{"article": [{"url": "https://www.marketwatch.com/story/stock-futures-point-to-more-gains-after-sp-500-snaps-4-day-losing-streak-2020-09-23", "published": 1600879940.0, "headline": "Dow ends 525 points lower as tech tumbles, stocks close near session lows", "body": "Major U.S. stock indexes closed lower on Wednesday, sliding in the final hour of trade, as market participants struggled to shake off worries about a lack of a coronavirus aid package and rising COVID-19 cases.How did major benchmarks fare? The Dow Jones Industrial Average DJIA, +0.56% tumbled 525.05 points, or 1.9%, to close at 26,763.13, while the S&P 500 SPX, +0.87% lost 78.65 points, or 2.4%, ending at 3,236.92. The Nasdaq Composite Index COMP, +1.39% shed 330.65 points, or 3%, finishing at 10,632.99, after plunging as low as 3%. That left the Dow 9.4% off its record close in February, the S&P 9.6% lower than its September all-time high and the Nasdaq 11.8% down from its September record, according to Dow Jones Market Data. On Tuesday, the Dow rose 140.48 points, or 0.5%, to end at 27,288.18, while the S&P 500 finished 34.51 points higher, up 1.1%, at 3,315.57. The Nasdaq gained 184.84 points, or 1.71%, to close at 10,963.64. What drove the market? The losses took the S&P 500 within a whisker of a correction, defined as a 10% pullback from a recent peak. “In big tech, a lot of the growth and momentum in stocks that exploded through the end of August, a lot of that’s retracing,” said Sahak Maneulian, head of equity trading at Wedbush Securities, in an interview. But volatility VIX, -5.15% also has made a comeback, he said, following a long period of dormancy. “We’re in the technical downdraft and it’s very hard to get out of as we get closer to the election and year-end.” Equities briefly caught a footing in Tuesday’s session, but were pressured again Wednesday amid deep-seated divides in Washington over additional pandemic aid and a resurgence of coronavirus cases in Europe and parts of the U.S., including in Texas, Wisconsin, Oklahoma and Colorado. “There’s been a worry about what happens going into the fall and winter. That’s on investors’ minds,” said Brent Schutte, chief investment strategist at Northwestern Mutual Wealth Management, of rising COVID-19 cases and political unease ahead of the Nov. 3 general election. “But I also think investors are reluctant to keep their feet completely out of the market,” he told MarketWatch, pointing to expectations for a safe and effective vaccine to be available at some point next year. Johnson & Johnson JNJ, +1.39% on Wednesday announced the start of a 60,000-person clinical trial of its single-dose COVID-19 vaccine on three continents, making the drugmaker the fourth experimental vaccine candidate to enter final-stage testing in the U.S. Skeptics said Tuesday’s brief turnaround for stocks was unconvincing, particularly given the still elevated stock values against a backdrop of tremendous uncertainty. “It’s not a surprise it’s becoming a little more volatile heading into the election,” Esty Dwek, head of global macro strategy at Natixis Investment Management, told MarketWatch. “But right now it’s kind of more about Congress.” “After Justice Bader Ginsburg’s passing, the probability of another fiscal package before the election has become quite small.” Related: Coronavirus deal prospects, already dim, recede further with pact to keep government open Jitters over the potential for a contested presidential election outcome on Nov. 3 are also hanging over the market, analysts said. Even after November’s election, investors should brace for potential protests against it, the uncertain timing and rollout of a vaccine, and more, said Peter Andersen, founder of Andersen Capital Management, in an interview. “I tell investors to focus on stocks that almost have an organic demand for products and services that will remain strong no matter what the election results, the vaccine hysteria, and the national polarization,” he said. On the economic front, Federal Reserve Vice Chairman Richard Clarida said Wednesday that policy makers won’t contemplate raising interest rates until inflation is clearly back at 2%—and possibly even beyond. Randal Quarles, the Fed’s vice chairman for banking supervision, said he’s optimistic about the outlook but also agreed with Fed Chair Powell that continued support will be required to sustain a robust recovery, in a Wednesday speech. A September composite purchasing managers index flash reading from IHS slipped to 54.4 in September from 54.6 in the prior month, signaling a slower pace of growth. The flash services purchasing managers index inched down to 54.6 from 55 in August. The flash manufacturing index rose to 53.5 in September from 53.1 in the prior month, still marking a 20-month high. Read: How far do stocks have to fall for Washington to take action? You may not like the answerWhich companies were in focus? Apple Inc. AAPL, +1.74% shares closed 4.2% lower, while Salesforce.com Inc. CRM, +2.21% fell 4.8%, after technology shares came under sharp selling pressure. Shares of Dow component Nike Inc. NKE, +0.97% jumped 8.8% after the athletic apparel company delivered results late Tuesday that easily beat Wall Street forecasts. Stitch Fix Inc. SFIX, +0.86% shares slid 15.5% after the provider of clothing and accessories subscriptions reported a bigger quarterly loss than expected. Shares of Johnson & Johnson JNJ, +1.39% rose 0.2%, after the health care and pharmaceutical company said it had launched a global Phase 3 trial of its COVID-19 vaccine candidate. Shares of Tesla Inc. TSLA, +1.89% fell 10.3% after the electric-auto maker unveiled innovations and increased efficiencies that appeared to disappoint investors late Tuesday at its “Battery Day” event. Oppenheimer analysts said its stock still was a “buy.” KB Home KBH, +1.89% shares lost 7.5% lower despite a pair of price-target increases. General Mills Inc. GIS, +0.78% shares fell 0.5% after the cereal maker beat on earnings and hiked its dividend. GoodRx Holdings Inc. GDRX, -2.40% completed an initial public offering Wednesday, and it didn’t come cheap. The prescription drugs and other medical help company raised more than $1 billion, with shares clearing at an $33 IPO price, but ending the session up 53%. SPI Energy Co. SPI, -8.51% shares soared 1,236.52% on Wednesday, following an announcement by the company that it was starting an electric-vehicle subsidiary. How did other markets fare? The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% was up 1.3 basis points at 0.676%. Bond prices move inversely to yields. The ICE U.S. Dollar Index DXY, -0.58% was up 0.4% at 94.39. Gold futures GCZ20, +2.17% fell 2.1% to settle at $1,868.40 an ounce, their lowest in two months.U.S. oil futures CLX20, -1.62% closed 0.3% higher to end at $39.93 per barrel on the New York Mercantile Exchange. The pan-European Stoxx Europe 600 Index SXXP, +0.55% closed 0.6% higher and the U.K.’s benchmark FTSE, +0.63% gained 1.2%. In Asia, Hong Kong’s Hang Seng Index HSI, -0.30% rose 1% and the Shanghai Composite Index SHCOMP, +1.67% closed 0.2% higher. Japan’s Nikkei NIK, -0.11% slipped less than 0.1%. William Watts contributed reporting."}]}