{"article": [{"url": "https://www.marketwatch.com/story/were-still-in-a-first-wave-fauci-says-noting-precautions-can-prevent-second-wave-of-coronavirus-2020-06-16", "published": 1592335220.0, "headline": "'We're still in a first wave,' Fauci says, noting precautions can prevent second wave of coronavirus", "body": "Dr. Anthony Fauci said Tuesday that he hasn't spoken to President Donald Trump in weeks, and warned that America is still not through the first wave of coronavirus cases. “ \"People keep talking about a second wave. We're still in a first wave.\" ” - Dr. Anthony Fauci In an interview with the Wall Street Journal, Fauci, the government's top infectious-disease expert, said that risky behavior as states reopen their economies is likely leading to a resurgence in COVID-19 cases. \"When I look at the TV and I see pictures of people congregating at bars when the location they are indicates they shouldn't be doing that, that's very risky,\" he said. While the White House has dismissed the increase in coronavirus cases as a result of more widespread testing, Fauci told the Journal that, in many states, the upswing in new cases \"cannot be explained by increased testing.\" Also see:U.K. trial sparks interest in dexamethasone's potential as a treatment for severely ill COVID-19 patients In a separate interview Tuesday with NPRs \"1A\" podcast, Fauci, who is a member of the White House coronavirus task force, said he hasn't talked to Trump in two weeks. While the task force has not been in the public spotlight as much recently, he said hard work is still being done. \"The seriousness with which the task force takes and the effort that we put into this is really substantial,\" he said. While Fauci did not explicitly fault states for reopening too soon, he did blame some people for flouting safety rules. \"States may say they're in this particular stage, but then you might find people are not adhering to the guidelines,\" he told NPR. \"That's clearly increasing the risk and likely explaining some of the upticks you're seeing.\" A second wave of outbreaks is not inevitable, he said, as long as \"we do what we need to do to prevent it from happening.\" Read:Why do so many Americans refuse to wear face masks? Politics is part of it - but only part Fauci said he was also concerned by the perception that shutting businesses or reopening them was a simple, \"all or none\" choice. \"It isn't as if you stay locked down or you open up and leave caution to the wind,\" he said, noting that each region needs to be treated differently, depending on a multitude of factors, and that safety precautions such as face masks and social distancing will be the norm for the foreseeable future. \"We are nowhere near herd immunity,\" he said. \"The bottom line is, you've got to protect yourself.\" As of Tuesday, the U.S. has had 2.1 million confirmed coronavirus cases, with nearly 117,000 deaths, according to data from Johns Hopkins University."}]}