{"article": [{"url": "https://www.marketwatch.com/story/whats-happening-now-with-ma-is-going-to-make-todays-stock-investors-wish-theyd-sold-sooner-2020-09-10", "published": 1599900140.0, "headline": "What's happening now with M&A is going to make today's stock investors wish they'd sold sooner", "body": "The resurgence of mergers and acquisitions (M&A) activity is a bad omen for the stock market. I'm referring to the blistering-hot pace of M&A deals in recent weeks. After M&A activity ground to a virtual halt in the second quarter, it came roaring back over the summer. According to Dealogic, total U.S. M&A activity in the third quarter of 2020 is already ahead of where it was in the entire first quarter of the year. Indeed, July's and August's M&A deals mark the strongest start ever to the second half of a year. This is a warning because M&A activity tends to come in waves, and all past waves have ended badly for the stock market. Matthew Rhodes-Kropf, an MIT Sloan finance professor and an expert in the M&A field, said in an interview that \"each of the last six great merger waves on record\" - going back more than 125 years - \"ended with a precipitous decline in equity prices.\" We're currently in the seventh of those great waves, which began about six years ago. Added Rhodes-Kropf: M&A waves tend to accelerate right before they end. And recent M&A activity does appear to be such an acceleration. \"I'm not predicting the end,\" he said. \"But I wouldn't be surprised if we're near the end.\" One of the factors fueling the acceleration of M&A activity are the SPACs that are falling over themselves going public. There are the Special Purpose Acquisition Companies that are otherwise known as \"Blank Check Companies.\" SPACs have no business operations; they are created solely to raise money that would enable them to acquire other already-existing companies. Year to date through Sep. 3, according to SPACInsider, 84 SPACs have gone public, raising $33.9 billion, versus 59 SPACs in all of 2019 that raised a total of $13.6 billion. I'm sure there are legitimate uses for the SPAC model. But forgive me for being a bit cynical. Their red-hot popularity reminds me of those now infamous companies that went public at the height of the internet bubble, even though they had no assets or business plan other than having \"dot com\" in their names. We all remember what happened thereafter. Another potentially worrisome sign in the M&A world is the elevated percentage of deals that are being paid for with shares rather than cash. So far this year, according to data from Dealogic, 23% of M&A activity (by dollar volume) has been paid for with shares - almost double what this percentage was over the first eight months of 2017, as you can see from the accompanying chart. The reason this is a worrisome trend is that corporate chief financial officers historically have exhibited an uncanny knack for sensing when their shares are overpriced and using their overpriced shares to acquire other companies. This trend is even more worrisome at a time when interest rates are as low as they are now, which would otherwise incline CFOs to pay for deals with debt rather than equity. Don't forget, this analysis can't translate into a specific prediction of when the current M&A wave will end. But don't forget that if this wave is like the others, the end will catch a lot of investors by surprise. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com Read:A 'shocking, spectacular and disorderly' market crash looms, investor warns More: Investing legend known for his annual predictions says the world could be in for a big surprise - in a good way"}]}