{"article": [{"url": "https://www.marketwatch.com/story/trump-defends-his-trip-to-kenosha-praises-stock-markets-august-surge-2020-08-31", "published": 1598908340.0, "headline": "Trump defends his trip to Kenosha, declines to criticize shooting suspect", "body": "President Donald Trump at a news conference on Monday evening defended his decision to visit Kenosha, Wis., as he also declined to criticize the teen accused of fatally shooting two protesters in that small city. The president was asked at the news conference about whether he had considered not making his Tuesday trip to Kenosha to avoid adding to tensions, as requested by the city’s mayor and Wisconsin’s governor, both Democrats. “No, because Kenosha was something we did a good job on,\" Trump said, adding that Gov. Tony Evers eventually agreed to allow the National Guard in. “As soon as he said ‘Yes,’ the problem ended. But I have to see the people that did such a good job for me.” “It could also increase enthusiasm,” the president said of the upcoming trip Kyle Rittenhouse, a white 17-year-old, was arrested last week after two people were shot to death during protests in Kenosha over the police shooting of a Black man, Jacob Blake. “We’re looking at all of it,” Trump said, while referring to video of the incident involving Rittenhouse. “He was trying to get away from them, I guess, it looks like, and he fell, and then they very violently attacked him.” “It’s under investigation,” he added. “He probably would have been killed.” Trump said he wasn’t planning to speak with the Blake family and had just talked to their pastor, because they wanted a lawyer on the call and he thought that was “inappropriate.” Democratic presidential nominee Joe Biden earlier Monday attacked Trump in a speech in Pittsburgh as “a president who fans the flames, rather than fighting the flames.” Trump is slated to make his own trip to Pennsylvania on Thursday, as he campaigns in Latrobe. Related:Trump re-election momentum could shock investors betting on Biden win, analyst says During his news conference on Monday, Trump also noted that the Dow Jones Industrial Average notched its biggest August gain in 36 years. The main stock gauges finished mostly with losses on Monday, but the Dow industrials DJIA, +0.56% still achieved an advance of 7.6% for the month. “That’s very impressive,” he said. “So people are very happy with their 401(k)s and with the stocks that they have.” In a RealClearPolitics average of polls as of Monday, Biden is leading the Republican incumbent by 2.7 percentage points in top battleground states that are likely to decide the November election, down from his 6.3-point edge a month ago. Betting markets give Biden just a 51% chance of winning, down from 61%, according to a separate RCP average."}]}