{"article": [{"url": "https://www.marketwatch.com/story/bryan-cranston-reveals-hes-recovering-from-coronavirus-keeping-wearing-the-damn-mask-2020-07-31", "published": 1598271620.0, "headline": "WATCH: Bryan Cranston shows how to donate convalescent plasma to help coronavirus patients", "body": "Walter White has gone from pushing “blue sky” to “liquid gold” — aka convalescent plasma. “Breaking Bad” star Bryan Cranston recently revealed that he contracted COVID-19 “a little while ago” — and that he has donated his plasma, because his blood has the antibodies that scientists believe could treat coronavirus patients. “Have you had COVID-19? This is something that you might be able to do to,” he says in the roughly 2 1/2-minute video. On Sunday, the Food and Drug Administration (FDA) issued an emergency use authorization (EUA) for convalescent plasma gathered from people who have recovered from COVID-19 as a treatment for hospitalized coronavirus patients. “The data from studies conducted this year shows that plasma from patients who’ve recovered from COVID-19 has the potential to help treat those who are suffering from the effects of getting this terrible virus,” FDA commissioner Dr. Stephen Hahn said in a statement. “At the same time, we will continue to work with researchers to continue randomized clinical trials to study the safety and effectiveness of convalescent plasma.” Read more:Trump announces emergency authorization of plasma treatment for COVID-19 Cranston, the Emmy and Tony Award-winning actor who is perhaps best known for playing chemistry teacher turned blue meth cook Walter White on “Breaking Bad,” previously walked his 2.6 million followers through the plasma donation process in his Instagram FB, +0.26% video. Basically, the donor’s blood is taken and separated into three parts (including the plasma, platelets and red blood cells) by a centrifuge. The doctors then take the plasma, and the platelets and red blood cells are returned back to the donor. “Pretty neat huh?” Cranston’s ticker reads. The center was able to collect 840 milliliters from Cranston during his visit. “Beautiful…liquid gold,” Cranston says, eying the bag of honey-colored plasma. “Hopefully it can do some good.” Watch his plasma donation here: People who have fully recovered from COVID-19 for at least two weeks, meaning they had been diagnosed with the novel coronavirus in a lab, and they have been symptom-free for 14 days following their diagnosis, are encouraged to consider donating their plasma. They can find their nearest donation center on the FDA’s “The Fight Is In Us” resource page. And those who haven’t had COVID-19 can still help by donating their blood, as the pandemic has hurt the U.S. blood supply. Convalescent plasma has been used to treat ebola and flu patients during past viral outbreaks. And preliminary studies have found that convalescent plasma from recovered COVID-19 patients is generally safe to use, and appears to raise the survival rate of those hospitalized with COVID-19. Researchers are studying whether convalescent plasma from recovered coronavirus patients could reduce the severity of COVID-19 illnesses in sick patients by boosting their ability to fight off the virus. More than 70,000 COVID-19 patients in the U.S. have received plasma through a government-funded program during the pandemic, although the FDA noted that convalescent plasma should not be considered the standard of care at this time. The Mayo Clinic has also reported preliminary data from 35,000 coronavirus patients treated with convalescent plasma, which found fewer deaths among people given the plasma within three days of diagnosis, and also among those given plasma with the highest level of COVID-19 antibodies. But this isn’t considered proof yet, because the treatment hasn’t been formally studied. Patients were treated in different ways at different hospitals, for example, so there isn’t firm proof that isolates the plasma as the reason for their improvement, versus some other care they received. Cranston has also been calling on his followers to wear masks and practice social distancing. The actor revealed that he became infected despite being “pretty strict in adhering to the protocols.” “I was one of the lucky ones. Mild symptoms,” he wrote, spurring the public to “keep wearing the damn mask, keep washing your hands, and stay socially distant.” He added that, “We can prevail — but ONLY if we follow the rules together.” Keep up with MarketWatch’s coronavirus coverage here. This article was originally published on July 31, 2020, and has been updated with the FDA’s emergency use authorization for convalescent plasma from COVID-19 patients."}]}