{"article": [{"url": "https://www.marketwatch.com/story/apple-beats-on-earnings-and-announces-stock-split-sending-shares-toward-record-high-2020-07-30", "published": 1596177680.0, "headline": "Apple beats on earnings and announces stock split, sending shares toward record high", "body": "Apple Inc. brushed off the COVID-19 crisis to report record results Thursday, and the company said it plans to split its stock in an attempt to make it “more accessible to a broader base of investors.” Apple shares AAPL, +1.74% gained 5.8% in after-hours trading, pushing shares higher than $400, a level the stock has never eclipsed in regular trading. The stock was up 6.2% premarket Friday. The company beat expectations across the board with its fiscal third-quarter results, which marked a record for the June period. Smartphone sales benefited from the launch if the iPhone SE in April, the distribution of stimulus payments, and a relaxation of shelter-in-place restrictions, driving improved performance in May and June relative to April. Read: Pandemic? Antitrust? Doesn’t matter to Big Tech, which just reported nearly $200 billion in sales “We’ve been having a strong cycle with the iPhone 11 and the 11 Pro, and so when you combine a strong cycle plus an iPhone SE launch plus the reopening of the stores etcetera, I think there were a lot of things that were going in the right direction there,” Chief Executive Tim Cook said on Apple’s earnings call. He added that the iPhone SE “seemed to appeal to some people that were holding on to the device a little longer because they wanted a smaller form-factor phone.” At the same time, the company saw negative impacts to the iPhone and wearables categories from store closures, as well as to its Apple Care insurance product, which is a part of the services segment. Apple was forced to temporarily shut its stores outside of China in March due to the pandemic and while it began gradually reopening some of its locations toward the end of May, it then moved to re-close some of them in states where the crisis was worsening. Don’t miss: Amazon promised to spend all its profit amid pandemic, but ended up with record earnings instead The iPad and Mac segments got a boost from work-from-home trends, and Apple said it faced product shortages as it attempted to meet demand. Cook said that it “certainly looks like” the company is set to have a “strong back-to-school season.” Apple’s revenue for the quarter rose to $59.7 billion from $53.81 billion, while the FactSet consensus was for $52.24 billion. Net income came in at $11.25 billion, or $2.58 a share, up from $10.04 billion, or $2.18 a share, in the year-prior quarter. Analysts surveyed by FactSet had been anticipating $2.05 a share. See also: Facebook shares rally as quarterly results easily top Street view The company declined to provide a financial forecast for the current quarter in its release, but Chief Financial Officer Luca Maestri confirmed that the next iPhone would be delayed by “a few weeks” relative to this past iPhone cycle, when devices were available for sale toward the end of September. Apple also announced that its board of directors has approved a four-for-one stock split for Apple shareholders of record as of the close of business on Aug. 24. Trading begins on a split-adjusted basis on Aug. 31. Read:How Apple’s stock split will change the pecking order in the 124-year old Dow industrials CFRA analyst Angelo Zino wrote after the report that he anticipates the stock split will “help support liquidity and attract new investors.” The company generated $26.42 billion in revenue from its iPhone segment for the quarter, compared with $26.99 billion a year ago and the $22.2 billion that analysts had been expecting. This is the first quarter to include sales of the iPhone SE, Apple’s lower-cost smartphone that launched in April. International sales accounted for 60% of the company’s revenue in the period. See also: Alphabet Q2 results show ad spending is still in a rut Revenue for the iPad business climbed to $6.58 billion from $5.02 billion, while revenue from Macs came in at $7.08 billion, compared with $5.82 billion a year earlier. Analysts had been modeling $4.85 billion in iPad revenue and $6.03 billion in Mac revenue. Apple’s services segment saw revenue increase to $13.16 billion from $11.45 billion in the quarter, above estimates for $13.1 billion. Revenue from wearables, accessories, and home products grew to $6.45 billion from $5.5 billion and came in ahead of estimates, which called for $5.98 billion. The report comes a day after Cook faced lawmakers at a House Judiciary subommittee hearing focused on antitrust issues. Representatives grilled Cook on Apple’s App Store practices, including the fees it charges developers to sell digital services through iPhone apps and whether Apple has pulled rival apps that it deems competitive to its own native offerings. Amazon.com Inc. AMZN, +3.01%, Alphabet Inc. GOOGL, +1.82% GOOG, +1.97% and Facebook Inc. FB, +0.26%, whose top executives were also questioned at the hearing, joined Apple in reporting June-quarter earnings Thursday afternoon. Apple shares have added 30% over the past three months as the Dow Jones Industrial Average DJIA, +0.56%, of which Apple is a component, has gained 8%."}]}