{"article": [{"url": "https://www.marketwatch.com/story/uber-wins-18-month-license-to-continue-to-operate-in-london-2020-09-28", "published": 1601288600.0, "headline": "Uber wins 18-month license to continue to operate London", "body": "Shares in Uber rose almost 4% in premarket U.S. trading, after the ride-hailing app won an appeal allowing it to continue to operate in London, its biggest European market. “Uber does not have a perfect record but it has been an improving picture,” Deputy Chief Magistrate Tanweer Ikram said in a written verdict on Monday. “Despite their historical failings, I find them, now, to be a fit and proper person to hold a London private hire vehicle (PHV) operator’s license,” he concluded. The city transport regulator Transport for London (TfL) had decided not to renew Uber’s PHV operating license in November 2019, over concerns about its safety practices. TfL said it found several breaches that placed passengers at risk, including a change that allowed unauthorized drivers to upload their photos to other driver accounts. Another failure allowed dismissed or suspended drivers to create an Uber account and pick up passengers. Uber was allowed to continue operating, pending the appeal. Uber has since introduced a range of new safety measures in the app, including real-time identification checks for drivers. Following the successful appeal on Monday, Uber was granted a new 18-month license with 21 conditions attached, which were jointly proposed by Uber and TfL. These include verification of insurance documents as well as measures to prevent drivers from tampering with Uber’s system. Neil Wilson, chief market analyst for Markets.com, said the decision was an important victory for the company and removes a significant regulatory overhang. “But the pandemic continues to exert an enormous drag on earnings and present management with a significant headache over the business model,” Wilson said. However, he cautioned that this wasn’t a permanent pass for the taxi-app. “The mayor of London indicated that Uber would face continuous scrutiny, whilst the company faces ongoing competition in the capital from the likes of India’s Ola and Estonia’s Bolt. But the decision today unquestionably is a good news story for Uber as it tries to stop its cash burn.” Uber’s problems with TfL date to 2017, when the regulator denied Uber a license, deeming it not ‘fit and proper’ to operate and saying it demonstrated a lack of corporate responsibility. That decision was overturned in 2018 after a judge concluded that new governance arrangements were sufficient and granted it a 15-month license to operate in London. Read:Uber to issue $500 million eight-year bonds The victory will come as a relief to the San-Francisco based company, which has faced regulatory obstacles in several countries worldwide. “This decision is a recognition of Uber’s commitment to safety and we will continue to work constructively with TfL. There is nothing more important than the safety of the people who use the Uber app as we work together to keep London moving,” Jamie Heywood, Uber’s regional general manager for northern & eastern Europe, said. Shares in Uber rose 3.5% in premarket U.S. trading to $35.67 on Monday. London, with around 3.5 million users and around 45,000 drivers, is Uber’s largest market in Europe and has been dubbed one of the group’s ‘fab five’ cities — along with New York, San Francisco, Los Angeles and São Paulo — which accounted for around a quarter of the company’s global revenues before the coronavirus pandemic, according to Markets.com’s Wilson. The Licensed Taxi Drivers’ Association (LTDA), representing black-cab drivers, said the decision was a “disaster for London.” “Uber has demonstrated time and time again that it simply can’t be trusted to put the safety of Londoners, its drivers and other road users above profit. Sadly, it seems that Uber is too big to regulate effectively, but too big to fail,” Steve McNamara, general secretary of the LTDA, said in a statement."}]}