{"article": [{"url": "https://www.marketwatch.com/story/trump-approves-of-oracles-effort-to-buy-tiktok-2020-08-18", "published": 1597791440.0, "headline": "Trump approves of Oracleâ\u0080\u0099s effort to buy TikTok", "body": "President Donald Trump voiced support on Tuesday for Oracle Corp. to buy the U.S. operations of TikTok, adding a fresh wrinkle to the bidding for the Chinese-owned video-sharing app. Oracle ORCL, +0.42% Â is a new entrant in the negotiations for TikTok, whose owner ByteDance Ltd. is facing a fall deadline from the Trump administration to divest itself of its U.S. operations. Oracle, a giant in business software, has had preliminary discussions about teaming with some of ByteDanceâ\u0080\u0099s existing minority investors to buy TikTokâ\u0080\u0099s U.S. operations but it isnâ\u0080\u0099t clear how advanced the talks are, said people familiar with the matter. Microsoft Corp. MSFT, +2.48% Â said earlier this month it was in negotiations with ByteDance, and that it was coordinating with the White House. Twitter Inc. TWTR, -0.23% Â is also exploring a bid, The Wall Street Journal previously reported. The Financial Times earlier reported Oracleâ\u0080\u0099s involvement. Oracle has closer ties to the White House than most other parties involved in the bidding. Larry Ellison, the companyâ\u0080\u0099s co-founder, chairman and largest shareholder, earlier this year threw a fundraiser at his house for the president. Chief Executive Safra Catz also worked on the executive committee for the Trump transition team in 2016. Asked Tuesday if Oracle would be a good buyer for TikTok, Trump said, â\u0080\u009cWell I think Oracle is a great company and I think itâ\u0080\u0099s owner is a tremendous guy, a tremendous person. I think that Oracle would be certainly somebody that could handle it.â\u0080\u009d An expanded version of this report appears on WSJ.com. Also popular on WSJ.com: Men urged to limit alcohol to one drink a day amid new concerns. 5G smartphones could crush your home Wi-Fi. So whereâ\u0080\u0099s the 5G?"}]}