{"article": [{"url": "https://www.marketwatch.com/story/smoking-or-vaping-cannabis-could-cause-strokes-heart-attacks-2020-08-05", "published": 1596712040.0, "headline": "Smoking or vaping cannabis could cause strokes, heart attacks", "body": "Some studies are sending dreams of cannabis being a cure-all up in smoke. The American Heart Association is warning that marijuana use shows “substantial risks” and “no benefit” in cardiovascular health, and its deputy chief science and medical officer is recommending that people “not smoke or vape any substance, including cannabis products, because of the potential harm to the heart, lungs and blood vessels.” Marijuana contains the psychoactive chemical THC (which gives users the “high”), as well as more than 100 compounds (cannabinoids, such as the popular cannabidiol, or CBD ) chemically related to THC that are still not entirely understood. Studies suggest that they inhibit some enzymes in the body that can affect the way we metabolize certain heart disease medications, such as cholesterol-lowering statins and blood-thinning warfarin, which skews what’s considered a safe dosage. So in a scientific paper published Wednesday, the American Heart Association (AHA) cites a growing crop of observational studies suggesting that cannabis use is linked to an increased risk of heart attacks, irregular heartbeats (atrial fibrillation, or AFib) and heart failure; a nearly 2.5 times higher risk of strokes; chest pain or angina; and high blood pressure. Some 2 million Americans with heart disease currently use marijuana or have used it in the past, according to a recent report in the Journal of the American College of Cardiology, which notes that more than 39 million U.S. adults have used the drug in the past year. What’s more, the AHA reports that THC appears to stimulate the body’s “fight or flight” response, which can trigger a higher heart rate, a greater demand for oxygen by the heart, higher blood pressure while laying down, and dysfunction within the walls of the arteries. The AHA also reports that states that have legalized cannabis have seen an increase in hospitalizations and ER visits for heart attacks. The heart-health body called out inhaling combustible cannabis, in particular, as smoking and inhaling marijuana (regardless of THC potency) has been shown to increase the concentrations of carbon monoxide and tar in the body similar to the effects of smoking a tobacco cigarette. “People who use cannabis need to know there are potentially serious health risks in smoking or vaping it, just like tobacco smoke,” said Dr. Rose Marie Robertson, the deputy chief science and medical officer for the American Heart Association, in a statement. Yet many Americans assume smoking or vaping marijuana isn’t as dangerous as smoking cigarettes, even though smoking marijuana usually involves taking a large hit and holding it in, as opposed to the more frequent, smaller puffs used for smoking cigarettes. Therefore, smoking cannabis may deposit as much — if not more — of the chemicals in the lungs as when people smoke cigarettes. And vaping has been shown to carry health risks, especially after vaping-related lung illness sickened hundreds of Americans last year. Edibles aren’t entirely in the clear, however, as it’s all-too-easy to accidentally ingest too much of the drug. A Canadian man with pre-existing heart disease had a heart attack last year, an hour after eating most of a lollipop laced with 90 milligrams of THC. He had taken it to treat his arthritis pain so that he could sleep better. Researchers noted that people typically inhale 7 milligrams while smoking a single marijuana joint. Related:‘CBD has the potential to harm you,’ FDA warns consumers But then again, research has suggested that CBD, which does not intoxicate users, has been associated with lower blood pressure, lower heart rate and reduced seizures, which are all good things. CBD also shows some promise for treating anxiety disorders. And cannabis has been found to treat pain, nausea and vomiting, anxiety and loss of appetite caused by cancer or the side effects of cancer therapies. Indeed, medical marijuana is legal in 33 U.S. states and Washington, D.C., where it is prescribed for pain management, anxiety and depression. The problem is, research into cannabis’ complex relationship with the cardiovascular system remains in the weeds because it’s illegal under U.S. federal law. Marijuana is classified as a Schedule I drug by the U.S. Drug Enforcement Agency (DEA), which limits scientists from studying it, or even getting access to enough high-quality product to study it. “We urgently need carefully designed, prospective short- and long-term studies regarding cannabis use and cardiovascular safety as it becomes increasingly available and more widely used,” said Robert L. Page II, chair of the AHA writing group for the statement. “The public needs fact-based, valid scientific information about cannabis’s effect on the heart and blood vessels.” Related:FDA releases guidelines for cannabis-related research, but CBD will have to wait The cannabis industry agrees on the need for more research, although it questioned the American Heart Association’s more dire health claims. “The cannabis industry is on the same page as the American Heart Association in calling for more research for many reasons, including the dearth of definitive evidence supporting their claims,” Morgan Fox, the media relations director for the National Cannabis Industry Association, told MarketWatch by email. “Cannabis — like almost any other psychoactive substances — can have harms associated with its consumption, but it is clear that the harms associated with prohibition and keeping the cannabis market underground and unregulated are far worse for the consumer and society,” he added, while calling cannabis “objectively safer” than many other legal substances. “Regulation is necessary to facilitate the research and education that are key to helping adults make informed decisions about whether and how to consume cannabis.” Cannabis use has become more acceptable in American society, as 11 states and Washington, D.C. have legalized recreational marijuana. And there’s money to be made here. Barclays estimates that the U.S. cannabis market would be $28 billion if it was legalized by the federal government today, reaching $41 billion by 2028, while the CBD market is expected to hit $2.1 billion this year, as MarketWatch previously reported."}]}