{"article": [{"url": "https://www.marketwatch.com/story/robert-shiller-explains-the-pandemic-stock-market-and-why-its-decoupled-from-the-economy-2020-07-07", "published": 1594481120.0, "headline": "Robert Shiller explains the pandemic stock market and why it's decoupled from the economy", "body": "NEW HAVEN, Conn. (Project Syndicate) - The performance of stock markets, especially in the United States, during the coronavirus pandemic seems to defy logic. With cratering demand dragging down investment and employment, what could possibly be keeping share prices afloat? The more economic fundamentals and market outcomes diverge, the deeper the mystery becomes, until one considers possible explanations based on crowd psychology, the virality of ideas, and the dynamics of narrative epidemics. After all, stock-market movements are driven largely by investors' assessments of other investors' evolving reaction to the news, rather than the news itself. Follow the latest movements of the stock market on MarketWatch. That is because most people have no way to evaluate the significance of economic or scientific news. Especially when mistrust of news media is high, they tend to rely on how people they know respond to news. This process of evaluation takes time, which is why stock markets do not respond to news suddenly and completely, as conventional theory would suggest. The news starts a new trend in markets, but it is sufficiently ambiguous that most smart money has difficulty profiting from it.Three phases of the market Of course, it is hard to know what drives the stock market, but we can at least conjecture ex post, based on available information. Also read: Living in retirement during COVID-19? How to keep your cool There are three separate phases of the puzzle in the U.S.: the 3% rise in the S&P 500 SPX, +0.87%  from the beginning of the coronavirus crisis, on Jan. 30, to Feb. 19; the 34% drop from that date until March 23; and the 42% upswing from March 23 to the present. Each of these phases reveals a puzzling association with the news, as the lagged market reaction is filtered through investor reactions and stories. The first phase started when the World Health Organization declared the new coronavirus \"a public health emergency of international concern\" on Jan. 30. For the next 20 days, the S&P 500 rose by 3%, hitting an all-time record high on Feb. 19. Why would investors give shares their highest valuation ever right after the announcement of a possible global tragedy? Interest rates did not fall over this period. Why didn't the stock market \"predict\" the coming recession by declining before the downturn started?Unfamiliar event One conjecture is that a pandemic wasn't a familiar event, and most investors in early February just weren't convinced that other investors and consumers paid any attention to such things, until they saw a bigger reaction to the news and in market prices. Their lack of past experience since the 1918-20 influenza pandemic meant that there was no statistical analysis of such events' market impact. The beginnings of lockdowns in late January in China received scant attention in the world press. The disease caused by the new coronavirus didn't even have a name until Feb. 11, when the WHO christened it COVID-19. In the weeks before Feb. 19, public attention to longstanding problems such as global warming, secular stagnation, or debt overhangs were fading. President Donald Trump's impeachment trial, which ended Feb. 5, still dominated talk in the U.S., and many politicians apparently still found it counterproductive to raise alarms about a hypothetical new enormous tragedy looming. The second phase began when the S&P 500 plummeted 34% from Feb. 19 to March 23, a drop akin to the 1929 stock market crash. Yet, as of Feb. 19, there had been only a handful of reported COVID-19 deaths outside of China. What changed investors' thinking over that interval was not just one narrative, but a constellation of related narratives.Making sense of the news Some of the new news was nonsense. On Feb. 17, a run on toilet paper in Hong Kong was mentioned for the first time, and became a highly contagious story as a sort of joke. Of course, the news about the spread of the disease was becoming more international. The WHO dubbed it a pandemic on March 11. Internet searches for \"pandemic\" peaked in the week of March 8-14, and searches for \"coronavirus\" peaked in the week of March 15-21. It appears that in this second phase, people were trying to learn the basics about this strange event. Most people couldn't get a handle on it immediately, let alone imagine that others who might influence market prices were doing so. As the stock-market downturn proceeded, vivid stories appeared of hardship and business disruption caused by the lockdown. For example, some people in locked-down China reportedly were reduced to searching for minnows and ragworms to eat. In Italy, there were stories of medical workers in overwhelmed hospitals being forced to choose which patients would receive treatment. Narratives about the Great Depression of the 1930s flourished. The beginning of the third phase, when the S&P 500 market began its 40% rise, was marked by some genuine news about both fiscal and monetary policy. On March 23, after interest rates had already been cut to virtually zero, the Federal Reserve announced an aggressive program to establish innovative credit facilities. Four days later, Trump signed the $2 trillion Coronavirus Aid, Relief, and Economic Security (CARES) Act, promising aggressive fiscal stimulus. Both of these measures, and similar actions in other countries, were described as resembling the actions taken to counter the 2008-09 Great Recession, which was followed by a gradual but ultimately huge increase in stock prices. The S&P 500 increased fivefold from its bottom on March 09, 2009, to Feb. 19, 2020.FOMO Most people have no idea what's in the Fed plan or the CARES Act, but investors did know of one recent example when such measures apparently worked. Stories of smaller but still significant stock-market collapses and strong recoveries, a couple of them from 2018, were widely recalled. Talk of regrets about not buying at the bottom then, or in 2009, may have left the impression that the market had fallen enough in 2020. At that point, FOMO (fear of missing out) took hold, reinforcing investors' belief that it was safe to go back in. In all three phases of the COVID-19 stock market, the effects of genuine news are apparent. But price movements are not necessarily a prompt, logical response to it. In fact, they rarely are. This article was published with permission of Project Syndicate - Understanding the Pandemic Stock Market. Robert J. Shiller, a 2013 Nobel laureate in economics and Professor of Economics at Yale University, is the author of \"Narrative Economics: How Stories Go Viral and Drive Major Economic Events.\""}]}