{"article": [{"url": "https://www.marketwatch.com/story/coca-cola-plans-to-cut-zombie-brands-from-its-portfolio-2020-07-21", "published": 1595679980.0, "headline": "Coca-Cola plans to cut â\u0080\u0098zombie brandsâ\u0080\u0099 from its portfolio", "body": "Coca-Cola Co. says itâ\u0080\u0099s going to streamline its portfolio, cutting what it calls â\u0080\u009czombie brandsâ\u0080\u009d in order to focus on more successful brands and smaller names with potential. According to James Quincey, chief executive of Coca-Cola KO, +0.69% Â , many of the companyâ\u0080\u0099s 400 â\u0080\u009cmaster brandsâ\u0080\u009d are in just one country, accounting for just 2% of total revenue. At the beginning of the pandemic, Quincey said the company decided to â\u0080\u009cruthlessly prioritizeâ\u0080\u009d core brands, which would also aid the supply chain. Read:Chipotle earnings preview: Digital menu exclusives could give sales a boost â\u0080\u009cWe are shifting to prioritizing fewer but bigger and stronger brands across various consumer needs,â\u0080\u009d he said, according to a FactSet transcript. â\u0080\u009cAt the same time, we need to do a better job nurturing and growing smaller, more enduring propositions and exiting some zombie brands not just zombie SKUs [stock-keeping units].â\u0080\u009d The cuts have already begun. Coca-Cola said that it would stop operations on the Odwalla brand of juice beverages, effective July 31. There will be 300 job cuts as a result of the move. â\u0080\u009cThis gives us the flexibility to support our investments in brands like Minute Maid and Simply and to continue to scale rising start like Topo Chico,â\u0080\u009d Quincey said. Topo Chico is a brand of sparkling mineral water. Bottled water has been a hot item, with Nielsen data showing online sales of seltzer, tonic and club soda climbing 61% year-over-year for the week ending June 13. Quincey said that Coca-Cola turned its attention to the sparkling category in China and saw a 14% increase in volume for the quarter, with strength in Coke Zero Sugar. Also:Dominoâ\u0080\u0099s Pizza could snap up market share with â\u0080\u0098improvedâ\u0080\u0099 chicken wings For the second quarter, Coca-Cola reported better-than-expected profit, though revenue fell short of expectations. Shares have tumbled nearly 13% for the year to date. The Dow Jones Industrial Average DJIA, +0.56% Â is down 6.7% for 2020 so far. Coca-Cola suffered from a decline in sales at places like stadiums, arenas, and movie theaters, which were shuttered due to COVID-19. However, Fairlife milk and the Simply juice brands did well as more consumers stayed home. Ryan Giannotto, director of research at GraniteShares, which offers the U.S. Large Cap XOUT, +1.15% Â among their products, says the company has failed to generate wealth for shareholders during the quarter due to a lack of technological advancement. Donâ\u0080\u0099t miss:Online food prices jump as food companies struggle to meet demand â\u0080\u009cFrom optimizing its product offering to opening new channels, Coca-Cola has fallen on the wrong side of the market in terms of digital adoption,â\u0080\u009d he said. â\u0080\u009cIt is for this reason, combined with lackluster management and poor capital reinvestment that we identify Coca-Cola as one the top 10 stocks to exclude in our XOUT Index.â\u0080\u009d The GraniteShares XOUT Index has gained 7.8% for the year to date. Coca-Cola talked up its touchless beverage fountains, which were introduced last week and allow customers to fill their drinks from their phones without creating an account or downloading an app. The company plans to roll out these Coca-Cola Freestyle fountains across the U.S. by the end of the year."}]}