{"article": [{"url": "https://www.marketwatch.com/story/airline-stocks-fall-on-lockdown-fears-as-report-calls-for-urgent-us-uk-air-bridge-2020-09-21", "published": 1600772900.0, "headline": "Come back, Americans: Urgent calls for U.S.-U.K. air bridge with airlines hit by fresh lockdown fears", "body": "Shares in Europe’s biggest airlines plunged on Monday over fears of a new lockdown in response to a second wave of coronavirus cases, while a new report laid bare the massive daily cost to the U.K. economy because of the lack of an air link to the U.S. British Airways owner International Airlines Group IAG, -3.72% was the worst performer in a sector that has been consistently hammered by the pandemic, with its stock falling almost 14% in early morning European trading. Shares in Irish budget carrier Ryanair Holdings RYA, -2.60% fell 6.42%. “The travel industry has again been left reeling after news that the U.K. government is seriously considering another national lockdown. British Airways’ owner IAG is one of the biggest fallers as tougher widespread restrictions on movement are likely to push any recovery for the airline industry even further into the future,” said Susannah Streeter, senior investment and markets analyst at Hargreaves Lansdown. Read:U.K. edges closer to second national lockdown to help contain second coronavirus wave Separately, a new report published on Monday showed that the closed air corridor between the U.S. and the U.K. will cost the U.K. economy £32 million ($41 million) a day by the beginning of October. The research, jointly commissioned by Airlines U.K., International Airlines Group, Heathrow Airport and aviation services company Collinson, said that the hit to U.K. gross domestic product in 2020 could reach at least £11 billion, with a significant proportion falling in the fourth quarter. Heathrow Airport Chief Executive John Holland-Kaye said this was a “stark warning” and that action is needed immediately to safely open up connections with the U.S., the country’s most important economic partner. “We can start with flights to New York, a city where infection rates are now lower than here, and which is the U.K.’s most valuable route,” Holland-Kaye said. He added: “PCR [polymerase chain reaction] testing in private labs, both preflight and on arrival, would ensure that there is no risk of importing COVID and could pave the way to a Common International Standard for aviation testing.” Read:After an unprecedented hard landing, the airline industry is facing a long path to a new takeoff The U.S. is the U.K.’s most lucrative market for inbound tourism and business travel, with nearly 4 million visits in 2019. Visitors from the U.S. spent a total of £3.8 billion ($4.9 billion) during 2019, but this figure is expected to fall by £3.1 billion ($4 billion) in 2020, the report warned. “Critically, the average duration of a trip by U.S. visitors is seven days, meaning that current quarantine rules effectively lock these high-spending visitors out of the U.K.,” the report added. Read:Welcome to New York! Don’t you dare go outside! It also warned of a “catastrophic loss in trade between the U.S. and the U.K. of £45.8 billion ($59 billion) due to closed borders;” £12.8 billion ($16.5 billion) of which is due to fall in the fourth quarter. More than 30 countries worldwide have now embraced airport-based COVID-19 testing, and it is now in use at more than half the world’s busiest airports, including Paris Charles de Gaulle, Tokyo Haneda and Dubai International. Shai Weiss, chief executive of Virgin Atlantic, which is 49% owned by Delta Air Lines DAL, +0.39%, called for urgent government action to introduce regional travel corridors for mainland U.S. states, starting with New York and New Jersey, where infection rates are lower than the U.K.’s. “[The] 14-day quarantine must be replaced by a robust passenger-testing regime for countries and regions where the risk is higher,” Weiss said. British Airways Chief Executive Álex Cruz cautioned that time is running out and called for ministers to reach agreement with their U.S. counterparts on a testing regime that minimizes quarantine and permits regional travel corridors to reopen the U.K.-U.S. market. “They must learn from trials across the globe and start implementing new measures as soon as possible to return confidence in flying and protect thousands of jobs,” Cruz said."}]}