{"article": [{"url": "https://www.marketwatch.com/story/prescription-drug-pricing-app-goodrx-raises-more-than-1-billion-in-ipo-stock-jumps-more-than-40-in-debut-11600880560", "published": 1600877720.0, "headline": "GoodRx stock jumps more than 50% after IPO raises over $1 billion", "body": "Images from GoodRx Holdings Inc.'s filing with the Securities and Exchange Commission. GoodRx Holdings Inc. followed its prescription for a strong initial public offering, and it didn’t come cheap. The app that helps consumers find cheaper prices on prescription drugs and other medical help raised more than $1 billion in its IPO by pricing shares nearly 18% higher than the top of its stated range Wednesday. GoodRx GDRX, -2.40% shares began trading Wednesday on the Nasdaq and jumped more than 50% from the $33 IPO price, opening at $46 a little after noon Eastern time and riding a late surge to close up 53% at $50.50. GoodRx sold roughly 34.6 million shares at the IPO price, to raise $1.14 billion at a valuation of $12.67 billion. It also sold $100 million in class A stock concurrently to Silver Lake, a private-equity firm that already owns more than 126 million class B supervoting shares of the stock. GoodRx is considered a controlled company because of the big-money investors that hold supervoting shares, which also includes Francisco Partners, Spectrum and Idea Men; combined, those investors will hold more than 90% of the votes in the company. The Santa Monica, Calif., company will receive proceeds from the sale of roughly 23.4 million shares, about $772 million, as well as the private placement, while selling stockholders will receive the rest. Underwriters, led by Morgan Stanley, Goldman Sachs, JPMorgan and Barclays, have access to an additional 5.2 million shares that would come from the company. Spectrum and Idea Men are selling more than 10 million shares combined in the offering, while employees and directors are also selling some stock in the deal. GoodRx intends to use the proceeds for general corporate purchases, potentially including acquisitions. See also: IPO like it’s 1999 because the market is near dot-com-boom levels GoodRx celebrated the ninth anniversary of its founding this month, and passed a $500 million revenue run rate in the first six months of the year while turning a profit. For the six months ended June 30, GoodRx recorded net income of $54.7 million revenue of $256.7 million, after net income of $31.2 million on revenue of $173.2 million a year ago. The company is known for its app that helps consumers determine the best prices for their prescription drugs, but has also moved into the telehealth field. In 2019, GoodRx acquired telehealth provider HeyDoctor for $14.3 million, and the company launched its own telehealth marketplace this year. “Our data suggests that approximately 20% of consumers who search for medications on GoodRx do not have a prescription at the time of their search,” the company said in its IPO prospectus filed with the Securities and Exchange Commission. “Through HeyDoctor and the GoodRx Telehealth Marketplace, we can provide these and other consumers with a convenient and affordable way to receive a diagnosis and a prescription online, when medically appropriate.” Exclusive: Behind the scenes of Unity’s unique IPO in the middle of a pandemic GoodRx chose a strong time to go public. Shares began trading the same day that stock in Laird Superfood Inc. LSF, +0.22%, a consumer packaged goods company founded by surfing superstar Laird Hamilton, debuted and jumped more than 77%. Last week was the busiest in more than a year for the IPO market, and included another telehealth-focused company — American Well Corp. AMWL, -8.90%, commonly referred to as AmWell — and a host of hot software debuts including Snowflake Inc. SNOW, -0.91% and Unity Software Inc. U, +8.43% All of those companies enjoyed strong debut gains as well. The Renaissance IPO ETF IPO, +1.98% has increased 24% over the past three months while the S&P 500 SPX, +0.87% has gained 5.3%. Correction: An earlier version of this article had an incorrect age for GoodRx, which is nine years old."}]}