{"article": [{"url": "https://www.marketwatch.com/story/microsofts-bid-to-buy-tiktok-reportedly-rejected-11600039684", "published": 1600052780.0, "headline": "The clock is ticking on TikTok and at least one deal is dead", "body": "TikTok's campus in Culver City, Calif. AFP/Getty Images The clock is ticking on TikTok after potential avenues to avoid President Donald Trump’s promised ban on the Chinese app appeared to dry up as the week began. Microsoft Corp. MSFT, +2.48% announced Sunday that its bid for TikTok had been turned down, with no explanation as to why the deal was rejected. After reports that Oracle Corp. ORCL, +0.42% would become a “trusted tech partner” for TikTok parent Bytedance, a Chinese state-affiliated news source reported that Bytedance will “not sell TikTok’s U.S. operations to Oracle.” Trump originally issued a Sept. 15 deadline for TikTok’s U.S. operations to be sold to an American company or be banned, but his executive order established a Sept. 20 deadline. Microsoft – which had attempted to bring Walmart Inc. WMT, +1.00% into the deal – and Oracle were reported to be the only suitors until Microsoft publicly threw in the towel Sunday afternoon. “ByteDance let us know today they would not be selling TikTok’s U.S. operations to Microsoft,” Microsoft said. “We are confident our proposal would have been good for TikTok’s users, while protecting national security interests. To do this, we would have made significant changes to ensure the service met the highest standards for security, privacy, online safety, and combatting disinformation, and we made these principles clear in our August statement. We look forward to seeing how the service evolves in these important areas.” The sticking point to a sale has been TikTok’s underlying algorithm, which may not be able to be transferred to a U.S. company under new Chinese tech-export rules. Reuters reported last week that it’s also possible that the Chinese government prefers no sale at all, as to not want to appear weak in the face of U.S. pressure. TikTok, the wildly popular video-sharing app, has more than 100 million users in the U.S., but the Trump administration has claimed the app’s Chinese ownership makes user data vulnerable to misuse by the Chinese government."}]}