{"article": [{"url": "https://www.marketwatch.com/story/airline-stocks-rally-after-data-showing-rise-in-travel-demand-over-labor-day-weekend-2020-09-08", "published": 1599636500.0, "headline": "Airline stocks rise after data showing rise in travel demand over Labor Day weekend", "body": "Shares of U.S. airline companies traded mostly higher Tuesday, as signs of increasing travel demand and bullish analysts calls helped the industry buck the selloff in the broader stock market. The U.S. Global Jets exchange-traded fund JETS, +0.16% gained 0.1% to $18.26, but pared earlier gains of as much as 1.5%. Among the ETF’s nine U.S.-based air carrier components, eight are gaining ground. The Dow Jones Transportation Average DJT, +0.84% dropped 1.3% to outperform the Dow Jones Industrial Average DJIA, +0.56% , which tumbled 632 points, or 2.3%. The only five of 20 Dow transport components to produce gains were airline stocks. Within the Dow transports, shares of Southwest Airlines Corp. LUV, +1.89% climbed 2.8%, JetBlue Airways Corp. JBLU, -0.07% rallied 2.6%, Delta Air Lines Inc. DAL, +0.39% rose 2.4%, Alaska Air Group Inc. ALK, +0.15% advanced 1.9% and American Airlines Group Inc. AAL, +0.34% tacked on 0.2%. United Airlines Holdings Inc.’s stock UAL, +0.32% was the lone airline loser, falling 2.4%. Data from the U.S. Transportation Security Administration (TSA) showed that 3.36 million people went through TSA checkpoints over the long Labor Day weekend, according to a MarketWatch analysis of TSA data, including the four days from Friday through Sunday. That compares with the 2.68 million people traveling over the long July 4th weekend, and the 1.21 million people that traveled over the Memorial Day weekend. In addition, there were more than 900,000 people traveling on Friday (968,673) and on Monday (935,308), the TSA data show, the first time the daily total topped the 900,000 mark since March 17. Don’t miss: Coronavirus update: Global case tally tops 27.3 million, and U.S. accounts for a quarter, as 9 drug-company CEOs pledge to ‘stand with science’ in vaccine development. Separately, August marked the fourth consecutive month that the daily average of travelers improved from the previous month. There was an average of 700,260 people a day going through TSA checkpoints in August, up from an average of 669,057 people a day in July and compared with the post-COVID-19 low of 109,567 a day in April. Cowen analyst Helane Becker said results of Cowen’s survey “clearly suggest the worst is behind us,” given signs that positive sentiment surrounding travel seems to be building. While she remains neutral to negative on airline stocks in the near term, the survey indicated there was “pent up demand” for travel, as 52% expect to fly by the end of the year versus only 34% that have flown during the pandemic. Also helping provide a boost to the sector, Morgan Stanley analyst Ravi Shanker initiated coverage of U.S. airlines with an “attractive” industry view, and four of the six companies he’s covering with bullish outlooks. “We’re bullish on timeline recovery in airline traffic which underpins our attractive industry view and drives significant upside to our average price target,” Shanker wrote in a note to clients. “However, we expect significant turbulence during the recovery and recognize the need to be selective with our stock picks.” Shanker’s “base case” is a return in traffic, in terms of revenue passenger miles, to pre-COVID-19 pandemic levels in late 2021 to early 2022, while his “bull case” calls for early 2021 and his “bear case” is for 2024. He started coverage of Delta, JetBlue and Southwest, as well as Allegiant Travel Co. ALGT, +2.16% , with overweight ratings. He targets $50 for Delta’s stock, $16 for JetBlue, $54 for Southwest and $175 for Allegiant. Allegiant’s stock gained 0.7%. Meanwhile, he started United Airlines at underweight, with a $37 stock price target that was slightly below current levels. “We believe [United] has the most challenged network of any airline in our coverage based on our path for a COVID recovery and a leverage balance sheet, which could limit rebound opportunities,” Shanker wrote. He also said that while United Chief Executive Scott Kirby is well regarded by investors, they may wait to see evidence that Kirby is focused on cost improvement rather than aggressive growth at the cost of unit revenue. Shanker initiated Alaska Air at equal weight with a $46 stock price target. He didn’t initiate coverage of American Airlines."}]}