{"article": [{"url": "https://www.marketwatch.com/story/google-searches-for-k-shaped-recovery-white-supremacy-and-how-to-move-to-new-zealand-spiked-during-the-debate-2020-09-30", "published": 1601477300.0, "headline": "Google searches for K-shaped recovery, white supremacy and â\u0080\u0098how to move to New Zealandâ\u0080\u0099 spiked during the debate", "body": "The first presidential debate between Donald Trump and Joe Biden may have raised more questions than it answered. While the political opponents battled over the government response to the coronavirus pandemic, economic recovery and civil unrest across the country â\u0080\u0094 often talking over each other and steamrolling over moderator Chris Wallace in the process â\u0080\u0094 viewers turned to search engines like Google GOOG, +1.97% and dictionary sites like Merriam-Webster to help decipher what the candidates were saying. During the first hour of the roughly 90-minute debate, Googleâ\u0080\u0099s top trending searches were: 1. K-shaped recovery 2. Roe v. Wade 3. How many people have pre existing conditions? 4. Who is winning the debate? 5. Affordable Care Act These correlated with the candidates arguing over whether weâ\u0080\u0099ll see a V-shaped (Trump) or K-shaped (Biden) economic recovery, as well as Trump nominating conservative Amy Coney Barrett for Ruth Bader Ginsburgâ\u0080\u0099s vacant Supreme Court seat, and concerns that she could overturn Roe v. Wade, the landmark decision that legalized abortion. Opinion:Â About that K-shaped recovery: For half of America, the economy is still terrible Trump and Biden also sparred over health care, with Biden accusing Trump of cutting coverage for â\u0080\u009c100 million people who have pre-existing conditionsâ\u0080\u009d in the presidentâ\u0080\u0099s attempts to scrap the Obama-era Affordable Care Act. Trump countered that, â\u0080\u009cThere arenâ\u0080\u0099t 100 million people with pre-existing conditions.â\u0080\u009d The real number depends upon whom you ask: The Kaiser Family Foundation estimated that at least 53.8 million adults had pre-existing conditions in 2018, but a 2017 Department of Health and Human Services studyÂ estimatedÂ that 133 million people had pre-existing conditions that would make them unable to buy insurance. Read more:Hereâ\u0080\u0099s where Trump and Biden stand on health care Search interest for â\u0080\u009cwhite supremacyâ\u0080\u009d also surged during the debate, after Wallace asked Trump to condemn white supremacists and militia groups, and to tell them to stand down and not add to the violence in cities that have been rocked by protests against racial injustice and police brutality. The presidentâ\u0080\u0099s response left many critics concerned. He told the Proud Boys, a far-right group that the Southern Poverty Law Center has classified as a hate group, and that has been suspended by Twitter TWTR, -0.23% Â and Facebook FB, +0.26%, to â\u0080\u009cstand back and stand by.â\u0080\u009d He then added, â\u0080\u009cBut Iâ\u0080\u0099ll tell you what, somebodyâ\u0080\u0099s got to do something about antifa and the left.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } This exchange led the top trending-related search, â\u0080\u009cTrumpâ\u0080\u0099s response to white supremacy,â\u0080\u009d to spike more than +5,000%, Google reported. That subject struck a nerve with a lot of viewers, as â\u0080\u009cProud Boysâ\u0080\u009d was the top Twitter trend on Wednesday morning, and â\u0080\u009cTrumpâ\u0080\u009d and â\u0080\u009cwhite supremacyâ\u0080\u009d also dominated Google trends early in the day. The New York Times reported that the Proud Boys themselves were calling Trumpâ\u0080\u0099s comments â\u0080\u009chistoric,â\u0080\u009d and that in one channel dedicated to the Proud Boys on the private messaging app Telegram, members considered the presidentâ\u0080\u0099s words a â\u0080\u009ctacit endorsement of their violent tactics.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } Merriam-Webster tracked dictionary lookups during and after the debate, as well, finding that the most searched words included â\u0080\u009cwhite supremacist,â\u0080\u009d â\u0080\u009cantifa,â\u0080\u009d â\u0080\u009cpetulant,â\u0080\u009d â\u0080\u009cracism,â\u0080\u009d â\u0080\u009cpoll watcher,â\u0080\u009d â\u0080\u009cmoderatorâ\u0080\u009d and â\u0080\u009cstandby,â\u0080\u009d which could all be traced back to Trump and Bidenâ\u0080\u0099s heated exchanges on Tuesday night. iframe.twitter-tweet { width: 100% !important; } Dictionary.com also picked up on CNNâ\u0080\u0099s Dana Bash calling the debate a â\u0080\u009cshâ\u0080\u0094show,â\u0080\u009d clarifying that the crude phrase is one word, and saying that searches for it suddenly spiked on Tuesday night. iframe.twitter-tweet { width: 100% !important; } Whatâ\u0080\u0099s more, U.S. Google searches for â\u0080\u009chow to move to New Zealandâ\u0080\u009d also skyrocketed during the debate, according to Google Trends and reported by Newshub, a New Zealand media company. People in the state of Oregon (home to Portland, which has been a hotbed of protests against injustice) googled â\u0080\u009chow to move to New Zealandâ\u0080\u009d the most, while residents in Washington, Nevada and UtahÂ were also especially interested, according to the data. Related:Hereâ\u0080\u0099s how you can get foreign citizenship and a second passport in as little as two years Read MarketWatchâ\u0080\u0099s debate analysis here, and track our 2020 election coverage here."}]}