{"article": [{"url": "https://www.marketwatch.com/story/some-workers-complain-tesla-has-threatened-firings-if-they-dont-return-to-work-2020-07-01", "published": 1593635240.0, "headline": "Some workers complain Tesla has threatened firings if they donâ\u0080\u0099t return to work", "body": "DETROIT â\u0080\u0094 Some Tesla workers and labor activists say the company is threatening to fire employees who havenâ\u0080\u0099t returned to the companyâ\u0080\u0099s California factory since it reopened because theyâ\u0080\u0099re afraid of catching the coronavirus. The group wants the practice to stop, and it also wants state and county officials to do a better job making sure proper safety procedures are followed at the factory in Fremont, in the San Francisco Bay Area. â\u0080\u009cThere are people we are paying to keep us safe, and theyâ\u0080\u0099re just turning the other cheek,â\u0080\u009d said Tesla worker Carlos Gabriel, who is among the organizers of a rally scheduled for Thursday at the Alameda County Public Health Department in Oakland. â\u0080\u009cThey should be holding (Tesla CEO) Elon Musk accountable.â\u0080\u009d A Tesla spokesman wouldnâ\u0080\u0099t immediately comment Wednesday, but company officials said at a public hearing on tax incentives in Texas last week that claims of Fremont workers being fired are untrue. Tesla TSLA, +1.89% Â has released plans to maintain worker safety including temperature checks, the wearing of gloves and masks, installing barriers between workers and maintaining social distancing. In early May, Musk told workers that they didnâ\u0080\u0099t have to return to the plant if they werenâ\u0080\u0099t comfortable with it. A message was left Wednesday seeking comment from the health department. Problems at the factory are among several that have flared up in the auto industry in recent weeks. Assembly lines at two Fiat Chrysler FCAU, -0.95% Â plants in the Detroit area were briefly shut down this week due to fears over viral spread, and local union officials want General Motors GM, -0.15% Â to close and clean an SUV factory in Arlington, Texas. Gabriel and another Tesla worker say they have heard of COVID-19 cases among workers at the Fremont factory, but donâ\u0080\u0099t know numbers because the company wonâ\u0080\u0099t tell them. They want the health department to release numbers and to trace whoever came in contact with sick workers rather than letting Tesla do it. Branton Phillips, a towmotor operator who has returned to work, says many workers donâ\u0080\u0099t wear masks covering their nose and mouth in the plant, and they remove them and donâ\u0080\u0099t keep proper social distance when they go outside. Heâ\u0080\u0099s worried about getting sick and spreading it to his longtime girlfriend who is vulnerable to the virus, he said. â\u0080\u009cI had to go back. I need the (medical) insurance,â\u0080\u009d Phillips said, adding that Tesla is trying to enforce mask requirements inside the factory. He says employees have been threatened with being fired, but then told they wonâ\u0080\u0099t be fired, creating confusion. Musk reopened the Fremont plant May 11 in defiance of Alameda County orders to stay closed. The county health department had deemed the factory a nonessential business that canâ\u0080\u0099t fully open under virus restrictions, but Tesla contended it was essential under federal guidelines. The next day, however, the health department announced that the plant could return to manufacturing as long as it delivers on worker safety precautions that it agreed to. Earlier this week, the United Auto Workers union sent teams to the two Fiat Chrysler plants and the Texas factory to investigate employee fears about other workers being infected, spokesman Brian Rothenberg said. He didnâ\u0080\u0099t know how many coronavirus cases there were at each of the plants. GM says its safety protocols in Arlington are working and it has not changed production plans. It says in a statement that some workers have tested positive at the plant because there is no vaccine or cure."}]}