{"article": [{"url": "https://www.marketwatch.com/story/cdc-finally-issues-social-distancing-guidelines-as-states-press-forward-with-reopening-plans-2020-06-12", "published": 1592204000.0, "headline": "CDC finally issues social-distancing guidelines as states press forward with reopening plans", "body": "The Centers for Disease Control and Prevention on Friday issued a set of social-distancing guidelines for Americans as states and cities move forward with plans to reopen their economies. The CDC’s new guidelines, called Considerations for Daily Life and Considerations for Events and Gatherings, recommend that people continue to maintain a distance of 6 feet from others whenever possible, wear face coverings in public, and wash their hands. The new guidelines also provide specific recommendations for visiting libraries, hotels, banks, nail salons, gyms, restaurants and bars, and attending gatherings at someone’s home or in public spaces, and cite questions that individuals should ask themselves before they engage with others, in these spaces. See also:Should all Americans be wearing face masks to protect against coronavirus? The CDC now says yes Some of the recommendations include: providing single-serve options or putting one person in charge of serving items like salad dressings and condiments at home gatherings, relying on online banking or ATMs when possible, sitting outside at restaurants, booking manicures or pedicures in advance to alleviate waiting times in shared spaces, and taking the stairs rather than an elevator at a hotel. “We recognize we’re all getting tired of staying home,” Dr. Jay Butler, the CDC’s deputy director for infectious diseases, said during the call on Friday. Read now:U.S. states slowly reopen after coronavirus lockdowns — some now permit visits to nursing homes In response to a question from a reporter about whether the guidelines conflict with plans for the Republican National Convention, currently slated to be held in August in both Charlotte, N.C., and Jacksonville, Fla., Butler said the guidelines “are recommendations or suggestions.” Until recently, health officials worldwide have shared wide-ranging views on wearing masks during the pandemic. The CDC first told Americans to wear face coverings in early April, and the World Health Organization on June 5 updated its own mask-wearing guidance to recommend that governments encourage masks among the public in areas whether there is both widespread transmission of the virus and social-distancing challenges, such as on public transportation. Read:Asymptomatic transmission of coronavirus appears to be worse than SARS or influenza — 5 reasons you should care This was the first call that the CDC has held with reporters since March. Before then, the federal agency conducted calls with journalists sometimes several times a week starting at the end of January when concerns began mounting about the spread of COVID-19 in the U.S. At least two million people in the U.S. have tested positive for the virus, and more than 114,000 have died, according to data aggregated by Johns Hopkins University. In recent weeks, parts of the country have began reopening their economies, allowing Americans to go to the beach, shop at certain retailers, and some to return to work."}]}