{"article": [{"url": "https://www.marketwatch.com/story/the-markets-in-la-la-land-and-one-warren-buffett-buff-warns-of-an-imminent-reckoning-for-oblivious-investors-2020-06-18", "published": 1592685560.0, "headline": "â\u0080\u0098La la land?â\u0080\u0099 The stock market is â\u0080\u0098insanely disconnectedâ\u0080\u0099 and due for a â\u0080\u0098reckoning,â\u0080\u0099 Warren Buffett buff warns", "body": "Those betting against this â\u0080\u009cabsurdly overvaluedâ\u0080\u009d stock market are about to get paid, if Kevin Smith, Crescat Capitalâ\u0080\u0099s chief investment officer, has it right in his gloomy assessment. â\u0080\u009cSpeculation is rampant and being championed by a bold new breed of millennial day traders,â\u0080\u009d he said. â\u0080\u009cThe mania is based on a widespread hope in Fed money printing. The catalysts for reckoning are numerous as a major cyclical economic downturn has only just begun.â\u0080\u009d Smith, who recently talked about learning the ropes from a stack of Berkshire Hathaway BRK.A, +0.06% BRK.B, +0.24% Â shareholders letters his dad gave him long ago, said, in a very unâ\u0080\u0093Warren Buffett fashion, that shorting stocks â\u0080\u009cis worthy of a significant allocation today.â\u0080\u009d Smith used this chart of plunging S&P 500 SPX, +0.87% profit margins to show â\u0080\u009chow insanely disconnected equity prices are from their underlying fundamentals.â\u0080\u009d He warned that buy-the-dip investors are â\u0080\u009cnot paying attention and have simply been too eager to call the bottom.â\u0080\u009d Smith reiterated his â\u0080\u009cmacro trade of the centuryâ\u0080\u009d call that thereâ\u0080\u0099s never been a better set-up for rotating out of overvalued stocks and into undervalued precious metals. â\u0080\u009cMarkets driven by euphoria never end well,â\u0080\u009d he explained in a note to clients this week. â\u0080\u009cThe U.S. stock market today is in la-la land. It is discounting a new expansion phase of the economy at the same time as a major recession has only just begun.â\u0080\u009d Smith took some lumps in his funds when the market was soaring early in the year, but his returns ballooned in March as the coronavirus pandemic arrived. Here are his historical numbers: The severe â\u0080\u009creckoningâ\u0080\u009d Smith has been warning about hasnâ\u0080\u0099t arrived as of Thursdayâ\u0080\u0099s trading session, but the Dow Jones Industrial Average DJIA, +0.56%, S&P 500 and tech-heavy Nasdaq Composite COMP, +1.39% were all under pressure, at last check."}]}