{"article": [{"url": "https://www.marketwatch.com/story/pandemic-antitrust-doesnt-matter-to-big-tech-which-just-reported-nearly-200-billion-in-sales-2020-07-30", "published": 1596279980.0, "headline": "Pandemic? Antitrust? No worries for Big Tech, which racked up $200 billion in sales anyway", "body": "Amid a global pandemic and concerted antitrust scrutiny, the Big Tech quartet in regulators’ sights are just getting bigger. Alphabet Inc. GOOG, +1.97% GOOGL, +1.82% GOOGL, +1.82% Amazon.com Inc. AMZN, +3.01%, Apple Inc. AAPL, +1.74% and Facebook Inc. FB, +0.26% combined Thursday to report profit of nearly $29 billion on sales approaching $200 billion in the second quarter, the first full three-month period of the COVID-19 pandemic. The four collectively crushed Wall Street’s expectations a day after a five-and-a-half-hour-long congressional hearing on anticompetitive practices in which their CEOs answered questions from lawmakers on their dominant positions in the marketplace. Their stocks in after-hours trading mirrored that view, with all four stocks gaining and pushing toward a combined market cap increase of more than $200 billion. The four companies combined were worth almost $5 trillion at the close. Combined revenue for the four — excluding traffic acquisition costs, or TAC, for Google parent Alphabet — was $198.11 billion, with Amazon reporting the most stunning revenue and earnings beat after Chief Executive Jeff Bezos promised to spend all of Amazon’s profit on responding to the pandemic. For more: Tech has been a pandemic savior and been richly rewarded. So what happens now? With more people stuck at home and relying on shopping online and working on cloud-computing power, Amazon’s net income was instead a record for the e-commerce giant. Chief Financial Officer Brian Olsavsky told analysts on its conference call that online grocery sales tripled in the quarter and world-wide video streaming doubled from a year ago. Amazon’s physical stores saw a 13% decline, however, as more consumers used online grocery delivery services while sheltering in place. Wall Street had been looking for the four giants to report a combined revenue of $181.5 billion, according to FactSet, compared with $165.7 billion in the year-ago quarter, excluding TAC for Alphabet. Combined revenue for the four grew nearly 20%. Amazon’s earnings beat pushed the four’s combined net income to $28.6 billion, far surpassing analysts’ average estimate of approximately $19.04 billion, according to FactSet, and marking growth of more than 13% from $25.21 billion a year ago despite the pandemic. Apple would not be impressed by Amazon’s record profit, as the iPhone maker recorded more than double Amazon’s earnings, surpassing $11 billion despite shutting down its Apple Stores in some geographies for some short periods due to the pandemic. The company told investors on its conference call that it is having a very strong cycle of demand with the smaller, lower-cost iPhone 11, and that the work-from-home trend helped fuel stronger sales of the iPad and the Mac. “Mac and iPad, these are productivity tools that people are using to stay engaged with their work or stay engaged with their schoolwork,” Apple Chief Executive Tim Cook told analysts. “And we believe we’re going to have a strong back-to-school season sitting here today, it certainly looks like that.” The company also announced a surprise four-for-one stock split. For more: How Apple’s stock split will change the Dow’s pecking order While Apple and Amazon flourished, there were difficulties for Facebook and Google, which rely on online advertising for their revenue, a category that could face larger headwinds from the COVID-19 pandemic. Alphabet met expectations but display ads on Google fell, producing a decline in Google’s ad revenue for the first time. “The macroeconomic environment costs by the pandemic created headwinds for our business,” Alphabet CEO Sundar Pichai, told analysts, adding that during the current quarter, the company saw early signs of stabilization as users returned to commercial activity online. “This was true across most of our advertising verticals and geographies. Of course, the economic climate remains fragile.” More from Therese: Big Tech painted as the railroad barons of the digital age in antitrust hearing Facebook, though, had the biggest after-hours jump in its stock price after it beat Wall Street expectations by topping $5 billion in quarterly profit. Facebook said that its traffic grew during the pandemic, with more people at home online, but that the average price per ad declined due to the economic fallout of COVID-19. “Facebook has been a lifeline of economic activity,” said Chief Financial Officer David Wehner. So even though every one of the tech giants discussed the economic slowdown as a result of the global pandemic, for the most part, they have been largely unaffected — and in Amazon’s case, made even more money — as their services became more necessary. Big Tech just keeps proving that little can stop them from getting bigger, unless the government decides to do something to try to stop it."}]}