{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-pandemic-not-even-close-to-being-over-who-chief-warns-the-worst-is-yet-to-come-2020-06-29", "published": 1593456020.0, "headline": "Coronavirus pandemic â\u0080\u0098not even close to being over,â\u0080\u0099 WHO chief warns. â\u0080\u0098The worst is yet to comeâ\u0080\u0099", "body": "“ â\u0080\u009cWe all want this to be over. We all want to get on with our lives. But the hard reality is that this is not even close to being over.â\u0080\u009d ” That was the grim message from Tedros Adhanom Ghebreyesus, head of the World Health Organization, on Monday during a briefing about the state of the coronavirus pandemic. Tuesday marks the six-month anniversary of the outbreakâ\u0080\u0099s first reported cases in China. â\u0080\u009cAlthough many countries have made some progress globally, the pandemic is actually speeding up,â\u0080\u009d Tedros said at the briefing in Geneva, Switzerland. â\u0080\u009cThe worst is yet to come. Iâ\u0080\u0099m sorry to say that.â\u0080\u009d His remarks came a day after COVID-19 reached two dire milestones: 10 million confirmed infections worldwide, and 500,000 deaths. Read:Coronavirus update: Global COVID-19 case tally tops 10 million and Florida, South Carolina and Nevada set daily records â\u0080\u009cSix months ago, none of us could have imagined how our world â\u0080\u0094 and our lives â\u0080\u0094 would be thrown into turmoil by this new virus,â\u0080\u009d he said. â\u0080\u009cThe pandemic has brought out the best and the worst of humanity.â\u0080\u009d Tedros said WHO plans to send a team to Wuhan, China, next week to investigate the virusâ\u0080\u0099s origins, a move sought by the U.S. President Donald Trump has harshly criticized WHO for what heâ\u0080\u0099s called its close relationship with China, and has announced the U.S. will pull out of WHO. At the briefing, Tedros reiterated that people, even those not feeling symptoms, need to continue to physically distance, wash their hands and wear masks when appropriate. â\u0080\u009cYou may be in a low-risk category, but the choices you make could be the difference between life and death for someone else,â\u0080\u009d he said. Also see: Watch out for these 3 new coronavirus symptoms Tedros said contact tracing was the best way to fight the spread of the disease, and expressed frustration at countries where it has not been successful. â\u0080\u009cNo excuse for contact tracing. If any country is saying contact tracing is difficult, it is a lame excuse,â\u0080\u009d he said. Contact tracing has been notably poor in the U.S., with Dr. Anthony Fauci, the governmentâ\u0080\u0099s top infectious disease expert, saying Friday that the process of tracking down people who may have been exposed to those infected was â\u0080\u009cnot going well.â\u0080\u009d"}]}