{"article": [{"url": "https://www.marketwatch.com/story/us-regains-48-million-jobs-in-june-and-unemployment-falls-to-111-2020-07-02", "published": 1593689720.0, "headline": "U.S. regains 4.8 million jobs in June and  unemployment falls to 11.1%, but rehiring poised to slow", "body": "The numbers: The U.S. added 4.8 million jobs in June and the unemployment rate fell for the second straight month to 11.1%, but the economy’s recuperation from the coronavirus might already be suffering a setback from a renewed surge in COVID-19 cases. Stock rose after the June employment numbers. The increase in new jobs exceeded the 3.7 million forecast of economists polled by MarketWatch. Millions of people have returned to work since the states began to reopen in May, signaling a recovery took root after what’s likely to turn out to be the deepest and shortest recession in American history. Still, the economy has a long way to go to get back to normal, especially with the coronavirus coursing through the veins of major population arteries such as Los Angeles, Houston and Miami. Some states have reimposed restrictions and others plan to proceed more slowly on reopening because of the fresh viral outbreak. The survey used to compile the June employment report took place from June 7 to June 13 — before the latest wave of coronavirus cases erupted. More people are returning to work, but companies have instituted a number of safeguards to try to protect themselves and workers from new coronavirus outbreaks. Getty Images The U.S. lost more than 22 million jobs during the height of the pandemic and only restored 7.5 million of them in the past two months. After the report, President Trump lauded the surge in new jobs and vowed that the economy will keep growing — unless voters choose Democrat Joe Biden in the November presidential election. He said Biden would raise taxes and hurt the economy. The Democrats, for their part, said the crisis is not over and accused Trump of putting his reelection effort ahead of the safety of citizens. “Americans can’t afford another four years of Trump’s failures,” the Democratic National Committee said. See:Marketwatch’s Coronavirus Economic Recovery Tracker What happened: Bars and restaurants recalled an additional 1.48 million workers as many were allowed to offer outdoor dining in the early stages of the economy reopening. They also brought back a similar number of workers in May. The industry had shed more than 6 million jobs in the first two months of the pandemic. Employment also rebounded by 740,000 in retail, 358,000 health care and 356,000 in manufacturing The energy sector was one of the few areas of the economy to reduce staff again. Employment fell by 10,000. There’s been sharp decline in demand for oil during the pandemic. Average hourly wages fell sharply for the second straight month after a record increase in April, reflecting the return of more workers in lower-paid jobs who bore the brunt of the shutdowns. The massive swings in employment caused by pandemic have thrown the normally slow-changing wage data out of whack. “The wage figures will be pretty much useless for a long while until the labor market gets back to some semblance of normality,” said Stephen Stanley, chief economist of Amherst Pierpont Securities. Still, other reports suggest some companies that have reopened are cutting pay or terminating jobs for good after concluding sales are unlikely to return to precrisis levels anytime soon in light of the depressed U.S. and global economies. These continuing job losses will also restrain a recovery. In a separate report Thursday, the government said 2.3 million new applications for unemployment compensation were filed through state or federal benefit programs. Read:Jobless claims continue slow but steady descent in late June More people are returning to work, but companies have instituted a number of safeguards to try to protect themselves and workers from new coronavirus outbreaks. Getty Images The official unemployment rate, meanwhile, sank to 11.1% from 13.3%. The BLS has tried to correct a problem in how households respond to its monthly survey that was causing the government to underestimate the jobless rate. The Bureau of Labor Statistics estimated the jobless rate would have been 1 point higher if not for continued problems in how respondents answer the question about their employment status. A broader measure of unemployment known as the U6 suggests the “real” rate was 18% in June, down from 21.2% in the prior month. The U6 rate includes workers who can only find part-time jobs and those who’ve become too discouraged to look for jobs because so few are available. The government revised the May employment gain up to 2.7 from a preliminary 2.51 million. The record loss of jobs in April was raised slightly to 20.8 million. Big picture: The rapid recovery in jobs in May and June could soon give way to a slower improvement in hiring or an outright pause if the new spate of coronavirus cases delays further moves to reopen the economy. Some states have ordered bars to re-close and told restaurants they can’t offer inside dining yet. See: U.S. case tally climbs above 2.6 million, and top Republicans now call on Americans to wear face masks Cell-phone and other data that track the movement of people indicate fewer Americans were getting out and about at the end of June compared to the start of the month. More people began wearing masks again and practicing social distancing after letting down their guard. Another looming threat to the economy is the end of emergency federal benefits for unemployed workers at the end of July. Unless Washington extends its relief programs, analysts say, the U.S. could suffer a big drop in demand that forces companies to scale back rehiring plans — and further shackle the economy. Read:Manufacturers come back strong in June, but ‘it’s a slow recovery at this point’ What they are saying?“The end of the lockdowns has allowed for a faster than expected recovery in jobs in the past two months, but more recent events and data suggest much tougher slogging ahead,” said Sal Guatieri, senior economist at BMO Capital Markets. “Today’s positive jobs report does provide a powerful signal of how swiftly U.S. job growth can bounce back and how rapidly businesses can reopen once the nation finally brings the coronavirus under control — a reason for optimism in coming months,” said chief economist Andrew Chamberlain of the job-posing site Glassdoor. Yet like Guatieri he expects tougher times for the next few months. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% were rose sharply in Thursday trades on the strong jobs report."}]}