{"article": [{"url": "https://www.marketwatch.com/story/lyft-revenue-and-riders-slashed-by-more-than-half-but-layoffs-save-earnings-11597263935", "published": 1597250000.0, "headline": "Lyft revenue and riders fall by more than half, and California could soon be cut off", "body": "Lyft reported second-quarter results Wednesday. AFP via Getty Images Lyft Inc.’s riders and revenue fell by more than half during a pandemic-dominated second quarter, the company reported Wednesday, and executives said they will cut off ride-hailing operations in their home state of California if forced to recognize drivers as employees. Unlike its much-bigger rival Uber Technologies Inc. UBER, -0.18%, Lyft LYFT, +2.16% doesn’t have a food-delivery business to help offset the rides it lost during its first full quarter dealing with the COVID-19 crisis and a weekslong lockdown. Also unlike Uber, Lyft operates only in the United States and Canada. However, like Uber, Lyft also mentioned the possibility of a shutdown in California if it fails to win an appeal of the injunction granted by a San Francisco Superior Court judge this week, which would force the company to classify its drivers as employees instead of independent contractors. Uber Chief Executive Dara Khosrowshahi said earlier Wednesday that his company could halt its service in the state through November if an appeal of that ruling is not successful, but Lyft executives used stronger language in a conference call Wednesday afternoon. Losing the appeal ”would force us to suspend operations in California,” said John Zimmer, president and co-founder of Lyft, during the call. California accounts for 16% of Lyft’s rides, Chief Financial Officer Brian Roberts later revealed. “We can’t reply to the injunction with the flip of a switch,” Zimmer said Wednesday, although he did not give further details because he said the company is counting on a ballot initiative that will put the issue before California voters in November. The judge gave Uber and Lyft 10 days to file an appeal before his order takes effect and the companies are forced to reclassify drivers. See: Uber and Lyft say they may shut down in California if forced to classify drivers as employees Lyft reported a second-quarter loss of $437.1 million, or $1.41 a share, on revenue of $339.3 million, down from $867 million a year ago. After adjusting for stock-based compensation and other effects, Lyft reported losses of 86 cents a share, worse than an adjusted loss of 68 cents a share a year ago but better than analysts’ expectations due to roughly $50 million in reversals of previous stock-based compensation costs for laid-off employees. Lyft announced a layoff of almost 1,000 employees in May, furloughs for nearly 300 more and pay cuts for those in leadership positions. Analysts surveyed by FactSet on average expected Lyft to post an adjusted loss of $1.05 a share on revenue of $339 million. Active riders dropped 60% in the quarter, to 8.7 million from 21.8 million. But Lyft did say it was beginning to see a rebound in demand for rides in some areas. “While rideshare rides in the quarter were down significantly year-over-year, we are encouraged by the recovery trends we are beginning to see, with monthly rideshare rides in July up 78% compared to April,” Chief Executive Logan Green said in a news release. During a conference call, Green also pointed to increased bike and scooter rentals as a bright spot, saying they surged 200% from April to June as riders sought “open-air” transportation options because of the pandemic. See also: Uber and Lyft must make drivers employees because California law has ‘overwhelming’ edge, judge says Shares of Lyft rose more than 2% in after-hours trading immediately following the release of the report, but then swung to a decline of less than 1% during the conference call. The stock is down 29.1% this year, as the S&P 500 index SPX, +0.87% has increased 4.4%. During the call, Lyft executives were upbeat about the increasing demand in rides, saying they were now thinking of ways to attract drivers to the platform again. They also focused on the effects of the company’s cost-cutting measures, which helped it beat expectations and, they said, will boost the company’s path to profitability. See: Uber’s delivery business tops core ride-hailing as pandemic rocks earnings “We continued to take aggressive actions to reduce costs and increase our underlying unit economics in the quarter, which has put Lyft on track to achieve $300 million of annualized fixed cost savings by the end of the year,” CFO Roberts said in the announcement. “These steps position the company to achieve adjusted EBITDA profitability with 20%-25% fewer rides than originally contemplated in our fourth-quarter 2021 target.” But Tom White, analyst for D.A. Davidson, said Wednesday that Lyft’s optimism doesn’t take the legal uncertainty in California — which is still under statewide shelter-in-place orders, so ride demand continues to be low — into account. “Some of the targets they gave for the third quarter don’t really factor in the shutdown,” he said. Lyft did not provide guidance for the third quarter, citing uncertainty surrounding the pandemic."}]}