{"article": [{"url": "https://www.marketwatch.com/story/you-support-peaceful-protestors-but-would-they-approve-of-your-investments-2020-06-19", "published": 1592642000.0, "headline": "You support peaceful protestors. But would they approve of your investments?", "body": "Most individual investors don’t see themselves as activists. But in the aftermath of the May 25 killing of George Floyd while in Minneapolis police custody, many investors are looking at racial and societal problems and considering how their investment choices can support their values — including structuring a portfolio to advance racial equality and economic justice. “People really want to understand the impact that they’re having and what they’re actually supporting with their investments,” said Johny Mair, co-founder of Ethic, a New York City-based asset management platform that enables advisers to construct ESG (environmental, social and governance) portfolios based on a client’s sustainable criteria and priorities. The key is to customize a portfolio that directly addresses protesters’ concerns. Even though many companies align themselves with Black Lives Matter and express alarm at incidents of police brutality, there’s no guarantee that these same companies are model corporate citizens with an impeccable history of socially responsible behavior. Read: 5 ways to support black-owned businesses: ‘It’s not rocket science — people just choose not to do it’ Don’t miss: American investors who want to ‘do something’ about injustices are basically out of luck Some clear red flags can disqualify companies from inclusion in a hypothetical portfolio for protesters. Examples include publicly traded REITs (real estate investment trusts) that invest in private prisons and companies with financial ties to for-profit prisons. Some analysts argue that private prisons capitalize on mass incarceration trends that disproportionately affect minorities. Makers of firearms, as well as distributors and retailers that sell weapons, might fail the test. Companies across all sectors that do not pay what activists deem a fair, living wage also may be unfit for consideration, particularly because many frontline workers are people of color. “Racial diversity on the board [of directors] and management level is pretty important,” said Justina Lai, chief impact officer at San Francisco-based Wetherby Asset Management. “It has a huge impact on leadership, hiring practices, policies rolled out to workers and mentorship” within the organization. “ When choosing municipal bonds, metrics such as arrest statistics in a community and its use on public safety fees to finance operations can prove revealing. ” Lai encourages concerned clients to ask their financial advisers, “How do you select investments for my portfolio?” When choosing municipal bonds, for instance, metrics such as arrest statistics in a community and its use on public safety fees to finance operations can prove revealing. “Too much reliance on public safety fees might indicate overly aggressive policing,” Lai said. “You can also look at controversy flags for high-profile incidents of police brutality.” Many of America’s most familiar brands are declaring their support for peaceful protesters and their goals. But an eloquent message posted on the company’s website is only a starting point for screening whether a corporation truly walks the talk. “There’s a little bit of a danger in trying to get laser-focused on a specific issue when looking at ESG [mutual] funds,” said Dave Nadig, chief investment officer at ETF Trends in Irvine, Calif. “Take racial inequality. What data point would you get from Nike to address racial inequality?” Nike’s decision to be involved in Black Lives Matter and run ads promoting its commitment to its cause may be one criteria, Nadig points out, but, he adds, that alone may not suffice if you set more rigorous standards for picking investments. You can also align your money with protesters by choosing a bank that’s deeply engaged at a local level. Community development financial institutions (CDFIs) include credit unions with stated missions to, say, advance equality and serve economically disadvantaged individuals. Said Ebony Perkins, manager of investor and community relations for Self-Help Credit Union in Durham, N.C.: “Focusing on where you place your cash is the quickest and easiest way to make an impact.” Read: How activist investors risk triggering even more automation, job losses and wealth inequality More: How the coronavirus pandemic could change ‘do-good’ investing for the better"}]}