{"article": [{"url": "https://www.marketwatch.com/story/the-european-economy-slowed-down-in-august-heres-why-more-trouble-lies-ahead-11602247168", "published": 1602263480.0, "headline": "As number of COVID infections keeps rising, here's what governments have to do this winter", "body": "Bar in the city center of Manchester, northwest England. AFP via Getty Images The pace of the economic rebound in Europe slowed down significantly in August, according to latest gross domestic product and industrial production figures. And the number of COVID-19 infections keep rising in most countries, prompting fears about the impact of future, tougher restrictive measures. The U.K.'s GDP grew an estimated 2.1% on a monthly basis in August, the Office for National Statistics said on Friday, or less than half the median forecast of economists polled by Reuters. And most of the uptick was due to a temporary government subsidy of restaurant meals. Manufacturing output in France rose 1% in August after a 4.5% bounce in July, the national statistics institute said. And it stood more than 7% below its February, pre-pandemic level. The slowdown happened before more restrictive measures were taken in most European countries to counter the current, severe second wave of the coronavirus pandemic. Spain, France and the U.K. in particular are fast moving toward the kind of tough lockdown measures in place for several months earlier this year. Even in Germany, where the pandemic was best controlled, health minister Jens Spahn said on Thursday that he was \"highly concerned\" by the rise of infections, now at a level not seen since April. Read: Activist investors are the unexpected heroes of the pandemic for U.K. stocks - unlike in U.S. and Europe The outlook: Growth is hit both by the careless who shunned restrictions and caused the pandemic's second spike, and by the cautious who fear the future and keep saving. The daily, higher number of infections also increases what Bank of England chief economist Andy Haldane has called \"collective dread risk, fanned by contagious pessimism.\" Governments managed to curb the rise of unemployment in the first half of the year. Now they have to devise new programs that will protect jobs throughout the winter season. Tackling the coronavirus pandemic forcefully will have an economic cost. But so would a softer approach, if it increases the fear of it. Read: U.K. Launches Third Job Program This Year to Counter Economic Slowdown"}]}