{"article": [{"url": "https://www.marketwatch.com/story/biden-to-talk-up-his-plans-to-boost-u-s-manufacturing-as-he-visits-michigan-11599671330", "published": 1599665660.0, "headline": "Biden talks up his plans to boost U.S. manufacturing as he visits Michigan", "body": "Democratic presidential nominee Joe Biden arrives at Detroit Metro Wayne County Airport on Wednesday. AFP via Getty Images Joe Biden on Wednesday gave a speech in Michigan about what his campaign described as “his plan to ensure the future is Made in America by all of America’s workers,” as the Democratic presidential nominee continued an effort to counter President Donald Trump’s “America First” stance. Biden talked up his “Made in America” tax policy that his campaign had rolled out earlier in the day and which proposes a 21% minimum tax on all foreign earnings, noting features such as a new offshoring tax penalty and a 10% tax credit for companies making investments to create jobs for American workers. The Democratic challenger also promised executive actions in his first week as president that ensure the federal government isn’t shirking on pledges to “Buy American.” “I don’t buy for one second that the vitality of American manufacturing is a thing of the past,” he said. Biden also said the Republican incumbent “hasn’t stopped companies from closing plants and sending jobs overseas,” but instead has “rewarded companies that have cut jobs and failed to invest here at home with billions in tax breaks.” Opinion: The pandemic revealed the cracks in U.S. manufacturing — here’s how to fix them Biden has addressed boosting domestic manufacturing before, such as by making a July proposal for a $700 billion “Buy American” campaign. As he spoke in Warren, Biden also blasted Trump in the wake of well-known journalist Bob Woodward’s new book saying that the president knew the coronavirus was “deadly stuff” but wanted to “play it down.” The Democratic challenger said that was “a life-and-death betrayal of the American people.” The Trump campaign attacked Biden’s latest moves before the Democratic challenger’s speech. “It’s fascinating to me that Joe Biden is suddenly trying to masquerade as an economic nationalist,” Steve Cortes, a senior adviser for Trump’s re-election campaign, told reporters during a conference call on Wednesday. “Welcome to the party, but unfortunately you have no credibility, because you’ve been acting in exactly the other direction for nearly a half century.” The Trump team often has criticized Biden for his 1994 vote as a U.S. senator for the North American Free Trade Agreement, or Nafta, which now has been replaced by the U.S.-Mexico-Canada Agreement, or USMCA. Trump is due to make his own visit on Thursday to Michigan, a key swing state, with a trip to Freeland. Meanwhile, a United Auto Workers branch in Flint, Mich., representing General Motors GM, -0.15% employees praised Biden ahead of his visit to their state, saying in a video that he “had their backs” amid the 2008 auto bailout. Unions for steelworkers and machinists also issued statements expressing support for Biden or criticizing Trump’s record on aiding U.S. manufacturing. In a RealClearPolitics moving average of polls focused on top swing states that are likely to decide the election, Biden on Wednesday had an edge of 3.7 percentage points over Trump. Betting markets were giving the former vice president a 53.2% chance of winning vs. Trump’s 45.8%. The S&P 500 index SPX, +0.87% and the Dow Jones Industrial Average DJIA, +0.56% were recently trading higher on Wednesday, rebounding after a three-day selloff led by the tech sector."}]}