{"article": [{"url": "https://www.marketwatch.com/story/pompeo-says-tiktok-isnt-the-only-chinese-software-that-trump-will-take-action-against-2020-08-02", "published": 1596386780.0, "headline": "Pompeo says TikTok isnâ\u0080\u0099t the only Chinese company that Trump will take action against", "body": "NEW YORK â\u0080\u0094 President Donald Trump plans to take action on a what he sees as a broad array of national security risks presented by software connected to the Chinese Communist Party, Secretary of State Mike Pompeo said Sunday. Pompeoâ\u0080\u0099s remarks followed reports that Microsoft MSFT, +2.48% Â is in advanced talks to buy the U.S. operations of TikTok, which has been a source of national security and censorship concerns for the Trump administration. â\u0080\u009cThese Chinese software companies doing business in the United States, whether itâ\u0080\u0099s TikTok or WeChat â\u0080\u0094 there are countless more ... are feeding data directly to the Chinese Communist Party, their national security apparatus,â\u0080\u009d Pompeo said on Fox News Channelâ\u0080\u0099s â\u0080\u009cSunday Morning Futures.â\u0080\u009d â\u0080\u009cCould be their facial recognition patterns. It could be information about their residence, their phone numbers, their friends, who theyâ\u0080\u0099re connected to. Those â\u0080\u0094 those are the issues that President Trump has made clear weâ\u0080\u0099re going to take care of,â\u0080\u009d he said. TikTokâ\u0080\u0099s U.S. user data is stored in the U.S., with strict controls on employee access, and its biggest investors come from the U.S., the company said Sunday. â\u0080\u009cWe are committed to protecting our usersâ\u0080\u0099 privacy and safety as we continue working to bring joy to families and meaningful careers to those who create on our platform,â\u0080\u009d a TikTok spokesperson said. Trump had said on Friday that he would soon ban TikTok in the United States. A federal committee is reviewing whether thatâ\u0080\u0099s possible, and its members agree that TikTok cannot remain in the U.S. in its current form, because it â\u0080\u009crisks sending back information on 100 million Americans,â\u0080\u009d said Treasury Secretary Steven Mnuchin. â\u0080\u009cWe all agree there has to be a change ... everybody agrees it canâ\u0080\u0099t exist as it does,â\u0080\u009d Mnuchin said Sunday on ABCâ\u0080\u0099s â\u0080\u009cThis Week.â\u0080\u009d As speculation grew over a ban or sale of the social mediaâ\u0080\u0099s U.S. business, TikTok posted a video on Saturday saying: â\u0080\u009cWeâ\u0080\u0099re not planning on going anywhere.â\u0080\u009d TikTokâ\u0080\u0099s catchy videos and ease of use has made it popular, and it says it has tens of millions of users in the U.S. and hundreds of millions globally. Its parent company, Bytedance Ltd., launched TikTok in 2017. It bought Musical.ly, a video service popular with teens in the U.S. and Europe, and combined the two. It has a similar service, Douyin, for users in China. But TikTokâ\u0080\u0099s Chinese ownership has raised concern about the potential for sharing user data with Chinese officials as well as censorship of videos critical of the Chinese government. TikTok says it does not censor videos and it would not give the Chinese government access to U.S. user data. â\u0080\u009cThe President, when he makes his decision, will make sure that everything we have done drives us as close to zero risk for the American people,â\u0080\u009d Pompeo said. â\u0080\u009cThatâ\u0080\u0099s the mission set that he laid out for all of us when we get â\u0080\u0094 we began to evaluate this now several months back. Weâ\u0080\u0099re closing in on a solution. And I think you will see the presidentâ\u0080\u0099s announcement shortly.â\u0080\u009d The debate over TikTok parallels a broader U.S. security crackdown on Chinese companies, including telecom providers Huawei and ZTE. The Trump administration has ordered that the U.S. stop buying equipment from those providers to be used in U.S. networks. Trump has also tried to steer allies away from Huawei over concerns that the Chinese government has access to its data, which Huawei denies."}]}