{"article": [{"url": "https://www.marketwatch.com/story/home-prices-continued-to-rise-in-june-case-shiller-index-finds-as-americans-face-a-growing-affordability-crunch-2020-08-25", "published": 1598349020.0, "headline": "Home prices continued to rise in June, Case-Shiller index finds â\u0080\u0094 as Americans face a growing affordability crunch", "body": "The numbers: Home-price appreciation continued at a steady clip in June as many states began reopening businesses from shutdowns related to the coronavirus pandemic, according to a major price barometer released Tuesday. Recent data suggests price appreciation should gain steam in the latter half of the year. The S&P CoreLogic Case-Shiller 20-city price index posted a 3.5% year-over-year gain in June, down from 3.6% the previous month. On a monthly basis, the index increased 0.2% between May and June. What happened: The separate national index released with the report noted a 4.3% increase in home prices across the country over the past year, unchanged from the rate of price growth in May. Phoenix continued to lead all other markets nationwide with a 9% annual price gain in May, followed by Seattle with a 6.5% increase and Tampa, Fla., with a 5.9% uptick. â\u0080\u009cAs has been the case for the last several months, prices were particularly strong in the Southeast and West, and comparatively weak in the Midwest and (especially) Northeast,â\u0080\u009d Craig Lazzara, managing director and global head of index investment strategy at S&P Dow Jones Indices, wrote in the report. Overall, the pace of price growth increased in five of the 19 cities Case-Shiller analyzed â\u0080\u0094 the 20-city list again didnâ\u0080\u0099t include Detroit this month because transaction records for Wayne County, Mich. were unavailable, the report noted. The big picture: Since June, home price growth has only accelerated as buyersâ\u0080\u0099 fervor has been met with a historically-low supply of homes. Median home list prices rose 10.1% year-over-year for the week ending Aug. 15, according to a recent report from Realtor.com, marking the fastest growth in listing prices since January 2018. Itâ\u0080\u0099s a significant turnaround from the start of the pandemic, when listing price appreciation slowed to the lowest level since at least 2013, according to Realtor.comâ\u0080\u0099s calculations. Record-low mortgage rates are boosting not only demand among buyers, but home prices as well, because, on the surface, they expand how much home buyers can afford. But a recent report from UBS Financial Services questioned how affordable buying a home really is right now. The report looked at the affordability index put out by the National Association of Realtors. UBS recalculated the index to account for lower down payments (rather than a 20% down payment) and additional costs such as taxes and insurance. â\u0080\u009cThe vast majority of home buyers buy on monthly payment as opposed to price,â\u0080\u009d Jonathan Woloshin, a real estate and lodging analyst at UBS, wrote in the report. â\u0080\u009cHowever, our concern is that many are only considering the principal and interest component of their monthly payment as opposed to the â\u0080\u0098fully loadedâ\u0080\u0099 monthly payment associated with ownership.â\u0080\u009d When the full cost of owning a home is added up, it is a much less affordable proposition. Meanwhile, apartment rents have flattened or declined across much of the country as home prices have continued to rise. Woloshinâ\u0080\u0099s calculations found that it is cheaper to own than to rent in one-third of markets nationwide. But that could change. â\u0080\u009cIf rents continue to flatline or decline and home prices continue their upward trajectory of the past several months, renting is likely to become more attractive for a greater number of markets,â\u0080\u009d he wrote. Ultimately, if many buyers are priced out, that could throw some cold water on the buying frenzy across the countryâ\u0080\u0099s housing market right now. What theyâ\u0080\u0099re saying: â\u0080\u009cRecently, Case Shiller price metrics have been weakest in Northeastern metros, but there are signs that the economies in these areas are recovering well from the coronavirus. As these economies bounce back, so do their housing markets,â\u0080\u009d said Danielle Hale, chief economist at Realtor.com."}]}