{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-rise-as-china-fuels-global-stock-market-rally-2020-07-06", "published": 1594051700.0, "headline": "Treasury yields rise as China fuels global stock-market rally", "body": "U.S. Treasury yields rose Monday as bullish Chinese sentiment spilled over into global equity markets, sapping appetite for safe-haven assets.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 1.3 basis points to 0.683%, while the two-year note rate TMUBMUSD02Y, 0.156% edged 0.4 basis points higher to 0.159%. The 30-year bond yield TMUBMUSD30Y, 1.576% picked up 1.1 basis points to 1.442%. Bond prices move in the opposite direction of yields.What’s driving Treasurys? Chinese equities gained sharply after the country’s state media ran editorials and articles encouraging investors to buy stocks to support domestic markets. The CSI 300 index 000300, +2.04%, China’s benchmark equity gauge composed of stocks listed in Shanghai and Shenzhen’s exchanges, gained 5.7%, driving it up 13.8% year-to-date. U.S. and European stocks joined in the bullish trading, with the S&P 500 SPX, +0.87% and Dow Jones Industrial Average DJIA, +0.56% logging gains on Monday. Still, investors are still contending with the climbing tally of new COVID-19 cases in the U.S., concentrated in a few hot-spot states including Arizona and Florida. The worry is fears of the virus could hamper consumer and business spending in the next few months, after business activity rebounded sharply in the second quarter of this year due to aggressive efforts to reopen the economy. In U.S. economic data, the Institute of Supply Management reported its index of service-sector companies jumped to 57.1 in June from 45.4 in May, marking the single-biggest increase since the survey was created in 1997. MarketWatch-polled economists expected to see a reading of 51. Any number above 50 represents an expansion in economic activity.What did market participants say? “The market is trading as if the more cases we get, the more liquidity that will be provided by central banks,” said Gregory Faranello, head of U.S. rates at AmeriVet Securities, in an interview. “Where we are seeing a lot of action is in the inflation markets. The Fed seems inclined to gear forward guidance to inflation, and it wants to reflate the economy. When you look at all that collectively together, it does lend itself to inflation expectations moving up,” said Faranello."}]}