{"article": [{"url": "https://www.marketwatch.com/story/asian-markets-mixed-as-growth-data-offsets-fears-2020-08-03", "published": 1596414140.0, "headline": "Asian markets mixed as growth data offsets fears", "body": "Asian shares were mixed on Monday as investors eyeballed surging coronavirus cases in the region. U.S. Secretary of State Mike Pompeo’s weekend comments that President Donald Trump plans to take action on a what he sees as a broad array of national security risks presented by software connected to the Chinese Communist Party adding to market jitters. Pompeo’s remarks followed reports that Microsoft MSFT, +2.48% is in advanced talks to buy the U.S. operations of TikTok, which is owned by the Chinese company ByteDance and is seen as a source of national security and censorship concerns by the Trump administration. Japan’s Nikkei 225 NIK, -0.11% gained 2% while Hong Kong’s Hang Seng index HSI, -0.30% slid 1%. The Shanghai Composite SHCOMP, +1.67% rose 1% while the smaller-cap Shenzhen Composite 399106, +3.09% surged 1.8%. South Korea’s Kospi 180721, +0.21% was about flat, while benchmark indexes in Taiwan Y9999, +1.10% , Singapore STI, -0.39% and Indonesia JAKIDX, +0.28% sank. Australia’s S&P/ASX 200 XJO, +0.00% inched up 0.1%. “Between the increased growth concerns and the big tech surprises from Wall Street last week, Asia markets are set for mixed movements into Monday morning,” said Jingyi Pan, market strategist at IG in Singapore, referring to the U.S. rally that closed last week’s trading. Investors were also watching the Caixin manufacturing Purchasing Manager’s Index, a private survey which showed China’s manufacturing activity grew in July. On Friday, Wall Street closed outs its fourth straight winning month, riding on Big Tech shares continuing to steamroll through the pandemic. The S&P 500 SPX, +0.87% rose 24.90 points, or 0.8%, to 3,271.12 following blowout profit reports from Apple AAPL, +1.74% and several other tech titans. The Dow Jones Industrial Average DJIA, +0.56% was down as many as 300 points before finishing the day up 114.67, or 0.4%, at 26,428.32. The Nasdaq composite COMP, +1.39% jumped 157.64, or 1.5%, to 10,745.27 on the strength for tech stocks, which also accelerated in the last hour of trading. Despite the gains, caution was apparent across markets as the coronavirus pandemic clouds the global economic outlook. The U.S. economy cratered to its worst quarterly performance on record during the spring, and worries are high that continuing waves of coronavirus infections may halt what had been a budding recovery. Over the weekend, the Philippines reported its confirmed caseload had surpassed 100,000, and authorities ordered a renewed lockdown. The premier of Australia’s Victoria state, Daniel Andrews, said a “state of disaster” had been imposed in the Australian state among sweeping new coronavirus-related restrictions to be imposed across Melbourne and the region from Sunday night. That included an 8 p.m. to 5 a.m. curfew beginning Sunday night. Andrews said the state of disaster proclamation gave police greater power. Japan’s second revised real gross domestic product data for January-March, released Monday, showed the world’s third largest economy shrank at an annual rate of 2.2%. The annual pace gives what the rate would have been when the pace for the quarter is continued for a year. The contraction for the quarter was minus-0.6%. Confirmed coronavirus cases have been surging recently across Japan, especially in urban areas like Tokyo and Fukuoka, raising worries people weren’t staying home or social distancing enough. Critics say the government has been sending out conflicting messages, encouraging people to travel and spend with a “GoTo” campaign offering discounts at hotels and resorts while also saying they should avoid unnecessary risks. Benchmark U.S. crude US:CLU20 oil lost 30 cents to $40.27 a barrel in electronic trading on the New York Mercantile Exchange. It rose 35 cents to settle at $40.27 a barrel on Friday. Brent crude UK:BRNU20 fell 25 cents to $43.27 a barrel. The U.S. dollar USDJPY, -0.38% fell to 105.84 Japanese yen from 105.90 yen on Friday."}]}