{"article": [{"url": "https://www.marketwatch.com/story/teachers-face-an-agonizing-life-or-death-decision-many-are-retiring-early-or-simply-leaving-the-job-2020-09-08", "published": 1599559700.0, "headline": "Teachers face an agonizing life-or-death decision; many are retiring early or simply leaving the job", "body": "This article is reprinted by permission from NextAvenue.org. It is part of The Coronavirus Outbreak: What You Need To Know Special Report. Wednesday was a big day in our house. My husband is a 63-year-old, African-American sixth-grade teacher headed back to the classroom in Michigan for in-person instruction. But, since it’s happening during the pandemic, I’m fearful. Many other older teachers and school staffers across America who have pre-existing conditions or are caregivers are concerned about contracting coronavirus at work, too. Their tough decisions about whether to return to school come at a time when there have been over 5 million diagnosed COVID-19 cases in the U.S. and a death rate that’s already nearing 200,000. According to the National Center for Education Statistics, nearly a third of teachers in the U.S. are 50 and older; about 18% are 55+. And according to the Kaiser Foundation, roughly 80% of COVID-19 deaths in the U.S. were of people 65 and older. COVID-19 has hit older African-Americans hardest in terms of hospitalizations and deaths.COVID-19 testing for NBA players, but not for teachers While the NBA is requiring regular coronavirus testing and quarantining of its basketball players and staffs, most school districts aren’t mandating COVID-19 testing for teachers, staff or students. Most schools with in-person learning are taking temperatures of teachers and students as they enter the buildings, but that doesn’t truly track COVID-19 in people who are asymptomatic and can spread the virus. See: Asymptomatic children who contract COVID-19 may ‘shed’ coronavirus for weeks Medical experts almost universally agree that children need to be back in school for instruction, development, socialization and to address food insecurity, but only when it can be done safely. School districts and parents are working together to decide if their children can return to the classroom safely, but few are having similar discussions about the safety of teachers and staff. Recently, the White House determined that teachers are critical infrastructure workers, which can exempt them from quarantine requirements should they be exposed to COVID-19. American Federation of Teachers President Randi Weingarten, whose group has endorsed Joe Biden for president, sees this more as a political move. She says: “Teachers are, and always have been, essential workers — but not essential enough, it seems, for the Trump administration to commit the resources necessary to keep them safe in the classroom.” More: Biden faults Trump over approach to school reopenings, pandemicThe decision older teachers are facing In some parts of the country, things have gotten contentious for teachers trying to decide what is right for them and their families. According to the Chicago Tribune, Elaine Sage, a 63-year-old St. Francis Xavier School teacher in Wilmette, Ill., was fired from her job at the Catholic high school when she didn’t return on the first day of classes. Sage asked to be allowed to teach remotely to students who opted out of in-person instruction. Her husband is a cancer survivor and she worried about the risks of bringing the virus home. Sage’s request was denied; the Archdiocese said it didn’t have a remote teaching position for her since so few students opted out of in-person classes. Many older teachers across the country are weighing their options, sometimes struggling to do so. When eligible, they’re taking early retirements or using new options for extended leaves that some local National Education Association (NEA)-affiliated unions have negotiated for their members.Leaving the job she loves Others, like Dora Williams, 60, who haven’t racked up enough years on the job to retire, are just walking away from jobs they love — with despair. “I have been teaching for 15 years, and I love the return to school, but not this year,” says Williams. She has asthma and her husband has several chronic illnesses. “My mother, who is in her 90s, lives with us and I can’t afford to bring anything home to [her or Williams’ husband] that could kill them,” Williams adds. According to a NEA survey, 28% of its members say the pandemic has made them more likely to retire early or leave teaching altogether. And at a time when the U.S. continues to struggle to diversify its teaching workforce, 43% of Black teachers say they’re now more likely to retire early. Education experts predict that the exodus of experienced teachers will cause a shortage crisis around the country, especially in underserved communities. The NEA estimates a potential loss of 1.89 million education jobs in the next three years due to the pandemic.What could help older teachers and school staffers What could make older educators and staffers more comfortable heading back to the classroom? Some analysts say that having a safe and effective vaccine would help, but this might not happen until 2021. Others think the key is a certainty that funds and safety policies will be in place, including proper protective equipment (PPE) and classroom cleanings for children, teachers and staff. According to an NPR poll, 78% of U.S. teachers are concerned about accessing sufficient PPE and cleaning materials for teaching in person. Read more: It seemed safe to reopen Israel’s schools, but then came COVID-19 outbreaks — what can we all learn from those mistakes? The Centers for Disease Control and Prevention has already warned that there will inevitably be new coronavirus cases of students, educators and staff, due to the opening of schools. In Georgia’s largest school district, 260 employees have already had to be quarantined and have since returned to work. Meantime, I’m still nervous. Andrea King Collier is a journalist and author based in Lansing, Mich. @andreacollier This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}