{"article": [{"url": "https://www.marketwatch.com/story/41-of-businesses-listed-on-yelp-have-closed-for-good-during-the-pandemic-2020-06-25", "published": 1595417900.0, "headline": "55% of businesses closed on Yelp have shut down for good during the coronavirus pandemic", "body": "American states have been reopening their economies in the wake of the coronavirus pandemic, but tens of thousands of businesses are still closed — many of them for good. As of July 10, 132,580 businesses listed on the Yelp YELP, -1.66% review site remain closed due to the coronavirus pandemic, according to its latest Economic Average report. The good news is, that’s a slight decrease from 140,000 closures last month, as phased reopenings in some places have allowed many businesses to operate again, even if in a limited capacity. But while temporary closures have dropped, the number of businesses that have permanently shuttered is rising. Of all the business closures since March 1, 55% (or 72,842 businesses) will never reopen again, which is up from the 41% that Yelp reported in its Local Economic Impact Report just last month. In other words, another 15,742 businesses listed on Yelp permanently closed between June 15 and July 10. “Overall, permanent closures have steadily increased since the peak of the pandemic with minor spikes in March, followed by May and June,” the report reads. Yelp Restaurants and retailers remain especially hard-hit. Restaurants listed on Yelp have suffered 26,160 total closures as of July 10, and 60% (15,770) have permanently closed — which is up 23% from June 15. And it’s been last call for more than four in 10 bars and nightlife spots (44%) listed on Yelp, that will also never reopen. Some 26,119 shopping and retail businesses are also still closed, of which roughly half (or 12,454) are permanent — which is up 29% from what Yelp reported last month. Beauty (4,897 permanent closures) and fitness (1,930 permanent closures) centers are also among the sectors struggling the most. It’s difficult for these establishments to incorporate the social distancing measures required to reopen in many places. “When you look at those two top categories [retail and restaurants], we’re potentially never going to see some of these businesses again,” Justin Norman, Yelp’s vice president of data science, recently told the Wall Street Journal. Yelp In May, the CEO of the OpenTable restaurant booking service warned that one in four eateries won’t be able to reopen following the coronavirus pandemic. Indeed, total reservations and walk-ins on OpenTable were down 95% on May 14 from that date the year before, and they were down 100% throughout the month of April compared to the same time last year. And the National Restaurant Association estimates that the total shortfall in restaurant and food service sales from March through May likely surprised $120 billion. Read more:1 in 4 restaurants won’t reopen after the coronavirus pandemic, OpenTable CEO warns Black-owned businesses have been more devastated by the pandemic than any other demographic group, according to the National Bureau of Economic Research. The number of Black small business owners plummeted from 1.1 million in February to 640,000 in April, or a 41% drop. Watch:41% of Black small businesses have closed since the pandemic But there’s one silver lining: Yelp reports that support for Black-owned businesses has skyrocketed on its site amid renewed activism for racial equality. In the months since George Floyd was killed while in Minneapolis police custody, there were more than 2.5 million Yelp searches for Black-owned businesses, compared to 35,000 during the same window last year — a 7,043% increase. Searches for Black-owned restaurants are up 2,508%. And Black-owned bookstores have seen a 1,437% year-over-year spike in interest, possibly driven by people looking to better educate themselves on anti-Black racism, police brutality and other social justice issues. Some other bright spots in the Yelp report include professional services such as lawyers and accountants, which have seen fewer closures (840 and 294, respectively.) Health services, education businesses and online services like web design are also closing at slower rates. It remains to be seen what economic recovery will look like, and which businesses will reopen and be able to remain open, as coronavirus cases continue to spike in southern and western states. Related: MarketWatch’s coronavirus recovery tracker — these 6 data points should tell us when the economy is returning to normal Los Angeles recorded the largest total number of closures with 11,342 business establishments shuttering on Yelp, but Las Vegas has had the highest number of closures relative to the number of businesses in the city at 861. These numbers have dipped slightly since last month, as more places have reopened, but they’re subject to shift as coronavirus cases continue to climb back up to April levels across the country. California is moving to shut down indoor operations at restaurants, bars, gyms and museums once again, for example. And New York, New Jersey and Connecticut, which managed to flatten their coronavirus curves, are now demanding that visitors from nearly two-thirds of the U.S. will now have to self-quarantine when entering their states. The U.S. coronavirus death toll surpassed 1,000 for the first time in weeks on Tuesday, when there were more than 65,000 new cases recorded across the country — raising the number of confirmed cases to more than 3.8 million. Read more of MarketWatch’s coronavirus coverage, including economic recovery, here. This article was originally published on June 25, and has been updated with the latest Yelp data."}]}