{"article": [{"url": "https://www.marketwatch.com/story/workers-should-be-able-to-invest-their-401-k-s-in-companies-that-wont-harm-the-climate-11595534901", "published": 1595924120.0, "headline": "Workers should be able to invest their 401(k)s in companies that won't harm the climate", "body": "Investors may want to steer clear of investing their 401(k) in companies that own risky assets such as coal-fired power plants. George Frey/Agence France-Presse/Getty Images Climate change. Exploitation of essential workers. Racism. In the face of an urgent need to tackle these societal challenges, the U.S. Department of Labor released a proposed rule on June 24 that undermines the ability of financial managers entrusted with investing the retirement savings of millions of Americans to consider environmental, social and governance (ESG) impacts on those investments. If implemented, the rule could mean that the company that manages your 401(k) savings wouldn't be able to offer you a socially responsible index fund, even if that is your personal preference. Sadly, in line with so many other Trump administration actions denying climate change and diminishing worker power, the DOL rule proposes to limit retirement plan managers' ability to assess companies' future prospects based in part on how they manage climate-related risks, relationships with their employees and communities, and leadership concerns such as executive pay and shareholder rights. Hurting workers Ignoring these issues limits the ability of a fund manager to assess the health of a firm over the medium and long term. A wrongheaded approach to risk management, this insidious rule ultimately will hurt workers whose retirement savings depend upon sound longer-term investments. Protecting retirees' financial interests is paramount, which is why employers that offer voluntary retirement plans must adhere to standards set by the Employee Retirement Income Security Act of 1974 (ERISA). Specifically, ERISA sets a fiduciary standard that requires persons or entities who manage a retirement plan \"to run the plan solely in the interest of participants and beneficiaries and for the exclusive purpose of providing benefits and paying plan expenses.\" But quite simply, the recently proposed DOL rule is confused about ESG. It asserts, incorrectly, that ESG investments are based on non-pecuniary factors, or factors other than financial returns. In reality, ESG factors absolutely can have serious financial ramifications, in particular related to risk management. For example, a manufacturer's facilities located in an area that is very likely to experience repeated climate-related flooding could be damaged or impaired. Companies that fail to provide fair pay through collective bargaining rights to their workers could end up plagued by quality issues, costly employee disputes, and reputational costs with customers. Integrating consideration of ESG factors into investment decisions is critical for all investors to do. It is even more important for retirement plan fiduciaries, who are invested for the long-term, usually in a manner where diversification means retirees cannot avoid broad systemic impacts-like climate change and its impacts on the financial system.Financially wise Indeed, the Trump administration's actions are in direct conflict with investors, who are voting with their feet. ESG investments have grown exponentially in recent years precisely because investors view them as more financially wise. A quarter of all professionally managed investments in the U.S. are tied to ESG factors. In part, this is because ESG factors are proving time and again to be leading indicators of risk. CalPERS, the country's largest pension fund, recently found that 20% of its $394-billion portfolio bears climate-related financial risk. This trend is not limited to public pensions or climate-conscious younger investors, either. The world's largest investment manager, BlackRock, announced it will avoid investments in companies with significant climate risk. Yet even with this greater desire to mitigate financial risks in retirement savings, DOL's interpretations of ERISA's fiduciary rules have made it difficult for ESG to be incorporated into 401(k) and other retirement plans, where less than 1% of assets currently are in sustainable funds. The DOL guidance is all the more confusing in that it implicitly prohibits apparently all ESG-focused funds from being default funds, where the employee does not make a selection. This is puzzling, however, as ESG funds have also proven to be safe, well-performing investment vehicles. Research from S&P Global Market Intelligence found that ESG funds are particularly reliable during times of economic downturns. Analyzing 17 ESG-focused funds, it found all but three of them outperformed the S&P 500 in 2020 through May 15. Looking at the long term, Morningstar found that most Europe-domiciled sustainable funds outperformed their average traditional peer over the course of 10 years. Mitigate risks These findings suggest that adding ESG investments to retirement savings funds, whether a defined-benefit plan or a defined-contribution plan like a 401(k), could mitigate financial risks and potentially improve longer-term returns. Given the solid performance of ESG funds, it may seem that ESG offerings could thrive despite the Trump administration's proposed rule. This may unfortunately not be the case. The rule's requirements to perform additional analysis and documentation build in an unnecessary cost to pursue ESG options and bring about compliance risks for fiduciaries. The troubling result will be to diminish the ability of employees to obtain the ESG funds they want, be it for their own views on risk management or because they believe in the broader value of holding companies accountable to ESG goals. The knock-on effect may be even more troubling. Driving investment away from more climate-friendly ESG portfolio holdings acts like a further subsidy for the dirty and, increasingly, failing fossil-fuel sector. By financing even more carbon emissions, retirement funds further increase the risk that the financial system itself will be exposed to a climate-related shock and ensuing financial crisis. Public comments accepted The Trump administration's shortsighted approach is costly-now and far into the future. But it doesn't have to be this way. The Department of Labor is accepting public comments on the proposed rule until July 30. Comments can be submitted here. Beyond preventing this rule from being completed, there is more to do to promote a greener, less risky economy. Instead of suppressing retiree access to responsible ESG funds, the federal government would better serve retirement savers by pushing companies to measure and publicly disclose a far wider range of ESG-related information, including carbon emissions financed by the financial system, in a manner that can be compared easily across firms by fiduciaries, investors, and retirement savers, alike. Doing so would help steer capital toward safer, low-carbon investments and protect both retirees and the planet. Alexandra Thornton is the senior director of tax policy for economic policy at the Center for American Progress, a Washington-based progressive think tank. Colin Medwick is an intern for economic policy at the center.Further reading 4 reasons why being a responsible ESG investor can help your 401(k) do better BlackRock's Fink Says U.S. Proposal to Limit ESG Investing Will Only Boost Interest Sustainable-investing flows have smashed records in 2020. What's going on?"}]}