{"article": [{"url": "https://www.marketwatch.com/story/oil-selloff-intensifies-after-trump-confirms-coronavirus-diagnosis-11601633152", "published": 1601651780.0, "headline": "Oil sells off after Trumpâ\u0080\u0099s coronavirus diagnosis, sending U.S. prices down 8% for the week", "body": "U.S. President Donald Trump said early on October 2, 2020 that he and First Lady Melania had tested positive for the coronavirus. jim watson/Agence France-Presse/Getty Images Oil prices were hit Friday by news that President Donald Trump said he contracted coronavirus, adding to the industryâ\u0080\u0099s concerns about rising cases of the disease worldwide which may dent demand for the commodity. The news that Trump and First Lady Melania Trump tested positive for Covid 19 â\u0080\u009ccreates a new round of market uncertainty and reinforcing fears of a second wave of the virus, which will harm the economy and projected energy demand,â\u0080\u009d said Phil Flynn, senior market analyst at The Price Futures Group, in a Friday note. â\u0080\u009cBroader implications of the diagnose for energy, not only for the short term but for the long-term, cannot be understated. â\u0080\u009c West Texas Intermediate crude for November delivery CLX20, -1.62% tumbled $1.67, or 4.3%, to settle at $37.05 a barrel on the New York Mercantile Exchange, the lowest finish since Sept. 8, according to Dow Jones Market Data. December Brent crude futures BRNZ20, -0.07% slid 4.1%, or $1.66, to $39.27 a barrel on ICE Futures Europe, settling at the lowest front-month contract price since June 12. Based on the front-month contracts, WTI futures lost about 8% and Brent futures declined by 7.4% for the week. â\u0080\u009cTonight,Â @FLOTUSÂ and I tested positive for COVID-19. We will begin our quarantine and recovery process immediately,â\u0080\u009d Trump said onÂ Twitter. â\u0080\u009cThe news throws uncertainty into the immediate future of both the incumbentâ\u0080\u0099s election campaign and potentially the U.S. leadership,â\u0080\u009d said analysts at the JBC Energy Research Centre, in a note to clients. Oil prices had logged their lowest settlement since mid-September on Thursday, driven by fears that COVID-19 cases will drive demand lower, even as U.S. supply tightens up. TheÂ Energy Information Administration on WednesdayÂ reported a surprise fall of 2 million barrels in U.S. crude supply, the third straight weekly decline. Still, data from Baker Hughes BKR, -1.34% Friday showed the number of active U.S. rigs drilling for oil rose by 6 to 189 this week, marking as second straight weekly rise and implying an upcoming rise in output. The crude market was already breaking down â\u0080\u009cbefore the announcement of the presidentâ\u0080\u0099s COVID diagnosis,â\u0080\u009d said Marshall Steeves, energy markets analyst at IHS Markit. â\u0080\u009cFears around demand growth through the 4thÂ quarter have undermined market sentiment.â\u0080\u009d Investors in oil markets have been keeping close watch on the diseaseâ\u0080\u0099s expansion, which has worsened in parts of Europe, because it has a direct effect on the commodity if economies begin to slow down. â\u0080\u009cThe main reason for the latest surge in demand is that people are using their own vehicles rather than public transport for fear of catching coronavirus, which puts a number of question marks over the recovery,â\u0080\u009d said Eugen Weinberg, head of commodity research at Commerzbank, in a note to clients. Among other petroleum products, November gasoline RBX20, -2.11% Â lost 2.5% to $1.1235 a gallon, with prices ending 5.6% lower for the week, and November heating oil HOX20, -0.05% Â declined by 3.6% to $1.085 a gallon, for a weekly loss of 4.3%. November natural gas NGX20, +5.17% settled at $2.438 per million British thermal units, down 3.5% on Friday. For the week, prices fell by more than 13%. Read: Natural gas, lumber among best performers are commodities post second straight quarterly gain Also see: Silver, copper provide hints for the global economic outlook"}]}