{"article": [{"url": "https://www.marketwatch.com/story/my-late-husband-did-not-see-his-son-in-30-years-should-i-mail-his-son-photos-and-other-memorabilia-and-risk-him-making-a-claim-on-his-estate-2020-09-14", "published": 1601010620.0, "headline": "My late husband did not see his son in 30 years. Should I mail his son photos and other memorabilia - and risk him making a claim on his estate?", "body": "Dear Moneyist, My late husband had not seen his son in over 30 years. He and his son's mother decided on her receiving a larger share of assets in lieu of child support. He did see his son a few times a year for the next several years, but contact stopped during the teen years when his son no longer wanted to come. They lived in different states. The son is approximately the age of my own children, who are in their early forties. There was no probate after my husband's death because he had no separate assets. The house and car were titled in my name because I had purchased them prior to remarrying. All of our bank accounts were joint although we treated them as separate accounts. He had no retirement funds other than Social Security whereas I was still working. When I signed my will shortly after my husband's death, the lawyer told me that probate was unnecessary since there was nothing to probate. I put together a box of a few special items that belonged to my husband - his medals from his time in the service, pictures of him over the years, including some with the son, his watches, and so on - thinking that the son might want them some day. I'm sure the son has no idea that my husband relocated and remarried so it isn't particularly likely that he will knock on the door one day. Friends of my husband tried to initiate contact once during a health crisis before I met him, and the mother refused. I hate the idea that my own kids will simply trash these things one day because they will have no idea what to do with them after I die. I found the son's mother's address online. She is in her mid-70s and never remarried. Would I be making a mistake if I mailed the box to her? I don't want the son to demand \"his share\" when there is nothing else for him. Having to hire a lawyer to defend that position, though, can be expensive. So should I leave well enough alone? Want to do the right thing. Dear Right Thing, Your husband's son has a right to know that his father passed away, regardless of inheritance or photographs or other family memorabilia, even if he did not see his father in over 30 years. Teenagers can be angry, confused, and/or simply want to do their own thing and find their own identity. He may have also been influenced by his mother, given that she refused previous attempts to make contact, so sending a box of mementos to her may not necessarily reach his son. The Moneyist: I filed a joint tax return with my estranged wife because she is a gambler and her finances are a mess. But I got NO stimulus check - what can I do? See if you can find his son on Facebook, LinkedIn MSFT, +2.48%, Twitter TWTR, -0.23%  or by other means. Failing that, reach out to his mother and tell her that her son's father died, and that you have some things that you would like to send directly to her son from the time they spent together when he was a child. Explain that whatever has happened in the intervening years, it's your belief that your late husband loved his son and you are available should he want to know more about his father. The Moneyist: I didn't get my stimulus check because I owe back child support. It's not fair. My stepchildren rely on me - what can I do? Ideally, it would be best to contact him directly and leave his mother out of the process entirely. You could start with a couple of photographs and a letter, if you manage to get his address. Or you could send copies of the photographs and address them to his mother's address, with the same letter enclosed. If he asks about inheritance, you can explain that to him and offer to provide full transparency through a lawyer, and/or consider a monetary gift. You are connected through your husband, and sometimes death provides a bridge for those who are left behind. Who knows? One day you might even end up as friends. You can email The Moneyist with any financial and ethical questions related to coronavirus at qfottrell@marketwatch.com. Want to read more?Follow Quentin Fottrell on Twitterand read more of his columns here. Don't miss:'We will not have a vaccine by next winter.' Like the 1918 Spanish flu, CDC says second wave of coronavirus could be worse. So what happens now? Hello there, MarketWatchers. Check out the Moneyist private Facebook FB, +0.26%  group where we look for answers to life's thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}