{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-aim-for-first-back-to-back-gains-in-2-weeks-11601381383", "published": 1601389580.0, "headline": "Gold prices climb back above $1,900 for highest finish in a week", "body": "Gold prices reclaimed the psychologically important $1,900 an ounce mark on Tuesday to book their highest settlement in a week, as a pullback in the U.S. dollar for a second session provided room for bullion values to climb. “The dollar has emerged as the single biggest influence on gold recently…and the fact that the greenback fell from two month highs [Monday] offered gold a tailwind,” analysts at Sevens Report Research wrote in a Tuesday newsletter. “Gold prices have formed a near-term support zone between $1,850 and $1,860 that should allow futures to recover the $1,900 mark in the sessions ahead. But the risk of a continued pullback toward $1,800 still exists, especially if there is another spike higher in the dollar index,” they said. On Tuesday, December gold GCZ20, +2.17% GOLD, +2.86% rose $20.90, or 1.1%, to settle at $1,903.20 an ounce, after a 0.9% rise on Monday. The metal hasn’t posted consecutive daily gains since a three-day stretch ended Sept. 16, FactSet data show. Prices based on the most-active contract settled at their highest since Sept. 22. The dollar on Tuesday was down 0.4%, as measured by the ICE U.S. Dollar Index DXY, -0.58%, FactSet data show. The index is down 0.8% so far this week, after posting a 1.9% weekly rise on Friday. Last week, gold and silver prices came under pressure due to the mini rally in the greenback, which can make assets priced in the currency relatively more expensive to overseas buyers. Gold enthusiasts and some commodity experts say that gold remains a strong investment in the long term, given persistent concerns about the global economy and monetary policies implemented to combat the COVID-19 pandemic. Analysts say that demand from exchange-traded funds, which must buy gold to mimic the performance of the commodity, also have been a key driver of price gains. “From a fundamental point of view, despite the recent slowdown of the price, ETF demand remains stellar, while central banks are still printing money in order to mitigate impact of the economic crisis generated by COVID, a scenario that is likely to last for at least all of 2021,” wrote Carlo Alberto De Casa, chief analyst at ActivTrades, in a daily note. The gold-focused ETF, the SPDR Gold Trust ETF GLD, +1.81% SLV, +5.54%, is up by more than 1.9% so far this week and nearly 25% so far this year, while the iShares Silver Trust SLV, +5.54% has advanced 36% in the year to date. Meanwhile, December silver SIZ20, +5.96% SI00, +5.96% picked up 84 cents, or 3.6%, at $24.445 an ounce Tuesday, following a 2.2% advance for gold’s sister metal in the prior session. December copper HGZ20, +1.38% settled unchanged at $2.99 a pound. October platinum PLV20, +3.99% fell by 0.6% to $887.50 an ounce, while December palladium PAZ20, +2.31% tacked on 2.5% to $2,329.30 an ounce."}]}