{"article": [{"url": "https://www.marketwatch.com/story/when-you-want-to-retire-but-your-partner-doesnt-money-isnt-necessarily-the-real-issue-2020-09-14", "published": 1600088420.0, "headline": "When you want to retire but your partner doesnâ\u0080\u0099t, money isnâ\u0080\u0099t necessarily the real issue", "body": "A good marriage requires good communication. But what if spouses open up to each other about their future only to discover that they disagree over their respective timing to retire?Anxiety sets in if only one half of a couple is ready to retire. Fears can spike if their clashing assumptions â\u0080\u0094 and different needs â\u0080\u0094 expose a deep rift. Skilled financial advisers know how to educate couples without overstepping any boundaries. It takes diplomacy and keen listening skills to offer wise counsel while not getting ensnared in marital squabbles. â\u0080\u009cThey are delicate and complex issues, sometimes bringing up very difficult feelings on both sides,â\u0080\u0099 says James Lange, an adviser and attorney in Pittsburgh, Pa. Crafty spouses might even enlist the adviser to convince their mate to retire. For example, a workaholic refuses to call it quits, despite a massive nest egg. â\u0080\u009cSometimes,â\u0080\u009d Lange adds, â\u0080\u009ccouples could use a therapist in addition to a financial adviser on these matters.â\u0080\u009d Author of â\u0080\u009cThe IRA and Retirement Plan Ownerâ\u0080\u0099s Guide to Beating the New Death Tax,â\u0080\u009d Lange works with many college professors who love their job and want to keep it well past age 65. â\u0080\u009cTheir spouses often prefer they retire so they could spend more time together, travel and spend time with the kids and grandchildren,â\u0080\u009d Lange says. â\u0080\u009cIâ\u0080\u0099m sometimes brought in to prove the spouseâ\u0080\u0099s contention that the professor could afford to retire and be fine. Even then, most of them will continue to work as long as they feel productive and appreciated.â\u0080\u009d Some advisers redirect a coupleâ\u0080\u0099s disagreements over retiring into a friendly negotiation. After encouraging both parties to share their ideal scenario for the future, planners try to bridge gaps and encourage compromise. â\u0080\u009cTypically, we donâ\u0080\u0099t like to get in the middle of these conflicts,â\u0080\u009d says Luke Lloyd, a Cleveland-based adviser. â\u0080\u009cBut if a husband and wife have different goals in retirement, Iâ\u0080\u0099ll say to them they have to give and take and meet in the middle.â\u0080\u009d Addressing a coupleâ\u0080\u0099s fears of transitioning to retirement, especially if theyâ\u0080\u0099re not on the same page about timing, often involves letting them vent freely. Once they feel heard, they may be more receptive to reappraising their concerns. Danny Michael, a certified financial planner in San Diego, Calif., likes to give each spouse a chance to open up. They speak as long as they want, without interruption, in an attempt to articulate their values, goals and perceived obstacles. â\u0080\u009cThrough this process, they learn from each other,â\u0080\u009d he says. â\u0080\u009cThey often say, â\u0080\u0098I never knew about those things.â\u0080\u0099 A lot of times, they werenâ\u0080\u0099t listening to each otherâ\u0080\u009d until this meeting. Dueling priorities can fuel a coupleâ\u0080\u0099s differing views on their readiness to retire. If one of them intends to spend lavishly while the other favors austerity, an adviser can help them align their expectations and preferences. When only one spouse buys into their proposed timetable for each of them to retire, such disagreements can mask an underlying fear. Examples include the loss of professional identity that comes with ending a prestigious career or the perceived risk of money running out earlier than anticipated. â\u0080\u009cYou have to get to the crux of the fear,â\u0080\u009d says Marcel Winger, a certified financial planner in San Antonio, Tex. â\u0080\u009cIâ\u0080\u0099ll say to clients, â\u0080\u0098Iâ\u0080\u0099m a financial planner for you as a couple and for you as individuals. So I want to hear each of your deeply rooted concerns about retirement.â\u0080\u0099 From there, itâ\u0080\u0099s promoting an environment of self-realization where they can come together.â\u0080\u009d More:Worried about being bored in retirement? Your financial adviser has a plan Plus: How retirees should invest in a time of record-low interest rates"}]}