{"article": [{"url": "https://www.marketwatch.com/story/trump-says-bidens-not-a-savior-of-americas-soul-but-rather-the-destroyer-of-americas-jobs-2020-08-28", "published": 1598574140.0, "headline": "Trump says Bidenâ\u0080\u0099s â\u0080\u0098not a savior of Americaâ\u0080\u0099s soul,â\u0080\u0099 but rather the â\u0080\u0098destroyer of Americaâ\u0080\u0099s jobsâ\u0080\u0099", "body": "President Donald Trump on Thursday night made an effort to turn his Democratic challengerâ\u0080\u0099s campaign rallying cries against him, as he accepted the Republican Partyâ\u0080\u0099s nomination and delivered the last speech at the GOPâ\u0080\u0099s four-day convention. â\u0080\u009cIn America, we donâ\u0080\u0099t turn to government to restore our souls. We put our faith in Almighty God,â\u0080\u009d Trump said, in a reference to Bidenâ\u0080\u0099s pledge to â\u0080\u009crestore the soul of America.â\u0080\u009d â\u0080\u009cJoe Biden is not a savior of Americaâ\u0080\u0099s soul. He is the destroyer of Americaâ\u0080\u0099s jobs, and if given the chance, he will be the destroyer of American greatness.â\u0080\u009d Trump said his opponentâ\u0080\u0099s record is â\u0080\u009ca shameful roll call of the most catastrophic betrayals and blunders in our lifetime,â\u0080\u009d highlighting Bidenâ\u0080\u0099s vote for â\u0080\u009cthe Nafta disaster, the single worst trade deal ever enacted,â\u0080\u009d as well as his support of â\u0080\u009cChinaâ\u0080\u0099s entry into the World Trade Organization, one of the greatest economic disasters of all time.â\u0080\u009d The president said China â\u0080\u009csupports Joe Biden and desperately wants him to win. I can tell you that upon very good information.â\u0080\u009d â\u0080\u009cHe repeatedly supported mass amnesty for illegal immigrants. He voted for the Iraq war,â\u0080\u009d Trump also said. The address, delivered from the White House grounds, capped the mostly virtual Republican National Convention. It followed testimonials earlier in the week from a range of speakers, including Donald Trump Jr. and Nikki Haley on Monday, first lady Melania Trump and Secretary of State Mike Pompeo on Tuesday, and Vice President Mike Pence on Wednesday. Related:Trumpâ\u0080\u0099s convention breaks norms â\u0080\u0094 and possibly the Hatch Act Ahead of the presidentâ\u0080\u0099s remarks, Bidenâ\u0080\u0099s running mate, Sen. Kamala Harris, attacked Trumpâ\u0080\u0099s handling of the coronavirus crisis, saying he was â\u0080\u009cunwilling and unable to deal with this crisisâ\u0080\u009d in part because he was â\u0080\u009cfixated on the stock market SPX, +0.87% Â DJIA, +0.56% Â over fixing the problem.â\u0080\u009d Trump defended his administrationâ\u0080\u0099s response to the pandemic, saying it launched the largest national mobilization since World War II, and the U.S. has among the lowest case fatality rates of any major country. Trump also seized on a line in Bidenâ\u0080\u0099s speech a week ago. In his address at the Democratic convention, the former vice president cast himself as â\u0080\u009can ally of the light, not the darkness,â\u0080\u009d as he pledged to rebuild the battered U.S. economy and tackle the coronavirus pandemic. â\u0080\u009cJoe Biden may claim he is an â\u0080\u0098ally of the light,â\u0080\u0099 but when it comes to his agenda, Biden wants to keep you completely in the dark,â\u0080\u009d Trump said. He accused the former vice president of planning a $4 trillion tax hike, which â\u0080\u009cwill totally collapse a rapidly improving economy and once again record stock markets that we have right now will also collapse â\u0080\u0094 that means your 401(k)s.â\u0080\u009d â\u0080\u009cBiden has promised to abolish the production of American oil, coal, shale and natural gas â\u0080\u0094 laying waste to the economies of Pennsylvania, Ohio, Texas, North Dakota, Oklahoma, Colorado and New Mexico,â\u0080\u009d Trump said. â\u0080\u009cThese same policies led to crippling power outages in California just last week.â\u0080\u009d (Bidenâ\u0080\u0099s campaign has said he does not endorse completely banning fossil fuels, and the cause of Californiaâ\u0080\u0099s blackouts is still being investigated.) â\u0080\u009cHow can Joe Biden claim to be an â\u0080\u0098ally of the lightâ\u0080\u0099 when his own party canâ\u0080\u0099t even keep the lights on?â\u0080\u009d he asked. The president also said Democrats will â\u0080\u009cmake every city look like Democrat-run Portland, Oregon. No one will be safe in Bidenâ\u0080\u0099s America.â\u0080\u009d â\u0080\u009cIf the left gains power, they will demolish the suburbs, confiscate your guns, and appoint justices who will wipe away your Second Amendment and other constitutional freedoms,â\u0080\u009d he said. Opinion:Trump, running for re-election, is faking it on the economy and the pandemic Counterpoint:Donâ\u0080\u0099t count Trump out â\u0080\u0094 hereâ\u0080\u0099s how he can still win in November In RealClearPolitics averages of polls as of Thursday, Biden is leading Trump by 7.1 percentage points in nationwide surveys and by 3.7 points in key swing states that are likely to decide the November election."}]}