{"article": [{"url": "https://www.marketwatch.com/story/retail-sales-bounce-back-in-the-uk-but-clothing-is-hardest-hit-as-changing-rooms-remain-shut-2020-08-21", "published": 1598253680.0, "headline": "Retail sales in the U.K. are back to their pre-coronavirus levels. Here's why this may not last", "body": "Consumers flocked to reopened shops and kept spending online in July, the first month of full activity for retail businesses since a general lockdown was decreed in March to prevent the spread of coronavirus in the U.K. Retail sales jumped 3.6% in volume over June, and were 1.4% above their July, 2019 level, the Office for National Statistics said on Friday. - The overall level hides persistently wide differences between sectors. Household goods were popular because of pent-up demand after months of forced savings, while supermarkets and food stores kept benefiting from the reduced activity of restaurants and pubs. - Many retailers have announced plans for thousands of job cuts - Britain's biggest clothing retailer Marks & Spencer MKS, +3.54%, for example, will shed 7,000 jobs in the next few weeks. And clothing and footwear sales are still down 25% over their level last year. - According to the latest purchasing managers index, the U.K. economy is rebounding strongly in August, both in the manufacturing and services sectors. This contrasts with weaker similar data published on Friday for the rest of Europe. - The ONS also reported on Friday that the U.K.'s public debt now stands at more than £2,000 billion, or a little over 100% of the country's gross domestic product, due to the increased government spending and reduced tax receipts caused by the economy's lockdown. This compares with the eurozone's 102% public debt-to-GDP ratio predicted by the European Central Bank for this year. The outlook: After a bright summer, U.K. retail could be hit further in the fall, as government programs to support jobs are being phased out, and unemployment rises to levels commensurate with the continuing recession. Unless the government agrees on more fiscal stimulus, and the Bank of England loosens its monetary policy further. What is still unclear is how spending patterns have changed during the three months of restrictions, and whether this is to last. In that case, the surge of online spending could go on, as bricks-and-mortar shopping continues to decline. Read: Third of adults unlikely to use Chancellor's restaurant incentive, survey finds"}]}