{"article": [{"url": "https://www.marketwatch.com/story/the-irs-sent-more-than-1-billion-in-stimulus-checks-to-dead-people-2020-06-25", "published": 1593163040.0, "headline": "The IRS sent more than $1 billion in stimulus checks to dead people", "body": "The Internal Revenue Service sent out 1.1 million stimulus checks to dead people totaling $1.4 billion, according to a new report from a government watchdog agency. As the IRS hurried to process direct payments to Americans reeling from the coronavirus outbreak, the Government Accountability Office said the tax agency didn’t use Social Security death records to filter out payments to the deceased. “ The $1.4 billion paid to dead people accounts for 0.5% of the total value of stimulus checks. ” The watchdog agency noted Thursday it recommended a way for the IRS to avoid sending stimulus checks to dead people back in 2013, after some Great Recession-era stimulus checks went to the dead. At that time, more than 71,500 dead Social Security recipients were paid a total $18 million of the $13 billion allotted for all Social Security recipients in the Obama-era stimulus package, according to the Social Security Administration’s Inspector General. The IRS used those 2013 recommendations to create a process where it used death records to update taxpayer accounts. But it didn’t use the controls when it came to stimulus checks and “substantially increased the risk of potentially making improper payments to decedents,” according to the Government Accountability Office (GAO) report. As of May 31, the IRS has distributed 160.4 million stimulus checks, dubbed “economic impact payments” either as direct deposits, paper checks or debit card. The payments totaled $269.3 billion. The $1.4 billion paid to dead people accounts for 0.5% of that total. The IRS started distributing the checks in early April and stories started cropping up about checks to dead people — including one from a friend of a Kentucky congressman. Don’t miss: I received a $1,200 stimulus check addressed to my late mother. What should I do now? The stimulus checks are $1,200 for people with adjusted gross incomes below $75,000 and $2,400 for married couples making less than $150,000. The IRS looks at 2019 income returns to determine eligibility, and if it doesn’t have that, it looks at the 2018 return. If a person had a 2018 return, but died, the IRS — without reliance on death records — wouldn’t have a way to know if the recipient was alive. “ Last month, Treasury Secretary Steven Mnuchin said the relatives of dead stimulus checks recipients needed to return the money. ” Last month, Treasury Secretary Steven Mnuchin said the relatives of dead stimulus checks recipients needed to return the money. The IRS outlined a process on how to remit payment. The instructions, however, don’t discuss consequences if people do not send the money back. Apart from the instructions on the IRS website, the new report said the tax collector isn’t planning extra steps to notify ineligible recipients and their families about the return process. The IRS should rethink that decision, the GAO report said. The IRS and the Treasury Department didn’t immediately respond to a request comment on GAO report or consequences for people who do not return checks. The IRS and Treasury Department didn’t use death records before sending out the first three batches of payments. That accounted for 72% of all the stimulus check money disbursed by May 31. The IRS has full access to the Social Security Administration’s death records, according to the GAO but the Treasury Department its Bureau of Fiscal Service, which actually distributed the money, do not. The Treasury Department should have the same access to the records, the GAO recommended."}]}