{"article": [{"url": "https://www.marketwatch.com/story/10-year-treasury-yield-flirts-with-key-060-level-as-investors-eye-eu-bailout-discussions-2020-07-17", "published": 1595003060.0, "headline": "10-year Treasury yield bounces off 0.60% level as inflation expectations heat up", "body": "U.S. Treasury yields edged up Friday as investors poured into Treasury inflation-protected securities, reflecting expectations for rising consumer prices while weighing on trading in government bonds. What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 1.7 basis point to 0.628%, after coming off the key 0.60% floor for recent trading in the bond-market. The 2-year note TMUBMUSD02Y, 0.156% stood at 0.145%, around its lowest since May, while the 30-year bond yield TMUBMUSD30Y, 1.576% rose 2.7 basis points to 1.329%. All three maturities were virtually unchanged from where they finished at the end of last Friday. What’s driving Treasurys? The bond market came under slight pressure amid growing worries about the risk of inflation, even though the economy’s recovery faces an uphill slog in face of the coronavirus pandemic. The 10-year breakeven rate, or what traders of Treasury inflation-protected securities anticipate inflation will average over the next decade, jumped 10 basis points to 1.51% on Friday. Investors cited comments from senior Federal Reserve officials indicating their support for a monetary policy strategy that would see the Fed wait to raise policy intrest rates until inflation overshot the central bank’s 2% target for some time. Dallas Fed President Robert Kaplan was be open to such a policy, but said he would need a few more weeks assessing the coronavirus’ trajectory and the pace of the U.S. recovery. U.S. economic data also heightened inflation concerns. The University of Michigan’s consumer sentiment gauge for July fell to 73.2 from 78.1 last month, but five-year inflation expectations rose to 2.7% from 2.5%. In other data, housing starts for June were up 17% at an annualized pace of 1.186 million, MarketWatch-surveyed analysts had forecast a reading of 1.20 million. Building permits came in a pace of 1.24 million. Investors also assessed the prospect of additional government spending in Europe. German Chancellor Angela Merkel said there remained significant differences between European leaders over a fiscal bailout package and a budget for the European Union, amid hopes by market participants that the EU would employ more stimulus measures to support their coronavirus-battered economies. Reports said the Dutch Prime Minister Mark Rutte was demanding a vote to how the EU would distribute the bailout funds across the 27-member bloc, holding up progress towards a deal. European bond yields were largely unmoved. The 10-year German government bond rate TMBMKDE-10Y, -0.521% rose 2 basis points to negative 0.48%, while its Italian counterpart TMBMKIT-10Y, 0.722% was at 1.18%. See: European Union leaders say they are far apart on COVID-19 bailout dealWhat did market participants’ say? “Even though people don’t really think there’s a high risk of inflation, they want to buy protection against it,” said Zhiwei Ren, a portfolio manager at Penn Mutual Asset Management, in an interview. He noted the Fed’s moves to normalize inflation and expectations for additional stimulus measures as the coronavirus situation worsened in the U.S. was helping to drive inflows into Treasury inflation-protected securities."}]}