{"article": [{"url": "https://www.marketwatch.com/story/warren-buffett-is-an-idiot-says-investor-who-claims-daytrading-is-the-easiest-game-ive-ever-played-2020-06-09", "published": 1592035640.0, "headline": "Barstool Sports founder believes heâ\u0080\u0099s a better investor than Warren Buffett and has determined day trading is â\u0080\u0098the easiest gameâ\u0080\u0099 there is", "body": "Did we just witness â\u0080\u009can epic signal of a blow-off topâ\u0080\u009d ... ? Yes, says Gary Evans of the Global Macro Monitor blog, who pointed to the recent action on Barstool Sports founder Dave Portnoyâ\u0080\u0099s Twitter feed as the reason. On Monday, Portnoy slammed Berkshire Hathawayâ\u0080\u0099s BRK.A, +0.06% BRK.B, +0.24% Â Warren Buffett for unloading airline stocks as the coronavirus epidemic took its initial toll. He also went off on how he made almost $300,000 on the day but missed out on an even bigger number by getting out too soon. â\u0080\u009cIâ\u0080\u0099m just printing money,â\u0080\u009d Portnoy said. â\u0080\u009cWhy take profits when every airline goes up 20% every day. Losers take profits. Winners push the chips to the middle. ... I should be up a billion dollars.â\u0080\u009d Watch the clip: iframe.twitter-tweet { width: 100% !important; } Evans compared Portnoyâ\u0080\u0099s rant Monday to one of the most-quoted market-top signals in history. Back in the fall of 1929, Yale economist Irving Fisher famously said â\u0080\u009cStock prices have reached what looks like a permanently high plateau.â\u0080\u009d We all know what happened in October of that year. â\u0080\u009cFrame it,â\u0080\u009d Evans said of Portnoyâ\u0080\u0099s take. â\u0080\u009cThen run like hell.â\u0080\u009d After Portnoyâ\u0080\u0099s tweet spread across Finance Twitter TWTR, -0.23%, he doubled down on his Buffett bashing on Tuesday, calling him a â\u0080\u009cwashed upâ\u0080\u009d investor whoâ\u0080\u0099s no longer relevant. â\u0080\u009cIâ\u0080\u0099m not saying I had a better career. ... Heâ\u0080\u0099s one of the best ever to do it,â\u0080\u009d he said. â\u0080\u009cIâ\u0080\u0099m the new breed. Iâ\u0080\u0099m the new generation. Thereâ\u0080\u0099s nobody who can argue that Warren Buffett is better at the stock market than I am right now. Iâ\u0080\u0099m better than he is. Thatâ\u0080\u0099s a fact.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } Look out below? Meanwhile, the stock market is taking a breather. On Tuesday, the Dow Jones Industrial Averageâ\u0080\u0099s DJIA, +0.56% saw its six-day winning streak end at six. Itâ\u0080\u0099s down again early Wednesday. The S&P 500 SPX, +0.87% was also lower Wednesday while the tech-heavy Nasdaq COMP, +1.39% parted ways to post an early gain. Need to Know (May 28):Hedge-fund manager Bill Ackman says he dumped Berkshire Hathaway but held on to these winners"}]}