{"article": [{"url": "https://www.marketwatch.com/story/audit-likely-gave-congressional-staff-glimpse-of-trump-taxes-01602055434", "published": 1602041480.0, "headline": "Audit likely gave congressional staff glimpse of Trump taxes", "body": "US President Donald Trump speaks during a briefing at the White House September 27, 2020, in Washington, DC. brendan smialowski/Agence France-Presse/Getty Images WASHINGTON (AP) — It’s one of the most obscure functions of Congress, little known or understood even by most lawmakers. But it may have once put staffers in possession of one the most enduring mysteries of the Donald Trump era: his tax data, which a recent The New York Times revealed to the world. The Times report included a series of bombshell revelations about Trump’s finances, including that he paid only $750 in federal income taxes in 2016 and 2017 and that he carries $421 million in debts. Trump has long refused to release his tax returns, blaming an IRS audit. That’s where Congress comes in. The audit of Trump’s taxes, the Times reported, has been held up for more than four years by staffers for the Joint Committee on Taxation, which has 30 days to review individual refunds and tax credits over $2 million. When JCT staffers disagree with the IRS on a decision, the review is typically kept open until the matter is resolved. The upshot is that information on Trump’s taxes, which Democrats are now suing to see, has almost certainly passed through the JCT’s hands, putting it tantalizingly close to lawmakers. Key members of the tax-writing House Ways and Means Committee defended the JCT after the Times report and were emphatic that that the panel does not have copies of tax forms pertaining to Trump. “They are not sitting at JCT,” said House Ways and Means Committee Chairman Richard Neal, D-Mass. “I see no evidence that they’re sitting on those forms.” But lawmakers did not say whether the JCT has reviewed any tax refund involving the president. Neal and top House Republican tax expert Kevin Brady of Texas said the panel typically completes its reviews in a month or two, at most. “The vast majority of JCT refund reviews are processed quickly and very rarely does JCT express concerns with the IRS audit findings,” said Brady, who has previously chaired the panel. “Contrary to the Times’ reporting, I think the longest time JCT has ever had a case pending is one year. I think we should focus on the facts as much as possible.” Lawmakers on Joint Tax are provided summary information on the categories of cases handled and how long it takes to process them, but the information is not made public. Even acknowledging that Trump’s taxes were before the panel is verboten. “That gets too close to talking about potential tax return information, which is protected under the internal revenue code,” Joint Tax chief of staff Thomas Barthold said in declining to comment about the Times’ Trump story. Representatives for the Trump Organization did not respond to messages for comment and confirmation that the Joint Tax Committee had reviewed Trump’s taxes. How the process works: When an individual refund or credit over $2 million is approved, the IRS is statutorily required to notify Congress. A designated team at the IRS prepares a report for the JCT on each individual case that contains taxpayer information, spreadsheets and technical data and analysis. Trump should have been sent a letter disclosing that his case was sent to the JCT for review. Even when the JCT was sifting through Trumps’ tax information, it should have remained beyond the grasp of the five Democrats and five Republicans on the committee. The reviews are performed by the panel’s tax experts and attorneys, typically working in dedicated space in an IRS facility. Lawmakers don’t participate. “It is held quite tightly in the hands of just a few lawyers in the staff who are dedicated to doing this work. And they know not to communicate any of it to outsiders,” said George Yin, an emeritus University of Virginia law professor who was JCT chief of staff from 2003 to 2005. Former JCT staffers would not comment on whether they remembered the dispute with Trump, citing confidentiality rules. Unauthorized release of tax return information can mean a felony conviction and a prison sentence of up to five years. Kenneth Kies, a tax attorney who served as chief of staff on the committee from 1994 to 1998, said the committee typically handled a “couple hundred” cases year. And usually the JCT — which includes former IRS staffers — ratifies the IRS’s decision. “A lot of them were fairly straightforward. Those were no drama,” Kies said. “Only occasionally we would get one where there was an interpretation of the law we didn’t agree with.” While the Joint Committee rarely makes headlines, it plays a crucial role in policymaking, delivering cost estimates that can be make-or-break for proposed tax legislation. It was instrumental during the creation of both the Obama administration health care law and the GOP tax overhaul in 2017. The office is overseen by chief of staff Barthold, a Harvard Ph.D. economist who has worked on the panel for more than 30 years. As the JCT’s top staffer since 2009, he is among the very few who might know whether Trump’s audit was reviewed. But he is legally barred from disclosing most information related to the committee’s audit work. Left unresolved is a full accounting of Trump’s finances, which Democrats predict will illustrate numerous conflicts of interest between his businesses and his presidency. They point to Trump’s reported $421 million in debt, which ethics experts say raises serious national security concerns. Neal, the lead force behind a Democratic lawsuit to expose Trump’s taxes, said the Times’ reporting is proof that the documents should be given to Congress. The existence of the audit also strengthens their legal case, he said, since the Democratic investigation is focused on that very issue. “That’s what this case has been about — have the IRS tell us how auditing is done,” Neal said. “That’s always been our case.”"}]}