{"article": [{"url": "https://www.marketwatch.com/story/imf-says-40-of-worlds-current-account-surpluses-and-deficits-are-excessive-2020-08-04", "published": 1596532100.0, "headline": "IMF says 40% of worldâ\u0080\u0099s current account surpluses and deficits are â\u0080\u0098excessiveâ\u0080\u0099", "body": "The International Monetary Fund said current account deficits and surpluses were â\u0080\u009cexcessiveâ\u0080\u009d last year in 40% of the worldâ\u0080\u0099s countries, and the agency noted that the U.S. deficit was too high while Germanyâ\u0080\u0099s surplus was too large. . â\u0080\u009cEconomies that borrow too much and too quickly from abroad, by running external deficits, may become vulnerable to sudden stops in capital flows. Countries also face risks from investing too much of their savings abroad given investment needs at home,â\u0080\u009d said Martin Kaufman and Daniel Leigh in a new report. The U.S. dollar DXY, -0.58% Â was overvalued by roughly 11% in 2019, according to the IMF, which nonetheless expects foreign demand for U.S. debt to stay strong. The IMF estimated that the dollarâ\u0080\u0099s real exchange rate appreciated by 2.8% in 2019. Economists are debating the pros and cons of the recent decline in the dollarâ\u0080\u0099s value. The ICE U.S. Dollar Index DXY, -0.58% Â , a measure of the currency against a basket of six major rivals, fell 4.2% in July, its biggest one-month decline since September 2010, according to FactSet. The IMF report suggests the agency would welcome some fall in the dollar. At the start of the crisis, the dollar appreciated, given its role as a safe-haven but there was some unwinding of capital flows as central banks and governments provided support for the economy. Read: Dollar could be a â\u0080\u0098crash riskâ\u0080\u0099 if U.S. loses credibility, analyst warns The IMF report was designed to examine the external accounts of its members. The agency said the ballooning level of U.S. debt in recent months in the wake of the pandemic is expected to be offset by higher private sector savings. The IMFâ\u0080\u0099s forecast may already be coming to fruition. In an interview Sunday, Minneapolis Fed President Neel Kashkari said the rising U.S. personal savings rate was â\u0080\u009cone bright spotâ\u0080\u009d in the U.S. outlook. â\u0080\u009cThat means Congress has the resources to support those that are most hurting,â\u0080\u009d Kashkari said on CBSâ\u0080\u0099 â\u0080\u009cFace the Nation.â\u0080\u009d The IMF report said there were only â\u0080\u009cmoderateâ\u0080\u009d risks of a decline in foreign appetite for U.S. debt given the dominant status of the dollar as a global reserve currency. The U.S. should try over the next two or three years to reduce the external current account deficit. Policy efforts in the near term in the U.S. and elsewhere should continue to focus on providing lifelines and promoting economic recovery, the IMF said. In 2019 the global current account balance declined by 0.2 percentage point of world GDP, to 2.9% of world GDP. The IMF forecast only a further narrowing in 2020 by some 0.3% of world GDP, a more modest decline than after the global financial crisis 10 years ago. Chinaâ\u0080\u0099s external position was seen as â\u0080\u009cbroadly in line with fundamentals and desirable policies.â\u0080\u009d Overall current account deficits and surpluses in 2019 were just below 3% of world GDP, slightly less than a year earlier. The COVID-19 pandemic has caused a sharp decline in global trade. The global volume of goods trade in the first five months of 2020 was about 20% lower than in 2019."}]}