{"article": [{"url": "https://www.marketwatch.com/story/why-trump-and-mcconnell-may-not-be-able-to-choose-ginsburgs-successor-at-the-supreme-court-11600699885", "published": 1600685960.0, "headline": "Why Trump and McConnell may not be able to choose Ginsburgâ\u0080\u0099s successor at the Supreme Court", "body": "People pay their respects to Ruth Bader Ginsburg in front of the U.S. Supreme Court Eric Baradat/Agence France-Presse/Getty Images â\u0080\u009cMy most fervent wish is that I will not be replaced until a new president is installed.â\u0080\u009d These were among the last words uttered by Ruth Bader Ginsburg, to her granddaughter, before the Supreme Court justice died Friday evening at the age of 87. The conversation was first reported by National Public Radio.Â But it is a dying wish that, if President Donald Trump has his way, will go unfulfilled. A sitting president has every right to nominate whomever he (or she) wants for the high court of course, and Trump, coincidentally just days ago, floated several deeply conservative names.Â Breaking news: Trump says heâ\u0080\u0099ll name Supreme Court pick on Friday or Saturday What happens now? Democrats tried and failed to stop Trumpâ\u0080\u0099s first two nominees, Neil Gorsuch and Brett Kavanaugh, from being confirmed. The Kavanaugh fight was particularly brutal and drawn-out, after allegations of sexual misconduct were leveled by no less than three women. The White House will have to do a better job of vetting if it wants to avoid an embarrassing rerun of that mess.The math The math hasnâ\u0080\u0099t changed. Democrats, on paper, still lack the votes to stop Trump. However, several variables come into play. For starters, the three key Republican playersâ\u0080\u0094Trump, Senate Majority Leader Mitch McConnell, and Judiciary Committee Chairman Lindsey Graham, are all up for re-election in November. Two of themâ\u0080\u0094Trump and Grahamâ\u0080\u0094look to be in trouble. In politics, self-preservation is always job one. Trump and Graham are worried about saving their skin (McConnell looks in better shape in his race), and perhaps may not be able to spend as much time on a pre-election confirmation as many people seem to assume. This suggests the real fight will come after the election is decided.Â Also read: Biden to senators: Extinguish the â\u0080\u0098flamesâ\u0080\u0099 engulfing U.S. politics by not â\u0080\u0098jammingâ\u0080\u0099 through a Supreme Court justice Usually, these things play out over many weeks. Over the last half-century it has taken about 10 weeksâ\u0080\u009471 days to be exactâ\u0080\u0094for the average nominee to be confirmed. Kavanaughâ\u0080\u0099s confirmation, at 89 days, was an outlier.Â Â But this is 2020. Graham has shown himself to be such a craven hypocrite, so contemptuous and disrespectful of the Senate procedures he once claimed to revere, that he could just schedule a quick Judiciary Committee vote and ram Trumpâ\u0080\u0099s nominee through. Who cares what Democrats think? Republicans have the votes.Â That would send the nomination to the full Senate itself for a final vote, and again, Republicans, withÂ 53 seats, have the votes.Â Â Democrats need defections The only hope DemocratsÂ have here is for four Republican senators to buck the party line and slow things down. Already there are two. Maineâ\u0080\u0099s Susan Collins, whose re-election bid is in serious trouble because of her support for Kavanaugh in 2018), says she wonâ\u0080\u0099t vote to back a nominee so close to electionâ\u0080\u0094nor would she in a lame duck if thereâ\u0080\u0099s a change in presidents. Â Alaskaâ\u0080\u0099s Lisa Murkowski is also not on board. â\u0080\u009cI would not vote to confirm a Supreme Court nominee,â\u0080\u009d she said Friday.Â Thatâ\u0080\u0099s two Republican senators who arenâ\u0080\u0099t on the Trump train. That brings the Republican vote to 51â\u0080\u0094one more than the 50 theyâ\u0080\u0099d need to put Trumpâ\u0080\u0099s pick on the court.Â 50? Donâ\u0080\u0099t they need a majority of 51? No. Because a 50-50 tie, should that occur, would be broken by Vice President Mike Pence.Â So it would appear that Republicans are in pretty good shape. But are they? Consider that Utahâ\u0080\u0099s Mitt Romneyâ\u0080\u0094the only Republican senator who voted to convict in Trumpâ\u0080\u0099s impeachment trialâ\u0080\u0094could stick it to the president once again. That brings the GOP tally down to 50, but that would still be safe, given the Pence tiebreaker. Â Â Coloradoâ\u0080\u0099s Cory Gardner could also bolt. Heâ\u0080\u0099s in a very tough re-election fight in a state that rejected Trump in 2016. Voting to ram through Trumpâ\u0080\u0099s nominee wouldnâ\u0080\u0099t exactly help his prospects back home.Â Â Neither Romney nor Gardner have said what theyâ\u0080\u0099ll do. McConnell needs to corral just one of them.Â A mess What happens if a nominee isnâ\u0080\u0099t approvedÂ by Election Day? Then it could really get messy. First, weâ\u0080\u0099reÂ probably not going to know who the next president will be on Nov. 3, and we might not know for a few weeks.Â The 2000 Gore-Bush debacle dragged on for five weeks, after allâ\u0080\u0094and that was because of a dispute in just one state: Florida.Â The way things are shaping up this year, there could be simultaneous, postelection messes in numerousÂ states.Â Meanwhile, the electoral college is scheduled to be certified on Dec. 14. Thatâ\u0080\u0099s 84 days from now.Â What if Biden wins? What if DemocratsÂ take the Senate? And consider Arizona, where Democrat Mark Kelly will almost certainly crush Republican Martha McSally, who was appointed to finish the term of the late Sen. John McCain. Kelly could be sworn in as early as Nov. 30, according to Arizona election expertsâ\u0080\u0094and vote down Trumpâ\u0080\u0099s pick.Â Â When conservative Justice Antonin Scalia died in February 2016, Barack Obama was a lame-duck president. Remember what happened next? McConnell said the vacancy should be filled by the next president. So he sat on the nomination of Obamaâ\u0080\u0099s nominee, Merrick Garland, and the seat wound up getting filled by Gorsuch. McConnell bet bigâ\u0080\u0094and won big.Â But unlike Obama, Trump is not a lame duck. He could win again. Thatâ\u0080\u0099s the difference, Republicans argue. And theyâ\u0080\u0099re right. But if he loses to Joe Biden, what becomes of their argument then?Â Hereâ\u0080\u0099s what becomes of it: Nothing. McConnell has already said heâ\u0080\u0099s all in on pushing a nominee through. As for Graham, after saying in 2016 that heâ\u0080\u0099d oppose a Republican president trying to fill a vacancy in the last year of the first term, he reneged on his words on Saturday. It may very well be that in a city where men of principle are few and far between, that Graham is the lowest of them all.Â These are menâ\u0080\u0094Trump, McConnell, Grahamâ\u0080\u0094who donâ\u0080\u0099t give a hoot what you think about any of this. Itâ\u0080\u0099s all about the raw exercise of power. Nothing more, nothing less. They intend to exercise it now. But theyâ\u0080\u0099d better hurry.Â Suggested reading: Ruth Bader Ginsburg played a pivotal role in the womenâ\u0080\u0099s-rights eraâ\u0080\u0094and that was before she joined the Supreme Court Amy Coney Barrett emerges as Trumpâ\u0080\u0099s front-runner to fill Ruth Bader Ginsburgâ\u0080\u0099s Supreme Court seat"}]}