{"article": [{"url": "https://www.marketwatch.com/story/gold-rises-back-near-1800-as-us-dollar-softens-to-start-julys-first-full-week-2020-07-06", "published": 1594044920.0, "headline": "Gold ends at a nearly 1-week high as U.S. dollar softens to start Julyâ\u0080\u0099s first full week", "body": "Gold futures finished Monday at their highest prices in nearly a week, supported in part by a softer U.S. dollar, which provided a runway higher for the commodity even as global stocks rallied. The U.S. dollar was off 0.5% in Monday dealings, as measured by the ICE U.S. dollar index DXY, -0.58%, a gauge of the buck against a half-dozen currencies. A weaker U.S. dollar can make assets priced in the currency more attractive to buyers using other monetary units. â\u0080\u009cSeeing as dealers are keen to take on more risk today, it is likely that goldâ\u0080\u0099s positive move is almost exclusively down to the weakness in the dollar,â\u0080\u009d said David Madden, market analyst at CMC Markets UK, in a market update. Moves in the greenback came amid a broad rally in equities that has been attributed to a surge in Chinese markets. Beijingâ\u0080\u0099s state-run media published a front-page editorial encouraging investors to buy stocks to support domestic markets. Still, investors are wrestling with the climbing tally of new COVID-19 cases in the U.S., concentrated in a number of hot-spot states including Arizona and Florida. â\u0080\u009cBullion prices donâ\u0080\u0099t typically jump because of social unrest or geopolitical strife. But if those stresses add to a financial crisis or economic slump,â\u0080\u009d gold prices can spiral higher, said Adrian Ash, director of research at BullionVault. Against that backdrop, August gold US:GCQ20 Â rose $3.50, or 0.2%, to settle at $1,793.50 an ounce, the highest finish for a most-active contract since June 30, when prices ended above $1,800 for the first time since September 2011. Prices on Thursday ended 0.5% higher for the holiday-abbreviated week, according to FactSet data. Gold saw some pressure, briefly giving up earlier gains that had lifted prices to as high as $1,799 shortly after economic data released Monday showed that the Institute for Supply Managementâ\u0080\u0099s index of nonmanufacturing companies jumped to 57.1% in June from 45.4% in May. That marked the single-biggest increase since the survey was created in 1997. However, growth looked so strong because it occurred after a few months of extremely low activity. Itâ\u0080\u0099s â\u0080\u009chard to see what stops gold reaching new highs from here,â\u0080\u009d said Ash. In a daily note, he explained that â\u0080\u009clast weekâ\u0080\u0099s swing towards 2011 levels in U.S. dollar terms near $1,800 per ounce is attracting a flood of new interest, piling on top of January-Juneâ\u0080\u0099s heavy demand.â\u0080\u009d â\u0080\u009cFear of missing out could spur a dramatic spike [in gold] if the economic, health and political news continues to darken,â\u0080\u009d Ash said. â\u0080\u009cHeaven forbid we get a hot, angry summer to match 2011. But rarely have there been so many tailwinds for gold.â\u0080\u009d â\u0080\u009cThe economic slump caused by Covid-19 has spurred record government deficits and central-bank inflation to try and offset it,â\u0080\u009d he said. â\u0080\u009cChinaâ\u0080\u0099s power grab in Hong Kong is worsening geopolitical tensions ahead of Novemberâ\u0080\u0099s U.S. election, with the U.K.â\u0080\u0099s looming no-deal exit from the [European Union] now baked in the crust for December.â\u0080\u009d Read:Gold posts largest quarterly gain in 4 years; talk of record prices by year-end grows Meanwhile, September silver US:SIU20 rose 26 cents, or 1.4%, at $18.582 an ounce, after the metal put in a weekly gain of 1.6%. Among other metals traded on Comex, September copper US:HGU20 Â tacked on nearly 1% to $2.7745 a pound. October platinum PLV20, +3.99% Â rose 0.7% to $837.70 an ounce and September palladium US:PAU20 Â settled at $1,952.30 an ounce, up 1.3%."}]}