{"article": [{"url": "https://www.marketwatch.com/story/georgia-governor-relents-allows-some-local-mask-requirements-2020-08-16", "published": 1597598120.0, "headline": "Georgia governor relents, allows some local mask requirements", "body": "ATLANTA — Georgia’s governor, who has opposed local mask mandates and even sued over one in Atlanta, has signed a new executive order that allows local governments to enact mask requirements to help fight the coronavirus pandemic. As with previous orders, the one issued Saturday says residents and visitors of the state are “strongly encouraged” to wear face coverings when they are outside of their homes, except when eating, drinking or exercising outside. But unlike previous orders, this one allows local governments in counties that have reached a “threshold requirement” to require the wearing of masks on government-owned property. A county meets that threshold requirement if it has had 100 or more confirmed cases of COVID-19 per 100,000 people over the previous 14 days. Only two of Georgia’s 159 counties were below that threshold, according to data from the state Department of Public Health. Local mask mandates cannot result in fines, fees or penalties against private businesses or organizations, and penalties against individuals for non-compliance cannot included a fine greater than $50 and cannot include prison time, the order says. If people are not in compliance, local authorities must warn them “about the health risks posed by not wearing a face mask or face covering” prior to issuing a citation. Local mask requirements can’t be enforced on residential property and can only be enforced on private property, including businesses, if the owner or occupant consents to enforcement, the order says. “This order also protects Georgia businesses from government overreach by restricting the application and enforcement of local masking requirements to public property,” Kemp said in a news release accompanying the order, which is in effect through Aug. 31. “While I support local control, it must be properly balanced with property rights and personal freedoms.” Additionally, the order extends shelter-in-place requirements for people who meet certain criteria that result in “higher risk of severe illness,” including people in nursing homes or long-term care facilities, people with certain chronic health conditions and those with compromised immune systems or other underlying health conditions that make them more susceptible to the coronavirus. It also continues to ban gatherings larger than 50 people if people are closer than 6 feet apart and imposes specific operating guidelines on bars, restaurants and other businesses. Kemp, a Republican, last month sued Atlanta Mayor Keisha Lance Bottoms, a Democrat, and the Atlanta City Council after Bottoms made statements that the governor said some interpreted as orders for restaurants to close and ordered masks. Kemp dropped the lawsuit Thursday. Atlanta was one of a number of cities that issued orders requiring masks to be worn, despite Kemp’s arguments that local governments can’t impose measures that are more or less restrictive than those in his statewide executive orders. Georgia reported 3,372 new confirmed COVID-19 cases and 96 deaths Saturday. On Sunday, state officials announced 1,873 new confirmed cases and 33 deaths, bringing the state’s total to 237,030 cases and 4,702 deaths. Also Sunday, Cherokee County school officials said Creekview High School in Canton would suspend in-person learning through Aug. 31, becoming the third school in the district to temporarily end in-person learning, The Atlanta Journal-Constitution reported. The move came after 25 students tested positive for COVID-19 and 500 of the 1,800 students taking in-person classes at the school were quarantined. The school district says it expects that once pending tests come back the number of quarantined students will “significantly increase,” according to the newspaper. The Creekview closure comes about two weeks after 31,000 students who opted for in-person learning resumed classes and followed a transition to online-only classes at two other Cherokee County high schools. One of those schools, Etowah High School, made national headlines after a photo showed dozens of maskless students squeezed together for first-day-of-school senior photos."}]}