{"article": [{"url": "https://www.marketwatch.com/story/dow-sp-500-futures-point-to-fourth-straight-gain-ahead-of-private-sector-jobs-report-2020-08-05", "published": 1596646100.0, "headline": "S&P 500, Dow book 4th days of gains, Nasdaq adds 6th, as market awaits more pandemic aid", "body": "U.S. stocks closed higher Wednesday, leaving the Nasdaq Composite Index with its 31st record close this year, as investors embraced corporate earnings and service-sector data that surprised to the upside. Reports of some progress in Congress toward a fresh coronavirus relief package also offered some support for the bulls. How did equity benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% rose 373.05 points, or 1.4%, to settle at 27,201.52, its largest daily percent gain since July 14, while the S&P 500 SPX, +0.87% gained 21.26 points, 0.6%, to end at 3,327.77. The Nasdaq Composite Index COMP, +1.39% added 57.23 points, 0.5%, closing at 10,998.40, after briefly setting an intraday 11,002.11 record high. On Tuesday, the Dow picked up 164.07 points, or 0.6%, at 26,828.47; the S&P 500 index rose 11.90 points, or 0.4%, to 3,306.51, while the Nasdaq Composite Index finished 38.37 points, or 0.4%, to close at 10,941.17. What drove the market? The stock market closed higher Wednesday, supported by hopes for progress toward another fiscal relief package in Congress and better than expected corporate earnings results. Late Tuesday, reports suggested that, Trump administration officials and congressional Democratic leaders are working to reach a coronavirus aid bill deal by the end of the week even if the parties still remain far apart on the issues. As lawmakers wrangle over additional pandemic aid, House Speaker Nancy Pelosi on Wednesday said the Trump administration might be able to unilaterally extend the federal moratorium on tenant evictions put in place in March by the CARES Act that expired on July 25. “It’s all about the prospects of a stimulus package and earnings that have been coming in, for the most part, better than expected,” Peter Cardillo, chief market economist, Spartan Capital told MarketWatch. “So, the stock market keeps rallying. And of course, the basic powerhouse of this is the generous Fed.” The Federal Reserve has used up only a fraction of its roughly $2 trillion slate of emergency lending facilities to keep liquidity going, letting investors do the rest. The central bank also has vowed to keep up its unlimited Treasury bond buying program, which comes as the U.S. Treasury Department prepares a record sale of bonds and notes next week to help finance the response to the COVID-19 pandemic. Read: Treasury ramps up debt issuance across entire U.S. bond market for third quarter Meanwhile, concerns over the coronavirus led Democratic presidential candidate Joe Biden on Wednesday to decide not to travel later this month to Milwaukee to accept his party’s White House nomination, according to several news reports, underscoring how COVID-19, tallied at 18.5 million cases globally on Wednesday, is pushing more facets of life into the virtual realm. Better-than-expected quarterly results late Tuesday from Dow component and entertainment and theme park giant Walt Disney Co. DIS, +1.53% also helped to fuel bullish sentiment, even though it reported a $3.5 billion loss. The company touted 100 million subscribers on its streaming platforms amid the pandemic and announced that it would be releasing the live-action version of “Mulan,” through Disney+ for $29.99, a new approach to that streaming service. Separately, Teladoc Health Inc. TDOC, -1.52% and Livongo Health Inc. LVGO, -1.17% said Wednesday they have agreed to merge in a deal valued at $18.5 billion to create a company that can serve a spectrum of health needs, using virtual care. Choppy market action over the previous few trading sessions is a healthy sign, said Andrew Smith, chief investment strategist of Dallas-based Delos Capital Advisors, in an interview. “The market is sending a very clear signal that it’s trying to rotate into the cyclical economic recovery names.” Smith thinks back-and-forth between pandemic darlings, like Amazon.com Inc. AMZN, +3.01% and cyclical recovery stories, will continue for some time. “It’s a battle between leading economic indicators and lagging ones,” he said. In economic news, the final monthly reading of the closely-watched ISM service sector purchasing managers index jumped to a reading of 58.1 in July, beating expectations and signalling stronger economic growth. Payroll provider ADP ADP, +1.93% also said only 167,000 private sector jobs were created in July, a fraction of the consensus estimate for a gain of 1.88 million jobs, according to Econoday, though June was revised up to 4.3 million from 2.4 million. Separately, the trade deficit narrowed 7.5% in July to $50.7 billion. “In one line: Ouch,” wrote Ian Shepherdson, Pantheon Macroeconomics’ chief economist, after the ADP release. But since the payroll company’s model incorporates lagged official payroll data, he expects Friday’s jobs report to show payrolls up by about 1 million. That still leaves many millions of jobs lost to the pandemic. Five of the top 10 U.S. states with the most dire labor market disruptions during the pandemic are located in the East, according to an Oxford Economics report on Wednesday, which warns “local labor conditions could suffer renewed deterioration,” without a “booster shot” from policy makers. The Federal Reserve’s No. 2, Richard Clarida, told CNBC that he’s sticking to his prior forecast of an improving economy over the remainder of the year. Cleveland Fed President Loretta Mester will also speak at a virtual event at 5 p.m. Which stocks were in focus? Apple Inc. AAPL, +1.74% shares rose 0.4%, even after Bank of America downgraded the stock to neutral from buy Wednesday, pointing to a more balanced risk-reward profile for the stock as it’s currently trading at its highest premium to the S&P 500 SPX in a decade. Johnson & Johnson JNJ, +1.39% shares advanced 0.8% after the company said it will receive more than $1 billion from the U.S. government to manufacture 100 million doses of its investigational COVID-19 vaccine. Shares of Humana Inc. HUM, +1.43% gained 3.3% after the health care services company reported second-quarter profit and revenue that beat expectations, while maintaining its adjusted earnings outlook. CVS Health Corp. shares CVS, -1.76% dipped 1% Wednesday, after the drugstore chain trounced estimates for the second quarter and raised its full-year guidance despite the impact of the coronavirus pandemic on its operations Shares of Regeneron Pharmaceuticals Inc. REGN, +0.36% fell 3.7% after surging toward a record high in premarket trading Wednesday, after the biotechnology company reported second-quarter profit and revenue that beat Wall Street expectations, and said it expects clinical studies to remain generally on track in the face of the COVID-19 pandemic. Lumber Liquidators Holdings Inc. LL, +4.17% reported Wednesday that it swung to a surprise second-quarter profit as sales fell less than expected, as sales trends improved through the quarter as markets reopened following COVID-19-related shutdowns. Shares lost 8.3%. Moderna Inc. MRNA, +0.09% shares fell 3.4% even though the company said it was moving ahead with Phase 3 clinical trials for a COVID-19 vaccine. Shares of Wayfair Inc. W, -2.59% rose 3.6% Wednesday after the online seller of home furnishings and housewares swung to a big profit beat in the second quarter, citing “unprecedented demand.” Wendy’s Co. WEN, +2.20% beat analyst expectations on its second quarter earnings, and the fast-food chain declared a dividend, but also declined to provide guidance. Shares lost 6%. Beyond Meat Inc. BYND, +0.80% shares fell 6.7% after the company on Tuesday reported a widening loss in the second-quarter and its chief executive said the meat alternative provider had been offering discounts during the coronavirus pandemic to encourage consumers to try its plant-based burgers and other products as beef prices rose. Match Group Inc. MTCH, -0.94% shares gained 12.2% Wednesday, a day after the online dating company reported strong gains in profit and revenue in the second quarter, beating Wall Street estimates in the first full period of sheltering-in-place due to the spread of the coronavirus pandemic. How did other markets trade? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 2.7 basis points to 0.541% after rosy economic data from the eurozone. Bond prices move inversely to yields. Equity markets in Europe closed higher. The Stoxx Europe 600 index SXXP, +0.55% gained 0.5% to 365.16, and the FTSE 100 UKX, +0.64% jumped 1.1%. In Asia, China’s CSI 300 index 000300, +2.04% was flat and Japan’s benchmark Nikkei NIK, -0.11% closed 0.3% lower. The greenback slumped again, with the ICE U.S. Dollar index DXY, -0.58% down 0.6%. Oil futures gained, with the U.S. benchmark CL.1, -1.62% adding 1.2% to finish at $42.19 a barrel on the New York Mercantile Exchange, boosted in part by a decline in inventories. Gold futures for December GCZ20, +2.17% settled 1.4% higher at $2,049.30 an ounce, recording a fourth straight day of record closes. Mark DeCambre contributed reporting"}]}