{"article": [{"url": "https://www.marketwatch.com/story/qanon-conspiracy-theory-is-on-the-ballot-in-some-states-this-november-2020-09-07", "published": 1599548960.0, "headline": "QAnon conspiracy theory is on the ballot in some states this November", "body": "PHOENIX (AP) — Candidates engaging with the QAnon conspiracy theory are running for seats in state legislatures this year, breathing more oxygen into a once-obscure conspiracy movement that has grown in prominence since adherents won Republican congressional primaries this year. Some of the legislative candidates have repeatedly shared QAnon memes and interacted extensively with social-media accounts promoting the conspiracy — which is centered on the baseless belief that President Donald Trump is waging a secret campaign against enemies in the “deep state” and a child sex trafficking ring. Others have acted in ways that leave it unclear whether they believe in the theory or may be merely flirting with the ideas to garner attention. They make up a tiny share of the thousands of state legislative candidates on the ballot in November and many are longshots, but several, including in Arizona, Minnesota and Wisconsin, are running in competitive districts. Among those who have engaged with QAnon postings on social media is Dave Armstrong, a Republican candidate for the Wisconsin Assembly. He was asked to run for the seat by the incumbent, a fellow Republican. As the overlap between support for President Donald Trump and adherence to the “QAnon” conspiracy theory has increased, Trump has been called upon to disavow it, as Vice President Mike Pence and Trump’s presidential rival Joe Biden have done. He has pointedly refused. The FBI has flagged QAnon as a domestic-terrorism threat. Associated Press While he does not describe himself as a QAnon adherent, he has liked and forwarded videos made by QAnon backers. Armstrong told the Associated Press that he finds core aspects of the conspiracy credible, but not all of it. “I don’t know if we’ll ever know the answer to that, nor can we prove it,” he said. “That’s the biggest thing with QAnon is you can’t prove any of it.” John Ellenson, Armstrong’s Democratic opponent for the seat, said it would be “dangerous” to elect Armstrong because he “plays in conspiracies and not the truth.” The conspiracy theory has been creeping into the mainstream political arena. It gained wider attention after Marjorie Taylor Greene won the Republican primary for a U.S. House seat in a heavily GOP Georgia district last month. Greene was invited to the White House for Trump’s acceptance speech during the Republican National Convention. Trump has said he knows little about the movement but has spoken favorably of its followers. Vice President Mike Pence has dismissed it. Former Vice President Joe Biden, Trump’s Nov. 3 rival, last week called it mortifying and dangerous. While races for congressional seats often generate more publicity, state legislative positions serve as springboards to higher office, and their holders wield significant power to affect everyday life — determining state policies on education, policing, health care, criminal justice and other issues. As with many conspiracy theories, it’s not always clear how much of it the candidates believe. Through the AP’s statehouse reporters, the nonprofit research group Media Matters for America and Democratic groups involved in state legislative races, the news cooperative identified about two dozen candidates in more than a dozen states who have expressed some level of support or interest in QAnon. That number is only the roughest of estimates. Some who had shared messages referencing the conspiracy sought to put distance between themselves and the movement when contacted by the AP. Many simply did not return requests for comment — perhaps not surprising given that the movement proclaims the mainstream media is in on the conspiracy. Among those was Suzanne Sharer, a Republican legislative candidate in the Phoenix area who has posted QAnon videos and messages more than a dozen times in recent months. She is running in a suburban district that once was solidly Republican but has been trending Democratic. In April, she wrote: “Q has been quiet. Is this 10 days of darkness?” Julie Buria, a Republican running in a northern Minnesota legislative district that Trump carried by nearly 3 percentage points in 2016, retweeted at least four posts in April and May that seemed to support QAnon. In one she wrote: “Link to new Q drop” with a link to a QAnon site. The tweet also used several hashtags common to the conspiracy’s followers. But in an interview, Buria insisted she was not very familiar with QAnon. “Have I looked at it? Yes. Do I believe all of it? No. I’m not really sure what to think about all that,” she said. Whether or not candidates believe in QAnon, they are lending the ideas legitimacy by sharing them, said Jenny Guzman, legislative communications coordinator for Progress Arizona, a liberal group that has worked to draw attention to candidates sharing conspiracy theories. “I think that Republicans very clearly know what they’re doing when they’re engaging and spreading misinformation and conspiracy theories,” Guzman said. “But when they get caught, they’re trying to play ignorant because they just don’t want to face accountability for their actions.” Most of the legislative candidates identified by the AP as having some history of posting about QAnon are Republicans, though some are independent or third-party candidates. Some are not shy about their interest in the movement. On her Twitter account, Melissa Moore has included a picture of Earth inside the letter Q with the slogan, “The World is About to Change,” that is common among the movement’s followers. She has also used several Q-associated hashtags in her tweets. A delegate to the Republican National Convention, she is running in a Democratic-leaning district in suburban Minneapolis. “I like following it,” Moore said. “It’s an exciting movement that opens up our minds to different possibilities of what’s going on, of what’s really happening in our world today.” In Nevada, independent state Assembly candidate John Cardiff Gerhardt also openly embraces the movement. He said he suspected government officials, the mainstream media and the criminal justice system were conspiring to cover up human trafficking even before he became familiar with QAnon. “Hiding behind the curtain where everything seems to be fine and dandy, there’s actually executives, CEOs, pop stars and the top politicians, including the past few presidents before Donald Trump,” said Gerhardt, who is running in a heavily Democratic district of eastern Las Vegas. Gerhardt said his main focus is to replace the state constitution. A draft proposal integrates elements of the conspiracy, including an official recognition that a “Cabal” is attempting to “control & corrupt the State of Nevada.”"}]}