{"article": [{"url": "https://www.marketwatch.com/story/global-payments-stock-gains-after-company-says-new-partnership-with-amazons-aws-could-triple-market-opportunity-2020-08-03", "published": 1596463640.0, "headline": "Global Payments stock gains after company says new partnership with Amazon's AWS could triple market opportunity", "body": "Global Payments Inc. topped earnings expectations Monday and announced a new partnership with Amazon.com Inc.'s Amazon Web Services that it said would provide more cloud-focused offerings for bank clients and allow the company to expand its geographic reach. Shares GPN, +1.22%  are up 1.2% in Monday afternoon trading. Through the partnership with Amazon's AMZN, +3.01% AWS, Global Payments will create a cloud-based processing platform for card issuers. Global Payments' Chief Executive Jeff Sloan said that the arrangement would \"level the playing field for large financial institutions\" by giving them access to technology-oriented offerings that could help them to deliver more modern consumer experiences and move more quickly to bring about feature improvements. Things like the rollout of contactless payment options and improved digital banking experiences \"can all be done better, faster, and cheaper in the cloud,\" Sloan told MarketWatch. The AWS arrangement is about \"letting large financial institutions globally access the same technology that startups did,\" he said. See also: Here's how PayPal hopes to turn Venmo into the next PayPal From the perspective of Global Payments' own business, the AWS partnership allows the company the opportunity to move into new markets, since it had previously been limited just to geographies where it could build physical data centers. Sloan said that overall, the arrangement could more than triple the company's addressable market in issuer solutions. Global Payments beat earnings and revenue expectations for the second quarter despite (and perhaps, even partly due to) the pandemic, and Sloan pointed to sequential improvement from month to month during the period, while some aspects of the business returned to year-over-year growth in June. Further, trends were \"stable\" throughout July \"and even slightly improving over what we saw in June,\" President Cameron Bready said on Global Payments' earnings call. Sloan told MarketWatch that Global Payments saw a 16% increase in the e-commerce and omnichannel category during the second quarter, excluding travel. He disclosed on the earnings call that this part of the business accounts for 20% of merchant revenue. Don't miss: Visa tops earnings expectations, but travel category remains slow to snap back He also said that he believes Global Payments is the \"biggest deployer of NFC technology,\" referring to near-field communications technology that allows for contactless payments, which have picked up during the COVID-19 crisis as shoppers look for ways to avoid exchanging cash or handing people their credit cards due to concerns about viral spread. \"I think you're likely to pull forward two to three years' worth of demand and I don't see it diminishing,\" Sloan said about contactless trends as well as the boom in e-commerce adoption during the pandemic. He said that it can be difficult to get consumers to change their behavior in terms of payment preferences but that people are unlikely to revert to old habits once they have made a change. Read: Mastercard earnings dip as COVID-19 limits spending but drives greater demand for antifraud services While COVID-19 has created growing interest in tap payments, Sloan said that the crisis could generate a preference for contactless payments like physical cards that don't require facial identification that way some modern phones do for their mobile wallets. Activating facial recognition is more difficult in the age of the pandemic since masks block the nose and mouth. Global Payments, which merged with fellow financial technology company Total System Services in September, earned an adjusted $1.31 a share for the second quarter, down from $1.51 a share a year earlier but ahead of the $1.21 a share that analysts surveyed by FactSet had been forecasting. Revenue rose to $1.67 billion from $935 million. Shares have gained 11.3% over the past three months as the S&P 500 SPX, +0.87%  has risen 16.5%."}]}