{"article": [{"url": "https://www.marketwatch.com/story/why-august-in-a-pandemic-for-stock-market-investors-is-a-time-for-vigilance-11596288235", "published": 1596362060.0, "headline": "Why August in a pandemic is a time for vigilance for stock market investors", "body": "The dog days of summer on Wall Street are upon us. The ancient Greeks would refer to the so-called “dog days” in late July and early August as the period in which the star Sirius — also known as Alpha Canis Majoris, or dog star–as the hottest part of summer, notably because the star appeared to rise just before the sun. It signified a time prone to bringing fever or catastrophe. That description, perhaps, is an apt way to think about August markets in the midst of a pandemic that continues to dog investors, wreaking havoc on global economies. “Historically August has had pretty muted performance…given the fluid coronavirus situation, the uncertainty regarding the timing of fiscal stimulus and signs of economic data stalling out, August could be more turbulent than it has in the past,” Lindsey Bell, chief strategist at Ally Invest told MarketWatch. In fact, August has tended to be more prone to unexpected turbulence than its traditional reputation as a period in which traders and investors laze about before autumn trading action kicks off. Last year, for example, the month began with President Donald Trump reigniting Sino-American trade tensions via a series of tweets that indicated that the U.S. would impose levies of 10% on China imports starting on Sept. 1. In 2017, a flare-up in tensions between North Korea and the U.S. drove the Cboe Volatility Index VIX, -5.15%, one measure of implied volatility in the S&P 500 SPX, +0.87%, to its highest level to that point of the year. China’s yuan CNYUSD, CNHUSD, +0.72% devaluation and sluggish economy in 2015 helped to fuel the worst August performance in 17 years, amplified by angst of a rate-hike by the Federal Reserve to normalize monetary policy (that seems so far away now), and weakness in global energy markets. The list of tumultuous August moments goes on, including the default of Russia in 1998, but this moment in history might seem more uniquely primed for turbulence. There is arguably more uncertainty about the future of the economy and markets swirling around than answers. And for many a fresh round of fiscal stimulus for Americans stricken by the COVID-19 pandemic ranks tops among the list of concerns. Checkout: Coronavirus Update: 17.6 million cases world-wide, with 4.6 million in the U.S., as of Aug. 1. “I think in terms of market outlook we’re all laser focused on two things: 1) the outcome of Fiscal Stimulus / extended [unemployment] benefits and 2) the path of the virus,” Michael Antonelli, market strategist at Robert W. Baird & Co ., told MarketWatch. “If I had to weight importance, #1 is like 75% and #2 is 25%,” he said. “August is notoriously slow but those two things are unique to 2020 and might ratchet up volatility,” Antonelli said. A modicum of progress was enough to hep the Dow Jones Industrial Average DJIA, +0.56%, the S&P 500 and the Nasdaq Composite Index COMP, +1.39% finish in positive territory on Friday, along with a heaping dose of Apple’s share AAPL, +1.74% rally, on Friday. Talks between Trump administration officials and congressional Democrats over a coronavirus aid package stretched into the weekend, after Democrats rejected the administration’s offer of a short-term extension of the $600 weekly unemployment benefit. Emerging from the weekend without some path toward some further aid from Congress for suffering Americans and corporations could inject fresh volatility into markets to start the month. The economy shrank at a record 32.9% annualized in the second quarter, highlighting the fact that this is the deepest recession in American history. Read: ‘A massive welfare economy’ – federal aid prevents even steeper GDP collapse Also: MarketWatch Coronavirus Recovery Tracker As MarketWatch’s Jeff Bartash puts it, the severity of the economic downturn will come into fuller focus next week when the employment report for July is released on Friday. The number of jobs regained last month is unlikely to match the huge increases in May and June that totaled a combined 7.5 million. Economists polled by MarketWatch predict on average that the U.S. added about 1.5 million jobs in July. Fretting about fresh shocks to the financial system in August and months ahead could also explain why gold prices GOLD, +2.86% finished at a fresh record on Friday and are closing in on a round-number level at $2,000 an ounce. Meanwhile, the Cboe Volatility Index, which tends to rise when markets fall because it reflects buying in options contracts intended to insure against drops in stocks, has been trading well above its historical average. The index, which is colloquially referred to by its ticker, VIX, has a long-run average at 19.38, and hit an all-time high above 80 in March, a week before stocks hit a recent nadir on March 23, amid the worst of the outbreak of the novel strain of coronavirus that causes COVID-19. VIX, which closed at 24.46 on Friday, has been trading above its historic average for 111 trading days, with 117 trading days representing the longest trade above its mean since Jan. 11 of 2012, according to Dow Jones Market Data. Despite the angst about the outlook for August, however, there is cause for optimism. August performance in presidential election years has been stellar. August’s performance on average is up 0.63%, as gauged by monthly returns for the S&P 500 index since inception. However, during election years, August returns 2.87% on average, marking the best monthly performance by some margin, with July’s returns during election years second on average at 2.08%, Dow Jones Market Data show (see attached table). Source: Dow Jones Market Data So far, July has lived up to its billing and then some, with the S&P 500 up 5.51% in July, the Dow returning 2.38% and the Nasdaq Composite registering a 6.82% gain, on the back of unfettered appetite for technology and e-commerce stocks. To be sure, this is a pandemic year too, so anything could happen."}]}