{"article": [{"url": "https://www.marketwatch.com/story/pentagons-esper-seeks-to-reassure-nato-allies-as-trump-threatens-to-reduce-troops-in-germany-2020-06-26", "published": 1593192020.0, "headline": "Pentagonâ\u0080\u0099s Esper seeks to reassure NATO allies amid Trump threat to reduce troops in Germany", "body": "BRUSSELS (AP) â\u0080\u0094 U.S. Defense Secretary Mark Esper on Friday sought to reassure allies at NATO that Washington will consult them on any future troop movements, after President Donald Trump surprised partners at the military alliance by announcing the withdrawal of thousands of personnel from Germany. At a time when videoconferencing has become the norm due to the coronavirus, Esper paid a short in-person visit to NATO headquarters in Brussels, a week after several allied defense ministers expressed concern about the unpredictability of U.S. troop plans in Europe and amid a draw down in Afghanistan. â\u0080\u009cI welcome that the U.S. is consulting with allies, while making clear that the U.S. commitment to European security remains strong,â\u0080\u009d NATO Secretary-General Jens Stoltenberg said in a joint video statement before holding talks with Esper. Both men arrived at their lecterns wearing face masks. Media are not generally permitted to enter NATO headquarters because of virus-related restrictions. Last week, Trump said that he is ordering a major reduction in troop strength in Germany, from around 34,500 personnel down to 25,000. Members of his own party have criticized the move as a gift to Russia and a threat to U.S. national security. Germany is a hub for U.S. operations in the Middle East and Africa. Trump said this week that the troops could be moved to Poland. Germany wasnâ\u0080\u0099t notified of the move, which came after Trump branded its NATO ally â\u0080\u009cdelinquentâ\u0080\u009d for failing to pay enough for its own defense, by not meeting a goal set in 2014 for members to halt budget cuts and move toward spending at least 2% of gross national product on defense by 2024. See: Nearly two dozen House Republicans petition Trump to reconsider troop reduction in Germany Esper reaffirmed that message, saying that â\u0080\u009cI continue to urge all of our allies to meet their target goal of 2% of GDP. Weâ\u0080\u0099ve moved a good distance here in the last few years but thereâ\u0080\u0099s much, much more we need to do to ensure our collective security.â\u0080\u009d On Thursday, Secretary of State Mike Pompeo again took aim at Germany. Mark Esper, then Army secretary,speaks at a Pentagon news conference in 2018. Getty Images â\u0080\u009cWe do consider Russia to be a serious threat. Spending 1% of your GDP on defense, as Germany does, acknowledges that they may well not take it as serious of a threat as the United States of America takes it. They need to,â\u0080\u009d Pompeo said. â\u0080\u009cThat doesnâ\u0080\u0099t show the resolve that [Russian President] Vladimir Putin needs to see from Germany,â\u0080\u009d he added. According to NATO figures, Germany is spending about 1.38% of GDP on its defense budget. Berlin aims to hit 1.5% by 2024 and insists that this level of spending allows it to meet NATOâ\u0080\u0099s defense planning goals. The U.S. â\u0080\u0094 at around 3.4% of GDP â\u0080\u0094 spends more on defense than all 29 other allies combined. In an interview Friday with six European newspapers, Chancellor Angela Merkel conceded that Germany should boost military spending, but she also underlined that the presence of U.S. troops doesnâ\u0080\u0099t just benefit her country alone. â\u0080\u009cWe in Germany know that we have to spend more on defence; we have achieved considerable increases in recent years, and we will continue on that path to enhance our military capabilities,â\u0080\u009d Merkel said, adding that â\u0080\u009cAmerican troops in Germany help to protect not only Germany and the European part of NATO but also the interests of the United States of America.â\u0080\u009d She also said that Europe has to take responsibility for more of its security needs in her interview with Germanyâ\u0080\u0099s Sueddeutsche Zeitung, Britainâ\u0080\u0099s Guardian, Le Monde in France, Italyâ\u0080\u0099s La Stampa, La Vanguardia from Spain and Polandâ\u0080\u0099s Polityka newspaper. â\u0080\u009cWe grew up in the certain knowledge that the United States wanted to be a world power. Should the U.S. now wish to withdraw from that role of its own free will, we would have to reflect on that very deeply,â\u0080\u009d Merkel said. In a statement after his talks with Esper, Stoltenberg also underlined that â\u0080\u009cthe U.S. military presence in Europe is important for Europe, and itâ\u0080\u0099s also important for North America. Because only by working together can we address the great challenges we face.â\u0080\u009d On Afghanistan, where NATO has led security efforts since 2003 and recently began to pull troops out in line with a U.S.-brokered peace deal with the Taliban, the statement said the alliance â\u0080\u009cwill continue to adjust its presenceâ\u0080\u009d and that this will â\u0080\u009cbe done in close coordination with allies and partners.â\u0080\u009d ___ Frank Jordans in Berlin contributed to this report."}]}