{"article": [{"url": "https://www.marketwatch.com/story/the-coronavirus-is-devastating-us-hospitals-which-will-lose-200-billion-in-revenue-by-the-end-of-june-2020-06-11", "published": 1592568140.0, "headline": "The coronavirus is devastating U.S. hospitals, which will lose $200 billion in revenue by the end of June", "body": "As the deadly coronavirus takes U.S. lives, it’s also hurting hospitals. U.S. hospitals are predicted to lose more than $200 billion in revenue by June 30, according to a report by the American Hospital Association. The industry group estimates the total revenue hit from the pandemic at about $50 billion a month among health-care facilities since March. Hundreds face bankruptcy, industry experts say. “The worst is yet to come,” said Michael Topchik, executive director of The Chartis Center for Rural Health, a Chicago-based management-consulting firm. It found that 453 of the country’s 2,000 rural hospitals were in danger of closing and 216 were identified as “most vulnerable.” “It’s no exaggeration to say the sky is falling,” he said. “We’re already starting to see major hot spots in rural areas in Iowa, Nebraska and South Dakota. It doesn’t take a rocket scientist to see this is bad.” Rick Pollack, who heads the AHA and oversaw its study, said the virus has created an epic financial threat. “America’s hospitals and health systems have stepped up in heroic and unprecedented ways to meet the challenges caused by Covid-19,” he said. “However, the fight against this virus has created the greatest financial crisis in history for hospitals and health systems.”Pain at Mayo The famed Mayo Clinic, which runs 23 hospitals around the country, is among the troubled institutions. It expects to lose $3 billion in revenue in 2020 after governors in Arizona, Florida and Minnesota, where most of Mayo’s facilities are located, ordered all non-essential surgeries postponed in mid-March. Mayo announced in April extensive pay cuts and staff furloughs, despite its facilities having worked for weeks at or above capacity to handle critical cases related to the virus. Facilities in the country’s heartland are now dealing with some of the biggest outbreaks of the virus, and they’re hurting financially as well. One rural hospital in Kansas and another in West Virginia went out of business in May, and two more closed in Florida. Five are in danger of closing in Washington state, according to the state’s hospital association. The flow of red ink has left many operations scrambling to refinance debt, merge with other outfits or seek protection by declaring bankruptcy. “The $64,000 question is whether hospitals and their allies will convince the federal government to provide another injection of financial support to hospitals adversely affected by the pandemic,” said Jim Unland, president of Chicago-based Health Capital Group. “This is a nightmare.”Canceled elective surgeries Hospitals got clobbered by a mix of maladies. Surges of critically ill Covid-19 patients didn’t only overwhelm hospital emergency rooms, strain staff and deplete personal protective equipment. The outbreak also sapped their supply of drugs, forced them to pay inflated prices for basic supplies and decimated a primary revenue source, elective surgeries. Those procedures, scheduled operations such as joint replacements, tumor removals and cardiac surgeries, comprise an average of 48% of all hospital income, according to experts. Like the Mayo Clinic, hospitals in New York state have gone more than two months without elective surgeries following Gov. Andrew Cuomo’s statewide ban March 22 when he said, “If it’s not critical, then postpone it.” The result? Several New York medical centers are scrambling to make ends meet. The state’s teaching hospitals lost between $350 million and $450 million a month as they worked to flatten New York’s Covid-19 curve, pushing many to the brink of ruin. Many hospitals were unprepared to face the challenges of a worldwide pandemic. “The decision to eliminate elective surgeries and outpatient visits was the right decision in terms of protecting the safety of our patients and staff,” said Mayo’s chief administrative officer, Jeff Bolton. “But it has led to significant reductions in revenue.” The outbreak came at a particularly tough time for smaller facilities. More than 120 rural hospitals have closed in the past decade, including 18 in 2019 and 10 more this year through April, according to the University of North Carolina’s Cecil G. Sheps Center for Health Services Research. “Everyone in American hospitals is talking about this now,” said management expert Eugene Litvak, a Harvard professor and private consultant who has worked with hospitals on patient flow — the journey patients take from admission to discharge — for more than 20 years. “Canceling elective surgeries was the right thing to do to expand hospital capacity for the rush of Covid patients,” he said. But now, “almost all hospitals are bleeding red ink.” Unprepared medical systems Litvak said some health-care facilities might try to restart elective procedures before potentially having to scrap them again if additional outbreaks occur. “In many places the pandemic is waning, and hospitals may have a narrow window to reduce their backlog of elective surgeries, take care of those patients and strengthen their financial future for a second surge this fall,” he said. Litvak, founder of the nonprofit Institute for Healthcare Optimization in Newton, Mass., said most American hospitals did a poor job managing patient surges and staffing prior to the virus. “U.S. hospitals were experiencing a pandemic of inefficiency even before Covid,” he said. “And that crisis only highlighted existing vulnerabilities.” Mark Taylor is a freelance health-care reporter. This article is published in partnership with The Hatch Institute, a New York-based foundation for investigative reporting."}]}