{"article": [{"url": "https://www.marketwatch.com/story/i-cant-believe-this-is-america-confronted-with-unprecedented-need-new-york-food-pantries-try-to-fill-in-the-gaps-2020-08-06", "published": 1596727700.0, "headline": "â\u0080\u0098I canâ\u0080\u0099t believe this is America.â\u0080\u0099 Confronted with unprecedented need, New York food pantries try to fill in the gaps", "body": "The line for meals on a cloudy Thursday curves around the block.Â Standing 6 feet apart, most wearing masks, guests wait for chicken stew, a green salad, fresh fruit, a sandwich, orange juice, and some iced coffee. Stephen Fenwick, 57, has been coming to the Holy Apostles Soup Kitchen in Manhattanâ\u0080\u0099s Chelsea neighborhood for about four months. He had worked delivering food for apps such as DoorDash but started having tech problems with the apps on his phone around the time that New York City began to quarantine, and couldnâ\u0080\u0099t get help. He applied for unemployment, but says his case has been pending for months, and he has received no money.Â â\u0080\u009cIâ\u0080\u0099m not the only one. Thereâ\u0080\u0099s a lot of people out there with the same problem,â\u0080\u009d said Fenwick, who lives in Manhattan. Heâ\u0080\u0099s renting a room right now, and is able to get some odd jobs, but not too many. Fenwick said he is still in the process of applying for the Supplemental Nutrition Assistance Program (SNAP), a government food benefit. Holy Apostles, which serves meals five days a week, helps him save money for other expenses, like rent. Since coronavirus hit New York City in March, Holy Apostles Soup Kitchen and organizations that serve people who are food insecure have been tasked with tackling an unprecedented level of need, supplementing a government response that has also surged. Several food pantries and community organizations in New York City that MarketWatch spoke with reported astronomical increases in the amount of groceries or meals they served before the pandemic hit. Many struggled early on with an elderly volunteer workforce, and the new world wrought by coronavirus has, in some cases, significantly changed their service model. â\u0080\u009cEarly April, late March, we were just putting out fires,â\u0080\u009d said Matt Jozwiak, CEO and founder of Rethink Food NYC, a nonprofit. â\u0080\u009cCommunity organizations were closing left and right. But people were getting laid off and unemployment wasnâ\u0080\u0099t coming through...it was just a perfect storm.â\u0080\u009dÂ Before the pandemic, there were around 1.2 million people in New York City who faced food insecurity. The city estimates that number is now around 2.2 million, roughly 25% of the population, according to projections. Also see: New York City to set up COVID checkpoints at bridges and tunnels â\u0080\u009cSometimes the media is implying this is a brand-new crisis,â\u0080\u009d said Joel Berg, CEO of Hunger Free America, a nonprofit based in Manhattan working to end domestic hunger. â\u0080\u009cThatâ\u0080\u0099s missing the real story that we had a hunger crisis when things were going great. This has only made it worse.â\u0080\u009d In addition, more than 3.35 million people participated in SNAP in New York in April, a 26% increase year on year, according to the latest figures available from the U.S. Department of Agriculture.Â In many cases, government benefits donâ\u0080\u0099t cover all the needs of a family, in which case they will supplement with food pantries. Some feel social stigma about signing up for benefits, while others may earn too much money to qualify, but still canâ\u0080\u0099t meet their food needs. Benefits are also difficult to apply for, according to several hunger advocates.Â â\u0080\u009cItâ\u0080\u0099s more complex to apply to SNAP than it is to file your taxes in most cases,â\u0080\u009d Berg said. â\u0080\u009cThatâ\u0080\u0099s why groups like ours spend a lot of time helping people actually submit that application.â\u0080\u009dâ\u0080\u0098I canâ\u0080\u0099t believe this is Americaâ\u0080\u0099 Visitors to Holy Apostles Soup Kitchen used to sit down at tables inside the church and eat together. On March 13, for health safety reasons, the organization closed down indoor operations and moved to a grab-and-go model.Â Before the pandemic, they were giving out between 80 and 90 pantry bags a week, usually to help families over the weekend when schools and senior centers were closed. That number is now around 385 pantry bags. The number of hot meals they serve has remained relatively stable, at around 800 to 1,000 meals a day, with more served at the end of the month as people run out of government food benefits.Â Related: Older Americans are having trouble getting enough to eat â\u0080\u0094 and this was before COVID-19 The staff at Holy Apostles and food pantries across the city dread what will happen with the end of enhanced unemployment insurance. The extra money stopped in July, and politicians in Congress are currently at a standoff about how they will proceed. â\u0080\u009cYou take $600 away from a family or an individual, and take it away from their income. So what does that do to our food pantry system?â\u0080\u009d said Michael Ottley, the chief operating officer of Holy Apostles Soup Kitchen. On a recent day, across the street from the soup kitchen, a line of about 15 small carts marked the spots of people who had come hours early to wait for food pantry bags that would be handed out later in the afternoon.Â â\u0080\u009cI canâ\u0080\u0099t believe this is America,â\u0080\u009d Ottley said. â\u0080\u009cBut here we are.â\u0080\u009dThe cityâ\u0080\u0099s response to the food crisis New York City has made several moves to address surging food insecurity over the past few months. â\u0080\u009cWeâ\u0080\u0099ve faced an incredible crisis in New York City, with the number of food-insecure New Yorkers swelling from 1.2 million to over 2 million,â\u0080\u009d said Kathryn Garcia, also the commissioner of the Department of Sanitation, who in April Bill de Blasio appointed to be New Yorkâ\u0080\u0099s food czar, overseeing the cityâ\u0080\u0099s response to coronavirus emergency food distribution. â\u0080\u009cTo meet this need, weâ\u0080\u0099ve stood up a huge operation, quickly putting thousands of people to work distributing more than 100 million meals to New Yorkers in need,â\u0080\u009d Garcia said in a statement . â\u0080\u009cWe cannot and will not allow the crisis of this virus to become a crisis of hunger in New York City.â\u0080\u009d The mayorâ\u0080\u0099s office released a plan in AprilÂ announcing that they would spend $170 million over several months in an effort to feed New Yorkers. The city has created â\u0080\u009cgrab-and-goâ\u0080\u009d sites for free food at 400 to 500 locations operated by the Department of Education. People can pick up three meals a day, five days a week. It has also created a home-delivery program by employing around 23,000 taxi drivers to deliver roughly one million meals a day to homebound people, mostly seniors. In addition, it has partnered with FreshDirect, a grocery delivery service, to transport grocery boxes to different locations every week. Workers at Brooklyn Packers pack bags of fresh produce to be distributed to area food banks, community leaders and other places to serve New Yorkers in need of food. Getty Images As for food pantries, despite the tidal wave of food insecurity created by the coronavirus, their numbers have shrunk. The city estimates that before the pandemic, there were around 800 food pantries in New York City, but since, about a third has shuttered, usually because of a workforce made up of elderly high-risk volunteers. Before the coronavirus, City Harvest, a food rescue organization, worked with 317 locations that provided food for those in need. Initially during quarantine, around 130 food pantries they worked with closed down. Currently, 45 remain closed. City Harvest is now working with 307 sites because they have new partnerships for 31 emergency food relief locales.Â However, the number of people that they serve has never been higher. From March to June last year, City Harvestâ\u0080\u0099s mobile markets that distribute fresh fruits and vegetables served around 51,000 people. This year, during that same period, they served more than 100,000 people, according to Jenique Jones, senior director of program operations and policy at City Harvest.Â Read: New York metropolitan area lost nearly 1.5 million jobs in June, the most of any U.S. city â\u0080\u009cSome of this is COVID, definitely, but I also think that there are a lot of people who probably needed support prior, who were just hanging on,â\u0080\u009d Jones said. â\u0080\u009cThey had jobs that allowed them to just scrape by. And then when those jobs were gone, they couldnâ\u0080\u0099t even do that.â\u0080\u009dÂ How food groups adjusted to a COVID-19 world Some food insecurity organizations have dramatically changed the way they operate because of coronavirus.Â Before the pandemic, Rethink Food NYC would collect excess food from restaurants and cafeterias, cook it, and cater free meals to community organizations. But after the coronavirus hit, corporate cafeterias closed down and the restaurant industry was severely curtailed.Â Rethink pivoted to contracting with restaurants, where existing employees make food that is delivered through food pantries or community organizations to those in need. Rethink is now working with around 26 restaurants, according to CEO and founder Jozwiak, who says their model allows money to stay in communities, as restaurants can keep staff members employed as they provide meals. Rethink has contracts with fine-dining restaurants, but Jozwiak said the majority are smaller businesses in the city. â\u0080\u009cThe approach now is, OK, letâ\u0080\u0099s build a network of restaurants, of 30 to 100 restaurants that are in these neighborhoods,â\u0080\u009d Jozwiak said. The organization originally had a $1.6 million budget for 2020. They have spent $3.2 million in 2020, and have raised more than $3 million since the coronavirus hit. So far this year, Rethink has raised more than 300% of their annual budget from last year, receiving money from the city, and engaging with some larger donors, according to Jozwiak. The Holy Apostles Soup Kitchen was able to meet the huge increase in need due to corporate and community partners, as well as a major fundraising effort.Â They have raised roughly $2.75 million so far this year from a variety of sources, including individuals, companies, nonprofits, and the government. This is around $2 million more than what they had raised this time last year. However, soup kitchen officials say, they must raise more to continue to provide through the winter.Â City Harvest did not provide specific fundraising numbers, but said that they were able to keep food donations flowing in part because of their partnership with the Feeding America network, a hunger relief organization which gives them access to food sources nationwide, as well as existing relationships with food donors. They are also part of government initiatives like the federal Coronavirus Food Assistance Program, and Nourish NY, a New York state program that connects food banks with state agriculture products.Â A long-term crisis There is awareness among food pantries and those who work in the food insecurity space that this is not a short-term spike in need.Â â\u0080\u009cUsually in a disaster like a hurricane, thereâ\u0080\u0099s sort of an immediate response that gets everybody safe and sound and secure, and then you begin the long term recovery,â\u0080\u009d said Gary Bagley, the executive director of New York Cares, a volunteer organization. â\u0080\u009cBut thereâ\u0080\u0099s this question of â\u0080\u0098Are we still in an immediate response, or are we in the longer-term recovery? Or did this just turn into long-term recovery the very first day?â\u0080\u0099â\u0080\u009d For food-insecure Americans, the future is more uncertain than ever.Â Coronavirus update: Global death toll tops 700,000 with 18.5 million confirmed cases and U.S. accounts for more than a quarter The HEROES Act, passed by the U.S. House of Representatives, would provide additional SNAP benefits, and extend the Pandemic EBT program. However, it is stalled in the Republican-held Senate.Â â\u0080\u009cThis is a true crisis now, and the worst hunger crisis in modern American history,â\u0080\u009d Berg said. â\u0080\u009cWhat weâ\u0080\u0099re all really looking at is if the Senate really balks at expanding unemployment benefits and really balks at providing another stimulus check and really balks and expanding P-EBT (Pandemic Electronic Benefit Transfer)...when that stuff runs out in August or September, you ainâ\u0080\u0099t seen nothing yet in terms of societal collapse and hunger.â\u0080\u009d This story was updated to reflect the number of City Harvestâ\u0080\u0099s new partnerships for emergency food relief locales."}]}