{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-spike-in-the-dog-days-of-summer-sap-economy-of-momentum-2020-07-11", "published": 1594642460.0, "headline": "Coronavirus spike in the dog days of summer saps economy of momentum", "body": "Summer doldrums are taking on a whole new meaning during the coronavirus pandemic. The momentum in the U.S. economy in May and June appears to have melted away. It’s not the July heat that’s at fault, of course. It’s a wave of new outbreaks of COVID-19 across the country that has forced some states to reimpose economic restrictions and others to pause further business reopenings. Thirty-eight U.S. states have seen a rise in cases in the past 14 days. Harvard Global Health Institute researchers have developed a national tracker to trace the severity of the outbreak on a state-by-state basis, and it’s flashing red for Arizona, Florida, Louisiana, South Carolina and Georgia, with 25 cases per 100,000 people. The loss of momentum in the recovery is evident in key segments of the economy such as retail and dining out. Some businesses in California, Texas and elsewhere have been ordered to scale back operations again. At the same time, fear of catching the virus has made Americans more reluctant to venture out. Two companies that track how many workers punch digital time clocks or time-tracking apps, Homebase and Kronos, indicate the number of shifts worked began to flatten out at the end of June and declined in the first week of July. See: MarketWatch Coronavirus Recovery Tracker Some of the decline in shifts worked is clearly the result of the July 4 holiday, but the spike in coronavirus cases has also played a role. “Rising COVID-19 cases, particularly across the Midwest and Southeast, present a new challenge for businesses trying to reopen and stay open,” said David Gilbertson, vice president of HCM strategy and operations at Kronos. Another worrisome sign is an explosion in the number of people applying for unemployment benefits under an emergency-federal relief program. These claims have surged 53% in the past month to nearly 14.5 million, nearly equaling the 16.8 million people collecting benefits through the traditional state-run unemployment compensation system. Read: Soaring demand for federal jobless benefits points to fresh fissures in the economy And: Jobless claims tell us 32.9 million people are unemployed, but is it really that bad Workers who file under the federal program include the self-employed such as doctors, writers, Uber UBER, -0.18% drivers and other “gig” economy workers who would not have been eligible for jobless benefits in the past. Read: Wholesale prices drop in June — inflation very low due to the coronavirus pandemic The increase indicates the latest economic troubles are “hitting non-traditional workers harder than those in regular payroll jobs,” said Ian Shepherdson, chief economist of Pantheon Economics. Whatever the case, the economic recovery can’t sustain its recent momentum if more than 30 million people are out of work and collecting unemployment benefits. The expiration of a $600 a week unemployment bonus at the end of July will add to the problems: A divided Congress is unlikely to extend the bonus. Read:Goodbye, extra $600: Jobless benefits won’t exceed former wages in next relief bill Investors on Wall Street, already nervous about the coronavirus spike, will look for further clues on whether the economy is slowing in reports this week on retail sales in June and consumer sentiment in July. See: MarketWatch Economic Calendar Economists predict retail sales rose by more than 5% in June following a nearly 18% rebound in May. Sales probably were OK in June because states didn’t began to reimpose restrictions until later in the month. Yet if retail sales disappoint, the reaction on Wall Street may well be negative. What will probably be more telling is the preliminary look at consumer sentiment in early July. There are signs Americans have reduced travel, avoided restaurants, and taken more precautions with the virus running amok again in many states. While there’s many reasons to be worried about the economy, states in the Northeast such as New York continue to reopen businesses. And even the states that have tightened restrictions again have done so in a more limited way than they did in the early stages of the lockdown when much of the economy was closed."}]}