{"article": [{"url": "https://www.marketwatch.com/story/rolls-royce-climbs-as-aviation-stocks-rally-in-london-11601989390", "published": 1601975480.0, "headline": "Rolls-Royce climbs as aviation stocks rally in London", "body": "In this file photo taken on July 04, 2013 a reflection of a Rolls Royce Trent 1000 turbofan engine is seen at an event to mark the arrival of a British Airways Airbus A380 at Heathrow Airport in London. justin tallis/Agence France-Presse/Getty Images The hard-hit aviation sector was in demand on the London Stock Exchange on Tuesday, as investors rotated into the losers and out of the winners of the year. Rolls-Royce RR, +14.25% shares jumped 12%, a day after the company announced a £1 billion ($1.3 billion) convertible bond offering. It also won a contract in India to use its engines to power a gas-based power plant. Rolls-Royce stock has nonetheless lost 81% this year. “Investors seem heartened that this could be the start of a long slow turnaround for Rolls-Royce, given the devastating impact the collapse in international travel had on its core aircraft engine manufacturing business,” said Susannah Streeter, senior investment and markets analyst at Hargreaves Lansdown. Other travel-related stocks advancing including TUI TUI, -0.92%, which rose 8%, International Airlines Group IAG, -3.72%, which gained 6%, and easyJet EZJ, -4.22%, which rallied 6%. The FTSE 100 UKX, +0.64% overall edged up 0.4%, as gains for oil giants Royal Dutch Shell RDSA, +1.90% and BP BP, -0.74% helped offset losses for Ocado Group OCDO, -3.17%, which slumped 5%, and Rentokil Initial RTO, +2.07%, which fell 3% after Goldman Sachs downgraded the company to neutral from buy. “While the company should also benefit from increased demand for its hygiene/deep cleaning services, which performed strongly in the second quarter, at 30x 2021E P/E (on our above Reuters consensus estimates), we believe this is broadly in the price,” the analysts said of Rentokil, as part of a broader look into the business services sector in Europe. Elsewhere, Watches of Switzerland WOSG, +0.36% surged 20% as the retailer hiked its annual sales and margin guidance, after better-than-expected 18% sales growth in the first 10 weeks of its fiscal second quarter."}]}