{"article": [{"url": "https://www.marketwatch.com/story/nasdaq-futures-down-sharply-after-last-weeks-tech-rout-2020-09-08", "published": 1599584540.0, "headline": "Dow closes down 632 points, as tech rout leaves Nasdaq in correction territory", "body": "U.S. stock indexes finished lower for a third day on Tuesday, slumping to a four week low, led by technology stocks which had driven the five month rally, as the Nasdaq Composite booked its quickest plunge ever from a record close to correction territory. While investors worried about valuations at their highest levels in more than a decade, remarks by President Donald Trump on Monday, threatening to “decouple” the U.S. economy from China added to market jitters, analysts said.How did major indexes fare? The Dow Jones Industrial Average DJIA, +0.56% dropped 632.42 points, or 2.3%, to finish at 27,500.89, while the S&P 500 SPX, +0.87% gave up 95.12 points, or 2.8%, to end at 3,331.84 The Nasdaq Composite COMP, +1.39% skid 465.44 points, or 4.1%, to close in correction territory at 10,847.69, after plunging 10% in the three sessions from its 12,056.44 record close on Sept. 2. The tech-heavy Nasdaq Composite dropped 3.3% last week to end Friday at 11,313.13, its biggest weekly decline since March. The Dow Jones Industrial Average lost 1.8% last week, ending at 28,133.31, while the S&P 500 dropped 2.3% to 3,426.96 — the biggest weekly falls for those indexes since June. To qualify for correction territory, shares must end at least 10% lower from their prior closing high, which the Nasdaq accomplished on Tuesday after only three trading sessions, its quickest correction on record, according to Dow Jones Market Data. What drove the market? High valuations especially for technology companies, a sluggish economic recovery in the wake of the coronavirus pandemic, geopolitical risks including U.S. - China tensions, and the upcoming November elections all pose risks for investors, though the Nasdaq bore the brunt Tuesday, slumping 10% in three days, to register its fastest correction ever. Read:Tech-stock rout stirs memories of 1999-2000, but here’s what’s different The reversal for the Nasdaq, which had previously soared to a series of all-time highs, was led by falls for its highest-flying components, including Apple Inc. AAPL, +1.74%, Facebook Inc. FB, +0.26%, Microsoft Corp. MSFT, +2.48% and Amazon.com Inc. AMZN, +3.01% and Google parent Alphabet Inc. GOOG, +1.97% GOOGL, +1.82% as worries grew that the momentum-led gains for the sector had finally pushed valuations too far to be sustained. One thing to watch will be if major U.S. equity indexes can manage to rally without the tech giants, given their bulkier footprint in a stay-at-home, pandemic world, said Clifton Hill, a portfolio manager for Acadian Asset Management’s multi-asset class strategies group, in an interview with MarketWatch. Hill also said he’ll be watching to see whether money fleeing tech stocks rotates into “value equities and others that had not done as well,” while also monitoring developments on the “Nasdaq whale” front, after the Financial Times unmasked SoftBank on Friday as having amassed billions worth of equity derivatives in recent months that helped fuel the sharp ascent for big tech stocks. See:The Nasdaq just marked the fastest 10% plunge in history–again Senate Majority Leader Mitch McConnell said Tuesday that the Senate plans to vote on pared-down Republican coronavirus relief package this week, but looks unlikely to pass into law as Democrats fight for more aid. Remarks by Trump in a Labor Day news conference also left stocks under pressure, analysts said. “We will make America into the manufacturing superpower of the world and we’ll end reliance on China once and for all, whether it’s decoupling or putting in massive tariffs like I’ve been doing already. We’re going to end our reliance on China, because we can’t rely on China,” Trump said. “Decoupling implies that only domestic companies can serve domestic customers,” Mark Haefele, chief investment officer at UBS Global Wealth Management, wrote in a note Tuesday. But his team also outlined several reasons why the post-COVID-19 world already was poised “to be less global and more digital” anyway, as production is brought closer to home and driven to adopt more technology and automation in the process. Meanwhile, China on Tuesday said it would launch an initiative of its own to set global standards on data security, a move seen as an attempt to counter U.S. efforts to isolate their networks from Chinese technology. In coronavirus pandemic news, a group of nine drug company chief executives said that they have signed a pledge to make the safety and well-being of vaccinated individuals the priority in developing the first COVID-19 vaccine. Related: There are seven coronavirus vaccine candidates being tested in the U.S. — here’s where they stand Fresh data also showed U.S. consumer borrowing rose again in July, for the second month in a row, after households tightened their belts in March and socked away more savings at the onset of the pandemic in the U.S., according to Federal Reserve data. Which companies were in focus? Airliner shares were a bright spot amid a sea of red Tuesday, after data showed an uptick in Labor Day travel, giving a boost to shares of JetBlue Airways Corp JBLU, -0.07%, Southwest Airlines Corp LUV, +1.89%, Alaska Air Group Inc ALK, +0.15%, American Airlines Group Inc. AAL, +0.34% and Delta Air Lines Inc DAL, +0.39% Shares of Tesla Inc. TSLA, +1.89% fell 21.1%, a record one-day decline, after a rebalancing of the S&P 500 by S&P Dow Jones Indices on Friday unexpectedly left the electric-vehicle maker out of the U.S. stock-market benchmark. The rebalancing saw Catalent Inc. CTLT, +1.90%, Etsy Inc. ETSY, +5.11% and Teradyne Inc. TER, +4.38% added to the index. Shares of Nikola Corp. NKLA, -1.36% soared 40.8% after the alternative-fuel vehicle maker and General Motors Co. announced they had entered a strategic partnership that would start with the Nikola Badger, the company’s planned fully-electric and hydrogen-fuel cell electric pickup truck, and include cost reductions for other models. GM shares rose 7.9%. Shares of Boeing Co. BA, -0.39% fell 5.8% after the Wall Street Journal reported that production problems at a 787 Dreamliner factory prompted air-safety regulators to review quality-control lapses that could stretch back almost a decade. Peloton Interactive Inc. shares PTON, +6.97% advanced 6.2% after the company said it had lowered the price of its original exercise bike Monday while introducing a premium option and rolling out a new lower-priced treadmill. Roku Inc. ROKU, +0.04% shares rose 1.7% after Wells Fargo analyst Steven Cahall began coverage of the stock with an overweight rating, an $215 price target and called the company an “advertising heavyweight in the making.” Chip-equipment stocks Applied Materials Inc. AMAT, +1.10%, KLA Corp. KLAC, +2.10% and Lam Research Corp. LRCX, +2.04% each fell more than 8% Tuesday amid reports that the U.S. is considering putting export restrictions on Chinese chipmaker Semiconductor Manufacturing International Corp. JPMorgan Chase & Co. JPM, -0.57% shares fell 3.5%, after the banks said it found evidence of employees and customers misusing the government’s flood of stimulus funds this spring and is cooperating with authorities. How did other markets trade? The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% TMUBMUSD10Y, 0.777% fell 3.8 basis points to 0.682% as investors prepared for a heavy week of supply. Bond prices move inversely to yields. The ICE U.S. Dollar Index DXY, -0.58%, which tracks the performance of the greenback against its major rivals, was up 0.8%. Gold futures GCZ20, +2.17% gained 0.5% to settle at $1,943.20 an ounce. U.S. crude oil benchmark futures CL.1, -1.62% fell sharply, finishing more than 7.6% lower, while global benchmark Brent crude BRN.1, -0.07% traded below $40 a barrel for the first time since June on continued worries over the outlook for demand. The Stoxx Europe 600 index SXXP, +0.55% closed 1.2% lower, losing steam as U.S. equities fell, while the U.K.’s benchmark FTSE UKX, +0.64% shed 0.1%. In Asia, Hong Kong’s Hang Seng Index HSI, -0.30% rose 0.1%, while Japan’s Nikkei NIK, -0.11% rose 0.8%."}]}