{"article": [{"url": "https://www.marketwatch.com/story/slack-microsoft-zoom-are-upping-the-ante-in-virtual-meeting-wars-2020-07-08", "published": 1594226600.0, "headline": "Slack, Microsoft, Zoom are upping the ante in virtual meeting wars", "body": "There is a virtual gold rush among the biggest players in the virtual-meeting workspace. A flurry of activity by Slack Technologies Inc. WORK, +3.36% , Microsoft Corp. MSFT, +2.48% , and Zoom Video Communications Inc. ZM, +2.89% on Wednesday and Tuesday underscores the aggressive actions they’re willing to take to capitalize on tech’s hottest market: The forced migration of millions of employees to work from home accelerated what was already a fledgling business. In short order, Slack made a rare acquisition, Microsoft Teams dressed up its Teams platform, and Zoom is diving into the hardware business. Read more: Slack acquires business directory provider Rimeto for undisclosed sum Each company is looking for an edge in a market expected to be worth more than $50 billion by 2026, according to new research from Global Market Insights. Slack started the day with just the sixth acquisition in its 11-year history. For an undisclosed sum, it snapped up Rimeto, a maker of enterprise-directory software to offer a “searchable directory, automatically integrating information from across your company to deliver rich profiles of every employee, their skills, experience, and current projects.” Rimeto will run as a stand-alone app, extending Slack’s horizontal strategy. Expect more, much more, Slack Chief Executive Stewart Butterfield told MarketWatch. He said Slack, flush with cash after raising $1.4 billion, is likely to step up purchases of startups. The news sent Slack shares soaring 8% in trading Wednesday. Several hours later, Microsoft — which has added customers by the millions in an unrelenting digital land grab — unveiled new features to Teams, including a Together mode that puts all participants in a single virtual environment. The mode displays images of the user and up to 49 other participants in a videoconference against the same backdrop, ranging from a coffee bar for a couple people to an auditorium for larger gatherings. “Together mode makes meetings more engaging by helping you focus on other people’s faces and body language and making it easier to pick up on the nonverbal cues that are so important to human interaction,” Microsoft said in a statement. Several customers, including Levi Strauss & Co. LEVI, -2.24% , Stony Brook University, and the University of Texas-Arlington, have been testing Together, a Microsoft spokesperson told MarketWatch. Microsoft’s stock lifted 2% on its Teams announcement. On Tuesday, Zoom said it is partnering with hardware manufacturers DTEN, Neat, Poly, and Yealink to streamline its video communication services. Zoom, whose wild popularity during the coronavirus pandemic has turned its name into a verb, has seen its stock rise 291% this year. See also: Zoom offering hardware-as-a-service option"}]}