{"article": [{"url": "https://www.marketwatch.com/story/these-are-the-years-best-pickup-trucks-2020-08-18", "published": 1597727540.0, "headline": "These are the year's best pickup trucks", "body": "Year after year, sales data tells us that we Americans really love our pickup trucks. They're big, strong and capable, and they've gotten so nice that they've become strong choices as family vehicles with their roomy, comfortable interiors. Whether you're shopping for a family car that's more rugged than a minivan or if you're looking to get some serious work done, there's a pickup truck out there for you. Look past the usual suspects, and you might find something that's both capable and affordable. Here are the best full-size trucks for 2020, ranked. 1. Ram 1500- $28,200 Score: 4.5 / 5 The Ram 1500 Ram The 2020 Ram 1500 tops our list because it does everything well, and there's almost nothing bad we can say about it. The Ram is a great value in lower trims, extremely luxurious in the top trims and it loves to play in the mud in the off-road-ready Rebel variant. The torquey and efficient EcoDiesel V6 engine returns for 2020, and it's available on every trim. The exterior is stylish, the interior is comfortable and it has one of the most efficient gas engines in this class in the form of the base V6 with the eTorque mild hybrid system. No matter which engine, cabin or trim you go with, there's no such thing as a bad 2020 Ram 1500. See: Why this is a great time to buy a pickup truck2. Ford F-150- $28,745 Score: 4.4 / 5 The Ford F150 Ford The 2020 Ford F-150 is a perennial bestseller in full-size trucks for good reasons. The F-150 offers rock-solid reliability, a range of outstanding engine options with muscular capabilities and modern, user-friendly technology. This Ford F, -1.36%   truck is comfortable and roomy enough to use as a family vehicle, but capable enough to get tough jobs done. For 2020, there is expanded engine availability on the lower trims, and a 10-speed automatic transmission is now standard with every engine. If you're looking for a high-performance off-road pickup truck, the F-150 Raptor is simply unmatched. Also read: The all-new Ford Bronco still has its off-road chops, but with plenty of creature comforts3. GMC Sierra 1500- $29,600 Score: 4.3 / 5 The GMC Sierra. GMC In the past, the Silverado and Sierra have been very similar. For 2020, the two trucks are finally distinct with unique features and styling details. The 2020 GMC Sierra 1500 is the mechanical twin of the Chevy Silverado, but we give it a slight edge over its corporate cousin because we love the optional MultiPro tailgate that can only be had on the Sierra. This trick tailgate folds in six different ways and can turn into steps, load stops and even a little desk. The Sierra delivers a plush ride, a spacious interior and user-friendly technology. We love the variety in the Sierra model range, which includes the rugged AT4 trim, the luxurious Denali model and more. 4. Chevrolet Silverado 1500- $28,300 Score: 4.3 / 5 The Chevy Silverado 1500 Chevrolet The 2020 Chevrolet Silverado 1500 is still fresh off its 2019 redesign and has learned a few new tricks for 2020. There's a new, super-efficient turbodiesel engine option, a new 10-speed automatic transmission available with the 5.3-liter V-8 engine, wider availability of the brawny 6.2-liter V8 and some new optional features, including adaptive cruise control and a towing camera. This Chevy boasts best-in-class towing capacity, balanced handling and a spacious cabin, especially in the crew cab configuration. Check out: A first look at Toyota's new RAV4 plug-in hybrid5. Nissan Titan- $30,690 Score: 4 / 5 The Nissan Titan Nissan Our score for the 2020 Nissan NSANY, -1.50%  Titan is slightly improved over the 2019 model because of some new improvements to the truck that make it more competitive with the heavy-hitters in this segment. The 2020 updates for the Titan include a standard 9-speed automatic transmission, a little more power from the standard V-8 engine, a refreshed aesthetic, an updated infotainment system and more standard driver-assist technologies. If you're looking for a V8-powered full-size truck that won't break the bank, the Titan is a solid value-conscious alternative to its American rivals.6. Toyota Tundra- $33,575 Score: 3.7 / 5 The 2020 Toyota Tundra gets some nice updates this year, but they're not enough to keep this truck out of the bottom of our rankings. A few of those updates include a newly standard 5.7-liter V-8 engine and infotainment updates like standard Android Auto, Apple AAPL, +1.74%  CarPlay, Amazon AMZN, +3.01%  Alexa and an optional 8-in touchscreen. However, the Tundra hasn't received a full redesign since 2014, and it's showing its age. Fuel economy, an outdated cabin and an uncomfortable ride hold it back from really being competitive with the best full-size trucks. Also see: These 3 EVs are the lowest cost to own over 5 years This story originally ran on Autotrader.com."}]}