{"article": [{"url": "https://www.marketwatch.com/story/trump-wears-mask-in-public-for-first-time-during-pandemic-2020-07-11", "published": 1594495700.0, "headline": "Trump wears mask in public for first time during pandemic", "body": "President Donald Trump wore a mask during a visit to a military hospital on Saturday, the first time the president has been seen in public with the type of facial covering recommended by health officials as a precaution against spreading or becoming infected by the coronavirus. Trump flew by helicopter to Walter Reed National Military Medical Center in suburban Washington to meet wounded service members and health care providers caring for COVID-19 patients. As he left the White House, he told reporters: “When you’re in a hospital, especially ... I think it’s expected to wear a mask.” Trump was wearing a mask in Walter Reed’s hallway as he began his visit. He was not wearing one when he stepped off the helicopter at the facility. The president was a latecomer to wearing a mask during the pandemic, which has raged across the U.S. since March and infected more than 3.2 million and killed at least 134,000. Most prominent Republicans, including Vice President Mike Pence, endorsed wearing masks as the coronavirus pandemic gained ground this summer. Trump, however, has declined to wear a mask at news conferences, coronavirus task force updates, rallies and other public events. People close to him have told The Associated Press that the president feared a mask would make him look weak and was concerned that it shifted focus to the public health crisis rather than the economic recovery. They spoke on condition of anonymity to describe private matters. While not wearing one himself, Trump has sent mixed signals about masks, acknowledging that they would be appropriate if worn in an indoor setting where people were close together. But he has accused reporters of wearing them to be politically correct and has retweeted messages making fun of Democrat Joe Biden for wearing a mask and implying that Biden looks weak. The wearing of masks became another political dividing line, with Republicans more resistant to wearing them than Democrats. Few masks were seen at recent Trump campaign events in Tulsa, Oklahoma, Phoenix and South Dakota’s Mount Rushmore. The only time Trump has been known to wear a mask was during a private part of a tour of a Ford plant in Michigan. On its website, Walter Reed carries this recommendation: “Whenever you’re out in public, like at your local grocery store or pharmacy, where it’s difficult to maintain 6 feet of social distance, you should wear a cloth face covering.” The facility also notes that the Centers for Disease Control and Prevention recommends wearing cloth face coverings to slow the spread of the coronavirus.” See also: Coronavirus update: Global case tally hits 12.5 million with U.S. accounting for a quarter as death toll starts to rise again"}]}