{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-nudge-higher-after-worst-drubbing-in-three-months-amid-second-wave-concerns-11600760250", "published": 1600753220.0, "headline": "European stocks rise after worst drubbing in three months amid second COVID-19 wave concerns", "body": "People enjoy a drink outside a pub in Camden in central London on September 13, 2020. justin tallis/Agence France-Presse/Getty Images European stocks edged higher on Tuesday after their worst one-day performance in more than three months, as the Continent faces tighter economic restrictions due to rising cases of coronavirus. After a 3.2% nosedive on Monday, the Stoxx Europe 600 SXXP, +0.55% rose 0.7%. The U.K. FTSE 100 UKX, +0.64%, German DAX DAX, +0.06% and French CAC 40 PX1, +0.71% each advanced. Following a 509-point decline for the Dow Jones Industrial Average DJIA, +0.56%, U.S. stock futures ES00, +1.13% inched up. Federal Reserve Chairman Jerome Powell will appear with U.S. Treasury Sec. Steven Mnuchin in front of a House committee to discuss the largely unspent credit facilities, though he may address other topics. In prepared remarks, Powell said activity has picked up from its depressed second-quarter level, when much of the economy was shut down, but the path forward will “come only when people are confident that it is safe to reengage in a broad range of activities.” Sweden’s Riksbank held interest rates at zero and said it would continue asset purchases. Several European countries, including France, Spain and the U.K., are grappling with rising coronavirus numbers. U.K. Prime Minister Boris Johnson is expected to order pubs in England to shut by 10 p.m. and, in a reversal from the summer, encourage working from home. “We project a modest temporary setback in response to more modest, better targeted and often regional restrictions,” said Holger Schmieding, chief economist at Berenberg Bank, of Europe generally. “Many such measures will hit parts of consumer spending (mostly services such as leisure, entertainment, tourism…) disproportionally. We expect these measures to temporarily dampen but not derail the overall economic rebound.” Whitbread WTB, +2.25%, the Premier Inn owner, fell 4% as it said it would cut up to 6,000 jobs, or 18% of its workforce. Second-quarter ending Aug. 27 like-for-like sales slumped 75%. U.K. insurers including Direct Line Insurance DLG, -1.17%, Hiscox HSX, +0.09% and RSA Insurance RSA, -0.66% dropped after the Financial Conduct Authority proposed that when a customer renews their home or motor insurance policy, they pay no more than they would if they were new to their provider through the same sales channel, stamping out a practice called “price walking.” Beazley BEZ, -0.06%, a specialty insurer, tumbled after saying COVID-19 claims are going to be double its previous expectation, at $340 million net of reinsurance. Grenke GLJ, +1.02%, the German leasing company, bounced 12% higher. The stock is still down roughly 37% from when accounting irregularities were alleged by a short seller. The company has denied any impropriety and ordered a special audit. Kingfisher KGF, +1.42%, the owner of home-improvement chains, rose after reporting its first-half ending July 31 pretax profit rose to £398 million from £245 million, and that third-quarter like-for-like sales jumped 17%."}]}