{"article": [{"url": "https://www.marketwatch.com/story/the-intense-2020-atlantic-hurricane-season-used-up-all-the-storm-names-for-only-the-second-time-since-1950-2020-09-19", "published": 1600533380.0, "headline": "The intense 2020 Atlantic hurricane season used up all the storm names for only the second time since 1950", "body": "Here’s how active this year’s Atlantic hurricane season has been: When Tropical Storm Wilfred formed on Sept. 18, the National Hurricane Center exhausted its list of storm names for only the second time since naming began in 1950. Within hours, two more storm had formed — now known as Alpha and Beta. Even more surprising is that we reached the 23rd tropical storm of the year, Beta, more than a month earlier than in 2005, the only other year on record with so many named storms. The 2020 Atlantic hurricane season is far from over. With the new storms, forecasters shifted from the alphabetical list of people’s names to letters of the Greek alphabet. The 2005 season had six Greek-letter storms, ending with Zeta. So, why is the Atlantic so active this year? Meteorologists like myself have been following a few important differences, including many tropical storms forming closer to the U.S. coast.What’s causing so many tropical cyclones? When a disturbance – a large blob of convective clouds, or thunderstorms – exists over the Atlantic Ocean, certain atmospheric conditions will help it grow into a tropical cyclone. Warm water and lots of moisture help disturbances gain strength. Low vertical wind shear, meaning the wind speeds and directions don’t change much as you get higher in the atmosphere, is important since this shear can prevent convection from growing. And instability enables parcels of air to rise upward and keep going to build thunderstorms. This year, sea surface temperatures have been above average across much of the Atlantic Ocean and wind shear has been below average. That means it’s been more conducive than usual to the formation of tropical cyclones. La Niña probably also has something to do with it. La Niña is El Niño’s opposite – it happens when sea surface temperatures in the eastern and central Pacific are below average. That cooling affects weather patterns across the U.S. and elsewhere, including weakening wind shear in the Atlantic basin. NOAA determined in early September that we had entered a La Niña climate pattern. That pattern has been building up for weeks, so these trending conditions could have contributed to how favorable the Atlantic has been to tropical cyclones this year.An unusual twist off the U.S. coast Four hurricanes have hit the U.S. coast this year – Hanna, Isaias, Laura and Sally, which is more than usual by this point in the hurricane season. But we also have observed many short-lived tropical storms that had less impact. When a tropical cyclone develops from a disturbance that forms over Africa, it has a lot of ocean ahead of it with room to get organized and gain strength. But this year, many storms have formed farther north, closer to the U.S. coast. Most came from disturbances that didn’t look too promising – until they moved over the Gulf Stream. The Gulf Stream is a large ocean current that carries warm water from the Gulf of Mexico, up the East Coast and into the North Atlantic. Tropical cyclones typically need sea surface temperatures over 80 degrees Fahrenheit to form, and the warm water along the Gulf Stream can help disturbances spin up into tropical cyclones. Because these tropical storms were already fairly far north, however, they didn’t have much time to gain strength. Meteorologists haven’t yet studied why so many storms formed this way this season, but it’s possible that it’s due to both warmer-than-normal Atlantic Ocean waters and the position of the Gulf Stream.2020’s Atlantic tropical storms are breaking records Lots of firsts as the season breaks records One of the biggest surprises this year has been how consistently we have been breaking records for earliest named storm for their rank. For example, Edouard became the earliest fifth named storm on July 6, beating 2005’s Emily by a week. Fay was the earliest sixth named storm, showing up almost two weeks earlier than Franklin did in 2005. Wilfred was the earliest to run out the list of designated storm names. In 2005, Hurricane Wilma formed on Oct. 17, but it ended up being the year’s 22nd named storm chronologically, not the 21st like Wilfred, because an unnamed subtropical storm formed on Oct. 4. The National Hurricane Center discovered this unnamed storm during a post-season analysis. In all, the 2005 season had 28 qualifying storms. The list of Atlantic tropical cyclone names skips letters where easy-to-distinguish names are harder to find, like Q and Z, then moves to the Greek alphabet. Could we run out of Greek letters before hurricane season ends on Nov. 30? I don’t think anyone’s ready to consider that. Kimberly Wood is an assistant professor of meteorology at Mississippi State University. This article was published with the permission of The Conversation."}]}