{"article": [{"url": "https://www.marketwatch.com/story/watch-rand-paul-boils-dr-faucis-coronavirus-response-down-to-we-cant-do-this-we-cant-do-that-2020-06-30", "published": 1593529280.0, "headline": "WATCH: Rand Paul boils Dr. Fauciâ\u0080\u0099s coronavirus response down to â\u0080\u0098we canâ\u0080\u0099t do this, we canâ\u0080\u0099t do thatâ\u0080\u0099", "body": "A Senate hearing over the nationâ\u0080\u0099s coronavirus response got pretty heated on Tuesday, with Sen. Rand Paul questioning whether the countryâ\u0080\u0099s top infectious disease experts have been doing more harm than good during the pandemic. â\u0080\u009cIt is a fatal conceit to believe any one person or small group of people has the knowledge necessary to direct an economy or dictate public health behavior,â\u0080\u009d the Republican and libertarian from Kentucky said during the Senate Health, Education, Labor and Pensions Committee hearing. â\u0080\u009cWe shouldnâ\u0080\u0099t presume that a group of experts somehow knows whatâ\u0080\u0099s best for everyone.â\u0080\u009d His argument was that health experts and government â\u0080\u009cplannersâ\u0080\u009d are weighing in on subjects and expressing opinions that affect everyday public life before getting all of their facts straight. â\u0080\u009cItâ\u0080\u0099s important to realize that if society meekly submits to an expert and that expert is wrong, a great deal of harm may occur when we allow one manâ\u0080\u0099s policy or one group of small men and women to be foisted on an entire nation,â\u0080\u009d he said. And Paul, who tested positive for the coronavirus in March, when he drew flak for not quarantining while he was awaiting his test results, directed some of his sharpest rebukes toward Anthony Fauci on Tuesday. â\u0080\u009cDr. Fauci, every day, virtually every day, we seem to hear from you things we canâ\u0080\u0099t do,â\u0080\u009d he said. â\u0080\u009cBut when youâ\u0080\u0099re asked, â\u0080\u0098Can we go back to school?â\u0080\u0099 I donâ\u0080\u0099t hear much certitude at all. â\u0080\u0098Well, maybe. It depends.â\u0080\u0099â\u0080\u009d “ â\u0080\u009cAll I hear, Dr. Fauci, is, â\u0080\u0098We canâ\u0080\u0099t do this, we canâ\u0080\u0099t do that. We canâ\u0080\u0099t play baseball.â\u0080\u0099 Well, even thatâ\u0080\u0099s not based on the science.â\u0080\u009d ” â\u0080\u0094 Sen. Rand Paul â\u0080\u009cWe just need more optimism,â\u0080\u009d Paul said. Fauci, the director of the National Institute of Allergy and Infectious Diseases, responded by noting he agrees with a lot of what Paul said, particularly with regards to people sharing opinions not backed by scientific data. He also said that â\u0080\u009cwe need to do whatever we can to get the children back in school.â\u0080\u009d But, Fauci continued, â\u0080\u009cSometimes you have to make extrapolations because youâ\u0080\u0099re in a position where you need to give some sort of recommendation.â\u0080\u009d And he noted that his recommendations are often interpreted in ways that he did not intend. “ â\u0080\u009cThe only thing that I can do is, to the best of my ability, give you the facts.â\u0080\u009d ” â\u0080\u0094 Dr. Anthony Fauci â\u0080\u009cI never said we canâ\u0080\u0099t play a certain sport,â\u0080\u009d he said. (Although it should be noted that he did recently warn that â\u0080\u009cfootball may not happen this yearâ\u0080\u009d on CNN.) â\u0080\u009cI agree with you. I am completely unqualified to tell you whether you can play a sport or not,â\u0080\u009d he continued. â\u0080\u009cThe only thing that I can do is, to the best of my ability, give you the facts and the evidence associated with what I know about this outbreak. Thank you.â\u0080\u009d Watch some of that exchange here iframe.twitter-tweet { width: 100% !important; } The back-and-forth had Paulâ\u0080\u0099s name trending on Twitter TWTR, -0.23% Â on Tuesday afternoon, as the debate illustrated the split opinions Americans have had to the widespread closures and social distancing guidelines across the country since the pandemic began. And that drew plenty of heated reactions online. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } More than 2.5 million Americans have been infected with COVID-19, and 129,545 and counting have died as of Tuesday afternoon. And as cases continue to climb across many parts of the country, Fauci also warned on Tuesday that the number of confirmed coronavirus infections could go up to 100,000 a day. Related:Fauci makes dire warning for America in the ongoing fight against coronavirus Read more of MarketWatchâ\u0080\u0099s coronavirus coverage here."}]}