{"article": [{"url": "https://www.marketwatch.com/story/covid-19-vaccine-60000-subject-trial-plans-at-jj-2020-08-20", "published": 1597925120.0, "headline": "J&J plans 60,000-subject COVID-19 vaccine trial", "body": "Johnson & Johnson plans to launch by late September what could become the largest clinical trial of a coronavirus vaccine to date, enlisting up to 60,000 people world-wide to test whether its experimental shot safely protects from Covid-19. The targeted enrollment, reported on a government database and confirmed by the company, is double the size of other pivotal studies that have started recently or are expected imminently for vaccines developed by Moderna Inc., Pfizer Inc. and AstraZeneca PLC. It is unclear why J&J is planning a much bigger late-stage trial than other companies. A J&J spokesman said the company wants \"to enroll a robust number of participants who are representative of those populations affected by Covid-19,\" and to determine the safety, efficacy, durability and optimal dosing regimens of the vaccine. The late-stage, or phase 3, coronavirus vaccine trials depend on a certain number of subjects being exposed to the virus to see if the vaccinated subjects were protected against Covid-19 symptoms compared with the unvaccinated. William Schaffner, infectious-disease specialist and professor of preventive medicine at Vanderbilt University School of Medicine, said reaching the numbers needed to detect whether the vaccine is working could happen more quickly if more people are enrolled. \"It will certainly speed up the evaluation process,\" said Dr. Shaffner, who serves on a liaison committee to a federal vaccine-advisory panel, and is not involved in designing the trial. J&J is using epidemiology and modeling data to predict and plan study locations with high incidence rates of Covid-19. The company, based in New Brunswick, N.J., is among several front-runners in the global race for a vaccine that could help beat back the deadly global pandemic. Its vaccine uses a weakened common cold virus to deliver genetic instructions for human cells to manufacture a protein found on the surface of the new coronavirus. Researchers say this should trigger an immune response that can fight off the virus. In July, J&J started its first human study of the vaccine, code-named Ad26. COV2. S, in Belgium and the U.S. For the phase 3 study, some subjects will be given a single dose of the vaccine while others will receive a placebo, according to the federal database. Researchers will track whether the vaccinated have lower rates of Covid-19 featuring moderate to severe symptoms than the unvaccinated. The study will be conducted at nearly 180 locations in the U.S. and eight other countries where transmission rates are high, including Brazil, Chile, the Philippines and South Africa, according to a posting on a federal database of clinical trials. In the U.S., J&J's vaccine will be tested in 28 states, including those with high transmission rates like Texas, Florida and California that will each have multiple study sites. Many of the sites are part of a national network for investigating Covid-19 drugs and vaccines funded by the National Institutes of Health, according to a spokeswoman for the National Institute of Allergy and Infectious Diseases. The company has started to recruit subjects, the J&J spokesman said. The study will follow the subjects for more than two years, but preliminary results could become available much sooner. The company might have initial results by the end of this year, a J&J executive has said. If results prove the vaccine works safely and the U.S. government clears the vaccine, J&J plans to make its first batches available for potential emergency use in early 2021, the spokesman said. J&J recently signed a $1 billion contract with the federal government to supply 100 million doses for the U.S. The company said last week it will collaborate with the U.K. government for a global phase 3 study to test a two-dose regimen of the vaccine, which will run in parallel to the single-dose study. Separately, Pfizer Inc. and BioNTech SE on Thursday reported additional results from a small, early-stage study of two experimental coronavirus vaccines, including the vaccine they are now testing in a large phase 3 study. The results, posted to the preprint server medRxiv, showed that the vaccine candidate now in phase 3 testing induced immune responses in study subjects. The results haven't yet been reviewed by outside experts. Study subjects received two doses of the Pfizer-BioNTech vaccine, code-named BNT162b2, three weeks apart. Researchers found it induced a key component of the immune system, neutralizing antibodies to the virus, at levels that were more pronounced in people ages 18 to 55 than in people 65 to 85. But the responses in the older subjects were still higher than antibody levels seen in the plasma of people who had Covid-19, according to the paper. In the early-stage study, people who received BNT162b2 had lower rates of systemic reactions like fever than the other vaccine that Pfizer and BioNTech tested in the study. The companies are not advancing the other vaccine. The ongoing phase 3 study is designed to test whether the immune responses translate into actual protection from Covid-19. Write to Peter Loftus at peter.loftus@wsj.com"}]}