{"article": [{"url": "https://www.marketwatch.com/story/is-30-too-old-to-work-in-media-this-advertising-boss-has-been-forced-to-apologize-after-ageism-row-11599127075", "published": 1599143240.0, "headline": "Is 30 too old to work in media? This advertising boss has been forced to apologize after ageism row", "body": "Mark Read, CEO of WPP Group, the largest global advertising and public relations agency. toby melville/Reuters The chief executive of one of the world’s biggest advertising groups has been forced to apologize after misspeaking during a financial update and sparking a row over ageism. Mark Read, 53, who took over at WPP WPP, +1.33% from Sir Martin Sorrell in 2018, has been forced to apologize after suggesting the business was lucky to have employees with an average age of less than 30. He was asked if the business, home to leading agencies including Ogilvy, Wunderman Thompson, Finsbury, Kantar Group and Grey, had the correct balance of people with skills in digital compared with more traditional television. Read: WPP comparable sales rise as advertising backs 2019 guidance He had replied: “We have a very broad range of skills, and if you look at our people — the average age of someone who works at WPP is less than 30. They don’t hark back to the 1980s, luckily.” This has triggered an industry row over how experience is valued across businesses, with former employees and commentators questioning whether there is a place for creatives and account managers over the age of 30. Read: Is this age discrimination? What older workers can do when they’re marginalized at their job WPP is used by some of the biggest companies in the world, including pharmaceutical giants Merck MRK, -0.14% and Pfizer PFE, -0.27%, and retailers Walgreens WBA, -1.96% and Walmart WMT, +1.00%. Gabriel Dorosz, executive strategy director at The New York Times, tweeted: “I assure you, no one who has worked at WPP, and there are many of us, are shocked or even remotely surprised by Mark Read’s comments.” Dave Trott, author of Creative Mischief, tweeted: “If you were a client over 30 years old, how would you feel about the CEO of WPP saying anyone over 30 is crap?” Daniel Stander, an employment solicitor, tweeted: iframe.twitter-tweet { width: 100% !important; } The backlash prompted Read to row back on his comments tweeting that: iframe.twitter-tweet { width: 100% !important; } The company is no stranger to controversy. In 2018, Sir Martin Sorrell, who founded and led WPP for three decades, stepped down amid allegations he used company funds to pay for prostitutes. Read: WPP says expenses row may hit former CEO Sir Martin Sorrell’s bonus Sorrell has since denied allegations he visited a prostitute, and paid with WPP’s money. A spokesman has previously said: ” Sir Martin left WPP as a good leaver and I am surprised there [are] any remaining questions of his expenses.” Watch: Ignoring Old People div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; }"}]}