{"article": [{"url": "https://www.marketwatch.com/story/the-homeownership-rate-jumps-to-the-highest-level-since-2008-but-looks-could-be-deceiving-2020-07-28", "published": 1596001160.0, "headline": "The homeownership rate jumped to the highest level since 2008 â\u0080\u0094 but looks could be deceiving", "body": "The U.S. homeownership rate soared to the highest level since 2008 in the second quarter, even as the coronavirus pandemic led to record levels of unemployment nationwide. But the rise in homeownership might not actually reflect a sudden surge in interest on Americansâ\u0080\u0099 part. The homeownership rate was 67.9%, up from 65.3% in the first quarter, according to a report from the Commerce Department released this week. The increase represented a record. The current homeownership rate is the highest since the third quarter of 2008. Last year, the homeownership rate was 64.1%. Broken down by age, the homeownership rate increased the most on a percentage basis among those under 35 years old, rising to 40.6% in the second quarter from 37.3% the quarter prior. The homeownership rate increased among Americans of all ages. The rental vacancy rate decreased to 5.7% from 6.6% between the second and the first quarters. This was the lowest rental vacancy level since 1984. The rise in homeownership comes as the housing sector has rebounded from its coronavirus-fueled lows. Home-sales activity dipped in April and May as consumers stayed home amid rising COVID-19 case counts and record job losses. But sales of new homes rose to the highest level in 13 years in June, while existing-home sales rebounded sharply as well. â\u0080\u009cRecord-low mortgage rates in mid-2020 will provide a further boost to homebuilding, and it could be that families are more interested in homeownership because of the pandemic,â\u0080\u009d PNC Financial Services said in a research note released last week. One reason why home buyers have managed to continue purchasing properties amid the pandemic and economic downturn is that the job losses triggered by COVID-19 have largely been concentrated in the service sector. These workers earn lower wages on average than people in other industries, meaning theyâ\u0080\u0099re more likely to be renters and less likely to be able to afford to buy a home. “ â\u0080\u0098Measurement error as a result of COVID is undoubtedly playing a role in the spike in the homeownership rate for Q2.â\u0080\u0099 ” â\u0080\u0094 Danielle Hale, chief economist at Realtor.com At the same time, mortgage companies have seen a record number of homeowners request payment relief. Some 4.3 million homeowners were in forbearance plans with their mortgage servicers in mid-June â\u0080\u0094 and that numbers has fallen since then. These plans, which allow for people to pause mortgage payments for up to 12 months, have helped millions of Americans avoid becoming delinquent on their home loans despite rising unemployment. However, the jump in homeownership may have been overstated by the federal government because of issues with data collection. The U.S. Census Bureau reported that it had to adjust how it conducts the interviews used to produce the homeownership report because of the coronavirus pandemic. Notably, the response rate for the survey was 12 percentage points lower in the second quarter as compared with the first quarter. â\u0080\u009cMeasurement error as a result of COVID is undoubtedly playing a role in the spike in the homeownership rate for Q2,â\u0080\u009d said Danielle Hale, chief economist at Realtor.com. â\u0080\u009cBut measurement error may not be solely responsible for the increase. Home sales have been on a rollercoaster ride in the first-half of 2020, and this data coupled with other survey evidence suggests that homeownership desire remains strong as Americans seek certainty in their own homes against an uncertain economic and health backdrop,â\u0080\u009d Hale added. “ While 76% of White Americans are homeowners, the same is true for only 47% of Black Americans. ” Disparities in homeownership among people of color persisted during the second quarter, even though the share of Black and Hispanic Americans who are homeowners rose. The homeownership rate among Black Americans increased to 47% from 44% the previous quarter. Among Hispanic Americans, the homeownership rate rose to 51.4% from 48.9%. Comparatively, 76% of White Americans were homeowners, up from 73.7% in the first quarter. The Black homeownership rate fell to a record low last year and still remains below the all-time high of 49.7% in 2004 before the subprime-mortgage crisis began. During the housing crisis, Black households faced foreclosure at twice the rate of their white neighbors, largely because Black homeowners were targeted with subprime loans, research shows. Since then, Black communities have struggled to recover financially. And experts warn that Black households are at a particular risk of losing their homes because of the coronavirus-related economic downturn. Twenty-eight percent of black homeowners did not pay or deferred their mortgage payment in May, compared with just 9% of white homeowners, the Urban Institute previously reported."}]}