{"article": [{"url": "https://www.marketwatch.com/story/reports-of-covid-cases-are-growing-on-college-campuses-as-schools-bring-students-back-for-in-person-classes-11597700320", "published": 1597767620.0, "headline": "Notre Dame and University of North Carolina abandon in-person classes after COVID cases grow â\u0080\u0094 and outbreaks are happening at several other campuses", "body": "The University of North Carolina at Chapel Hill moved courses online after a spike in positive COVID cases during the first week of classes. Gerry Broome/Associated Press After months of anticipation over what an in-person college semester in the midst of a global pandemic might look like, weâ\u0080\u0099re starting to get a sense Â â\u0080\u0094 and so far itâ\u0080\u0099s not going well.Â Colleges across the country that have brought students back to campus are reporting dozens of positive cases of COVID-19. At Oklahoma State University, 23 reported positive cases were tied to a sorority house over the weekend. At the University of Tennessee, officials have reported 28 positive cases, 20 of them students, since Aug. 1. At Colorado College, 155 students are quarantining in campus housing after being exposed to a student who tested positive for the virus. â\u0080\u009cUltimately, protocols were not adhered to,â\u0080\u009d Leslie Weddell, a Colorado College spokeswoman, wrote in an email.Â Classes at the school are scheduled to start on Aug. 24, which means that these students will be logging on remotely, and, â\u0080\u009cfor some, that may not be a change from what was already planned,â\u0080\u009d Weddell wrote. And after observing a â\u0080\u009csignificant riseâ\u0080\u009d in positive cases between Aug. 10 and 16, the University of North Carolina at Chapel Hill announced Monday that it would switch undergraduate classes to remote instruction and reduce density in the residence halls. As of Monday afternoon, the school said there were 177 students in isolation and 349 in quarantine both on and off campus.Â UNC Chancellor Kevin M. Guskiewicz wrote in a university message that â\u0080\u009cthe health and safety of our campus community are paramount,â\u0080\u009d and that the school would continue to adapt its plan as needed. â\u0080\u009cWe understand the concern and frustrations these changes will raise with many students and parents,â\u0080\u009d Guskiewicz wrote. â\u0080\u009cAs much as we believe we have worked diligently to help create a healthy and safe campus living and learning environment, the current data presents an untenable situation. â\u0080\u009c The announcement came in the wake of alerts sent to students, faculty and staff over the past few days identifying four clusters of positive cases in campus housing or off-campus housing tied to the university community. It also comes amid weeks of pressure from faculty and an editorial in the student newspaper criticizing the schoolâ\u0080\u0099s initial plan for some in-person classes.Â Are you a student living on a college campus right now? We want to hear from you. Email jberman@marketwatch.com â\u0080\u009cWe all saw this coming,â\u0080\u009d the editorial board of the Daily Tar Heel wrote of the outbreak. â\u0080\u009cUniversity leadership should have expected students, many of whom are now living on their own for the first time, to be reckless. Reports of parties throughout the weekend come as no surprise. Though these students are not faultless, it was the Universityâ\u0080\u0099s responsibility to disincentivize such gatherings by reconsidering its plans to operate in-person earlier on.â\u0080\u009d At Notre Dame University, the schoolâ\u0080\u0099s president, Rev. John I. Jenkins, announced Tuesday that all undergraduate classes would be offered solely remotely for at least two weeks after â\u0080\u009ca dramatic increaseâ\u0080\u009d in the number of positive cases at the school. Officials have identified 147 cases out of 927 total tests since Aug. 3. Jenkins also said residence halls would be limited to residents only, public spaces on campus would be closed and that students living off campus should remain in their residences, associate with only their housemates and not come to campus during this time. Jenkins said that the schoolâ\u0080\u0099s contact tracing efforts suggest that most of the infections are coming from off-campus gatherings. The school has a policy of not disciplining students for behavior that comes to light during contact tracing inquiries, Jenkins said, in order to encourage participation in these efforts. â\u0080\u009cIf however we learn of a serious violation of policies from other sources we will take disciplinary action,â\u0080\u009d he said. Jenkins encouraged students to observe health protocols, avoid dangerous behavior and report unsafe behavior, noting that if the mitigation efforts outlined Tuesday are unsuccessful, students could be sent home. â\u0080\u009cThe virus is a formidable foe, for the past week it has been winning, let us as the Fighting Irish join together to contain it,â\u0080\u009d he said. Â Professors have been modeling the diseases spread on campuses for months The cases at UNC, Notre Dame, and elsewhere come after months of modeling, mask ordering and safety guideline drafting. They also follow weeks of hand-wringing over whether to reopen amid, in some cases, pressure from public health experts, faculty and students to remain largely remote and the weight of revenue pressure that could result from keeping a campus closed. For many colleges, the funds students pay for on-campus housing represent an important source of revenue, and almost all schools rely heavily on tuition, which theyâ\u0080\u0099ve worried students and their families might be hesitant to pay for an all-online experience. The recent outbreaks raise questions about whether schools are doing enough to keep campuses, which are tightly intertwined communities susceptible to viral spreading, safe.Â â\u0080\u009cWe are beginning to see that schools that chose only to respond once symptoms have occurred are like fire departments that respond only to alarms after the house has been declared to be burnt to the ground,â\u0080\u009d said David Paltiel, a professor at the Yale School of Public Health.Â â\u0080\u009cWe explored thousands of scenarios and failed to find even one plausible circumstance under which that strategy would be able to contain an outbreak.â\u0080\u009d Paltielâ\u0080\u0099s modeling suggests that without a plan to test students and those interacting with them regularly at least twice a week, colleges will likely be playing catch-up with the virus.Â Thatâ\u0080\u0099s not a good place to start because even a relatively low infection rate on a college campus can spiral out of control relatively quickly, according to two experts who have been modeling the spread of COVID-19 on campuses since May.Â When Jennifer Peck, an economist at Swarthmore College, and Phil Gressman, a mathematician at the University of Pennsylvania, first began looking at this issue a few months ago, they determined that some mitigation by universities â\u0080\u0094 such as requiring universal mask wearing, moving most large classes online and randomly testing 3% of the population on campus â\u0080\u0094 could keep positive cases relatively low for the entire semester.Â But the trajectory of the disease in the U.S. over the summer turned out to be very different from what they expected in May. Now thereâ\u0080\u0099s a much higher prevalence of community spread than what Peck and Gressmanâ\u0080\u0099s original model assumed would be the case at this time. The two adjusted the model for our current COVID reality and some other factors â\u0080\u0094 for example, 80% rather than universal mask compliance among students. The combination of higher prevalence in the community and not quite 100% compliance with guidelines pushed the number of positive cases up, Gressman said.Â The pair also learned that even a relatively small number of positive cases in a relatively large university community is something schools should be concerned about. Even a campus with a population of 20,000 to 30,000 should start taking seriously the threat of the disease with the first positive case, Gressman said.Â â\u0080\u009cThere is this sense out there that cases are going to be happening on college campuses,â\u0080\u009d Gressmen said. â\u0080\u009cThatâ\u0080\u0099s really a dangerous way of looking at it.â\u0080\u009d Just a few days in a row with five positive cases signals that a school is â\u0080\u009con track to have a serious problem,â\u0080\u009d Peck said. Schools on track for 50 or 100 COVID-19 cases in a semester should be reporting no positive tests on most days, Peck said. Because the data on positive cases are relatively â\u0080\u009cnoisyâ\u0080\u009d â\u0080\u0094 meaning that a clear pattern isnâ\u0080\u0099t necessarily presented â\u0080\u0094 and because, for every positive test, there may be several other positive cases in the community, schools are at risk of not intervening before itâ\u0080\u0099s too late, the two said.Â Schools are â\u0080\u009cat a crossroads,â\u0080\u009d Gressman said, â\u0080\u009ceven though the semester has already started â\u0080\u0094 they really need to be re-examining what theyâ\u0080\u0099re doing.â\u0080\u009dÂ"}]}