{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-rise-about-200-points-ahead-of-adp-private-sector-jobs-report-beige-book-2020-09-02", "published": 1599066860.0, "headline": "Stocks book fresh round of records, Dow ends 1.5% shy of all-time high, on hopes of COVID treatments, cures", "body": "U.S. equity benchmark indexes closed in record territory Wednesday, as investors drew hope from progress in the development of tests and vaccines for COVID-19. Investors largely ignored a mixed batch of economic reports, including a private-sector jobs reading that came in weaker than expected, suggesting only a slow recovery from the coronavirus pandemic. How did the benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% surged 454.84 points, or 1.6%, ending at 29,100.50, or 1.5% away from its Feb. 12 closing high of 29,551.42. The S&P 500 index SPX, +0.87% climbed 54.19 points, or 1.5%, to settle at a record 3,580.84, its 22nd record close this year. The Nasdaq Composite Index COMP, +1.39% advanced 116.78 points to close at a record 12,056.44, a gain of 1%, and its 43rd record close of the year. On Tuesday, the Dow rose 215.61 points to end at 28,645.66, or 0.8% higher, the S&P 500 index added 26.34 points to close at a record 3,526.65, a gain of 0.8%, after setting an intraday record of 3,528.03; while the Nasdaq Composite Index advanced 165.21 points to a record 11,939.67 finish, a rise of 1.1%, after touching a new intraday all-time high of 11,945.72.What drove the market? Stock markets finished at fresh records Wednesday, with a number of possible catalysts boosting the investing mood amid the coronavirus pandemic. U.S. Treasury Secretary Steven Mnuchin restarted talks with House Speaker Nancy Pelosi about another fiscal stimulus plan to help out-of-work Americans, although Pelosi said the two sides still have “serious differences,” following their brief phone call Tuesday. On the health front, leading infectious disease health expert Dr. Anthony Fauci told NBC’s “Today” show that a COVID-19 pandemic cure could come by the end of 2020, if the roster of companies attempting to achieve a vaccine are able to produce outstanding preliminary results. Speaking to Kaiser Health News on Tuesday, Fauci said the board overseeing vaccine approvals could decide that “the data is so good right now that you can say it’s safe and effective.” The global tally for confirmed cases of the coronavirus that causes COVID-19 climbed to near 26 million on Wednesday, according to data aggregated by Johns Hopkins University, while the death toll rose to 858,661. Buying continued in large-capitalization technology stocks and shares tied to pandemic stay-at-home trends, but also in shares of makers of consumer goods and autos. Microsoft Corp. MSFT, +2.48%, Facebook Inc. FB, +0.26% , Intel Corp. INTC, -1.03% and Walmart Inc. WMT, +1.00% shares punched higher, as did those of Coca-Cola Co KO, +0.69%, Ford Motor Co. F, -1.36% and General Motors Co. GM, -0.15%. “The unprecedented fiscal and monetary stimulus, not only in the U.S., but around the world, is going to provide the economy with a bridge,” said Chris Armbruster, a portfolio manager at Kayne Anderson Rudnick in Los Angeles, giving investors reason to look beyond recently depressed economic data and high unemployment, to what lies ahead. In that vein, the U.S. government also will end up running its biggest budget shortfall ever this year, at $3.311 trillion, the nonpartisan Congressional Budget Office said Wednesday. Still, Armbruster sees many companies forced by the pandemic to adopt technologies and make improvements to their supply chains as likely to “grow and recover faster, and realize better margins.” Stocks advanced despite a rash of mixed economic data. Automatic Data Processing Inc ADP, +1.93% data showing 428,000 private-sector jobs were created in August, missing expectations for a gain of 900,000 jobs, according to a consensus of estimates surveyed by Econoday. “It’s a pretty substantial miss, but still much better than what we saw last month,” said Mike Loewengart, managing director investment strategy at E-Trade Financial, via email. ADP did, however, raise last month’s jobs figure to 212,000 for July from a rise of 167,000, which was then below forecast of 1.9 million jobs. The economy has recouped fewer than half of the 20-million-plus jobs lost in the early stages of the coronavirus pandemic. Separately, U.S. factory orders rose 6.4% in July for a third straight increase, reflecting a rebound in manufacturing after the economy reopened. Economists polled by MarketWatch had forecast a 6.2% gain. The Federal Reserve’s Beige Book survey also showed the U.S. economy expanded modestly in August, but with many parts of the country experiencing slower growth during the pandemic, including as some companies make temporary layoffs permanent. In other news, the Centers for Disease Control and Prevention late Tuesday implemented a temporary eviction moratorium through the end of the year, protecting millions of U.S. renters from losing their homes during the COVID-19 pandemic. “Certainly, the real estate sector continues to be one that very few investors think will emerge in good shape,” said Cameron Brandt, director of research at EPFR, in an interview with MarketWatch. However, Brandt also sees improvements in the cards for a broader base of stocks, beyond the stay-at-home winners and technology giants, as the general population becomes more comfortable with the idea that COVID-19 can be a managed risk. “People want to get on with their lives,” he said, adding that basic restocking, differed consumption and other factors that go along with reopening “will provide modest surprises to the upside.” Which stocks were in focus? Shares of Macy’s Inc. M, -0.95% rose 0.6% Wednesday, after the department store chain reported a fiscal second-quarter loss that was much narrower than expected as net sales topped forecasts. Vera Bradley Inc. shares VRA, +1.70% soared 32% Wednesday, after the handbag and accessories retailer posted a surprise profit for the second quarter. Shares of DraftKings DKNG, -4.51% rallied 8% Wednesday after the company added basketball legend Michael Jordan as an adviser to the company. Shares of Peloton Interactive Inc. PTON, +6.97% ran up 8.8% to record territory, after J.P. Morgan analyst Doug Anmuth boosted his price target to the highest among Wall Street analysts, citing optimism ahead of next week’s earnings report. Shares of Jack Daniel’s parent Brown-Forman Corp. BF.B, +0.53% rose 10% Wednesday, after the alcohol brands company reported fiscal first-quarter results that beat expectations, although gross margin contracted as price/mix decreased. Shares of ServiceMaster Global Holdings Inc. US:SERV rose 8.8% Wednesday, after the termite and pest control company said it’s selling its ServiceMaster Brands franchise business for $1.55 billion to Roark Capital. Clothing retailer Guess Inc. shares GES, +2.17% soared 11.6% Wednesday, after the company blew past estimates for its fiscal second quarter. Mobile games platform Skillz Inc. said Wednesday it is going public via a merger with special purpose acquisition corporation Flying Eagle Acquisition Corp. FEAC, +8.88%. The deal has an implied equity valuation of $3.5 billion, or 6.3 times estimated 2022 revenue, the company said in a statement. Tesla Inc. TSLA, +1.89% shares slumped 5.8%, to correction territory, after the electric vehicle maker disclosed that one of its largest shareholders sold off a chunk of stock. How did other assets trade? The Stoxx Europe 600 SXXP, +0.55% finished 1.7% higher Wednesday, while U.K.’s FTSE 100 benchmark UKX, +0.64% rose 1.4%. The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% edged back 2.2 basis points at 0.650%. Bond prices move inversely to yields. Gold GCZ20, +2.17% shed $34.20, or 1.7%, to settle at $1,944.70 an ounce, pulling back from its highest settlement in about two weeks on Tuesday. West Texas Intermediate crude for October delivery CL.1, -1.62% lost $1.25, or 2.9%, settling at $41.51 a barrel on the New York Mercantile Exchange. The ICE U.S. Dollar Index DXY, -0.58%, which tracks the currency versus a basket of six major rivals, rose 0.5% at 92.85 after trading down earlier in the session. In Asia, China’s CSI 300 000300, +2.04% closed less than 0.1% higher and Hong Kong’s Hang Seng HSI, -0.30% finished 0.3% lower. Japan’s Nikkei 225 NIK, -0.11% rose 0.5%, while the South Korea’s Kospi 180721, +0.21% gained 0.6%."}]}