{"article": [{"url": "https://www.marketwatch.com/story/for-older-workers-there-are-risks-if-they-return-to-the-officeand-if-they-dont-2020-06-15", "published": 1592215040.0, "headline": "For older workers, there are risks if they return to the officeâ\u0080\u0094and if they donâ\u0080\u0099t", "body": "This article is reprinted by permission from NextAvenue.org. Now that weâ\u0080\u0099re entering a new stage of the coronavirus pandemic in many parts of the country, many Americans will be told to come back to their workplaces. Employers like Apple AAPL, +1.74% Â and Facebook FB, +0.26% Â are spelling out the new rules. But whether to return can be a difficult decision for older workers concerned that it could heighten their risk of contracting COVID-19. In a recent survey of workers from workplace well-being expert Michelle McQuaid and the Center for the Advancement of Well-Being at George Mason University, 78% of the workers reportedÂ â\u0080\u009cnot feeling positiveâ\u0080\u009d about the prospect of returning to the officeÂ as pandemic restrictions ease. And just 22% of those who started working at home due to COVID-19 said they are feeling positive about returning to work. This nurse says she's 'work optional' instead of FIRE - here's how Some employers, however, are giving employees little choice. Or, as at Tyson Foods TSN, -1.71% Â , theyâ\u0080\u0099re penalizing ones who miss shifts and potentially firing them for too many absences. According to The Wall Street Journal, â\u0080\u009cstate and federal workplace safety agencies have fielded complaints from workers and advocates from at least 34 workplaces expressing concerns that older workers or employees with pre-existing health conditions werenâ\u0080\u0099t being properly protected from, or in some cases informed of, the coronavirus spread in the workplace.â\u0080\u009dOlder workers and the coronavirus risk Many employers are in a quandary about whether theyâ\u0080\u0099d be increasing theÂ coronavirus riskÂ to their workforce by bringing in their employees in their late 60s or older â\u0080\u0094 who the Centers for Disease Control has said are more vulnerable to COVID-19 than younger people, generally speaking. â\u0080\u009cItâ\u0080\u0099s a dicey subject when [coronavirus] risks are age-related,â\u0080\u009d saidÂ Monique Morrissey,Â an economist specializing in older workers at the nonprofit Economic Policy Institute, which focuses on low- and middle-income workers. â\u0080\u009cYou want to address older workers, but not stigmatize them.â\u0080\u009d I recently interviewed Morrissey for her insights about older workers and COVID-19 as well as her advice to them about returning to work in this new phase of the pandemic. Highlights: Next Avenue: You recently gave a presentation in a webinar on older workers and COVID-19 and called it â\u0080\u0098This Time Itâ\u0080\u0099s Different.â\u0080\u0099 What did you mean? Monique Morrissey:Â Usually, in a recession, because older workers have more tenure than younger workers, theyâ\u0080\u0099re less likely to lose their jobs. But this time, you canâ\u0080\u0099t say theyâ\u0080\u0099re less affected. In fact, workers in their 50s and older areÂ more likely to be unemployedÂ due to the recession. On the flip side, the pattern we usually observe in a recession is that although older workers are relatively less likely to lose their jobs, the ones who do take a much bigger proportional hit in pay if they get new jobs. It can take them twice as long to get hired, if they get hired at all. And what about their retirement savings and their earnings? Typically, in a recession, the older, middle- and upper-class workers take a hit to their retirement savings. This time, the stock market has sort of propped up those people losing their jobs. And older workers losing their jobs might not see as big a drop in their earnings when they come back to work because many of them had low-income jobs, like home health aide or child-care worker.Age discrimination in the new phase of the pandemic Are you concerned aboutÂ age discrimination by employersÂ as managers decide which employees to bring back? Will they cherry-pick workers? The employers might be tempted to engage in age discrimination. Even though thatâ\u0080\u0099s illegal, it might be hard to prove. Before we get to the problems older workers are facing, and will be, can you talk about some of the relief measures that have been helpful to older workers and why? The government extended unemployment benefits by duration and by who gets covered. People got $600 on top of normal unemployment benefits because states only cover a fraction of earnings and in some states, the amount in benefits is pathetically low. So, this has helped older workers and especially low-income older workers. Also read: Youâ\u0080\u0099re likely to be out of a job in your 50s â\u0080\u0094 4 ways to prepare and minimize the pain And the small-businessÂ PPP moneyÂ [the Small Business Administrationâ\u0080\u0099s recent Paycheck Protection Program] disproportionately benefited older workers because older adults are more likely to work for small businesses than bigger businesses.What employers need to do Can you talk about health and safety protections for workers? What do you think employers need to do? We have forced people called essential workers to work during the pandemic with no regard to the risks and no protections. OSHA [the Occupational Safety and Health Administration] has done nothing. Itâ\u0080\u0099s scandalous, really. TheÂ CARES ActÂ said which people can be eligible for unemployment benefits related to COVID-19 and said that if you were told to quarantine by your doctor, thatâ\u0080\u0099s legitimate for the COVID benefits. But thereâ\u0080\u0099s nothing in this law about what if your employer tells you that you need to come back to work and youâ\u0080\u0099re high risk because you have underlying conditions or age-related reasons and thereâ\u0080\u0099s no way to use social distancing at work or make your job safe. That couldâ\u0080\u0099ve been clarified. The Texas Workforce Commission has explicitly said that one risk factor for not going back to work in Texas is being over 65. Thatâ\u0080\u0099s great, but itâ\u0080\u0099s just Texas and thereâ\u0080\u0099s a clear line at age 65. How should offices be set up to allow people to return safely? All employers are looking at that carefully. We want to think that taking precautions with masks would be sufficient. But a lot depends on ventilation and how many people are working in the space. Employers might be short-sighted if they force the issue too quickly. They may come to regret it. My take is that the health part [of the pandemic] will drag out longer than people think and the economic downturn, unless we smarten up, will take longer than we think.What if youâ\u0080\u0099re afraid to go back to your workplace? What would you tell older workers who are uncertain about going back to work because theyâ\u0080\u0099re afraid they will get the coronavirus but theyâ\u0080\u0099re also afraid of losing their jobs? Â If itâ\u0080\u0099s a health decision, it doesnâ\u0080\u0099t make sense to make a gut decision based on hoping and praying something wonâ\u0080\u0099t affect you. Itâ\u0080\u0099s worth taking a financial hit in the short run to preserve your health. Related: Older workers are as well situated as younger workers to work remotely Some states are encouraging employers to tell the state unemployment departments if certain workers wonâ\u0080\u0099t go back to work because they are concerned about COVID-19. And some employers have been trying to coerce workers reluctant to come back with the fear of cutting off their unemployment benefits if they donâ\u0080\u0099t come back. How can older workers get their employersâ\u0080\u0099 working conditions changed to be safer? If you see some people arenâ\u0080\u0099t wearing masks, ask your employer to explain to workers why wearing a mask is not being hostile to other workers. It is a way to protect them. It sends a signal of reciprocity and of being considerate. How can someone negotiate with an employer about going back to work during the pandemic? It depends on your relationship with your employer. A worker who is valued by an employer and has a good relationship could bring it up on behalf of all workers with elevated risks. You can show your willingness to come back to work with concrete proposals to make it safe. Try to point out to the employer that this will, in the end, benefit them and reduce absenteeism. Iâ\u0080\u0099ve seen one estimate saying that 42% of the jobs lost due to the pandemic will never come back and another saying that the pandemic will push 3.1 million older workers into poverty. Do you share those expectations? All those things are possible. What we do know is that the coronavirus and the recession will inevitably increase senior poverty. Richard Eisenberg is the Senior Web Editor of the Money & Security and Work & Purpose channels of Next Avenue and Managing Editor for the site. He is the author of â\u0080\u009cHow to Avoid a Mid-Life Financial Crisisâ\u0080\u009d and has been a personal finance editor at Money, Yahoo, Good Housekeeping, and CBS MoneyWatch. Follow him onÂ Twitter. This article is reprinted by permission from NextAvenue.org, Â© 2020 Twin Cities Public Television, Inc. All rights reserved."}]}