{"article": [{"url": "https://www.marketwatch.com/story/white-house-officials-suggest-breaking-new-coronavirus-relief-package-into-smaller-pieces-2020-07-26", "published": 1595795780.0, "headline": "White House officials suggest breaking new coronavirus relief package into smaller pieces", "body": "White House officials on Sunday again suggested the best way to proceed with coronavirus relief is to split the Democratic $3.4 billion plan into pieces and pass some measures quickly while debate lingers on other items. In an interview on ABC News’ “This Week,” White House Chief of Staff Mark Meadows said he thought Congress should pass unemployment insurance, aid to schools and liability protection for businesses. “Perhaps we can put that forward, get that passed and we can negotiate on the rest of the bill,” he said. Last week, Speaker of the House Nancy Pelosi repeatedly rejected doing the legislation in piecemeal fashion. And interviewed on Sunday on CBS’ “Face the Nation,” Pelosi showed no sign of changing her mind. One major priority for Democrats missing from Meadow’s package is more money for state and local governments. “We have been ready for two months and ten days” to negotiate, Pelosi said, referring to when the Democrat plan passed the House. With neither side showing signs of budging, it looks like the stimulus talks may drag on. Republicans might be counting on pressure for lawmakers to act from the looming expiration of $600 weekly payment of enhanced federal unemployment benefits. These benefits, received by more than 20 million Americans, expire fully on July 31. No matter what Congress does, there is already likely to be a gap in those federal benefits given the delay in extending them. But Pelosi could be counting on voters blaming Trump for any delay. She gave the president a new nickname, “Mr. Makes Matters Worse.” Economists are worried the economy is losing steam in July after rebounding from the short but deep contraction in the second quarter. They see more government aid to unemployed as essential to keep the economy from sliding into a double-dip recession As it is, new layoffs continue to be announced daily, with billionaire Ray Dalio’s hedge-fund Bridgewater the latest to report job cuts late last week. In an interview on Fox News Sunday, Treasury Secretary Steven Mnuchin confirmed the GOP package would reduce the blanket $600 weekly unemployment payment. Instead, the bonus would be tailored to workers’ income so they get about 70% of their take-home pay. “We want to have something which is capable of about 70% wage replacement, which I think is a very fair level,” Mnuchin said. Meadows and Mnuchin were on Capitol Hill on Saturday and will return Sunday to put the finishing touches on a Republican package to be unveiled on Monday. Mnuchin said the GOP measure would cost $1 trillion. “We can move very quickly with the Democrats on these issues. We’ve moved quickly before and I see no reason why we can’t move quickly again. And if there are issues that take longer, we’ll deal with those as well,” he added. In a separate interview, White House economic adviser Larry Kudlow confirmed in an interview on CNN’s “State of the Union” that the GOP plan would include new $1,200 stimulus checks for Americans and would extend a federal moratorium on evictions. Kudlow scoffed at suggestions the economy was weakening. “The economy is improving by leaps and bounds,” Kudlow said."}]}