{"article": [{"url": "https://www.marketwatch.com/story/were-still-in-a-first-wave-fauci-says-noting-precautions-can-prevent-second-wave-of-coronavirus-2020-06-16", "published": 1592335220.0, "headline": "â\u0080\u0098Weâ\u0080\u0099re still in a first wave,â\u0080\u0099 Fauci says, noting precautions can prevent second wave of coronavirus", "body": "Dr. Anthony Fauci said Tuesday that he hasnâ\u0080\u0099t spoken to President Donald Trump in weeks, and warned that America is still not through the first wave of coronavirus cases. “ â\u0080\u009cPeople keep talking about a second wave. Weâ\u0080\u0099re still in a first wave.â\u0080\u009d ” â\u0080\u0094 Dr. Anthony Fauci In an interview with the Wall Street Journal, Fauci, the governmentâ\u0080\u0099s top infectious-disease expert, said that risky behavior as states reopen their economies is likely leading to a resurgence in COVID-19 cases. â\u0080\u009cWhen I look at the TV and I see pictures of people congregating at bars when the location they are indicates they shouldnâ\u0080\u0099t be doing that, thatâ\u0080\u0099s very risky,â\u0080\u009d he said. While the White House has dismissed the increase in coronavirus cases as a result of more widespread testing, Fauci told the Journal that, in many states, the upswing in new cases â\u0080\u009ccannot be explained by increased testing.â\u0080\u009d Also see:U.K. trial sparks interest in dexamethasoneâ\u0080\u0099s potential as a treatment for severely ill COVID-19 patients In a separate interview Tuesday with NPRs â\u0080\u009c1Aâ\u0080\u009d podcast, Fauci, who is a member of the White House coronavirus task force, said he hasnâ\u0080\u0099t talked to Trump in two weeks. While the task force has not been in the public spotlight as much recently, he said hard work is still being done. â\u0080\u009cThe seriousness with which the task force takes and the effort that we put into this is really substantial,â\u0080\u009d he said. While Fauci did not explicitly fault states for reopening too soon, he did blame some people for flouting safety rules. â\u0080\u009cStates may say theyâ\u0080\u0099re in this particular stage, but then you might find people are not adhering to the guidelines,â\u0080\u009d he told NPR. â\u0080\u009cThatâ\u0080\u0099s clearly increasing the risk and likely explaining some of the upticks youâ\u0080\u0099re seeing.â\u0080\u009d A second wave of outbreaks is not inevitable, he said, as long as â\u0080\u009cwe do what we need to do to prevent it from happening.â\u0080\u009d Read:Why do so many Americans refuse to wear face masks? Politics is part of it â\u0080\u0094 but only part Fauci said he was also concerned by the perception that shutting businesses or reopening them was a simple, â\u0080\u009call or noneâ\u0080\u009d choice. â\u0080\u009cIt isnâ\u0080\u0099t as if you stay locked down or you open up and leave caution to the wind,â\u0080\u009d he said, noting that each region needs to be treated differently, depending on a multitude of factors, and that safety precautions such as face masks and social distancing will be the norm for the foreseeable future. â\u0080\u009cWe are nowhere near herd immunity,â\u0080\u009d he said. â\u0080\u009cThe bottom line is, youâ\u0080\u0099ve got to protect yourself.â\u0080\u009d As of Tuesday, the U.S. has had 2.1 million confirmed coronavirus cases, with nearly 117,000 deaths, according to data from Johns Hopkins University."}]}