{"article": [{"url": "https://www.marketwatch.com/story/michelle-obama-rips-trump-as-wrong-president-for-our-country-in-dnc-speech-2020-08-17", "published": 1597742540.0, "headline": "Michelle Obama rips Trump as â\u0080\u0098wrong president for our countryâ\u0080\u0099 in DNC speech", "body": "Former first lady Michelle Obama blasted President Donald Trump in her speech to the Democratic National Convention on Monday, calling him unfit to run the country as she hailed Joe Bidenâ\u0080\u0099s character and readiness for the White House. Speaking via video, Obama called Trump â\u0080\u009cthe wrong president for our country.â\u0080\u009d â\u0080\u009cHe has had more than enough time to prove that he can do the job, but he is clearly in over his head,â\u0080\u009d she said. The former first lady was the eveningâ\u0080\u0099s keynote speaker, following an address by Sen. Bernie Sanders, who battled Biden in the Democratic primary. The convention was set against the backdrop of the coronavirus that has killed about 170,000 Americans and ravaged the U.S. economy, and came as the nation is struggling with a racial reckoning after the killing of George Floyd, an unarmed Black man, in Minnesota earlier this year. Also see:â\u0080\u0098We need Joe Biden as our next presidentâ\u0080\u0099: Sanders makes case for his former rival. Trump earlier Monday slammed the former first lady, asking why sheâ\u0080\u0099d taped her speech to the convention. â\u0080\u009cYou want to go to a snooze? You know, when you hear a speech is taped, itâ\u0080\u0099s like thereâ\u0080\u0099s nothing very exciting about it, right?â\u0080\u009d he said in remarks to supporters in Minneapolis. Obama ripped Trump in her 2018 book â\u0080\u009cBecoming,â\u0080\u009d saying the campaign he championed that falsely claimed Barack Obama wasnâ\u0080\u0099t a U.S. citizen was â\u0080\u009cdeliberately meant to stir up the wing nuts and kooks.â\u0080\u009d Also read:Michelle Obama blames Trump for contributing to her depression. Her starkly personal words about Trump were countered by her praise of Biden. â\u0080\u009cI know Joe,â\u0080\u009d she said. â\u0080\u009cHe is a profoundly decent man, guided by faith. He was a terrific vice president. He knows what it takes to rescue an economy, beat back a pandemic, and lead our country. And he listens. He will tell the truth and trust science.â\u0080\u009d Her husband, former President Barack Obama, is scheduled to speak to the convention on Wednesday. More from the DNC:Daughter of Trump voter who died of coronavirus: â\u0080\u0098His only pre-existing condition was trusting Donald Trumpâ\u0080\u0099 Also:Hereâ\u0080\u0099s how to watch the Democratic convention â\u0080\u0094 plus whoâ\u0080\u0099s speaking, and when"}]}