{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-sink-more-than-300-points-on-jobs-friday-as-president-trump-first-lady-contract-coronavirus-11601636256", "published": 1601656520.0, "headline": "U.S. stocks end lower as Trumpâ\u0080\u0099s coronavirus diagnosis weighs, but notch second weekly gain in a row", "body": "U.S. stock indexes ended lower Friday in choppy trade as investors reacted to a weaker-than-expected September jobs report and news that President Donald Trump and first lady Melania Trump had tested positive for the coronavirus. The president and his wife will need to quarantine as the presidential election campaign enters its final weeks. The diagnosis also overshadows negotiations in Congress for another round of fiscal stimulus to combat the economic effects of the pandemic.What did major benchmarks do? The Dow Jones Industrial Average DJIA, +0.56% shed 134.09 points, 0.5%, to close near 27,682.81, while the S&P 500 index SPX, +0.87% lost 32.36 points, or 1%, closing at 3,348.44. The Nasdaq Composite Index COMP, +1.39% slumped 251.49 points, or 2.2%, to reach 11,075.02. The small-cap Russell 2000 RUT, +0.55% gained 8.10points, 0.5%, to close at 1,539.30. For the week, the Dow added 1.9%, the S&P 500 gained 1.5%, and the Nasdaq rose 1.5. The Russell 2000 outperformed, adding 4.4% for the week. What drove the market? A disappointing September employment report and Trumpâ\u0080\u0099s positive COVID-19 test helped erode bullish sentiment on Wall Street, as did a lack of progress on new fiscal stimulus measures to help the economy recover faster from the pandemic. The U.S. economy created 661,000 new jobs in September and the unemployment rate fell again to 7.9% to the lowest level of the pandemic, but the gain in hiring was the smallest since businesses reopened after lockdowns earlier this year and pointed to deceleration in the economic recovery. The decline in the unemployment rate mostly reflected 700,000 people exiting the labor force because of a scarcity of new jobs. About 12 million jobs have been recovered since the mid-March economic shutdown that saw about 22 million layoffs. â\u0080\u009cJob growth is moderating just as fiscal aid is expiring â\u0080\u0093 a toxic cocktail,â\u0080\u009d wrote Oxford Economics economist Kathy Bostjancic in a note. â\u0080\u009cDespite relatively strong growth since May, employment remains a staggering 10.7 million below the pre-Covid level,â\u0080\u009d she added. But the jobs report was eclipsed by the news of the presidentâ\u0080\u0099s diagnosis, which he tweeted early Friday. iframe.twitter-tweet { width: 100% !important; } Although the White Houseâ\u0080\u0099s doctor said that both were â\u0080\u009cdoing wellâ\u0080\u009d and will remain in quarantine, reports indicated that Trump was experiencing â\u0080\u009cmild symptoms.â\u0080\u009d â\u0080\u009cEveryone was anticipating the October surprise. Still, honestly, this one came flying in from the left-field, not only caching virtually everyone flatfooted but probably hit at the most vulnerable time of the week as a risk had turned off due to the fiscal impasse,â\u0080\u009d wrote Stephen Innes, an independent market strategist. Some investors argue that Trumpâ\u0080\u0099s forced quarantine, as he deals with the deadly illness, could hurt his election campaign efforts as the race for the White House with challenger former Vice President Joe Biden heats up headed into the Nov. 3 election. â\u0080\u009cWhat is there to say? Yes, itâ\u0080\u0099s definitely a development that is going to weigh on peoplesâ\u0080\u0099 minds for the next few weeks,â\u0080\u009d said John Carey, Amundi Pioneerâ\u0080\u0099s director of U.S. equity Income, in an interview.Â On the other hand, Carey noted, â\u0080\u009cSpeaker Pelosi said that maybe the dynamic had changed in the stimulus discussions and there was more likely to be a compromise measure after all.â\u0080\u009d Especially in light of the weak jobs report, Carey said, â\u0080\u009cmaybe this will remind people that this is a very serious crisis and that the government needs to help. Weâ\u0080\u0099d be in a much worse situation economically if we hadnâ\u0080\u0099t had the aggressive CARES act and so much Federal Reserve stimulus.â\u0080\u009d Questions about the economy are increasingly driving market moves, Carey noted. â\u0080\u009cThere still seems to be a lot of doubt about energy XLE, -1.59% with the low level of economic activity, a lot of questions about people-facing businesses such as retail and hospitality. Manufacturing XLI, +0.37% is the area I would focus on and there have been mixed signals there with regard to strength.â\u0080\u009d Trumpâ\u0080\u0099s response to the coronavirus pandemic has been sharply criticized, although he has often hailed his own management of the health crisis. To date, the U.S. has recorded more than 7.27 million cases of the coronavirus, with 207,808 related deaths, according to data compiled by Johns Hopkins University. In testing positive for the coronavirus, Trump, who is 74, follows U.K. Prime Minister Boris Johnson, 56, and Brazilian President Jair Bolsonaro, 65. The diagnosis forces investors to reassess the likelihood of a Biden victory and its implications for markets, since Trump was widely viewed as a business-friendly president and the former vice president was considered more likely to raise taxes and increase regulations. Midday Friday, Biden tweeted that he and his wife, Jill, had tested negative. Which stocks were in focus? Shares of avocado producer Mission Produce AVO, +2.20% were in focus on Friday after trading began on Thursday. The stock close 9.8% lower. Teslaâ\u0080\u0099s stock TSLA, +1.89% was in focus after the company released vehicle sales results, showing that the electric-vehicle marker sold some 124,100 Model 3s and Ys. The companyâ\u0080\u0099s shares were off 7.4%. Walmart WMT, +1.00% shares lost 1.8%, after the retailer on Friday announced a deal to sell its U.K. supermarket chain Asda, which finally rids the U.S. giant of a unit it has long wanted to sell. Uber Technologies UBER, -0.18% said it received $500 million for Uber Freight from Greenbriar. Shares closed up 1.6%. How did other markets trade? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% Â Â was 1.4 basis points higher at 0.692%, after initially selling off on the diagnosis news. Bond prices move inversely to yields. U.S. benchmark crude futures for November delivery CL.1, -1.62% Â CLX20, -1.62% fell 4.3% or $1.67 to settle at $37.05 a barrel on the New York Mercantile Exchange, the lowest close since Sept. 8,Â amid concerns about rising case counts.Â Gold futures for December delivery GCZ20, +2.17% fell $18.70, or nearly 0.5%, to settle at $1,907.60 an ounce on Comex as investors parsed the morning news, after rising 1.1% on Thursday. In global equities, the Stoxx Europe 600 index SXXP, +0.55% Â closed 0.3% higher, at 362.69, while the U.K.â\u0080\u0099s FTSE 100 UKX, +0.64% Â gained 0.4% to close at 5902.12. The ICE U.S. Dollar index DXY, -0.58%, Â Â a gauge of the greenbackâ\u0080\u0099s strength against a basket of currency trading partners, was up about 01.%, paring some slight gains from earlier. Read next: â\u0080\u0098Anything can happen:â\u0080\u0099 Why the hottest investing trend is playing it safe"}]}