{"article": [{"url": "https://www.marketwatch.com/story/the-covid-recession-has-decimated-some-states-but-barely-touched-others-11599743385", "published": 1599729440.0, "headline": "The COVID recession has decimated some states, but barely touched others", "body": "The unemployment rate varies from more than 15% in Massachusetts and New York to less than 5% in Utah and Nebraska. This is not a typical recession with a broad downturn. It’s a series of micro-recessions and micro-recoveries. When I first discussed this phenomenon, it was within the context of industries and categories. Some industries flourished while others foundered. Variance increases further when you delve into categories within those industries. However, the notion of micro-recessions and micro-recoveries is not limited to industry. States across the United States are experiencing a wide range of consequences from pandemic-related pressures. This is dependent on a number of factors, including the number of Covid-19 cases, response to the pandemic, and regional industries vulnerable to the novel coronavirus. Here are the most important factors to consider when evaluating geographic-based impact over the next few quarters. The Differences Between States Magnified The Philadelphia Federal Reserve’s coincident state indexes are a basket of state-specific indicators indexed to state gross domestic product, which are intended to demonstrate overall economic performance at the state level. This includes average hours, unemployment, wages and other indicators. Most states, with rare exceptions, are experiencing recession. More important, the gap between well-performing states and underperforming states has widened. This is nothing new. Gaps between well-performing and underperforming states have historically widened during recessions. This was the case during the double-dip recession of the 1980s, the recession of the 1990s, and the Great Recession of 2008-09. It’s important to note, though, that the divergence between well-performing and underperforming states is far greater during this recession than at any other time since the data became available in the 1980s—a 40-year sample of data. We have never seen such wide economic differences by geography in modern U.S. history; it has never been so important to customize a business strategy according to location. Pay Attention to States Reliant on Vulnerable Industries Tourism Industry Some states and regions are more reliant on industries that are especially vulnerable to the pandemic. The tourism industry is a good example of this phenomenon. As the pandemic took hold in the U.S., we saw the restaurant and hotels consistently drop off across the country, but as we’ve seen time and time again, we don’t come out of recessions the same way we go into them. The same can be said about economic shutdowns. We started to see pronounced variance when states began to reopen and those states that draw a higher percent of their income from out-of-state and international travel are showing particular challenges in the pace of their recovery. Naturally, restrictions around social distancing had an impact on restaurants, which were compelled to operate on a fraction of their capacity. The precise restrictions varied from state to state, but the data showed states that were more dependent on tourism have had a harder time restarting their restaurant industries. Hawaii, for example, depends on both domestic and international tourism, which in turn injects the local restaurant economy with an influx of consumer spending. The challenge Hawaii, Florida and other tourism-reliant states have moving forward is the uncertainty of travel. As we’ve seen in previous recessions, negative consumer sentiment tends to be a leading signal for discretionary spend across multiple tourism-related segments. This recession-minded consumer believes they are in the midst of a recession and the nature of the pandemic is encouraging people to stay closer to home, so less spending on tourism overall, and less of the dollars are spent away from a day’s drive. Given the nature of this recession, consumers are likely to feel uncertain for some time. As such, it is likely that consumers will be wary of plane travel beyond the health crisis, which will have lasting ramifications for tourism. The Energy Industry With many businesses shut down and millions of citizens required to shelter in place, energy consumption took a big hit. For example, North Dakota, which relies heavily on profits from shale oil extraction, was severely impacted. The question becomes, what will energy consumption be moving forward and will that continue to hurt oil production-heavy states? The answer hinges on the proverbial new normal we keep talking about. Initially, we as a society held our breath through the shutdown, waiting for things to go back to normal. As the health crisis has continued, however, consumers adopted new behaviors that could extend into this “new normal.” Consumers are ordering their groceries online, they’re working remotely, and they’ve grown more comfortable with telehealth. How many of these behaviors persist could have long-term implications for the oil and energy industry. Don’t Just Look at the Number of Covid Cases, Look at the Response The coronavirus has cascaded across the U.S. from region to region and state to state. As a result, states have experienced vastly different trajectories. Most seem to have the worst behind them while others are still contending with high numbers of new coronavirus cases. Where they are in the cycle of the pandemic has a bearing on economic prospects, but their response to the pandemic may have even greater bearing. For example, New York, once the epicenter of the pandemic, has effectively flattened the curve, but it’s come at a steep price. One-third of restaurants in New York are likely not to reopen after the pandemic. New Yorkers, having long coped with an exorbitant cost of living, are leaving the city in droves. Texas, by contrast, is in the thick of the pandemic, but is not experiencing the same economic woes because the state hasn’t enforced restrictions as severe as New York’s. Having said that, Texas is also dealing with an increased number of cases because of lax restrictions, which could have economic consequences moving forward. Winners and Losers of the Pandemic This pandemic-driven recession has created winners and losers. Some industries have found new growth opportunities while other industries have cratered. Some states, like Utah and Arkansas, are not currently experiencing recession while other states are reeling from economic shutdowns. This uneven distribution of economic gain and hardship should encourage businesses to pay special attention to state-specific and industry-specific indicators in planning for the remainder of 2020 and into 2021. Approaching this economic event as a series of micro-recessions and micro-recoveries will help you collect more relevant, actionable data, and could be the difference-maker that ensures your business ends up in the winners column. Andrew Duguay is the chief economist at Prevedere, an industry insights and predictive analytics company.More from Andrew Duguay: Why this unusual recession hammered Coke, but not Pepsi As the economy reopens, these three indicators will show the strength of the recovery To avoid a step backward, Congress must renew enhanced unemployment benefits"}]}