{"article": [{"url": "https://www.marketwatch.com/story/online-car-seller-gives-an-inside-look-at-the-pandemics-most-popular-path-to-going-public-11602182496", "published": 1602168560.0, "headline": "Online car seller gives an inside look at the pandemicâ\u0080\u0099s most popular path to going public", "body": "A concierge for Shift, an online used-car seller that is going SPAC-public. Shift Technologies Shift Technologies Inc. Chief Executive George Arison didnâ\u0080\u0099t even know what a SPAC was until last year. Now, his San Francisco-based online marketplace for used cars is hopping aboard the blank-check train on its way to becoming public.Â Special-purpose acquisition companies, also known as SPACs or blank-check companies, have been around for decades, but have made a big comeback this year amid the pandemic, thanks to low interest rates and stock-market volatility. Sports-betting operator DraftKings Inc. DKNG, -4.51%, Â electric-vehicle maker Nikola Corp. NKLA, -1.36%, electric-truck powertrain maker Hyliion Holdings Corp. HYLN, -3.94% and space-flight company Virgin Galactic Holdings Inc. SPCE, -3.12% are among the companies that have gone public via the SPAC route.Â SPACs raise money in an initial public offering, then look to buy businesses, usually within a couple of years. When a SPAC finds a business and successfully negotiates the transaction, the two merge and the acquired business becomes publicly traded. Shift is merging with Insurance Acquisition Corp. INSU, +3.47%, and is expected to be listed on the Nasdaq under a new ticker symbol, SFT, soon after the deal is approved by Insurance Acquisition shareholders in a vote Oct. 13. In other such recent deals, shares of the new company traded the day after the merger was approved. â\u0080\u009cPublic markets were hungry for a business like us,â\u0080\u009d Arison told MarketWatch in one of a series of interviews as he navigated the process. â\u0080\u009cPost-COVID in particular, e-commerce was among the winners. A SPAC would allow us to go public sooner.â\u0080\u009d See: When this California company tried to build a diverse board, â\u0080\u0098it was really hard to find peopleâ\u0080\u0099 The 6-year-old company wanted to seize the moment as going through the process of a traditional initial public offering, with its more involved disclosure rules, would probably have meant having to wait until next year, Arison said. Another advantage of a SPAC is that it allows companies with a valuation of under $1.5 billion to raise more money than in an IPO, he said. â\u0080\u009cIf youâ\u0080\u0099re a billion-dollar company, you maybe raise $100 million in an IPO vs. $300 million to $500 million in a SPAC,â\u0080\u009d he said. The â\u0080\u009cde-SPACâ\u0080\u009d process for Shift was made easier because of the lawyers, bankers and analysts the company worked with, Arison said. â\u0080\u009cGetting the right help is really critical, and donâ\u0080\u0099t assume you can do this all yourself,â\u0080\u009d he said. The company chose lawyers (Jenner & Block) and bankers (Wells Fargo) with relevant experience because â\u0080\u009cSPAC deals are a unique animal,â\u0080\u009d he said. Jose Cobos, chief revenue officer of private-equity marketplace Forge Global, said companies are going the SPAC route as opposed to a traditional IPO or direct listing â\u0080\u009cbecause of the lower cost when considering banking, legal and accounting fees as well as the â\u0080\u0098popâ\u0080\u0099 or discount.â\u0080\u009d For more: 2020 is the year of the SPAC, but traditional IPOs offer better returns There is also less guessing and anxiety involved. â\u0080\u009cFor a company considering a public listing, the SPAC route provides certainty on both valuation and minimum capital raise at the time the transaction is announced,â\u0080\u009d said Benjamin Kwasnick, founder of SPAC Research. â\u0080\u009cIn a regular-way IPO, a company wonâ\u0080\u0099t know those two things until the night the IPO prices.â\u0080\u009dÂ There is plenty of optimism about the online car-buying industry, including among Shiftâ\u0080\u0099s competitors: Carvana Co. CVNA said in August when it reported second-quarter earnings that it saw unprecedented demand and expected to set records in revenue and gross profit per unit in the third quarter.Â Its shares are up 145% so far this year, and have skyrocketed 232% over the past 52 weeks. Shift focuses on buying and selling low-priced used cars, and would-be buyers can request vehicles be brought to them for test drives. All that is serving the company well, especially during a pandemic, Arison said. â\u0080\u009cWe sell a different type of inventory than our competitors,â\u0080\u009d he said. â\u0080\u009cWe sell lots of value cars, older than eight years, with 80,000-plus miles.â\u0080\u009d Arison said 29% of Shiftâ\u0080\u0099s sales fall under that value category, which generally sell for under $10,000. In its investor presentation, Shift also cited a Capgemini survey that said 46% of U.S. adults surveyed said they planned to use cars more often than public transportation because of COVID-19. See also: With car dealerships closed, discounts on new and used cars are popping up online Other Shift competitors include Vroom Inc. VRM, -0.26%, Cars.com Inc. CARS, -2.80% and Amazon.com Inc. AMZN, +3.01% â\u0080\u0094 as well as CarMax KMX, -1.02% and AutoNation Inc. AN, -1.70%, which are huge retailers that also do business online â\u0080\u0094 although those are national companies and Arison stressed that Shift is focusing on the Western region. It buys and sells cars in California (Sacramento, San Francisco and the rest of the Bay Area, San Diego, Los Angeles), Oregon and is expanding to Washington state. Shift recently raised its third-quarter estimates 10%, to an adjusted gross profit of $3.9 million and adjusted gross profit per unit to $1,334.Â"}]}