{"article": [{"url": "https://www.marketwatch.com/story/virgin-galactic-reports-no-quarterly-revenue-as-it-continues-to-plan-for-liftoff-2020-08-03", "published": 1596530600.0, "headline": "Virgin Galactic plans to sell more stock after reporting no quarterly revenue; shares fall", "body": "Virgin Galactic Holdings Inc. reported no revenue in the second quarter and has collected less than $200,000 in 2020, but it expects to pull in millions more by selling fresh stock. The space-tourism company reported second-quarter losses of $62.5 million, or 30 cents a share, Monday afternoon after posting losses of 19 cents a share on sales of about $600,000 in the same quarter a year ago. In a filing with the Securities and Exchange Commission, the company also declared that it expects to sell roughly 20.5 million fresh shares, which would pull in almost $500 million at the going rate. Virgin Galactic shares SPCE, -3.12% declined as much as 9% in after-hours trading immediately following the release of the results and announcement of the stock offering. Virgin Galactic was taken public late last year through a special-purpose acquisition company, or SPAC, named Social Capital Hedosophia Holdings that was launched by venture-capital investor Chamath Palihapitiya, who remains chairman of the company. Shares have more than doubled since the SPAC merged with the space-tourism company to form a publicly traded entity, and the company was worth more than $5 billion as trading ended Monday with shares up 7% on the day. “We are making substantial progress across many areas of the company as we continue to focus on our path to commercial launch and the steps we are taking to get there, including conducting our first powered spaceflight from Spaceport America this fall,” Chief Executive Michael Colglazier said in a statement Monday. Colglazier, a former Walt Disney Co. DIS, +1.53% executive, was named the new CEO of Virgin Galactic last month, while former CEO George Whitesides became chief space officer. Earnings Watch: After Big Tech helped earnings look better, here comes Disney and Uber Virgin Galactic has not set an exact date for when it will begin taking tourists into space, but did unveil the interior of its spaceship last week and detailed what customers will experience on their trip. The company said in its stock filing that it expects to fly its founder, Richard Branson, into space in the first quarter of 2021 as long as planned test flights — including the one Colgazier mentioned in the fall — go as planned, with commercial flights launching afterward. Initial trips were sold for $250,000 apiece, and Virgin Galactic said Monday that it has received deposits for about 600 customers and faced “minimal” requests for refunds. A dozen customers entered into deposit agreements in the quarter, the company reported."}]}