{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-case-total-rises-to-23-million-and-dont-blame-more-testing-analyst-says-2020-06-22", "published": 1592840960.0, "headline": "Coronavirus update: Global case total tops 9 million and U.S. cases rises to 2.3 million, and don't blame more testing", "body": "The number of new cases of the coronavirus illness COVID-19 keep rising in the U.S., with signs of acceleration in half the states, including three states recording more than 3,000 new cases in a day, and it's not because there is more testing. A resurgence of COVID-19 cases is also occurring outside of the U.S., with the global case total topping 9 million. The World Health Organization reported on Sunday the largest one-day increase in cases, with Brazil and the U.S. leading the way. The U.S. remained by far the world's leader in overall cases and deaths, with both totals more than double that of Brazil. As the number of cases were seen rising, President Donald Trump on Saturday held a campaign rally at an indoor arena in Tulsa, Okla. Trump said at the rally, which far fewer people than projected by the campaign, that the increase in new cases was a result of more testing: \"So I said to my people, 'slow the testing down, please.'\" White House officials said after that his comments on testing were \"tongue-in-cheek.\" Don't miss: Fox News host Chris Wallace: Trump campaign looks 'silly' for now owning up to Tulsa rally's crowd size. See also: WHO chief warns leaders against 'politicizing' the coronavirus pandemic. Oklahoma is one of the states showing a surge in new cases, with a daily record 478 new cases on Sunday. That is more than five times the 91 new cases Oklahoma was seeing on June 1, which was when Phase 3 of the state's reopening plan launched. Oklahoma sees new high for COVID-19 cases Johns Hopkins University of Medicine Raymond James analyst Chris Meekins said identified cases last week increased to 9% from 8% the previous week, marking the first uptick seen in several weeks. He said an increase in positive text percentages are also being seen in a number of states, which indicates that rising infections \"are definitely NOT\" a result of more testing. \"Public health leaders across the country are playing an extended game of\" Whac-A-Mole, where \"clusters of the virus will pop up; they do their jobs and control the spread, only to have new cases pop up elsewhere,\" Meekins wrote in a note to clients. Arizona new COVID-19 cases keeps climbing to fresh peaks Johns Hopkins University of Medicine Trump will next attend a rally in Phoenix, Ariz., on Tuesday, a state that is also seeing a spike in new cases to new daily records. Separately, the White House said it was scaling back temperature checks for people entering the grounds, although people in close proximity to Trump and Vice President Mike Pence will still receive COVID-19 tests. And on Sunday, White House trade advisor Peter Navarro said on CNN that stockpiles were being filled in anticipation of a possible second coronavirus wave in the fall. Meanwhile, Wall Street seemed to focus more on hopes of a recovery, rather than the rising case and death totals. The Dow Jones Industrial Average DJIA, +0.56%  rose 92 points, or 0.4% in afternoon trading, while the S&P 500 index SPX, +0.87%  gained 0.4% and the Nasdaq Composite Index COMP, +1.39%  climbed 0.8%. See Market Snapshot.Latest tallies The global COVID-19 case tally increased to 9,008,850 million on Monday afternoon, while the death toll rose to 469,220, according to data aggregated by Johns Hopkins University. About 4.47 million people have recovered. The U.S.'s case and death tolls continue to lead the world by a large margin, with COVID-19 cases growing to 2.29 million and the number of deaths rising to 120,121. About 622,000 people have recovered, the Johns Hopkins data shows. There are 25 states that showed an increasing trend in cases this past week, with Florida, Texas and California leading the way, with each state recording more than 3,300 new cases on Sunday alone. There are 19 states showing a decline in the trend of new cases, as well as the District of Columbia, while 6 states are flat. See related: As coronavirus cases surge, California is the latest state to require face masks - here's why other states may want to follow its lead. New York City, the early epicenter of the outbreak in the U.S., entered Phase 2 of its reopening on Monday, which includes retail stores, hair salons and barbershops, as COVID-19 cases and death tolls continue to fall. New York's new COVID-19 cases keep falling Johns Hopkins University of Medicine Outside the U.S., Brazil remained the new hot spot, with cases climbing to 1.08 million cases and deaths rising to 50,591. Also read: Brazilian doctors fume as President Bolsonaro gets rap for eating hot dogs while COVID-19 cases are on track to pas U.S. Russia has the highest case tally in Europe with 591,465, while the U.K. leads the region in fatalities with 42,731. The U.K. has 306,761 cases, while Russia has recorded 8,196 deaths. Early hot spot Spain was eighth in the world in cases with 246,504, and with a death toll of 28,324, while Italy has 238,720 cases and 34,657 deaths. France has 197,008 cases and 29,643 deaths, while Germany has 191,768 cases and 8,899 deaths. Elsewhere, India has 425,282 cases and 13,699 deaths, Peru has 251,338 cases and 7,861 deaths, Canada has 103,292 cases and 8,487 deaths and Mexico has 180,545 cases and 21,825. China, where the illness was first reported last year, has seen a cluster of new cases, with the tally at 84,610 and deaths at 4,639. Coronavirus Update: TikTok Users Target Tulsa Rally, China Halts Tyson Imports Latest medical news Gilead Sciences Inc. GILD, +0.82%  said Monday that it plans to start Phase 1 clinical trials for an inhaled version of remdesivir, its treatment for severely ill COVID-19 patients. An intravenous version of the drug received emergency use authorization from the Food and Drug Administration in May. The new study will first test this version of the investigational medication in healthy patients before moving on to COVID-19 patients. It is thought that an inhaled drug would be easier to administer outside of a hospital setting. \"That could have significant implications in helping to stem the tide of the pandemic,\" CEO Daniel O'Day said in a letter on Monday. The Food and Drug Administration issued a warning over the weekend on nine alcohol-based hand sanitizers made by Eskbiochem SA de CV in Mexico, because they may contain wood methanol, a possibly toxic substance.What the economy is saying? Sales of previously-owned homes dropped 9.7% in May, as the real-estate market continued to be weighed down by the COVID-19 pandemic, the National Association of Realtors reported on Monday. The seasonally-adjusted annual pace of existing-home sales fell to a 10-year low of 3.91 million, the NAR report showed. Meanwhile, the median existing-home price rose 2.3% from a year ago to $284,600. Also, the Chicago Federal Reserve's national activity index recovered to a record-high 2.61 in May, from a record-low negative 17.89 in April. A zero value for the index indicates the national economy is expanding at its historical trend rate of growth.What companies are saying? â\u0080¢ Carnival Corp. CCL, +0.51%  extended the operational pause of its cruises in North America to Sept. 30, marking the third time it has extended the pause since the original announcement of a pause on March 13 as a result of the COVID-19 pandemic. The announcement follows fellow cruise operator Norwegian Cruise Line Holdings Ltd.'s NCLH, +2.91%  announcement last week that it was halting voyages through Sept. 30. â\u0080¢ Alaska Air Group Inc. ALK, +0.15%  expects June revenue to improve to being down about 80% from a year ago, following May revenue being down 83% and April revenue down 87%. The air carrier said so-called load factor, the proportion of seats sold, is expected to improve to about 50% to 55%, from 40% in May and 15% in April. Available seat miles, or capacity, is expected to be down 70% in June, after being down 79% in May, while revenue passengers is expected to improve to being down 80% to 85% in June from down 90% in May. The company said despite the signs of recovery seen starting in May, second-quarter demand remains significantly below historic levels as a result of the COVID-19 pandemic, and the third quarter is expected to be \"significantly adversely impacted\" as well. The company said it has parked 156 mainline aircrafts, including permanently removing 12 Airbus aircrafts. â\u0080¢ Royal Caribbean Cruises Ltd. RCL, +2.59%  said its Spanish cruise line Pullmantur Cruceros joint venture with Cruises Investment Holding has filed for reorganization under terms of Spanish insolvency laws, citing the impact of the COVID-19 pandemic. Royal owned 49% of the JV, and Cruises Investment owned the rest. Pullmantur had canceled all sailings through November as a result of the pandemic. \"Despite the great progress the Company made to achieve a turnaround in 2019 and its huge engagement and best efforts of its dedicated employees, the headwinds caused by the pandemic are too strong for Pullmantur to overcome without a reorganization,\" Pullmantur's board of directors said in a statement â\u0080¢ Bed Bath & Beyond Inc. BBBY, -1.37%  executed an $850 million asset-based credit facility, expiring in 2023, to further strengthen its liquidity position amid the \"unparalleled challenge\" resulting from the COVID-19 pandemic. \"While the impact of the COVID-19 situation has been felt across our business, we have taken measured, purposeful steps to maintain our financial flexibility,\" said Chief Executive Mark Tritton. \"We ended our fiscal 2020 first quarter with approximately $1.2 billion in cash and investments, and we now have access to additional liquidity through our new ABL facility.\" Separately, the company said it expects 95% of its stores to be reopened by the end of this week and nearly all of its stores to reopen by July. â\u0080¢ Sherwin-Williams Co. SHW, +1.47%  raised its second-quarter sales outlook, and now expects a decline in the mid-single-digit percentage range from a year ago. The paint seller had previously expected a decline in the low to mid-teens percentage range. The current FactSet consensus for second-quarter revenue of $4.33 billion implies an 11.2% decline. The company also raised the sales outlook for its Americas Group and Consumer Brands Group business segments, as moving to curbside pickup and the e-commerce business helped stem the COVID-19 pandemic's effect on business, but maintained its outlook for the Performance Coatings Group. The company said its automotive refinish business remains under pressure, and recovery is sluggish in its general industrial and industrial wood businesses â\u0080¢ TripAdvisor Inc. TRIP, +0.74%  expects June revenue to be about 20% of last year's comparable period total as the coronavirus slowdown in the travel sector continues to hurt results. April and May revenue totaled about 10% of the 2019 comparable period. Monthly unique users in April were 33% versus last year, May was 45%, and June month-to-date is showing further improvement. TripAdvisor has announced significant staff cuts and other actions to manage costs. TripAdvisor said it still believes it has sufficient liquidity to withstand a period of revenue disruption and meet its debt covenants in 2020 and 2021, though it may consider measures to raise capital in the future."}]}