{"article": [{"url": "https://www.marketwatch.com/story/postal-service-chief-clashes-with-house-democrats-upset-with-his-cost-cuts-and-policy-changes-2020-08-24", "published": 1598285600.0, "headline": "Postal Service chief clashes with House Democrats who say his cost cuts and policy changes are red flags", "body": "Louis DeJoy, the embattled postmaster general, clashed repeatedly on Monday with House Democrats, who are livid over the delays caused by his cost-cutting and operational changes. “One can only reach two conclusions. One, either through gross incompetence you have ended the 240-year history of delivering the mail reliably on time, or the second conclusion that we could gather is that you’re doing this on purpose,” said Rep. Stephen Lynch, a Democrat from Massachusetts. “What the heck are you doing?” DeJoy shot back that Lynch’s accusations were outrageous. The two then exchanged angry words before Rep. Carolyn Maloney, who chairs the House Oversight Committee, banged her gavel. DeJoy has said he was confident the Postal Service could handle November’s mail-in ballots. Things did not get any easier for DeJoy after his clash with Lynch. The Democrats’ ire has been fueled in part by President Donald Trump’s attack on plans for widespread mail-in voting this November. Rep. Jim Cooper, a Democrat from Tennessee, cited reports that, under DeJoy’s operational changes, 53-foot mail trucks in Nashville were forced to leave on schedule even when completely empty. “Your so-called reforms ... are not efficiency — that’s insanity,” Cooper said. Cooper said DeJoy’s reforms unilaterally moved up Election Day from Nov. 3 to something like Oct. 27. Cooper asked DeJoy, who worked with Trump’s 2016 campaign, if he had illegally reimbursed contributions to the Trump campaign from his subordinates. “That’s a outrageous claim, sir, and I resent it. What are you accusing me of?” DeJoy said. “Am I the only one in this room that understands that we have a $10 billion-a-year loss?” DeJoy asked rhetorically. “Is your backup plan to be pardoned, like Roger Stone?” Cooper asked. “I have no comment on that. It’s not worth a comment,” DeJoy replied Republicans on the House panel at first struck a bemused tone toward the hearing and the attacks on DeJoy, but their anger rose as the hearing went on. “They’re out to get you,” said Rep. Jim Jordan, a Republican from Ohio. “They know President Trump is going to win, and they want to keep counting.” The House on Saturday passed legislation to grant the Postal Service $25 billion in funds and to prioritize election-related mail. Democrats were joined by 26 Republicans in supporting the measure. White House chief of staff Mark Meadows said the House’s Postal Service legislation “is going nowhere.” He suggested that Senate Republicans pass their own post-office reform measure. Some of the more progressive Democrats urged DeJoy to resign, but he rejected these calls. “I don’t see why I would commit here right now to resigning for any reason,” DeJoy said, in response to a suggestion by Rep. Katie Porter, Democrat of California, that he step down."}]}