{"article": [{"url": "https://www.marketwatch.com/story/how-millennials-and-gen-zers-can-talk-about-race-and-racism-so-their-parents-and-grandparents-will-listen-2020-07-15", "published": 1595062940.0, "headline": "These tips can help millennials and Gen-Zers make their point on Black Lives Matter and racism to their boomer elders", "body": "It’s said that people fear loss more than change. In other words, we can handle change unless we feel we’re giving something up. This gut reaction is related to research done with investors that shows the pain of loss is greater than the pleasure of a gain. Remember that humans are hard-wired to avoid pain. Since it feels worse to be a loser than a winner, we’re going to resist anything that even hints at loss. This is important to keep in mind as Americans confront racial inequality and racism — and their part in it. How you look at these issues and your openness to them — and changes — is frequently a matter of when you were born. Older Americans in particular often see sweeping, swift social change as challenging the familiar order of their world. That’s understandably upsetting and even frightening. Accordingly, Black Lives Matter and other social justice causes in their view are a threat to what older people have and how they envision leaving the world. At the extreme, these societal changes are a referendum on their very character. Younger people, in contrast, have grown up in a more inclusive, multiracial America. They are looking to make their own mark on the world, to reshape it in their image — just as their parents and grandparents did before them. This is as true in 2020 as it was in 1970 and 1920. Yet the generation gap in America today seems more cavernous, especially around equality and other racial and gender issues. Therein lies opportunity. With mediation and moderation, a generational divide can be bridged and legitimate differences can be discussed, says Ken Dychtwald, a psychologist who has been leading a global conversation about aging well and healthy life transitions for almost half a century. In this recent interview with MarketWatch, Dychtwald focuses on older Americans and offers advice to younger people on how to better understand their elders and communicate with them calmly and effectively. He provides tools for all of us — young and old — to loosen deep-seated beliefs and prejudices and biases, without fear that we’ll be humiliated or vilified. That said, Dychtwald maintains that it’s incumbent on older people — those who hold more money and power — to better understand and even embrace the progressive, pluralistic views of younger generations. Resistance to change only keeps us stuck. How do we age with grace and compassion? How do we become comfortable with change, and realize that jettisoning behaviors and beliefs which no longer work can create a more perfect union? These are two life questions Dychtwald has been addressing throughout his long career, and his answers are worth considering if our goal is to improve our relationships with others, no matter when they were born. The interview has been edited for length and clarity. “ Our biases, stereotypes and prejudices from an earlier time, to some extent, persist. ” MarketWatch: People in the United States are anything but united these days, hyperfocused as we are on divisions — racial, economic, gender. One other clear divide is around age. Young and old Americans seem to live on different planets. And while there will always be a “generation gap,” why does it appear so much more consequential and isolating now? Dychtwald: It's a challenge and an opportunity to have five adult generations alive at the same time, each with its own historical anchoring and each with its own aspirations and biases. We talk about baby boomers or the “Greatest Generation” or Gen-Xers or Gen-Zers, and what do we mean? The essence of it is that throughout most of history, a key question to ask someone to gain a strong sense of who they are and what they believed and valued was “where are you from?” Nowadays, “when are you from?” can be an even more useful question to ask. Because when we grow up, our formative years — up until our early 20s — are heavily influenced by our parents, their values, their language, what they do, but also by the music, the style of the times, the roles of women and men, for example, and the role of technology in our lives. So when we think about who we are as people, with the accelerating speed of life, the “when we are from” is increasingly consequential. For example, if you were to ask me “Who are your favorite musicians right now?” I would tell you my favorite guitar player was, and remains Jimi Hendrix, and my favorite singers were and remain David Ruffin of The Temptations and Van Morrison. Most people still like the music that was popular when they were teenagers as their preferred music. We kind of laugh at that, but if you grew up in a world in which women were supposed to function a certain way and men another way, that's baked into you as well. Q: Yet attitudes are changing in the U.S. Younger Americans are more likely to be tolerant of how others look and act. Older people, not as much. Do the data and research confirm this? Dychtwald: Yes. The speed with which change is occurring is dizzying, and this can be difficult for people who still have a big portion of themselves anchored in an earlier era. Our biases, stereotypes and prejudices from an earlier time, to some extent, persist. So even though we're all living in 2020, the household we might have grown up in, let's say those of us who were older, may have had an attitude and a point of view about people from Asia, or Mexico or African-Americans. If we grew up experiencing those biases and hearing the feelings that our parents might have felt about those groups, to some extent that's still living inside of us. And it's not only what we might have picked up from our parents. I was born in 1950 and growing up I liked to watch the “Leave it to Beaver” TV show. The Cleaver family had no black friends or work associates. The early decades of modern media were incredibly racist, both by commission as well as omission. In the U.S., the young generation, Gen Z, is only 50% white, and is now 26% Hispanic, 14% black, and 5% Asian, according to the 2018 U.S. Census. If you grow up in Generation Z, you are likely to be fully familiar with multi-racial families, and you are so accustomed to diversity, in the music you listen to, the movies and the TV shows you watch and your friends at school and your neighbors. Young people are far more used to a diverse cultural make-up. From their vantage point, it's just normal. It's the melting pot that America always said it was hoping for. But then look at millennials, who are 56% white. Like Gen Zers, their schoolteachers were, in all likelihood multi-ethnic, as were their neighborhoods, the sports teams they played on, the books they read, and the songs they like to sing. Then look at Gen-Xers: 60% white. Boomers: 74% white. Silent Generation: 79% white. “ To be over 75 in America means that you grew up in a different world. ” To be over 75 in America means that you grew up in a different world, one that was nearly 80% white. You probably didn't have that much contact with people of color. You probably didn't have many friends who weren't white. The so-called minority groups may have found themselves working hard to live the American dream, but they were a small portion of the population and not one that white people were necessarily familiar or empathetic with. Q: Let’s look deeper at attitudes towards race among age groups. When it comes to diversity and racial equity, what do older people need to understand about young people? Dychtwald: For young people today, diversity is not something they think about or take note of, which is what often older people have to stop and do. Diversity is simply the way it is for young people. It's like the air they breathe. It's like having 500 flavors of ice cream, where when I was growing up, there were only a handful. To be young is to have a greater sense of connectivity and interrelationship between different kinds of people and frankly more fluidity in so many ways. But if you jump to our older generations, let's say Boomers and the Silent Generation, diversity is, for most, less-familiar, less comfortable territory. Which means that 60- and 70- and 80-year-olds have to really take stock of themselves and recognize that either consciously or unconsciously, they may be living and feeling and thinking in a biased way, holding onto prejudices from another time that were wrong then — and wrong today. Things are changing so fast, and our racial and lifestyle and religious make-ups are shifting, generation to generation. I think this is one of the drivers for why many — not all — but many older people are alienated, entrenched, or worse, antagonistic to this new American cultural tapestry that's emerging. Q: Why should older people have to ‘take stock’ and have a responsibility to younger generations? Most people in or near retirement have worked a lifetime, raised a family, and spend time with their children and grandchildren. They’re done. Why can’t young people take care of themselves? Dychtwald: As we get older, while we might be retiring from our jobs, it's not a time to take a 20-plus- year vacation break from citizenship. It’s unfortunate that so many older men and women try to wind the clock backwards and live in the past, with yesterday’s fashions, yesterday’s technologies and yesterday’s racial make-up. Rather, with all of the new longevity and a lifetime of experience, modern elderhood should be the time to become generative, to give back, and not just to give back to your own kin but to give back to communities and society at large. And let’s not forget, it’s today’s young people that are contributing to our Social Security and Medicare benefits. People will often say, oh, I'm very connected with young people, I talk to my kids and grandkids all the time. You don't hear that many older people saying, “I really have a lot of involvement with younger people from other neighborhoods, other races, other countries and other backgrounds.” Q: If someone wants to break their own pattern and broaden their worldview, or talk honestly about race and racism with family and friends, what steps can they take? Dychtwald: One way is self-review. Taking advantage of the cocooning that COVID-19 has catalyzed to reflect on how we can emerge as better versions of ourselves. For example, as a 70-year-old boomer myself, I’ve concluded that it's not enough for me to have lived my life embedded in my era; I need to take stock of myself and find ways to become more connected and aware of what young people are thinking and feeling, their hopes as well as their fears. Another approach is through education. How do we educate people? I am a big supporter of global travel — which I sure hope we’re allowed to do again before too long. You go to another country, meet the people, dance their dances, eat their food, watch their TV shows, and you get a little more outside of the box you've grown up in. Of course, you can also read, watch shows outside of your usual choices, or even take classes with the intent to expand yourself. “ Grown-ups should not be turning the world into a political version of Wrestlemania. ” Another approach is confrontation, preferably respectfully handled. Think about the trials and tribulations of any marriage or friendship. If somebody's off-kilter or they're not paying attention, sometimes you’ve got to say, “Hey, I don't agree. Snap out of it!” Think of the way people get confronted when there's a medical diagnosis. Many people live without taking much care of their health. They usually know what they ought to be doing, but they don't do it. Then you get a scary diagnosis — or you just had a stroke, or you are diabetic, or your brother just had a heart attack. That’s a confrontation and a wake-up call to reconsider lots of things. With all of today’s divisiveness, we grown-ups should not be turning the world into a political version of Wrestlemania, but as a national community that’s hurting and could benefit from some healing guidance. Last is an intervention. Think about it: If I'm addicted to an opioid, it's not enough to simply say I'm an opioid addict. I'm addicted to it. I'm connected to it. I'm doing a dance with it that I can't release. A powerful intervention can cause me to realize how important it is for me to break free of that addiction, to realize that I'll be a better person if I can break this habit. A lot of people are addicted to their racist prejudices and may not even realize it, and they might even surround themselves with other people who are similarly addicted. So how do you get people, either individually or as a group, to recognize this? There’s no question that the Black Lives Matter movement is attempting to provide an intervention to both white people and Black people in America. Also, maybe folks can have their kids talk to them and really listen to what they have to say; maybe it's by having them watch certain programs; or by purposely interacting with people of other races or backgrounds in order to better understand them. It's not just Black/white. It's the realization that many of our views and our personal narratives, the story that goes on inside our mind, by which we evaluate and judge, were shaped in a different time in history. Q: What do young people need to know about older people so they can find common ground on issues of race and racism? Dychtwald: Older people often say they don't wish for young people to push them to the sidelines, but during my 45 years as a psychologist and gerontologist studying these dynamics, I’ve repeatedly seen that many older people — usually unknowingly — move themselves to the sidelines. They do this by not staying modern, by not staying current, by not being comfortable and fluent with the latest technology and sociology. By not being aware of the issues of young people, older people relegate themselves to the sidelines, and then they get frustrated and anxious when they feel marginalized and see that people at the center of the playing field don't necessarily think or feel the way they do. “ A defect of our modern society is that we have allowed the segregation of generations. ” A defect of our modern society is that we have allowed the segregation of generations. Young people go to school with young people; colleges don't have many retirees back on campus, older people are discharged from the workforce. So you can have work teams with no older people on them. Our faith leaders don't talk about inter-generational connections enough, don’t introduce ideas and understanding about where we might be unjust and not functioning in the highest possible way. It's not simply that we’ve got to get grandma to sit down and understand what's wrong about things. We need public forums. We need to call these issues out. Only 62% of people over 75 are on the internet, and only 28% of them feel comfortable with social media. What we've created is segregation by age, and what we need is for all generations to interact more. That will bring more much-needed awareness and empathy, which hopefully can lead to wiser and more thoughtful conclusions which respect our many differences and interdependencies. So rather than older people going off to play golf and thinking, “It's not my problem, I already served my time as a worker and a parent,” I believe it is the role of elders to bring together the tribes and to work shoulder to shoulder with younger generations to build new multi-racial, multi-ethnic, multi-generational communities. This is not a call to vacation. It's a call to action. We're all in this, and we've all got to be a part of the fix. Ken Dychtwald is a psychologist, gerontologist and founder and CEO of Age Wave, a think tank that conducts field research and provides consulting services to corporations and non-profit organizations worldwide on aging and longevity-related issues. He is the author of 17 books including the newly published “What Retirees Want: A Holistic View of Life’s Third Age” co-authored with Robert Morison. More:There’s only one generation in U.S. history that’s considered to be more unlucky than the ‘Lost Generation’ Also read: 6 ways to invest in racial justice"}]}