{"article": [{"url": "https://www.marketwatch.com/story/higher-gas-prices-trigger-first-increase-in-consumer-inflation-in-four-months-2020-07-14", "published": 1594720100.0, "headline": "Higher gas and food prices trigger first increase in U.S. consumer inflation in 4 months", "body": "The numbers: The cost of consumer goods and services rose in June for the first time in four months largely because of higher gasoline and food prices, but inflation more broadly remained low and is likely to stay that way during the pandemic. The consumer price index jumped 0.6% last month to match the biggest increase since 2012, the government said Tuesday. About half of the increase traced to higher gas prices. Yet even after the latest increase, inflation has risen less than 1% in the past year. By contrast, inflation was running at a 2.5% clip shortly before the pandemic struck. Another measure of inflation that strips out volatile gas and food prices, known as core CPI, rose a smaller 0.2% in June. It had declined three months in a row for the first time since the government began compiling the number in 1957. Read:Small businesses more optimistic, NFIB says, but coronavirus threatens fresh pain What happened: The cost of gasoline jumped 12.3% after oil prices continued to rebound from a multi-year low. Gasoline is still fairly cheap, however, with prices down more than 23% compared to a year earlier. The pandemic has crippled travel, hurt global trade and kept many drivers off the road. The cost of food rose again, up a sharp 0.6% in June. Consumers are paying more for certain products that are in high demand or face sporadic shortages because of viral outbreaks at meat-packing plants or other food-manufacturing sites. People are also eating more at home with indoor dining off limits at most restaurants. That’s also led to higher prices. As a result, groceries prices have surged during the pandemic. The cost of what the government calls “food at home” has risen at a 5.6% yearly pace — the highest since 2011. The increase in prices tapered off in June, but it remains to be seen if prices continue to recede. Read:Online food prices jump as food companies struggle to meet demand Prices also rose for car insurance, clothing, medical care and shelter. Yet rents only rose 0.1%, marking the smallest increase in nine years. Millions of Americans have lost their jobs and fallen behind on rent and landlords aren’t in a position to raise prices. The cost of used vehicles, recreation and Internet and phone services all declined. Big picture: Inflation poses little threat to the economy right now and is expected to remain low until the pandemic ends and the threat from the coronavirus fades. Although consumers are paying more for groceries and a few other things, the prices of goods and services have declined owing to a lack of demand. The Federal Reserve has cut a key short-term interest rate to near zero and has no plans to raise rates for the next year or two. What they are saying? “Despite supply constraints for some goods and improving post-lockdown demand for all goods, any short-term inflation pressures are bound to fade as jobs and GDP are both going to take some time to completely recover their recession losses,” said deputy chief economist Michael Gregory at BMO Capital Markets. “Inflation is not going to be an issue for a long while.” Market reaction: The Dow Jones Industrial Average DJIA, +0.56% fell slightly and S&P 500 SPX, +0.87% were set to open higher in Tuesday trades."}]}