{"article": [{"url": "https://www.marketwatch.com/story/how-the-pandemic-has-changed-tech-in-its-first-100-days-2020-06-18", "published": 1592657480.0, "headline": "How the pandemic has changed tech in its first 100 days", "body": "When COVID-19 began to spread publicly in the U.S., predictions were grim and quickly ended a bull market in technology that had lasted more than a decade. One hundred days after the World Health Organization declared the coronavirus a worldwide pandemic, tech stocks have bounced back along with companies’ supply chains and executives’ bright outlooks. Silicon Valley leaders — cautious to make dramatic pronouncements in the opening weeks — now say their long-predicted remaking of the U.S. corporate machine into a cloud-enabled, work-from-anywhere workforce with constant access to intelligent tools has only been accelerated by the response to the disease. Read: Here are the best and worst stocks during the first 100 days of the coronavirus pandemic Data show a more nuanced shift in U.S. tech behavior, one that does benefit newer technologies that seem to be tailor-made for a population trapped at home with an internet connection: Endless streaming media, instant video chats with friends anywhere in the world, constant connections to coworkers. While consumer adoption of those technologies, and a larger enterprise shift toward cloud computing and software, is likely to be long-lasting, demand for other tech products — especially hardware — is an open question. We are now 100 days into the pandemic: A by-the-numbers look at COVID-19’s toll on American lives and livelihoods In the first quarter, sales in the information-technology sector of the S&P 500 SPX, +0.87% index rose 4.3%, less than the expected 6.7% but stronger than a slight contraction in the first quarter of 2019. The first quarter comprised only the first three weeks of the pandemic, so second-quarter numbers will be more telling — analysts are currently modeling a decline of less than 1%, third-best of the S&P’s 11 segments. The IT sector has the two most valuable tech companies in the U.S., Apple Inc. AAPL, +1.74% and Microsoft Corp. MSFT, +2.48%, but it would likely be expected to grow if it still included Amazon.com Inc. AMZN, +3.01%, Facebook Inc. FB, +0.26% and Netflix Inc. NFLX, +1.43% Amazon alone is expected to grow sales more than 27% in the second quarter, as e-commerce deliveries and cloud computing power experience large demand spikes. With workers returning to offices and stores reopening across the U.S., it is hard to predict how tech’s lessons from the past 100 days will relate to coming days, but they do show investors what some companies stand to gain and lose.Big Tech appears to be just fine Apple, Microsoft, Amazon, Alphabet Inc. GOOGL, +1.82% GOOG, +1.97% and Facebook were worth a combined $4.8 trillion at the end of trading March 10, the day before WHO’s declared an official pandemic. On Wednesday, they closed at a combined valuation of roughly $6 trillion. That extra $1 trillion-plus is the confidence investors have put into the continued resilience of the five Big Tech companies, which have established businesses in hot areas along with vast resources and customers and may only be rivaled by each other. Amazon dominates cloud computing, but faces growing threats from Microsoft and Google; Facebook and Google command much of the online-advertising market, but Amazon is a growing force there; Facebook and Google both want to establish videoconferencing beachheads to rival Apple’s FaceTime. See also: MarketWatch’s coronavirus recovery tracker Amazon and Microsoft especially seem secure, although Amazon will spend its operating profit in an attempt to bolster its operations. Google and Facebook’s reliance on a shaky market for online advertisements could be worrisome, but Google has YouTube and the growing cloud business to soften the blow while Facebook’s rivals will certainly weather rougher storms than the social-media juggernaut. That leaves Apple. Consumers aren’t as likely to make big device purchases given financial uncertainty and temporary retail store closures, and that could continue to weigh on the iPhone maker’s business. The company saw a 6% drop in iPhone sales last quarter, and analysts expect a 16% drop in the current period. While the smartphone giant eked out positive overall revenue growth for the March quarter, sales are expected to turn negative this time around. All but Microsoft may face more uncertainty from other factors than COVID-19. Antitrust and other regulatory investigations continue into Alphabet, Amazon, Apple and Facebook around the globe, and the growing importance of these companies in this time could expose even more tender targets. Don’t miss: Justice Department proposes limiting internet companies’ protections A Zoom boom in collaboration and videoconferencing software “Zoom” became a verb in the first 100 days of the pandemic, showing how software previously known largely to certain industries and finance nerds could explode into public consciousness when the need arises. Zoom Video Communications Inc. ZM, +2.89% saw 300 million daily meeting participants at its peak in recent weeks, more than 30 times its 2019 peak of roughly 10 million. Software meant to help coworkers and others communicate seamlessly from anywhere was broadly strong in reaction to a work-from home environment. Slack Technologies Inc. WORK, +3.36% had a record April quarter as well, adding 12,000 new paying customers compared with 5,000 in each of the prior two quarters. The key for both Slack and Zoom will be finding ways to convince free customers to pay up for these services even once employees start returning to the workplace again in large numbers, and battling a suddenly relevant Microsoft Teams offering, that attempts to combine their core features and another tech titan. Teams had 75 million daily active users as of Microsoft’s last earnings call, up from 32 million on March 11, while Cisco Systems Inc.’s CSCO, +0.15% Webex had “well over” 500 million meeting participants throughout April, more than triple its February volume. Zoom, Slack and other young software names that have found success will have to fight hard against those entrenched interests to retain their gains. Videogames move further into mainstream with streaming media Netflix had its biggest quarter ever, but must compete with a host of new rivals that were in the works well before the pandemic, and the struggles of Quibi show that success is unlikely to be universal. Videogame publishers, however, have showed broad gains as people hunkered down in their homes look for entertainment. April spending on gaming hardware, software, and game cards rose 73% from a year earlier to $1.5 billion, according to the NPD Group, while May spending climbed 52% to $1.2 billion. Both were record figures for their respective months. Nintendo Co. Ltd.’s NTDOY, -0.10% Switch console was the top-selling hardware in units and dollar volume for April and May, with unit sales the best for any May since the Nintendo DS was hot in 2009, pushing Nintendo stock to a decade-high. The two largest public videogame publishers, Electronic Arts Inc. EA, +1.15% and Activision Blizzard Inc. ATVI, +0.52% , are up on the year and chasing highs set in 2019, while Take Two Interactive Software Inc. TTWO, +0.76% and Zynga Inc. ZNGA, +0.10% trade at records. The maker of “Fortnite” was recently valued at $17 billion, higher than either Take-Two or Zynga. Electronic Arts Chief Executive Blake Jorgensen told investors that sports fans were flocking to its “Madden,” “FIFA,” and “NHL” titles as substitutes for watching live sporting events. Take-Two Chief Executive Strauss Zelnick said nearly all of the company’s titles outperformed in the first quarter, while Activision Chief Executive Bobby Kotick said that first-quarter net bookings hit “new heights” across the mobile, console, and PC platforms. The question is how engaged players will stay with states opening up again and easing restrictions on social activities outside the home. “The video game market has historically proven resilient as players have seen games as a relatively inexpensive form of entertainment,” Jorgensen said on EA’s earnings call.Hard times for hardware This year isn’t expected to be pretty for hardware sales across the board despite some short-term benefits from the rush to equip remote work spaces. Smartphone shipments could plummet 11.9% this year to 1.2 billion, according to market researchers at IDC who see a “global demand-side problem.” That’s down from the 2.3% decline that IDC analysts had been expecting as of late February, before the COVID-19 outbreak accelerated in the U.S. And the analysts had actually predicted as of late last year that the smartphone industry would return to growth for 2020 based on optimism about more widespread 5G availability. The first quarter witnessed the largest year-over-year drop in smartphone shipments on record, according to IDC. PC shipments could drop 12.4% to 360.9 million units, per the latest IDC projections. The analysts say consumers may focus on buying staples rather than new electronics given economic uncertainties, while businesses may curb tech purchases as they “struggle to keep the lights on.” The analysts were predicting a 9% decline back in February and a 7% decline as of November."}]}