{"article": [{"url": "https://www.marketwatch.com/story/yes-the-u-s-economy-really-does-need-more-fiscal-stimulus-and-the-stock-market-knows-it-11600461677", "published": 1600504700.0, "headline": "Yes, the U.S. economy really does need more fiscal stimulus â\u0080\u0093 and the stock market knows it", "body": "A reflection of the United States Capitol makes Washington seem upside down. Stefani Reynolds/Getty Images Remember the massive disconnect between the real economy and the stock market? It was the story of the spring: all of a sudden a terrifying virus was stalking the land, tens of millions of Americans were jobless, businesses were shuttered, and government officials were reeling to get control of the situation. Yet despite it all, after crashing in March, U.S. stocks spent the next few months roaring higher. See: 16 million people just got laid off but U.S. stocks had their best week in 45 years That narrative has receded as time has passed. As the economy â\u0080\u009cre-opens,â\u0080\u009d after all, it makes sense to see financial markets pushing higher. But the foundation underpinning the recent recovery is shaky, according to several analysts, and many believe that both the economy and financial markets will need more government help â\u0080\u0093 fiscal stimulus â\u0080\u0093 to continue to make gains. â\u0080\u009cThere has always been a reckoning that needs to occur which has not yet taken place,â\u0080\u009d said Steve Blitz, chief US economist for TS Lombard. â\u0080\u009cAnd that is the possibility of an extended recessionary environment. Because most people believe this is a COVID cycle as opposed to a true economic cycle, the forward sentiment never dropped like it would in a regular recession.â\u0080\u009d By â\u0080\u009cCOVID cycle,â\u0080\u009d Blitz means changes in economic activity dictated by the need to control the spread of the virus: short-term business closures, temporary layoffs, and so on. The sense that this is not a â\u0080\u009crealâ\u0080\u009d recession comes from the fact that the economy is so bifurcated, keeping the Americans who need assistance â\u0080\u009coff the radar,â\u0080\u009d he said in an interview. â\u0080\u009cThe burden is more on the people making $14 an hour than those making $40 an hour,â\u0080\u009d Blitz said. That also masks the blow to the economy: â\u0080\u009cThe $14-an-hour people are only responsible for 9% of consumer spending. And the top 40% have had a lifestyle change but their lives havenâ\u0080\u0099t changed and their balance sheets are bigger than they were at the beginning of the crisis.â\u0080\u009d See: â\u0080\u0098The stock market no longer thinks it needs the economy if it has the Fed,â\u0080\u0099 David Rosenberg says Itâ\u0080\u0099s fair to acknowledge that the economy has made big steps toward recovery over the course of the summer. But thatâ\u0080\u0099s to be expected, given the events of the spring, pointed out Lindsey Bell, chief investment strategist for Ally Invest. â\u0080\u009cWhen you go from completely shut down to somewhat open, thereâ\u0080\u0099s going to be a huge pop. This was a bigger pop than in a normal recession. Itâ\u0080\u0099s also normal to see that momentum begin to taper off.â\u0080\u009d Tapering momentum was evident this past week in a slower pace of growth in retail sales and industrial production. Bell thinks American consumers, overall, are in a surprisingly healthy place. Consumer sentiment was stronger than expected, and at its highest level since March in a reading from the University of Michigan, published Friday. Still, she worries about the normal fading of momentum taking place alongside the pull-back in expanded unemployment benefits. â\u0080\u009cThere are 12.6 million people still receiving unemployment benefits,â\u0080\u009d Bell said. â\u0080\u009cThatâ\u0080\u0099s why we need stimulus from the government by the end of the year. The consumer can chug along and withstand the next couple of months, but 12.6 million Americans are going to need more than the typical unemployment benefit to weather the storm.â\u0080\u009d Strategists at BCA Research earlier in September quantified exactly how much fiscal support they believe is needed: at least $500 billion, to ensure consumer spending grows about 2% over the next 12 months. In the aftermath of the 2008 financial crisis, spending growth averaged between 2% and 6%, BCA notes. BCAâ\u0080\u0099s calculations show that if Congress were to extend another $1.1 trillion worth of stimulus, that would boost spending to 6% over the next 12 months. But the team estimates that even just holding spending growth flat requires more spending â\u0080\u0093 roughly $249 billion, they reckon â\u0080\u0093 â\u0080\u009cand that outcome would almost certainly disappoint markets,â\u0080\u009d they said. There is some consensus that the lack of any deal so far is already disappointing investors. â\u0080\u009cI donâ\u0080\u0099t think weâ\u0080\u0099re going to get stimulus before the election and I think thatâ\u0080\u0099s whatâ\u0080\u0099s been weighing on the markets for the past couple of weeks,â\u0080\u009d Bell told MarketWatch. Since the September 2 high, the S&P 500 SPX, +0.87% has lost about 5.3%. And in an analysis published the day after the most recent meeting of the Federal Reserve, AxiCorp analyst Milan Cutkovic wrote, â\u0080\u009cThe focus will now shift back to the US Congress, where Democrats and Republicans are still struggling to agree on a stimulus package. Investors are becoming increasingly impatient with the lack of progress, and market sentiment could turn sour if there is no deal soon.â\u0080\u009d Investors may have been expecting too much of monetary policy, Blitz thinks. â\u0080\u009cThe Fed can only affect the economy thatâ\u0080\u0099s working and open,â\u0080\u009d he said. â\u0080\u009cThey canâ\u0080\u0099t do anything about the airlines, the restaurants, the hotels. They are doing twice as much as they normally would have, because they can only be half as effective. As long as that dynamic is still in play, the short-term loss of the fiscal initiative doesnâ\u0080\u0099t mean a lot. As time goes on, though, the virus controls everything. Things will stall because the economy isnâ\u0080\u0099t working 100%, and if the federal government doesnâ\u0080\u0099t send out income support, it will pull growth lower. â\u0080\u009c U.S. stocks closed the week lower Friday, extending a three-week sell-off. The Dow Jones Industrial Average DJIA, +0.56% was less than 0.1% lower for the week, but the Nasdaq Composite index COMP, +1.39% slid 1.1%, and is now down 8.3% from the early September peak. In the week ahead, investors will get more information on the health of the economy, and the consumer. The National Association of Realtors will report on sales of previously-owned homes on Tuesday, and the government will release data on new-home sales Thursday. On Friday, a report on durable goods orders is due. Read next: Fool me twice? For businesses and consumers, coronavirus is the financial crisis all over again"}]}