{"article": [{"url": "https://www.marketwatch.com/story/after-dow-inclusion-news-salesforce-reveals-first-5-billion-quarter-and-zooms-toward-more-record-stock-prices-2020-08-25", "published": 1598428280.0, "headline": "After Dow inclusion news, Salesforce stock soars on reveal of first $5 billion quarter", "body": "A day after Salesforce.com Inc. was announced as the first cloud-software entry into the Dow Jones Industrial Average, the San Francisco company announced that it had collected $5 billion in quarterly revenue for the first time, sending its stock toward fresh record highs. Salesforce CRM, +2.21% reported second-quarter net income of $2.63 billion, or $2.85 a share, on revenue of $5.15 billion, up from $4 billion in the year-ago quarter. Adjusted earnings, which excluded a $2 billion tax benefit from changes in Salesforce’s international corporate structure, were $1.44 a share, compared with 66 cents a share in the year-ago period. Analysts surveyed by FactSet had estimated earnings of 67 cents a share on revenue of $4.9 billion, while Salesforce had forecast earnings of 66 cents to 67 cents a share on revenue of $4.89 billion to $4.9 billion. On the conference call, Chief Executive Marc Benioff said it was “humbling” and “bittersweet” that the company produced strong results amid the difficulties and tragedies created by the COVID-19 pandemic as businesses need to adapt and connect digitally with their customers. One example mentioned was facilitating the logistics of curbside pickups, which most retailers didn’t offer before the pandemic. “We all want to get back to how things were, but the reality is that’s never going to happen,” said Chief Executive Marc Benioff on the conference call. “We’re in a new world. We’re in an all-digital world with the work digitally, we’re living digitally, we’re educating digitally.” That shift into a digital reality showed in Salesforce’s guidance as the company raised its annual revenue outlook for the year. For revenue, the company sees a range of $20.7 billion to $20.8 billion, after previously forecasting $20 billion in sales. For annual adjusted earnings, Salesforce expects $3.72 to $3.74 a share, up from a previous range of $2.93 to $2.95 a share. Analysts expect earnings of $2.97 a share on revenue of $20.01 billion. For the third quarter, Salesforce expects adjusted earnings of 73 cents to 74 cents a share on revenue of $5.24 billion to $5.25 billion, while analysts had forecast adjusted earnings of 76 cents a share on revenue of $5.02 billion. Salesforce shares gained 3.6% Tuesday to close at a record high of $216.05 following an announcement from S&P Dow Jones Indices that the stock would replace Exxon Mobil Corp. XOM, -1.47% on the Dow DJIA, +0.56% at the end of the month. It is the first pure cloud-software company included in the blue-chip index. Salesforce shares rallied more than 13% in premarket trade Wednesday, pushing for more records. At Tuesday’s close, the stock was up 33% for the year, while the First Trust Cloud Computing ETF SKYY, +1.78% is up 31%, the S&P 500 index SPX, +0.87% is up 6.6%, and the tech-heavy Nasdaq Composite Index COMP, +1.39% is up 28%. Salesforce also garnered attention recently when the company disclosed it unloaded its 2.8 million-share stake of Zoom Video Communications Inc. ZM, +2.89% some time in the second quarter, when Zoom shares were priced anywhere from $137 to $253.54, or up 101% to 273% for the year."}]}