{"article": [{"url": "https://www.marketwatch.com/story/trump-wants-poll-watchers-this-is-what-happened-after-new-jersey-republicans-used-them-to-intimidate-voters-in-1981-11601498081", "published": 1601544860.0, "headline": "Trump wants poll watchers â\u0080\u0094 This is what happened after New Jersey Republicans used them to intimidate voters in 1981", "body": "Agence France-Presse/Getty Images During the first presidential debate, Donald Trump wasÂ asked by moderator Chris WallaceÂ if he would â\u0080\u009curgeâ\u0080\u009d his followers to remain calm during a prolonged vote-counting period after the election, if the winner were unclear. â\u0080\u009cI am urging my supporters to go into the polls and watch very carefully because that is what has to happen, I am urging them to do it,â\u0080\u009d Trump said. â\u0080\u009cI hope itâ\u0080\u0099s going to be a fair election, and if itâ\u0080\u0099s a fair election, I am 100 percent on board, but if I see tens of thousands of ballots being manipulated, I canâ\u0080\u0099t go along with that.â\u0080\u009d ThisÂ wasnâ\u0080\u0099t the first time TrumpÂ has said he wants to recruit poll watchers to monitor the vote. AndÂ to some, the image of thousands of Trump supporters crowding into polling places to monitor voters looks like voter intimidation, a practice long used in the U.S. by political parties to suppress one sideâ\u0080\u0099s vote and affect an electionâ\u0080\u0099s outcome. In theÂ history of voter suppressionÂ in the U.S. â\u0080\u0093 including attempts to stopÂ BlackÂ andÂ Latino peopleÂ from voting â\u0080\u0093 Republican tactics in the 1981 New Jersey gubernatorial race are worth highlighting. That incident sparked a court order â\u0080\u0093 a â\u0080\u009cconsent decreeâ\u0080\u009d â\u0080\u0093 forbidding the GOP from using a variety of voter intimidation methods, including armed poll watchers. The 2020 presidential election will be the first in nearly 40 years conducted without the protections afforded by that decree.The National Ballot Security Task Force In November 1981, voters in several cities saw posters at polling places printed in bright red letters. â\u0080\u009cWARNING,â\u0080\u009d they read. â\u0080\u009cThis area is being patrolled byÂ the National Ballot Security Task Force.â\u0080\u009d And voters soon encountered the patrols themselves. About 200 were deployed statewide, many of them uniformed and carrying guns. In Trenton, patrol members asked a Black voter for her registration card and turned her away when she didnâ\u0080\u0099t produce it. Latino voters were similarly prevented from voting in Vineland, while in Newark some voters were physically chased from the polls by patrolmen, one of whom warned a poll worker not to stay at her post after dark. Similar scenes played out in at least two other cities, Camden and Atlantic City. Weeks later, after a recount, RepublicanÂ Thomas KeanÂ won the election by fewer than 1,800 votes. Democrats, however, soon won a significant victory. With local civil rights activists, they discovered that the â\u0080\u009cballot securityâ\u0080\u009d operation was a joint project of the state and national Republican committees. They filed suit in December 1981,Â charging Republicans with â\u0080\u009cefforts to intimidate, threaten and coerceÂ duly qualified black and Hispanic voters.â\u0080\u009d In November 1982, the case was settled when theÂ Republican committees signed a federal consent decreeÂ â\u0080\u0093 a court order applicable to activities anywhere in the U.S. â\u0080\u0093 agreeing not to use race in selecting targets for ballot security activities and to refrain from deploying armed poll watchers. That orderÂ expired in 2018Â after Democrats failed to convince a judge to renew it. AsÂ a professorÂ who teaches andÂ writesÂ about New Jersey history, Iâ\u0080\u0099m alarmed by the expiration because I know that Republicans in 1981 relied not only on armed poll watchers but also on a history of white vigilantism and intimidation in the Garden State. These issuesÂ resonateÂ today in the midst of the Black Lives Matter movement and continued GOP attempts toÂ suppress the 2020 voteÂ in numerous states. U.S. Rep. John Lewis with House Democrats before passing the Voting Rights Advancement Act to eliminate potential state and local voter suppression laws, in December. The Senate has not taken up the bill. Getty Images The Republican â\u0080\u0098ballot securityâ\u0080\u0099 plan Considered an early referendum on Ronald Reaganâ\u0080\u0099s presidency, New Jerseyâ\u0080\u0099s 1981 gubernatorial race held special meaning for Republicans nationwide. Kean â\u0080\u0093 withÂ campaign manager Roger StoneÂ at the helm â\u0080\u0093 promised corporate tax cuts and relied heavily on Reaganâ\u0080\u0099s endorsement. To secure victory, state and national Republican party officials devised a project they claimed would prevent Democratic cheating at the polls. In the summer of 1981, the Republican National Committee sent an operative named John A. Kelly to New Jersey to run the ballot security effort. Kelly had first been hired by the Republican National Committee in 1980 to work in the Reagan campaign, and he served as one of theÂ RNCâ\u0080\u0099s liaisons to the Reagan White House. Later, after he was revealed as the organizer of the National Ballot Security Task Force â\u0080\u0093 and after The New York Times discovered that he hadÂ lied about graduating from Notre Dame and had been arrested for impersonating a police officerÂ â\u0080\u0093 Republicans distanced themselves from him. In August 1981, under the guise of the National Ballot Security Task Force, Kelly sent about 200,000 letters marked â\u0080\u009creturn to senderâ\u0080\u009d to voters in heavily Black and Latino districts. Those whose letters were returned had their names added to a list of voters to be challenged at the polls on Election Day, a tactic known asÂ voter caging. In the Newark area, Kelly produced a list of 20,000 voters whom he deemed potentially fraudulent. He then hired local operatives to organize patrols, ostensibly to keep such fraud at bay. To run the Newark operation, he hired Anthony Imperiale.Newarkâ\u0080\u0099s white vigilante Imperiale, in turn, hired off-duty police officers and employees of his private business, the Imperiale Security Police, to patrol voting sites in the city. The gun-toting, barrel-chested former Marine had first adopted the security role duringÂ Newarkâ\u0080\u0099s 1967 uprisingÂ â\u0080\u0093 five days of protests and a deadly occupation of the city by police and the National Guard following the police beating of a Black cab driver. During the uprising, Imperiale organized patrols of his predominantly white neighborhood to keep â\u0080\u009cthe riotsâ\u0080\u009d out. Soon, Imperiale became a hero of white backlash politics. HisÂ opposition to police reformÂ earned him widespread support from law enforcement. And hisÂ fight against Black housing developmentÂ in Newarkâ\u0080\u0099s North Ward delighted many of his neighbors. By the end of the 1970s, Hollywood wasÂ making a movieÂ based on his activities. After serving as an independent in both houses of the state legislature,Â Imperiale became a Republican in 1979. Two years later, he campaigned with Kean. Once in office, the new governor named Imperiale director of a new one-man state Office of Community Safety â\u0080\u0093 an appointment often interpreted as reward for Imperialeâ\u0080\u0099s leadership of the ballot efforts in Newark, but stymied whenÂ Democrats refused to fund the position.Outcome and legacy Despite Keanâ\u0080\u0099s slim margin of victory, Democrats at the time were careful not to claim that Republican voter suppression efforts had decided the election. (In 2016, the formerÂ Democratic candidate claimed they did indeed make the difference.) Rather, the state and national Democratic committees brought suit against the Republican National Committee to ensure it couldnâ\u0080\u0099t again use such methods anywhere. For nearly 40 years â\u0080\u0093 throughÂ amendmentsÂ andÂ challengesÂ â\u0080\u0093 the resulting consent decreeÂ helped curtailÂ voter suppression tactics. Since the decreeâ\u0080\u0099s expiration in 2018, Republicans have ramped up theirÂ recruitment of poll watchersÂ for the 2020 presidential election. Last November, Trump campaign lawyer Justin Clark â\u0080\u0093 calling the decreeâ\u0080\u0099s absence â\u0080\u009ca huge, huge, huge, huge dealâ\u0080\u009d for the party â\u0080\u0093 promised a larger, better-funded and â\u0080\u009cmore aggressiveâ\u0080\u009d program of Election Day operations. The Trump campaign is claiming, as Republicans did in 1981, that Democrats â\u0080\u009cwill be up to their old dirty tricksâ\u0080\u009d and has vowed to â\u0080\u009ccover every polling place in the countryâ\u0080\u009d with workers to ensure an honest election and reelect the president. This November, Republican tactics in 1981 are worth remembering. They demonstrate that the safeguarding of polling places from supposedly fraudulent voters and of public places from Black bodies share not only a logic. They also share a history. Mark Krasovic is an associate professor of history and American studies at Rutgers University Newark. This was first published by The Conversation â\u0080\u0094 â\u0080\u009cTrumpâ\u0080\u0099s encouragement of GOP ballot watchers echoes an old tactic of voterÂ intimidationâ\u0080\u009c. .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; margin-bottom: 5px; } .at16units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body.at12units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body .header .wsj-interactive.generic-iframe-embed[name=\"\"], body.at8units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body.at4units .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .header .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; }"}]}