{"article": [{"url": "https://www.marketwatch.com/story/stock-index-futures-point-higher-as-us-china-reaffirm-commitment-to-trade-deal-2020-08-25", "published": 1598373500.0, "headline": "S&P 500 and Nasdaq book fresh record highs, but Dow slumps as Apple and Boeing weigh", "body": "The S&P 500 and the Nasdaq notched records Tuesday, on the back of buying in communication services, health care and consumer discretionary sectors. Enthusiasm for equities, however, momentarily buckled earlier in the session after a report on consumer confidence highlighted a division in the perception of the economy on Main Street compared with Wall Street, where equities have recovered to new record highs recently. What did major benchmarks do? The Dow Jones Industrial Average DJIA, +0.56% traded 60.02 points, or 0.2%, lower to close at 28,248.44, while S&P 500 index SPX, +0.87% ES00, +1.13% rose 12.34 points, or 0.4%, to end at 3,443.62, marking its 17th record close of the year. The Nasdaq Composite Index COMP, +1.39% climbed 86.75 points, or 0.8%, to end at 11,466,47, to end near its intraday record high and log its 38th record finish of 2020. What drove the market? Investors were heartened overnight by news that U.S. and Chinese officials reaffirmed their commitment to a trade deal signed in January, but questions about the power of investors to help the economy mount a more substantial recovery from COVID-19 were thrown into some doubt after a reading on U.S. consumer confidence. Consumer confidence fell in August to a new pandemic low after a fresh rash of coronavirus cases during the summer. The index of consumer confidence sank to 84.8 this month from a revised 91.7 in July, the Conference Board said Tuesday. Economists polled by MarketWatch had expected a reading of 93.0. “Households are becoming more cautious in their outlook for continued healing of the economy,” wrote Kathy Bostjancic, chief U.S. financial economist at Oxford Economics, in a research report. “This could slow consumer spending relative to the rather strong rebound over the past few months,” she said. Analysts tied the positive tone across global equity markets in part to remarks following a phone call between U.S. and Chinese officials over the status of the partial trade agreement, despite rising tensions over Beijing’s treatment of Hong Kong and other issues. China described the call as a “constructive” discussion between Vice Premier Liu He, the country’s top negotiator, and U.S. Trade Representative Robert Lighthizer and Treasury Secretary Steven Mnuchin. The U.S. said both sides “see progress and are committed to taking the steps necessary to ensure the success of the agreement.” The call came after plans for a discussion earlier this month were postponed. “Given the exchanges between the two countries recently have been negative, any small bit of positivity is seen as a big step forward, even when it isn’t,” said David Madden, analyst at CMC Markets, in a note. “The Chinese government are still well behind on their commitments to purchase U.S. goods, but to be fair, some of that is down to the pandemic.” Investors were also processing the potential impact of Hurricane Laura, which was bearing down on the Gulf Cost region, with 345,000 people ordered to evacuate the area on Tuesday. The storm is projected to become a Category 3 hurricane, capable of producing winds of around 115 mph, on Wednesday as it hits Texas and Louisiana. Meanwhile, a shake-up of the Dow Jones Industrial Average is in store at the end of the month. S&P Dow Jones Indices late Monday announced that customer relationship management software company Salesforce.com Inc. CRM, +2.21% would replace oil giant Exxon Mobil Corp. XOM, -1.47%, biotech drugmaker Amgen Inc. AMGN, -1.41% will replace pharmaceutical company Pfizer Inc. PFE, -0.27% and software-and-industrial conglomerate Honeywell International Inc. HON, +0.34% will replace defense contractor Raytheon Technologies Corp. RTX, -1.46%. S&P Dow Jones Indices said the move was prompted by Apple Inc.’s AAPL, +1.74% coming 4-for-1 stock split, which will reduce the blue-chip index’s technology weighting. In other U.S. economic data, U.S. home prices continued to rise at a steady clip in June as many states began reopening businesses from shutdowns related to the coronavirus pandemic. The S&P CoreLogic Case-Shiller 20-city price index posted a 3.5% year-over-year gain in June, down from 3.% the previous month. On a monthly basis, the index increased 0.2% between May and June. Sales of new single-family houses rose 14% between June and July to a seasonally-adjusted annual rate of 901,000, the U.S. Census Bureau reported Tuesday. The pace of sales was the highest since 2006. Compared with a year ago, new home sales were up 36%. Which companies were in focus? Shares of Salesforce.com Inc. closed up 3.6%, following the announcement of its pending addition to the Dow, while shares of Amgen rose 5.4% and Honeywell shares added 3.2%. ExxonMobil shares lost 3.2%, while Pfizer fell 1.1% and Raytheon gave up 1.5%. Palo Alto Networks Inc. PANW, +1.20% Shares of fell 2.3% Tuesday after the company delivered results and an outlook that topped Wall Street forecasts after Monday’s closing bell. The company also continued its acquisition spree, saying it would buy incident-response company Crypsis Group for $265 million in cash to support its Cortex XDR platform. J.M. Smucker Co. SJM, +1.32% said Tuesday it had net income of $237.9 million, or $2.08 a share, in its fiscal first quarter to July 31, up from $154.6 million, or $1.36 a share, in the year-earlier period. The company’s shares ended up 6.9%. Hormel Foods Corp. shares HRL, -0.28% declined 2.1% Tuesday, even after the parent of food brands, including Skippy peanut butter, Spam and Applegate, posted better-than-expected earnings for its fiscal third quarter. Starbucks Corp. SBUX, +0.53% rose 5.1% Tuesday after the coffee chain was upgraded to buy from hold at Stifel based on sales potential Hain Celestial Group Inc. shares HAIN, +1.78% sank 8.1% in Tuesday trading after the natural and organic company reported a fiscal fourth-quarter international sales decline and forecast slowing growth in the second-half of fiscal 2021. Shares of Children’s Place Inc. PLCE, -6.78% plunged almost 19% in Tuesday trading after the kids apparel retailer reported wider-than-expected second-quarter losses. Best Buy Co. Inc. shares BBY, +1.45% fell 4% in Tuesday after the company reported a fiscal second-quarter earnings and revenue beat, but took a cautious tone for the future. Medtronic PLC shares MDT, +0.81% rose 2.5% after the Dublin-based medical device maker posted earnings for its fiscal first quarter that were down sharply from a year ago, but ahead of consensus estimates. American Airlines AAL, +0.34% said Tuesday it will eliminate 19,000 jobs in October as it struggles with a sharp downturn in travel because of the pandemic.Shares were off 2.2%. How did other markets fare? The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% TMUBMUSD10Y, 0.777% rose 3.5 basis points to 0.680%. Bond prices move inversely to yields. Gold futures GCZ20, +2.17% fell $16.10, or 0.8%, to settle at $1,923.10 an ounce, after the metal fell 0.4% in the previous session. Oil futures CL.1, -1.62% rose 73 cents, or 1.7%, to finish the session at $43.35 a barrel on the New York Mercantile Exchange, as a a pair of storms have forced the shutdown of more than 80% of offshore crude-oil production in the Gulf of Mexico. The greenback was 0.3% lower, ICE U.S. Dollar Index DXY, -0.58%. In global equity markets, China’s CSI 300 000300, +2.04% rose 0.1%, the Shanghai Composite SHCOMP, +1.67% ended 0.4% higher and Japan’s Nikkei NIK, -0.11% closed with a gain of 1.4%. The Stoxx Europe 600 SXXP, +0.55% closed off 0.3% and U.K.’s FTSE benchmark UKX, +0.64% posted a 1.1% loss on the day."}]}