{"article": [{"url": "https://www.marketwatch.com/story/empire-state-index-recovers-in-june-from-two-months-of-record-lows-2020-06-15", "published": 1592235920.0, "headline": "Empire State index shows stable conditions in June after two months of record declines", "body": "The numbers: Business activity steadied in New York State in June after two months of record contractions, according to the New York Fed’s Empire State Manufacturing Survey released Monday. The Empire State business conditions index rose 48 points to negative 0.2 in June. A reading close to zero indicates steadying conditions. However, the report is still well below levels at 50 or below that would indicate contraction. Economists had expected a reading of negative 30, according to a survey by Econoday. What happened: Thirty-six percent of manufacturers reported that conditions were better in early June than in May, up from 15% in the prior survey. The new orders index rose 42 points to a level close to zero, indicating that the quantity of orders was unchanged from last month. Shipments climbed 42 points to 3.3, indicating a slight rise. The index for employees was little changed at -3.5, the second month of slight employment declines. Eighteen percent of firms said they were increasing employment levels. Firms were optimistic that conditions would be better in six months, with the index for future conditions rising 27 points to 56.5, its highest level in more than a decade. Big picture: The Empire State index has climbed nearly 80 points over the past two months, as factory activity has stopped falling after the lock down due to the coronavirus pandemic. Economists emphasized that the ground lost in the past couple of months hasn’t been recovered only that manufacturing has stabilized. What are they saying? “Diffusion indexes like the factory surveys measure the direction of change in activity from one month to the next, not the level of activity. New York State was slow to reopen its economy last month, which meant that the Empire State survey was the weakest of all the regionals in ISM-weighted terms in May. With many factories emerging from lockdown in June, the month-to-month change seems likely to be positive even if total output remains far below pre-pandemic levels,” said Lou Crandall, chief economist at Wrightson ICAP, who forecast a big rebound while most economists were predicting the index to remain well below break-even. Market reaction: U.S. equity benchmarks recovered after opening sharply lower.The Dow Jones Industrial Average DJIA, +0.56% was up 81 points and the S&P 500 index SPX, +0.87% up 17 points in late afternoon trading."}]}