{"article": [{"url": "https://www.marketwatch.com/story/apple-preps-for-wwdc-its-big-party-with-developers-as-developers-grow-testy-with-app-store-rules-2020-06-19", "published": 1592817620.0, "headline": "Apple is under pressure over its App Store rules from the testy developers it will have to court at the upcoming WWDC", "body": "Apple Inc.’s annual WWDC developer event will have a different tone this year, and not just because the COVID-19 crisis has forced the smartphone giant to hold the annual conference virtually. Apple AAPL, +1.74% is in an awkward spot with its developer community heading into Monday’s keynote address as it faces heightened scrutiny over the policies for its App Store, which relies on third-party developers. European Union regulators have recently opened antitrust investigations into the company’s App Store and Apple Pay services, and Apple has faced criticism from high-profile developers, including Spotify Technology SA SPOT, +0.08% and Tinder parent company Match Group Inc. MTCH, -0.94%, which believe the company takes too large a cut of in-app purchases made by Apple device users. The tension was highlighted this week in a dustup with Hey, an email app that charges users $99 a year for its services but doesn’t give customers the option to purchase subscriptions through Apple. Apple has told Hey’s developers to add an in-app subscription option and threatened to remove the Hey app if they don’t comply. See more: Apple faces new complaints from app makers as EU launches antitrust probes Apple takes a cut of subscription fees when customers buy digital services through apps on iOS devices and developers increasingly have been trying to steer users toward websites for such purchases so they don’t have to fork over a portion of their subscription revenue to Apple. With that as a backdrop, Chief Executive Tim Cook’s keynote address — scheduled for 1 p.m. Eastern time on Monday — could be much more fraught than in recent years. “I think there’s more pressure on Apple to show what’s in store from a developer perspective,” Wedbush analyst Daniel Ives told MarketWatch in a telephone interview. A mass developer exodus would be a problem for Apple, in his view, but he said developers are in a “quagmire” given the ubiquity of the App Store.Software updates expected The virtual nature of the event will also give it a different feel, as “a big part of WWDC is the excitement, the crowds going up escalators, and the anticipation before Cook’s keynote,” Ives said. That vibe changes when developers are instead perched in front of their computers at home. This year’s WWDC is expected to offer a look at new software features planned for the fall, when Apple is expected to debut its first 5G-enabled devices. Bank of America analyst Wamsi Mohan said that health will be a focus at the event as he predicts the company will discuss a new fitness app that lets users watch fitness videos on their various devices and receive instruction as they go through exercises. He expects that the company could also introduce a new augmented reality app that would allow users to engage in AR experiences by scanning QR codes and roll out new options that would let device owners customize their home screens. A new approach to semiconductors On the hardware side, Apple is likely to formally announce that it will be shifting to a custom ARM-based processor for its Macs, though the company may not begin rolling out devices featuring these chips until next year. The company currently uses Intel Corp. INTC, -1.03% chips in its Macs but has been slowly moving to outfit more of its device categories with custom processors. “With Intel having lost its transistor advantage (and not likely to regain its lead for several years, if ever), we think that has provided an incentive for Apple to make a change,” Raymond James analyst Chris Caso wrote in a note to clients. The custom processor in last year’s iPhone 11 “essentially matches the performance” of the best Intel and Advanced Micro Devices Inc. AMD, -3.94% processors, Caso said, citing computer-hardware publication AnandTech. Apple plans to move over to Taiwan Semiconductor Manufacturing Co. Ltd.’s TSM, +1.11% 5-nanometer architecture with this year’s iPhone chips, he said, which could provide a further performance boost. Ives said that the broader switch to custom chips gives Apple more control over its ecosystem, while Bernstein’s Mark Li has argued that the move could also drive slight improvements in gross margins. Don’t miss: How the pandemic has changed tech in its first 100 days The focus of WWDC is generally on software improvements, but analysts aren’t ruling out the possibility of some hardware announcements beyond talk of custom Mac chips. Apple could launch a new iMac, new over-the-ear AirPods, Bluetooth “AirTags” tracking devices or a new HomePod speaker, Mohan said. Ives sees a strong possibility that Apple stops including wired EarPods with new device purchases beginning in the fall, which could both lower Apple’s costs and help spur more purchases of AirPods. Apple shares have proven resilient despite business disruptions from the pandemic. The company decided to temporarily re-close some store locations in states that have recently seen big spikes in COVID-19 cases, but investors seem largely willing to look past these challenges as the company prepares for its 5G device launches in the fall. Ives said that 350 million of the 950 million iPhones in Apple’s installed base are ripe for upgrades. Apple’s stock has rallied 42% over the past three months, and it’s trading slightly below a new all-time high set earlier in June. The S&P 500 SPX, +0.87% is up 29% over the past three month, matching gains for the Dow Jones Industrial Average DJIA, +0.56%, which counts Apple as a component."}]}