{"article": [{"url": "https://www.marketwatch.com/story/trump-disputes-cdc-director-on-vaccine-rollout-blames-high-coronavirus-death-toll-on-blue-states-11600296669", "published": 1600330400.0, "headline": "Trump disputes CDC director on vaccine rollout, blames high coronavirus death toll on â\u0080\u0098blue statesâ\u0080\u0099", "body": "President Donald J. Trump speaks to the press during a news conference Wednesday at the White House. Getty Images President Donald Trump discussed his administrationâ\u0080\u0099s plan to roll out a COVID-19 vaccine as soon as possible during Wednesdayâ\u0080\u0099s coronavirus task force briefing, and disputed earlier comments from CDC Director Dr. Robert Redfield. â\u0080\u009cAs soon as itâ\u0080\u0099s announced, weâ\u0080\u0099ll be able to start,â\u0080\u009d Trump said. â\u0080\u009cThatâ\u0080\u0099ll be from mid-October on â\u0080\u0094 maybe a little bit later than that. Weâ\u0080\u0099ll be all set so as soon as itâ\u0080\u0099s given the go-ahead â\u0080\u0094 theyâ\u0080\u0099re doing trials, as you know â\u0080\u0094 so as soon as itâ\u0080\u0099s given the go-ahead, we will get it out, defeat the virus.â\u0080\u009d Trump suggested Redfield had been confused in his Senate testimony or had misunderstood the questions asked. Dr. Scott Atlas, a member of the presidentâ\u0080\u0099s coronavirus task force, also discussed the plan, noting he expects that 700 million doses will be available by the end of March. Earlier Wednesday, Redfield, head of the Centers for Disease Control and Prevention, told Congress under oath that a vaccine may not be available to the general public until well into next year. Redfield also said a face mask could be â\u0080\u009cmore guaranteed to protect me against COVID than when I take a COVID vaccine.â\u0080\u009dÂ Redfield subsequently tweeted that it is, in fact, a vaccine that will do the most to restore â\u0080\u009cnormal lifeâ\u0080\u009d and that he â\u0080\u009c100% believe[s] in the importance of vaccines.â\u0080\u009d Trump contradicted the statement and later mocked Joe Biden for often wearing a mask in public. When asked about Redfieldâ\u0080\u0099s comments, Trump claimed he was misunderstanding questions. â\u0080\u009cI believe he was confused,â\u0080\u009d Trump said. When asked about Oracleâ\u0080\u0099s ORCL, +0.42% potential deal with ByteDance for a stake in TikTokâ\u0080\u0099s U.S. operations, Trump said he will be briefed on studies of the deal on Thursday. He said he â\u0080\u009cconceptuallyâ\u0080\u009d wouldnâ\u0080\u0099t like it if ByteDance maintained a majority stake, â\u0080\u009cassuming that ByteDance is China, which I think it is.â\u0080\u009d Giving an update on COVID-19, Trump noted the national test positivity rate has fallen below 5%, while the number of hospitalized patients has declined 43% from mid-July. The president tried to pin the blame for total COVID-19 deaths on â\u0080\u009cblue states,â\u0080\u009d arguing if you take out such areas â\u0080\u0094 which include many of the largest cities by population, such as New York and Los Angeles â\u0080\u0094 the death count would be far lower. He again urged Democratic governors to reopen their states. Trump also congratulated the Big Ten conference for walking back its decision to postpone the fall football season, and pushed for the Pacific-12 Conference to follow suit. â\u0080\u009cWe started putting a lot of pressure on, frankly, because there was no reason not for it to come back,â\u0080\u009d Trump said. One Big Ten university president on the decision-making panel said Trumpâ\u0080\u0099s pressure had had no bearing and could only have been a negative, as the administrators wanted to be certain to avoid the appearance of having been swayed by politics. Penn State, among the schools in the Big Ten conference, said the total number of COVID-19 cases at its University Park, Pa., campus hit 1,146 on Tuesday. Trump began the briefing outlining the governmentâ\u0080\u0099s response to Hurricane Sally."}]}