{"article": [{"url": "https://www.marketwatch.com/story/biden-has-more-of-americas-top-ceos-as-donors-but-trumps-have-given-more-2020-10-08", "published": 1602241520.0, "headline": "Trump raised 5 times as much money from America's top CEOs as Biden", "body": "As the Nov. 3 election sparks record campaign contributions, the CEOs of S&P 500 companies are helping to fund the war chests of President Donald Trump and challenger Joe Biden, while also contributing to other Republican and Democratic politicians. In their political giving as individuals, these chief executives have combined to give more to Trump than Biden. Some 15 CEOs whose companies are components of the S&P 500 SPX, +0.87% have donated a total of $2.489 million to Trump's principal campaign committee, its joint fundraising groups with the Republican National Committee or pro-Trump super PACs. Meanwhile, 30 chief execs have contributed $536,100 to Biden's main campaign committee, its joint groups with the Democratic National Committee or pro-Biden super PACs. These figures come from a MarketWatch analysis of processed Federal Election Commission data on individual contributions made between January 2019 and August 2020. Anyone who held the CEO job in 2019 or 2020 at a company that was part of the S&P 500 is included. As shown in the table below, the S&P CEOs giving the most to Trump were Intercontinental Exchange's ICE, -0.04%  Jeffrey Sprecher, whose wife, Republican Sen. Kelly Loeffler of Georgia, faces a tough Senate race, and Las Vegas Sands's LVS, -0.84%  Sheldon Adelson, a longtime major GOP donor. Also ranking high in dollar amounts donated were Vornado Realty Trust's VNO, -3.13%  Steven Roth and Oracle's ORCL, +0.42%  Safra Catz.S&P 500 CEOs giving their own money to Trump's campaign CEO Company Amount Recipient Sector 1. Jeffrey Sprecher Intercontinental Exchange $1,000,000.00 America First Action Financials Jeffrey Sprecher Intercontinental Exchange $290,300.00 Trump Victory Financials Jeffrey Sprecher Intercontinental Exchange $5,600.00 Donald J. Trump for President Financials 2. Sheldon Adelson Las Vegas Sands $580,600.00 Trump Victory Consumer Discretionary Sheldon Adelson Las Vegas Sands $5,600.00 Donald J. Trump for President Consumer Discretionary 3. Steven Roth Vornado Realty Trust $200,000.00 Trump Victory Real Estate Steven Roth Vornado Realty Trust $200.00 Donald J. Trump for President Real Estate 4. Safra Catz Oracle $125,000.00 Trump Victory Information Technology Safra Catz Oracle $5,600.00 Donald J. Trump for President Information Technology 5. Jayson Adair Copart $100,000.00 Trump Victory Industrials Jayson Adair Copart $5,600.00 Donald J. Trump for President Industrials 6. David Farr Emerson Electric $50,000.00 Trump Victory Industrials David Farr Emerson Electric $5,525.00 Donald J. Trump for President Industrials 7. Timothy Sloan* Wells Fargo $35,500.00 Trump Victory Financials Timothy Sloan* Wells Fargo $5,600.00 Donald J. Trump for President Financials 8. Alan Miller Universal Health Services $25,000.00 Trump Victory Health Care Alan Miller Universal Health Services $5,600.00 Donald J. Trump for President Health Care 9. William Hornbuckle MGM Resorts International $17,500.63 Trump Victory Consumer Discretionary William Hornbuckle MGM Resorts International $5,600.00 Donald J. Trump for President Consumer Discretionary 10. James Fish Waste Management $2,707.50 Donald J. Trump for President Industrials James Fish Waste Management $2,610.00 Trump Make America Great Again Industrials 11. Scott Farmer Cintas $2,500.00 Trump Victory Industrials Scott Farmer Cintas $2,500.00 Donald J. Trump for President Industrials 12. John Chiminski Catalent $2,043.02 Trump Make America Great Again Health Care John Chiminski Catalent $1,942.69 Donald J. Trump for President Health Care 13. Scott Donnelly Textron $1,750.00 Trump Make America Great Again Industrials Scott Donnelly Textron $1,375.00 Donald J. Trump for President Industrials 14. Steve Sanghi Microchip Technology $2,800.00 Donald J. Trump for President Information Technology 15. Dan Dinges Cabot Oil & Gas $250.00 Trump Make America Great Again Energy Dan Dinges Cabot Oil & Gas $187.50 Donald J. Trump for President Energy Total $2,489,491.34 * Former CEO who held the position during the FEC's 2020 election cycle that started Jan. 1, 2019 Source: MarketWatch analysis of processed Federal Election Commission data on individual contributions made between January 2019 and August 2020 The S&P 500 bosses donating the most to Biden were Disney's DIS, +1.53%  Bob Iger, who is currently the entertainment company's executive chairman after leaving the CEO post in February, as well as Amphenol's APH, -0.00% Richard Norwitt, DuPont's DD, +0.06% Edward Breen, Merck's MRK, -0.14%  Kenneth Frazier and Vertex Pharmaceuticals's VRTX, +0.52%  Jeffrey Leiden. Overall spending in this year's election will approach $11 billion, easily topping the $7 billion spent (in today's dollars) in the 2016 election, according to the Center for Responsive Politics, a nonprofit group that tracks money in politics. One CEO, MGM Resorts International's MGM, -2.59%  Bill Hornbuckle, gave to both Trump and Biden, according to MarketWatch's analysis of disclosures. He contributed $17,501 to the Trump Victory Fund, a joint fundraising committee with the RNC, plus the maximum amount of $5,600 to Trump's primary campaign committee. He donated $2,800 to Biden's main campaign committee. Related:These are the basics of campaign finance in 2020 - in two handy charts And see:Politicians keep coordinating with super PACs and other supposedly independent groups, study findsS&P 500 CEOs giving their own money to Biden's campaign Company Amount Recipient Sector 1. Robert Iger* Disney $250,000.00 Biden Victory Fund Communication Services Robert Iger* Disney $5,600.00 Biden for President Communication Services 2. Edward Breen Dupont De Nemours $50,000.00 Biden Victory Fund Materials Edward Breen Dupont De Nemours $5,600.00 Biden for President Materials 3. Kenneth Frazier Merck $50,000.00 Biden Victory Fund Health Care Kenneth Frazier Merck $5,600.00 Biden for President Health Care 4. Richard Norwitt Amphenol Corporation $50,000.00 Biden Victory Fund Information Technology Richard Norwitt Amphenol Corporation $5,600.00 Biden for President Information Technology 5. Jeffrey Leiden* Vertex Pharmaceuticals $25,000.00 Unite the Country Health Care 6. David Kenny Nielsen Holdings $5,600.00 Biden for President Industrials David Kenny Nielsen Holdings $2,800.00 Biden Victory Fund Industrials 7. Debra Cafaro Ventas $5,600.00 Biden for President Real Estate 8. John Donahoe Nike $5,600.00 Biden for President Consumer Discretionary 9. Ronald O'Hanley State Street $5,600.00 Biden for President Financials 10. Ted Sarandos Netflix $5,600.00 Biden for President Communication Services 11. Andrew Silvernail Idex $5,500.00 Biden for President Industrials 12. Joshua Silverman Etsy $3,300.00 Biden for President Consumer Discretionary 13. Stanley Bergman Henry Schein $2,800.00 Biden for President Health Care 14. Steven Cahillane Kellogg's $2,800.00 Biden for President Consumer Staples 15. Steven Collis Amerisourcebergen $2,800.00 Biden for President Health Care 16. Timothy Gokey Broadridge Financial Solutions $2,800.00 Biden for President Information Technology 17. Reed Hastings Netflix $2,800.00 Biden for President Communication Services 18. William Hornbuckle MGM Resorts International $2,800.00 Biden for President Consumer Discretionary 19. Stephen Kaufer Tripadvisor** $2,800.00 Biden for President Communication Services 20. Tom Leighton Akamai $2,800.00 Biden for President Information Technology 21. Charlie Lowrey Prudential Financial $2,800.00 Biden for President Financials 22. Joseph Margolis Extra Space Storage $2,800.00 Biden for President Real Estate 23. Michael McMullen Agilent $2,800.00 Biden for President Health Care 24. James Murren* MGM Resorts International $2,800.00 Biden for President Consumer Discretionary 25. Sumit Roy Realty Income $2,800.00 Biden for President Real Estate 26. Michael Schall Essex Property Trust $2,800.00 Biden for President Real Estate 27. Arne Sorenson Marriott International $2,800.00 Biden for President Consumer Discretionary 28. Owen Thomas Boston Properties $2,800.00 Biden for President Real Estate 29. Bradley Tilden Alaska Air Group $2,800.00 Biden for President Industrials 30. Devin Stockfish Weyerhaeuser $1,500.00 Biden for President Real Estate Total $536,100.00 * Former CEO who held the position during the FEC's 2020 election cycle that started Jan. 1, 2019 ** Former S&P 500 company that was a component of the index during the FEC's 2020 election cycle that started Jan. 1, 2019 Source: MarketWatch analysis of processed Federal Election Commission data on individual contributions made between January 2019 and August 2020 CEOs who have donated to Trump's campaign may be showing that they're pleased with his policies, such as the 2017 tax cuts, said Michael Beckel, research director at Issue One, a nonpartisan watchdog group that aims to reduce the influence of big money in politics. \"Some corporate executives may see their political contributions as good investments in policies that will benefit them,\" Beckel told MarketWatch in an email. Many of them \"see themselves as having a fiduciary responsibility to be active in politics.\" Execs also may donate \"based on their own political preferences and ideological leanings,\" even as their political contributions could \"carry some risks for companies,\" Beckel said. \"An executive's giving could turn off a segment of customers from their brand, and even lead to protests or boycotts.\" Bruce Freed, president of the Center for Political Accountability, a nonprofit that pushes for better disclosure of corporate political activity, also noted the potential challenges for CEOs as they vote with their wallets. \"Companies today face very serious risks - both reputational risks and bottom-line risks - for contributions that companies are making,\" Freed said in an interview. The donations can \"conflict with their core values and positions\" on issues such as racial justice or climate change, he said, adding that his organization has explored the situation in its \"Conflicted Consequences\" and \"Collision Course\" reports. \"All of these things have made political spending much more controversial for companies and executives - and much riskier,\" he said. Related:Watchdog says Washington's growing swampier, even as coronavirus lockdowns let Congress climb off 'hamster wheel of fundraising' And see:S&P 500 companies are protecting themselves from today's inflamed politics, study findsCompanies' responses Intercontinental Exchange, Las Vegas Sands, Vornado Realty, Oracle, Disney, DuPont, Merck, Amphenol and Vertex didn't respond to requests for comment. Oracle's Catz worked in 2016 on Trump's transition team, while Disney's Iger and Merck's Frazier are among the executives who have shown their opposition to the president's actions by resigning from his White House councils. Iger cited Trump's withdrawal from the Paris climate agreement, and Frazier was responding to the president's initial reaction to racial violence in Charlottesville, Va., in 2017. A spokeswoman for Wells Fargo WFC, , whose former chief executive, Tim Sloan, gave to Trump's campaign, said his donation \"was a personal contribution and was in no way related to his time as CEO of Wells Fargo, which ended a year and a half ago.\" A Waste Management spokesman said the company doesn't comment on the \"personal political contributions of our employees.\" Among the Biden donors, a Boston Properties BXP, -1.65%  spokeswoman said \"personal political contributions\" made by the company's CEO or other employees are \"personal decisions.\" A Marriott International MAR, -0.96% spokeswoman said the hotel company \"will not be commenting on any personal contributions made by our CEO or any other executive,\" and a Tripadvisor TRIP, +0.74%  spokesman said the travel company does \"not comment on the personal contributions made by employees or executives within this company.\" A Henry Schein HSIC, -1.03%  spokeswoman said the health-care products company \"makes no national political campaign contributions, per its Worldwide Business Standards,\" and \"individual contributions are just that - individual donations that have nothing to do with the company.\" Netflix NFLX, +1.43%, Nielsen NLSN, -4.77% and Broadridge Financial Solutions BR, +1.28%  declined to comment. The other companies listed in the tables above didn't respond to requests for comment.S&P 500 CEOs give much more to Republicans The higher dollar total for Trump's campaign aligns with how Republican groups overall have attracted more money from S&P 500 CEOs than Democratic groups. Some 179 of these CEOs donated a total of $35.61 million of their own money to Republican candidates and organizations, while 148 bosses combined to contribute $3.172 million to Democratic efforts, according to MarketWatch's analysis of outlays between January 2019 and August 2020. Most of the GOP's big advantage comes from Las Vegas Sands's Adelson, who has given $26.38 million to Republicans, including $25 million to the Senate Leadership Fund, a super PAC aiming to protect and expand on the GOP majority in the U.S. Senate. But even with Adelson excluded, Republicans come out ahead in drawing donations from the S&P CEOs, with $9.233 million in 2019 and 2020, tripling the Democratic haul. Related: Democrats' chances of Senate takeover rise, and that could affect health care, energy and financial services And see:If the Democrats win the Senate, Big Tech better be ready for a bigger fight Many of the S&P CEOs - 81 of them, to be exact - contributed to both Republican and Democratic groups. In other words, only 98 of the 179 GOP donors gave just to the GOP, and only 67 of the Democratic donors gave just to that party's groups. The greater giving to Republicans by the S&P CEOs in the current election cycle fits with their past behavior. Ahead of the 2018 midterm elections, a MarketWatch analysis found 200 S&P chief execs had given a total of $7.4 million to the GOP, while 149 donated a total of $2.6 million to Democrats. MarketWatch's analysis here doesn't cover political contributions by current or former executives of privately held companies, such as billionaire Michael Bloomberg, as it focuses instead on chief executives of the S&P 500's large, publicly traded companies. Now read:Biden topped Trump in cash on hand as September began And see:Trump says he might spend his own money on his re-election campaign This report was first published on Oct. 8, 2020."}]}