{"article": [{"url": "https://www.marketwatch.com/story/biden-to-blast-trump-for-having-fomented-violence-as-presidential-race-tightens-11598890916", "published": 1598886740.0, "headline": "Biden blasts Trump for having 'fomented' violence, as presidential race tightens", "body": "Democratic presidential nominee Joe Biden speaks Monday during a campaign event in Pittsburgh. Getty Images Joe Biden on Monday attacked President Donald Trump as having sparked recent violence, in a speech that comes as swing-state polls show the Democratic challenger's lead is eroding in the White House race. \"Fires are burning, and we have a president who fans the flames, rather than fighting the flames,\" Biden said during a speech in Pittsburgh. \"He can't stop the violence, because for years he's fomented it. He may believe mouthing the words 'law and order' makes him strong, but his failure to call on his own supporters to stop acting as an armed militia in this country shows how weak he is.\" Biden's address in the swing state of Pennsylvania occurred as polls focused on battleground states show the former vice president's advantage over Trump declining. In a RealClearPolitics average of polls as of Monday, the Democratic nominee is leading the Republican incumbent by 2.7 percentage points in top battleground states that are likely to decide the November election, down from his 6.3-point edge a month ago. Betting markets give Biden just a 51% chance of winning, down from 61%, according to a separate RCP average. Ahead of Biden's speech, the Trump campaign made a counterattack. \"Biden's coming out of his basement today and traveling to Pittsburgh to pretend that he's spoken out against violence all along and cast blame of President Trump,\" a senior adviser to Trump's campaign, Jason Miller, told reporters on a conference call on Monday morning. \"But the fact is President Trump has been the one who's been stopping the violence the whole time.\" Real Clear Politics Biden and other Democrats on Sunday accused Trump of trying to inflame racial tensions to benefit his campaign as the president praised supporters who clashed with protesters in Portland, Ore., where one man had just died, and announced he will travel to Kenosha, Wis., amid anger over the shooting of another Black man by police. Trump is slated to go to Kenosha on Tuesday, and then make his own trip to Pennsylvania on Thursday, as he campaigns in Latrobe. In his Pennsylvania speech on Monday, Biden also said he'd \"be looking to lower the temperature in this country, not raise it. I'd be looking to unite the nation.\" In addition, the former vice president talked up his economic plans, saying his energy XLE strategy \"has a place for the energy workers right here in western Pennsylvania\" and that he is \"not banning fracking, no matter how many times Donald Trump lies about me.\" The S&P 500 index SPX, +0.87% and the Dow Jones Industrial Average DJIA, +0.56% on Monday were trading mostly lower on August's last session, but staying on track to notch monthly gains of 7% or more."}]}