{"article": [{"url": "https://www.marketwatch.com/story/back-to-normal-we-can-do-better-here-are-the-best-new-ideas-in-money-11601997311", "published": 1601983400.0, "headline": "Back to normal? We can do better: Here are the best new ideas in money", "body": "Illustrations by Kevin Whipple The universe is mean. Average. A man who wins the lottery will feel a million times happier at first, but research shows this mood windfall is short-lived. Even if he manages not to blow the money, his level of happiness will soon settle back to that of his crabby, pre-jackpot self. The same gravity awaits the fund manager who beats the market for eight quarters, the dieter who loses 15 pounds in January, or the backup catcher riding high above the Mendoza line in April. Even our spending and saving habits tend over time toward a certain baseline on behavioral scientist Scott Rick’s spendthrift/tightwad scale. Of course, in 2020 one could argue the universe isn’t nearly mean enough. With a global pandemic, an economy in chaos, a society reckoning with its inequities and injustices, we’d kill for even a little regression to the mean. When will life get back to normal? Average could run for president. In fact, many voters headed to the ballot box next month probably don’t want a revolution so much as a reversion to the mean. So can we just sit back and doomscroll Twitter until the mean comes back from sabbatical? Maybe, but don’t count on it. The statistical arc of the universe bends toward average, but it doesn’t take a Sir Francis Galton or even a Nate Silver to know we might not be able to wait that long. Means change. Cataclysmic events can spin the planet off its axis. Cataclysmic enough and it might even turn spendthrifts into tightwads, as Scott Rick told me. Social scientists say a crisis like COVID-19 is a “focusing event,” one that recalibrates public policy and cultural norms. The death of George Floyd is another example. Sometimes it takes a crisis or tragedy to get society to wake up, look in the mirror, face up to uncomfortable truths and find a better way forward. That is the essence of MarketWatch’s third annual Best New Ideas in Money, which explores innovative thinking with the potential to change how we live, work, spend, save and invest. New thinking and action may be needed to repair the economy and the world. This year’s Best New Ideas in Money run the gamut from new approaches to philanthropy, new ways of measuring the economy and new ways to shop. The stories will appear throughout October. Money itself was a technological innovation. And now it may need upgrading to make the world a better place. Or at least, a better-than-average one. Let me know what you think. But don’t be mean. How to protect America from the next economic calamity Illustration by Kevin Whipple The solution to the retirement crisis is still in its infancy Illustration by Kevin Whipple Charity on a deadline: Why more philanthropists are spending themselves out of existence Illustration by Kevin Whipple Here’s how the federal government could help millions of students better afford college Illustration by Kevin Whipple COVID-19 devastated nursing homes — here are safer, more cost-effective options Illustration by Kevin Whipple"}]}