{"article": [{"url": "https://www.marketwatch.com/story/americans-love-affair-with-pickup-trucks-might-be-derailing-their-retirement-plans-2020-09-23", "published": 1601119940.0, "headline": "Americans' love affair with pickup trucks might be derailing their retirement plans", "body": "The Wall Street Journal recently shared the story of a couple who is struggling because the pandemic has upended their jobs and income. To make matters worse, they're dealing with a massive amount of consumer debt. The article says: \"The Denton, Texas, couple pay $4,400 a month on their mortgage, four car loans and leases, and student debt, Ms. Scott-White said. Minimum required monthly credit-card payments total about $700. The debt was manageable pre-pandemic, she said. \"She deferred lease payments on her Infiniti QX60 for three months and started paying again with unemployment benefits. Her husband traded in his Ford F-150 in August for a lower-cost car and reduced his original monthly payment of $820 by about $100, and his income covers the $2,100 mortgage.\" (Emphasis added.) The Ford F, -1.36%  F-150 payment stuck out to me for a couple of reasons. Maybe it's because I live in Michigan, but I see Ford trucks all over the roads. And a monthly outlay of $820 is quite high for a car payment, especially when you consider this family has credit card debt and three other car loans or leases. After doing some digging, it's no surprise I see so many Ford F-Series trucks on the road. It's been the best-selling vehicle in the United States for 39 straight years. (And it looks like 2020 will make it 40 in a row.) In fact, the top three vehicles in the U.S. over the past seven years are pickup trucks: That's more than 13.2 million new pickups sold from 2013-2019, and these are only the most popular models. I'm sure there are people in certain professions who need a truck, but I'm not sure how so many millions of people afford the payments on them. If you get all of the bells and whistles such as four-wheel drive, extended cab and such, these trucks can run anywhere from $50,000 to $70,000.Truck poor For a 60-month loan at 4%, that's a monthly payment in the $800-$1,300 range, depending on your down payment. And these numbers don't include extras like gas or insurance. That's a lot of money for a truck if you're not regularly using it on the job. I understand why it can be hard to save more for many families. Some people simply don't make enough money. Others are bogged down with student loans. And then there are those who have seen their careers or businesses upended by the 2009 financial crisis and 2020 pandemic. But there are certainly people out there who spend far more than they should on their vehicle(s), and it is inhibiting their ability to get ahead financially. Adam Ozimek, an economist at Upwork, shared similar thoughts on Twitter: iframe.twitter-tweet { width: 100% !important; } Ozimek's hurdle rate for buying a $40,000 car are a touch higher than mine, but the point remains that there are plenty of people driving expensive cars who don't have enough savings elsewhere.Spending priorities I know I shouldn't judge other people's spending habits, but I'm constantly looking at decked-out trucks and SUVs on the road and thinking to myself, \"I wonder if that person maxes out their 401(k)?\" Or: \"Do they have an emergency fund set up because you can't spend that Land Rover in a pinch?\" The difference between the monthly payment on a $45,000 vehicle and a $20,000 vehicle is basically enough to max out your individual retirement account (IRA) in a given year. The difference between a new $70,000 truck and a $20,000 used model would be enough to fund nearly 60% of the way toward maxing out your 401(k). And a new vehicle depreciates the minute you drive it off the lot while your retirement savings grow over the long term. Driving an inexpensive car is one of the biggest levers people can pull to free themselves up financially to save more. It's also true that the good feelings you get from buying a more expensive vehicle are fleeting. Researchers from the University of Michigan studied drivers of a BMW BMW, -1.55%, Honda HMC, -1.21%  Accord and Ford Escort. During a short trip such as a test drive, people reported more positive feelings for a luxury brand like a BMW. This is because you're hyper-aware about all of the features that come in a more expensive ride during that initial drive.The happiness factor But once people began taking the cars for longer trips, those feelings all but evaporated. The correlation of positive feelings to the price of the car was essentially zero. Once you get behind the wheel enough times, the novelty wears off and it becomes more about traffic, other drivers on the road and getting from point A to point B. I'm not saying people can't have nice things. I don't want to be that personal-finance scold who constantly tells people all of the things they can't spend money on. But if you're struggling financially, your vehicle is the perfect place to find some wiggle room since a more expensive car or truck isn't going to make you any happier. Ben Carlson is the author of the investing blog \"A Wealth of Common Sense,\" where this was first published. It is reprinted with permission. Follow him on Twitter @awealthofcs."}]}