{"article": [{"url": "https://www.marketwatch.com/story/whats-the-problem-with-the-4-rule-11596799147", "published": 1596880820.0, "headline": "What's the problem with the 4% rule?", "body": "Getty Images/iStockphoto It's scary to retire with a pool of money, knowing how you handle it determines your financial security for the next 25 years or so. It must seem even scarier to everyday Americans who don't think they can count on Social Security. A recent Tweet caught my eye. It linked to an article about the problems with the so-called 4% rule. As you might recall, the 4% rule states that, if you withdraw 4% of your portfolio's value in the first year of retirement and thereafter step up the dollar amount withdrawn with inflation, you have a good shot at making your money last 30 years. What's the problem with the 4% rule? The article mentioned that people don't spend the same amount each year, past investment results may not predict future returns and people's finances could be upended by major life changes. Meanwhile, others have argued that the rule is outdated. What's the problem? Interest rates aren't what they used to be, plus individuals may not feel comfortable with the assumed investment mix. Getting worried? Yet other critics say the 4% rule results in retirees not spending enough, thereby leaving an unnecessarily large estate. I'm guessing that isn't a problem for most. Still, it seems we have critics saying that the 4% rule leads to both too little spending and too much. Neat trick, wouldn't you say? I was particularly puzzled by the criticism that people don't spend the same amount each year. If you're living on a pension or Social Security, your spending will also vary from year to year. So why is this criticism directed at the 4% withdrawal rate? If you're managing your own income flow, at least you have flexibility not found with a fixed monthly pension. For many people, the key retirement planning question is, \"How much income can I count on for the rest of my life?\" Let's assume you were earning $50,000 a year before you quit the workforce and you want that same income in retirement. First, subtract your Social Security benefit from the $50,000. That might leave you needing to generate $32,000 a year from savings. To that end, you could buy an immediate fixed annuity that'll pay $32,000 a year for life. Today, that annuity would cost a 65-year-old man around $550,000. Alternatively, you could manage the money yourself. Based on the 4% rule, you'd need to retire with $800,000 to generate $32,000. The good news: Unlike the annuity, the 4% rule should result in a growing income stream. For instance, after withdrawing $32,000 in the first year of retirement, you might pull out $32,960 in year two, assuming 3% inflation. Still, there's a tradeoff. With the annuity, you have guaranteed income for life-but you've turned over $550,000 to an insurance company and you've left yourself vulnerable to inflation. Meanwhile, with the 4% rule, there are no guarantees. Maybe your annual income will rise with inflation and you'll leave excess funds to your heirs-or maybe you'll run out of money and die broke. Keep in mind that nothing says you have to withdraw the exact sum specified by the 4% rule. If you need less, take less. Alternatively, take the amount based on the formula from your long-term investment portfolio, but add some of the money to your emergency fund. That'll give you a financial buffer if, say, we have a year with a significant market downturn and withdrawing the full amount specified by the 4% rule doesn't seem prudent. Here are five additional pointers: In addition to the nest egg you'll use to generate income, aim to start your retirement with a reserve fund. If you're using the 4% rule, modify it annually based on your spending needs. Don't need the full inflation increase? Don't take it. Make sure your living expenses are less than your expected income, so you have some wiggle room. Budget for health care. It's a big item, but not as big as some suggest. You see projections that retirees will spend hundreds of thousands on health care. Maybe, maybe not. The predictable annual cost is what matters. For most, that'll be Medicare Part B and D premiums, plus Medigap premiums. Yes, Medicare does involve some modest out-of-pocket costs. But the real wildcard is long-term care. It won't affect many, but those affected could face huge costs: About 2.4% of the population over age 65 is in a nursing home, though many of those are there on a temporary basis. Read: 5 things to know about medical care in retirement Consider combining an immediate annuity with retirement assets where you use the 4% rule. That way, you'll have steady income from Social Security and the annuity-but you'll still retain control of part of your nest egg. As you navigate all of this, you will have the added complication of taking required minimum distributions (RMDs) from your retirement accounts. Interestingly, the RMD schedule starts close to 4%. At age 72, the required withdrawal rate is 3.9%, rising to 4.37% at age 75, 5.35% at age 80 and 6.76% at age 85. The upshot: There may be those who say that withdrawing 4% plus an inflation increase is too much, and yet the IRS effectively insists that retirement account investors withdraw that sort of amount-though just because the IRS insists doesn't mean you have to spend the entire sum. Is any retirement income guidance totally reliable? I doubt it. You'll inevitably need to make adjustments along the way. Still, I think the 4% rule is helpful. My advice: Be more conservative than the rule suggests-and, if you're married, that's doubly true, because you need to make your money last for two lifetimes. This column originally appeared on Humble Dollar. It was republished with permission. Richard Quinn blogs at QuinnsCommentary.com. Before retiring in 2010, Dick was a compensation and benefits executive. Follow him on Twitter @QuinnsComments."}]}