{"article": [{"url": "https://www.marketwatch.com/story/consumer-confidence-tumbles-to-new-pandemic-low-after-summer-viral-outbreak-2020-08-25", "published": 1598355920.0, "headline": "Consumer confidence tumbles to new pandemic low after summer viral outbreak", "body": "The numbers: Consumer confidence fell in August to a new pandemic low after a fresh rash of coronavirus cases during the summer caused Americans to turn more pessimistic about an economic recovery, according to a closely followed survey. The index of consumer confidence sank to a six-year nadir at 84.8 this month from a revised 91.7 in July, the Conference Board said Tuesday. Economists polled by MarketWatch had forecast the index to rise to 93.0. The surprising decline in consumer confidence puts the index below April’s 85.7 reading during the height of the economic lockdown. It may have also been spurred by the expiration of a $600 federal unemployment stipend at the end of July. President Trump has since authorized temporary $300 payments, but not every state is providing the money and the checks are just starting to go out. Read:Washington deadlock on jobless benefits, coronavirus aid risks economic recovery A pair of other consumer surveys, meanwhile, seem to suggest confidence is starting to mend again. The consumer sentiment index produced by the University of Michigan edged up slightly in August, though it was still quite low. And the daily tracker by Morning Consult has been creeping higher in the past two weeks. See:MarketWatch Coronavirus Recovery Tracker What happened: A rising level of confidence in May and June faltered during the summer after a new coronavirus outbreak largely in the South and West. It remains to be seen if confidence starts to rise again with caseloads receding. An index that gauges how consumers feel about the economy right now slid to 84.2 in August from 95.9 in the prior month. Americans are just as pessimistic about the near future. Another gauge that assesses how Americans view the next six months—the so-called future expectations index—dropped to 85.2 in August from 88.9. That’s also a new pandemic low. “Consumer spending has rebounded in recent months but increasing concerns amongst consumers about the economic outlook and their financial well-being will likely cause spending to cool in the months ahead,” said Lynn Franco, senior director of economic indicators at the board. Big picture: After a roller-coaster ride in the past several months, the economy has settled into a more gradual pace of recovery. Americans are venturing out to eat more often and movie theaters have started to reopen, among other things. Yet the persistence of the coronavirus, the reduction of temporary federal benefits and still-high unemployment are likely to keep the recovery from speeding up much before the end of the year. What they are saying? “I have to admit that I do not take this latest reading at face value,” said chief economist Stephen Stanley of Amherst Pierpont Securities. “If you believe the number, then consumers are feeling worse in August than they were in the depths of the lockdown. I can’t imagine that anyone believes that.” “Covid-19 levels have dropped from their July peaks, and assuming that continues and broad government support is reinstated, we could see the rate of business openings, confidence and spending rise in the fall,” said corporate economist Robert Frick of Navy Federal Credit Union. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% extended its losses after the drop in confidence. The S&P 500 index SPX, +0.87% wavered in Tuesday trade after recording an intraday record closing high."}]}