{"article": [{"url": "https://www.marketwatch.com/story/how-to-shop-for-the-right-economy-car-2020-06-24", "published": 1592975540.0, "headline": "How to shop for the right economy car", "body": "High on the list of reasons to buy a small car is affordability and fuel economy. And a vehicle’s compact size is a benefit when it comes to parking and overall maneuverability. But getting the right one takes a bit of study to find one that’s right for you. Here’s a list of things to consider in the small car shopping process.Fuel economy While fuel prices have moderated somewhat recently, a big driver of small car sales is efficiency. Gas prices may not remain low forever, as witnessed by California’s experience which has seen the per-gallon price climbing back up in some areas. When considering fuel economy, the flip side of that is power. Most small cars with the 40 mpg fuel economy numbers typically use small-displacement non-turbocharged engines. They’re great for delivering high fuel economy and make terrific city cars, but if you have any thoughts of freeway driving, you may want to consider a more powerful turbocharged version to make merging a little easier. Diesel engines offer plenty of torque, fuel economy and range, but typically they will be found on compact class and higher cars and usually at a premium over conventional gas engines. Also, diesels need additives (urea-based fluids) to meet emission standards, which is an additional expense and maintenance item. Also see: These 3 EVs are the lowest cost to own over 5 years Another option is either a hybrid, plug-in hybrid, or battery EV. All deliver great acceleration along with high efficiency. The downside is that typically hybrids and EVs are more expensive. Federal tax credits and local on plug-ins and EVs may take some of the sting out of the higher prices. EVs are good for city dwellers or those with short commutes, but typically the range of pure electrics in this class of vehicles is still in the 90 to 100-mile range between charges.Transmission choice Most small cars come with traditional 5-, 6- or now more commonly, 8- or 9-speed automatic transmissions. Also, for traditionalists who like to shift for themselves, some 6-speed manuals are still available but not as common as they once were. The wider range of gears deliver better fuel economy thanks to the overdrive top gears. In another trend, many of these small vehicles are relying on continuously variable transmissions. These CVTs are smooth in operation, but there is still a tendency for them to feel a bit elastic in acceleration or hold the engine at a high rpm in steady-state cruising. This droning condition is called “motorboating.” A test drive will quickly tell you which transmission is right for you. Also see: This car could be Toyota’s best-kept secretCabin comfort Small cars are, well, small. Most have seating for five but in pretty cramped quarters. If you’re single, married, or have two small children, most subcompacts should meet your needs, although a new emerging class of vehicles, the subcompact crossover SUV. These include the Buick Encore, Chevy Trax, Honda HMC, -1.21% HR-V, and Mazda MZDAY, -1.05% CX-30. They offer a bit more room than the traditional sedan or hatchbacks based on the same underpinnings. Plus, this new class of vehicles offers the additional benefit of a higher ride height, better visibility, and more cargo space behind the second row. The other option is to move up a class to a compact-sized vehicle.Safety The other side of vehicle size is safety. As car size increases, the more mass you have around you, the safer you are. It’s simple physics. Although many of today’s cars are the safest ever, an extra margin is provided in compact-class cars as opposed to subcompacts. You can also check NHTSA and the IIHS websites to see what a vehicle’s crashworthiness is under the federal 5-star program. There are additional tests that go beyond current safety standards, like IIHS’ small overlap crash test. Also see: 8 affordable new cars priced well below $20k Other safety features to look for include backup cameras, blind-spot and cross-traffic alerts, lane departure warnings, and adaptive cruise control. Keep in mind that some of these features are standard on larger cars, but more likely are extra-cost options on subcompact and compact models, which again will impact the final price you pay.Surprise and delight features Good things do come in small packages. Keep your eye out for surprise and delight features. Take the Honda HR-V for example. Its Magic Seat configuration provides a surprising amount of cargo space and seating configurations. Other key features to look for include keyless entry/start, heated seats, Bluetooth connectivity, music apps like Pandora, PANDY, +12.03% satellite radio, and navigation. Again, some features, like Bluetooth and USB ports are standard on many entry-level cars, but other features, like navigation, are not and can add considerably to the final price of the car. This story originally ran on KBB.com."}]}