{"article": [{"url": "https://www.marketwatch.com/story/10-year-treasury-yields-hangs-around-six-week-low-as-coronavirus-fears-dog-wall-street-2020-06-30", "published": 1593537620.0, "headline": "Treasury yields finish mostly higher to end a listless quarter of trading", "body": "Treasury yields mostly rose Tuesday, following the buoyant sentiment in the stock market, after a round of solid economic data bolstered investor hopes in the U.S. recovery despite a rising tally of COVID-19 cases.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 1.7 basis points to 0.653%. The two-year yield TMUBMUSD02Y, 0.156% was barely changed at 0.152%, but stood at its lowest level in seven weeks. The 30-year yield TMUBMUSD30Y, 1.576% edged 2 basis points higher to 1.410%. In a listless month, the two-year note was down 0.4 basis points, the 10-year note gained 0.3 basis points, while the 30-year bond yield was up 0.3 basis points. For the second quarter, the two-year note fell 3.8 basis points, the 10-year note picked up 3.8 basis points, and the 30-year bond yield added 6.4 basis points. What’s driving Treasurys? In U.S. economic data, April’s S&P CoreLogic Case-Shiller national home price index rose 4.7% year-over-year in April. June’s Chicago purchasing managers’ index rebounded slightly to 36.6 in June, after falling to a 38-year low in May. Meanwhile, the Conference Board reported its index of consumer confidence rose to 98.1 this month from a revised 85.9 in May. In China, the official manufacturing PMI for June came in at 50.9, according to the country’s National Bureau of Statistics. Readings above 50 signify an expansion in economic activity, while those below 50 signal contraction. This raft of strong data helped equities to shrug off concerns around the coronavirus, with major stock-market benchmarks booking their best quarter in around two decades on Tuesday. Investors are watching the rising number of coronavirus cases in at least with 35 U.S. states which are resulting in business activity slowing again. California Gov. Gavin Newsom ordered bars in several of the state’s counties to close again, and Arizona’s Gov. Doug Ducey said his state’s bars, gyms, movie theaters and water parks would be shut down for at least 30 days Tedros Adhanom Ghebreyesus, head of the World Health Organization, on Monday said “the worst is yet to come,” regarding the state of the pandemic. His remarks came a day after COVID-19 reached two milestones: 10 million confirmed infections worldwide, and 500,000 deaths. Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said Tuesday “we do need to open up again, no doubt about it, we want to get the economy back, but you’ve got to do it in a measured way, and now we’re seeing the consequence of community spread, which is even more difficult to contain.” Fed Chairman Jerome Powell and U.S. Treasury Secretary Steven Mnuchin spoke in front of the House’s Committee on Financial Services. Powell warned the U.S. recovery would suffer a setback if the virus was not brought under control. New York Fed President John Williams said the U.S. economy was far from healthy even if worst of the coronavirus outbreak was over.What did market participants say? “The combination of better-than-expected consumer confidence and strong equity performance overshadowed any” rebalancing flows, as investors were expected to pull their gains away from equities and plough them into government bonds, said Ian Lyngen, head of U.S. rates strategy at BMO Capital Markets. He also added portfolio managers may have rebalanced their portfolios well in advance of Tuesday, and, as a result, the bond market did not rally as it usually would at the end of the month and quarter."}]}