{"article": [{"url": "https://www.marketwatch.com/story/which-is-better-the-ford-bronco-or-the-land-rover-defender-2020-09-04", "published": 1599196340.0, "headline": "Which is better, the Ford Bronco or the Land Rover Defender?", "body": "The 2021 Ford Bronco is most likely to be cross-shopped with the Jeep Wrangler, and if not the Wrangler, then the Toyota 4Runner. But there’s another new midsize off-road SUV on the scene – the Land Rover Defender – that has a similar form-factor to the Bronco and elicits similar feelings of old-school nostalgia. We haven’t actually had a chance to drive either vehicle yet, but here we’ll compare the two to see how they stack up on paper.Quick facts The 2021 Ford F, -1.36% Bronco is all-new and rides on a body-on-frame platform with an independent front suspension and a solid rear axle, and has a removable roof and doors. The Land Rover Defender is all-new for 2020 and rides on a platform shared with the Range Rover, Range Rover Sport, and Discovery. It uses a fully-independent suspension with standard height adjustability. 2021 Ford Bronco The Ford Bronco. Ford Base price: $29,995 What we like: Classic looks; bold off-road technology; removable roof and doors; 35-in tires available on all trims. What we would change: Likely won’t be available in large quantities for over a year and dealers will try to charge big markups. Overview: After being discontinued in 1996, the Ford Bronco returns as an all new take on this legendary vehicle. The new one is more closely inspired by the original Bronco from the 1960s than the F-series based Bronco made famous in the 1990s. The new Bronco is aimed squarely at the Jeep Wrangler, though it lacks the Wrangler’s solid front axle. That said, while the die-hards will lament the Bronco’s independent front suspension setup, IFS is the better choice for on-road driving, and the Bronco offers all of the Wrangler’s configurability, with a removable roof and doors, but in a more modern, more innovative design. It’s the first vehicle to ride on Ford’s next-generation midsize truck platform, and it’s offered with either a four-cylinder or six-cylinder engine, both of which are turbocharged. The four-cylinder can be had with either a ten-speed automatic or a new six-speed manual with a special ultralow crawler gear, while the V6 comes standard with the 10-speed. Also see: The all-new Ford Bronco Sport: a smaller Bronco with more mass appeal The Bronco’s design is heavily inspired by that of the original, which was sold from 1966 through 1977. Both two- and four-door bodystyles will be available. While it carries a starting price of just under $30,000, in its most performance-oriented off-road trims, a Bronco will run you between $50,000 and $60,000, pitting it against the Wrangler Rubicon, the Toyota 4Runner TRD-Pro, and a Defender with basic options. What’s new for 2021: The 2021 Ford Bronco is all-new. Features and technology: Ford designed a lot of new off-road tech for the Bronco. The vehicle’s main selling point for a lot of people will be its removable roof and doors; which appear to offer more versatility than anything else on the market. Beyond this, the Bronco will be available in a number of different trims, the most capable of which are the Wildtrack, which prioritizes going fast off-road, and the Badlands, which aligns closely with the Jeep Wrangler Rubicon. Additionally, a ‘Sasquatch package’ is available on any trim level and adds 35-in tires, locking front and rear differentials, an off-road suspension, and more. Related: The 10 coolest things about the new Ford Bronco There are also a number of different driving modes, a one-pedal driving features, an off-road turn mode, and a disconnecting front sway bar that comes standard on the Badlands. The Ford Bronco 2-door. Ford Expect Ford to debut loads of accessories for the new Bronco as well. The Bronco also comes with the latest version of Ford’s Sync infotainment system, which will offer a number of new features and work with different mapping services, allowing you to plot out your off-road adventures before you actually hit the trail. What’s the future hold? While it’ll likely be a year before you see a Bronco on the road, down the pipeline even further is likely a top-tier Raptor trim and supposedly a pickup version meant to compete with the Jeep Gladiator. 2020 Land Rover Defender The 2-door Land Rover Defender. Landrover USA Base price: $51,000 What we like: Like the Bronco, the Defender’s design leans heavily on its heritage; air suspension is standard; pricing allows it to be cross-shopped with upper trims of mainstream off-roaders like the Bronco, rather than just other luxury SUVs. What we would change: Not as utilitarian as the original; unibody platform has more in common with the Explorer than the Bronco; Land Rover isn’t known for reliability. Overview: The new Land Rover defender is significantly different from the vehicle it replaces. The original Defender, which had been on sale since the 1980s, but hadn’t been sold in the US since 1997, rode on a body-on-frame platform with solid axles front and rear. The new Defender, on the other hand, uses a unibody platform shared with the Discovery, Range Rover Sport, and full-size Range Rover, and uses a fully-independent suspension setup. While it isn’t as rugged as the vehicle it replaces, the new Defender will be an excellent on-road vehicle, while still being able to keep up with Broncos, Wranglers, 4Runners, and G-Wagens in the majority of off-road environments, thanks in part to a standard air suspension system. See: The 10 coolest things about the Land Rover Defender Like the Bronco and Jeep Wrangler, the new Land Rover Defender is offered in both two- and four-door bodystyles, though we expect the vast majority of Defenders you see on the road to be of the four-door variety. Like the Bronco, the Defender is available with two different engines; a turbocharged four-cylinder and a turbocharged V6. An 8-speed automatic is standard across the board. What’s new for 2020: Like the Bronco, the Defender you see here is all-new. Features and technology: The Defender comes standard with air suspension, which allows you to adjust its ride height by up to 3 inches, making for up to 11.5 inches of ground clearance. The Defender also packs a number of standard trail modes, a locking center differential, and an automatically locking rear differential. Land Rover offers the Defender with a number of different ‘accessory packs’ the most comprehensive of which adds a platform-style roof rack, a ladder for accessing said roof rack, a side-mounted storage box for gear, mud flaps, and more. The Defender’s towing capacity of 8,200 lbs. has a nearly 5,000 lb. edge over the Bronco. Landrover USA Additionally, The Defender is available as a seven-seater, thanks to an available third row on the 110 model, though it’s pretty tight back there. What’s especially unique is that the Defender is available as a six-seater as well thanks to an available front bench seat – making it the only mainstream passenger vehicle sold new in the U.S. today that seats three across up front. Additionally, a large 10-inch center infotainment screen comes standard, while most every active safety feature you could want is available, though not all come standard – a typical upsell tactic when it comes to European luxury cars. What’s the future hold? The first version of the Defender to go on sale in the U.S. is the four-door 110 model, but the delightful two-door Defender 90 should be arriving at dealerships by the end of the 2020. No matter how charming, two-door SUVs tend to do poorly in the U.S. market, so we wouldn’t be surprised if the 90 is only offered in very small quantities on this side of the pond. Down the line, we expect off-road ‘SVX’ and performance-oriented ‘SVR’ trims to be added to the lineup. Bronco vs. Defender: Strengths comparison Either vehicle offers a go-anywhere attitude and the aesthetics to match. Additionally, both vehicles are available as two-door models – bold moves on the part of Ford and Land Rover, as the vast majority of sales are certain to be four-doors. Both vehicles can be accessorized straight from the dealership, and either can be had with a four- or six-cylinder turbocharged engine. Altogether, while either one will scratch the itch, the Bronco is the more toylike of these two vehicles, while the Defender is better described as ‘rugged luxury’. Don’t miss: These are the best new cars for a road trip Both offer off-road capability, but the Bronco will take you further into the rough stuff thanks to its solid rear axle, available 35-in factory tires, and bevy of off-road features like front and rear locking differentials and a cleverly-designed disconnecting front sway bar. And when you do damage to either vehicle on the trail, expect repairing a Bronco to be a far easier, and far less costly endeavor. That said, if you’re already comfortable owning a European luxury car, the Defender has its merits too; they just come in the form luxury, comfort, on-road performance, towing capability, and interior refinement, though Land Rover isn’t exactly known for long-term reliability. Check out: A first look at Toyota’s new RAV4 plug-in hybrid Ford Bronco benefits: The most obvious benefit of the Bronco are its removable doors and roof, assuming that’s something that interests you. The Bronco, a mainstream vehicle, is also more affordable than the Defender, a luxury car molded into the form of a rugged off-roader. A well-equipped (or even fully loaded) Bronco will cost you about as much as a bare-bones Defender, though the Defender does offer more standard features. Additionally, while the Bronco likely won’t be available in large quantities for more than a year, once Ford does ramp up production, Broncos will be far more common than Defenders, with availability of parts, dealership access, and reliability all falling in Ford’s favor. Land Rover Defender benefits: While it leans into its rugged roots, at the end of the day, the new Defender is a luxury vehicle. This means it comes with a nicer and quieter cabin, more sophisticated design, and more standard features than the Bronco. Also, the Defender’s towing capacity of 8,200 lbs. has a nearly 5,000 lb. edge over the Bronco, while the Defender’s standard air suspension means you can adjust the ride height while off-road, and keep things snug to the ground when on-road; the Bronco will likely ride like a truck regardless of the terrain you’re on. Read: Four electric and hybrid SUVs that can tow some serious weight Additionally, while pent-up demand means it’s still tough to come by, the Defender is already on sale here in the U.S., meaning you won’t have to wait a year or so to get your hands on one like you will a Bronco. While the Defender tops out at over $100,000 in fully loaded form, what’s nice is that you can get one equipped to compete with the most capable versions of the Bronco and Wrangler – meaning different terrain modes, steel wheels, all terrain tires, the ‘Explorer’ accessory pack, and not much else – for around $60k, putting it right on par with America’s off-road torch bearers. Once both have been on sale for a year or so, the Defender will emerge as the more exclusive, more niche of these two off-roaders.Bronco vs. Defender: Which is better? Both of these two have their merits, and both offer above-average off-road capability, but they’ll ultimately appeal to different buyers. The Bronco will be purchased by younger people looking for a toylike, expressive vehicle to supplement their active lifestyle. Also see: 8 new luxury SUVs for under $50,000 The Defender will likely appeal more to an older, more affluent customer base who occasionally may do some off-roading, but don’t make it their top priority. We’re just calling it how we see it though; a Bronco will work perfectly fine as a pavement queen, while the Defender is more than suitable for overlanding duty. Regardless, we’re elated that both of these vehicles exist today, and even more so by the fact that they’re available as two-doors. When it comes down to it, the Bronco is the better value, but within a couple of years, the Defender will likely wind up the more exclusive of these two off-roaders. Only you can decide which is right for you. See a comparison of stats of these two vehicles at Autotrader.com. This story originally ran on Autotrader.com."}]}