{"article": [{"url": "https://www.marketwatch.com/story/the-markets-in-la-la-land-and-one-warren-buffett-buff-warns-of-an-imminent-reckoning-for-oblivious-investors-2020-06-18", "published": 1592685560.0, "headline": "'La la land?' The stock market is 'insanely disconnected' and due for a 'reckoning,' Warren Buffett buff warns", "body": "Those betting against this \"absurdly overvalued\" stock market are about to get paid, if Kevin Smith, Crescat Capital's chief investment officer, has it right in his gloomy assessment. \"Speculation is rampant and being championed by a bold new breed of millennial day traders,\" he said. \"The mania is based on a widespread hope in Fed money printing. The catalysts for reckoning are numerous as a major cyclical economic downturn has only just begun.\" Smith, who recently talked about learning the ropes from a stack of Berkshire Hathaway BRK.A, +0.06% BRK.B, +0.24%  shareholders letters his dad gave him long ago, said, in a very un-Warren Buffett fashion, that shorting stocks \"is worthy of a significant allocation today.\" Smith used this chart of plunging S&P 500 SPX, +0.87% profit margins to show \"how insanely disconnected equity prices are from their underlying fundamentals.\" He warned that buy-the-dip investors are \"not paying attention and have simply been too eager to call the bottom.\" Smith reiterated his \"macro trade of the century\" call that there's never been a better set-up for rotating out of overvalued stocks and into undervalued precious metals. \"Markets driven by euphoria never end well,\" he explained in a note to clients this week. \"The U.S. stock market today is in la-la land. It is discounting a new expansion phase of the economy at the same time as a major recession has only just begun.\" Smith took some lumps in his funds when the market was soaring early in the year, but his returns ballooned in March as the coronavirus pandemic arrived. Here are his historical numbers: The severe \"reckoning\" Smith has been warning about hasn't arrived as of Thursday's trading session, but the Dow Jones Industrial Average DJIA, +0.56%, S&P 500 and tech-heavy Nasdaq Composite COMP, +1.39% were all under pressure, at last check."}]}