{"article": [{"url": "https://www.marketwatch.com/story/charity-on-a-deadline-why-more-philanthropists-are-spending-themselves-out-of-existence-11601997107", "published": 1602080780.0, "headline": "Charity on a deadline: Why more philanthropists are spending themselves out of existence", "body": "Illustration by Kevin Whipple Extraordinary times call for extraordinary measures, and philanthropists have put that maxim into action by accelerating their spending. The Bill & Melinda Gates Foundation has committed more than $500 million to fight the coronavirus pandemic. Twitter TWTR, -0.23% CEO Jack Dorsey pledged $1 billion for coronavirus relief and later added racial justice organizations to his list of beneficiaries. MacKenzie Scott, ex-wife of Amazon AMZN, +3.01% CEO Jeff Bezos, has handed out $1.7 billion to address the pandemic, racial justice and other issues. The moment has also brought new momentum to a less popular style of philanthropy: Spend-down, or time-limited, philanthropy, in which charitable foundations spend their assets by a certain date, then close up shop. This is in contrast to a traditional foundation, in which a wealthy person puts money aside to address an issue of their choosing, such as cancer research or animal cruelty. These foundations are typically designed to last forever, and they tend to hand out money relatively slowly. In fact, they’re required to give out only 5% of their assets each year in grants to nonprofits. The spend-down approach has its critics, and the debate goes to the heart of some thorny questions: What is the best way to use money to solve society’s problems? Who benefits when a foundation exists in perpetuity? Meanwhile, growing wealth inequality and ever-louder critiques of philanthropy have added to a sense that it’s time to rethink how to spend money for the greater good. Also see: He went from multibillionaire to relatively broke and living in a small apartment — just as he planned Foundations and funders that are tackling “massive, wicked problems” like climate change, social justice and racial inequity have also come to realize that these issues “won’t be solved by allocations of 5% every year,” said Melissa Stevens, executive director of the Milken Institute Center for Strategic Philanthropy. “There’s no longer really this choice of, ‘Go big or go home.’ It’s rather an imperative to go big and be part of a better solution.” Why spend-down philanthropy is becoming more popular now Spend-down philanthropy is not new, but it is still outside the norm. About 70% of foundations are designed to exist in perpetuity, and about 30% have put deadlines on their spending, according to a January 2020 report by Rockefeller Philanthropy Advisors and Campden Wealth. The number of foundations pursuing a time-limited strategy has increased by nearly two-thirds since 2000. “The interest in time-limited philanthropy has been growing pretty steadily over the last 20 years, and the current crises seem to be accelerating that,” said Melissa A. Berman, president and CEO of Rockefeller Philanthropy Advisors. “ “There’s no longer really this choice of, ‘Go big or go home.’ It’s rather an imperative to go big and be part of a better solution.” ” — Melissa Stevens, executive director of the Milken Institute Center for Strategic Philanthropy The heads of three spend-down foundations recently urged others to follow their lead, writing in July in the Chronicle of Philanthropy: “There is no better time than now for philanthropy to spend itself out of existence.” Rather than fully embrace a spend-down model, some foundations are increasing their payout rate this year. The Wallace Global Fund, for example, said it would spend 20% of its assets on coronavirus relief. This year, the Atlantic Philanthropies, probably the best-known spend-down foundation, closed its doors — as it had planned to — after donating $8 billion over 38 years. Founder Chuck Feeney, who made his fortune as co-founder of Duty Free Shoppers, signed off with a message: “To those wondering about Giving While Living: Try it, you’ll like it.” Others appear to be following his lead. Every decade or so since the 1990s there have been predictions of a new wave of spend-down foundations on the horizon that have not materialized, said Ben Soskis, a research associate in the Center on Nonprofits and Philanthropy at the Urban Institute who studies the history of philanthropy. But this moment feels different, Soskis says, in part because today’s billionaire philanthropists are making their money as young people. Gilded Age philanthropists such as Andrew Carnegie and John D. Rockefeller were in their 70s when they started their private foundations, both of which still exist today. Facebook FB, +0.26% CEO Mark Zuckerberg, for example, was 31 when he and his wife, Priscilla Chan, announced both the birth of their first child and their intention to give away 99% of their Facebook shares while they were still alive. “ “When you start to make your wealth earlier in life and you take on a responsibility as a philanthropist as a vocation early in life, the idea of perpetuity itself loses its luster.” ” — Ben Soskis, research associate in the Center on Nonprofits and Philanthropy at the Urban Institute “When you start to make your wealth earlier in life and you take on a responsibility as a philanthropist as a vocation early in life, the idea of perpetuity itself loses its luster, because you have five decades as a philanthropist in front of you,” Soskis said. Philanthropists are also becoming more comfortable throwing money at certain problems because it’s now easier to measure the impact they’re having, Berman said. “People are more and more confident that they can have impact by giving at a much faster rate,” she said. Organizations such as the nonprofit GiveDirectly have shown through randomized controlled trials that giving money directly to poor households with no conditions has immediate and lasting benefits, she said. Motivations behind spend-down philanthropy Motivations behind spend-down philanthropy have varied over the years, and sometimes reflect broader societal trends. Industrialist John M. Olin, for example, put his foundation’s spending on the fast track because he feared future generations wouldn’t carry out his conservative vision. He was “troubled by a growing anti-business atmosphere among college students and their professors on many campuses in the late 1960s.” “ “The risk you’re running is that the timeline of your giving doesn’t match the timeline by which change can happen in the issue that you’re tackling .” ” — Melissa A. Berman, president and CEO of Rockefeller Philanthropy Advisors He was also influenced by Henry Ford II’s 1977 resignation from the board of the Ford Foundation, reportedly over frustration that its grantmaking had strayed to the left politically and “reflected little interest in or understanding of the system of private enterprise that had generated the foundation’s wealth.” (Ford, for instance, questioned the foundation’s funding of the arts.) Olin’s philanthropy went on to help create an influential network of think tanks and academic programs that helped shape the conservative movement. Today, some spend-down philanthropists are motivated by an urgency around the world’s most pressing problems. “There is a sense around certain issues, particularly climate change, that there is a tipping point and that putting a lot of resources over a short period of time to keep the crisis from becoming uncontrollable is better than releasing money over a long slow period of time,” Berman said. Pros and cons of spend-down philanthropy Sometimes making big bets gets big results. Philanthropist Irene Diamond, for example, spent down her and her husband’s foundation of more than $200 million over 10 years in the 1980s and ’90s and funded the development of the AIDS “cocktail,” a major breakthrough in AIDS treatment. But other problems are more incalcitrant, Berman noted. “The risk you’re running is that the timeline of your giving doesn’t match the timeline by which change can happen in the issue that you’re tackling,” she said. Funding the creation of a vaccine for COVID-19, for example, could happen on a relatively short timeline. Philanthropists have poured money into that effort, including the Gates Foundation, which is funding research into potential treatments and the manufacture and delivery of vaccine doses in India and other low-income countries. The Gates Foundation is a spend-down foundation, but its timeline isn’t as tight as Irene Diamond’s was. The Gates Foundation plans to spend all of its resources within 20 years after the deaths of Bill and Melinda Gates. Warren Buffett, who pledged most of his fortune to the Gates Foundation, “has stipulated that the proceeds from the Berkshire Hathaway BRK.A, +0.06% shares he still owns upon his death are to be used for philanthropic purposes within 10 years after his estate has been settled.” Jack Dorsey and MacKenzie Scott haven’t publicly announced an intention to be spend-down philanthropists, but Scott has signed the Giving Pledge, a promise to give away at least half of her wealth either during her lifetime or in her will. She and Dorsey, who is one of the top funders of COVID-19 efforts, have won praise for the fast rate of their giving and their transparent approach. Dorsey publicly lists his grants on a Google GOOGL, +1.82% spreadsheet, for example. People who support perpetuity for foundations say it will take a long time to end problems like poverty, racism and bias against girls and women, Berman said, and contend that doing so will require a slow stream of funding over many years. “There is clear value both in acting with urgency and dealing with pain and suffering in the current moment, but there is also benefit in thinking about what is the generational long-term change,” she said."}]}