{"article": [{"url": "https://www.marketwatch.com/story/trumps-positive-for-covid-19-tweet-is-his-most-liked-post-ever-2020-10-02", "published": 1601712800.0, "headline": "Trump's 'positive for COVID-19' tweet is his most 'liked' post ever", "body": "Bad news travels fast. President Trump revealed early Friday that he and his wife Melania have tested positive for COVID-19. And even though he tweeted the bombshell health revelation at 12:54 a.m. Eastern time, when many Americans were asleep, it quickly became his most liked and most widely shared post to date. By 5:30 a.m. Eastern, the tweet had hit that milestone with more than 273,000 retweets and 344,000 quote tweets (a retweet with a comment attached), Axios reported, along with 834,000 likes. But by 9 p.m., those figures had ballooned to more than 900,000 retweets and nearly 549,000 replies plus more than 1.7 million likes - and, presumably, counting. iframe.twitter-tweet { width: 100% !important; } It should be noted that a \"like\" does not necessarily mean that Twitter TWTR, -0.23%  users were glad that the president had tested positive for a virus that has killed 1.02 million people globally. Indeed, many of the more than 461,000 comments featured people wishing the First Couple a speedy recovery. (There were also snarky responses and questioning of the president's response to the pandemic, however, including references to his shifting statements on the coronavirus.) White House Chief of Staff Mark Meadows said on Friday morning that Trump was showing \"mild symptoms\" and was in \"good spirits,\" while Trump's Twitter account was quiet. As Trump traveled to Walter Reed hospital for observation Friday evening, more than 17 hours after announcing his diagnosis, he sent out a video message and said, \"I think I'm doing very well.\" iframe.twitter-tweet { width: 100% !important; } Here's what we know about the president's diagnosis so far, as well as the questions it raises about the November election and national security. Prior to his test-result tweet, Trump's most liked tweet was a 2019 post sharing news that A$AP Rocky had been released from prison and was on his way home to the United States from Sweden. That tweet pulled in some 310,000 retweets and more than 818,000 likes. \"It was a Rocky Week,\" he said back then."}]}