{"article": [{"url": "https://www.marketwatch.com/story/what-investors-should-do-if-they-think-the-stock-market-is-in-a-bubble-according-to-the-folks-who-wrote-the-book-on-bubbles-11596818858", "published": 1597326260.0, "headline": "What investors should do if they think the stock market is in a bubble, according to the folks who wrote the book on bubbles", "body": "Philip Fong/Agence France-Presse/Getty Images The coronavirus shutdown has resulted in a resurgence of day trading, particularly on zero-commission apps. But could the entry of large numbers of speculative day traders create a bubble in stocks? In our book “Boom and Bust: A Global History of Financial Bubbles,” we document the role played by day traders and other novice investors in driving some of the largest bubbles in history. 1929 bubble The most famous example is Wall Street in 1929. While summers at that time were usually the quietest time of the year for stockbrokers, in 1929 many had to cancel their holidays to deal with the number of trades being requested. Many novices gave up their jobs to become day traders, most of them borrowing heavily to invest on margin. Paul Merriman answers: Should you be a day trader? The prospect of margin calls made markets spectacularly volatile -— even those who weren’t borrowing to invest had to worry about forced sales suddenly driving prices down. With markets on a knife edge, all it took was a handful of large trades in the shares of automobile companies to trigger one of history’s greatest crashes. Day traders were also central to the dot-com bubble. It wasn’t just that people were excited by the internet COMP, +1.39% — the internet made it much easier to trade. By 1999 there were 9.7 million active online trading accounts, three times as many has there had been in 1997. After-hours trading was extended to the public around the same time, so day traders didn’t just trade during the day. For the first time they could buy and sell shares any time they liked from the comfort of their own home. The result was internet shares rising by over 1,000 % in the two years up to February 1998—then losing all of these gains by the end of 2000.Chinese day traders More recently, day traders drove a huge bubble in Chinese stocks SHCOMP, +1.67% in 2015. Ordinary Chinese citizens, encouraged by government propaganda and a belief that the government would not let the market collapse, plowed their savings into stocks and became day traders. To meet this demand, brokerage offices popped up around the country, with several firms struggling to process the huge demand for new trading accounts. Thirty million new trading accounts were opened by individual investors in the first five months of 2015. By the end of the bubble in the summer of 2015, there were about 90 million individual investors—more than there were members of the Communist Party. These individual investors accounted for about 90% of daily stock market transactions in 2015. MarketWatch helps you keep up on the latest news about the stock market Many of these novices were completely uneducated—two thirds of investors had not completed high school. Many took incredibly naïve approaches to investment. One newcomer simply picked stocks the way he picked vegetables, buying the cheapest ones at random; another bought stocks on 15 June, the day the bubble popped, because it happened to coincide with President Xi’s birthday. What should I do? If day trading does lead to a bubble, how should investors react? Our study of bubbles over the past 300 years suggests two options. The first is to try to ride the bubble: get in early, and try to get out at the peak. We find evidence that some investors have been able to do this successfully in bubbles—but usually only if they are well-connected or have privileged information. Many more investors overestimate their ability to get out at the right time, and lose money as a result. The second option is to sit it out, then hunt for bargains when the inevitable bust comes. One feature of bubbles that sometimes goes unnoticed is that the crash often goes too far, and historically, the aftermath of a bubble has usually been the best time to invest. In 2001, Amazon AMZN, +3.01% stock was trading at $6, down from a high of $106 -— today that same stock is worth close to $3,000. Are we in a bubble today? Although stock prices SPX, +0.87% are high by traditional measures, this doesn’t necessarily indicate a bubble. Instead, we think investors are betting on the willingness and ability of central banks to prevent the dramatic crashes of the past through quantitative easing and other extraordinary measures, as they did in March of this year. This logic can be taken too far—the famous ‘Greenspan put’ didn’t prevent the dot-com bubble from bursting in 2000, and the Chinese government tried everything in its power to prevent a crash in 2015, with little success. But since we don’t see the large-scale momentum trading of those eras, we don’t think that we are in the middle of a bubble. William Quinn is a lecturer in finance at Queen’s University Belfast, where he conducts research on market manipulation, stock markets and, above all, bubbles. John D. Turner is a professor of finance and financial history at Queen’s University Belfast. He is a fellow of the Academy of Social Sciences and an editor of The Economic History Review. His book “Banking in Crisis” (2014) won the Wadsworth Prize in 2015."}]}