{"article": [{"url": "https://www.marketwatch.com/story/everything-you-need-to-know-about-plug-in-hybrids-2020-08-12", "published": 1597209140.0, "headline": "Everything you need to know about plug-in hybrids", "body": "When you buy a hybrid vehicle, there are three different kinds from which to choose: a light-electrified hybrid (often called a ‘mild’ hybrid), a standard hybrid, and a plug-in hybrid. All three are equipped with a gasoline-fueled engine, an electric motor, and a battery pack, and each kind is designed to minimize the use of the gasoline engine in order to improve fuel economy. Mild hybrid vehicles use the electric motor to assist with initial acceleration so that the gas engine doesn’t need to work as hard to get the vehicle moving, or they can serve as onboard power sources for electrical components and vehicle systems that otherwise would require the engine to idle when the vehicle is stopped in traffic or at traffic lights (i.e., the radio or climate control system). Standard hybrid vehicles have more powerful electric motors and larger battery packs, making it possible to equip a vehicle with a smaller and more efficient gasoline engine, and to operate at lower speeds purely on electricity from the battery. The battery automatically recharges during driving thanks to a regenerative braking system and, in some models, a generator integrated with the mechanical components. Plug-in hybrids feature extra-large battery packs so that the vehicle can be driven longer distances and at freeway speeds solely on electricity. When the battery is depleted, the gasoline engine turns on to continue powering the vehicle, which then behaves like a standard hybrid car. To recharge the battery, you plug the car into a standard 120-volt wall socket at your house, or a Level 2 home charging station, or a more powerful public charging station. The great thing about plug-in hybrids is that they’ll work just fine even if you never plug them in. The only reason to plug in is to enjoy emissions-free electric driving. With that said, if you’re never going to plug in, you should just get a standard hybrid vehicle. That’s because plug-in models are typically more expensive, and the battery packs are so large that they reduce passenger room, trunk space, or both. And if you live and work in places where charging the battery is difficult or impossible, it makes no sense to own a car like this.A larger battery gives a plug-in hybrid extra driving range Plug-in hybrid vehicles work like a regular hybrid vehicle, except they can travel farther and faster using nothing but electricity stored in the larger and more powerful battery pack, like this Subaru Crosstrek. Subaru A plug-in hybrid vehicle works just like a standard hybrid vehicle, except that it can travel farther distances at higher speeds using nothing but electricity. With some models, that distance is no more than 10 or 15 miles. With others, specifically the Chevrolet Volt, electric-only range can rise to more than 50 miles. It all depends on the design and engineering of the vehicle. A larger and more powerful battery pack – and sometimes a stronger electric motor – makes the higher travel speeds and distances possible. Most plug-in hybrid vehicles can travel between 20 and 30 miles before the gasoline engine is required, and that means many people can easily conduct much of their average daily driving without using a drop of gasoline. Check out: A first look at Toyota’s new RAV4 plug-in hybrid Better yet, when the battery can’t power the car by itself, a gasoline engine takes over. In that way, a plug-in hybrid represents the best of both worlds: you get an electric car for part of the time, and you get a gasoline car that you can drive across the country, right now, without ever plugging it in and waiting for the battery to charge.Different ways to plug in and charge a plug-in hybrid vehicle All plug-in hybrid vehicles come standard with a Level 1 charging cord that you can use with a standard household electrical outlet. For faster charging, you’ll want to use a Level 2 or Level 3 charger. The nice thing about plug-in hybrids is that they easily charge overnight using a typical 120-volt wall socket. Subaru Plug-in hybrid vehicles come with two different exterior panels that serve different purposes. One is a traditional fuel door that you open in order to get gasoline at a traditional gas station. The other is a charging port cover that reveals the connector or connectors that you will use to recharge the car. Also see: Ford’s new Escape PHEV gets an eye-popping 100 MPGe Every plug-in hybrid comes with a charging cord that the owner can use to charge the car’s battery using a traditional 120-volt household outlet. This type of outlet is known as a Level 1 charging connection. Level 2 chargers include 240-volt home charging stations and public charging stations that are not DC Fast Charger stations. All plug-in hybrid vehicles are compatible with these stations, which use a J1772 connector, the standard for Level 2 charging compatibility. If you want to use a Level 3 charging station, also known as a DC Fast Charger, your car will need to have an SAE Combo (CCS) connector or a CHAdeMO connector. Generally speaking, according to EVgo, a company that operates charging stations across the U.S., Asian-brand vehicles have CHAdeMO connectors and American- and European-brand vehicles have SAE Combo connectors. If you buy a plug-in hybrid vehicle and plan to use Level 3 charging stations, you will need to know: What kind of a connector your car has (SAE Combo, or CHAdeMO, or both). What kind of a connector the charging station is designed for. Obviously, the goal is to match your car with the right charging station. Companies like EVgo, ChargePoint, and other charging station operators offer smartphone apps that can help you find the right station for your car’s connector.Plug-in hybrids usually require compromise in terms of cargo space The Chrysler Pacifica Hybrid might be the best plug-in hybrid vehicle you can buy because it provides 32 miles of electric driving range combined with seating for up to seven people and lots of room in the trunk for your junk. Chrysler Commonly, the unfortunate trade-offs with a plug-in hybrid vehicle include reduced passenger and cargo space. See: These are your best bets for used hybrids under $10k While the Chevrolet Volt supplies more than 50 miles of electric driving range, it only seats four people in a rather cramped cabin (technically, you can put five people into this car, but I don’t recommend it). The Volt’s trunk measures just 10.6 cubic feet. Several midsize sedans are available in both hybrid and plug-in hybrid format, including the Ford F, -1.36% Fusion, Hyundai HYMTF, -0.02% Sonata, and Kia Optima. In each case, trunk space shrinks. The Ford Fusion Energi plug-in can hold no more than 8.2 cu.-ft. of cargo, down from 12 cu.-ft. in the Fusion Hybrid. The Hyundai Sonata Plug-in shrinks the trunk from 13.4 cu.-ft. in the Sonata Hybrid to 9.9 cu.-ft. The Kia Optima Plug-in, which shares its platform and drivetrain with the Hyundai, also offers just 9.9 cu.-ft. of cargo space compared with 13.4 cu.-ft. in the Optima Hybrid. As electric motor and battery packaging improve, however, such disparities will diminish. Or, you could just get yourself a new Chrysler Pacifica Hybrid, which has a plug-in hybrid drivetrain good for 32 miles of electric driving, and 520 miles of total driving range, according to the manufacturer. Plus, because it’s a minivan, the Pacifica Hybrid provides seating for up to seven people and can hold 32.3 cu.-ft. of cargo at the same time. Fold the third-row seat down and this clean, green, people-moving machine can carry 87.5 cu.-ft. of cargo. Who says you can’t have your cake and eat it, too? Also see: These 3 EVs are the lowest cost to own over 5 years This story originally ran on Autotrader.com."}]}