{"article": [{"url": "https://www.marketwatch.com/story/5-ways-things-are-better-for-investors-now-11592425906", "published": 1593597140.0, "headline": "Why investors who are buying fewer individual stocks are getting better returns", "body": "Many of my articles seem to involve warnings about how “the system” is designed to take advantage of us as investors and take away more of our hard-earned money. Today I’ve got the opportunity to relay a quite different point of view. While we should not relax our guard for a moment, as many of the individuals and institutions that make up Wall Street still want to reach deep into our pockets, I see several favorable trends for investors. Here are five: 1. We get to keep more of the gains we make in mutual funds and ETFs. We’re talking about billions of additional dollars that collectively belong to us instead of Wall Street. The reason: Fund expenses have come down dramatically in the past 20 years. According to a research paper published this month by Morningstar, fund expenses last year were on average only 0.45% in 2019 – compared with 0.87% in 1999. That meant investors like us saved an estimated $5.8 billion – money that can continue to grow for us, not Wall Street. And that was just in a single year. Morningstar cited three main reasons for this: Investors are flocking to funds with lower expenses; Asset managers are cutting their fees in order to remain competitive; More investors are paying for advice in the form of fees instead of commissions. Here’s the evidence that investors are wising up: The cheapest 20% of funds (those with the lowest expense ratios) last year attracted $581 billion in net new money, with 70% of it going into index funds. The other 80% of funds had net outflows of $224 billion. One other interesting finding: Vanguard funds continue to have the lowest asset-weighted average expense ratio – just 0.09% last year. A couple more statistics I find interesting: Average fees of actively managed funds dropped by 10%, from 1.2% in 2015 to 1.08% in 2019. For index funds, the drop was 15.3%, from 0.72% in 2015 to 0.61% last year. Morningstar cited a “fee war” among index fund managers that culminated in the 2018 introduction by Fidelity Investments of “zero-fee” index funds that charge no expenses at all. All this is vitally important to investors. As the Morningstar report says, fund fees “are a reliable predictor of future returns.” Here’s what that means: The portfolios in our funds earn whatever they earn. Say it’s 10% in a year. From those earnings, fund managers take out some of that to cover expenses. The less they take out, the more we get to keep. If fund expenses are 1%, we get to keep only 90% of the portfolio’s gains. If expenses are 0.2%, we keep 98% of our gains. That is the surest formula that I know for getting better returns. Wall Street does not like this trend, because it threatens cushy profits, high pay and lavish perks. Too bad. 2. More investors are getting more predictable (and most likely better) returns by using index funds instead of actively managed ones. Data in the Morningstar report bears this out, citing “steady flows into the lowest-cost funds,” which of course means index funds. “The mass migration to lower-cost funds and share classes has been a key driver of falling costs,” Morningstar reported. “Expensive active funds have been the epicenter of outflows. During each of the past six years, the most expensive 80% of active funds has accounted for all of the net outflows across all funds.” Last year, roughly 93% of new money “went into the cheapest of the cheap … the least costly 10% of all funds,” the report said. The first favorable trend for investors results from a change in the industry. The second, as we just saw, results from a change in investor behavior. 3. Here’s another good trend, and it follows from No. 2: Investors are increasingly focused on asset classes instead of individual stocks. Asset classes are much less risky than individual stocks, without sacrificing anything in terms of expected return. Briefly: The experts teach that the expected return of one stock is the same as the expected return of the entire asset class of which that stock is a member. Yet the risk of owning just one stock is huge: It could disappear (relatively unlikely) or go into massive freefall for any of a variety of reasons. There’s very little risk of that happening with an asset class made up of hundreds of stocks. 4. So far this century, we’ve seen a variety of resources (if that’s the right word) emerge with the intention of helping individual investors. The grassroots Financial Independence Retire Early (FIRE) movement has sprouted local chapters throughout North America, in every U.S. state plus eight in Canada, devoted to helping each other find ways to cut current expenses, boost savings, and invest well. A nonprofit organization in California that I recently wrote about, Next Gen Personal Finance, wants to persuade every high school in the United States to require a semester-long class in personal finance as a graduation requirement. They also have a lot of excellent educational resources for teachers and parents available free online. More financial advisers are becoming fiduciaries by voluntarily assuming legal responsibility for recommending only the products and services that are demonstrably in the best interests of their clients. (The Morningstar report alludes to this, saying investors are increasingly choosing such advisors instead of traditional brokers who have no such legal obligation.) More authors and educators are preaching the value of lower expenses, index funds, and fiduciary advisory arrangements. 5. Increasingly popular index funds continue to outperform the vast majority of the actively managed funds in their asset classes. In the 15 calendar years ended last Dec. 31, the S&P 500 Index outperformed 90.5% of all actively managed U.S. large-cap funds, according to analysts at S&P. Among 13 specific asset classes, the percent of funds that underperformed their benchmark indexes were similar, ranging from a low of 81.4% for large-cap value funds to a high of 95.2% for mid-cap blend funds. Other statistics from this report are interesting. Mutual funds are allowed to advertise that (when it’s accurate) their performance is above average compared to their peers. But “better than average” isn’t necessarily impressive when nine of every 10 funds fails to even meet the SPX, +0.87%. Over the past 15 calendar years, the top 25% of actively managed U.S. large-cap blend funds returned 8.9% or more. But one of every four such funds returned less than 7.3%, according to S&P’s statistics. All these points add up to one happy conclusion: Investors like us get to keep more of the returns from the equities in our mutual funds. Want to know more? Check out my latest podcast, “How confident can we be in past performance?” Richard Buck contributed to this article."}]}