{"article": [{"url": "https://www.marketwatch.com/story/trump-needs-to-go-public-with-threats-to-election-security-top-democrats-say-2020-07-24", "published": 1595869340.0, "headline": "Trump needs to go public with threats to election security, top Democrats say", "body": "WASHINGTON (AP) — Democratic leaders in Congress are dialing up pressure on President Donald Trump’s administration over foreign election interference, saying it’s time for officials to make a “concrete and specific statement” to inform voters ahead of the 2020 contest. The call comes as the nation’s intelligence agencies, congressional intelligence committees and Democratic presidential candidate Joe Biden have all warned of renewed interference this year. Trump himself has been loath to discuss the subject or acknowledge that Russia tried to sow discord in the 2016 contest by hacking Democratic accounts and pushing out inflammatory content on social media. See:Biden warns Russia and other countries that interference in 2020 election won’t go unpunished The Democrats’ letter Friday was in response to a statement earlier in the day by William Evanina, the government’s chief counterintelligence official. The statement said adversaries such as China, Russia and Iran are seeking to compromise U.S. private communications and infrastructure in campaigns. It also warned of disinformation being pushed out on social media. House Speaker Nancy Pelosi arrives for a Friday news conference on unemployment benefits. Associated Press “We sent that letter,” said House Speaker Nancy Pelosi in an interview with MSNBC late Monday, “because we believe that our electoral system is in jeopardy.” Without giving specifics, the Democrats said Evanina’s statement “does not go nearly far enough in arming the American people with the knowledge they need about how foreign powers are seeking to influence our political process” and falsely paints the three countries as equivalent in their efforts. The statement was from Speaker Pelosi, Senate Democratic Leader Chuck Schumer, House Intelligence Committee Chairman Adam Schiff, D-Calif., and Virginia Sen. Mark Warner, the top Democrat on the Senate Intelligence panel. “We can trust the American people with knowing what to do with the information they receive and making those decisions for themselves,” the Democrats said. “But they cannot do so if they are kept in the dark about what our adversaries are doing, and how they are doing it. When it comes to American elections, Americans must decide.” The Democrats specifically criticized the line in Evanina’s statement that said Russia has a persistent objective to weaken the U.S. and “denigrate what it sees as an anti-Russia ‘establishment’ in America.” They said that line “omits much on a subject of immense importance” and is “so generic as to be almost meaningless.” In his statement, Evanina said it would be “extraordinarily difficult” for the adversaries to broadly disrupt the fall election or change vote tallies, but that “we continue to monitor malicious cyber actors trying to gain access to U.S. state and federal networks, including those responsible for managing elections.” Specifically, Evanina said, China is “expanding its influence efforts to shape the policy environment in the United States, pressure political figures it views as opposed to China’s interests, and counter criticism of China.” Iran is also spreading disinformation to undermine U.S. institutions, he said. It is unclear what information the Democrats want to be made public. On Monday, the same four Democrats wrote in a letter to FBI Director Christopher Wray that they are concerned that Congress appears to be the target of a “concerted foreign interference campaign” to influence the 2020 presidential election. They asked Wray for an all-members, classified briefing on the matter before the August recess. Democrats, including members of the Senate intelligence panel, have voiced concerns that an ongoing Republican probe into Biden’s son, Hunter Biden, and his work in Ukraine would amplify Russian disinformation. But they did not specifically mention the investigation, which is being led by Senate Homeland Security and Governmental Affairs Chairman Ron Johnson, a Wisconsin Republican. In her Monday MSNBC interview, Pelosi lamented Trump’s having spoken with Putin some “seven times since March” without a single mention, she said, of Kremlin election interference. The warnings from all sides come after criticism of the way President Barack Obama’s administration handled the 2016 interference as it was happening. A bipartisan congressional report released by the Senate Intelligence Committee earlier this year said the Obama administration was ill-prepared to handle and failed to respond effectively as officials feared getting caught up in a heavily politicized environment and undermining the election. The Obama White House, and fellow Democrats, was reported to be wary of risking an appearance of politicizing intelligence in a way that could be perceived as assisting the presidential campaign of Hillary Clinton. An effort to put out a bipartisan statement on the matter was reportedly blocked by Senate Majority Leader Mitch McConnell, who a year ago blocked consideration in the Republican-led chamber of a House-passed bill to bolster election security, calling it unnecessary. More recently, Senate Republicans were reported to have stripped from the National Defense Authorization Act, as a condition of the legislation’s passage, a provision requiring presidential campaigns to report any attempts by foreign entities to involve themselves in a U.S. election. MarketWatch contributed."}]}