{"article": [{"url": "https://www.marketwatch.com/story/heres-why-netflix-stock-now-below-500-is-going-to-1000-2020-07-27", "published": 1596285740.0, "headline": "Here's why Netflix stock, now below $500, is going to $1,000", "body": "The so-called FAANG stocks have done so well for so long that it seems almost unimaginable that there could ever be a contrarian \"buying opportunity\" in one of them. Yet that's the case with Netflix NFLX, +1.43%  now. Talk about a surprising plot twist. The stock price has fallen recently for all the wrong reasons. Chief among them, management guided for a \"soft\" second half of the year. Investors hate weak guidance. They're programmed to think it's a sign of a long stretch of bad news to come. But Netflix subscriber growth will cool off because the COVID-19 stay-at-home lifestyle pulled so much growth forward to the first half. This a good problem to have. And the long-term story is still intact. So the stock will recover, and outperform. I'm not the only one who thinks so. \"While the soft third-quarter outlook may put the stock in the penalty box near-term, there is no change to our positive long-term thesis,\" says Jefferies analyst Alex Giaimo. \"We view Netflix as a consistent high double-digit growth story with sizable margin expansion over time.\" Before we get to the long-term growth story, let's look at that \"problem\" of weak guidance.So slow, but so what? Netflix guided for just 2.5 million net subscriber adds in the third quarter, way below Wall Street estimates of 5 million, and less than half the 6.8 million net adds in the same quarter in 2019. Growth investors never like a 63% contraction in a key business metric. But forgive Netflix the \"slowdown.\" It's happening because the company posted 110% subscriber growth in the first half of this year. It added a massive 25.8 million subscribers (net) compared to 12.3 million in the first half of 2019. That surpassed 20%-22% growth in the three quarters leading up to 2020. Netflix added nearly as many subscribers so far this year, as it did in all of 2019. I'll take that. Besides, \"cash in the door now is better than cash in the door three months from now,\" says Giaimo at Jefferies. One \"conspiracy theory\" going around is Netflix deliberately guided low to create an easy win for newly appointed co-CEO Ted Sarandos in the third quarter. \"They set the bar low for the third quarter, and if they beat those numbers, the stock is going to go up,\" said one mutual fund analyst who follows the company.Netflix is a great international growth story There are about 800 million broadband households, and over two billion smartphones in the world (outside of China), says RBC Capital Markets analyst Mark Mahaney. If Netflix can match the 57% penetration rate in the U.S., that means it could get nearly 500 million subscribers. For context, Netflix currently has around 193 million subscribers in the U.S. And it only has about 10% market penetration in most major markets abroad, says Mahaney. There's little reason to doubt the company can hit U.S.-level penetration abroad, because RBC Capital Markets surveys tell us foreign customers like Netflix even more than U.S. customers do. That subscriber base could produce $50 in earnings per share, which could translate into a $1,000 stock in five years, says Mahaney. He just upped his 12-month price target to $610 from $500. Meanwhile, international growth could boost profit margins because foreign markets are generally less competitive and local production costs can be dramatically lower. Netflix has about 130 new non-English original programs in 18 languages slated for 2020 and beyond, three times that of Amazon.com. The wild card: China lets global media inside. Netflix is good at what it does and it's getting better Netflix obviously has a knack for producing content people like at a reasonable cost, from shows like \"Money Heist\" to \"Stranger Things,\" \"Orange is the New Black\" and \"Tiger King\" as well as reality programming like \"Too Hot to Handle\" and \"Floor is Lava.\" Its first-half mega growth means this will continue, since it has more money to produce more hits. This creates the kind of growth feedback loop that can really help investors. Netflix has more than three times as many subscribers as its closest competitor. More money means more content, which means more subscribers, which begets more revenue to invest in more content. Part of the reason Netflix content is so good is that it's a big data and tech company as much as a content provider. It has subscriber tracking down to a science, microanalyzing viewership to figure out what people like, so executives can replicate the dynamic. Another reason Netflix is so good is that its popularity reaches beyond consumers. \"The real story with Netflix is that many producers always want Netflix to be their first choice of distribution,\" says Jeff Sica, CEO of Circle Squared Alternative Investments which advises content producers. \"This is why they will continue to have the advantage in content.\" Despite COVID-19 related production slowdowns, Netflix still expects to launch more original programming in 2021 than it will this year. The co-CEO \"problem\" is a false narrative Netflix doubters made a big deal about the fact that Sarandos was just appointed co-CEO. They latched on to the idea that enterprises with two leaders underperform because it's never clear which agenda subordinates should follow. Seriously? What about Charlie Munger and Warren Buffett at Berkshire Hathaway BRK.A, +0.06%  BRK.B, +0.24%, one of the most successful insurance and investment companies in history? Or Larry Page and Sergey Brin at Alphabet GOOG, +1.97%  GOOGL, +1.82%, one of the most successful tech companies? Or Steve Ellis and Monty Moran at Chipotle CMG, +0.01%,  a company that crushed it in fast food? In the realm of content production, I could also cite John Lennon and Paul McCartney, and Mick Jagger and Keith Richards. The duos co-lead two of the most successful and productive bands in history, the Beatles and the Rolling Stones. Yes, two heads are often better than one. The rock stars are relevant even if they weren't technically CEOs, because they are in content, like Netflix. Founder Reed Hastings says he will be for at least a decade. \"And as co-CEO, it's two of us full time. It's not like a part-time deal.\" He and Sarandos have effectively led the company together for years, and this change is just a formal acknowledgment of that. Sarandos will remain chief content officer, and Hastings will continue to focus on strategy. \"In terms of the day-to-day running of Netflix, I do not expect much to change,\" says Hastings. \"Ted's got some increased external stature, and he can put bigger deals together for us, and that's really cool. But think of it as much more consistent with the past than different.\" \"The chances that Reed's going to relax a little more are very low,\" says Sarandos. Several industry trends remain favorable Cord-cutting continues, as subscribers continue to flee cable services like Comcast CMCSA, -0.99%, AT&T's T, -1.01% Warner, Cable One CABO, +0.31%  and Altice ATUS, -0.40%. Nearly half (45%) of people in a recent RBC Capital Markets survey said they intend to cut the cord either this year or in the next two years. This will help streaming services and particularly Netflix because it's the leader, says Mahaney at RBC. Some competitors like NBCUniversal's streaming service Peacock aren't getting on devices like Roku. Netflix has top placement on the landing page there. Netflix is 'politician free' So far, at least, Netflix has dodged the regulatory scrutiny faced by other FAANGs like Alphabet, Facebook FB, +0.26%  and Apple AAPL, +1.74%. The bottom line: Netflix clearly isn't the buy it was when I first introduced it in my stock newsletter Brush Up on Stocks in December 2010 at $27.80, now up a 1,665% (a 16-bagger). And it's not the buy it was last summer when I reintroduced it as a new stock in my letter at $289, and suggested it in this column. It's now up 66% since then, compared to 29% gains for the Nasdaq COMP, +1.39% 11% gains for the S&P 500 index SPX, +0.87%  and flat performance for the Dow Jones Industrial Average DJIA, +0.56%. But given the irrationality behind the current Netflix weakness, there's a good chance it will outperform those indexes over the next year, too. At the time of publication, Michael Brush had no positions in any stocks mentioned in this column. Brush has suggested NFLX, BRK.B, GOOGL, CMG, T, FB and AMZN in his stock newsletter Brush Up on Stocks. Brush is a Manhattan-based financial writer who has covered business for the New York Times and The Economist Group, and he attended Columbia Business School. Follow him on Twitter @mbrushstocks."}]}