{"article": [{"url": "https://www.marketwatch.com/story/oracle-revenue-hit-by-pandemic-stock-drops-in-after-hours-trading-2020-06-16", "published": 1592329880.0, "headline": "Oracle revenue hurt by pandemic, return to growth a coin-flip for this quarter", "body": "Oracle Corp. shares declined in the extended session Tuesday after the software company’s revenue faced headwinds amid the COVID-19 pandemic and forecast a possible shift back to sales growth. “We are now at a point where our growing businesses are now larger than our declining businesses and this favorable shift will inevitably drive revenue acceleration going forward,” said Chief Executive Safra Catz on a conference call with analysts Tuesday. But that return to growth may be a toss-up when it come to the current quarter. Catz she expects adjusted fiscal first-quarter earnings of 84 cents to 88 cents a share on revenue with revenue either increasing or declining by 1%, meaning $9.13 billion to $9.31 billion. Analysts surveyed by FactSet expect earnings of 85 cents a share on revenue of $9.05 billion. Oracle ORCL, +0.42% on Tuesday reported fiscal fourth-quarter net income of $3.11 billion, or 99 cents a share, compared with $1.07 a share in the year-ago period. Adjusted earnings were $1.20 a share, compared with $1.16 a share in the year-ago period. Revenue declined to $10.44 billion from $11.14 billion in the year-ago quarter. Analysts surveyed by FactSet had forecast earnings of $1.15 a share on revenue of $10.61 billion.Oracle projected adjusted earnings of $1.20 to $1.28 a share on revenue of $10.92 billion to $11.36 billion back in March. In a statement, Catz said Oracle’s “overall business did remarkably well considering the pandemic, but our results would have been even better except for customers in the hardest-hit industries that we serve, such as hospitality, retail and transportation, postponing some of their purchases.” Taking a different view was Jefferies analyst Brent Thill, who has a hold rating and a $55 price target on Oraclle. In a note following the earnings release, Thill said he viewed Oracle’s revenue as “underwhelming in the seasonally strong” fourth quarter. Thill said he was looking at Oracle’s results “against a backdrop of a highly supportive software spending environment as reflective of share losses” to competitors like Microsoft Corp. MSFT, +2.48% and Amazon.com Inc. AMZN, +3.01% . Of the 31 analysts who cover Oracle, 10 have buy or overweight ratings, 20 have hold ratings, and one has a sell rating, with an average price target of $52.54, according to FactSet data. Oracle shares fell more than 4% after hours, after gaining 2.5% in the regular session to close at $54.59. Oracle shares are up 3% for the year, compared with a 10% gain in the Nasdaq Composite Index COMP, +1.39% and a 3% decline in the S&P 500 index SPX, +0.87%."}]}