{"article": [{"url": "https://www.marketwatch.com/story/new-york-city-schools-delay-in-person-instruction-again-2020-09-17", "published": 1600361360.0, "headline": "New York City schools delay in-person instruction â\u0080\u0094 again", "body": "New York City, the only major school district in the U.S. attempting to reopen school buildings, has delayed in-person learning for the second time, Mayor Bill de Blasio announced in a news conference on Thursday.Â All students whose parents opted to send their children back to school on a hybrid basis were supposed to return on Monday, but they now face a staggered return. Students in schools serving kindergarten through fifth and eighth grades are now expected to go back on Sept. 29, with middle and high schools scheduled to open their doors on Oct. 1. Special-education students, as well as those in prekindergarten and below, will return Monday as originally planned.Â The decision came under mounting pressure from the cityâ\u0080\u0099s teachersâ\u0080\u0099 and administratorsâ\u0080\u0099 unions, who say schools are not yet ready to welcome students. The delay marks the latest blow for roughly 600,000 students expecting to return to classrooms and whose families have been getting mixed messages for weeks about the systemâ\u0080\u0099s ability to pull-off in-person learning safely. â\u0080\u009cWe would much rather be talking about opening school on Monday to all of our studentsâ\u0080¦ However, it wouldnâ\u0080\u0099t be safe,â\u0080\u009d said Mark Cannizzaro, the president of the Council of School Supervisors and Administrators on Thursday. â\u0080\u009cThis is something weâ\u0080\u0099ve been speaking about over and over again.â\u0080\u009d Indeed, the president of the United Federation of Teachers, Michael Mulgrew, sounded the alarm Monday, when he announced there was â\u0080\u009ca lot of work to doâ\u0080\u009d in a press briefing. He cast doubt on the schoolsâ\u0080\u0099 ability to open, noting staffing and safety as top concerns.Â Coronavirus update: Global cases near 30 million; Trump contradicts CDC head on vaccine timetable and again derides face masks To address staffing issues, the mayor also announced Thursday that the city will be hiring 2,500 educators in addition to the 2,000 new teachers he promised on Monday for a total of 4,500. Substitute teachers and education graduate students form the City University of New York will be tapped to fill the jobs. Remote learning has begun, and students that were supposed to return on Monday will continue to learn at home until buildings reopen. Students were originally set to go back on Sept. 10, but the city issued the first delay at the beginning of the month.Â Be sure to read: Federal law now gives some parents paid time off to help their kids with remote learning Many parents have been frustrated with the delays as they continue to try to manage both work and child care.Â â\u0080\u009cParents scrambled to find ways to make this plan work for them, and once again with just days before the start of school the mayor and chancellor leave families in the lurch,â\u0080\u009d the NYC Coalition for Educational Justice, a parent-led organization working for educational equity in the public schools, tweeted after the announcement. â\u0080\u009cWhat are working families supposed to do with yet another delay in school reopening?â\u0080\u009d Related: As schools reopen, scientists say some children could spread COVID-19 even if they already have the antibodies The mayor maintained that parents were â\u0080\u009cpragmaticâ\u0080\u009d and understood the importance of taking extra time â\u0080\u009cto get things right for in-person learning...to serve our children and families as best as possible while protecting everyone in the school community.â\u0080\u009d"}]}