{"article": [{"url": "https://www.marketwatch.com/story/republican-leaders-with-one-notable-exception-urge-wearing-face-masks-2020-06-30", "published": 1593544220.0, "headline": "Republican leaders - with one notable exception - urge wearing face masks", "body": "WASHINGTON - In Republican circles - with the notable exception of the man who leads the party - the debate about masks is over: It's time to put one on. As a surge of infections hammers the South and West, GOP officials are pushing back against the notion that masks are about politics, as President Donald Trump suggests, and telling Americans they can help save lives. Sen. Lamar Alexander, a Tennessee Republican, on Tuesday bluntly called on Trump to start wearing a mask, at least some of the time, to set a good example. \"Unfortunately, this simple, lifesaving practice has become part of a political debate that says: If you're for Trump, you don't wear a mask. If you're against Trump, you do,\" Alexander said. It's a rare break for Republicans from Trump, who earlier this month told the Wall Street Journal that some people wear masks simply to show that they disapprove of him. And the Republican nudges for the public - and the president - to embrace mask-wearing are coming from all corners of Trump's party and even from friendly conservative media. Both Vice President Mike Pence and Senate Majority Leader Mitch McConnell in recent days have urged Americans to wear one when they are unable to maintain social distance. Sen. Mitt Romney, a Utah Republican, told reporters it would be \"very helpful\" for Trump to encourage mask usage. \"Put on a mask - it's not complicated,\" McConnell, R-Ky., urged Americans during his weekly news conference Tuesday. Last week, Republican Rep. Liz Cheney of Wyoming tweeted a photo of her father, former Vice President Dick Cheney, wearing a disposable mask and a cowboy hat. She included the message: \"Dick Cheney says WEAR A MASK #realmenwearmasks,\" a hashtag that echoed words spoken earlier by the Democratic House Speaker Nancy Pelosi. Steve Doocy, co-host of a Trump friendly morning show \"Fox & Friends,\" said during an interview with House Minority Leader Kevin McCarthy that he doesn't \"see any downside in the president being seen more often wearing it.\" McCarthy, R-Calif., responded that, for the upcoming holiday, \"we could all show our patriotism with a red, white and blue mask.\" Jacksonville, the Florida city where Trump is scheduled to accept his renomination as Republicans' presidential candidate in August, announced a mask requirement for indoor public spaces this week. The president's eldest son said the new requirements were no big deal. \"You know, I don't think that it's too complicated to wear a mask or wash your hands and follow basic hygiene protocols,\" Donald Trump Jr. told Fox Business on Tuesday. Trump aides have defended the president's refusal to wear a mask by noting that he is regularly tested for the coronavirus, as are his aides. Those outside the administration - including White House visitors and members of the media who are in close proximity to him and Pence - are also tested. White House press secretary Kayleigh McEnany didn't directly address Republican calls for Trump to wear a mask in public more often, but noted that the president has said in the past he has no problem wearing one when necessary. But even with safeguards, the virus has found its way into the White House. A top aide to Pence, as well as a military valet to Trump, in May tested positive for the virus. Still, mask usage remains rare in the West Wing, said Rep. Brad Sherman, a California Democrat who attended an intelligence briefing at the White House on Tuesday with senior members of the president's staff. At the briefing, which he said included about eight White House staffers, only national security adviser Robert O'Brien wore a mask, Sherman said. He added that no one in the secure briefing room was able to maintain 6 feet of social distancing, as recommended by the Centers for Disease Control and Prevention. \"I learned something major, and that is the White House is a mask-free zone,\" Sherman told The Associated Press. \"The president is consistent. He's fine with people not wearing masks.\" Polls show how the partisan divide on masks has seeped into public opinion. The vast majority of Democrats think people in their community should wear a mask when they are near other people in public places at least most of the time, including 63% who say they should always, according to a Pew Research Center poll published in early June. Among Republicans, 29% say masks should be worn always, and 23% say they should be worn most of the time. Another 23% say masks should rarely or never be worn. Trump has been caught on camera once wearing a mask. But Pence and members of the White House coronavirus task force frequently appear in public wearing masks. \"If you want the return of college football this year, wear a face covering. If you want a chance at prom next spring, wear a face covering,\" Surgeon General Jerome Adams urged Americans. Over the course of the crisis, the government has sent mixed messages on masks. As the first COVID-19 cases were identified on U.S. soil, top public health officials insisted masks should be reserved for front-line workers. In early April, the CDC issued a recommendation that people wear cloth face coverings in public settings where other social distancing measures were difficult to maintain. But Trump immediately undercut the CDC guidance by flatly stating that he wouldn't be following it, suggesting it would be unseemly for the commander in chief to wear one as he meets with heads of states. Other world leaders, including Canada's Justin Trudeau and France's Emmanuel Macron, have worn masks in public and urged their citizens to do the same when they can't maintain social distance Lawrence Gostin, a public health expert at Georgetown University, says he worries Republican calls for wearing masks \"might be too late.\" \"The public has received such mixed messages from the administration,\" Gostin said. \"I fear we may be stuck with coronavirus until it burns through the American population and leaves hundreds of thousands dead.\""}]}