{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-and-dow-futures-fall-as-goldman-slashes-gdp-view-citing-lack-of-stimulus-11600933727", "published": 1600938080.0, "headline": "European stocks and Dow futures fall as Goldman slashes GDP view, citing lack of stimulus", "body": "A woman rides a bicycle past a red light in Paris, France, on September 23, 2020. christophe archambault/Agence France-Presse/Getty Images European stocks dropped and U.S. stock futures weakened on Thursday, as investors have largely given up on the idea that the U.S. Congress will provide new stimulus, while worrying about a recent rise in COVID-19 cases. After a 0.6% advance on Wednesday, the Stoxx Europe 600 SXXP, +0.55% fell 0.7%. The aviation sector had another rough day, with Rolls-Royce RR, +14.25%, International Airlines Group IAG, -3.72% and Airbus AIR, -0.20% retreating. The German DAX DAX, +0.06%, French CAC 40 PX1, +0.71% and U.K. FTSE 100 UKX, +0.64% each declined. U.S. stocks had a rough Wednesday, with the Dow Jones Industrial Average DJIA, +0.56% retreating 525 points. Stock futures YM00, +0.82% NQ00, +1.63% were lower on Thursday as well. U.S. jobless claims rose by 4,000, according to the latest data from the Labor Department. Economists at Goldman Sachs cut their U.S. growth forecast for the fourth quarter in half, to 3% from 6%. “We think it is now clear that Congress will not attach additional fiscal stimulus to the continuing resolution. This implies that after a final round of extra unemployment benefits that is currently being disbursed, any further fiscal support will likely have to wait until 2021,” the economists said. The continuing resolution is a reference to the extension of funding beyond the September-ending fiscal year, which the U.S. House has already passed. Germany’s Ifo business climate index rose a fifth month, according to data released on Thursday that was very close to economist expectations, while U.K. Chancellor Rishi Sunak rolled out a new program to replace the expiring job furlough program, which will pay part of the cost for employees working at least one-third their previous hours. Ajay Rajadhyaksha, a New York-based strategist for U.K. bank Barclays, told clients that “the valuation gap between growth and value equities is now at such an extreme that value stocks offer positive asymmetry on the next leg of the recovery, which should help European and other non-U.S. indices.” Bucking the broader trend, some hard-hit financials rose. Banco Bilbao Vizcaya Argentaria BBVA, -1.84%, UniCredit UCG, -1.68% and NatWest Group NWG, -0.35% each advanced. Of stocks on the move, Suez SEV, -0.62% shares fell 4% after its board of directors announced moves that seek to prevent a sale of its water subsidiary Suez Eau France, as part of Suez’s broader resistance to a takeover from Veolia Environnement VIE, -0.92%. Smiths Group SMIN, +1.08% shares dropped 8%. The U.K. engineering group reinstated its dividend as its pretax profit from continuing operations slumped due to the planned separation of Smiths Medical as well as a new write-down. Analysts at Barclays said even though the firm didn’t provide guidance, its own estimates of a 5% organic sales decline and steady margins of 15% seem “achievable” after the results. Pets At Home PETS, -1.38% shares rose 24%, as the U.K. pet supplies retailer said underlying pretax profits would be ahead of the £73 million consensus. It said it had double-digit like-for-like sales growth through the eight weeks to Sept. 10."}]}