{"article": [{"url": "https://www.marketwatch.com/story/trump-has-taken-both-sides-in-the-states-rights-debate-2020-07-22", "published": 1595429600.0, "headline": "Trump is currently taking both sides in the statesâ\u0080\u0099-rights debate", "body": "WASHINGTON (AP) â\u0080\u0094 When it comes to statesâ\u0080\u0099 rights, President Donald Trump is all over the map. To battle the coronavirus, heâ\u0080\u0099s told states theyâ\u0080\u0099re largely on their own. But when it comes to stamping out protests in cities led by Democrats, Trump is sending in federal troops and agents â\u0080\u0094 even when local leaders are begging him to butt out. Itâ\u0080\u0099s a driven-by-expedience approach thatâ\u0080\u0099s been a hallmark of his stormy presidency, one that has little to do with ideology and more to do with reelection efforts. â\u0080\u009cAfter seeing Trump in the White House for three and a half years, anyone expecting to find classical ideological consistency is bound to be mistaken,â\u0080\u009d said Andrew J. Polsky, a political-science professor at Hunter College. â\u0080\u009cAll of this is done for partisan political purposes with an eye toward the election.â\u0080\u009d “ â\u0080\u0098Itâ\u0080\u0099s selective federalism.â\u0080\u0099 ” â\u0080\u0094 Julian Zelizer, Princeton University For months now, as heâ\u0080\u0099s tried to skirt responsibility for the nationâ\u0080\u0099s flawed response to the coronavirus, Trump has put the onus on states, first to acquire protective gear and testing agents and then to scale testing and contact tracing. â\u0080\u009cThe federal government is not supposed to be out there buying vast amounts of items and then shipping. You know, weâ\u0080\u0099re not a shipping clerk,â\u0080\u009d Trump said in March when testing in the U.S. severely lagged behind other countries and governors were pleading for help as they competed against one another on the open market. His son-in-law and adviser, Jared Kushner, even said, â\u0080\u009cThe notion of the federal stockpile is that itâ\u0080\u0099s supposed to be our stockpile. Itâ\u0080\u0099s not supposed to be statesâ\u0080\u0099 stockpiles that they then use.â\u0080\u009d Just a month later, Trump flipped to asserting vast executive authority as he pushed states to reopen their economies fast. â\u0080\u009cWhen somebody is the president of the United States, the authority is total,â\u0080\u009d he declared in April, in an inaccurate interpretation of the Constitution. He quickly reversed course, saying heâ\u0080\u0099d leave reopening plans up to the states, but continued to threaten to intervene if he didnâ\u0080\u0099t like what they were doing. Now, heâ\u0080\u0099s pressuring schools to fully reopen in September, saying heâ\u0080\u0099ll pull funding from school districts that continue to keep kids home. That approach stands in stark contract with Trumpâ\u0080\u0099s view of â\u0080\u009claw and order,â\u0080\u009d the mantle under which heâ\u0080\u0099s decided to run his 2020 race. After National Guard troops were deployed to Washington, D.C., to quell protests near the White House following the police killing of George Floyd, the Department of Homeland Security now has agents patrolling Portland, Ore., to protect federal buildings, despite pleas from the mayor, governor and local activists to leave. And DHS is poised to deploy about 150 Homeland Security Investigations agents to Chicago to bolster local law enforcement, according to an official with direct knowledge of the plans who wasnâ\u0080\u0099t authorized to speak publicly and spoke on condition of anonymity. â\u0080\u009cKeep your troops in your own buildings, or have them leave our city,â\u0080\u009d Portland Mayor Ted Wheeler said Friday. See:Trump and Barr set to expand â\u0080\u0098surgeâ\u0080\u0099 of federal forces to Chicago and other cities Also:Legal experts call Portland force deployment a constitutional â\u0080\u0098red flag,â\u0080\u0099 while Trump eyes federal actions on Chicago streets â\u0080\u009cWe are trying to help Portland, not hurt it,â\u0080\u009d Trump tweeted in response. â\u0080\u009cTheir leadership has, for months, lost control of the anarchists and agitators. They are missing in action. We must protect Federal property, AND OUR PEOPLE.â\u0080\u009d Chad Wolf, the acting DHS secretary, whose agency was created after the Sept. 11 attacks to protect the country from terrorist threats, said Monday on Fox News the agency had every right to protect some 9,000 federal facilities across the country. â\u0080\u009cI donâ\u0080\u0099t need invitations by the state, state mayors or state governors to do our job,â\u0080\u009d Wolf said. â\u0080\u009cWeâ\u0080\u0099re going to do that, whether they like us there or not.â\u0080\u009d Tom Ridge, who under the George W. Bush administration became the countryâ\u0080\u0099s first secretary of homeland security, told radio host Michael Smerconish that the department â\u0080\u009cwas not established to be the presidentâ\u0080\u0099s personal militiaâ\u0080\u009d and that, while he was the Republican governor of Pennsylvania, he would have been â\u0080\u009ca cold day in hellâ\u0080\u009d before he allowed uninvited federal agents into the state. “ â\u0080\u0098He wants to be a law-and-order president. But he is not bringing law and order. This is lawlessness and needs to be stopped.â\u0080\u0099 ” â\u0080\u0094 Jann Carson, Oregon ACLU Jann Carson, interim executive director of the American Civil Liberties Union of Oregon, said federal agents dressed in camouflage, indiscriminately using munitions and abducting people in unmarked vans have escalated tensions and made the situation worse. â\u0080\u009cWhat the federal agents are doing in Portland should concern people everywhere in the United States,â\u0080\u009d she said. â\u0080\u009cWe know that the president is trying to change the narrative [and say] that cities like Portland are in crisis, that heâ\u0080\u0099s got to send in federal agents to bring about law and order, and that couldnâ\u0080\u0099t be further from the truth. â\u0080\u009cHe wants to be a law-and-order president,â\u0080\u009d she said. â\u0080\u009cBut he is not bringing law and order. This is lawlessness and needs to be stopped.â\u0080\u009d Oregonâ\u0080\u0099s two U.S. senators and two of its House members have demanded U.S. Attorney General William Barr and Wolf immediately withdraw â\u0080\u009cthese federal paramilitary forces from our state.â\u0080\u009d And top leaders in the U.S. House said Sunday theyâ\u0080\u0099ve called on federal inspectors general to investigate. Still, Jennifer Selin, an assistant professor of constitutional democracy at the University of Missouri whose work has focused, in part, on the separation of powers, said that, while Trump has been unusually blatant in his efforts, presidents have relied on politicized interpretations of federalism since George Washington and the Whiskey Rebellion over taxes. Selin pointed to the 1950s and 1960s as the country grappled with the extent to which it should be up to states to integrate schools and allocate housing. â\u0080\u009cI think that the short answer is that federalism can be used strategically and politically, which, to be 100% honest, is nothing new,â\u0080\u009d she said. Polsky said that, when it comes to the virus, Trump has attempted â\u0080\u009cto displace responsibility for dealing with the pandemic onto states, onto governors. I donâ\u0080\u0099t think that was driven by ideology. I think that was driven by wanting to keep responsibility as far from him as possible.â\u0080\u009d See:Trump has assigned Homeland Security a new task: defending statues and monuments But when it comes to law enforcement, Polsky sees an attempt to stoke â\u0080\u009cunrest in sites that can then be broadcast on television, at least in the conservative and right-wing mediaâ\u0080\u009d to rouse the Republican base and scare suburban voters into believing a strong approach is needed. â\u0080\u009cItâ\u0080\u0099s selective federalism,â\u0080\u009d added Julian Zelizer, a historian at Princeton University. â\u0080\u009cI think obviously when it comes to closing and how to do reopening, he has been incredibly hands-off [and] hasnâ\u0080\u0099t used his presidential hand in ways that he could have. And then you have protests in the city of Portland, which really shouldnâ\u0080\u0099t be a center of discussion right now, and then you have these troops being sent.â\u0080\u009d â\u0080\u009cObviously with President Trump, thereâ\u0080\u0099s no logic to it,â\u0080\u009d Zelizer said â\u0080\u0094 other than what may serve his political interests. Read on:Oregon sues Trump administration as unrest and clashes continue in Portland MarketWatch contributed."}]}