{"article": [{"url": "https://www.marketwatch.com/story/amazon-apple-facebook-and-google-ceos-get-grilled-by-house-members-in-historic-antitrust-hearing-2020-07-29", "published": 1596547700.0, "headline": "Antitrust questions bruise but don't break Big Tech CEOs in historic hearing", "body": "It has been a bruising day for tech's biggest names on Capitol Hill, but they didn't break. The CEOs of Google parent Alphabet Inc. GOOGL, +1.82%  , GOOG, +1.97%  , Amazon.com Inc. AMZN, +3.01%  , Apple Inc. AAPL, +1.74%  , and Facebook Inc. FB, +0.26%  endured more than five hours of grueling questions about competition Wednesday from House Judiciary Antitrust Subcommittee members in a series of sharp exchanges. See also: Opinion: Big Tech painted as the railroad barons of the digital age in antitrust hearing \"Our documents from Facebook show it considered Instagram a 'competitive threat' that could meaningfully hurt Facebook, so Facebook bought it,\" Rep. Jerrold Nadler, D-N.Y., chairman of the House Judiciary Committee, said in a particularly contentious exchange with Facebook CEO Mark Zuckerberg. \"This should not have been allowed to happen.\" Zuckerberg, who has testified a handful of times before Congress the past few years, said he viewed Instagram - a photo-sharing app for mobile devices acquired for $1 billion in 2012 - as a competitor and complement to Facebook's business. He deemed the purchase \"wildly successful\" after Facebook invested heavily into its operations. In another clash, Amazon CEO Jeff Bezos was hesitant to deny Amazon uses data from its third-party sellers to build its products. The charge, outlined in a Wall Street Journal story, could be the focus of an Amazon investigation, paralleling similar complaints that Apple develops its own apps based on data it receives within App Store about the apps of independent developers. Later, Rep. Mary Gay Scanlan, D-Pa., invoked the story of Diapers.com, a competitor that Amazon engaged in a price war before buying its parent company, Quidsi Inc., for $545 million in 2011. The company was shut down in March 2017. Bezos, who was testifying before Congress for the first time, acknowledged it was hard to recall details of the long-ago episode. Alphabet CEO Sundar Pichai was repeatedly grilled for allegedly stealing content from developers, such as restaurant reviews from Yelp Inc. YELP, -1.66%  (When Yelp complained, Google threatened to delist Yelp.) It also was accused of skewing search queries that showed the most profitable results for Google rather than the most popular. Pichai declined both charges. Luther Lowe, senior vice president of public policy at Yelp, said he was \"pleasantly surprised\" to see the issue addressed after Yelp had \"advocated for a decade\" on the issue. There were no immediate \"aha!\" moments nor smoking guns, but clearly uncomfortable exchanges. Facebook and acquisitions from a more than yearlong investigation covering some 1.3 million documents. Strong undercurrents of political grandstanding emerged, as when several Republican members charged Facebook, Google's YouTube, and Twitter with censoring the views of conservative voices on their platforms - as well as accusing Google of untoward interactions with the Department of Defense and Chinese authorities. \"This is a mix of antitrust ambush and political grandstanding and, as Mary Gay Scanlon put it, diversions into conspiracy theories,\" Bhaskar Chakravorti, dean of global business at The Fletcher School of Law and Diplomacy at Tufts University, told MarketWatch in an email. What patterns emerged from the hearing were charges of misconduct across various categories including stifling competition, exerting market power, and questionable use of data, NYU business professor Vasant Dhar told MarketWatch. Another theme was the risk companies face when employees engaged in questionable practices to misuse seller data (as in the case of Amazon) or influence company policy to bias algorithms (Google). The confrontational tone was set early, in the opening statement of Rep. David Cicilline, D-R.I., chairman of the subcommittee. \"Many of the practices used by these companies have harmful economic effects. They discourage entrepreneurship, destroy jobs, hike costs, and degrade quality,\" he said. \"Simply put: They have too much power. This power staves off new forms of competition, creativity, and innovation.\" \"And while these dominant firms may still produce some new innovative products, their dominance is killing the small businesses, manufacturing, and overall dynamism that are the engines of the American economy,\" Cicilline said. Befitting its historic nature and what's at stake, the hearing was scheduled to start at high noon ET, but was delayed an hour because an unrelated hearing ran late. The virtual clashes capped more than a year of hearings and investigations by Congress into the business practices of the Big Four and whether they violate antitrust laws. The committee and its staff accumulated 1.3 million documents; its conclusions, following today's hearing, are expected to be issued in a report later this year. Read more: Congress has a million-plus documents from Big Tech antitrust investigation, and are ready to grill big-name CEOs What they recommend will go a long way in influencing current probes by the Justice Department and Federal Trade Commission, as well as state attorneys generals - all of whom are looking into how Apple, Facebook, Alphabet, and Amazon leverage their vast resources to accumulate significant market share in multiple industries. The companies are also the subject of investigations by European regulators, who have shown more of a willingness to fine them. The companies boast sizable market share an influence in e-commerce (Amazon, Google), streaming (Amazon, Apple), advertising (Google, Facebook, Amazon), search (Google), social media (Facebook and its properties Instagram and WhatsApp), cloud computing (Amazon, Google), and fledgling areas such as artificial intelligence and machine learning. \"Your platform is so big, you can't contain false and harmful content,\" Cicilline told Zuckerberg at one point, driving home the immensity of its digital properties. Google, which is being investigated by the Justice Department and state attorneys general for its ad business, is likely to face the first action from the federal government. During an exchange in Wednesday's hearing, Rep. Pramila Jayapal, D-Wash., asserted that Google controls both the buy and sell side of the ad market. Microsoft Corp. MSFT, +2.48%  , which does not play big in consumer markets, is not part of the investigations though Slack Technologies Inc. WORK, +3.36%  last week filed an anticompetitive claim against the software giant with the European Commission. An attempt by Republicans to add Twitter Inc. TWTR, -0.23%  to Wednesday's hearing was unheeded by Democrats, who control the House. The tentacles of power of the four companies questioned have affected thousands of smaller companies and businesses that compete in some manner. Their combined market value of about $5 trillion continued to rise Wednesday. Shares of all four were up at least 1% on Wednesday. \"We want to see fairness at the end of the day,\" said Ben Volach, co-founder and co-CEO of Blix, an email app developer that claims it has data showing Apple suppressed App Store rankings of products that compete with Apple's own apps. Blix, which sued Apple in October alleging patent infringement and antitrust violations, worked with Cicilline's staff to come up with questions for Cook. \"Apple not only creates the devices and the OS, but the main operations on the phone, and they extend this into even more areas,\" Volach told MarketWatch. \"A handful of technology platform giants have come to exert far too much power over consumer commerce and communications,\" George Slover, senior policy counsel at Consumer Reports, said in a statement. \"This extreme level of market concentration harms consumers, depriving people of competitive choices, fair and transparent prices, and a meaningful diversity of views.\" All four tech CEOs opened with statements that ranged from the personal (Bezos) and prowess of and popularity of products (Apple's Tim Cook) to an eight-part opus that read like a grade-school essay (Zuckerberg) and personal success stories of customers (Pichai). See also: Here's what the CEOs of Apple, Amazon, Facebook and Alphabet will say at Wednesday's antitrust hearing What impact, if any, the hearings have on shares of the companies - all four report quarterly results Thursday - is unclear. So far, their stocks have flourished during COVID-19 with Amazon a particular beneficiary. Wedbush Securities analyst Dan Ives cautioned in a note Wednesday that \"anti-trust storm clouds appear to be building in the Beltway against Big Tech looking ahead into the rest of 2020.\" \"Ultimately, we think a legislative fix is the only one that creates a potential for limitations on these companies' ability to conduct business, whether that takes the form of higher taxes or new rules regarding market concentration,\" Ives wrote. \"Absent a legislative fix, we don't see meaningful change in regulation, although future acquisitions will most certainly be scrutinized and more difficult to close (see Alphabet's proposed acquisition of FitBit FIT, -0.14%  , still unsettled after 9 months).\" See also: Big Tech's big test arrives in the busiest week of earnings season"}]}