{"article": [{"url": "https://www.marketwatch.com/story/in-person-classes-in-new-york-city-delayed-until-sept-21-mayor-says-2020-09-01", "published": 1598967620.0, "headline": "In-person classes in New York City delayed until Sept. 21 mayor says", "body": "Amid mounting pressure from the teachers union to delay the start of the school year, Mayor Bill de Blasio announced Tuesday that in-person classes will be pushed back until Sept. 21, which is 11 days later than originally planned. Additionally, remote learning, also originally slated to start on Sept. 10, will now commence on Sept. 16. The delay is part of an agreement reached between the city and the United Federation of Teachers, which was threatening a potential strike over safety concerns regarding in-person learning. The union’s demands included mandatory testing in schools, which before today’s agreement, was not a component of the city Department of Education’s reopening plans. Details of the new reopening plan include: A mandatory monthly testing program in schools with in-person classes. “Every single school will have testing, it will be done every month, it will be rigorous,” de Blasio said. “Anyone who tests positive will, of course, be isolated, and that will trigger the Test and Trace apparatus.” Regular deliveries of personal protective equipment to ensure that schools have a running 30-day supply at all times. This will include masks for both teachers and students. “We will replenish it every day so there’s constantly a 30-day supply,” said schools Chancellor Richard Carranza. “No question, that will happen.” Schools will be allowed to purchase additional supplies at their own discretion. A week-long preparation period for teachers and other school staff from Sept. 10-14. A three-day “transitional period” with remote-only classes will begin on Sept. 16, and blended learning with in person classes will start on Sept. 21. De Blasio described the delay as “a revision that still allows us to keep things moving forward on a tight timeline but with additional preparation time.” There are significant logistical concerns outstanding at individual schools, but the now-agreed-upon list of requirements and procedures should keep reopening plans moving forward, said UFT President Michael Mulgrew. “It’s very clear to every school now. These are the supplies and equipment every school has to have, here are all of the procedures on how [reopening] works inside schools,” Mulgrew said during the news conference with the mayor. “We could say that you need to use social distancing, but how many entrances are you using, which way are you moving people in and out, when is bathroom time? Those have to be figured out on an individual level, but we have a definitive list of what those are.” Also see: This university created its own COVID-19 test and is testing students twice a week The UFT did not immediately respond to a request for comment on the city’s latest steps, but released a fact sheet stating that school buildings that fail to meet safety requirements will remain closed. Mulgrew also lashed out at federal officials’ overall response to the pandemic, saying, “The federal government completely failed to act yet had no qualms about standing up at press conferences saying how important it was for the schools to open. Shame on all of them.” Currently, more than one-third of the city’s 1.1 million public school students have chosen remote learning, with the option to enroll in blended classes in November. For the students planning to return to school, the mayor urged parents to “have their children tested in advance of the start of classes.”Other New York City news: 0.98% of COVID-19 tests in the state were positive on Monday, the 25th consecutive day that the statewide infection rate has remained below 1%. In New York City, 0.9% of tests on Monday came back positive. Gov. Andrew Cuomo has added Alaska and Montana to the growing list of states under travel advisory with a 14-day required quarantine for travelers coming to New York. The advisory now applies to 30 states, as well as Guam, Puerto Rico, and the Virgin Islands. Advisories are issued for states with a positive test rate higher than 10 per 100,000 residents, or areas with a 10% or higher positivity rate. Coronavirus update: Global case tally tops 25.5 million, and U.S. climbs to 6.03 million as Midwest states suffer rise in infections"}]}