{"article": [{"url": "https://www.marketwatch.com/story/vanguard-comes-to-defense-of-the-6040-portfolio-as-it-forecasts-stock-market-returns-for-the-next-decade-2020-07-23", "published": 1595665280.0, "headline": "Vanguard comes to defense of the 60/40 portfolio as it forecasts stock market returns for the next decade", "body": "The 60/40 portfolio has come in for its share of criticism recently, with Bank of America proclaiming its death last year. A 60/40 portfolio has 60% invested in stocks, and 40% in bonds or other safe asset classes. In a new note to clients, index fund powerhouse Vanguard Group points out how well the portfolio did in weathering the storm caused by the coronavirus pandemic. A 60/40 portfolio — with 60% in the MSCI All Country World index 892400, +0.75%, and 40% in a dollar-hedged Bloomberg Barclays Global Aggregate Bond index — weakened just 1.5% over the first half of the year. “It is true that over a few days, the correlation between the global equity and bond markets was positive and that they moved relatively in tandem, but for the first half of 2020, a globally diversified bond exposure acted as ballast, helping to counter the riskier stock component of the portfolio,” says Joe Davis, global chief economist at Vanguard. Vanguard is forecasting average annual U.S. stock-market returns between 4% and 6% over the next decade, which isn’t dissimilar from a recent projection from Goldman Sachs. Vanguard says global stocks, to U.S. investors, will return between 7% and 9% a year. But despite Vanguard’s low return outlook for bonds — 0% to 2% for both U.S. and non-U.S. bonds — Davis says globally diversified fixed income will continue to play the important role of a risk diversifier in a multiasset portfolio. Peter Dixon, senior economist at Commerzbank in London, is another who has come to the defense of the 60/40 portfolio. He points out that, over 20 years, it has generated higher returns than hedge funds once fees are taken into account. “The current low rate environment means the returns from bonds are likely to look very poor for years to come. But investors tempted to overweight equities, which are likely to benefit as a consequence, run the risk of getting caught out by volatility as markets continue to question whether current price valuations are justified (we can expect quite a lot of that in the months ahead),” says Dixon. “Since the intention of 60/40 is to offset the extreme highs and lows of equities, it may be worthwhile sticking with it for a bit longer. It is, after all, a tried and trusted method and that is not a bad thing in our new, uncertain investment world.” Strategists at Goldman Sachs disagree. In a note to clients this week, they acknowledge that over the last 30 years, there has been little benefit from diversification within equities or bonds, while diversification across assets was very effective. But with bond yields closer to the effective lower bound, potential for further declines is limited, they say. As for stocks, equities are likely to be stuck in a “fat and flat” range, that is, below average returns with above average volatility. They suggest an 80/20 portfolio with put protection, which they say outperformed a 60/40 portfolio significantly this year. Convertible bonds also look more attractive, they add. The S&P 500 SPX, +0.87% has rallied 46% this year from its March lows, and has gained a little over 1% this year. The yield on the benchmark 10-year Treasury TMUBMUSD10Y, 0.777% has fallen below 0.60%, falling 1.3 percentage points on the year. Yields move in the opposite direction to prices."}]}