{"article": [{"url": "https://www.marketwatch.com/story/im-retired-my-wife-isnt-how-should-we-pay-off-our-60000-mortgage-before-her-retirement-2020-07-15", "published": 1597493060.0, "headline": "Iâ\u0080\u0099m retired, my wife isnâ\u0080\u0099t â\u0080\u0094 how should we pay off our $60,000 mortgage before she retires?", "body": "Dear MarketWatch, I just recently retired at age 60, have $130,000 in savings and sufficient funds in my 401(k) for retirement. My current source of income is a $4,600 per month pension. My wife plans to retire next year. She makes $150,000 a year. Our only major debt is our house mortgage which we owe about $60,000. My questions are: a) should I pay that off using funds from my savings or b) using funds from my 401(k) (which will incur tax), or c) a combination of savings and 401(k) or d) none of the above and continue with wife paying mortgage till she retires? Uncertain in San Diego See:We have $190,000 in retirement savings and want to use the COVID-related distribution rules to pay off $40,000 in debt â\u0080\u0094 should we? Dear Uncertain in San Diego, Congratulations on your recent retirement, and the fact that your only major source of debt is your mortgage â\u0080\u0094 thatâ\u0080\u0099s an accomplishment entirely on its own. A $60,000 mortgage may seem like it needs to be repaid as soon as possible, but considering your monthly retirement income, your wifeâ\u0080\u0099s salary, your liquid savings and the retirement assets in your 401(k), you may not need to rush to pay it off, financial advisers said. Debt itself is neither good nor bad, said Larry Luxenberg, principal at Lexington Avenue Capital Management. Debt only becomes bad when thereâ\u0080\u0099s a lot of it at a high interest rate and it is a struggle to pay off. I will preface this with saying â\u0080\u0094 these suggestions are based solely on what you told us. We donâ\u0080\u0099t know your full financial picture, such as your monthly fixed expenses or your goals for retirement. These advisers are referring solely to how one could or should pay off a mortgage when approaching retirement, and they suggest you speak with a financial planner for a more comprehensive plan that incorporates all aspects of your financial lives. However, hereâ\u0080\u0099s what the advisers I spoke with said: Paying off the mortgage before retirement is a noble goal, but having some sort of housing debt when entering retirement isnâ\u0080\u0099t the worst thing in the world if your monthly income can handle it. In some scenarios, it may even be the better alternative to using your nest egg to repay the loan. â\u0080\u009cI would say that 90% of the time, paying off the mortgage provides more of an emotional satisfaction than a financial benefit,â\u0080\u009d said Laurie Nardone, managing principal at Shira Ridge Wealth Management. â\u0080\u009cWith mortgage rates so low, and possibly still a viable tax deduction, it can often help their entire financial situation to keep a mortgage.â\u0080\u009d Why? A few reasons. Investments, such as those in a 401(k), are working for you. Even though youâ\u0080\u0099ve passed the age where you would incur a penalty for withdrawing from your account (that was 59 Â½ years old), you will still pay taxes on those assets, as you noted. And the rate of return for that portfolio is likely higher than your mortgage rate (worst case scenario, itâ\u0080\u0099s roughly the same, and even then, youâ\u0080\u0099d at least be breaking even). You shouldnâ\u0080\u0099t take money out of an account that is doing well for you, especially because doing so would diminish the amount of money left to grow over the next few decades, said Michael Simmons, director of financial planning at Transitions Wealth Management. Taking money from a retirement account to pay off the mortgage when you have a decent income right now is not the best route, many advisers agreed. You donâ\u0080\u0099t want to be â\u0080\u009chouse rich and cash poor,â\u0080\u009d said Joseph Romano, president of Romano & Romano Financial. You could pay off your entire mortgage right now with your liquid assets in savings, and that would leave you with about $70,000 in those assets alone. Is that enough for you in the event of an emergency, such as a medical procedure or a roof repair, or to meet some other sort of goal, like eventually taking a nice vacation or gifting that money to loved ones or a charity one day? Will you be able to repay yourself (in your savings account) so that you have a comfortable amount of money in there as you did prior to paying off your mortgage? There are a few factors you should consider before determining if having a mortgage in retirement is a â\u0080\u009cbad thing,â\u0080\u009d said Kevin Gahagan, an adviser and principal at Private Ocean, such as: are the payments affordable (in retirement); is it â\u0080\u009cproductive debt,â\u0080\u009d meaning is it building your equity?; how does the mortgage benefit you at tax time, such as any tax deductions it may offer; will keeping your savings in your possession give you financial flexibility should you need it?; and how much time do you have left with your loan? â\u0080\u009cThe longer the remaining loan term, the greater the argument for retaining but restructuring the mortgage versus paying it off,â\u0080\u009d he said. Refinancing the mortgage is one option, if you decided you were okay with having some sort of a home payment in retirement. It would be best to apply for a refinanced mortgage while your wife is still working, Simmons said. Banks and lenders prefer working with clients who are still earning income, even if they have a sizable amount of money in savings, he said. Weâ\u0080\u0099re also in a low-interest rate environment right now, said John Pilkington, a senior financial adviser at Vanguard, which makes it an opportune time to refinance the mortgage. There are additional costs associated with refinancing however, so you should weigh the pros and cons of that decision (and determine whether itâ\u0080\u0099s even worth it based on what your interest rate is now versus what it would be when refinanced). There are advantages for paying off a mortgage before retirement, of course. Taking that major source of debt off the table means youâ\u0080\u0099ll need less income in retirement, and that would lead to less money distributed from retirement accounts, said Nadine Burns, president and chief executive officer of A New Path Financial. â\u0080\u009cThe less you take out, the less in taxes due,â\u0080\u009d she said. Also see:Iâ\u0080\u0099m a 32-year-old stay-at-home mom, and my husband earns $150,000 a year. Will I ever be able to enjoy a retirement? Paying off the mortgage before or right at retirement is also an emotional decision. Even if the numbers suggest someone would be financially fine having some sort of a mortgage while retired, that path isnâ\u0080\u0099t for everyone and could cause undue stress. Nobody wants that either. â\u0080\u009cIt can be financially practical for them and mathematically in their benefit, but if they canâ\u0080\u0099t be comfortable with that, it doesnâ\u0080\u0099t do them much good,â\u0080\u009d Romano said. If paying off the mortgage is a goal of yours, there are ways to do so. You can ramp up your payments with excess savings from your monthly income. You could also take a chunk of your liquid assets to pay off most of that mortgage now and then pay off the rest while your wife is working, for example. If you do the latter, try to use money thatâ\u0080\u0099s earning a low rate of return, such as from a money market or regular savings account, Simmons said. Remember: youâ\u0080\u0099re in control of your mortgage, not your lender, and thatâ\u0080\u0099s an advantage, Romano said. Your payment is the same in the first month of having a mortgage as it is in the last, which means your inflation-adjusted dollars used for your cost of living and purchasing power is outpacing your mortgage payments. Being in control, instead of at the hands of your lender, also means you have the ability to ride the mortgage out until the very end or, in many cases, pay it off faster than expected. If paying the mortgage off before retirement is something you think you have to do but you donâ\u0080\u0099t necessarily want to do with your savings or retirement assets, the good news is: you can wait it out. But if you decide youâ\u0080\u0099d really like that mortgage paid off before your wife retires, try to do it as painlessly as possible, such as using money thatâ\u0080\u0099s earning low rates of return and cash that wonâ\u0080\u0099t affect your near- and far-off retirement goals. Letters are edited for length and style. Have a question about your own retirement savings? Email us at HelpMeRetire@marketwatch.com."}]}