{"article": [{"url": "https://www.marketwatch.com/story/us-jobless-claims-fall-in-mid-september-but-economy-still-appears-to-be-suffering-sizable-layoffs-2020-09-17", "published": 1600337060.0, "headline": "U.S. jobless claims fall in mid-September, but the economy still suffering lots of layoffs", "body": "The numbers: The number of Americans who applied for unemployment benefits through state and federal programs fell in September for the first time in five weeks, but initial jobless claims are still very high and point to ongoing job losses due to the coronavirus pandemic. Initial jobless claims filed traditionally through state employment offices fell to 860,000 in the week of Sept. 6 to Sept. 11, the Labor Department said Thursday. Economists polled by MarketWatch had forecast new claims to fall to 870,000. Schools, businesses and other organizations are trying to restore some semblance of normalcy, but the U.S. economy is still struggling with the coronavirus and millions remain out of work, Getty Images New claims also fell for the first time since mid-August if self-employed workers who applied for benefits under a separate federal program are included. Some 658,737 people filed under the Pandemic Unemployment Assistance Act. That put the number of actual or unadjusted new claims at 1.45 million, compared to 1.73 million in the prior week. Federal filings declined for the first time in five weeks. Continuing jobless claims, or the number of people already receiving benefits, fell by 916,000 to a seasonally adjusted 12.63 million in the seven days ended Sept. 5. That’s the lowest level since April 4, just as the virus shut down most of the U.S. economy. Those figures only include people who applied through state programs. The number of people gettting benefits is more than double when including those on federal assistance. Read:The numbers say the economy is better, but millions of Americans aren’t feeling it What happened: A steady if erratic decline in jobless claims over the summer appears to have slowed in September. Part of the reason may be an increase in layoffs at hotels, airlines and other service-oriented companies whose businesses have suffered a big loss of customers. More companies have announced permanent job reductions after demand failed to return near to pre-crisis levels. Applications for benefits under the federal program, meanwhile, could have risen after President Trump authorized temporary $300 bonus payments in early August using an executive order. Congress let a more generous $600 stipend lapse after Democrats and Republicans were unable to agree on another aid package. Read:How long the $300 unemployment benefit lasts depends on which state you live in Whatever the case, the still-high number of people applying for or receiving benefits suggests the quick rebound in the economy earlier in the summer has given way to a more grudging recovery that’s going to take awhile. Altogether, the number of people getting benefits through eight state and federal programs increased by 98,000 to an unadjusted 29.77 million as of Aug. 29, the latest data available. Fewer than 2 million people were getting receiving unemployment checks before the pandemic started. Big picture: The U.S. economy bounced back stronger than expected after the initial onslaught of the coronavirus and it’s recovered almost half of the 22 million jobs lost, but it’s probably going to get a lot harder to get the rest of the jobs back. Thousands of small businesses have already closed and large industries like the airlines are likely to remain on life support until the pandemic fades. Read:U.S. retail sales climb in August for third straight month, but momentum is slowing All the jobs and incomes lost will weigh down the rest of the economy and drag out a recovery. The Federal Reserve on Wednesday estimated it will take more than three years before the unemployment rate falls close to pre-pandemic levels. Read:Fed aims to keep a key U.S. interest rate near zero until end of 2023 What they are saying? “The labor market continues to heal from the viral recession, but unemployment remains extremely elevated and will remain a problem for at least a couple of years,” said chief economist Gus Faucher of PNC Financial Services in Pittsburgh. “With initial claims at almost four times their pace before the pandemic, layoffs are far higher than normal.” Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% were set to decline in Thursday trades."}]}