{"article": [{"url": "https://www.marketwatch.com/story/halloween-sales-forecast-could-be-frightful-to-companies-trying-to-create-holiday-season-momentum-2020-09-10", "published": 1601566460.0, "headline": "Halloween sales forecast could be frightful to companies trying to create holiday season momentum", "body": "Nearly half of shoppers, 49%, will spend less to celebrate Halloween this year versus last, according to data from Numerator, which could put a chill in the launch of the holiday shopping season as brands and retailers try to generate momentum amid the ongoing COVID-19 pandemic. More than half, 52%, of consumers say they will buy less candy this year. And 73% expect to celebrate Halloween differently. “Baking continues to outpace prior years so expect to see more homemade treats for more personal exchanges which may take a bite out of candy,” Numerator said. “Individual candy packets will continue to be important but we expect sales to be lower with fewer large gatherings in which larger quantities are needed.” Read:The back-to-school shopping season will be a ‘dud’ one analyst says, but the NRF is forecasting a record breaker Retailers, in turn, have made adjustments. “ “[I]f trick-or-treat tends to be a little lower than expectation, clearly, we’ll focus even more on the treat-for-me and the candy bowl occasion.” ” — Hershey Chief Executive Michele Buck The coronavirus, which has kept consumers close to home for the summer, has already derailed the back-to-school season. As school districts worked to provide altered in-person instruction as well as remote classes, parents pulled back on their usual purchases of items like clothing and notebooks. See: Children’s Place is in a good place for a comeback, analysts say -- right behind Walmart, Target and Kohl’s Now with weeks until Halloween, families appear to be preparing for a scaled back Halloween spend due to safety concerns tied to the spread of COVID-19, as well as any fears about the state of the U.S. economy, which has experienced a sharp rise in unemployment over the past six months. “Home spending continues to be strong so Halloween decorations may be on the rise, depending on where the economy is in October,” Numerator said. The National Retail Federation is expecting Halloween sales of $8.05 billion, down from $8.78 billion in 2019. However, those that are participating are expected to spend $92.12 on average, compared with $86.27 last year. The coronavirus has forced significant shifts in the American shopping calendar. Halloween is now feeling the squeeze. “COVID-19 concerns will lead to lighter participation than previous years, shifting focus to family festivities in the home,” wrote Advantage Solutions in a report. Advantage Solutions is a sales and marketing services provider to consumer goods companies and retailers. In a normal year, 32% of Americans would go trick-or-treating, Advantage Solutions data shows. This year, only 14% say they will, with the authorities in the city of Los Angeles recommending that people forego the practice all together. And while 41% would normally go to a Halloween party with friends or host one themselves, this year, only 19% will, the data show. Advantage Solutions did find, however, that 22% of Americans will host or attend a Halloween party with just family, compared with 28% during a normal year. With consumers still making plans for some sort of Halloween festivities, retailers are preparing – and holding out hope – that the sales will come. At the Goldman Sachs Global Retailing Conference on Wednesday, Kohl’s Corp. KSS, -1.64% Chief Executive Michelle Gass said demand involving the home, including cooking and décor, has continued. “We’re already seeing the uptick of things around harvest and Halloween,” she said, according to FactSet. “[W]e expect… that this trend is going to continue for some time, as people are spending more time in their home.” Also:COVID-19-related consumer needs are turning Best Buy into an essential retailer, analysts say And candy company Hershey Co. HSY, +1.47% said during its second-quarter earnings call in late July that it begins shipping product in the summer, but has a strategy if this year is dramatically different. “[A]bout half of our product for Halloween is purchased for self-consumption,” said Hershey Chief Executive Michele Buck, according to FactSet. “[I]f trick-or-treat tends to be a little lower than expectation, clearly, we’ll focus even more on the treat-for-me and the candy bowl occasion. So you already know that we shifted some of our portfolio to more everyday packaging to protect the downside, should Halloween sales be a little bit lighter.” Buck said at the time that the company was keeping close contacts with retailers to keep on top of trends, but was upbeat about the prospects for the holiday. “We feel good about many retailers wanting to kind of lean in,” she said. “We also think that consumers will find creative and sage ways to trick-or-treat. It is an outdoor event. And it’s an event where a lot of masks are already worn.” Advantage Solutions data shows that Walmart Inc. WMT, +1.00% is the top choice for candy consumers, with 64% saying they’ll head to the retail giant for their sweet supply. And 67% say they’ll buy their candy in October. September and October is also normally when early holiday shopping begins. According to the latest COVID-19 Barometer from Kantar, Christmas spending will fall this year, with 53% of global consumers feeling an income impact from the pandemic. Another 20% expect to feel an impact. And:Here is Walmart’s list of the hottest toys for the holidays “Consumer confidence looks like it will take a hit as many household incomes continue to be damaged and concerns about the virus spreading again grow,” the report says. Shoppers are planning to turn out for the holiday season, but they might do it far earlier. Data from marketing company Fluent shows that 78% more consumers plan to shop before Thanksgiving this year versus last year, with many, 56%, expecting shipping delays to affect their purchases, a sign that the high level of online shopping done during the pandemic isn’t going to stop anytime soon. Retailers and brands are gearing up to make the most of what will come from the holiday season, with Target Corp. TGT, +1.14% making its first announcement back in July and other retailers following with Thanksgiving announcements. Walmart and BJ’s Wholesale Club Holdings Inc. BJ, +1.19% have pushed out their toy lists for parents who are already giving some thought to what they’ll give their kids this year."}]}