{"article": [{"url": "https://www.marketwatch.com/story/coca-cola-sales-fall-28-but-it-says-worst-is-over-2020-07-21", "published": 1595337560.0, "headline": "Coca-Cola Sales fall 28% but it says worst is over", "body": "Coca-Cola Co. said it believes the biggest challenges of the pandemic are behind it, despite the current surge in coronavirus cases in many parts of the U.S. About half of Coca-Cola's business comes from away-from-home venues -- the restaurants, bars, movie theaters and sports stadiums that were shut around the world during the second quarter because of the pandemic. But China, Southeast Asia and Western Europe have done a \"pretty good job in managing the worst stages of the pandemic\" and sales there should continue to improve, Coke's finance chief, John Murphy, said in an interview. \"Here in the U.S., we're seeing a spike in a number of places but the degree of lockdown is not nearly what it was.\" The company's sales improved in May and June as shelter-in-place measures eased around the world. Latin America and Africa still present the greatest amount of uncertainty, Mr. Murphy said. Nearly 15 million people have been infected by the virus, including more than 2.1 million in Brazil and 3.8 million in the U.S., according to data compiled by Johns Hopkins University. Coca-Cola's Fairlife milk and Simply orange-juice brands have sold well during the pandemic as people have eaten more at home. The company's biggest soda brands -- including Coke, Coke Zero Sugar and Sprite -- have sold well in grocery stores but have taken a hit from a steep drop-off in soda fountain sales. Meanwhile, smaller soda brands such as Fresca have suffered as retailers narrowed their offerings, Mr. Murphy said. Coca-Cola said revenue fell 28% to $7.15 billion for the quarter ended June 26, down from $10 billion a year earlier. Organic revenue, which excludes the effects of currency swings, acquisitions and divestitures, dropped 26%. Rival PepsiCo Inc. last week posted flat revenue for the latest quarter, which ended June 13, as increased demand for its snacks and packaged foods largely offset a decline in beverage sales. Some U.S. states have reported a rising number of Covid-19 cases, prompting some states to take steps to try to curb the pathogen's spread. For example, California has banned indoor dining and movie theaters in much of the state. Coca-Cola earlier this month said it was closing its Odwalla juice and smoothie business, as well as its refrigerated-truck delivery network. The soda giant will eliminate other small, underperforming brands around the world, Chief Executive James Quincey said in a call with analysts Tuesday, noting that more than half of the company's 400 brands are single-country brands with little to no scale. \"We have not been assertive enough\" in weeding them out, he said. For the quarter, Coca-Cola recorded earnings of $1.78 billion, or 41 cents a share, down from $2.61 billion, or 61 cents a share, in the comparable quarter last year. Adjusted earnings were 42 cents a share, ahead of the 40 cents a share analysts had expected. Coca-Cola is shifting marketing spending to its biggest brands and during the pandemic has pulled the plug on small R&D projects, Mr. Murphy said. Last week, the company said it was updating its Freestyle fountain machines to allow consumers to use their phones to pour soda instead of touching a screen. The company, like many big brands, has paused social-media advertising for July to review its policy amid a national reckoning over racial justice after the killing of George Floyd by Minneapolis police. The company said it has committed to spend an incremental $500 million with Black-owned suppliers over the next five years in the U.S. Dave Sebastian contributed to this article. Write to Jennifer Maloney at jennifer.maloney@wsj.com"}]}