{"article": [{"url": "https://www.marketwatch.com/story/tenet-off-to-fantastic-start-with-hodgepodge-theatrical-release-2020-08-30", "published": 1598805260.0, "headline": "â\u0080\u0098Tenetâ\u0080\u0099 off to â\u0080\u0098fantastic startâ\u0080\u0099 with hodgepodge theatrical release", "body": "NEW YORK â\u0080\u0094 The first wave of big new movies released since the beginning of the pandemic, including Christopher Nolanâ\u0080\u0099s mind-bending thriller â\u0080\u009cTenetâ\u0080\u009d and the long-delayed â\u0080\u009cX-Menâ\u0080\u009d spinoff â\u0080\u009cThe New Mutants,â\u0080\u009d arrived in theaters over the weekend, testing the waters of a radically different theatrical landscape. Warner Bros.â\u0080\u0099 â\u0080\u009cTenetâ\u0080\u009d â\u0080\u0094 the most hotly anticipated movie of the year and the one that has repeatedly positioned itself to lead the return of multiplex moviegoing â\u0080\u0094 opened with an estimated $53 million overseas in 41 markets, including most of Europe, South Korea and Canada. Given the circumstances, it was difficult to forecast the performance of the $200 million â\u0080\u009cTenet,â\u0080\u009d starring John David Washington Robert Pattinson and Elizabeth Debicki. But the result exceeded the expectations of most. Toby Emmerich, chairman of Warner Bros. Pictures Group, called it â\u0080\u009ca fantastic start.â\u0080\u009d â\u0080\u009cGiven the unprecedented circumstances of this global release we know weâ\u0080\u0099re running a marathon, not a sprint, and look forward to long playability for this film globally for many weeks to come,â\u0080\u009d said Emmerich in a statement. While many of Hollywoodâ\u0080\u0099s largest productions have postponed their release and others have rerouted to streaming platforms, AT&Tâ\u0080\u0099s T, -1.01% Â Warner Bros. gambled that â\u0080\u009cTenetâ\u0080\u009d could roll out abroad first, and then gradually debut in the U.S. So far, it seems to be working. The overseas opening for â\u0080\u009cTenetâ\u0080\u009d was greeted by some as proof that blockbuster moviegoing can be resurrected even while the virus continues to circulate and large indoor gatherings are considered higher risk. As part of their safety protocols, movie theaters are mandating mask wearing, cleaning cinemas in between showings and operating at 50% capacity to distance moviegoers usually crowded shoulder to shoulder. â\u0080\u009cThe strong international debut of Christopher Nolanâ\u0080\u0099s â\u0080\u0098Tenetâ\u0080\u0099 is an emphatic statement that audiences around the world are ready to return to theaters where local guidelines allow,â\u0080\u009d said Rich Gelfond, chief executive of IMAX. The large-format exhibitor accounted for $5 million of the filmâ\u0080\u0099s box office. In nine markets, including Ukraine and the Netherlands, â\u0080\u009cTenetâ\u0080\u009d did better than any previous movie directed by Nolan, including â\u0080\u009cThe Dark Knight.â\u0080\u009d It was the largest opening yet in Saudi Arabia, which in 2018 ended its ban on cinemas. In the United Kingdom, â\u0080\u009cTenetâ\u0080\u009d accounted for 74% of ticket sales, Warner Bros. said. â\u0080\u009cTenetâ\u0080\u009d will open this week in the U.S. and China, the two largest markets. In the U.S., the conditions remain far from ideal. About 60% of theaters are currently open. The largest chains, including AMC AMC, -2.17% Â and Regal , reopened the week prior. Any new release is trying to coax moviegoers back to the movies â\u0080\u0094 any movie â\u0080\u0094 in the midst of the COVID-19 pandemic. In the U.S. over the weekend, the Walt Disney Co.â\u0080\u0099s DIS, +1.53% Â â\u0080\u009cThe New Mutants,â\u0080\u009d a critically panned horror riff for Marvel made by 20th Century Fox before the Disney acquisition, led the domestic box office with an estimated $7 million in 2,412 locations. Cathleen Taff, Disneyâ\u0080\u0099s president of global distribution, called it a success for times requiring recalibrated expectations. â\u0080\u009cWe continue to have faith and believe in the theatrical experience. We think consumers are ready to start having that experience with others sooner rather than later,â\u0080\u009d Taff said. â\u0080\u009cWeâ\u0080\u0099re encouraged. Weâ\u0080\u0099re very encouraged.â\u0080\u009d Disney will next week release the live-action remake of â\u0080\u009cMulanâ\u0080\u009d for a $30 digital rental through its streaming service, Disney+. Originally slated for theatrical release in March, itâ\u0080\u0099s the most expensive movie yet to go straight to the home. Taff, though, said sheâ\u0080\u0099s optimistic about upcoming releases coming to theaters. â\u0080\u009cOf course itâ\u0080\u0099s not going to be a linear process. Weâ\u0080\u0099ve been upended for sure, along with many other industries. But we have to continue to pivot and adjust our approach in real time,â\u0080\u009d said Taff. â\u0080\u009cRight now weâ\u0080\u0099re feeling pretty good.â\u0080\u009d Theaters remain closed in several states, including New York and California. On Friday, California Gov. Gavin Newsom released guidelines that could allow county-by-country reopening of cinemas. United Artists Releasingâ\u0080\u0099 â\u0080\u009cBill & Ted Face the Musicâ\u0080\u009d debuted Friday on video-on-demand. The company didnâ\u0080\u0099t provide rental grosses Sunday, but it also put â\u0080\u009cBill and Tedâ\u0080\u009d in 1,007 North American theaters where it made just shy of $1.1 million. Theatrical release may be harder for adult-skewing specialty fare whose audiences are historically harder to get out of the house. Fox Searchlightâ\u0080\u0099s â\u0080\u009cThe Personal History David Copperfield,â\u0080\u009d a Charles Dickens adaptation by Armando Iannucci (â\u0080\u009cVeepâ\u0080\u009d), opened with $520,000 from 1,360 theaters. â\u0080\u009cThe results, while modest, signal a return to the cinema for moviegoers who are yearning for the majesty of the big screen,â\u0080\u009d said Frank Rodriguez, distribution head for Searchlight."}]}