{"article": [{"url": "https://www.marketwatch.com/story/fed-unanimously-adopts-new-strategy-widely-seen-as-leading-to-easier-policy-2020-08-27", "published": 1598543240.0, "headline": "Fed adopts new strategy to allow higher inflation and welcome strong labor markets", "body": "The Federal Open Market Committee on Thursday announced that it has approved significant changes to its written policy strategy that are widely seen as leading to an easier monetary policy stance over time. In a new policy framework, agreed to by all 17 top Fed officials, the central bank said it would allow inflation to run above 2% for some period of time. This is known as an “average inflation target.” “The Committee seeks to achieve inflation that averages 2% over time and therefore judges that, following periods when inflation has been running persistently below 2%, appropriate monetary policy will likely aim to achieve inflation moderately above 2% for some time,” the new policy framework said. The Fed also removed its bias against strong labor markets. Read:Here are major changes to Fed strategy The announcement of the new strategy was timed for Fed Chairman Jerome Powell’s speech to the annual Jackson Hole economic symposium, to be held virtually this year. Fed chairman have used the conference to make major policy announcements in the past. Some Fed watchers were surprised that the strategy was announced as it looked like the Fed needed to more work on the plan, given how little it was mentioned in the minutes of the central banks late July meeting. In his speech, Powell trumpeted the changes, saying “a robust job market can be sustained without causing an outbreak in inflation.” Economic evidence shows that minority communities benefit the most when strong labor markets persist. Support for strong labor markets would not have come from a central banker a generation ago. In the past, strong labor markets for Fed officials meant that higher inflation was just around the corner and a reason to “tap the brakes” and raise interest rates - even if there was no sign of higher prices. Powell did not elaborate on what “moderately above 2%” means. Later on Thursday Dallas Fed President Robert Kaplan said it meant inflation in a range of a 2.25% to 2.5% annual rate. St. Louis Fed President James Bullard said the details needed to be avoided to achieve consensus. “This is a very large committee as you know, with many opinions,” Bullard said in an interview on Bloomberg Television. “So I don’t think you want to get into precise mathematical formulas here. But the spirit of this is that, in the committee’s judgement, it would be wise to allow inflation to be above targets for some time to make up for past misses.” Over the past twenty years, people globally have started to save more and companies have started to invest less. This has pushed down interest rates around the world, forcing central banks to rewrite their strategies. Investors have started to bet that inflation is going to remain below central bank targets. This is a danger for economies because too low inflation can sap the life out of an economy. Foreign central banks tried to reverse low inflation expectations by pushing their benchmark interest rates into negative territory to spur demand. But this looks a lot like ineffective policy, or “pushing on a string”.” The Fed wants to avoid falling into this morass. “We have seen this adverse dynamic play out in other major economies around the world and have learned that once it sets in, it can be very difficult to overcome. We want to do what we can to prevent such a dynamic from happening here,” Powell said. The yield on 10-year Treasury notes TMUBMUSD10Y, 0.777% rose after Powell’s remarks. Stocks were higher. The Dow Jones Industrial Average DJIA, +0.56% was up 260 points in late afternoon trading. Asked about the economic outlook, Powell said he expected the recovery begun in May and June to continue “with stops and starts” but that unemployment would stay elevated. In some sense, the new strategy is an academic exercise. Adam Posen, the president of the Peterson Institute for International Economics, said he was doubtful that inflation overshoots its 2% target “anytime soon” or even over the next few years. Vincent Reinhart, a former Fed staffer and now chief economist at BNY Mellon Asset Management, noted the Fed strategy did not discuss what would happen if inflation was over the Fed’s target for a long period of time. It is difficult to image the Fed would engineer softer economic conditions to bring inflation below its 2% target, he said. Jim O’Sullivan, the chief U.S. macro strategist at TD Securities, said the new wording amounts to a more dovish reaction function for the Fed. This dovish tilt “was already evident in actions and speeches,” he noted."}]}