{"article": [{"url": "https://www.marketwatch.com/story/nyc-schools-can-have-outdoor-classes-in-schoolyards-streets-and-parks-mayor-announces-2020-08-24", "published": 1598293580.0, "headline": "NYC schools can have outdoor classes in schoolyards, streets and parks, mayor announces", "body": "New York City will open streets and public parks to schools that want to hold classes outdoors, where there’s less risk of spreading COVID-19, Mayor Bill de Blasio said on Monday. “We know outdoors is one of the things that works,” de Blasio said at a morning briefing. The mayor, who’s been working out how to reopen the largest school district in the U.S., has opened the program to public, charter and private schools. With little more than two weeks before the semester starts, the onus is on principals to submit a school-specific request for outdoor learning space, which could include expanding into the adjacent streets and nearby parks. Schools that plan to use their own school yards for outdoor learning don’t have to put in a request, but are being asked to notify the city by survey. The city will prioritize proposals from communities hard-hit by COVID-19, including many working-class neighborhoods across the outer boroughs and Upper Manhattan, where schools tend to be more cramped and have little or no schoolyard. Also read: ‘I can’t believe this is America.’ Confronted with unprecedented need, New York food pantries try to fill in the gaps The city is also emphasizing outdoor classroom subjects that require more space to effectively social distance, such as gym, art or music — raising the charming prospect of children singing in the streets come September. “Our students need time to run and play, explore and create in a safe, socially distanced way,” said schools Chancellor Richard A. Carranza. The city will consider proposals to hold standard academic classes outdoors as well. Mayor Bill de Blasio holds a media availability Monday with Schools Chancellor Richard Carranza. Ed Reed/Mayoral Photography Office Outdoor learning is not a new idea. During the 1918 Spanish flu and outbreaks of tuberculosis in the early 1900s, U.S. educators experimented with outdoor learning as a means to stem the spread. But the concept is more fraught in a densely built city with less reliable weather than, say, Southern California. Also see: Here’s one ‘remarkable’ difference between COVID-19 and the 1918 Spanish flu Closing off streets, for example, will require coordination with numerous city agencies, including police, fire and transportation to make sure that outdoor classrooms don’t cut off access to vital infrastructure like bus routes, hospitals or parking garages, city officials said. “We are grateful to our sister agencies for working together to make this possible,” Carranza said. His department has asked schools to focus on quiet, residential one-way streets. New York City is the only major school district in the country attempting some form of in-person learning in the fall, and as Monday’s decision highlighted, many of the plans are still fluid, even with less than three weeks to go. Schools are expected to reopen on Sept. 10 with a hybrid model that will mean two to three days of in-person classes and remote instruction on the other days, as a way to reduce classroom sizes and promote social distancing. The city says that schools that submit their outdoor learning proposals by Friday will receive an answer by Sept. 4 — leaving less than a week for principals, teachers and parents to execute those plans in time for the first day. Teachers technically return to work on Sept. 8. Many stakeholders, including three unions representing the city’s teachers, principals and lunch workers, have asked for the start of classes to be delayed at least several weeks in order to leave more time to update equipment and train staff. Many city leaders cheered the decision on Monday, though others, such as Michael Mulgrew, president of the United Federation of Teachers, indicated the city could still go further in efforts to keep children and teachers safe. Also see: Have you ‘herd’? New York might have immunity—but please don’t count on it, the mayor pleads “The mayor’s reopening plan continues to fall short, particularly in terms of necessary testing,” said the union chief, who last week threatened to strike or go to court if the city tried to rush teachers back into unsafe buildings on Sept. 10. Outdoor learning is only the latest twist in a school year unlike any the city’s students have had before. It could be a fall without high-school football across New York state, according to Gov. Andrew Cuomo who announced it and other higher-risk sports such as volleyball, wrestling and hockey may practice but not compete until further notice. Lower-risk school sports, like soccer, track and swimming, may resume games on Sept. 21, though only in regional matches, Cuomo said. Other NYC developments: Only 0.66% of coronavirus tests statewide came back positive on Sunday, the lowest positivity rate since the pandemic started. The positivity rate was below 1% in New York City, according to the state figures. LaGuardia and Kennedy International airports will set up on-site COVID-19 testing through a partnership with New York City’s public hospital system. It will enable faster testing of people coming into the state potentially from higher risk states and hospital staff, Cuomo said. Read next: At many schools, college will cost more than last year, despite COVID disruptions"}]}