{"article": [{"url": "https://www.marketwatch.com/story/preserving-some-drilling-pelosi-and-climate-panel-push-congress-to-get-nation-to-net-zero-emissions-by-2050-2020-06-30", "published": 1593530600.0, "headline": "Preserving some drilling, Pelosi and climate panel push Congress to get nation to net-zero emissions by 2050", "body": "Speaker Nancy Pelosi and Democrats on the House Special Committee on Climate are pushing Congress to set a national goal of net-zero emissions by at least 2050 and to more aggressively shift to renewable energy over fossil fuels. It’s an agenda, they argue, that is necessary to slow the man-made consequences of a warming planet and it’s largely in step with presumptive Democratic presidential nominee Joe Biden’s pledge on climate. Further, it shares the spirit of steps taken by private-sector heavyweights including Microsoft MSFT, +2.48% and the often criticized fast-delivery giant Amazon.com AMZN, +3.01% to reduce their own climate impact. Related:Microsoft aims to be ‘carbon negative’ by 2030 And:Amazon’s $2 billion fund for innovation in curbing climate change is latest sustainability effort Pelosi, the Democrat of California, and Rep. Kathy Castor, Democrat of Florida, the head of the special panel, on Tuesday unveiled the plan that also includes interim targets in 2030 and 2040, including net-zero emissions in the power sector by 2040 and a push to require all new cars and light trucks be fully electric by 2035. The release was put off initially because of the coronavirus pandemic. “The health of our families and the air we breathe are at the heart of our plan. We chart the course to good-paying jobs in solar and wind energy, in manufacturing American-made electric vehicles, and in strengthening communities, so they are more resilient to flooding, extreme heat, intense hurricanes and wildfires,” said Rep. Castor. Some Republicans object to the costs of this approach, especially as the U.S. has moved into a competitive fossil-fuel CL00, -1.62% production position with Saudi Arabia and Russia. “The risks of climate change are real, and the solutions must be equally real. Our industry is focused on reducing greenhouse gas emissions while providing access to affordable and reliable energy that helps enhance standards of living around the world,” said Frank Macchiarola, senior vice president of Policy, Economics and Regulatory affairs at the American Petroleum Institute, in a release that also called for bipartisan cooperation on climate change. Read:For first time ever, majority of shareholders push oil giant Chevron to align with Paris climate pact A group of House Republicans released their own set of climate-change policy proposals earlier this year that emphasized technological innovation and investing in carbon capture to control emissions. The Senate has its own version. “What I like about today’s proposal is its inclusion of a time-bound target for the emissions goal. That is useful,” said Charles Hernick, vice president of policy and advocacy at Citizens for Responsible Energy Solutions Forum. “The challenge, though, is that the proposal by the majority calls for a heavy hand by federal government that focuses on increasing costs and decreasing consumer options... [M]andating new sales of electric vehicles or certain types of electricity generation will crowd out innovation and cost reductions,” Hernick said, adding that he and others felt that Tuesday’s release got away from bipartisan progress on other proposals, including the Senate’s Growing Climate Solutions Act. Republicans also sit on the Cantor-led special climate committee and said they would issue their own detailed response to the report in the near future. “We can reduce emissions in the U.S. at a high cost to Americans. But can we export those solutions?” Hernick continued. “Until Latin America, Africa, and especially China, can adopt these solutions, we haven’t accomplished the goal.” The strongest opponents to legislating a climate-change fix, emboldened by the Trump White House, stand by claims that climate change is not a crisis. Trump has pulled the U.S. from the Paris climate pact in which 200 countries volunteered to reduce greenhouse gas emissions and keep global temperatures from rising no more than 2 degrees Celsius above preindustrial levels. Trump has linked his withdrawal to claims of noncompliance by developing nations. The latest Democrat-written proposal also wants to spend to expand carbon capture, similar to Republican ideas, and revives old plans for putting a price — it avoids the word “tax”— on carbon emissions. The proposal also recognizes that renewable energy development such as offshore wind should be a priority, and calls for the end to offshore oil and gas drilling. It does not ban future oil and gas leasing on federal lands but does extend some protections by limiting leasing. “This is not a plan that [President Trump] can lambast as an end to capitalism,” wrote Monica Medina and Miro Korenha, in the Our Daily Planet newsletter. The recommendations, which also tie in labor and farming protections and update building codes, are largely in line with Biden’s campaign pledge to take the U.S. to carbon-neutral by 2050. At first glance, the plan, especially its timeline, isn’t as aggressive as the Green New Deal advanced by other lawmakers, including New York Democrat Alexandria Ocasio-Cortez, last year. It found little traction in a divided Congress. Atmospheric concentrations of carbon dioxide hit a record high in May, several scientific reports have asserted. That month was the second-hottest on record, according to the National Oceanic and Atmospheric Administration, and the hottest on record, according to NASA, which uses a different calculation. The API, citing EPA data, says the U.S. has reduced CO2 emissions more than any other nation since 2000, and methane emissions relative to natural gas production from five of the largest U.S. producing regions, such as the Permian, fell more than 60% between 2011 and 2018. Other sources say methane leaks at the point of production remain a concern. Nearly two-thirds of Americans say they believe the federal government should act more aggressively to combat climate change, and almost as many say the issue is already affecting their community in some way, a June Pew Research Center survey said. And according to a June 2020 Yale, Climate Nexus and George Mason poll, more than 70% of voters queried support legislation favoring a “clean” economy that is less reliant on fossil fuels."}]}