{"article": [{"url": "https://www.marketwatch.com/story/travel-will-never-ever-go-back-to-the-way-it-was-airbnb-ceo-says-2020-06-28", "published": 1593370280.0, "headline": "â\u0080\u0098Travel will never, ever go back to the way it was,â\u0080\u0099 Airbnb CEO says", "body": "“ â\u0080\u009cTravel will never, ever go back to the way it was pre-COVID.â\u0080\u009d ” Thatâ\u0080\u0099s the grim view of Airbnb Inc. co-founder and Chief Executive Brian Chesky, in an interview published Sunday by Axios. â\u0080\u009cI will go on the record to say that travel will never, ever go back to the way it was pre-COVID. It just wonâ\u0080\u0099t,â\u0080\u009d Chesky told Axios. â\u0080\u009cThere are sometimes months when decades of transformation happen.â\u0080\u009d Chesky predicted that vacationers will stay closer to home in the future, largely limiting their travel to places within driving distance, with national parks becoming even more popular destinations. â\u0080\u009cI think youâ\u0080\u0099re going to start to see travel becoming more intimate, more local, to smaller communities,â\u0080\u009d he said, citing Airbnb data that shows travel within countries is recovering to normal levels. But its international business is still being hit hard. â\u0080\u009cPeople are not getting on airplanes, theyâ\u0080\u0099re not crossing borders, theyâ\u0080\u0099re not meaningfully traveling to cities, theyâ\u0080\u0099re not traveling for business.â\u0080\u009d Read: Is it safer to stay at a hotel or an Airbnb during your summer vacation? â\u0080\u0098We need to balance sanity and riskâ\u0080\u0099 â\u0080\u009cPeople will, one day, get back on planes,â\u0080\u009d Chesky told Axios. â\u0080\u009cBut one of the things that I do think is a fairly permanent shift is ... a redistribution of where travelers go.â\u0080\u009d Chesky said the changes hurt convention business for years to come. â\u0080\u009cI think a lot of people are going to realize they donâ\u0080\u0099t need to get on an airplane to have a meeting,â\u0080\u009d he said. While its business is improving, the global shutdowns caused by the coronavirus pandemic had a devastating effect on Airbnb. The San Francisco-based company laid off nearly 25% of its workforce in early May, and raised about $2 billion in equity and debt to boost its balance sheet. Its long-anticipated initial public offering seems unlikely to happen anytime soon, though Cheskly told Bloomberg News in June that â\u0080\u009cWeâ\u0080\u0099re not ruling out going public this year.â\u0080\u009d"}]}