{"article": [{"url": "https://www.marketwatch.com/story/how-does-the-genesis-g90-stand-up-to-the-lincoln-continental-2020-09-29", "published": 1601356280.0, "headline": "How does the Genesis G90 stand up to the Lincoln Continental?", "body": "As the flagship luxury sedans for their respective brands, the 2020 Genesis G90 and 2020 Lincoln Continental have plenty to offer. Here’s how they compare.2020 Genesis G90 The Genesis G90 Genesis 2020 Genesis G90 Starting Price: $73,915 Above average: A luxury sedan at a more reasonable price that comes with impressive features and good looks. It is also available with all-wheel drive. Below average: Some high-tech features are missing, and there’s a lack of status behind the Genesis name. Consensus: The 2020 Genesis G90 compares handily to other, pricier German vehicles and, in some cases, outdoes them. New, bolder styling gives the G90 a distinctive look.2020 Lincoln Continental 2020 Lincoln Continental Starting Price: $47,300 Above average: Plush ride, large rear seating area, available all-wheel drive. Below average: Standard front-drive, 6-speed automatic transmission, resale values not strong. Consensus: The 2020 Lincoln Continental exudes old-school domestic luxury cues at an affordable price. There’s plenty of room and the ability to move up to higher levels performance with the top line 400-horse 3.0-liter V6 with all-wheel drive. See: Which is better? The Tesla Model S and Model 3 comparedG90 vs. Continental: Traditional, yet cutting edge Genesis G90 The 2020 Genesis G90 might be the most affordable German-car killer you’ve never heard of. It compares nicely to other luxury marques like BMW, Lexus, and Audi and has plenty of power and features for a great price that makes it incredibly appealing. The only problem: Genesis, as a brand still lacks the cachet. This full-size sedan offers seating for five and a soft and supple ride. It boasts a quiet interior and ample power from the turbocharged V6, or optional 5.0-liter V8. The G90 also comes with a suite of tech and safety features, including collision avoidance assist, full-speed adaptive cruise control, lane-keeping assist, blind-spot monitoring, and a 360-degree camera. Genesis offers a valet service that retrieves your G90 for service and leaves you a loaner. Also see: 8 new luxury SUVs for under $50,000 Lincoln Continental While it’s Lincoln’s flagship luxury sedan, it is smaller than the G90, slotting between it and the G80. However, as the top dog on Lincoln’s car side, it has an interior that rivals the more costly G90. However, the base model with the 3.7 normally aspirated V6 or even the step-up turbo 2.7-liter engine come up short on performance, because of the standard front-drive and 6-speed automatic. AWD is optional on both and comes standard with the 400-horsepower 3.0-liter turbo V6. That model tops out in the low $70,000 range. The Continental boasts for five with a focus on comfort. Lincoln’s specialty here is confident highway cruising.Similarities Both offer all-wheel drive, a standard suite of driver and safety assists along with relatively affordable stickers in an expensive segment. Genesis G90 advantages Availability of a V-8 engine and a stellar warranty. Lincoln Continental advantages Feels like more of a cosseting luxury car; name recognition; affordability.Final recommendation Lincoln is a grand old name in the luxury car segment, and the Continental continues to offer the traditional domestic luxury car cues and feel. The Genesis G90 prevails here. It has more presence, feels more connected to the road and bridges the gap between American and European luxury cars. Also on MarketWatch: American muscle: We compare a Chevy Camaro to Dodge Challenger This story originally ran on KBB.com."}]}