{"article": [{"url": "https://www.marketwatch.com/story/these-2-charts-explain-why-the-stock-market-is-so-strong-while-the-economy-is-still-so-weak-2020-07-12", "published": 1594627820.0, "headline": "These 2 charts explain why the stock market is so strong while the economy is still so weak", "body": "As the coronavirus hit the U.S. in March, the S&P 500 index plummeted. Since its nadir, it has leapt more than 40% in 3½ months to within 6% of its all-time high. While many businesses have since reopened, the U.S. faces what will likely be the largest quarterly drop in GDP since the Great Depression in the second quarter, and 17.8 million people were counted as unemployed in June. How can the stock market be so strong in the face of such bad news? These two charts shed some light on the apparent disconnect between the stock market and the economy. First, while the job losses are immense, they are in industries that aren’t material to the performance of the S&P 500 index SPX, +0.87% . Almost 4 million hotels and restaurant jobs disappeared in the first half of 2020, according to government data. But many restaurants, for example, are privately held; restaurants made up a mere 1.2% of the S&P by market value at the start of the year. Hotels, resorts and cruise lines were just 0.5% of the S&P. Similarly, about 1.3 million retail jobs disappeared over the last six months, according to government data. Retail accounted for 6.2% of the S&P, and many brick-and-mortar retailers were already struggling to compete against e-commerce rivals like Amazon.com AMZN, +3.01% and eBay EBAY, +6.47%, which also are part of the sector. In fact, many of these traditional retailers had already been bumped out of the S&P 500 index. About 130,000 jobs in air transportation disappeared during that time—but airlines were just 0.4% of the index at the start of the year. By contrast, job losses were minimal in information technology, the S&P’s biggest sector, which accounted for 23% of the index. Read:Coronavirus spike in the dog days of summer sap economy of momentum The first chart shows how the stock-market performance of industries has varied considerably across sectors. Sector or industry group Percentage of S&P Market Capitalization - Dec. 31, 2019 Percentage of S&P Market Capitalization - July 10, 2020 Total Return - 2020 through July 10 Information Technology 23.2% 27.6% 18.8% Health Care 14.2% 14.3% -0.3% Financials 13.0% 9.9% -22.6% Communication Services 10.4% 11.2% 6.9% Consumer Discretionary 9.8% 11.3% 14.8% Industrials 9.1% 7.7% -15.6% Consumer Staples 7.2% 7.0% -2.8% Energy 4.3% 2.6% -39.2% Utilities 3.3% 3.1% -9.0% Real Estate 2.9% 2.8% -8.1% Materials 2.7% 2.5% -4.3% Retailing 6.2% 8.4% 34.7% Restaurants 1.2% 1.2% -7.4% Hotels, Resorts and Cruise Lines 0.5% 0.2% -49.5% Airlines 0.4% 0.2% -51.3% Source: FactSet The stock market typically overreacts once news of a recession hits, then rebounds. So while the S&P 500 gained 5.1% from the start of the year through its all-time closing high on Feb. 19, it plunged 33.8% through its closing 2020 low on March 23. Then came the recovery, which has left it down 0.4% for the year through Friday (assuming dividends are reinvested). Investors value companies over the long term, and that is another big reason for the market’s resiliency. This perspective involves more than just looking ahead six or nine months and anticipating an economic recovery. Of course, no one knows the extent and length of this economic downturn, but let’s assume that corporate profits and cash flows will be 50% lower than they otherwise would have been for the next two years and then return to levels that are permanently 5% lower than otherwise. Discounting the impact of these lower profits and cash flows suggests a decline in the present value of the stock market of less than 10%. Less dire assumptions would lead to an even smaller dip in valuations. The second chart shows how this works. The top line assume COVID-19 never happened and cash flows increase 4% each year (2019 is scaled at 100).The 4% growth rate represents a conservative estimate of 2% real growth (a conservative estimate based on history) and 2% inflation. The light gray area shows the how our assumptions of lost cash flows because of COVID-19. As you can see, the lost cash flows are small relative to the total potential cash flows. McKinsey While the market’s strength may be cold comfort to those who have lost their jobs, it can serve as a source of resilience amid today’s twin health and financial crises. Investors and others should welcome that as an important sign of hope for economic recovery. Tim Koller is a partner at McKinsey & Co. who advises clients on corporate finance. He is the lead author of “Valuation: Measuring and Managing the Value of Companies.” Now read:S&P 500 earnings set to plunge as the coronavirus batters all sectors — with Wall Street counting on a bounce that may not come"}]}