{"article": [{"url": "https://www.marketwatch.com/story/j-p-morgan-to-commit-an-additional-30-billion-to-help-reduce-systemic-racism-11602158018", "published": 1602144080.0, "headline": "J.P. Morgan to commit an additional $30 billion to help reduce systemic racism", "body": "J.P. Morgan CEO Jaime Dimon Getty Images J.P. Morgan Chase & Co. said Thursday that it will spend an additional $30 billion over the next five years as part of its new commitment to address the racial wealth divide and reduce systemic racism. The banking giant JPM, -0.57% said the new commitment builds on its existing investments, in which it said it would hire more than 4,000 Black students over the next five years, and provide 1,000 men of color over the next 10 years skills for greater economic opportunity. “Systemic racism is a tragic part of America’s history ,” said Chief Executive Jamie Dimon. “We can do more and do better to break down systems that have propagated racism and widespread economic inequality, especially for Black and Latinx people . It’s long past time that society addresses racial inequities in a more tangible, meaningful way .” The new commitments include: —Originate an additional 40,000 home purchase loans for Black and Latinx households, by committing $8 billion in mortgages. —Help lower mortgage payments for an additional 20,000 Black and Latinx households, by committing up to $4 billion in refinancing loans. —Provide $14 billion in new loans, equity investments and other efforts to finance an additional 100,000 affordable rental units. —Commit $2 billion to provide an additional 15,000 loans to small businesses in majority-Black and -Latinx communities. “We have a responsibility to intentionally drive economic inclusion for people that have been left behind ,” said Brian Lamb, head of diversity and inclusion. “The COVID-19 crisis has exacerbated long-standing inequities for Black and Latinx people around the world. We are using this catalytic moment to create change and economic opportunities that enhance racial equity for Black and Latinx communities .” Shares of J.P. Morgan, which rose 0.5% in premarket trading, have dropped 28.5% year to date through Wednesday. In comparison, the SPDR Financial Select Sector exchange-traded fund XLF, +0.11% has lost 19.2% and the Dow Jones Industrial Average DJIA, +0.56% has eased 0.8%."}]}