{"article": [{"url": "https://www.marketwatch.com/story/the-triple-wtf-chart-of-the-year-put-your-brain-on-tesla-autopilot-and-believe-11598979889", "published": 1598979200.0, "headline": "The 'Triple-WTF' chart of the year: 'You just have to put your brain on Tesla Autopilot and believe'", "body": "MarketWatch photo illustration/Getty Images/ iStockphoto Wolf Richter couldn't wrap his brain around the \"supernatural phenomenon\" way back in February when he warned investors to steer clear of shorting it. He then bestowed the stock with \"round-trip chart of the year\" honors a few months after that. Now, with Tesla stock TSLA, +1.89% splitting and pushing even deeper into uncharted territory, Wolf Richter of the popular Wolf Street blog just posted another chart to commemorate the occasion. \"Tesla's market cap soared by $64 billion in eight hours, including after hours. That's $8 billion in 'value created' per hour,\" Richter wrote in a blog post late Monday. \"If you have to ask, 'value created by doing what,' then you don't have the right stuff. Simple as that.\" He then put Tesla's market cap in perspective: Apple AAPL, +1.74% : $2.21 trillion Amazon AMZN, +3.01% : $1.73 trillion Microsoft MSFT, +2.48% : $1.71 trillion Google GOOG, +1.97% : $1.11 trillion Facebook FB, +0.26% : $835 billion Berkshire Hathaway BRK.A, +0.06% : $521 billion Tesla: $476 billion \"Tesla, the minuscule automaker with a global market share of less than 1%, isn't actually an automaker with stagnant revenues in a long-term stagnant or declining industry, but a data company with a secret government contract to populate Mars or whatever,\" Richter wrote, with more than a hint of sarcasm. \"You just have to put your brain on Tesla Autopilot and believe.\" Read: His short just got 'obliterated,' but this Tesla bear keeps trying Tesla gave up gains on Tuesday, after the company took advantage of the stock's best monthly performance in seven years to raise more capital. Before the disclosure, the stock was rallying premarket. The broader market, however, closed in the green, with the Dow Jones Industrial Average DJIA, +0.56%,  S&P 500 SPX, +0.87%  and Nasdaq COMP, +1.39% all higher."}]}