{"article": [{"url": "https://www.marketwatch.com/story/european-union-leaders-say-they-are-far-apart-on-covid-19-bailout-deal-11594982373", "published": 1594968440.0, "headline": "European Union leaders say they are far apart on COVID-19 bailout deal", "body": "Finland's Prime Minister Sanna Marin ( 2nd L), Belgium's Prime Minister Sophie Wilmes (L), European Commission President Ursula von der Leyen ( 2nd R) and German Chancellor Angela Merkel in Brussels on July 17, 2020, as the leaders of the European Union hold their first face-to-face summit over a post-virus economic rescue plan. francois lenoir/Agence France-Presse/Getty Images BRUSSELS (AP) — European Union leaders acknowledged Friday they are about as far apart from reaching a deal on an unprecedented 1.85 trillion euro ($2.1 trillion) EU budget and virus recovery fund as the seating distance imposed upon them for health reasons at their summit center. “The differences are still very, very big and so I can’t predict whether we will achieve a result this time,” said German Chancellor Angela Merkel as she arrived at the Europa summit site. “So I expect very, very difficult negotiations.” The challenges facing the 27 EU leaders — some of whom arrived masked, some unmasked — are formidable. The bloc is suffering through the worst recession in its history and member states are fighting over who should pay the most to help other countries and which nations should get the most to turn around their battered economies. As the summit got underway all leaders were wearing masks. The usual hugs, handshakes and kisses were replaced by friendly nods and elbow bumps. The jovial atmosphere was not expected to last long at what will likely be one of the most brutal and bruising summits of recent times. What is slated as a two-day meeting could go even longer, if necessary, to bridge the differences between leaders. French President Emmanuel Macron led the early negotiations, arriving Thursday and using the the pre-summit hours to meet with Dutch Prime Minister Mark Rutte, a stringent budget hardliner and considered one of the biggest obstacles to reaching a deal at the two-day meeting. “I am not optimistic, but you never know. Nobody wants another meeting,” said Rutte. Macron underscored the importance of the challenge. “The coming hours will be absolutely decisive,” he said. “It is our project Europe that is at stake.” The urgency is such that the leaders have ended a string of coronavirus-enforced videoconference summits and are meeting in person for the first time since the pandemic began its devastating sweep around the globe. The usual summit venue, an intimate room high up in the urn-shaped Europa center, was deemed too snug to be safe and instead the leaders have been sent down to meeting room EBS-5, whose 850 square meters (9,150 square feet) normally fits 330 people. Delegations were cut to a minimum, leaving leaders more dependent on their own knowledge of complicated dossiers. It should put a smile on the face of Merkel, who has been in office for 15 years and seen countless leaders come and go. Since the pandemic struck, she is seen as a safe pair of hands to lead her country through the crisis and now that Germany holds the rotating six-month EU presidency her stature will be even greater at the summit. And throw in that she is celebrating her 66th birthday on Friday. Macron, her geopolitical equal at the table, gave her a fine bottle of Burgundy. There may be cake later but the summit will hardly be a cakewalk for Merkel. The members were already fighting bitterly over the seven-year, 1-trillion-euro EU budget when COVID-19 was still a local story in Wuhan, China, late last year. Then the virus hit the EU head-on and estimates are now that the economy of the 19 countries that use the euro currency will contract by 8.7% this year. It sent the EU into a panic as it was at a loss on how to coordinate policies of its member states early on. Now, the EU’s executive is proposing a 750-billion-euro recovery fund, partly based on common borrowing, to be sent as loans and grants to the most needy countries. Merkel, who is in her last term and has her political legacy at stake, already got Germany to agree to join in a common debt program to alleviate the economic suffering in mostly southern and eastern member states. And she has agreed to include grants and not just loans in the recovery package to avoid overburdening member states with high debt already.Rutte doesn’t like that and Dutch officials said they would stick to their tough line going into the summit, raising the specter that a further summit might be needed. There are also plans to link budget funds to respect for basic democratic rights that the European Parliament says are under threat in nations like Hungary and Poland. Some eastern European nations will be objecting to having that as part of the deal. Hungarian Prime Minister Viktor Orban was clear upon departure that he would fight any such strings attached to the plan. “The Hungarian position is clear: Hungarians should decide about Hungarians’ money,” he said."}]}