{"article": [{"url": "https://www.marketwatch.com/story/market-swings-are-a-sign-something-is-lurking-says-strategist-who-called-08-crisis-11601403688", "published": 1601389760.0, "headline": "Market swings are a sign 'something is lurking,' says strategist who called '08 crisis", "body": "Is it time to \"get out of Dodge\"?Courtesy Everett Collection The ups and downs in the stock market over the past few weeks haven't been fun for anyone - though they arguably help keep financial journalists employed. Here's another thought. The recent pattern may be more than just the normal course of business - and perhaps something to pay attention to. \"After that whippy rally out of nowhere yesterday, I started to think how the current market pattern of instability and volatility is so much like what we saw back in January and February of this year,\" wrote David Rosenberg, a long-time strategist now running his own firm, Rosenberg Research. Rosenberg is often known as a bear, and he has had a glass-half-full view through most of this year. But he's also known for predicting the subprime mortgage crisis, even while working for one of the biggest enablers - and victims - of the bubble, Merrill Lynch. Biggest moves in the Dow Jones Industrial Average DJIA, +0.56%, 2020 January 27 -453 points January 31 -603 points February 4 +407 points February 5 +483 points February 24 -1,031 points February 27 -1,190 points February 28 -357 points March 2 +1,293 points March 3 -785 points March 4 +1,173 points September 3 -807 points September 9 +439 points September 10 -405 points September 14 +327 points September 21 -509 points September 23 -525 points September 25 +358 points September 28 +410 points Source: Rosenberg Research While investors worldwide knew about the novel coronavirus in January and February - few people anticipated just how bad it would become. Rosenberg also points out that markets \"tanked\" in February, but only ended up \"bottoming when the Fed and the Treasury and Congress teamed up to engage in the most intense policy easing of all time.\" Veteran investors sometimes like to associate the bond market with signals and stocks with noise. iframe.twitter-tweet { width: 100% !important; } But Rosenberg thinks recent stock-market choppiness should be a reason to worry. \"Does this behavior look normal to you?\" he asked. \"Any reason, you think, for all this volatility? Could it be a signal that something is lurking around the corner?\" It's not clear what that \"something\" could be, although there's a long list of headwinds, from the U.S. presidential election to a no-deal Brexit to the seemingly endless string of natural disasters. And underneath it all are rising global COVID-19 case counts that could swamp health systems and sap economies - which forecasters expect to only get worse with the return of winter. \"Fatigue has set in, people are getting sloppy, but the impact on economic activity is still one of a drag,\" Rosenberg wrote. \"And as we go into fall and then winter, this situation can only get worse. And the market gyrations, as at the turn of the year, are telling you get out of Dodge - as in, de-risk.\" Read next: 'The stock market no longer thinks it needs the economy if it has the Fed,' David Rosenberg says"}]}