{"article": [{"url": "https://www.marketwatch.com/story/kamala-harris-is-bidens-running-mateheres-what-she-means-and-doesnt-mean-for-financial-markets-2020-08-12", "published": 1597485320.0, "headline": "Hereâ\u0080\u0099s what Kamala Harris means and doesnâ\u0080\u0099t mean for financial markets", "body": "Financial markets have been unperturbed so far about the pick of the first Black American woman and the first person of Indian decent to appear on the ticket of a major national partyâ\u0080\u0094and, perhaps, for good reason. Presumptive Democratic presidential nominee Joe Biden announced Tuesday that he has selected California Sen. Kamala Harris as his running mate in the race for the White House against President Donald Trump and Vice President Mike Pence. But the vice presidential candidate isnâ\u0080\u0099t normally a make-or-break selection in the campaign for the Oval Office. Running mates are selected to complement the top of the ticket, but in this case, questions of whether Biden is willing to go beyond a four-year term may have raised the stakes. Biden, who is 77, would be 78 years and 61 days old when he takes the oath of office in 2021, should he prevail against Republican Trump. Harris is 55, and market participants may be viewing her as having a greater chance of eventually influencing financial market policy. Notably, Biden holds a 6.9 percentage-point lead over Trump in an average of national polls, according to RealClear Politics, suggesting that his chances of winning the election on Nov. 3 are better than average, if the polling data are an accurate reflection of ultimate outcomes. On Wednesday, less than 24 hours after the Harrisâ\u0080\u0099s selection by Biden, the stock market was climbing. The Dow Jones Industrial Average DJIA, +0.56%, the S&P 500 SPX, +0.87% and the Nasdaq Composite COMP, +1.39% indexes were all headed solidly higher, on the back of hope for vaccines to battle the COVID-19 pandemic and optimism about further stimulus from the government to help laborers who have lost jobs due to business closures to curb the spread of the deadly illness. The gains werenâ\u0080\u0099t because of Harris, to be sure, but market participants say that Bidenâ\u0080\u0099s selection, one that had been widely telegraphed, perhaps, eases fears of a candidate that could have been viewed as less market friendly, experts told MarketWatch. Chris Larkin, managing director of trading and investment product, at E-Trade Financial Corp. US:ETFC, said that â\u0080\u009cthereâ\u0080\u0099s a bit more certainty around what a Biden administration would look like, with Harris joining the ticket, who no less is understood as a moderate by the Street.â\u0080\u009d Some analysts said that markets may have been heartened by Bidenâ\u0080\u0099s decision to not pick a progressive candidate like Massachusetts Sen. Elizabeth Warren, who is seen by some as a negative for stocks and the banking industry in particular. Andrew Adams, analyst at Saut Strategy, said â\u0080\u009c[Harris] was the betting favorite and seems to be more palatable to the market than someone like long-shot Elizabeth Warren would have been from what little Iâ\u0080\u0099ve read.â\u0080\u009d Read: Kamala Harris on student-loan forgiveness, Medicare, universal basic income, credit scores â\u0080\u0094 and a tax on trading stocks Bespoke Investment Groupâ\u0080\u0099s researchers wrote in a Wednesday note that â\u0080\u009cwhile the selection [of Harris] isnâ\u0080\u0099t likely to provide much of a boost for Biden, at this point it likely wonâ\u0080\u0099t hurt him either,â\u0080\u009d and that could be read as not likely to hurt the market either. â\u0080\u009cKamalaâ\u0080\u0099s history as a California representative during a period of economic boom reflects a more â\u0080\u0098hands-offâ\u0080\u0099 approach to markets and commerce in general,â\u0080\u009d Pierce Crosby, general manager, at TradingView, an online trading community with some 10 million users, told MarketWatch via email. â\u0080\u009cThose not given the appointment - i.e. Warren - says more to market confidence than Harrisâ\u0080\u0099 appointment specifically, which indeed strips out some of the implied volatility in the November race,â\u0080\u009d he said. â\u0080\u009cTraders will be watching closely for thoughts on additional stimulus, as well as more social protections for the working class,â\u0080\u009d he continued. Harrisâ\u0080\u0099s selection does have some specific implications for the stock market and financial markets broadly, given her stance on taxing trading. â\u0080\u009cI would tax Wall Street stock trades at 0.2%, bond trades at 0.1%, and derivative transactions at 0.002%,â\u0080\u009d Harris said when she was a candidate for the Democratic presidential nomination. Harris had said the transaction tax would raise $2 trillion over 10 years, and Biden has expressed some support for those ideas. She has advocated for an expanded version of Medicare, popularly known as â\u0080\u009cMedicare For All,â\u0080\u009d and she has made the case that Wall Street can pay for it in part via taxes on trading. MarketWatchâ\u0080\u0099s Jon Swartz reports that Harris doesnâ\u0080\u0099t support breaking up Facebook Inc. FB, +0.26%, Google parent Alphabet Inc. GOOG, +1.97% Â GOOGL, +1.82% Â and Amazon.com Inc. AMZN, +3.01%, as Warren and Vermont Sen. Bernie Sanders had in their respective presidential bids. She was, however, open to strengthening antitrust enforcement. It is important to note that the market is fickle. VP candidates aside, market participants had spent considerably amounts of time hand-wringing about the possibility of a Biden candidacy up until recently. JPMorgan strategists have said that a Biden win in November would be â\u0080\u009cneutral to slight positiveâ\u0080\u009d for equities. The Democratâ\u0080\u0099s major economic policies include lifting the corporate tax rate from 21% to 28% â\u0080\u0094 partially reversing the Republican corporate tax cut of 2017 â\u0080\u0094 and increasing the federal minimum wage. The investment bankâ\u0080\u0099s U.S. equity strategy team also says it expects the former vice president to ease tariffs on China and increase infrastructure spending, which could assuage market fears about rising Sino-American tensions. Market participants caviled about the potential Trump victory back in 2016, up until the point that the 45th president actually secured victory over Democratic candidate Hillary Clinton in a stunning outcome and the market preceded to surge on the view that the real estate billionaire would be friendly to business. Another point worth noting is that the overall impact of a candidate may not be as significant as the timing of their presidency. Barack Obama became president in the aftermath of what was then the worst financial crisis since the Great Depression in 2008-09, and helmed a recovery for the overall economy and the markets, while whomever is elected president will preside over the fallout from the worst public-health crisis in generations and a rising stock market that seems disassociated from the economic calamity created by the pandemic. Trillions of dollars have been spent by the government to help ailing businesses and out-of-work Americans and interest rates are at or near 0% while the unemployment rate is at 10.2%. In the end, the circumstances may have a greater influence over the market than who is in the Oval Office or the person who serves as that leaderâ\u0080\u0099s No. 2."}]}