{"article": [{"url": "https://www.marketwatch.com/story/new-york-sees-increase-in-virus-infections-among-20-somethings-2020-07-23", "published": 1595520620.0, "headline": "New York sees increase in virus infections among 20-somethings", "body": "More 20-something New Yorkers are testing positive for COVID-19, Gov. Andrew Cuomo said in a news conference Thursday. In the last two weeks, the infection rate has risen 4 points for people between 21 and 30 years old, from 9.9% to 13.2%, he announced. It is the only age group in which infection rates increased in that time period. Calling the uptick a “threat” to the state, Cuomo pointed to large gatherings at bars and a lack of social distancing as causes, as he has regularly done over the past week. “This is not the time to fight for your right to party,” Cuomo said, quoting the 1980s Beastie Boys hit. “I respect your right to party...but let’s be smart about it. There’s an attitude that young people are immune. You are not.” Doctors have noticed the shift in the age of COVID-19 patients, according to Dr. Daniel Griffin, a practicing physician and an associate research scientist in the Department of Biochemistry and Molecular Biophysics at Columbia University. “The dynamic of the younger population has to do with behavior,” he told MarketWatch. “We’re seeing lots of young people out with large social circles interacting and we’re seeing spread within those communities.” Across the general population, there were 811 new cases of the virus reported Wednesday, with an infection rate of about 1.16%, Cuomo said in the news conference. There were 706 new hospitalizations, the lowest number since March 18, and 13 fatalities. In total, there have been nearly 410,000 reported cases of the virus in New York and 25,081 deaths. Coronavirus update:Global COVID-19 cases top 15 million as U.S. edges closer to 4 million, and California has more cases than New York Cuomo has called on local law enforcement to keep large gatherings at bars at bay, and earlier this week announced liquor licenses have been suspended for a number of establishments who have not complied with state guidelines. On Thursday, he also called on local police to enforce mandates against such gatherings. “New York City has to enforce the law,” Cuomo said. “The state liquor authority and the state police are going to step up their efforts dramatically, but they can’t do it without the local police.” Mayor Bill de Blasio has also expressed concern about the uptick in cases in this age group. Last week he announced that positive cases of the virus in 20- to 29-year-olds rose from 26.6 for every 100,000 people the first week of June, to 34.6 the week ending June 27. Still, the city is seeing the lowest number of new cases of the virus since the pandemic began. In addition, there hasn’t been an uptick in the infection rate since the city started reopening, the mayor said Thursday during his daily briefing. Read: Next coronavirus aid package may not become reality until second week of August, analysts say De Blasio also announced four new testing sites in the city, and that NYC Health + Hospitals sites can now test up to 50,000 people a day. There have been a total of 219,489 reported cases of the virus in New York City, as well as 18,839 confirmed deaths and 4,624 probable deaths, according to city data."}]}