{"article": [{"url": "https://www.marketwatch.com/story/powell-says-us-economy-will-continue-to-recover-with-stops-and-starts-2020-08-27", "published": 1598529560.0, "headline": "Powell says U.S. economy will continue to recover 'with stops and starts'", "body": "The U.S. economy should continue to recover, in fits and starts, but many unemployed workers will have trouble finding work, Fed Chairman Jerome Powell said Thursday. \"I think we will get through this period, maybe with some starts and stops, with reasonable growth but ultimately we're looking atâ\u0080¦a couple of years of relatively high unemployment,\" Powell said in a question-and-answer session after his Jackson Hole remarks. In his remarks, Powell announced a new strategy to combat too-low inflation and foster tight labor markets. The U.S. economy has a lot of strength and is still healthy, except for the many areas directly affected by COVID-19, the Fed chairman said. That includes a large number of sectors, including airlines, entertainment, and restaurants \"The part of the economy which involves getting people together, and feeding them - flying them around the country, having them sleep in hotels and entertaining them- that part of the economy will find it very difficult to recover. That is a lot of workers. That is millions of people whose are really going to struggle to find work,\" Powell said. \"We need to stay with those people, we need to support them and help them get back into their working lives,\" he said. Powell also said small businesses will need \"more direct aid\" from congressional spending, rather than from Fed lending programs. In the recent past, economic downturns have been quick to arrive and slow to depart, said Vincent Reinhart, a former top Fed staffer and now chief economist at Mellon. There are lots of reasons to think this will be the case this time with the recovery from the pandemic shutdown, he added. As unemployment benefits get more generous, the average spell of unemployment lengthens, he noted. \"You get a core of people who stay unemployed for longer. That that makes the unemployment rate slow to recover,\" Reinhart added."}]}