{"article": [{"url": "https://www.marketwatch.com/story/chinas-economy-may-be-back-on-track-but-problems-plague-it-elsewhere-11598997987", "published": 1599136640.0, "headline": "Chinaâ\u0080\u0099s economy may be back on track, but problems plague it elsewhere", "body": "Elementary-school students were in class Tuesday in Wuhan, in China's Hubei Province, the city where the coronavirus causing the disease COVID-19 was first identified late last year. str/Agence France-Presse/Getty Images Itâ\u0080\u0099s been no secret that China was among the first to emerge from the pandemic that is still ravaging much of the world â\u0080\u0094 in part because it was the first to experience the crisis, but also because of its heavy-handed but effective lockdown. And compared with much of the world, Chinaâ\u0080\u0099s current conditions are exceptional, and it has been seen as the sort of sentinel in how to return, and how to gauge that return, to elements of normalcy. Schools are mostly back in session, the coronavirus is under control save for a few small pockets, and a steady stream of solid economic news has come in lately. China is likely to be the only country globally to see full-year 2020 economic growth. That being said, Chinaâ\u0080\u0099s National Bureau of Statistics reported on Monday that the manufacturing index fell, while the services reading rose a bit. The country has come an enormous way since January, when it locked down. Yet these measurements of normalcy are misleadingly narrow â\u0080\u0094 they define â\u0080\u009cnormalâ\u0080\u009d in terms of select economic areas, low coronavirus numbers, and kids returning to school â\u0080\u0094 all important metrics. But as China exerts its newfound superpower status, it finds itself grappling with the most challenges faced in years if not decades. Defined this way, things are far from normal. â\u0080\u009cIn these days of the global pandemic, â\u0080\u0098normalâ\u0080\u0099 is relative,â\u0080\u009d Karen Eggleston, director of Stanford Universityâ\u0080\u0099s Asia health-policy program, told MarketWatch on Wednesday.Â Eggleston added: â\u0080\u009cChina still faces numerous challenges, from handling the risks of reinfection, to making up for the foregone/delayed screening and care for non-COVID conditions, to quickly but carefully developing and testing vaccines and preparing for national deployment in an industry previously rocked by scandal, to trying to address the structural challenges underlying [the difficulty and expense of receiving medical care], and addressing disparities in lifecourse opportunities for healthy lives that leads to a more than 10-year differences in life expectancy across regions.â\u0080\u009d Thus, under the placid surface of Chinaâ\u0080\u0099s post-coronavirus return to life largely as it was, lies a slew of exceptions, setbacks and maneuverings that are both part of its escape from the pathogenâ\u0080\u0099s grip as well as its ongoing rise as the worldâ\u0080\u0099s up-and-coming global power.Â Chinaâ\u0080\u0099s true unemployment rate may never be known given Chinaâ\u0080\u0099s opaque system â\u0080\u0094 the latest reading by outside experts puts the number at 20% among recent graduates â\u0080\u0094 the concentration-camp scandal and virus crisis in the Xinjiang region are roiling potentially millions of lives, border clashes with India and historically bad relations with the U.S. (aggravated by the pandemic) put it at loggerheads with two giant rivals, Beijingâ\u0080\u0099s takeover of Hong Kong has upended many lives there, and the worst floods in decades are wreaking havoc across a quarter of the country. Last weekend, China implemented restrictive export rules for technology companies, which could complicate an order from the administration of U.S. President Donald Trumpâ\u0080\u0099s that ByteDance sell the American operations of its subsidiary TikTok by Sept. 15. The move mirrors the economic retaliations the countries have been lobbing since the trade war. Most observers are focused on the brighter day-to-day return to normal life. â\u0080\u009cFrom afar it looks a miserable year for all the reasons you cited, but relatively China appears to be doing better than many other countries that are still struggling with the pandemic,â\u0080\u009d said China expert Bill Bishop, author of the Sinocism newsletter and a former MarketWatch executive. Susan Shirk, currently a professor at the School of Global Policy and Strategy at the University of California, San Diego, who previously served as deputy assistant secretary of state responsible for U.S. policy toward China, agreed, telling MarketWatch, â\u0080\u009cI believe that what people mean when they contrast Chinaâ\u0080\u0099s â\u0080\u0098return to normalcyâ\u0080\u0099 to the situation in the U.S. and many other countries, is simply that people have returned to in-person work, school, shopping, dining, and even travel now that the virus has been controlled for the time being.Â But of course, you are right that there are many features of pre-covid life that havenâ\u0080\u0099t returned yet and the government is on high alert for any new outbreaks.â\u0080\u009d COVID didnâ\u0080\u0099t cause all of China geopolitical and trade issues, its frayed relationships with more than a handful of countries. But it certainly exacerbated them. We might do well to rethink our definition of â\u0080\u009creturn to normalcy.â\u0080\u009d Tanner Brown covers China for MarketWatch and Barronâ\u0080\u0099s."}]}