{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-see-muted-trade-as-dollars-run-up-steadies-2020-09-22", "published": 1600784480.0, "headline": "Gold prices suffer back-to-back losses as dollar extends run-up", "body": "Gold prices on Tuesday ended lower for a second session as the dollar continued its climb on the back of concerns about fresh COVID-19 lockdowns implemented in London and other parts of Europe. Rising cases in Europe and in the U.S. have unsettled investors about the global economic recovery, driving investors into dollars, which has weighed on bullion. On top of that, investors also have unwound some of their gold holdings as a part of Monday’s equity-market turbulence, which added to the pressures around precious commodities. European countries, including France, Spain and the U.K., are grappling with rising coronavirus numbers, and U.K. Prime Minister Boris Johnson introducing new restrictions to stem the spread of coronavirus, including 10 p.m. curfews for pubs and restaurants in England, in a reversal from the summer relaxing of coronavirus restrictions. Meanwhile, new cases in the U.S. on Monday rose by 52,000, marking the highest single-day increase since Aug. 14, according to Johns Hopkins University. The U.S. dollar was recently up 0.3% at 93.958, as gauged by the ICE U.S. Dollar DXY, -0.58%. A stronger dollar can make assets priced in the currency relative more expensive to overseas buyers using other monetary units. “The dollar appears to have trampled over gold in its comeback bid,” wrote Raffi Boyadjian, senior investment analyst at XM, in a Tuesday note. “The precious metal remains heavily skewed to the downside despite the diminishing risk appetite and looks set to breach the $1,900/oz level,” the analyst wrote. December gold GCZ20, +2.17% GC00, +2.17% shed $3, or 0.2%, to settle at $1,907.60 an ounce, following a 2.6% slide Monday. Tuesday’s settlement was the lowest for most-active contract since July 24, according to FactSet data. Bullion’s price finish on Comex Monday pushed gold beneath its short-term, 50-day moving average at $1,941.78 an ounce — a move that is seen as contributing to a view that gold’s bullish short-term trend line was in jeopardy. Market technicians view moving averages as dividing lines between bullish and bearish momentum in an asset. Chintan Karnani, chief market analyst at Insignia Consultants, said he believes Monday’s fall was due to “quarter-end investment portfolio reallocation.” “Some of the bond investors who switched to gold and stocks have started reinvesting in bonds in small amounts,” he told MarketWatch on Tuesday. “They are expecting bond yields to rise in the final quarter of the year. Vaccine hopes are also supporting bond yields.” Meanwhile, December silver SIZ20, +5.96% SI00, +5.96% tacked on 14 cents, or 0.6%, at $24.523 an ounce, following a 10.1% tumble on Monday that pushed gold’s sister metal to the lowest settlement since July 31, based on the most-active contracts. Federal Reserve Chairman Jerome Powell on Tuesday told the House Financial Services Committee it’s up to them to provide relief to some troubled companies, as doubts remain over prospects for another aid package. Powell will offer testimony to the House Select Subcommittee on coronavirus crisis on Wednesday. Read:Powell says it’s tough for Fed to boost lending to smaller businesses Once testimony is over, gold traders will take positions for the U.S. September nonfarm payrolls data, due out on Oct. 2, said Karnani. “A bad nonfarm payrolls and a way below jobs creation in September…will result in gold prices easily breaking past $2,000” to a new all-time high. “Other bullish factors have not changed, like risk before the U.S. presidential elections, protectionism, helicopter money availability etc., but for a very swift rise in gold price, U.S. jobs in September have to be in dire straits,” Karnani said. Among other metals traded on Comex, December copper HGZ20, +1.38% added 1% to $3.061 a pound. October platinum PLV20, +3.99% shed 2.1% to $857.40 an ounce and December palladium PAZ20, +2.31% settled at $2,229.60 an ounce, down 2.3%."}]}