{"article": [{"url": "https://www.marketwatch.com/story/higher-rates-for-upper-income-folks-and-a-bigger-child-credit-what-joe-bidens-tax-plan-could-mean-for-your-taxes-11599643996", "published": 1600170560.0, "headline": "Higher rates for upper-income folks and a bigger child tax credit - what Joe Biden's tax plan could mean for you", "body": "Democratic presidential nominee Joe Biden has called for higher capital gains taxes for upper-income people. (Photo: MarketWatch photo illustration/Getty Images, iStockphoto) Now that the DNC and RNC conventions are over, and the presidential campaigns of Joe Biden and Donald Trump are rolling full steam ahead. One important issue will be taxes. Former Vice President Joe Biden has proposed a new offshoring tax penalty, which would establish a 28% corporate tax rate, plus a 10% \"offshoring penalty surtax,\" on profits of any production by a U.S. company overseas for sales back to the U.S., according to a campaign email. The current tax rate on such profits is 30.8%. He's also proposing a 10% tax credit for companies making investments to create jobs for American workers, such as by revitalizing existing closed or closing facilities. In addition, he proposes a 21% minimum tax on all foreign earnings. See also: Biden's 401(k) plan: Changing tax incentive for retirement is a great idea Here are the most important federal tax changes proposed by the Democratic nominee Joe Biden: Key point: Specifics about Biden's tax-change proposals are not fully fleshed out at this point, and what you see here may only be the proverbial tip of the iceberg if the Democrats take total control in the November general election.  Tax Guy looked at descriptions of Biden's tax proposals by the Committee for a Responsible Federal Budget, a center-right-leaning nonpartisan nonprofit, and The Motley Fool, a financial-advice website. According to the Committee for a Responsible Federal Budget, an independent, non-profit, bipartisan public-policy organization based in Washington, D.C. that examines federal budget and fiscal issues, Biden's tax plan would raise $3.35 trillion to $3.67 trillion over a decade if enacted in full starting next year, or 1.3% to 1.4% of gross domestic product. \"The Biden tax plan is highly progressive, increasing taxes for the top 1% of earners by 13% to 18% of after-tax income, while indirectly increasing taxes for most other groups by 0.2% to 0.6%,\" the committee said, adding, \"The ultimate fiscal, economic, and distributional impact of Vice President Biden's tax policies will depend on how newly raised revenue is spent or allocated.\" \"Major proposals by the Biden campaign would raise $1.6 trillion to $1.9 trillion over a decade from corporations, $1 trillion to $1.2 trillion from high earners through the income tax, and $800 billion to $1 trillion from Social Security payroll taxes on high-wage earners. Biden also supports a fee on banks, which we believe will raise $100 billion, tax credits for renters and first-time homebuyers that we estimate will cost $300 billion, and an increase of the Child and Dependent Care Tax Credit, which we estimate will cost $100 billion.\" Last month, Biden told ABC News: \"I will raise taxes for anybody making over $400,000. The very wealthy should pay a fair share. Corporations should pay a fair share. The fact is there are corporations making close to a trillion dollars that pay no tax at all.\" He told the network that his administration would not raise taxes on \"90% of the businesses out there are mom and pop businesses that employ less than 50 people.\" He said the coronavirus pandemic has taken a toll on these businesses. \"We have to provide them with the ability to reopen. We have to provide more help for them, not less help,\" he added. Here's a breakdown: Increased child and dependent care credits Under current law, parents can collect a credit of up to $2,000 for each under-age-13 qualifying child. This is a refundable credit, which means you don't have to have any federal income tax liability to collect the credit. Under current law, a tax credit of up to $2,100 is allowed to cover expenses to care for a qualifying dependent, including an eligible child, or up to $4,200 for expenses to care for two or more qualifying dependents. In most cases, however, an income limitation reduces the maximum allowable credit to $1,200 or $2,400 for two or more qualifying dependents.  The Biden tax plan would increase the maximum refundable child credit to $4,000 for one qualifying child or $8,000 for two or more qualifying children. Families making between $125,000 and $400,000 would receive reduced credits. Apparently, the same rules would apply to an enhanced credit for expenses to care for qualifying dependents. Biden would also establish a new credit of up to $5,000 for informal caregivers.   New credits for homebuyers and renters The Biden plan would create a new refundable tax credit of up to $15,000 for eligible first-time homebuyers. The credit could be collected when a home is purchased, rather than later at tax-return filing time. Biden would also establish a new refundable tax credit for low-income renters. The credit would be intended to hold rent and utility payments to 30% of monthly income. Observation: For years, I've complained about the fact that homeowners get big tax breaks while renters get nothing.  Higher corporate tax rate One of the biggest changes in the 2017 Tax Cuts and Jobs Act (TCJA) was the installation of a flat 21% corporate federal income tax rate for 2018 and beyond. Before the TCJA, the maximum effective rate for profitable corporations was 35%. The Biden plan would increase the corporate tax rate to 28%. This change would raise an estimated $1.1 trillion or so over 10 years. New corporate minimum tax The Biden plan would impose a new 15% minimum tax on corporations with at least $100 million in annual income that pay little or no federal income tax under the \"regular rules.\" An affected corporation would pay the greater of: (1) the \"regular\" federal income tax bill or (2) 15% of reported book net income. This new tax would raise an estimated $160 billion to $320 billion over 10 years.  New financial risk fee for financial institutions Biden would introduce a so-called financial risk fee on banks, bank holding companies, and non-bank financial institutions with more than $50 billion in assets. The fee would be based on an institution's covered liabilities and would provide the Federal Deposit Insurance Corporation (FDIC) with a pool of funds to pay for FDIC-insured deposits held in failed institutions.'Green energy' tax changes Biden would reinstate or expand tax incentives intended to reduce carbon emissions - such as deductions for emission-reducing investments in residential and commercial buildings and restored credits for buying electric vehicles produced by manufacturers whose credits have been phased-out under current law. Biden would also eliminate federal income tax deductions for oil and gas drilling costs and depletion.Higher maximum individual tax rate Biden would raise the top individual rate on ordinary income and net short-term capital gains back to 39.6%, the top rate that was in effect before the Tax Cuts and Jobs Act (TCJA) lowered it to 37% for 2018-2025. Biden has stated that he would not increase taxes for those who make under $400,000 per year. It's unclear whether that pertains to taxable income, gross income, or adjusted gross income. It's not yet specified if the $400,000 threshold would apply equally to singles, heads of households, and married joint-filing couples.Limit on tax savings from itemized deductions Biden would limit the tax benefit of itemized deductions to 28% for upper-income individuals. In other words, each dollar of allowable itemized deductions could not lower your federal income tax bill by more than 28 cents, even if you are in the proposed 39.6% maximum tax bracket. For upper-income individuals, Biden would reinstate the pre-TCJA rule that reduces total allowable itemized deductions above the applicable income threshold. Allowable deductions are reduced by 3 cents for every dollar of income above the threshold. Biden would eliminate the TCJA's $10,000 cap on itemized deductions for state and local taxes. This limitation mainly affects upper-income residents of high-tax states. Higher maximum tax rate on individual long-term capital gains Wealthier households would also face higher capital gains taxes under the Biden plan. Under current law, the maximum effective federal income tax rate on net long-term capital gains and qualified dividends recognized by individual taxpayers is 23.8%. That rate is comprised of the advertised 20% top rate plus another 3.8% for the unadvertised net investment income tax (NIIT). Under the Biden plan, net long-term gains (and presumably dividends) collected by those with incomes above $1 million would be taxed at the same 39.6% maximum rate that would apply to ordinary income and net short-term capital gains. With the 3.8% NIIT add-on, the maximum effective rate on net long-term gains would 43.4% (39.6% plus 3.8%). That would be almost double the current maximum effective rate of 23.8%. Higher Social Security taxes for upper-income individuals Under current law, the 12.4% Social Security tax hits the first $137,700 of 2020 wages or net self-employment income. Employees pay 6.2% via withholding from paychecks, and employers pay the remaining 6.2%. Self-employed individuals pay the entire 12.4% out of their own pockets via the self-employment (SE) tax. For 2020, the 12.4% Social Security tax cuts out once 2020 wages or net SE income exceed the $137,700 ceiling. For 2021 and beyond, the Social Security tax ceiling will be adjusted annually to account for inflation. The Biden tax plan would restart the 12.4% Social Security tax on wages and net SE income above $400,000. This is the so-called doughnut hole approach to increasing the Social Security tax. Over the years, the doughnut hole would gradually close as the lower edge of the hole is adjusted upward for inflation, while the $400,000 upper edge of the hole remains static. This change in the Social Security tax regime would raise an estimated $800 billion to $1 trillion over 10 years.Elimination of basis step-up for inherited assets Under current law, the federal income tax basis of an inherited capital-gain asset is stepped up fair market value as of the decedent's date of death. So, if heirs sell inherited capital-gain assets, they only owe federal capital gains tax on the post-death appreciation, if any. This provision can be a huge tax-saver when we are talking about a greatly-appreciated inherited asset - such as a personal residence that was acquired many years ago for next to nothing and is now worth millions. The Biden plan would eliminate this tax-saving provision. Key question: Would Biden also lower the unified federal gift and estate tax exemption, currently set at $11.58 million and/or increase the gift and estate tax rate, currently set at a flat 40%? Unknown, but it's unlikely that the current taxpayer-friendly federal estate and gift tax regime would be left untouched. For what could be in store, see this previous Tax Guy.Elimination of real estate tax breaks The Biden tax plan would: (1) eliminate the $25,000 exemption from the passive loss rules for rental real estate losses incurred by middle-income individuals, (2) eliminate Section 1031 like-kind exchanges that allow deferral of capital gains taxes on swaps of appreciated real property, (3) eliminate rules that allow faster depreciation write-offs for certain real property, and (4) eliminate qualified business income (QBI) deductions for profitable rental real estate activities.   Enhanced QBI deduction   For 2018-2025, current law allows an eligible individual taxpayer to claim a deduction for up to 20% of qualified business income (QBI) from a sole proprietorship, LLC, partnership, or S corporation. However, the QBI deduction is phased out at higher income levels. Under current law, phase-out for 2020 begins once taxable income (calculated before any QBI deduction) exceeds $163,300 for an unmarried individual or $326,600 for a married joint-filing couple. Other limitations apply in specific circumstances. Biden's plan would simplify matters by limiting QBI deductions only for individuals who earn more than $400,000. Key point: As stated above, the Biden plan would eliminate QBI deductions for rental real estate activities. "}]}