{"article": [{"url": "https://www.marketwatch.com/story/democrats-are-making-a-renewed-push-to-bring-back-the-600-unemployment-benefit-11601412769", "published": 1601544140.0, "headline": "Democrats are pushing for another round of stimulus checks and $600 in weekly unemployment benefits", "body": "House Democrats unveiled a scaled-down version of the HEROES Act which calls for extending the $600 weekly unemployment benefit that expired in July. (Photo by BRIDGET BENNETT/AFP via Getty Images) bridget bennett/Agence France-Presse/Getty Images House Democrats are making another push to provide a fresh round of federally-funded unemployment benefits to replace the $600-a-week benefit that expired in July. On Monday, Democrats unveiled a scaled-down version of the HEROES Act, their proposed stimulus package that passed in the House in May. Originally the package had a $3 trillion price tag. The revised version would cost $2.2 trillion. It calls for extending the $600 weekly benefit through Jan. 2021 and a second round of $1,200 direct payments to households, both of which were included in the prior version of the HEROES Act, and were part of the CARES Act passed in March. The new version also includes $436 billion in aid to state, local and tribal governments, down from $1 trillion in the Democrats’ prior proposal; a renewed Paycheck Protection Program with easier loan terms for small businesses; and $225 billion for schools and colleges to deal with the pandemic. But even with some cut corners, the revised HEROES Act costs $1.7 trillion more than the stimulus package Senate Republicans unveiled in July. That proposal, dubbed the HEALS Act, called for implementing supplemental weekly unemployment benefits that would be the equivalent of 70% of a workers’ prior wages, capped at $500. Related: COVID-19 stimulus talks could still get off the ground as end of runway nears Last month’s better-than-expected jobs report — which showed that the U.S. economy regained 1.4 million jobs, pushing the unemployment rate to 8.4% from 10.2% — led some analysts to believe that another stimulus package with enhanced unemployment benefits was not likely to move forward. But the tides could change this Friday when September’s unemployment report is released. Economists polled by MarketWatch expect it to show a relative slowdown in hiring compared to last month. That could direct more attention toward enhanced unemployment benefits, said Michele Evermore, a senior policy analyst at the National Employment Law Project, an advocacy organization focused on workers’ rights. Some unemployed workers have recently been receiving an extra $300 in unemployment benefits funded by a $44 billion FEMA disaster relief fund, but that money is nearing depletion, with just $2.5 billion remaining as of Tuesday. The $300 add-on benefit resulted from an executive order President Donald Trump signed in August after Congress failed to replace the $600-a-week unemployment benefit when negotiations over a next-phase coronavirus relief package broke down. Unlike the $600 enhanced unemployment benefit, which all unemployment beneficiaries were eligible for, approximately 1 million unemployed Americans have been ineligible for the $300 add-on because they don’t already receive $100 a week in unemployment benefits, which was a required threshold to receive the $300. House Speaker Nancy Pelosi, Treasury Secretary Steven Mnuchin and White House Chief of Staff Mark Meadows all signaled on Tuesday that some progress has been made on a second stimulus package. But there is likely a ways to go before the two parties reach a full-fledged agreement before lawmakers vacate Capitol Hill ahead of the Nov. 3 election. In the event that an agreement is reached, Evermore said the next stimulus package is “very likely to include at least a substantial unemployment insurance provision.”The case for bringing back the $600 benefit Reviving the $600 enhanced unemployment benefit “still makes sense,” Evermore said. Also see: How COVID-19 may have changed Americans’ views on unemployment benefits and health care — in an election year Members of the Trump administration had argued that the extra $600 benefit discouraged unemployed people from seeking new jobs. But some research suggests that’s not the case. “We have no data showing a disincentive effect and we are starting to see COVID numbers start to tick back up,” Evermore said. Reintroducing the $600 benefit now would give people the “economic power they need to be able to make the best decision about whether to return to work or not,” Evermore added. Additionally, as temperatures begin to drop in many parts of the country, outdoor dining may no longer be a viable option. That could result in a resurgence of layoffs in the restaurant industry, Evermore told MarketWatch. “The economy is changing fast, [the $600 unemployment benefit] could help them adapt,” she said."}]}