{"article": [{"url": "https://www.marketwatch.com/story/cannabis-stocks-get-a-broad-boost-after-veep-candidate-kamala-harris-said-biden-administration-would-decriminalize-marijuana-11602170817", "published": 1602175580.0, "headline": "Cannabis stocks get a big boost after veep-candidate Kamala Harris said Biden administration would decriminalize marijuana", "body": "Getty Images Shares of cannabis companies enjoyed a broad rally Thursday, amid growing hopes of federal decriminalization following comments from vice-presidential candidate Sen. Kamala Harris. “[W]e will decriminalize marijuana, and we will expunge the records of those how have been convicted of marijuana,” Harris said in the vice-presidential debate late Wednesday. The Cannabis ETF THCX, +3.21% shot up 7.4% to close at a three-week high of $9.32. It has run up 15.2% since closing at a four-month low two weeks ago. Among some of the ETF’s more active components, the U.S.-listed shares of Aurora Cannabis Inc. ACB, -1.37% ACB, -2.08% shot up 10.6%, Aphria Inc. APHA, +1.41% APHA, +0.53% jumped 10.3%, Canopy Growth Corp. CGC, +2.49% WEED, +1.80% climbed soared 13.5% and Tilray Inc. TLRY, -1.78% ran up 18.3%. Shares of Corona beer brewer Constellation Brands Inc. STZ, +0.81%, which has made a large investment in Canopy Growth, tacked on 2.0%. The likelihood of former-Vice President Joe Biden winning the presidential election next month has increased recently, after the latest polls showed Biden widening his lead over President Trump. Don’t miss: President Trump loses big edge over Biden on the economy as election looms. Also read: Here’s how Trump’s positive coronavirus test has shaken up the campaign — plus what could happen next. Elsewhere, shares of Cronos Group Inc. CRON, -1.88% CRON, -1.95% rallied 10.0%, Curaleaf Holdings Inc. CURLF, +6.03% CURA, +5.16% surged 10.5%, OrganiGram Holdings Inc. OGI, -3.96% hiked up 11.5% and Trulieve Cannabis Corp. TCNNF, +0.28% TRUL, -0.42% advanced 6.8%. The Cannabis ETF has still tumbled 25.7% year to date, while the S&P 500 index SPX, +0.87% has gained 6.7%."}]}