{"article": [{"url": "https://www.marketwatch.com/story/walmart-surpasses-ebay-in-us-e-commerce-for-the-first-time-amazon-still-tops-emarketer-2020-06-15", "published": 1592306120.0, "headline": "Walmart surpasses eBay in U.S. e-commerce for the first time, Amazon still tops: eMarketer", "body": "Walmart Inc. has surpassed eBay Inc. in share of U.S. e-commerce sales for the first time, according to May 2020 data provided by eMarketer, though Amazon.com Inc. remains number one by a large margin. Amazon AMZN, +3.01% tops the list with 38.0% of all U.S. e-commerce sales share, followed by Walmart WMT, +1.00% with 5.8% and eBay EBAY, +6.47% with 4.5%. Apple Inc. AAPL, +1.74% (3.5%) and Home Depot Inc. HD, +0.49% (1.9%) round out the top five. “Amazon will increase its e-commerce market share to 38.0% and extend its reign of dominance,” said Andrew Lipsman, eMarketer principal analyst also with Insider Intelligence, in a statement. “But big-box retailers are leveraging their click-and-collect models to accelerate their e-commerce businesses.” See:More consumers are willing to head back to stores than dine out at restaurants, S&P Global finds These big box retailers include Target Corp. TGT, +1.14% and Costco Wholesale Corp. COST, +1.19% , which are both also in the top 10. Retail sales increased a record 17.7% in May, though there was still a 6% year-over-year decline. E-commerce sales in 2020 will climb 18%, higher than the previous forecast for 13% growth, according to eMarketer estimates, although retail sales overall are expected to drop 10.5% to $4.894 trillion. Both outcomes are the result of the coronavirus, which forced stores to close and consumers to social distance, shifting shopping activity to necessities and other categories in line with spending more time at home. “The U.S. retail sector could take years to recover from the impact of the coronavirus, and the hit could be worse than that of the Great Recession,” eMarketer wrote in a June report, with one analysts saying it will be years before consumer activity levels bounce back. Retail sales dropped 8.2% in 2009. In 2019, retail sales totaled $5.465 billion. Watch: Here’s how the global supply chain may change after COVID-19 E-commerce is expected to reach $709.78 billion this year, eMarketer said. Food and beverage is the top growth category, expected to grow 58.5%. Apparel and accessories is expected to increase 8.6%. “Certain e-commerce behaviors like online grocery shopping and click-and-collect have permanently catapulted three or four years into the future in just three or four months,” said Lipsman. This continues a trend that ramped up sharply and quickly as COVID-19 spread and lockdowns began, accelerating the move to online shopping that began before the pandemic. The latest Adobe Inc. ADBE, +2.30% data shows e-commerce sales in May reaching $82.5 billion, up 77.8% year-over-year. “Compared to pre-pandemic sales for the period, online transactions were $52 billion higher than expected for the period, with e-commerce levels tracking higher than shopping holiday levels on Black Friday and Cyber Monday,” according to the Adobe report. Online Memorial Day sales reached a record $3.5 billion. Buy-online-pickup-in-store (BOPIS) grew 195% for the month, though the pace of growth is slowing, Adobe said. Don’t miss:Lululemon Athletica is the top publicly traded specialty retailer, says Susquehanna “With consumers now having had three months to adjust to ‘the new normal’, we are seeing signs that online purchasing trends formed during the pandemic may see permanent adoption, said Taylor Schreiner, director at Adobe Digital Insights. “While BOPIS was a niche delivery option pre-pandemic, it is fast becoming the delivery method of choice as consumers become more familiar with the ease, convenience and experience BOPIS offers.” After weeks of elevated online sales, e-commerce fraud protection company Signifyd says its data is showing sales settling into new spending patterns even as they remain up year-over-year. For instance, online spending between June 2 and June 8 was down 8% week-over-week, but up 30% year-over-year. “While plenty goes into shifts in consumer spending, it will be interesting to see, as in-store shopping becomes more accessible, whether awkward COVID-19 shopping experiences will drive consumers back to online options for more purchases,” wrote Signifyd’s Mike Cassidy, who lists his title as “lead storyteller.” Retailers have been reopening stores with rules and suggestions for social distancing, limiting store capacity, wearing masks and other measures. The SPDR S&P Retail ETF XRT, +0.05% has fallen 7% for the year to date, the Amplify Online Retail ETF IBUY, +1.39% has gained 31.4% and the S&P 500 index SPX, +0.87% is down 3.8%."}]}