{"article": [{"url": "https://www.marketwatch.com/story/double-dip-recession-chances-significant-ex-cbo-chiefs-say-citing-policymaking-malpractice-11598633394", "published": 1598619440.0, "headline": "Double-dip recession chances significant, ex-CBO chiefs say, citing â\u0080\u0098policymaking malpracticeâ\u0080\u0099", "body": "A sign identifies the offices of the nonpartisan Congressional Budget Office in the Ford House Office Building in Washington, 13 March 2017. (EPA/JIM LO SCALZO Published Credit: Jim Lo Scalzo/European Pressphoto Agency) The chances the U.S. economy falls into a second recession, the so-called double-dip scenario, without another big fiscal stimulus package, are significant, the two most recent former chiefs of the nonpartisan Congressional Budget Office say. Douglas Elmendorf and Keith Hall, the first appointed when Democrats held Congress and the second when Republicans held the reigns, said lawmakers and the White House should take another stab at an aid package. That view was also held by Doug Holtz-Eakin, another former CBO chief who was more skeptical, though, of the possibility of a double-dip recession. â\u0080\u009cI think itâ\u0080\u0099s appalling that we donâ\u0080\u0099t have a second round fiscal stimulus, so Iâ\u0080\u0099m happy to be quoted to that effect,â\u0080\u009d Elmendotrf said. â\u0080\u009cIt was clear months ago that there should be another substantial boost to follow the CARES Act. I think it is policymaking malpractice that the president and the Congress have not put through another substantial fiscal bill.â\u0080\u009d Without another stimulus package, Elmendorf put the chances of a double-dip recession at one in four. Hall, who was CBO director from 2015 to 2019, said the risk of a second recession was â\u0080\u009csignificant.â\u0080\u009d The warnings came as many economic indicators have bounced off of lows seen in the immediate aftermath of the coronavirus pandemic onset and the ensuing lockdown in the first half of 2020. But that bounceback was credited in part to the quick and robust reaction by the government in putting together the CARES Act, a $1.7 trillion bill passed in late March that sent direct payments to households, gave jobless workers an extra $600 on top of their stateâ\u0080\u0099s unemployment benefits, and provided forgivable loans to businesses that temporarily furloughed their employees instead of laying them off. But many of the measures in that law have run their course, including the federal unemployment add-on payment and the small business support program. In the meantime, House Democrats, the White House and Senate Republicans have been unable to come to agreement on a second big package, despite near-unanimity on the need for one. The CBO is Congressâ\u0080\u0099 official scorekeeper on how much bills will cost. The agencyâ\u0080\u0099s directors are often called upon by lawmakers to provide input on policy options theyâ\u0080\u0099re looking at and they have a deep understanding of both the economy and how Congress works. During their tenures, they usually try to avoid the appearance of taking sides, a restraint that disappears after they leave the agency. Holtz-Eakin, who headed the CBO from 2003 to 2005 and was appointed by Republicans, doubted a second recession was likely in the absence of another aid deal, putting the odds of one beginning in the current quarter at 1%. Households, in Holtz-Eakinâ\u0080\u0099s view, remain in good financial shape overall and have continued to spend, despite everything. â\u0080\u009cLook at the real time data, credit card spending, things like that, theyâ\u0080\u0099re at worst flattening out in July and then picking back up a little bit in August,â\u0080\u009d he said. â\u0080\u009cI donâ\u0080\u0099t think thereâ\u0080\u0099s real risk right now. It would be foolhardy to say that we faced no risk of a double dip ever,â\u0080\u009d Holtz-Eakin said. â\u0080\u009cWeâ\u0080\u0099ve already seen a recent decline in consumer confidence. If that gets compounded by a real decline in the growth of personal income, then yeah, you could imagine it, but not right now.â\u0080\u009d Hall, who also headed the Bureau of Labor Statistics during the 2007-2009 Great Recession, said he was looking at job market indicators, like next weekâ\u0080\u0099s monthly payrolls report. While much of the bounceback in unemployment in recent months has been among people temporarily furloughed, a positive sign, the increase in the duration of joblessness is worrisome, Hall said. â\u0080\u009cWeâ\u0080\u0099re now sitting at almost 20 million people who have now been unemployed for five weeks or more. And those are the folks that are in the biggest danger of turning permanent,â\u0080\u009d he said. All three of the ex-CBO chiefs said another package was needed, though they differed somewhat in their policy prescriptions and timelines. Elmendorf said a bigger danger than a double dip was the economy simply drifted sideways in lieu of more aid. He reiterated proposals he made at an early June House Budget Committee meeting for a federal add-on to jobless payments, more money to state and local governments and help for businesses to keep workers, though the best form of that aid was unclear. He also upped his recommended package size. In June, he said a package of more than a trillion dollars was warranted. â\u0080\u009cThe situation with the virus has improved less than I expected in June, therefore I think a larger stimulus is justified and I would support a somewhat larger unemployment benefit,â\u0080\u009d he said. In June, Elmendorf had suggested capping the add-on amount at $300. Hall said the focus should be on things to support households, like the enhanced jobless benefits and direct payments to households. â\u0080\u009cBecause the big challenge, of course, now is weâ\u0080\u0099ve lost big demand. We have a big demand gap here and we need to support demand for the economy until things get back,â\u0080\u009d he said. But he added the measures should be limited in time to help keep them from becoming too expensive. In contrast, Holtz-Eakin said he was looking at things to boost the economy further out than the next few months. His suggestion: an infrastructure bill. â\u0080\u009cWorry now about 2021 and pass an infrastucture bill that you would pass in the absence of a pandemic,â\u0080\u009d he said. â\u0080\u009cThat will kick in in in 2021, 2022, and 2023. That will cement, I think, the recovery.â\u0080\u009d He also said the jobless benefit add-on should be reduced from the $600 in the CARES Act and phase out and Congress should pass a tax credit for businesses and non-profits to modify their workplaces to make them safer and ease worries about returning to work. Both sides have engaged in â\u0080\u009cmagical thinkingâ\u0080\u009d in their responses, Holtz-Eakin said. â\u0080\u009cThe magical thinking on the conservative side is that weâ\u0080\u0099ll just get a vaccine and our problems are solved and the magical thinking on the Democratic side is that thereâ\u0080\u0099s a $600 UI or a check you can send and weâ\u0080\u0099ll all be good. Thatâ\u0080\u0099s just not true.â\u0080\u009d Despite their differences in what to do, all three of the ex-directors also said the people bearing the brunt of economic harm so far have been lower-income wage laborers, those often without much capital to fall back on. Holtz-Eakin said that was because services spending, as opposed to outlays for goods, was most dramatically hit by the lockdown. Elmendorf said the issue needs to be looked at ahead. â\u0080\u009cItâ\u0080\u0099s really stunning that we have some of the highest unemployment rates weâ\u0080\u0099ve seen in this country since the Great Depression and we have the highest stock prices weâ\u0080\u0099ve seen in this country,â\u0080\u009d he said. â\u0080\u009cThere could not be a more vivid illustration of the way our economy is serving some people much more than others.â\u0080\u009d"}]}