{"article": [{"url": "https://www.marketwatch.com/story/as-covid-19-cases-surge-wisconsin-is-opening-a-field-hospital-at-state-fairgrounds-01602097615", "published": 1602083660.0, "headline": "As COVID-19 cases surge, Wisconsin is opening a field hospital at state fairgrounds", "body": "Wisconsin Gov. Tony Evers speaks during a news conference in Kenosha, Wis., in August. AP Photo/Morry Gash MADISON, Wis. (AP) — Wisconsin health officials announced Wednesday that a field hospital is opening in the coming days at the state fairgrounds near Milwaukee as a surge in COVID-19 cases threatens to overwhelm hospitals. Wisconsin has become a hot spot for the disease over the last month, ranking third nationwide this week in daily new cases per capita. Health experts have attributed the spike to the reopening of colleges and K-12 schools as well as general fatigue over wearing masks and socially distancing. Democratic Gov. Tony Evers’ office said in a statement that the facility will open for patients within the next week. “We hoped this day wouldn’t come, but unfortunately, Wisconsin is in a much different, more dire place today and our healthcare systems are beginning to become overwhelmed by the surge of COVID-19 cases,” Evers said in the statement. “This alternative care facility will take some of the pressure off our healthcare facilities while expanding the continuum of care for folks who have COVID-19.” The move also came as a state judge was considering a lawsuit seeking to strike down Evers’ mandate that masks be worn in enclosed public spaces. Only 16% of the state’s 11,452 hospital beds were available as of Tuesday afternoon, according to the state Department of Health Services. The number of hospitalized COVID-19 patients had grown to 853, it’s highest during the pandemic according to the COVID Tracking Project, with 216 in intensive care. Results of COVID-19 tests on an additional 262 in-patients in Wisconsin were pending. The southeastern region of the state had 250 COVID-19 patients, the most of any of the state’s seven hospital regions. Nationwide, about 30,000 coronavirus patients are hospitalized, the COVID Tracking Project reported. Virus spread is also bad in northeastern Wisconsin. The Green Bay Packers announced this week that no home fans would be admitted to home games until the situation improved, and head coach Matt LaFleur asked area residents to wear masks and practice social distancing. The U.S. Army Corps of Engineers built a 530-bed field hospital on the state fairgrounds in West Allis just outside Milwaukee in April at the request of Evers’ administration. Local leaders had warned about the possibility of area hospitals being overwhelmed, but hospitalizations never reached the point where the hospital was needed, until now. The hospital will accept patients from across Wisconsin but is designed to provide low-level care, and it will accept only patients who have already been hospitalized elsewhere for at least 24 to 48 hours, according to the state Department of Administration. Patients who qualify will be transported to the facility by ambulance. The facility will not accept walk-ins. “The goal of this facility is to transition COVID-19 patients who are less ill out of hospitals and reserve hospital beds for patients who are more ill and in need of hospital-level care,” Evers’ office said. The hospital will be staffed by volunteers, state workers and National Guard members, DOA officials said. Patients will not be allowed to have visitors. Several other states moved to set up field hospitals in the early stages of the pandemic — at great expense — only to find that they got little to no use, and many were shut down."}]}