{"article": [{"url": "https://www.marketwatch.com/story/world-health-organization-creates-independent-panel-to-provide-an-honest-assessment-of-the-worlds-response-to-covid-19-2020-07-09", "published": 1594294100.0, "headline": "World Health Organization creates independent panel to provide an â\u0080\u0098honest assessmentâ\u0080\u0099 of the worldâ\u0080\u0099s response to COVID-19", "body": "GENEVA (AP) â\u0080\u0094 The head of the World Health Organization said Thursday that former Liberian President Ellen Johnson Sirleaf and former New Zealand Prime Minister Helen Clark will head a new panel tasked with giving â\u0080\u009can honest assessmentâ\u0080\u009d of the global response to the coronavirus pandemic. WHO Director-General Tedros Adhanom Ghebreyesus, whose agency is facing a U.S. pullout following Trump administration complaints about its early handling of the virus emergency, announced the appointments to the newly created Independent Panel for Pandemic Preparedness and Response. â\u0080\u009cI cannot imagine two more strong-minded, independent leaders to help guide us through this critical learning process to help us understand what happened â\u0080\u0094 an honest assessment â\u0080\u0094 and to help us understand also what we should do to prevent such a tragedy in the future,â\u0080\u009d Tedros said. The WHO chief reiterated his calls for global unity and decried a general lack of leadership, but he made no reference to the Trump administration giving formal 1-year notice this week of its intent to withdraw the United States from the U.N. health agency. The United States is the WHOâ\u0080\u0099s biggest donor, contributing $400-$500 million annually in recent years. â\u0080\u009cMy friends, make no mistake: The greatest threat we face now is not the virus itself. Rather, itâ\u0080\u0099s the lack of leadership and solidarity at the global and national levels,â\u0080\u009d Tedros said at a weekly meeting of member states, which unusually was made public for the announcement of the panel appointments. He said he would convene a special meeting of the WHOâ\u0080\u0099s executive board in September, before hosting the assembly of its 194 member states in November. The World Health Assembly, usually held in May, was cut short and held online this year due to the pandemic. â\u0080\u009cWe must be readying ourselves for future global outbreaks and the many other challenges of our time, such as anti-microbial resistance, inequality and the climate crisis,â\u0080\u009d Tedros said. â\u0080\u009cCOVID-19 has taken so much from us. But itâ\u0080\u0099s also giving us an opportunity to break with the past - and build back better.â\u0080\u009d The assembly in May called for a comprehensive evaluation of the WHOâ\u0080\u0099s and the worldâ\u0080\u0099s response to the outbreak, and after repeated Trump administration criticism of the U.N. health agency over its handling of the pandemic and alleged deference to China, where COVID-19 first emerged. Tedros suggested the panel would have an independent administration, update member states regularly on its progress and hold monthly meetings. â\u0080\u009cThis cannot be another blue-ribbon panel that issues a report that goes up on the bookshelf,â\u0080\u009d he said. â\u0080\u009cWe must come together in a global conversation to take these hard-won lessons and turn them into action.â\u0080\u009d â\u0080\u009cMy hope is that the defining crisis of our age will likewise remind all people that the best way forward and all the only way forward is together,â\u0080\u009d he said."}]}