{"article": [{"url": "https://www.marketwatch.com/story/retired-102-year-old-chicago-teacher-dons-hazmat-suit-to-cast-her-ballot-by-mail-2020-10-05", "published": 1602063920.0, "headline": "Retired 102-year-old Chicago teacher dons hazmat suit to cast her ballot by mail", "body": "A 102-year-old former Chicago teacher donned an unconventional outfit to cast her vote Thursday — a pink-and-white hazmat suit. A picture on the Chicago Teachers Union’s Twitter account captured the moment Beatrice Lumpkin dropped her mail-in ballot into a mailbox: “Good morning! This is 102-year-old CTU retiree Bea Lumpkin casting her vote-by-mail ballot,” the union wrote. iframe.twitter-tweet { width: 100% !important; } “If Bea can do it, anyone can do it. Vote!” The longtime Chicago teacher was surrounded by fellow Chicago Teachers Union members as she fulfilled her civic duty, according to Fox News. “Bea is truly universally beloved in our union, where she remains an active and dedicated retiree who shows up at as many picket lines and union events as she can, and remains very active in our work, plus writes occasionally for our monthly member publication, Chicago Union Teacher, most recently on the desperate need to address climate change,” a spokesman for the CTU told the network. Lumpkin, despite her age, remains active in the union and, until the pandemic hit, regularly attended protests along with her fellow members — in March 2019, CTU posted a video on Facebook of her at the age of 100, protesting at the Chicago International Charter School headquarters. According to the US Census Bureau, people who are 65 and over are more likely to vote. Of Americans who are 65 and over, 71% showed up to the polls in 2016 while only 46% of Americans 18 to 64 turned out to the polls. From the archives (November 2018):Midterm voter turnout was highest in a century — but U.S. won’t be confused with Australia any time soon A version of this story previously appeared at NYPost.com. |"}]}