{"article": [{"url": "https://www.marketwatch.com/story/why-gold-may-continue-to-rally-as-long-as-us-stocks-do-2020-06-24", "published": 1592990780.0, "headline": "Why gold may continue to rally - as long as U.S. stocks do", "body": "The tech-heavy Nasdaq COMP, +1.39%  keeps setting new records, and gold is GC00, +2.17%  on a roll, closing at its highest level since 2012. That is not the typical correlation, but then these aren't typical times. Chris Weston, head of research at Australian broker Pepperstone, says the same underlying reason is driving both - the U.S. bond market. It isn't easy to see in the price action, and the 10-year yield TMUBMUSD10Y, 0.777%  barely budged on Tuesday. The movement is in real, or inflation-adjusted terms, as the yield on the Treasury Inflation-Protected Securities, or TIPS, heads into ever deeper negative territory. Gold is viewed by the market as a zero-coupon bond, so when inflation-adjusted Treasury yields head lower, the relative attractiveness of gold increases, Weston points out. Over two years, 90% of the variance in gold can be explained by the inflation-adjusted U.S. Treasury, he says. At the same time, speculative interest in gold is slightly below average, according to Commodity Futures Trading Commission positioning data. He does concede the cumulative money flow into gold exchange-traded funds is moving progressively higher. He is bullish on gold - $1796 is his next target - but he says the clear risk to gold is higher real yields and, oddly, a selloff in equities could hurt the yellow metal if it causes dollar DXY, -0.58%  strength. \"Until that time the path of least resistance is higher,\" he says. The buzz The recent spike in coronavirus cases was in the spotlight as the governor of Texas urged residents to stay home and let cities and counties impose stricter rules. The number of people currently hospitalized jumped by 5% on Tuesday, the biggest increase since April 14, according to data analyzed by Ian Shepherdson, chief economist at Pantheon Macroeconomics. The U.S. Trade Representative said it is considering tariffs on an additional $3.1 billion worth of goods from France, Germany, Spain, and the U.K. The potential tariffs relate to the long-simmering dispute between plane makers Boeing BA, -0.39%  and Airbus AIR, -0.20%. The New York Times separately reported the U.S. is considering reimposing tariffs on Canadian aluminum. The International Monetary Fund downgraded its view of the global economy this year. Computer maker Dell Technology DELL, -0.39%  is considering spinning off its $50 billion stake in cloud software firm VMware VMW, +0.81%, or buying the firm outright, according to The Wall Street Journal. Tax rules prevent a spinoff before September 2021. Major League Baseball issued a 60-game schedule Tuesday night, while Los Angeles Lakers guard Avery Bradley said he would sit out the shortened National Basketball Association season when it resumes. North Korea said on Wednesday leader Kim Jong Un suspended a planned military retaliation against South Korea. Sign up for Barron's Investing in Tech series, which on Wednesday will include Synchrony's chief executive discussing the future of payments. The markets U.S. stock futures ES00, +1.13%  YM00, +0.82%  were weaker on Wednesday, due to virus and tariff concerns. Gold turned lower, while oil futures CL.1, -1.62%  fell. The chart In its quarterly investor survey, RBC Capital Markets asked its participants to list what is keeping them up at night, either something that is getting them nervous or excited about the stock market. The election, the Federal Reserve and coronavirus top the list. Overall, the survey of 107 institutional investors found them increasingly bearish and a surge in those who say valuations are a problem, a new survey high. Cyclicals topped the list of what they are buying, followed by value stocks, while energy, \"expensive stocks\" and financials topped the list of what they are selling. Random reads The chief executive of plant-based foods maker Impossible Foods said his industry will completely replace animal meat in 15 years. Hundreds of thousands of unused kegs of Guinness beer have been repurposed to fertilize Christmas trees. A Saharan dust cloud will bring hazy skies and impressive sunsets to the U.S. Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. Be sure to check the Need to Know item. The emailed version will be sent out at about 7:30 a.m. Eastern."}]}