{"article": [{"url": "https://www.marketwatch.com/story/get-your-flu-shot-in-september-before-cases-start-to-climb-11597851877", "published": 1599556760.0, "headline": "Get your flu shot in September â\u0080\u0094 before cases start to climb", "body": "Reuters With the coronavirus still spreading widely, itâ\u0080\u0099s time to start thinking seriously about influenza, which typically spreads in fall and winter. A major flu outbreak would not onlyÂ overwhelm hospitalsÂ this fall and winter, but also likely overwhelm a person who might contract both at once. Doctors have no way of knowing yet what the effect of a dual diagnosis might be on a personâ\u0080\u0099s body, but they do know the havoc that theÂ flu alone can do to a personâ\u0080\u0099s body. And, we know the U.S. death toll of COVID-19 as of Aug. 17 wasÂ 170,000, and doctors are learning more each day about the effects of the disease on the body. Public health officials in the U.S. are thereforeÂ urging peopleÂ to get the flu vaccine, which is already being shipped in many areas to be ready for September vaccinations. Flu casesÂ are expected to start increasing early in October and could last late into May. This makesÂ September and early OctoberÂ the ideal time to get your flu shot. But thereâ\u0080\u0099s reason to be concerned that flu vaccination rates could be lower this year than in past years, even though the risk of getting seriously ill may be higher because of widespread circulation of the coronavirus. In an effort to avoid getting sick, millions of Americans avoided seeing their health-care provider the past few months. Social distancing and stay-at-home orders have resulted in a decreased use of routine medical preventive services such as vaccinations. Many employers that often provide the flu shot at no cost to employees are allowing employees to work from home, potentially limiting the number of people who will get theÂ flu shot at their jobs. As aÂ health-care professional, I urge everyone to get the flu vaccine in September. Please do not wait for flu cases to start to peak. The flu vaccine takesÂ up to two weeksÂ to reach peak effectiveness, so getting the vaccine in September will help provide the best protection as the flu increases in October and later in the season. Read: CDC director warns America is in for the â\u0080\u0098worst fall â\u0080¦ weâ\u0080\u0099ve ever hadâ\u0080\u0099 A lifesaver in previous years, but more so now Both COVID-19 and the flu are contagious respiratory illness that present withÂ similar symptoms. Both viruses can impact the elderly and those with certain chronic conditions, such as heart and lung disease, the hardest. Data on flu vaccination rates from 2018-2019 show that onlyÂ 49% of Americans six months of age and older received the flu vaccine. The vaccineâ\u0080\u0099s effectiveness varies each season, with early data from the 2019-2020 flu season indicating a vaccine effectiveness rate ofÂ 50%Â overall, andÂ 55%Â in youth. While some may think this effectiveness rate is low, the flu vaccine remains the single best way to prevent the flu and related complications. For example, during the 2018-2019 flu season, flu vaccination was estimated to preventÂ 4.4 million flu illnesses, 58,000 flu hospitalizations and 3,500 deaths. Early data from the 2019-2020 flu season estimates there wereÂ 39-56 million flu illnesses, 18-26 million flu-related medical visits, 410-740,000 hospitalizations and up to 62,000 deaths. Much of this disease burden is preventable from higher flu vaccination rates. It is now quite apparent that COVID-19 will still be circulating during flu season, which makes getting a flu vaccine more important than ever. As schools, our communities and our economy continue to reopen, it is vital to get the flu vaccine for personal, family and community protection. Severe cases of both COVID-19 and the flu require the same lifesaving medical equipment. This highlights the importance of getting the flu vaccine for not only your own personal health but also the health of your community. Receiving the flu vaccine will help reduce the burden of respiratory illness on our already very overstretched health-care system. By increasing flu vaccination rates, we can reduce the overall impact of respiratory illnesses on the population and hence lower the resulting burden on the health-care system during the COVID-19 pandemic. Because flu vaccination protects against one of these respiratory illnesses, theÂ CDC recommendsÂ everyone (with few exceptions) six months of age and older get an annual flu vaccine. While the flu vaccine will not protect you against COVID-19, the flu vaccine will reduce your risk of developing the flu as well as reduce your risks of flu-related complications including hospitalization and even death. While it may seem like there is so much out of our control during this pandemic, getting the flu vaccine, practicing proper hand washing, social distancing andÂ wearing face coveringsÂ are within our control and will protect not only you but also your family and community. If you are not getting the flu vaccine from your employer, think about alternative sources now. Vaccines should be available in most areas by Sept. 1. Call you doctorâ\u0080\u0099s office to ask how you can get a flu shot. Call your local public health department. Consider getting a vaccine while you are grocery shopping or picking up prescriptions. Mainly, make sure you take advantage of this potentially lifesaving vaccine. Get it on your calendar for early September now. And remember,Â the flu shot cannot give you the flu. Libby Richards is an associate professor of nursing at Purdue University in West Lafayette, Ind. This was first published by The Conversation â\u0080\u0094 â\u0080\u009cGetting a flu shot this year is more important than ever because ofÂ COVID-19â\u0080\u009d .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; margin-bottom: 5px; } .at16units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body.at12units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body .header .wsj-interactive.generic-iframe-embed[name=\"\"], body.at8units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body.at4units .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .header .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; }"}]}