{"article": [{"url": "https://www.marketwatch.com/story/the-danger-in-the-market-right-now-isyou-2020-09-09", "published": 1599908480.0, "headline": "The danger in the market right now isâ\u0080¦you", "body": "Take a few minutes to peruse the financial news online or tune into cable TV and you might end up with the investor equivalent of whiplash. Some stocks zoom to nosebleed highs, even as the economy unloads one bad headline after another. Meanwhile, thousands of inexperienced day traders armed with smartphones flood the market with orders, pushing up shares of companies with virtually no earnings, some of them literally bankrupt. All this activity and noise and to what end, the late John Bogle might ask. But itâ\u0080\u0099s when the party gets the loudest, the headlines the craziest, that the usually more sedate investor begins to pay attention. And thatâ\u0080\u0099s the danger. Legendary investor Sir John Templeton put it this way: â\u0080\u009cBull markets are born on pessimism, grown on skepticism, mature on optimism, and die on euphoria.â\u0080\u009d To a certain kind of investor these words sound like advice. Learn to read the crowd, some profess, and you can time your way in and out of the markets. Once the party gets roaring, jump to safety, modesty and wallet intact. But it was Warren Buffett who warned that while everyone has a plan to exit a raucous party, nobody has a clue as to exactly when. â\u0080\u009cThe giddy participants all plan to leave just seconds before midnight. Thereâ\u0080\u0099s a problem, though: They are dancing in a room in which the clocks have no hands,â\u0080\u009d Buffett told shareholders. Read: Investors should be wary of Warren Buffettâ\u0080\u0099s crash warning Say you manage to escape. Now the problem is deciding when to return. A lot of investors ran away in March near the bottom. How many of them only bought back in by June, well after the rebound? So letâ\u0080\u0099s take a step back. Why did the market go down? Why did it go back up? And what is likely to happen next? Read: Todayâ\u0080\u0099s older workers may see the first cuts to Social Security benefits We know why stocks fell so sharply back in February and March. The coronavirus itself was not a surprise. The whole world watched what was happening in China, then in Italy. The surprise was our own inept response when COVID inevitably crept to U.S. shores, followed by an unfortunately high body count and shutdowns of major parts of the economy. The virus has lingered and so have the shutdowns, now spreading to schools and pro sports as well as the everyday economy of restaurants, hotels and travel. Bad news for retail and transportation stocks. But good news for a raft of other types of companies, notably online meeting software makers and e-commerce stocks. Extraordinary government support has helped; doubts about aid continuing has some worried about another leg downward. Throw on top a chaotic national election season and itâ\u0080\u0099s easy to understand why Mr. and Mrs. 401(k) might suddenly be concerned about their holdings. Read: What has COVID-19 done to our retirement savings? Again, the danger is not the news. Itâ\u0080\u0099s not the shutdowns or the virus or even the political cycle. The danger comes from assigning too much importance to any of these things, and then taking action to try to â\u0080\u009cprotectâ\u0080\u009d your investments. The danger is reacting to short-term events as if they were permanent changes to how markets and the economy work over time. The danger is you. At some point in the relatively near future there will be one or two, maybe even multiple vaccines against COVID-19, rolling out around the world. Corporations will gear up for a steady return to business. The election will come and go. Think about that. Thatâ\u0080\u0099s six months away, maybe less. Would you change anything about your long-term investments because of a six-month window of relative uncertainty? Read: This is one Trump tax cut you really donâ\u0080\u0099t want If you are prudently invested in a wide selection of investments through a low-cost index fund, as many retirement investors are, what even would you sell or buy? Broad diversification is built to absorb shocks, but it also discourages rash choices made under pressure. Itâ\u0080\u0099s a feature, not a bug. Learning to manage your emotional responses to the news, even surprising news, is a huge part of successful long-term investing. This too shall pass."}]}