{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-remain-lower-after-mixed-data-on-durable-goods-orders-11601042627", "published": 1601056280.0, "headline": "Long-dated government bond yields post weekly slide as stocks run into turbulence", "body": "Treasury yields on Friday barely budged but longer-dated government debt posted weekly declines, and prices rose, as stocks faced headwinds centered on a lack of fresh coronavirus stimulus from Washington lawmakers, and jitters about the Nov. 3 presidential elections in the U.S. What are Treasurys doing? The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% fell 0.5 basis point to 0.659%, while the 2-year Treasury note yield TMUBMUSD02Y, 0.156% slipped 0.4 basis point to reach 0.131%. The 30-year Treasury bond yield TMUBMUSD30Y, 1.576% also was little changed, edging 0.4 basis point higher to 1.405%. Yields move in the opposite direction of bond prices. What’s driving the market? Rates for long-dated government bonds have been down three of the past four weeks, reflecting some persistent buying in assets considered havens over a period in which spiking cases of COVID-19 helped to spark a mini-flight to safety for government debt. Still, the moves failed to knock 10-year and 30-year Treasurys out of their longstanding ranges since August. A report on long-lasting goods saw yields edge somewhat lower on the day. Durable-goods orders rose 0.4% in August, compared with an average forecast for a 1.9% rise, according to a MarketWatch survey of economists. Core capital-goods orders, however, were stronger than expected, rising 1.8% versus expectations for a 1% increase. A modest pickup in demand for Treasurys also came as the U.S. dollar saw one of its steepest weekly gains versus a half-dozen rival currencies since April, as measured by the ICE U.S. Dollar Index DXY. Concerns about spiking COVID-19 cases in the U.S. and Europe have continued to rise, with a lack of another round of stimulus out of Washington adding to worries about the economic outlook. Fears of a contested U.S. presidential election between President Donald Trump and challenger former Vice President Joe Biden have also contributed to investor jitters, helping underpin demand for assets perceived as havens. House Democrats on Thursday were said to be preparing a $2.4 trillion aid package that includes a number of items seen having bipartisan support, including direct payments to households, the Paycheck Protection Program, a revival of a federal add-on to state unemployment benefits, as well as a renewal of aid to airlines and money to help restaurants stay open. But analysts said a path to an agreement on a spending program remained uncertain. What are analysts saying? “Ahead of the data, Treasuries were modestly bid and the curve incrementally flatter — the decided theme of late,” said Ian Lyngen, head of U.S. rates strategy at BMO Capital Markets. “From here, focus will be on the movements in risk assets as the weekend quickly approaches. The mixed data has left the market agnostic. We’re open to headline risk this afternoon — either political, stimulus, of pandemic related — another theme of sorts ,” he said, in a note."}]}