{"article": [{"url": "https://www.marketwatch.com/story/ges-stock-sinks-as-ceo-culp-cant-call-a-bottom-in-the-aviation-business-2020-07-29", "published": 1596096980.0, "headline": "GEâ\u0080\u0099s stock sinks, as CEO Culp canâ\u0080\u0099t call a bottom in the Aviation business", "body": "Shares of General Electric Co. sank Wednesday in volatile trading after the diversified industrial conglomerate said it suffered â\u0080\u009cacross the boardâ\u0080\u009d weakness in the second quarter, and indicated its aviation business could take years to recover from the effects of the COVID-19 pandemic. The stock GE, +2.85% took a 4.4% dive to close at three-week low $6.59. That reversed a gain of as much as 1.6% just moments after the open, and a premarket rally of as much as 4.5% minutes after second-quarter results were released. Trading volume swelled to 146.7 million shares, about double full-day average of 73.2 million shares. The selloff marks the biggest one-day, post-earnings decline since it tumbled 8.8% on Oct. 30, 2018, after GE reported third-quarter 2018 results. Back then, the Power business was GEâ\u0080\u0099s biggest problem, and Aviation was its darling. In the latest quarter, Power has continued to show improvement and Aviation continued to be the biggest problem, as the grounding of the Boeing Co.â\u0080\u0099s BA, -0.39% Â 737 MAX planes and the COVID-19 pandemic weighed heavily. GE shares have tumbled 41% year to date, while the Dow Jones Industrial Average DJIA, +0.56% Â has slipped 7%. See also: GEâ\u0080\u0099s stock craters to 3-decade low as airline industry outlook darkens. FactSet, MarketWatch On Wednesday, GE reported second-quarter net losses that widened to $2.18 billion, or 26 cents a share, from $61 million, or 1 cent a share, and an adjusted loss of 15 cents a share, which missed the FactSet loss consensus of 10 cents a share. â\u0080\u009cNow as we expected, our financial performance declined across the board in the quarter,â\u0080\u009d said Chief Executive Larry Culp, according to a FactSet transcript of GEâ\u0080\u0099s post-earnings conference call with analysts, as the COVID-19 pandemic took a heavy toll. Meanwhile, what may have given the stock an early lift was that overall revenue fell 24% to $17.75 billion, but beat expectations of $17.01 billion. And free cash flow (FCF) was negative $2.1 billion, which was much better than expectations of negative $3.3 billion. And Chief Executive Larry Culp reiterated his view that FCF would return to positive in 2021. In addition, GE said it was launching a program to sell off its stake in Baker Hughes Co. BKR, -1.34% Â over the next three years, and planned to use the proceeds to pay down debt. GE said it owned 377.4 million shares of Baker Hughes, which at current stock prices would be valued at about $5.9 billion. Culp said on the conference call that GEâ\u0080\u0099s overall financial performance started to see signs of improvement in June and July. For specifically the Aviation business, however, Culp said the drivers that were really hurting the business in March â\u0080\u0094 airlines conserving cash, not flying the planes they have, limiting maintenance spend and deferring orders â\u0080\u0094 â\u0080\u009care still relevant today.â\u0080\u009d â\u0080\u009cWeâ\u0080\u0099re planning for a steep market decline this year, and likely a slow multiyear recovery,â\u0080\u009d Culp said. GE Aviation revenue fell 44% to $4.38 in the second quarter, missing the FactSet consensus of $4.62 billion. In comparison, Raytheon Technologies Corp. RTX, -1.46% Â reported on Tuesday that sales at its Collins Aerospace business fell 35% to $4.30 billion, above expectations of $3.56 billion, according to FactSet. And Honeywell International Inc. HON, +0.34% Â reported on July 24 that aerospace sales dropped 28% to $2.54 billion but beat expectations of $2.41 billion. See related: GEâ\u0080\u0099s stock dives after Warren Buffettâ\u0080\u0099s negative outlook, â\u0080\u0098permanentâ\u0080\u0099 job cuts at Aviation. Analyst Nigel Coe at Wolfe Research asked on GEâ\u0080\u0099s analyst call if that, given the â\u0080\u009cvery encouragingâ\u0080\u009d trends in airline departures in recent months, could the second quarter be considered the â\u0080\u009clow pointâ\u0080\u009d for Aviation, but Culp couldnâ\u0080\u0099t say yes. He said that while the departure trends are encouraging, â\u0080\u009cby no means are we suggestingâ\u0080\u009d things will get easier. â\u0080\u009cI think this is going to continue to be a challenging environment, as governments and the public sort through how to react just broadly to the case trends,â\u0080\u009d Culp said. â\u0080\u009cSo weâ\u0080\u0099ll have to see how this plays out,â\u0080\u009d Culp said. Credit Suisse analyst John Walsh then asked that given all the â\u0080\u009cputs and takesâ\u0080\u009d as it relates to cash flow, how will GE get to positive FCF in 2021. Culp said Healthcare is â\u0080\u009cwell positioned to leadâ\u0080\u009d the recovery, and the â\u0080\u009cturnaroundsâ\u0080\u009d in Power and Renewable Energy are expected to continue. But for Aviation, Culp repeated that he was expecting a â\u0080\u009cmultiyear recovery.â\u0080\u009d When Morgan Stanleyâ\u0080\u0099s Josh Pokrzywinski followed by asking for a â\u0080\u009ccadence elementâ\u0080\u009d to that multiyear recovery, Culp couldnâ\u0080\u0099t give a straight answer. He said improved airline departures should help Aviationâ\u0080\u0099s services business, but as airlines work through what this means for them, not only in terms of their fleet plans, their own cash preservation efforts and their maintenance programs going forward, the services business will continue to be under pressure. â\u0080\u009cI just donâ\u0080\u0099t think there is, really, any two ways about it,â\u0080\u009d Culp said. â\u0080\u009cSo despite the improvement in departures and that sequential uplift, I think weâ\u0080\u0099re mindful that this is going to be challenging for us in 2020, and that wonâ\u0080\u0099t be the end of it.â\u0080\u009d"}]}