{"article": [{"url": "https://www.marketwatch.com/story/trump-claims-mail-voting-leads-to-fraud-but-he-and-other-top-white-house-officials-have-embraced-it-2020-06-22", "published": 1592850800.0, "headline": "Trump claims mail voting leads to fraud, but he and other top White House officials have embraced it", "body": "WASHINGTON — Vice President Mike Pence and a half-dozen other senior advisers to President Donald Trump have repeatedly voted by mail, according to election records obtained by The Associated Press. That undercuts the president’s argument that the practice will lead to widespread fraud this November. More than three years after leaving the Indiana governor’s residence, Pence still lists that as his official residence and votes absentee accordingly. Education Secretary Betsy DeVos has permanent absentee voting status in her home state of Michigan. Brad Parscale, Trump’s campaign manager, voted absentee in Texas in 2018 and didn’t vote in the general election two years earlier when Trump’s name was on the ballot. Two other senior Trump campaign officials — chief operating officer Michael Glassner and deputy campaign manager Bill Stepien — have repeatedly voted by mail in New Jersey. And Nick Ayers, a senior campaign adviser who was previously chief of staff to Vice President Mike Pence, has voted by mail in Georgia since 2014. In most election years, voting by mail is an unremarkable event. But this year is different because Trump has railed against state efforts to expand access to mail-in voting as an alternative to waiting in lines at polling places during a pandemic. He has argued without evidence that mail-in voting will lead to fraud and warned Monday that foreign countries could print ballots. That, some experts say, is a double standard that amounts to voter suppression. “These are people who are taking advantage of — which is perfectly legal — their right to vote absentee,” said Trevor Potter, the president of the nonpartisan Campaign Legal Center, who previously served as a general counsel on both of John McCain’s Republican presidential campaigns. “But they don’t want other people to do the same thing.” Trump himself voted by mail in the Florida primary earlier this year. White House press secretary Kayleigh McEnany has a lengthy history of voting by mail, which has been detailed in recent news stories. And Attorney General William Barr, who has also raised concern about the practice, voted absentee in Virginia in 2012 and 2019, The Washington Post previously reported. Tim Murtaugh, the Trump campaign’s communications director, defended the Trump aides who have voted by mail. In a statement, he said there’s a “vast difference between voting absentee by mail when you can’t get to the polls on Election Day versus mailing every registered voter a ballot, even those who didn’t request one.” Amid the pandemic, some states — governed by both Democrats and Republicans — send applications for absentee ballots to voters, but not ballots themselves. Six states will send ballots in November. Others are taking less dramatic steps. “The media thinks they’re playing ‘gotcha’ by purposefully ignoring that difference,” Murtaugh continued. “Voter rolls are notorious for having bad addresses or even listing dead people as active voters.” The campaign declined to make the Trump advisers who vote by mail available for interviews. The coronavirus has upended primaries across the U.S. this year, leading to postponed elections, shortages of poll workers, the shuttering of some polling locations and hours-long lines at some that have remained open. That’s raised Democratic fears that similar complications in November could alter the outcome of the contest between Trump and Democratic challenger Joe Biden. Justin Clark, the Trump campaign’s top attorney, told Republicans during a meeting in Wisconsin last year that the GOP relies on voter suppression to be competitive in swing states, while calling for the party to “start playing offense a little bit,” according to a recording that was previously obtained by the AP. While instances of voter fraud are rare, Trump’s campaign seized on recent news stories detailing how a Philadelphia election judge recently pleaded guilty to stuffing ballot boxes in exchange for bribes between 2014 and 2016. In Texas, where Parscale voted by mail in 2018, there are stiff absentee ballot laws, requiring a person to be over 65, disabled, or out of the county where they are registered during early voting, as well as on Election Day. Parscale was in Houston for a Trump rally on Oct. 22, 2018, the day early voting began in San Antonio, where he lived at the time, according to records and several tweets he sent. The day after, he signed a statement of residence that was submitted to county election officials to clarify his address. Yet it’s unclear if he traveled to San Antonio, where his presence would have disqualified him from voting absentee. The Texas Supreme Court has ruled that fear of contracting the coronavirus does not make voters eligible to cast their ballot by mail. Parscale acknowledged the difficulty he faced casting an absentee ballot in 2016, when wasn’t able to vote. “I was in New York working to elect Donald Trump and encountered a series of problems receiving my absentee ballot from Texas and missed the deadline,” Parscale said in a statement to CBS News, which first reported that he didn’t vote that year. “Just further proof that vote-by-mail is not the flawless solution Democrats and the media pretend it is.” DeVos, the education secretary, has voted absentee in all but three Michigan elections over the past decade, according to records. Trump threatened last month to withhold federal funding after Michigan’s Democratic secretary of state mailed out absentee ballot applications to registered voters. DeVos’ family has donated millions of dollars to Republican causes, including groups that are now part of a fierce court fight to limit the expansion of vote-by-mail. Glassner and Stepien have both voted repeatedly by mail in New Jersey, where Glassner has voted absentee four times since 2016. That includes a general election ballot that rejected by election officials in 2019. Stepien has voted seven times by mail since 2006, the records show. Some Republicans question the wisdom of Trump’s anti-vote-by-mail strategy. Former Pennsylvania Gov. Tom Ridge, a Republican, said it is “counterproductive.” “You’re the incumbent president of the United States. You have a bully pulpit, you’ve got this massive war chest, and you’ve got a huge electronic following,” he said. “Why would you not encourage them to vote, number one, and say, well if you can’t get to the polls for whatever reason, make sure you fill out that absentee ballot and vote for me?”"}]}