{"article": [{"url": "https://www.marketwatch.com/story/clothing-stores-not-bars-and-restaurants-took-the-biggest-sales-hit-from-the-coronavirus-2020-06-16", "published": 1592304980.0, "headline": "Clothing stores, not bars and restaurants, took the biggest sales hit from the coronavirus", "body": "If you had clothing stores on your bingo card, congratulations. It turns out that bars and restaurants did not take the biggest hit from the coronavirus pandemic — it was clothing stores that suffered the biggest revenue losses over the past three months, with sales slashed by 66.6%. By contrast, sales at restaurants and bars were down “only” 40%. Many of them have been surviving on take-out or delivery, but how many clothing stores were doing curbside pickup? And who needs to buy new clothes if you’re just hanging out in your yoga pants all day and night? If you need something, it’s much easier to just order online, or go to the big-box store that’s been open the whole time. Places where customers linger will have the hardest time recovering completely. Restaurants and bars, of course, but also destinations such as clothing stores, book stores, housewares and antique stores. It’s hard to follow social distancing guidelines when you are lingering in the stacks and not paying attention to what other customers are doing. Also read:Powell says economic activity far below pre-pandemic levels despite ‘modest rebound’ in some areas The Census Bureau estimated Tuesday that retail sales rose by a record 17.7% in May compared with the dreary April numbers, as many stores reopened and consumers ventured out of their homes again. But even with that spectacular increase, total retail sales in May were down 6.1% from a year earlier. The retail sales figures don’t cover such hard-hit services as arts, sports, recreation, travel, lodging, hair salons or health care. To gauge the total impact of the pandemic’s closings and tentative reopenings, I compared total retail sales over the three-month period from March (when the stores began closing) through May with sales in the same period last year. Total retail sales were down 10.5%, with some wide variations by type of store. As you’d expect, online stores and grocery stores actually increased their sales compared with a year earlier. Hardware stores and garden centers also got a boost, perhaps because people figure if they have to stay home, they might as well make it nice. General merchandise stores, such as Walmart WMT, +1.00%, Target TGT, +1.14% and Costco COST, +1.19%, also increased sales modestly. Aside from the big hit that clothing stores took, the biggest declines were seen in gasoline stations, furniture stores, electronics and appliance stores, and car dealers. Gas stations, of course, took a double hit, with lower volumes as well as lower prices. With so many people out of work, it makes sense that sales of durable goods such as cars, washing machines and sofas won’t be strong until more people go back to work. A lot will also depend on whether Washington provides more financial support for the unemployed and underemployed. And for buying some types of merchandise, consumers may never go back into brick-and-mortar stores."}]}