{"article": [{"url": "https://www.marketwatch.com/story/new-york-state-launches-app-that-warns-of-potential-covid-19-exposure-2020-10-01", "published": 1601576480.0, "headline": "New York state launches app that warns of potential COVID-19 exposure", "body": "Call it contact tracing in app form. State officials Thursday announced the launch of Covid Alert NY, an app that will warn New Yorkers if they’ve spent more than 10 minutes within 6 feet of other app users, creating a network of “close contacts” who can easily be notified of exposure if one of them later tests positive for the virus. “This is a technology-based contact tracing app,” Gov. Andrew Cuomo said in a statement. “Testing is only as good as your contact tracing.” Cuomo made the announcement in partnership with New Jersey Gov. Phil Murphy. New York and New Jersey will now join Pennsylvania and Delaware in a regional app network that will work across state lines to help stop the spread. Connecticut is expected to join the network in the coming weeks, as well. The technology comes from the Exposure Notification System developed by Google GOOGL, +1.82% and Apple AAPL, +1.74% . It does not track or collect users’ location or personal data, according to a release from the governor’s office. Instead, Bluetooth technology is used to detect proximity to other app users, rather than exact location. The free app, available for iPhone and Android, generates randomized anonymous close-contact codes if you’re in prolonged proximity with another user. If you test positive, contact tracers will now ask if you have the app, and if so, whether you’re willing to share your app’s auto-generated list of close contacts so that tracers can warn them of possible exposure. Users who have been in close contact with positive cases will receive “exposure alerts” telling them that they’ve been exposed to the virus by a close contact. All personal information will remain anonymous. “It will tell you if you were within 6 feet of a person who tested positive and if you were within 6 feet of a person who tested positive for 10 minutes,” the governor said. “So, it will tell you if you’re ‘in contact’ with a COVID positive person.” Coronavirus update: Global case tally above 34 million — with U.S. accounting for a fifth — as Dr. Fauci hits back at Trump’s mask claim By having a ready-made list of people who may have been exposed to one another, contact tracers may be able to more effectively slow the spread of the virus. Covid Alert also shows users recent local statistics on how many New Yorkers have been tested, and the current rate of positive tests. The launch coincides with a rise in cases, as well as the reopening of indoor dining and in-person school, both of which resumed this week. Based on Wednesday’s testing, the statewide positivity rate was 1.27%, with 20 “hotspot” ZIP Codes reporting a combined rate of 6.5%. In New York City, the overall positivity rate was 1.3%, with significantly higher rates in cluster neighborhoods, including Williamsburg and Borough Park in Brooklyn. On Thursday, the first New York City school was closed due to coronavirus. The John F. Kennedy School in Elmhurst, Queens, was ordered into the standard 14-day quarantine protocol after two unrelated coronavirus cases were detected. Citywide, the rolling seven-day average positive-test rate is currently 1.59%. Indoor dining, which began Wednesday across the five boroughs at 25% capacity, will be put on pause if that rate hits 2% on a seven-day rolling average, Mayor de Blasio has said, and schools will return to remote-only learning if it reaches 3%."}]}