{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-boosted-by-expectations-for-fall-in-crude-inventories-2020-08-12", "published": 1597245200.0, "headline": "Oil prices end at highest since March with U.S. crude supplies down 3 weeks in a row", "body": "Oil futures climbed to end Wednesday at a five-month high, as U.S. government data showed that domestic crude supplies fell for a third week in a row. Despite a 2.2 million-barrel shift from the Strategic Petroleum Reserve into commercial inventories, “a drop in oil imports and ongoing strength in Gulf Coast exports has led to another inventory draw” for crude, Matt Smith, director of commodity research at ClipperData, told MarketWatch, adding that “similar to last week, the draw was on the U.S. Gulf Coast, down 6.7 million barrels.” The Energy Information Administration reported Wednesday that U.S. crude inventories fell by 4.5 million barrels for the week ended Aug. 7. That followed sizable declines in each of the previous two weeks. On average, analysts polled by S&P Global Platts had forecast a decline of 4.7 million barrels for crude supplies. The American Petroleum Institute on Tuesday reported a weekly decrease of roughly 4 million barrels, according to data released to the media Wednesday. West Texas Intermediate crude for September delivery US:CLU20 CL.1, -1.62% on the New York Mercantile Exchange gained $1.06, or nearly 2.6%, to settle at $42.67 a barrel, after the U.S. benchmark finished Tuesday’s session down 0.8%. The settlement marked the highest for a front-month contract since March 5, according to Dow Jones Market Data. Global benchmark October Brent crude UK:BRNV20 settled 93 cents, or 2.1%, higher at $45.43 a barrel on ICE Futures Europe, also ending at the highest since March 5, following a 1.1% decline in the previous session. The EIA data also showed crude stocks at the Cushing, Okla., storage hub edged up by about 1.3 million barrels for the week, but total domestic oil production saw a weekly fall of 300,000 barrels to stand at 10.7 million barrels a day. Gasoline supply, meanwhile, fell by 700,000 barrels, while distillate stockpiles decreased by 2.3 million barrels. The S&P Global Platts survey had shown expectations for supply declines of 2.1 million barrels for gasoline and 100,000 barrels for distillates. On Nymex, September gasoline US:RBU20 rose 3.3% to $1.2438 a gallon, while September heating oil US:HOU20 gained 1.5% to $1.2572 a gallon. September natural-gas futures NG00, +5.17% lost 0.9% to end at $2.152 per million British thermal units, extending Tuesday’s 1.1% decline. The EIA on Thursday will provide an update on U.S. supplies of the commodity in storage. The biggest obstacle for the oil market continues to be the uncertainty surrounding the coronavirus, Tariq Zahir, managing member at Tyche Capital Advisors, told MarketWatch. The global tally for confirmed cases of the coronavirus that causes COVID-19 topped 20 million on Wednesday, according to data aggregated by Johns Hopkins University. The impact of the virus on energy demand has been key to the moves for petroleum prices. “While airline travel has increased recently, we still are well over 65% of people traveling—not to mention all the restrictions that are there with international flights and states imposing restrictions,” Zahir said. “We could start to see some hedging come into the [oil] market since prices are above the $40 level and some U.S. production has start to come back online, however very slowly,” he said. For now, “energy prices are range bound, but if we see a breakout and closing price above moving averages this could add an additional move to the upside in the days and weeks to come.” Meanwhile, in a monthly report issued Wednesday, the Organization of the Petroleum Exporting Countries said it now expects global oil demand growth to fall by 9.1 million barrels a day this year to 90.6 million barrels per day, due mainly to lower economic activity levels in developing economies. The expected decline in demand growth is 100,000 barrels a day lower than last month’s forecast. Demand growth in 2021 is expected to rise by 7 million to 97.6 million barrels a day, OPEC said, unchanged from its July forecast."}]}