{"article": [{"url": "https://www.marketwatch.com/story/check-your-junk-mail-4-million-americans-are-getting-their-stimulus-payments-as-prepaid-debit-cards-not-checks-2020-05-27", "published": 1593702260.0, "headline": "Donâ\u0080\u0099t toss that junk mail in the recycling bin just yet â\u0080\u0094 it might contain your stimulus check in the form of a prepaid debit card", "body": "If youâ\u0080\u0099ve been throwing away your junk mail, then you might have thrown away your stimulus payment. The U.S. Treasury Department and the Internal Revenue Service sent out Economic Impact Payments as prepaid debit cards to roughly 2 million Americans in May. Problem is, many taxpayers still waiting for their cut of the $2.2 trillion CARES Act didnâ\u0080\u0099t get the message that they should be expecting to get their stimulus money in the form of an EIP Card, as opposed to a paper check. And the IRS is concerned that people may have thrown them out, as many of the stimulus debit cards it mailed out last month still havenâ\u0080\u0099t been activated. So now people who have still not received their Economic Impact Payments should be keeping an eye out for new letters from the IRS, the revenue service announced Thursday, which will notify them that they may have an unactivated prepaid EIP card. â\u0080\u009cThese new letters, like the prepaid cards, are not a scam,â\u0080\u009d the IRS emphasized in a new announcement on Thursday, which included images of what the envelope looks like (see here), as well as a sample letter (see here). Anyone who has not received the card, or who has accidentally thrown it out, should call 800-240-8100. If the letter you receive has a different phone number on it, the IRS warned, then it is likely a scam. “ Anyone who has not received the card, or who has accidentally thrown it out, should call 800-240-8100. ” So why the confusion over these cards? Well, these Visa cards are being issued by MetaBank (the Treasuryâ\u0080\u0099s financial agent) and delivered in plain envelopes from Money Network Cardholder Services â\u0080\u0094 neither of which is a familiar name for most of us. So reports of people mistaking these for preapproved credit-card junk mail, or even a scam, have popped up across the country. And, in some cases, people have even thrown away the debit cards containing their long-awaited stimulus money before they realized their mistake. Related:This is how fast Americans are spending their stimulus checks â\u0080\u0094 and hereâ\u0080\u0099s a breakdown of what theyâ\u0080\u0099re buying Thomas and Bonnie Moore of southwest Florida are one such pair. They told local CBS VIAC, -2.34% affiliate WINK-TV that they chucked their EIP Card because they were expecting a stimulus check from the U.S. Treasury. â\u0080\u009cMy husband looked at it, briefly read it and he said, â\u0080\u0098Do you want this?â\u0080\u0099 And I said, â\u0080\u0098I donâ\u0080\u0099t need another fake card,â\u0080\u0099 so he cut it up in little pieces,â\u0080\u009d Bonnie Moore said. â\u0080\u009cThe next thing you see is I am in the garbage can trying to pull out all of the pieces together, which did not work.â\u0080\u009d Their neighbor also told the outlet that he found his prepaid debit card suspicious because it bore no official federal insignia, and the return address was in Omaha, Neb. â\u0080\u009cDoesnâ\u0080\u0099t sound like the federal government to me,â\u0080\u009d he said. Wall Street Journal (March 30):Trump wants his signature to appear on coronavirus stimulus checks Also:Trumpâ\u0080\u0099s signature to be on stimulus checks, delaying mailing process: report Several people have also complained on Twitter TWTR, -0.23% Â that they mistook their EIP Cards for junk mail: iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } And this has led several authorities to reassure consumers that the EIP Cards are legit. Both the Nassau County district attorneyâ\u0080\u0099s office in New York and the Belmont, Mass., police department have tweeted that this is â\u0080\u009cnot a scam.â\u0080\u009d Better Business Bureau offices in Texas, Colorado and Alabama have all been fielding calls from concerned consumers asking if the debit cards are real. And the Iowa attorney generalâ\u0080\u0099s office said it received dozens of calls about the cards. â\u0080\u009cPeople were very confused, wondering what these were,â\u0080\u009d a spokeswoman told a local NBC CMCSA, -0.99% affiliate. â\u0080\u009cThey were throwing these in the garbage.â\u0080\u009d Neither the IRS nor the Treasury Department responded to MarketWatch requests for comment on the confusion nor on the complaints about receiving debit cards instead of checks. But the IRS has tweeted â\u0080\u009cremindersâ\u0080\u009d that â\u0080\u009cmillions of people are getting Economic Impact Payments by prepaid debit card mailed in plain envelopes from Money Network Cardholder Services.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } Whatâ\u0080\u0099s more, the IRS recently issued a press release with the subject line: â\u0080\u009cEconomic Impact Payments being sent by prepaid debit cards, arrive in plain envelope.â\u0080\u009d It also answered several â\u0080\u009cfrequently asked questionsâ\u0080\u009d about the cards, such as how the cards could be used without fees. Because, yes, there are some fees tied to these EIP Cards, including a $7.50 replacement charge if the card is lost. Among the dissatisfied customers complaining online about getting a debit card instead of a direct deposit or a check were those saying theyâ\u0080\u0099d prefer, and expected, a payment form that they could more easily cash or deposit into a bank account: iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } The Internal Revenue Service had distributed more than 128 million checks and paid over $218 billion by early May. This includes $1,200 payments to individuals with adjusted gross income below $75,000 and $2,400 to married couples filing taxes jointly who earn under $150,000, with payouts prorated above those income thresholds. And that money canâ\u0080\u0099t come soon enough for the millions of Americans out of work since the coronavirus temporarily shut down large swaths of the economy. Related:Do I have to pay back my $1,200 stimulus check? Donâ\u0080\u0099t fall for these 5 myths about the stimulus payments May 13 was the last day that Americans could submit direct-deposit information to receive stimulus checks, which means payments will arrive as either checks or debit cards moving forward. So if youâ\u0080\u0099re still awaiting your stimulus payment, visit the online Get My Payment tool to find the projected date when a direct deposit has been scheduled, or when your payment will be mailed by check or prepaid debit card. Read more:Why havenâ\u0080\u0099t I gotten my stimulus check? 6 reasons your payment might be a no-show And hereâ\u0080\u0099s some important things you need to know about the prepaid debit cards, including what they look like, how they can be used â\u0080\u0094 and where there could be hidden fees. You can also see an exhaustive list of questions and answers at the EIP Card website eipcard.com/faq or by calling customer service at 1-800-240-8100. Whoâ\u0080\u0099s getting a debit card? Nearly 4 million people will receive a prepaid debit card instead of a paper check, which was determined by the Bureau of the Fiscal Service, another part of the Treasury Department that works with the IRS to handle distribution of the payments. In some cases, people who qualified for an Economic Impact Payment, but whose bank account information was not on file with the IRS, received a debit card in lieu of a check or a direct deposit. How will I receive my card, and what does it look like? The EIP Cards are being sent to the most recent mailing address filed with the IRS. The cards will arrive in a plain envelope from Money Network Cardholder Services. The Visa name will appear on the front of the card, and the back of the card will feature the name of the issuing bank, MetaBank, N.A. The Welcome Packet will include information explaining that the card is an Economic Impact Payment Card. Check it out: Behold the EIP Card, a prepaid debit card containing oneâ\u0080\u0099s stimulus payment. epicard.com The mailing will not include your balance, however. Youâ\u0080\u0099ll have to call and activate your card to find out how much stimulus money you getHow do I use my card? You will need to call 1-800-240-8100 to activate your card, and you will be asked to verify your identity by providing your name, address and the last six digits of your Social Security Number. You will also be asked to create a four-digit PIN required for ATM transactions and automated assistance and to hear your balance. Then you will register your card online at EIPCard.com, where you will create a user ID and a password, which you can also use on the accompanying Money Network Mobile App. You can use your EIP Card to make purchases at stores accepting Visa cards. During checkout, youâ\u0080\u0099ll insert your card into the reader or present it to the cashier. You may be asked to enter your four-digit PIN number or to sign for the transaction. You can also get cash back at participating merchants by punching in your PIN number. When shopping online (at merchants who accept Visa V, +1.80%, naturally), youâ\u0080\u0099ll need to enter the 16-digit card number when checking out, along with the expiration date and the three-digit code from the back of the card. Youâ\u0080\u0099ll also need to enter the billing address associated with your EIP Card. For both shopping in stores and online, there is a $2,500 limit per transaction and per day limit. And the merchantâ\u0080\u0099s cash back limit may be less.How do I cash out the card? You can withdraw cash at ATMs, get cash-back from participating merchants, or withdraw cash from a bank or credit union. But only some of these methods are free, and there are some limits to how much cash you can take at once. Cash from an ATM: Thereâ\u0080\u0099s no fee to withdraw cash at in-network ATMs, but fees may apply if you use an out-of-network ATM. Refer to this ATM Locator to determine which ones are in-network. To get cash, simply use this card like you would any debit card: insert the card, enter your PIN and select â\u0080\u009cWithdrawâ\u0080\u009d from â\u0080\u009cChecking.â\u0080\u009d Just be warned that thereâ\u0080\u0099s a $1,000 ATM withdrawal limit per transaction and per day, and individual bank limits may be lower. Cash back from participating merchants: As you would with any other debit card, select â\u0080\u009cDebitâ\u0080\u009d when paying, then enter your PIN and select â\u0080\u009cyesâ\u0080\u009d for the cash-back option. Enter the amount and then hit â\u0080\u009cOK.â\u0080\u009d Once again, thereâ\u0080\u0099s a $2,500 per transaction and per day limit, although individual merchant cash-back limits may be lowe. Cash from a bank or credit union teller: You can visit any bank or credit union branch to withdraw cash, but fees may apply (except for your very first withdrawal with the card.) Youâ\u0080\u0099ll need to know your balance beforehand, since the teller cannot tell how much money is on your EPI Card. Youâ\u0080\u0099ll also need to know your PIN for the card, and you will probably be asked for an additional form of ID, such as a government-issued photo ID card. Then youâ\u0080\u0099ll ask the teller for the amount that you would like to withdraw. Thereâ\u0080\u0099s a $2,500 per transaction and per day limit, although the bankâ\u0080\u0099s limit may also be less. What if I just want to transfer my balance into my bank account? You can transfer the funds from your EIP Card to your bank account online at EIPCard.com or using the Money Network Mobile App. You will need the routing number and the account number for your bank account, and you will need to have activated your EIP Card. To transfer funds: Call 1-800-240-8100 to activate your EIP Card. Register for online or mobile app access by going to EIPCard.com or the Money Network Mobile App and click on â\u0080\u009cRegister.â\u0080\u009d Follow the steps to create your User ID and Password. Be sure to have your EIP Card handy. Select â\u0080\u009cMove Money Outâ\u0080\u009d and follow the steps to set up your ACH transfer. Transfers should post to your bank account in 1-2 business days. Thereâ\u0080\u0099s a limit of $1,250 per transaction, $2,500 per day and $5,000 per month.So what are the fees? Those who receive their Economic Impact Payment by prepaid debit card can do the following without any fees: â\u0080¢ Make purchases online and at any retail location where Visa is accepted. â\u0080¢ Get cash from in-network ATMs. â\u0080¢ Transfer funds to their personal bank account. â\u0080¢ Check their card balance online, by mobile app or by phone. But you will be charged $2 for withdrawing money from out-of-network ATMS â\u0080\u0094 after your first ATM withdrawal. Of course, you may also be charged a fee by the ATM operator, even if you do not complete a transaction. Refer to this ATM Locator. Thereâ\u0080\u0099s also a $5 bank teller over-the-counter cash withdrawal fee, although once again, the first time you withdraw funds from your card at a teller will be free. So if youâ\u0080\u0099re planning to cash out your card from an ATM or a bank, the lesson here is to take it all out at once, if you can. Perhaps most importantly, thereâ\u0080\u0099s a $7.50 fee to reissue a lost or stolen card. It will be shipped in seven to 10 business days after the reissue order is placed. If you want that card to be sent four to seven days after the order is placed, thereâ\u0080\u0099s also a $17 priority shipping fee. Will the government be tracking what I spend the money on? No. Under the Right to Financial Privacy Act, the federal government is not allowed to ask the card issuer about your EIP Card account, and the card issuer is not allowed to give the government information about your EIP Card account without your written permission, except under very limited circumstances.So these cards arenâ\u0080\u0099t a scam â\u0080\u0094 but what IRS scams should I watch out for? Be warned that the IRS will never call, text, email or reach out to you over social media to say it needs more information to process a payment. The same goes for banks and credit unions. You will only get such IRS correspondence by mail. Here are five red flags to watch out for from scammers trying to steal your stimulus money. Any additional questions can be answered by visiting eipcard.com/faq. This article was originally published on May 27, and has been updated with the pending IRS letters about unactivated EIP cards."}]}