{"article": [{"url": "https://www.marketwatch.com/story/trump-rally-attendees-dismiss-heat-and-coronavirus-concerns-as-they-line-up-outside-tulsa-arena-2020-06-19", "published": 1592581880.0, "headline": "Trump rally attendees dismiss heat and coronavirus concerns as they line up outside Tulsa arena", "body": "TULSA, Okla. (AP) — Rick Frazier drove more than 750 miles from Ohio to be one of the first campers in line for President Donald Trump’s first rally in months, undeterred by a days-long wait in searing heat, the growing risk of the coronavirus in Oklahoma or a lukewarm reception from local officials. The 64-year-old is among scores of supporters who have brought their vans, tents, campers and Trump flags to the parking lots and sidewalks outside the 19,000-seat BOK Center, and who say what matters most is being there to see the president take the stage on Saturday — and to be sure he knows they have his back. “The big thing is to go in and support the president,” said Frazier, who arrived Tuesday for what will be his 21st Trump rally. Frazier said he feels safe, noting he and other campers are using hand sanitizer to prevent spread of COVID-19. Tulsa’s mayor, G.T. Bynum, declared a civil emergency and set a curfew for the area around the BOK Center ahead of the rally Saturday night. The state supreme on Friday afternoon rejected a last-ditch appeal to require that rally attendees adhere to CDC guidelines on face masks and social distancing. The Tulsa lawyer who brought the suit, according to the newspaper Tulsa World, said the goal was to limit the risk to local public health. The court said the Tulsa residents who had asked that the thousands expected at the rally be required to take the precautions couldn’t establish that they had a clear legal right to the relief sought. In a concurring opinion, two justices wrote that the state’s reopening plan is “permissive, suggestive and discretionary.” A local convenience-store chain has reportedly opted to close over concerns for employee health and safety rather than seek to capitalize on the influx of prospective shoppers. The president issued this crackdown threat on Twitter to would-be demonstrators, even as campaign representative Marc Lotter was telling MSNBC that peaceful exercise of the First Amendment right to protest is welcome: iframe.twitter-tweet { width: 100% !important; } Trump rallies are known for an atmosphere akin to a political tailgate party and have always drawn diehard fans who often travel from event to event and sleep outside for days to secure a spot and pass time. Some are self-described “front-row Joes.” The groups gathering in Tulsa are taking that loyalty to a new level, though some called the coronavirus threat “an exaggeration.” Temperatures in Tulsa have reached the 90s, and the Trump faithful are camped in an area with hardly a spot of shade. While Trump said Thursday he picked Oklahoma partly because “you’ve done so well with the COVID,” the city has seen record numbers of new coronavirus cases this week, and Tulsa Health Department Director Bruce Dart has pushed for a postponement of the event. Trump said there had been “tremendous requests for tickets” and that there will be “a crowd like I guess nobody has seen before,” creating the kind of packed, indoor space that scientists say heighten the virus’s spread as compared with outdoor gatherings. His rallies typically include a lot of shouting and chanting, and attendees often travel from long distances, prompting fears they could be infected and then spread it to people back home, or bring it from their hometowns and become vectors within the Tulsa arena. In an attempt to protect itself from lawsuits, Trump’s campaign added language to the event registration stating guests assumed risk for exposure to COVID-19. Key Words:Trump adviser Kudlow talks up limiting coronavirus liability for businesses: ‘I don’t think there should be a lawsuit’ But meeting with Trump at the White House on Thursday, Oklahoma Gov. Kevin Stitt pledged the state is ready, noting its rate of positive COVID-19 tests is lower than many other states. As of this week, Tulsa County has displaced Oklahoma County as the state’s leading COVID-19 hot spot with 1,825 cases. “It’s going to be safe,” said Stitt, a Trump-aligned Republican who was recommending dining in restaurants even as the World Health Organization made its pandemic declaration in March. “We have to learn how to be safe and how to move on.” That has not reassured BOK Center management, who requested a written health and safety plan from the Trump campaign on Thursday. In a statement to Oklahoma City television station KFOR, rally organizers appeared unimpressed but said they would review the request. The Trump campaign said Thursday that it takes “safety seriously,” noting that organizers are providing masks, hand sanitizers and doing temperature checks for all attendees. “This will be a Trump rally, which means a big, boisterous, excited crowd,” the campaign said. “We don’t recall the media shaming [anti-racism] demonstrators about social distancing — in fact the media were cheering them on.” Stitt, the governor, suggested in a Fox News interview that the campaign’s response was good enough for him: iframe.twitter-tweet { width: 100% !important; } Trump had originally been scheduled to speak on Friday. He changed the date amid an uproar that it would occur on Juneteenth, which marks the end of slavery in the U.S., and in a city where a 1921 white-on-black attack killed as many as 300 people. Black community leaders — some of whom characterized the originally targeted date as a slap in the face — said they still worry Saturday’s rally could spark violence. Juneteenth:Special coverage of date marking slavery’s end, including stories reparations, the salary gap, education and student debt, policing and more Trump has been on a hiatus from the rallies that have been a centerpiece of his campaign — and indeed, unusually, his entire presidency — halting them since March 2 because of the spreading virus, which has killed more than 118,000 people in the U.S. But he has been eager to return to the events, which allow him to rally his base and build the campaign database of supporters. (Campaign manager Brad Parscale has crowed that the Tulsa arena is significantly oversubscribed — going on to describe those requesting the free tickets as having participated in a campaign “data haul.”) iframe.twitter-tweet { width: 100% !important; } Saturday’s rally also could provide a bit of diversion from criticism over Trump’s handling of the pandemic and the protests following the killing of George Floyd in Minneapolis. Rainey Strader, 48, who traveled to Tulsa from Iowa with her husband and 75-year-old mother, said she brought a mask but isn’t sure if she will wear it once she gets inside the venue. Strader said she isn’t worried about COVID-19, which she considers to be “like the flu.” “It’s just a new thing, and everybody’s worried,” said Strader, who was working a word-search puzzle while she waited Thursday with her mother as her husband slept in their van. “It’s exaggerated.” Strader’s mother, Catherine Pahsetopah, said she’s also not sure whether she will wear her mask, despite being considered high-risk for COVID-19 because of her age and health problems. She said she’s seen presidents come and go — all the way “back to Eisenhower” — and Trump ranks among the best. “He’s great. He’s wonderful,” Pahsetopah said, adding: “If John Kennedy knew what happened to the Democratic Party he wouldn’t want them” because of their support for “aborting the babies.” Delmer Phillips, 41, of Tulsa, described himself and others who showed up early for the rally as “front-row Joes” who are excited to get a glimpse of the president. He said he won’t wear a mask this weekend because he believes he may have already had the virus and has built up immunity. “I’m personally not so worried about it,” he said. “I believe in God, and I don’t live in fear.” MarketWatch contributed to this report."}]}