{"article": [{"url": "https://www.marketwatch.com/story/amazon-prime-day-delay-back-to-school-uncertainty-is-changing-the-shopping-calendar-2020-08-17", "published": 1597737740.0, "headline": "Amazon Prime Day delay, back-to-school uncertainty is changing the shopping calendar", "body": "Shoppers can usually count on this time of year for end-of-summer deals and back-to-school promotions, but the coronavirus pandemic has thrown the retail calendar out of whack, making year-over-year comparisons difficult. “Changes in back-to-school/college spending are the latest factor altering comparisons to last year. We are in a period of continuous change and uncertainty, making it increasingly important to look at retail activity over time, rather than just one point in time,” said Marshal Cohen, NPD Group’s chief retail industry adviser. “July’s loss of Prime Day will bring another layer of change to the 2020 holiday season, with retailers already preparing to compete with the event, effectively moving Black Friday up by more than a month.” Last year, Amazon.com Inc.’s AMZN, +3.01% two-day Prime Day event took place July 15 and July 16. This year, it has been moved to later in the year, though the date has yet to be announced. Analysts have already forecast a bust for this year’s back-to-school shopping season, with many parents and school officials still working out plans See:The back-to-school shopping season will be a ‘dud’ one analyst says, but the NRF is forecasting a record breaker NPD notes a 3% year-over-year decline in dollar sales for general merchandise items for the week ending Aug. 1 after a surge in coronavirus cases and uncertainty over unemployment benefits leading up to the period. RetailNext hasn’t ruled out the back-to-school shopping season. “It appears that back-to-school shopping will be popular even in these uncertain times, although it may be in a phased approach,” wrote Susan Davidson, a retail consultant at RetailNext. Cowen analysts also think the back-to-school season will be a more “prolonged” one, but say it will be weakened by the current consumer condition. “Cowen anticipates a back-to-school season with fewer apparel purchases that’s highly promotional. Consumers will value versatility, comfort, active apparel, and soft ‘lock down’ wear,” analysts said. Cowen thinks Ulta Beauty Inc. ULTA, -1.63% will benefit from the shift away from clothing purchases during the season, and favors Target Corp. TGT, +1.14% thanks to its strength in categories away from apparel, like home and beauty. Target reports second-quarter earnings on Wednesday. More than half of the respondents (52%) to the First Insight poll that Cowen hosted said they weren’t going to be buying for back-to-school this year. Also: Stein Mart files for bankruptcy as analysts forecast pressure on usually-robust off-price retail Looking ahead Target, Walmart Inc. WMT, +1.00% and other retailers have already announced store closures on Thanksgiving Day, which has become an important part of the Black Friday shopping weekend. As the calendar moves from back-to-school to holiday, Wells Fargo analysts see three headwinds facing the retail sector: a stalled recovery, the aforementioned uncertainty around unemployment and other government stimulus benefits and holiday season shipping price increases, like those United Parcel Service Inc. UPS, +0.27% announced. “Both UPS and FedEX have continued to increase pricing (some industry sources citing as much as a double-digit price hike for some retailers) and have announced incremental holiday surcharges,” analysts said. “With the expectation for a significant channel shift online this holiday season, this could be a meaningful margin headwind in 2H.” Before we get to the holidays, retailers will have to deal with a back-to-school shopping season that doesn’t look like any before it. “With some families still undecided as to how their children will learn this fall, and many school districts still figuring out if and how to re-open their doors to students safely, the traditional back-to-school shopping timeline may be delayed and traditional back-to-school wallet share may shift,” Wells Fargo said. The Consumer Discretionary Select Sector SPDR ETF XLY, +1.04% has gained 16% for the year to date. The SPDR S&P Retail ETF XRT, +0.05% is up 14.6%. And the S&P 500 index SPX, +0.87% is up 4.7% for the period."}]}