{"article": [{"url": "https://www.marketwatch.com/story/ford-rolls-out-revamped-f-150-but-most-changes-are-in-the-interior-2020-06-25", "published": 1593117560.0, "headline": "Ford rolls out revamped F-150, but most changes are in the interior", "body": "DETROIT — Six years ago, Ford made a Texas-size wager on the top-selling vehicle in America, rolling out a radical new version of the F-Series pickup with a lighter aluminum body instead of the customary steel. Now it’s time for another revamp, and Ford F, -1.36% is playing it safe with the company’s crown jewel. On the outside, the truck changes little, and the internal combustion engines and transmissions remain the same. The biggest differences are a gas-electric hybrid version, internet connectivity, and a revamped interior that turns the truck into more of a rolling office or even a place to nap. There’s good reason for Ford to minimize changes. Since the 2014 revamp, it has sold nearly 4.5 million of the aluminum-clad trucks, holding its sales crown despite challenges from GM’s GM, -0.15% Chevrolet and Chrysler’s FCAU, -0.95% Ram. Pickups also have been a bright spot during the pandemic as automakers cautiously restarted factories last month. Annette Sykora, who runs Smith South Plains Ford in Levelland, Texas, said Ford’s conservative stance is smart. “It’s been the No. 1 seller for a number of years, and a good, tough truck that does the work,” she said. “We definitely don’t want them to mess with that.” F-Series pickups are so important to Ford that a mistake could cost the company at a critical time with a wobbly economy due to the coronavirus, restructuring costs and investment in new technologies draining badly needed cash. The big pickups generate $50 billion per year in global revenue, about one-third of what Ford normally takes in. That’s more than revenue generated by entire companies such as Coca Cola or Delta Air Lines. The F-Series brings in $42 billion in U.S. revenue, raising more cash than every other consumer product except the iPhone, according to Boston Consulting Group. In Texas, where more pickups are sold than any other state, one in every five new vehicles sold is a full-size pickup. It’s one in every seven nationwide, according to Ford research. “There’s really nothing more important to us than the F-Series,” Ford CEO Jim Hackett said in an interview. The aluminum body, he said, gives the trucks an advantage in handling over competitors that will carry over into the new version, he said. Sam Pack, who owns four Dallas-area Ford dealerships, says the F-Series accounts for well over 40% of his sales. Company research pointed toward revamping interiors to make it easier to do office work in the cab, said Pack, one of the dealers who advises Ford on new vehicles. Before doing the redesign, Ford employees lived with owners to see how they used their pickups, said Dawn Piechocki, the truck’s engineering manager. They found that nearly one-third use a laptop in the truck, yet there was no place for it to sit because the gearshift was in the way. Many rigged up computer holders with plywood or bungee cords, Hackett said, yet they still prefer conventional shift levers to dials or buttons that would free up space. So the design team figured out how to collapse the shifter to make the center console box lie flat, creating a desk-like space for laptops, he said. The flat space is an option on all trim levels. There’s also a new tailgate work surface that has its own ruler, and customers can get optional front bucket seats that recline to lie almost flat for snoozing between jobs. The hybrid powertrain, with a 3.5-liter turbocharged V6 engine, can produce enough power to serve as an onsite generator. One version can run enough tools to frame a house, powered from outlets in the bed, Ford said. The battery can run the tools alone, but the engine may turn on depending on how much electricity is being used. Trucks powered by gas or diesel engines also have a generator feature available, although engines must be running. Ford expects the hybrid system to produce the most torque and horsepower of any light-duty full-size pickup, although gas mileage, power and other specifications weren’t released. The company predicts 10% of buyers will choose the hybrid because of its extra power and generator. All F-150s will have internet-connected modems so owners can send documents directly from the truck. The modems also will let Ford fix problems and update software wirelessly, a first for big pickups. The trucks come with standard safety features including automatic emergency braking and pedestrian detection. Available is Ford’s new hands-free driver assist system, which can be used on over 100,000 miles of divided highways in the U.S. and Canada. The system uses a camera to make sure the driver is paying attention. The truck, to be built in Dearborn, Michigan, and Kansas City, Missouri, arrives in showrooms in the fall. The price wasn’t announced. The current truck starts at just under $29,000 but can run close to $80,000."}]}