{"article": [{"url": "https://www.marketwatch.com/story/florida-suffers-record-single-day-covid-19-death-toll-but-cdcs-redfield-wont-blame-desantiss-brisk-reopening-of-state-2020-07-15", "published": 1594803740.0, "headline": "Florida suffers record single-day COVID-19 death toll, but CDC's Redfield won't blame DeSantis's brisk reopening of state", "body": "FORT LAUDERDALE, Florida (AP) - Florida surpassed its daily record for coronavirus deaths Tuesday amid rising global worries of a resurgence, even as researchers announced that the first vaccine tested in the U.S. had worked to boost patients' immune systems. Florida's 132 additional deaths topped a state mark set just last week. The figure likely includes deaths from the past weekend that had not been previously reported. See also: Two ways Washington changing its 'Redskins' nickname could make the team money The new deaths raised the state's seven-day average to 81 per day, more than double the figure of two weeks ago and now the second-highest in the United States behind Texas. The worrisome figures were released just hours before the news about the experimental vaccine, developed by the National Institutes of Health and Moderna Inc. Coronavirus daily update:Global cases of COVID-19 climb above 13 million as California, Hong Kong and India reimpose restrictions on movement \"No matter how you slice this, this is good news,\" Dr. Anthony Fauci, the U.S. government's top infectious disease expert, told the Associated Press. Key final testing of the vaccine will start around July 27, tracking 30,000 people to prove if the shots really work in preventing infection. Tuesday's announcement focused on findings since March in 45 volunteers. See:Moderna stock surges 17% on coronavirus vaccine trial news With the virus spreading quickly in the southern and western U.S., one of the country's top public health officials offered conflicting theories about what is driving the outbreak. \"We tried to give states guidance on how to reopen safely. ... If you look critically, few states actually followed that guidance,\" Dr. Robert Redfield, the director of the Centers for Disease Control and Prevention. said Tuesday in a live-streamed interview with the editor of the Journal of the American Medical Association. Redfield said people in many states did not adopt social distancing and other measures because they hadn't previously experienced an outbreak. But he went on to say, without explanation, that he didn't believe the way those states handled reopening was necessarily behind the explosive rise in virus cases. He offered a theory that infected travelers from elsewhere in the country might have brought the virus with them around Memorial Day. CDC officials said that there are various possible explanations, and that Redfield was offering just one. Don't miss:In debate over school reopenings, it's Trump vs. the health experts - again Plus:CDC won't revise guidelines for reopening schools, despite Trump criticism Doctors in Florida have predicted more deaths as daily reported cases have surged from about 2,000 a day a month ago to a daily average of about 11,000, including a record 15,000 on Sunday. The state recorded 9,194 new cases Tuesday. Marlyn Hoilette, a nurse who spent four months working in the COVID-19 unit of her Florida hospital until testing positive recently, said hospitals are so desperate for staff to return to work they are not following guidelines that call for two negative tests first. \"Nurses are getting sick, nursing assistants are getting sick and my biggest fear is that it seems we want to return folks to work even without a negative test,\" said Hoilette, who works at Palms West Hospital in Loxahatchee. Florida. \"It's just a matter of time before you wipe the other staff out if you're contagious, so that is a big problem.\" Florida Gov. Ron DeSantis talks about the state's response to the coronavirus pandemic during a press conference on April 17 in Fort Lauderdale, Fla. Getty Images Word of the rising toll in Florida came as Arizona officials tallied 4,273 newly confirmed cases of COVID-19. The state, which became a virus hot spot after Gov. Doug Ducey relaxed stay-at-home orders and other restrictions in May, reported 3,517 patients hospitalized because of the disease, a record high. Arizona's death toll from COVID-19 rose to 2,337, with 92 additional deaths reported Tuesday. Redfield urged Americans to wear masks to help contain the virus. \"At this critical juncture when COVID-19 is resurging, broad adoption of cloth face coverings is a civic duty, a small sacrifice reliant on a highly effective low-tech solution that can help turn the tide,\" he and two colleagues wrote, in an editorial published online Tuesday by the journal of the American Medical Association. In Britain, officials announced they will require people to wear face masks starting July 24, after weeks of dismissing their value. \"We are not out of the woods yet, so let us all do our utmost to keep this virus cornered and enjoy summer safely,\" British Health Secretary Matt Hancock told lawmakers in the House of Commons. French President Emmanuel Macron said masks will be required by Aug. 1, after recent rave parties and widespread backsliding on social distancing raised concerns the virus may be starting to rebound. Even Melania Trump, whose husband President Donald Trump resisted wearing a mask or urging anyone else to do so, called on people to step up precautions. \"Even in the summer months, please remember to wear face coverings & practice social distancing,\" she said Tuesday in a posting on her Twitter account. \"The more precaution we take now can mean a healthier & safer country in the Fall.\" Meanwhile, officials in the Australian state of Queensland said those breaking quarantine rules could face up to six months in jail. With higher fines and the threat of jail time, \"I hope that will demonstrate to the public just how serious we are about enforcing these measures,\" Queensland Deputy Premier Steven Miles said. Queensland shut its state borders to successfully contain the coronavirus outbreak, but reopened to all but residents of Victoria, Australia's worst affected region, two weeks ago. The city of Melbourne in Victoria recorded 270 new coronavirus infections overnight, with more than 4,000 cases now active across the state. Melbourne is one week into a six-week lockdown. Disney officials announced that Hong Kong Disneyland Park is closing Wednesday until further notice following the city's decision to ban public gatherings of more than four people to combat newly spreading infections. In Thailand, where there have been no reports of locally transmitted cases for seven weeks, authorities have revised rules governing visitors from abroad after a breakdown in screening led to two infected foreigners posing a possible risk to public health. The government said Tuesday that diplomats will be asked to stay in state-supervised quarantine for 14 days, instead of self-isolating. And it is postponing the recently allowed entry of some foreign visitors so procedures can be changed. India, which has the third-most cases after the U.S. and Brazil, was rapidly nearing 1 million cases with a jump of more than 28,000 reported Tuesday. It now has more than 906,000 and accumulated more than 100,000 in just four days."}]}