{"article": [{"url": "https://www.marketwatch.com/story/hurricane-laura-cleanup-begins-weeks-without-power-or-water-ahead-2020-08-29", "published": 1598704280.0, "headline": "Hurricane Laura cleanup begins; weeks without power or water ahead", "body": "The destructive storm surge has receded, and the clean up has begun from Hurricane Laura, but officials along this shattered stretch of Louisiana coast are warning returning residents they will face weeks without power or water amid the hot, stifling days of late summer. The U.S. toll from the Category 4 hurricane stood at 14 deaths, with more than half of those killed by carbon monoxide poisoning from the unsafe operation of generators. President Donald Trump plans to tour the damage in Louisiana and neighboring Texas on Saturday. Across southwestern Louisiana, people were cleaning up from the hurricane that roared ashore early Thursday, packing 150 mph (240 kph) winds. Many were deciding whether they wanted to return home to miserable conditions or wait until basic services are finally restored. At First United Methodist Church in Lake Charles, a work crew was battling water that continued to pour into the church building as it rained Friday. “This roof blew off. There’s some of it over there,” said Michael Putman, owner of Putman Restoration, pointing to part of the roof resting near the side of the building. A pile of black garbage bags sat outside the church, filled with insulation and ceiling tile. Putman lives in Shreveport, which also got damage from the storm. But he said he drove down to Lake Charles to help the minister, who was his high school pastor. “We slept in our truck in the parking lot last night,” he said. Simply driving was a feat in Lake Charles, a city of 80,000 residents hit head on. Power lines and trees blocked paths or created one-lane roads, leaving drivers to negotiate with oncoming traffic. Street signs were snapped off their posts or dangling. No stoplights worked, making it an exercise in trust to share the road with other motorists. Mayor Nic Hunter cautioned that there was no timetable for restoring electricity and that water-treatment plants “took a beating,” leaving barely a trickle of water coming out of most faucets. “If you come back to Lake Charles to stay, make sure you understand the above reality and are prepared to live in it for many days, probably weeks,” Hunter wrote on Facebook. Caravans of utility trucks were met Friday by thunderstorms in the sizzling heat, complicating recovery efforts. The Louisiana Department of Health estimated that more than 220,000 people were without water. Restoration of those services could take weeks or months, and full rebuilding could take years. Forty nursing homes were relying on generators, and assessments were underway to determine if more than 860 residents in 11 facilities that had been evacuated could return. The much weaker remnants of the hurricane continued to move across the Southern U.S., unleashing heavy rain and isolated tornadoes. North Carolina and Virginia could get the brunt of the worst weather Saturday, forecasters said. When the storm moves back over the Atlantic Ocean, forecasters said it could become a tropical storm again and threaten Newfoundland, Canada. Louisiana Gov. John Bel Edwards called Laura the most powerful hurricane to strike the state, meaning it surpassed even Katrina, which was a Category 3 storm when it hit in 2005. He said Friday that officials now believe the surge was as high as 15 feet (4.5 meters). Saturday marks the 15th anniversary of Katrina. Hurricane Laura also killed nearly two dozen people in Haiti and the Dominican Republic en route to the U.S. Gulf Coast. In Lake Charles, chainsaws buzzed and heavy machinery hauled tree limbs in the front lawn of Stanley and Dominique Hazelton, who rode out the storm on a bathroom floor. A tree punctured the roof not far from where the couple was taking cover. They regretted staying. “There’s people without homes,” Stanley Hazelton said. “So it was dumb. We’ll never do it again. We’ll never stay through another hurricane again.” ___"}]}