{"article": [{"url": "https://www.marketwatch.com/story/trump-uses-coronavirus-briefing-to-criticize-bidens-mask-mandate-decry-mail-in-vote-question-kamala-harriss-eligibility-as-vice-president-2020-08-13", "published": 1597394000.0, "headline": "Trump used coronavirus briefing to criticize Bidenâ\u0080\u0099s call for a mask mandate, decry mail-in voting, question Kamala Harrisâ\u0080\u0099s eligibility to serve as vice president", "body": "President Donald Trump on Thursday evening blasted Joe Bidenâ\u0080\u0099s call for a national mask mandate, challenged the security of mail-in voting and questioned the eligibility of Kamala Harris to serve as vice president, during a wide-ranging news briefing ostensibly convened to provide updates and information about Americaâ\u0080\u0099s battle against the worst public health crisis in a generation. â\u0080\u009cWe will continue to urge Americans to wear masks when they cannot social distance, but we do not need to bring the full weight of the federal government down on law-abiding Americans to accomplish this goal,â\u0080\u009d he declared at Thursdayâ\u0080\u0099s briefing, criticizing comments Biden had made earlier in the day. â\u0080\u009cItâ\u0080\u0099s up to the governors, and we want to have a certain freedom,â\u0080\u009d the president said, adding that each state is â\u0080\u009cfacing unique circumstancesâ\u0080\u009d in their fight against the disease. â\u0080\u009cAmericans must have their freedoms, and I trust the American people,â\u0080\u009d he said. The comments from the president come after presumptive Democratic presidential nominee Joe Biden on Thursday called for a national mask mandate to limit the spread of COVID-19, stepping up his rhetoric on the issue after criticizing Trumpâ\u0080\u0099s own stance earlier this summer and having called on the president as early as January, in a USA Today op-ed, to take the coronavirus more seriously than he was doing. Biden, speaking during a brief appearance before reporters in Wilmington, Del., said that â\u0080\u009cevery single American should be wearing a mask when theyâ\u0080\u0099re outside for the next three months at a minimum.â\u0080\u009d Trump blasted Biden for what he described as politicizing the viral outbreak to score â\u0080\u009cpolitical points,â\u0080\u009d though he used much of the coronavirus press briefing in an attempt to highlight differences between the former vice president and himself as the race for the White House heats up with Bidenâ\u0080\u0099s selection this week of Sen. Kamala Harris of California as his running mate. â\u0080\u009cStop playing politics with the virus,â\u0080\u009d Trump said at one point. The president also emphasized his optimism about the prospects for a vaccine and remedies for the deadly illness. Opinion:Hereâ\u0080\u0099s a pandemic stock tip: Buy on the rumor of a COVID-19 vaccine, sell on the news The global tally of confirmed cases of COVID-19 climbed to 20.6 million on Thursday, with the death toll rising to 749,656, according to data aggregated by Johns Hopkins University. At least 12.8 million people are confirmed to have recovered. The U.S. has had 5.19 million cases, and COVID-19â\u0080\u0093related deaths stand at 166,027. Meanwhile, Trump attempted to tamp down a public outcry to comments heâ\u0080\u0099d made about not funding the U.S. Postal Service and criticism of mail-in voting during a Fox Business Network interview, when he was asked about issues preventing a deal with Democratic lawmakers on another coronavirus relief package, Read:Trump explicitly links mail-in voting and his opposition to post-office financial relief The president said he would rather not provide funding to the USPS and encouraged voters to physically travel to voting stations even if the virus was still not under control on Election Day on Nov. 3. From the archives (December 2019):Trump campaign adviser tells Wisconsin Republicans in secret recording that voting-place tactics will be stepped up â\u0080\u009cWe want to have an accurate vote,â\u0080\u009d he said, suggesting that voting by mail is vulnerable to fraud. â\u0080\u009cI am not saying anything wrong with voting, I want them to vote, but that would mean they would have to go to a voting booth like they used to and vote,â\u0080\u009d he said. â\u0080\u009cWe want people to vote so when they vote it means one vote. It doesnâ\u0080\u0099t mean ballots all over the place,â\u0080\u009d Trump continued. Trump currently trails in national opinion polls and has repeatedly attacked mail-in voting, claiming that expanding such voting would lead to large-scale fraud in the election. Independent researchers have found no widespread cases of such voter fraud in past races. A number of states have conducted elections primarily by mail, and others are rolling out mail-in balloting. He and the first lady have requested ballots to vote in Florida while in Washington, but he opts to characterize such votes as absentee rather than mail-in, though itâ\u0080\u0099s a distinction without difference. Key Words (April 2020):White House officials may or may not have explicitly threatened a veto but made clear Trumpâ\u0080\u0099s opposition to post-office rescue funds in the CARES Act He also claimed that countries like China, Iran and Russia could create counterfeit ballots. See:Russia aims to run down Biden candidacy in support of Trumpâ\u0080\u0099s re-election, says U.S. counterintelligence official Trumpâ\u0080\u0099s challenges to USPS funding have fueled allegations that he is trying to hamstring the service ahead of the presidential election where mail-in voting is likely to be crucial. See:Critics of Trump White House decry latest â\u0080\u0098Friday night massacreâ\u0080\u0099 as postmaster general sidelines two dozen USPS officials Later in the briefing, Trump declined to denounce claims that Harris, born in Oakland, Calif., doesnâ\u0080\u0099t meet constitutional requirements to serve as Bidenâ\u0080\u0099s running mate. She is the first Black woman and the first person of Indian ancestry on a major national ticket. â\u0080\u009cI just heard today that she doesnâ\u0080\u0099t meet the requirements, and by the way, the lawyer who wrote that pieces is a very highly qualified, very talented lawyer. I have no idea if thatâ\u0080\u0099s right,â\u0080\u009d he said. â\u0080\u009cI would have assumed the Democrats would have checked that out before she gets chosen to run for vice president,â\u0080\u009d he said in a response to reporterâ\u0080\u0099s question. The questions abut Harris follow an op-ed in Newsweek by John C. Eastman, a law professor at Chapman University, who argued that because neither of Harrisâ\u0080\u0099s parents were naturalized U.S. citizens at the time of Harrisâ\u0080\u0099s birth in 1964, she is not a â\u0080\u009cnatural born citizenâ\u0080\u009d and therefore â\u0080\u009cineligible for the office of the president and, hence, ineligible for the office of the vice president.â\u0080\u009d A claim that has been refuted by experts, including in the pages of Newsweek. Read:Jobless claims fall below 1 million for first time since start of coronavirus pandemic"}]}