{"article": [{"url": "https://www.marketwatch.com/story/stock-index-futures-point-lower-as-investors-watch-coronavirus-aid-talks-assess-flood-of-earnings-2020-07-28", "published": 1595955440.0, "headline": "Dow slides 205 points, stocks end near session lows, as investors await coronavirus aid progress", "body": "U.S. stocks indexes closed lower Tuesday, as investors monitored talks between Republicans and Democrats on a second coronavirus aid package and tuned in to a deluge of second-quarter corporate results.How did major indexes fare? The Dow Jones Industrial Average DJIA, +0.56% finished 205.49 points lower, or 0.8%, at 26,379.28, while the S&P 500 SPX, +0.87% shed 20.97 points, or 0.7%, ending at 3,218.44, after briefly trading positive. The Nasdaq Composite COMP, +1.39% lost 134.18 points, or 1.3%, to close at 10,402.09. The Dow on Monday finished with a gain of 114.88 points, or 0.4%, at 26,584.77, while the S&P 500 gained 23.78 points, or 0.74%, to close at 3,239.41. The Nasdaq Composite advanced 173.09 points to end at 10,536.27, a 1.7% gain. What drove the market? Stocks ended lower Tuesday as investors migrated toward businesses that may benefit from economic recovery after taking a hit from the global pandemic, but the gains were not enough to offset sharp selling in a number of high-profile companies. Norwegian Cruise Line Holdings Ltd NCLH, +2.91% and Regency Centers Corp. REG, -2.12%, a shopping center real-estate investment trust, ended the day higher, as did American Airlines Group Inc. AAL, +0.34%, United Airlines HoldingInc. UAL, +0.32% and Delta Air Lines Inc. DAL, +0.39%. But stocks that already have done well from online shopping and work-from-home rules during the pandemic lost ground, including Netflix NFLX, +1.43% and Alphabet GOOG, +1.97%. Investors also sold shares of Dow components 3M Co. MMM, +0.94% and McDonald’s Corp. MCD, -0.43%, which reported second-quarter earnings that fell short of Wall Street expectations and pulled the Dow lower. Still, the shift reinforced hopes that sentiment finally might start to shift toward value sectors and away from large-cap growth stocks that in recent months have been responsible for powering major equity indexes higher. “One or two days is not a trend, but it’s welcome news for those who have owned value entities,” said Kent Engelke, chief economic strategist at Capitol Securities Management, in an interview. Related: Future returns: REITs should rise as economy recovers Senate Republicans’ roughly $1 trillion coronavirus relief package also was in focus, as negotiations kicked off with Democrats over another fiscal stimulus bill that comes amid recent economic data suggesting the U.S. economic recovery is stalling. A fight looms over supplemental unemployment benefits, with Democrats eager to maintain the existing $600 weekly supplement, while the Republican plan would reduce it to a $200 add-on through September. The supplemental jobless benefits are due to expire at the end of the month. Democrats and Republicans also want to issue another round of stimulus checks, but disagree on the details. See:Republicans and Democrats both want another round of stimulus checks — but here’s where they disagree Analysts said the added jobless benefits have been credited with helping to cushion the economic blow of the COVID-19 pandemic. “In our view, for equities to continue yesterday’s rebound, a common ground should be found before Friday when the enhanced unemployment benefits expire,” said Charalambos Pissouros, senior market analyst at JFD Group. Pissouros said a package near $1 trillion or lower would likely come as a disappointment to the market. Meanwhile, the number of U.S. coronavirus cases rose to 4.29 million and the death toll hit 148,056. Texas became the fourth state with more than 400,000 cases, joining California, Florida and New York. The global tally for confirmed cases of COVID-19 climbed to 16.5 million on Tuesday, according to data aggregated by Johns Hopkins University, while the death toll rose to 654,327. Aside from rising case counts, Major League Baseball also has become a harbinger of the nation’s attempts to contain the coronavirus, after 17 players from the Miami Marlins this week were reported as testing positive for COVID-19, forcing the team’s scheduled games to be suspended through Sunday. “You listen to earnings and some have been particularly bad,” Jason Ader, chief executive officer of SpringOwl Asset Management, told MarketWatch. “But bad earnings aren’t the driver. Amazingly, there’s more focus on if there will be a baseball season or not.” On the vaccine front, Moderna Inc. MRNA, +0.09% kicked off its late-stage trial while Pfizer Inc PFE, -0.27% and BioNTech BNTX, +1.23% entered late-stage trials of their candidates also. The Federal Reserve also began a two-day policy meeting on Tuesday that’s unlikely to result in much action, but is expected to see Chairman Jerome Powell underline a willingness to take further action to support the economy and maintain easy financial conditions. The Fed on Tuesday announced that its board of governors had decided to extend until the end of the year several emergency loan programs that had been set to expire on Sept. 30. The extensions should shore up confidence around markets that have surged back from a COVID-19-induced panic in large part due to monetary stimulus provided by the Fed, said Thomas Kee, chief executive of Stock Traders Daily, in a note. “The FOMC remains ‘locked and loaded’ and now the hedge funds that piggyback the FOMC have the extended confidence that the [Federal Open Market Committee] will be there to buy more if the market experiences the slightest amount of trouble through the end of the year,” he wrote, referring to the Fed’s policy-setting panel. “The FOMC has the facilities in place to do it without any policy adjustments.” In U.S. economic data, the Case-Shiller home price index for May rose 3.7% annually. The Conference Board’s consumer-confidence index fell to 92.6 in July from a revised 98.3 reading in June. Economists polled by MarketWatch had expected a reading of 96.0. The measure of how consumers feel about the economy right now actually rose to 94.2 in July from 86.7, but the subindex that gauges expectations about the future fell to a four-month low 91.5 from 106.1 in June. “The data signals that consumers, in the face of rising virus cases and a reversal in labor market gains, are becoming more cautious about the continued healing of the economy,” wrote economists Kathy Bostjancic and Gregory Daco of Oxford Economics, in a note. “While the present situations index increased on the month, if the economy does not regain forward momentum, we are likely to see some retrenchment in the present assessment soon.”Which companies were in focus? Pfizer Inc. PFE, -0.27% shares gained 3.9% after beating earnings and revenue expectations and raising its full-year outlook. 3M Co. MMM, +0.94% shares fell 4.9% after the diversified maker of health care, consumer and industrial products reported second-quarter profit and revenue that came in below expectations, with results “significantly impacted” by the COVID-19 pandemic. Shares of McDonald’s Corp. MCD, -0.43% slumped 2.5% after the fast-food chain reported earnings that fell short of Wall Street forecasts. Raytheon Technologies Corp. RTX, -1.46% shares fell 0.2% after it beat both earnings and revenue forecasts. Eastman Kodak Co. KODK, +12.98% shares soared 203.1% after The Wall Street Journal reported that the print and advanced materials and chemicals company secured a $765 million government loan to help with the production of drugs to treat a variety of medical conditions. Shares of Harley-Davidson Inc. HOG, -3.31% were 0.8% lower after the motorcycle maker swung to a loss in the second quarter and unveiled an overhaul of its business that will see it exit certain markets and streamline its product line. Department-store chain J.C. Penney JCP, -2.53% shares soared 23.5%, after Sycamore Partners on Monday was reported as poised to win an auction to buy the out of bankruptcy. Altria Group Inc. shares MO, +0.76% rose 0.9% Tuesday, after the cigarette maker reported second-quarter profits that topped expectations and management raised the dividend. Shares of Twitter Inc. TWTR, -0.23% closed down 0.7% after the social media platform suspended Donald Trump Jr.’s account for 12 hours after the president’s son shared a video showing doctors touting hydroxychloroquine as a COVID-19 treatment, which Twitter flagged as content that “may pose a risk to people’s health.” How did other markets trade? In Asia, China’s CSI 300 gauge 000300, +2.04% rose 0.9%, the Shanghai Composite SHCOMP, +1.67% gained 0.7%, Hong Kong’s Hang Seng Index HSI, -0.30% rose 0.7% and Japan’s Nikkei 225 NIK, -0.11% fell 0.3%. In Europe, the Stoxx 600 Europe index SXXP, +0.55% and the U.K.’s FTSE 100 UKX, +0.64% both closed 0.4% higher. Gold futures US:GCQ20 advanced 0.7% to a new all-time closing record of $1,944.60 an ounce, a day after hitting an all-time high, while the ICE U.S. Dollar Index DXY, -0.58% was up less than 0.1% a day after hitting a two-year low. US:CLU20 Oil futures closed at a more than one-week low as traders placed bets on supply data, with the U.S. benchmark US:CLU20 down 1.4% on the New York Mercantile Exchange. The yield on the 10-year U.S. Treasury note TMUBMUSD10Y, 0.777% was off 2.8 basis points at 0.581%, its lowest level since April 21, according to Dow Jones Market Data. Yields move in the opposite direction of prices."}]}