{"article": [{"url": "https://www.marketwatch.com/story/black-leaders-call-trumps-juneteenth-rally-in-tulsa-a-slap-in-the-face-2020-06-11", "published": 1591905620.0, "headline": "Black leaders call Trumpâ\u0080\u0099s Juneteenth rally in Tulsa â\u0080\u0098a slap in the faceâ\u0080\u0099", "body": "OKLAHOMA CITY â\u0080\u0094 Black community and political leaders called on President Donald Trump to at least change the Juneteenth date for a rally kicking off his return to public campaigning, saying Thursday that plans for a rally on the day that marks the end of slavery in America come as a â\u0080\u009cslap in the face.â\u0080\u009d Trump campaign officials discussed in advance the possible reaction to the Juneteenth date, but despite fierce blowback there are no plans to change it. See also: Joe Biden is the new favorite over Donald Trump in the 2020 election From Sen. Kamala Harris of California to Tulsa civic officials, black leaders said it was offensive for Trump to pick that day â\u0080\u0094 June 19 â\u0080\u0094 and that place â\u0080\u0094 Tulsa, an Oklahoma city that in 1921 was the site of a fiery and orchestrated white-on-black killing spree. â\u0080\u009cThis isnâ\u0080\u0099t just a wink to white supremacists â\u0080\u0094 heâ\u0080\u0099s throwing them a welcome home party,â\u0080\u009d Harris, a leading contender to be Democratic presidential candidate Joe Bidenâ\u0080\u0099s running mate, tweeted of Trumpâ\u0080\u0099s rally plans. â\u0080\u009cTo choose the date, to come to Tulsa, is totally disrespectful and a slap in the face to even happen,â\u0080\u009d said Sherry Gamble Smith, president of Tulsaâ\u0080\u0099s Black Wall Street Chamber of Commerce, an organization named after the prosperous black community that white Oklahomans burned down in the 1921 attack. At a minimum, Gamble Smith said, the campaign should â\u0080\u009cchange it to Saturday the 20th, if theyâ\u0080\u0099re going to have it.â\u0080\u009d Trump announced the rally plan Wednesday afternoon. It comes as his harsh law-and-order stance appears to fall increasingly out of sync with a growing concern over police abuse of African Americans after the killing of George Floyd in Minneapolis. Trump campaign officials defended the rally. â\u0080\u009cAs the party of Lincoln, Republicans are proud of the history of Juneteenth,â\u0080\u009d said Katrina Pierson, senior adviser to the Trump campaign. â\u0080\u009cPresident Trump has built a record of success for Black Americans, including unprecedented low unemployment prior to the global pandemic, all-time high funding for Historically Black Colleges and Universities, and criminal justice reform.â\u0080\u009d The Trump campaign was aware in advance that the date for the presidentâ\u0080\u0099s return to rallies was Juneteenth, according to two campaign officials, who were not authorized to speak publicly about internal discussions and spoke on condition of anonymity. When the date was discussed, it was noted that Biden had held a fundraiser a year ago on Juneteenth. Though choosing June 19 was not meant to be incendiary, some blowback was expected, the officials said. But the campaign was caught off guard by the intensity, particularly when some linked the selection to the 1921 massacre. Scheduling the highly anticipated comeback rally in Oklahoma, a state Trump won easily in 2016, raised eyebrows. The campaign picked Tulsaâ\u0080\u0099s BOK Center, with a listed seat capacity of 19,199. The arenaâ\u0080\u0099s Facebook page shows organizers calling off shows there by country singer Alan Jackson and other performers into mid-July, citing the coronavirus pandemic. Arena marketing director Meghan Blood said Thursday she didnâ\u0080\u0099t know yet about any plans for social distancing or other coronavirus precautions for Trumpâ\u0080\u0099s rally, which would be one of the larger public gatherings in the U.S. at this stage of the outbreak. Campaign officials said safety decisions would be made in coordination with local authorities. A disclaimer on the ticket registration website said attendees voluntarily assume all risks related to exposure to COVID-19 and agree not to hold the campaign liable for any illness. The campaign officials said the Trump campaign picked Oklahoma because arrangements could be made quickly, for a variety of reasons: Oklahoma has a Republican, Trump-friendly governor; the state is not seeing huge numbers of coronavirus cases; and the arena was â\u0080\u009cturn-keyâ\u0080\u009d and could easily be opened for the rally. Moreover, the rally will be held up the turnpike from a district held by Rep. Kendra Horn, one of the Democrats the GOP feels is vulnerable this fall. Campaign officials also wanted to hold the rally where they could all but guarantee a big crowd despite coronavirus concerns, according to the officials. Oklahoma is one of the most Republican states in the nation and Trump has not held a rally there as president, so it will likely deliver an enthusiastic audience eager to see him, the officials believed. Tulsa, an oil center along the Arkansas River, has had its own marches, viral videos and problematic police actions during this monthâ\u0080\u0099s unrest. On Tuesday, Tulsa police released video and said they were investigating officers who handcuffed and arrested two black teenagers for jaywalking. Video of the June 4 incident showed officers pinned one of the two unidentified teens stomach-down on the ground. â\u0080\u009cGet off me! I canâ\u0080\u0099t breathe! I canâ\u0080\u0099t breathe! I canâ\u0080\u0099t breathe!â\u0080\u009d one teen shouts in the police video. â\u0080\u009cYou can breathe just fine,â\u0080\u009d the officer replies. On Monday, a Tulsa police major played down police shootings of African Americans nationally by telling a radio show that statistically, â\u0080\u009cweâ\u0080\u0099re shooting African Americans about 24% less than we probably ought to be, based on the crimes being committed.â\u0080\u009d And on Wednesday, the same day Tulsa Mayor G.T. Bynum welcomed news of Trumpâ\u0080\u0099s rally pick as evidence of the cityâ\u0080\u0099s progress against COVID-19, Bynum apologized for remarks about a 2016 police killing of an unarmed black man. Bynum had said the killing was â\u0080\u009cmore about the really insidious nature of drug utilization than it is about race.â\u0080\u009d Nationally, as research brings to light more about the 1921 massacre, Tulsa increasingly is associated with the rampage in which white Tulsans razed a thriving black business community, killing as many as 300 people. Long dismissed by generations of white Tulsans as a race â\u0080\u009criot,â\u0080\u009d the May 31-June 1 events were marked this year by community memorials. Oklahomaâ\u0080\u0099s black Democratic Party chairwoman also condemned Trumpâ\u0080\u0099s rally plan. â\u0080\u009cA day set aside to commemorate the freedom of enslaved people must not be marred by the words or actions of a racist president,â\u0080\u009d Alicia Andrews said. Community groups had earlier canceled a main Tulsa Juneteenth celebration because of the coronavirus pandemic. Some black Tulsans said they planned to turn out for public protests of Trump on that day. â\u0080\u009cThereâ\u0080\u0099s definitely going to be demonstrating,â\u0080\u009d Gamble Smith said."}]}