{"article": [{"url": "https://www.marketwatch.com/story/why-early-retirement-is-all-its-cracked-up-to-be-2018-05-15", "published": 1595161820.0, "headline": "Why early retirement IS all itâ\u0080\u0099s cracked up to be", "body": "Sometimes, the stuff that people say about early retirement (and early retirees) is terrible. It is assumed that early retirement is the end of productive life and that unless weâ\u0080\u0099re swimming in millions in cold hard cash, early retirement will eat us alive. Today, it is my distinct honor and pleasure to debunk five of the most common of these myths, which also happen to be the ones that I hear most often. As I said in my one-year early retirement performance review, early retirement is all that itâ\u0080\u0099s cracked up to be. Itâ\u0080\u0099s a remarkable feeling of control, each and every day. It didnâ\u0080\u0099t take long before I forgot entirely that I didnâ\u0080\u0099t have any major income coming in. That part just didnâ\u0080\u0099t matter. My wife â\u0080\u0094 the money master in the family â\u0080\u0094 worked the budget so we are able to travel the country and have fun doing it without much thought about our financial picture. I rarely get bored, but thatâ\u0080\u0099s also because I had set up a plan of attack. I knew what I wanted to do with myself before I quit. Thatâ\u0080\u0099s essential. If you have no hobbies, then you probably wonâ\u0080\u0099t be happy sitting at home doing nothing. Doing nothing isnâ\u0080\u0099t what early retirement is all about. Here are the biggest myths of early retirement: You will completely lose your purpose in life To believe a statement like this, you must also believe that your job is the only source of purpose in your life. Respectfully, that just sounds devastating. A single point of failure. And, it does not represent my life. At all. There is more to life than your job. At least, there should be. What keeps me busy and full of purpose in early retirement? Full-time travel. We sold both of our homes and travel the country for a living. Full-time. Our Airstream is our home. Yes, our only home. We pulled out of the KOA in Tucson, Ariz., April 1 of 2017 and began our new lives of travel (we are temporarily back in the KOA, but weâ\u0080\u0099re leaving once again for permanent travel). Rockstar Finance. For near the entire year of 2016, I worked closely with J$ as his primary technical resource. I built out the entire Rockstar Directory from scratch (with J$ delivering the vision, of course). Today, I manage the operational side of Rockstar Finance after ESI Money bought Rockstar Finance, and I couldnâ\u0080\u0099t be happier. [ESI Money columns also appear on MarketWatch.] YouTube channel. My wife and I spend time running a growing YouTube channel. Iâ\u0080\u0099m the one filming the majority of the videos, and Iâ\u0080\u0099m also the guy who edits the videos and puts together the final product. Our talking videos only take about 30 minutes to edit, but hiking and exploration videos can take hours to edit with music. Itâ\u0080\u0099s fun, though! Fitness. Iâ\u0080\u0099m a fitness fanatic. In fact, I used to be that guy who went to the gym multiple times a day on some days. Yes, an actual â\u0080\u009cgym ratâ\u0080\u009d. Now, Iâ\u0080\u0099m working out at more reasonable intervals and enjoying more time away from the gym. This year, I will be taking my Planet Fitness gym membership with me around the country. As you can tell, Iâ\u0080\u0099ve been busy, but not too busy where Iâ\u0080\u0099ve felt overwhelmed by the work I was doing. Everything that I do is a passion. But still, there is a balance that needs to be maintained throughout early retirement. The idea is to keep that buttery sweet feeling of freedom and combine it with satisfying work that makes you feel productive, accomplished and useful.$1 million at retirement is nothing, youâ\u0080\u0099ll need more It might surprise many of you to know that we didnâ\u0080\u0099t have $1 million saved when we officially set sail in our Airstream. Thatâ\u0080\u0099s right, we arenâ\u0080\u0099t one of those â\u0080\u009crich peopleâ\u0080\u009d, though we are rich enough to make our lifestyle work. When you live at or below your means and actually care about where your money is going, people can live quite well on far less than a million. Live like kings, in fact. A million bucks is a wonderful milestone, but we donâ\u0080\u0099t need to reach it before retiring early. There is nothing inherently magical about the million-dollar figure, aside from all those zeros. Itâ\u0080\u0099s a completely arbitrary number. In fact, we may never need to reach it to keep our jobless dreams alive, and here is why. Four years of living expenses in short-term savings. We have almost four years of living expenses in our Ally savings account, which will provide a nice little buffer once the next recession hits. Until then, we live off our monthly cash flow from our passion projects (this cash flow was a complete surprise, by the way) and by depositing dividends into our checking account rather than reinvesting them (this was a recent change). Also, my wife drew a salary as she finished up a work commitment during the winter of 2017. Best of all, we are earning more and more with our passion projects. In March of 2018, we funded half of our lifestyle with just the money we earned from these projects. Amazing. Our lifestyle is cheap. We spend in the neighborhood of $30,000 to $35,000 a year. We do this by boondocking as much as possible on BLM land, which is free government-owned wilderness to call home â\u0080\u0094 usually for a maximum of 14 days before you need to move on. Find a spot, park your rig and enjoy nature. Of course, no hookups (electric, water and sewer) available, so youâ\u0080\u0099ll have to provide your own power, water and hold on to your waste products or dispose of them safely (thank you for making that job easier, Mr. Composting Toilet). We remain completely flexible and willing to change. Flexibility happens to be a critical element of our postretirement lifestyle. If things donâ\u0080\u0099t work out exactly like we planned, we change. We find a solution. It might include us working a seasonal job or two. Or, maybe we look for ways to reduce our spending. Choosing a lower cost of living area is another idea, to include overseas travel to areas like Thailand and Costa Rica. When youâ\u0080\u0099re retired, your options are virtually limitless. It is amazing what the impact of earning $15,000+ a year through our passion projects has on our long-term probability of success. When your expenses are low, every earned dollar is that much more valuable to your lifestyle. Earning an extra $15,000 a year for someone who spends $100,000 is one thing. But, an extra $15,000 a year for a couple who doesnâ\u0080\u0099t spend a penny over $35,000 suddenly becomes meaningful earnings.If you earn money after retirement, then you arenâ\u0080\u0099t retired To the retirement police, you canâ\u0080\u0099t be retired if youâ\u0080\u0099re making money by doing work. Doing work, after all, is what people do â\u0080\u009cfor a livingâ\u0080\u009d, and therefore, if you do something postretirement that generates cash, youâ\u0080\u0099re not actually retired. Because youâ\u0080\u0099re still making a living. As most of us in the financial independence and early retirement community know, our lives donâ\u0080\u0099t simply stop once we reach retirement (in many cases, itâ\u0080\u0099s quite the opposite). We donâ\u0080\u0099t sit and stare out the window. Many of us still choose to â\u0080\u009cworkâ\u0080\u009d after weâ\u0080\u0099ve quit our jobs. In fact, the earlier that one retires, the more likely it is he or she will spend their time doing something productive, even if that generates additional cash. Retirement means you are no longer beholden to a job to sustain your life. It doesnâ\u0080\u0099t mean that youâ\u0080\u0099re done being productive. Work, you see, is what we love. Jobs, on the other hand, drain our lifeblood from our souls. This difference is fundamental. Retirement to me is a way of life that exists once your net worth and passive income support you and your family for the duration of your lives without holding another job. Ultimately, that means one can sit and stare out of the window for the next 50 years if they like, literally doing nothing. But, early retirees donâ\u0080\u0099t do that.Early retirement in a trailer sounds like a life of destitution In mid-November of 2015, my retirement renaissance article got picked up by Business Insider. Business Insider often does publish personal finance material, but they are far from an early retirement resource. The publication is well read among the general population. The article describes my transition from a fairly big spender to an aggressive saver with a goal of retiring at 35 in pursuit of a life of freedom and choice. I mentioned that I no longer care about spending eight to 10 hours a day confined to an office and prefer to live life on my terms. Iâ\u0080\u0099m not following the traditional society-approved path in life. Neither are those like me. I have chosen a very different path in life, and naturally, the comments reflected that. Those who dare walk in a different direction from societyâ\u0080\u0099s traditions must be sticking their fingers in the eyes of everybody elseâ\u0080¦I guess. I think my favorite comment was this: â\u0080\u009cSo basically this man lives a quasi-destitute life in the present so that he can â\u0080\u0098retireâ\u0080\u0099 at 35?â\u0080\u009d Destitute. Is this truly what Americans believe a life of maximum saving and a freedom of choice truly means? Destitution? Letâ\u0080\u0099s take a look at my life of destitution, shall we? My wife and I have never been more happy or healthy. We travel the country full-time and wander our nationâ\u0080\u0099s wilderness, exploring our national parks and experiencing our cities. We wake up happy every day. Also, our carbon footprint is incredibly small. Our 500 watts of roof-mounted solar panels enable us to generate our own power during daylight hours and our composting toilet reduces the amount of sewage we generate to zero. Thatâ\u0080\u0099s right, no sewage. Ever. However, we donâ\u0080\u0099t live in a 4,000-square-foot house with multiple sitting rooms, glass display cases, a separate dining room and nook, a 500-square-foot en-suite bathroom and a marble foyer. We arenâ\u0080\u0099t permanently connected to the grid and paying $200 a month for electric service. No mortgage. No debt. Talk about destitution. The 4% Trinity Study rule is antiquated and outdated. There is no way you wonâ\u0080\u0099t run out of money Contrary to popular critique, the 4% safe withdrawal rate is not some one-size-fits-all approach that people â\u0080\u0094 come hell or high water â\u0080\u0094 must blindly and stubbornly adhere to for the duration of their retirements. Instead, a large majority of us are using the 4% rule as a guideline. Meaning, we use the 4% number as a starting point. As well-known personal finance and early retiree blogger Mr. Money Mustache writes (and one who happens to believe in the 4% principle), there are no guarantees in life and we should always adjust our expenditures based on economic conditions. We start at the 4% rule, but that doesnâ\u0080\u0099t mean that we canâ\u0080\u0099t adjust. The truth is thereâ\u0080\u0099s no way to tell whether or not we will run out of money. Sadly, I donâ\u0080\u0099t have one of those magic 8-balls. Life is entirely organic; itâ\u0080\u0099s not some equation that is consistently solvable by a calculator. Life doesnâ\u0080\u0099t work like that. We did use the 4% guideline to ballpark enough wealth to call it quits. But, we also know that early retirement isnâ\u0080\u0099t the end of productive work. Opportunities to earn additional income are all over society, and these are opportunities that we never saw because our full-time jobs kept our subconscious minds from accepting them. Without full-time work, our vision instantly becomes much more clear. In other words, weâ\u0080\u0099re people who are fully capable of change and flexibility. Early retirement requires both of these habits. Are there any other myths about early retirement that youâ\u0080\u0099ve heard? This column originally appeared on ThinkSaveRetire. It was modified and published with permission."}]}