{"article": [{"url": "https://www.marketwatch.com/story/everything-you-need-to-know-about-what-it-would-take-for-the-fda-to-approve-a-covid-19-vaccine-11600809562", "published": 1601047460.0, "headline": "Everything you need to know about what it would take for the FDA to approve a COVID-19 vaccine", "body": "A lab technician sorts blood samples for a COVID-19 vaccination study at the Research Centers of America in Hollywood, Florida. Chandan Khanna/Agence France-Presse/Getty Images With COVID-19 vaccines currently in the final phase of study, you’ve probably been wondering how the Food and Drug Administration will decide if a vaccine is safe and effective. Based on the status of the Phase 3 trials currently under way, it is unlikely that the results of these trials will be available before November. But it is likely that not just one but several of the competing COVID-19 vaccines will be shown to be safe and effective by the end of 2020. I am a scientist and infectious diseases specialist at the University of Virginia, where I care for patients with COVID-19 and conduct research on the pandemic. I am also a member of the World Health Organization Expert Group on COVID-19 Vaccine Prioritization.What is the status of COVID-19 vaccines in human clinical trials? Phase 3 studies are under way for the Moderna MRNA, +0.09% and BioNTech BNTX, +1.23% /Pfizer PFE, -0.27% vaccines and the Oxford/AstraZeneca AZN, +0.63% AZN, +1.16% viral vector vaccine and now the Johnson & Johnson viral vector vaccine. Follow the latest news on the coronavirus on MarketWatch Each of these vaccines uses the SARS-CoV-2 spike glycoprotein, which the virus uses to infect cells, to trigger the immune system to generate protective antibodies and a cellular immune response to the virus. Protective antibodies act by preventing the spike glycoprotein from attaching the virus to human cells, thereby neutralizing the SARS-CoV-2 virus that causes COVID-19. In the case of Moderna’s nucleic acid vaccine, the messenger RNA encoding the spike glycoprotein is encased in a fat droplet—called a liposome—to protect the mRNA from degradation and enable it to enter cells. Once these instructions are inside the cells, the mRNA is read by the human cell machinery and made into many spike proteins so that the immune system can respond and begin producing antibodies against this coronavirus. The Oxford/AstraZeneca and Johnson & Johnson JNJ, +1.39% vaccines use a different strategy to activate an immune response. Here an adenovirus found in chimpanzees shuttles the instructions for manufacturing the spike glycoprotein into cells. Phase 1 and 2 studies by the pharmaceutical companies Janssen and Merck MRK, -0.14% also use viral vectors similar to the Oxford/AstraZeneca vaccine, while vaccines by Novavax NVAX, +0.18% and GSK GSK, +1.10% and Sanofi SNY, +0.89% use the actual spike protein itself.Animal tests show the vaccines provide protection from coronavirus infection Studies in animal models of COVID-19 provide convincing evidence that vaccination with the spike glycoprotein will protect from COVID-19. Experiments have show that when the immune system is shown the spike protein—which alone cannot trigger disease—the immune system will generate an antibody response that protects from infection with SARS-CoV-2. In studies in hamsters an adenovirus viral vector—the approach used by Oxford/AstraZeneca, for example—was used to immunize with the spike glycoprotein. When the hamsters were infected with SARS-CoV-2 they were protected from pneumonia, weight loss and death. In nonhuman primates, DNA vaccines—which deliver the gene for the spike glycoprotein—reduced the amount of virus in the lungs. Animals that produced an antibody that prevented virus attachment to human cells were most likely to be protected.What have the early Phase 1 and 2 studies in humans shown? Overall, vaccination has triggered a more potent neutralizing antibody response than even that seen in patients recovering from COVID-19. This has also been the case for Moderna’s vaccine currently in Phase 3 trials and for vaccines from CanSino Biologics 6185, +0.69% and Oxford/ AstraZeneca.What side effects have been observed? Physicians have recorded mild to moderate reactions when the subjects were observed up to 28 days after vaccination. These side effects included mild pain, warmth and tenderness at the site of injection, and fever, fatigue, joint and muscle pain. But Phase 1 and 2 studies are by small by design, with just hundreds of participants. So these trials will not be large enough to detect uncommon or rare side effects. The emphasis on safety as the primary goal was recently demonstrated in the Phase 3 Oxford/AstraZeneca vaccine trial where one vaccinated individual developed inflammation of the spinal cord. It isn’t clear whether the vaccine caused this reaction—it might be a new case of multiple sclerosis unrelated to the vaccine—but the Phase 3 trial was halted in the U.S. until more is known.How is the FDA ensuring that a vaccine will be safe yet quickly produced? The FDA has issued guidance for industry on the steps required for developing and ultimately licensing vaccines to prevent COVID-19—these are the same rigorous safety standards required for all vaccines. There are, however, ways to speed the process of approval that are centered on “platform technology.” What this means is that if a vaccine is using an approach such as an adenovirus that has previously been shown to be safe, it may be possible for a company to use previously collected data on toxicity and pharmacokinetics to fast-track clinical trial approval. ile speed and safety may appear conflicting goals, it is also encouraging to note that the rival vaccine manufacturers have jointly pledged not to bow to any political pressures to rush vaccine approval, but to maintain the most rigorous safety standards.How protective does a vaccine need be to receive FDA approval? The FDA has set the bar for the primary endpoint of a Phase 3 trial of 50% protection for approval of a COVID-19 vaccine. Protection is defined as protection from symptomatic COVID-19 infection, defined as laboratory-confirmed SARS-CoV-2 infection plus symptoms such as fever or chills, cough, shortness of breath, fatigue, muscle aches, loss of taste or smell, congestion or runny nose, diarrhea, nausea or vomiting. This means that an effective vaccine is considered one that will reduce the number of infections in vaccine recipients by half. This is the minimal protection that is anticipated to be clinically useful. That is, in part, because lower levels of efficacy could paradoxically increase COVID-19 infections if it leads vaccinated people to decrease mask wearing or social distancing because they think they are completely protected. Since a vaccine might be more effective at preventing severe COVID-19, the FDA instructs that protection from severe COVID-19 should be a secondary endpoint. FDA to announce tough guidelines that could delay approval of vaccine, Washington Post reportsHow many people have to be vaccinated to know if a vaccine works in Phase 3? The current Phase 3 trials are enrolling 30,000-40,000 subjects. Most of these participants will receive the vaccine and some a placebo. When, exactly, the results of Phase 3 studies will be released depends in large part on the rate of infection in the placebo recipients. The way that these vaccine studies work is that they test if naturally acquired new coronavirus infections are lower in the group that received the vaccine compared with the group receiving the placebo. So while it is good news that COVID-19 infections have dropped recently in the U.S. from 70,000 to 40,000 cases per day, this drop in new infections may slow the vaccine studies.Will Emergency Use Authorization fast-track vaccine? In an emergency such as we are faced with the COVID-19 pandemic, with approximately 700 new deaths and 40,000 new cases per day right now, the FDA is authorized to allow the use of unapproved products for the diagnosis, treatment and prevention of disease. That includes a vaccine. The standard approval process for vaccines can require more than one year of observation after vaccination. If the short-term safety is good and the vaccine works to prevent COVID-19, then the vaccine should be approved for use under an Emergency Use Authorization while it is still being studied. Under Emergency Use Authorization, the FDA will continue to collect information from the companies producing the vaccines for benefit and harm, including surveillance for vaccine-associated enhanced respiratory disease or other potentially rare complications that might be observed in only one in a million.What should we expect in terms of approvals? I expect that the FDA will approve several vaccines by the end of 2020 under its Emergency Use Authorization authority so that vaccination can begin immediately, starting with high-risk groups including first responders, health-care personnel, and the elderly and those with pre-existing medical conditions. This will be followed rapidly with rollout of vaccination to the population at large, while all of the time the FDA and vaccine manufacturers will continue to monitor for side effects and work to improve upon these first vaccines. This process is expected to take months. It may not be life back to normal next year, but all signs point to a healthier 2021. William Petri is professor of medicine at the University of Virginia. This commentary was originally published by The Conversation—How and when will we know that a COVID-19 vaccine is safe and effective? .wsj-interactive.generic-iframe-embed[name=\"counter\"] { height: 1px; margin-bottom: 5px; } .at16units .bleed .wsj-interactive.generic-iframe-embed[name=\"counter\"] { height: 1px; } body.at12units .bleed .wsj-interactive.generic-iframe-embed[name=\"counter\"] { height: 1px; } body .inline .wsj-interactive.generic-iframe-embed[name=\"counter\"], body .offset .wsj-interactive.generic-iframe-embed[name=\"counter\"], body .header .wsj-interactive.generic-iframe-embed[name=\"counter\"], body.at8units .bleed .wsj-interactive.generic-iframe-embed[name=\"counter\"] { height: 1px; } body.at4units .inline .wsj-interactive.generic-iframe-embed[name=\"counter\"], body.at4units .offset .wsj-interactive.generic-iframe-embed[name=\"counter\"], body.at4units .header .wsj-interactive.generic-iframe-embed[name=\"counter\"] { height: 1px; } Other commentaries by William Petri: Here’s the latest on what we know works—and doesn’t work—in treating coronavirus infections How to stay safe from coronavirus in a public restroom"}]}