{"article": [{"url": "https://www.marketwatch.com/story/with-trump-postponing-a-stimulus-package-heres-what-joe-bidens-coronavirus-relief-plan-would-prioritize-11602089318", "published": 1602154700.0, "headline": "With Trump postponing a stimulus package, here's what Joe Biden's coronavirus relief plan would prioritize", "body": "President Donald Trump delayed plans to enact a second stimulus package before the November election, putting Democratic presidential nomineeJoe Biden's plan for stimulus in the spotlight (Photo by ROBERTO SCHMIDT / AFP) (Photo by ROBERTO SCHMIDT/AFP via Getty Images) Roberto Schmidt/Agence France-Presse/Getty Images President Donald Trump's move to end negotiations on a second stimulus package until after the Nov. 3 election puts new focus on his Democratic challenger Joe Biden's coronavirus relief proposal. The fate of the next potential stimulus package could lie in Biden's hands. Biden is ahead in most major polls. Since Trump's coronavirus diagnosis, Biden's lead over Trump appears to have grown. Here's what Joe Biden's coronavirus relief proposal would prioritize:More stimulus checks, \"should conditions require\"  The Biden campaign calls the $1,200 stimulus checks (plus an additional $500 per child) that millions of Americans received under the the CARES Act a \"good start.\" As of June, an estimated one-third of Americans had used these checks to to pay their bills, including rent, studies show. Some used the money to buy food; others made discretionary purchases. Biden would \"provide for additional checks to families should conditions require,\" his campaign website states. It's not clear who would potentially qualify for additional stimulus checks. Campaign staff did not immediately respond to MarketWatch's request for a comment.Forgiving at least $10,000 of each student-loan borrower's federal loans Biden's stimulus package would forgive a minimum of $10,000 in federal student loans for each borrower, according to Biden's campaign site. Canceling $10,000 in student debt would completely wipe away the loan balances of 30% of borrowers, according to a Brookings Institution analysis. Related: How a President Biden or a President Trump could affect the student-debt crisis and college affordability Biden has also proposed canceling federal undergraduate student debt for borrowers earning up to $125,000, as long as it was related to their education at a public college, a Historically Black College or university or Minority Serving Institution. Biden has not indicated that proposal as a priority for his first stimulus package if elected president.Adding $200 to monthly Social Security checks The average Social Security check Americans received in June was $1,514, according to an August report by the Center on Budget and Policy Priorities, a think tank focused on the impact of budget and tax issues on inequality and poverty. That amounts to $18,170 a year. Biden's proposal calls for increasing Social Security checks by $200 a month. On average, that would mean that Social Security beneficiaries -who include some 64 million retired workers, people with disabilities, and survivors of deceased workers - would have nearly $2,400 more a year.Paying for coronavirus testing and treatment Nearly one-third of Americans indicated that they would not be willing to pay a cent for a coronavirus vaccine, once it's available, according to a recent nationally representative Axios/Ipsos Coronavirus Index poll. Biden's stimulus priorities call for ensuring that \"no one has to pay a dollar out of pocket for COVID-19 testing, treatment, or an eventual vaccine.\" Extending unemployment benefits The extra $600 a week that unemployed workers were receiving in federal unemployment benefits expired at the end of July. Biden has called for extending unemployment benefits \"as long as public health and economic conditions call for it,\" but has not named a specific dollar amount.How much would Biden's stimulus proposal cost taxpayers? The Biden campaign did not respond to a request for comment. Axios reported that economists on Biden's advisory team have privately said this package could cost $1 trillion to $2 trillion. A subsequent stimulus package Biden's campaign has published could cost another $3 trillion.Democrats and Republicans have some common priorities for a second stimulus The stalled stimulus talks come after negotiations between House Democrats and Senate Republicans had generated hope that a second stimulus package would come to fruition. Democrats had recently proposed a slimmed-down $2.4 trillion stimulus proposal that knocked $1 trillion off the original version of the HEROES Act passed May. Republicans, led in part by members of the Trump administration, upped their bid by $1.1 trillion from the $500 billion HEALS Act proposal that failed to pass in the Senate. Both parties appeared to agree to a second round of direct stimulus checks; $400 in weekly unemployment benefits, according to some reports; and increased funds for state and local governments. Despite President Donald Trump's admission to Walter Reed Hospital after testing positive for coronavirus, he expressed over Twitter on Oct. 3 that he wanted to sign a stimulus package to law. iframe.twitter-tweet { width: 100% !important; } Three days later, Trump's appetite for a stimulus package seemed to diminish. Related: As Trump abandons stimulus talks, renters and landlords face a financial cliff \"I have instructed my representatives to stop negotiating until after the election when, immediately after I win, we will pass a major Stimulus Bill,\" Trump tweeted on Tuesday. After Trump's tweet on Tuesday, all major U.S. stock indexes SPX, +0.87% DJIA, +0.56% COMP, +1.39% plunged. A few hours later, however, in another flurry of tweets, Trump said that he would immediately sign individual stimulus measures, if sent to him, including another round of $1,200 individual stimulus checks, a package of $25 billion in airline payroll support, and $135 billion for the Paycheck Protection Program for small businesses, which he said could be paid for with unused funds from the CARES Act. House Speaker Nancy Pelosi has previously rejected Republican proposals to pass stand-alone stimulus proposals. Recently, however, she has conveyed openness to passing relief measures targeted at the airline and restaurant industries. In a Wednesday interview, Pelosi said her party's priorities in a second stimulus package included a child tax credit, food insecurity and evictions. \"Our plan and the plan of Joe Biden is one course. We'd like the plan to be implemented right now. We wanted to implement it months and months ago, but the administration has resisted,\" Pelosi said Wednesday on ABC's \"The View.\""}]}