{"article": [{"url": "https://www.marketwatch.com/story/fauci-urges-schools-to-hold-classes-outdoors-as-much-as-possible-11597357573", "published": 1597343660.0, "headline": "Fauci urges schools to hold classes outdoors as much as possible", "body": "Dr. Anthony Fauci, director of the National Institute for Allergy and Infectious Diseases, speaks on Capitol Hill on July 31. Associated Press School districts developing their plans for reopening for the new academic year should find ways to offer as man outdoor activities as possible, from classes to recess and lunchtime, the nation’s top infectious disease expert recommended in an online discussion Thursday. Dr. Anthony Fauci, who heads the National Institute of Allergy and Infectious Diseases, also suggested in his Facebook Live chat with Rhode Island Gov. Gina Raimondo that, on school buses, windows should remain open and students wear their masks as much as possible. “Get as much outdoors as you can. If you look at the superspreader events that have occurred, they’re almost always inside,” he said, citing major outbreaks at nursing homes, meatpacking warehouses, prisons and weddings and other social events. And when asked by Raimondo what his recommendation would be for reopening schools, Fauci said states shouldn’t take an all-or-nothing approach. Communities with low virus levels should be allowed to open for in-person classes, while those with higher case counts should focus on remote learning until the rate declines, he said. “If you want to open schools, do what you need to do,” Fauci said. “Close the bars. Wear your masks. Because when you do that, you will bring the infections down.” Fauci, who has, at times, found himself at odds with Republican President Donald Trump’s response to the coronavirus pandemic, also praised Rhode Island’s efforts to keep its virus caseload relatively low. “You are starting from a very good place,” he said, noting Rhode Island is considered among the lowest-risk states, with a positive infection rate of less than 5% for the virus. Raimondo, a Democrat, on Wednesday delayed the start of school in Rhode Island from Aug. 31 to Sept. 14 as virus cases continue to rise in the state and elsewhere. More than 1,000 people have died in Rhode Island from COVID-19, and the state has had more than 20,000 positive cases of the virus since the pandemic started. In an online discussion hosted by Brown University last week, Fauci urged states to take quick action to stamp out even slight upticks in COVID-19 cases. He also said he’s “cautiously optimistic” a COVID-19 vaccine could be developed soon, but acknowledged the chances it would be highly effective are “not great.”"}]}