{"article": [{"url": "https://www.marketwatch.com/story/heres-one-depressing-thing-covid-19-and-the-1918-spanish-flu-have-in-common-2020-08-17", "published": 1598370740.0, "headline": "COVID-19 and 1918 â\u0080\u0098Spanish fluâ\u0080\u0099 have one depressing thing in common", "body": "How much has changed? The 2020 coronavirus and 1918 Spanish influenza pandemics have many differences and share many similarities, but they also converge on one key point: their impact on the economy and employment and, in particular, how wealthier people had better odds of surviving their respective pandemics. Both pandemics involve novel, highly contagious, respiratory viruses, spread across the world in a matter of months and, as of August 2020, COVID-19 â\u0080\u0094 like the 1918 influenza â\u0080\u0094 lacks a vaccine. During the 1918 pandemic, people wore masks and employed social distancing as much as possible instead, just like today. Related: Another warning from 1918 Spanish flu for COVID-19: â\u0080\u0098Survival does not mean that individuals fully recoveredâ\u0080\u0099 A new working paper released Monday looked at the effects of the 1918 influenza and COVID-19 pandemics on mortality and the economy, plus the role of non-pharmaceutical interventions such as mask wearing and social distancing, and the impact on workers and socioeconomic status. Even though both of these pandemics occurred 100 years apart, they had one depressing commonality, according to the research carried out by economists at Vanderbilt University in Nashville, Oberlin College in Oberlin, Ohio, and Carnegie Mellon University in Pittsburgh. During the 1918 influenza pandemic, wealthier people had a better chance of survival: Individuals of moderate and higher economic status had a mortality rate of 0.38%, versus 0.52% for those of lower economic status and 1% for those who were â\u0080\u009cvery poor,â\u0080\u009d they wrote. The economists â\u0080\u0094 Brian Beach, Karen Clay, Martin Saavedra â\u0080\u0094 said pandemics may exacerbate health disparities by disproportionately affecting groups more likely to suffer from risk factors, such as underlying, chronic conditions, including diabetes, and other cardiovascular issues. â\u0080\u009cCompared to individuals who lived in one-room apartments, individuals who lived in two-room, three-room, and four-room apartments had 34%, 41%, and 56% lower mortality, respectively,â\u0080\u009d they added. Similarly, multi-generational households were more at risk from coronavirus in 2020. Women were harder hit by both pandemics economically Some 500 million people, or one-third of the worldâ\u0080\u0099s population, became infected with the 1918 Spanish flu. An estimated 50 million people died worldwide, with about 675,000 deaths occurring in the U.S., according to the Centers for Disease Control and Prevention. COVID-19 has now killed at least 813,265 people worldwide, and 177,279 in the U.S., Johns Hopkins University says. As of Tuesday, the U.S. still has the worldâ\u0080\u0099s highest number of COVID-19 cases (5,740,909). Worldwide, there has been at least 23,658,038 confirmed cases, which mostly does not account for asymptomatic cases. There were some differences between the first and second waves in 1918. Using data from military, insurance, and death records, earlier research showed that Blacks had lower morbidity and mortality rates, but higher case-mortality rates than whites during the second wave in 1919. â\u0080\u009cThis finding is striking given the evidence from other contexts that lower socioeconomic groups were more affected by the pandemic,â\u0080\u009d they wrote. â\u0080\u009cIt is possible that Blacks may have had greater exposure to the milder spring wave and thus some immunity to the more deadly second wave.â\u0080\u009d Although it seems unlikely that the 1918 pandemic significantly affected gender equality, as few married women participated in the labor force during 1918, a man who lost his spouse to the virus in 1918 likely would been less economically affected than a widowed women. In 2020, the International Labour Organization said women were likely harder hit economically. They are in greater danger of contracting COVID-19 and less likely to have Social Security coverage, â\u0080\u009cas they make up the vast majority of domestic, health and social-care workers globally.â\u0080\u009d The organization warned that women were disproportionately affected, â\u0080\u009cwith almost 510 million women, or 40% of all employed women, working in the industries with most job losses compared to 36.6% of men, which includes food and accommodation, retail and real estate.â\u0080\u009d The 2020 pandemic may have a shorter economic shock Both pandemics caused an economic contraction, reducing both gross domestic product and employment. â\u0080\u009cBusinesses and schools temporarily shut down in many places, although those shutdowns were less stringent than what occurred in the spring of 2020,â\u0080\u009d the economists said. â\u0080\u009cMany studies disagree on the size of the contraction and how long the effects lasted. Some suggest the economy recovered by the time the pandemic was over, whereas others argue that the economy recovered in two to three years.â\u0080\u009d There, however, the two pandemics part ways. â\u0080\u009cWith COVID-19, working-age adults are among the most likely to survive,â\u0080\u009d Beach, Clay, and Saavedra wrote. â\u0080\u009cIt is thus unlikely that COVID-19 will generate a similarly sized negative labor supply shock.â\u0080\u009d As separate research by Deutsche Bank DB, -0.85% said: â\u0080\u009cFor COVID-19, the elderly have been overwhelmingly the worst hit.â\u0080\u009d Approximately eight in 10 deaths in the U.S. from coronavirus were among those who were 65 or older, according to the Centers for Disease Control and Prevention. Though the 1918 pandemic is forever associated with Spain, this strain of H1N1 was discovered earlier in Germany, France, the U.K. and the U.S. But similar to the Communist Partyâ\u0080\u0099s response to the first cases of COVID-19 in China, World War I censorship buried or underplayed those reports. â\u0080\u009cIt is essential to consider the deep connections between the Great War and the influenza pandemic not simply as concurrent or consecutive crises, but more deeply intertwined,â\u0080\u009d historian James Harris wrote in an article about the pandemic. Coronavirus update: COVID-19 has now killed at least 815,248 people worldwide, and 177,873 in the U.S., Johns Hopkins University says. As of Tuesday, the U.S. still has the worldâ\u0080\u0099s highest number of COVID-19 cases (5,759,147). Worldwide, there has been at least 23,729,008 confirmed cases, which mostly does not account for asymptomatic cases. The Dow Jones Industrial Index DJIA, +0.56% was lower Tuesday as consumer confidence sinks to new pandemic low, while the S&P 500 SPX, +0.87% and the Nasdaq Composite COMP, +1.39% Â were slightly higher. Last week, the Federal Reserve minutes urged Congress for more pandemic aid, underscoring the challenge to the countryâ\u0080\u0099s economic recovery. AstraZeneca AZN, +1.16%, in combination with Oxford University; BioNTech SE BNTX, +1.23% and partner Pfizer PFE, -0.27% ; GlaxoSmithKline GSK, +1.10% Johnson & Johnson JNJ, +1.39% ; Merck & Co. MERK, +1.59% ; Moderna MRNA, +0.09% ; and Sanofi SAN, -1.48% are among those are currently working toward COVID-19 vaccines."}]}