{"article": [{"url": "https://www.marketwatch.com/story/how-to-protect-america-from-the-next-economic-calamity-11601997250", "published": 1601983340.0, "headline": "How to protect America from the next economic calamity", "body": "Illustration by Kevin Whipple America has a long way to go when it comes to economic resilience. Since the start of the coronavirus pandemic, there have been shortages of critical protective equipment, ventilators and tests, and supplies often haven’t come online fast enough to meet communities’ urgent needs. Authorities worry about how fast supply chains and distribution networks will be able to make an eventual vaccine widely available. Months of people staying at home, with the prospect of months more, has meant a shuttered economy in many parts of the country and millions of people unemployed. Over 200,000 Americans have died, about four times the casualties we suffered in the Vietnam War. If resilience is the ability to weather a challenge successfully and bounce back, this isn’t it. Part of the reason for our relative lack of economic resilience is that the federal government isn’t designed for it. In other areas, there are agencies that are prepared. FEMA springs into action for a range of emergencies. The Department of Defense is ready for military conflict. But when it comes to economic challenges, we don’t have a system that is built to plan for a crisis – or respond to it. Many of the problems facing the U.S. today are the result of a lack of preparedness. No agency assesses how contemporary threats would impact the vulnerability of all our supply chains. The Federal Trade Commission allowed a medical device merger that threatened ventilator production, contributing to shortages. Despite warnings from the medical community, the Trump administration imposed high tariffs on critical medical products as part of its conflict with China. “ The Congressional Budget Office estimates that the COVID-19 pandemic will cost the U.S. economy $7.9 trillion. ” And when it comes to responding to the COVID-19 crisis, there wasn’t a law, waiting to be activated, to provide direct payments to small businesses in crisis. There wasn’t a system to keep people employed, so they didn’t need to lose their jobs. There weren’t even plans for some of these challenges. Instead, Congress was left to rush through bailouts and financial packages. Responses like the Small Business Paycheck Protection Program did not do enough to help the very small businesses for whom the program is named. And a hodgepodge of efforts at the private, state and federal level have had to try to improve supply chain issues. The economic turmoil in the United States today is not a one-time crisis. This summer has given us ample evidence of other challenges to America’s economic resilience. Wildfires have consumed millions of acres in the western United States, leaving death and destruction in their wake. Multiple hurricanes have pounded the Gulf Coast, causing massive flooding, damage and dislocation. The economic harm from these events is massive. A recent report from the Commodity Futures Trading Commission found that climate change “poses a major risk to the stability of the U.S. financial system and to its ability to sustain the American economy.” Hurricane Sandy in 2012 caused approximately $75 billion in damage, while Hurricane Katrina in 2005 caused roughly $125 billion. The Congressional Budget Office estimates that the COVID-19 pandemic will cost the U.S. economy $7.9 trillion. In addition to pandemics and climate shocks, we could see more purposeful forms of interference in American economic life, such as attacks on the electricity grid. All of these events can bring on an economic crisis. We are also in a new era of great power competition with China and Russia. Foreign policy makers increasingly use terms like “geoeconomics” and “weaponized interdependence” to indicate that some of the biggest international threats are now economic. The federal government needs a strategy for economic resilience and an agency to execute it. Congress should therefore create a new Department of Economic Resilience. At present, the federal government’s work on trade, export controls, economic security and domestic economic development — all essential to an economic resilience strateg — are fractured across multiple departments and agencies. People in these agencies pursue their own missions with admirable gusto, but none of them has economic resilience as their raison d’être. So it is no surprise that America’s economic security isn’t at the forefront of planning, resources or efforts anywhere in the government. The new department should replace the Department of Commerce, merging many scattered offices into one institution with a clear, focused mission, and the ability to align these offices to achieve that mission. For example, the Economic Development Agency (EDA) and Minority Business Development Agency (MBDA) are within Commerce, but the Small Business Administration (SBA) rests outside of it. Much of economic and industrial security is within Commerce, but economic sanctions are no — nor are all of export controls. The International Trade Administration is within Commerce, but the U.S. Trade Representative (USTR) is outside of it. And when trade creates domestic dislocations, trade adjustment assistance (TAA) is run from the Labor Department, the Agriculture Department, or the Commerce Department, depending on who the affected party is. A single department would be able to coordinate and plan across these divisions more seamlessly. It would also have higher status — and as a result, be able to recruit top talent who see the critical importance of enhancing America’s economic resilience. One of the core functions of the new department would be to produce a national economic resilience strategy every four years, akin to the Pentagon’s national defense strategy. The strategy would identify the major threats and dangers to American economic resilience, identify vulnerabilities and bottlenecks in critical supply chains, and make plans and recommendations for how to address those challenges. Part of the reason a new department is necessary — rather than a one-time blue-ribbon commission or task force — is that much of this work is labor intensive and ongoing. It requires detail-oriented civil servants to work through many sectors to determine economic vulnerabilities. These vulnerabilities differ if the crisis is sparked by a hurricane, an extended power outage or another pandemic, and they change over time as the economy evolves. The department’s economic resilience mission would also enable it to develop and coordinate a strategy to address geographic inequality within the United States. Studies show that the dislocations caused by American trade policies have been felt disproportionately in some communities over others, and those communities haven’t bounced back. As the failure to align our tariffs on Chinese products with the risks created by a pandemic illustrate, coordination between domestic economic development agencies and international trade offices is critical. A new department could conduct studies on the regions that might be most severely impacted from a trade agreement and then coordinate TAA and programs at the SBA, MBDA, and EDA to enable community development. Of course, some might argue that it is simply too hard to embark on a major restructuring of the government. But many of the biggest reforms to American government have taken place during or right after a crisis. Lincoln pushed forward a complete overhaul of banking law in the middle of the Civil War. The Securities and Exchange Commission was created during the Great Depression. The reorganization of all of our national security agencies happened immediately after World War II. The Department of Homeland Security was created a year after the Sept. 11 attacks. Big reforms happen with big crises because Americans can see right before their eyes why action is essential. Others might point out that government reorganizations always face the pesky problem that members of Congress don’t want to give up their committees’ jurisdiction over agencies. There is an easy solution to this problem too. The new department would have overlapping oversight from multiple congressional committees, and Congress would phase out that system after 12 years and rest oversight in a single congressional committee. That would give members more than enough time to migrate to new committees. But most important, the reason to create a new department is that we can’t afford not to have one. The COVID-19 crisis has already cost the U.S. dearly – in health, wealth and well-being. We know there will be more crises coming down the line. If we do not put ourselves in the best position to weather them, shame on us. Ganesh Sitaraman is Professor of Law and Director of the Program on Law and Government at Vanderbilt University Law School. His most recent book is “The Great Democracy: How to Fix our Politics, Unrig the Economy, and Unite America.” Timothy Meyer is Professor of Law and Director of International Legal Studies at Vanderbilt University Law School. He is an expert on international and U.S. trade law and U.S. constitutional law."}]}