{"article": [{"url": "https://www.marketwatch.com/story/kroger-to-launch-two-ghost-kitchens-as-food-chains-get-creative-during-coronavirus-11602152461", "published": 1602147320.0, "headline": "Kroger to launch two ghost kitchens as food chains get creative during coronavirus", "body": "Kroger is jumping on the ghost kitchen trend that has accelerated during COVID-19 Kroger Kroger Co. said Thursday that it will launch two ghost kitchens at stores in Indianapolis and Columbus, Ohio through a partnership with ClusterTruck, a company that launched its first kitchen in 2016. A ghost kitchen is a cooking space that prepares food for delivery or to go. Ghost kitchens have grown more popular during COVID-19 as restaurant dining rooms have shuttered, customers have grown cautious about eating indoors, and online ordering has gained customers. Kroger KR, +0.46% is also an investor in ClusterTruck, though the grocery giant did not disclose all of the financial details of the partnership. Kroger and ClusterTruck piloted kitchens in Dec. 2019. See: Online grocery sales will skyrocket but margins take a hit, analysts say Each of the new kitchens will be about 1,000 square feet, and the menu will consist of about 80 meals that Kroger describes as “quality you can get at a sit-down restaurant with the personality of street food.” Kroger says the expanded partnership comes after the grocer experienced a 127% rise in digital sales during the second quarter. ClusterTruck’s delivery process is aided by technology to ensure that meals are delivered to the customer within seven minutes of preparation and within 30 minutes of ordering. Orders are placed through the ClusterTruck app or on that company’s website and can be delivered to a customer’s home or picked up at a participating Kroger store. Menus will be branded with the ClusterTruck name, though Kroger will provide some in-store promotion. “As part of the Restock Kroger initiative launched in 2018, Kroger has prioritized offering new prepared fresh food options and developing new ways for customers to engage via e-commerce,” a Kroger spokesperson told MarketWatch. Also: Shares of avocado producer Mission Produce soar 18% as trading begins “Our insights tell us that the use of and interest in on-demand ordering continues to grow — and as customers seek out more convenient, seamless meal ordering options, the ClusterTruck partnership allows Kroger to meet this evolving need.” Kroger is launching its latest ghost kitchens at a time when food companies, including restaurants, are getting creative with their brands as well as their space. In addition to ghost kitchens, restaurant chains are also launching virtual brands, which offer specialized menus that capitalize on the kitchen space and marketing abilities of existing companies. Chili’s parent Brinker International Inc. EAT, +1.00% launched its virtual chicken chain It’s Just Wings during the final weeks of its fiscal 2020 year. By the time Brinker announced its earnings in August, the company said It’s Just Wings had the potential to be a $150 million brand in its first year. “[W]e had to buy a couple of small refrigerators in a couple of restaurants, but for the sales volume that it generates, it’s really capital-free,” Brinker Chief Executive Wyman Roberts said on the earnings call, according to FactSet. On the flip side, Eugene Lee, chief executive of Olive Garden parent Darden Restaurants Inc. DRI, -1.34%, said on his company’s fiscal first-quarter earnings call last month that virtual brands are “not the right approach” for them. “We want to focus on brands that we have got 20-plus year and hundreds of millions of dollars invested in trying to build and we want to make sure that they are executing at a high level,” he said, according to FactSet. Monica Challingsworth, head of global relationships at Synergy Restaurant Consultants, agrees that ghost kitchens and virtual brands might not be for every company. She has worked with Darden. With businesses impacted by the coronavirus pandemic, there must be considerations made for execution, marketing and other factors. A large company with many brands, like Darden, would likely have problems making a virtual brand strategy work. Don’t miss: Amazon Prime Day could generate nearly $10 billion in sales, experts forecast “They take so much pride in being consistent, testing items, implementing it,” Challingsworth said. “It would take so long and you don’t know that it will be successful.” Virtual brands and ghost kitchens were on the rise pre-COVID, but Challingsworth expects that many will go under once the pandemic is over. “We were oversaturated with restaurants,” she said. “Everyone switching and jumping to these ghost kitchens and virtual brands, some will fail.” On Sept. 16, KeyBanc Capital Markets raised the price target for Darden Restaurants to $102 from $87 while maintaining its overweight stock rating. “Olive Garden’s sales recovery has lagged that of several big casual dining brands with the absence of third-party delivery partnerships and/or virtual concepts, limited outdoor seating (no tents in parking lots), and a more nuanced floor plan that limits capacity under social distancing restrictions,” wrote analysts led by Eric Gonzalez. “That said, we believe these issues are transitory. Wait times remain elevated at peak times despite limited advertising investment, no new innovation, and a pause in the promotional schedule. This suggests an opportunity exists for Olive Garden to drive demand at the appropriate time.” In a conversation after that note was published, Gonzalez pointed out the differences between Brinker restaurants, which also includes Chili’s and Maggiano’s brands. “The real differentiator is capacity,” he said. “The average Chili’s is more in rural, suburban areas whereas Olive Garden has two locations in Manhattan. Chili’s traffic is down, comping slightly negative and traffic is generally negative, so there’s plenty of capacity without disrupting business.” Moreover, Olive Garden isn’t set up digitally to easily launch a virtual brand, he said. Still, the barrier to entry for these ghost kitchens and virtual brands is low, Gonzalez said. And: Halloween sales forecast could be frightful to companies trying to create holiday season momentum COVID-19 has accelerated the move to digital ordering and ghost kitchens, Gonzalez said, in much the same way that the pandemic accelerated the shift to e-commerce that is happening in retail. The model isn’t perfect, and there are many diners who miss eating out. But Gonzalez estimates that there were hundreds of thousands of restaurants operating in the U.S. before the pandemic, more than there should have been. “There will always be an element of service and people looking for a dine-in experience,” he said. “But I don’t know that we need 600,000 or 700,000 restaurants in this country.” Kroger sees a demand for its ghost kitchens, and the results from the first two locations will determine whether it will expand further. “The new on-premise kitchen, in partnership with ClusterTruck, is an innovation that streamlines ordering, preparation and delivery, supporting Kroger as we meet the sustained customer demand for quick, fresh restaurant-quality meals, especially as we navigate an unprecedented health crisis that has affected every aspect of our lives, including mealtime,” said Dan De La Rosa, Kroger’s group vice president of fresh merchandising, in a statement. Kroger stock has rallied 17.4% for the year to date while the S&P 500 index SPX, +0.87% is up 5.8% for the period."}]}