{"article": [{"url": "https://www.marketwatch.com/story/retailers-are-shutting-stores-amid-covid-19-but-could-be-getting-stronger-in-the-process-says-bmo-11599839700", "published": 1600082480.0, "headline": "Retailers are shutting stores amid COVID-19 but could be getting stronger in the process, says BMO", "body": "Coronavirus is giving retailers a chance to reorganize for growth, analysts say Getty Images The coronavirus pandemic has hurt the retail sector in many ways, but forcing some companies to shutter stores may not be one of them, according to BMO Capital Markets. Analysts led by Simeon Siegel say the pandemic has forced many retailers to act quickly to “shrink to grow,” creating a chance to thrive that doesn’t come up often. “As retailers choose which stores to open, rather than close, we believe the pandemic created a (hopefully) once in a lifetime opportunity for companies to focus on health, rather than growth,” analysts said, “re-fashioning businesses for the future and allowing well-capitalized companies a ‘COVID-19 cover’ to ponder whether stronger is better achieved via smaller.” Read: Halloween sales forecast could be frightful to companies trying to create holiday season momentum Certainly, the pandemic has pushed some already-weak retailers over the edge into bankruptcy. But for others, like Gap Inc. GPS, -0.10%, there is discussion of revitalization of the company despite the difficult business conditions. Gap Inc., parent to the namesake Gap brand, Old Navy and Banana Republic, expects to close more than 225 stores around world in 2020. “[W]e strategically walked away from unprofitable sales by choosing not to reopen select Gap and Banana Republic stores as part of our ongoing fleet restructure,” said Sonia Syngal, chief executive of Gap, during the August 27 earnings call, according to FactSet. Still, Syngal struck an upbeat note with the progress the company has made in other areas, discussing the “new digital capabilities and shipping scale” that the company launched and how the business “pivoted to relevant marketing.” “So we enter the back half in great shape,” she said. “And understanding it will be unpredictable, still with opportunities to grow sales, improve margin and invest in the business.” See: Nordstrom moved the Anniversary Sale to August due to COVID-19 and it was devastating to Q2 results American Eagle Outfitters Inc. AEO, -0.97%, which reported earnings this week, talked about opening new stores for the Aerie brand of athleisure and underwear, but closing others. “We are actively evaluating our fleet and plan to increase store closures over the next several years and reduce the fixed costs associated with our stores,” said Chief Financial Officer Michael Mathias on the earnings calls, according to a FactSet transcript. “While our fleet remains important for distribution and customer engagement… the recent success we have had acquiring customers through our digital channel and fueling our online growth gives us additional confidence in our plan to reduce our footprint.” And Children’s Place, Inc. PLCE, -6.78%, which had its most recent earnings announcement on August 25, is speeding up its plans. “As e-commerce demand has accelerated, partly as a result of COVID-19, we have significantly increased our planned store closures and continue to target approximately 300 store locations to close in fiscal 2020 and 2021,” said Chief Financial Officer Michael Scarpa, on the earnings call. “By the end of fiscal 2021, we continue to expect to greatly reduce our reliance on our brick-and-mortar channel, resulting in a smaller, more profitable store footprint and positioning us to enter fiscal 2022 with less than an estimated 25% of our total revenue in traditional malls.” Also: Children’s Place is in a good place for a comeback, analysts say — right behind Walmart, Target and Kohl’s BMO says that COVID-19 may have given retailers the chance for renewed thinking about the approach to the business. “Too many chasing growth for growth’s sake overextended beyond saturation points; incremental revenues became detrimental revenues,” analysts said. “COVID-driven revenue declines may represent the resets companies need but could not actively implement. Rather than deciding how much revenue to give up, they must choose what to recapture.” Analysts think Gap, L Brands Inc.’s LB, -0.98% Victoria’s Secret brand and Nordstrom Inc. JWN, -2.18% could benefit most from store closures. For many retailers, closing stores means taking a revenue hit before seeing increases. Analysts use Coach parent Tapestry Inc. TPR, +0.80%, Michael Kors parent Capri Holdings Ltd. CPRI, +2.55% and Ralph Lauren Corp. RL, -0.59% as examples of companies that pulled back from wholesale channels and got smaller in the interest of brand health and full-price sales. Now, thanks to COVID-19, companies don’t have to worry that their pullback efforts will result in revenue declines. The pandemic has already driven a drop in sales. Watch: Americans lost more than $59 million to COVID-19 e-commerce fraud “Even those not making structural changes to their business should take advantage of the involuntarily provided pandemic-driven pause button to reevaluate their internal ‘Growth Versus Health’ agenda,” BMO writes. The SPDR S&P Retail ETF XRT, +0.05% has gained 10.1% for the year to date. The Amplify Online Retail ETF IBUY, +1.39% has soared 67.3%. And the S&P 500 index SPX, +0.87% is up 5% for the period."}]}