{"article": [{"url": "https://www.marketwatch.com/story/elon-musk-doesnt-want-tesla-to-be-super-profitable-as-it-soars-toward-a-300-billion-valuation-2020-07-22", "published": 1595458760.0, "headline": "Elon Musk doesn't want Tesla to be 'super profitable' as it soars toward a $300 billion valuation", "body": "Tesla Inc. Chief Executive Elon Musk, who heads a company with a valuation approaching $300 billion, doesn't want the electric-vehicle maker to be \"super profitable.\" He got his way in the second quarter, when Tesla squeaked out a profit of $104 million thanks to more than $400 million in electric-vehicle tax credits and Musk's push to reopen his Fremont, Calif., factory despite shelter-in-place orders that the CEO described as \"fascist\" in an unhinged rant three months ago. That profit puts Tesla in position to join the S&P 500 index , a possibility that has buoyed an indescribable run for Tesla TSLA, +1.89% stock, which has more than doubled in the past three months, nearly quadrupled in 2020 and gained more than 500% in the past 12 months. Typically, gains like that are reserved for companies that are on a track to huge profits or have multiple proven businesses. Not in Tesla's case, though. \"We need to, you know, not go bankrupt, obviously, that's important....But we're not trying to be super profitable, either,\" Musk said toward the end of Wednesday's conference call. \"I think just we want to be like slightly profitable and maximize growth and make the cars as affordable as possible,\" he concluded. Little else Musk had to say Wednesday could justify the stock's surge amid a pandemic that has slowed car sales this year. Some investors are banking on Tesla becoming the Apple Inc. AAPL, +1.74% of the automotive world, offering services for their cars that deliver a consistent monthly revenue stream. When one analyst asked about that path Wednesday, Musk said they were \"putting some games and stuff on the car, for fun,\" but didn't offer any other potential revenue stream beyond autonomous driving, which Tesla has been charging willing customers for at purchase time and expects to make a subscription offering. \"FSD [fully self-driving] remains by far and away the biggest opportunity in the near term,\" he said, adding that a huge improvement in the system will come \"probably\" later this year and \"trump everything\" in terms of reliability. If that is an investment thesis for anything near term, it is a mistake. Musk continues to exaggerate the self-driving capabilities of his company's cars, while delivering advanced driver-assistance systems not overly dissimilar from other car manufacturers. Musk has failed to meet many goals in autonomous driving, such as a doing a hands-free road trip across the country, which has been pushed back a few times since Musk first promised it would happen at the end of 2017. Musk reiterated Wednesday that full self-driving capabilities would make the Teslas in the market five times more valuable, and he said he knows the system should be ready by the end of the year because he is driving his car from home to work in full self-driving mode, with only limited failures. \"It's, like, amazing,\" Musk said. \"So, it's almost getting to the point where I can go from my house to work with no interventions. Despite going through construction and widely varying situations. So, this is why I am very confident about full self-driving and functionality... by the end of this year. Because I'm literally driving it.\" While Musk's car may be able to follow a defined route on California roads with only a few issues every day, that is so, so, so far away from where the software needs to be to upload to millions of Tesla cars worldwide with confidence that it will be able to drive them safely, in wildly varying weather conditions. Describing the service as \"far and away the biggest opportunity in the near term,\" as Musk did Wednesday, is an insult to the term \"near term.\" Solar is another area that Musk has high hopes for, noting that Tesla's solar roof installations roughly tripled in the second quarter compared with the first quarter. Tesla's energy generation and storage division has largely languished since the conflict-ridden acquisition of Musk's cousin's company, SolarCity, though. The segment reaped $293 million in revenue in the second quarter, down from $324 million in the year-ago period and very little suggests there will be gains there anytime soon. Tesla has made huge strides in getting its increasingly popular cars manufactured and adding new plants to meet demand, but with the stock at these levels, investors must know what will happen when Tesla finally sates all the demand for its electric vehicles. Can software upgrades for self-driving and solar provide the additional revenue streams that would justify Tesla's market capitalization, especially while \"not trying to be super profitable\"? It is doubtful, and nothing announced Wednesday cures any doubts."}]}