{"article": [{"url": "https://www.marketwatch.com/story/is-it-2000-deja-vu-for-tech-stocks-or-time-to-party-like-2009-2020-09-09", "published": 1599724700.0, "headline": "2000, zero zero, are tech stocks going to party like itâ\u0080\u0099s 2009?", "body": "What just happened? Just days after charting a new record high, technology stocks, as measured by the Nasdaq Composite COMP, +1.39% Â Index, closed Tuesday in correction territory: a decline of at least 10% from a recent peak. For some analysts, itâ\u0080\u0099s a healthy, if dizzying, modification of valuations that leapt into nosebleed territory for no good reason, but others wonder if thereâ\u0080\u0099s a bigger story to be told. See also:Hereâ\u0080\u0099s the silver lining â\u0080\u0094 stocks have done well after similar Nasdaq corrections â\u0080\u009cTech only returns +50% over 100 days in 1) a bubble (2000) or 2) a cyclical recovery (2009) and we continue to believe 2020 fits the latter paradigm better than the former,â\u0080\u009d wrote Nicholas Colas, co-founder of DataTrek Research, in a Wednesday note. â\u0080\u009cAt the end of the day 2020 is an early cycle year (more like 2009) rather than a late cycle one (like 2000).â\u0080\u009d Colas has argued a few times this year that 2020 market conditions resemble those in 2009, when the world was emerging from a shock to the financial system. It was hard to imagine at the time, amid concerns about the stability of the biggest banks, double-digit unemployment, and a deep and long-tailed housing crisis that would lead to millions of foreclosures and lost home equity â\u0080\u0094 but markets, and the economy, did eventually heal. For that reason, comparisons to 2009, amid the shock of the coronavirus pandemic and the worldwide call to shelter in place and shutter local economies, can be both comforting for investors, and provide a playbook to follow. Whatâ\u0080\u0099s more, comparisons to the dot-com bust are unfounded, Colas argues and other analysts say the same. â\u0080\u009cTechâ\u0080\u0099s fundamentals are ferociously strong just now even though the US/global economy is in a deep recession.â\u0080\u009d Weâ\u0080\u0099re at a once-in-a-generation technological pivot, finally enabling knowledge workers to do their jobs remotely, bringing futuristic innovations to logistics, and more. â\u0080\u009cWeâ\u0080\u0099ve had five years of disruption in five months,â\u0080\u009d in Colasâ\u0080\u0099 words. But thereâ\u0080\u0099s another reason itâ\u0080\u0099s somewhat more comforting to imagine the present moment is like 2009 rather than 2000. Thatâ\u0080\u0099s because when tech stocks peaked in March 2000, it took nearly 15 years for them to recover. Itâ\u0080\u0099s also worth noting, as Colas does, that if you believe there are good justifications for the big rally in tech stock this year, those reasons may not have a ton of staying power. â\u0080\u009cThe next five months are not going to give us another half decade of Tech-led disruption,â\u0080\u009d as Colas puts it. But thatâ\u0080\u0099s okay! â\u0080\u009cThere are plenty of other cyclical sectors to consider if you (like us) believe the US/global economy will continue to improve. We continue to favor Industrials XLI, +0.37% Â (plenty of earnings leverage) and US Small Caps RUT, +0.55% Â (no Big Tech exposure).â\u0080\u009d Read next:This innovation could do for investing what Napster and the iPod did for music â\u0080\u0094 and financial services may never be the same"}]}