{"article": [{"url": "https://www.marketwatch.com/story/there-are-four-coronavirus-vaccines-in-late-stage-studies-heres-how-they-differ-2020-09-25%7CNEW", "published": 1601278520.0, "headline": "There are four coronavirus vaccines in late-stage studies - here's how they differ", "body": "Johnson & Johnson's investigational COVID-19 vaccine entered Phase 3 clinical trials this week, making it the fourth vaccine candidate in the U.S. to do so and providing additional details that can help investors differentiate the pool of late-stage coronavirus vaccines. Shares of J&J JNJ, +1.39%  were up 0.3% in trading on Friday, two days after the health care giant announced it had dosed the first of an estimated 60,000 participants in the Phase 3 trial for Ad26.COV2.S, which is also referred to as JNJ-78436735. J&J's vaccine candidate joins a group of late-stage vaccines being developed by AstraZeneca AZN, +1.16%  AZN, +0.63%  and the University of Oxford, BioNTech BNTX, +1.23%  and Pfizer Inc. PFE, -0.27%, and Moderna Inc. MRNA, +0.09%  At least three other vaccines developed by Inovio Pharmaceuticals Inc. INO, -1.36%, Novavax Inc. NVAX, +0.18%, and Sanofi SNY, +0.89%  SAN, +1.20%  are also being tested in early- and mid-stage clinical trials in the U.S. One of the unique characteristics of this race to develop a vaccine is how different the candidates are, down to the type of vaccine. \"We have three categories of vaccines that are moving forward: there's protein vaccines, which are coming with an adjuvant, to make them [stronger], we have the nucleic acid vaccines, and we have the viral vectors,\" said Dr. Corey Casper, president and CEO of the Infectious Disease Research Institute, a not-for-profit biotechnology organization. \"There's pluses and minuses of all of them. None of them are perfect.\" Here's what we know so far: Vaccine type: The AstraZeneca and J&J vaccines are viral-vector vaccines, while Moderna and Pfizer's candidates are messenger RNA vaccines. An mRNA vaccine has never been approved by the Food and Drug Administration, while there is only one approved viral-vector vaccine, Merck & Co. Inc.'s MRK, -0.14%  Ebola vaccine, which received FDA approval in December of last year. The Novavax vaccine, which is expected to soon move into Phase 3 trials, is a protein-based vaccine, similar to the common flu shot. The challenge with this type of vaccine, despite its proven safety profile, is that it often requires an adjuvant to boost its effectiveness. Dr. Michael Farzan, a professor of immunology and microbiology at the Scripps Research Institute, this week told Mizuho Securities analysts that it's easier to quickly ramp up production of an mRNA vaccine, but it may be more difficult to scale this kind of vaccine. Trial size: J&J is the leader in terms of trial size, with plans to enroll 60,000 participants. AstraZeneca, BioNTech/Pfizer, and Moderna each committed to enrolling 30,000 participants, though BioNTech and Pfizer recently expanded their target group to 44,000 people. Dosing: J&J's vaccine is the only single-dose vaccine to enter late-stage studies in the U.S., though separate clinical trials in Northern Ireland and the U.K. will test a two-dose regimen. The other three candidates require two doses, spaced between roughly three to four weeks apart, depending on the vaccine. \"The single dose could be a source of commercial differentiation, and also means [J&J's] pivotal trial could read out more quickly (since it only takes one dose to immunize a person, not two doses spaced a month apart),\" Bernstein's Vincent Chen wrote on Sept. 17. Adherence to medication in the U.S. is a well-documented issue - one study estimates that 1 of 8 Americans prescribed drugs for atherosclerotic cardiovascular disease don't take them, citing cost, while other research found that up to 30% of prescriptions are never filled. However, GlaxoSmithKline GSK, +1.10%, which markets the Shingrix shingles vaccine, has data through March showing that 80% of people return for the second and final dose of the vaccine, according to a company spokesperson. Refrigeration requirements: BioNTech and Pfizer's vaccine, BNT162b2, and Moderna's mRNA-1273 are both mRNA vaccines that require freezing levels of storage, in the range of negative 94 degrees Fahrenheit for BNT162b2 to negative 4 degrees Fahrenheit for mRNA-1273. AstraZeneca's vaccine will likely require refrigeration but not freezing, according to a company spokesperson. \"Our current expectation is that the final packaged multi-dose vials will require refrigeration to ensure product quality,\" he wrote in an email. It's unclear at this time whether J&J's vaccine will require refrigeration or freezing. The need to refrigerate vaccines generally (and not just the COVID-19 ones) has long been an issue for vaccination programs, according to Casper. \"Even in highly industrialized countriesâ\u0080¦it is very challenging to keep vaccines refrigerated, just at refrigeration temperatures,\" he said. Effectiveness goal: The FDA in June issued guidance that called for COVID-19 vaccines to be at least 50% effective at preventing infections with COVID-19 or by reducing severity of disease. AstraZeneca's candidate is targeting an effectiveness rate of 50%; however, the effectiveness goals for BNT162b2, Ad26. COV2, and mRNA-1273 are 60%, according to the individual trial protocols. Dr. Stanley Plotkin, a vaccine expert and a former pharmaceutical executive, this week told SVB Leerink analysts that achieving between 60% and 70% protection should aid \"long-term containment of the pandemic,\" though he doesn't expect the first generation of COVID-19 vaccines to achieve those efficacy levels. Timeline: Despite the prevalance of vaccine timeline talk among administration officials, companies have been cautious sharing dates for when they expect to publish the first batches of Phase 3 data. Here's a tally created by Mizuho's Difei Yang: Though AstraZeneca's trial in the U.S. is still on hold due to an adverse event, the company previously said it expected to get late-stage data by the end of the year, Moderna expects a Phase 3 readout in \"November or December,\" and BioNTech and Pfizer expect Phase 3 efficacy data by the end of October. J&J said this week it expects to file for an emergency use authorization in early 2021. The race so far: Analysts have mixed views on which vaccine is the front-runner. SVB Leerink analysts told investors in a Sept. 18 note that the trial protocols seem to favor BioNTech and Pfizer, when compared with Moderna. J.P. Morgan said Sept. 22 that the Phase 1 data provided so far by AstraZeneca, BioNTech/Pfizer, and Moderna didn't have a \"real standout in terms of the safety profile. That said, mRNA-1273 tends to have slightly higher rates of fever, chills, headache than competitors.\" So far this year, AstraZeneca's stock is up 8.1%, shares of BioNTech have rallied 87.9%, Pfizer's stock has dropped 8.8%, J&J's stock is down 0.5%, and shares of Moderna have soared 250.4%. The S&P 500 SPX, +0.87%  is up 0.5% year-to-date."}]}