{"article": [{"url": "https://www.marketwatch.com/story/these-small-business-owners-are-still-making-it-work-coronavirus-and-all-11602259273", "published": 1602245360.0, "headline": "These small-business owners are still making it work, coronavirus and all", "body": "Hello Robin bakery, Seattle Photo courtesy Hello Robin In the frantic days of late March, as the coronavirus panic burst forth and cities and towns began to impose lockdown orders, MarketWatch spoke to four small-business owners from around the country. All four were successful, and most were planning some form of expansion in what then seemed like a booming economy. Yet even as early as March, these owners had already tasted some of the new normal and pivoted to other business strategies. Each knew the hard part still lay ahead. In early October, we reached out again to to see how they’ve made it through. There have been more downs than ups over the past few months, but amazingly, all four owners expect their 2020 business to be not far off what they’d anticipated before the virus hit. Each expressed a sense of being lucky, and of watching the disparate economic impact of the virus play out across their circle of contacts, from customers to business partners to employees. All four received money from the Paycheck Protection Program, part of the stimulus package passed in the spring. They know the story isn’t over yet. Each is located in cold-winter areas, from Vermont to New Jersey to Seattle, and all have the same questions: Will consumers come out? Will heat lamps work? When will things get back to normal? Earlier coverage: These small-business owners made their dreams come true — and then the coronavirus hit ‘This whole pandemic is a tale of two economies:’ Mad River Distillers, Warren, Vt. In March, when MarketWatch talked to John Egan, co-founder of Warren, Vt.-based Mad River Distillers, the company had just started to produce hand sanitizer for the local community. Sanitizer is essentially just alcohol, after all, and when it ran low in the panicky early weeks of the shutdowns, Egan realized Mad River could help. “It was as much a community-building exercise as anything else,” he said in October. That pivot didn’t last long, however. As well-meaning companies around the country tried to help with the pandemic efforts by pivoting to producing sanitizer, federal regulators, including the FDA and NIH, got involved. “There started to be a whole bunch of standards and over a four or five week period, you’d have to check in and make sure your formulation was correct,” Egan said. “There were weekly conference calls and people were attempting to stay up with the regulatory requirements but as each government agency got involved, they added additional things.” About six-eight weeks into the crisis, producers started to drop out of the sanitizer effort, “and then the regular supply chain started supplying it,” Egan said. “We still have some available if people want it but It’s really gone back to the normal providers handling that.” For Mad River’s regular beverage business, it’s been a tough year. “We depend on an in-person experience,” Egan explained. “People want to hear the craft brew story from the bartender. If they don’t get that, they go to the store and buy Jim Beam or Bud Light.” The company applied for a PPP loan and got a small one “with the help of our local community banker from Montpelier,” Egan said. “It has been helpful to us in bringing everybody back sooner than we might otherwise have been able to.” In its Burlington, Vt. location, Mad River has a tasting room, which is open at 50% capacity with a reservation, up from 25% over the summer. They’ve also fanned out to farmer’s markets, although they can’t offer customers the chance to taste the alcohol there. Egan finds the virus’s economic impact unsettling. “This whole pandemic is a tale of two economies,” he said. “The markets have done well, the professional workers, the people who own stocks, have done well. In Massachusetts,” where Mad River has distribution partners, the unemployment rate is high. “The people who live paycheck to paycheck are most impacted by that.” Mad River Distillers server Connor welcomes guests to the tasting room. Courtesy Mad River Distillers. How has business been overall? “There was an eight- week period in the spring that felt like we fell off a cliff,” Egan said, but they’ve almost made that up. “This year may be on par with last year, which is extraordinary. We had been hoping to grow but in this environment I’ll take treading water all day long.” But 2020 may still have some challenges ahead. “For the hospitality industry, everyone’s worried about November and December,” Egan said. “The regulations and the weather are going to conspire against people.” ‘We’re definitely worried about how this winter is going to look:’ Axe and Arrow Brewing, Glassboro, N.J. Glassboro, N.J.-based Axe and Arrow Brewing had barely been open a year when lockdowns began. “We were just starting to hit our stride,” co-owner Krystle Lockman told MarketWatch last March as she canned beer while watching her twin six-year-olds do their homework in a booth. Lockman and her partners sold canned beer and growlers through the spring, and then once they were able to open up for outdoor seating, their landlord granted them an additional patio space. Now, they’ve got more outdoor space than in the original indoor space. And after having to ask her entire part-time staff to stop showing up, and laying off her one full-time employee so that he could collect unemployment, “we’re back with full force,” and even made a few additional hires, she said. But there have been some hard decisions to make. “We are allowed to have 25% capacity indoors, but we’ve chosen not to do that,” Lockman said. With that privilege comes a long list of mandates, including having to watch customers’ mask-wearing. “It’s too much to ask my people to police that,” she said. And while canning is helping pay the bills, it’s much lower-margin than the restaurant business. “We really need the tap room to be able to support operations,” she said. Axe and Arrow received an $11,000 PPP loan, and Lockman is now waiting to see how much will be forgiven. Against all odds, her revenue projections for the brewery’s second year in business are “not far off,” she said. It’s the expenses that are the challenge. There’s additional rent for the second patio, a giant tent over part of it, which cost “a couple thousand,” five heaters at about $1,000 each, and as soon as Lockman can settle on the right electric heaters to buy for the rest of the patio, those expenses as well. “Now we’re a little worried because the nice weather is going to get chilly. If we lived in a climate that wouldn’t get any colder we’d be able to operate like this. I don’t foresee people coming in the rain if it’s cold. I don’t foresee people coming out if it’s really cold. We’re definitely worried about how this winter is going to look.”‘It’s really sad when you work so hard on something… to close it down:’ Hello Robin, Seattle, Wa Hello Robin is a Seattle neighborhood cookie shop with a national following. It’s been in business several years, and has proven so successful that shop owners Robin Wehl Martin and her husband, Clay Martin, were in the process of expanding to a second location across town. Shortly after speaking to MarketWatch in late March, Martin closed the shop, and it stayed closed for 12 weeks. The state had mandated all non-essential businesses close, and as Robin put it, she might have made the argument that the cookie shop was, in fact, essential, but “it just seemed like the right thing to do was to encourage people to stay home,” she said. “The day after we shut down, I went in and scrubbed all the surfaces and sealed everything up,” Robin said. “I was ready to give up. It’s really sad when you work so hard on something and you feel like it’s in a really good place, to close it down.” The first weekend back in business was June 19, and in a nod to “Juneteenth,” the shop donated all revenue to Black Lives Matter organizations. “People did come back in a substantial way when we opened,” Robin said. “That first Friday was one of our busiest days ever.” Since then, it’s been a matter of taking the good – like a local pizza chain placing an order for 20,000 cookies to try to help support other neighborhood businesses – with the bad, like missing out on catering opportunities. Still, Clay estimates the company will do roughly 80% of the business they did in 2019. “We really can’t complain,” he said. The company received a PPP loan through Square SQ, +2.06%, and expect most of it will be forgiven. The original location, in Seattle’s Capitol Hill, has gotten by with just a take-out window for selling baked goods and frozen dough. And the new location is in a completely outdoor area. “I just feel very lucky,” Robin said. “I feel lucky that we’re not a bar. We just have these key factors that have by chance worked in our favor.” Still, in the new set-up, there are some things she misses. “I feel the absence of the customer. Normally kids and families and people come in and we get to know them. There are kids who come in who are seven, who we met when the moms were pregnant. We’ve been through life cycles with people.”‘I totally agree with the stimulus checks…but we’ve got to be careful about how much support we continue to give:’ The Shop, Seattle, Wa Matt Bell’s labor of love, The Shop, is a unique enterprise – a “car club” where aficionados can garage their wheels, mingle in a club-like atmosphere, or enjoy a meal in the restaurant, which was also open to the public. The Shop's new outdoor space in Seattle. Photo courtesy The Shop. It had done so well in Seattle that Bell decided to open a second location in Dallas in June, and construction was underway. But work came to a screeching halt in the spring, and then Bell found himself agonizing over whether or not to move ahead. “The hardest dynamic for me and the most stress I’ve had is trying to predict the future,” he said in October. “When do you fund initiatives to grow again and when do you hold back and wait? That’s tricky when you’re used to growing. when is that right time?” Eventually, he did decide to start back up, and is now hoping for a December or January opening date. At the Seattle location, Bell had a deck built outside so the restaurant could operate – though he is also concerned about the coming cold weather. And there have been other, unexpected, considerations. When The Shop re-opened and tried to bring staff back to work, some didn’t want to return, Bell said: they were making more money on unemployment. “I totally agree with the stimulus checks,” Bell said. “That’s pumped money into the economy and it’s helped people and businesses but we’ve got to be careful about how much support we continue to give. The government has made it a tough decision for some people to come back to work.” He did apply for and receive “a six-figure” PPP loan, which funded the construction of the outdoor area in Seattle, and says he expects 80% of it to be forgiven. Because he’s been traveling – on planes – back and forth between Seattle and Dallas, Bell is most struck by what he calls “the polar opposites” in the two areas, “both in terms of the rules and the consumer mindset. People in Dallas seem to be more interested in going out and getting back to some normalcy and in Seattle, people are not ready.” Bell finds his bifurcated life unsettling. “I spend time in Dallas and I think Seattle needs to really move forward, and I’ll be back in Seattle and think, why is Dallas moving so quickly? It doesn’t seem safe and right. It’s a sign of our country. There are polar extremes. I wish there was state or national consistency across the board. I can see how people are frustrated with each other.” Read: It was fair winds and following seas for small-business owners like these ship captains. Then came coronavirus"}]}