{"article": [{"url": "https://www.marketwatch.com/story/wall-street-banks-net-64-billion-in-fees-in-bumper-year-for-m-a-and-ipos-11601479432", "published": 1601559560.0, "headline": "Wall Street banks net $64 billion in fees in bumper year for M&A and IPOs", "body": "Global M&A volumes surged to $1 trillion over the summer, according to data provider Refinitiv — the best third quarter since it started tracking numbers in 1998. The world’s largest investment banks made more money in fees during the first nine months of the year than at any point since before the 2008 financial crisis, fueled by emergency fundraisings, initial public offerings and a rash of mergers and acquisitions activity. Investment banking fees soared to around $64 billion in the first three quarters of 2020, the most lucrative start to the year for the sector since 2007, when banks were riding high at the top of the last M&A cycle and a year before Lehman Brothers collapsed. Five banks — JPMorgan JPM, -0.57%, Goldman Sachs GS, -0.21%, Bank of America BAC, +0.47%, Morgan Stanley MS, -0.34% and Citigroup C, +0.47% — accounted for around a third of that, collectively raking in fees of $19.8 billion in the nine months to end of September, according to data from Dealogic. With just three months left until the end of 2020, banks are on course for their best year in more than a decade. Global M&A volumes surged to $1 trillion over the summer, according to data provider Refinitiv — the best third quarter since it started tracking numbers in 1998. Read: The M&A surge: Is it rational exuberance or a frenzy before the market falls? However, some lawyers and bankers cautioned that a rise in coronavirus infections could dampen deal making. “Clearly there is great momentum to this deal activity, but another winter COVID spike with further lockdowns could slow the pace and push deals into 2021,” said Frank Aquila, global head of M&A at international law firm Sullivan & Cromwell. Eamon Brabazon, co-head of EMEA M&A at Bank of America, said there was an “underlying fragility and nervousness” that something akin to a significant second COVID wave could happen. “If so, we would expect the recent positive learnings around virtual processes would mean that any impact on M&A would be less acute than otherwise” Equity capital markets bankers were kept busy, as a stampede of companies took advantage of the rapid recovery in capital markets to sell their shares, with fees soaring by 73% on last year to $18.8 billion. So far this year, IPOs have raised $135.5 billion globally, 56% of which was unveiled in the third quarter, with health care, technology and blank-check companies (or special purpose acquisition vehicles — SPACS) dominating activity. Read: A new breed of tech IPOs may give the stock market reason to party like it’s 1999 Investor demand for fast-growing companies was demonstrated by the IPO of Snowflake SNOW, -0.91%. Stock in the data storage and analytics provider more than doubled on its market debut on Sept. 16. In Europe, shares in The Hut Group soared more than 30% in the online health and beauty retailer’s first day of trading on Sept. 16 in London, as it swept away corporate governance concerns to become the U.K.’s biggest ever technology initial public offering. Martin Steinbach, EY EMEIA global leader, said the demand for IPOs was being driven by investors looking for returns in a low interest rate environment. “If equity stories, management and balanced pricing are met — we predict this will bring a strong close to 2020,” he said, adding that the trend could accelerate as multinationals look to spin off divisions to focus on core businesses. Read: Here’s Why Investors Should Bet on Stocks That Are Selling Noncore Assets A series of emergency fundraisings by companies looking to shore up their finances when the pandemic hit in March also provided a big payday for debt capital markets bankers. DCM fees have surged by nearly 30% in the same period in 2019, to $22.9 billion. Among those raising hundreds of billions of dollars were computer technology company Oracle ORCL, +0.42% ($20 billion), U.S. oil major Exxon Mobil XOM, -1.47% ($8.5 billion), and the world’s largest brewer Anheuser-Busch InBev BUD, -0.21% ($5.0 billion). The resurgence of activity across all areas of investment banking will come as a relief to bankers, as M&A deal making and IPOs ground to a halt at the height of the pandemic in March and April. “For the next 12 to 18 months the investment banking wallet opportunity looks buoyant, but the product mix will adjust,” said Philip Drury, head of banking, capital markets and advisory for EMEA, at Citigroup. However, despite the recent spike in M&A, the total value of global deal making for the first nine months of 2020 is $2.1 trillion — 21% lower than it was during the same period last year. Read: Surge in megadeals points to M&A recovery as tech sector dominates Volumes were boosted by a wave of megadeals across sectors and geographies, as companies sought to become bigger and more diversified to help them weather the pandemic. These included Gilead Sciences’s $20 billion takeover of biopharmaceutical company Immunomedics and Nvidia’s $40 billion acquisition of U.K.-based chip designer Arm from Japan’s SoftBank Group, which has helped spur a huge uptick in deal making over the summer. Read: Pressure grows for U.K. to intervene in Nvidia’s $40 billion Arm takeover The Americas almost doubled activity in the third quarter compared with the same period last year, while Europe is still lagging, recording just $232 billion of deals in the third quarter, a 3.5% fall on the same period in 2019. “M&A activity in Europe will follow the U.S.,” said Javier Oficialdegui, co-head of global banking at UBS UBS, -0.93%. “Every single sector and market needs to restructure in one way or another because of COVID-19 and we expect a big uptick in activity over the coming quarters.” Activity in the region is also expected to pick up once the final Brexit terms are known and the consequences are understood. “Then we can expect to see a significant number of European deals as companies inside and outside the EU seek to realign based on the new economic reality,” said Sullivan & Cromwell’s Aquila. Technology deals have surged this year, accounting for 16.9% of overall activity — or $377 billion — compared with to 11% in 2019, as companies look to capitalize on their record valuations and use their stock to become dominant players in emerging sectors. “There is a lot of momentum going into year-end. Europe is at the epicenter. When you look at the pipeline of deals into 2021, we see a material year-on-year uplift,” said Brabazon."}]}