{"article": [{"url": "https://www.marketwatch.com/story/you-can-sip-a-canned-cocktail-and-save-the-bees-at-the-same-time-2020-07-17", "published": 1595005220.0, "headline": "This fizzy canned cocktail has a hint of honey â\u0080\u0094 and a soft spot for bees", "body": "The can:Siponey Royale, $27.99 for a four-pack The back story: Years ago, canned cocktails or similarly packaged alcoholic beverages â\u0080\u0094 think wine coolers â\u0080\u0094 were considered poor excuses for sips. But these days, they are suddenly gaining a newfound respectability, with a host of craft-style companies entering the market. Sales are up as well: Market researcher Nielsen says spirits-based ready-to-drink products â\u0080\u0094 thatâ\u0080\u0099s the industry term for such beverages â\u0080\u0094 saw a 40.7% annual sales spike in 2019. Siponey is a new brand to enter the market, offering a sweet twist on the canned cocktail â\u0080\u0094 itâ\u0080\u0099s all about honey (as in sip honey, or Siponey for short). The company plans to make all its products with honey as a key ingredient, in part to draw attention to efforts to keep the honeybee population strong at a time when concerns are growing about its future stability. But Amanda Victoria, a veteran New York City spirits professional and former bartender who founded the brand with her husband, horticultaralist Joseph Mintz, also asserts that honey is a more natural and healthier sweetener than white sugar. See also: When booze meets a bite of the apple: Jack Danielâ\u0080\u0099s launches a new flavor The brandâ\u0080\u0099s first offering, a carbonated sip called Siponey Royale, combines New York-sourced honey, lemon juice and a four-year-old rye whiskey. Victoria says she was just as fussy about the rye that goes into the drink as the honey, noting she searched across the U.S. for a whiskey that â\u0080\u009cwould exhibit a complexity that was spicy and a little minty.â\u0080\u009d What we think about it: Weâ\u0080\u0099re big fans of the new wave of canned cocktails hitting the market. (We told you a few months ago about Cutwater Spirits, another emerging brand.) Siponey fits in nicely with the trend â\u0080\u0094 its Siponey Royale is a fine example of a beverage that balances sweetness and refreshment and delivers a somewhat boozy punch at the same time (you definitely taste the rye and its hints of mint). It seems tailor-made for a summer day. How to enjoy it: Obviously, you donâ\u0080\u0099t need to do anything more than pop open a chilled can and sip away. By virtue of its bubbly nature, the drink also goes well with lots of food â\u0080\u0094 Victoria suggests everything from cheese plates to potato chips."}]}