{"article": [{"url": "https://www.marketwatch.com/story/trump-supporters-say-they-dont-view-his-contracting-the-coronavirus-as-a-cautionary-tale-2020-10-08", "published": 1602229940.0, "headline": "Trump supporters say they donâ\u0080\u0099t view his contracting the coronavirus as a cautionary tale", "body": "CANTON, Ohio (AP) â\u0080\u0094 As an infected President Donald Trump urged Americans not to fear the virus that has killed more than 1 million people worldwide, many of his supporters were already in sync with that message. In interviews with Republican voters at Trump events and campaign offices, very few saw the presidentâ\u0080\u0099s illness as a cautionary tale. None said they would change their personal approach to masks or distancing, and many expressed a confidence that the disease was less dangerous than advertised. In Ohio, a â\u0080\u009cWomen for Trumpâ\u0080\u009d group gathered indoors â\u0080\u0094 many maskless and not distanced â\u0080\u0094 to pray for the presidentâ\u0080\u0099s recovery. In Nevada, a Reno businessman dismissed the threat of the pandemic as â\u0080\u009coverplayed.â\u0080\u009d Nearby, another Trump backer shrugged off any second thoughts about having cheered at a Trump campaign event last week as part of a maskless crowd. Capitol Report:Trump calls contracting coronavirus â\u0080\u0098blessing from Godâ\u0080\u0099 in latest video â\u0080\u009cI think most of us have reached the realization that, at some point, weâ\u0080\u0099re probably going catch it, and have to deal with it anyway,â\u0080\u009d Ken Gray, a county commissioner from Dayton, Nev., shortly before the president returned to the White House after three days of treatment for COVID-19 at Walter Reed National Military Medical Center. Trumpâ\u0080\u0099s â\u0080\u009cdonâ\u0080\u0099t be afraidâ\u0080\u009d take-away is infuriating public health experts â\u0080\u0094 who note that basic prevention measures do work contain the spread of the deadly virus. Itâ\u0080\u0099s also angering family members of those who have died. But for many of Trumpâ\u0080\u0099s supporters, the president was merely adopting an attitude they expect, and they themselves reflect, when it comes to the pandemic. They view Trumpâ\u0080\u0099s infection as almost inevitable. Some were amazed heâ\u0080\u0099d made it this far before getting sick. â\u0080\u009cItâ\u0080\u0099s October and heâ\u0080\u0099s just now getting it,â\u0080\u009d said 18-year-old Taylor Adams, a first-time voter, at the womenâ\u0080\u0099s meeting in Ohio. Adams even commended the president for not contracting the disease sooner. â\u0080\u009cI think that heâ\u0080\u0099s definitely going to pull through. But Iâ\u0080\u0099m not surprised that he did get it eventually.â\u0080\u009d The comments were a testament to the power of Trumpâ\u0080\u0099s messaging, widely seen as misleading by public health experts. Throughout the pandemic, the presidentâ\u0080\u0099s public portrayal of the virus has been rosier than reality. Heâ\u0080\u0099s routinely brushed off the severity of the outbreak and dismissed expert advice on mask wearing and social distancing. On Tuesday, he compared the virus to the seasonal flu, suggesting it was something that should be â\u0080\u009clearned to live with.â\u0080\u009d Donâ\u0080\u0099t miss:Trump reportedly asked doctors at Walter Reed National Military Medical Center to sign nondisclosure agreements when he made a surprise visit to the hospital last year. Hereâ\u0080\u0099s what you need to know before signing an NDA In fact, COVID-19 has proven to be a more potent killer than the flu, particularly among older people, and has shown indications of having long-term impacts on the health of younger people it infects. Trump acknowledged to journalist Bob Woodward that he â\u0080\u009cwanted to always play it downâ\u0080\u009d because he did not want to cause panic. Among many supporters, that appears to have worked. Trump voters interviewed this week were almost blase about their presidentâ\u0080\u0099s health scare, describing it as an unavoidable part of his work and travel schedule. â\u0080\u009cI donâ\u0080\u0099t find it surprising. The president has spent much of the year around the country, with supporters, campaigning for another four years,â\u0080\u009d said Ohio resident Brenda Parsons, 58. As women supporting Trump gathered at an office building in Canton, a battleground area in the stateâ\u0080\u0099s northeast, few wore masks. They sat closer than the recommended six feet apart. They posed for photos with a life-size cutout of the president and a giant mural of a bald eagle wearing a â\u0080\u009cMake America Great Againâ\u0080\u009d hat, and chanted â\u0080\u009cfour more years!â\u0080\u009d “ â\u0080\u0098From Day 1, Iâ\u0080\u0099ve thought the whole virus has been overplayed and used as a political tool.â\u0080\u0099 ” â\u0080\u0094 Reno, Nev., businessman They prayed for the president and first lady Melania Trump, who contracted the disease along with others in the White House. â\u0080\u009cI pray and know the presidentâ\u0080\u0099s positive mind set combined with his faith in Jesus is what will help him pull through this,â\u0080\u009d Parsons said. Itâ\u0080\u0099s unclear exactly how Trump got infected. He has traveled steadily for weeks for his reelection campaign, sometimes holding events indoors, where experts say the virus is more likely to spread. The White House required testing for anyone in close proximity to the president, but masks and social distancing practices were lax. Even now, masks at the White House are a matter of â\u0080\u009cpersonal choiceâ\u0080\u009d except for National Security Council staffers, who are required to wear them. Trumpâ\u0080\u0099s supporters donâ\u0080\u0099t view these practices as irresponsible and were largely quick to dismiss the level of risk involved. Kathy Burke, a Reno retiree who dropped by her local Trump campaign office Monday afternoon to pick up more campaign signs, was wearing a Trump face mask, a precaution she said she already took before Trumpâ\u0080\u0099s diagnosis. She too saw the presidentâ\u0080\u0099s infection as inevitable. â\u0080\u009cAnybody could get it. I could get it,â\u0080\u009d Burke said. Rick Zirpolo, a Reno businessman who eschewed a mask outside, said he had no qualms with the way Trump has portrayed or confronted the deadly threat. â\u0080\u009cFrom Day 1, Iâ\u0080\u0099ve thought the whole virus has been overplayed and used as a political tool,â\u0080\u009d he said. Zirpolo praised the president for briefly leaving the hospital over the weekend for a drive-by to wave to supporters, despite his infection. And he said Trump was right to leave the hospital Monday to return to the White House. â\u0080\u009cI think itâ\u0080\u0099s outstanding because it shows his commitment to the nation,â\u0080\u009d he said. Across the country, in Newberry, S.C., Scott Gardner, a teacher and coach, felt differently. He didnâ\u0080\u0099t blame the president for having contracted COVID-19, given its pervasive nature and ease of transmission. But the 50-year-old who supported Trump in 2016 and planned to vote for him again this year, hoped the president would change his behavior. The experience should serve as a â\u0080\u009cwakeup callâ\u0080\u009d to employ more social distancing and masking, especially in a crowd. â\u0080\u009cI guess it should be an eye opener,â\u0080\u009d said Gardner. â\u0080\u009cBut if youâ\u0080\u0099re going to get out of your basement, youâ\u0080\u0099re going to have a chance to catch it.â\u0080\u009d"}]}