{"article": [{"url": "https://www.marketwatch.com/story/seventeen-year-old-suspect-arrested-after-deadly-shootings-at-kenosha-wis-protest-2020-08-26", "published": 1598479940.0, "headline": "17-year-old suspect arrested in deadly shootings at Kenosha, Wis., protest", "body": "KENOSHA, Wis. — A white, 17-year-old police admirer was arrested Wednesday after two people were shot to death during a third straight night of protests in Kenosha over the police shooting of a Black man, Jacob Blake. Kyle Rittenhouse, of Antioch, Illinois, about 15 miles from Kenosha, was taken into custody in Illinois on suspicion of first-degree intentional homicide in the rifle attack Tuesday night that was largely captured on cellphone video. A third person was wounded. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } “I just killed somebody,” he could be heard saying at one point during the shooting rampage that erupted just before midnight. iframe.twitter-tweet { width: 100% !important; } Blake’s shooting set off three nights of unrest in the city midway between Milwaukee and Chicago. In the wake of the killings, Wisconsin Gov. Tony Evers authorized the sending of 500 members of the National Guard to Kenosha, doubling the number of troops. The governor’s office said he is working with other states to bring in additional National Guard members and law officers. Authorities also announced a 7 p.m. curfew, an hour earlier than the night before. “A senseless tragedy like this cannot happen again,” the governor, a Democrat, said in a statement. “I again ask those who choose to exercise their First Amendment rights please do so peacefully and safely, as so many did last night. I also ask the individuals who are not there to exercise those rights to please stay home and let local first responders, law enforcement and members of the Wisconsin National Guard do their jobs.” In Washington, the Justice Department said it is sending in more than 200 federal agents from the FBI, U.S. Marshals Service and the Bureau of Alcohol, Tobacco, Firearms and Explosives in response to the unrest. The White House said up to 2,000 National Guard troops would be made available. And in Orlando, the NBA’s Milwaukee Bucks, a team based in Wisconsin, didn’t take the floor for their playoff game against the Magic. It was later announced that all three NBA playoff games scheduled for Wednesday were postponed, with players around the league choosing to boycott in their strongest statement yet against racial injustice. The dead were identified only as a 26-year-old Silver Lake, Wisconsin, resident and a 36-year-old from Kenosha. The wounded person, a 36-year-old from West Allis, Wisconsin, was expected to survive, police said. “We were all chanting ‘Black lives matter’ at the gas station and then we heard, boom, boom, and I told my friend, ‘That’s not fireworks,’” 19-year-old protester Devin Scott told the Chicago Tribune. “And then this guy with this huge gun runs by us in the middle of the street and people are yelling, ‘He shot someone! He shot someone!’ And everyone is trying to fight the guy, chasing him and then he started shooting again.” Scott said he cradled a lifeless victim in his arms, and a woman started performing CPR, but “I don’t think he made it.” According to witness accounts and video footage, police apparently let the gunman walk past them and leave the scene with a rifle over his shoulder and his hands in the air as members of the crowd were yelling for him to be arrested because he had shot people. As for how the gunman managed to leave the scene, Sheriff David Beth portrayed a chaotic, high-stress situation, with screaming, chanting, nonstop radio traffic and people running all over — conditions he said can cause “tunnel vision” among law officers. Rittenhouse was assigned a public defender in Illinois for a hearing Friday on his transfer to Wisconsin. The public defender’s office had no comment. Under Wisconsin law, anyone 17 or older is treated as an adult in the criminal justice system. Much of Rittenhouse’s Facebook page is devoted to praising law enforcement, with references to Blue Lives Matter, a movement that supports police. He also can be seen holding an assault rifle. Other photographs include those of badges of various law enforcement agencies, including the Chicago Police Department. All of the badges have a black line across them — something police officers typically do with black tape when an officer is killed in the line of duty. In a photograph posted by his mother, he is wearing what appears to be a blue law enforcement uniform as well as the kind of brimmed hat that state troopers wear. The sheriff told the Milwaukee Journal Sentinel that militia members or armed vigilantes had been patrolling Kenosha’s streets in recent nights, but he did not know if the gunman was among them. However, video taken before the shooting shows police tossing bottled water from an armored vehicle to what appear to be armed civilians walking the streets. And one of them appears to be the gunman. “We appreciate you being here,” an officer is heard saying to the group over a loudspeaker. Before the shooting, the conservative website The Daily Caller conducted a video interview with the suspected gunman in front of a boarded-up business. “So people are getting injured, and our job is to protect this business,” the young man said. “And part of my job is to also help people. If there is somebody hurt, I’m running into harm’s way. That’s why I have my rifle — because I can protect myself, obviously. But I also have my med kit.” Sam Dirks, 22, from Milwaukee, said he had seen the gunman earlier in the evening, and he was yelling at some of the protesters. “He was definitely very agitated. He was pacing around, just pointing his gun in general. Not necessarily at anyone specifically,” Dirks said. Wisconsin Lt. Gov. Mandela Barnes, who is Black, said in an interview with the news program “Democracy Now!” that the shootings were not surprising and that white militias have been ignored for too long. “How many times across this country do you see armed gunmen, protesting, walking into state Capitols, and everybody just thinks it’s OK?” Barnes said. “People treat that like it’s some kind of normal activity that people are walking around with assault rifles.” In Wisconsin, it is legal for people 18 and over to openly carry a gun, with no license required. Witness accounts and video indicate the shootings took place in two stages: The gunman first shot someone at a car lot, then jogged away, fell in the street, and opened fire again as members of the crowd closed in on him. A witness, Julio Rosas, 24, said that when the gunman stumbled, “two people jumped onto him and there was a struggle for control of his rifle. At that point during the struggle, he just began to fire multiple rounds, and that dispersed people near him.” “The rifle was being jerked around in all directions while it was being fired,” Rosas said. Blake was shot in the back seven times on Sunday as he leaned into his SUV, three of his children seated inside. Kenosha police have said little about what happened other than that they were responding to a domestic dispute. The officer who shot Blake was Rusten Sheskey, a seven-year veteran of the Kenosha Police Department, the state Department of Justice said Wednesday. Sheskey shot Blake while holding onto his shirt after officers first unsuccessfully used a Taser, the agency’s news release said. State agents later recovered a knife from the driver’s side floorboard of the vehicle, authorities said. A search of the vehicle located no additional weapons. No charges were announced and the state Department of Investigation was continuing to investigate. On Tuesday, Ben Crump, the lawyer for Blake’s family, said it would “take a miracle” for Blake to walk again. He called for the officer who opened fire to be arrested and for the others involved to lose their jobs. The shooting was captured on cellphone video and ignited new protests in the U.S. three months after the death of George Floyd under the knee of a Minneapolis police officer touched off a nationwide reckoning over racial injustice. Democratic presidential nominee Joe Biden posted a video saying he had spoken with Blake’s parents and other family members. “What I saw on that video makes me sick,” Biden said. “Once again, a Black man, Jacob Blake, has been shot by the police in broad daylight, with the whole world watching.”"}]}