{"article": [{"url": "https://www.marketwatch.com/story/a-dilemma-facing-college-students-during-the-pandemic-delaying-graduation-could-have-long-term-financial-consequences-2020-06-22", "published": 1592835680.0, "headline": "A dilemma facing college students during the pandemic: Delaying graduation could have long-term financial consequences", "body": "The coronavirus pandemic upended the lives of college students across the country, sending them from the bustle of dorms and classrooms to computer screens away from their fellow students. But new research indicates that this disruption to college will impact some students more than others. Sixteen percent of lower-income students said they would delay their graduation due to the pandemic, according to a survey of 1,500 undergraduates at Arizona State University. That’s compared to 10% of their more affluent peers. The survey was the basis for a working paper distributed this week by the National Bureau of Economic Research. Lower-income students — defined as those with parents whose incomes were below the median of the survey — were also 41% more likely than their more affluent peers to change their major as a result of the pandemic. In addition, the gap in GPA expectations between lower and higher income students became more pronounced as a result of COVID-19, the researchers found. The research circulated Monday is limited to students at one university and so the results can’t be extrapolated to the college population as a whole. Still, given that ASU is a large, public institution, the findings offer a troubling indication that the pandemic is exacerbating inequalities already present in the higher education system — and in society more broadly. “We know already that lower income families are the ones who have been impacted more by this pandemic, their lives have been disrupted a lot more,” said Basit Zafar, a professor of economics at ASU and one of the authors of the working paper. The survey indicates that dynamic is spilling over into students’ experience in higher education. Other, recent research points to a similar conclusion. Roughly 58% of students surveyed in March by the Hope Center for College, Community and Justice experienced basic needs insecurity — described as struggling to afford food or stable housing — as a result of the pandemic. The survey, which is based on information from more than 38,000 students at 54 colleges, also found the pandemic had a disparate impact on different student demographics; 71% of black students said they’d experienced food insecurity compared with 52% of white students. Taking longer to graduate increases the cost of a degree Faith Sandler, the executive director of the Scholarship Foundation of St. Louis, an organization that provides grants and interest-free loans to low-income students to attend college, said if data from the students her organization serves is any indication, the pandemic “will have a significant impact on time to graduation, if not graduation rates.” The longer it takes a student to graduate, the more costly their degree, she noted. Of the 57 students scheduled to graduate this spring who responded to a survey sent by the organization, 40% didn’t graduate, according to Sandler. Already, low-income students struggle more to complete college, in part because of the obstacles they face paying for school. In addition, they may have other obligations on their time — work or family responsibilities — that can make it difficult to get through college quickly. Though some elite, wealthy colleges have the funds to both provide generous financial aid to low-income students and access to a suite of resources that may help them complete college, these schools educate a relatively small slice of the low-income student population overall. The pandemic offered an extreme example of the dichotomy in the college experience between low-income students and those with more resources to fall back on as they make their way through school. While more affluent students likely went back to secure housing situations with space to study, low-income students may not have had a home to go back to or faced returning to a crowded living environment. In addition, because of the disproportionate economic and health impact of the coronavirus on low-income communities, these students may also be dealing with a job loss or health-care challenge in their family. “Low-income students, who are obviously more at risk financially, are less likely to be able to stay on track to graduate if they have to relocate, if they have to have home internet access, if they have to have technology, if they lose their jobs on campus or near campus,” Sandler said. Twenty-nine percent of students in the ASU survey said they lost the jobs they held prior to the pandemic and 61% of students surveyed said a close family member lost a job. “Everything is precarious, so any one piece of that can have an impact, but when it all happens at once, it’s amazing that some folks did graduate.” For Sandler, the pandemic has also exposed how invested the higher-education system is in the idea of completing college in four consecutive years. Many financial-aid awards are tied to a student’s full-time status or are limited to a certain number of semesters or can’t be deferred. In addition, it’s often difficult for students to transfer between institutions without losing some of their credits along the way. Staffers at Sandler’s organization are meeting with and counseling the students they serve to help them plan their future in light of the rigidity in this system and the uncertainty of the moment. For those who are attending schools planning to be completely online in the fall, Sandler’s organization is making sure they reflect on how the spring semester went online and what resources could make it work better in the upcoming semester. They’re also meeting with students preparing to attend college for the first time to help them determine what changes from their university of choice would affect their decision to attend and to set up an emergency plan in case they’re sent back home in the middle of the semester. In addition, the organization is also talking with students who are enrolled in colleges that were in financial danger before the pandemic to help them assess their options. “If you’re a person of means those are stressors, but they are not necessarily financial stressors,” Sandler said of all of the pandemic-related changes to the college experience. The decision is about “is it worth it to me financially to invest my money? If you’re already terribly precarious financially, it’s much more dangerous than, “Is this worth my investment.’” Even for those students who do ultimately make it through school, the pandemic and the associated economic downturn could affect their financial lives for years to come. Thirteen percent of respondents to the ASU survey said they had their job or internship offers rescinded. Respondents also expected their earnings would be lower at age 35 as a result of the pandemic. If history is any indication, student-advocates say, they may be correct."}]}