{"article": [{"url": "https://www.marketwatch.com/story/why-gasoline-is-set-to-lead-a-bumpy-rebound-in-transportation-fuels-2020-06-19", "published": 1592580440.0, "headline": "Why gasoline is set to lead a bumpy rebound in transportation fuels", "body": "Demand and prices for transportation fuels took a hit when it became apparent that the Covid-19 pandemic would slow down U.S. travel, but gasoline, diesel, and jet fuel are set to establish their own paths toward recovery. “Covid-19 has had a unique influence on transport fuel demand because consumerism decreased so abruptly,” says Jenny Vander Zanden, chief operating officer at transportation and energy management firm Breakthrough. As individual states ease measures to contain the spread of the coronavirus, transport fuel demand will “naturally begin to increase,” but the rate of the rebound will vary by fuel type, she says. Weekly demand for jet fuel dropped to just 352,000 barrels a day for the week ended on May 8, the lowest based on Energy Information Administration data going back to 1991. It climbed to 788,000 barrels a day as of the week ended on June 12, but remains far below the year’s peak of more than 1.7 million barrels a day by mid-March. Jet fuel demand has been “anemic” as Americans stayed away from planes from the onset of the pandemic, says Patrick De Haan, head of petroleum analysis at GasBuddy. It could take several years or longer, or until a vaccine is developed, to see a full recovery, given “older fuel-guzzling jets being retired first to reduce capacity,” he says. Jet fuel is “the most challenged mainstream hydrocarbon coming out of the barrel,” he adds. Similarly, Tom Kloza, global head of energy analysis for the Oil Price Information Service, refers to jet fuel as “hopeless in 2020,” with refiners trying to make as few barrels of jet fuel as possible because “it is a loser, in terms of margin and the ability to move it.” Diesel, meanwhile, saw an early demand surge before the lockdowns as “Americans panicked and hit stores hard,” says De Haan. Factories temporarily raised production, and products were sent to market quickly, “generating more demand for trucks,” which primarily use diesel fuel, before eventually experiencing a slowdown as businesses began shutting down. Diesel was a “saving grace for refiners” early on, he says. Now, “it has quickly taken the ugly-brother role from gasoline, which has seen notable recovery due to cabin fever as summer temperatures arrive.” Vander Zanden says that while some fuel demand has returned, U.S. gasoline sales are still down by 21% year over year; diesel, down 20%; and jet, fuel down 62%, citing EIA data for the week ended on June 12. “Gasoline’s rebound will likely emerge more rapidly than other transport fuels,” she says. Weekly motor gasoline demand hit a low this year of nearly five million barrels a day for the week ended on April 3, EIA data show. It has since climbed to 7.87 million barrels a day. “Gasoline demand will benefit from vacationers taking the great American road trip instead of flying to their destination, and also as commuters shun public transportation,” says Brian Milne, editor, product manager at commodity analysis provider DTN. Still, with so many people out of work and many more working from home, gasoline demand will remain under pressure for months, he says. The average price for regular unleaded gasoline at the pump stood at $2.12 a gallon Friday afternoon, according to GasBuddy. That’s up 21.1 cents from a month ago, but down 55.1 cents from a year ago. On the futures market, reformulated gasoline for July delivery US:RBN20 settled at $1.2716 a gallon on Friday, up around 24% for the month, but still down over 25% for the year, according to Dow Jones Market Data. Overall, the Covid-19-related lockdowns are likely to affect petroleum consumption for years, and may not even see a full recovery in our lifetimes, as businesses adapt to working from home, warns De Haan. Transportation fuels will also have to contend with the risk of a second wave of Covid-19 as states emerge from shutdowns. “Apprehension among consumers and investors will stall future economic growth, keeping spending low, personal savings high, and demand for goods and commercial trucking in neutral,” Vander Zanden says."}]}