{"article": [{"url": "https://www.marketwatch.com/story/pelosi-mcconnell-trade-blame-as-coronavirus-deal-standoff-continues-11596738215", "published": 1596724280.0, "headline": "Pelosi, McConnell trade blame as coronavirus deal standoff continues", "body": "From left: House Speaker Nancy Pelosi, Senate Majority Leader Mitch McConnell and Senate Minority Leader Chuck Schumer speak outside the Capitol on July 29. (Getty Images) Don’t hold your breath for another coronavirus-aid deal from Washington soon. Another high-level negotiation meeting ended Thursday night with congressional Democrats and the White House still far apart on many issues. That was after President Donald Trump threatened to take unilateral moves on some items under debate that could spark legal action. “We understand where we are and where they are on a whole bunch of issues. I think there are a lot of issues we are close to a compromise position on, but I think there are a handful of very big issues that we are still very far apart,” Treasury Secretary Steven Mnuchin told reporters upon leaving a three-hour meeting with House Speaker Nancy Pelosi and Senate Democratic Leader Chuck Schumer. “We’ve had some further exchange of of paper to be clarified, to see if we can find some further common ground, but we’re very far apart,” Pelosi said. “It’s most unfortunate.” Mnuchin, who was accompanied in the meeting by Mark Meadows, the White House chief of staff, said the sides would talk by phone Friday, a day previously seen as the target date to get a framework agreement, to see if it was even worth meeting in person again. The meeting capped another day where Republicans and Democrats accused each other of preventing a deal. In general, Republicans have said Democrats have been unwilling to compromise or take a smaller deal, while Democrats have said Republicans have not been willing to budge and are pushing proposals too small to meet the needs of the stumbling economy. “While they focus on unrelated liberal demands like tax cuts for rich people in blue states, we’re focused on serious solutions for the problems facing Americans right now,” McConnell said as he opened up the Senate for its Thursday session. “Instead of getting serious, the Democratic leaders have chosen instead to misrepresent and even lie about what’s at stake,” he said. McConnell was referring to the Democrats’ bid to reverse the limitation on federal tax deductions for payment of certain state and local taxes which would arguably help upper-income earners in Democratic states. “Perhaps you mistook them for somebody who gives a damn” about those hurt the most economically by the virus and the resulting lockdown, Pelosi said about Republicans in an appearance on CNBC. The impasse continued amid a backdrop of shaky economic data ahead of the July jobs report due out Friday. Meanwhile, weekly jobless claims fell in early August, but remained high by historical standards, at 1.19 million. At her weekly press conference, flanked by Schumer, Pelosi said she could see light at the end of the tunnel that is the talks. “We just don’t know how long the tunnel is. But we have to move quickly, more quickly, because the light at that end of the tunnel may be the freight train of the virus coming at us if we do not act to contain it,” she said. The stalemate so far has seen the extra $600 paid weekly to the jobless by the federal government lapse. Another program put in place in March, the Paycheck Protection Program to aid small businesses, is set to expire Saturday without congressional action. A federal moratorium on evictions expired July 25 but a separate requirement for 30 days’ notice of evictions provides some protection for delinquent tenants through Aug. 24. “Congress should be strengthening the PPP. Instead, the Democrats have put it in jeopardy,” McConnell said, noting Republicans have offered to renew it at $190 billion in lending authority, which would be an expansion from the approximately $140 billion in unused authority it now has. The standoff is also beginning to affect lawmakers’ plans for the usually sacrosanct annual August break. House lawmakers left Washington last week, but were told they would get a 24-hour notice to return if there was a House vote expected. McConnell used similar language Thursday morning but said the Senate will at least formally stay in session, though without scheduled votes it is unclear how much substantial business will be conducted. “I’ve told Republican senators they will have 24-hour notice before a vote, but the Senate will be convening on Monday, and I will be right here in Washington.” McConnell said. “The House has already skipped town, but the Senate won’t adjourn for August unless and until the Democrats demonstrate they will never let an agreement materialize.” All the back-and-forth raises the chances the White House will attempt to make some moves unilaterally by executive order to provide economic relief without the blessing of Congress. Meadows said Thursday night that possibility remained on the table if there were no deal. Schumer warned against it, saying it would “leave most people out, will not cover the broad expanse of what’s needed, will be litigated in court and be awkward and difficult to implement.” “It’s not a good choice at all, and they admitted that in the room — they said that’s not a good choice,” Schumer said. Such a move could extend the eviction moratorium and revive supplemental jobless benefit payments. Pelosi has said President Donald Trump could extend the moratorium through executive action, but that would not forestall delinquent rents from piling up and being due at the end of the moratorium. Read more: Trump may have power to extend eviction moratorium on his own, Pelosi says The other possibility is a short-term bill on a narrow set of issues the two sides agree on, something that Meadows and Mnuchin have brought up before the two sides agreed to reach the framework for a deal by the week’s end. And there is general bipartisan agreement on sending another round of cash payments to individuals, giving schools and colleges money to reopen safely and even on the PPP, albeit with some disagreement on details. But the White House has said the jobless payments and the eviction moratorium should top any short-term bill, while Pelosi remained adamantly opposed to a stopgap bill when asked about it after her and Schumer’s press conference was over. “We’re not having a short-term extension,” Pelosi said flatly."}]}