{"article": [{"url": "https://www.marketwatch.com/story/under-cares-act-tax-sheltered-hsas-are-even-more-useful-nowhow-to-make-the-most-of-them-2020-08-26", "published": 1598627840.0, "headline": "Under CARES Act, tax-sheltered HSAs are even more useful nowâ\u0080\u0094how to make the most of them", "body": "This article is reprinted by permission from NextAvenue.org. As COVID-19 sweeps across the globe, â\u0080\u009cwe know now more than ever our health is at risk and that we may experience unexpected medical expenses,â\u0080\u009d says Juan Carlos Cruz, founder of Britewater Financial Group in Brooklyn, N.Y. What you may not know is that a health savings account (HSA) could help and that The CARES Act, recently passed by Congress, offers extra assistance for people using one. AnÂ HSAÂ is a triple tax-sheltered account to pay for certain medical expenses if you have a high-deductible health plan (a minimum annual deductible of $1,400 for an individual, $2,800 for a family). You can contribute up to $3,550 as an individual or up to $7,100 for a family in 2020, with an extra $1,000 if youâ\u0080\u0099re 55 or older. HSA contributions are tax-deductible; earnings on the accounts grow tax-free, similar to 401(k)s, and you can make tax-free withdrawals for health costs. If your employer doesnâ\u0080\u0099t offer an HSA you can still open one â\u0080\u0094Â if you have a high deductible health plan â\u0080\u0094 at a bank, broker or credit union. Some financial institutions donâ\u0080\u0099t charge to open the account; others levy a small opening fee or account maintenance fee. The maintenance fee is often waived, however, if you keep a minimum balance in the account.The ABCs of HSAs But many people are confused about HSAs and loads of workers offered them donâ\u0080\u0099t sign up. A July 2020 Optum Bank and Retirement survey found thatÂ many employees who have HSAs donâ\u0080\u0099t understand how they workÂ or how contributions can grow. And a Fidelity Investments survey found thatÂ only 50% of employees with access to health savings accounts use them. Yet 62% of HSA users surveyed told Fidelity the accounts help them pay for health care. Also see: Millions of COVID-hit nursing home residents risk losing their vote A key point of confusion: the difference between a Health Savings Account and a Flexible Savings Account (FSA). While both are offered by employers, are funded with pretax contributions and can be used for health costs, only the HSA lets you roll over money you donâ\u0080\u0099t use during the year and keep it in the account â\u0080\u0094 even to use years from now in retirement. Also, if you have an HSA and lose your job, you can keep the HSA as long as you stay in aÂ high-deductible health plan. By contrast, after a job loss, you forfeit any unused funds in an FSA. Another thing that confounds some about HSAs: how to use them as investment accounts for retirement. In the Optum survey, less than half of those who understood that HSA contributions can be invested in mutual funds or other investments have actually considered doing so. â\u0080\u009cLike your 401(k), your HSA account can be deposited into stocks, bonds, mutual funds and ETFs,â\u0080\u009d Cruz says. â\u0080\u009cIf you are risk adverse and fear the volatility may reduce [the size of your health] savings account, you can place your savings in a cash account where it will not experience any market loss.â\u0080\u009d Then, your HSA is like having a tax-sheltered bank account.The CARES Act and HSAs The CARES ActÂ broadened HSA reimbursements in a number of ways, and 13% of HSA participants surveyed by Charles Schwab SCHW, +1.29% Â said theyâ\u0080\u0099veÂ used the accounts for coronavirus-related expenses. â\u0080\u009cThe largest impact COVID-19 made on HSA regulations relates to what folks can now access their HSAs forÂ â\u0080\u0094 even if they havenâ\u0080\u0099t met their out-of-pocket deductible,â\u0080\u009d says Ty Stewart, CEO and president of Simple Life Insure. Also read: Inflation will have a big impact on your retirement Over-the-counter products and medications bought without a prescription since Jan. 1, 2020 are now reimbursable for HSAs. That includes things like pain relievers for cold and flu-related symptoms, menstrual products, contact lenses and solution, thermometers, batteries for medical devices and bandages. If youâ\u0080\u0099ve been furloughed or laid off due to the pandemic, you can use funds in your HSA to pay for health insurance premiums through COBRA, the federal law for people whoâ\u0080\u0099ve left jobs. An HSA can also pay for other health insurance premiums if youâ\u0080\u0099re collecting unemployment. Should you need to buy personal protective equipment (PPE), The CARES Act says you can use HSA funds to cover the cost. You can also use an HSA to pay for COVID-19 testing, along with treatment related to the virus. TelemedicineÂ is now covered, too. The new HSA rules â\u0080\u009ccover the rising use of telehealth services and virtual doctor visits for any reason,â\u0080\u009d Stewart says. And you can tap your HSA for these telehealth services even if you havenâ\u0080\u0099t reached your deductible. â\u0080\u009cFor Americans struggling with their bills, [an HSA] could be a place to look for available funds that would allow their savings to stretch a little further,â\u0080\u009d says Josh Simpson, a financial adviser with Lake Advisory Group in Lady Lake, Fla. You might like: Bonds or bond fundsâ\u0080\u0094which is better? If you have an HSA, you might have used less money from it this year than normal due to the pause on elective surgeries and doctor visits. But keep in mind that since HSA contributions can be rolled over into subsequent years, youâ\u0080\u0099ll be able to use your account whenever you ultimately have postponed surgery or a medical exam. COVID-19 may also motivate you to contribute more in your HSA than in the past. That way, youâ\u0080\u0099ll be better prepared for future health expenses, including in retirement. â\u0080\u009cYou can own one forever, and when invested properly, an HSA can do very well,â\u0080\u009d Cruz says. Rachel Hartman is a freelance writer specializing in finance, business, lifestyle and travel topics. She has written for Parenting, Yahoo Finance and MSN Money, among other outlets. This article is reprinted by permission from NextAvenue.org, Â© 2020 Twin Cities Public Television, Inc. All rights reserved."}]}