{"article": [{"url": "https://www.marketwatch.com/story/boeings-messy-q2-results-get-a-pass-from-wall-street-2020-07-29", "published": 1596097940.0, "headline": "Boeingâ\u0080\u0099s â\u0080\u0098messyâ\u0080\u0099 Q2 results get a pass from Wall Street", "body": "For Boeing Co., not as bad as feared may be as good as it gets. Boeing BA, -0.39% Â earlier Wednesday reported a much wider-than-expected second-quarter adjusted loss, saying the results were â\u0080\u009csignificantly impactedâ\u0080\u009d by the COVID-19 pandemic and the grounding of its 737 Max planes. Revenue, down 25%, also came below Wall Street consensus. Boeing delivered â\u0080\u009ca messy 2Q as expected,â\u0080\u009d Jonathan Raviv at Citi said in a note Wednesday. â\u0080\u009cAt this stage of the crisis where the aero industry is still trying to find its footing, the numbers that stand out are cash and cash balances where things looked â\u0080\u0098ok,â\u0080\u0099â\u0080\u009d with Boeing burning through less cash in the quarter than feared and ending with about $32 billion on the balance sheet, he said. â\u0080\u009cActual (defense and aerospace) results are terrible this reporting season, but in some cases not as bad as feared,â\u0080\u009d Raviv said. The â\u0080\u009centire industry is acclimating to the reality of a prolonged recessionary environment as opposed to a relatively shorter public-health crisis environment. That means itâ\u0080\u0099s not clear when the recovery comes and it means lower-for-longer.â\u0080\u009d Analysts at UBS also praised better-than-feared free cash flow, with a burn around $5.6 billion putting the year-to-date usage at $10.4 billion. Going into the report, cash flow was a top concern for Wall Street. â\u0080\u009cWe would not have been surprised by a $8B+ burn in the quarter given the lower deliveries so clearly a positive,â\u0080\u009d UBS analyst Myles Walton said in a note. Boeing announced more cuts to its commercial-airplane production rates and workforce to align operations â\u0080\u009cto the sharp reduction in commercial market demand.â\u0080\u009d Guidance remained suspended. Boeing stockâ\u0080\u0099s losses widened after a call with analysts later on Wednesday, with the company saying that its free cash flow is still negative into part of 2021, even as it expects to be positive for the full year. In the statement accompanying results, Boeing leaned on the â\u0080\u009cdiversityâ\u0080\u009d of its portfolio. Its government services and defense and space programs provide â\u0080\u009csome critical stability for us in the near-term as we take tough but necessary steps to adapt for new market realities,â\u0080\u009d Chief Executive David Calhoun said. Air travel has ground to a standstill with the pandemic, with hopes for a partial recovery dimming amid the recent surges in COVID-19 cases in several U.S. states. According to a Jefferies note on Wednesday, the total number of flights worldwide are up 3% from last week, but down 55% on year; global capacity is down 73%. Despite tight capacity, the average price of an economy ticket is down 19%, while the average for a business class ticket is down 18%. In addition to production-rate cuts to its 787 and 777 planes, it pushed delivery of its first 777X jets to 2022. Donâ\u0080\u0099t miss:Boeingâ\u0080\u0099s Q2 commercial airplane deliveries drop 78% from last year as COVID-19 weighs The news wasnâ\u0080\u0099t much better for the grounded 737 Max. â\u0080\u009c(Boeing) has resumed production of the 737 MAX at a low rate and now expects a slower than planned production ramp. BA now expects the 737 MAX to increase to 31/mo by the beginning of 2022, slower than previous expectations of reaching 31/mo during 2021,â\u0080\u009d Jefferies analyst Sheila Kahyaoglu said in a separate note on Wednesday. â\u0080\u009cOur estimates had factored in (Boeing) reaching the 31/mo production rate by Q1 2022,â\u0080\u009d she said. Moreover, the production ramp assumes that regulatory approvals will allow deliveries to resume during the fourth quarter of this year. The Wall Street Journal recently reported that many doubt that a return to service will be possible before 2021. The plane family, a â\u0080\u009cGoldilocksâ\u0080\u009d long- and short-haul jet for airlines the world over, has been grounded since March 2019 following two deadly accidents less than five months apart blamed on a faulty anti-stall system. Boeing has been working on software and hardware changes and to get those changes approved, while completing pilot training and other maintenance checks. Boeing shares have lost 49% this year, compared with losses around 7% for the Dow Jones Industrial Average DJIA, +0.56% Â and contrasting with gains under 1% for the S&P 500 index SPX, +0.87% Â in the same period. Boeing is a Dow component."}]}