{"article": [{"url": "https://www.marketwatch.com/story/u-s-plans-to-make-covid-19-vaccine-free-but-only-half-of-americans-say-theyd-take-it-01600266397", "published": 1600252460.0, "headline": "U.S. plans to make COVID-19 vaccine free, but only half of Americans say they'd take it", "body": "Most vaccines will require two doses, 21 to 28 days apart, according to the plan. AP Photo/Kirsty Wigglesworth WASHINGTON (AP) - The federal government outlined a sweeping plan Wednesday to make vaccines for COVID-19 available for free to all Americans, even as polls show a strong undercurrent of skepticism rippling across the land. In a report to Congress and an accompanying \"playbook\" for states and localities, federal health agencies and the Defense Department sketched out complex plans for a vaccination campaign to begin gradually in January or possibly later this year, eventually ramping up to reach any American who wants a shot. The Pentagon is involved with the distribution of vaccines, but civilian health workers will be the ones giving shots. The campaign is \"much larger in scope and complexity than seasonal influenza or other previous outbreak-related vaccination responses,\" said the playbook for states from the Centers for Disease Control and Prevention. Among the highlights: - For most vaccines, people will need two doses, 21 to 28 days apart. Double-dose vaccines will have to come from the same drugmaker. There could be several vaccines from different manufacturers approved and available. - Vaccination of the U.S. population won't be a sprint but a marathon. Initially there may be a limited supply of vaccines available, and the focus will be on protecting health workers, other essential employees, and people in vulnerable groups. CDC's Advisory Committee on Immunization Practices, the National Academy of Medicine, and other organizations are working on priorities for the first phase. A second and third phase would expand vaccination to the entire country. - The vaccine itself will be free of charge, and patients won't be charged out of pocket for the administration of shots, thanks to billions of dollars in taxpayer funding approved by Congress and allocated by the Trump administration. - States and local communities will need to devise precise plans for receiving and locally distributing vaccines, some of which will require special handling such as refrigeration or freezing. States and cities have a month to submit plans. Some of the broad components of the federal plan have already been discussed, but Wednesday's reports attempt to put the key details into a comprehensive framework. Distribution is happening under the umbrella of Operation Warp Speed, a White House-backed initiative to have millions of doses ready to ship once a vaccine is given what's expected to be an emergency use approval by the Food and Drug Administration. Several formulations are undergoing final trials. But the whole enterprise is facing public skepticism. Only about half of Americans said they'd get vaccinated in an Associated Press poll taken in May. Of those who wouldn't get vaccinated, the overwhelming majority said they were worried about safety. To effectively protect the nation from the coronavirus, experts say upwards of 70% of Americans must either be vaccinated or have their own immunity from fighting off COVID-19. Since the poll, questions have only mounted about whether the government is trying to rush COVID-19 treatments and vaccines to help President Donald Trump's reelection chances. Before the Republican National Convention in August, the FDA granted authorization for treatment of COVID-19 patients with plasma from people who have recovered, even though some government scientists were not convinced the clinical evidence was sufficiently strong. And last week it was reported that Michael Caputo, a Health and Human Services Department political appointee, tried to gain editorial control over a weekly scientific publication from the Centers for Disease Control and Prevention. As public confidence in core health agencies has taken a beating, Trump administration officials have been forced to play defense. \"We are working closely with our state and local public health partners â\u0080¦ to ensure that Americans can receive the vaccine as soon as possible and vaccinate with confidence,\" HHS Secretary Alex Azar said in a statement Wednesday. \"Americans should know that the vaccine development process is being driven completely by science and the data.\" That could be a tough sell. In the AP poll, 1 in 5 Americans said they would not get a coronavirus vaccine, and 31% said they were unsure."}]}