{"article": [{"url": "https://www.marketwatch.com/story/global-banks-hit-by-new-corruption-allegations-why-authorities-are-unlikely-to-act-this-time-2020-09-21", "published": 1600754660.0, "headline": "Global banks hit by new corruption allegations. Why authorities are unlikely to act this time", "body": "Shares of European banks fell sharply on Monday, after the release by BuzzFeed and the International Consortium of Investigative Journalists of thousands of documents seemingly showing that some $2,000 billion worth of illicit funds were moved and laundered through the U.S. financial system over two decades. - The papers show that five global banks — JPMorgan JPM, -0.57%, HSBC, Standard Chartered Bank, Deutsche Bank DBK, -1.07%, and Bank of New York Mellon — kept doing business with “oligarchs, criminals and terrorists” even after being fined by U.S. authorities for earlier failures to clamp down on dirty money. The banks themselves said they could not comment on specific transactions due to bank secrecy laws. Their statements can be found here. - The reports are based on leaked suspicious activity reports (SARs) filed by banks and other financial firms with the U.S. Department of Treasury. - Shares in British-Asian giant lender HSBC HSBA, -1.49% and the U.K.’s Standard Chartered STAN, -1.38% fell 6% and 5%, respectively, marking 20-year lows in London mid trading. HSBC said in a statement that “all of the information provided (...) is historical.” The outlook: The report, based mostly on past behavior already fined and sanctioned by U.S. authorities, is unlikely to trigger new punishments by governments or regulators. Especially not in a moment in the deepest of the coronavirus recession, when authorities are trying to convince and subsidize banks so they can keep lending to businesses and households. And even if legal grounds did exist in a few cases for authorities to act, regulators everywhere are likely to decide that punishment by markets is enough for now. Read: U.K. edges closer to second national lockdown to help contain second coronavirus wave"}]}