{"article": [{"url": "https://www.marketwatch.com/story/blue-cross-blue-shield-medicare-plans-review-01602268771", "published": 1602254840.0, "headline": "Blue Cross Blue Shield Medicare Plans Review", "body": "MarketWatch has highlighted these products and services because we think readers will find them useful. This content is independent of the MarketWatch newsroom and we may receive a commission if you buy products through links in this article. Blue Cross Blue Shield is one of the most well-known names in health insurance. Over 106 million people (one in three Americans) are covered by a Blue Cross Blue Shield plan. It’s also the insurer of choice for 88 of the country’s Fortune 100 companies. When it comes to Medicare plans, roughly 15 percent of all enrollees choose a Blue Cross Blue Shield Medicare Advantage plan. The company and its subsidiaries sell Medicare Advantage plans in 41 states and Medicare Supplement plans in all 50 states. This guide explains what Blue Cross Blue Shield plans are available and details how they compare with other plans currently on the market. RELATED: To learn more about Medicare Supplement and Advantage plans, call: 844-259-6504.Pros and Cons of Blue Cross Blue Shield Medicare Plans Pros Cons Reputable company with a nationwide presence Medicare Advantage not available in all states Multiple plan types, including $0 premium and $0 deductible plans Part D prescription drug coverage not included in all Medicare Advantage plans Extra benefits available for vision and dental; most plans include fitness benefits Operates 36 different regional companies; finding information on the company’s website can be confusing Large provider network In some states, Blue Cross Blue Shield gets below average marks for customer service Transparent pricing, with discounts on Medicare Supplement plans Most plans are rated 3.5 or 4 out of 5 stars in the Medicare star ratings system About Blue Cross Blue Shield Medicare Before you compare plans, it’s important to note that Blue Cross Blue Shield is an organization for 36 different health insurance companies. While this guide discusses Blue Cross Blue Shield Medicare plans, in some states, they may be sold under a different name.Blue Cross Blue Shield Medicare Supplement Plans Blue Cross Blue Shield sells seven different Medicare Supplement plans: Plan A Plan F High-deductible Plan F Plan G Plan K Plan L Plan N Not all plans may be available in every state. Note that Plan F and high-deductible Plan F are only available to people who first became eligible for Medicare before January 1, 2020. RELATED: Find the right Medicare Supplement plan option for you here.Blue Cross Blue Shield Medicare Supplement Plan Benefits Medicare Supplement plan benefits are standardized by the federal government. This means you get essentially the same benefits with a Blue Cross Blue Shield Plan G as you would with any Plan G sold by another insurance company. A few states have state-specific laws regarding Medigap plans, which may affect your coverage. You may be able to add dental and vision to your Blue Cross Blue Shield Medicare Supplement plan depending on where you live. There is an additional monthly premium for this coverage. You may also have access to the Blue365 program, which offers discounts on health and wellness services such as hearing aids, gym memberships, diet and nutrition supplements, and even cell phone plans. These benefits vary by location.Blue Cross Blue Shield Medicare Supplement Plan Costs Premiums are based on several factors, including your age, gender, ZIP code, and smoking status. Rates tend to be competitive in most markets, but you may be able to lower your monthly premium even further with the following discounts: Household discount: Available if both spouses buy a Blue Cross Blue Shield plan Non-smoking discount: Available if you haven’t used tobacco products for a specified period of time Automatic payment discount: Available if you set up electronic premium payments from your bank account Plan premiums are generally available on the Blue Cross Blue Shield website, allowing you to easily compare costs for your plans of interest.Bottom Line Blue Cross Blue Shield Medicare Supplement plans are backed by a major national health insurance company with an A+ rating from A. M. Best. Plan members generally have the option to customize their coverage with additional dental and vision insurance for an extra premium. They can also potentially lower their monthly premiums with multiple premium discounts. The fact that the company has a large network of affiliates means that members often have access to discounts on products and services, as well as other perks. On the other hand, Blue Cross Blue Shield receives poor marks for response time in some areas. Some third-party review sites, such as the Better Business Bureau and Consumer Affairs, also give the company below-average ratings for customer service in certain areas. However, this is not uncommon among large, national insurance companies.Blue Cross Blue Shield Medicare Advantage Reviews Blue Cross Blue Shield offers several Medicare Advantage plans in most states. These plans include $0 premium, $0 deductible HMO, PPO, and Special Needs Plans (SNPs), which are limited to people who meet eligibility requirements. Keep in mind you must continue to pay your Part B premium even if you enroll in Medicare Advantage. Blue Cross Blue Shield does not currently sell Medicare Advantage plans in the following states: Alaska Delaware Hawaii Iowa Mississippi North Dakota South Dakota Vermont Wyoming Washington, DC RELATED: Find out if there are Medicare Advantage plans in your area.Blue Cross Blue Shield Medicare Advantage Plan Types Most Blue Cross Blue Shield Medicare Advantage plans are either HMOs or PPOs. Special Needs Plans are not as widely available, and are limited to individuals who are dual-eligible for Medicare and Medicaid, live in a long-term care facility, or have a chronic health condition.Blue Cross Blue Shield HMOs HMO plans are generally available as either a basic or an enhanced option. All HMO plans include a fitness membership, such as the Silver & Fit or SilverSneakers program. A few plans include some of the new expanded benefits, such as home meal delivery and non-medical transportation. Another thing to note is that you’re required to choose a primary care provider and receive all of your care in-network. The only exception is in the case of an emergency. Some services require a referral or prior authorization.Sample HMO Plan Comparison Basic Enhanced Part D Prescription Drug Coverage No Yes Preventive Vision and Dental No Yes Premium $0 $0 Deductible $0 $0 for medical, $0 for Tier 1 and Tier 2 prescription drugs, $375 for Tiers 3, 4, and 5 Out-of-Pocket Maximum $4,400 $4,200 You have copays for most services. This is typically a flat fee charged for primary care and specialist services, urgent care, emergency room visits, and most diagnostic tests. For some services, you pay a percentage of the amount charged. All Blue Cross Blue Shield Medicare Advantage plans have an annual out-of-pocket maximum. Once you reach that amount, your plan pays 100 percent of all covered charges. This allows you peace of mind knowing what to expect regarding your exact healthcare costs. Blue Cross Blue Shield PPOs If you buy a PPO plan, you have the option of choosing in-network care or going outside the network to see any provider that accepts your plan. You will generally pay a flat copayment with network providers but will pay a percentage of the actual charges for any out-of-network care. There is an annual out-of-pocket limit with PPO plans, but it is typically a great deal lower for network services.Sample PPO Plan Summary Premium $59 Deductible $0 Part D prescription drug coverage Yes, with $0 deductible Routine vision and dental coverage Yes Out-of-pocket maximum $5,900 in-network, $8,900 out-of-network Blue Cross Blue Shield Special Needs Plans SNPs are HMO plans designed to fit the unique needs of the plans’ members. For example, a diabetes SNP might include benefits for dietician services, weight management, and podiatry care, and even may offer low copays for a wide range of diabetes medications. All SNPs include Part D prescription drug coverage, and most provide extra benefits such as vision and dental, medical social worker services, and coordination of care. These are usually $0 premium, $0 deductible plans.Bottom Line Blue Cross Blue Shield offers a wide variety of HMO and PPO plans at every price point, including multiple $0 premium, $0 deductible plans. All plans include fitness benefits. Most plans include Part D prescription drug coverage and extra benefits for routine vision and dental care. Blue Cross Blue Shield is known for its large provider network. If you choose a PPO plan, chances are good you’ll find a participating provider anywhere you travel in the United States. Its pharmacy network is similarly impressive, with excellent mail order pharmacy options to help you save on prescription drugs. On the other hand, the company’s Medicare Advantage plans received lower than average ratings for customer service in several markets. Also noteworthy are the facts that access to a 24/7 nurse hotline isn’t universally available, and only one Blue Cross Blue Shield plan achieved a 5-star rating from Medicare. Choosing a Medicare plan is one of the most important decisions you’ll make in retirement. Blue Cross Blue Shield sells a wide range of Medicare plans, which means you’ll be able to find one that suits your budget and health needs. You can find information about Blue Cross Blue Shield plans in your area using the Medicare Plan Finder. A licensed Medicare broker is a useful resource for information about plan networks, covered medications, and member experience. Sheila Olson writes for Home Media and has over two decades of experience writing about Medicare, health, and personal finance. Her work has been featured on sites such as Investopedia, The Motley Fool, and Boomer Benefits."}]}