{"article": [{"url": "https://www.marketwatch.com/story/heres-everything-coming-to-hbo-max-in-july-2020-and-whats-leaving-2020-06-23", "published": 1593499580.0, "headline": "Hereâ\u0080\u0099s everything coming to HBO Max in July 2020, and whatâ\u0080\u0099s leaving", "body": "HBO Max is only a month old, but itâ\u0080\u0099s already become a go-to-destination for streaming classic movies, and will bolster its already impressive catalog in July 2020. Alongside a handful of original series â\u0080\u0094 such as the three-part Amy Schumer docuseries â\u0080\u009cExpecting Amyâ\u0080\u009d (July 9) and the surreal animated comedy â\u0080\u009cClose Enoughâ\u0080\u009d (July 9) â\u0080\u0094 the AT&T T, -1.01% Â -owned streaming service will add a ton of movies, including â\u0080\u009cThe Exorcist,â\u0080\u009d â\u0080\u009cAmerican Graffiti,â\u0080\u009d â\u0080\u009cBlazing Saddles,â\u0080\u009d â\u0080\u009cThe Departedâ\u0080\u009d and â\u0080\u009cThe Right Stuffâ\u0080\u009d (all July 1). div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Update: â\u0080\u009cThe House of Ho,â\u0080\u009d originally scheduled to debut in July, has been pushed back to the second half of the year, according to HBO Now. Thatâ\u0080\u0099s on top of HBO originals such as Season 4 of the quirky anthology series â\u0080\u009cRoom 104â\u0080\u009d (July 23) and HBO Europeâ\u0080\u0099s â\u0080\u009cFoodie Loveâ\u0080\u009d (July 13). Read more: Whatâ\u0080\u0099s streaming in July on Netflix | Amazon Prime | Hulu | Disney+ Itâ\u0080\u0099ll also be your last chance to watch â\u0080\u009cCrazy Rich Asians,â\u0080\u009d \"Blindspottingâ\u0080\u009d and â\u0080\u009cCasino Royale,â\u0080\u009d which are among the movies leaving in July.Whatâ\u0080\u0099s coming in July 2020 July 1 Absolute Power, 1997 The Adventures of Pinocchio, 1996 The Amazing Panda Adventure, 1995 American Graffiti, 1973 (HBO) American History X, 1998 Angels in the Outfield, 1951 Angus, 1995 August Rush, 2007 The Bachelor, 1999 Batman & Mr. Freeze: SubZero, 1998 Batman and Harley Quinn , 2017 Batman vs. Two-Face, 2017 The Batman vs. Dracula, 2005 Batman: Assault on Arkham, 2014 Batman: Return of the Caped Crusaders, 2016 Batman: Under the Red Hood, 2010 Batman: Year One, 2011 Beautiful Creatures, 2013 Beerfest, 2006 The Big Year (Extended Version), 2011 (HBO) The Bishopâ\u0080\u0099s Wife, 1947 Blade 2, 2002 Blade, 1998 Blade: Trinity, 2004 Blazing Saddles, 1974 div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Blood Work, 2002 Born to Be Wild, 1995 The Boy Who Could Fly, 1989 Bridget Jones: The Edge Of Reason, 2004 (HBO) Catch Me If You Can, 2002 Claraâ\u0080\u0099s Heart, 1988 The Conjuring, 2013 Cop Out, 2010 Creepshow, 1982 Death Becomes Her, 1992 (HBO) The Departed, 2006 The Dirty Dozen, 1967 Dirty Harry, 1971 Doc Hollywood, 1991 Dolphin Tale, 2011 Dumb & Dumber, 1994 Dumb and Dumberer: When Harry Met Lloyd, 2003 Enemy of the State, 1998 (HBO) The English Patient, 1996 (HBO) The Enforcer, 1976 The Exorcist, 1973 Fantastic Four, 2005 (Extended Version) (HBO) Flags of Our Fathers, 2006 (HBO) Flushed Away, 2006 (HBO) Four Christmases, 2008 Fred Claus, 2007 Free Willy 2: The Adventure Home, 1995 Free Willy 3: The Rescue, 1997 Free Willy, 1993 Free Willy: Escape from Pirateâ\u0080\u0099s Cove, 2010 Freedom Fighters: The Ray, 2017 The Gauntlet, 1977 Get Smart, 2008 Good Girls Get High, 2019 Green Lantern: Emerald Knights, 2011 Green Lantern: First Flight, 2009 The Green Pastures, 1936 Grumpier Old Men, 1995 Grumpy Old Men, 1993 A Guy Named Joe, 1943 Halwa, 2019 APAV Short (HBO) Heartbreak Ridge, 1986 The Horn Blows at Midnight, 1945 Horrible Bosses, 2011 (Extended Version) (HBO) In Secret, 2014 (HBO) In Time, 2011 (HBO) Inkheart, 2009 Innerspace, 1987 (HBO) Insomnia, 2002 J. Edgar, 2011 Jack Frost, 1998 Jane Eyre, 2011 (HBO) Jeepers Creepers 2, 2003 (HBO) Jeepers Creepers, 2001 (HBO) JLA Adventures: Trapped in Time, 2014 John Q, 2002 (HBO) Journey to the Center of the Earth, 2008 Justice League vs. Teen Titans, 2016 Justice League: Crisis on Two Earths, 2010 Justice League: Doom, 2012 Justice League: Gods and Monsters, 2015 Justice League: The Flashpoint Paradox, 2013 Justice League: The New Frontier, 2008 Justice League: Throne of Atlantis, 2015 Justice League: War, 2014 Kill Bill: Volume 1, 2003 Kill Bill: Volume 2, 2004 Kiss of the Dragon, 2001 (HBO) Lara Croft Tomb Raider: The Cradle of Life, 2003 Lara Croft: Tomb Raider, 2001 The Last Emperor, 1987 (HBO) Last Knights, 2015 (HBO) The Last Samurai, 2003 Lego DC Comics Super Heroes: Justice League vs. Bizarro League, 2015 Lego DC Comics Super Heroes: The Flash, 2018 Lego DC Super Hero Girls: Super-Villain High, 2018 Lego Justice League: Cosmic Clash, 2016 Lego Justice League: Gotham City Breakout, 2016 The Letter, 2020 (HBO) Life Is Beautiful, 1998 (HBO) Little Big League, 1994 Little Manhattan, 2005 (HBO) Little Nicky, 2000 The Longest Yard, 2005 Loser Leaves Town, 2020 (HBO) Love Donâ\u0080\u0099t Cost a Thing, 2003 Mad Max 2: The Road Warrior, 1983 Mad Max Beyond Thunderdome, 1985 Magnolia, 1999 (HBO) Malibuâ\u0080\u0099s Most Wanted, 2003 Mars Attacks, 1996 Megamind, 2010 Message In A Bottle, 1999 Michael, 1996 Mickey Blue Eyes, 1999 Money Talks, 1997 Monkey Trouble, 1994 Moonwalk With Me, 2019 APAV Short (HBO) Mr. Nanny, 1993 Munich, 2005 (HBO) Music and Lyrics, 2007 Nancy Drew, 2007 National Lampoonâ\u0080\u0099s Christmas Vacation, 1989 National Lampoonâ\u0080\u0099s European Vacation, 1985 National Lampoonâ\u0080\u0099s Loaded Weapon, 1993 National Lampoonâ\u0080\u0099s Vacation, 1983 Necessary Evil: The Super-Villains of DC Comics, (Documentary Premiere) New Looney Tunes Now and Then, 1995 Orphan, 2009 Osmosis Jones, 2001 Pee-weeâ\u0080\u0099s Big Adventure, 1985 The Polar Express, 2004 Pop Star, 2005 Power, 1986 The Resurrection Of Gavin Stone, 2017 (HBO) Rich and Famous, 1981 The Right Stuff, 1983 div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Rumor Has It, 2005 Saving Private Ryan, 1998 Sesame Street Presents Follow That Bird, 1985 Showgirls, 1995 (HBO) Something to Talk About, 1995 Space Jam, 1996 Spies Like Us, 1985 Star Trek, 2009 Stay, 2005 (HBO) Sudden Impact, 1983 Suicide Squad: Hell to Pay, 2018 Superman II, 1981 Superman III, 1983 Superman IV: The Quest for Peace, 1987 Superman Returns, 2006 Superman: Brainiac Attacks, 2006 Superman: The Movie, 1978 Superman: Unbound, 2013 Sweet November, 2001 Take the Lead, 2006 Tenacious D in the Pick of Destiny, 2006 Tequila Sunrise, 1988 The Talented Mr. Ripley, 1999 (HBO) Thirteen Ghosts, 2001 Tightrope, 1984 Tom & Jerry: The Movie, 1993 The Towering Inferno, 1974 (HBO) Troy, 2004 True Crime, 1999 Twelve Monkeys, 1995 (HBO) Unforgiven, 1992 Vegas Vacation, 1997 Watchmen (Movie), 2009 Whatâ\u0080\u0099s Your Number?, 2011 (Extended Version) (HBO) Women, The, 2008 Wyatt Earp, 1994 Yogi Bear (Movie), 2010 Yours, Mine, and Ours, 2005 Zoetic, 2019 APAV Short (HBO) July 3 Los Futbolismos (Aka The Footballest), 2020 (HBO) July 4 Midway, 2019 (HBO) July 7 Blue Exorcist, Seasons 1 & 2 Your Lie in April, Season 1 91 Days, Season 1 July 9 Close Enough, Series Premiere div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Expecting Amy, Docuseries Premiere July 11 Sesame Street, Season 50 Finale (HBO) Last Christmas, 2019 (HBO) July 13 Foodie Love, Series Premiere (HBO) July 14 Inuyasha, Season 1 Showbiz Kids, Documentary Premiere (HBO) July 15 Smurfs, Season 1 July 17 Abuelos (Aka Grandpas), 2020 (HBO) July 18 Harriet, 2019 (HBO) July 21 Bungo Stray Dogs, Seasons 1-3 Puella Magi Madoka Magica, Season 1 July 23 Tig nâ\u0080\u0099 Seek, Series Premiere July 24 Room 104, Season 4 Premiere (HBO) La Gallina Turuleca (Aka Turu, The Wacky Hen), 2020 (HBO) July 25 Motherless Brooklyn, 2019 (HBO) div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } July 28 Aldnoah.Zero, Season 1 Mob Psycho, Season 1 Stockton On My Mind, Documentary Premiere (HBO) July 30 The Dog House â\u0080\u0093 UK Edition, Season 1 Frayed, Series Premiere July 31 Los Lobos, 2020 (HBO)Whatâ\u0080\u0099s leaving in July July 5 Crazy Rich Asians, 2018 (HBO) The Nun, 2018 (HBO) July 7 The Defiant Ones (HBO) July 30 Blindspotting, 2018 July 31 A Christmas Story, 1983 Analyze This, 1999 Aquamarine, 2006 (HBO) Blood Diamond, 2006 Bowling For Columbine, 2002 (HBO) Boys Donâ\u0080\u0099t Cry, 1999 (HBO) Casino Royale, 1967 (HBO) Casino Royale, 2006 (HBO) Crimson Peak, 2015 (HBO) Final Destination, 2000 For Love Of The Game, 1999 (HBO) Friday the 13th, 2009 Hairspray (Musical Remake), 2007 Hairspray, 1988 Happy Feet, 2006 Intolerable Cruelty, 2003 (HBO) King Arthur (Directorâ\u0080\u0099s Cut), 2004 (HBO) Long Shot, 2019 (HBO) Look Away, 2019 (HBO) Mamartuile, 2018 (HBO) Man Of The House, 1995 (HBO) Mildred Pierce, 1945 Now, Voyager, 1942 Once Upon A Crime, 1992 (HBO) Pet Sematary, 1989 Presumed Innocent, 1990 Pride and Prejudice, 1940 The Polar Express, 2004 Quantum Of Solace, 2008 (HBO) Recreo, 2019 (HBO) Rio, 2011 (HBO) Rock The Kasbah, 2015 (HBO) Season Of The Witch, 2011 (HBO) Sheâ\u0080\u0099s Funny That Way, 2015 (HBO) The Goonies, 1985 The Honeymooners, 2005 (HBO) The Island, 2005 (HBO) The Merchant Of Venice, 2004 (HBO) The Neverending Story, 1984 The Predator, 2018 (HBO) The Sun Is Also A Star, 2019 (HBO) The Take, 2016 (HBO) TMNT, 2007 When Harry Met Sally, 1989 X-Men, 2000 (HBO)"}]}