{"article": [{"url": "https://www.marketwatch.com/story/senate-gop-closing-in-on-covid-aid-bill-deal-with-white-house-11595520939", "published": 1595664200.0, "headline": "Senate GOP leaves town, aiming to unveil COVID-19 aid bill Monday", "body": "Mark Meadows, White House chief of staff, left, and Steven Mnuchin, U.S. Treasury secretary, speak to the media after a meeting with Senate Majority Leader Mitch McConnell on Thursday at the U.S. Capitol. Bloomberg News They’re not there yet. Senate Republicans, who had originally hoped to unveil a counteroffer to the Democrats’ $3.4 trillion coronavirus bill as early as Tuesday or Wednesday this week, will now keep details under wraps until Monday. Senate Majority Leader Mitch McConnell announced the timeline late Thursday, after most Republicans had left the Capitol for the weekend. “This is the package our country needs. This is what we will introduce,” he said. The delay, even as some senators had said they expected legislative text to be released today, puts a bipartisan goal of getting a bill done by next Friday in jeopardy. And it may weaken Republicans’ bargaining hand politically. Sen. Marco Rubio, a Florida Republican, said the delay was not a big deal. “Most members at this point have a general sense of where it’s headed and they’ll have different opinions about what the size of it should be, what we should we should be involved in,” said Rubio. “We’re a diverse conference, so we’re going to have those differences of opinion.” Earlier in the day, two top Trump administration officials, Treasury Secretary Steven Mnuchin and White House chief of staff Mark Meadows, told reporters after meeting with McConnell that the package was just about done. “Whether this is introduced today or not, we’re still looking at the timing. Again, we have a fundamental agreement and we’re going through the language,” Mnuchin said Mnuchin said the outlines included an extension through the end of the year of an add-on amount to jobless benefits, but at a rate intended to replace 70% of a worker’s missed wages, rather than the $600-a-week amount that was in place from the coronavirus aid bill enacted on a bipartisan basis in March. “This is about wage replacement and we don’t want to incentivize people not to work,” Mnuchin said. He said the administration is prioritizing money for schools and extending the unemployment add-on, and aiming to have a bill done by July 31. However, labor experts say state computer systems that process unemployment benefits are so antiquated that a delay past Friday will mean at least a short interruption in the extra payments. “The problem is that if Congress doesn’t act by this weekend, states have to turn off the code in their IT systems allowing payment of the $600, and there is not a quick way to flip the ‘on’ switch back on. It will take 2-4 weeks to restart,” said Michele Evermore, senior policy analyst with the left-leaning National Employment Law Project, in an email. Mnuchin said he did not think there would be a gap and the administration was looking at technical fixes to ensure that. “There’s a way to extend this, so the majority of the people will get paid the 70% immediately,” he said. “One of the things we’ll do is work with the banks. I think you know there’s plenty of banks that are willing to extend credit to people if they know the government is going to come in. There’s plenty of things we can do.” The package will include $105 billion for schools, colleges and virus testing, a figure they noted was higher than the Democrats’ $100 billion in their bill in May. Another round of individual checks would also go out, with the same parameters as the first batch in the spring. The Paycheck Protection Program, which has more than $100 billion in loan authority sitting unused and expires in early August, would be extended as well. Rubio said the plan would extend the Paycheck Protection Program and add more money to it. It would allow businesses with 300 or fewer workers and who met Small Business Administration revenue guidelines for the current PPP program to get a second round of help. Businesses would also be able to qualify if they were located in an impoverished U.S. Census tract. McConnell said the package would also include language pushed by Sen. Mitt Romney, a Utah Republican, to help stabilize the finances of several U.S. government trust funds. Similar efforts to create commissions or panels to solve entitlement program finances have largely failed. Exaxctly how the pieces of the package will be handled legislatively remained unclear. Mnuchin said the they would like to see an overarching package dealing with all the issues, but if that wasn’t possible in a short time frame, the focus would be on the unemployment add-on payment and the school money and other issues could be dealt with in separate, later bills. But that idea — breaking the aid package into more bite-size pieces — drew a quick rebuke from House Speaker Nancy Pelosi. “This is a package. We cannot piecemeal this,” she said at her weekly press conference. Mnuchin said there will be more time to work on issues that don’t face immediate deadlines. “We’re at a trillion dollars,” he said. “If we need to come back to work in the next 45 days, 60 days, if the economy needs more money — we’ve done four of these deals — we can always come back and do more,”"}]}