{"article": [{"url": "https://www.marketwatch.com/story/ibm-outlook-remains-cloudy-at-best-as-new-ceo-fails-to-plot-the-way-forward-2020-07-21", "published": 1595400680.0, "headline": "IBM outlook remains cloudy at best as new CEO fails to plot the way forward", "body": "International Business Machines Corp.’s earnings initially boosted the stock, but shares eventually lost their momentum because there was little actual reason for optimism. On Monday, IBM IBM, -2.81% beat analysts’ expectations, which were revised with the knowledge that the COVID-19 pandemic had taken a toll on some of its customers’ purchasing power, but still showed large declines in earnings and revenue. Big Blue’s new chief executive, Arvind Krishna, said it was tough to give guidance in the current backdrop, but failed to lay out much of a pandemic plan that goes beyond his predecessor’s path, at least for now. IBM stock was up more than 5% in after-hours trading Monday when the results were announced, but those gains eventually dissipated in Tuesday trading. That is because there was little to suggest an improvement from the company’s prospects three months ago, when IBM closed at a lower price than the going rate and sank after the report. In fact, IBM’s outlook has probably worsened in the past three months. “It’s likely that we see that the economic recovery is looking to be longer and more protracted than we might have hoped for back in March,” Krishna said in Monday’s earnings call, in which he did not provide a financial forecast. Krishna needed to voice how IBM is reacting to that dynamic, but largely failed to do so. The CEO took over for Ginni Rometty earlier this year, and has largely kept to the mantra of hybrid cloud — backed by the acquisition of Red Hat Inc. — and artificial intelligence that defined the end of her reign. Despite the pandemic’s arrival not long after Krishna took over, little has changed, despite COVID-19 likely making pure cloud a better play than hybrid cloud and IBM’s legacy tech. See also: Tech has been a pandemic savior and been richly rewarded. So what happens now? “We see opportunity in hybrid cloud, we see opportunity in digital transformation. We see opportunity in people as they’re doing a return to the workplace and projects that all advance those things,” Krishna said. “Some of those give long-term benefit, some give them short-term benefit.” While IBM keeps talking about the cloud, right now its cloud business is focused on hybrid cloud, with its large base of entrenched customers using legacy systems and software. Hybrid cloud is where companies with their own massive systems keep part of their data on premise and move part of their data to be managed by another company. Krishna said the pandemic is accelerating the shift to hybrid cloud systems by many customers. But pure cloud-service providers are faring far better in the pandemic, as more companies look to move their entire computing operations to Amazon’s AMZN, +3.01% AWS, Microsoft Corp. MSFT, +2.48% Azure and Alphabet Inc.’s GOOG, +1.97% GOOGL, +1.82% Google Cloud. Many companies are not doing a full return to the workplace and won’t anytime soon, and some are letting their employees work from home until at least the end of the year. That trend appears to suit Amazon and Azure, and it’s clear now that every company needs some kind of cloud strategy. IBM is hoping its hybrid stance will keep its legacy customers happy, but it may have a hard time attracting new ones in the current environment. Additionally, Krishna and his team are continuing down IBM’s well-worn path of major cost-cutting to help lower expenses. IBM has quietly been cutting jobs, which it refers to as “workforce rebalancing” in its regulatory filings and the charts that accompany earnings press releases. On the conference call, Chief Financial Officer Jim Kavanaugh referred to “structural actions” that will help earnings going forward, especially in its services business. Read: S&P 500 earnings set to plunge as the coronavirus batters all sectors “Savings from our structural actions will start to yield in the second half, providing better cost competitiveness and margin performance, especially in GTS [global technology services],” he said. Since Krishna became CEO in late January, IBM has cut an unspecified yet seemingly large number of jobs. In the first quarter, IBM took a $728 million charge for workforce rebalancing, according to its most recent 10Q from late April. In the second quarter, IBM took another $140 million charge for workforce rebalancing, but did not specify how many jobs were cut or moved to other businesses as a result. An IBM spokesman said it announced structural actions during its earnings call in January, to reposition its global services business, and that the charges in the first and second quarter are part of that same announcement. IBM ended 2019 with about 352,000 people, and yesterday said it would hire 1,000 paid interns from inner-city schools, as part of a program to diversify its tech talent. But the spokesman declined to say how many jobs IBM has cut, adding that IBM only reports its employee population at the end of the year. One Wall Street analyst wrote Tuesday that she believes the pandemic may be delaying even more aggressive moves by Krishna, which she believes are necessary for a complete turnaround. More from Therese: This Wall Street analyst turned his Twitter feed into ‘Sell-Side Stories with Stacy’ “Although IBM should fare relatively well through a recession, the pandemic will delay new-CEO Krishna’s ability to take more aggressive strategic actions to turn around IBM’s business (e.g., divestitures, acquisitions, radical restructuring) — in our view, essential to the success of the turnaround — and in the meantime, the company will continue its slow, difficult decline,” wrote MoffettNathanson Research analyst Lisa Ellis, in a note. In an email, Ellis estimates IBM’s job cuts in a range of 5,000 to 10,000, and said that she believes the new CEO needs to do more, such as potentially splitting up services and/or legacy products, to focus on its higher growth opportunities. “We believe that IBM should consider — not saying it is the right answer, but should be seriously evaluated — breaking up the company, splitting the services businesses apart from products; potentially separating the growth products (like Red Hat) away from the legacy platforms that are stable, but declining and can be run for cash,” Ellis said. “As a new CEO in a turnaround situation, we believe Arvind should — and arguably has a fiduciary duty to — evaluate some more drastic options.” While the pandemic does make it harder to make big moves, it does not preclude an executive from confidently laying out the path forward he expects to take. At Big Blue, though, that path seems to be “Whatever we already had planned, and layoffs that we won’t talk much about,” which simply isn’t good enough for investors to have confidence in the future."}]}