{"article": [{"url": "https://www.marketwatch.com/story/paypal-tops-earnings-expectations-as-covid-19-drives-big-e-commerce-growth-2020-07-29", "published": 1596044180.0, "headline": "PayPal tops earnings expectations as COVID-19 drives big e-commerce growth", "body": "Shares of PayPal Holdings Inc. PYPL, +2.18% were up more than 3% in after-hours trading Wednesday after the digital payments company topped earnings and revenue expectations amid booming growth in online transactions. (See more about the company's earnings in MarketWatch's interview with Chief Executive Dan Schulman.) PayPal posted net income of $1.53 billion, or $1.29 cents a share, up from $823 million, or 69 cents a share, in the year-prior quarter. PayPal's adjusted earnings per share increased to $1.07 a share from 71 cents a year earlier, whereas analysts surveyed by FactSet were modeling 87 cents. That includes a 7-cent negative impact from credit-loss reserves. Revenue for the quarter climbed to $5.26 billion from $4.31 billion. The FactSet consensus called for $4.99 billion. PayPal's total payment volume, or the value of transactions flowing through the PayPal platform, rose to $222 billion from $172 billion, while analysts were looking for $210 billion. The company also saw about $37 billion in Venmo payment volume. Overall, PayPal added 21.3 million net new active accounts in the period. The company disclosed that it had more than 60 million active Venmo accounts as of the second quarter, which the company defines as accounts that have completed a transaction within a 12-month span. For the third quarter, PayPal expects 30% growth in total payment volume, 25% growth in revenue on a currency-neutral basis, and 25% growth in adjusted earnings per share. The company also reinstated a 2020 forecast after pulling the prior one earlier in the year due to pandemic-related uncertainties. For the full year, the company expects high-20% growth in total payment volume, 22% growth in currency-neutral revenue, and about 25% growth in adjusted EPS. PayPal shares have gained 49% over the past three months as the S&P 500 SPX, +0.87% has risen 11%."}]}