{"article": [{"url": "https://www.marketwatch.com/story/new-york-feds-williams-says-treasury-market-seizure-in-march-underlines-importance-of-central-bank-backstop-11601386397", "published": 1601372480.0, "headline": "New York Fed's Williams says Treasury market seizure in March underlines importance of central bank backstop", "body": "Andrew Caballero-Reynolds/Agence France-Presse/Getty Images New York Federal Reserve President John Williams said the seizure in the $20 trillion U.S. Treasurys market in March underlined the importance of central banks as a backstop of liquidity. He was speaking at the virtual Treasury market conference on Tuesday where investors, Fed officials and other regulators are expected to discuss ways to insure against a similar seize-up in short-term repo lending, Treasurys and mortgage-backed debt markets. \"If these critical markets break down, credit stops flowing, and people can't finance the purchase of a car or a home, businesses can't invest, and the economy suffers, resulting in lost jobs and income,\" he said. The Fed said it needed to take stock of the changes also sweeping through the Treasury market including the rise of financial institutions outside of the banking sector, the emergence of proprietary trading companies, and new regulations affecting the market's middlemen. \"This is an opportunity to think hard about what changes will help fortify the financial system against future shocks,\" he said. At the same time, Williams cautioned no private institution could replace the Fed's ability to provide massive amounts of liquidity and prevent further financial distress. \"We should not fool ourselves that we can design a system that is bulletproof against every circumstance,\" said Williams. Back in March, forced selling by investors who needed to get rid of their most liquid assets to raise cash combined with an unwillingness by bank trading desks to act as middlemen led to the usually liquid Treasury market breaking down. Highly levered hedge funds that betted on a narrowing of prices between virtually identical Treasury securities were also forced to unwind their positions, adding to the intense bout of selling. The 10-year Treasury note yield BX:TMUBMUSD10Y briefly spiked to 1.27% in mid-March only days after hitting an all-time low of 0.38%, FactSet data show, as the sheer imbalance between demand and supply led to a disorderly surge in the benchmark maturity rate. See: These are the dysfunctions in the U.S. bond market that will lead the Fed to buy at least $500 billion of Treasurys Also, the functioning of the market by some indicators had deteriorated to levels worse than the 2008 financial crisis. In the end, the Fed's rapid interventions helped to stave off disaster, with the central bank pouring temporary cash into short-term lending markets, and accelerating its bond-buying program. The Fed's balance sheet has swelled to more than $7 trillion from its pre-pandemic levels of around $4.2 trillion. In markets on Tuesday, the S&P 500 SPX, +0.87% and Dow Jones Industrial Average DJIA, +0.56% were pointed to a slightly negative start, after the previous session's gains."}]}