{"article": [{"url": "https://www.marketwatch.com/story/hillary-clinton-admits-she-wanted-to-tell-donald-trump-to-shut-up-during-presidential-debate-2020-09-30", "published": 1601477540.0, "headline": "Hillary Clinton admits she wanted to tell Donald Trump to â\u0080\u0098shut upâ\u0080\u0099 during presidential debate", "body": "The combative first presidential debate of the 2020 election saw both candidates talking over each other and exasperating the moderator â\u0080\u0094 not to mention disgusting many of the viewers. Among those watching was former Secretary of State Hillary Clinton, the previous presidential candidate to face off with Donald Trump on a debate stage back in 2016 â\u0080\u0094 and she has some thoughts about last nightâ\u0080\u0099s debate debacle. Tuesday nightâ\u0080\u0099s chaotic debate saw President Trump and former Vice President Joe Biden insulting each other, interrupting each other and often straying from the agreed-upon topics. And while both men interrupted each other, by Slateâ\u0080\u0099s count, Trump interrupted Biden at least 128 times, compared with Biden interrupting â\u0080\u009cdozensâ\u0080\u009d of times. Biden got so exasperated early into the roughly 90-minute debate that he said, â\u0080\u009cWill you shut up, manâ\u0080\u009d â\u0080\u0094 which quickly became the line of the night. Read more:Trump, Biden blast each other on economy, coronavirus in fiery first debate The hashtag #shutupman was trending on Twitter TWTR, -0.23% Â well into Wednesday morning, and the Biden campaign was already selling $30 T-shirts sporting the phrase online by the end of the debate. While many viewers lamented that political discourse has boiled down to the candidates insulting each other rather than speaking about the issues most important to the American public during a health and economic crisis, some wished that Clinton had also told Trump to â\u0080\u009cshushâ\u0080\u009d or â\u0080\u009ckeep yapping manâ\u0080\u009d like Biden did back when she faced off with Trump in 2016 â\u0080\u0094 when by Slateâ\u0080\u0099s count, Trump interrupted her at least 51 times during the first debate. Read more:Presidential debate antics leave many viewers disgusted â\u0080\u009cI so feel for Hillary now,â\u0080\u009d wrote author and lawyer Jill Filipovic on Twitter, â\u0080\u009cbecause Iâ\u0080\u0099m positive she wanted to say [shut up] and couldnâ\u0080\u0099t.â\u0080\u009d To which Clinton responded, â\u0080\u009cYou have no idea.â\u0080\u009d Her response was â\u0080\u009clikedâ\u0080\u009d more than 61,00 times, retweeted more than 11,000 times and drew almost 900 comments by Wednesday morning iframe.twitter-tweet { width: 100% !important; } Clinton has expressed regret that she didnâ\u0080\u0099t push back harder on Trump four years ago when he interrupted her â\u0080\u0094 or when, in their infamous town hall debate, he stalked behind her on the stage. â\u0080\u009cHe was literally breathing down my neck. My skin crawled,â\u0080\u009d she wrote in her 2017 memoir â\u0080\u009cWhat Happened,â\u0080\u009d adding that she thought of turning around to tell Trump to back off, with a dismissive line such as, â\u0080\u009cI know you love to intimidate women, but you canâ\u0080\u0099t intimidate me.â\u0080\u009d But she ultimately decided against it. Related:First Trump-Biden debate: Fox Newsâ\u0080\u0099 Chris Wallace, the moderator, criticized after chaotic clash in Cleveland She tweeted later on Tuesday night that she was â\u0080\u009cso proudâ\u0080\u009d of Biden for his debate performance, and â\u0080\u009cmore confident than ever that heâ\u0080\u0099s the leader with the experience we need right now.â\u0080\u009d And when Pete Buttigiegâ\u0080\u0099s husband Chasten tweeted his concern about Clinton, writing, â\u0080\u009cGirl Iâ\u0080\u0099m so sorry,â\u0080\u009d she responded with, â\u0080\u009cThanks, Iâ\u0080\u0099m fine. But everyone better vote.â\u0080\u009d Related:Google searches for K-shaped recovery, white supremacy and â\u0080\u0098how to move to New Zealandâ\u0080\u0099 spiked during the debate The remaining two debates will have â\u0080\u009cadditional structure,â\u0080\u009d the Commission on Presidential Debates promised in a statement on Wednesday, â\u0080\u009cto ensure a more orderly discussion of the issues.â\u0080\u009d There are two more presidential debates scheduled in October, and the vice presidential candidates will square off next Wednesday."}]}