{"article": [{"url": "https://www.marketwatch.com/story/he-had-35000-in-retirement-savings-in-march-350-trades-later-and-hes-apparently-sitting-on-1-million-2020-07-08", "published": 1595076020.0, "headline": "He had $35,000 in retirement savings in March â\u0080\u0094 350 trades later and heâ\u0080\u0099s apparently sitting on $1 million", "body": "Prepare for some serious trading FOMO, courtesy of Redditâ\u0080\u0099s â\u0080\u009cWallStreetBetsâ\u0080\u009d community. If his detailed story is to be believed, the user, who identifies as â\u0080\u009cMori226â\u0080\u009d on the popular social-media platform, has had a spectacular run during the coronavirus pandemic, and he walked his fellow traders on Reddit through every step of his journey. â\u0080\u009cI cracked the 7-figure mark, and then some. I started with $35k in my ROTH IRA in late February/early March,â\u0080\u009d the trader wrote. He said he pulled out about $50,000 along the way. Check out:All about the Roth IRA Hereâ\u0080\u0099s what his nosebleed trading climb looks like charted: How did he pull it off? Mori226 offered up some of the tips that worked best: Hold at least 50% in cash reserves at all times, donâ\u0080\u0099t beat yourself up on bad trades, let the winners ride, never put more than 25% in any single position and learn to cut your losses, to name just a few. â\u0080\u009cTry to stay disciplined. Learning to control. my emotions was key,â\u0080\u009d he said. â\u0080\u009cLosses donâ\u0080\u0099t kill options traders, calculating your alternate universe net worth on your woulda-coulda-shouldas do.â\u0080\u009d Mori226 went so far as to lay out each trade made during that stretch. Here are the biggest winners, led by huge profits betting on alternative-fuel vehicle maker Nikola Corp. NKLA, -1.36%, as well as on Amazon AMZN, +3.01% AMZN, +3.01%, Disney DIS, +1.53% and Apple AAPL, +1.74% : The trader also took some lumps, particularly on bets against the S&P 500 SPX, +0.87% : And one last bit of wisdom to impart: â\u0080\u009cLearning to get a sense of the current trend is the hardest part... Who is your best friend? The trend. Who gives you your giant pile of tendies [profits]? The trend,â\u0080\u009d he wrote, â\u0080\u009cWho buys your wife a new iMac pro? The trend. Never try to â\u0080\u0098outsmartâ\u0080\u0099 the market. Youâ\u0080\u0099re going to lose you f*****g shirt.â\u0080\u009d What do his buddies on â\u0080\u009cWallStreetBetsâ\u0080\u009d make of it all? The top comment pretty much summed up the outpouring of love, appreciation and unveiled envy: â\u0080\u009cCongrats! Now f*** off.â\u0080\u009d"}]}