{"article": [{"url": "https://www.marketwatch.com/story/75-of-frontline-workers-in-new-york-the-epicenter-of-coronavirus-are-people-of-color-and-black-americans-are-twice-as-likely-to-die-from-covid-19-2020-06-01", "published": 1592561960.0, "headline": "The coronavirus pandemic and Juneteenth: Black Americans are twice as likely to be hospitalized from COVID-19", "body": "New York — It was easy to forget why they were wearing masks. The protests against police brutality in the wake of the death of George Floyd in police custody, turned into violence on Sunday night as some protestors broke into luxury downtown stores. These scenes were played out across the country. Peaceful protesters marched down Columbus Avenue on a recent Sunday afternoon holding placards and wearing #BlackLivesMatters T-shirts. It was, perhaps, the largest group of people gathered in one place since social distancing began. Even during the march, they wore face masks. The wait, of course, is not over. At least, not yet. New York City remains Ground Zero for coronavirus. Coronavirus deaths here have long surpassed the number of New York fatalities on 9/11. As a blanket of silence covers the streets during the day and people have started wearing masks in public, hospitals are grappling with the chaos created by an unseen virus and lack of personal protective equipment. As of Friday, there were 2,191,200 confirmed cases of COVID-19 in the U.S. and 118,435 deaths, including 30,974 deaths in New York, the most of any state in the country. Worldwide, there were 8,514,522 confirmed cases and 454,522 deaths, according to Johns Hopkins University. The Dow Jones Industrial Index DJIA, +0.56% and the S&P 500 SPX, +0.87% are up Friday, as the market mulled hopes of a potential therapeutic steroid treatment and vaccine research. A Black Lives Matter protester raises his fist during a march to honor George Floyd in Manhattan on May 31 in New York City. Getty Images Gallup data released Monday data add more support to previous research that less-educated workers in low-wage, blue-collar roles have been hardest hit by COVID-19, and suggests the pandemic is “exacerbating the income inequality that existed before its arrival.” Some 95% of workers in low-income households — making less than $36,000 per year — have either been laid off as a result of the coronavirus (37%) or have experienced a loss in income (58%). “These patterns were predicted in the early stages of the pandemic, and proposals for relief called for targeted and proportional funding,” Jonathan Rothwell, the principal economist at Gallup, said. “The U.S. Congress relied heavily on the unemployment insurance system to provide relief, but Gallup data finds that low-income, laid-off workers are less likely to be approved for unemployment insurance than high-income workers“ and “raises questions about the efficacy of relief programs.” A quarter of workers reporting annual household income is between $90,000 and $180,000 saw an income loss, and 12% were laid off, the Gallup report found. “Yet, despite the disproportionate hardship of the lowest-income workers, only 30% of laid-off workers in the lowest income group say they have been approved for unemployment insurance, which is below the national average of 38% and below approval rates of laid-off middle- and upper-income workers,” Rothwell added. Other findings: Layoffs have hit service workers the hardest (34%), including food servers and delivery providers, janitors and cleaners, personal-care providers, and security workers. What’s more, 43% of workers in the service sector report a loss of income, Gallup found. Artists, designers, and those in entertainment and media have also been hit hard by COVID-19 (25%) and the related shut-down of concerts, cinematic and theatrical productions, and sporting events. Like many parts of the country, people in New York, which remains the epicenter of the COVID-19 pandemic, wear homemade masks, while some nurses wear garbage bags. Among the cities where black residents have been hard-hit: New York, Detroit, New Orleans, Chicago and Milwaukee: 42% were black, according to a recent Associated Press analysis. African-Americans account for roughly 21% of the total population in the areas covered by the AP’s analysis. Source: Gallup Black and Latino people in New York City are more likely to die than Caucasians, data released last month by the City of New York showed. In New York City, black and Latino people are being hospitalized at twice the rate of Caucasians, data released last month by the City of New York showed. Black New Yorkers were hospitalized at a rate of 632 per 100,000 people, followed by Latinos (570 per 100,000), while Caucasians were hospitalized at a rate of 284 per 100,000 people. Hispanic residents were dying at a rate of 21.3 per 100,000, black and African-American people were dying at a rate of 23.1 per 100,000, other non-Hispanic/Latino, non-white races were dying at a rate of 40.2 per 100,000, it added. Meanwhile, white people were dying at a rate of 15.7 per 100,000 and Asians at a rate of 9.1 per 100,000. “This virus is not hitting New Yorkers equitably,” Health Commissioner Oxiris Barbot said. “We’re seeing this around the country,” New York Gov. Andrew Cuomo, a Democrat, said when the figures on racial disparity began trickling out. He said the same pattern was found in major cities across the U.S., some worse than New York City. “You know, it always seems that the poorest people pay the highest price. Why is that? Whatever the situation is.” Cuomo said he would investigate why people of color were so badly affected by the virus, and said an increase in testing would help. Speaking of his gratitude about essential workers before the unrest in cities across the nation, Cuomo said, “ What if the essential workers don’t show up? You have to have food, you have to have transportation, the lights have to be on, someone has to pick up the garbage, the hospitals have to run. What if you communicated so effectively, the essential workers say, ‘If everyone is staying home, I’m staying home too.’” He described this as a “nightmare” he had early in the pandemic. “What if they said, ‘You don’t pay me enough to put my life in danger? I’m not doing it.’ They showed up. They didn’t show up for a pay check. They didn’t show up because government asked them to show up,” he said. “They showed up out of their honor, out of their values, out of their dignity. That’s why they showed up.” He added, “They have honor in their souls and strength in their character.” Kay, a nurse at The Brooklyn Hospital, wearing a garbage bag in lieu of personal protective equipment. CBS News Kay, a nurse at The Brooklyn Hospital who did not want to give her last name for fear of reprisals from relatives of patients who are not allowed to visit their loved ones, told CBS reporter David Begnaud, who was covered in a hazmat decontamination suit and large face shield. “It’s like something out of the Twilight Zone.” She added, “I’d like a mask like yours. We should all have masks like yours, and that white suit you have on? What do I have on? What is this?” It was a garbage bag. The Associated Press analysis examined the racial disparities of COVID-19 cases and deaths nationwide. It looked at more than 4,450 deaths and 52,000 COVID-19 cases from across the country, and relied on the handful of state and local governments that have released victims’ race. “Everywhere we look, the coronavirus is devastating our communities,” Derrick Johnson, president and CEO of the NAACP, said in a statement. “The uprising spreading across this country is fueled by systemic racial issues,” Johnson said in response to the death of George Floyd. The policeman who was filmed kneeling on George Floyd’s neck has since been charged with murder and manslaughter. “These issues have now manifested into anger, sadness, fear, and confusion. Many throughout the country are left to consider at this moment after watching the horrific footage of George Floyd: When is enough, enough?” Graph: Office of New York City Comptroller Scott Stringer New York Gov. Andrew Cuomo said the city is still on track to embark upon Phase 1 on the reopening on June 8. The total number of confirmed cases of coronavirus in New York City is likely far more than that when accounting for asymptomatic or mild cases, according to The New York Times. South Bronx, North and Southeast Queens, and Staten Island had the highest cases and also have the lowest median incomes and largest households sizes, it added. Some 75% of all frontline workers are people of color, including 82% of cleaning services employees, according to a report by the New York City Comptroller Scott Stringer. More than 40% of transit employees are black, while over 60% of cleaning workers are Hispanic. At least 123 transit workers in the city have died from the virus. The Metropolitan Transportation Authority, which runs the city’s subway and buses, pledged to give death benefits to the families of COVID-19 victims. “Living in the outer reaches of the city and traveling to work sites scattered throughout the five boroughs, day-to-day commuting is an arduous task for many frontline workers. The average frontline worker, in fact, will spend 45 minutes traveling to work each day and another 45 minutes traveling back home to their families and loved ones,” the Comptroller added. Brooklyn is home to the largest share of frontline workers (28%), followed by Queens (22%) and the Bronx follow (17%). Graph: Office of New York City Comptroller Scott Stringer What’s more, African-American COVID-19 patients have 2.7 times the odds of being admitted to the hospital compared to non-Hispanic white patients after controlling for sex, age, income and co-morbid health conditions, according to a separate study in the latest edition of the peer-reviewed journal Health Affairs conducted by researchers affiliated with Sutter Health, a nonprofit health system in northern California. The researchers, who analyzed 1,052 confirmed coronavirus cases between Jan. 1 and April 8, said there could be a number of potential explanations for this gap, including that African-American patients might have “more advanced or severe illness at the time of presenting for COVID-19 testing and medical care” and cited “barriers to timely access to care” that could create circumstances in which patients view delaying care as the only available and/or most sensible option. Analysts say the demonstrations and, in some cases, violence against property, compounds a difficult period of political turmoil for the U.S., given that it comes in the middle of a public-health emergency. Markets are pricing a V-shaped recovery where everyone goes back to work, Manolo Falco, Citigroup’s C, +0.47% co-head of investment banking, told the Financial Times Monday. “I don’t think it’s going to be that easy, quite frankly.” As the second quarter approaches, he added, “We think this is going to be much tougher than it looks.” The Dow Jones Industrial Index DJIA, +0.56% and the S&P 500 SPX, +0.87% were higher Friday, as investors weighed the impact of the political unrest over the death of George Floyd in police custody in Minneapolis, as well as possible progress in COVID-19 vaccine research, and fears of further deterioration of trade and political relations with China. The markets are digesting the escalating social unrest, and COVID-19, and the effects that may have on corporate earnings. Graph: Office of New York City Comptroller Scott Stringer"}]}