{"article": [{"url": "https://www.marketwatch.com/story/millions-of-covid-hit-nursing-home-residents-risk-losing-their-vote-2020-08-20", "published": 1598015180.0, "headline": "Millions of COVID-hit nursing home residents risk losing their vote", "body": "For months, the pandemic has curtailed nursing home residents’ freedom of movement and visits with family and friends. Now, it is threatening their ability to vote. The 2.2 million residents of U.S. nursing homes and residential care facilities have been among the most vulnerable during the pandemic. But facility lockdowns, combined with COVID-driven revisions of voting procedures, mean that some residents may not get to the ballot box, researchers and election officials say. It is “a really open question to what extent people in long-term care institutions are going to be able to participate in our election in November,” says Nina Kohn, a law professor at Syracuse University who has studied facility residents’ voting-rights issues. Living in a long-term care facility, however, “in no way restricts your right to vote,” she says. Under federal law, facilities participating in Medicare or Medicaid must honor residents’ rights as citizens. Safeguarding residents’ voting rights “is of utmost importance,” industry group American Health Care Association/National Center for Assisted Living said in a statement. Providers “will do everything possible to ensure residents can get the information and materials they need to participate in the election, while also staying safe from COVID.” Read:The Crisis Raging Inside America’s Nursing Homes In several states, election officials are scrambling to reinvent nursing-home voting procedures in light of the pandemic. Many jurisdictions are following the Centers for Disease Control and Prevention recommendation that polling places be moved away from long-term care facilities. Others plan to maintain some polling sites at these facilities and hope that social distancing and protective gear keep residents safe. Many nursing home residents may vote by mail, though those who need help with their ballots may have to rely on staff members who are already overwhelmed — and they face the same concerns over mail delays that confront a much broader swath of voters. In Iowa, a bipartisan team of election officials would traditionally deliver ballots to nursing home residents, wait while voters mark their ballots, and bring them back to the local election office. “Due to COVID, that option is likely not feasible,” says Kevin Hall, spokesman for the Iowa Secretary of State. “We are working on a solution.” Some jurisdictions have shifted to a hands-off approach. After receiving a list of voters from local facilities, Lake County, Fla., election officials would typically send bipartisan teams to deliver ballots to nursing homes and help with the voting process, such as by answering residents’ questions about “how to color in the ovals” and seal and sign their ballot envelopes, says Alan Hays, the county’s elections supervisor. This year, ballots will be placed in bags equipped with ultraviolet lights meant to disinfect them, dropped off at the facilities, and collected later in the day, Hays says. “We’re trying to do everything we can reasonably do to make sure every eligible voter has an opportunity to vote,” he says. Opinion: Start planning now for how you will vote in November Some states expect nursing home workers to fill in the gaps if election officials are locked out of facilities. Voting plans in Tennessee and Ohio, for example, say that if elections staff are denied entry to facilities, they must find nursing-home workers willing to be deputized to oversee voting, review their party affiliations, train them on election procedures, and have them swear an oath before they can help residents with their ballots. That is a tall order in a public health emergency, some nursing-home industry and consumer advocacy groups say. “Election commissions and nursing homes are both struggling to figure out how to handle this during the pandemic,” says Randy Horick, vice chair of Tennessee Citizen Action. In Ohio, many nursing homes will likely allow election officials to enter, “because with all the other demands, such as administering state-mandated or recommended testing, they can’t spare the staff time” to oversee voting, says Peter Van Runkle, executive director of the Ohio Health Care Association. A handful of other states, including North Carolina, prohibit nursing home workers from helping residents vote. August guidance from the North Carolina Department of Health and Human Services made it clear that the rules wouldn’t bend for the pandemic, saying “it is a felony for owners or employees of these facilities to assist in the absentee voting process.” County boards of elections can deploy assistance teams to help residents request and cast ballots, preferably in an outdoor setting, the guidance said. Even jurisdictions without such strict rules are encountering challenges. Oregon voters can seek assistance from anyone other than their employer or union representative, and all registered voters receive mail-in ballots before an election. In Multnomah County, elections officials can set up pop-up tents outside facilities and are looking to work with nursing homes to help residents vote, says Tim Scott, the county’s elections director. While facilities have said they’d do their best to help, he says, “they clearly let us know, ‘we’ve got our hands full right now.’” Helene Silver, 85, a long-term care facility resident in Needham, Mass., normally casts a ballot in every election. But earlier this year, when she was living at a different Massachusetts facility, she never received the absentee ballot she needed to vote in the March primary. The activities director who typically helped residents with voting issues had recently left, and with the facility fighting the pandemic, “I had nobody to help me,” she says. “I didn’t get to vote in the primary, and I was very disappointed, because I always vote.” Read:Postal Service head suspends changes until after November election Pre-COVID, many long-term care facility residents had a relatively easy way to vote in person: Their polling place was located in their facility. As the pandemic spread during this spring’s primary season, polling places were yanked out of many senior care facilities, in some cases just days before the election. Ohio relocated 158 long-term care facility polling places about a week before its March primary, says Maggie Sheehan, spokesperson for the Ohio secretary of state. Facility residents were given instructions on how to cast an absentee ballot, she says. For the November election, local jurisdictions are working to find accessible alternatives for polling locations previously sited in senior facilities, but in many areas polling places are already in short supply, “so this can be an extremely challenging prospect,” says Tim Mattice, executive director of the Election Center, a national association of election officials. In Chicago, where owners of 180 private buildings made last-minute refusals to serve as polling places before the March primary, election officials are locating as many polling places as possible in public buildings such as schools and libraries to avoid an 11th-hour rush before the November election, says Lance Gough, executive director of the Chicago Election Board. “We’re probably going to see reductions in the number of polling places in November, so the siting of any location becomes even more critical,” says Hannah Klain, a fellow at the Brennan Center for Justice. Despite the CDC polling-site recommendations, Broward County, Fla., isn’t relocating senior-care facility polling places unless the facility administrators request it, says Steven Vancore, spokesperson for the county elections supervisor. With mandatory social distancing and disposable pens, “we’re enacting everything but dumping workers into vats of bleach to make sure it’s clean,” he says. If someone comes to vote and refuses to wear a mask, however, “we can’t turn them away,” he says. “We can’t deny them the right to vote.” Read more:Coronavirus Leaves Children in Institutionalized Care at Risk"}]}