{"article": [{"url": "https://www.marketwatch.com/story/trump-postmaster-dejoy-to-testify-before-house-as-democratic-lawmakers-craft-rescue-package-for-postal-service-2020-08-17", "published": 1597742480.0, "headline": "Trump postmaster DeJoy to testify before House as Democratic lawmakers craft rescue package for Postal Service", "body": "WASHINGTON (AP) — Facing a public backlash over mail delays, the Trump administration scrambled to respond Monday as the House prepared an emergency vote to halt delivery interruptions and service changes that Democrats warned could imperil the November election. The Postal Service said it has stopped removing mailboxes and mail-sorting machines amid an outcry from lawmakers, after sparking a public near-panic. President Donald Trump flatly denied he was asking for the mail to be delayed even as he leveled fresh criticism on universal ballots and mail-in voting. “Wouldn’t do that,” Trump told reporters Monday at the White House. “I have encouraged everybody: Speed up the mail, not slow the mail.” Later, he tweeted in characteristically capitalized letters, “SAVE THE POST OFFICE!” Embattled Postmaster General Louis DeJoy will testify next Monday before Congress, along with the chairman of the Postal Service board of governors. Democrats and some Republicans say actions by the new postmaster general, a Trump ally and a major Republican donor, have endangered millions of Americans who rely on the post office to obtain prescription drugs and other needs, including an expected surge in mail-in voting this fall. Speaker Nancy Pelosi is calling the House back into session over the crisis at the Postal Service, setting up a political showdown amid growing concerns that the Trump White House is trying to undermine the agency ahead of the election. See:Pelosi to call House back to session this week to vote on Postal Service bill Plus:Trump explicitly links mail-in voting and his opposition to post-office financial relief Pelosi cut short lawmakers’ summer recess with a vote expected Saturday on legislation that would prohibit changes at the agency. The package will also include $25 billion to shore up the Postal Service, which faces continued financial losses amid declines in first-class and business mail, even as costs have increased significantly because of the coronavirus pandemic. The agency has had to pay for personal protective equipment and increased sick leave for workers who became ill or chose to stay home in fear of the virus. DeJoy, a former supply-chain CEO who took over the Postal Service in June, has sparked nationwide outcry over delays, new prices and cutbacks just as millions of Americans will be trying to vote by mail to avoid polling places during the coronavirus outbreak. Trump on Monday defended DeJoy, but also criticized postal operations and claimed that universal mail-in ballots would be “a disaster.” “I want to make the post office great again,” Trump said on “Fox & Friends.” Later at the White House, he denied asking for a mail-delivery slow down. Trump told reporters he wants “to have a post office that runs without losing billions and billions of dollars a year.’’ The decision to recall the House carries a political punch. Voting in the House will highlight the issue after the week’s Democratic National Convention nominating Joe Biden as the party’s presidential pick and pressure the Republican-held Senate to respond. Senate Majority Leader Mitch McConnell sent senators home for a summer recess. “In a time of a pandemic, the Postal Service is Election Central,” Pelosi wrote Sunday in a letter to colleagues, who had been expected to be out of session until September. “Lives, livelihoods and the life of our American Democracy are under threat from the president.” At an event in his home state of Kentucky on Monday, McConnell distanced himself from Trump’s complaints about mail operations. But the Republican leader also declined to recall senators to Washington, vowing the Postal Service “is going to be just fine.” “We’re going to make sure that the ability to function going into the election is not adversely affected,” McConnell said in Horse Cave, Ky. “And I don’t share the president’s concerns.” On Monday, two Democratic lawmakers called on the FBI to investigate whether DeJoy or members of the independent Postal Board of Governors may have committed a crime in slowing the mail. Reps. Ted Lieu of California and Hakeem Jeffries of New York cited reports that mail-sorting machines were being dismantled and policy changes have delayed mail delivery. “It is not unreasonable to conclude that Postmaster General DeJoy and the Board of Governors may be executing Donald Trump’s desire to affect mail-in balloting,” they wrote in the letter to FBI Director Christopher Wray. Senate Democratic leader Chuck Schumer and other Democrats, meanwhile, urged the Postal Board of Governors to immediately use their authority under a 1970 law to reverse operational changes put in place last month by DeJoy. If he declines to cooperate, “you have the authority, under the Postal Reorganization Act, to remove the postmaster general,’’ the senators said in a letter to the board. Congress is at a standoff over postal operations. House Democrats approved $25 billion in a COVID-19 relief package but Trump and Senate Republicans have balked at additional funds for election security. McConnell held a conference call Monday with Treasury Secretary Steven Mnuchin and GOP senators on the broader virus aid package. The Postal Service said Sunday it would stop removing its distinctive blue mailboxes through mid-November following complaints from customers and members of Congress that the collection boxes were being taken away. And White House chief of staff Mark Meadows pledged that that “no sorting machines are going offline between now and the election.’’ “That’s something that my Democrat friends are trying to do to stoke fear out there. That’s not happening,” Meadows told CNN. Asked about reports that hundreds of sorting machines were recently removed — causing mail delays across the country — Meadows said they were part of an “already scheduled reallocation.” The legislation being prepared for Saturday’s vote, the “Delivering for America Act,” would prohibit the Postal Service from implementing any changes to operations or level of service it had in place on Jan. 1, five months before DeJoy took office. Pelosi on Monday extended the pandemic emergency through Oct. 2, ensuring lawmakers who don’t want to travel to Washington can continue voting by proxy. DeJoy, the first postmaster general in nearly two decades who was not a career postal employee, has pledged to modernize the money-losing agency to make it more efficient. He eliminated most overtime for postal workers, imposed restrictions on transportation and reduced of the quantity and use of mail-processing equipment. Trump said last week that he was blocking emergency aid to the Postal Service, as well as a Democratic proposal to provide $3.6 billion in additional election money to the states to help process an expected surge of mail-in ballots. Both funding requests have been tied up in congressional negotiations over a new coronavirus relief package. Meanwhile, the Postal Service is seeking a short-term rate increase that would raise prices on commercial domestic competitive parcels, including Priority Mail Express, Priority Mail, first-class package service, Parcel Select and Parcel Return Service. The agency cited increased expenses, heightened demand for online packages due to the coronavirus pandemic and an expected increase in holiday mail volume. Key Words (April 2020):Trump officials may or may not have dropped ‘v-bomb’ but made clear opposition to post-office rescue funds MarketWatch contributed."}]}