{"article": [{"url": "https://www.marketwatch.com/story/chinese-stocks-continue-to-surge-as-asian-markets-await-word-on-australian-interest-rates-2020-07-06", "published": 1594095200.0, "headline": "Asia markets slip as virus outbreaks mute hopes for rebound", "body": "TOKYO (AP) — Markets were mostly lower in Asia on Tuesday as expanding coronavirus outbreaks dimmed hopes for a global recovery, despite an overnight rally in tech shares that pushed the Nasdaq composite to another record high. Japan’s benchmark Nikkei 225 NIK, -0.11% dropped 0.4% to finish at 22,614.69 and South Korea’s Kospi lost early gains to decline nearly 1.0% to 2,166.73. Australia’s S&P/ASX 200 was little changed, edging less than 0.1% lower to 6,012.90. Hong Kong’s Hang Seng HSI, -0.30% shed 0.7% to 26,161.15, while the Shanghai Composite SHCOMP, +1.67% gained 1.2% to 3,373.22. Government stimulus and hopes for an economic turnaround have kept investor sentiment upbeat, Prakash Sakpal and Nicholas Mapa, senior economists at ING, said in a report. But pandemic uncertainties are looming, and the situation is fragile. “Investors continue to look past the sustained pickup in new infections in the southern part of the U.S. as well as other parts of the world like Israel, but a sustained influx of downbeat reports could change sentiment,” their report said. The fallout from the pandemic has sent financial earnings plunging at many Asian companies, including giant Japanese exporters like Toyota Motor Corp. Their recovery is not expected until overseas consumption picks up. Daily confirmed infection cases have not fallen in Tokyo, exceeding 100 in recent days. The Japanese government is still pushing for events and businesses to open gradually with social distancing restrictions in place to keep growth going. Profit-taking set in quickly on Tuesday, erasing much of an initial rise for regional benchmarks that tracked Wall Street’s rally. Overnight, the S&P 500 rose 1.6%, following up on similar gains in Europe and Asia, clawing back to within 6.1% of its record set in February. Stocks of the biggest companies once again led the way, and strength for Apple, Amazon and other tech-oriented titans helped lift the Nasdaq composite 2.2%, to a record high of 10,433.65. The Dow Jones Industrial Average rose 1.8% to 26,287.03. The S&P 500 rose 49.71 points to 3,179.72 for its third gain of at least 1.5% in the last five days. The Russell 2000 index of smaller stocks was up a more modest 0.8%. They’re the latest buoyant moves for markets where investors are focusing more on recent improvements in the economy and all the stimulus that central banks and governments are supplying than on how much pain still remains. Investors are also continuing to sidestep the mounting number of known coronavirus infections, at least for now. The worry is that if the pandemic keeps worsening, with hotspots stretching across the U.S. South and West, it could scare shoppers and businesses away from spending. The worst-case scenario for markets is that governments resume lockdowns implemented during the spring and choke off the budding economic recovery. Either way, many economists expect it will take years for the global economy to return to the level of output it was at before the pandemic. Benchmark U.S. crude oil lost 57 cents to $40.06 a barrel. It fell 2 cents to $40.63 a barrel Monday. Brent crude oil for September delivery fell 58 cents to $42.52 a barrel. The dollar USDJPY, -0.38% rose to 107.55 Japanese yen from 107.37 yen. The euro inched down to $1.1304 from $1.1309."}]}