{"article": [{"url": "https://www.marketwatch.com/story/i-didnt-lie-trump-spars-with-reporters-over-playing-down-the-coronavirus-2020-09-10", "published": 1599757280.0, "headline": "â\u0080\u0098I didnâ\u0080\u0099t lieâ\u0080\u0099 â\u0080\u0094 Trump spars with reporters over playing down the coronavirus", "body": "President Donald Trump defended himself during a Thursday news conference, as he drew more questions over telling famed journalist Bob Woodward months ago that he was playing down the coronavirus. â\u0080\u009cI didnâ\u0080\u0099t lie. What I said is â\u0080\u0098We have to be calm. We canâ\u0080\u0099t be panicked,â\u0080\u0099â\u0080\u009d Trump said, after a reporter asked him: â\u0080\u009cWhy did you lie?â\u0080\u009d Trump said the questionâ\u0080\u0099s phrasing was â\u0080\u009ca disgrace.â\u0080\u009d The president then was asked why he told Woodward that COVID-19 was worse than the most strenuous flu, but then told the public that it was just like the flu. Trump said: â\u0080\u009cWhat I went out and said was very simple. I want to show a level of confidence and I want to show strength as a leader, and I want to show that our country is going to be fine one way or another.â\u0080\u009d Trump then repeated a view that he tweeted about earlier in the day, saying that Woodward could have reported on his comments sooner. And at the start of the news conference at the White House, Trump sounded upbeat about the coronavirus crisis. â\u0080\u009cI really do believe weâ\u0080\u0099re rounding the corner, and the vaccines are right there. But not even discussing vaccines, and not discussing therapeutics, weâ\u0080\u0099re rounding the corner,â\u0080\u009d he said. Related:Coronavirus update â\u0080\u0094 U.S. death toll above 190,000 and experts slam Trump for playing down virus Trumpâ\u0080\u0099s remarks come 54 days before the Nov. 3 election, and as Democratic challenger Joe Biden has an edge of 3.9 percentage points over the Republican incumbent in a RealClearPolitics moving average of polls focused on top swing states that are likely to decide the White House race. Betting markets are giving the former vice president a 53% chance of winning vs. Trumpâ\u0080\u0099s 46.3%. Biden has denounced Trump over the Woodward developments, saying Wednesday that â\u0080\u009ca life-and-death betrayal of the American peopleâ\u0080\u009d had occurred. During his news conference on Thursday, Trump also said Secretary of State Mike Pompeo was departing Thursday evening for Qatar for â\u0080\u009cthe beginning of intra-Afghan peace negotiations,â\u0080\u009d and he elaborated on the administrationâ\u0080\u0099s plans for troop withdrawals in Afghanistan, as well as drawdowns in Iraq. â\u0080\u009cWeâ\u0080\u0099ll be down to 4,000 soldiers in a very short period of time. Likewise, Iraq will be down to about 2,000 soldiers in a very short period of time,â\u0080\u009d he said. On Thursday evening, Trump is slated to deliver a campaign speech in Michigan, with his visit to that swing state following Biden's trip there on Wednesday. U.S. stocks SPX, +0.87% Â DJIA, +0.56% Â closed lower, a day after the marketâ\u0080\u0099s rebound from a three-day tumble."}]}