{"article": [{"url": "https://www.marketwatch.com/story/gold-rises-as-precious-metal-retakes-perch-atop-2000-2020-08-18", "published": 1597762460.0, "headline": "Gold ends higher for a second session and retakes perch atop $2,000", "body": "Gold prices finished higher to extend a rally on Tuesday, with the precious metal regaining traction above the psychologically significant level at $2,000 amid persistent weakness in the U.S. dollar and slack in government bond yields. One gauge of the buck, the ICE U.S. Dollar Index DXY, -0.58%, was down 0.6% at 92.30, hanging around the lowest level for the gauge against a half-dozen currencies since around 2018, according to FactSet data. Market Extra:Why the dollar’s fall could turn into a rout if ‘political disarray’ continues A weaker dollar can boost the appeal of gold because it is priced in the currency while receding yields can lower the opportunity cost of favoring bullion, which doesn’t offer a yield, over Treasurys. “A spike in global bond yields tormented the yen and gold last week but all that is turning around, as yields are back on the decline,” wrote investment analyst Marios Hadjikyriacos at brokerage XM, in a note. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% was around 0.66%, off 1.5 basis points from its level on Monday. The benchmark bond yield is hanging around its lowest yield since Aug. 11, Dow Jones Market Data said. “Despite last week’s correction, the factors that brought bullion to the dance are still present. Central banks and deficits remain in play, there’s a U.S. election coming up, and tensions with China are getting worse if anything,” Hadjikyriacos wrote. Moves in bullion come as the global death toll for the coronavirus pandemic approached 775,000, according to data compiled by Johns Hopkins University. And signs of Sino-American tensions were evident as the U.S. Commerce Department issued new rules curbing Huawei Technologies’s access to foreign-made chips Monday. December gold GCZ20, +2.17% GC00, +2.17% rose $14.40, or 0.7%, to settle at $2,012.10 an ounce, after the metal climbed 2.5% on Monday to mark its best daily point and percentage gain since April 22. Meanwhile, September silver prices US:SIU20 advanced 40.8 cents, or 1.5%, to end at $28.075 an ounce, following a 6% rally in the prior session. In other metals trade, September copper US:HGU20 added 7.35 cents, or 2.5%, to settle at $2.9750 a pound. October platinum PLV20, +3.99% closed up $7.50, or 0.8%, to end at $975.40 an ounce, while September palladium US:PAU20 lost $5.50, or 0.2%, to settle at $2,228.30 an ounce."}]}