{"article": [{"url": "https://www.marketwatch.com/story/heres-what-interest-rates-are-saying-about-stock--and-bond-returns-for-the-next-5-years-and-the-bulls-wont-believe-it-2020-06-22", "published": 1592844500.0, "headline": "Bulls just wonâ\u0080\u0099t believe what interest rates are saying about U.S. stock and bond returns for the next 5 years", "body": "Bullish investors are paying little attention nowadays to a big stock-market negative â\u0080\u0094 as in negative real interest rates. Because of this situation, the odds are disturbingly high that U.S. stocks over the next five years will barely beat inflation. Just donâ\u0080\u0099t tell that to investors who are excited about the stock marketâ\u0080\u0099s impressive recovery from its waterfall decline in February and March. But ignoring those odds doesnâ\u0080\u0099t make them go away, as I was reminded recently listening to a seminar conducted by Elroy Dimson, a professor at Cambridge Universityâ\u0080\u0099s Judge Business School and chairman of its Centre for Endowment Management. Dimson is the co-author (with Paul Marsh and Mike Staunton of the London Business School) of what most researchers accept as the most comprehensive global database of stock and bond returns. It encompasses 23 different countries and dates back to 1900. Notably, this database also includes data on each countryâ\u0080\u0099s inflation, which enables a calculation for what interest rates have been on an after-inflation, or real, basis. Thatâ\u0080\u0099s crucial, since real rates around the world right now are largely negative â\u0080\u0094 in some cases at or near the lowest since 1900. Take the current yield on the Treasuryâ\u0080\u0099s 10-year TIPS: minus 0.57%. This yield represents the real interest rate, since it is how much investors are willing to earn above (or below) the inflation rate. This low real yield is not a record low in U.S. history, but close. Read: The â\u0080\u0098Single Greatest Predictor of Future Stock Market Returnsâ\u0080\u0099 has a message for us from 2030 More: The government says thereâ\u0080\u0099s no inflation â\u0080\u0094 except for the things people are actually buying In the seminar, Dimson emphasized the strong correlation between real rates and returns over the subsequent five years for both stocks and bonds. To show that correlation, he looked at all countries and all years in his database â\u0080\u0094 a total of 2,382 observations. He then segregated those observations into 8 groups: Groups 1 and 8 contained the 5% of country-years with the lowest and highest real rates, respectively. Groups 2 through 7 contained successive 15% of the observations. As you can see from the chart below, bondsâ\u0080\u0099 and stocksâ\u0080\u0099 average real returns over the subsequent five years were consistently higher in countries where real interest rates at the beginning of the five-year period were themselves higher. The chart is based on averages, so of course there are exceptions. One was the five-year period in the U.S. beginning in 2013, when real interest rates were also negative. The subsequent five years were extremely good to both stock and bond investors, needless to say. But itâ\u0080\u0099s risky to construct your investment outlook on exceptions to the rule, rather than the rule itself. And the historical correlation between real interest rates and stocksâ\u0080\u0099 and bondsâ\u0080\u0099 subsequent returns, while not perfect, is nevertheless quite compelling. Thereâ\u0080\u0099s also strong theoretical support for why this correlation would exist, according to Nicholas Bloom, an economics professor at Stanford University and co-director of the Productivity, Innovation and Entrepreneurship Program at the National Bureau of Economic Research. In an email, he explained that â\u0080\u009cinterest rates are an excellent predictor of long-run growth potential, and their moribund level [today] reflects the marketsâ\u0080\u0099 expectation of sustained low future growth.â\u0080\u009d â\u0080\u009cUntil real interest rates pick up again,â\u0080\u009d Bloom noted in another email, â\u0080\u009cit is hard to be optimistic on growth â\u0080\u0094 when there are great opportunities for growth in the economy firms are investing, hiring and building and rates are high. Everyone wants to borrow money. When rates are close to zero it is a terrible take on the pulse of the real economy growth is on life-support and its interest rate pulse is very weak.â\u0080\u009d So keep all this in mind as you otherwise celebrate the Nasdaq Compositeâ\u0080\u0099s COMP, +1.39% Â recent new all-time high and the S&P 500 SPX, +0.87% Â and the Dow Jones Industrial DJIA, +0.56% Â rising to within shouting distance of theirs. Notwithstanding the impressive rally over the past 12 weeks, the prospects for both U.S. equities and bonds over the next five years appear mediocre at best. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com More: Stock-market legend who called 3 financial bubbles says this one is the â\u0080\u0098Real McCoy,â\u0080\u0099 this is â\u0080\u0098crazy stuffâ\u0080\u0099 Plus: â\u0080\u0098La la land?â\u0080\u0099 The stock market is â\u0080\u0098insanely disconnectedâ\u0080\u0099 and due for a â\u0080\u0098reckoning,â\u0080\u0099 Warren Buffett buff warns"}]}