{"article": [{"url": "https://www.marketwatch.com/story/trump-re-election-momentum-could-shock-stock-market-investors-betting-on-biden-win-says-star-analyst-11598901254", "published": 1598941880.0, "headline": "Trump re-election momentum could shock stock-market investors betting on Biden win, quantitative analyst says", "body": "The odds are starting to shape up for a potential second term for Presidential Donald Trump in the race for the White House against Democrat Joe Biden, according to Marko Kolanovic, quantitative strategist at J.P. Morgan Chase & Co., in a Monday research note. “We currently believe that momentum in favor of Trump will continue, while most investors are still positioned for a Biden win,” the strategist, along with analyst Brad Kaplan, wrote. Regardless of your politics, a Trump victory, said, would possibly have big implications for investors who have been positioning for a less universally business-friendly approach from the former vice president, who is viewed as a candidate who would raise taxes on corporations and increase regulations on Wall Street. Biden has been enjoying a wide polling lead all summer over Trump, who has drawn criticism for his handling of the COVID-19 pandemic and the deterioration in the market and economy that began in March, as well as his response to demonstrations and unrest over policing practices. However, improvements in both areas have started to provide a glimmer of hope for Trump to score another four years in the Oval Office, and Kolanovic says investors shouldn’t ignore the possibility of such an outcome. Investors should ‘adjust for a potential Trump re-election.’ The Dow Jones Industrial Average DJIA, +0.56%, the S&P 500 index SPX, +0.87% and the Nasdaq Composite COMP, +1.39% are aiming for their best August returns in years, as optimism for a coronavirus cure and/or remedies have stoked appetite for risk on Wall Street. On top of that, cases of the COVID-19 illness derived from the novel strain of coronavirus has appeared to moderate somewhat, while scores of vaccines are in some stage of development globally, according to the World Health Organization. “COVID-19 cases rate has been declining by about ~20,000 cases/day a month,” wrote the JPMorgan researchers. “Given that there are no very large states that have yet to see widespread outbreaks that can significantly boost new cases, this will likely set the pandemic on course to subside in time for the election,” the analysts wrote. Against that backdrop, Trump, who has hitched his wagon to the economy and the market, as key drivers of a potential second term, has seen the race tighten somewhat in recent weeks. Over the weekend, The Hill reported that Biden’s support stood at 50% among likely voters, compared with 44% for Trump, with another 7% undecided, compared with a 10 percentage-point spread, 52% to 42%, in favor of Biden for the week ended Aug. 23, citing a survey from Morning Consult, a private data provider. See: Biden says Trump has ‘fomented’ violence Real Clear Politics has Biden holding on to a 6.9 percentage-point margin in an average of national polls. Biden is at 49.7%, while Trump stands at 42.8%. Betting markets also give Biden just a 51% chance of winning, down from 61%, according to a separate RCP average. JPMorgan Chase & Co. Kolanovic and his team remind us that it is worth heeding their warning of a potential Trump victory because, months ago, he accurately predicted that the stock market would soon reach all-time highs, even with investors at the time still reeling from the gut-wrenching moves lower for the main benchmarks in March. See: Leon Cooperman torn on voting for Trump: ‘Bottom line is we have a man with limited character who has good economic ideas, but he’s very divisive’ “This was not just considered contrarian, but also ridiculed at the time. Standing solidly above ATH at the end of August, the question is what is next for markets and the economy?” the strategist writes. “Certainly a lot can happen in the next [roughly] 60 days to change the odds,” Kolanovic and company wrote. “Implications could [be] significant for the performance of factors, sectors, COVID-19 winners/losers,” as well as investing themes focused on environmental, social and governance issues, known collectively as ESG. The analysts say that an important factor to consider is the fallibility of polls, especially considering Trump’s stunning victory over Hillary Clinton in the 2016 presidential contest. But the researchers make the case that some voters may not be inclined to reveal exactly whom they are going to place their ballots for until they are in the voting booth, virtually or otherwise. “Research suggests that the reasons for this include voters being afraid of reprisal (e.g. job termination) if their voting intentions are revealed, and others trying to ‘throw off’ polls.” It should not come as a surprise that this effect appears to be stronger for Republican voters, said Kolanovic, citing voting research report led by Leib Leitman, which found that around 10% of Trump voters are likely not to be honest with pollsters."}]}