{"article": [{"url": "https://www.marketwatch.com/story/airline-stocks-fall-as-travel-demand-declines-for-first-time-in-13-weeks-2020-07-20", "published": 1595261780.0, "headline": "Airline stocks drop as travel demand declines for first time in 13 weeks", "body": "Shares of airline companies suffered broad losses Monday, after data from the U.S. Transportation Security Administration showed that travel demand declined last week to snap a 12-week streak of increases since the COVID-19 bottom in mid-April. The drop in demand comes as the number of new COVID-19 cases in the U.S. have been increasing at a record pace. “ ‘We are growing increasingly convinced that the industry’s recovery to 2019 levels of output will be a multiyear affair, with traffic levels expected to recover in 2022 at the earliest given recent travel trends.’ ” — Jamie Baker, analyst at JPMorgan The U.S. Global Jets exchange-traded fund JETS, +0.16% sank 2.2% to $16.13, and has shed 6.4% amid a three-day losing streak. The ETF has rallied 34.4% since hitting its post-COVID-19 pandemic closing low of $12.00 on May 15, but has lost 26.5% since reaching its recovery high of $21.94 on June 8. In comparison, the S&P 500 index has gained 0.6% since June 8. Don’t miss: Coronavirus update: Global case tally tops 14.5 million as U.S. deaths toll climbs above 140,000 with new infections still rising. The daily average number of travels going through TSA checkpoints for the week ended Sunday was 664,022, down from 694,489 the week before, according to a MarketWatch analysis of TSA data. The daily average for weeks ended Sundays had increased every week since it bottomed at 97,799 during the week ended April 19. “The near-term rise in COVID cases and quarantine measures appear to be now manifesting in the data and disrupting positive trends,” said analyst Savanthi Syth at Raymond James, which echoes recent commentary from some airlines. He said the quarantine measures for domestic travelers “have added another layer to traveler unease.” Read more about Delta Air’s earnings miss and American Airlines job cuts. Also read: Travelers from four more states added to N.Y.’s mandatory quarantine. The year-over-year decline in the daily average of travelers for the week ended Sunday increased to 74.5% from 73.1% the week before. That snapped a 12-week streak of declines, since the decline peaked at 95.8% during the week ended April 19. Among the ETF’s more active U.S.-based components on Monday, American Airlines Group Inc. AAL, +0.34% slumped 3.7%, United Airlines Holdings Inc. UAL, +0.32% slid 4.7% and Delta Air Lines Inc. DAL, +0.39% shed 3.1%. United Airlines tried to alleviate some traveler unease by announcing measures to improve airflow and filtration, and announcing boarding, onboard and deplaning measures to help increase passenger and employee safety. Elsewhere, shears of Southwest Airlines Co. LUV, +1.89% lost 3.4%, Spirit Airlines Inc. SAVE, +1.35% dropped 5.5%, Alaska Air Group Inc. ALK, +0.15% fell 3.0%, Mesa Air Group Inc. MESA, +11.83% declined 3.5% and Hawaiian Airlines parent Hawaiian Holdings Inc. HA, +0.36% gave up 2.9%. “We are growing increasingly convinced that the industry’s recovery to 2019 levels of output will be a multiyear affair, with traffic levels expected to recover in 2022 at the earliest given recent travel trends,” analyst Jaime Baker at JPMorgan wrote in a note to clients."}]}