{"article": [{"url": "https://www.marketwatch.com/story/this-one-sector-will-be-the-hardest-hit-by-trumps-suspension-of-work-visas-2020-06-23", "published": 1592922020.0, "headline": "This one sector will be the hardest hit by Trump's suspension of H-1B work visas", "body": "On Monday President Donald Trump issued a proclamation that, among other things, would suspend H-1B visas for the remainder of the year. That move disproportionately impacts technology companies that accounted for 66% of all H-1B visa holders in the U.S. in 2019, according to the U.S. Citizenship and Immigration Services. The Trump administration issued the proclamation to create an estimated 525,000 more jobs for 20 million Americans who are unemployed amid the coronavirus pandemic, a senior official said late Monday. H-1B visas are different from other kinds of visas in that they are allotted to \"highly educated foreign professionals to work in 'specialty occupations' that require at least a bachelor's degree or the equivalent,\" according to the American Immigration Council, a non-profit based in Washington, D.C. that supports immigration into the U.S. Typically, these visas last for three years but could be extended to six, the AIC said. The median annual compensation for the 388,403 workers on H-1B visas was $98,000 in 2019, according to USCIS. Opponents of the visas, which were capped at 85,000 this year, hold that it drives down wages for U.S.-born workers. Related: Tech-backed group blasts Trump's order on work visas as 'full-frontal attack on American innovation and our nation's ability to benefit from attracting talent' However, wages in the computer-service industry have risen by 7% since 2009. Industries that don't have as large a share of H-1B workers which have seen 1.6% wage growth since 2009, a 2015 study from left-leaning think-tank, Brookings, found. Unemployment in the high-growth tech sector has been low compared to other sectors because workers on these visa have filled the skills gap that would otherwise exist if employers could only high U.S.-born workers, economists say. With over 13,000 workers on H-1B visas, Cognizant Technology Solutions Corp. CTSH, +0.23%  was the largest H-1B employer in the 2019 fiscal year, followed by India-based technology consultant, Tata Consultancy Services Ltd 532540, -0.34%  and Amazon AMZN, +3.01% These workers along with other foreigners who were already approved for the H-1B visa won't be affected by Trump's proclamation. \"As an American company, Cognizant is committed to hiring U.S. citizens and residents, and is investing in and supporting training and retraining initiatives across the country,\" said a Conizant spokesman. Ben Trounson, a spokesman for Tata declined to comment stating that \"as a matter of policy, TCS does not speculate on such matters.\" Amazon labeled the Trump administration's move as a \"short-sighted action.\" \"Preventing high skilled professionals from entering the country and contributing to America's economic recovery puts American's global competitiveness at risk,\" an Amazon spokeswoman told MarketWatch. \"The value of high-skilled visa programs is clear, and we are grateful for the many Amazon employees from around the world that have come to the U.S. to innovate new products and services for our customers.\" \"This is not about public health or the economy,\" said Beth Werlin, executive director of AIC. \"While President Trump says he wishes to reignite our economy, this ban will prevent businesses and universities from filling critical gaps.\""}]}