{"article": [{"url": "https://www.marketwatch.com/story/heres-why-markets-shouldnt-overlook-the-fed-meeting-next-wednesday-11599856516", "published": 1599899900.0, "headline": "Hereâ\u0080\u0099s why markets shouldnâ\u0080\u0099t overlook the Fed meeting next Wednesday", "body": "AFP via Getty Images Investors might be tempted to sleep through this coming weekâ\u0080\u0099s Federal Reserve policy meeting after the central bank announced a historic change to its policy approach at the virtual Jackson Hole symposium in August, meaning the prospects for further policy changes appear slim. But analysts say that would be a mistake. The central bank gathering may offer important details on how the Fed will put its new average inflation targeting framework into practice as clarity remains lacking even after senior Fed officials were queried over its implementation in the last two weeks. When the Fed releases its economic projections next Wednesday many investors expect its U.S. inflation forecast to stay below 2% for the next three years. Thatâ\u0080\u0099s why Aneta Markowska, chief financial economist at Jefferies, says the Fed should not sit on its hands. If the Fed does remain pessimistic on the prospect of a pick-up in inflation over the next few years, it will need to strengthen expectations that it still has monetary policy tools at its disposal. â\u0080\u009cMaintaining a policy status quo in this context would be akin to throwing in a towel, which would undermine the credibility of the new framework right out of the gate,â\u0080\u009d she noted. Thatâ\u0080\u0099s why Markowska also expects the Fed to change the emphasis of its bond-buying to a mandate more focused on easing financial conditions. Up to now, asset purchases have mostly been focused on limiting any disruption to the working of financial markets. Such a move would pave the way for the Fed to shift its purchases of U.S. Treasurys towards more longer-dated maturities at the expense of shorter-dated bills and notes, a tweak demanded by some market participants who worry the bond market will be unable to absorb the sharp increase in issuance of longer-dated debt to fund the fiscal expansion Congress has enacted to combat the coronavirus pandemic. Yet bond yields have not moved much this year in spite of the federal governmentâ\u0080\u0099s yawning fiscal deficits and soaring debt total. Read: Hereâ\u0080\u0099s why markets arenâ\u0080\u0099t worried over the U.S. governmentâ\u0080\u0099s mountain of debt The 10-year Treasury note yield BX:TMUBMUSD10Y ended at 0.67% this week, but down from 1.92%, where it stood at the end of last year. In other U.S. markets, stocks finished mixed on Friday, capping a two week slide in technology stocks which had soared during the recovery from March lows. The Nasdaq Composite COMP lost 4.1% and the S&P 500 SPX fell 2.5% over the holiday-shortened week. Yet the slow economic recovery and the liquidity provided this year by the Fed may mean thereâ\u0080\u0099s a lack of urgency for it to offer guidance on its asset purchases let alone provide more information on the inflation framework. The gradually improving trajectory of economic data may not be enough to force the Fedâ\u0080\u0099s hand and accelerate its timeline for further policy announcements, said Nathan Sheets, chief economist for PGIM Fixed Income. â\u0080\u009cThey want to get a better sense of how the economy is going to evolve before committing to these long-lasting type of policy changes,â\u0080\u009d said Marvin Loh, senior global macro strategist at State Street, in an interview. Read: U.S. Treasuryâ\u0080\u0099s record debt auctions may swamp market appetite without more support from Federal Reserve The more likely outcome from the meeting would be for Fed Chairman Jerome Powell to take the opportunity to underline the need for further fiscal stimulus, according to Kathy Bostjancic, chief U.S. financial economist for Oxford Economics. Next weekâ\u0080\u0099s U.S. economic data releases will also include August industrial production numbers, last month retail sales, and Septemberâ\u0080\u0099s consumer sentiment gauge. The corporate earnings calendar is thin, but Adobe ADBE, +2.30%, Lennar LEN, +0.07% and Fedex FDX, +0.18% are among the bigger companies reporting next week."}]}