{"article": [{"url": "https://www.marketwatch.com/story/how-to-mentally-prepare-for-retirement-11594308407", "published": 1594294460.0, "headline": "How to mentally prepare for retirement", "body": "Transitioning into retirement is like flipping a switch — mentally, emotionally and financially. There are many considerations to make before retiring. Near-retirees must consider where they’ll live, what they’ll do, how much of their nest egg they’ll spend each year and countless others. And for some soon-to-be retirees, that transition isn’t easy, especially if they’re worried about losing a piece of their identity or they’re afraid they’ll run out of money in retirement. Everyone has a different path to retirement, but there are some ways anyone — regardless how they approached or entered retirement — can make the most of this next phase of their lives, said Barbara O’Neill, chief executive officer and founder of Money Talk, a financial education and consulting business. O’Neill is also the author of a new book “Flipping the Switch: Your Guide to Happiness and Financial Security in Later Life,” which is being released on Aug. 3. See: There is more to picking a place to retire than low taxes — avoid these 5 expensive mistakes O’Neill spoke with MarketWatch about how to flip the switch and why that may be challenging for Americans, especially in the midst of a pandemic. MarketWatch: The path and transition to retirement is different for everyone, but are there any commonalities among people retiring? Barbara O’Neill: The big commonality is that people are looking for meaning and purpose in their lives. The book was written through a lens of privilege, I acknowledge, because it is talking about that small subset of people who have adequate resources. If you’re really struggling, you don’t have a lot of options. You’re not going to be able to make a lot of decisions because you’re at that base survival level. It was really written for people whose finances are not driving their lives, who were able to save enough to live comfortably and who are looking for meaning and purpose. There’s a chapter about people asking you what you do, and if you don’t have a job title or employer to mention, for some people it could be freelance work, consulting, volunteer work, caregiving for grandchildren — but people need to find that meaning and purpose, otherwise it could lead to depression, boredom and not a happy state. MW: Could you share some examples of people transitioning to retirement, and how they react to it? O’Neill: I have a chapter called “Invincible to Vulnerable” and that was really acknowledging the fact that you’re not a 20-year-old anymore, or even 45-year-old anymore. I know people say 65 is the new 45, but your body is still 65. People in their 60s and 70s push back when classified as the elderly, such as when health officials were focusing on the elderly being at a higher risk of COVID-19, and I felt like that at the beginning too. There’s just the sense of feeling more vulnerable in respect to your health. As you get older, you also start to question the timeline and start making calculations. Even simple things like, if I get a dog will the dog outlive me? Things you never thought about when you were younger. And another one about being fraud bait because older adults tend to be the victim of fraud more because they’re easily reachable at home, they have more assets and in some cases there is diminished capacity, which can lead to poor decisions. MW: What are some of the challenges that come from flipping the switch? O’Neill: The big issue is: if you don’t spend down your money, someone else will. It really is true. Only about 60% of people have wills, so if you have access and accumulate wealth and don’t have a will then your state, depending where you live, will choose where your money will go. Different states have different percentages that go to blood relatives and that may not be the person you wanted to have your money. The state formulas also have no allocation for charities so if you are charitably-inclined and don’t have a will you could have several million left and none go to a charitable purpose. If you get into philanthropy and make those arrangements you could get a tax benefit through charitable contributions, whether it’s a qualified charitable distribution or setting up donor-advised funds. There’s also a theory called the lifestyle formation hypothesis — for someone who was frugal for so long, you have to practice not to be frugal anymore. It might be buying a business class ticket on a plane or train, or getting orchestra seats instead of the back of the theater for a play. Just giving yourself permission to think those things are possible because you’ve always been doing the most frugal options — that’s a hard change. It will take some practice. Also, maybe automating withdrawals would help because when you take your own money out of savings, it may feel like a loss. It does for a lot of people. When the balance goes down, it still looks like a loss psychologically, and if you have an automatic withdrawal or annuity that pays them a monthly income, you won’t feel the psychological effect. MW: Is there anything retirees can do to help themselves from getting overwhelmed with spending too fast or slow in retirement? O’Neill: The Holy Grail has always been a million dollars and if they get to a million or beyond they probably want to sit down with a financial adviser and just plot a path. The adviser can give them the confidence they need for the ability to spend, such as through Monte Carlo calculations. They can look over their assets, run some time value analyses. Say the adviser charges $250 and you work with one to get a financial plan for four hours — that may be the best $1,000 you ever spend, just to have the confidence of knowing that you have enough money and some tips on investing and asset allocation when you’re older. It doesn’t necessarily have to be an ongoing engagement, but even just a check up for a couple of hours to feel like you’re on track. When they know they’re on track they’ll have the confidence to spend a little bit more and not worry they won’t have enough. Also see: Will COVID-19 force older workers to retire? MW: What are some other challenges people face when becoming a retiree? O’Neill: What your next step is. I have a chapter about finding fulfillment after full-time work and the find in “finding” is capitalized. It stands for “financial independence, new directions.” I am not a big fan of the FIRE movement (short for “financial independence, retire early) because I think FIRE people are promoting it are not retiring like they’re never working again. It’s really looking for a new direction. I like FIND instead of FIRE because that’s what people really want to do. People are searching for their next act. I moved into a 55+ community a couple of days before Christmas last year, so now I’ve lived in this community more weeks in lockdown than prior to it. Everyone came here looking for activities and socialization and there’s none of that right now so what I’m seeing is a lot of bored people with nothing going on who are social distancing. It’s hard for people. COVID-19 is making everything worse for everyone. I talked about it in the book — it is important to keep ourselves busy, like volunteer work, but that has gone to the wayside right now. People are doing the best they can."}]}