{"article": [{"url": "https://www.marketwatch.com/story/oddsmakers-say-joe-biden-is-the-favorite-over-donald-trump-in-the-2020-election-2020-06-12", "published": 1592069180.0, "headline": "Oddsmakers say Joe Biden is the favorite over Donald Trump in the 2020 election", "body": "Joe Biden saw his lead grow to 14 points over President Donald Trump in a recent presidential poll, and for the first time this year, Biden has better odds than Trump to win control of the White House according to Betfair, a sportsbook based in Europe. The betting odds and implied probability as of June 11 are listed below. Implied probability is the conversion of betting odds into a traditional percentage to show how likely something is to happen. Joe Biden -137, implied probability 52.6% Donald Trump +125, implied probability 40.5% Mike Pence +5000, implied probability 1.8% Hillary Clinton +5000, implied probability 1.8% Nikki Haley +10000, implied probability 0.9% Bernie Sanders +10000, implied probability 0.9% Andrew Cuomo +10000, implied probability 0.9% Michelle Obama +15000, implied probability 0.6% A “-” symbol indicates a favorite and a “+” symbol indicates an underdog. For example, a $100 bet placed on a +5000 side would net a $5,000 profit, in addition to getting back the original $100. For favorites, it would take a $137 bet to win $100 on something with the odds -137. Joe Biden has been ahead of President Trump in most high-quality national polls in 2020, according to data gathered by RealClearPolitics. But, single digit polling leads for Biden were not convincing to oddsmakers. Trump had been the favorite to win the 2020 election since March when Biden took a commanding lead in the Democratic nomination process with a 10-state primary win on Super Tuesday over Bernie Sanders. Here’s how the odds have changed since Biden’s Super Tuesday win: Biden is now favored by oddsmakers to beat Trump in the 2020 presidential election MarketWatch Even during the coronavirus pandemic, Trump was still the betting favorite over Biden. Despite record jobless claims and threats of a recession, Trump’s betting odds were resilient. Trump’s approval rating also remained steady throughout both crises. In the past week, betting odds have shifted in Biden’s favor. The odds are now more in line with the polling of the race. Alex Donohue, political betting analyst for betting aggregators US-Bookies.com, thinks the culmination of the ongoing protests over the death of George Floyd, recent polls and economic uncertainty may have finally caught up to Trump. “Poor polling alone hadn’t previously been enough to convince bettors to abandon Trump,” Donohue told MarketWatch. “But the latest disastrous set of numbers, coupled with the outlook for the coming months and the consensus assessment of Biden’s likely VP pick has clearly triggered a wave of fresh confidence.” Former Democratic presidential hopeful Kamala Harris is currently the favorite to become Biden’s vice president pick, according to prediction markets. Trump’s handling of the protests and racial issues in general have not been viewed positively by many Americans. Recent polls from CBS News, Emerson College, and Reuters/Ipsos found an average of only 34% of Americans who approve of Trump’s handling of the situation. The handling of race relations is an advantage for Biden in the eyes of voters. According to the latest CNN tracking poll, voters gave Biden a nearly two-to-one advantage over Trump on race relations. That same poll showed Biden with 14 point lead over President Donald Trump Betfair is a European sportsbook and no legal U.S. sportsbook is offering betting on U.S. political election outcomes."}]}