{"article": [{"url": "https://www.marketwatch.com/story/where-will-americas-oldest-people-live-after-covid-19-2020-07-28", "published": 1596188900.0, "headline": "Where will Americaâ\u0080\u0099s oldest people live after COVID-19?", "body": "This article is reprinted by permission from NextAvenue.org. After seeing the heart-wrenching images of nursing home residents desperately trying to connect with their families perched outside their windows during COVID-19 and learning about the many deaths in those facilities, itâ\u0080\u0099s quite likely that there will be a sea change in how and where the oldest Americans will live out their lives once the pandemic subsides. According to the Centers for Disease Control and Prevention, people over 65 account for 80% of allÂ COVID-19Â deaths and close to half of those were residents in nursing homes or other long-term care institutions. But if fewer of Americaâ\u0080\u0099s oldest people will live inÂ nursing homesÂ orÂ assisted living facilitiesÂ post-pandemic, where and how will they live? 80% of older Americans can't afford to retire - COVID-19 isn't helping Enlightening comments from students who study aging For answers, Steve Gurney, publisher of the Positive Aging Sourcebook, asked the students in his School of Aging Studies class at the University of Maryland Baltimore County what they thought. The comments of these 18-to-25-year-olds were enlightening. As members of Generation Y and Z, theyâ\u0080\u0099ll be among the activists whoâ\u0080\u0099ll probably lead the charge to a changed America for their parents and grandparents. Also see: All the ways assisted living and senior housing could serve residents better A sampling of what the students said: â\u0080\u009cWeâ\u0080\u0099ve now seen the detrimental effects of having our older loved ones far away from us, either living alone or in assisted living communities.â\u0080\u009d â\u0080\u009cI do believe more families will think about adapting their houses and lifestyle to accommodate older people living with them because living in those nursing facilities is risky.â\u0080\u009d Also see: new coronavirus measures to protect nursing homes â\u0080\u009cI think that this current situation will definitely bring a big change in how families view their elders living with them. Even as I grow older, and knowing that it may be 30-plus years until my parents might need end-of-life care, this situation makes me more and more wary of the idea of having them live in a seniorsâ\u0080\u0099 facility or even receiving care from someone whoâ\u0080\u0099s not in my family.â\u0080\u009d But there was also this reality check: â\u0080\u009cThough there might be a temporary emphasis on seniors aging in place or sharing homes,Â I think that overall people will still have to consider the cost of their loved ones aging in placeâ\u0080¦ after COVID-19, a good majority of the people will have to recover financially on their own and may not have the time/attention to take care of their parents/grandparents.â\u0080\u009dViews of an influencer in aging and nursing home authority Much of the studentsâ\u0080\u0099 sentiment jives with the opinions ofÂ Next Avenue Influencer in Aging Dr. Bill Thomas, a gerontologist and leading international authority on geriatric medicine and elder care. But Thomas is quick to point out that the older population â\u0080\u0094 those he characterizes as â\u0080\u009cin their last one-third of lifeâ\u0080\u009d â\u0080\u0094 is a highly diverse group. As a result, he says, post-COVID changes where theyâ\u0080\u0099ll live are not straightforward. â\u0080\u009cFor those who are poorer, more frail or ill, existing trends will accelerate,â\u0080\u009d Thomas predicts. He believes there will still be a need for nursing homes and assisted living homes, and that many of the poor, frail and ill population will continue to rely on these institutions. But, Thomas adds, he also expects to see more emphasis on stopping the spread of infection there. Also read: The latest victim of COVID-19: Alzheimerâ\u0080\u0099s research That will likely lead to more private rooms and spaces within the facility, with additional tech available to help lower the cost of these places by reducing the need for extra staff. Those with more income will have more housing options that provide greater independence in less risky environments, Thomas predicts. â\u0080\u009cWithÂ Medicaid, we â\u0080\u0098medicalizedâ\u0080\u0099 old age,â\u0080\u009d he says. By that he means, the financing of long-term care has been tied to skilled nursing care, which is not necessarily what people need as they age. â\u0080\u009cThe fact is,â\u0080\u009d Thomas says, â\u0080\u009colder people need more assistance with the â\u0080\u0098activities of daily living,â\u0080\u0099 which are not currently covered by any public insurance or health care program.â\u0080\u009d He believes that post-COVID-19, public policy will provide more incentives to alternatives such as aging in place, living with family, shared housing and community-based services â\u0080\u0094 through more comprehensive insurance coverage and tax incentives. Thomas is also optimistic that senior living options will become more accessible to more people. He expects a future with smaller and clustered housing â\u0080\u0094 pocket neighborhoods, as some call it â\u0080\u0094 providing a greater sense of community for the oldest Americans.A â\u0080\u0098breakout momentâ\u0080\u0099 Catherine McCallum, a clinical social worker and aging care management consultant with Coral Life Strategies in Bethesda, Md., feels certain that the pandemic is a breakout moment for long-term care facilities. â\u0080\u009cYes,â\u0080\u009d she says, â\u0080\u009cthe crisis uncovered the risk of infection. But to me, the tragedy is in the isolation many residents feel.â\u0080\u009d Caregiving at homeÂ may address some of that isolation in the future, she says. But McCallum is concerned that too many people are not equipped to handle the responsibilities. Related: The case for defunding nursing homes and replacing them with a radically different model Those who arenâ\u0080\u0099t, she believes, will live in nursing homes and assisted-living facilities staffed by professionals delivering the help they need. â\u0080\u009cThe places that did well [during COVID-19] are those that not only kept a close eye on the health of the resident, but built relationships among the residents, caregiving staff, and families,â\u0080\u009d McCallum says. Like Thomas, she hopes and expects weâ\u0080\u0099ll see long-term care facilities with a greater emphasis on clustering residents, creating neighborhoods to address the problem of isolation. â\u0080\u009cWeâ\u0080\u0099re better angels when we help each other in our neighborhoods,â\u0080\u009d says McCallum. Bart Astor, an expert in life transitions and elder care, is the author of the bookÂ AARP Roadmap for the Rest of Your Life: Smart Choices About Money, Health, Work, Lifestyle and Pursuing Your DreamsÂ andÂ Baby Boomerâ\u0080\u0099s Guide to Caring for Aging Parents. His website isÂ BartAstor.comÂ and he can be reached atÂ Bart@BartAstor.com. @bartastor This article is reprinted by permission from NextAvenue.org, Â© 2020 Twin Cities Public Television, Inc. All rights reserved."}]}