{"article": [{"url": "https://www.marketwatch.com/story/trump-administration-asks-fcc-to-rein-in-social-media-2020-07-27", "published": 1595879420.0, "headline": "Trump administration asks FCC to rein in social media", "body": "The Trump administration moved forward with plans to regulate content on social-media platforms Monday, formally asking federal regulators to start overseeing how these platforms treat user-generated content. In a petition to the Federal Communications Commission, the Commerce Department called for an FCC rule-making to reinterpret key elements of Section 230 of the 1996 Communications Decency Act. That provision has given online companies broad immunity from legal liability for their users’ actions, and wide latitude to police content on their sites. “Unfortunately, large online platforms appear to engage in selective censorship that is harming our national discourse,” the petition says. “The FCC should determine how Section 230 can best serve its goals of promoting internet diversity and a free flow of ideas, as well as holding dominant platforms accountable for their editorial decisions, in new market conditions and technologies that have emerged since the 1990s.” The action follows complaints by President Donald Trump and others who say left-leaning Silicon Valley technology companies unfairly censor conservative views on their digital platforms. The internet industry has dismissed those claims, and is expected to resist attempts to reframe Section 230 as an intrusion on the free-speech rights of technology companies. In a statement, FCC Chairman Ajit Pai said the commission will carefully review the petition. But FCC Commissioner Jessica Rosenworcel, a Democrat, said the panel “shouldn’t take this bait.” “While social media can be frustrating, turning this agency into the President’s speech police is not the answer,” Rosenworcel said in a statement. “If we honor the Constitution, we will reject this petition immediately.” An expanded version of this report appears on WSJ.com. Also popular on WSJ.com: Google to keep employees home until summer 2021 amid coronavirus pandemic. New York rats embolded by lockdown have a new enemy."}]}