{"article": [{"url": "https://www.marketwatch.com/story/dont-be-stupid-new-york-governor-warns-bars-and-restaurants-can-be-closed-again-if-street-partying-continues-2020-07-20", "published": 1595264180.0, "headline": "â\u0080\u0098Donâ\u0080\u0099t be stupidâ\u0080\u0099 â\u0080\u0094 New York governor warns bars and restaurants can be closed again if street partying continues", "body": "Gov. Andrew Cuomo threatened to close restaurants and bars back down in New York City following a weekend marked by more incidents of people crowding the streets outside of venues to party late at night. â\u0080\u009cDonâ\u0080\u0099t be stupid,â\u0080\u009d Cuomo said Monday at a morning briefing. â\u0080\u009cWhat theyâ\u0080\u0099re doing is stupid and reckless for themselves and for other people, and it has to stop.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } He demanded local governments and law enforcement agencies enforce state public health and safety mandates, such as mask-wearing and social distancing, as well as disperse crowds and crack down on bars and restaurants that flout the rules â\u0080\u0094 or else. â\u0080\u009cWe will have to roll back the bar and restaurant opening if congregations continue. If local governments donâ\u0080\u0099t stop it, that is what is going to happen,â\u0080\u009d Cuomo said during a briefing held at Kennedy Airport, ahead of a flight to Savannah, Georgia, where heâ\u0080\u0099s expected to deliver coronavirus aid. Heâ\u0080\u0099s part of a delegation of New York medical professionals who went to Savannah to help expand testing and other strategies addressing the outbreak in the southern city. Among the most egregious parties over the weekend included hundreds of late-night revelers who crowded a block in the New York City borough of Queens â\u0080\u0094 once the epicenter of the cityâ\u0080\u0099s COVID-19 outbreak and which to-date has suffered nearly 6,000 deaths, more than any other county in the U.S. Authorities have already shuttered one venue as a result of the block party, which took place on a bar-heavy artery in the boroughâ\u0080\u0099s Astoria neighborhood, Mayor Bill de Blasio said at his own briefing on Monday. De Blasio said businesses are â\u0080\u009coverwhelminglyâ\u0080\u009d following the rules, but echoed the governorâ\u0080\u0099s sentiment that the industry could be shut back down if â\u0080\u009ctroublingâ\u0080\u009d incidents like the one in Queens continue. â\u0080\u009cWe donâ\u0080\u0099t want to shut down restaurants,â\u0080\u009d he said on Monday. But when it comes to other parts of the country, he said: â\u0080\u009cIt was reckless disregard in the way that bars and restaurants were handled that was one of the causes of the resurgence of the coronavirus, and we will not let that happen here.â\u0080\u009d The threats to close dining back down came as the city entered a modified version of Phase 4, the final stage in its economic reopening. Phase 4 allows zoos and botanical gardens to reopen; and paves the way for schools and colleges to reopen in the fall. But indoor dining, theaters, gyms, malls and museums remain closed in the five boroughs indefinitely. De Blasio said there was no timeline for when they could reopen. Confirmed cases in the state have remained flat for weeks. Cuomo announced another 519 new diagnoses out of about 50,000 tests performed on Sunday; there were eight deaths from COVID-19 reported that day and 58 new hospitalizations."}]}