{"article": [{"url": "https://www.marketwatch.com/story/you-can-soon-buy-playboy-stock-again-iconic-brand-returns-to-public-markets-by-merging-with-a-spac-2020-10-01", "published": 1602053360.0, "headline": "You can soon buy Playboy stock again as iconic brand returns to public markets using a pandemic-era favorite path", "body": "Playboy Enterprises Inc. is merging with special purpose acquisition corporation Mountain Crest Acquisition Corp., bringing the iconic brand back to public markets after about 11 years as a private company. Mountain Crest MCAC, -0.10%, a SPAC or blank-check company, will change its name to Playboy as soon as the deal closes and trade on Nasdaq under the ticker symbol “PLBY.” SPACs are companies that raise money through an initial public offering and then seek to acquire a business, or businesses. They have become incredibly popular this year and raised $28 billion in the third quarter in 75 deals, a record that was more than triple the previous one. Playboy Chief Executive Ben Kohn, a former private-equity executive at Rizvi Traverse who took on the position in 2017, will retain his role along with the rest of the management team. See now: 2020 is the year of the SPAC — yet traditional IPOs offer better returns, report finds “Playboy is huge,” Kohn told investors on a conference call to discuss the deal. “It is a brand and platform that could not be replicated today,” with a global reach of more than $3 billion in global consumer spend, and products sold in over 180 countries, he said. Under the terms of the deal, Playboy shareholders will receive about 23.9 million shares of Mountain Crest valued at $10 a share, and Mountain Crest will assume outstanding debt of about $142 million. That brings the total purchase price to about $381 million. To limit dilution, Playboy has agreed to purchase 700,000 Mountain Crest shares at $6.35 a share. Playboy shareholders have agreed to a one-year lockup, subject to a partial release if after six months the stock has traded at $14 for 20 out of 30 consecutive days. Mountain Crest has further agreed to sell $50 million in stock to a group of institutional investors. The deal is expected to close early in the first quarter of 2021. Playboy is a very different company today from what it was during the peak years of the 1960s and 1970s, and has shut down most of its legacy media businesses. The company started as a magazine published out of late founder Hugh Hefner’s Chicago apartment before growing to include a global licensing business and television networks. The company was first listed on the New York Stock Exchange in 1971 to raise the capital needed to expand beyond its monthly magazine and its night clubs with bunny waitresses into book publishing, new resort hotels and other ventures, as the New York Times reported at the time. Hefner took it private in 2011 in a deal that was partly financed with equity provided by Rizvi Traverse. See:Billionaire Bill Ackman has a $4 billion ‘blank check’ to buy a company, but he hasn’t said which one A collapse in magazine advertising revenue before and during the 2008 financial crisis combined with changes in the publishing business that made a lot of adult material available for free online to pressure the business. In 2016, the company stopped publishing images of fully nude women, declaring them “passé” now that nudity was all over the internet. The company’s growing popularity in conservative China was likely another factor. China today is a key market for the brand, which licenses its bunny logo for a range of goods including branded clothing and fragrances. The company today focuses on four categories: sexual wellness, including products such as condoms; style and apparel; gaming and lifestyle; and beauty and grooming. The company has more than $400 million in cash flows that are contracted through 2029, sexual-wellness products in more than 10,000 retail stores and online and branded lifestyle and digital gaming products, it said in a release. Playboy is on track to boost revenue 68% in 2020, said Kohn, and to more than double adjusted earnings before interest, taxes, depreciation and amortization, or EBITDA, over 2019. “Our product strategy is informed by consumer data and our iconic brand positioning of free expression, sex-positivity and pleasure for all,” he said. Playboy is expecting its sexual-wellness category, which includes CBD-based “arousal products” and “natural” erectile-dysfunction products, to become an addressable market worth $400 billion in the next four years. The segment is expected to account for about 40% of 2020 revenue. See also:Hugh Hefner’s trademark black pajamas, captain’s hat will be auctioned to benefit LGBT and marijuana rights The style and apparel category accounts for 50% of the brand’s revenue today, and includes fashion and accessory brands in China, where the company is a leader in men’s apparel. Gaming and lifestyle drives more than $50 million of global gross gaming sales on casino-style games, and includes partnerships with Scientific Games and Microgaming. The company is working to expand its beauty and grooming segment, which currently includes fragrance, skin care, men’s grooming and cosmetics lines. See: Artist who drew iconic Playboy Bunny remembers Hef In December 2019, Playboy closed the acquisition of Yandy.com, an online women’s lingerie and accessories business, which expanded its direct-to-consumer base by more than 2½ million relationships and added needed warehouse and fulfillment-center infrastructure, said Kohn. That business has grown more than 35% this year, he said. “We have a clear mission: to create a culture where all people can pursue pleasure. The core pillars of that mission — standing for free expression, equality, personal freedoms and the power of pleasure and fun in your life — are rooted in our 67-year history,” he told analysts. Playboy has worked to connect with millennials and Gen-Z, too, via partnerships with celebrities including Kylie Jenner, Lizzo, King Princess, Bad Bunny and Travis Scott, as well as activists Alicia Garza and Tarana Burke, among others. It has also collaborated with brands that are popular with those generations, such as PacSun and Misguided. The company has long been a campaigner for civil rights, including racial and LGBTQ+ equality and favors cannabis law reform. Mountain Crest Acquisition shares were up 0.4% Thursday. The Renaissance IPO ETF IPO, +1.98% was up 1.7% and has gained 71% in the year to date, outperforming the S&P 500’s SPX, +0.87% 4.7% gain and the Dow Jones Industrial Average’s DJIA, +0.56% 2.6% decline."}]}