{"article": [{"url": "https://www.marketwatch.com/story/its-a-huge-decision-for-policyholders-a-judge-just-handed-a-win-to-businesses-in-the-high-stakes-fight-for-insurance-coverage-during-the-pandemic-2020-08-14", "published": 1597686320.0, "headline": "â\u0080\u0098Itâ\u0080\u0099s a huge decisionâ\u0080\u0099: Judge hands a win to businesses demanding insurance coverage for lost income due to coronavirus", "body": "A group of Kansas and Missouri hair salon and restaurant owners can proceed with a lawsuit trying to make their insurance company pay for the income they missed out on during COVID-19 government shutdown orders, a judge ruled Wednesday. The businesses adequately alleged â\u0080\u0094 for now at least â\u0080\u0094 that they ought to be covered by their â\u0080\u009call-riskâ\u0080\u009d insurance policies, Western District of Missouri Judge Stephen Bough ruled after combing through insurance policy wording. The ruling could have broad implications as more businesses sue their insurance carriers for denying similar claims, observers say. Business interruption insurance replaces lost income when a business has to temporarily close its doors. The policies kick in when thereâ\u0080\u0099s â\u0080\u009cdirect physical loss or damage.â\u0080\u009d That typically applies to events including burst pipes, fires or damage from a nasty storm. So does it kick in when businesses close their doors under government orders to slow the spread of an invisible, communicable virus? And does it apply when many policies might contain coverage exclusions related to fallout from a virus? In the first few decisions on business interruption coverage amid the pandemic, three judges have sided with carriers and dismissed the cases. Boughâ\u0080\u0099s decision marks the first time a judge has decided to let businesses go ahead with their case. The Cincinnati Insurance Companyâ\u0080\u0099s policies covered â\u0080\u009cphysical lossâ\u0080\u009d or â\u0080\u009cphysical damage,â\u0080\u009d the businesses emphasized in court papers. “ â\u0080\u0098COVID-19 allegedly attached to and deprived Plaintiffs of their property, making it â\u0080\u0098unsafe and unusable, resulting in direct physical loss to the premises and property.â\u0080\u0099 â\u0080\u0099 ” â\u0080\u0094 Western District of Missouri Judge Stephen Bough But Bough noted the carrier didnâ\u0080\u0099t define â\u0080\u009cphysical loss,â\u0080\u009d so he had to make his own interpretation. â\u0080\u009cCOVID-19 allegedly attached to and deprived Plaintiffs of their property, making it â\u0080\u0098unsafe and unusable, resulting in direct physical loss to the premises and property,â\u0080\u0099â\u0080\u009d the judge wrote. These policies had no exclusion for economic fallout from viruses, he noted. The salons and restaurants, including cafes and an Italian restaurant, followed a range of city and state shutdown orders from Kansas and Missouri that stretched from March to May, according to court papers. The seven businesses that filed the lawsuit only passed an initial hurdle and the case is not over, Bough noted. But one attorney said itâ\u0080\u0099s an important first step. â\u0080\u009cItâ\u0080\u0099s a huge decision for policyholders to use as persuasive authority in other cases,â\u0080\u009d said Kim Winter, a partner at Lathrop GPM, where she represents policyholders in coverage disputes. Though Winter doesnâ\u0080\u0099t represent a side in this lawsuit, sheâ\u0080\u0099s negotiating the same sort of coverage question for other business clients. At least 1,000 lawsuits have been filed related to insurance coverage amid the pandemic, she estimated. The cases sometimes hinge on dry questions like policy language, but the stakes can be high in these lawsuits, Winter said. â\u0080\u009cIt could be the difference between businesses going out of business if thereâ\u0080\u0099s no insurance money,â\u0080\u009d Winter said. Itâ\u0080\u0099s a serious matter for the insurance industry too. One industry expert told federal lawmakers in May that carriers canâ\u0080\u0099t and shouldnâ\u0080\u0099t pay these claims for a range of reasons. â\u0080\u009cGiven this unpredictability and really unimaginable potential for loss, insurance is simply unable to underwrite or cover a pandemic like COVID-19. This concept is expressly clear in standard business interruption policies,â\u0080\u009d according to Sean Kevelighan, CEO of the Insurance Information Institute, an industry-funded consumer education association. Re-writing a contract like an insurance policy is â\u0080\u009cunconstitutionalâ\u0080\u009d and retroactive business interruption payouts â\u0080\u009cwould bankrupt insurance,â\u0080\u009d he told members of the House of Representativesâ\u0080\u0099 Small Business Committee. One-third of small businesses have a business interruption policies, according to Kevelighan. Brandon Boulware, one of the lawyers representing the Kansas and Missouri businesses, called Boughâ\u0080\u0099s ruling â\u0080\u009ca significant winâ\u0080¦and an important first step in compelling Cincinnati Insurance to stand by its policy and pay covered losses. The Cincinnati policy is an â\u0080\u0098all risksâ\u0080\u0099 policy and does not contain any exclusion for losses caused by a virus. The Courtâ\u0080\u0099s Order recognizes that. We look forward to moving ahead with this case.â\u0080\u009d In a brief decision issued the same day â\u0080\u0094 which cites the decision on the salon and restaurant case â\u0080\u0094 Judge Bough let the business entity that wholly or partially owns at least four bar and grill establishments go ahead with a separate case against Cincinnati Insurance. Cincinnati Insurance Company CINF, -1.17% Â told MarketWatch it would ultimately prevail. â\u0080\u009cWe respect the legal process. As this case continues, we believe that the court will ultimately enforce the language of our policy contract. Our commercial property insurance policies require direct physical damage or loss to property and do not provide coverage in this case,â\u0080\u009d a spokeswoman said. While these insurance cases and others wend through the court system, federal lawmakers are focused on a different legal question â\u0080\u0094 how much liability protection businesses and schools should have against lawsuits alleging coronavirus exposure. Republicans want to include a â\u0080\u009cliability shieldâ\u0080\u009d any new stimulus bill, but Democrats oppose the idea. The proposed shield would toughen legal standards to win in court. Opponents said itâ\u0080\u0099s not necessary because there is no wave of personal injury cases related to COVID-19, but proponents say businesses need the protections before they get sued, not afterwards."}]}