{"article": [{"url": "https://www.marketwatch.com/story/australia-shutting-border-between-two-biggest-states-as-covid-19-surges-in-melbourne-2020-07-06", "published": 1594010480.0, "headline": "Australia shutting border between two biggest states as Covid-19 surges in Melbourne", "body": "MELBOURNE, Australia (AP) — Australian authorities were preparing to close the border between the country’s two largest states, as the country’s second-largest city, Melbourne, recorded two deaths and its highest-ever daily increase in infections on Monday. The border between the states of New South Wales — home to Sydney — and Victoria — home to Melbourne — is due to be shut late Tuesday. New South Wales Premier Gladys Berejiklian was a critic of states that closed their borders to her state when Sydney had Australia’s largest number of coronavirus cases. But she said she changed her stance because the situation in Melbourne was unprecedented and indicated the pandemic was in a new phase. The overwhelming majority of new infections detected in Melbourne in recent weeks were from community transmission. Everywhere else in Australia, the vast majority of people who tested positive for the virus were infected overseas or had been infected by a returned traveler, Berejiklian said. “What is occurring in Victoria has not yet occurred anywhere else in Australia,” she said Monday. “It’s a new part of the pandemic and, as such, it requires a new type of response.” The Victorian government locked down 36 of the most virus-prone Melbourne suburbs last week and at the weekend added another four suburbs because of the disease spread. Victorian Premier Daniel Andrews said of the 127 new cases recorded overnight, 53 were among 3,000 people who have been confined by police to their apartments in nine public housing blocks since Saturday. Australia’s Acting Chief Medical Officer Paulk Kelly has described the high-rises as “vertical cruise ships” because of the high risk of virus spread. Police allege a 32-year-old man bit a police officer on Monday as he attempted to leave a high-rise in the suburb of Flemington. He would be charged with assault, resisting police and attempting to breach a pandemic order, Police Chief Commissioner Shane Patton said. The infections announced Monday surpassed the first surge of infections in Melbourne that peaked on March 28 at 111 cases recorded in a day. Daniels said he agreed with Berejiklian and Prime Minister Scott Morrison, a Sydney resident, that the border needed to close. Three in five Australian residents live in Sydney or Melbourne and the air services between the two cities before the pandemic were among the busiest in the world. “I think it is the smart call, the right call at this time, given the significant challenges we face in containing this virus,” Andrews said. Deputy Chief Medical Officer Michael Kidd confirmed that federal authorities agreed with the closure. The federal government had previously opposed any internal border closures aimed mostly at stopping spread from Victoria and New South Wales. Morrison had urged state leaders to open their borders for the good of the economy. Kidd said that only 16% of new cases detected in Australia in the past week had been infected overseas. Two weeks ago, 50% of new cases were people infected overseas and detected in hotel quarantine, he said. “The situation in Melbourne has come as a jolt, not just of the people of Melbourne but people right across Australia who may have thought that this was all behind us. It is not,” Kidd said. Outside of Victoria, another 13 cases reported in the past 24 hours were people infected overseas. Of those, 10 had been in hotel quarantine in New South Wales and three in Western Australia New South Wales police will enforce the Victorian border closure. Some flights and trains services would continue for travelers who are given permits and exemptions, Berejiklian said. New South Wales Police Commissioner Mick Fuller said officers would use drones to detect people who attempt across the border via forest tracks to avoid the 55 policed road and bridge crossings. Nationwide, Australia has recorded more than 8,500 total infections and 106 deaths."}]}