{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-up-100-points-as-stocks-head-for-best-week-since-august-11602242784", "published": 1602261920.0, "headline": "Dow notches best week since August even as stimulus progress stalls", "body": "Jewel Samad/Agence France-Presse/Getty Images U.S. stocks rose Friday as investors remained optimistic over prospects for another round of fiscal stimulus from Congress eventually, with major benchmarks posting their best week since the summer. What did major benchmarks do? The Dow Jones Industrial Average DJIA, +0.56% rose 161.39 points, or 0.6%, to close at 28,586.90, while the S&P 500 SPX, +0.87% added 30.30 points, or 0.9%, to 3,477.13. The Nasdaq Composite COMP, +1.39% gained 158.96 points, or 1.4%, to end at 11,579.94. The Dow on Thursday rose 122.05 points, or 0.4%, to finish at 28,425.51, while the S&P 500 advanced 27.38 points, or 0.8%, to close at 3,446.83. The Nasdaq Composite finished at 11,420.98, up 56.38 points, or 0.5%. For the week, the Dow gained 3.3%, while the S&P 500 was up 3.8% and the Nasdaq was up 4.6%. That marked the strongest weekly rise for the blue-chip index since Aug. 7 and the best for the S&P 500 and Nasdaq since July, according to FactSet. The small-cap Russell 2000 RUT, +0.55% advanced 0.5% on Friday, but closed the week 6.4% higher. What drove the market? Investors remained optimistic about another fiscal stimulus package being passed by Congress eventually and stocks advanced late in the week, encouraged by continued talks between House Democrats and the Trump administration. The on-again, off-again fiscal stimulus talks in Washington sped up Friday, as bargaining warmed up over a comprehensive deal, a prospect President Trump rejected only three days ago. But after House Speaker Nancy Pelosi and U.S. Treasury Secretary Steven Mnuchin talked by phone, the provisions of the plan for coronavirus testing remained a sticking point. Prior to the Pelosi-Mnuchin discussion breaking up, Trump expressed his hope for a big deal while on a conservative radio talk show. Amid reports the administration was willing to go to $1.8 trillion from its previous level of $1.6 trillion in its offer, compared to the Democrats $2.2 trillion proposal, Larry Kudlow, director of the White House’s National Economic Council, said Trump had signed off on a revised offer. The situation marks a sharp turnaround from Tuesday afternoon, when Trump tweeted he was pulling out of talks and both Pelosi and the Republican party Senate Majority Leader Mitch McConnell appeared to accept the negotiations were over until after the election. But McConnell’s path to getting a deal of more than $1 trillion passed in the Senate would appear difficult as he has said some of his Republican colleagues don’t want to see more stimulus spending at all. Read: On again: Pelosi says talking to Mnuchin again Friday about big fiscal stimulus “Stimulus is one of the most important topics in the market today,” said Ben Kirby, co-head of investments at Thornburg Investment Management. But Kirby thinks the odds are low that anything passes in the next few weeks. “It’s not in either party’s best interest to do a package ahead of the election. I think they’re incentivized to play ball but not come to a deal. I view election uncertainty as noise and I would be a buyer on short-term volatility.” Analysts also said Democratic challenger Joe Biden’s widening lead in the polls over President Donald Trump has also been seen as a supportive factor because it lessens, but doesn’t eliminate, the prospect of a contested election outcome on Nov. 3, a prospect that has unnerved investors fearing weeks of legal and political wrangling. The president trails Joe Biden by an average of 9.7 percentage points nationally according to the Real Clear Politics average of polling. “The market rally is also the result of polls – both nationally and in key states – showing that Biden’s lead is widening,” said David Donabedian, chief investment officer of CIBC Private Wealth Management. “The market does not favor one party or another, but the widening lead reduces the odds there will be a close, contested election. That is the market’s biggest fear,” he said. Read: Stocks are rallying because fears of a contested election are fading COVID-19 treatment hopes were also noted, analysts said. Gilead Sciences Inc. GLD, +1.81% said late Thursday that a late-stage study of its experimental COVID-19 treatment showed it shortened time to recovery. The drug, remdesivir, was reportedly one of the medications recently prescribed to President Donald Trump for his COVID-19 infection. Gilead shares rose 1.4%. The third quarter U.S. corporate earnings reporting season gets under way next week, with major banks set to report third-quarter results. Read: U.S. corporate earnings reports will shine a light on the uneven playing field in the pandemic Friday was a light day for economic data. U.S. wholesale inventories rose by 0.4% in August as companies began to stock up again to replace dwindling supplies.s Which companies were in focus? The Wall Street Journal reported that Advanced Micro Devices Inc. AMD, -3.94% AMD is in talks to buy rival chip maker Xilinx Inc. XLNX, in a deal that could be valued at more than $30 billion and mark the latest big merger in the rapidly consolidating semiconductor industry. AMD shares were down 4.1%, while Xilinx shares rose 12%. AT&T T, -1.01% is planning thousands of job cuts in its WarnerMedia unit as it seeks to cut costs by up to 20%, according to The Wall Street Journal. Shares were off 0.3%. Kronos Bio Inc. KRON, +42.47% shares rocketed 43% in their first day of trading, while shares of Shattuck Labs Inc. STTK, +13.82% were up nearly 14%. What did other markets do? Mainland Chinese stocks jumped as investors returned from a weeklong break, with the Shanghai Composite SHCOMP, +1.67% rising 1.7%. Japan’s Nikkei 225 index NIK, -0.11% rose 0.1%, while Hong Kong’s Hang Seng Index HSI, -0.30% gained 0.3%. The pan-European Stoxx 600 Europe Index SXXH, +0.54% gained 0.6% to close at 480.10. London’s FTSE 100 UKX, +0.64% also gained 0.6%., closing at 6,016.65 The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% slipped nearly a basis point to 0.774%. Bond yields move inversely to prices. Oil futures CL.1, -1.62% slumped but were on track fell 59 cents, or 1.4%, to settle at $40.60 a barrel as Hurricane Delta approached the Louisiana Gulf Coast. Gold GOLD, +2.86% added $31.10, or 1.6%, to settle at $1,926.20 and ending at a 3-week high. The ICE U.S. Dollar Index DXY, -0.58%, a measure of the currency against six major rivals, was down 0.6% at 93.05."}]}