{"article": [{"url": "https://www.marketwatch.com/story/a-modest-stock-market-correction-may-be-ahead-jpmorgan-says-heres-why-you-shouldnt-panic-2020-08-03", "published": 1596538040.0, "headline": "A stock market correction may be imminent, JPMorgan says. Hereâ\u0080\u0099s why you shouldnâ\u0080\u0099t panic", "body": "A modest stock market correction could occur in the next few weeks but doesnâ\u0080\u0099t justify bearish targets or even a defensive investment strategy, JPMorgan strategists said. They said key coming data releases, such as payrolls on Friday and retail sales on Aug. 14 could â\u0080\u009cundershoot expectationsâ\u0080\u009d and drive the modest correction. â\u0080\u009cSome misgivings are justified given a macro backdrop that is becoming muddied, but not muddied enough to justify bearish targets or a defensive investment strategy,â\u0080\u009d say strategists, led by John Normand, in a note. Pent-up demand and the assumption that Congress will approve another stimulus package of at least $1 trillion means the economy remains â\u0080\u009cwell above trend,â\u0080\u009d they say, while a larger correction was unlikely. Talks over another coronavirus stimulus package that would restore jobless benefits to millions of Americans continued into the weekend and will remain in focus this week. However, lawmakers reportedly remain far apart in the negotiations. â\u0080\u009cA large correction (about 10%) would be tough to generate when positioning measures in equities are below average for most hedge funds,â\u0080\u009d they add. August may be one of the most bearish months for risky markets, but JPMorgan says there were â\u0080\u009cas many signs of calm as of concern,â\u0080\u009d at the start of the month. The investment bankâ\u0080\u0099s U.S. strategists say they see an â\u0080\u009cincreasingly compelling case for value,â\u0080\u009d as second-quarter earnings were likely to mark an inflection point in the profit cycle, and the global business cycle was â\u0080\u009csurprising on the upside.â\u0080\u009d The three major benchmark indexes have recovered from March lows, with the Dow Jones Industrial Average DJIA, +0.56% Â 6.5% down year-to-date, the S&P 500 SPX, +0.87% Â 2% higher in 2020 and the Nasdaq Composite COMP, +1.39% Â 21.6% up for the year, hitting record highs on Monday."}]}