{"article": [{"url": "https://www.marketwatch.com/story/vanguard-opposes-this-wall-street-tax-its-founder-john-bogle-favored-and-that-says-a-lot-about-mutual-funds-today-2020-09-03", "published": 1599136940.0, "headline": "Vanguard opposes a tax on Wall Street its founder John Bogle favored â\u0080\u0094 and the reason may surprise you", "body": "Last January, MarketWatch published an article I wrote about Vanguard Groupâ\u0080\u0099s research on a financial transaction tax (FTT). The U.S. mutual fund giant argued â\u0080\u0094 in solidarity with a number of financial industry companies and lobbying organizations â\u0080\u0094 that a small tax on Wall Street financial transactions â\u0080\u009cwould harm everyday savers.â\u0080\u009d Vanguardâ\u0080\u0099s piece claimed to quantify â\u0080\u009cthe hardships imposed on American families.â\u0080\u009d This research, though not made publicly available by Vanguard, was distributed, Vanguard tells me, by its Government Relations team â\u0080\u009cto inform discussions and advocate for investors.â\u0080\u009d The research, entitled â\u0080\u009cMain Street investors at risk,â\u0080\u009d is still available online (as of this writing) at a site maintained by the National Association of Plan Advisors, an industry lobbying organization. In other words, the Vanguard research was available through its Government Relations arm to selected industry lobbying organizations, but not to the general public or to Vanguard fund investors. In this research document, Vanguard claimed that the effect of the FTT on an investment of $10,000 would be that the investor would lose $5,989 after 20 years. In my article, I pointed out that Vanguard got this result by assuming the investment, which was assumed to be in an actively managed stock fund, would lose a hefty 1.09% per year because of the FTT. “ Vanguard revised its estimate of the annual cost of the tax to the average investor downward by a factor of 15. ” After my article was published, Vanguard went back to the drawing board to update its research. The firm kindly kept me informed as it approached the completion of the revision. Last June, Charles Kurtz, a Vanguard public relations specialist, sent me the new findings. It now assumes the impact of the FTT on an active equity fund will be not 1.09%, but 0.075% â\u0080\u0094 about 1/15th as much as Vanguardâ\u0080\u0099s previous assumption. In other words, Vanguard revised its estimate of the annual cost of the tax to the average investor downward by a factor of 15. Yet thereâ\u0080\u0099s no difference between Vanguardâ\u0080\u0099s new conclusion, as stated in words, and the old one. You have to read the fine print to see how much the firmâ\u0080\u0099s assumption about the cost of the FTT has changed. Now, instead of the headline on the research paper being â\u0080\u009cMain Street investors at risk,â\u0080\u009d it is, â\u0080\u009cFinancial transaction tax: Main Street bears the burden.â\u0080\u009d Why does Vanguard persist in exaggerating the impact of a proposed financial transaction tax on the average (â\u0080\u009cMain Streetâ\u0080\u009d) investor? In the body of the June research document, Vanguard takes up a good deal of room with an exhibit that makes it look like the FTT would cost a huge amount because it is levied on each of a series of transactions. But the cost for each of those transactions (buying shares, rebalancing portfolio, selling securities) is small. Even added together the cost is trivial. “ The financial services industry is deploying its usual tactic to protect the wealth of those who have accumulated enormous amounts of it. ” The real burden of a FTT will fall on the professional traders who often trade in microseconds â\u0080\u0094 algorithmic traders and high-frequency traders. The financial services industry is deploying its usual tactic to protect the wealth of those who have accumulated enormous amounts of it, which is to claim that those who are not at all wealthy will bear the burden. Nothing could be further from the truth. But why is Vanguard, in particular, joining this cavalcade of industry giants and lobbyists who are circling their wagons against the FTT? Vanguard, as far as I know, has little or nothing to lose from this tax, unlike many other financial industry firms. Vanguard doesnâ\u0080\u0099t have outside shareholders who might push it to lobby against the tax. (Vanguard, unique among financial industry firms, is organized as a non-profit and thus doesnâ\u0080\u0099t have outside shareholders.) Moreover, John Bogle, Vanguardâ\u0080\u0099s hugely admired late founder, favored a FTT and he would never have allowed Vanguard to promulgate such a politicized document. Read: How fund giant Vanguard is misleading investors about a tax on stock tradesÂ Then why is Vanguard taking this position? For an answer, look to an article Vanguardâ\u0080\u0099s Kurtz sent me as background for my January MarketWatch piece. This opinion article appeared in The Wall Street Journal on December 8, 2009, entitled â\u0080\u009cA Transaction Tax Would Hurt All Investors.â\u0080\u009d The articleâ\u0080\u0099s co-authors are former Vanguard board member Burton G. Malkiel (author of the best-seller â\u0080\u009cA Random Walk Down Wall Streetâ\u0080\u009d) and former Vanguard chief investment officer George U. (â\u0080\u009cGusâ\u0080\u009d) Sauter. I respect both of these men very much. But their article is based on a repetition of a conventional wisdom that runs rampant in the investment world, without sufficient careful scrutiny â\u0080\u0094 namely that reduced trading volume in the securities markets (reduced â\u0080\u009cliquidityâ\u0080\u009d) means added cost to an investor, and therefore the investor earns less. A simple thought experiment shows this is not necessarily true. Trading volume in shares of U.S. stocks is now more than six billion a day. Suppose that volume could be increased to, say, trillions of shares, or quadrillions. Would that mean that ordinary investors would somehow earn more money on their investments? Of course not. Why would they? In the original Vanguard research â\u0080\u0094 the research that assigned a 1.09% annual cost to the FTT â\u0080\u0094 Vanguard assumed a ripple effect in the market causing a loss to all investors, due to the fact that a FTT would reduce the volume of transactions. During the time between my January article and the writing of this one, I continued to communicate with Vanguardâ\u0080\u0099s Kurtz, and offered my opinions on why no such a loss to investors could be assumed. I donâ\u0080\u0099t know if that had any effect on Vanguardâ\u0080\u0099s work in progress, but the firmâ\u0080\u0099s updated report says that â\u0080\u009cresearch indicates that FTTs lead to reduced trading volume and higher bid-ask spreads, which result in lower liquidity and higher costs.â\u0080\u009d But Vanguard assumes no such costs in its calculations. Thatâ\u0080\u0099s because no such cost can be clearly ascertained â\u0080\u0094 or even if there is one.Vanguard chooses a side There is another cost to Main Street investors â\u0080\u0094 one that would not be imposed by a FTT but in fact alleviated by one. High-frequency traders and algorithmic traders, who account for at least half of all stock-market transactions, make their money largely in one particular pursuit. They try to detect whether investing â\u0080\u009cwhalesâ\u0080\u009d â\u0080\u0094 by which is meant very large investment funds, such as mutual funds, pension funds, and endowment funds â\u0080\u0094 are in the process of making a big trade. These large trades canâ\u0080\u0099t be made all at once, so a whale will try to dribble a trade into the market piecemeal. But the high-frequency traders can tell what the whale is doing and â\u0080\u009cfront-runâ\u0080\u009d the rest of its trade â\u0080\u0094 that is, they can buy quickly at a lower price and then sell to the whale at a higher price, thus levying against the whale â\u0080\u0094 or rather against its â\u0080\u009cMain Streetâ\u0080\u009d investors â\u0080\u0094 a small cost. These costs add up. With a FTT in place, most high-frequency trading is likely to be eliminated; and the cost to Main Street investors in mutual funds and pension funds will be mitigated. But Vanguardâ\u0080\u0099s compatriots in this fight (not Bogleâ\u0080\u0099s, when he was still alive) stand to lose from the FTT â\u0080\u0094 even if Vanguard itself does not. Â Thatâ\u0080\u0099s why Vanguard is fighting the FTT. Vanguard, through a spokesperson, responded to the points in this article by saying: â\u0080\u009cAs our analysis illustrates, Vanguard firmly believes the costs of an FTT would be borne by all investors, not just Wall Street traders, speculators, or market-timers. The impact of an FTT would be passed on to investors through higher costs and wider bid-ask spreads. These increased costs would compound over time and lower returns, hindering millions of American investors who are striving to reach their long-term financial goals like saving for retirement or education.Â â\u0080\u009cWe also believe an FTT would harm the functioning of the capital markets through a number of unintended, domino-like consequences. To avoid the FTT, we expect that some market participants would trade less frequently, reducing liquidity. As a result, market volatility would increase and bid-ask spreads would widen, adding yet another layer of increased costs for investors. In an effort to avoid the tax, sophisticated investors would likely shift activity to less regulated markets and engage in financial engineering, such as increasing exposure to alternative investments like derivatives.â\u0080\u009d In response, I believe that neither Vanguard nor any other analyst has rigorously shown why the impact of an FTT or wider bid-ask spreads should necessarily increase costs for the average investor. It should be emphasized that any market trader, not just a designated market-maker, can post a bid-ask spread, and it certainly doesnâ\u0080\u0099t imply that the trader will profit from that spread, nor that the traderâ\u0080\u0099s counterparty or counterparties will lose. Vanguard has not shown why even more frequent trading than takes place today would result in gains for the average investor, nor, conversely, why less-frequent trading would result in costs. Financial engineering is already what is done by Wall Street traders, speculators, and market-timers; there is no reason to believe that a FTT would increase the level of financial engineering. Furthermore, Vanguard does not explain why the headline conclusion of its research is that â\u0080\u009cMain Street bears the burden,â\u0080\u009d when it would clearly impose a burden â\u0080\u0094 a greater one â\u0080\u0094 on Wall Street traders and speculators. Michael Edesess is chief investment strategist at mobile financial-planning software company Plynty and a research associate at the EDHEC-Risk Institute. He is the author of â\u0080\u009cThe Big Investment Lieâ\u0080\u009d and co-author of â\u0080\u009cThe 3 Simple Rules of Investment.â\u0080\u009dÂ Read: A small subset of Vanguard investors moved entirely into cash when the market tumbled. Hereâ\u0080\u0099s how they did More: Robinhood faces SEC investigation over deals with high-speed traders"}]}