{"article": [{"url": "https://www.marketwatch.com/story/the-west-burns-coastlines-are-threatened-and-trump-and-biden-are-too-quiet-on-climate-change-say-analysts-2020-09-11", "published": 1599919880.0, "headline": "The West burns, coastlines are threatened, and Trump and Biden are too quiet on climate change, say analysts", "body": "Editor’s note: Article has been updated to include President Trump’s plan to visit California announced Saturday. Historic blazes are raging across the western U.S. ahead of what scientists say is the typical peak of wildfire season. Hot and dry conditions are aggravating the situation and raising fresh alarm over the impact of climate change on natural disasters — except, it would seem, from presidential election foes Donald Trump and Joe Biden. Trump has blamed local leaders and forest management while granting emergency status to some states, which sends federal dollars their way, though Oregon says it is still waiting. Trump has granted California emergency status that will free up relief, but during the 2019 fires the president threatened to withhold FEMA funds. The White House on Saturday announced that the president plans to visit McClellan Park, Calif., on Monday for a briefing with local and federal fire and emergency officials. The announcement comes after weeks of no comment on the deadly blazes from Trump, which has drawn criticism from climate-change policy advocates. Trump’s EPA has also rolled back several protections that are decades old for water and air quality at the behest of the fossil-fuel industry and other business lobbyists, citing cost and imperfect enforcement. Read:Former Republican and Democratic EPA bosses call for agency reset after election Biden, say political analysts, has advanced a thorough climate-change policy platform but has been at times unclear and careful not to sound too progressive on climate as he fights to win battleground states with energy-reliant economies, such as his native Pennsylvania, in November’s election. Read:Here’s where Joe Biden has moved to the left — and where he hasn’t Beyond the fires in California, Colorado, Oregon and other states, Hurricane Laura devastated parts of the Gulf Coast last month, only one of the recent major hurricanes that are common threats to high-population U.S. areas. Many Iowa crops were leveled when a derecho brought hurricane-force winds last month. Plus, rising average temperatures and extreme heat and its public health impact leave the medical field fretting about the burden of care in coming decades, especially as the COVID-19 pandemic strains the system. Extreme weather has historically had a shaky association to the broader issue of climate change; yes, weather and climate are two different factors. But scientists are increasingly tracking evidence that a warming Earth has upped the frequency, irregularity and impact of extreme weather events. “Scientific evidence suggests that the severity of prolonged droughts and heat waves has been exacerbated not only by rising temperatures but also by changes in atmospheric circulation patterns associated with recent climate change,” says Charles Jones of the University of California, Santa Barbara. “These changes can enhance extreme fire-weather behavior.” Oregon officials revealed on Thursday that an estimated half a million of the state’s residents, more than 10% of its population, had been evacuated from their homes due to the fires. Gov. Kate Brown, a Democrat, said Oregon is now approaching 900,000 acres burned. “To put that number into perspective,” she said, “in the last 10 years, we see an average of 500,000 acres burn in an entire year. We’ve seen that nearly double in the past three days.” Read:Deadliest fire of the year in California leaves 10 dead The left-leaning policy group Climate Power 2020 on Thursday tallied up the president’s no- comment approach to climate change and the fires. “President Trump hasn’t mentioned the wildfires in any way, shape or form since Aug. 23, nearly three weeks ago,” the group wrote. “During that time, Trump held 46 public events where he could have addressed the crisis and devastation. Nor has Trump tweeted about the wildfires from his personal account. When he did last address the fires in mid-August, he blamed California for the wildfires and said ‘you gotta clean your floors.’ ” “ ‘The Biden campaign understands that a full embrace of an aggressive climate-change agenda could create problems for them in Upper Midwest.’ ” — Political adviser Dan Schnur Connecting climate-change policy and the latest disasters is also touchy territory for Biden, say political analysts, because the former vice president has delicately laid out his environmental platform to maintain some separation from the Democratic Party’s most progressive arm. It’s not clear whether Biden approves of fracking in key state Pennsylvania or of other fossil-fuel exploration and drilling, and he has appeared to waver at times as his campaign nears the Nov. 3 election. Read:Are Democrats wavering on oil subsidies? Biden-Harris climate platform remains fluid Other toss-up states feature in the energy debate, too. “The Biden campaign understands that a full embrace of an aggressive climate-change agenda could create problems for them in Upper Midwest,” Dan Schnur, who served as an adviser to former California Gov. Pete Wilson and Arizona Sen. John McCain, told the Associated Press. Progressives and even some middle-of-the road Democrats largely back the Green New Deal — the policy outline with a big price tag that promotes renewable energy, green job creation and a march toward zero carbon emissions. It was advanced by Rep. Alexandria Ocasio-Cortez and Sen. Edward Markey last year, and throughout the Democratic primaries most candidates and now the Democratic National Committee adopted some portion of the plan as their own. Biden’s plan mimics much of the Green New Deal, but far from all. Read:Climate change is huge risk for the American financial system, a major new bipartisan report says The Biden campaign’s response to the fires is especially notable as his running mate, Sen. Kamala Harris, represents California in the Senate. She was campaigning in Miami this week, but her campaign told the AP that Biden and Harris “have been closely monitoring the wildfires raging across the state and highlighting the urgent need to address the threat of climate change.” Biden tweeted that climate change “is already here — and we’re witnessing its devastating effects every single day.” Related:Kamala Harris has a particular climate-change agenda: environmental justice Biden’s top advisers note that many of his proposals will move the country toward the Green New Deal, but some activists worry it is not ambitious enough and that the extreme weather is real-time evidence that lawmakers and presidential leadership are already behind the curve. Trump, charging that polluters China, India and others don’t do enough, has pulled the U.S. from the Paris Climate Accord, an international, voluntary effort that aims to limit the global average temperature rise to below 2 degrees Celsius and ideally 1.5 degrees. Some analysts say Democrats are likely to crank up the climate-change-disaster rhetoric when and if they have greater political cover. “Investors frequently ask how we would rank the Democrats’ priorities in 2021 to which we semi-facetiously suggest: (1.) Economy, (2.) Jobs, (3.) Climate as a tool for supporting economy and jobs,” said Benjamin Salisbury and Josh Price of Height Securities, in a note. “We believe that the Democrats are set on a path to interlock employment, justice and climate policy in a way that prioritizes environmental regulation should they win control.” This week, Senate Democrats released a resolution called the THRIVE agenda that asserts the “duty of the Federal Government [is] to respond to the crises of racial injustice, mass unemployment, a pandemic, and climate change with a bold and holistic national mobilization.” The resolution includes a net-zero target for the electric sector by 2035, in line with Biden’s proposal. In addition, it makes union employment and restarting domestic manufacturing integral to climate and labor strategies. THRIVE earned the endorsement of Senate Democratic Leader Chuck Schumer, who would set the agenda if the Democrats win the Senate. Schumer did not sponsor the Green New Deal resolution, on which Majority Leader Mitch McConnell called a show vote in February 2019, when the ink was barely dry on the policy framework. “ ‘No. 1 since Teddy Roosevelt. Who would have thought, Trump is the great environmentalist?’ ” — President Trump, in Florida Some of the energy-sector policy targets are concerning to Republican lawmakers and right-of-center trade groups that are seeking their own approach to slowing man-made climate change, including Citizens for Responsible Energy Solutions, the R Street Institute and others. They desire a unified federal carbon-credit program and more balance in keeping heating and cooling costs low for Americans by including fossil fuels in a diverse energy mix, and they promote carbon sequestration as a way to harness emissions. Those issues are among the key facets of the proposed GOP-led Growing Climate Solutions Act, a main challenger to Democratic ideas resembling the Green New Deal. Key election states and their links to climate change wasn’t lost on the Trump campaign earlier this week when the president, in Florida, announced an expansion of the ban on oil drilling off the coasts of Florida, Georgia and South Carolina. Trump touted himself as the No. 1 environmentalist “since Teddy Roosevelt ... ” And as the GOP works toward its own environmental platform, largely one that keeps fossil fuels in a diverse energy mix, Trump’s shrug on climate change and extreme weather may have consequences for him and the party. More younger voters who identify as Republicans now consider climate change fact than fiction. “The President can’t wash his record, no matter how hard he tries,” said Monica Medina and Miro Korenha, writing in the Our Daily Planet newsletter. “While it’s doubtful that most people believe President Trump when he touts his environmental accomplishments, do they buy his rhetoric that environmental policy is bad for the economy? Likely not,” they argued. “A recent survey from Resources for the Future showed that the public is perhaps starting to see past the false dichotomy that action on climate change and protection of the environment comes at the direct expense of the economy.” The Associated Press contributed to this report."}]}