{"article": [{"url": "https://www.marketwatch.com/story/trump-trade-adviser-navarro-blasts-beijing-for-spawning-the-coronavirus-and-then-seeding-and-spreading-the-disease-2020-07-03", "published": 1594108880.0, "headline": "Trump trade adviser Navarro blasts Beijing for 'spawning' the coronavirus and then 'seeding and spreading' the disease", "body": "White House trade adviser Peter Navarro in a bombastic Friday afternoon television interview accused China of having \"spawned\" and \"hid\" the coronavirus that causes the disease COVID-19 and then sending \"hundreds of thousands of Chinese nationals\" to \"seed and spread\" the disease \"to the United States and Italy and everywhere in between.\" With Navarro disclosing that he'd arrived for the MSNBC interview with preset talking points, host Ali Velshi waded in to inquire whether Navarro was alleging that Beijing had deliberately brought about what ultimately became a global pandemic, Navarro responded: “ 'I don't think it matters.' ” He continued: \"What they deliberately did, Ali, and this is beyond reproach in terms of a fact - they deliberately allowed Chinese nationals to come to the United States, Italy and everywhere in between who were infected while they were locking down their own [domestic] transportation network.\" He went on to accuse the Chinese of failing to raise an early alarm when the outbreak began last year and then \"under the shield of the [World Health Organization]\" not divulging an accurate genomic picture of the virus. \"The Chinese Communist Party is responsible for every bad thing we're experiencing right now,\" he said. \"We need to start pointing the blame at China.\" He said his market-attention-seizing June 22 lamentation on Fox News, \"It's over,\" was not, as it appeared to have been, about the demise of U.S.-China trade deal itself but about U.S. trust in China's ruling party, which, he said, sent its trade negotiators to the U.S. without mentioning the viral outbreak that had begun months earlier in Wuhan, China. Opinion:'Wildly out of context' - Peter Navarro on his own words, and the markets in relation to the economy Stating he'd come to the interview with a second point to make in addition to the finger pointing at China, he returned to a longtime favorite Donald Trump topic, saying, \"Hydroxychloroquine needs a second look,\" in light of a new study pointing to prospective mortality-rate improvements in a Detroit hospital system. \"I'm literally sitting on 63 million doses of hydroxychloroquine in the FEMA strategic national stockpile that I can't give away.\" Read on:Trump was being 'tongue in cheek' when he said the U.S. should 'slow the testing down,' White House adviser Peter Navarro says Key Words:Trump contradicts narrative that he was speaking in jest when he appeared to advocate a slowdown in coronavirus testing The WHO over the weekend said it had discontinued studies evaluating hydroxychloroquine and the AbbVie ABBV, +0.41%  HIV drug Kaletra as potential COVID-19 treatments. Navarro, reported to have engaged in at least one heated exchange with Dr. Anthony Fauci, the U.S.'s widely respected top infectious-disease expert, did not seek to paper over any animosity in their relationship. \"He shouldn't be viewed as the oracle,\" Navarro said of Fauci. \"Dr. [Deborah] Birx, she's my heroine. I love how she has really tackled this.\" iframe.twitter-tweet { width: 100% !important; } The trade adviser remained in the science realm when he allowed that the \"reasonable assumption\" of President Trump and perhaps others that, \"come summer, heat and humidity would get rid of the virus\" now appears to have been flawed. Key Words: Trump contradicts Navarro and McEnany narrative that he was speaking in jest when he appeared to advocate a slowdown in coronavirus testing The Margin:Peter Navarro challenges '60 Minutes' on the White House's coronavirus response - it doesn't go very well |"}]}