{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-extend-climb-above-9-year-high-as-traders-see-few-limits-to-central-bank-stimulus-2020-07-08", "published": 1594217480.0, "headline": "Gold up for a 4th session to log another 9-year high as traders see few limits to central-bank stimulus", "body": "Gold futures climbed for a fourth straight session on Wednesday to score another settlement at their highest since September 2011, supported by the prospect of a lengthy period of government and central bank stimulus to support economies harmed by the COVID-19 pandemic. The “pandemic, economic and political headlines, tariff tiffs,China worries,and relentless buying by [exchanged-traded fund] haven seekers,” said George Gero, managing director at RBC Wealth Management. The World Gold Council reported Tuesday that global net inflows to gold-backed ETFs reached $39.5 billion, topping the previous annual inflow record from 2016. “Gold has been a haven for investors looking ahead to volatility in stocks, currencies, and low rates as aggressive global stimulus ensued,” said Gero, in emailed commentary. Read:Why gold has become a ‘weapon of choice’ for investors August gold US:GCQ20 rose $10.70, or 0.6%, to settle at $1,820.60 an ounce. Prices based on the most-active contract settled at their highest since Sept. 14, 2011, according to FactSet data. Prices had gained 0.9% Tuesday, to also mark their highest in nearly nine years. On Tuesday, the Federal Reserve’s No. 2, Richard Clarida, did little to disabuse investors of the view that the Fed would do whatever it takes to limit the damage from the viral outbreak. “We have a lot of accommodation in place; there’s more that we can do, there’s more that we will do, if we need to,” the Fed Vice Chairman said on CNN International. The Fed’s balance sheet has grown from $4 trillion back in March to about $7 trillion, as policy makers rolled out a cavalcade of programs intended to inject liquidity into markets that have been nearly frozen due to fears of the economic impact of the pandemic. Precious metals have benefited from loose monetary policy as bullion is viewed as a hedge against uncertainty and a protection against a wave of money printing to help stimulate economic growth. Gold’s “explosive appreciation” to levels not seen since 2011 is partly due to “fears around the longer-term impacts of repeated centra bank intervention,” said Lukman Otunuga, senior research analyst at FXTM. And as “negative themes in the form of trade uncertainty, geopolitical tensions and growth concerns sap investor confidence, gold may become a prime hotspot for safety.” Meanwhile, September silver US:SIU20 settled 46 cents, or 2.5%, higher at $19.161 an ounce, after it gained 0.6% in the previous session. The settlement was the highest for a most-active contract since September 2019. Gold’s break above $1,800 has triggered a big move in silver, which can “easily be in the $20s in the coming weeks,” said Peter Spina, president and chief executive officer at GoldSeek.com. Gold has “so many positive price drivers in its favor, with the key player being negative real rates,” he told MarketWatch. “The march to new highs is on and the momentum is growing—meaning the price will move up higher faster.” Spina added that he does not expect to see a meaningful pullback in gold until it breaks past $2,000. September copper US:HGU20 added 1% to $2.824 a pound. October platinum PLV20, +3.99% climbed by 2.4% to $884 an ounce, while September palladium US:PAU20 edged down by 0.7% to $1,938.30 an ounce."}]}