{"article": [{"url": "https://www.marketwatch.com/story/ive-got-a-budget-of-3300-a-month-and-want-to-be-near-some-wild-areas-where-should-i-retire-2020-06-11", "published": 1594303700.0, "headline": "Iâ\u0080\u0099ve got a budget of $3,300 a month and want to be near some â\u0080\u0098wildâ\u0080\u0099 areas â\u0080\u0094 where should I retire?", "body": "Dear MarketWatch, I want to retire within a one day (about 10-hour) drive of my family in Northern New Jersey. I want to be on the water, fresh or salt, and near some â\u0080\u009cwildâ\u0080\u009d areas like national or state parks, wilderness areas, etc. My retirement income will be about $3,300 a month before taxes and Iâ\u0080\u0099d like to keep those to a minimum. Obviously, a good hospital and airport are important and I like local theater, live music and a college town is a plus. What have you got for me? Ken Dear Ken, Natural beauty, low taxes and access to good medical care and entertainment options â\u0080\u0094 youâ\u0080\u0099re hardly alone. Your budget of just under $40,000 makes it more of a challenge, but here are some strong suggestions. Given how housing costs and crime rates can vary, donâ\u0080\u0099t forget to check out the nearby towns. Morgantown, West Virginia That request for â\u0080\u009cwildâ\u0080\u009d areas grabbed me, and my first thought was West Virginia, specifically Morgantown, a river town of 30,000 nestled in the Appalachian foothills and home to West Virginia University and about 27,000 college students. As youâ\u0080\u0099ve figured out, a college town punches above its weight with amenities, in this case a teaching hospital as well as theater and music. Youâ\u0080\u0099ve got water â\u0080\u0094 especially the Cheat River to the east and its whitewater rapids. Cheat Lake and Copper Rock State Forest are less than half an hour east of the city, so there are plenty of outdoor opportunities. Plus Morgantown is in the middle of the 238-mile Parkersburg to Pittsburgh (P2P) Rail-Trail under development (overlapping in part with the Great Allegheny Passage) that will open up even more options. Taxes are relatively low; the National Tax Foundation says the state ranks 19th for â\u0080\u009cTax Freedom Dayâ\u0080\u009d â\u0080\u0094 how long it takes to pay all federal, state and local taxes for the year. You didnâ\u0080\u0099t mention whether youâ\u0080\u0099ll be selling a house and using the proceeds for housing. So Iâ\u0080\u0099m assuming youâ\u0080\u0099ll be renting. The median rent, including utilities, is $821, according to the Census Bureau, or about 25% of your budget. You can see whatâ\u0080\u0099s available now on Realtor.com (owned, just like MarketWatch, by News Corp.). Overall, the cost of living here is lower than in my other two suggestions. The airport isnâ\u0080\u0099t great; flights are only to Pittsburgh and BWI airports. Or you can drive two hours to Pittsburgh (an area you may also want to check out, but affordable housing will be harder to find). The drive to northern New Jersey is about six hours.Roanoke, Virginia If Morgantown doesnâ\u0080\u0099t appeal, what about Roanoke, Va., with the Blue Ridge Mountains and the George Washington and Jefferson National Forests as your playground and the Appalachian Trail around the corner? Youâ\u0080\u0099d have some great hiking and mountain-biking options. Plus thereâ\u0080\u0099s Smith Mountain Lake with 500 miles of shoreline an hour away. Roanoke is a bigger city than Morgantown, with about 100,000 people, and has a better airport. Thereâ\u0080\u0099s a walkable, lively downtown, the extensive Roanoke Valley Greenway system for more biking and walking options, one of the oldest farmers markets in the country, plenty of cultural options, including some minor-league sports, and three health-care systems, including the Veteransâ\u0080\u0099 Administration and a level 1 trauma center. If youâ\u0080\u0099re looking for craft beer, the Roanoke area is your place. On top of the locals, Deschutes, the Bend, Ore., brewer, is building its East Coast brewery here. The townâ\u0080\u0099s average age is actually decreasing as more young professionals move in, a good sign. But the college town feeling may be less pronounced than in my other choices; Roanoke College is a 2,000-student liberal arts school. You can always get your big-sports fix at Virginia Tech 45 minutes away in the smaller city of Blacksburg. Virginia isnâ\u0080\u0099t as tax-friendly as West Virginia, but the overall cost of living in the Roanoke area is 10% below national average. The median rent in the county is $949, according to the Census Bureau, but still under 30% of your budget. (See whatâ\u0080\u0099s on the market now) And if you decide you want to supplement your income, the Roanoke areaâ\u0080\u0099s unemployment rate has been below the national average, unlike Morgantown, making it easier to get a job. The drive to North Jersey is seven hours along Skyline Drive (and you miss the Washington, D.C. traffic). Thereâ\u0080\u0099s also Amtrak service for those times you donâ\u0080\u0099t want to drive.Columbia, South Carolina If youâ\u0080\u0099re willing to drive a bit more than 10 hours, Columbia, S.C. pops up as a prime choice in MarketWatchâ\u0080\u0099s â\u0080\u009cwhere should I retireâ\u0080\u009d tool. This city of 133,000 people is another river town and home to both the state capital and the University of South Carolina with its 35,000 students and SEC sports. Of the three, this definitely will offer you the most cultural choices, and craft brewers abound too. Minor-league baseball offers more summer entertainment, and there are plenty of biking and walking trails. As for your water and wild fix, Lake Murray, a 50,000-acre man-made lake, is 15 miles away and Harbison State Forest is a bit closer. Congaree National Park, which preserves the largest tract of old growth bottomland hardwood forest left in the United States, is a half-hour away. The airport you want? Nonstops to eight major cities, mostly on the East Coast. The far bigger Charlotte, N.C., airport is less than two hours away. It, too, has Amtrak service. Of the three, temperatures are the hottest, and it is the muggiest. But if you hate snow, youâ\u0080\u0099ll barely get any here. South Carolina matches West Virginia in tax-friendliness, using that same National Tax Foundation calculation. Median rents across the county are $952, according to the Census Bureau, and the city itself is a bit cheaper. (Hereâ\u0080\u0099s whatâ\u0080\u0099s on the market now) Overall, the cost of living is about 8% below the national average. Unemployment here, too, has been below the national average. A word of warning: itâ\u0080\u0099s being discovered. Of course, the numbers will tell you only so much. Spend some time in each place youâ\u0080\u0099re considering and see what clicks with you. You may also want to spend some time thinking more deeply about taxes and which kind youâ\u0080\u0099ll pay. Many states donâ\u0080\u0099t tax Social Security. That may make Pennsylvania and Maryland more appealing, for example. On the flip side, sales taxes in Columbia are an above-average 8%. Read: I ran the tax numbers for a semi-retired life, and they look amazing I did look north, but Burlington, VT, is a tougher budget fit. Ithaca, NY, was cast aside for the same reason. Anyone have any other suggestions for Ken? Weigh in below."}]}