{"article": [{"url": "https://www.marketwatch.com/story/oregons-key-lessons-on-voting-by-mail-after-2-decades-of-only-voting-that-way-11599145297", "published": 1601459720.0, "headline": "Oregonâ\u0080\u0099s key lessons on voting by mail â\u0080\u0094 after 2 decades of only voting that way", "body": "An election worker opens envelopes containing vote-by-mail ballots for the Aug. 4 Washington state primary. Getty Images Oregon voters have longÂ cast their ballots by mailÂ in many types of elections, including for local, state and federal offices. They started doing so in 1987 â\u0080\u0094 and haveÂ voted exclusively by mail in all electionsÂ since 1998. For much of that time, I and others have studied how mail-in votingÂ affects voter turnout, as well as theÂ potential for partisan advantageÂ orÂ voter fraud. Oregonâ\u0080\u0099s experience shows that mail-in voting can be safe and secure, providing accurate and reliable results the public can be confident in. As more voters consider using mail-in voting than ever before, there are some lessons they â\u0080\u0094 and their local and state election officials â\u0080\u0094 can learn from Oregon, to help things move more smoothly.Consider timing Not everyone in the U.S. knows how to vote by mail. Theyâ\u0080\u0099ll need help from state and local officials so they know what to do. Ideally this will start early, with instructions about how to get a mail-in ballot in advance of the actual ballots being sent out to voters. “ By accepting mail-in ballots in September or early October, states would get a good sense of how many people will be voting by mail. ” In Oregon, all registered voters are automatically sent a ballot about three weeks before Election Day. This gives peopleÂ plenty of time to receive their ballots, consider the options and mark and return the ballots. They also are less likely to skip voting because of unanticipated events like illness or inclement weather, or because of worries about making arrangements at work, getting to the polling place or waiting in long lines before being allowed to vote. By accepting mail-in ballots in September or early October, states would get a good sense of how many people will be voting by mail. That would also give election officials and the postal system time to make plans toÂ handle the additional traffic.Teach voters whatâ\u0080\u0099s expected In any state, when a voter receives the ballot, they must mark it, making their selections for candidates and their choices on referenda or other ballot questions. In Oregon, after marking the ballot, the voter puts it into whatâ\u0080\u0099s called a â\u0080\u009cballot secrecy envelope,â\u0080\u009d which contains no identifying information. This prevents election workers or others from knowing which person cast the ballot inside. That secrecy envelope goes into aÂ second envelope, which is what is delivered to election officials. Each voter must sign the outside of that second envelope. Then the voter can mail the ballot back to their local election office â\u0080\u0094 in some places, postage is already paid, but in others voters need to put one or more stamps on it. Alternately, the voter can take the second envelope with its contents to one of severalÂ drop-off boxes set up around each communityÂ in the state. Many states are planning to set these up and have them regularly monitored by election officials, who collect the ballots. A Utah voter uses a drop box during the June primary. Getty Images When the ballots arrive at the local election office, the name and signature on the envelope are compared to the official registration records. If the signatures donâ\u0080\u0099t match, the voter is notified by mail, and given the opportunity to correct or explain the discrepancy. Of course, such corrections take time, so this is a good reason for voters who are casting their ballots by mail to send in their votes early. Read: Trump suggests North Carolina residents vote twice â\u0080\u0094 which is illegalLet voters track their ballots In Oregon, each outer envelope â\u0080\u0094 the one the voter needs to sign â\u0080\u0094 has a unique bar code printed on it. That lets votersÂ track the status of their ballotsÂ after they have either mailed them or dropped them off. Read: Whereâ\u0080\u0099s my vote? Tracking ID guarantees that your mail-in ballot is counted in the 2020 election Be clear about deadlines Some voters will always wait until the last minute to make their choices. Drop-off sites are good ways to help people return their ballots on or just before Election Day and to save on postage. In January 2020, Oregon set up a system whereÂ voters donâ\u0080\u0099t need to buy postage for the ballot envelope. All ballots must be received at county election offices by 8 p.m. on Election Day. So someone who is running late should probably avoid the mailbox and find a drop-off site instead. Read: Ballot drop boxes are safe, secure and have been used by Republicans and Democrats for decades â\u0080\u0094 so why is Trump bashing them? Be ready for criticism Mail-in voting isÂ popular in Oregon, and, it seems, around the country. But there are critics. Some are concerned that the system providesÂ no guarantee of a secret ballot, but there has beenÂ no evidence that undue influenceÂ on voters â\u0080\u0094 like bribes or threats â\u0080\u0094 has been a problem in Oregon elections conducted by mail. Others have falsely claimed there is moreÂ fraud with mail-in voting. Oregon has mailed out millions of ballots over the past three decades, withÂ about a dozen cases of actual fraud. Most problems were unintentional errors involving signing the wrong mailing envelope or assuming that a voter could sign the mailing envelope for a family member. Read: A look at claims made by William Barr on mail-in voting, China and more in his Wolf Blitzer interview on CNN My research, and that of others, has found that voting by mailÂ boosts turnout modestly, especiallyÂ in special electionsÂ and inÂ years with presidential elections. Some people have raised more personal concerns about losing the ritual of going to the polls with other members of the community. It may be less social to vote at home, butÂ more peopleâ\u0080\u0099s voices are being heard. Criticism is inevitable, but skeptics and supporters alike can look to the experience of Oregon for real answers. Perhaps the strongest evidence thatÂ the system is equitable, fair, reliable and safeÂ is that in two statewide surveys I have conducted over the years, aÂ nearly identical percentage of Oregon Republicans and DemocratsÂ strongly support voting by mail, andÂ the same is true of elected officialsÂ in the state. Now read: Iâ\u0080\u0099m the Republican secretary of state in Washington â\u0080\u0094 and I believe voting by mail works And: Indianaâ\u0080\u0099s alternative to vote by mail: 28 days of early in-person voting Priscilla Southwell is professor emerita of political science at the University of Oregon in Eugene. This was first published by The Conversation â\u0080\u0094 â\u0080\u009cMail-inÂ voting lessons from Oregon, the state with the longest history of voting byÂ mailâ\u0080\u009c .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; margin-bottom: 5px; } .at16units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body.at12units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body .header .wsj-interactive.generic-iframe-embed[name=\"\"], body.at8units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body.at4units .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .header .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; }"}]}