{"article": [{"url": "https://www.marketwatch.com/story/these-are-the-chinese-fintech-firms-you-should-be-aware-of-11599685121", "published": 1599671180.0, "headline": "These are the Chinese fintech firms you should be aware of", "body": "Ant Financial and CEO Eric Jing, here thanking philanthropic partners for helping to plant 100 million trees in some of China's most arid areas to combat desertification, have cast a long shadow over China's fintech sector. But, even with its $30 billion IPO drawing near, Ant is not the only company in the category that bears watching. Lintao Zhang/Getty Images Fintech behemoth Ant Group Co. has attracted the China-watching finance world’s attention, and for good reason — its coming IPO may break records if it raises its targeted $30 billion in Shanghai and Hong Kong. But partially obscured by Ant’s large shadow are several exciting Chinese fintech firms to keep an eye on as activity heats up in the space. Here are a few: Waterdrop: Digital insurance tech platform Waterdrop is raising quick money with its close connection to Chinese tech giant Tencent 700, +0.84%. The four-year-old, Beijing-based startup raised $230 million in Series D funding last week, led by Tencent and Swiss Re 0QL6, SREN, -0.62%, Waterdrop said Thursday. Smaller previous investors returned as well, including IDG Capital and Wisdom Choice Global Fund. Online behemoth Meituan Dianping 3690, +1.19% is also a leading investor. Tencent has been involved in each of the four fundraising rounds, and, more importantly, its WeChat app — used by nearly everyone in China — is the major route for signing up new Waterdrop customers. IPO rumors surfaced in July but had been hushed until this week, when Reuters said unnamed sources disclosed plans for an upcoming U.S. public listing. The company is developing a suite of products. Its Waterdrop Insurance Mall — an online shop of multiple insurance products — boasts some 120 million users resulting in nearly $900 million in premiums paid to insurers last year, the company claims. Waterdrop Crowdfunding is a GoFundMe-style community fundraising platform for patients with insufficient funds to cover often serious illnesses, as China’s health-care costs continue to soar. The company has not revealed its valuation, but multiple analysts put the number close to $2 billion. Lufax: Like many fintech companies that have been around more than a few years, Lufax survived the rise and fall of China’s P2P lending period, which largely ended in regulatory crackdown because of fraud. Most of those companies altered their business models to stay alive. Lufax — or Shanghai Lujiazui International Financial Assent Exchange — stayed under the wing of parent company Ping An Insurance Group 2318, +0.62% 601318, +2.15% and began offering online loans and wealth-management products. Its escape from the P2P demise was a success. As of its early 2019 fundraising round, it was valued at around $40 billion. Earlier this year, heavy hitters like Bank of America BAC, +0.47% and Morgan Stanley MS, -0.34% plowed in another $1.3 billion. Last month, the company filed to go public in the U.S. with a target of raising $3 billion. Wallyt: Anyone who’s spent time in China has been struck by the ubiquity of online payments. Most retail transactions now take place through Ant Financial’s Alipay or Tencent’s WeChat Pay. Both companies have made aggressive forays outside of China’s borders, but their riches by far derive from China’s enormous domestic market. Based in the Chinese tech hub of Shenzhen, Wallyt is looking abroad for its core customer base. The so-called software-as-a-service (SaaS) fintech startup, founded in 2018, provides an array of mobile payment solutions for finance firms and smaller vendors — most of them in Southeast Asia. The bulk of those clients are financial entities, such as banks, the company said. Yet instead of competing with, say, a lender that is going digital, it aims to charge those companies and in exchange assist in a smoother transition to online payments. Like China, most of Southeast Asia never developed a widespread credit-card culture, leaving it ripe to leapfrog straight into digital payments. “Selling our mobile payment solution in the U.S. is more difficult since the credit-card system is entrenched and paying via smartphones can’t make a great leap on the widely used credit card,” founder and CEO Liu Tong said recently. Liu said the company should hit close to $12 million in revenue by year-end, and is headed toward its first external funding round soon. JD Digits: E-commerce giant JD.com JD, +2.09% battles for online retail supremacy in China with Alibaba’s BABA, -0.26% Taobao and Tmall. But both parent companies have their hands in a slew of spinoff projects. One of JD’s early ones was its 2013 creation of JD Finance, which focused on online insurance, payments and consumer investment products. JD spun off the arm in 2017, and it was renamed JD Digits. This summer JD Digits filed for an IPO on Shanghai’s STAR board, China’s version of the Nasdaq, with an estimated valuation of $28 billion. The firm has enlisted Guotai Junan and Minmetals Securities as joint sponsors of the listing, with CITIC Securities and Hua Jing Securities as financial advisers. As with JD.com, founder Richard Liu holds a controlling stake in the firm. Tanner Brown covers China for MarketWatch and Barron’s."}]}