{"article": [{"url": "https://www.marketwatch.com/story/the-nasdaq-just-marked-the-fastest-10-plunge-in-historyagain-11599597345", "published": 1599583400.0, "headline": "The Nasdaq just marked the fastest 10% plunge in history-again", "body": "The bear is back in the pandemic era. After ushering in the ninth month of the year with record highs, it's shaping up to be one of the worst starts to a September for the Nasdaq Composite Index - and the broader U.S. stock market - ever, as the wheel's come off a bullish rally that had taken the technology-heavy index to unprecedented heights. On Tuesday, the day after the Labor Day holiday when markets in the U.S. were closed, the Nasdaq sank beneath a level that most market technicians view as kicking off a bearish trend: a decline from a recent peak of at least 10%. The Nasdaq Composite COMP, +1.39% finished down 465 points, or 4.1%, lower at 10,847, falling more than 10% from its Sept. 2 record high at , according to Dow Jones Market Data. A drop in an asset price of at least 10%, but not more than 20%, from a recent peak is the commonly used definition for a correction. The Composite last entered correction on Feb. 27 and proceeded to plunge by more than 30%, qualifying the gauge for a bear market. The index subsequently rebounded higher but now stocks are giving back some of the frenzied runup that took it from its March 23 low to a 58% return, even after its brutal beat down of the past few sessions. The Nasdaq's 10% downturn from its Sept. 2 all-time peak, however, is notable because it surpasses the previous record pace of six-sessions that it took for the index to crash from an all-time high into correction back in March, the Dow Jones data show. The steep fall for the Nasdaq Composite comes after three straight days of retrenchment of at least 1%, which marks the longest such losing streak since the COVID-19 pandemic took root in the market back in March. The skid lower also amounts to the worst start to a September, over the first 5 trading days, since 2001, when the Nasdaq Composite dropped 6.1%, Dow Jones data show. Dow Jones Market Data Read: A stock market correction may be imminent, JPMorgan says. Here's why you shouldn't panic See: A 10% selloff in the stock market is most likely, says expert who called March lows: 'Something has to give' Partly prompting the slide, have been growing concerns that some of the largest-capitalization stocks, including Tesla Inc. TSLA, +1.89% and Apple Inc. AAPL, +1.74%, seen as beneficiaries of the coronavirus pandemic, have climbed too far too fast. The Nasdaq-100 index NDX, +1.51%, representing the largest 100 companies in the Nasdaq Composite, also closed in correction, matching its fastest three-day decline of at least 10% for that benchmark since the dot-com bubble imploded in 2000. Dow Jones Market Data"}]}