{"article": [{"url": "https://www.marketwatch.com/story/investors-should-be-wary-of-warren-buffetts-crash-warning-2020-08-26", "published": 1598685800.0, "headline": "Investors should be wary of Warren Buffettâ\u0080\u0099s crash warning", "body": "I hesitate to disagree with anything Warren Buffett says about the stock market. Heâ\u0080\u0099s made about $80 billion from investingâ\u0080\u0094and I certainly havenâ\u0080\u0099t. But when it comes to his famous warning about the dot-com bubble 20 years ago, long-term investorsâ\u0080\u0094such as those saving for their retirementâ\u0080\u0094need to grab a large fistful of salt. â\u0080\u009cThey know that overstaying the festivitiesâ\u0080\u0094that is, continuing to speculate in companies that have gigantic valuations relative to the cash they are likely to generate in the futureâ\u0080\u0094will eventually bring on pumpkins and mice,â\u0080\u009d Buffett warned Berkshire Hathaway stockholders back in 2000, regarding those gambling on sky-high internet stocks. He added: â\u0080\u009cBut they nevertheless hate to miss a single minute of what is one helluva party. Therefore, the giddy participants all plan to leave just seconds before midnight. Thereâ\u0080\u0099s a problem, though: They are dancing in a room in which the clocks have no hands.â\u0080\u009d As a warning against the craziness of sky high stock prices, Buffettâ\u0080\u0099s comments, of course, were on target. The tech-heavy Nasdaq Composite Index COMP, +1.39%, which peaked at 5,049 shortly before Buffett sent out his stockholder letter, promptly collapsed over the next 2Â½ years by 75%. Someone who invested in the indexâ\u0080\u0094for example through the QQQ QQQ, +1.52% Â exchange-traded fundâ\u0080\u0094had to wait 15 years to see a new peak. They were in the red for all that time. And yes, we are clearly in some version of a second technology bubble. Today the stocks in the Nasdaq Composite Index are valued in aggregate at a wild, sky-high $17 trillion. Thatâ\u0080\u0099s equal to 90% of the entire U.S. gross domestic product, and more than half the market value of all U.S. traded stocks. The Nasdaq Composite in relation to the broad market S&P 1500 SP1500, +0.83% is now nearly at the peak levels seen during the madness of February-March 2000. Compared with the entire worldâ\u0080\u0099s stock markets, as measured by the MSCI All-Country World Index? Well, check out our chart. But thereâ\u0080\u0099s one problem with Buffettâ\u0080\u0099s analogy. We are not dancing in a room â\u0080\u009cin which the clocks have no hands.â\u0080\u009d And even if things turn into pumpkins and mice, figuratively, it is very unlikely to happen in an instant at midnight. The popular image of a stock market â\u0080\u009ccrashâ\u0080\u009dâ\u0080\u0094Wall Street in 1929, the Nasdaq in 2000â\u0080\u0094is a sudden phenomenon that comes out of nowhere and is too fast to escape. But itâ\u0080\u0099s not true. The infamous dot-com bubble of 1999-2000 took 2Â½ years to deflate fully. Along the way ordinary investors had opportunities galore to get out with most of their winnings. For instance in September of that year, a full six months after the bubble had burst, the Nasdaq Composite was still higher than it had been in early February, when the bubble was nearing its peak. So the clocks didnâ\u0080\u0099t just have hands, they had alarms and those were ringing like mad for months. This may not have helped you if you were buying the worst quality dot-comsâ\u0080\u0094the ones that quickly went bankruptâ\u0080\u0094or trading with borrowed money. But if you were investing responsibly in the technology sector as a whole, the comedown took a long time. It wasnâ\u0080\u0099t entirely dissimilar in the infamous crash of 1929. The market was sliding for a solid six weeks before the bottom dropped out. And even afterward there were plenty of opportunities to get out. The market rallied from November of that year through the following spring. The worst destruction didnâ\u0080\u0099t come until 1931-1932, and that was largely in response to a series of disastrous policy moves made by the U.S. and foreign governments. And in most crashes, the worst carnage isnâ\u0080\u0099t experienced by those who hung around a bit too long, but those who kept throwing good money after bad on the way down. Getting out of a boom too early could cost you almost as much money in missed profits as getting out too late costs you in losses. Many intelligent and responsible stock market gurus thought tech stocks were dangerously overvalued in 1997 and 1998. But if youâ\u0080\u0099d cashed out then, you would have spent the next couple of years kicking yourself as your former shares rose as much as 300% more. Selling out of the Wall Street boom of the late 1920s a year too early cost you nearly as much as selling out a year too late. You often make the biggest money in a bubble right at the end. As Peter Lynch, the legendary Wall Street investor and former Fidelity manager, said: â\u0080\u009cFar more money has been lost by investors preparing for corrections, or trying to anticipate corrections, than has been lost in corrections themselves.â\u0080\u009d Naturally the question that really matters is where we are now. OK, so maybe the dominant technology companies this time around, namely Apple AAPL, +1.74%, Amazon AMZN, +3.01%, Microsoft MSFT, +2.48%, Alphabet/Google GOOG, +1.97%, Netflix NFLX, +1.43% Â and Facebook FB, +0.26%, arenâ\u0080\u0099t as crazy as big tech was 20 years ago. At the peak of the madness back then, Microsoft stock was valued at 113 times the per-share earnings of the previous 12 months, and Cisco Systems an epic 300 times. This time around, Microsoft, Apple and Google are all on trailing price-earnings ratios in the 30s, which are historically very high â\u0080\u0094 but not quite as crazy as back then. (Netflix, though, is 80 times trailing earnings, and Amazon more than 100 times). But letâ\u0080\u0099s accept for the sake of argument that big tech is in a bubble that echoes that of 2000 and that this cannot last. So what should a responsible investor do? It is possible to minimize the risk of regret by selling often in small amounts. Market gurus point out that if stocks carry on rising you will congratulate yourself on the ones you didnâ\u0080\u0099t sell, and if stocks fall you will congratulate yourself on the ones that didnâ\u0080\u0099t. It is also possible to hang on in case there is a further spike, while vowing to cash out when the index hits a stop-loss of, say, 20% from the peak. Historically, that has worked pretty wellâ\u0080\u0094so long as people stuck to it, and actually did sell. But for the nervous, Cambria Investments money manager Meb Faber developed a system that is as simple as it has (so far) proven reliable. His rule: At the end of every month, see if the index is still above its average price of the past 10 months, also known as the 200-day moving average. So long as the index is above its 200-day average, hang on and pay it no more attention. But if the index is below the average, donâ\u0080\u0099t think, just sell. And donâ\u0080\u0099t buy back until it gets back above the average again. Faber has tested his system for the U.S. and international stocks, REITs, commodities, even Treasury bonds. Applied to the S&P 500 SPX, +0.87%, it even got you out of the stock market this year at the end of February, just before everything collapsed completely, and back in at the end of May. You donâ\u0080\u0099t even have to take it to extremes. You can stay, say, 75% invested in stocks so long as the index is above its 200-day average, and sell down to, say, 25% when it falls below. Astonishingly, itâ\u0080\u0099s managed to keep people invested in most booms and got them out of most bear markets early on. The very long-term investment returns are about the same as just buying and holding stocks. But this strategy has far less volatility and downside risk. Naturally the past is no guarantee of future performance, in this as in anything else. But if you carry on dancing, this allows you keep an eye on the clocks, and an ear out for alarms."}]}