{"article": [{"url": "https://www.marketwatch.com/story/the-housing-market-is-on-a-sugar-high-home-sales-are-soaring-but-is-it-a-good-time-to-buy-heres-what-the-experts-say-2020-08-21", "published": 1598238320.0, "headline": "â\u0080\u0098The housing market is on a sugar highâ\u0080\u0099: Home sales are soaring, but is it a good time to buy? Hereâ\u0080\u0099s what the experts say", "body": "Americans are rushing to buy homes right now. But should you be one of them? Sales of previously-owned homes in the U.S. rose 24.7% between June and July to a seasonally-adjusted annual rate of 5.86 million, the National Association of Realtors reported Friday. Not only did the percentage increase represent a record, but the sales volume was the highest the U.S. has seen since 2006. Itâ\u0080\u0099s a stunning turnaround from just a few months earlier when the coronavirus pandemic caused record-breaking decreases in sales as Americans were staying home to avoid getting sick. To a large extent, the bumper demand for housing is an indication that Americans are aiming to make up for lost time. Many economists believe that what weâ\u0080\u0099re seeing now is essentially a postponed spring home-buying season. â\u0080\u009cThe housing market is on a sugar high brought on by government stimulus and a pandemic-fueled rush to low density housing,â\u0080\u009d said Daren Blomquist, vice president of market economics at Auction.com, a real-estate website for foreclosure sales. Donâ\u0080\u0099t miss:THE BIG MOVE: I work in Silicon Valley, but my job is now remote. I can finally live somewhere cheaper. Where should I go? â\u0080\u009cProspective buyers will be better positioned for success as homeowners if they understand that this sugar high will not last and make sure their decision to buy is grounded in longer term factors that will affect their ability and willingness to commit to paying down a sizable amount of debt over the next 30 years,â\u0080\u009d Blomquist added. But even with home-sales activity reaching record levels, many Americans remain unsure of whether now is the right time to make the biggest financial decision of most peopleâ\u0080\u0099s lives. The home purchase sentiment index from Fannie Mae FNMA, +0.73% Â decreased in July, as peopleâ\u0080\u0099s view of home-buying conditions worsened in tandem with rising coronavirus cases across much of the country. Here are the factors that experts say you need to consider:Interest rates remain near all-time lows From a financing perspective, buying a home is something of a no-brainer right now. And indeed, record-low interest rates helped spur much of the rise in home sales. â\u0080\u009cNo matter what youâ\u0080\u0099re looking for, this is a great time to buy since the current low interest rates can stretch your spending power,â\u0080\u009d said Bill Banfield, executive vice president of capital markets at Quicken Loans RKT, +1.01%. â\u0080\u009cWith interest rates in the twoâ\u0080\u0099s available, a buyer can afford much more home than they could have just a few years ago.â\u0080\u009d While many economists expect interest rates to remain roughly this low for a while, they likely wonâ\u0080\u0099t get a whole lot lower. Mortgage rates have fallen in response to the pandemic and the effect it had on the economy. So if a vaccine or treatment for COVID-19 were to be discovered, rates would likely shoot upward. â\u0080\u009cThere are no guarantees,â\u0080\u009d said Tendayi Kapfidze, chief economist at LendingTree TREE, -0.37%. â\u0080\u009cSo affordability could decline going forward.â\u0080\u009dThere arenâ\u0080\u0099t many homes for sale As the adage goes, you canâ\u0080\u0099t buy whatâ\u0080\u0099s not for sale. And right now, well, thereâ\u0080\u0099s not much for sale across most of the country. â\u0080\u009cNow is a great time to buy because of incredible mortgage rates, but a terrible time to buy because of inventory,â\u0080\u009d said Ralph McLaughlin, chief economist and senior vice president of analytics at financial-technology company Haus. As McLaughlin put it, buyers are going to face a tough choice right now: Do you lock in a low rate and settle for whateverâ\u0080\u0099s on the market, or do you wait for your dream home and risk a higher interest rate. â\u0080\u009cIf you plan on finding your dream home, itâ\u0080\u0099s probably better to wait,â\u0080\u009d McLaughlin said. â\u0080\u009cBut if you plan on trading up in a few years now isnâ\u0080\u0099t a terrible time, other than low inventory, of course.â\u0080\u009dCompetition is driving faster sales and higher prices The tight inventory of homes for sale right now is being met with a large swathe of eager buyers. And thatâ\u0080\u0099s a recipe for rising prices and bidding wars. Median home list prices were up 10.1% year-over-year for the week ending Aug. 15, according to a recent report from Realtor.com. Thatâ\u0080\u0099s the fastest growth in listing prices since January 2018. Low-interest rates allow prices to rise more quickly. And homes are coming off the market at a rapid pace. Over two-thirds of the homes sold in July were on the market for less than a month, the National Association of Realtors reported. â\u0080\u009cThat quick-decision environment may challenge some buyers, especially first-timers who are new to the process,â\u0080\u009d said Danielle Hale, chief economist at Realtor.com. The good news is that high prices might coax some sellers into the market, said Holden Lewis, housing and mortgage expert at personal-finance website NerdWallet. More inventory on the market would keep prices and competition in check. Falling prices arenâ\u0080\u0099t necessarily something buyers should hold out for. â\u0080\u009cIf prices fall significantly and inventory rises dramatically, that means the economy has taken a hard turn for the worse and you may have other priorities than housing,â\u0080\u009d said Robert Frick, corporate economist at Navy Federal Credit Union. Also see:Mortgage rates are going back up â\u0080\u0094 just as home prices begin to skyrocketWhere you live and the lifestyle you lead are important As any real-estate agent will tell you, all real estate is local. So whatâ\u0080\u0099s happening one town over or at the national level may have little bearing on what youâ\u0080\u0099ll encounter in the housing market. â\u0080\u009cAre you an owner moving from a fast-paced real estate marketâ\u0080¦to a housing market where the pace is a bit less frenzied? If yes, then this may be a good time for you,â\u0080\u009d Hale said. For instance, if you own a home in a suburb of New York City but would like to live closer to the action, say in Manhattan, now may be a great time to buy. A recent Zillow ZG, -0.42% Â report threw cool water on the common wisdom that people are fleeing to the suburbs â\u0080\u0094 with some exceptions. Zillow found that in most parts of the country suburban markets have not strengthened at a disproportionately faster rate than urban markets. But in Manhattan, home values are indeed down 4.2% from last year and properties are staying on the market longer. Yet he biggest factor for most people in deciding whether to buy will be their lifestyle. Traditionally, most home-buying decisions revolve around milestones like getting married, having kids or retiring. Millennials are growing their families and reaching their peak home-buying years. And with more people working from home, the need for more space is a factor for many would-be buyers. If you find yourself in that position, then experts suggest not hesitating. If you have enough in savings to afford the down payment and ancillary costs of buying a home, fetch yourself a low rate and look for a home that suits your needs. On the other hand, if you are â\u0080\u009cin between jobs or working in an industry thatâ\u0080\u0099s been particularly hard-hit by the recession, it may be a better time to wait,â\u0080\u009d Hale said."}]}