{"article": [{"url": "https://www.marketwatch.com/story/we-have-glimmers-of-hope-scientists-testing-if-coronavirus-survivor-plasma-can-prevent-infection-in-others-2020-06-12", "published": 1591963640.0, "headline": "â\u0080\u0098We have glimmers of hopeâ\u0080\u0099 â\u0080\u0094 scientists testing if coronavirus survivor plasma can prevent infection in others", "body": "Survivors of COVID-19 are donating their blood plasma in droves in hopes it helps other patients recover from the coronavirus. And while the juryâ\u0080\u0099s still out, now scientists are testing if the donations might also prevent infection in the first place. Thousands of coronavirus patients in hospitals around the world have been treated with so-called convalescent plasma â\u0080\u0094 including more than 20,000 in the U.S. â\u0080\u0094 with little solid evidence so far that it makes a difference. One recent study from China was unclear while another from New York offered a hint of benefit. â\u0080\u009cWe have glimmers of hope,â\u0080\u009d said Dr. Shmuel Shoham of Johns Hopkins University. With more rigorous testing of plasma treatment underway, Shoham is launching a nationwide study asking the next logical question: Could giving survivors plasma right after a high-risk exposure to the virus stave off illness? To tell, researchers at Hopkins and 15 other sites will recruit health workers, spouses of the sick and residents of nursing homes where someone just fell ill and â\u0080\u009ctheyâ\u0080\u0099re trying to nip it in the bud,â\u0080\u009d Shoham said. Itâ\u0080\u0099s a strict study: The 150 volunteers will be randomly assigned to get either plasma from COVID-19 survivors that contains coronavirus-fighting antibodies or regular plasma, like is used daily in hospitals, that was frozen prior to the pandemic. Scientists will track if thereâ\u0080\u0099s a difference in who gets sick. It if works, survivor plasma could have important ramifications until a vaccine arrives â\u0080\u0094 raising the prospect of possibly protecting high-risk people with temporary immune-boosting infusions every so often. â\u0080\u009cTheyâ\u0080\u0099re a paramedic, theyâ\u0080\u0099re a police officer, theyâ\u0080\u0099re a poultry industry worker, theyâ\u0080\u0099re a submarine naval officer,â\u0080\u009d Shoham ticked off. â\u0080\u009cCan we blanket protect them?â\u0080\u009d The new coronavirus has infected more than 7 million people worldwide and killed more than 400,000, according to official tallies believed to be an underestimate. With no good treatments yet, researchers are frantically studying everything from drugs that tackle other viruses to survivor plasma â\u0080\u0094 a century-old remedy used to fight infection before modern medicines came along. The historical evidence is sketchy, but convalescent plasmaâ\u0080\u0099s most famous use was during the 1918 flu pandemic, and reports suggest that recipients were less likely to die. Doctors still dust off the approach to tackle surprise outbreaks, like SARS, a cousin of COVID-19, in 2002 and the 2014 Ebola epidemic in West Africa, but even those recent uses lacked rigorous research. When the body encounters a new germ, it makes proteins called antibodies that are specially targeted to fight the infection. The antibodies float in plasma â\u0080\u0094 the yellowish, liquid part of blood. Because it takes a few weeks for antibodies to form, the hope is that transfusing someone elseâ\u0080\u0099s antibodies could help patients fight the virus before their own immune system kicks in. One donation is typically divided into two or three treatments. And as more people survive COVID-19, there are increasing calls for them to donate plasma so thereâ\u0080\u0099s enough of a stockpile if it pans out. In addition to traditional infusions, donations can be combined into a high-dose product. Manufacturer Grifols is producing doses of that â\u0080\u009chyperimmune globulinâ\u0080\u009d for a study expected to start next month. Convalescent plasma seems safe to use, Dr. Michael Joyner of the Mayo Clinic reported last month. His team tracked the first 5,000 plasma recipients in a Food and Drug Administration-sponsored program that helps hospitals use the experimental treatment, and found few serious side effects. Does it help recovery? A clue comes from the first 39 patients treated at New Yorkâ\u0080\u0099s Mount Sinai Hospital. Researchers compared each plasma recipient to four other COVID-19 patients who didnâ\u0080\u0099t get plasma but were the same age, just as sick and being given the same amount of oxygen. People who received plasma before needing a ventilator were less likely to die than non-plasma recipients, said Dr. Sean Liu, the studyâ\u0080\u0099s lead author. â\u0080\u009cWe really tried to target patients who were early in their course, preferably within the first one to two weeks of their disease,â\u0080\u009d Liu said. â\u0080\u009cBeing a doctor during this time, you just feel helpless,â\u0080\u009d Liu added, stressing that more rigorous study was needed but he was glad to have tried this first-step research. â\u0080\u009cWatching people die is, itâ\u0080\u0099s heartbreaking. Itâ\u0080\u0099s scary and itâ\u0080\u0099s heartbreaking.â\u0080\u009d But results of the first strictly controlled study were disappointing. Hospitals in the hard-hit Chinese city of Wuhan were comparing severely ill patients randomly assigned to receive plasma or regular care, but ran out of new patients when the virus waned. With only half of the 200 planned patients enrolled, more plasma recipients survived but researchers couldnâ\u0080\u0099t tell if it was a real difference or coincidence, according to a report in the Journal of the American Medical Association last week. The real proof will come from ongoing, strict studies that compare patients assigned to get either survivor plasma or a dummy treatment. Further complicating the search for answers, COVID-19 survivors harbor widely varying levels of antibodies. And while researchers want to use what Hopkinsâ\u0080\u0099 Shoham calls â\u0080\u009cthe high-octane stuff,â\u0080\u009d no one knows the best dose to test. â\u0080\u009cAbout 20% of recovered patients and donors have very strong immunity,â\u0080\u009d estimated Dr. Michele Donato of Hackensack University Medical Center, who is studying how long they retain that level of protection. Those are the people researchers want to become repeat donors. â\u0080\u009cItâ\u0080\u0099s, I think, our job as humans to step forward and help in society,â\u0080\u009d said Aubrie Cresswell, 24, of Bear, Delaware, who has donated three times and counting. One donation was shipped to a hospitalized friend of a friend, and â\u0080\u009cit brought me to tears. I was like, overwhelmed with it just because the family was really thankful.â\u0080\u009d"}]}