{"article": [{"url": "https://www.marketwatch.com/story/texas-supreme-court-blocks-houstons-plan-to-send-out-unsolicited-mail-ballot-applications-01602086712", "published": 1602072800.0, "headline": "Texas Supreme Court blocks Houstonâ\u0080\u0099s plan to send out unsolicited mail ballot applications", "body": "Harris County election clerk Nora Martinez, left, helps a voter, in Houston. The Texas Supreme Court ruled Wednesday that 2 million Houston voters cannot receive unsolicited mail ballot applications from local elections officials who are dramatically expanding ways to vote in November in the nation's third-largest county, a key battleground in Texas. AP Photo/David J. Phillip File AUSTIN, Texas (AP) â\u0080\u0094 The Texas Supreme Court ruled Wednesday that 2 million Houston voters cannot receive unsolicited mail ballot applications from local elections officials who are dramatically expanding ways to vote in November in the nationâ\u0080\u0099s third-largest county, a key battleground in Texas. The decision by the all-Republican court is the latest defeat in a string of losses for Democrats whose efforts to change Texas voting laws during the coronavirus pandemic have largely failed. Polls show unusually tight races this year in Americaâ\u0080\u0099s biggest red state, intensifying battles over voting access. Texas is one of just five states not allowing widespread mail-in voting this year. Republican Gov. Greg Abbott has resisted calls to expand eligibility and courts have sided with GOP leaders who say fear of catching COVID-19 doesnâ\u0080\u0099t qualify voters for mail-in ballots. Abbott also continues facing lawsuits, including one filed Wednesday by the Texas NAACP, over his decision last week that barred Texasâ\u0080\u0099 254 counties from operating more than one drop-off box for absentee ballots, which forced the closure of dozens of drop-off sites in Harris County and other Democratic-led counties. Mail voting in Texas is generally limited to voters who are 65 years old or older, or who have a disability. In the ruling, the justices sidestepped the issue of whether mail-in voting was safer in the pandemic, ruling instead that current Texas law wouldnâ\u0080\u0099t allow Harris County to send mass ballot applications. â\u0080\u009cThe question before us is not whether voting by mail is good policy or not, but what policy the Legislature has enacted. It is purely a question of law,â\u0080\u009d the court wrote in its ruling. Democrats, who believe this yearâ\u0080\u0099s election is their biggest opportunity in Texas in decades, slammed the decision. â\u0080\u009cOnce again, the all-Republican Texas Supreme Court steps into this election against the interests of voters and a functioning democracy,â\u0080\u009d said Gilberto Hinojosa, chairman of the Texas Democratic Party. The case is among several significant battles over voting in Texas that are still playing out in courts with four weeks until Nov. 3. An appeals court reversed a federal judgeâ\u0080\u0099s decision to reinstate straight-ticket voting in Texas, which Democrats had sought over concerns of voters waiting in long lines on Election Day during the pandemic, particularly in large counties that have longer ballots. Abbott had also faced a lawsuit from within his own party over his decision to extend early voting by six days, part of an extraordinary backlash the governor has faced from the right wing of the GOP over his handling of the pandemic. In a separate order Wednesday, the Texas Supreme Court rejected that effort to scale back early voting, saying the challenge came too close to the election. The weekslong battle over whether mail-in ballot applications can be proactively sent to every registered voter in Texasâ\u0080\u0099 most populous county has not appeared to dampen interest in the option. More than 200,000 voters around Houston have already requested a mail-in ballot, roughly double the number in a typical presidential election year, said Susan Hays, an attorney for Harris County. Houston is a stronghold for Democrats, but the surrounding county still includes GOP-held seats that are helping keep Republicans in power in Texas. Democrats are most energized by their chances of winning a majority in the Texas House for the first time in 20 years, needing to flip just nine seats to take over the chamber. Harris County officials are implementing a $27 million plan to expand voting access by tripling the number of early voting centers â\u0080\u0094 including seven that will be open 24 hours for an entire day â\u0080\u0094 and adding more polling locations on Election Day. Like other cities with NBA teams, the Houston Rocketsâ\u0080\u0099 home arena, the Toyota Center, will also be used as a polling location."}]}