{"article": [{"url": "https://www.marketwatch.com/story/expect-violently-flat-markets-but-be-ready-to-buy-the-dip-analyst-says-2020-06-15", "published": 1593939680.0, "headline": "Expect 'violently flat' markets, but be ready to buy the dip, analyst says", "body": "Markets may have sold off in response to a resurgence in COVID-19 cases as local economies begin to re-open, but one analyst thinks it's a buying opportunity, not a reason to retreat. As long as new cases don't significantly strain the health care system, and Americans don't lose their nerve and return to hunkering down at home, Evercore ISI's Dennis DeBusschere thinks markets could be in for a \"sharp rebound,\" and his team has designed a portfolio of stocks designed to benefit from it. In the near term, however, he expects \"violently flat markets.\" \"A significant COVID second wave would continue to drive asset prices lower, but with vaccine development continuing, little correlation between economic re-openings and increased case growth and hospitalization data at the national level,\" investors should consider dips as a buying opportunity, DeBusschere said in a note out Monday. Related:The next 10% up in the S&P 500 is all about the pandemic recovery - and it's doable, this analyst says Some assumptions are key to this thesis. For one, Evercore research currently shows \"plenty of ICU capacity in every state\" - but that could change, referring to intensive care units. Also, the firm's base case is for another fiscal package later in the summer, for as much as $1-1.5 trillion. But the give-and-take between governments trying to dampen unsafe activities even as Americans keep trying to return to normal, in DeBusschere's word, \"is a risk that will help keep volatility high and markets violently flat near term.\" iframe.twitter-tweet { width: 100% !important; } That means investors may keep rotating between factors - like swapping exposure to risk-on strategies like value for risk-off ones like earnings quality - he said. Still, one small piece of evidence that the path for stocks may be gradually up over the coming months, rather than down, is that Evercore's \"recovery\" portfolio of stocks - those that will benefit from a positive economic outcome - is beating its \"quarantine\" portfolio. The recovery portfolio includes names from Apple Inc. AAPL, +1.74%  to Zions Bancorp ZION, -1.75%, with exposure to some of the areas that have been beaten down over the past few months, as investors stuck with proven winners. It includes Delta Airlines Inc. DAL, +0.39%  , United Airlines Holdings Inc. UAL, +0.32%  , and Walt Disney Co., DIS, +1.53%  for example, as well as energy plays like Concho Resources Inc. CXO, -1.22%  and Frontline Ltd. FRO, -1.45%  But it also features some of the names investors have favored through the recent disruption, and are likely to continue to benefit, like UnitedHealth UNH, +1.68%  and Amazon.com AMZN, +3.01%. See:Wall Street's road warriors have spent the past three months grounded. How's that working out?"}]}