{"article": [{"url": "https://www.marketwatch.com/story/the-mandalorian-returns-but-what-other-streaming-picks-are-worth-paying-for-in-october-2020-2020-09-28", "published": 1601810420.0, "headline": "'The Mandalorian' returns, but what other streaming picks are worth paying for in October 2020?", "body": "Baby Yoda is coming back. Disney+ will launch the second season of its flagship series, \"The Mandalorian,\" on Oct. 30. It's without a doubt the most anticipated streaming series of the year, and with good reason: In addition to driving tens of thousands of new subscribers to the Walt Disney Co.'s DIS, +1.53%  streaming service, it's also a whole lot of fun to watch. But aside than that, there aren't a lot of compelling new streaming offerings next month, making October perhaps a good time for budget-minded consumers to cut back on their subscriptions. As this column has previously mentioned, consumers can take full advantage of cord-cutting by capitalizing on the ability to add and drop streaming services each month, and all it takes is good planning and timing. Remember, a billing cycle starts when you sign up, not necessarily at the beginning of each month. Consumers can also take advantage of deals for free streaming trials, as Disney+ and Apple TV+ in particular focus on building subscriber bases rather than growing revenue (for now, at least). You're never going to get a better deal than free, and the offers won't last forever. In addition to the new Apple One subscription bundle, for example, you can still get a year of Apple TV+ for free when you purchase a new Apple AAPL, +1.74%  device, and Verizon VZ, +0.23%  offers a free bundle of Disney+, Hulu and ESPN+ for some wireless customers. Free and bundled possibilities aside, when it's time to decide where your subscription dollars should go, What's Worth Streaming is here to help. We rate each major streaming service every month as a \"play,\" \"pause\" or \"stop,\" similar to investment analysts' ratings of buy, hold and sell, and pick the best content to help you make your monthly decisions. Here's a look at what's coming to the various streaming services in October 2020, and what's really worth the monthly subscription fee.Disney+ ($6.99 a month) Forget Halloween, Disney+ is all about space in October. \"The Mandalorian\" kicks off its second season at the end of the month, but before that, there's the reboot of \"The Right Stuff\" (Oct. 9). The miniseries, made by NatGeo, is based on the classic Tom Wolfe book, which in turn was made into the Oscar-winning 1983 movie. It focuses on the early years of America's space program, as hotshot test pilots compete to become the Mercury astronauts and push the boundaries of human and technological achievement. The miniseries faces a daunting task: The book and the movie were each nearly perfect, and anything less than that will have to be considered a disappointment. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Season 2 of \"The Mandalorian,\" however, seems like a sure thing. The \"Star Wars\" spinoff series, and Disney+'s biggest hit so far, returns on a weekly basis starting Oct. 30. The new season sounds a bit more serialized this time around, as the eponymous bounty hunter (played by Pedro Pascal) and Baby Yoda (sorry Disney, we're not calling it \"The Child\") zip across the galaxy trying to avoid the clutches of the evil Moff Gideon (Giancarlo Esposito). Expect some familiar settings (looks like they make a stop on Tatooine) and new faces (Timothy Olyphant, Rosario Dawson and Termeura Morrison as Boba Fett), as well as the return of some old friends (Carl Weathers and Gina Carano). The first season was a lot of fun, so expect more of the same - the Season 2 trailer looks spectacular. Honestly, \"The Mandalorian\" is one of the most purely enjoyable, escapist shows out there, and yes, it's worth signing up for Disney+ just for it. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Those two shows should have Disney breathing a sigh of relief, as the pandemic forced the delay of some of its most anticipated series and movies into 2021, including the new Marvel series \"The Falcon and the Winter Soldier.\" Another Marvel spinoff series, \"WandaVision,\" appears to still be on track for release later this year. Who's Disney+ for? Families with kids, and hard-core \"Star Wars\" and Marvel fans. For those not in that group, its library is lacking. Play, pause or stop? Play. There aren't many must-see shows anymore. But \"The Mandalorian\" is one, and it works on enough levels that the whole family can enjoy it. And for that matter, \"The Right Stuff\" might be as well.Netflix ($8.99 or $12.99 a month) The best thing coming to Netflix NFLX, +1.43%  in October isn't even a Netflix original. It's the sixth and final season of \"Schitt's Creek,\" the Canadian sitcom that just swept the Emmys. After originally airing on Canadian TV and Pop TV in the U.S. earlier this year, it'll drop on Netflix Oct. 7, joining the previous five seasons that are already available on Netflix. If you're late to the game, \"Schitt's Creek\" is about a wealthy family who find themselves suddenly broke, and must reinvent themselves in a small town they once bought as a joke. It's a lighthearted, feel-good comedy that's well worth checking out. Another one to watch for is \"Rebecca\" (Oct. 21), an adaptation of Daphne du Maurier's classic 1938 novel that was made into an Oscar-winning movie in 1940 by Alfred Hitchcock. Lily James stars as the new wife of a mysterious and wealthy widower (Armie Hammer), who struggles to settle into life at their estate that's haunted by the memory of his deceased wife, thanks in part to the frightening housekeeper Mrs. Danvers (Kristin Scott Thomas). Much like \"The Right Stuff\" on Disney+, \"Rebecca\" has an imposing task to live up to the iconic source material, but the cast is solid and the movies' trailer looks lush and unsettling. It has the potential, at least, to be very good. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Besides those, Netflix will offer up a smattering of Halloween offerings in October, including the ghost story \"The Haunting of Bly Manor\" (Oct. 9) and the Adam Sandler comedy \"Hubie Halloween\"(Oct. 7). Be warned: Last year, Sandler warned that if he was snubbed by the Oscars for his legitimately outstanding performance in \"Uncut Gems,\" he'd make the worst movie ever as revenge. He wasn't even nominated for an Oscar, so...connect the dots. Also see:Here's everything coming to Netflix in October 2020 There are also a handful of new, bingeable shows to get through the next month, including \"Emily in Paris\" (Oct. 2), a comedy-drama series about a Midwestern girl who hopes to make it big in Paris; \"Grand Army\" (Oct. 16), a drama about five teens struggling to succeed at Brooklyn's largest high school; a new batch of \"Unsolved Mysteries\" (Oct. 19); and new seasons of David Letterman's interview show \"My Next Guest Needs No Introduction\" (Oct. 21) and the genial food/travel show \"Somebody Feed Phil\" (Oct. 30). And for pure comfort-watching, there's also the latest season of \"The Great British Baking Show,\" with new episodes every Friday. Who's Netflix for? Fans of buzz-worthy original shows and movies. Play, pause or stop? Play. Netflix is still the king of streaming, and October looks like another strong month for new releases, with a little something for everyone.Amazon Prime Video ($12.99 a month) Amazon's AMZN, +3.01%  offerings, though, appear a bit weak in October (with one big exception). Among new series, the highlight may very well be \"Truth Seekers\" (Oct. 30), a supernatural British comedy about ghost hunters. It comes from the creative team of Simon Pegg and Nick Frost (\"Shaun of the Dead,\" \"Hot Fuzz\") which is highly encouraging. The pair have balanced horror and comedy brilliantly in the past (See: \"Shaun of the Dead\"), and there's potential here for an entertaining series. Prime Video will also drop a quartet of chilling movies from horror factory Blumhouse, with\"Black Box\" and \"The Lie\" (both Oct. 6) followed by\"Evil Eye\" and \"Nocturne\" (both Oct. 13). If you're into scary movies, they may be worth a watch. \"The Lie,\" in particular, looks intriguing, mostly due to its impressive cast - Mireille Enos, Peter Saarsgard and Joey King - along with writer/director Veena Sud. But it also debuted at the Toronto Film Festival two years ago, and that kind of delay should give one pause. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Also see: Here's what's coming to Amazon Prime Video in October 2020 Amazon will also roll out a competition series for Twitch videogame streamers - \"Chasing the Crown: Dreamers to Streamers\" (Oct. 9). Thursday nights starting Oct. 8 will feature NFL football games, and the next two Fridays will see new episodes of the popular (and ultraviolent) superhero satire \"The Boys,\" which concludes its second season on Oct. 9. Those looking for a good binge should also check out fourth and final season of \"Mr. Robot\" (Oct. 6), which aired on cable last year. While some fans were put off by the second season's twists, the cyber-conspiracy show corrected itself nicely in its last two seasons, concluding on a satisfying note. Update: In a late-breaking October surprise, Amazon will launch a \"Borat\" sequel on Oct. 23 - and that could be a very, very big deal (the 2006 Sasha Baron Cohen comedy racked up $262 million worldwide in theaters). The first trailer has dropped, and the sequel looks just as stupid, offensive, cringe-inducing and hilarious as the original. In other words: It's a must-see. iframe.twitter-tweet { width: 100% !important; } Who's Amazon Prime Video for? Movie lovers, TV-series fans who value quality over quantity. Play, pause or stop? (Recommendation has been updated, post-\"Borat\" announcement.) Pause and think it over. While Amazon has an impressive catalog, there's nothing particularly compelling about October's offerings, aside from \"Borat,\" which will be required viewing for some people (you know who you are). Hulu ($5.99 a month or $11.99 with no ads) Hulu's new releases may be even less compelling than Amazon's. Like its rival, Hulu is launching a quartet of horror movies and series just in time for Halloween - \"Monsterland\" (Oct. 2), \"Books of Blood\"(Oct. 7),\"Helstrom\"(Oct. 16) and \"Bad Hair\" (Oct. 23) - none of which looks particularly outstanding. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } The real draw for Hulu in October will be its extensive library and its ability to show network and cable shows the day after broadcast. That will include \"Saturday Night Live\" (Oct. 4), \"The Bachelorette\" (Oct. 14), \"The Voice\" (Oct. 20) and \"Superstore\" (Oct. 23), as well as new episodes of \"Fargo\" and \"Archer\" from FX on Hulu. Also see:Here's what's coming to Hulu in October 2020, and what's leaving Don't forget the just-released second season of \"Pen15,\" a cringe-inducing but heartfelt comedy about the horrors of adolescence. Who's Hulu for? TV lovers. There's a deep library for those who want older TV series, and next-day streaming for many current network and cable shows Play, pause or stop? Pause. Hulu remains the best value in streaming, but with a weak offering of originals in October, you won't miss much by dropping it for a month or so.HBO Max ($14.99 a month) October will bring a ton more movies and a handful of interesting originals to HBO Max. In terms of big names, the top newcomer is \"The Undoing\" (Oct. 25), an HBO miniseries starring Nicole Kidman as a New York therapist whose life spirals out of control amid revelations that her husband (Hugh Grant) may have done some very bad things. With a deep pool of talent (it also co-stars Donald Sutherland, and was written by David E. Kelley and directed by Susanne Bier), there's no excuse for this to be anything but very good. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Also among the highlights: Greg Berlanti's docudrama series \"Equal\"(Oct. 22), about the unsung heroes of the LGBTQ+ rights movement; the \"West Wing\" reunion special \"A West Wing Special to Benefit When We All Vote\" (Oct. 15), in which the cast will perform a live script-reading;\"David Byrne's American Utopia\" (Oct. 17), a film directed by Spike Lee capturing the Talking Heads frontman's critically praised Broadway show; the new documentary\"John Lewis: Good Trouble\" (Oct. 27), about the late Georgia congressman and civil rights icon; and the season finales of a pair of HBO series, \"Lovecraft Country\" and \"The Vow\" (both Oct. 18) There are also dozens of new movies coming to the service, including \"Boogie Nights,\" \"Friday,\" \"Galaxy Quest,\" \"Malcolm X,\" \"The Matrix\" trilogy, and \"When Harry Met Sally\" (all Oct. 1). Who's HBO Max for? HBO fans and movie lovers. Though frustratingly enough, it's still NOT for Roku or Amazon Fire users, since HBO Max owner AT&T Inc. T, -1.01%  has yet to hammer out a deal with the two biggest makers of streaming-TV devices. Play, pause or stop? Stop. If you already get HBO, then by all means explore Max - you're already paying for it. But the lack of Roku and Amazon compatibility makes it hard to recommend Max for most consumers.Peacock (free basic level, $4.99 a month with ads, or $9.99 a month with no ads) The new-ish streaming service from Comcast Corp's. CMCSA, -0.99%  NBCUniversal is fast becoming an appealing option for cord-cutters who still want their network shows. October will see the additions of \"Saturday Night Live's\" entire 45-season library (dates TBA), all eight \"Harry Potter\" movies, and \"Mr. Mercedes\" (Oct. 15), a dark crime drama from David E. Kelley, based on the books by Stephen King. Brendan Gleeson stars as a retired detective who's haunted by an unsolved serial-killing case. The series, which spans three seasons and first ran on the obscure Audience cable network, got good reviews from critics and could be worth a watch. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Two promising late-night talk shows debuted in September - Larry Wilmore's \"Wilmore\" and Amber Ruffin's \"The Amber Ruffin Show\" - and will drop new episodes every Friday in October. Both are smart, funny and timely, and offer a welcome bit of diversity among the late-night offerings. Peacock will also become the exclusive streaming home of the beloved sitcom \"Parks and Recreation\" in October, ending its run on Netflix, Hulu and Amazon Prime Video. It will still be available on Peacock's free tier, though with ads, along with Peacock's other prize: \"The Office.\" Update: Peacock is also drawing ire from some soccer fans for keeping big Premier League matches on the paid, Premium tier of the service, rather than airing them on NBCUniversal's cable channels as they did in the past. But don't expect that to change anytime soon - U.S. fans of English soccer may be forced to pay up if they want to see live matches. Who's Peacock for? If you don't mind ads, the free version of Peacock is great. If you're eligible for Premium through a Comcast or Cox cable subscription, it's also a perfectly fine free addition. Play, pause or stop? Stop. By all means check out the free version (which is now available through Roku devices), but the paid tier will be unnecessary for most people (with the possible exception of soccer fans).Apple TV+ ($4.99 a month) It's getting to be a repetitive criticism - Apple TV+ has some decent things to watch, just not enough of them. But as time goes on, its catalog is indeed getting better and a bit deeper. October will see just two big splashes: the nature documentary\"Tiny World\" (Oct. 2), as narrator Paul Rudd explores small but amazing creatures, and the movie \"On the Rocks\" (Oct. 2), a comedy directed by Sofia Coppola and starring Bill Murray and Rashida Jones. It's getting good reviews, as Jones plays an author with writer's block and a crumbling marriage who reconnects with her father (Murray) while playing detective to find out if her husband (Damon Wayans Jr.) is having an affair. Like many things Apple TV+, it sounds perfectly fine, but not quite compelling enough on its own to jump for a subscription. It shouldn't be long, though, before Apple has enough of those in its catalog to make it worth signing up (among those: the surprisingly delightful \"Ted Lasso.\") div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Who's Apple TV+ for? That's the big question - it offers a little something for everyone, but not enough for anyone, really. Play, pause or stop? Stop. With the shallowest library of any other streaming service and only one or two originals a month, it's still not worth the admittedly low price.CBS All Access ($5.99 a month or $9.99 with no ads) \"Star Trek: Discovery\" was one of CBS All Access' first big shows, and it returns for a third season Oct. 15. While the first two seasons were set about a decade before the original \"Star Trek,\" Season 3 will see the crew of the USS Discovery travel 900 years into the future, as they try to reverse a galactic cataclysm. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Meanwhile, the first season of \"Discovery\" is airing on CBS this fall, as the broadcast network hopes to lure new fans to the streaming service. All Access (soon to be Paramount+ - long story, we'll talk about that another time) also has NFL football on Sundays, as well as a growing catalog of shows from ViacomCBS VIAC, -2.34%  cable networks. Who's CBS All Access for? Cord-cutters who miss network TV and sports. Play, pause or stop? Stop. There's still not enough to justify the price.Quibi ($4.99 a month with ads, $7.99 a month with no ads) Forget wondering if Quibi is worth paying for (it's not, still), the question now is, will it even exist in a couple of months? The troubled short-form streaming service is reportedly looking for a buyer just six months after launching, after failing to meet subscriber and advertising targets. Some experts say the service's underlying technology - particularly its ability to flip screen proportions vertically or horizontally - is worth more than its content (which Quibi doesn't even own, it just licenses), leading to the very real possibility that we won't have Quibi - ahem, pardon, Emmy-winning Quibi - to kick around for much longer. But while it's still here, Quibi has a few dramatic offerings for October: \"Last Looks\" (Oct. 12), about true crimes that rocked the fashion world; \"Murder Unboxed\" (Oct 19), another true-crime series delving into real case evidence; and \"The Expecting\" (Oct. 5), a horror series about a mysterious pregnancy. Who's Quibi for? Some bigger company that wants its underlying technology, most likely. Play, pause or stop? Stop. Save your money. Just not nearly enough quality for the price, and who knows how much longer Quibi will be around."}]}