{"article": [{"url": "https://www.marketwatch.com/story/us-recoups-65-million-jobs-in-may-but-rehiring-set-to-slow-amid-fresh-coronavirus-outbreak-2020-07-07", "published": 1594123760.0, "headline": "U.S. recoups 6.5 million jobs in May, but hiring set to slow amid new coronavirus outbreak", "body": "The numbers: A record 6.5 million people either found jobs or were rehired in May, a government report shows, as the economy emerged from a prolonged shutdown due to the coronavirus pandemic that drove the U.S. into a deep recession. Yet the increase in hiring in May only partial recouped the tens of millions of jobs lost in March and April, while a fresh outbreak of the virus in the states that reopened the earliest could prevent more people from going back to work anytime soon. iframe.twitter-tweet { width: 100% !important; } Job openings also rose to 5.4 million in May from 5 million in the prior month, according to a Labor Department report that’s released with a one-month delay. The number of jobs available was running around 7 million before the pandemic. The number of layoffs and firings fell to 1.8 million in May from 7.7 million in April and 11.5 million in March — the biggest back-to-back job losses by far in U.S. history. What happened: Hotels and restaurants rehired 763,000 workers in May, but employment is still well below precrisis levels. Travel almost came to a halt in the early stages of the viral outbreak and restaurants were only allowed to sell takeout and delivery. Health-care providers and social-service organizations also added 479,000 jobs. Dentists and doctor’s offices reopened in May as states began to ease lockdown restrictions and people returned for badly needed services. Employment in the construction industry increased by 427,000. Sales of new homes have bounced back because of extremely low interest rates even though the economy has been depressed. Similarly, job openings increased the fastest at hotels, restaurants, construction firms and retailers. Job openings fell in the federal government, education and information — newspapers, magazines, advertising agencies and the like. Even with readership soaring, media outlets have struggled to retain advertisers given widespread economic destruction and business losses. The share of people who left jobs on their own, known as the quits rate, rose to 1.8% from 1.6% among private-sector employees. That’s less than half a recent peak of 3.2% less than one year ago, however. Fewer people are willing quit a secure or semi-secure job in the middle pandemic. Read:U.S. regains 4.8 million jobs in June. Is rehiring poised to slow? The big picture: The pandemic destroyed at least 22 million jobs in the first two months of the viral outbreak, at least temporarily. Although the economy has rebounded in May and June, the momentum will be hard to sustain in the face of another wave of COVID-19 cases. Read:Manufacturers come back strong in June, but ‘it’s a slow recovery at this point’ Companies might be slow to rehire until they get a better sense of how quickly the economy recovers. And many jobs are unlikely to ever come back as companies reconfigure how and where their employees work. Many economists prediction the unemployment rate will linger around 10% of higher through the end of the year. The jobless rate slipped to 11.1% in June from 13.3%. Read:U.S. entered recession in February after end of longest expansion in history What they are saying? ““It is not surprising that the data from May show the beginning of a bounceback for the labor market,” said Nick Bunker, director of research at indeed Hiring Lab, “but employer demand for working moving forward is still depressed, as job openings are still down 23% compared to where they were in February.” Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% fell in Tuesday trades."}]}