{"article": [{"url": "https://www.marketwatch.com/story/the-pandemic-is-causing-women-to-drop-out-of-the-workforce-heres-what-it-will-take-to-get-them-back-11602195189", "published": 1602223760.0, "headline": "The pandemic is causing women to drop out of the workforce â\u0080\u0094 hereâ\u0080\u0099s what it will take to get them back", "body": "Women ages 25-44 are more than three times as likely as men not be working due to childcare demands during the pandemic, according to a report by the Federal Reserve and U.S. Census Bureau (Photo by Ethan Miller/Getty Images) Getty Images The Pregnancy Discrimination Act of 1978, the introduction of birth control, paid family leave, anti-sexual harassment laws and rising wages were just some of the factors that drove masses of American women to enter the workforce in the 1970s. More women continued to enter the workforce through the late 1990s, though at a much slower rate than in prior decades. Still, American women came a long way from the early 1950s, when 30% of them were in the workforce, to the late 1990s when 60% of them were in it. But the pandemic is starting to undo decades of progress as record amounts of women leave the workforce. In February, the labor force participation rate for women, a measure of the share of women working or looking for a job, was 57.8%. By April, that rate declined to 54.7%, according to the Bureau of Labor Statisticsâ\u0080\u0099 data.Â Rates increased in June to 56.1%, but by September they fell to 55.6%, the lowest reading since 1987 apart from April and May, the New York Times reported. â\u0080\u009cItâ\u0080\u0099s upsetting to see these changes happen so fast over the past six months,â\u0080\u009d said Kate Bahn, director of labor market policy and economist at the Washington Center for Equitable Growth, a nonprofit research and grant-making group. In prior recessions, parents with school-aged children, in particular, who were laid off from their jobs could apply and interview for a new position while their child attended school or daycare.Â But not in the age of coronavirus.Â â\u0080\u009cChild care needs and the uncertainty about the future of the American economy are making it hard to even begin the process of searching for a new job,â\u0080\u009d Bahn told MarketWatch.The child care dilemmaÂ Many schools across the country have started off the school year with virtual instruction, which for many parents means essentially home-schooling their children.Â One in five working adults said the reason they stopped working â\u0080\u009cwas because COVID-19 disrupted their childcare arrangements,â\u0080\u009d according to an August report published by the Census Bureau and the Federal Reserve. â\u0080\u009cOf those not working, women ages 25-44 are almost three times as likely as men to not be working due to childcare demands,â\u0080\u009d the report states.Â As a result, many jobless parents have put off applying for work altogether.Â Last month, a total of 4.5 million Americans reported that they had not looked for work in the last four weeks, according to Bureau of Labor Statistics data. Women are the majority of these workers. “ â\u0080\u0098Of those not working, women ages 25-44 are almost three times as likely as men to not be working due to childcare demandsâ\u0080\u0099 ” By definition, these workers are not considered unemployed because they did not actively look for work in the past four weeks and therefore are not factored into the unemployment rate. However, they may still qualify for unemployment benefits due to provisions in the CARES Act. Among prime-age workers (people between ages 25 to 54) women account for 63% of unemployed people in the U.S. who did not actively look for work during the last four weeks. â\u0080\u009cHistorically, women have largely been responsible for child care and tend to earn lower wages than men,â\u0080\u009d said Stephanie Aaronson, a former Fed researcher who is now at the Brookings Institution, a left-leaning think tank based in Washington, D.C. For those reasons, in opposite-sex relationships, women are more likely to drop out of the workforce, she added. When women drop out of the workforce, itâ\u0080\u0099s not just their families that are put at a disadvantage, but the overall U.S. economy, Nicole Mason, president of the Institute for Womenâ\u0080\u0099s Policy Research, which advocates for more womenâ\u0080\u0099s rights at home and in workplaces. Women make up almost half the workforce, she said. â\u0080\u009cIf they stop working, thatâ\u0080\u0099s income and earnings that donâ\u0080\u0099t get pumped back into the economy.â\u0080\u009d â\u0080\u009cThe economy grows faster when more women participate in the workforce,â\u0080\u009d Aaronson said. â\u0080\u009cOur potential output is higher, and we can more easily support the government through income taxes and raise more money to fund Social Security.â\u0080\u009d “ â\u0080\u0098Women make up more than half the workforce. If they stop working, thatâ\u0080\u0099s income and earnings that donâ\u0080\u0099t get pumped back into the economyâ\u0080\u0099 ” â\u0080\u0094 Nicole Mason, president of the Institute for Womenâ\u0080\u0099s Policy Research That, among other reasons, is why itâ\u0080\u0099s so important that women return to the workforce. But it will likely require significant structural changes to bring women back into the workforce.Â More affordable and accessible child care will be key to bringing women back into the workforce, experts say Even before the pandemic the cost of child care, both center-based and home-based, were consistently rising year over year.Â Now parents could be looking at even higher costs of child care. Some 35% of child-care centers and 21% of family child-care programs in the country remained closed as of July even after some restrictions were lifted, a report published by the nonprofit Child Care Aware of America, which advocates for access to affordable child care, found.Â Centers that remain open could become more costly due to factors such as reduced capacity necessitated by physical distancing, supplies including personal protective equipment, training on new safety measures and communication of protocols to employees and parents. In European Union countries, child care and paid family leave are both treated as public goods, meaning they are funded through taxes. Thatâ\u0080\u0099s made it possible for a greater share of women to participate in the workforce, Aaronson said. But more European women tend to work part-time and â\u0080\u009cdonâ\u0080\u0099t progress as much in their careers,â\u0080\u009d she added. â\u0080\u009cIn the U.S., there are more women in management positions who tend to work full-time.â\u0080\u009d In the U.S., child care is means-tested, meaning that lower-income families receive higher subsidies to cover the cost of child care.Â That said, families making under $1,500 a month shelled out nearly 40% of their income to child-care. â\u0080\u009cWe as a country should think thatâ\u0080\u0099s unacceptable,â\u0080\u009d Mason said. â\u0080\u009cChild care needs to be accessible, cost-effective and high quality for families across all income levels,â\u0080\u009d she said. Mason said sheâ\u0080\u0099s in favor of making child care a public good so that fewer families have to question whether their child is safe and if they can afford to work because of the cost of child care.Job training In addition to the child care dilemma women are facing, jobs within the child care and education sector, which women disproportionately hold compared to men, have also vanished during the pandemic.Â Many of the industries that have been hit hardest by the pandemic â\u0080\u0094 leisure and hospitality, government, food services and retail â\u0080\u0094 also disproportionately employed women. “ â\u0080\u0098Itâ\u0080\u0099s clear some companies are planning for a future where with or without a vaccine people travel less. It will be much more difficult for women to reenter the workforce if their jobs disappeared.â\u0080\u0099 ” Some of those industries could bounce back once a vaccine is available and widely distributed, and once schools reopen for in-person instruction â\u0080\u009csome women will start trickling back into the workforce,â\u0080\u009d Aaronson said. However, â\u0080\u009cthe economy is currently undergoing structural changes,â\u0080\u009d which could leave many women permanently unemployed. â\u0080\u009cItâ\u0080\u0099s clear some companies are planning for a future where with or without a vaccine, people travel less. It will be much more difficult for women to reenter the workforce if their jobs disappeared. We need programs to help both women and men adjust to a new landscape.â\u0080\u009d Itâ\u0080\u0099s particularly important that both men and women partake in the same programs so that women arenâ\u0080\u0099t â\u0080\u009cmommy-trackedâ\u0080\u009d. Meaning that once the economy springs back from the coronavirus induced-recession, in the next inevitable recession women wonâ\u0080\u0099t necessarily be more vulnerable than men in terms of job security.Â Thereâ\u0080\u0099s a huge role for community college and vocational schools to play in this next chapter to help figure out the best industries to pivot to next and gain the necessary skills to work in them, Aaronson said."}]}