{"article": [{"url": "https://www.marketwatch.com/story/nvidias-server-business-eclipses-gaming-chips-for-first-time-as-earnings-forecast-blow-away-expectations-2020-08-19", "published": 1597907960.0, "headline": "Nvidiaâ\u0080\u0099s server business eclipses gaming chips for first time, though maybe not for long", "body": "Nvidia Corp.â\u0080\u0099s data-center chips brought in more money than the gaming specialistâ\u0080\u0099s core business for the first time in the companyâ\u0080\u0099s second quarter, but new gaming chips amid a pandemic-influenced boom in videogames are expected to flip that back around and produce even more record sales. Nvidia NVDA, -0.54% Â reported $1.75 billion in data-center sales in the second quarter Wednesday, more than double last yearâ\u0080\u0099s total of $655 million and ahead of the average analyst expectation of $1.71 billion. The data-center segment is especially important to investors after Nvidia announced its latest Ampere-architecture-based offering for servers earlier this year. It was also the first full quarter that Nvidiaâ\u0080\u0099s Mellanox Technologies acquisition, which closed in April, contributed to revenue. On a conference call, Chief Financial Officer Collette Kress said that Mellanox contributed about 14% of total revenue and more than 30% of data-center revenue, and â\u0080\u009cwas a critical part of several of our major new product introductions this quarter.â\u0080\u009d Gaming sales rose more than expected in the second quarter, totaling sales of $1.65 billion after posting revenue of $1.31 billion a year ago. The average Wall Street estimate called for sales of $1.41 billion. It was the first time data-center sales eclipsed gaming sales for the company, though that trend may not last â\u0080\u0094 Nvidia is expected to announce a new line of Ampere gaming chips at a Sept. 1 event, and expectations for the gaming segment in the third quarter are high. â\u0080\u009cI think this may very well be one of the best gaming seasons ever,â\u0080\u009d Chief Executive Jensen Huang said on the conference call. â\u0080\u009cWeâ\u0080\u0099re already seeing amazing numbers from our console partner Nintendo.â\u0080\u009d In an interview with MarketWatch after the conference call, Kress said that gaming is expected to surpass data center in the current quarter amid back-to-school and early holiday sales of gaming PCs and Nintendo Co. Ltd.â\u0080\u0099s NTDOY, -0.10% manufacturing of Switch consoles for the holidays. It could be a close race, however. â\u0080\u009cGaming is growing faster sequentially than data center in the next quarter. In our second quarter, DC surpassed gaming â\u0080¦ [but] it will likely be gaming as we move into Q3,â\u0080\u009d she said For the third quarter, Nvidia expects record revenue of $4.31 billion to $4.49 billion, while analysts had forecast sales of $3.97 billion. In addition to a big console ramp-up, Huang said that the COVID-19 pandemic has driven more people to videogames as a source of entertainment. â\u0080\u009cWith all thatâ\u0080\u0099s happening around the world, and itâ\u0080\u0099s really unfortunate, but itâ\u0080\u0099s made gaming the largest entertainment medium in the world,â\u0080\u009d Huang said on the call. â\u0080\u009cThe thing that people havenâ\u0080\u0099t realized about videogames is that itâ\u0080\u0099s not just a game itself anymore,â\u0080\u009d Huang said. â\u0080\u009cYouâ\u0080\u0099re spending time with your friends. Youâ\u0080\u0099re using it to create, to realize your imaginations. People are using it for broadcast, for sharing ideas and techniques with other people, and then of course itâ\u0080\u0099s just an incredibly fun way to spend time.â\u0080\u009d Nvidia has rocketed to a record $300 billion-plus valuation this year, easily surpassing former Silicon Valley semiconductor king Intel Corp. INTC, -1.03% Â , on hopes for its videogame chips and server offerings. For more: Nvidia is officially not just a gaming company anymore Nvidia reported fiscal second-quarter net income of $622 million, or 99 cents a share, compared with $552 million, or 90 cents a share, in the year-ago period. Adjusted earnings, which exclude stock-based compensation expenses and other items, were $2.18 a share, compared with $1.24 a share in the year-ago period. Revenue rose to $3.87 billion from $2.58 billion in the year-ago quarter. Analysts surveyed by FactSet had forecast earnings of $1.97 a share on revenue of $3.65 billion. Kress said the company expects sequential gains of 25% in gaming sales and low-to-mid single digits in data-center sales in the third quarter. Analysts expect $1.7 billion in gaming sales, or 3% higher than second-quarter levels, and $1.77 billion in data-center sales, or 1% higher than those reported in the second quarter. Shares declined about 1% in after-hours trading, after a recent prolonged run to record highs. The stock declined 1% to $485.54 in the regular trading session to come up short of Mondayâ\u0080\u0099s record close of $493.48. For the year, Nvidia shares have gained 106%, while the PHLX Semiconductor Index SOX, +1.77% has risen 19%, the S&P 500 index SPX, +0.87% Â has advanced 4.5%, and the Nasdaq Composite Index COMP, +1.39% Â has gained 24%."}]}