{"article": [{"url": "https://www.marketwatch.com/story/feds-george-not-in-a-rush-to-change-guidance-for-markets-about-future-path-of-interest-rates-2020-08-26", "published": 1598442380.0, "headline": "Too soon to decide what more the Fed can do for economy, George says", "body": "It is too soon to know what additional steps the Federal Reserve can take to help the economy continue to recover from the sudden lock down in March and April, said Kansas City Fed President Esther George on Wednesday. “I think it is too soon to try to speculate on what else the might be needed, other than to say the Federal Reserve is going to be very vigilant on that and be prepared to respond,” George said in an interview on CNBC. George is the host of the annual Jackson Hole economic symposium that will be held solely on-line this year on Thursday and Friday and open to the public on the regional Fed bank’s YouTube channel. The agenda for the conference will be released later Wednesday. Fed Chairman Jerome Powell will open the conference at 9am ET Thursday. Read:Powell is speaking Thursday, here is what to expect Several top foreign central bankers are also scheduled to speak, including the governor of the Bank of England and the top economist at the European Central Bank. Read: Besides Powell, what else will be interesting for investors at Jackson Hole The Fed has cut its policy interest rate to zero and is now buying $120 billion per month of Treasury securities and mortgage-related securities to support the economic slump resulting from the coronavirus pandemic. The central bank has also launched a dozen programs to lend funds to help specific sectors, including small business. Since the late spring, Wall Street economists have thought the next monetary policy easing step for the Fed would be to clarify for markets how long it intends to keep interest rates at zero. The conventional wisdom was that this change would come at the Fed’s Sept. 16-17 meeting. Since the pandemic, the Fed has said that it would keep interest rates low until the economy regains its footing. Fed watchers think the Fed might strengthen this statement and say it will keep rates low until specific economic conditions are met, such as a lower unemployment rate. The central bank has also mulled setting a calendar date. George’s comments, combined with remarks from other Fed officials and the minutes of the central bank’s July meeting, released earlier this month, suggest the strengthening of the “foward guidance” may be put off until later this year. After all, markets don’t expect a rate hike. “The minutes somewhat diminished our conviction that the Fed will refine its forward guidance next month,” said Michael Gapen, chief U.S. economist at Barclays, in a note to clients. “With market expectations of the policy rate still close to zero throughout the medium term, the minutes suggest that the committee does not feel much urgency to adjust its pledge to maintain the existing target range for the policy rate ‘until it is confident that the economy has weathered recent events and is on track to achieve its maximum employment and price stability goals’,” he said. George sat down for a series of one-on-one interviews ahead of the conference and repeated that it was too soon for the Fed to take more steps. “I think we are beginning to see signs of a recovery, we’re beginning to see where the economy has shortfalls, and where it may be doing ok, but that is going to take some time,” George said, in an interview with Bloomberg News. Thinking about what further steps might help the economy has been a “useful discussion,” but “whether to activate those things is something we’ll be debating,” she added. In her interview with CNBC, George said her baseline forecast was for the economy to continue to improve over the rest of the year. She stressed the path of the economy depended in large measure on the course of the coronvirus. George also called the possibility of a double-dip recession “an important risk.” Congress has delayed further coronavirus fiscal relief and allowed federal unemployment benefits to expire. The outlook for more fiscal support for the economy is likely to be a key role in the Fed’s policy deliberations next month. George said fiscal policy, along with Fed policy, was critical in allowing households and businesses to survive the pandemic so far."}]}