{"article": [{"url": "https://www.marketwatch.com/story/ges-stock-falls-off-a-cliff-after-wells-notice-disclosure-2020-10-06", "published": 1602053600.0, "headline": "GEâ\u0080\u0099s stock falls off a cliff after â\u0080\u0098Wells noticeâ\u0080\u0099 disclosure", "body": "Shares of General Electric Co. took a sudden dive Tuesday afternoon, after the industrial conglomerate disclosed that the Securities and Exchange Commission is considering civil action against the company for possible securities law violations. The SEC has been conducting an investigation of GEâ\u0080\u0099s revenue recognition practices and internal accounting controls over financial reporting related to long-term service agreements. The SEC expanded the scope of the investigation after GE GE, +2.85% Â said in January 2018 that it was taking a multibillion charge following a review of GE Capital insurance portfolio. The investigation was expanded again after the company announced in October 2018 another multibillion charge related to its power business. See related: Investors who paid attention to GEâ\u0080\u0099s accounting saw trouble coming. In an 8-K filing with the SEC at 2:00 p.m. Eastern, GE said that on Sept. 30, the SEC staff issued a â\u0080\u009cWells noticeâ\u0080\u009d advising the company that it was considering a recommendation that the SEC bring a â\u0080\u009ccivil injunctive actionâ\u0080\u009d against GE for possible violations of securities laws. FactSet, MarketWatch The stock was up about 1.6% just before the 8-K was filed, then fell off a cliff on heavy volume to sink as much as 4.5% at about 2:31 p.m., before paring some losses. The stock closed down 3.7% at $6.17, above the intraday low of $6.11. Trading volume ballooned to 169.1 million shares, enough to make it the most actively traded stock listed on the New York Stock Exchange, and well above the full-day average of about 101.2 million shares. â\u0080\u009cGE has been informed that the issues the SEC staff may recommend that the SEC pursue relate to the historical premium deficiency testing for GE Capitalâ\u0080\u0099s runoff insurance operations, as well as GEâ\u0080\u0099s disclosures relating to such runoff insurance operations,â\u0080\u009d GE said in a statement. â\u0080\u009cThe staff has not made a preliminary decision whether to recommend any action with respect to the other matters under investigation.â\u0080\u009d GE stressed in the 8-K filing that a Wells notice is â\u0080\u009cneither a formal allegation nor a finding of wrongdoing.â\u0080\u009d The company said it is allowed the opportunity to provide its perspective and to address the issues raised by the SEC staff before any decision is made regarding the commencement of enforcement proceedings. GEâ\u0080\u0099s stock has tumbled 44.7% year to date, while the SPDR Industrial Select Sector exchange-traded fund XLI, +0.37% Â has slipped 4.4% and the S&P 500 index SPX, +0.87% Â has gained 4.0%."}]}