{"article": [{"url": "https://www.marketwatch.com/story/trump-doesnt-pay-taxes-thats-old-news-the-real-story-is-the-presidents-personal-debts-coming-due-2020-09-28", "published": 1601312060.0, "headline": "Trump doesnâ\u0080\u0099t pay taxes? Thatâ\u0080\u0099s old news. The real story is the presidentâ\u0080\u0099s personal  debts coming due", "body": "When it comes to the Trump presidency, every day is Groundhog Day. We keep hearing the same things over and over again. Weâ\u0080\u0099ve always known that Donald Trump is a billionaire. Forbes magazine puts his net worth at $2.5 billion, making him the 339th-wealthiest person in the U.S. Yet weâ\u0080\u0099ve also known that Trump has a prodigious knack for destroying value. His business career is littered with bankruptcies and failures, most famously his bad timing on Atlantic City casinos as Las Vegas ascended. Itâ\u0080\u0099s a fascinating contrast and makes you wonder how much wealthier the president, now 74, would be if he had been as smart of a businessman. Read:Some wealthy Americans are already prepping their finances for a Joe Biden presidency â\u0080\u0094 hereâ\u0080\u0099s how Such failures help explain Sundayâ\u0080\u0099s New York Times report showing â\u0080\u009cdeep, chronic losses and years of tax avoidanceâ\u0080\u009d by Trump. The report, from leaked documents, say that in 2016, Trump paid only $750 in federal taxes, which is $750 more than he paid in 10 of the 15 years before that. His federal income tax bill from 2000 to 2017 was an annual average of $1.4 million, the Times said. So Trump sometimes doesnâ\u0080\u0099t have to pay taxes? Havenâ\u0080\u0099t we always known this? The Times, after all, reported just last year that in 1987 â\u0080\u0094 when his â\u0080\u009cThe Art of the Dealâ\u0080\u009d hit bookstores â\u0080\u0094 that Trump â\u0080\u009cwas already in deep financial distress, losing tens of millions of dollars on troubled business deals, according to previously unreleased figures from his federal income tax returns.â\u0080\u009d And it was the very same Times reporters who also wrote that much of the money Trump came into earlier in life came via â\u0080\u009cdubious tax schemes,â\u0080\u009d including â\u0080\u009cinstances of outright fraud.â\u0080\u009d So now another report showing that Donald Trump is just another businessman minimizing his taxes? Color me shocked. Trump retreated, saying the Times report is â\u0080\u009cfake news.â\u0080\u009d But Trump himself has previously confirmed he doesnâ\u0080\u0099t pay federal taxes. â\u0080\u009cThat makes me smart,â\u0080\u009d he bragged in 2016. Business skills No, it doesnâ\u0080\u0099t make you smart. And this is why the Timesâ\u0080\u0099 reporting is important. It reinforces my earlier point: Trump simply isnâ\u0080\u0099t a very good businessman. As the Times notes, and this is one of the key sentences: Trump doesnâ\u0080\u0099t pay federal taxes â\u0080\u009clargely because he reported losing much more money than he made.â\u0080\u009d Trump, however, is smart in that he surrounds himself with accountants and tax advisers who know how to minimize his tax liabilities. Thereâ\u0080\u0099s nothing illegal about that. Everybody tries to lower their tax bill. Trump just does so on a large scale. People who canâ\u0080\u0099t stand Trump think the timing of this latest Times blockbuster is great, coming as it does just hours before Tuesday nightâ\u0080\u0099s first debate between the president and former Vice President Joe Biden. Itâ\u0080\u0099s a safe bet that Biden and his handlers are strategizing on how to play this. But so what? When I mentioned earlier that Trump bragged in 2016 about not paying taxes, the comment came during â\u0080\u0094 guess what? â\u0080\u0094 his first debate with Hillary Clinton. She hammered him, saying that avoidance of taxes meant Trump was giving â\u0080\u009czero for troops, zero for veterans, zero for schools, or health.â\u0080\u009d In the split-screen shot, Trump looks furious. In polls, the news that Trump doesnâ\u0080\u0099t pay much, if anything, in federal taxes didnâ\u0080\u0099t really move the needle at the time; I donâ\u0080\u0099t think anyone should expect it to now. Trumpâ\u0080\u0099s supporters donâ\u0080\u0099t trust the New York Times. Voting is already under way in some states, and it may influence the small pool of voters who remain undecided. But the vast majority of Americans made up their minds about the president long ago. Personal debts Sundayâ\u0080\u0099s Times report answered some questions but, as usual, raised new ones. The one that stands out for me is the revelation that the president is personally responsible for â\u0080\u009cloans and other debts totaling $421 million, with most of it coming due within four years.â\u0080\u009d Who are his creditors? What will Trump do to stave them off in coming years? The reason I wonder this stems from my own history. Many years ago, in a prior life, I went to work for the U.S. government at the American embassy in Moscow. During a background check, among the many things that were investigated were my personal finances. You canâ\u0080\u0099t have people with financial problems working in sensitive government jobs for the simple reason that such problems expose them to possible compromise by others. Surely a man in a sensitive job, as Trump is, and is up to his neck in debt, as Trump is, who oddly seems to cozy up to men such as Vladimir Putin could never be compromised or considered any sort of security risk, right? Thatâ\u0080\u0099s the potential danger."}]}