{"article": [{"url": "https://www.marketwatch.com/story/house-approves-bill-to-halt-postal-service-changes-blamed-for-delays-send-25-billion-to-boost-usps-ahead-of-election-2020-08-22", "published": 1598123240.0, "headline": "House approves bill to halt Postal Service changes blamed for delays, send $25 billion to boost USPS ahead of election", "body": "With heated debate over mail delays, the House approved legislation in a rare Saturday session that would reverse recent changes in U.S. Postal Service operations and send $25 billion to shore up the agency ahead of the November election. Speaker Nancy Pelosi had recalled lawmakers to Washington over objections from Republicans who dismissed the action as a stunt. President Donald Trump railed against mail-in ballots, including in a Saturday tweet, and urged a no vote. He has said he wants to block extra funds for the Postal Service. “Don’t pay any attention to what the president is saying, because it is all designed to suppress the vote,” Pelosi said at the Capitol. Pelosi called the Postal Service the nation’s “beautiful thread” connecting Americans and said voters should “ignore” the president’s threats. The daylong session came as an uproar over mail disruptions puts the Postal Service at the center of the nation’s tumultuous election year, with Americans rallying around one of the nation’s oldest and more popular institutions. Millions of people are expected to opt for mail-in ballots to avoid polling places during the coronavirus pandemic. Ahead of voting the president tweeted, “This is all another HOAX.” More than two dozen Republicans broke with the president and backed the bill, which passed 257-150. Democrats led approval, but the legislation is certain to stall in the GOP-held Senate. The White House said the president would veto it. Facing a backlash over operational changes, new Postmaster General Louis DeJoy testified Friday in the Senate that his “No. 1 priority” is to ensure election mail arrives on time. But the new postal leader, a Trump ally, said he would not restore the cuts to mailboxes and sorting equipment that have already been made. He could not provide senators with a plan for handling the ballot crush for the election. DeJoy is set to return Monday to testify before the House Oversight Committee. “The American people don’t want anyone messing with the post office,” said Rep. Carolyn Maloney, D-N.Y., the chair of the Oversight Committee and author of the bill. “They just want their mail.” But Republicans countered that complaints about mail delivery disruptions are overblown, and no emergency funding is needed right now. “It’s a silly, silly bill,” said Rep. Tom Cole, R-Okla. Despite the postmaster general’s vow election mail will arrive on time, Democrats remain skeptical. They produced new reports showing declines in postal service since he took over in June. DeJoy acknowledged at the Senate hearing there has been a “dip” in service, but disputed reports of widespread problems. The Board of Governors of the Postal Service announced a bipartisan committee to oversee mail voting. The bill would reverse the cuts by prohibiting any changes made after January, and provide funds to the agency. In a memo to House Republicans, leaders derided the legislation as a postal “conspiracy theory” act. Many GOP lawmakers echoed such sentiments during a lively floor debate. “I like the post office, I really do,” said Rep. Glenn Grothman, R-Wis. But he said, “We have no crisis here.” Nevertheless, Senate Republican leader Mitch McConnell is eyeing a $10 billion postal rescue as part of the next COVID-19 relief package. While Trump has said he wants to block emergency funding for the agency, the White House has said it would be open to more postal funding as part of a broader bill. Hundreds of lawmakers returned to Washington for the weekend session, but dozens cast votes by proxy under House rules that allow them to stay away during the COVID-19 crisis. Another lawmaker, Rep. Dan Meuser, R-Pa., announced Saturday he had tested positive for the virus. Trump’s chief of staff, Mark Meadows, was on Capitol Hill meeting Saturday with GOP House leader Kevin McCarthy and other lawmakers, according to a Republican aide granted anonymity to discuss the private sessions. The Postal Service has been struggling financially under a decline in mail volume, COVID-19-related costs and a rare and cumbersome congressional requirement to fund in advance its retiree health care benefits. For many, the Postal Service provides a lifeline, delivering not just cards and letters but also prescription drugs, financial statements and other items that are especially needed by mail during the pandemic. The postal board of governors, appointed by Trump, selected DeJoy to take the job as postmaster general. A GOP donor, he previously owned a logistics business that was a longtime Postal Service contractor. He maintains significant financial stakes in companies that do business or compete with the agency, raising conflict of interest questions. In a statement, the Postal Service said DeJoy has made all required financial disclosures, but he might have to divest some holdings if conflicts arise. Republicans have long sought changes to have the agency run more like a private company, and Trump often complains the Postal Service should be charging Amazon AMZN, +3.01% and other companies higher rates for package deliveries. The founder of Amazon, Jeff Bezos, also owns The Washington Post, a publication that Trump frequently derides as “fake news” over critical stories of him. Others say the Postal Service is not expected to be solely a money-making enterprise, often delivering to far-flung places where it is not efficient to operate. ___"}]}