{"article": [{"url": "https://www.marketwatch.com/story/former-malaysian-leader-arrives-in-court-for-1mdb-corruption-verdict-2020-07-28", "published": 1595898740.0, "headline": "Former Malaysian leader found guilty over 1MDB corruption", "body": "KUALA LUMPUR, Malaysia (AP) — A Malaysian court pronounced former Prime Minister Najib Razak guilty Tuesday in his first corruption trial over the multibillion-dollar looting of the 1MDB investment fund. The ruling came five months after a new government took power with Najib’s Malay party the biggest bloc in the alliance. His party’s shocking election ouster in 2018 was driven by public anger over the 1MDB scandal. “I find the accused guilty and convict the accused of all seven charges,” Judge Mohamad Nazlan Ghazali said after spending two hours to read out his ruling. Analysts said the ruling would bolster the prosecution’s case in Najib’s other trials and would signal to the business community Malaysia’s legal system has strength in tackling international financial crimes. Najib, 67, has promised to appeal. He has said he was misled by rogue bankers and the case against him is political. “From day one, I have said this is the chance for me to clear my name,”″ he wrote on Facebook late Monday. “After this, we will go to the Court of Appeal. I am ready.” A scion of one of Malaysia’s most prominent political families, he faces 42 charges in five separate trials and could face years in prison. Najib’s lawyers asked the judge for a delay until next week before they made their arguments on sentencing. The current trial involved a charge of abuse of power, three charges of criminal breach of trust and three money laundering charges. The judge said Najib failed to raise reasonable doubt and that prosecutors had established beyond reasonable doubt that Najib misappropriated money for his own use. “The conviction would serve as a solid foundation for the prosecution in ensuing IMDB-related trials,” said Oh Ei Sun, a senior fellow with Singapore’s Institute of International Affairs. He said the ruling also would strengthen the credibility of current Prime Minister Muhyiddin Yassin, who was fired as Najib’s deputy, five years ago to the date of Tuesday’s verdict, for speaking out on the 1MDB scandal, although he now relies on Najib’s party for support. Najib’s party is the biggest bloc in the current Malay nationalist alliance, which was formed in March after Muhyiddin’s party toppled the former reformist government. Najib shortly after taking office in 2009 set up 1MDB to ostensibly accelerate Malaysia’s economic development. But the fund accumulated billions in debt, and U.S. investigators allege that at least $4.5 billion was stolen from it and laundered by Najib’s associates to finance Hollywood films and buy hotels, a luxury yacht, artwork, jewelry and other extravagances. More than $700 million from the fund allegedly landed in Najib’s bank accounts. Najib’s wife and several officials from his party and previous government have also been charged with graft. Najib, whose father and uncles were Malaysia’s second and third prime ministers, denies any wrongdoing. He calls the prosecutions a political attack on him. Najib’s s first trial began in April 2019 over seven charges related to the transfer of 42 million ringgit ($9.8 million) from SRC International, a former 1MDB unit, into his bank accounts through intermediary companies. Najib was accused of using his position to receive a bribe for approving a government guarantee for billions in loans to SRC, committing criminal breach of trust and accepting proceeds from unlawful activities. Evidence showed a complex trail of money through the accounts that paid for renovating Najib’s home, credit card purchases including a Chanel watch bought in Hawaii as a birthday gift for his wife and disbursements to political parties. In defense, Najib has said he was misled by rogue bankers led by Malaysian fugitive financier Low Taek Jho, identified by investigators as a mastermind in the 1MDB saga. The judge found Najib and Low had a close relationship. Najib testified he assumed the money was part of an Arab donation arranged by Low. The judge debunked that argument in the guilty verdict, finding it an “elaborate but weak fabrication.” Najib’s lawyers said Low had used the donation as a guise to keep Najib from being suspicious of his plundering of the 1MDB fund. Prosecutors argued that Najib was the real power behind 1MDB and SRC, and called the Arab donation “manufactured evidence” to cover up his tracks."}]}