{"article": [{"url": "https://www.marketwatch.com/story/industrial-production-edges-up-in-may-2020-06-16", "published": 1592302400.0, "headline": "Industrial production edges up in May", "body": "The numbers: Industrial production rose by 1.4% in May, as many factories resumed operations after shutdowns spurred by the coronavirus crisis, the Federal Reserve said Tuesday. Capacity utilization came in at 64.8%. Economists polled by MarketWatch expected a rise of 2.8% in industrial production and capacity utilization of 66.8%. Key details: Manufacturing output, which had dropped sharply in March and April, increased 3.8% in May, the Fed said. Most major industries saw gains, with the biggest rise posted by motor vehicles and parts. Even so, total industrial production last month was 15.4% below its pre-pandemic level in February, according to the central bank. Big picture: The reading on industrial production is another sign that the U.S. economy began to revive last month from the worst economic crisis since the Great Depression of the 1930s. Ahead of Tuesday’s figures on industrial production, industrial output had been down in four out of the past five months. In March and April, the COVID-19 pandemic led many factories to slow or suspend operations. A separate report on Tuesday said sales at U.S. retailers roared back in May. It comes after a surprisingly upbeat jobs report for May that was released on June 6. Market reaction:U.S. stock indexes SPX, +0.87% DJIA, +0.56% traded sharply higher on Tuesday morning, with the advance being attributed to reports that the Trump administration was working on a $1 trillion infrastructure package to help revive the economy. What are they saying? “Total production was constrained by a steep 6.8% plunge in mining production and a 2.3% fall in utility output. These components will both rebound over the next couple of months as the economy reopens,” said economists at Pantheon Macroeconomics in a note. “In short, a disappointing increase in output in May,” said Rubeela Farooqi, chief U.S. economist at High Frequency Economics. “Output will likely continue to be restrained by ongoing issues related to supply chain disruptions and virus-related interruptions and weak demand, even as a reopening of states and factories boosts output from low levels.”"}]}