{"article": [{"url": "https://www.marketwatch.com/story/us-oil-prices-tumble-4-as-worries-of-resurgence-in-coronavirus-and-rise-in-us-inventories-slams-futures-2020-06-11", "published": 1591889060.0, "headline": "U.S. oil prices drop over 8% as resurgence in coronavirus cases dulls demand outlook", "body": "Crude-oil futures dropped Thursday, with U.S. and global benchmark prices posting their biggest one-day loss in over six weeks, as a weekly climb in U.S. inventories, evidence of climbing cases of coronavirus, and a gloomy economic outlook from the Federal Reserve combined to undermine the recovery from historic lows seen in April. “In less than a week, the supply and demand fundamentals both turned bearish for oil markets,” said Edward Moya, senior market analyst at Oanda. “Supply glut overhang and diminishing crude demand expectations are sinking oil prices sharply,” he said in a market update. “Second wave coronavirus risks [are] crushing hopes for a steady global economic recovery that was spearheading prospects of improving crude demand.” Also, following Wednesday downbeat economic outlook by the Fed, “energy traders are worried permanent damage to the economy along with a second wave of the coronavirus will cripple prospects for a strong second half of the year,” said Moya. “The supply glut issue to is not going away anytime soon, as U.S. crude stockpiles rise to a record high.” West Texas Intermediate crude for July delivery CL.1, -1.62% US:CLN20, the U.S. benchmark, fell $3.26, or 8.2%, at $36.34 a barrel on the New York Mercantile Exchange, after rising 1.7% and marking its highest settlement since March 6 on Wednesday. The decline marked the sharpest one-day fall since April 27 and the settlement was the lowest since June 1, according to Dow Jones Market Data. Global benchmark Brent oil for August delivery UK:BRNQ20 retreated $3.18, or 7.6%, at $38.55 a barrel on ICE Futures Europe, following a 1.3% gain. Prices also finished at their lowest since June 1 and the day’s slide represented Brent’s steepest since April 21. The Energy Information Administration reported Wednesday that U.S. crude inventories rose by 5.7 million barrels for the week ended June 5. That defied a forecast by analysts polled by S&P Global Platts for an average decline of 3.2 million barrels. Meanwhile, Fed Chairman Jerome Powell on Wednesday emphasized that the economic outlook for the U.S. would be challenging as the central bank kept rates at a range of 0% and 0.25% following its policy meeting and warned that millions of people might not return to their jobs. “In the last weeks, oil prices have rallied on the back of supply curtailments that have largely brought global crude inventories under control, but prices are once again under pressure as concerns over the pace of the demand recovery intensified,” wrote Paola Rodriguez Masiu, senior oil markets analyst at Rystad Energy, in a Thursday note. A weaker recovery from the pandemic that has hobbled much of the global economy can damage demand for crude oil and its byproducts as the industry struggles with concerns about the efficacy of measures to limit oil output. Traders are also concerned about signs that coronavirus cases in the U.S. are continuing to rise and topped the 2 million mark just as businesses are resuming activity. The global case tally for the coronavirus that causes COVID-19 climbed to 7.39 million on Thursday, according to data aggregated by Johns Hopkins University. “Risk assets, including crude oil and equities are under pressure today from an increase in coronavirus cases,” said Robert Yawger, director energy futures at Mizuho Securities USA, in a Thursday note. “Evidence is building that a second wave of COVID-19 cases is building in Arizona, Texas, Florida, and California,” he wrote. The oil market had been reacting to recovering demand as business activity had begun to restart amid signs that the coronavirus pandemic was receding in most developed countries, as well as the newly extended pact between the Organization of the Petroleum Exporting Countries and its allies, collectively known as OPEC+, to cut production by 9.7 million barrels a day through July. OPEC+ delivered 85% of its agreed production cuts last month, according to a survey conducted by S&P Global Platts, released Wednesday. Back on Nymex, prices for petroleum products followed oil lower, with July gasoline US:RBN20 down 7.5% at $1.1188 a gallon and July heating oil US:HON20 losing nearly 7.3% to $1.088 a gallon. Natural-gas futures settled higher after the EIA reported Thursday that domestic supplies of natural gas rose by 93 billion cubic feet for the week ended June 5. On average, analysts polled by S&P Global Platts forecast an increase of 95 billion. July natural gas US:NGN20 ended at $1.813 per million British thermal units, up nearly 1.9%."}]}