{"article": [{"url": "https://www.marketwatch.com/story/covid-19-will-force-older-workers-into-early-retirement-2020-06-17", "published": 1592495180.0, "headline": "COVID-19 will force older workers into early retirement", "body": "It’s a twofer for older workers. And that’s not a good thing. Since March, many have lost jobs during the coronavirus pandemic and retirement accounts that are invested in the stock market have been twirling like those oversize Mad Tea Party tea cups at Magic Kingdom. Let’s start with the job picture. Americans age 55 and older had an unemployment rate of 11.8% in May, up from just 2.6% in January, according to the U.S. Bureau of Labor Statistics. For women, the situation is worse: the current unemployment rate for women 55 and older is 13.6%. “Unlike previous recessions, this pandemic-led downturn has hit older workers especially hard and will likely create long-term employment challenges for them,” according to Richard W. Johnson, who directs the program on retirement policy at the Urban Institute. This nurse says she's 'work optional' instead of FIRE - here's how Consider what happened when older workers lost their jobs in the Great Recession of 2008-09. “After the Great Recession, workers ages 62 and older were about half as likely to become reemployed as their counterparts ages 25 to 34,” wrote Johnson. “And when unemployed older workers found a new job, they earned barely half as much as they did on their previous job.” Read more about older workers and COVID-19 So I was unhappy, but not surprised to read this headline in Jennifer Schramm’s blog last week: “Devastating Job Losses May Be Pushing Older Workers into Retirement.” Schramm is a senior strategic policy adviser at the AARP Public Policy Institute. Her data to back that up: The total number of workers ages 55+ in the U.S. economy shrank from 37.8 million in February, before the COVID-19-related layoffs began to take effect, to 32.7 million in May, she wrote. Meantime, the labor-force participation rate (the percentage of the population either working or actively seeking work) for this age cohort dropped from 40.3% to 38.5%. “The numbers suggest that while many older workers displaced by COVID-19 job loss are still seeking work, a large number have dropped out of the labor market entirely,” Schramm wrote. “Thus, job losses associated with the pandemic may be leading to a substantial rise in earlier-than-planned retirement.” Instead of firing up and fighting back to land a new job, it appears that an increasing number of older workers don’t have the stomach for rounds of potential rejections and offers of lower paying positions. Instead, they’re opting to step away and call it a day. This is what happens. “When older workers lost their jobs in past recessions, they often retired, dropping out of the labor force instead of trying to find another job,” Johnson reports. And yes, the National Bureau of Economic Research reported this month that following a record 128 months of expansion, the U.S. economy officially entered a recession in February. The decision to retire early, however, can have lifelong economic costs. Working longer typically bolsters financial security because you keep earning and saving and don’t need to dip into your retirement accounts prematurely. That, in turn, allows those funds to continue to grow and rebound when markets wobble. And that income can also defray the cost of health insurance until Medicare kicks in at 65. Importantly, you can stave off turning on Social Security benefits. Read: For older workers, there are risks if they return to the office — and risks if they don’t For every year you wait past your full retirement age (FRA), you get an 8% increase in your benefit. If you start taking Social Security at age 62, when you’re eligible to, rather than waiting until your full retirement age, you can anticipate up to a 30% reduction in monthly benefits with lesser reductions as you approach FRA, which now ranges from 66 to 67, depending on your date of birth. And, of course, work, in my opinion, is not a four-letter word. Even if it’s a part-time job, it keeps you mentally engaged, gives you a social network and a sense of purpose. All things you can’t put a price tag on. Many retirees, initially revel in their autonomy and ability to do things they didn’t have time for while they were working. I get that. And the allure of stepping out of the grind is enticing and liberating. Often a gap year is all that’s needed, though, to recharge and refocus and begin to seek out flexible work options. Many early retirees I have talked with find they miss the structure, co-workers, and the sense of identity and mission work delivers. It reminds me of Joni Mitchell’s lyric for her 1970 song Big Yellow Taxi. “Don’t it always seem to go, that you don’t know what you’ve got till it’s gone” That’s why, if you’re grappling with the decision to throw in the towel early, you need a plan. You can’t wing it, and, you bet, it’s not only about money. I’m a big believer in retiring to something, not from something. Recently, I called Lisa A.K. Kirchenbauer, a Certified Financial Planner and founder of Omega Wealth Management in Arlington, Va., one of my go-to financial gurus, to learn what older workers who have lost a job need to do to prepare if they decide to retire earlier than planned. Insights from Kirchenbauer “Check to be sure you have set aside a year’s worth of projected cash needs in a very conservative blend of high yield savings and short-term bonds. That way, regardless of the stock market volatility, you’ll have funds to live on. From the investment side, ideally you have put a portfolio together and have worked with a financial adviser to prepare for bad-timing risk if you turn on your retirement portfolio and — boom — the market goes down. Revisit the overall asset allocation for stocks in your portfolio. Consider repositioning to more conservative investments like bond funds and exchange-traded funds (ETFs) or money-market funds for the cash needs that you have from now until early 2021, so it is pretty cash-like while things settle out, this volatility is likely to be around at least until the election. That doesn’t mean pulling all your money out of the stock market. You need the potential growth of equities that you may need to pay for future health care costs and to keep pace with potential future inflation. Don’t try to time the market from day to day. Pick your strategy and move forward with the long-term in mind. Money aside, “are you ready to retire?” is the question. A little more goes into it than just how your portfolio is doing and do you have enough savings. Are you emotionally ready? Are you physically ready? Are you socially ready? I believe, as a musician, it’s always best to have a ‘decrescendo,’ as you have in music, where you gradually decrease the income and pace of work, as opposed to going cold turkey because it can be so hard emotionally.” The three questions Kirchenbauer asks clients who are facing the retirement decision right now (courtesy of the Financial Transitionist Institute): • What needs to be protected or maintained? What is truly important to you that you want to keep doing, protect, maybe do more of? I have had all kinds of answers here from my health, my financial lifestyle, some relationships. It is not one-size fits all. • What do you need to let go of? A lot of people have been realizing lately, during the stay at home mandates, that they don’t need as much stuff. These are often tangible things. But sometimes it’s about worrying, or relationships that are not healthy. This is a time right now to really reflect on what’s essential and what’s not. •What needs to be taken on, adopted, or created in your life? Reflect about what’s important at this stage– maybe it’s a relationship, learning something new, or even becoming an entrepreneur. The answers create some hope, even if you can’t do it right now. Hope is so powerful. Hope gets people through difficult times. You are saying: ‘Maybe not this moment, but this is what I want to have in my life.’ That’s far more meaningful than just financial goals. Kerry Hannon is a leading expert and strategist on work and jobs, entrepreneurship, personal finance and retirement. Kerry is the author of more than a dozen books, including “Great Pajama Jobs: Your Complete Guide to Working From Home,” “Never Too Old To Get Rich: The Entrepreneurs Guide To Starting a Business Mid-Life,” “Great Jobs for Everyone 50+,” and “Money Confidence.” Follow her on Twitter @kerryhannon."}]}