{"article": [{"url": "https://www.marketwatch.com/story/5-big-financial-issues-voters-didnt-hear-much-or-anything-about-in-the-trump-biden-debate-2020-09-30", "published": 1601543240.0, "headline": "5 big financial issues Trump and Biden didnâ\u0080\u0099t mention in their first debate", "body": "For a rancorous first debate between President Donald Trump and Democratic nominee Joe Biden, there was a whole lot that went unsaid. Unemployment is coming off double-digit rates in the spring after government shutdowns to deal with the coronavirus outbreak, yet joblessness is still high. But the candidates didnâ\u0080\u0099t delve deeply into solutions for joblessness before cross-talk reigned. The same goes for the prospect of another round of fiscal stimulus and more federal unemployment benefits. Health-care costs were another issue discussed briefly before the event became a slugfest. Meanwhile, millions of renters could be facing eviction starting next year, but interruptions â\u0080\u0094 many from Trump â\u0080\u0094 crowded out talk on that issue. How about student debt, the top form of nonmortgage debt, which now stands at roughly $1.7 trillion? Zero mention. Trump and Biden are scheduled to debate again on Oct. 15 in a town-hall format with undecided voters. Perhaps theyâ\u0080\u0099ll get to these critical personal finance topics then. Stimulus checks and unemployment insurance The most searched term on Google GOOGL, +1.82% Â GOOG, +1.97% Â during Tuesdayâ\u0080\u0099s debate was unemployment, according to data from Google. Thatâ\u0080\u0099s hardly a surprise given the fact that over 20 million Americans have lost their jobs during the pandemic-induced recession. The unemployment rate has come down from 14.7% in April to 8.4% last month as parts of the economy reopened, sending millions of Americans back to work. But for the Americans who havenâ\u0080\u0099t been able to return to work, enhanced unemployment benefits and stimulus checks, both of which were part of the $2 trillion CARES Act stimulus package, have been a lifeline. By now, most Americans have spent their stimulus checks of $1,200 per person plus $500 per child. Additionally, jobless Americans are no longer receiving an additional $600 a week in unemployment benefits that expired in July. Though many did receive a temporary $300 boost in benefits resulting from an executive order Trump signed. Thatâ\u0080\u0099s caused many Americans to cut back on spending in grocery stores. Donâ\u0080\u0099t miss: How Trump and Biden tax policies could affect your paycheck, tax return, investment portfolio and nest egg Trump and Biden have both expressed support for a second round of stimulus checks, but the two candidates disagree when it comes to unemployment benefits. Trump has said the $600 add-on benefit discourages unemployed workers from looking for jobs, because two-thirds of Americans received more in unemployment benefits with the extra $600 than they earned on the job. Bidenâ\u0080\u0099s economic recovery plan calls for extending the $600 benefit, more funding for nutrition and health programs, as well as more money for state and local governments, similar to the priorities House Democrats put forth in the HEROES Act, which languished in the Senate after being passed by the House in May.Evictions and affordable housing Millions of Americans continue to face the threat of eviction as a result of the economic turmoil caused by the coronavirus pandemic. In August, researchers estimated that as many as 40 million people could be at risk of eviction in the next several months, calling it â\u0080\u009cthe most severe housing crisisâ\u0080\u009d in the nationâ\u0080\u0099s history. Weeks later, the Centers for Disease Control and Prevention and the Trump administration announced a nationwide moratorium on evictions. But the moratorium is not a permanent solution: It only lasts through the end of the year, at which point renters can once again be evicted for nonpayment of rent if theyâ\u0080\u0099ve not managed to catch up on what they owe their landlords. And because the national moratorium was not accompanied by extra funding from Congress for emergency rental assistance, renters and landlords alike are facing financial calamity. Without aid, trade groups have warned that small-scale mom-and-pop landlords could face foreclosure or the need to sell their homes â\u0080\u0094 and that could shrink the supply of rental housing nationwide. Plus, the CDC moratorium doesnâ\u0080\u0099t apply to all Americans automatically. Instead, renters must notify their landlord using a form that the CDC drew up to stipulate that they are protected by the order. Experts have also warned that gaps in the CDCâ\u0080\u0099s order could allow for landlords to find other avenues to evict tenants, including people who have unofficial, month-to-month arrangements. Only around 4.2 million Americans are likely to file for protection, well short of the total number of people that researchers say could be at risk of being kicked out of their homes, according to a National Association of Realtors report. Some landlords have sought to move quickly to file for eviction against tenants in the weeks following the CDCâ\u0080\u0099s announcement. At least 5,200 eviction cases have been filed by private-equity firms and other corporate landlords since Sept. 1, according to data collected by the Private Equity Stakeholder Project. While the explosion in unemployment brought about by the coronavirus pandemic is the most immediate cause of the eviction crisis facing the country, the seeds for such an emergency were sowed well before that. For roughly a decade now, America has not built enough new homes to keep up with the growth in the number of households nationwide. That shortage of housing has driven up not only home prices for buyers, but also rents for renters. Nearly half of all renter households were cost-burdened before the pandemic, meaning over a third of their income went toward rent, said research from the Joint Center for Housing Studies of Harvard University.Consumer debts (and student debts in particular) Though new reporting on Trumpâ\u0080\u0099s tax record suggest heâ\u0080\u0099s potentially on the hook for more than $400 million in debt, Trump said during the debate that heâ\u0080\u0099s in good financial shape. â\u0080\u009cIâ\u0080\u0099m totally underleveraged because the assets are extremely good, and I built a great company,â\u0080\u009d he said. Meanwhile, Americans have a total $14.27 trillion in household debt as of 2020â\u0080\u0099s second quarter â\u0080\u0094 and thatâ\u0080\u0099s actually the largest decline on record since 2013. Within that mound of debt is the roughly $1.7 trillion in student debt, which wasnâ\u0080\u0099t mentioned Tuesday night. About 44 million Americans are coping with college debt and for many of them, that burden is delaying progress in their financial lives. For the millions of borrowers who have defaulted on their loans, the debt is putting their Social Security checks, tax refunds and wages at risk. More broadly, the nationâ\u0080\u0099s debt-financed higher education system has been linked to widening racial inequality. Momentum has been building over the past few years to cancel student debt, with Senate Democrats Elizabeth Warren and Chuck Schumer calling on the next president to cancel up to $50,000 in student debt for every borrower. Biden has said that if elected heâ\u0080\u0099ll immediately cancel $10,000 in student loans for every borrower and discharge federal undergraduate student debt for borrowers earning up to $125,000 as long as it was related to their education at a public college, a Historically Black Colleges and Universities institution or Minority Serving Institution. Heâ\u0080\u0099s also vowed to make public college tuition-free for students from families earning $125,000 a year or less. Trump hasnâ\u0080\u0099t said much about what he would do to address student debt and college affordability, but his record so far offers some hints. The Department of Education under Secretary of Education Betsy DeVos has rolled back Obama-era provisions aimed at cracking down on for-profit colleges, which have been accused of luring borrowers into taking on high debt loads for degrees with little value in the labor market. Trump, of course, formerly operated such an institution. This summer the Trump administration extended the pause on student loan payments and collections that Congress implemented through the CARES Act, the coronavirus stimulus bill, through Dec. 31. The pause was originally set to expire on Sept. 30.Health-insurance costs How much will your prescriptions and premiums cost if Trump is re-elected or Biden takes office? Tuesdayâ\u0080\u0099s debate provided little clarity on those questions among other pressing cost related health-care issues. The two candidates however spent a good chunk of the debate going back and forth about Obamacare, the informal name of the Affordable Care Act that overhauled the U.S. health-care system in President Barack Obamaâ\u0080\u0099s first term, with Biden as vice president. What they didnâ\u0080\u0099t delve into were the ways to address rising premiums. Last year, the average annual premium was $7,188 for single coverage, a 4% year-over-year rise, and $20,576 for family coverage, a 5% rise, according to the Kaiser Family Foundation. The average family premium jumped 54% since 2009 and 22% since 2014, according to the foundation focused on health-insurance matters. Some 20 million Americans receive health insurance through the program, which covers people with pre-existing conditions. Prior to the passage of Obamacare, health insurers could deny coverage, limit payouts or charge higher premiums to people with pre-existing medical conditions. Now, the entire Obamacare program is facing another challenge in the Supreme Court from the federal government and 18 Republican-leaning states. The Supreme Court is scheduled to hear the case on Nov. 10 while Judge Amy Coney Barrettâ\u0080\u0099s confirmation battle heats up. In 2016, Trump campaigned on the promise to repeal and replace Obamacare. Trump, however, has not presented an alternative to the program, Wallace pointed out during the debate. Trump said he wants to give Americans â\u0080\u009cbetter health-care at a much lower price because Obamacare is no good,â\u0080\u009d but did provide more details as to how heâ\u0080\u0099d accomplish that. Trump said heâ\u0080\u0099s cutting drug prices by â\u0080\u009c80 or 90%â\u0080\u009d but did not directly respond to Wallaceâ\u0080\u0099s question regarding medical costs for people with pre-existing health conditions. Biden said that he favors expanding Obamacare while adding a public option.Income inequality Last year, income inequality grew to its widest point in 50 years, according to U.S. Census Bureau data. The pandemic â\u0080\u0094 which wiped out 40% of the jobs paying $40,000 or less from February to March â\u0080\u0094 may only make matters worse, observers say. The racial wealth gap is also stark, with new Federal Reserve data saying the typical Black family had eight times less wealth than the typical white family. Wages were the third most searched issue on Google during the debate on Tuesday, the company said. Both said talked about job creation (and their opponentâ\u0080\u0099s supposed talent for job destruction) but there was little talk about the compensation for the work. At one point, Biden did say his bid for clean energy would create â\u0080\u009cmillions of good-paying jobsâ\u0080\u009d above $15 an hour. Trump emphasized that he presided over decades-low unemployment before the pandemic hit, while Biden referenced the Obama administrationâ\u0080\u0099s stewardship of a long-running economic rebound from the financial crisis. Biden supports a $15 federal minimum wage, which is more than double the current $7.25 rate. That rate is unchanged since 2009, when Biden was vice president. Numerous states and municipalities have unilaterally moved their minimums upward."}]}