{"article": [{"url": "https://www.marketwatch.com/story/arizona-residents-are-among-first-americans-to-receive-300-extra-in-unemployment-benefits-ordered-by-trump-2020-08-18", "published": 1597808960.0, "headline": "This state just became the first to give extra $300 federal unemployment payment ordered by Trump in Round 2 of stimulus", "body": "Some 250,000 jobless Arizonans received an extra $300 in weekly jobless benefits on Monday in addition to their standard state unemployment benefit, a partial replacement of the $600 federal benefit built into the CARES Act passed early this year as the coronavirus pandemic forced much of the U.S. economy into lockdown and cost millions of Americans their jobs. The $300 federal add-on results from executive actions taken by President Donald Trump this month — in the form of three memos and one executive order signed at his golf club in Bedminster, N.J. — after Congress failed to replace the $600-a-week unemployment benefit set forth in the CARES ACT, which expired at the end of July, when negotiations broke down over a next-phase coronavirus relief package. See:Republican senator calls Trump’s stimulus executive order ‘unconstitutional slop’ Plus: Pelosi on Trump’s coronavirus-aid orders: ‘He doesn’t know what he’s talking about’ The $300 benefit promised in the Trump memorandum is being funded from $44 billion set aside for disaster relief. Many Americans had been receiving beefed-up unemployment benefits under the $2 trillion CARES Act, passed by Congress in April. When those extra benefits ended, the average weekly unemployment compensation Americans received fell to $257 from $812. As of Monday, nearly $75 million was distributed to unemployed Arizonans to make the extra $300 payments, Brett Bezio, a spokesman for Arizona’s Department of Economic Security, told MarketWatch. Trump’s executive order initially was ill-received by states, which were told that they would have to contribute an additional $100 a week in unemployment benefits on top of what they were paying to beneficiaries in order to receive the federal $300 tack-on. Don’t miss: The extra $600 in weekly unemployment benefits expired — but gig workers and self-employed Americans still qualify for benefits The Trump administration reversed course after governors said they could not afford to contribute that additional $100. Instead, anyone who gets at least $100 in unemployment benefits from their state would qualify for the extra $300. Before Monday, the maximum weekly benefit Arizonans received was $240. The minimum weekly unemployment benefit in Arizona is $119 — meaning every Arizonan on unemployment would be eligible for the extra $300 benefit. Six states, in addition to Arizona, had been approved to access funds from the Federal Emergency Management Agency to distribute the additional $300-a-week federal benefit as of Sunday. So far, none of those six has been able to make the payments."}]}