{"article": [{"url": "https://www.marketwatch.com/story/nikes-covid-related-sales-decline-is-a-bump-on-the-path-to-long-term-growth-analysts-say-2020-06-26", "published": 1593435560.0, "headline": "Nike's COVID-related sales decline is a bump on the path to long-term growth, analysts say", "body": "Nike Inc. stock slumped 7.4% in Friday trading after the athletic wear giant reported a 38% fiscal fourth-quarter sales decline, but analysts have already turned an optimistic eye towards 2021 tailwinds. Even with stores closed for much of the quarter and sales slowing to a crawl during the coronavirus pandemic, Nike NKE, +0.97%  Chief Executive John Donahoe talked about the \"competitive advantages\" the company has, including its brand power, its digital efforts and the Jordan brand. By fiscal 2023, the company now expects to reach 50% penetration, up from an earlier goal of 30%, and the company is currently focused on digital investment. Nike expects revenue in the first half of fiscal 2021 to be lower than previous years, but revenue is forecast to be up in the second half of the year as stores continue to reopen and the digital business grows. \"Nike's financial strength enables us to stay focused on the long-term, creating even greater competitive advantage in times of dislocation,\" said Matthew Friend, Nike's chief financial officer, on the earnings call, according to a FactSet transcript. Read:Nike fourth-quarter sales drop nearly 40% \"In an environment where most companies are solely focused on survival, Nike's financial strength, scale and adaptability allows us to make appropriate near-term decisions while investing to fuel long-term growth.\" Nike ended the quarter with $12.5 billion in liquidity, including $9 billion in cash and short-term investments. \"Management's color calls for FY21 sales to be flat to up, with 1H down and 2H up significantly; should markets continue to improve, this is likely conservative,\" said Wedbush analysts led by Christopher Svezia. Wedbush spoke with Nike after the earnings call and confirmed that the company's sales guidance includes an intentional wholesale pullback due to \"marketplace disruptions\" in North America and elsewhere. \"For FY21, incremental digital drivers such as Nike Fit and the benefits from accelerated investments in connected inventory and membership (all gross margin accretive) and more are also likely not taken into account in the sales color,\" Wedbush said. See:Consumer spending jumps record 8.2% in May as the economy reopens, unemployment benefits surge Wedbush rates Nike stock outperform with a $107 price target. BMO Capital Markets analysts say despite the steep fourth-quarter decline, Nike is poised to snap up new customers. \"We expect Nike will feel dislocation,\" wrote analysts led by Simeon Siegel. \"However, we also believe it best situated to grab others' share through the havoc; with share opportunity increasingly shifting from athletic peers to further include traditional apparel dollars.\" BMO rates Nike stock outperform with a $100 price target. \"The shares are clearly not 'cheap' - few stocks worth owning these days are. Expect Nike to compound,\" BMO said. Digital initiatives may be a reason to be bullish, but Raymond James analysts also think Nike's plan to open 150 to 200 stores in North America and abroad is another. \"Nike's newly announced strategy to open 150-to-200 stores in North America and EMEA [Europe, Middle East and Africa] over the next couple years could become a critical component for Nike to gain further share in both apparel and women's segments,\" analysts said. Raymond James rates Nike stock outperform with a $115 price target. Don't miss:Companies are speaking out against racial injustice after the killing of George Floyd, but they have to back it up with action \"We think short-term headwinds are masking Nike's long-term potential. Investors should look past the challenges that Nike will face over the next two quarters and focus on the unmatched global strength of the Nike brand, digital prowess, best-in-class customer engagement, unrivaled product innovation, and fortress balance sheet,\" wrote Susquehanna Financial Group analysts led by Sam Poser. Susquehanna rates Nike stock positive with a $130 price target. Nike shares have rallied nearly 12% over the last three months barely outpacing the Dow Jones Industrial Average DJIA, +0.56%  gain of 11.1%."}]}