{"article": [{"url": "https://www.marketwatch.com/story/what-history-says-tends-to-happen-after-the-u-s-stock-market-logs-ugly-september-losses-11601498299", "published": 1601545640.0, "headline": "What history says tends to happen after the U.S. stock market logs ugly September losses", "body": "September proved to be a bruising month for the main U.S. equity benchmarks, resulting in the first losing month for Wall Street since a recovery rally began in late March. However, history suggests that a terrible September, which is historically the worst performing month of the year for U.S. stocks, could be followed by the indexes outperforming despite October usually ranking as the second-worst month of the year. On Wednesday, the Dow Jones Industrial Average DJIA, +0.56% DJIA, +0.56% ended September with a decline of a 2.3%, the S&P 500 index SPX, +0.87% SPX, +0.87% dropped by about 3.9% for the month, and the Nasdaq Composite Index COMP, +1.39% registered a decline of 5.2%. The last time any of those main benchmarks posted as ugly a September performance was 2011, during the European sovereign debt crisis and the downgrade of America’s pristine triple-A credit rating by Standard & Poor’s. However, Dow Jones Market data suggests that the irksome losses that helped to snap the hard-earned monthly win streak from the lows in March, when the coronavirus-sparked decline reached its nadir, doesn’t have to translate into more carnage in October. In fact, the indexes tend to rise in the following month 70% of the time after losses as severe as September this year, based on the last 10 periods in which the Dow marked a decline of at least 2%, the S&P 500 marked a September slide of at least 3.5%, and the Nasdaq Composite logged a drop in the ninth month of the year of at least 4.5%. Overall, however, on a percentage basis, the S&P 500 and the Dow have tended to fall on average in October. An important point to note, is that the relatively short data set is skewed to the low side by the punishing declines endured by the market in 2008, when the Dow lost 14.1% in October of 2008, the S&P 500 dropped nearly 17% that month, and the Nasdaq Composite tumbled almost 18%. Those declines during the financial crisis dragged the overall 2008 performance for the Dow lower, leaving an average loss for the month of October of about 1% and a relatively flat rest of the year at 0.05%. Meanwhile, the S&P 500 has declines of 1.2% and declines of 2.3% for the rest of the year. However, the Nasdaq Composite tends to gain nearly 4% in the October trading period on average and notch a 3.6% advance in the year to date (see attached chart). Dow Jones Market Data To be sure, the road ahead for stocks appears uncertain in 2020, even if investors are clinging to hope for a fresh round of economic stimulus from Washington to combat the ill effects of the coronavirus on business activity. The 2020 presidential election and the fear that stock prices are exceeding their earnings by increasing margins have fostered concerns of a possible shock to the system that could deliver a more substantive gut punch to Wall Street. But for now, investors may be hoping for a less-spooky October, if not a less-volatile trading stretch in the lead-up to the Nov. 3 elections."}]}