{"article": [{"url": "https://www.marketwatch.com/story/wisconsin-supreme-court-upholds-lame-duck-laws-enacted-by-republicans-as-governorship-turned-democratic-2020-07-09", "published": 1594309760.0, "headline": "Wisconsin Supreme Court upholds lame-duck laws enacted by Republicans as governorship turned Democratic", "body": "MADISON, Wis. (AP) — The conservative-majority Wisconsin Supreme Court on Thursday upheld Republican-authored lame-duck laws that stripped power from the incoming Democratic attorney general just before he took office in 2019. The justices rejected arguments that the laws were unconstitutional, handing another win to Republicans who have scored multiple high-profile victories before the court in recent years. Don’t miss (April 10, 2020):Pandemic election brings national attention to high-stakes battle for Wisconsin Supreme Court seat “ The actions in Wisconsin mirrored Republican moves after losing control of the governors’ offices in Michigan in November 2018 and in North Carolina in 2016. ” The 5-2 ruling marks the second time that the court has upheld the lame-duck laws passed in December 2018, just weeks before Gov. Tony Evers and Attorney General Josh Kaul, both Democrats, took office. The actions in Wisconsin mirrored Republican moves after losing control of the governors’ offices in Michigan in November 2018 and in North Carolina in 2016. Democrats decried the tactics as brazen attempts to hold onto power after losing elections. The Wisconsin laws curtailed the powers of both the governor and attorney general, but the case decided Thursday dealt primarily with powers taken from Kaul. From the archives (Dec. 5, 2018):Wisconsin Republicans pass lame-duck bills to strip governor of powers after Democrat wins office; outgoing GOP Gov. Scott Walker jeered at Christmas-tree lighting Opinion (Dec. 12, 2018):GOP’s lame-duck votes in Wisconsin are unprecedented in how direct, systematic and premeditated they are Plus (Dec. 7, 2018):Wisconsin and Michigan Republicans seek to curb incoming Democratic attorneys general The attorney general said in a statement that Republican legislators have demonstrated open hostility to him and Evers and made it harder for state government to function. Evers echoed that sentiment in a statement of his own, saying Republicans have been working against him “every chance they get, regardless of the consequences.” Thursday’s ruling involved a case filed by a coalition of labor unions led by the State Employees International Union. The coalition argued that the laws give the legislature power over the attorney general’s office and that this violates the separation of powers doctrine in the state constitution. The laws prohibit Evers from ordering Kaul to withdraw from lawsuits, let legislators intervene in lawsuits using their own attorneys rather than Kaul’s state Department of Justice lawyers, and force Kaul to get permission from the legislature’s Republican-controlled budget committee before settling lawsuits. Republicans designed the laws to prohibit Evers from pulling Wisconsin out of a multistate lawsuit challenging the Affordable Care Act, also known as Obamacare, and to ensure that they have a say in court if Kaul chooses not to defend GOP-authored laws. Evers still pulled the state out of the multistate lawsuit after a lower judge temporarily blocked the laws, but the restrictions on settlements have proven divisive. Kaul has said settlement discussions are confidential and has refused to share details of cases with the committee, putting tens of millions of dollars in potential settlement revenue in jeopardy. In recent months the committee has signed off on a handful of settlements after the litigants allowed Kaul to share details of the deals, but no formal process exists for how to handle settlements under the laws. The court ruled that the attorney general derives his powers from state statutes, not the constitution, and his role is not a core function of the executive branch. The legislature clearly has an interest in joining lawsuits independently and signing off on settlements because it’s responsible for spending the state’s money, Justice Brian Hagedorn wrote for the majority. “While representing the State in litigation is predominately an executive function, it is within those borderlands of shared powers, most notably in cases that implicate an institutional interest of the legislature,” Hagedorn wrote. The legislature’s top Republicans, Senate Majority Leader Scott Fitzgerald and Assembly Speaker Robin Vos, hailed the ruling as a victory. “A rogue attorney general can no longer unilaterally settle away laws already on the books,” Fitzgerald said. The court’s two liberal justices, Rebecca Dallet and Ann Walsh Bradley, argued in dissent that the ruling blurs the lines between the executive and legislative branches. “The power of the purse cannot be understood so broadly as to permit substantial burdens on another branch’s intersecting power,” Dallet wrote. “The Wisconsin Constitution, like the United States Constitution, does not contemplate an active role for the legislature in executing or in supervising the executive officers charged with executing the laws it enacts.” The unions’ attorneys didn’t immediately respond to messages seeking comment. The decision doesn’t close the door to future legal challenges. Hagedorn wrote that the ruling doesn’t address how the lame-duck laws are specifically applied, leaving open a potential line of attack. For example, a litigant looking to get a case settled with the state could sue if the budget committee simply won’t address the matter, Evers’s attorney, Lester Pines, said. Democrats and liberal groups have been trying to push back against the laws since they were passed but have had little success. Liberal advocacy group One Wisconsin Now persuaded a federal judge in January 2019 to block language in the law that restricted in-person early voting to the two weeks before an election. The League of Women Voters and other groups filed a state lawsuit arguing the laws as a whole were invalid because Republican lawmakers passed them after the legislature’s regular session had ended months earlier. The justices ruled last year that lawmakers can meet whenever they wish. The Supreme Court did deliver a partial win for Evers on Thursday, throwing out some of the rules the legislature put in place that required his administration to rewrite thousands of government “guidance documents” and websites. The law also gave the legislature more power to block rules written by the Evers administration. The court found the rules were overly broad and unconstitutional. Evers had argued that the new requirements to rewrite documents were so extensive it would make it impossible for the executive branch to get information to the public. The court is set to hand down another significant ruling Friday on whether Evers exceeded his authority with four partial budget vetoes he issued last year. That decision could further weaken his ability to rewrite proposals coming out of the Republican-led legislature."}]}