{"article": [{"url": "https://www.marketwatch.com/story/mortgage-rates-fall-to-a-record-low-for-the-eighth-time-this-year-making-buying-a-home-more-affordable-for-many-americans-2020-08-06", "published": 1596879620.0, "headline": "Mortgage rates fall to a record low for the eighth time this year, making buying a home more affordable for many Americans", "body": "As mortgage rates continue to decline to new record lows, prospective home buyers are facing a frustrating situation: Cheap financing is everywhere, but there’s seldom a home to buy. The 30-year fixed-rate mortgage averaged 2.88% for the week ending August 6, dropping 11 basis points from the week prior, Freddie Mac FMCC, +0.52% reported Thursday. It was the eighth time this year the benchmark mortgage rate slipped to a record low. In comparison, these loans had an average rate of 3.6% a year ago. The 15-year fixed-rate mortgage dropped seven basis points to an average of 2.44%, while the 5-year Treasury-indexed hybrid adjustable-rate mortgage fell by only four basis points to 2.9%. Concerns about the state of unemployment nationwide and lawmakers’ delays in approving a new stimulus package pushed rates lower. The yield on the 10-year Treasury note flirted with record lows this week. Because mortgage rates are long term rates, they have historically moved roughly in line with the direction of the 10-year Treasury. “Recently, downward pressure on mortgage rates has been consistent, but a combination of factors — including increased demand from borrowers and reluctance from lenders to push rates lower — had kept them afloat,” said Zillow ZG, -0.42% economist Matthew Speakman. “But the inability for the federal government to agree to a new fiscal relief bill last week finally tipped rates over the edge and down to new all-time lows.” Speakman added that a weak July jobs report could push rates lower, while a stronger-than-expected report might move them higher. “ ‘Tighter lending standards and low inventory will squeeze housing activity and we will see a substantial slow down in sales in the second half of this year.’ ” — George Ratiu, senior economist with Realtor.com Either way, the low-rate environment has been extremely enticing for Americans. Although the number of people who applied for a mortgage fell on a weekly basis last week, application volume remains extremely elevated compared to a year ago, according to data from the Mortgage Bankers Association. In particular, the number of mortgage applications for loans used to buy homes (as opposed to refinances) was up 22% from a year ago. “Historically-low mortgage rates are stoking demand for real estate, as buyers are rushing to lock-in low monthly payments,” said George Ratiu, senior economist with Realtor.com. “However, buyers are facing many obstacles on the path to their new home.” (Realtor.com is operated by News Corp NWSA, -1.35% subsidiary Move Inc., and MarketWatch is a unit of Dow Jones, which is also a subsidiary of News Corp.) In particular, buyers are facing an incredibly short supply of homes for sales, which Ratiu said is “leading to a frenzied environment of multiple bids, price escalation clauses and inspection waivers.” The situation may even be scaring off some sellers who would otherwise be in the market, because they too would need to buy a home and are struggling with the limited supply. And while rates are low, lenders have maintained very high standards to qualify for a loan given the risks posed by the pandemic and the tumultuous economy. “At this pace, tighter lending standards and low inventory will squeeze housing activity and we will see a substantial slow down in sales in the second half of this year,” Ratiu said."}]}