{"article": [{"url": "https://www.marketwatch.com/story/in-a-win-for-the-gop-court-blocks-decision-to-extend-wisconsin-absentee-ballot-deadline-01602184877", "published": 1602170960.0, "headline": "In a win for the GOP, court blocks decision to extend Wisconsin absentee ballot deadline", "body": "A canvasser wears gloves while processing mail-in ballots. Drew Angerer/Getty Images MADISON, Wis. (AP) — A federal appeals court on Thursday blocked a decision to extend the deadline for counting absentee ballots by six days in battleground Wisconsin, in a win for Republicans who have fought attempts to expand voting across the country. If the ruling stands, absentee ballots will have to be delivered to Wisconsin election clerks by 8 p.m. on Election Day if they are to be counted. The ruling makes it more likely that results of the presidential race in the pivotal swing state will be known within hours of poll closing. Democrats almost certainly will appeal the decision to the U.S. Supreme Court. Under state law, absentee ballots are due in local clerks’ offices by 8 p.m. on election night. But Democrats and allied groups sued to extend the deadline after the April presidential primary saw long lines, fewer polling places, a shortage of poll workers and thousands of ballots mailed days after the election. Wisconsin, like much of the rest of the country, is already seeing massive absentee voting for November and the state expects as many as 2 million people to vote absentee. U.S. District Judge William Conley ruled last month that any ballots that arrive in clerk’s offices by Nov. 9 will be counted, as long as they are postmarked by Nov. 3. In that ruling, Conley noted the heavy absentee load and the possibility it could overwhelm election officials and the postal service. The 7th Circuit Court judges initially upheld Conley’s ruling on Sept. 29, rejecting the Republicans’ standing to intervene. After the Wisconsin Supreme Court affirmed that standing, the same three-judge panel delivered Thursday’s ruling. Justices Frank Easterbrook and Amy St. Eve voted to stay the order and Ilana Rovner opposed. “The State Legislature offers two principal arguments in support of a stay: first, that a federal court should not change the rules so close to an election; second, that political rather than judicial officials are entitled to decide when a pandemic justifies changes to rules that are otherwise valid,” the majority wrote. “We agree with both of those arguments.” Rovner, in a blistering dissent, highlighted the coronavirus threat to citizens in Wisconsin, currently one of the nation’s worst hot spots. Conley came up with a “limited, reasonable set of modifications” to election rules to preserve “the precious right of each Wisconsin citizen to vote,” she wrote. “Today, in the midst of a pandemic and significantly slowed mail delivery, this court leaves voters to their own devices,” she wrote. “Good luck and G-d bless, Wisconsin. You are going to need it.” Easterbrook was appointed by Ronald Reagan, St. Eve by Donald Trump. Rovner was appointed by George H.W. Bush. President Donald Trump won Wisconsin by less than 1 percentage point — fewer than 23,000 votes — in 2016. Polls show Democratic challenger Joe Biden with a slight lead in the state, but both sides expect a tight race."}]}