{"article": [{"url": "https://www.marketwatch.com/story/pepsi-to-launch-sleep-aid-drink-driftwell-as-beverage-companies-expand-into-new-health-and-wellness-categories-2020-09-14", "published": 1600156580.0, "headline": "Pepsi to launch sleep-aid drink Driftwell as beverage companies expand into new health and wellness categories", "body": "PepsiCo Inc. has a new addition to the “functional” beverage category coming nationwide in December: Driftwell, a beverage that aims to help consumers relax and fall asleep. Driftwell will roll out online first and then head to select retail shelves in the first quarter of 2021, a strategy chosen to drive interest in the product before it hits stores, the company said. Developed through an internal pitch competition in 2019 and launched in less than a year, Driftwell contains L-theanine. Theanine is also found in tea and is used to ease anxiety and improve mental function. Driftwell also has a “spa-water inspired flavor” of BlackBerry and lavender. Driftwell isn’t carbonated and doesn’t contain sugar or calories. See:Starbucks Pumpkin Spice Latte still drives traffic and could be a source of holiday season inspiration for retailers The new beverage comes at a time when many consumers are reportingtrouble sleepingdue to anxieties related to the coronavirus pandemic. PepsiCo PEP, +0.42% says Driftwell was in development before COVID-19, though recognizes the need during the pandemic. “Relaxation and dealing with stress is a lifestyle shift,” according to a statement from PepsiCo. Over-the-counter sleep aids are a $1 billion market with a more than 9.5% four-year compound annual growth rate (CAGR), according to data provided by PepsiCo. Driftwell falls into what PepsiCo calls an “emergent” category, which means it could be placed in a variety of places throughout the grocery store, including health and beauty. “While PepsiCo ultimately envisions relaxation beverages owning a space similar to the energy category today, how that grows will largely depend on how consumers look for them and the brands’ ability to react to that shopping behavior,” the company said. Beverage companies are exploring a broader set of categories and ingredients for their drinks to grow. This year, Coca-Cola Co. KO, +0.69% launched Coca-Cola Energy, which includes B-vitamins, and Aha, a sparkling water that comes in flavors including black cherry and coffee and citrus and green tea, which each containing caffeine. Also:Instant Pot has launched a coffee/espresso maker, the Instant Pod, available exclusively at Walmart And Molson-Coors Beverage Co. TAP, -1.87% has launched Vizzy, a sparkling seltzer that contains antioxidant vitamin C, a differentiator in the sparkling seltzer category that the company is emphasizing in its marketing. Molson-Coors announced last week that it is also launching a nonalcoholic seltzer, Huzzah, online and in Southern California this month. Huzzah will come in three flavors, juicy pear, raspberry and lemon and strawberry and hibiscus, and will contain probiotics for gut health. Other coming launches from Molson-Coors include MadVine, a plant-based diet soda with ingredients like bourbon vanilla and yuzu lemon; and Golden Wing, a grain-based milk alternative with proteins and nutrients. “We’re following through on our promise to seek out new opportunities beyond beer, and we’ll continue to innovate and move into new spaces as it’s an important part of our long-term strategy,” said Pete Marino, president of emerging growth for Molson Coors, in a statement. Molson Coors took a minority stake in L.A. Libations in November 2019, which is helping with these new products. PepsiCo shares are breakeven for the year to date while the S&P 500 index SPX, +0.87% has gained 4.7% for the period."}]}