{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-tally-climbs-above-26-million-us-above-61-million-amid-concerns-cdc-will-rush-out-a-vaccine-2020-09-03", "published": 1599199880.0, "headline": "Coronavirus update: Global tally climbs above 26 million, U.S. above 6.1 million, amid concerns CDC will rush out a vaccine", "body": "The global tally of confirmed cases of the coronavirus that causes COVID-19 climbed above 26 million on Thursday, while the U.S. tally rose above 6.1 million, amid growing concerns that President Donald Trump’s administration may attempt to rush out a vaccine ahead of the November presidential election. Those concerns were fueled by the news that the head of the Centers for Disease Control and Prevention has sent a letter to governors, urging them to prepare to start distributing a COVID-19 vaccine in their states by Nov. 1, just two days before the election. In the letter dated Aug. 27, CDC head Robert Redfield said states “in the near future” will receive permit applications from drug distributor McKesson Corp. MCK, -1.75%, which has contracted with CDC to distribute vaccines to places including state and local health departments and hospitals, as the Associated Press reported. “CDC urgently requests your assistance in expediting applications for these distribution facilities and, if necessary, asks that you consider waiving requirements that would prevent these facilities from becoming fully operational by November 1, 2020,” Redfield wrote. The Redfield letter was first reported on by McClatchy. Public health experts pointed out that final-stage trials of experimental vaccines are still recruiting, and are at best halfway through that process. The vaccines consist of two doses, given a month apart. Experts told the AP they did not understand how there could be adequate data on whether the vaccines work and are safe before Nov. 1. “Being ready is reasonable. Cutting short Phase 3 trials before you get the information you need isn’t,” said Dr. Paul Offit, a Children’s Hospital of Philadelphia immunization expert who sits on the FDA’s vaccine advisory committee. Dr. Michael Osterholm, an epidemiologist at the University of Minnesota, said he was concerned about an “October surprise” with a vaccine being rushed through ahead of the election. “The public health community wants a safe and effective vaccine as much as anybody could want it,” Osterholm said. “But the data have to be clear and compelling.” Moncef Slaoui, a venture capital investor and former GlaxoSmithKline PLC executive who heads up the government’s Operation Warp Speed program, told NPR he cannot imagine trials producing data before the end of October. iframe.twitter-tweet { width: 100% !important; } Meanwhile, the State Department told Congress it is diverting funds owed to the World Health Organization this month, the Guardian reported. Trump issued a notice of withdrawal from the world’s leading public health agency in July, but the move does not take effect until next July. In the meantime, the U.S. is on the hook for $65 million in membership dues. In other news: • A group of 22 economists from leading universities has sent an open letter to U.S. policy makers urging them to “start over and do it right” to contain the virus. “Our nation’s economy will remain in crisis as long as the COVID-19 virus spreads unchecked,” reads the open letter, which is being distributed by U.S. PIRG, the federation of state Public Interest Research Groups, a consumer advocacy group. “As experts on economic theory and practice, we have come together to insist that you reconsider your understanding of the economic reality we face.” Reopening bars, gyms and restaurants is “prolonging the harm,” they wrote, and driving up disease and deaths. The letter warns that people’s economic lives will be kept on hold for a long time, if the virus is not contained. Signatories include James Galbraith of the University of Texas at Austin, Martin Ravallion of Georgetown University, Jerry Green of Harvard University, Donald Davis of Columbia University, Amalia Miller of the University of Virginia, Francine D. Blau of Cornell University, and Debraj Ray of New York University. • France counted 7,017 new coronavirus cases on Wednesday, up from 4,982 on Tuesday, marking the third time since the onset of the pandemic that it has counted more than 7,000 infections in a single day, according to local media. “The virus keeps spreading in the country,” French health authorities said in a statement. About a fifth of France’s administrative districts are suffering from an “active circulation of the disease,” they said. The number of French people hospitalized stood at 4,632, well below the peak of 32,292 seen in April but worrying to experts after rising for more than five straight days. France has 331,060 confirmed cases of the virus, and 30,692 people have died, according to Johns Hopkins data. • A Minnesota biker who attended the Sturgis Motorcycle Rally in South Dakota in August has died of COVID-19, the Washington Post reported, marking the first fatality linked to an event that drew more than 400,000 people. The man was in his 60s, and had underlying medical conditions, the paper said; he was hospitalized after returning from the rally. At least 260 cases in 11 states have been linked to the event, the paper said, based on a survey of health departments. Participants were filmed crowding bars and sidewalks, while failing to socially distance or wear face masks. Experts say the number of cases stemming from the event is likely understated, because many of the attendees are unwilling to be tested and the states they live in have limited contact tracing. • Dwayne “The Rock” Johnson and his family tested positive for the coronavirus. Johnson announced their diagnoses in an 11-plus-minute video on Instagram on Wednesday. He said he was shocked after hearing their test results, calling the ordeal “one of the most challenging and difficult things we’ve ever had to endure.” Johnson said the illness has made him more conscious. He made several suggestions to combat the virus, such as wearing a mask, boosting immune systems and committing to wellness.Latest tallies There are now 26.1 million confirmed cases of COVID-19 worldwide, according to the Johns Hopkins data, and 864,691 people have died. At least 17.3 million people are confirmed to have tested positive and recovered. The U.S. has the highest case tally at 6.1 million, and the highest death toll at 186,185. The U.S. mortality rate stands at 56.77 per 100,000 people. Brazil is second to the U.S. with 3.9 million cases and 123,780 deaths. See: ‘We can’t let our guard down’: Scientists say some children could spread COVID-19 even if they have antibodies Brazil is followed in case numbers by India, Russia and Peru. India has the third highest death toll at 67,376, followed by Mexico with 65,816. The U.K. has 342,684 cases and 41,615 deaths, the highest in Europe and fifth highest in the world. China, where the disease was first reported late last year, has 89,961 cases and 4,727 deaths, according to its official numbers. What’s the latest medical news? Sanofi SA SAN, +1.20% SNY, +0.89% and GlaxoSmithKline PLC GSK, +1.10% GSK, +1.52% said their COVID-19 vaccine candidate has entered a Phase 1/2 clinical trial, MarketWatch’s Jaimy Lee reported. The randomized, double-blind, placebo-controlled study plans to enroll 440 healthy participants in the U.S., and the companies said they plan to move their experimental vaccine into Phase 3 trials by the end of the year based on the vaccine’s performance in the earlier phases of development. The vaccine has received funding from the Biomedical Advanced Research and Development Authority. Novavax Inc. NVAX, +0.18% released more data on its Phase 1 trial of a vaccine for COVID-19 Wednesday, and shares rose about 4% in after-hours trading. Novavax previously released findings from the study that said the vaccine candidate induced immune responses and was well-tolerated, but more data from the study was published Wednesday in the New England Journal of Medicine. See also:Moderna and Pfizer’s COVID-19 vaccine candidates require ultra-low temperatures, raising questions about storage, distribution “The rapid publication of Phase 1 results from our trial in a prestigious peer-reviewed journal reflects both the importance of the data and the urgent need for an effective vaccine to slow the COVID-19 pandemic,” Novavax’s president of research and development, Gregory Glenn, said in a news release.What’s the economy saying? New applications for unemployment benefits fell sharply last week to a fresh pandemic low, but the entire decline stemmed from a major change in how the data are reported instead of more people finding jobs, MarketWatch’s Jeffry Bartash reported. The labor market showed no progress absent the change. Initial jobless claims fell by 130,000 to a seasonally adjusted 881,000 in the last week of August, the Labor Department said Thursday. These figures reflect applications filed the traditional way through state unemployment offices. Economists polled by MarketWatch had forecast 940,000 new unemployment claims in the seven days ended Aug. 29. Yet not all of their estimates took into account the change in the government’s formula for seasonal adjustments. See also:Did the expired $600 federal jobless benefit keep people from going back to work? Sudden drop in claims adds fuel to debate The Bureau of Labor Statistics said last week it would alter its adjustment process to make the report more accurate. The level of seasonally adjusted new claims has run notably higher than the real or actual number of people applying for benefits each week, a problem that became more pronounced in the past month. The new method began with this week’s report. The BLS does not plan to revise previous data to reflect its new statistical approach. For a fuller explanation:The government is making a big change in how it reports jobless claims — and here’s why The unadjusted or real number of new jobless claims, meanwhile, suggest there was barely any change last week in how many people are applying for benefits. They rose slightly to 833,352 from 825,761. It was the fifth straight week in which unadjusted claims have been below 1 million. By any measure, though, jobless claims are still exceedingly high. They ran in the low 200,000s and stood near a half-century low shortly before the coronavirus epidemic broke out. “The data show that layoffs remain widespread and the recovery in the labor market is occurring at a frustratingly slow pace,” said lead U.S. economist Nancy Vanden Houten of Oxford Economics. The Dow Jones Industrial Average DJIA, +0.56% was last down 133 points, while the S&P SPX, +0.87% was down 1.2%.What are companies saying? • AMC Entertainment Holdings Inc. AMC, -2.17% will start reopening its movie theaters in New Jersey on Sept. 4, after the sixth largest state in the movie theater chain’s circuit announced the reopenings will be permitted. AMC said it will start by opening two theaters — AMC Jersey Gardens 20 and AMC Wayne 14 — on Friday, and expects to have all 27 of its New Jersey theaters open on or around Sept. 10. • Arconic Corp. ARNC, +3.32% restored the salaries and 401(k) match for all of its U.S. salaried employees, including executives on Sept. 1, after cutting them earlier this year to counter the impact of the pandemic. The maker of aluminum parts for airplanes and cars said the move will not affect its plan to cut costs by $100 million and cut capex by $50 million. “These salary and benefit reductions represented approximately one third of the Company’s temporary cash savings on an annualized run rate,” the company said in a regulatory filing. • Campbell Soup Co. CPB, +0.10%, the canned soup, snacks and simple meals company reported fiscal fourth-quarter profit and sales that topped forecasts, buoyed by at-home dining trends during the pandemic. Meals & beverages sales rose 28% to $1.02 billion, above the FactSet consensus of $960.3 million, and snacks sales grew 11% to $1.09 billion to top expectations of $1.08 billion. For the fiscal first quarter, the company expects adjusted EPS of 88 cents to 92 cents, surrounding the FactSet consensus of 89 cents, and sales to rise 5% to 7%, while the current FactSet consensus of $2.29 billion implies 4.9% growth. • Ciena Corp. CIEN, +1.53%, the networking systems and software company, reported fiscal third-quarter results that beat expectations but said an orders slowdown related to the COVID-19 pandemic would hurt revenue for “a few quarters.” Revenue rose 1.7% to $976.7 million, topping the FactSet consensus of $972.8 million. Total networking revenue rose 0.8% to $802.3 million, above the FactSet consensus of $794.0 million, and total global services revenue was flat at $116.7 million to miss expectations of $124.1 million. Software and services revenue totaled $57.7 million, up from $47.8 million a year ago, but below expectations of $62.8 million. • Conn’s Inc. CONN, +2.21% posted a surprise profit for its fiscal second quarter, as the furniture and home appliances retailer saw strong online demand during the pandemic. E-commerce sales rose 72% from a year ago, as shoppers moved online during the pandemic. Same-store sales fell 13.2%, mostly due to changes in underwriting in the company’s credit department, and supply chain disruptions caused by the pandemic. • Designer Brands Inc. shares DBI, -1.28% plummeted, after the parent of the DSW Designer Shoe Warehouse retail chain reported a wider-than-expected fiscal second-quarter loss as sales fell more than forecast despite “aggressive” promotional activity, as the pandemic continued to affect store traffic. Sales dropped 43% to $489.7 million, missing the FactSet consensus of $589.6 million, as same-store sales fell 42.7% versus expectations of a 26.5% decline. Gross margin as a percentage of sales fell to 7.6% from 30.5%. “The decrease in gross profit was primarily driven by the impacts of the COVID-19 outbreak on our operations resulting in the temporary closure of stores and, subsequently, significantly reduced customer traffic upon store re-openings, which we addressed with aggressive promotional activity,” the company said in a statement. • Discount-store chain Five Below Inc. FIVE, +2.50% reported second-quarter revenue that beat Wall Street estimates as stores reopened after being closed temporarily during the pandemic. Five Below declined to give a forecast for its fiscal third quarter or its current year due to the coronavirus. The company expects to open 110 to 120 net new stores in 2020. “We feel good about our positioning for the second half of the year,” Chief Executive Joel Anderson said in a statement about the results. • Arts and crafts retailer Michaels Cos. Inc. MIK, -1.95% blew past estimates for the second quarter as stores reopened after being closed during the pandemic. Same-store sales rose 12%, compared with a FactSet consensus for a decline of 5.9%. The company said all its stores had reopened by the beginning of July, though e-commerce sales remained strong and were up more than 350% from a year ago. The company ended with quarter with $1.3 billion in liquidity. It is not offering guidance, because of the uncertainty created by the pandemic. • Signet Jewelers Ltd. SIG, -0.38% reported a much narrower-than-expected loss and revenue that topped forecasts, although same-store sales missed. Same-store sales declined 31.3% to miss expectations of a 28.9% decline. “While same-store sales were down 31.3% in the quarter given store closures, same-store sales turned positive in late Q2 as we reached scale on store re-openings while driving high double-digit growth in e-commerce,” said Chief Executive Virginia Drosos. “Momentum has continued into Q3 with preliminary August same-store sales of 10.9% and e-commerce growth of 65.2%.” The company increased the target savings from its cost-cutting efforts to $285 million from $225 million. • Tyson Foods Inc. TSN, -1.71% will open seven health clinics near its facilities for employees and their families. The clinics, which will be operated by Marathon Health, a privately held provider of worksite health clinics, are expected to open in 2021. Employers are facing rising costs of health care services provided to their employees, and in recent years several large companies including Apple Inc. AAPL, +1.74% and Amazon Inc. AMZN, +3.01% have announced plans to set up health clinics for their workers. In July Tyson announced that it will create the company’s first chief medical officer role. It also outlined a COVID-19 testing strategy that requires it to test thousands of workers for the virus following several coronavirus outbreaks among its workers this summer."}]}