{"article": [{"url": "https://www.marketwatch.com/story/incidence-of-violence-and-inhumanity-against-blacks-in-this-country-must-stop-former-amex-ceo-chenault-says-2020-06-10", "published": 1592138060.0, "headline": "'Incidents of violence and inhumanity against blacks in this country must stop,' says former American Express CEO Ken Chenault", "body": "Business has a responsibility to eradicate racism, former American Express CEO Ken Chenault, said in an impassioned appeal at the start of a Barron's Group event last week. “ 'Incidents of violence and inhumanity against blacks in this country must stop. We must not stand by and stay silent.' ” - Ken Chenault The 69-year-old Wall Street veteran, who was the CEO of American Express AXP, +0.26%  from 2001 until 2018, and only the third African-American to run a Fortune 500 company, said that the \"business community must recognize\" its responsibility to eradicate \"racism and inequality.\" Chenault told the event's attendees on Wednesday that as the CEO of the travel and financial leviathan that he himself faced discrimination - that he could not \"avoid the stings of racism.\" The executive, now chairman and managing director of the venture-capital firm General Catalyst Partners, was speaking during an Investing in Tech event, the first in a series of webcast interviews with investors, executives and entrepreneurs hosted by Barron's Group that will run through July 15. Sign up:The future of tech investing: Take part in the conversation - a virtual Barron's Group event Chenault's comments come after the killing of George Floyd in the custody of Minneapolis police on May 25, which sparked a wave of protests and put newfound focus on racial inequality in America as well as systemic racism among police forces. Ken Chenault Addresses Racism and Inequality \"I call on each of us in the business community to bring about real change,\" Chenault said. \"We have to close the racial gap. Everyone must play a role. We have to seize the moment and bring about real change.\" Chenault recently stepped down from the board of Facebook Inc. FB, +0.26%  to join the board of Berkshire Hathaway Inc. BRK.A, +0.06%  BRK.B, +0.24%. Comments made by the executive on Wednesday during the Barron's event echo those he made with his General Catalyst colleagues in a blog post earlier this month. \"George Floyd, Breonna Taylor and Ahmaud Arbery did not know each other,\" Chenault and his associates wrote on June 1, referring to other black Americans killed at the hands of police in recent weeks. \"They were Americans going about their lives in very normal ways. But they had two things in common. They were all black Americans victimized because of their race,\" General Catalyst executives wrote. \"Incidents of violence and inhumanity against blacks in this country must stop,\" Chenault said. \"We must not stand by and stay silent.\" Read on:Death of Rayshard Brooks in Atlanta and two recent deaths of black men by hanging in California motivate new protest wave"}]}