{"article": [{"url": "https://www.marketwatch.com/story/trump-kamala-harris-as-first-female-president-would-be-an-insult-to-our-country-2020-09-08", "published": 1599597800.0, "headline": "Trump: Kamala Harris as first female president â\u0080\u0098would be an insult to our countryâ\u0080\u0099", "body": "“ â\u0080\u009cPeople donâ\u0080\u0099t like her. Nobody likes her. She could never be the first woman president. She could never be. That would be an insult to our country.â\u0080\u009d ” Thatâ\u0080\u0099s what President Donald Trump said of Democratic vice-presidential nominee Sen. Kamala Harris on Tuesday night, as he spoke to supporters in North Carolina. Harris is the first woman of color on a major-party presidential ticket, and is considered a front-runner for the White House in 2024 if Joe Biden wins this year and doesnâ\u0080\u0099t seek a second term. iframe.twitter-tweet { width: 100% !important; } Itâ\u0080\u0099s hardly the first time Trump has insulted Harris, who Trump claimed Tuesday is â\u0080\u009cfurther left than crazy Bernie.â\u0080\u009d After the Republican National Convention, Trump said Harris was â\u0080\u009cnot competentâ\u0080\u009d and that his daughter, Ivanka, would be a better vice-presidential contender. He has also promoted a false and racist conspiracy theory that Harris is not eligible to be president, and has a long history of demeaning women who oppose him. Also at Tuesdayâ\u0080\u0099s rally in Winston-Salem, N.C., Trump said Biden had made â\u0080\u009cunholy alliance with the most extreme and dangerous elements of the radical leftâ\u0080\u009d and repeated his claim that â\u0080\u009cthe economy will collapseâ\u0080\u009d if Biden is elected. Trump also appeared to once again suggest voting twice â\u0080\u0094 by mail and in person, which is illegal. â\u0080\u009cMake sure you send the ballot in, then make sure you go to your polling place and make sure it counts,â\u0080\u009d he said. Voting twice is a felony, at both the state and federal level."}]}