{"article": [{"url": "https://www.marketwatch.com/story/the-latest-victim-of-covid-19-alzheimers-research-2020-07-26", "published": 1596815240.0, "headline": "The latest victim of COVID-19: Alzheimerâ\u0080\u0099s research", "body": "This article is reprinted by permission from NextAvenue.org. After a frustrating 2019, Alzheimerâ\u0080\u0099s researchers had reason to look forward to 2020 as a year of promise. Then the pandemic struck. â\u0080\u009cLast year, seven [Alzheimerâ\u0080\u0099s clinical] trials were stopped. The portfolio was more than halved,â\u0080\u009d said John R. Dwyer, Jr., president of the Global Alzheimerâ\u0080\u0099s Platform (GAP) foundation, a network for clinical trials in North America. Clinical trialsÂ with human participants are needed to test the safety and effectiveness of any new Alzheimerâ\u0080\u0099s drugs or treatments to prevent, slow or cure the disease. â\u0080\u009cAlzheimerâ\u0080\u0099s studiesÂ take a long time to conclude. There hasnâ\u0080\u0099t been a successful treatment approved since 2003,â\u0080\u009d Dwyer said. 80% of older Americans can't afford to retire - COVID-19 isn't helping Setting back Alzheimerâ\u0080\u0099s research Private clinical trial sites have been particularly hard hit because ofÂ COVID-19Â restrictions. â\u0080\u009cIf sites fail, that loss of research capacity could set back Alzheimerâ\u0080\u0099s research for years,â\u0080\u009d Dwyer noted. Before the pandemic, Alzheimerâ\u0080\u0099s researchers were hopeful that 2020 could have been a breakthrough year for the nearly 6 million Americans living with the disease and for their caregivers. The National Institutes of Health was set to allocate $2.8 billion for dementia research, a nearly threefold increase over 2016. But the disruption in clinical trials might have an irreversible effect on the health and well-being of Alzheimerâ\u0080\u0099s patients and their caregivers, said Steve Satek, president of Great Lakes Clinical Trials in Chicago. â\u0080\u009cThe greatest hope for treating this disease lies in clinical trials. That is where the most cutting-edge, innovative medicines can be found,â\u0080\u009d he noted. â\u0080\u009cA person who is experiencing gradual memory loss cannot put that decline on hold while we wait to start up or reactivate trials. Their disease moves on.â\u0080\u009d As of the beginning of April, only 12% of research centers were enrolling in any clinical trials, according to reports to GAP.Â Some said they could be closing their doors in the next few months; more than half said they may need to lay off staff.Workarounds to keep Alzheimerâ\u0080\u0099s clinical trials going In some cases, Alzheimerâ\u0080\u0099s researchers have been devising alternatives to lower the number of required visits vulnerable older participants must make to health care facilities for the trials. Home visits and telemedicine are taking up some of the slack. But these workarounds add another degree of difficulty to an already complex process, according to Dwyer. Also read: 5 ways to reduce your risk of developing dementia, according to research Observational studies, which donâ\u0080\u0099t involve the introduction of an actual drug or treatment, are not considered essential to participantsâ\u0080\u0099 health. So, they â\u0080\u009chave pretty much shut down,â\u0080\u009d according to Dr. Paul Aisen, director of the Alzheimerâ\u0080\u0099s Therapeutic Research Institute (ATRI) at the University of Southern California. But interventional or therapeutic trials where participants receive some type of treatment are more likely to be considered essential. That has allowed some of them to continue, albeit with difficulties. But â\u0080\u009cat many sites, we have had to put a hiatus in place. Itâ\u0080\u0099s very disruptive,â\u0080\u009d said Aisen. These tests are rigorous, Aisen noted, adding that â\u0080\u009cwhen you already have a study under way, itâ\u0080\u0099s critical to try to maintain it, to try to keep the dosing on scheduleâ\u0080\u009d at home or in a setting that does not put participants at risk.A major clinical trial pushed back One major Alzheimerâ\u0080\u0099s study ATRI is participating in is known as the AHEAD 3-45. Itâ\u0080\u0099s a global multicenter clinical trial aimed at preventing memory loss due to Alzheimerâ\u0080\u0099s disease. This study was poised to launch in May but had to be pushed back until at least mid-July. â\u0080\u009cFor a number of reasons, participation in AHEAD 3-45 cannot be done at home. The screening process requires in-person cognitive and clinical assessment, as well as MRI and PET brain imaging,â\u0080\u009d said Aisen. â\u0080\u009cIn addition, the study medication is administered intravenously.â\u0080\u009d Despite the delays, many Alzheimerâ\u0080\u0099s clinical trial participants remain committed. â\u0080\u009cWeâ\u0080\u0099re confident we are going to be able to complete studies,â\u0080\u009d said Aisen. â\u0080\u009cThere will be delays, it will require adjustments, but we will complete and evaluate therapies.â\u0080\u009d Also on MarketWatch: Judge stops federal execution amid claims inmate has dementia However, Li-Huei Tsai, director of the Picower Institute for Learning and Memory at the Massachusetts Institute of Technology, is much less confident that her institute will be able to complete trials to test noninvasive brain simulation. â\u0080\u009cWe had tested animals with light and sound, and this reduced Alzheimerâ\u0080\u0099s pathology and improved cognitive function,â\u0080\u009d according to Tsai. Based on that research, â\u0080\u009cwe designed a study to have human subjects receive light and sound one hour a day for a year.â\u0080\u009dâ\u0080\u0098Completely disruptedâ\u0080\u0099 A device consisting of a 2x2â\u0080² panel designed to produce the gamma frequency light and a speaker producing the gamma frequency sound was installed in each participantâ\u0080\u0099s home. One group had been receiving treatment and the second group got a placebo. Caregivers were instructed how to monitor the treatment. Although use of the device has not been much affected by the pandemic, â\u0080\u009cour ability to bring subjects back for evaluation is completely disrupted,â\u0080\u009d said Tsai. â\u0080\u009cI donâ\u0080\u0099t see any time soon that we will be able to evaluate them.â\u0080\u009d The pandemic is requiring Tsai and her team to make changes to a painstakingly designed protocol, setting research back by at least six months. â\u0080\u009cWe will still have useful data, but there may be limits on some outcome measures compared to what we would have had without the pandemic,â\u0080\u009d Tsai said. See: Coronavirus pandemic could get much, much worse, according to this health expert Many participants had agreed to sign on to the trial with the understanding that even if they were initially given the placebo theyâ\u0080\u0099d later be switched to the actual treatment. With that possibility indefinitely on hold, Tsai said, â\u0080\u009cI feel bad.â\u0080\u009d Sheâ\u0080\u0099s also concerned about the ability to expand the light/sound study and to begin other trials.The pandemicâ\u0080\u0099s biggest impact on Alzheimerâ\u0080\u0099s research Satek sees the inability to screen new patients for trials as â\u0080\u009cprobably the biggest impactâ\u0080\u009d of the pandemic for Alzheimerâ\u0080\u0099s research. Thatâ\u0080\u0099s because it takes years of working within a community to convince people to participate in clinical trials. Said Satek: â\u0080\u009cNormally we bring in 10 to 15 people a week for free memory tests. That doesnâ\u0080\u0099t mean they will join a trial, but a lot doâ\u0080\u009d once theyâ\u0080\u0099re educated about how trials work. Now, few people are coming in for free tests. And although Great Lake Clinical Trials has remained open during the coronavirus outbreak, the nearby hospital that provides MRI and PET scans closed its imaging center for weeks, along with other services, to prevent the spread of COVID-19. As a result, some people temporarily couldnâ\u0080\u0099t get the brain scans they needed to enter the program and the clinic had to postpone follow-up scans for trial participants whoâ\u0080\u0099d already enrolled.Challenges for doing the tests at home Since most Alzheimerâ\u0080\u0099s medications under study havenâ\u0080\u0099t been approved for prescription by the Food and Drug Administration, having patients take the medicine at home and report the results makes the assessment more challenging, Satek said. â\u0080\u009cWe still need to assess the patientâ\u0080\u0099s safety via physical exam, ECG and lab tests and perform standardized cognitive and quality of life assessments. This could possibly be done in the home setting as long as it is approved by our ethics board and study sponsor. But it would require assembling a traveling research team,â\u0080\u009d he added. And entering homes opens the door to questions about COVID-19 safety for the patients as well as the researchers. For people visiting his clinic, Satek said, numerous steps have been taken to protect against the coronavirus. Patients are reminded to stay home if they show any COVID-19 symptoms. And for social distancing, â\u0080\u009cwe donâ\u0080\u0099t have two people coming to the waiting area at the same time,â\u0080\u009d said Satek. Also, interviews with new patients and memory assessments have been moved from small rooms to larger conference rooms and offices.How to attract new clinical trial participants In an effort to keep the pipeline of new trial participants from drying up, Satek has been conducting Zoom ZM, +2.89% Â meetings and virtual memory assessments. â\u0080\u009cItâ\u0080\u0099s going pretty well. We ask them: â\u0080\u0098Do you want to be called when things open again?â\u0080\u0099 We keep them on the list,â\u0080\u009d Satek noted. In the past, he often spoke to groups in person about the importance of volunteering for clinical trials. Those talks have moved online, too. â\u0080\u009cIt takes years to build up a presence in the community. Weâ\u0080\u0099re doing our best to keep the momentum going. Weâ\u0080\u0099re focused on trying to keep the information river flowing,â\u0080\u009d said Satek. Still, Dwyer worries about the pipeline of participants drying up. â\u0080\u009cHealthy folks are needed, sick people are needed,â\u0080\u009d he said. See: How to pay less for your prescriptions - even without insurance He encourages people concerned about getting Alzheimerâ\u0080\u0099s to enter clinical trials. â\u0080\u009cYouâ\u0080\u0099re going to get the best neurological workups. A complete review of your cognitive situation. Even if you donâ\u0080\u0099t go into a study, you get information,â\u0080\u009d Dwyer said. These days, heâ\u0080\u0099s especially concerned that small, family-owned private clinics wonâ\u0080\u0099t survive the current economic crisis. More than half of Alzheimerâ\u0080\u0099s studies are done in what Dwyer calls this â\u0080\u009ccapillary system.â\u0080\u009d Getting financial relief to them â\u0080\u009cis more of a challenge. Thereâ\u0080\u0099s not a natural mechanism to get them help,â\u0080\u009d Dwyer noted. If these small clinics donâ\u0080\u0099t get some type of small-business relief from the government, Dwyer said, their capacity will be reduced 20% to 30%. â\u0080\u009cThat means that one full Alzheimerâ\u0080\u0099s trial will not get done. We lose one more big shot on goal,â\u0080\u009d said Dwyer. Stephenie Overman writes about workplace and health issues. She is the author ofÂ â\u0080\u009cNext-Generation Wellness at Work.â\u0080\u009d This article is reprinted by permission from NextAvenue.org, Â© 2020 Twin Cities Public Television, Inc. All rights reserved."}]}