{"article": [{"url": "https://www.marketwatch.com/story/amazon-expands-its-nfl-thursday-night-football-programmingcould-the-e-commerce-giant-buy-more-nfl-rights-11602177095", "published": 1602184760.0, "headline": "Amazon expands its NFL â\u0080\u0098Thursday Night Footballâ\u0080\u0099 programming â\u0080\u0094 will the e-commerce giant buy more NFL rights?", "body": "US online retail giant Amazon is seen at the distribution center in Staten Island. Angela Weiss/Agence France-Presse/Getty Images The NFLâ\u0080\u0099s â\u0080\u009cThursday Night Footballâ\u0080\u009d game this week between the Tampa Bay Buccaneers and the Chicago Bears will be broadcasting on Fox, NFL Network and for the first time this season, Amazon AMZN, +3.01% Prime. Amazon, which has been airing a few NFL games over the past three seasons, is attempting to distinguish itself from traditional broadcasts. The e-commerce giant announced itâ\u0080\u0099s offering a variety of new experiences for NFL fans, like alternate announcers and interactive in-game replays that itâ\u0080\u0099s calling â\u0080\u009cX-Ray.â\u0080\u009d Amazon will have three separate announcing crews available for fans to choose from: A broadcast television crew from a major network which for this weekâ\u0080\u0099s game is Fox FOX, -1.45%, an all-female booth consisting of Hannah Storm and Andrea Kremer, as well as a â\u0080\u009cScoutâ\u0080\u0099s Feedâ\u0080\u009d featuring prominent sports podcasters and TV host Joy Taylor. The new X-Ray replay experience will allow fans to rewatch plays from the game with unique statistical displays like player speeds and catch probabilities. Amazon has also created a series of original NFL shows it will run on Twitch, the Amazon-owned live streaming service. Amazon will simulcast 11 NFL games this year with Fox, and be the exclusive broadcaster of one other game. â\u0080\u009cWe are relentlessly focused on our customers, and continue to look for ways to improve the viewing experience on their behalf,â\u0080\u009d Jared Stacy, Director of Live Production at Amazon Prime Video, told MarketWatch. â\u0080\u009cWe are thrilled to deliver Thursday Night Football for the fourth year in a row, and like with all of our top sports properties, nothing is more important than delivering premium, high-quality coverage.â\u0080\u009d The $65 million contract between the NFL and Amazon is still relatively small compared with Amazonâ\u0080\u0099s overall business, which secured $280 billion in revenue last year. So why is Amazon making such an effort to bolster its NFL coverage this year? Amazon may be looking to purchase more NFL rights. CNBC has reported that Amazon, along with other non-traditional broadcast brands like Apple AAPL, +1.74%, Google GOOG, +1.97% and Netflix NFLX, +1.43%, will be making a play to purchase NFL broadcast rights in the next few years. The current NFL rights agreement, held by Fox, undefined, CBS VIAC, -2.34% and AT&T T, -1.01%, expires in 2022. For years, Amazon has been rumored to be interested in expanding its NFL broadcast rights portfolio. The NFL, and more generally live sports, still dominate television ratings as 88 of the top 100 television programs in 2018 were live sporting events. Lee Berke, president of LHB Sports Entertainment & Media, who has worked in the content rights industry for over 20 years, thinks the current Amazon deal with the NFL could be viewed as a trial period for the league to see if viewers react favorably to their sport being on Amazon Prime. â\u0080\u009cI think that potentially bodes well for them in terms of other packages that might be available, such as Sunday Ticket,â\u0080\u009d Berke told NextTV shortly after the deal was announced. â\u0080\u009cIt definitely works well from a bandwidth standpoint, from a distribution standpoint, for steamers in general. It sure seems like Amazon has a strong relationship with the NFL going forward.â\u0080\u009d The Sunday Ticket package is currently held by DirecTV, a subsidiary of AT&T. The NFL did not respond for comment on this story. Amazonâ\u0080\u0099s Jared Stacy would not confirm on the record that the company will seek to purchase more NFL rights when the leagueâ\u0080\u0099s current TV deals expire, only saying that Amazon feels like itâ\u0080\u0099s in a good position. â\u0080\u009cWe know many Prime members are passionate sports fans and want options for how to watch their favorite sporting events. We believe weâ\u0080\u0099re uniquely positioned to deliver on this promise.â\u0080\u009d"}]}