{"article": [{"url": "https://www.marketwatch.com/story/heres-how-savers-both-republicans-and-democrats-should-vote-to-avoid-a-huge-hit-to-their-nest-eggs-2020-08-13", "published": 1597509320.0, "headline": "Hereâ\u0080\u0099s how savers â\u0080\u0094 both Republicans and Democrats â\u0080\u0094 should vote to avoid a huge hit to their nest eggs", "body": "The best case scenario: Gridlock. The worst: Complete Democratic power. â\u0080\u009cThe punchline is (for the stock market) â\u0080\u0094 that it does not matter which party wins â\u0080\u0094 so long as no one wins COMPLETE power (sweep of Executive, Senate and House),â\u0080\u009d Thomas Hayes, founder and chairman of Great Hill Capital, wrote in a blog post. He used this chart to show how, historically, a Democrat in the White House with a split Congress has delivered the best returns. A Republican sweep has been by far the worse scenario, though, as Hayes highlighted, that has a lot to do with the Great Depression: While those numbers, ex-Great Depression, arenâ\u0080\u0099t really all that troubling in any of the cases, this election could have profound consequences on the stock market, particularly if Democrats sweep and manage to hike the corporate tax rate, Hayes suggested. Republicans have promised to continue the tax cuts and perhaps even introduce more on capital gains and for the middle class, he said. Democrats, on the other hand, are committed to raising the corporate tax rate from 21% to 28%. That is where the market gets in trouble. â\u0080\u009cIn the 34 years (since 1928) that Democrats have ruled with absolute power (sweep of Executive and Legislative Branches), you did not have such a material CORPORATE TAX INCREASE â\u0080\u0094 imminent upon election,â\u0080\u009d Hayes wrote. â\u0080\u009cDemocrats have consistently run on higher individual tax rates for the rich, but NOT higher corporate tax rates â\u0080\u0093 as we had very high corporate tax rates relative to the rest of the world â\u0080\u0094 until the change under the current administration.â\u0080\u009d As Goldman Sachs GS, -0.21% recently calculated in a note, an increase in the corporate tax rate in the event of a Democratic sweep, which is becoming increasingly likely, would slash S&P 500 earning estimates for 2021 by $20 a share to $150 from $170. â\u0080\u009cIf Goldman is correct. it means we are currently trading at 22.5x 2021 earnings â\u0080\u0094 which is unsustainable,â\u0080\u009d Hayes said. â\u0080\u009cFurthermore, GROWTH expectations would decline as the money companies save from paying the government is invested into growth, hiring, R&D and/or circulated to owners as dividends/buybacks. This would not be the case if the tax rate was increased.â\u0080\u009d Using a formula with an earnings multiple of 15.3x â\u0080\u0094 the 10-year average multiple (P/E) that was in place when the corporate tax rate was higher â\u0080\u0094 along with $150 earnings on the S&P, Hayes estimated that the Dow Jones Industrial Average DJIA, +0.56% would drop below 19,000. For a retirement account of about $2,000,000 â\u0080\u0094 a recent Charles Schwab survey showed that to be the average targeted figure among the younger generations â\u0080\u0094 that would mean a â\u0080\u009cdevastatingâ\u0080\u009d hit of more than $600,000, according to his calculations. â\u0080\u009cThe expected drop in equity value has nothing to do with political party,â\u0080\u009d Hayes said. â\u0080\u009cThe difference this time is that we are starting with the most favorable tax/business environment that weâ\u0080\u0099ve ever had. When that policy is changed it will have a deleterious impact on stock market value.â\u0080\u009d The best an investor can hope for in this climate, he explained, is that both parties have enough power that there are no changes on the corporate tax/regulation front. So whatâ\u0080\u0099s a liberal to do? â\u0080\u009cMy strong suggestion is that if you vote Democrat for the Executive Branch (and you like your net worth), either donâ\u0080\u0099t vote for the Senate and House, or vote the other party as a check on power,â\u0080\u009d Hayes said. â\u0080\u009cIF the tax policy changes as proposed, so will everyoneâ\u0080\u0099s retirement account value.â\u0080\u009d Meanwhile, the market continues to hold up nicely. The Dow was down slightly Thursday, but both the S&P 500 SPX, +0.87% and Nasdaq Composite COMP, +1.39% Â were in the green."}]}