{"article": [{"url": "https://www.marketwatch.com/story/wearing-masks-is-all-we-have-to-try-to-reduce-the-spread-of-coronavirus-former-fda-commissioner-says-2020-06-21", "published": 1592757860.0, "headline": "Wearing masks is â\u0080\u0098all we haveâ\u0080\u0099 to try to reduce the spread of coronavirus, former FDA commissioner says", "body": "As cases of coronavirus spike in Arizona, California, Florida and Texas, more health officials are calling on those states to mandate the use of face masks in public. On Thursday, California took health officialsâ\u0080\u0099 advice into account, and became the latest state requiring masks, issuing a mandate that most of the stateâ\u0080\u0099s nearly 40 million residents wear face masks whenever they leave their homes. Previously, only essential-business employees had been required to wear them, although cities and counties had been allowed to issue their own face-mask orders. But the three other states that have seen record-high spikes in daily cases of COVID-19 have not yet issued statewide mandates to wear masks in public, and thatâ\u0080\u0099s a problem, said Scott Gottlieb, former commissioner of the Food and Drug Administration. In Arizona and Texas, Republican governors have given mayors the authority to mandate masks in their respective cities, but mayors in Florida have not been given the same authority. â\u0080\u009cItâ\u0080\u0099s a mistake,â\u0080\u009d Gottlieb said Sunday on â\u0080\u009cFace the Nationâ\u0080\u009d on CBS News. â\u0080\u009cTheyâ\u0080\u0099re losing precious time I think theyâ\u0080\u0099re gonna have to [mandate masks].â\u0080\u009d â\u0080\u009cWeâ\u0080\u0099re not going to want to shut down businesses again weâ\u0080\u0099re not gonna want to shut down the economy, so thereâ\u0080\u0099s not many tools we can reach for,â\u0080\u009d he said. Collectively wearing masks is something we can do â\u0080\u009cto try reduce the spread. Itâ\u0080\u0099s really all we have and itâ\u0080\u0099s not a very robust tool at that. But itâ\u0080\u0099s a tool that we have [and] a tool has been demonstrated to have an impact if everyone does it, or most people do it,â\u0080\u009d Gottlieb said. Wearing a mask has become a controversial partisan issue. Notably, President Donald Trump and Vice President Mike Pence have been reluctant â\u0080\u0094 or have outright refused â\u0080\u0094 to wear masks in public, and in Trumpâ\u0080\u0099s case, to bristle at the sight of people wearing face coverings, or even, in some instances, practicing social distancing in his presence. Thousands of supporters who gathered Saturday at Trumpâ\u0080\u0099s rally in Tulsa, Okla., did not wear masks and were not required to do so, despite recommendations from the U.S. Center for Disease Control and Prevention. Politics aside, there are several other reasons why Americans have refused to wear masks. â\u0080\u009cI think some people see it as a sort of infringement on their liberty or as or as a way to cast some scorn on a public health establishment thatâ\u0080\u0099s come in for some questions, because people blame the public health establishment for the shutdowns. They blame the public health establishment for some conflicting guidance,â\u0080\u009d Gottlieb said Sunday. Earlier in the health crisis, the CDC did not recommend the general public wear face masks. In addition to fears of shortages of face masks for frontline medical workers, Gottlieb said he suspects that the CDC waited until April 3 to recommend masks because they worried that Americans would think that they were being â\u0080\u009cencouragedâ\u0080\u009d to go out. iframe.twitter-tweet { width: 100% !important; } Nevertheless, â\u0080\u009cwe should have been recommending masks from the outset [of coronavirus],â\u0080\u009d Gottlieb said."}]}