{"article": [{"url": "https://www.marketwatch.com/story/thinking-about-moving-to-a-state-with-lower-taxes-here-are-the-mistakes-to-avoid-2020-08-27", "published": 1598770160.0, "headline": "Thinking about moving to a state with lower taxes? These are the mistakes to avoid", "body": "If you’re contemplating moving to a different state, taxes may be a deciding factor. This column explains how to evaluate the tax picture in states you may be considering. Investigate all state and local taxes If your intent is to relocate to a lower-tax state, it may seem like a no-brainer to move to one that has no personal income tax. No! To avoid an expensive misstep, you must consider all the taxes that can potentially apply to residents — including property taxes and death taxes. Example As you know, Texas is “famous” for having no personal state income tax while Colorado has a flat 4.63% personal state income tax rate. So, if you have a healthy income, you might reasonably think it would be much cheaper tax-wise to live in Dallas, Texas than in Colorado Springs, Colorado. Maybe not! The property tax rate on a home in some Colorado Springs locales is about 0.49% of the property’s actual value, as determined by the county assessor. Say you move to one of these areas and buy a $500,000 home. Your annual property tax bill would be about $2,450, which is a really low number. Say your taxable income is $200,000. Your Colorado state income tax bill would be $9,260. Your combined property tax bill and state income tax bill would be about $11,710. According to the Dallas Central Appraisal District’s online property tax estimator, the annual property tax bill on a $500,000 home in some City of Dallas locales would be about $21,200, or about $17,800 if you’re over 65 or a surviving spouse. You would have no state income tax bill, so the relevant number for comparison to Colorado Springs is about $21,200, or $17,800 if you’re over 65 or a surviving spouse. In most areas within both Colorado Springs and Dallas, the combined state and local sales tax rate is 8.25%, so no difference there. Mixed message conclusion: Much-higher property taxes in Dallas could overwhelm the no-state-income-tax factor. But if you have a really high income, the no-state-income-tax factor could lead to the opposite conclusion. Unless you would buy a really expensive home. That could put Colorado Springs back into the number one position, due to the much-lower-property-taxes factor. Avoid the worst states to die in With the ultra-generous $11.58 million federal estate tax exemption for 2020 (effectively doubled if you’re married), most folks are currently free of any federal estate tax worries. Events and politics could change that. Or not. Who knows? That’s the good news. The bad news: For 2020, 17 states and the District of Columbia impose their own estate tax or inheritance tax. Maryland imposes both. Exemptions from these state death taxes are far below the ultra-generous federal estate tax exemption. So, if you have a healthy estate and move to the “wrong” place, your estate could be completely exempt from any federal estate tax hit (under the current rules) but badly exposed to a significant state death tax hit. Not good! See also:Opinion: There is more to picking a place to retire than low taxes — avoid these 5 expensive mistakes What’s the difference between an estate tax and an inheritance tax? Good question. An estate tax is charged against your entire taxable estate, regardless of who the beneficiaries of the estate may be. An inheritance tax is only charged against inheritances received by certain categories of beneficiaries. With those thoughts in mind, here’s the state death tax picture for 2020 in alphabetical order. Connecticut The top estate tax rate is 12%. For 2020 a $5.1 million exemption is allowed. The exemption is scheduled to increase to $7.1 million for 2021 and $9.1 million for 2022. Above $15 million of estate tax value, the tax rate drops to 0%. Hawaii The top estate tax rate is 20%. For 2020 a $5.49 million exemption is allowed.Illinois The top estate tax rate is 16%. For 2020, a $4 million exemption is allowed.Iowa No estate tax, but an inheritance tax ranges from 5% to 15%, depending on the size of the estate and the beneficiary in question. For 2020, a $25,000 exemption is allowed. Kentucky No estate tax, but an inheritance tax ranges from 4% to 16%. Members of the most-common class of beneficiaries (surviving spouse, child, parent, etc.) are exempt. Tiny exemptions are allowed for members of other classes of beneficiaries.Maine The top estate tax rate is 12%. For 2020, a $5.8 million exemption is allowed. Maryland A good choice for folks who love to pay taxes, because Maryland has both an estate tax and an inheritance tax. The top estate tax rate is 16%. For 2020, a $5 million exemption is allowed. The separate inheritance tax is imposed at a 10% rate, with the taxable amount based on how closely related the beneficiary is to the decedent (that would be you). Massachusetts The top estate tax rate is 16%. For 2020, a $1 million exemption is allowed.Minnesota The top estate tax rate is 16%. For 2020, a $3 million exemption is allowed. Nebraska No estate tax, but an inheritance tax is imposed with a top rate of 18%. Surviving spouses are exempt. For 2020, exemptions range from $10,000 to $40,000, depending on the relationship between the beneficiary and the decedent (you). New Jersey No estate tax, but there’s an inheritance tax with a top rate of 16%. Surviving spouses, parents, grandparents, and direct descendants are exempt. New York The top estate tax rate is 16%. For 2020, a $5.85 million exemption is allowed. Oregon The top estate tax rate is 16%. For 2020, a $1 million exemption is allowed.Pennsylvania No estate tax, but the inheritance tax rate ranges from 4.5% to 15%, depending on the relationship between the beneficiary and the decedent (you). Surviving spouses are exempt. Rhode Island The top estate tax rate is 16% For 2020, a $1,579,922 exemption is allowed. Vermont The estate tax rate is a flat 16%. For 2020, a $4.25 million exemption is allowed.Washington The top estate tax rate is 20%. For 2020, a $2.193 million exemption is allowed. Washington, D.C. The top estate tax rate is 16%. For 2020, a $5,762,400 exemption is allowed. Other states have no death taxes States that are not listed above have no estate or inheritance taxes for 2020. Keep that in mind! Another example As stated earlier, you must look at the whole tax picture before concluding that you’ll be moving to a state that has lower taxes in your specific circumstances. For example, Washington State has no personal state income tax. Terrific! But it has an estate tax that could cost big bucks if you die there, and the combined state land local sales tax rate can be as high as 10.4% So is Washington really a low-tax state? Maybe not for you. In contrast, Florida has no personal income tax, no death taxes, and relatively low sales taxes in many jurisdictions. The bottom line Consider all applicable taxes before concluding that moving to another state will actually save taxes in your specific situation. Finally, consider the distinct possibility that some states may raise taxes in response to lower tax revenues and higher spending due to the COVID-19 mess. I think that’s more likely to happen in already-high-tax states than in lower-tax states. Just my opinion."}]}