{"article": [{"url": "https://www.marketwatch.com/story/tapping-social-security-for-anything-including-covid-19-payments-is-wrongheaded-2020-07-21", "published": 1595326400.0, "headline": "Tapping Social Security for anything â\u0080\u0094 including COVID-19 payments â\u0080\u0094 is wrongheaded", "body": "Like a bad penny, new ideas keep popping up that would allow individuals to tap Social Security today for a variety of purposes in exchange for lower benefits in the future. Some past forays include former Congressman Tom Garrettâ\u0080\u0099s (R-Va.) Student Security Act of 2017, which would have allowed young people to pay off a portion of their student loans today in exchange for a reduction in their future Social Security benefits and Sen. Marco Rubioâ\u0080\u0099s (R-Fla.) Economic Security for New Parents Act of 2019, which would allow new parents to use a portion of their Social Security benefits for parental leave after the birth or adoption of a child. The most recent incarnation of this idea is for Social Security to provide loans to individuals to help them cover their bills during the economic downturn resulting from COVID-19. The proponents argue that the loan program would target money to households that really need it and would not increase the deficit because the loans would be repaid, along with a modest interest charge, by reducing future Social Security benefits. Let me be clear, I think that alleviating the burden of student loans, providing some paid parental leave, and providing funds to households severely hurt by the pandemic are all laudable goals. Reducing student indebtedness would allow young people to stabilize their finances and start saving for a secure future. Paid parental leave would greatly ease the pressure on working women, increase the likelihood that they will return to work, and result in healthier babies. And, certainly, those individuals who have lost their jobs as a result of COVID-19 need money immediately to pay for their food, rent and other necessities. Although the goals are laudable, reducing future Social Security benefits is not the right method to fund any of these initiatives. The key reason is that our retirement income system is already inadequate. Social Security will â\u0080\u0094 under current law â\u0080\u0094 replace less of earnings than it has in the past, because the programâ\u0080\u0099s Full Retirement Age has been increasing from 65 to 67; more households have two earners and thereby are not eligible for the spousal benefit; Medicare premiums account for an ever-increasing share of benefits; and more households will see their benefits taxed under the personal income tax. Moreover, Social Security faces a 75-year deficit, which could lead to further benefit cuts. The only supplement to Social Security for private sector workers is increasingly a 401(k) plan, and data from the Federal Reserveâ\u0080\u0099s 2016 Survey of Consumer Finances indicate that 401(k)/IRA balances were only $135,000 for working households with a 401(k) plan approaching retirement (ages 55-64). At any given point, about half of all private sector workers have no workplace retirement plan; many of these will end up solely dependent on the contracting Social Security system. I have a list of other reasons to oppose using Social Security to finance anything other than retirement and disability benefits. These proposals would increase administrative costs and complexity, they would create a slippery slope (why not use it to cover periods of unemployment or as a down payment for a house?); and they would undermine support for the program by confusing its mission. However, I donâ\u0080\u0099t feel like I really need these reasons when the inadequacy of our current retirement income system is so compelling."}]}