{"article": [{"url": "https://www.marketwatch.com/story/consumers-increase-borrowing-in-july-for-the-second-month-in-a-row-2020-09-08", "published": 1599579380.0, "headline": "Consumers increase borrowing in July for the second month in a row", "body": "The numbers: Consumer borrowing rose again in July largely for big purchases such as new autos or college tuition, but Americans remained cautious about spending in light of the U.S. economy’s slow recovery from the coronavirus. The use of credit has risen twice in a row after slumping from March through May, according to the latest Federal Reserve report. Outstanding consumer rose by $12.3 billion in July from the prior month, marking a 3.6% increase. Credit rose at a revised 3.3% annual clip in June. The use of credit had sunk nearly 20% in April during the worst of the pandemic. The increase in borrowing occurred despite the expiration of extra federal benefits for workers who lost their jobs during the epidemic. Read: U.S. regains 1.4 million jobs in August and unemployment drops to 8.4% Also: Initial jobless claims fall to new pandemic low of 881,000 — but there’s a big catch What happened: Revolving credit, like credit cards, fell in July at a 0.4% annual clip. It was the fifth straight decline, but was the also the smallest drop since the pandemic began. Nonrevolving credit, typically auto and student loans, climbed 4.8% and rose for the third month in a row. Nonrevolving credit is more stable and less prone to sharp swings like the use of credit cards. The Fed report does not include mortgage borrowing. See:Marketwatch’s Coronavirus Economic Recovery Tracker Big picture: The rising use of credit is a good sign for the economy. Households saved more and slashed the use of credit early in the pandemic after much of the economy was locked down and tens of millions of people lost their jobs. What’s been the biggest surprise has been the increase in borrowing for new autos. Low rates and prices have enticed people who evidently feel secure in the jobs to snap up cars and trucks, giving a boost to the American manufacturing industry. The declining use of credit cards, meanwhile, appears ready to come to an end soon, though it’s unclear why. The end of federal benefits could be forcing people to dip into their savings. Alternatively, an improving economy and more people going back to work may have encouraged Americans to use credit as they typically do. Market reaction: The Dow Jones Industrial Average DJIA, +0.56%, S&P 500 SPX, +0.87% and Nasdaq COMP, +1.39% all declined in Tuesday trades."}]}