{"article": [{"url": "https://www.marketwatch.com/story/the-stock-market-is-a-great-speculation-at-this-point-and-its-time-to-raise-cash-billionaire-investor-warns-11600788079", "published": 1600791500.0, "headline": "The stock market is a 'great speculation' at this point, and it's time to raise cash, billionaire investor warns", "body": "Barry Diller Getty Images “ 'Personally, and professionally, every nickel you can, keep it wherever it's bankedâ\u0080¦ Generally, I think for any speculation, and I think the market right now is a great speculation, I would stay home.' ” That's billionaire media mogul Barry Diller in a CNBC interview on Tuesday urging investors to keep plenty of powder dry in light of just how far the stock market has come since bouncing off lows from earlier this year. Diller, the chairman of both Expedia EXPE, +0.36% and IAC IAC, +0.79%, warned that the uncertainty swirling around the election will only serve as another headwind for a market many believe has already gotten stretched. \"Each day from now until November is going to get more and more concerning, and more and more decisive, and more and more difficult,\" said Diller, who has backed Joe Biden to the tune of more than $600,000, according to Federal Election Commission data cited by CNBC. \"I actually think if I could wake up in mid-November, maybe it's even late November given what might be contested, I would rub that magic genie,\" he said, explaining that there could be an initial, but temporary, \"downdraft\" in the stock market if Biden wins. \"As far as business is concerned, I don't think long term there's going to be any particular difference\" between Biden and Trump as president, he added. \"I think there will be differences personally. I think people are going to pay higher taxes, particularly the wealthy. I think there are going to be things that are going to be done, really done, to deal with inequality.\" Watch this clip from the wide-ranging interview: .wsj-interactive.generic-iframe-embed[name=\"diller\"] { height: 349px; margin-bottom: 5px; } .at16units .bleed .wsj-interactive.generic-iframe-embed[name=\"diller\"] { height: 349px; } body.at12units .bleed .wsj-interactive.generic-iframe-embed[name=\"diller\"] { height: 349px; } body .inline .wsj-interactive.generic-iframe-embed[name=\"diller\"], body .offset .wsj-interactive.generic-iframe-embed[name=\"diller\"], body .header .wsj-interactive.generic-iframe-embed[name=\"diller\"], body.at8units .bleed .wsj-interactive.generic-iframe-embed[name=\"diller\"] { height: 349px; } body.at4units .inline .wsj-interactive.generic-iframe-embed[name=\"diller\"], body.at4units .offset .wsj-interactive.generic-iframe-embed[name=\"diller\"], body.at4units .header .wsj-interactive.generic-iframe-embed[name=\"diller\"] { height: 349px; } Cash wasn't the best place to be during Tuesday's trading session, with the Dow Jones Industrial Average DJIA, +0.56% up triple digits. The tech-heavy Nasdaq Composite COMP, +1.39% and S&P 500 SPX, +0.87% were also firmly in the green."}]}