{"article": [{"url": "https://www.marketwatch.com/story/the-medicare-enrollment-process-is-failing-seniors-and-needs-to-be-modernized-11602183719", "published": 1602169820.0, "headline": "The Medicare enrollment process is failing seniors and needs to be modernized", "body": "Getty Images/iStockphoto “As more Americans postpone retirement, a growing number are experiencing difficulties with Medicare enrollment that can saddle them with hefty penalties,” warns The Wall Street Journal. “The program is complicated,” adds the New York Times. “Medicare features an alphabet soup of plans, coverage choices, premium levels and enrollment rules.” “Enrolling in Medicare is a daunting task,” concludes The Washington Post. With Medicare’s open enrollment season set to begin soon, stakeholders, beneficiaries and policy makers agree: the process needs to change. Medicare is a promise that our government has made and faithfully kept to older Americans for 55 years. In recent history, we’ve built on the program’s success—extending its protections to Americans with disabilities in 1973, paving the way for Medicare Advantage in 1997, and adding prescription drug coverage in 2003. The problem? As Medicare improved, our enrollment system failed to catch up. For example, the Centers for Medicare & Medicaid Services (CMS) was created within the Department of Health and Human Services (HHS) to run Medicare in 1977 (originally under a different name), but the Social Security Administration (SSA) still handles Medicare enrollment—even as the ages for enrolling in Medicare and enrolling in Social Security have fallen out of alignment. Seniors are rightfully confused that when applying for health coverage they do not do so through the agency with “health” in the title. Seniors who do not receive Social Security benefits at age 65 must actively apply for Medicare Parts A and B. Missed deadlines could mean years of late enrollment penalties. In 2016, 800,000 Medicare beneficiaries paid such penalties, an estimated 20% of whom had no idea they missed a deadline. Most significantly, Medicare has evolved. Beneficiaries now have choices in how they receive benefits and can add prescription drug coverage and other supplemental coverage. The option between Traditional Medicare, the original fee-for-service model, and Medicare Advantage, the integrated care model, is not universally understood. A whopping 45% of seniors did not know that Medicare Advantage existed at their first open enrollment. Beneficiaries who fail to make a choice default into Traditional Medicare, which may not best suit their medical or financial needs. Research shows that 36% of seriously ill Traditional Medicare beneficiaries use up their life savings on health expenses and the average older beneficiary in Traditional Medicare spends $10,307 annually on out-of-pocket costs. In contrast, beneficiaries in Medicare Advantage save roughly $1,600 a year. The lack of clear information on enrollment options and deadlines impacts not only costs for seniors, but access to the care and benefits they need. It doesn’t have to be this way. The frustration with Medicare’s cumbersome enrollment system is fertile ground for sensible, achievable reforms. At Better Medicare Alliance, we’ve seen positive improvements in recent years, but more needs to be done. We recently partnered with consumer advocates, physician groups, health plans, and other stakeholders from across the health care spectrum to provide insights on both the problem and the solution. The result is a vision for a simplified, modernized enrollment process that puts beneficiaries first. Our plan will ensure that seniors have a single, trusted source for Medicare enrollment: HHS. We propose that CMS, operating within HHS, handle Medicare enrollment while HHS’s Administration for Community Living retain its oversight of State Health Insurance Assistance Program (SHIP) volunteers. Private agents and brokers also play an important role in this process, but HHS must take the mantle of leadership here. We further propose that HHS provide greater oversight of materials disseminated to beneficiaries. CMS should deploy a “CMS approved” seal for Medicare resources used by private entities that meet its standards for accuracy and completeness. Training and certification for volunteer counselors in SHIP should be consistent and mandatory across all states. With nearly 350 different languages spoken in U.S. homes, we also call upon CMS to translate Medicare resources into more languages to meet the needs of Medicare’s increasingly diverse beneficiary population, while updating its “Medicare & You” handbook with an eye toward ensuring various reading levels, cultural backgrounds, socioeconomic statuses and health needs, and accommodate those with special needs. As seniors have more Medicare options than ever before, it’s clear they need more time to make sense of their choices. We propose initiating beneficiary engagement and education upon their 64 birthday and ask CMS to reach out to employers with information and materials for employees, so those in the workforce are properly informed too. Finally, seniors need a single, modernized tool to compare all coverage options with beneficiary-specific information tailored to their unique circumstances. Even with positive changes made recently, CMS’s online Medicare Plan Finder tool is not fully living up to its promise. Medicare delivers vital health and financial protections and benefits, but its value is diminished when seniors cannot find their way in the door. We can fix this, and the time to act is now. Our recommendations offer a road map to ensure that every senior is an active and empowered participant in the selection of their health coverage. When it comes to something as personal as health care, we should accept nothing less. Allyson Y. Schwartz is president and CEO of the Better Medicare Alliance and represented Pennsylvania in the U.S. House of Representatives from 2005 to 2015."}]}