{"article": [{"url": "https://www.marketwatch.com/story/you-have-ample-savings-so-why-are-you-scared-of-running-out-of-money-2020-09-29", "published": 1601725400.0, "headline": "You have ample savings. So why are you scared of running out of money?", "body": "All of us have a history with money. We grow up with too little or too much — or fall under the sway of parents or others who influence our attitude about saving and spending. As we age, money often becomes an indicator of our emotional well-being. It’s fine to think about money frequently, enjoying its benefits and squeezing value from it. But it’s not healthy to fret about it constantly and let the “I-don’t-have-enough” worry eat away at you. Even some rich people express irrational fear of going penniless. In an honest moment, a financial adviser will admit that chronic worrywarts are high-maintenance clients. They require more hand-holding. What’s worse, they may not listen to reason. A little empathy goes a long way. Rather than dread these clients, savvy advisers ask gentle questions in an effort to uncover deeper concerns, motivations and memories. “I wouldn’t say the fear of never having enough money is irrational,” said Jim Ludwick, a certified financial planner in Las Vegas. “Most of the time, it’s because some friend or relative experienced adverse things and the client observed it up close. Their experience colors looking at their assets and liabilities objectively.” When clients tell Ludwick that they’re scared of running out of money, he starts by listening without interrupting. Then he repeats back what he heard to confirm understanding. From there, he asks questions such as, “Why are you raising this now?” “I try to understand the real source of their concern so that I can identify what’s triggering it,” he said. “I want to find out where their anxiety is coming from.” When wealthy clients insist that they might lose it all — or they’re beset by fear that their nest egg is too small — an adviser’s sensible appeal to data can backfire. All the facts and figures in the world can fall by the wayside if someone is unwilling to digest them. To allay such fears, Steve Jablonski takes a less-is-more approach. Rather than list all the reasons why a client is set for life financially, he will make his case succinctly. “We keep it as simple as we can,” said Jablonski, a certified financial planner in Norristown, Pa. “We want to deliver it in a way the client can understand.” Early in his career, Jablonski worked for a firm that produced a 125-page book to educate clients about their holdings. He recalls that about 75% of the material was boilerplate content that had nothing to do with the client. He soon abandoned that strategy in favor of teaming up with clients to customize their financial plan. “We build it together,” he said. “The client gets a three-page printout,” which tends to hit home and tamp down money worries. For some fretful clients, realizing that their adviser is making highly conservative assumptions can in itself offer some relief. They’re less apt to worry if they see that their adviser has considered worst-case outcomes and factored them into the plan. When Tony Zabiegala, an adviser in Independence, Ohio, works with anxious clients, he compares the assumptions he’s making with numbers often used in financial planning software. “I’ll tell clients the software assumes 7% rate of return and we use 5%,” he said. “Or it might assume you’ll live to 85. We use 95.” Some clients need some perspective to reduce their fear. Anxious about never having enough money, they may not realize that they’re hardly alone in their state of distress. Bjorn Amundson, a Minneapolis-based certified financial planner, cites research in which wealthy people were asked, “At what point would you feel comfortable with the amount of money you have?” Respondents with $5 million and even $10 million said they felt they needed more money to be comfortable. “There seems to be a psychological thing going on where you’ll never feel comfortable until you have something like $200 million in the bank,” Amundson said. “That may not be rational, but it’s totally human to be afraid of things regardless of what the odds are.” By sharing this with clients, Amundson assures them that they’re not alone in feeling antsy about not having enough. Once they see that their fear is normal, they’re able to focus on the facts and view their situation with more clarity and logic. Now read: When you want to retire but your partner doesn’t, money isn’t necessarily the real issue More: This mutual fund may have cracked the ‘Buffett Code’ — Berkshire Hathaway’s secret sauce"}]}