{"article": [{"url": "https://www.marketwatch.com/story/trumps-epa-dumps-methane-emissions-rule-for-oil-gas-fields-11597364947", "published": 1598779400.0, "headline": "Trumpâ\u0080\u0099s EPA dumps methane-emissions rule for oil and gas fields", "body": "In this March 12, 2020, file photo, the sun shines through clouds above a shale gas drilling site in St. Mary's, Pa. Associated Press HARRISBURG, Pa. â\u0080\u0094 President Donald Trumpâ\u0080\u0099s administration is undoing Obama-era rules designed to limit potent greenhouse-gas emissions from oil and gas fields and pipelines, having formalized the changes earlier this month in the heart of the nationâ\u0080\u0099s most prolific natural-gas reservoir and in the premier presidential battleground state of Pennsylvania. “ The oil and gas industry was responsible for nearly 30% of all U.S. methane emissions in 2018, while methane, in turn, accounted for 10% of the nationâ\u0080\u0099s greenhouse-gas emissions, according to the EPA. ” Andrew Wheeler, the Environmental Protection Agency administrator, signed the rollback of the 2016 methane-emissions rule in Pittsburgh in mid-August as the agency touted the Trump administrationâ\u0080\u0099s efforts to â\u0080\u009cstrengthen and promote American energy.â\u0080\u009d The EPA first proposed the rollbackÂ last year, accusing the administration of President Barack Obama of enacting a legally flawed rule, and agency officials said it would save companies tens of millions of dollars a year in compliance requirements without changing the trajectory of methane emissions. But states including California and a coalition of environmental advocacy groups warned that the changes are illegal â\u0080\u0094 not to mention a setback in the fight against climate change â\u0080\u0094 and expect to quickly sue to block it. â\u0080\u009cItâ\u0080\u0099s not only negligent, itâ\u0080\u0099s unlawful,â\u0080\u009d California Attorney General Xavier Becerra said in a statement. â\u0080\u009cWe wonâ\u0080\u0099t sit silently while the EPA allows this superpollutant to rapidly warm our atmosphere.â\u0080\u009d The White House took the event to Pittsburgh, the headquarters for many companies exploring the Marcellus Shale, the booming reservoir that vaulted Pennsylvania to the nationâ\u0080\u0099s No. 2 natural-gas state, behind Texas. â\u0080\u009cEPA has been working hard to fulfill President Trumpâ\u0080\u0099s promise to cut burdensome and ineffective regulations for our domestic energy industry,â\u0080\u009d Wheeler said in a statement. Reflecting the pervasive politics of the presidential campaign, Wheeler cast blame onto the Democratic presidential nominee, former Vice President Joe Biden, saying that â\u0080\u009cregulatory burdens put into place by the Obama-Biden Administration fell heavily on small and medium-sized energy businesses.â\u0080\u009d Pennsylvania is of prime importance in Novemberâ\u0080\u0099s presidential election, and the natural-gas industry is playing a central role in TV attack ads being aired in the state by Trumpâ\u0080\u0099s allies. “ Trump is eliminating the twice-yearly requirement for companies to inspect for methane leaks on equipment installed after 2015 at well sites and downstream segments. ” In recent years, preventing methane leaks from well-site equipment and pipelines has become important for regulators because methane is a potent greenhouse gas. The oil and gas industry was responsible for nearly 30% of the nationâ\u0080\u0099s methane emissions in 2018, and methane accounted for 10% of the nationâ\u0080\u0099s greenhouse gas emissions, according to the EPA. The Trump administration is eliminating the twice-yearly requirement for companies to inspect for methane leaks on equipment installed after 2015 at well sites and downstream segments, such as pipelines, compressor stations and storage tanks. Leaks must be fixed. Supporters of the rule maintained that, based on reports the companies file, it seemed to be helping reduce methane emissions. They also pointed to the EPAâ\u0080\u0099s acknowledgment in its technical analysis that its rule changes will increase emissions of methane and smog-forming compounds. Operators will still have to check equipment for leaks of smog-forming compounds at some higher-producing well sites, but Thursdayâ\u0080\u0099s changes relaxed those standards and producers wonâ\u0080\u0099t have to inspect pipelines or downstream equipment anymore. Any leaks they fix help capture methane, and companies say they have a financial incentive to voluntarily fix leaks to ensure that methane gets to customers, rather than going into the atmosphere. But, far more importantly, killing the methane emissions rule also blocks a legal requirement for the EPA to extend the rule to cover many more pieces of equipment installed before 2015, environmental advocates say. â\u0080\u009cWeâ\u0080\u0099ll see them in court because this is blatantly illegal,â\u0080\u009d said David Doniger, senior strategic director of the climate and clean energy program at the Natural Resources Defense Council. “ Shale oil and gas production in North America accounted for one-third of the total global increase in methane emissions over the past year. ” â\u0080\u0094 Cornell University ecologist Robert Hogarthâ\u0080\u0099s estimate Robert Howarth, an ecology professor at Cornell University, estimated that shale oil and gas production in North America accounted for one-third of the total global increase in methane emissions over the past year. Rolling back methane measures now is â\u0080\u009cdangerously reckless,â\u0080\u009d Howarth said. â\u0080\u009cMethane emissions are increasing rapidly, and the oil and gas industry is clearly part of the problem.â\u0080\u009d Peter Zalzal, an attorney for the Environmental Defense Fund, said that, without federal leadership, stronger state regulation will be even more important. Some states â\u0080\u0094 such as California, Colorado, Pennsylvania and Wyoming â\u0080\u0094 have methane standards that are comparable to or stronger than the EPAâ\u0080\u0099s 2016 rule. But many big oil and gas states â\u0080\u0094 such as Texas â\u0080\u0094 do not, Zalzal said. Oil and gas industry representatives pushed for the methane rollbacks, fearing more expensive rules covering emissions from older equipment. Smaller, independent operators hailed the changes as important to their survival. â\u0080\u009cThe issue for producers has never been whether regulations were necessary; it has always been whether the regulations were sound and cost effective,â\u0080\u009d the Independent Petroleum Association of America said. Still, some companies opposed a rollback, noting they had pledged to reduce emissions or pointing out that they were already exceeding the ruleâ\u0080\u0099s requirements. Some oil majors including BP BP, -0.74%, Shell RDS.A, +0.83% and ExxonMobil XOM, -1.47% have called on Trump to strengthen efforts to cap methane emissions. The Trump administrationâ\u0080\u0099s move is â\u0080\u009cfrustrating and disappointing,â\u0080\u009d Shellâ\u0080\u0099s U.S. president, Gretchen Watkins, said in a statement. In 2016â\u0080\u0099s election, Trump eked out a win in Pennsylvania â\u0080\u0094 the first Republican presidential candidate to capture the state since 1988 â\u0080\u0094 by piling up support with Pennsylvaniaâ\u0080\u0099s rural areas and working-class whites. Since then, Trump has eagerly promoted the stateâ\u0080\u0099s gas industry, underscoring his focus on shoring up his base as his appointees have moved to expand extraction on federal lands, boost the export of liquefied natural gas and restrict the ability of states to block pipelines. Meanwhile, a pro-Trump super PAC, America First Action, is running TV ads in Pennsylvania accusing Biden of wanting to ban â\u0080\u009cfracking,â\u0080\u009d the process that along with horizontal drilling has unlocked a torrent of oil and natural gas across the United States in the past decade. Bidenâ\u0080\u0099s campaign counters that that is flatly untrue. Biden, a native of Scranton, Pa., would only ban new gas-drilling permits on public lands, his campaign said, pointing out that about 90% of fracking is on private land. And while Trump often ridicules the science behind increasingly urgent warnings for immediate action to stave off the worst of climate damage by cutting fossil fuel emissions, Bidenâ\u0080\u0099s campaign said it recognizes that â\u0080\u009cclimate change is an urgent problem and that all Americans have the right to clean air and clean water.â\u0080\u009d"}]}