{"article": [{"url": "https://www.marketwatch.com/story/trump-administration-behaved-like-a-gangster-to-push-the-us-tiktok-deal-and-beijing-has-no-reason-to-approve-it-chinese-media-2020-09-23", "published": 1600925840.0, "headline": "The U.S. behaved like a 'gangster' to 'rob' TikTok from China and Beijing has 'no reason' to approve the deal: Chinese media", "body": "An agreement on the ownership of TikTok's U.S. operations approved by Washington last weekend is a \"dirty and underhanded trick\" based on \"bullying and extortion,\" state-owned English language newspaper China Daily wrote in an editorial on Wednesday. It went on to compare the U.S. administration to \"a gangster forcing an unreasonable and unfair business deal on a legitimate company.\" - The White House last weekend approved a deal that quickly showed the three signatory companies at odds over its interpretation. TikTok's Chinese owner, ByteDance, said it would own 80% of a new TikTok Global entity, while Oracle and Walmart, its U.S. future partners, insisted instead that they will control the company. - Global Times, an English language version of the Communist Party newspaper People's Daily, also denounced the Trump-approved deal on Wednesday, proclaiming in a headline that China wouldn't \"allow the U.S. to rob TikTok.\" The paper also quoted an expert describing Oracle's founder Larry Ellison as \"definitely an anti-China person.\" - ByteDance chose database software company Oracle ORCL, +0.42%  and retailer Walmart WMT, +1.00%  over technology giant Microsoft MSFT, +2.48%  when it was forced by Washington to hand over its U.S. operations under the threat of an outright ban. The U.S. government balked at a first version of the deal that kept the Chinese in control of the popular videosharing app. - \"Even if it means TikTok could be shut down complete in the U.S., China will not sit idle and allow the U.S. government to seize a Chinese asset so brazenly,\" the Global Times warned. Read:China flexes its muscles in Hong Kong with arrest of pro-democracy media tycoon Jimmy Lai The outlook: It looks like the White House-sanctioned deal wasn't quite a deal after all. But it is still hard to tell whether the Chinese media editorials signal Beijing's outright opposition to any form of agreement, or whether they just amount to a bit of saber-rattling before another compromise is found. However important it has become to the online lives of American and European teenagers, and to President Donald Trump's campaign against Chinese security threats, TikTok isn't seen by analysts as crucial to Beijing's interests. And in any case, the dispute about its ownership must be placed in the overall context of the tense and deteriorating U.S.-China relations. Read: From lockdowns to Brexit, the U.K. economy is heading toward a rough winter"}]}