{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-cases-climb-above-263-million-and-us-vaccine-program-head-sees-very-low-chance-of-vaccine-by-late-october-2020-09-04", "published": 1599228680.0, "headline": "Coronavirus update: Global cases climb above 26.4 million, and U.S. vaccine program's head sees very low chance of vaccine by late October", "body": "The number of confirmed cases of the coronavirus that causes COVID-19 worldwide rose above 26.4 million on Friday, with the U.S. accounting for about a quarter of that total, as a key member of the government's vaccine program said the chances of a vaccine being ready by late October are \"very, very low.\" Moncef Slaoui, a venture-capital investor and former GlaxoSmithKline PLC GSK, +1.10%  executive who heads up the government's Operation Warp Speed program, told NPR he cannot imagine trials producing data by the end of October. \"There is a very, very low chance that the trials that are running as we speak could read before the end of October, and therefore, there could be - if all other conditions required for an [EUA] are met - an approval,\" he said. \"I think it's extremely unlikely but not impossible.\" Slaoui's comments come amid growing concerns that the Trump administration may try to rush out a vaccine just in time for the November presidential election. Those concerns were fueled by the news that the Trump-appointed head of the Centers for Disease Control and Prevention has directed governors to do what is needed to have vaccine distribution centers ready in their states by Nov. 1. Dr. Howard Koh, a former assistant secretary of health and current professor of public health leadership at the Harvard T.H. Chan School of Public Health, said that, while speed is needed in developing a vaccine during a pandemic, \"we also need attention to safety. And the public needs to hear more about the attention to safety.\" In an interview with MarketWatch, Koh added his voice to a chorus of criticism of the recent emergency-use authorization granted by the U.S. Food and Drug Administration for convalescent plasma as a treatment for hospitalized COVID-19 patients, which experts say was granted without sufficient data to prove it's effective. FDA commissioner Stephen Hahn, also a Trump nominee, announced the EUA at a press conference with President Donald Trump on the eve of the Republican National Convention. Hahn was later forced to admit he misspoke at that briefing in describing the survival rate that plasma had produced in a study. \"It was fairly clear to me and many of my scientific colleagues that the data on [convalescent plasma's] effectiveness was not strong enough to proceed with an EUA,\" said Koh. \"There have been no definitive outcomes from randomized, placebo-controlled trials. The Mayo Clinic data that was held up as justifying authorization were analyses where everybody got convalescent plasma and there was no control arm.\" Koh also called for a national approach to managing the pandemic, which he said \"has been absent\" and \"allowed this pandemic to persist for way too long,\" and for a national face-mask mandate. Americans are heading into the Labor Day weekend after adding more than 44,000 new COVID-19 cases on Thursday. The U.S. now has 6.2 million confirmed cases of COVID-19, and 187,152 people have died, according to data aggregated by Johns Hopkins University. State and local officials are cautioning residents against large gatherings that would expose them to the virus and are urging them to continue to follow public safety instructions. New York City Mayor Bill de Blasio reminded New Yorkers that if they travel to a destination on the state's travel-advisory list, they will be obliged to quarantine for 14 days on return. Louisiana Gov. John Bel Edwards, who is working on the clean up after Hurricane Laura hammered the state in late August, issued his own warning at a Thursday press conference. \"We know the last surge in COVID-19 cases started with Memorial Day, and now we're about to have Labor Day. We don't want a repeat. If you celebrate, do so in way that is safe and use mitigation measures,\" he said. See:Trump urges Americans to 'remain vigilant' about virus over Labor Day weekend Dr. Anthony Fauci, head of the National Institute for Allergies and Infectious Diseases, said seven states - North Dakota, South Dakota, Arkansas, Iowa, Missouri, Illinois and Indiana - are at the highest risk for a surge in new cases this holiday weekend. \"We don't want to see a surge under any circumstances, but particularly as we go out the other side of Labor Day and enter into the fall,\" Fauci said in an interview with Bloomberg. \"We want to go into that with a running start in the right direction. We don't want to go into that with another surge that we have to turn around again.\" In other news: â\u0080¢ Brazil marked a grim milestone on Friday of more than 4 million COVID-19 cases, the Johns Hopkins data show. President Jair Bolsonaro has been widely criticized for his handling of the crisis, which he has consistently played down, even after testing positive himself. At least 124,614 Brazilians have died, second only to the U.S. There was a glimmer of hope in a statement from the Brazilian health ministry which said infections were slowing in recent days. â\u0080¢ Silvio Berlusconi, the former Italian prime minister who announced Thursday that he had tested positive, has been admitted to hospital, according to the party he led, Forza Italia. The 83-year-old was reported to be in isolation in his home in Arcore, near Milan. He is not in intensive care, according to news agency AGI, but rather in a room he often occupies at San Raffaele hospital, suggesting his condition is not serious. â\u0080¢ Actor Robert Pattinson has tested positive for COVID-19, forcing the temporary shutdown of production on \"The Batman,\" the latest iteration of the superhero story from Warner Bros., according to media reports. â\u0080¢ India counted more than 80,000 new cases of the virus on Friday, boosting its tally to 3.94 million, the Guardian reported. India is the worst hit country in Asia by COVID-19 and there are fears that the spread could accelerate in cities that are some of the most densely populated in the world. â\u0080¢ France has recorded nearly 9,000 new cases of COVID-19 in a 24-hour period, the highest daily number since the start of the outbreak, Agence France-Presse reported. France has identified 53 new clusters, and 46 patients have been placed in intensive care, bringing the total to 473, the agency reported. The French health agency has warned that the \"R\" rate of transmission remains at 1.3 across France, meaning that every 10 infected people are infecting 13 others. â\u0080¢ A group of Russian scientists said that two trials of the country's COVID-19 vaccine found it produced antibodies and caused no serious side effects, according to research published in medical journal the Lancet on Friday. The trials were small, each involving just 38 patients, and they were open and nonrandomized, meaning there was no placebo and the patients involved were aware they were being given the vaccine. The participants were aged 18 to 60 and were given an initial dose, followed by a booster 21 days later. \"The most common adverse events were pain at injection site (44 [58%]), hyperthermia (38 [50%]), headache (32 [42%]), asthenia (21 [28%]), and muscle and joint pain (18 [24%]),\" said the report. \"Most adverse events were mild and no serious adverse events were detected. \" The researchers acknowledged that more clinical trials are required and noted that the two small trials mostly involved men and younger, healthy volunteers. A Phase 3 trial involving 40,000 volunteers from different age and risk groups is planned, they said. Russia became the first country to register a COVID-19 vaccine in August, before it had completed Phase 3 trials, dismaying experts who fear it may come with safety issues that could stoke antivaccination and anti-science sentiment. The World Health Organization said at the time that Phase 3 trials are crucial for evaluating the safety of a vaccine.Latest tallies There are now 26.3 million confirmed cases of COVID-19 worldwide, the Johns Hopkins data shows, and 870,477 people have died. At least 17.6 million people have tested positive and recovered. India is third by cases and deaths after the U.S. and Brazil. Russia has fourth highest case tally at more than 1 million, followed by Peru, Colombia, South Africa and Mexico. Mexico has 616,894 cases and 66,329 fatalities, the fourth highest in the world. The U.K. has 344,655 cases and 41,626 deaths, the highest in Europe and fifth highest in the world. China, where the virus was first reported late last year, has 89,999 cases and 4,728 deaths. What's the economy saying? The U.S. regained 1.4 million jobs in August and the unemployment rate posted a surprisingly noteworthy decline to 8.4%, suggesting an economic recovery is still plowing ahead even if the pace of growth has slowed since the start of the summer, MarketWatch's Jeffry Bartash reported. The increase in hiring last month exceeded Wall Street's forecast. Economists polled by MarketWatch had forecast a 1.2 million gain. The employment picture was a bit softer after stripping out the hiring of 238,000 temporary U.S. Census workers and those who work in public education. Private-sector hiring rose by 1 million, down from 1.48 million in July, the government said Friday. The most positive news was a big drop in the official unemployment rate to 8.4% from 10.2%, marking the fourth straight decline. A separate survey of households showed a much larger number of people returning to work (3.76 million) and a sharp decline in the unemployed (down 2.8 million). Read also: Tech bloodbath aside, ride these two giants for the second half of the recovery, veteran analyst says The jobless rate shot up in April to a post-World War II high of 14.7% as most of the economy shut down. Since then it's fallen nearly by half, though the current unemployment rate probably exaggerates the improvement in the labor market. Several million Americans still haven't returned to the labor force since the start of the pandemic, and some 29 million were reportedly receiving jobless benefits as of the middle of last month. \"There are certain industries that are essentially stuck until the virus recedes further, such as air travel, sporting event and concert admissions,\" said Amherst Pierpont Securities chief economist Stephen Stanley. \"But for most of the economy, the return to normal is occurring inch by inch and day by day, with plenty more to come.\"What are companies saying? Carnival Corp. CCL, +0.51% CCL, +1.26%  confirmed that its Italy-based Costa Cruises is scheduled to restart sailing in Italy on Sept. 6. The company had previously announced Costa's restart on Aug. 11. â\u0080¢ Peloton Interactive Inc. PTON, +6.97% plans to introduce a cheaper treadmill and a higher-end exercise bike as it looks to grow its library of luxury fitness products due to strong demand for at-home exercise offerings during the pandemic. The company is prepared to launch a new Tread treadmill that will be priced under $3,000, according to a Bloomberg News story, compared with its original Tread offering that costs more than $4,000. The company intends to still sell the existing Tread as a more premium product featuring a slat design, according to the report, and it will be renamed the Tread+. Peloton's new treadmill will have a more inexpensive belt setup that's more in line with what other treadmills have, Bloomberg News said. The company is also reportedly looking to launch a higher-end stationary bike, called the Bike+, which will cost more than the company's existing $2,245 spin bike offering and prompt Peloton to reduce the price of that older model. Peloton didn't immediately respond to a MarketWatch request for comment. â\u0080¢ Athletic company Under Armour Inc. UA, +0.09%  UAA, -0.39%  will close all of its UA Brand House and UA Factory House retail locations in the U.S. for Thanksgiving on Nov. 26., as a way to thank workers for their efforts during the pandemic. \"This entire year has been unpredictable and for all of us, challenging in our own ways,\" said Patrik Frisk, CEO of Under Armour. \"It's important to take the time to acknowledge and celebrate the wins that we've accomplished throughout 2020.\" The company has more than 6,000 retail workers in the U.S. Stores will reopen on Friday, Nov. 27. â\u0080¢ Yum China Holdings Inc. YUMC, +0.50%, the Shanghai-based licensee of KFC, Taco Bell and Pizza Hut restaurant chains parent Yum Brands Inc. YUM, +0.08% priced its global and Hong Kong public offering, with the company raising HG$17.27 billion ($2.23 billion). The offering of 41.91 million shares was priced at HK$412.00, or the equivalent of $53.16. The stock, which has been listed on the New York Stock Exchange since October 2016, will start trading on the Stock Exchange of Hong Kong starting Sept. 10. Yum China said it plans to use the proceeds from the offering to expand its restaurant network, invest in digitalization and the supply chain and for working capital and general corporate purposes. It joins the many companies raising equity financing during the pandemic."}]}