{"article": [{"url": "https://www.marketwatch.com/story/uconn-becomes-first-fbs-program-to-cancel-football-season-over-coronavirus-2020-08-05", "published": 1596624380.0, "headline": "UConn becomes first FBS program to cancel football season over coronavirus", "body": "STORRS, Conn. (AP) — UConn canceled its 2020-2021 football season Wednesday, becoming the first FBS program to suspend football because of the coronavirus pandemic, as other schools had taken the Huskies off their schedules and the governor was reluctant to allow UConn to travel to states with high infection rates. “After receiving guidance from state and public health officials and consulting with football student-athletes, we’ve decided that we will not compete on the gridiron this season,” athletic director David Benedict said. “The safety challenges created by COVID-19 place our football student-athletes at an unacceptable level of risk.” See also: Dwayne ‘The Rock’ Johnson buys XFL for $15 million UConn had been scheduled to play its first season as an independent after leaving the American Athletic Conference. The Huskies had already been taken off the schedules of Illinois, Indiana, Maine and Mississippi by those schools, and games against North Carolina and Virginia remained uncertain, UConn officials said. Many of the Power Five conferences are playing league-only games this season. The Huskies began spring practice on Feb. 4 and were one of the only teams in the country to complete a full spring schedule. The team returned to campus in early July and no one has tested positive for the coronavirus, UConn officials said. The football team will remain enrolled in classes either in-person or virtually, and will keep access to facilities and support services under NCAA rules. “We engaged and listened to the concerns of our football student-athletes and feel this is the best decision for their health, safety, and well-being,” coach Randy Edsall said. “Our team is united in this approach and we will use this time to further player development within the program and gear ourselves to the 2021 season.” See also: Fresh off a $500 million contract, Patrick Mahomes buys ownership stake in the Kansas City Royals Connecticut Gov. Ned Lamont had expressed reluctance to allow the football team to travel to any state with a high virus infection rate. He said the team would be subject to the state’s 14-day quarantine rule upon its return to Storrs from away games. Connecticut, New York and New Jersey have travel advisories that require visitors from more than 30 states and Puerto Rico to quarantine for 14 days, with certain exceptions. UConn officials said they will be reaching out to season ticket holders in the coming days to explain refunds and other options."}]}