{"article": [{"url": "https://www.marketwatch.com/story/ipo-market-braces-for-another-7-deals-this-week-and-yet-another-blank-check-company-2020-07-27", "published": 1596003500.0, "headline": "IPO market braces for another 7 deals this week and yet another blank-check company", "body": "The U.S. initial public offering market is gearing up for another week with seven deals and yet another blank-check company, led by tax software provider Vertex which is expected to have a $2 billion valuation. The latest crop of deals comes after a week that saw seven companies go public, along with five blank-check companies, or special purpose acquisition vehicles (SPACs), including the biggest ever, that of Bill Ackman’s Pershing Square Tontine Holdings US:PSTH. A blank-check company, or SPAC, is a shell company that has no business until it acquires one or more. Ackman raised more than $4 billion and has two years to find an acquisition target. Read now:Billionaire Bill Ackman has a $4 billion ‘blank check’ to buy a company, but he hasn’t said which one The deals come at a time when the IPO market has been performing strongly, rebounding from a lull earlier in the year when the pandemic began to spread widely. The Renaissance IPO ETF IPO, +1.98% has gained 34% in the year to date, easily outperforming the S&P 500 SPX, +0.87% which is up 0.1%. While companies currently reporting second-quarter earnings are struggling with the impact of the pandemic, new listings have mostly performed well in recent weeks. Insurer Lemonade Inc. LMND, +12.82% gained a staggering 139% in its trading debut in early July, to snag the best first-trading day for an IPO in the year to date. U.S. companies have issued record amounts of stock in secondary deals too this year, and have issued record amounts of bonds and convertible debt. In case you missed it: Mad dash for cash drives biggest month for follow-on offerings since the financial crisis “More deals will close out an active July,” said Bill Smith, president of Renaissance Capital, which provides institutional research along with its IPO ETFs. “Our IPO calendar features a diverse group, including providers of pasture-raised eggs, US tax software, Brazilian education solutions, and Chinese electric vehicles.” Vertex is aiming to raise $317 million in its IPO. The family-owned company “has a track record of profitability and strong cash flow generation, and it has achieved growth at scale,” said Smith. “However, the company plans to increase spending to accelerate growth, and the IPO proceeds will go to debt (and) to fund an insider dividend.” The company will list on Nasdaq, under the ticker “VERX.” Other deals expected this week include Vital Farms, an ethical food company that is the biggest producer of pasture-raised eggs in the U.S., and aims to raise $125 million at a market valuation of $692 million. The company will list on Nasdaq, under the ticker “VITL.” Li Auto, a maker of electric SUVs in China, is expected to raise $855 million at a $7.9 billion market cap. That company will also list on Nasdaq, under the ticker ‘LI.” Vasta Platform VSTA, +0.27%, a Brazilian company that was spun out of private education group Cogna, is expected to raise $306 million at a $1.4 billion valuation. Vasta will list on Nasdaq, under the ticker “VSTA.” Rounding out the list are AlloVIR ALVR, -1.97%, a viral disease biotech planning to raise $251 million at a $1.0 billion market cap; Fathom Holdings (FTHM), a cloud-based real-estate brokerage planning to raise just $20 million; 1847 Goedeker GOED, +3.09%, an e-commerce platform for appliances and home goods planning to raise $10 million at a $58 million valuation; and SPAC Ace Convergence Acquisitions ACEV.U, which raised $200 million at a $250 million valuation late Monday. Ace is planning to target a business in the IT infrastructure software and chip sector. Blank-check companies have become a popular way to go public, as they can act as a backdoor into the market without the usual regulatory burden and costs of listing through a syndicated deal. SPAC issuers had raised a record $16.8 billion in proceeds in 2020 before the Pershing deal last week, surpassing the previous record of $12.1 billion. Ackman’s SPAC has a war chest “that could acquire virtually any of the world’s largest private companies (think Airbnb, Palantir, SpaceX, Bloomberg, Fidelity, etc.),” Smith wrote in commentary. Three other companies could also hit the market this week if their virtual roadshows allow for it, according to Renaissance. They are cloud hosting service provider Rackspace Technology RXT, -1.99%, health center chain Oak Street Health (OSH) and mortgage lender Rocket Companies RKT, +1.01%. The latter company, parent to mortgage lending giant Quicken Loans, set terms for its IPO on Tuesday. The company said it plans to offer 150 million shares priced at $20 to $22 each. The company would raise $3.300 billion. Rocket has applied to list on the New York Stock Exchange, under the ticker “RKT.” There are 20 banks underwriting the deal, led by Goldman Sachs. Proceeds of the deal will be used to purchase businesses and Class D stock from Rocket Cos.’ existing holding company, Rock Holdings Inc., which is owned by the company’s founder and chairman Dan Gilbert. Don’t miss:Quicken Loans is going public: 5 things to know about the mortgage lender"}]}