{"article": [{"url": "https://www.marketwatch.com/story/a-lurking-tension-threatens-to-break-the-bond-market-out-of-its-summer-doldrums-11594904374", "published": 1594890440.0, "headline": "A lurking tension threatens to break the bond market out of its summer doldrums", "body": "undefined A divergence between inflation-adjusted yields and inflation expectations could trigger a Treasury market selloff and potentially upend weeks of sideways trading, according to bearish bond investors. In the last few weeks, two components of Treasury yield — inflation expectations and the inflation-adjusted interest rate — have moved in opposite directions. Their divergence has effectively canceled each other out and left the nominal yields largely unchanged, creating the illusion of a sleepy market. “This feels like an unstable equilibrium to us,” said Gaurav Saroliya, director of global macro strategy at Oxford Economics. The 10-year U.S. real, or inflation-adjusted, yield traded at a multiyear low of negative 0.80%, while the 10-year breakeven inflation rate, or what investors in Treasury inflation-protected securities, or TIPS, forecast consumer prices to do over the next decade stood at 1.41% on Wednesday, up from 0.50% in mid-March. The 10-year Treasury yield TMUBMUSD10Y, 0.777% stood at 0.62% on Wednesday. Bond prices move in the direction of yields. Usually, the real yield moves in line with bond investors’ inflation expectations as both indicators are sensitive to economic growth hopes. It’s why many feel their current divergence cannot last indefinitely as it would imply a stagflationary scenario of higher inflation and lower growth, Saroliya said , a scenario that few predict. The negative correlation between inflation expectations and real yields is at its strongest outside of 2013 and 2009, according to the chart below from Société Générale. Analysts say this negative correlation between the two bond-market indicators could break down soon, with real yields set to rebound and follow the steady uptrend in inflation expectations. Their synchronized rise would therefore spark a selloff in long-dated Treasurys. Bond prices and yields move in opposite directions. Even though investors still expect the U.S. recovery to remain sluggish, many feel the downbeat economic message sent by ultra-low inflation-adjusted interest rates is much too pessimistic, and out of step with the reflationary signals sent out by higher equity values and recovering commodity prices. As for the rise in inflation expectations, these investors feel price pressures will eventually percolate into the economy in part because the Federal Reserve has signaled it is willing to keep rates low for several years and that the central bank would not prematurely tighten monetary policy even if inflation did finally return to the Fed’s 2% target. Philadelphia Fed President Patrick Harker said Wednesday he would support a monetary policy strategy of ” letting inflation get above 2% before we take any action with respect to the federal funds rate.” A higher breakeven rate “signals people think that the Fed will be active for a long, long time and we will be ultimately successful,” Tim Magnusson, senior portfolio manager at hedge fund Garda Capital, told MarketWatch. Exchange-traded funds focused on Treasury inflation-protected securities saw inflows of $2.28 billion for the week ended July 3, the largest inflow since April. The iShares TIPS Bond ETF TIP, +0.03% has gained more than 6% year-to-date, FactSet data show. To be sure, few traders are anticipating a return of inflation to pre-COVID levels. “Central bank stimuluses will definitely normalize inflation expectations. But what normal means now is just significantly lower than what it was pre-pandemic,” said Michael Lorizio, senior fixed-income trader at Manulife Investment Management, in an interview. So if bond investors think real yields and inflation expectations will synchronize and rise together, why haven’t long-dated government bonds sold off yet? Tom Graff of Brown Advisory says holders of long-dated bonds may misapprehend the Fed’s ability to tamp down on a surge in long-end rates, arguing the Fed’s forte is controlling short-dated interest rates. “Why are higher inflation expectations not translating into the Treasurys market at this moment? My best guess is there’s a bit of a push and pull from those that have become a little myopic over what the Fed controls,” said Graff. Investors have also learned to tread carefully around a one-way rally in government bonds. Graff pointed out that many bearish traders had shorted Treasurys in early June, sending the 10-year yield to a high of 0.96% after a strong May jobs report. But it only took a few sessions for the selloff to peter out, delivering painful losses to those betting against the bond market."}]}