{"article": [{"url": "https://www.marketwatch.com/story/united-airlines-warns-36000-workers-they-could-be-furloughed-this-fall-2020-07-08", "published": 1594242200.0, "headline": "United Airlines warns 36,000 workers they could be furloughed this fall", "body": "United Airlines is warning 36,000 employees — nearly half its U.S. staff — they could be furloughed in October, the clearest signal yet of how deeply the virus pandemic is hurting the airline industry. The outlook for a recovery in the airline industry has dimmed in just the past two weeks, as infection rates rise in much of the U.S. and some states impose new quarantine requirements on travelers. Airlines say they must shrink to match falling travel demand. American Airlines executives have said they could have 20,000 more employees than the airline will need this fall. United UAL, +0.32% told employees Wednesday that not everyone who gets a layoff notice will be furloughed. The company said job losses could be reduced if enough employees accept buyouts or early retirement by a deadline next week. The buyouts come at a price too, however. United said it would take a $300 million charge in the second quarter to cover voluntary departures so far. The company said it was unable to estimate the cost of workforce reductions for the rest of the year. If every U.S. airline matched United’s worst-case scenario of furloughs, it could be extrapolated to about 240,000 lost jobs nationwide, given United’s share of the domestic market. Helane Becker, an analyst for Cowen, predicted Wednesday that U.S. airlines will end 2020 with 150,000 to 200,000 fewer employees than they had at the end of 2019 — much bigger losses than she expected back in April. The notices that United sent out are meant to comply with a law requiring employers warn workers at least 60 days before mass job cuts. The furloughs could include up to 15,000 flight attendants, 11,000 customer service and gate agents, 5,500 maintenance workers and 2,250 pilots. “The United Airlines projected furlough numbers are a gut punch, but they are also the most honest assessment we’ve seen on the state of the industry,” said Sara Nelson, president of the Association of Flight Attendants. “This crisis dwarfs all others in aviation history, and there’s no end in sight.” United executives said any furloughs will take effect on or shortly after Oct. 1. United can’t lay off workers any sooner — that’s a condition of the $5 billion it got as its share of $25 billion in federal aid to help airlines cover payroll costs for six months. The flight attendants’ union and other airline labor groups are lobbying Congress for another $25 billion to protect jobs through next March. But a senior United executive expressed doubt that Congress would approve the spending in an election year. United has already cut capital spending by $2.5 billion and convinced thousands of employees to take unpaid leave. It has hoarded cash after raising billions in new borrowing — including mortgaging its MileagePlus frequent-flyer program. But with ticket sales sagging again, the Chicago-based airline is still losing about $40 million a day, executives said. Layoffs are “the last option left to protect the long-term interests of the company,” said the senior United official, who spoke to reporters on condition of anonymity. Executives said the notices covered 45% of the airline’s U.S. staff, most of whom are represented by unions. They would have reinstatement rights if United’s fortunes improve. Another 1,300 management and support staff will be laid off Oct. 1, the company said. Including international employees, United has a work force of about 95,000. Air travel in the U.S. plunged about 95% from March 1 until mid-April, then began a slow recovery. The number of U.S. air travelers around the July 4 weekend was the highest since mid-March, but was still down about 70% from a year ago. In recent weeks, the number of new reported cases of COVID-19 has roughly doubled to about 50,000 a day, with cases rising in Texas, Florida and California. Last month, New York, New Jersey, Connecticut and Chicago announced requirements that people arriving from states with high infection rates go into quarantine for 14 days, throwing up a new roadblock to travel. United’s bookings for flights at its hub in Newark, New Jersey, have slumped badly since the region’s governors announced the quarantine requirements, falling 84% from a year earlier. That compares with a 73% decline in bookings for United’s other destinations. Executives of other airlines have predicted their companies will be much smaller in October, and that air travel might not return to pre-pandemic levels for several years. Delta Air Lines DAL, +0.39% recently told employees that it will send layoff notices to more than 2,500 of its 14,000 pilots, but it has not publicly discussed the outlook for other workers. American AAL, +0.34% has not said whether it has issued layoff notices, but executives have encouraged workers to take buyouts. Southwest Airlines LUV, +1.89% said Wednesday it has not issued layoff warnings. Germany’s Lufthansa has warned that it might cut 22,000 jobs, Air France last week announced plans to eliminate 7,500 jobs, and Latin America’s two largest carriers have filed for bankruptcy protection. The International Air Transport Association estimates that global carriers could lose $84 billion this year. The airline trade group is lobbying governments to provide more financial help for carriers."}]}