{"article": [{"url": "https://www.marketwatch.com/story/after-trump-actions-on-unemployment-aid-stimulus-negotiators-can-only-talk-about-a-lack-of-relief-talks-11597081795", "published": 1597077740.0, "headline": "After Trumpâ\u0080\u0099s actions on unemployment aid, Mnuchin and Senate leaders can only talk about a lack of relief talks", "body": "Treasury Secretary Steven Mnuchin is seen in July. (Getty Images) Republican and Democratic party leaders in the Senate spent Monday much the same way they spent the prior two weeks before coronavirus talks collapsed Friday: Blaming the other side. Senate Majority Leader Mitch McConnell, speaking on the Senate floor after the dayâ\u0080\u0099s sessionâ\u0080\u0099s began in a week with no votes scheduled and few senators in attendance, said Democrats were hurting Americans in order to get their way. â\u0080\u009cRepublicans wanted to agree on the things we could agree to. Democrats said â\u0080\u0098our way or the highway,'â\u0080\u009d McConnell said. â\u0080\u009cOver the weekend, President Trump took steps to soften the blow of the Democratsâ\u0080\u0099 hostage tactics on American families who need help most,â\u0080\u009d McConnell said, referring to an executive order and several memorandums President Donald Trump unveiled Saturday that Trump said will provide some relief. Senate Democratic Leader Chuck Schumer responded on the Senate floor: â\u0080\u009cAfter days of arduous negotiations, Speaker Pelosi and I continue to run into Republican intransigence. They didnâ\u0080\u0099t see peopleâ\u0080\u0099s needs the way we did. They didnâ\u0080\u0099t see the depth and breadth of this crisis.â\u0080\u009d Read more: Stimulus talks appear to end with a whimper, not a bang In the wake of Trumpâ\u0080\u0099s actions, the dueling speeches by McConnell and Schumer gave little reason to think there was much movement imminent. Read more: Republican senator calls Trumpâ\u0080\u0099s stimulus executive order â\u0080\u0098unconstitutional slopâ\u0080\u0099 The picture McConnell and Schumer painted was in marked contrast to the one portrayed by Trump earlier in the day in a tweet, where he said Democrats are seeking a deal and Schumer and Pelosi want to meet. â\u0080\u009cThey know my phone number!â\u0080\u009d he said. iframe.twitter-tweet { width: 100% !important; } Schumer said neither he nor Pelosi had reached out by phone to the White House. â\u0080\u009cFables from Donald Trump. Fables,â\u0080\u009d Schumer said in an interview on MSNBC when asked about Trumpâ\u0080\u0099s assertion that they wanted a meeting. â\u0080\u009cI didnâ\u0080\u0099t call him. Speaker Pelosi didnâ\u0080\u0099t call him. No, we didnâ\u0080\u0099t call him.â\u0080\u009d In an interview on CNBC, Treasury Secretary Steven Mnuchin said the administration remained ready to deal, but only if a bargain made sense. â\u0080\u009cWhen [the Democrats] are reasonable, we can get deals done. If theyâ\u0080\u0099re going to be unreasonable, weâ\u0080\u0099re not going to get a deal done,â\u0080\u009d Mnuchin said. â\u0080\u009cIf thereâ\u0080\u0099s a fair deal to do, weâ\u0080\u0099ll do a fair deal.â\u0080\u009d Mnuchin called Democratic demands for more than $900 billion in aid to states, localities and tribes to offset lost revenues and increased expenses due to the coronavrus â\u0080\u009cabsurdâ\u0080\u009d and dismissed the idea of splitting the difference in areas where the two sides disagree on policy. But he noted two areas where there was widespread bipartisan agreement: Money to help schools and colleges reopen safely and a revival of the Paycheck Protection Program loan-forgiveness initiative for small businesses. â\u0080\u009cThe president will be more than happy to sign a standalone education bill. Well, letâ\u0080\u0099s get that done. Letâ\u0080\u0099s not hold up our kids,â\u0080\u009d Mnuchin said. While the White House proposal called for $105 billion, more than the May Democratic billâ\u0080\u0099s $100 billion, Pelosi has said they need more than the May figure and that she disagreed with the administrationâ\u0080\u0099s desire to give more money to schools that reopened with in-person classes. Asked when the two sides would get together again after two weeks of near-daily talks, Mnuchin said, â\u0080\u009cIâ\u0080\u0099m not going to comment on the specifics of the logistics of negotiations. I donâ\u0080\u0099t think that thatâ\u0080\u0099s helpful.â\u0080\u009d"}]}