{"article": [{"url": "https://www.marketwatch.com/story/bidens-newest-economy-plan-includes-8000-child-care-credit-universal-preschool-2020-07-21", "published": 1595343620.0, "headline": "Biden unveils $775 billion plan for universal preschool, expanded child and elder care", "body": "Joe Biden on Tuesday unveiled a $775 billion plan for child care and elder care that includes universal preschool and tax credits for lower-income families, the latest in a series of policy proposals leading up to next month’s Democratic convention. In a speech in New Castle, Del., the presumptive Democratic presidential nominee said if Americans want to reward work, “we have to ease the financial burden of care that families are carrying.” The former vice president calls for universal preschool for three-and four-year olds; offers low-income and middle-class families a tax credit of up to $8,000 to help pay for child care; and proposes eliminating the current waitlist for home and community services under Medicaid. Biden’s campaign says the 10-year plan will be paid for by “rolling back unproductive and unequal tax breaks” for real-estate investors making more than $400,000, as well as increasing “tax compliance for high-income earners.” The speech marked the third plank of what Biden calls his “Build Back Better” plan. Biden has previously announced a $2 trillion clean-energy plan and a $700 billion proposal aimed at increasing government purchasing of American-made products. Now see:Biden calls for $2 trillion in clean-energy spending and zero power-plant emissions by 2035. The plan comes as Biden is leading President Donald Trump in national polls of voters and in surveys of battleground states including Arizona and Pennsylvania ahead of the elections in November. Biden, who has criticized Trump for what he says is his failure to address the COVID-19 pandemic, charged that the president hasn’t been able to explain how he’ll help working families. “He’s quit on you. He’s quit on this country,” Biden said of the president. The Trump campaign said in a statement that Biden’s plans will translate to fewer jobs and higher taxes on middle-class families. “Just like the rest of the radical Democrats who have co-opted his campaign, the only thing Biden knows how to do is raise taxes, kill jobs, and pass regulations that strangle small businesses,” said the campaign."}]}