{"article": [{"url": "https://www.marketwatch.com/story/consumer-prices-jump-again-in-july-rebounding-from-pandemic-lows-but-inflation-still-low-2020-08-12", "published": 1597228640.0, "headline": "Consumer prices jump again in July, rebounding from pandemic lows, but inflation remains low", "body": "The numbers: The cost of many goods and services such as gas, automobiles, clothing and airfare rose in July in a rebound from pandemic lows, but inflation is still barely visible in the wake of a coronavirus-induced recession that sapped demand throughout the economy. The consumer price index rose 0.6% for the second month in a row, the government said Wednesday. Economists polled by MarketWatch had forecast a 0.4% advance. The cost of living had declined from March through May during the height of the crisis. The increase in consumer prices over the past 12 months, meanwhile, rose to 1% from 0.6% in June. Just seven months ago, at the start of 2020, the yearly pace of inflation had climbed to as high as 2.5%. Another closely watched measure of inflation that strips out food and energy also shot up 0.6% last month. The increase in the core rate was the largest since 1991, but it follows a record decline. The yearly increase in the so-called core rate moved up to 1.6% from 1.2%. Read:Fed’s Barkin says economy could suffer relapse without more Washington stimulus What happened: Higher gas prices accounted for about one-quarter of the increase in consumer inflation in July. The cost of oil has recovered from multiyear lows earlier in 2020, though prices are still relatively low. Prices for rent, medical care, new and used vehicles, auto insurance, passenger fares, apparel, and wireless phone and Internet service also rose. Even after these recent increases, however, many companies lack the power to raise them significantly further. Far fewer people are flying, going out to eat, booking hotel rooms or buying clothes for the office, among other things. “It mainly reflects a recovery in the prices of goods and services that were most affected during the early stages of the pandemic,” said Capital Economics’ chief U.S. economist, Paul Ashworth. The cost of food and recreation were among the few categories to show declines in prices. Food prices fell 0.4% after three large increases in a row. Read:Wholesale prices surge 0.6%, but don’t be fooled: Inflation no threat to the economy See: MarketWatch Economic Calendar Big picture: Inflation has been relatively tame since the Great Depression of 2007–09, and the coronavirus crisis is likely to keep it that way for the foreseeable future. Inflation is still running well below the Federal Reserve’s 2% target. The government in pumping trillions of dollars’ worth of aid into the economy, but only because demand was on the verge of collapsing. Inflation has been famously described as too much money chasing too few goods. Right now there’s simply not enough demand for goods and services either in the U.S. or abroad to stoke a sustained increase in prices. Read:The economy took another body blow from COVID-19 in July — just how bad was it? What they are saying?“At this point, it appears that the recent pickup in inflation has been more about the retracement from the lows in March and April rather than a telling sign of mounting price pressures,” said Jim Baird, chief investment officer at Plante Moran Financial Advisors. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% rose in Wednesday morning trades."}]}