{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-case-tally-tops-155-million-and-us-hits-405-million-as-virus-spreads-fast-in-florida-california-and-texas-2020-07-24", "published": 1595603900.0, "headline": "Coronavirus update: Global case tally climbs to 15.6 million and U.S. hits 4.07 million as virus spreads fast in Florida, California and Texas", "body": "The number of confirmed cases of the coronavirus illness COVID-19 climbed to 15.6 million on Friday, and the U.S. case tally hit 4.07 million as the virus continued to spread in the South and West and more states reported that health care systems are steadily being overwhelmed. President Donald Trump canceled the planned Republican National Convention events that were due to take place in hot spot Florida next month, after that state saw a record number of fatalities in a single day on Thursday at 173. The U.S. counted more than 1,000 deaths on Thursday, with more than 500 of them taking place in Florida, California and Texas. The U.S. death toll is now 144,780, according to data aggregated by Johns Hopkins University, The U.S. added more than 69,900 cases on Thursday to push the total above 4 million, according to a New York Times tracker. The spread has accelerated through the summer, climbing to 4 million from 3 million in just 15 days, as the Washington Post reported. In the early days of the outbreak it took 45 days to increase from 1 million to 2 million cases, and then took 27 days to rise to 3 million. Forty states have seen rising cases in the last 14 days, according to the Times tracker, led by Florida, Louisiana and Mississippi. Louisiana Gov. John Bel Edwards told reporters at a briefing that his state is nearing breaking point after its case tally rose above 100,000. Dr. Deborah Birx, coordinator of the White House Task Force created to manage the pandemic, took a more somber tone than usual on Friday on NBC’s “Today Show.” “I just want to make it clear to the American public: What we have now are essentially three New Yorks, with these three major states,” she said. “And so we’re really having to respond as an American people, and that’s why you hear us calling for masks and increased social distancing to really stop the spread of this epidemic.” The face mask issue continued to be a thorny issue with the American public with legal challenges against mandates extending to Oregon on Thursday, when conservative group Freedom Foundation filed a suit against Gov. Kate Brown. “Governors in left-leaning states all over the country are making up the rules as they go – and ignoring the procedural rules their own state laws set up,” Jason Dudash, the Freedom Foundation’s Oregon director, said in a statement on the group’s website. Last week, Georgia Gov. Brian Kemp sued Atlanta Mayor Keisha Lance Bottoms over her face mask mandate. Several Georgia cities have also filed suits, while counties and districts in other states, including California, have also launched suits. Public health experts have stressed that wearing face masks is key to containing the virus, along with frequent hand washing and social distancing. Robert Redfield, head of the Centers for Disease Prevention and Control, said at a recent news conference that if every American agreed to wear a mask, “over the next six weeks we could drive (the virus) into the ground.” Dr. Ezekiel Emanuel of the University of Pennsylvania, an oncologist, bioethicist and senior fellow at the Center for American Progress, reiterated his concern that the U.S. has squandered the last four months, “and it really is very, very depressing,” he said in an interview on MSNBC. “We’re really right back in March,” he said.Latest tallies The global death tally from COVID-19 stands at 634,954, the Johns Hopkins data shows, and at least 8.9 million people have recovered. Brazil is second to the U.S. with 2.3 million cases and 84,082 deaths. India is third measured by cases at 1.3 million, followed by Russia with 799,499 and South Africa with 408,052. The U.K. has 299,500 cases and 45,762 fatalities, the highest in Europe and third highest in the world. China, where the illness was first reported late last year, has 86,177 cases and 4,650 fatalities.What’s the economy saying? There was good news on the housing front Friday, when data showed sales of new single-family homes rose sharply in June for the second straight month, pushing the sales rate to its highest level in 13 years, as MarketWatch’s Greg Robb reported. The annual sales pace for U.S. new-home sales rose 13.8% last month to 776,000, the Commerce Department said Friday. That’s above the prior cycle high of 774,000 hit in January and is the strongest since July 2007, according to the Mortgage Bankers Association. Economists polled by MarketWatch had expected a June sales rate of 710,000, compared with an original May estimate of 676,000. On Friday, the government revised May’s rate to 682,000. That pushed the May rise in new home sales to 19.4% “The impact of falling mortgage rates — down 80 basis points this year — is more than offsetting the wave of Covid-induced job losses, which seem to be hitting younger renters rather than would-be homebuyers; the median buyer is 47 years of age, while the median restaurant employee is 29,” said Ian Shepherdson, chief economist at Pantheon Macroeconomics. See: America is facing an eviction crisis as moratoriums expire: ‘This is a potential catastrophe’ A separate report found the service sector lagging behind manufacturing, as some areas of the country have reimposed lockdown measures. IHS Markit said its U.S. flash manufacturing purchasing managers index rose to 51.3 in July from 49.8 in the previous month. The flash services purchasing managers index rose only to 49.6 from 47.9 in June. Any reading above 50.0 indicates improving conditions, while readings below that measure indicate contraction. The flash estimate is typically based on approximately 85%–90% of total survey responses each month. See:Baseball is back — here’s how U.S. sports leagues are returning during the pandemic The U.S. economy is experiencing the first-ever recession driven by the services sector. And economists are concerned because some key service sectors like travel, restaurants, and entertainment are not expected to recover soon given the pandemic. Manufacturing is slowly getting on its feet but is still experiencing headwinds. “The lack of growth is a disappointment,” said Chris Williamson, chief business economist at IHS Markit.What are companies saying? Three Dow Jones Industrial Average DJIA, +0.56% components reported earnings, starting late Thursday with chip giant Intel Corp., which disappointed with news of a delay in its next generation of semiconductor technology, MarketWatch’s Jon Swartz reported. Intel said it may actually use a third party to manufacture it as a contingency plan. Intel INTC, -1.03% stock was slammed after it reported along with second-quarter earnings that the introduction of its 7-nanometer chips would be delayed by at least six months. AMD AMD, -3.94% is already selling 7-nm semiconductors for servers and PCs; in chip parlance, nanometers, or nm, is the size of the transistors that go on a computer chip, with the general rule being that smaller transistors are faster and more efficient in using power. “We have identified a defect mode in our 7-nanometer process that resulted in yield degradation,” said Bob Swan, Intel’s chief executive, on a conference call late Thursday. “We’ve root-caused the issue and believe there are no fundamental roadblocks, but we have also invested in contingency plans to hedge against further schedule uncertainty.” See now: Intel admits another defeat with unprecedented manufacturing issues There was better news from American Express Co. AXP, +0.26%, which posted a surprise profit for the second quarter, but revenue that lagged estimates amid a fall in card member spending during the pandemic. Verizon Communications VZ, +0.23% beat on profit and revenue but its report showed negative impacts from the pandemic. The wireless operator estimates that both GAAP and adjusted EPS saw negative impacts of about 14 cents stemming from impacts to wireless service revenue and lower advertising and search revenue for Verizon’s media unit. Elsewhere, there was a setback for Moderna Inc. MRNA, +0.09%, one of the many companies working on a COVID-19 vaccine candidate. The U.S. Patent and Trademark Office ruled in favor of Arbutus Biopharma Corp. ABUS, +1.91% in a patent dispute between the companies, MarketWatch’s Jaimy Lee reported. The decision may mean that Arbutus will attempt to make a royalty claim to products developed by Moderna’s lipid nanoparticle delivery technology, which is currently being used to develop a COVID-19 vaccine. SVB Leerink’s Mani Foroohar said the ruling is a “disappointing turn” for Moderna, and “any meaningful royalty burden could hamper MRNA’s pricing flexibility and margin profile vs. other players in the SARS-CoV-2 vaccine market.” What It Would Take to Reach Herd Immunity for the Coronavirus Here’s the latest news on companies and COVID-19: • Fans of the iPhone will probably have to wait at least another month before shiny new models are unveiled. Apple Inc. AAPL, +1.74% is delaying its annual fall event until the latter half of October instead of early September, according to a tech blog. The company was forced to push back the event for the 5G-compatible iPhone 12 line because of production delays caused by the pandemic, the Japanese Apple blog Mac Otakara reported. Apple is expected to announce four new iPhones, with the 5G models available in November. • Boston Beer Co. SAM, -0.19%, maker of Sam Adams and other alcoholic beverages, reported an unexpected doubling of profit from the year before amid the pandemic. Chief Executive Dave Burwick credited “increases in our Truly Hard Seltzer and Twisted Tea brands and the addition of the Dogfish Head brands” for some of the demand gains. Boston Beer now expects full-year earnings of $11.70 to $12.70 a share, while analysts on average had forecast 2020 earnings of $9.84 a share. • eHealth Inc. EHTH, +0.40%, an online health insurance marketplace, reported an adjusted quarterly profit and sales that came in above expectations. Revenue rose 35% to $88.8 million. The company said the number of new paying members for all its Medicare products rose 40% to 72,651 people. • • ETrade Financial Corp. US:ETFC reported fiscal second-quarter results that slightly exceeded Wall Street estimates. The company also declared a quarterly cash dividend of 14 cents a share. • Honeywell International Inc. HON, +0.34% reported second-quarter profit and sales that fell, but beat expectations. The company said it expects sales challenges resulting from the pandemic will continue, particularly in the aerospace and oil and gas businesses. Aerospace sales declined 28% to $2.54 billion, but topped the FactSet consensus of $2.41 billion; performance materials and technologies sales declined 19% to $2.22 billion but topped expectations of $2.19 billion; safety and productivity sales slipped 1% to $1.54 billion to beat expectations of $1.43 billion; and building technologies sales shed 19% to $1.18 billion, missing expectations of $1.24 billion. • Toy maker Mattel Inc. MAT, -0.87% reported a narrower-than-expected second-quarter loss and sales that were higher than Wall Street expected, thanks to sales in North America and total sales of Barbie and other dolls and games. Online sales “continued to grow strongly in all regions.” Gross sales in North America increased 3%, primarily on sales of Barbies as well as action figures, building sets, and games, the company said. Sales of its toy vehicles, including Hot Wheels, fell, the company said. Mattel said its supply chain continued to perform well despite temporary closures connected to the coronavirus pandemic. “Currently all of our factories are open with minimal disruption to operations, as we enter the peak production season,” it said. Liquidity is expected to be enough “to effectively manage through the COVID-19 disruption and to continue to execute our strategy,” the company said. • Paramount Pictures will delay the release of two of its most anticipated movies, “Top Gun: Maverick,” and “A Quiet Place Part II,” to 2021 due to the pandemic. The “Quiet Place” sequel is now scheduled for April 23, 2021, and the “Top Gun” sequel is on tap for July 2, 2021. Paramount is a unit of ViacomCBS Inc. VIAC, -2.34% • ScanSource Inc. SCSC, -0.92%, a provider of barcode, networking, security and business communications services, provided an upbeat sales outlook, while also saying it will cut jobs as part of a expense-reduction plan. The company expects fiscal fourth-quarter net sales of $758 million, compared with the FactSet consensus for total revenue of $718 million. ScanSource announced a $30 million cost cutting plan, which will include a reduction of its North America workforce, salary reductions of 10% to 25% for its executive team, elimination of cash retainers for the board of directors for the rest of the year and cutting discretionary spending. The company is closing its Canpango professional services business, which it acquired in August 2018, which is expected to result in a $2 million charge. • Schlumberger Ltd. SLB, -1.21% swung to a multibillion-dollar loss in the second quarter and revenue fell short of estimates, as the twin effects of the pandemic and falling oil price weighed. “This has probably been the most challenging quarter in past decades,” Chief Executive Olivier Le Peuch said, as he announced 21,000 job cuts. Revenue fell 28% from the first quarter, “caused by the unprecedented fall in North America activity, and international activity drop due to downward revisions to customer budgets accentuated by COVID-19 disruptions. This speaks volumes about an industry confronted with historic oil demand and supply imbalances caused by demand destruction from the global COVID-19 containment effort.” The company is reorganizing and combining its 17 product lines into four divisions, restructuring geographically around five key basins of activity and streamlining management, he said. Schlumberger expects to remove $1.5 billion of costs permanently. “Looking at the macro view in the near-term, oil demand is slowly starting to normalize and is expected to improve as government measures support consumption,” said the CEO. “However, subsequent waves of potential COVID-19 resurgence pose a negative risk to this outlook.” • Skechers USA Inc. SKX, -1.75% reported a narrower-than-expected adjusted second-quarter loss and sales that were above expectations. “Skechers, like most businesses around the world, has never faced a more challenging time than during the pandemic, which caused the closing of nearly every market worldwide,” Chief Executive Robert Greenberg said. The company ended the quarter with cash and cash equivalents around $1.6 billion, thanks in part to drawing down $490 million from its credit facility in the first quarter. The company did not provide an outlook. • Office supply equipment retailer Staples became the latest to require face coverings in all its stores starting Monday. Staples is an essential retailer, selling hand sanitizer and other personal protective equipment (PPE) as well as equipment for working and schooling from home. Staples joins retailers like Walmart Inc. WMT, +1.00% and Target Corp. TGT, +1.14% that will require customers to wear face coverings in stores. See also: Christopher Nolan blockbuster ‘Tenet’ now delayed indefinitely due to coronavirus • Walt Disney Co.’s DIS, +1.53% “Mulan” — scheduled for release Aug. 21, and expected to be a summer blockbuster — has been delayed indefinitely because of theater closures and production shutdowns caused by the pandemic. The live-action movie has been repeatedly delayed. Additionally, Disney delayed releases of Star Wars and Avatar movies by a year. “Over the last few months, it’s become clear that nothing can be set in stone when it comes to how we release films during this global health crisis, and today that means pausing our release plans for ‘Mulan’ as we assess how we can most effectively bring this film to audiences around the world,” a Walt Disney Studios spokesperson said in a statement."}]}