{"article": [{"url": "https://www.marketwatch.com/story/weekend-reads-how-to-be-safe-with-or-without-a-face-mask-2020-07-02", "published": 1593885680.0, "headline": "Weekend reads: How to be safe, with or without a face mask", "body": "The rise in COVID-19 infections as many states reopen is alarming. State officials have blamed young people congregating in bars. In some states, bars are banned from serving alcohol, and plans to allow indoor dining are back on hold. But in many other states, indoor restaurants have reopened and stayed that way. Here’s detailed information about why you’re better off dining outside. And, wherever you are, wear a mask when you can to help stop the spread of coronavirus. More on staying safe (or not): American Airlines will fly at full capacity — only 3 U.S. airlines have blocked the middle seat on domestic flightsThe extra $600 The federal government’s addition of $600 a week for unemployment payments ends on July 31. Here’s what’s being proposed to extend or replace it. Related stories about the government’s coronavirus assistance: • House passes bill extending Paycheck Protection Program, sending to Trump for signature • Government tax watchdog: IRS should not waste time pursuing $1 billion in stimulus checks sent to dead people The Willamette Valley in Oregon. iStockphoto These COVID-19 treatments are actually working We’re all hoping for a coronavirus vaccine — sooner rather than later. William Petri, a professor of medicine at the University of Virginia in Charlottesville, rounds up treatments that are helping people recover from the virus right now, while also pointing out which treatments aren’t working. Related:Watch out for these 3 new coronavirus symptomsThree retirement destinations that may be ‘just right’ for you With so much in flux, it may surprise you that there are signs of renewed life in the real-estate market. Pending home sales rebounded tremendously in May, and there are other signs of a strong recovery for the housing market this summer. Silvia Ascarelli continues our series on ideal retirement destinations, this time helping a reader who wants to live where it isn’t too hot or cold, and where people of all different races will feel welcome. In other words, a “Goldilocks scenario.” Weigh in with your suggestions. Getty Images An excellent retirement problem to have Alessandra Malito answers a question most of us wish we were in a position to ask: Am I saving too much for retirement?Good news on unemployment, but the gains may slow The U.S. economy added (or recovered) 4.8 million jobs in May, with the unemployment rate falling to 11.1% in June from 13.3% in May. However, there’s good reason to expect the pace of improvement to decline over coming months.Has Trump been able to drain the swamp?’ President Trump famously said he wanted to “drain the swamp” in Washington, D.C., referring to the influence of lobbyists over members of Congress. Here’s how well that has been going, according to Issue One, a nonpartisan watchdog. Where to earn some interest on your cash If you have a savings account or money-market account, it is likely that your interest rate has fallen below 0.10%. But Mark Hulbert has four alternatives that can earn you decent yields with low risk. Getty Images Investment strategy in a distorted market One traditional strategy for long-term investors is to have a portfolio that is split, with a 60% allocation to stocks and a 40% allocation to bonds. But with interest rates so low (and bond prices so high), that strategy might backfire from here. J.P. Morgan has an idea about tweaking investment allocation. Burton Malkiel, author of “A Random Walk Down Wall Street,” says he is believes the old 60/40 portfolio is a bad idea. Your retirement investment strategy It is very important to pay attention to investment returns in your retirement account. Paul Merriman explains that an extra 0.5% return a year can greatly increase your wealth.These health-care stocks should perform well no matter who wins the election in November Here are six health-care stocks of companies that should thrive no matter what changes are made to the U.S. health system. The Tesla plant in Fremont, Calif. Associated Press Tesla tears it up Shares of Tesla Inc. TSLA, +1.89% more than doubled during the second quarter. And now that the electric-car pioneer has blown past its expected quarterly car deliveries, some analysts say the shares can come close to doubling again. Competition:A first look at the 2021 Polestar 2, Volvo’s all-new EV"}]}