{"article": [{"url": "https://www.marketwatch.com/story/heres-the-truth-about-mail-in-voting-fair-safe-and-honest-11594920269", "published": 1596104180.0, "headline": "Hereâ\u0080\u0099s the truth about mail-in voting: fair, safe and honest", "body": "A women puts her ballot in a box while voting from her car Utah on June 30. Getty Images As millions of Americans prepare to vote in November â\u0080\u0094 and in many cases, primaries and state and local elections through the summer as well â\u0080\u0094 lots of people are talking aboutÂ voting by mail. It is a way toÂ protect the integrity of the countryâ\u0080\u0099s voting systemand to limit potential exposure to the coronavirus, whichÂ continues to spread widelyÂ in the U.S. I am a political scientist and part of a National Academy of Public Administration working group offering recommendations toÂ ensure voter participation as well as public confidenceÂ in the election process and the outcome during this coronavirus pandemic. To meet that goal, our work has found that state and local governments will need to make significant adjustments to their voting systems this year â\u0080\u0093 changes that will likely require new federal funding. Our recommendations â\u0080\u0094 which include ways to reduce health risks from in-person voting as well asÂ to expand access to, and ease the process of, mail-in votingÂ â\u0080\u0094 are based on a thorough review of the evidence. Some critics, including President Donald Trump on several ocaasions, haveÂ cast doubt on the integrity of mail-in voting, even though some of them haveÂ voted by mailÂ in the past. iframe.twitter-tweet { width: 100% !important; } Conservative groups areÂ suing to limit mail-in voting, and someÂ federal judges seem reluctantÂ to defend votersâ\u0080\u0099 rights if it means intervening in state-level decisions. The presidentâ\u0080\u0099s reelection campaign is suing to block mail-in voting at the same time itÂ pushes his backers to be readyÂ to vote by mail. The evidence we reviewed finds that voting by mail is rarely subject to fraud, does not give an advantage to one political party over another and can in fact inspire public confidence in the voting process, if done properly. .wsj-interactive.generic-iframe-embed[name=\"map1\"] { height: 550px; margin-bottom: 5px; } .at16units .bleed .wsj-interactive.generic-iframe-embed[name=\"map1\"] { height: 550px; } body.at12units .bleed .wsj-interactive.generic-iframe-embed[name=\"map1\"] { height: 550px; } body .inline .wsj-interactive.generic-iframe-embed[name=\"map1\"], body .offset .wsj-interactive.generic-iframe-embed[name=\"map1\"], body .header .wsj-interactive.generic-iframe-embed[name=\"map1\"], body.at8units .bleed .wsj-interactive.generic-iframe-embed[name=\"map1\"] { height: 550px; } body.at4units .inline .wsj-interactive.generic-iframe-embed[name=\"map1\"], body.at4units .offset .wsj-interactive.generic-iframe-embed[name=\"map1\"], body.at4units .header .wsj-interactive.generic-iframe-embed[name=\"map1\"] { height: 550px; } Voter fraud is rare overall, and rarer by mail When fraud does occur, election administrators identify it and take action, correcting election returns and prosecuting those responsible. Thatâ\u0080\u0099s what happenedÂ in North Carolina in 2018, when a Republican political activist paid others to collect incomplete absentee ballots so they could be filled out to vote for the Republican candidate. The activist was arrested, charged and convicted â\u0080\u0094 and the entire election was invalidated and run again. But overallÂ election fraud is rare. AÂ database of election fraud reportsÂ maintained by the conservative Heritage Foundation reports approximatelyÂ 1,200 allegations of voter fraudÂ â\u0080\u0094 for which there were 1,100 criminal convictions â\u0080\u0094 for voter fraud since 2000. Of those, only 204 allegations, and 143 convictions, involved mail-in ballots. That is a tiny fraction of the roughly 250 million mail-in ballots cast over those two decades. In addition,Â problems are extremely rareÂ in states that rely primarily on vote by mail. Of course, any voting system must be protected against fraud. Election officials are already doing that, including prosecuting fraud attempts.No partisan advantage Allowing people to vote by mail does not give one party an advantage over the other â\u0080\u0094 either in terms of party members who turn out to vote, or the outcome of the election. Thatâ\u0080\u0099s the finding fromÂ severalÂ recentÂ studies, which confirm what earlier research had found. As far back as 2001, Oregonâ\u0080\u0099s vote-by-mail system was foundÂ not to disproportionately mobilize or discourageÂ voting by Democrats or Republicans. In 2008, a study foundÂ little difference between Democratic and Republican votersÂ in Los Angeles County in terms of who voted by absentee ballot or whose ballots were disqualified. A recent survey has found that people of all political stripes who are concerned about the coronavirus pandemicÂ support letting everyone voteÂ by mail. Milwaukee residents wait in long line to vote on April 7. Getty Images The public can learn to trust mail-in voting There is one problem with mail-in voting, but itâ\u0080\u0099s a problem with voting overall: A 2019 Gallup poll found thatÂ 59% of Americans lack confidenceÂ in the honesty of elections for a range of reasons, including concerns about interference from foreign powers or domestic political elites, security worries and general frustration. Americansâ\u0080\u0099 confidence isÂ lower than that reportedÂ in almost every other democratic country. With voting by mail, research has found people to be more concerned that their vote will not be counted correctly, as compared with voting in person. One 2008 study found thatÂ white absentee voters were less confidentÂ their ballots would be counted correctly than white in-person voters. A 2008 telephone survey found thatÂ about half of respondents were concerned that mail-in voting might lead to increased fraud, though the report on survey results didnâ\u0080\u0099t describe specific types of fraud the respondents feared. Research from 2015 mostly confirmed those findings, revealing that people in states with more absentee votingÂ tend to believe that various types of voter fraud are more common. That same study also found thatÂ absentee voters are less confidentÂ their vote will count than people who voted in person either before Election Day or on the day itself. Some concerns about mailed-in ballots not being counted may be legitimate: A 2018 study in Florida found that mailed-in ballots from younger voters and voters who needed assistance marking their ballotsÂ were rejected more oftenÂ than others. That indicates standards for rejecting mailed-in ballots may not be uniform, or that some votersâ\u0080\u0099 signatures change over time in ways election officials may not expect or accept. However, research from California in 2011 found that frequent public communication from election officials canÂ increase votersâ\u0080\u0099 faith in voting by mail. Mail-in voting is safe, reliable and trustworthy All this evidence leads to some clear conclusions: Voting by mail is â\u0080\u0094 or, with training of election officials and the use of common standards, can be made â\u0080\u0094 just as honest as in-person voting. Officials can help ensure public confidence by being transparent and communicating their plans and preparations. People are more interested in voting by mail than ever before, because of the pandemic. Epidemiology indicates thatÂ voting from home is saferÂ than going to a crowded public building to vote. Novemberâ\u0080\u0099s election will likely involve far more mail-in voting than in the past. To retain votersâ\u0080\u0099 confidence in its integrity, our review indicates that local election offices and the U.S. Postal Service will need toÂ make substantial additional preparationsÂ toÂ provide mail-in ballotsÂ and to handle theÂ increased volume of mailed-in ballots. And the public needs to understand that the results of the voteÂ may not be clearÂ for days after Election Day. It takes longer for election workers to open, verify signatures, and count mail ballots than it does to run voting machines, and some states â\u0080\u0094 such as Michigan â\u0080\u0094 do not permit mail ballots to be opened until Election Day. But when the tallies are announced, if large numbers of Americans have voted by mail, the public can feel confident that the process was fair and the results are accurate. Edie Goldenberg is a professor of public policy and a professor of political science at the University of Michigan in Ann Arbor. This was first published by The Conversation â\u0080\u0094 â\u0080\u009cResearch on voting by mail says itâ\u0080\u0099s safe â\u0080\u0093 from fraud andÂ diseaseâ\u0080\u009c .wsj-interactive.generic-iframe-embed[name=\"counter1\"] { height: 1px; margin-bottom: 5px; } .at16units .bleed .wsj-interactive.generic-iframe-embed[name=\"counter1\"] { height: 1px; } body.at12units .bleed .wsj-interactive.generic-iframe-embed[name=\"counter1\"] { height: 1px; } body .inline .wsj-interactive.generic-iframe-embed[name=\"counter1\"], body .offset .wsj-interactive.generic-iframe-embed[name=\"counter1\"], body .header .wsj-interactive.generic-iframe-embed[name=\"counter1\"], body.at8units .bleed .wsj-interactive.generic-iframe-embed[name=\"counter1\"] { height: 1px; } body.at4units .inline .wsj-interactive.generic-iframe-embed[name=\"counter1\"], body.at4units .offset .wsj-interactive.generic-iframe-embed[name=\"counter1\"], body.at4units .header .wsj-interactive.generic-iframe-embed[name=\"counter1\"] { height: 1px; }"}]}