{"article": [{"url": "https://www.marketwatch.com/story/chicago-feds-evans-says-stalled-stimulus-negotiations-are-an-unfortunate-development-for-the-economy-2020-08-09", "published": 1596977900.0, "headline": "Chicago Fedâ\u0080\u0099s Evans says stalled stimulus negotiations are â\u0080\u0098an unfortunate developmentâ\u0080\u0099 for the economy", "body": "The stalled efforts by White House officials and Congressional Democrats is â\u0080\u009can unfortunate developmentâ\u0080\u009d for the U.S. economy, said Chicago Fed President Charles Evans on Sunday. Fiscal policy has been unbelievably important during the initial phase of the shutdown of the economy, and it continues to be important as â\u0080\u009cweâ\u0080\u0099ve not control over the virus spread,â\u0080\u009d Evans said, in an interview on CBSâ\u0080\u0099s â\u0080\u009cFace the Nation.â\u0080\u009d â\u0080\u009cAnother support package is really, in my opinion, important,â\u0080\u009d he said. Fed officials have taken aggressive action to battle the coronvirus. They have slashed interest rates to zero, bought trillions in Treasurys and mortgage-backed securities and set up almost a dozen lending programs to support financial markets, midsized businesses, and but corporate and municipal bonds. Still Fed officials admit public health efforts and spending by Congress are more important to the health of the economy. â\u0080\u009cThe path of the economy will depend significantly on the course of the virus,â\u0080\u009d the Fed said in its latest policy statement. Read: What Congress decides on jobless claims will influence outlook, Evans says The Chicago Fed president said he didnâ\u0080\u0099t think another shutdown would be adopted so it was important to provide funds for testing, contract tracing and isolating people to try to get a hold of the virus. â\u0080\u009cWhat we need is public confidence so that people feel good about going back to work, they feel safe they can go out to retail establishments and enjoy leisure and hospitality that put people back to work,â\u0080\u009d Evans said. Evans said that state and local governments need assistance. The most pessimistic scenarios facing the economy involve local governments having to cut jobs, he said. An extension of the Payroll Protection Program would also be helpful, he said. These two provisions are not included in the presidentâ\u0080\u0099s executive orders."}]}