{"article": [{"url": "https://www.marketwatch.com/story/pound-nudges-higher-as-sunak-rolls-out-successor-to-furlough-program-11600948419", "published": 1600943000.0, "headline": "Pound nudges higher as Sunak rolls out successor to furlough program", "body": "A video grab from footage broadcast by the U.K. Parliament's Parliamentary Recording Unit shows Chancellor of the Exchequer Rishi Sunak speaking as he presents his Winter Economy Plan in the House of Commons in London on September 24, 2020. -/Agence France-Presse/Getty Images The pound edged higher on Thursday as Chancellor Rishi Sunak rolled out the successor to the expiring job furlough program. The pound GBPUSD, +0.83% traded at $1.2733 vs. $1.2726 on Wednesday as the successor program had been expected, particularly in light of the new restrictions imposed in England as well as the other nations of the U.K. in response to rising coronavirus infections. It will replace the Coronavirus Jobs Retention Scheme, which covered the majority of salary for fully furloughed staff. From November, the U.K. will subsidize by 22% the pay of employees working at least 33% of their normal hours, so that they receive at least 77% of their normal pay. This program will run for six months. iframe.twitter-tweet { width: 100% !important; } Sunak also rolled out a program for the self-employed, and extended a value-added tax cut for the tourism and hospitality sectors. “The [Job Support Scheme] appears to be a decent compromise in the sense that it transfers some of the costs from government to firms with enough flexibility for firms to choose their staffing levels. This should limit the rise in unemployment towards the end of the year, which we previously though would roughly double to 2.8 million. But of course there is no cost-free, magic bullet to prevent joblessness rising from current levels,” said Philip Shaw, chief economist for Investec in London. The broader FTSE 100 UKX, +0.64% slipped 1% after a bleak end to Wall Street trading on Wednesday, where traders have now largely given up on the prospect of a second U.S. stimulus package. Smiths Group SMIN, +1.08% shares dropped 8%. The U.K. engineering group reinstated its dividend as its pretax profit from continuing operations slumped due to the planned separation of Smiths Medical, as well as £24 million in write-downs. Outside the FTSE 100, Pets At Home PETS, -1.38% shares rose 22% as the U.K. pet supplies retailer said underlying pretax profits would be ahead of the £73 million pound consensus. It said it had double-digit like-for-like sales growth through the eight weeks to Sept. 10."}]}