{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-slide-for-3rd-session-setting-stage-for-first-back-to-back-weekly-skid-since-march-2020-08-21", "published": 1598023580.0, "headline": "Gold prices inch higher to halt skid, but mark first back-to-back weekly fall since March", "body": "Gold futures eked out a tiny gain on Friday to halt a third consecutive slide, but the precious metal’s advance for the day wasn’t sufficient to avoid the first back-to-back weekly declines since the COVID-19 pandemic began in March. Experts say that a resurgence in the U.S. dollar gave investors some pause in buying bullion because the commodity is priced in the currency and a stronger dollar can make gold comparatively more expensive to overseas investors. The dollar was up 0.5% on Friday, paring a sharper rise earlier in the session but also putting a measure of the buck against a half-dozen currencies, the ICE Dollar Index, on track for a weekly rise of 0.2%, prompted partly by comments from the Federal Reserve that implied that the central bank isn’t yet willing to implement unconventional strategies to hold interest rates lower for longer amid the COVID-19 pandemic. “Gold bulls have been missing in action this week as investors digested the latest Fed minutes which temporarily injected life into the dollar,” wrote Lukman Otunuga, senior research analyst at FXTM, in a Friday note. Still, the FXTM analysts sees the longer-term outlook for the yellow metal as strong. “Regardless of recent losses, the fundamentals remain in favour of higher gold prices with a rebound potentially on the cards,” Otunuga wrote. He said that weakness in government debt rates, with the 10-year Treasury note yield TMUBMUSD10Y, 0.777% trading between a range of 0.80% and 0.60% in recent weeks, concerns about the outcome of the U.S. presidential election and the path for the economy in the aftermath of the race for the White House as bullish factors for bullion. “A broadly weaker Dollar, negative US yields, pre-election jitters and rising coronavirus cases in the United States are likely to keep gold shining in the medium to long term,” he said. On top of that, analysts at UBS said that gold can serve a place in a diversified portfolio “as a way to capture the economic recovery,” and “a portfolio hedge in a low-rate environment.” Meanwhile, on Thursday, former Vice President Joe Biden formerly accepted the Democratic presidential nomination and cast himself as a capable leader prepared to steer the nation out of the coronavirus pandemic, setting the stage in November for a battle with Republican incumbent President Donald Trump. December gold GCZ20, +2.17% GC00, +2.17% picked up 50 cents, or less than 0.1%, to settle at $1,947 an ounce, marking a weekly decline of 0.1%, based on last Friday’s settlement for the most-active contract. The decline marks gold’s second straight weekly decline since a similar stretch ended March 20, according to FactSet data. Meanwhile, December silver prices US:SIU20, the most-active contract, fell 42.4 cents, or 1.5%, to end at $26.877 an ounce, with the metal notching a weekly decline of 3%, based on the most active contract. In other metals, September copper US:HGU20 declined 5.7 cents, or 1.9%, to settle at $2.9175 a pound, but mark a weekly gain of 2%. Separately, October platinum PLV20, +3.99% shed 80 cents, or less than 0.1%, to finish at $926.10 an ounce, and logged a 3.4% weekly drop, while September palladium US:PAU20 declined $6.60, or 0.3%, to settle at $2,180.30 an ounce, but marking a weekly climb of 1.7%."}]}