{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-stays-steady-as-investors-wait-for-fed-meeting-to-kick-off-2020-07-28", "published": 1595953280.0, "headline": "10-year, 30-year Treasury yield plumb three-month low as investors eye Fed meeting start", "body": "U.S. Treasury yields slipped Tuesday as the Federal Reserve kicked off its two-day meeting, where the central bank may offer clues on how monetary policy might evolve in the coming months.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 2.8 basis points to 0.581%, its lowest since April 21, while the 2-year note rate TMUBMUSD02Y, 0.156% was down 1.2 basis points to 0.141%. The 30-year bond TMUBMUSD30Y, 1.576% declined 2.9 basis points to 1.223%, its lowest since April 28. What’s driving Treasurys? The Fed began its two-day proceedings though the central bank is not expected to make any tweaks to its benchmark interest rate. Fed Chairman Jerome Powell could offer guidance on monetary policy at the post-meeting press conference as the economic recovery stalls due to rising coronavirus cases in several U.S. states and the reinstatement of lockdown measures to combat the disease’s spread. The U.S. central banks announced on Tuesday its board of governors had decided to extend seven of its emergency lending programs until the end of the year. The programs had been set to expire on Sept. 30. See: Fed puts $18 trillion U.S. government bond market under lockdown Read: Fed won’t be happy with how the economy is performing, but is not perturbed enough for aggressive action The Senate outlined their fiscal stimulus proposal on Monday. Divisions between Democrats and Republicans over the extension of unemployment benefits and other issues could stymie negotiations in Congress, amid worries a delay to a bill could hit consumers as their hopes for an economic rebound dissipate. In U.S. economic data, consumer confidence swooned in July amid a rash of new coronavirus cases. The index of consumer confidence fell to 92.6 this month from a revised 98.3 in June, the Conference Board said Tuesday.What did market participants’ say? “I see this meeting as kind of kicking off a months-long process on how they think about monetary policy and how to conduct it going forward. The current framework is designed for a pretty solid growth environment,” said Atul Bhatia, a portfolio strategist at RBC Wealth Management, in an interview. “It makes very little practical difference in the short-term. It’s perfectly consistent with how they don’t want to rock the boat. It’s a cost-less way of showing you’re still a player and you’re still support lending,” said Bhatia, referring to the Fed’s decision to extend the duration of its lending programs."}]}