{"article": [{"url": "https://www.marketwatch.com/story/apple-patents-reveal-ambitions-in-augmented-reality-and-more-2020-06-25", "published": 1593101360.0, "headline": "Apple patents reveal ambitions in augmented reality and more", "body": "Apple Inc.’s latest software announcements may have been fairly standard, but the company has some tricks up its sleeve — at least if its patent filings are any indication. A review of Apple’s AAPL, +1.74% patent library reveals a deep focus on wearables, health, augmented reality and autonomy, according to Bank of America analyst Wamsi Mohan. “In our opinion, there is a large effort underway on new product development, clues to which are hidden in the patent applications,” he wrote in a Thursday note to clients. Opinion: Apple says more with its quiet actions than on the WWDC keynote stage Mohan said that investors often tell him that Apple is showing an “apparent lack of ongoing innovation,” but that in his view, the company’s wide-ranging ambitions are being obscured by the size and success of the iPhone business. Apple is active with the U.S. Patent and Trademark Office, applying for 2,090 patents and receiving 2,490 granted patents just last year, though it’s worth noting that many patented technologies never see the light of day. Still, Apple’s patent filings convey a strong interest is building up the Apple Watch’s health capabilities. Apple has applied for patents for Apple Watch technology that would measure dyskinesia and tremor symptoms, and it’s been granted one for blood-pressure detection. The company also seems interested in technology like a mat that could measure vital signs and track sleep, augmenting the Apple Watch and other existing iOS devices. Outside of health, Apple has received a patent for an Apple Watch band that could take photos and videos through an optical sensor. Apple’s patents also show wide-ranging ambitions for augmented and virtual reality. The company has applied for patents focused on AR navigation systems and AR technology for virtual meetings, both features that could come to a designated AR headset. In addition, Apple has received a patent for an AR device that could warp images so that people who are partially visually impaired could see more clearly. Read: Apple reportedly buys virtual-reality startup NextVR In autonomous driving, Apple has sought a patent for sensor technology that would gauge stress levels through measures of heartbeat, body temperate and eye movement in order to increase comfort in an autonomous vehicle. The company has been granted a patent for a system that would let drivers give autonomous cars direction about where to park and even use hand gestures to instruct cars to park in a certain lot. Apple shares rose 1.3% Thursday. They’ve gained 48% over the past three months as the Dow Jones Industrial Average DJIA, +0.56% has risen 21%."}]}