{"article": [{"url": "https://www.marketwatch.com/story/asian-markets-fall-following-wall-streets-slide-as-hopes-of-quick-recovery-dim-2020-06-25", "published": 1593044900.0, "headline": "Asian markets fall, following Wall Street's slide as hopes of quick recovery dim", "body": "Shares skidded in Asia on Thursday after a sharp retreat overnight on Wall Street as new coronavirus cases in the U.S. climbed to their highest level in two months, dimming investors' hopes for a relatively quick economic turnaround. Japan's Nikkei 225 NIK, -0.11%  fell 1% while South Korea's Kospi 180721, +0.21%  sank 1.8%. Benchmark indexes in Singapore STI, -0.39%  and Indonesia JAKIDX, +0.28%  fell. Markets in Hong Kong, Taiwan and Shanghai were closed for holidays. Australia's S&P/ASX 200 XJO, +0.00%  sank 1.6% after its biggest airline, Qantas QAN, +1.17%  , announced it plans to cut at least 6,000 jobs and keep 15,000 more workers on extended furloughs to survive the coronavirus pandemic. The airline said it will slash costs by billions of dollars and raise fresh capital, while grounding 100 planes for a year or more and immediately retiring its six remaining Boeing 747 planes. Overnight, the S&P 500 SPX, +0.87%  fell 2.6% to 3,050.33, giving back all of its gains for the month. The selling followed a skid in European stock indexes. It accelerated on news that New York, New Jersey and Connecticut will require visitors from nine states with high infection rates to quarantine for 14 days. The rise in new infections is stoking worries that reopenings of businesses closed earlier to fight the pandemic may have to be curtailed, despite indications that economies are recovering from lockdowns that are being eased in the U.S. and other countries. \"A huge problem for investors is that volatility is too expensive to buy right now, so they are finding it easier just to cut and run from their stock market positions,\" Stephen Innes of AxiCorp said in a commentary. On top of lingering concerns over trade tensions between the U.S. and China, reports said the White House is considering fresh tariffs on $3.1 billion worth of exports from France, Germany, Spain and Britain. That helped send markets tumbling on worries that such a move might spiral into another trade war, said Jingyi Pan of IG. \"Renewed fears of the COVID-19 spread and fresh tariffs reign ... in guiding market sentiment midweek as riskier assets lose favor among investors,\" Pan said. The Dow Jones Industrial Average DJIA, +0.56%  lost 2.6% to 25,480. The Nasdaq COMP, +1.39%  , which was coming off its second all-time high this week, shed 2.2% to 9,909.17. Despite shedding its gains for June, the S&P 500 still is on pace for its best quarter since the fourth quarter of 1998. The market has been mostly in rally mode since April as investors focused on the prospects for an economic turnaround as broad areas of the economy reopened. But the recent surge in new infections is undercutting some of that optimism. Coronavirus hospitalizations and caseloads have hit new highs in over a half-dozen U.S. states and new cases nationwide are near their peak level of two months ago. While early hot spots like New York and New Jersey have seen cases steadily decrease, the virus is hitting the south and west, with several states setting single-day records, including Arizona, California, Mississippi, Nevada and Texas. The yield on the 10-year Treasury note fell to 0.67% from 0.69% late Wednesday. It tends to move with investors' expectations for the economy and inflation. In energy trading, benchmark U.S. crude oil US:CLQ20  fell 23 cents to $37.78 per barrel in electronic trading on the New York Mercantile Exchange. It slid 5.8% to settle at $38.01 a barrel on Wednesday. Brent crude UK:BRNQ20  , the international standard, gave up 25 cents to $40.28 per barrel. It fell 5.4% to close at $40.31. In currency dealings, the dollar USDJPY, -0.38%  bought 107.19 Japanese yen, rising from 107.05 yen. ."}]}