{"article": [{"url": "https://www.marketwatch.com/story/congress-urges-postal-service-to-immediately-undo-changes-slowing-mail-2020-08-06", "published": 1596743240.0, "headline": "Congress urges Postal Service to immediately undo changes slowing mail", "body": "WASHINGTON — Lawmakers from both parties are calling on the U.S. Postal Service to immediately reverse operational changes that are causing delays in deliveries across the country just as big volume increases are expected for mail-in election voting. House Speaker Nancy Pelosi and Senate Democratic Leader Chuck Schumer said Thursday that changes imposed by the new, Republican postmaster general “threaten the timely delivery of mail — including medicines for seniors, paychecks for workers and absentee ballots for voters — that is essential to millions of Americans.’’ In separate letters, two Montana Republicans, Sen. Steve Daines and Rep. Greg Gianforte, also urged the Postal Service to reverse the July directive, which eliminates overtime for hundreds of thousands of postal workers and mandates that mail be kept until the next day if distribution centers are running late. “This action, if not rescinded, will negatively impact mail delivery for Montanans and unacceptably increase the risk of late prescriptions, commercial products or bill delivery,’’ Daines said Thursday in a letter to Postmaster General Louis DeJoy. “Delaying mail service is unacceptable,” Gianforte wrote to DeJoy. “Do not continue down this road.” In their letter, Pelosi and Schumer acknowledged that the Postal Service continues to face financial challenges, but said “enacting these policies as cost-cutting or efficiency measures as the COVID-19 public health emergency continues is counterproductive and unacceptable.’’ During the pandemic, “Americans have turned to the Postal Service and depend on it for timely delivery of critical goods and a safe alternative to in-person interactions. As a result, we believe these changes must be reversed,’’ the Democrats said. The flurry of letters came as the top Democrat on a Senate panel that oversees the Postal Service launched an investigation into the operational changes that he said “are preventing Americans from receiving critical mail on time, including prescription drugs, business mail and mail-in ballots.” The cost-cutting measures, intended to address the Postal Service’s longtime financial problems, were imposed last month after DeJoy, a Republican fundraiser and former supply-chain executive, took over the top job in June. DeJoy, 63, of North Carolina, is a major donor to President Donald Trump and the Republican Party. He is the first postmaster general in nearly two decades who is not a career postal employee. Michigan Sen. Gary Peters, the top Democrat on the Homeland Security and Governmental Affairs Committee, said DeJoy has failed to provide answers about the service delays, despite repeated requests. Peters is asking the public to provide their stories about delays or other problems with deliveries. The Senate inquiry comes as lawmakers increasingly focus on the Postal Service, which is reeling from mail delays and financial problems at a time when record numbers of mail ballots are expected in the November presidential election because of the coronavirus pandemic. The House Oversight Committee has called DeJoy to testify at a hearing next month. Trump, a vocal critic of the Postal Service, contended Wednesday that “the Post Office doesn’t have enough time” to handle a significant increase in mail-in ballots. “I mean you’re talking about millions of votes. .. It’s a catastrophe waiting to happen.” DeJoy met with Schumer and Pelosi Wednesday in a closed-door session that Schumer called “a heated discussion.” Democrats told DeJoy that “elections are sacred” and urged him not to impose cutbacks “at a time when all ballots count,” Schumer said. “For 245 years, the Postal Service has worked to provide reliable, consistent and on-time delivery that keeps Americans connected no matter where they live – especially in rural areas,” Peters said. “Unfortunately, in recent weeks, I’ve heard firsthand from constituents, postal workers and local officials in Michigan who have encountered problems with the timely and dependable service they count on to conduct business, get prescription medications and critical supplies and even exercise their right to vote.’’ Democrats have pushed for $10 billion for the Postal Service in talks with Republicans on a huge COVID-19 response bill. The figure is down from a $25 billion plan in a House-passed coronavirus measure. Key Republicans whose rural constituents are especially reliant on the post office support the idea. With her state’s vast and difficult terrain, “the Postal Service is a primary source of knowledge, commerce and basic necessities,” said Sen. Lisa Murkowski, R-Alaska. For Alaskans, additional help from Congress “is truly a necessity — not a convenience,’’ she said. David Partenheimer, a spokesman for the Postal Service, declined to comment on the letter from Democrats. But he said the agency is using all available resources to “match the workload created by the impacts of the ongoing coronavirus pandemic.” The Postal Service has “a liberal leave policy” and is aggressively trying to hire qualified candidates to replace tens of thousands of workers who have gotten sick or opted not to work because of the pandemic, he said. “We appreciate the patience of our customers and the efforts of employees as conditions change on a day-to-day basis,” he said. Partenheimer disputed reports that the Postal Service is slowing down election mail or any other mail. “We continue to employ a robust and proven process to ensure proper handling of all election mail consistent with our standards,’’ he said."}]}