{"article": [{"url": "https://www.marketwatch.com/story/tom-brady-again-fails-to-shake-nick-foless-hand-after-a-loss-after-appearing-to-have-lost-track-of-downs-on-final-drive-in-chicago-2020-10-09", "published": 1602240080.0, "headline": "Tom Brady again fails to shake Nick Folesâ\u0080\u0099s hand after a loss â\u0080\u0094 having appeared to lose track of downs on final drive in Chicago", "body": "Tom Brady couldnâ\u0080\u0099t seem to keep his numbers straight. Bradyâ\u0080\u0099s Tampa Bay Buccaneers lost 20-19 to the Nick Folesâ\u0080\u0093quarterbacked Bears in Chicago on Thursday night. For the signal callers, it was a rematch of Super Bowl 52, when Folesâ\u0080\u0099s Philadelphia Eagles beat Bradyâ\u0080\u0099s New England Patriots. This yearâ\u0080\u0099s meeting came with a bizarre ending as Brady appeared to lose track of the downs on the Buccaneersâ\u0080\u0099 final offensive play. â\u0080\u009cHe knew,â\u0080\u009d Buccaneers coach Bruce Arians told reporters when asked if Brady was aware it was fourth down. See:Amazon expands its NFL â\u0080\u0098Thursday Night Footballâ\u0080\u0099 programming â\u0080\u0094 will the e-commerce giant buy more NFL rights? After his fourth-down pass to Cameron Brate over the middle was broken up with 38 seconds left, Brady lingered on the field, signaling to a nearby official that he believed Tampa Bay still had a down to play â\u0080\u0094 putting up four fingers. â\u0080\u009cYeah, youâ\u0080\u0099re up against the clock and youâ\u0080\u0099re up against the â\u0080\u0094 I knew we had to gain a chunk, so I should have been thinking more first down instead of chunk in that situation,â\u0080\u009d Brady said when asked about his odd reaction. â\u0080\u009cI knew we needed a chunk and I was thinking about more yardage. It was just bad execution. We had a great opportunity there so â\u0080¦ just didnâ\u0080\u0099t execute when we needed to.â\u0080\u009d After he returned to the Buccaneersâ\u0080\u0099 bench, Brady was shown on camera flinging a tablet in disgust after, it appeared, he recognized his mistake. The cameras then caught Brady running off the field when the game was over, leaving a confused Foles looking around as he tried to find the six-time Super Bowl champion to shake hands. Brady also did not shake Folesâ\u0080\u0099s hand after the Super Bowl loss. â\u0080\u009cI didnâ\u0080\u0099t get a chance to say anything to him,â\u0080\u009d Foles said during his on-field interview after the game. â\u0080\u009cIâ\u0080\u0099m sure sometime weâ\u0080\u0099ll catch up, but weâ\u0080\u0099re trying to keep our distance.â\u0080\u009d Frank Schwab of Yahoo Sports observed that Brady was doing â\u0080\u009cwhat the NFL wants him to doâ\u0080\u009d in heading for the locker room without postgame handshakes, in accordance with coronavirus guidelines. â\u0080\u009cReally, itâ\u0080\u0099s no big deal,â\u0080\u009d Schwab wrote. â\u0080\u009cBut itâ\u0080\u0099s Brady, so people will take their shots regardless.â\u0080\u009d Foles, 31, was 30 for 42 for 243 yards with a touchdown and an interception for his first win as the Bears starter. Cairo Santos kicked a 38-yard field with 1:17 left to give Chicago the lead for good. Few believed the Buccaneersâ\u0080\u0099 claims Brady had not forgotten the down. â\u0080\u009cHe definitely did [lose track of downs],â\u0080\u009d Terry Bradshaw said on Foxâ\u0080\u0099s postgame show. The 43-year-old Brady went 25-for-41 passing for 253 yards and a touchdown as Tampa Bay fell to 3-2. Chicago moved to 4-1. Read on:Another positive virus test for the NFLâ\u0080\u0099s Titans raises total to 23 cases, games now in jeopardy A version of this report previously appeared at NYPost.com."}]}