{"article": [{"url": "https://www.marketwatch.com/story/what-will-quad-witching-mean-for-the-stock-market-trade-on-friday-11600371672", "published": 1600437380.0, "headline": "What will quad witching mean for the stock-market trade on Friday?", "body": "The spooky-sounding quadruple witching gets a lot of fanfare in the news and was living up to its billing on Friday, amid the COVID-19 pandemic and rising anxieties on Wall Street. Quadruple witching, occurs on the third Friday of the month of every quarter, in March, June, September, and December, and refers to the simultaneous expiration of single-stock options, single-stock futures, and stock-index options and stock-index futures. In the broadest terms, the popular stock-index futures for the Nasdaq-100 NQ00, +1.63%, the Dow Jones Industrial Average YM00, +0.82% and the S&P 500 index ES00, +1.13% will transition from the September contract NQU0 ESU0 YMU0, which expires at the end of trade on Friday, to the December contract NQZ20, +1.63% ESZ20, +1.13% YMZ20, +0.82%, which already is receiving higher volumes and open interest for those contracts. Options volumes tend to be particularly elevated during quad-witching periods, which may also account for some of the choppiness anecdotally associated with September as the worst-performing month for the Dow DJIA, +0.56% DLW1IDUA, -0.76%, S&P 500 SPX, +0.87% and Nasdaq Composite COMP, +1.39% indexes. Quad witching usually only results in higher than normal volumes, and those usually peak on Wednesday or Thursday of the expiration week, experts have said. Options volume typically spikes around 3:30 p.m. Eastern Time on quadruple-witching days, but it remains to be seen on how that will play out in reality on Friday. Historically, however, quad witching hasn’t been particularly momentous, with the S&P 500 index, for example, posting a daily average percentage gain of 0.04% since the first quad witching in 2002, according to Dow Jones Market Data. Meanwhile the Cboe Volatility Index VIX, -5.15%, which reflects bullish and bearish options bets on the S&P 500 in the coming 30 days, and tends to rise as stocks fall as investors turn to options to hedge against market downturns, has seen muted moves. The so-called VIX, or fear gauge as it is sometimes referred, has seen a daily average decline of 1.41% since the first quad witching 18 years ago. “These days tend to get a lot of press for all of the volume they create, but historically they are nearly always a non-event,” Ryan Detrick, senior market strategist at LPL Financial, told MarketWatch. “The system survived the incredible volume back in March and we don’t think tomorrow will be much different,” he added. In fact, similar to back in June when the last quad witching occurred, the market has already experienced a bit of a shock in the mostly bullish sentiment on Wall Street earlier this month that has forced investors in options to unwind a number of short-term bets."}]}