{"article": [{"url": "https://www.marketwatch.com/story/a-lot-of-bad-news-is-converging-on-the-stock-market-heres-how-to-deal-with-it-2020-06-25", "published": 1593261440.0, "headline": "Bad news is punishing stock market investors â\u0080\u0094 hereâ\u0080\u0099s how to deal with it", "body": "Heads up, investors: Wednesdayâ\u0080\u0099s selloff in the stock market carried through Friday. It may be the start of something bigger, for the five key reasons I cite below. The good news is weâ\u0080\u0099re not going to see a full retest of the March lows or anywhere near that kind of decline, thanks to several positive factors in the mix (also below). The upshot: Itâ\u0080\u0099ll make sense to buy stocks after potential 5%-10% declines in the S&P 500 SPX, +0.87%, Dow Jones Industrial Average DJIA, +0.56% Â and Nasdaq COMP, +1.39%. Stock market indexes posted declines Friday of over 2% on concerns about rising coronavirus cases in some states as they reopen their economies. Here are some tactical suggestions. â\u0080¢â\u0080\u0089Focus on buying a group that I call â\u0080\u009cpublic spaceâ\u0080\u009d stocks. The eight stocks I put in my public-gathering-place portfolio in my stock newsletter, Brush Up on Stocks, on March 17 were up 70.7% by the close June 15, compared with 26.3% gains for the SPDR S&P 500 ETF Trust SPY, +0.89%. As the big gainers (and the ones most vulnerable to Covid-19 resurgence fears), they will likely decline a lot, offering the best opportunity for a rebound when Covid-19 fears recede again. If you missed this play the first time around, you will get another shot on a smaller scale. The eight stocks are: Churchill Downs CHDN, -3.00%, Royal Caribbean Cruises RCL, +2.59%, Carnival CCL, +0.51%, Planet Fitness PLNT, +2.61%, Loweâ\u0080\u0099s LOW, +1.38%, Home Depot HD, +0.49%, Howard Hughes HHC, +1.00% and Cedar Fair FUN, +1.07%. These all have solid brands, good business prospects and decent insider buying levels. â\u0080¢â\u0080\u0089Buy the most cyclical areas, which will also get hit the hardest. This means energy, industrials and basic materials. Consider solid names in energy like Exxon Mobil XOM, -1.47% and Royal Dutch Shell RDS.A, +0.83%, which get Morningstarâ\u0080\u0099s highest (five star) stock rating, or one I like and own among mid-caps, Continental Resources CLR, -3.44%. In industrials and chemicals, thereâ\u0080\u0099s been compelling insider buying in TransDigm Group TDG, -1.21% and LyondellBasell Industries LYB, +0.73% over the past several weeks. For exchange traded funds (ETFs), consider Energy Select Sector SPDR XLE, -1.59%, SPDR S&P Oil & Gas Explore & Production XOP, -1.53% and Vanguard Energy VDE, -1.60% in energy; Industrial Select Sector SPDR Fund XLI, +0.37% and Vanguard Industrials VIS, +0.34% in industrials; and Materials Select Sector SPDR XLB, +0.77%, Vanguard Materials VAW, +0.59% and iShares Dow Jones US Basic Materials IYM, +0.97% in basic materials. â\u0080¢â\u0080\u0089Own gold or gold-mining stocks. They are a hedge against potential weakness. Consider SPDR Gold Trust GLD, +1.81%, iShares Gold Trust IAU, +1.82%, VanEck Vectors Gold GDX, +4.64% and VanEck Vectors/Jr Gold Miners GDXJ, +5.32%. Â­â\u0080¢â\u0080\u0089Donâ\u0080\u0099t get too aggressive in selling biotech stocks or the iShares NASDAQ Biotechnology Index IBB, +0.81% or SPDR S&P Biotech XBI, +0.92%. Biotech is less likely to sell off sharply, and it may even go up since itâ\u0080\u0099s now considered a â\u0080\u009cdefensiveâ\u0080\u009d group that rises on increasing fears about Covid-19 spread. Politicians need breakthroughs on vaccines and therapies, so they are in love with the sector. No more talk about drug price regulation, at least not for now. Biotech stock valuations are largely based on the discounted net present value of earnings many years out, when therapies get approved. What happens over the next 12 months is less important to valuations. The bottom line: This is not a time when you need to rush into the markets for fear of missing out. Wait for price. Get out of trades and positions you are not certain about. But donâ\u0080\u0099t touch core long-term positions. A disastrous long-term recession does not appear to be in the cards. Be wary of using margin. Slowly raise some cash or keep some on hand. Then as market weakness develops, scale into stocks getting hit the most, such as the public-space stocks and companies in cyclical areas like energy, industrials and chemicals. There are plenty of things that could crop up to create volatility and better prices, near term. Here are five reasons why. The stock market is more vulnerable now 1. Sentiment is turning bullish. Not feverishly so, but enough to make this a less compelling time to buy stocks in the contrarian sense, meaning you should get less bullish as the crowd gets more bullish. The dozen sentiment indicators I track are all now either neutral or bearish (showing too much bullishness). Excessive optimism is seen in the high levels of call buying at the Chicago Board Options Exchange, for example, and the record number of new accounts at discount brokerage firms and Robinhood. 2. Insiders have shifted to neutral. Insider buyers have left the building. On Tuesday there were only 12 companies whose own executives bought more than $100,000 worth of stock, which is low. Part of the decline is because we are moving into earnings reporting season. So insiders are getting locked down. But this doesnâ\u0080\u0099t explain all of it. 3. Covid-19 risks are rising. In the early days of the coronavirus resurgence, you could argue case counts were rising because of more testing. No longer. The infection rate per number of tests is going up because the coronavirus case count is rising as people circulate again. Epidemiologists I talk with, including Dr. Michael Mina at Harvard, caution that the chances are very high that we will see even more serious outbreaks in early October when flu season returns. 4. Political risk is rising. Polls show Joe Biden is now the favorite to win the White House. Betting odds at gaming sites suggest there is a good chance the Senate will go Democratic. Both events would be perceived as negatives for stocks since tax and regulation policies of Democrats can be viewed as bad for stocks. Democratic presidential candidate Joe Bidenâ\u0080\u0099s policies would impose $3.5 trillion in costs on businesses and investors by increasing the corporate tax rate, and capital gains and dividend tax rates, according to Cornerstone Macro. 5. The seasonally weak time of year lies just ahead. That means July through the end of October. Not all bad news Offsetting those negatives are six factors that suggest any selloff wonâ\u0080\u0099t be too dramatic and that the current Covid-19 resurgence wonâ\u0080\u0099t be as bad as the initial phase. 1.â\u0080\u0089Cash levels are really high. Money market funds now hold $4.8 trillion, says the Investment Company Institute, above the prior high of $3.8 trillion in January 2009. Deposits in commercial banks increased sharply in March-May (by $2 trillion), moving those levels up to a record $15.4 trillion, or around twice as much as 2009 levels, according to the Federal Reserve. Those numbers suggest a lot of investors who sold the March selloff never got back in. They are itching to do so, which means they will support the market in any significant decline. 2.â\u0080\u0089The personal savings rate has increased dramatically. This boosts consumer-spending power. Defined as the percentage of income left after people spend money and pay taxes, this rose to a record high of 33% during April from 8.2% in February. 3.â\u0080\u0089The Fed and the federal government have injected massive amounts of stimulus in the economy. They are not even done yet. Phase 4 with an infrastructure-spending component awaits. To consider infrastructure stocks, here is a recent column I wrote on this theme. 4.â\u0080\u0089We probably arenâ\u0080\u0099t going back into full lockdown mode. Thatâ\u0080\u0099s because the trillions of dollars in costs seem too high, in economic damage and government stimulus funding to offset it. 5.â\u0080\u0089Covid-19 immunity for people who get it seems to be real. Mina, at Harvard, notes we see very few cases of people getting infected twice, and when it happens itâ\u0080\u0099s because of severe immune-system problems. Meanwhile, we have learned a lot about how to track and contain virus spread, even if adequate testing and surveillance infrastructure is not in place, according to Mina. 6.â\u0080\u0089The Covid-19 resurgence may be limited geographically. The biggest spreads so far are happening in the Sunbelt. This suggests it may be linked to staying indoors because of the heat, with air conditioning recirculating viruses. People stay out of the heat and use air conditioning in the North, too, but less so. Many relatively cooler states currently do not show as much of a resurgence. For example, recent testing in New York City showed a steady 1% infection hit rate, despite the fact that there were mass protests and riots long enough ago for Covid-related infections to show up. At the time of publication, Michael Brush owned FUN, HHC, CCL, CHDN, CLR and XOP. Brush has suggested FUN, LOW, HD, HHC, RCL, CCL, PLNT, CHDN, TDG LYB, XLE, XOP, GLD, GDX, IBB and XBI in his stock newsletter, Brush Up on Stocks. Brush is a Manhattan-based financial writer who has covered business for the New York Times and The Economist Group, and he attended Columbia Business School. Follow Brush on Twitter @mbrushstocks."}]}