{"article": [{"url": "https://www.marketwatch.com/story/heres-why-all-of-the-sp-500s-gains-since-april-came-after-the-market-closed-jp-morgan-2020-07-17", "published": 1595061320.0, "headline": "Here's why all of the S&P 500's gains since April came after the market closed: JP Morgan", "body": "Since April, analysts and traders have noticed a puzzling phenomenon in the stock market - all of the gains in the S&P 500 index's have taken place outside of regular trading hours. Analysts at JP Morgan say the answer is simple. Based on their analysis of how markets moved during different timezones, they argue U.S. investors were acting on market-moving news such as Chinese economic data or the latest developments on coronavirus vaccine candidates and therapeutics, all of which tended to arrive when U.S. markets were formally closed. \"Since April all of the S&P 500 up move appears to have happened during extended market hours, while regular trading hours have on average acted as a small drag,\" they said, in a research note on Friday. Since the start of April, the S&P 500 SPX, +0.87% has gained more than 30%. Blloomberg, JP Morgan To gauge market sentiment outside of U.S. hours, Nikolaos Panigirtzoglou and his team of quantitative investing gurus tracked how the Eurostoxx 50 index SX5E, +0.53%  and other Asian equity indexes performed during and after their regular hours of trading. The JP Morgan analysts noted much of the gains in the European markets had come when their official trading sessions began, mirroring the strong performance of the S&P 500 when the U.S. stock market was shuttered. Whereas in Asia, markets tended to exhibit the biggest swings after regular hours. By process of deduction, this suggested \"the most important news or flows likely took place during European regular trading hours,\" they said. Panigirtzoglou said the widespread suspicion that foreign investors were responsible for the divergence in the S&P 500's performance between regular hours and after hours was misplaced. He noted changes in Wall Street infrastructure meant U.S. investors could keep trading even after the market closed at 4 p.m. ET. Before, after-hours trading was the province of large institutional investors who enjoyed the technological capabilities and resources to buy and sell stocks when the market closed. But retail investors could now do the same thanks to the proliferation of new trading systems that allowed securities to change hands outside of the traditional stock exchange. \"This has likely facilitated the incorporation of information arriving outside of regular market hours into prices,\" said Panigirtzoglou. So what kind of information driving markets up and down outside of the U.S.'s regular session? \"Important economic data such as Chinese and European PMIs or the US payroll report and US retail sales are released during extended U.S. hours, but also because virus news emanating from Asia and Europe, regions that have been ahead of the U.S. on the virus curve, have been important market drivers in recent months. In addition, important U.S. news about vaccines or therapeutics in recent months or U.S. company earnings reports were released after U.S. hours,\" he said."}]}