{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-inch-lower-ahead-of-first-bond-auction-of-week-2020-07-07", "published": 1594140080.0, "headline": "30-year Treasury yield marks biggest drop in 3 weeks as bond auction fetches record low yield", "body": "U.S. Treasury yields fell Tuesday after a bond auction fetched its lowest yield on record, highlighting the U.S. government’s ultralow borrowing costs as the economy recovers from the coronavirus crisis.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 3.5 basis points to 0.648%, while the 2-year note rate TMUBMUSD02Y, 0.156% was flat at 0.163%. The 30-year yield TMUBMUSD30Y, 1.576% slipped 5.2 basis points to 1.390%, marking its biggest drop in around three weeks.What’s driving Treasurys? The Treasury Department auctioned off $46 billion of 3-year notes on Tuesday at a yield of 0.19%, surpassing the previous low of 0.23% in May’s auction. The strong demand reflected investor expectations for short-end rates to stay anchored at depressed levels as the Federal Reserve signals its willingness to keep interest rates at or near 0% for a protracted period. Benchmark federal-funds rates currently stand at a range between 0% and 0.25%. Atlanta Federal Reserve President Raphael Bostic said that the U.S. economic recovery was bumpier than he had expected. He also said economic activity was plateauing in some areas of the country where the coronavirus was seeing a resurgence. Randal Quarles, the Fed’s vice chairman for financial regulation, said the coronavirus still presented challenges to U.S. financial stability. He expected nonperforming loans and bank provisions for losses to rise as the pandemic progressed.What did market participants’ say? “Despite the heavy supply and the paltry yield levels, buyside demand was very strong,” said Thomas Simons, senior money market economist at Jefferies, describing the results of the 3-year note auction on Tuesday."}]}