{"article": [{"url": "https://www.marketwatch.com/story/why-silver-is-trading-at-a-nearly-4-year-high-2020-07-13", "published": 1594657820.0, "headline": "Why silver is trading at a nearly 4-year high", "body": "Silver futures on Monday marked their highest settlement in nearly four years, buoyed by a sharp climb in investment demand as the metal continues to play catch up to gains by sister metal gold. “Trading in the gray metal is worth barely 10% of what gold sees each day, so hedge funds and other money managers wanting to catch up with the yellow metal’s jump towards new all-time highs might expect to get more bang for their buck in silver,” said Adrian Ash, director of research at BullionVault. The September silver contract US:SIU20 rose 73 cents, or 3.9%, to settle at $19.788 an ounce Monday. That was the highest finish for a most-active contract since September 2016, according to Dow Jones Market Data. Gold on Monday, meanwhile, saw its August contract US:GCQ20 settle at $1,814.10 an ounce, close to the $1,820.60 it settled at on July 8, which was the highest since September 2011. There has been a historically high purchase of physical silver via silver exchange-traded funds in the past few months alone, said Peter Spina, president and chief executive officer at GoldSeek.com. “Never in the history of silver have we seen such demand for [the metal] in such a short period of time.” As of June 30, global holdings of silver in silver exchange-traded products, or ETPs, which include ETFs, reached a “fresh all-time high of 925 million ounces, which is roughly 14 months of mine supply,” according to a recent report from The Silver Institute, an international industry association. ETP growth in the first half of 2020 of 196 million ounces “comfortably surpassed” the highest annual inflow of 149 million ounces set in 2009, the report said. Among the reasons for the surge in silver interest, Spina pointed out that the metal has been “dismissed and mostly ignored over the last few years, as many former silver buyers turned to cryptocurrency and more exciting markets.” The value of silver, however, is “difficult to ignore,” Spina, who is also president of silver news and analysis provider SilverSeek.com, told MarketWatch. “One of the best value indicators is the relative value of silver to gold,” he said, pointing out that during extremes in the market selloffs, the ratio of gold to silver could spike to around 130 — meaning that it would take 130 ounces of silver to buy one ounce of gold. That ratio is now back under 100, but that figure should be closer to 50 instead, he said. “Even at a 50 ratio, silver is far removed from the ratio found naturally,” said Spina, as silver is found at a ratio of nearly 20 ounces per ounce of gold. BullionVault’s Ash said that even if the ratio manages to retreat to 84, the bottom of its four-year uptrend, by the end of August from the current four-month low of 93, that would put silver at $21.50, if gold holds the $1,800 level. A move up to gold’s all-time, roughly $1,900 peak could put silver at $22.60, he said. The settlement record for most-active gold futures stands at $1,891.90 from Aug. 22, 2011, based on records going back to November 1984, according to Dow Jones Market Data. The record intraday level was seen at $1,923.70 an ounce on Sept. 6, 2011. Ash pointed out to MarketWatch that silver has jumped from its COVID-19 price crash to an 11-year low in mid-March by 58% in just 80 trading days. That puts the March to July 2020 performance in the “top 4% of all four-month gains over the last half-century,” he told MarketWatch. Even so, silver has outpaced this current surge many times — in 1974, 1979, 1982, 1987, 2010 and 2011, which all marked times of extreme economic or financial stress, so “when silver gets moving, it can really move,” he said. “The number of private individuals seeing stability and diversification with precious metals has never been greater,” with silver holdings on BullionVault up by 26% so far this year, versus 11% growth in gold, Ash said. “ $100-an-ounce silver is ‘not at all unreasonable in the coming several years…’ ” — Peter Spina, GoldSeek.com With gold now heading toward $2,000 and beyond, silver is poised to march higher too, said Spina. He said his first target for silver prices is $25 to $30 in the coming few quarters, but the “liftoff” for silver is “now well under way.” In the coming years, with gold moving above $2,000, Spina sees silver “revisiting its non-inflation adjusted highs of $50” and potentially higher, with $100-an-ounce silver “not at all unreasonable in the coming several years, and it may be shocking to many how quickly it can move.”"}]}