{"article": [{"url": "https://www.marketwatch.com/story/rncs-3rd-night-pence-to-talk-up-trumps-handling-of-the-economy-coronavirus-and-foreign-policy-2020-08-26", "published": 1598485100.0, "headline": "RNCâ\u0080\u0099s 3rd night: Pence says Biden canâ\u0080\u0099t be trusted to rebuild economy, keep cities safe", "body": "Vice President Mike Pence on Wednesday night argued that Democratic presidential nominee Joe Biden canâ\u0080\u0099t be trusted to restore the coronavirus-battered economy or keep cities safe, as he delivered the keynote speech on the Republican National Conventionâ\u0080\u0099s third night and accepted his party's nomination to serve as President Donald Trumpâ\u0080\u0099s No. 2. â\u0080\u009cOn Nov. 3, you need to ask yourself: Who do you trust to rebuild this economy?â\u0080\u009d Pence asked.Â â\u0080\u009cA career politician who presided over the slowest economic recovery since the Great Depression? Or a proven leader who created the greatest economy in the world?â\u0080\u009d â\u0080\u009cThe choice is clear: To bring America all the way back, we need four more years of President Donald Trump,â\u0080\u009d the vice president said. In a reference to the unrest sparked by recent police killings of Black Americans, Pence said people â\u0080\u009cdonâ\u0080\u0099t have to choose between supporting law enforcement and standing with our African-American neighbors,â\u0080\u009d but then claimed that Biden would cut funding for law enforcement and â\u0080\u009cdouble down on the very policies that are leading to violence in Americaâ\u0080\u0099s cities.â\u0080\u009d â\u0080\u009cThe hard truth is you wonâ\u0080\u0099t be safe in Joe Bidenâ\u0080\u0099s America,â\u0080\u009d Pence said. The veteran Republican politician, who was Indianaâ\u0080\u0099s governor before becoming Trumpâ\u0080\u0099s vice president, also noted that Biden has referred to himself as â\u0080\u009ca transition candidate,â\u0080\u009d so he â\u0080\u009cwould be nothing more than a Trojan horse for a radical left.â\u0080\u009d Penceâ\u0080\u0099s remarks â\u0080\u0094 made at Baltimoreâ\u0080\u0099s Fort McHenry, known as the national anthemâ\u0080\u0099s birthplace â\u0080\u0094 came a day before a speech from Trump serves as the grand finale for the four-day, mostly virtual convention. The president on Thursday night â\u0080\u009cwill be trumpeting his accomplishmentsâ\u0080\u009d and talking about what he would do in a second term if the Trump-Pence ticket wins re-election in November, according to a campaign spokesman. Ahead of Penceâ\u0080\u0099s speech, Bidenâ\u0080\u0099s running mate, Kamala Harris, attacked the GOP candidates in a fundraising email sent to supporters. â\u0080\u009cDonald Trump and Mike Pence can talk all they want about making America great again, but they canâ\u0080\u0099t hide from their record,â\u0080\u009d the California senator said. â\u0080\u009cAmerican families are reeling from the worst public health crisis in a century, and the worst economic crisis since the Great Depression. Trump and Pence have responded with incompetence.â\u0080\u009d Among the other speakers at the GOP event on Wednesday night were Trump adviser Kellyanne Conway, who plans to step down from her White House job by the end of the month, as well as former Notre Dame football coach Lou Holtz, South Dakota Gov. Kristi Noem, second lady Karen Pence, Rep. Dan Crenshaw of Texas and Lara Trump, the presidentâ\u0080\u0099s daughter-in-law. Related:Trumpâ\u0080\u0099s convention breaks norms â\u0080\u0094 and possibly the Hatch Act Conway praised Trumpâ\u0080\u0099s efforts to address the opioid crisis, saying heâ\u0080\u0099s â\u0080\u009cthe president we need for four more years,â\u0080\u009d as he â\u0080\u009cpicks the toughest fights and tackles the most complex problems.â\u0080\u009d Holtz said â\u0080\u009cone of the important reasonsâ\u0080\u009d that he trusts the Republican incumbent is â\u0080\u009cbecause nobody has been a stronger advocate for the unborn than President Trump,â\u0080\u009d while the Biden-Harris ticket is â\u0080\u009cradically pro-abortion,â\u0080\u009d adding that they and other politicians â\u0080\u009care Catholics in name only.â\u0080\u009d The speeches followed testimonials earlier in the week from a range of speakers, including Donald Trump Jr. and Nikki Haley on Monday, and first lady Melania Trump and Secretary of State Mike Pompeo on Tuesday. Bidenâ\u0080\u0099s deputy campaign manager and communications director Kate Bedingfield criticized the GOP convention early Wednesday, casting it as â\u0080\u009can alternate reality.â\u0080\u009d â\u0080\u009cIn this delusion, thousands of Americans didnâ\u0080\u0099t die in the last week from COVID-19, nor have millions of Americans been infected or put out of work,â\u0080\u009d she said in a statement. Bedingfield also said Americans â\u0080\u009ccanâ\u0080\u0099t afford for Donald Trump to bury his head in the sand any longer,â\u0080\u009d and the country needs â\u0080\u009creal leadership.â\u0080\u009d Opinion:Trump, running for re-election, is faking it on the economy and the pandemic Counterpoint:Donâ\u0080\u0099t count Trump out â\u0080\u0094 hereâ\u0080\u0099s how he can still win in November In RealClearPolitics averages of polls as of Wednesday, the Democratic nominee is leading Trump by 7 percentage points in nationwide surveys and by 3.7 points in key swing states that are likely to decide the November election. The main U.S. stock gauges mostly closed with gains Wednesday, with the S&P 500 SPX, +0.87% and Nasdaq Composite COMP, +1.39% finishing at fresh all-time highs."}]}