{"article": [{"url": "https://www.marketwatch.com/story/it-spread-like-wildfire-this-very-very-scary-chart-might-have-you-reconsidering-your-sunday-plans-2020-08-06", "published": 1596878780.0, "headline": "â\u0080\u0098It spread like wildfireâ\u0080\u0099: This â\u0080\u0098very scaryâ\u0080\u0099 chart might have you reconsidering your plans for Sunday morning", "body": "Ohio Gov. Mike DeWine announced at a coronavirus briefing this week that heâ\u0080\u0099s sending a letter to his stateâ\u0080\u0099s faith-based community in an effort to get the churches, synagogues and mosques on board with safety measures to help prevent community spread. â\u0080\u009cOur religious faiths are at the core of our great state and country,â\u0080\u009d DeWine explained. â\u0080\u009cHowever, it is vital that â\u0080\u0094 to control the spread of the virus â\u0080\u0094 that any time people gather together, including for religious services, that everyone wear masks, practice social distancing, wash hands, and also, while indoors, making sure there is good ventilation and airflow.â\u0080\u009d To hammer home his point, DeWine used this illustration of a recent outbreak at a church service that led to the infection of 91 people across five counties. As you can see, the 56-year-old man at the center of the spread passed the coronavirus on to 53 people at the church, 18 of whom infected at least one other person. â\u0080\u009cIt spread like wildfire,â\u0080\u009d DeWine said, without detailing the severity of the cases. â\u0080\u009cVery, very scary.â\u0080\u009d He also warned that several other clusters of cases across the state can be traced back to â\u0080\u009cinformal gatheringsâ\u0080\u009d like parties and weddings where the rules of social distancing had been ignored. More than 96,000 people in Ohio have tested positive for the coronavirus. The global tally climbed above 18.8 million on Thursday, according to data aggregated by Johns Hopkins University, and the death toll rose to 708,036. At least 11.3 million people have recovered. In the U.S., the case count climbed to 4.8 million as the death toll rose to 158,256."}]}