{"article": [{"url": "https://www.marketwatch.com/story/cisco-shares-dip-6-on-tepid-earnings-outlook-revenue-decline-2020-08-12", "published": 1597304300.0, "headline": "Cisco's tepid earnings outlook, revenue decline and CFO retirement news hits stock", "body": "Cisco Systems Inc. reported another revenue decline and soft earnings guidance for the current quarter Wednesday afternoon, then announced that its chief financial officer will retire as shares were pummeled in after-hours trading. The maker of network services, videoconferencing tools and security software reported fourth-quarter net income of $2.64 billion, or 62 cents a share, as revenue declined 9% to $12.15 billion from $13.4 billion in the year-ago period. After adjusting for stock compensation and other effects, Cisco reported earnings of 80 cents a share, down slightly from 83 cents a share a year ago. Analysts surveyed by FactSet had projected adjusted earnings of 65 cents a share on revenue of $12.09 billion on average, though those expectations have come down significantly since COVID-19 began to spread across the globe. Analysts expected adjusted earnings of 75 cents a share on sales of $13.14 billion at the end of 2019. First-quarter adjusted earnings guidance of 69 cents to 71 cents fell short of the 75 cents modeled by FactSet analysts. Cisco also warned that Q1 revenue will decline 9% to 11% year-over-year. The fourth-quarter results, announced after the market's close Wednesday, sent Cisco CSCO, +0.15%  shares down more than 6% in after-hours trading. The were down about 7% premarket Thursday. Cisco stock is flat in 2020, while the S&P 500 index SPX, +0.87%  has climbed 4.6%. Since March 12, however, Cisco shares have jumped 45%. In a conference call Wednesday afternoon, Cisco announced that CFO Kelly Kramer will retire from the company once a replacement is found. In an interview after the call ended, Kramer told MarketWatch that her departure had \"nothing to do with the company, I love Cisco.\" Kramer instead said \"it's just time\" after 30 years in the business and six years as Cisco's CFO, and that she looks forward to \"more board work and investing.\" Kramer won't be the only Cisco employee retiring in this fiscal year. Cisco said it would undergo a $1 billion cost reduction \"over the next few quarters\" by \"rebalancing its R&D investments\" on several areas that include cloud security and automation in the enterprise, leading to speculation of job cuts from Patrick Moorhead, principal analyst at Moor Insights & Strategy. Kramer admitted in the interview with MarketWatch that the first part of those cuts will be voluntary retirement offerings for Cisco employees. After the company figures out how much they can cut through those efforts, decisions will be made about other moves to get up to the $1 billion figure, she said. Cisco is both benefiting and suffering in the age of coronavirus: Hardware sales are being squeezed during the pandemic, while demand for Cisco tools and services that aid remote work, such as Webex, has surged. Executives pointed out Wednesday that the majority of Cisco's revenue - 51% - came from software and services in the 2020 fiscal year, the first time they have has passed that mark. \"By the end of fiscal 2020, we achieved our goal of more than half of our revenue coming from software and services, and this strategy continues to resonate with customers as they digitize their organizations,\" Cisco Chief Executive Chuck Robbins said in a statement announcing the results. \"As we focus on the future, we are rebalancing our R&D investments to focus on new areas so we can continue to offer customers the best, most relevant technology in simpler, more easily consumable ways.\" Cisco finds itself in a gauzy situation during the pandemic: It is dominant across network equipment markets but faces pressure from unpredictable service-provider and enterprise spending; COVID-19 and the work-from-home movement have put pressure on high-margin campus product groups; and the recent entry of Arista Networks Inc. ANET, +2.30%  and Juniper Networks Inc. JNPR, +0.08%  into campus switching and WLAN pose threats. \"We are cognizant that Cisco's top line is challenged in the near to medium term from macro headwinds, but diversification, opex [operating expense] discipline and cash flow flexibility afford it the ability to show greater resilience on the earnings line,\" Morgan Stanley analyst Meta Marshall, said in July 9 note that upgraded Cisco shares to overweight and maintained a price target of $54. MarketWatch staff writer Jeremy C. Owens contributed to this article."}]}