{"article": [{"url": "https://www.marketwatch.com/story/5-things-to-know-about-trumps-possible-supreme-court-picks-like-how-barbara-lagoa-could-help-him-in-florida-2020-09-21", "published": 1600718180.0, "headline": "5 things to know about Trumpâ\u0080\u0099s possible Supreme Court picks â\u0080\u0094 including how Barbara Lagoa could help Trump win Florida", "body": "While speculation swirls around whom President Trump will name as his third justice to the Supreme Court, political analysts have largely centered around two contenders: Amy Coney Barrett, a judge since 2017 on the Chicago-based U.S. Court of Appeals for the 7th Circuit, and Barbara Lagoa, a judge on the U.S. Court of Appeals for the 11th Circuit in Florida. Trump said on Monday that heâ\u0080\u0099ll likely name a nominee for late Supreme Court Justice Ruth Bader Ginsburgâ\u0080\u0099s seat by Friday or Saturday, and that he has five appointees in mind. But as Trump has also said that he plans to pick a woman to replace Ginsburg, the second female justice ever seated on the high court, a number of conservative female judges are topping the presidentâ\u0080\u0099s rumored short list â\u0080\u0094 although a man backed by Senate Majority Leader Mitch McConnell could also be in the mix. Hereâ\u0080\u0099s a look at five potential Supreme Court nominees, and how they could influence the presidential election in November. Theyâ\u0080\u0099re mostly women. Analysts including Height Capital Markets have centered the potential picks around a group of conservative women, including Barrett and Lagoa, as well as White House Deputy Counsel Kate Todd, and North Carolina federal judge Allison Jones Rushing. There are a number of forces at play here. First, Ginsburg was a champion of equal rights, and there have only been four women to serve on the Supreme Court. If Trump names a woman, as he has said heâ\u0080\u0099ll do, she would stand to become the fifth woman Supreme Court justice; there are currently two: Elena Kagan and Sonia Sotomayor. Trumpâ\u0080\u0099s support among women, and suburban women in particular, is weak, according to his poll numbers. The top two contenders appear to be Barrett, a law professor at the University of Notre Dame tapped by Trump to fill an Indiana seat on the 7th Circuit, and Lagoa, a Miami native and Columbia Law School grad who worked as a pro bono lawyer for Elian Gonzalezâ\u0080\u0099s family in the 2000 international custody battle over the then 5-year-old Cuban boy found floating off the Florida coast. Barrett was also believed to be on Trumpâ\u0080\u0099s shortlist at the time of Brett Kavanaugh nomination two years ago, upon the retirement of Anthony Kennedy; Axios reported Trump said this of Barrett at the time: â\u0080\u009cIâ\u0080\u0099m saving her for Ginsburg.â\u0080\u009d But Lagoa, while largely unknown in D.C., has the support of Florida Republicans like Sen. Marco Rubio, Rep. Matt Gaetz and Gov. Ron DeSantis â\u0080\u0094 and Florida will be a key state in deciding the November election. Opinion:Why Trump and McConnell may not be able to choose Ginsburgâ\u0080\u0099s successor at the Supreme Court Lagoa could help Trump win votes in Florida. Lagoa, the first Hispanic woman to serve on the Florida Supreme Court, is a Cuban-American and Florida native. The analysts at Capital Alpha Partners wrote that picking Lagoa could â\u0080\u009cupend the presidential race,â\u0080\u009d as naming her to the highest court could mobilize Floridaâ\u0080\u0099s Hispanic community behind Trump, and perhaps even Hispanic voters across the country. Meanwhile, Bidenâ\u0080\u0099s polling among Hispanic voters is behind where Hillary Clintonâ\u0080\u0099s was at this time in 2016, hitting one of the Democratic candidateâ\u0080\u0099s weak points. Whatâ\u0080\u0099s more, Lagoa would be a historic pick: only the second Latina justice to serve on the Supreme Court, following Obama pick Sotomayor. â\u0080\u009cThe president wants a conservative jurist, and he wants to win the biggest battleground. How do Democrats in the Senate vote against a Latina?â\u0080\u009d a Republican source told Politico. Theyâ\u0080\u0099re fairly young conservatives who could have lasting influence. Barrett is 48, Lagoa is 52 and Rushing is 38 â\u0080\u0094 which would make any one of them the youngest justice on the current Supreme Court. This means that whichever one is picked could be in a position to decide landmark cases for a generation or more. And they have voiced opinions that cater to Trumpâ\u0080\u0099s base. Barrett is a devout Catholic who has said that â\u0080\u009clife begins at conception,â\u0080\u009d according to Notre Dame Magazine, and that justices should not be bound by Supreme Court precedents. Liberals have interpreted this as a sign that she could vote to overturn the 1973 Roe v. Wade decision legalizing abortion. Lagoa has only spent a year serving on the federal level and doesnâ\u0080\u0099t much of a record to scrutinize. But she did join in a major ruling that upheld a law requiring people with felony convictions to pay all court fees, fines and restitution before regaining their right to vote after the passage of a 2018 ballot measure called Amendment 4, whose impact Florida Republicans moved to curtail. Rushing has worked with the Alliance Defending Freedom, a Christian nonprofit that has been called an â\u0080\u009canti-LGBTQâ\u0080\u009d organization by the Southern Poverty Law Center. Opinion:Hereâ\u0080\u0099s what has to happen for President Trump and Mitch McConnell to seat a new Supreme Court justice before Election Day Many have clerked for conservative Supreme Court justices. Barrett clerked for the late Justice Antonin Scalia in the 1990s, and is considered a Scalia-like textualist who believes the law should be interpreted based on the ordinary meaning of the legal text, and not nontextual sources such as the intention of the law. Rushing clerked for Supreme Court Justice Clarence Thomas for the 2010-11 term and clerked for Neil Gorsuch before he was on the high court. Todd also clerked for Thomas, during the 2000-01 term. Related: Analysts worry Ginsburg replacement fight will take Congressâ\u0080\u0099 eye off ball of fiscal aid Amul Thapar could also be a contender. While Trump has said heâ\u0080\u0099ll pick a woman, heâ\u0080\u0099s also known for changing his mind, and Thapar was one of four finalists to replace Kennedy when he retired in 2018. Thapar, 51, a conservative who serves the 6th Circuit in Kentucky, would be the first Asian-American on the Supreme Court. McConnell recommended him for the district bench and the appellate court, and heâ\u0080\u0099s also a favorite of the Federalist Society, a conservative group that believes the Constitution should be interpreted as it was written and which is believed to have, alongside the Heritage Foundation, dictated the list of Supreme Court prospects influencing Trumpâ\u0080\u0099s decisions. While he has not written about abortion, Thaparâ\u0080\u0099s father told Louisvilleâ\u0080\u0099s Courier Journal in 2018 that Thapar â\u0080\u009cnearly wouldnâ\u0080\u0099t speak to me after I voted for Barack [Obama].â\u0080\u009d Then again, Thapar has also argued against â\u0080\u009cpoliticians in robesâ\u0080\u009d who put their personal views before the law, and has written that the three branches of government should â\u0080\u009cstay in their lanes.â\u0080\u009d"}]}