{"article": [{"url": "https://www.marketwatch.com/story/50-years-after-the-stonewall-riots-lgbt-americans-still-grapple-with-these-financial-struggles-2019-06-28", "published": 1592219780.0, "headline": "As Supreme Court affirms workplace rights, LGBTQ Americans have a long way to go for economic equality", "body": "The U.S. Supreme Court ruled Monday that civil rights laws barring workplace discrimination based on gender also apply to gender identity and sexual orientation. In a 6-3 decision, the court ruled that Title VII of the federal Civil Rights Act of 1964, which prohibits sex discrimination, also protects LGBTQ people from discrimination at work. Title VII does not explicitly mention LGBTQ people, but federal appeals courts in Chicago and New York had ruled that gay and lesbian employees are entitled to protection from discrimination. The ruling marks a major victory for the LGBTQ rights movement — but LGBTQ Americans continue to face significant challenges. In the 50 years since the movement began following the riots at the Stonewall Inn in New York City, the community of people who identify as lesbian, gay, bisexual, transgender and queer has made great strides. They have successfully campaigned for marriage equality, culminating in the landmark 2015 Supreme Court decision that made marriage a right for any American regardless of their sexual orientation or gender identity. Four years after marriage equality became the law across the land, former South Bend, Indiana mayor Pete Buttigieg captured national attention for his campaign to become the Democrat nominee for the 2020 U.S. presidential election. On the campaign trail, he was often accompanied by his husband, Chasten. Voters on both sides of the political spectrum judged him on his policies rather than his sexual orientation. LGBTQ representation in film and media has by grown leaps and bounds — and celebrities like Ellen Degeneres have gone from being ostracized in the industry for their identity to being the stars of long-running, popular TV shows. Movies like “Booksmart” and “Love, Simon” with leading LGBTQ characters have also found mainstream appeal. Read more:How Pete Buttigieg’s marriage is inspiring more gay men to find love online Despite these accomplishments, the LGBT community is still far from achieving full equality with their straight, cisgender peers. In 2017, more than 1,400 LGBT Americans were the victims of hate crimes, a 3% increase over the previous year. Transgender people, particularly transgender women of color, are at an especially high risk of violence. In 2020, at least 14 transgender or gender non-conforming people have been fatally shot or killed by other violent means, according to the Human Rights Campaign. “We say at least because too often these stories go unreported — or misreported,” the Campaign wrote on its website. The struggles LGBTQ Americans face extend to their financial lives. “There are many places in this country where LGBTQ people are still at risk of being fired from their jobs, being denied services such as credit and facing other forms of discrimination,” said Beck Bailey, director of the Human Rights Campaign’s Workplace Equality Program. “That’s why passing the Equality Act, a federal bill that would add LGBTQ people to existing civil rights laws and strengthen protections for all people, is so important.” (The Equality Act passed in the U.S. House of Representatives in May 2019.) Here are some of the financial challenges LGBT people continue to face:Wage gap persists between LGBTQ and heterosexual workers People in the LGBTQ community typically make less money compared to their heterosexual counterparts, research shows. A 2018 Prudential Financial survey said LGBTQ participants reported a median annual household income of $50,000. That’s compared with the $70,000 earned by non-LGBTQ indidivudals, the survey noted. The differences are especially pronounced for LGBTQ women, Prudential added. Though almost one-quarter of the non-LGBTQ men and women made less than $30,000, 40% of LGBTQ women earned less than $30,000, the survey said. Thirty-five percent of LGBTQ men made less than that amount, while only 24% of heterosexual men and women made less than $30,000 —Andrew KeshnerDespite low jobless rates, LGBT unemployment rates are far higher Before the coronavirus pandemic upended the economy and destroyed millions jobs, the unemployment rate had dropped to 3.6%, a 49-year low. But the LGBTQ unemployment rate far exceeded the national average: 9% of the LGBTQ community was unemployed as of January 2019, according to the UCLA School of Law’s Williams Institute. State unemployment rates were even more disproportionate. For example, LGBTQ residents accounted for 3.3% of Wyoming’s population, but they had a 17% unemployment rate, the Williams Institute said. —Andrew Keshner Read more:Scoring 10.2 million viewers, ‘Will & Grace’ reboot takes aim at Trump’s White HouseTransgender people, in particular, experience discrimination at work Jobless rates in the transgender community are especially high. There was a 15% transgender unemployment rate in 2015, according to estimates from the National Center for Transgender Equality. More than three quarters (77%) of survey participants told the advocacy group they’ve hidden or delayed their gender transition to avoid workplace mistreatment, or just quit altogether. “Too many transgender people know what it’s like to have their job applications ignored, their reports of harassment silenced, and their accomplishments denied and dismissed,” said Gillian Branstetter, media relations manager at the National Center for Transgender Equality. “While many large employers have taken great strides to improve their workplace policies, we still have a long way to go to address the deep and unjustifiable inequities faced by transgender people every day.” In a 2019 speech, John Williams, president and CEO of the Federal Reserve Bank of New York, said “we are not where we need to be.” The work has to continue, Williams added. “Creating an inclusive culture has no end date. Like so many aspects of culture and values, it’s not a project with a deadline, where we can say, ‘OK, we’re done now.’” —Andrew KeshnerUntil the Supreme Court ruling, you could still be fired for being LGBTQ in many states Prior to the Supreme Court’s ruling Monday, there was a gap between the workplace protection laws for gay, bisexual, lesbian and transgender workers and many other people. The Civil Rights Act of 1964 outlawed worker discrimination because of their sex, race, color, national origin or religious belief, but it had been an open legal question whether the landmark federal law guards against unfair treatment because of one’s sexual orientation. State laws in more than half of the country were silent on the critical issue. The Human Rights Campaign said 28 states lacked laws barring discrimination because of sexual orientation. Likewise, 30 states had no laws forbidding discrimination on the basis of someone’s gender identity. —Andrew KeshnerAdvocates fear ‘religious freedom laws’ will be used to discriminate against LGBTQ individuals President Trump has moved to protect “religious liberty” in a series of actions applauded by some conservative Christians, including a May 2017 executive order that relaxed constraints on churches’ political activity and told federal agencies they could exempt some religious organizations from having to include contraception coverage in their health-insurance plans. Many LGBTQ advocates at the time feared such directives could lead to discrimination against LGBTQ individuals on the basis of religion. “For too long, the federal government has used the power of the state as a weapon against people of faith — bullying and even punishing Americans for following their religious beliefs,” Trump said. “No American should be forced to choose between the dictates of the federal government and the tenets of their faith.” In October 2017, then-Attorney General Jeff Sessions issued a guidance to federal agencies stating that the “principles of religious liberty” should be accommodated to the greatest extent possible “in all government activity, including employment, contracting, and programming.” The Justice Department later created the Religious Liberty Task Force, which the Human Rights Campaign blasted as part of the Trump administration’s “ongoing campaign to license discrimination against LGBTQ people in the public square.” The Department of Health and Human Services in 2018 launched a new “Division of Conscience and Religious Freedom,” and last year finalized a regulation to protect health-care entities and individuals who refuse to participate in medical procedures (like abortion) or provide services due to religious or moral objections. The new rule faced criticism from the LGBTQ community and multiple legal challenges by cities and states, and was later struck down in federal court. —Meera Jagannathan Don’t miss:Nearly 50% of LGBT Americans are in the closet at workAccess to housing remains one of the biggest challenges facing LGBTQ Americans Finding safe, affordable housing can be a challenge. Only 21 states and the District of Columbia have laws that prohibit housing discrimination on the basis of sexual orientation or gender identity, according to the Human Rights Campaign. (One additional state, Wisconsin, has a law that only prohibits discrimination related to sexual orientation.) In states without these laws, LGBTQ people have little recourse when they encounter discrimination. Having a law on the books doesn’t actively prevent discrimination from occurring of course. The Urban Institute conducted a study in which people identified themselves as transgender when contacting housing agents in Washington, D.C. Transgender testers were less likely to be told if units were available for rent. Young Americans who identify as part of the LGBTQ community are vastly more likely to become homeless than their straight, cisgender peers. A 2017 report from Chapin Hall at the University of Chicago, a policy research institution that focuses on child welfare and family well-being, found that LGBTQ youth have a 120% higher risk of reporting homelessness relative to young adults overall. Previous research has estimated that up to 40% of homeless youth identify as LGBTQ. Additionally, one in five people who are transgender or gender-nonconforming have experienced homelessness at some point. Many of these people are homeless explicitly because of their sexual orientation or gender identity. Roughly a quarter of homeless LGBTQ youth were forced to live on the streets or in shelters because they were kicked out of their homes because they identified as LGBTQ. Being homeless as a young adult can have a ripple effect in the lives of LGBTQ Americans, said Cait Howerton, a financial coach at SmartPath Financial in Atlanta, Ga., and the 2019 Financial Planning Association diversity scholar. “That starts a downward spiral towards not being able to reach economic security and achieve prosperity because you’re having to hustle just to put a roof over your head,” she said. —Jacob PassyIt’s extremely expensive to become a parent for LGBTQ people Depending on the route they take, LGBTQ people can expect to spend tens of thousands of dollars to become parents. An adoption from a licensed private agency can cost anywhere from $5,000 to more than $40,000, although adopting from foster care can cost less than $2,500. People who choose child birth don’t avoid all of these costs. Intrauterine insemination costs between $300 and $1,000 without insurance, according to Planned Parenthood. In-vitro fertilization is even more expensive, costing $10,000 on average per cycle. In many cases though, it takes multiple cycles for someone to become pregnant. And in many states, insurers are not required to cover the cost of these procedures. The expenses don’t end there. “After a child is conceived and born, you still have to go through second parent adoption,” said Howerton, who identifies as lesbian. “You don’t have legal claims over that child until you go through adoption.” Second-parent adoptions, on average, cost anywhere from $2,000 to $3,000. —Jacob Passy Also see:How LGBT Americans have fared since Trump’s electionRetirement is the chief financial concern among LGBTQ people About 23% of the LGBTQ population is aged 50 and up, according to the Williams Institute. And saving for retirement is the chief financial concern among LGBTQ people, according to a 2018 Experian survey of 1,000 Americans, cited by 29% of respondents. (Half of the survey’s respondents identified as LGBTQ, while the other half were heterosexual and cisgender.) Accordingly, 44% of LGBTQ people reported difficulty maintaining adequate savings, compared to 38% of the general population. Those findings track with a 2017 Prudential survey, which found that LGBTQ respondents were less likely than those in the general population to save in retirement accounts (20% versus 25%). LGBTQ survey participants, moreover, were more likely than their general-population counterparts to regard themselves as “spenders.” That survey also found that LGBTQ respondents polled in 2016 were less likely than those polled for Prudential’s 2012 report (and less likely than general-population participants) to have an estate plan, to have begun saving or investing for retirement, or to have insurance. —Meera Jagannathan This story was updated on June 15, 2020."}]}