{"article": [{"url": "https://www.marketwatch.com/story/if-youve-started-day-trading-you-have-until-july-15-to-get-this-fire-insurance-for-next-tax-season-2020-07-14", "published": 1594891760.0, "headline": "If you've started day trading, you have until July 15 to opt for this 'fire insurance' with the IRS", "body": "A new crop of day traders are learning they have to think fast about buying, selling and holding stock - and they might need to think quickly about tax planning strategies for next season as well. July 15 isn't just the deadline to file federal income taxes. It's the deadline when people trying to make a living off their stock market savvy need to tell the Internal Revenue Service how they want the tax agency to tabulate their gains and losses for the upcoming tax season. There's no one-size answer on whether to go for the \"mark-to-market election,\" experts say. It can result in big time deductions for some, but big time headaches for others, they note. But a rookie trader with a rocky trading year in this volatile market should think hard about the option, they add. The mark-to-market election is like \"fire insurance,\" according to Darren Neuschwander, CPA and a managing member of Green, Neuschwander & Manning, a firm for traders and investments managers that's seen a 100% increase in prospective client consultations year-over-year. The election doesn't boost someone's portfolio, but Neuschwander said it makes \"a substantial difference when you're basically burning down in the market.\" Here's what to know about this tax move and other tax angles for day traders and retail investors:The IRS won't just let you call yourself a trader The IRS distinguishes between who counts as an \"investor\" for tax purposes and who counts as a \"trader.\" For one thing, an investor can't get around the annual $3,000 capital loss limitation, but the trader can potentially write off much more, if they take certain steps. Also, trading is a business, even if it's for the trader's personal gain. As a business, there are potential business expenses write-offs including home office expenses, computer equipment, software, trading newsletters, according to Andrew Schmidt, an accounting professor at North Carolina State University. It's tough to achieve trader status for tax purposes, Schmidt said. To be engaged in the business of securities trading, a person has to \"seek to profit from daily market movements in the prices of securities and not from dividends, interest, or capital appreciation,\" the IRS says. Their activity has to be \"substantial\" and done \"with continuity and regularity,\" the agency adds. The requirements to be trader for tax purposes can sound fuzzy, as MarketWatch tax expert Bill Bischoff notes. The tax code itself doesn't lay down hard and fast eligibility rules, but Neuschwander said Tax Court cases give guidance. The case law says people who are traders for tax purposes need to make at least 720 trades in the year with an average holding period under 31 days. There's approximately 250 trading days, Neuschwander noted. Don't miss: IRS says evangelist's private plane trips and tips to waiters aren't tax deductible A trader's profits are taxed at whatever bracket they fall in, which can range from 10% to 37%. That's because net short-term capital gains are taxed as ordinary income using the escalating tax rates, according to the IRS. The long term capital gains rate - for sale on an asset held over one year - is 0% if a person's income is beneath $39,375 ($78,750 for a married couple), the IRS notes. For most others above that amount, the rate is 15%. The ups and downs on mark-to-market elections The IRS has a \"wash sale rule,\" which can kick in when someone sells a security at a loss and either buys or sells the same security or a similar one 30 days before or after that sale. An investor who buys or sells in that 30-day timeframe forfeits the potential capital loss write off, explained Tony Zabiegala, chief operations officer and senior wealth advisor at Strategic Wealth Partners in Cleveland, Ohio. \"The government likes it when you pay taxes â\u0080¦ They don't like be taken advantage of. They don't like people who bought stock, decide to sell it, lock in a loss and re-buy to realize the loss,\" he said. If a taxpayer convinces the IRS they're a trader, and if they've made the mark-to-market election, they can sidestep the wash rule. They can also deduct all their losses, as opposed to an investor, who can only write off a $3,000 maximum every year after they also subtracted their net gains for the year. For example, if a trader loses $50,000 and their spouse earns $100,000, they can subtract the loss for a taxable income of $50,000 that would be taxed at 12%. If an investor loses $50,000 and their spouse makes $100,000, they could only write off the $3,000 and end with a taxable income of $97,000 - which is taxed at 22%. (The remaining losses can be carried forward and applied to future tax years.) To elect using mark-to-market rules under section 475(f) of the Internal Revenue Code, a taxpayer needs to enclose a cover letter with their 2019 returns saying they want to use that accounting method. If they've already submitted their returns, Neuschwander said they can print the first and second pages of their 2019 return, write \"do not process\" and include a cover letter stating the election was inadvertently omitted. The post mark has to be by July 15, he noted. The mark-to-market election can sound enticing, but it can be a drawback in certain scenarios, Neuschwander said. Suppose a trader made a $50,000 profit, but they also have a $20,000 capital loss carryover of $20,000 from past years. Without the election for mark-to-market accounting, they can deduct the $20,000 from the $50,000 and just pay tax on $30,000. With the election, a trader cannot offset tax on the profits with the carryover. They'll still have to pay tax on the $50,000. With more than five months before the year's done, it may be tough for someone to game out how they'll end the year. But Neuschwander said it's a tax strategy they'll have to weigh one way or another. \"If you're down for the year, which a lot people may have gotten into this first yearâ\u0080¦ if they have enough trades, and don't have that capital loss carry forward, you want that fire insurance.\""}]}