{"article": [{"url": "https://www.marketwatch.com/story/president-trump-tested-positive-for-coronavirus-heres-everything-we-know-so-far-2020-10-02", "published": 1601714420.0, "headline": "President Trump tested positive for coronavirus â\u0080\u0094 hereâ\u0080\u0099s everything we know so far", "body": "The revelation that President Donald Trump has tested positive for the coronavirus that causes the disease COVID-19 rattled the world on Friday, raising questions and concerns about his personal health, U.S. national security, and the course of the November presidential election. Hereâ\u0080\u0099s everything we know about Trumpâ\u0080\u0099s diagnosis and its wide-ranging implications so far. This story will continue to be updated. The diagnosis: President Trump tweeted at 12:54 a.m. Eastern time on Friday that he and first lady Melania Trump tested positive for COVID-19. â\u0080\u009cWe will begin our quarantine and recovery process immediately,â\u0080\u009d he wrote. â\u0080\u009cWe will get through this TOGETHER!â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } Their son Barron, 14, has so far tested negative, the first ladyâ\u0080\u0099s chief of staff, Stephanie Grisham, reportedly told NPR. President Trump was taken to Walter Reed Medical Center in Bethesda, Md., for â\u0080\u009cfurther evaluationâ\u0080\u009d and out of â\u0080\u009can abundance of caution,â\u0080\u009d the White House reported late Friday afternoon. It should be noted that Trumpâ\u0080\u0099s age, 74, and likely also his weight put him at a higher risk of suffering severe illness from the coronavirus. The Margin:Trump posts video update on Twitter before boarding Marine One for trip to Walter Reed Vice President Mike Pence, who would stand in for Trump as president if Trump were to become too ill to lead the country, tested negative for COVID-19 on Friday morning. But there has been no discussion of a turnover of presidential powers to the vice president, NBC national political correspondent Carol Lee reported. For the time being, the White House doctor said earlier Friday that the president can carry out his duties â\u0080\u009cwithout disruption,â\u0080\u009d and press secretary Kayleigh McEnany said that Trump will be working from the presidential offices at Walter Reed for the next few days. Melania Trump tweeted that she was showing â\u0080\u009cmild symptoms but overall feeling good,â\u0080\u009d and thanked the public for â\u0080\u009cthe love you are sending our way.â\u0080\u009d White House Chief of Staff Mark Meadows said Trump was showing â\u0080\u009cmild symptomsâ\u0080\u009d on Friday. White House physician Sean Conley said the president was â\u0080\u009cfatigued but in good spiritsâ\u0080\u009d later Friday afternoon, and revealed Trump received a â\u0080\u009csingle 8 gram doseâ\u0080\u009d of an antibody cocktail made by Regeneron Pharmaceuticals Inc. REGN, +0.36%. Several months into the pandemic, there are a limited number of treatment options for people with severe forms of COVID-19, and fewer still for milder cases. Treatments like remdesivir and convalescent plasma target very ill patients. â\u0080\u009cItâ\u0080\u0099s watching, waiting â\u0080¦ just supportive care, in general. Isolate,â\u0080\u009d Dr. Steven Shapiro, chief medical and scientific officer at UPMC, a hospital system based in Pittsburgh, told MarketWatch. (He is not involved in treating the Trumps.) â\u0080\u009cThe thing that we know that is most effective right now are steroids. But that tends to work later in the disease when someone develops the pneumonia.â\u0080\u009d Trump traveled to Walter Reed Medical Center before nightfall Friday and is expected to remain there for â\u0080\u009cthe next few days.â\u0080\u009d Before he left the White House aboard a Marine Corps helicopter, Trump sent out a video message on Twitter in which he said, â\u0080\u009cI think Iâ\u0080\u0099m doing very well, but weâ\u0080\u0099re going to make sure that things work out. The First Lady is doing very well.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } What if Trump becomes too sick to serve as president? As noted above, under the Constitution the vice president would take the reins in the event that Trump was unable to perform his duties for health reasons, and he would likely pick another Republican to serve as his own vice president. If something happened where Pence was unable to step in as commander-in-chief, Democratic House Speaker Nancy Pelosi would be next in line. Hereâ\u0080\u0099s a detailed look at the presidential line of succession. Even though the presidentâ\u0080\u0099s symptoms were described as â\u0080\u009cmildâ\u0080\u009d on Friday, the health scare is raising questions about what happens next with Trumpâ\u0080\u0099s Supreme Court nominee, Amy Coney Barrett, and how his illness could shake up the federal government in the midst of a pandemic crisis. The Rev. John Jenkins, the president of Notre Dame, the university at whose law school Barrett has been a professor, revealed Friday that he had received a positive diagnosis. He had traveled to Washington for the Rose Garden ceremony at which Barrettâ\u0080\u0099s nomination was formally announced. iframe.twitter-tweet { width: 100% !important; } Jenkins conceded he had not worn a face covering at the ceremony and said he regretted that decision. iframe.twitter-tweet { width: 100% !important; } Contact tracing: The news came hours after the White House revealed that presidential aide Hope Hicks had contracted COVID-19 after traveling with the president several times earlier in the week. Among the questions raised by Trumpâ\u0080\u0099s diagnosis were where he had been and whom he had met with in the days before he tested positive. And heâ\u0080\u0099d had a busy week, including a debate against former Vice President Biden, who tested negative for the virus on Friday morning and urged everyone to wear a mask, wash their hands and practice social distancing. See:Hereâ\u0080\u0099s a reverse timeline of where Trump has been. Trumpâ\u0080\u0099s chief of staff noted Friday morning that all White House staff had been tested for COVID-19, saying he expects that â\u0080\u009cas this virus continues to go on, other people in the White House will certainly have a positive test result.â\u0080\u009d Biden and running mate Kamala Harris expressed their wishes for the Trumps to make a speedy recovery, with Biden tweeting, \"We will continue to pray for the health and safety of the president and his family.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } What this means for the election: Thereâ\u0080\u0099s a lot still up in the air, such as whether the remaining two presidential debates, on Oct. 15 and Oct. 22, will be canceled. They will most likely be impacted in some way. There is some speculation that they may not be in-person events. Next weekâ\u0080\u0099s vice presidential debate between Pence and Sen. Kamala Harris in Salt Lake City, Utah will go forward as planned, according to a report from the Associated Press, citing officials within the debate commission. The president will be putting in-person campaigning on pause while he quarantines, with his campaign manager Bill Stepien announcing Friday that these are being moved to virtual events or are being temporarily postponed. â\u0080\u009cAll other campaign events will be considered on a case-by-case basis and we will make any relevant announcements in the days ahead,â\u0080\u009d he said. But Pence will resume his scheduled campaign events. Bidenâ\u0080\u0099s schedule also still has him traveling to Michigan on Friday. Related:Hereâ\u0080\u0099s how Trumpâ\u0080\u0099s positive coronavirus test has shaken up the campaign â\u0080\u0093 plus what could happen next As for the election itself, itâ\u0080\u0099s unlikely that Congress would delay an election thatâ\u0080\u0099s now just 32 days away. But if it were to be postponed, or if a president became incapacitated or died this close to Election Day, hereâ\u0080\u0099s what would happen. Global reactions: Financial markets were rattled by the October surprise, with U.S. stocks and European equities falling overnight, and the Dow trading lower Friday after the presidentâ\u0080\u0099s COVID-19 diagnosis and a weaker-than-expected jobs report. Opinion:Trumpâ\u0080\u0099s COVID-19: What the latest election turmoil might mean for your 401(k) European stock markets finished higher on Friday, but U.S. stocks were well off their opening lows Friday afternoon. Read more:Hereâ\u0080\u0099s what President Trumpâ\u0080\u0099s coronavirus diagnosis means for stock-market volatility â\u0080\u0094 so far World leaders including U.K. Prime Minister Boris Johnson, who was hospitalized with the coronavirus in July, sent the Trumps expressions of concern and well wishes for their speedy recovery. The Russian leader Vladimir Putin sent a telegram reading, â\u0080\u009cI am certain that your inherent vitality, good spirits and optimism will help you cope with this dangerous virus.â\u0080\u009d Opinion:Why Trumpâ\u0080\u0099s virus infection resonates globally, and adds a new layer of uncertainty to world affairs Trump joins a small number of world leaders who have contracted COVID-19, including Johnson and Brazilian President Jair Bolsonaro. Their diagnoses have impacted their countriesâ\u0080\u0099 responses to the pandemic in different ways. Trumpâ\u0080\u0099s diagnosis also put his own response to the pandemic â\u0080\u0094 which he likes to â\u0080\u009cplay down,â\u0080\u009d in his own words â\u0080\u0094 in even sharper focus. The president has chosen not to wear a face mask during most public engagements, despite a long-standing CDC recommendation to wear a face covering to stem the virusâ\u0080\u0099s spread. Hereâ\u0080\u0099s a timeline of Trumpâ\u0080\u0099s shifting statements on face masks and the threat that the coronavirus has posed to Americans. By Friday morning, the U.S. accounted for about a fifth of the global number of confirmed cases of COVID-19, with its 7.3 million cases now including the president and first lady, and 207,816 fatalities and counting. House Speaker Nancy Pelosi told MSNBC that she hoped the news would bring a complete shift in the U.S. approach to managing the pandemic. â\u0080\u009cMaybe now that people that see that the president of the United States, and all the protection he has, and the first lady, having this exposure, it might be a learning experience,â\u0080\u009d she said. â\u0080\u009cAnd more than learning, it has to be something that is acted upon.â\u0080\u009d This breaking-news story will continue to be updated."}]}