{"article": [{"url": "https://www.marketwatch.com/story/the-redskins-will-be-renamed-the-washington-football-team-for-the-2020-season-2020-07-23", "published": 1595516480.0, "headline": "The Redskins will be renamed the Washington Football Team for the 2020 season", "body": "The NFL team formerly known as the Redskins will go by the Washington Football Team for the 2020 season, giving the organization time to choose a new, full-time name. The club announced the placeholder name Thursday, ahead of the start of training camp next week. It’s been reported that the team will sell new merchandise on Fanatics, the NFL official apparel partner, with the new name. The move gives an opportunity for team owner Daniel Snyder to profit off the name change. See also: Here’s when each sport is returning amid the pandemic “The decision to use ‘Washington Football Team’ for this season allows the franchise the ability to undertake an in-depth branding process to properly include player, alumni, fan, community and sponsor input,” the team said in a statement. “To date, we have been pleased to see so many people putting forward their vision of what the new name and design should be on their social media channels and we look forward to including their feedback as this process progresses.” iframe.twitter-tweet { width: 100% !important; } Washington will keep its burgundy and gold colors and replace the Indian head logo on helmets with a player’s jersey number. All references to the Redskins name and logo will be removed from the team’s headquarters in Ashburn, Virginia, and FedEx Field in Landover, Maryland. Owner Dan Snyder recently dropped the Redskins name amid pressure from sponsors and after decades of criticism from Native American advocacy groups. On Monday, he hired Terry Bateman as executive vice president and chief marketing officer to oversee the name change and re-branding process. The franchise that began in Boston in 1932 had the name Redskins since 1933. FedEx — whose CEO is a minority owner — and other prominent sponsors called on Snyder to drop the name, and he did so after launching a review process. Red Wolves and Red Tails are among the betting favorites for the new name. “I think it’s critically important because you don’t want to do (a name change) again,” Carnegie Mellon associate professor of marketing and strategy Tim Derdenger said recently. “You don’t want to mess this up, so they really need to take it seriously.”"}]}