{"article": [{"url": "https://www.marketwatch.com/story/nordstrom-moved-the-anniversary-sale-to-august-due-to-covid-19-and-it-was-devastating-to-q2-results-2020-08-27", "published": 1598697980.0, "headline": "Nordstrom moved the Anniversary Sale to August due to COVID-19 and it was devastating to Q2 results", "body": "Nordstrom Inc. moved its Anniversary Sale to August due to the coronavirus pandemic, and the shift had a disastrous impact on the department store retailer’s second-quarter results. Nordstrom JWN, -2.18% reported sales that fell by more than half or 53% to $1.8 billion. For the year to date, Nordstrom stock has plunged 61.7% while the S&P 500 index SPX, +0.87% has gained 8.6%. “Due to COVID-19, we moved our event from July to August to help ensure the safety and comfort of our customers and employees and to deliver the most relevant merchandise assortment,” said Erik Nordstrom, chief executive of Nordstrom, during the late Tuesday earnings call, according to a FactSet transcript. Read:Ann Taylor parent joins other retailers that have recently filed for bankruptcy. Here are a few things they have in common “We took actions to meet evolving customer preferences by expanding our assortment to reflect growing preferences for categories focused on casualization, comfort, wellness and home.” The Anniversary sale started on August 4; this is the final week of the event. “[R]esults are in line with our expectations, reflecting a notable sequential improvement in full-price sales trends,” Nordstrom said. The event provides the company with a big opportunity to engage with existing customers, and to attract new customers, Nordstrom added, which made the move such a devastating one for the quarter. “Moving it to later in the year is the right decision from both the perspective of maximizing demand and holding the event at a time which is safer for people to shop,” said Neil Saunders, managing director at GlobalData Retail, in a note. “Nevertheless, the decision cost Nordstrom around 10 percentage points of growth during the second quarter.” See: Wayfair is on S&P’s ‘most vulnerable list’ despite soaring stock, new customer numbers Nordstrom increased the digital aspect of this year’s sale, offering shoppers the chance to create “wish lists,” for instance. Nordstrom said customers created nearly 20 million wish lists. The coronavirus pandemic has accelerated the shift to online retail and all of the services that can be provided digitally. The move has hurt department stores in particular, which continue to make adjustments to meet the online demand. These retail chains have also seen traffic at malls, where a lot of their stores are located, decline. Moreover, department stores had to shutter for a portion of the most recent quarter due to lockdown orders. Iconic department store Lord & Taylor announced on Thursday that going-out-of-business sales would begin at its 38 locations. It’s one of many retailers that have had to declare bankruptcy as COVID-19 took a toll on their businesses. Don’t miss:Macy’s, Kohl’s suffer as brands, competitors step in to replace department stores “The company’s exposure to malls where opening was not possible had an enormous negative impact on trade,” Saunders said. “However, it is extremely disappointing that Nordstrom did not make up some of its physical losses online.” Nordstrom’s digital sales fell 5%, though the company said that, excluding the impact of the shift of the Anniversary Sale, the increase was about 20%. “We think the Street undersestimates the pressure on Nordstrom’s earnings from share loss as consumers’ migrate to online pure-play channels, retailers with better value-for-money propositions such as TJX, and brands’ own stores and websites,” wrote UBS analysts. “Plus COVID-19 has changed fashion trends away from work, dressy and event items, three categories Nordstrom has historically been known for.” UBS rates Nordstrom stock sell and lowered its price target by $1 to $11. JPMorgan analysts struck a more optimistic tone in its note. Analysts there rate Nordstrom stock neutral with a $17 price target. And: Urban Outfitters shares soar after full-price sales drive better-than-expected earnings “[W]e note Nordstrom is relatively better-positioned than department store peers given higher e-commerce penetration (one-third of sales in 2019 versus ~20% for peers),” analysts said. Considering the major shift to e-commerce, Nordstrom made a big mistake opening up a flagship store in New York City, according to CFRA’s Camilla Yanushevsky. CFRA rates Nordstrom shares sell with a $12 price target. The Nordstrom flagship, which sells women’s and children’s items as well as beauty and home goods, opened in October 2019. Nordstrom also opened a men’s store in New York City in April 2018. “We think investors underestimate the issue of saturation in the U.S. retail market and, as we learned from the financial crisis, retailers most mired in debt and lagging in digital run the real risk of going bust,” said Yanushevsky, who called the flagship investment “a nail in the coffin.” Nordstrom paid down $300 million in its revolving line of credit during the quarter, and ended the period with $1.3 billion in liquidity, including $1 billion in cash. “It draws to mind Ron Johnson’s venture into small boutiques at JCPenney, which flopped and induced damage on JCPenney’s balance sheet that was difficult to rebuild,” she said. JCPenney Co. Inc. JCP, -2.53% filed for bankruptcy in May."}]}