{"article": [{"url": "https://www.marketwatch.com/story/the-assault-on-social-security-is-under-way-2020-08-28", "published": 1598699660.0, "headline": "The assault on Social Security is under way", "body": "When I was growing up, Social Security used to be called “the third rail of American politics,” because it threatened to kill the career of any politician who dared touch it. Not, it seems, any longer. Senators are seriously considering trying to arrange for the cutting — or gutting — of Social Security under cover of the coronavirus pandemic. This is an attack on multiple fronts. It includes proposals to suspend, or even eliminate, the payroll tax on which Social Security depends, and arranging a secret — yes, indeed — conference on Capitol Hill to find ways to “save” Social Security. Republican Senate Majority Leader Mitch McConnell wants this secret conference to be a condition of agreeing any further economic rescue package. He’s already on record calling for Social Security benefits to be, er, “adjusted.” Suspending the payroll tax as a “crisis” measure won’t help people out of work. But it will apparently make it even more needed to cut benefits down the road. Oops! It will surprise no one that this attempt to violate commitments made to American savers and future retirees is apparently to be called the “Trust Act.” And my British friends always say we Americans “have no sense of irony.” This forthcoming election may decide the fate of Social Security. The president has vowed to eliminate the payroll tax if he’s re elected. Just one thing. There is no Social Security “crisis.” It is completely made up. There is no financial “crisis.” There is no economic “crisis.” The only Social Security “crisis” is the crisis of people believing there is a Social Security crisis. If anyone guts the program, or slashes benefits, they are doing so through choice, not necessity. And they are choosing to slash an absolutely vital program that keeps millions out of poverty and has functioned successfully for 80 years. Read: This eye-opening experience has me rethinking how Social Security fits into my retirement planning Is there a problem with funding? Yes, of course there is. But it is eminently fixable without draconian measures. The most obvious is to get rid of the cap on taxable wages, so people pay the tax on everything they earn. But there are plenty of others. Others include actually investing the Social Security trust funds in stocks, like almost every other pension plan on the planet. The Social Security Administration Trustees, in their latest report, said the so-called “trust fund” will run out by 2035. The technical term for that is “insolvent.” But it’s a word being bandied around deliberately to scare people. It doesn’t mean “insolvent” in any normal meaning of the word. It just means the trust fund, which is an internal accounting technique for the federal budget, will no longer have an accounting surplus. Money out will have to depend on money coming in. The Social Security Administration says the “unfunded obligations” will equal 3% of taxable payroll. Trillions of dollars. Congressional Research Service explains that from 2035 onward, without any changes, benefits could have to be cut by 21% to balance the books. Yikes. But whenever policy wonks—or political journalists, for that matter—write about these things they seem to try to blind us all with science. Sometimes they seem to find the biggest or most abstruse or complicated data possible. (Budget and tax changes, for example, are generally discussed in terms of 10 years’ numbers, because they sound so huge.) So let’s cut through all the scary numbers around Social Security, and just focus on these two items. The first is that the average Social Security benefit is just $1,514 a month. It’s chicken feed. On this, people have to live out their golden years. Cutting this by 21% would mean slashing it to $1,200 a month. That’s the average. Imagine the humanitarian crisis in this country if that happens. And here’s the second gem, which can be found on page 16 of the latest trust fund report. The alleged funding gap, the so-called crisis, represents no more than “1.0 percent of GDP (increased from 0.9 percent in last year’s report) over the 75-year valuation period.” 1%. That’s the “crisis.” Ahem. We were able to find a spare 1% of GDP for the 2017 tax cut. We’re able to borrow several percentage points of GDP every single year to run budget deficits every year. How big a deal is 1 percent of GDP to the federal government? Well, federal taxes were just 16.3% of GDP last year, according to the White House’s numbers. The average under Ronald Reagan? Over one full point higher. So we could fix this just by going back to Reagan-era tax rates. The average during Bill Clinton’s second term was a full 3 percentage points higher than today. And the economy boomed and the stock market soared. According to Statista, we’ve just found 13% of GDP just this year to pay for the pandemic and lockdowns. And apparently we are able to print that money without unleashing inflation or budget panic. Quite the reverse, actually. Long-term interest rates have collapsed. The only crisis facing Social Security is that more and more people under 65 are being convinced that the program will have to be gutted so they shouldn’t plan for it. And that lays the groundwork for the cuts. It’s a perfect circular argument. But: 15 hundred bucks a month. And 1% of GDP. Things to remember, next time someone tries to tell you there’s a Social Security “crisis.”"}]}