{"article": [{"url": "https://www.marketwatch.com/story/when-are-the-confirmation-hearings-for-supreme-court-nominee-amy-coney-barrett-11602265378", "published": 1602260300.0, "headline": "When are the confirmation hearings for Supreme Court nominee Amy Coney Barrett?", "body": "Judge Amy Coney Barrett stands to become President Donald Trump's third nominee on the U.S. Supreme Court in a span of just over 3½ years. Demetrius Freeman/Washington Post via AP Confirmation hearings on President Donald Trump’s Supreme Court nominee, Amy Coney Barrett, are set to kick off Monday, in what promises to be an intense Washington spectacle just three weeks before Election Day. The hearings before the Senate Judiciary Committee are scheduled to get underway at 9 a.m. Eastern time on Monday, in the first of a four-day process. Trump and Senate Republicans are plowing ahead with Barrett’s nomination, over Democrats’ objections. Democrats have said that whoever wins the Nov. 3 election should choose a replacement for the late Justice Ruth Bader Ginsburg, just as Republicans refused to take up President Barack Obama’s nomination of Judge Merrick Garland to the seat vacated upon Antonin Scalia’s death in February 2016, explaining that a presidential election was just nine months away. Now read: Democrats seek more safety as McConnell eyes approval process for SCOTUS nominee “Partisanship will likely reach an 11 next week when the Senate Judiciary Committee hearings begin on Judge Amy Coney Barrett,” wrote Chris Krueger of Cowen Washington Research Group in a note on Friday. Monday’s hearings will feature opening statements, to be followed by two days of questioning. The final day will have testimony from outside witnesses, a spokesman for the Senate Judiciary Committee said. Vice-presidential nominee Kamala Harris, a California Democrat, is among the senators who will question Barrett. The committee is headed by Sen. Lindsey Graham, a South Carolina Republican locked in a tight re-election fight with Democrat Jaime Harrison. See: Here are the Senate races to watch, as Democrats battle to take control from Republicans Trump nominated Barrett to the high court on Sept. 26. The federal judge would be the sixth justice on the nine-member Supreme Court to be appointed by a Republican president, and the third in the 3½ years since Trump’s inauguration. Read more: Trump picks conservative Amy Coney Barrett for Supreme Court"}]}