{"article": [{"url": "https://www.marketwatch.com/story/fortnites-impact-could-be-epic-on-antitrust-investigations-of-big-tech-2020-08-17", "published": 1597748360.0, "headline": "'Fortnite's' impact could be Epic on antitrust investigations of Big Tech", "body": "As lawmakers and privacy advocates continue to methodically press for antitrust overhaul of four of tech's biggest companies, some big names in videogaming could speed up things. That is one of the initial conclusions of legal experts and developers following Epic Games Inc.'s lawsuits against Apple Inc. AAPL, +1.74%   and Alphabet Inc.'s GOOGL, +1.82%  GOOG, +1.97%  Google for booting Epic's hit videogame \"Fortnite\" out of their app stores Thursday. \"Fortnite's\" ouster came after Epic publicly announced an offer for players to receive a discount on in-game purchases if they paid Epic directly. (Late Monday, Epic sought a temporary restraining order in federal court in California to block Apple from removing \"Fortnite\" from the App Store. Epic also asked the court to stop the iPhone maker from terminating its developer account on Aug. 28.) Epic's size and market influence just might be the impetus to ramp up antitrust investigation, said Ram Mohan, chief operating officer of domain-name registrar Afilias Inc. \"Clearly, for the first time, there is a company that has the ability to challenge the rules that Apple and Google have created,\" Mohan told MarketWatch. \"Smaller companies can't do that. Ironically, it takes big tech to take on Big Tech.\" Underscoring Epic's standing, Spotify Technology Inc. SPOT, +0.08%  and Match Group Inc. MTCH, -0.94%  quickly offered statements of support, and Facebook Inc. FB, +0.26%  later claimed Apple refused to wave its 30% fee on Facebook's new paid online events feature. FB, +0.26% FB, +0.26% Read more: 'Fortnite' maker accuses Apple, Google of illegal monopolistic practices in tech battle royale FB, +0.26% FB, +0.26% Eventbrite Inc. EB, -0.09%  , too, could join the chorus of dissent. The company said it has been notified it has until December to start following Apple's rules on in-app purchases because of events going online. Privately held Epic could prove to be Apple's most dangerous antagonist, both financially and symbolically. \"Fortnite\" hauled in $1 billion in player spending on Apple iOS devices through mid-May, based on estimates from mobile-app research company Sensor Tower, suggesting Apple received hundreds of millions of dollars from the hit videogame. In the larger picture, Epic represents a videogame industry that may prove a tipping point for anti-competitive actions by federal lawmakers, who grilled the chief executives of Apple, Facebook, Google, and Amazon.com Inc. AMZN, +3.01%  in a landmark antitrust hearing last month, as well as separate investigations by the Justice Department, Federal Trade Commission and state attorneys general. Microsoft Corp. MSFT, +2.48%  has excoriated Apple for its stance on cloud gaming apps, which the iPhone maker does not allow on the App Store for apparent violations of its guidelines. When asked for comment on Epic's legal actions, Apple late Monday emailed the following statement: \"The App Store is designed to be a safe and trusted place for users and a great business opportunity for all developers. Epic has been one of the most successful developers on the App Store, growing into a multibillion dollar business that reaches millions of iOS customers around the world. We very much want to keep the company as part of the Apple Developer Program and their apps on the Store. The problem Epic has created for itself is one that can easily be remedied if they submit an update of their app that reverts it to comply with the guidelines they agreed to and which apply to all developers. We won't make an exception for Epic because we don't think it's right to put their business interests ahead of the guidelines that protect our customers.\" Apple's unbending stance on videogaming - and pushback from developers, both small and large - is the type of scenario that feeds into antitrust pressure on Apple and Google to change their platform operations, said Rebecca Allensworth, a law professor at Vanderbilt University. \"Antitrust has always had a dual system of enforcement: Private like the Epic suits, and public such as FTC and DoJ investigations,\" Allensworth told MarketWatch. \"Companies feel maximal pressure when under both kinds of scrutiny.\" Antitrust attorney Jonathan Rubin adds, \"What the Epic suit suggests is that even private marketplaces organized within the confines of a private company should be subject to antitrust oversight.\" So far, only a small developer, Blix Inc., has taken on Apple - both in court, and in cooperating with the office of Rep. David Cicilline, D-R.I., chairman of the House Subcommittee on Antitrust, Commercial and Administrative Law. Cicilline led an hours-long inquisition of the four CEOs on July 29. Read more: Antitrust questions bruise but don't break Big Tech CEOs in historic hearing \"What Epic is doing is very powerful. I think it's a big step forward, and pushes momentum for stronger antitrust scrutiny,\" Blix co-CEO Ben Volach told MarketWatch. \"We've heard this from Spotify [it filed a complaint with the European Commission last year against Apple, charging the iPhone maker with anti-competitive behavior related in part to the fees it charges on purchases made through the App Store], but it took a bold move in the U.S. Epic's action talks to a broader monopoly by Apple.\" Blix, which claims it has data showing Apple suppressed App Store rankings of products that compete with Apple's own apps, sued Apple last October, alleging patent infringement and antitrust violations. Blix also believes Apple and Google are working in concert on pricing, which led Google to abruptly kick its BlueMail email app off its Play Store - 36 hours after Blix developers revealed they cooperated with House lawmakers. \"Google retaliated against us for outspokenness on antitrust issues,\" Volach said. A Google spokesperson said in a written statement that the BlueMail app had been reinstated to the store. Volach countered that unfavorable media coverage forced Google's hand after only 15 hours. Yet it might take the actions of much larger companies like Epic to move the needle on antitrust actions in a political setting that is growing increasingly hostile to Big Tech. For years, developers have groused about Apple's 30% tax as exorbitantly high. But many felt they had no choice: There are some 1.5 billion Apple gadgets in use worldwide, and users of Apple devices collectively spend nearly twice as much on apps as do owners of Android gadgets. \"It shows the power of Apple and Google, when you have a company as big as Spotify teaming up with Epic. When titans are taking on titans, you know there is a problem, and that gets people's attention,\" Jamie Court, president of nonprofit Consumer Watchdog, told MarketWatch."}]}