{"article": [{"url": "https://www.marketwatch.com/story/4-safe-ways-to-beat-those-sinking-money-market-fund-yields-2020-06-30", "published": 1593866600.0, "headline": "4 safe and inflation-beating ways to beat those sinking yields on money-market funds", "body": "It’s possible to squeeze more yield out of the cash you are keeping on the sidelines. That’s important, because long gone are the days when you could earn even one percent from a money-market fund. In fact, yields consistently have been below 0.5% for the past decade; nowadays the average national money market fund yield is just 0.09%. Yields are so low that mutual fund giant Fidelity Investments in March decided to close three of its money-market funds to new investors (though it recently announced that it will reopen them in the future depending on market conditions such as rising rates). Don’t despair. Several decent alternatives are available, but first it’s important to view money-market funds on an after-inflation basis. For example, an inflation model maintained by the Cleveland Federal Reserve puts expected inflation over the next 12 months at 0.49%. That means the current average national money-market fund yield is minus 0.40% in real terms. Second it’s a mistake to think that because money-market yields are so low, your money should be in stocks. The Federal Reserve wants you to believe that, since it hopes that by investing in risky assets, investors will stimulate the economy. But equities’ risk does not decrease just because interest rates are low. In fact, equities’ risk arguably increases at such times. What’s left for investors between money-market funds and stocks? There are several choices to consider, each with a relatively short maturity and high quality. Any of these could be a good alternative for at least a portion of what otherwise would be given to a money-market fund: 1. Vanguard GNMA Fund: This fund VFIIX, invests in mortgage-backed securities that are guaranteed by the U.S. government. Its effective duration, according to investment researcher Morningstar, is 1.0 years, and its SEC yield currently is 1.72%. Note that unlike many fixed-income funds, this one carries what’s known as prepayment risk: If many of the mortgages owned by the fund get refinanced at lower rates, then the fund’s yield will decline. 2. Fidelity Conservative Income Bond Fund: This fund FCONX, falls in Morningstar’s “Ultrashort Bond” category, with an effective duration of three to four months. It invests primarily in high-quality corporate bonds, more than 80% of which are A-rated or higher. Its SEC yield is 1.01%. 3. Vanguard Short-Term Investment Grade Fund: This fund VFSTX, has an effective duration of 2.45 years, according to Morningstar, and invests more than 70% of assets in corporate bonds rated A or higher. Its SEC yield is 1.43%. 4. Bank certificates of deposit:.By shopping around, you can find bank CD yields on short-term (less than 24 months) commitments that are above 1%. Bankrate is a good place to start in locating the best rates. Right now, for example, this site is showing a three-month CD with a rate of 1.0% and 12-month CDs with rates as high as 1.2%. Remember, after-inflation return is what counts, and each of these options offers a positive real yield right now. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com More: High volatility is here to stay in 2020. Goldman names 31 stocks to deliver the best returns amid the turbulence Also see: These 5 giant stocks are driving the U.S. market now, but watch out down the road"}]}