{"article": [{"url": "https://www.marketwatch.com/story/trump-knew-the-coronavirus-was-deadly-stuff-but-wanted-to-play-it-down-according-to-woodward-book-2020-09-09", "published": 1599724580.0, "headline": "Trump knew the coronavirus was 'deadly stuff' but wanted to 'play it down,' according to Woodward book", "body": "President Trump warned respected journalist Bob Woodward early in the pandemic that the novel coronavirus was \"deadly stuff,\" even as he minimized the health threat publicly by telling Americans that COVID-19 was \"under control\" and \"going to disappear.\" The contradictory accounts are spelled out in Woodward's new book \"Rage,\" which includes interviews that Woodward recorded with the president from Dec. 5, 2019, to July 21, 2020. CNN and the Washington Post (where Woodward famously broke and reported on the Watergate scandal with fellow journalist Carl Bernstein) were given advance copies of the book, and published the eyebrow-raising accounts on Wednesday, which quickly went viral. Both news outlets obtained some copies of the audio tapes, which included the president admitting that he repeatedly played down the virus to keep the American people calm. \"I wanted to always play it down,\" Trump told Woodward on March 19, days after he had declared COVID-19 a national emergency. \"I still like playing it down, because I don't want to create a panic.\" Indeed, he told a CNBC interviewer on Jan. 22 that he wasn't worried about a pandemic. \"No, not at all. We have it totally under control. It's one person coming in from China, and we have it under control. It's going to be just fine.\" “ 'To be honest with you, I wanted to always play it down. I still like playing it down, because I don't want to create a panic.' ” - President Trump, on March 19, 2020 In early February, he told reporters that by early April, \"when it gets a little warmer, it miraculously goes away.\" And during a Feb. 26, White House news conference, he said that, \"We're going to be pretty soon at only five people [with COVID-19]. And we could be at just one or two people over the next short period of time. So we've had very good luck.\" Meanwhile, Trump was also telling Woodward on Feb. 7 that the coronavirus was \"deadly stuff.\" \"You just breathe the air, and that's how it's passed. And so that's a very tricky one. That's a very delicate one. It's also more deadly than even your strenuous flu,\" he said. And on March 19, Trump warned Woodward that the virus was infecting more people than just the vulnerable populations of elderly Americans and those with pre-existing conditions that health officials and the White House had originally warned about. \"Now it's turning out it's not just old people, Bob. Just today and yesterday, some startling facts came out. Young people, too - plenty of young people,\" Trump said. “ 'This is deadly stuff.' ” - Trump, on Feb. 7, 2020 This was about the time that the president began to present the COVID-19 pandemic as a more serious situation to the media and the American people. He told reporters on March 17 that he \"felt it was a pandemic long before it was called a pandemic.\" Trump responded during a press conference about possible Supreme Court picks on Wednesday. that \"we had to show calm\" in the early days of the pandemic. Read more: Trump responds to Woodward book saying he played down coronavirus: 'We had to show calm' White House press secretary Kayleigh McEnany made the same point during press conference earlier in the day, stating that Trump was doing what \"good leaders\" do: staying calm in a moment of crisis. \"The president has never lied to the American public on COVID,\" she said. \"He makes clear that he doesn't want to see chaos.\" McEnany also said that \"the president never downplayed the virus,\" despite the president himself saying just that - \"I wanted to always play it down\" - on a Woodward recording. iframe.twitter-tweet { width: 100% !important; } But the backlash was swift on Wednesday, with Woodward's book and the hashtag #TrumpKnew trending on Twitter by early afternoon. Critics accused the commander-in-chief of misleading the American people during a once-in-a-century pandemic. iframe.twitter-tweet { width: 100% !important; } Democratic presidential candidate Joe Biden told reporters that Trump \"knew and purposely played [COVID-19] down\" and said that Trump had \"lied to the American people.\" He also called this a \"life and death betrayal of the American people.\" iframe.twitter-tweet { width: 100% !important; } House Speaker Nancy Pelosi offered a rebuttal to the \"calm\" argument on MSNBC, stating, \"The way to avoid a panic is to show leadership, to say, this is what the challenge is, we're going to use the best scientific evidence that is available to us to contain it. We are going to make sure that we can stop the spread of it. That is what stops a panic, not ignoring it,\" Pelosi said. Listen to excerpts of the Woodward recordings here: iframe.twitter-tweet { width: 100% !important; } More than 6.3 million Americans have tested positive for COVID-19 so far, and at least 189,718 have died. A study published by Columbia University's Mailman School of Public Health in May suggested that more than 61% of COVID-19 infections and 55% of reported deaths - nearly 36,000 people - could have been prevented had social distancing measures been put in place across the U.S. one week sooner. Trump called that report a \"political hit job\" at the time. This is a developing story that will continue to be updated."}]}