{"article": [{"url": "https://www.marketwatch.com/story/fed-to-add-pandemic-recession-scenarios-to-next-round-of-big-banks-stress-tests-2020-09-17", "published": 1600363940.0, "headline": "Fed to add pandemic-recession scenarios to next round of big banks' stress tests", "body": "WASHINGTON - The Federal Reserve will analyze large banks' ability to withstand two coronavirus-related recession scenarios as part of a second round of stress tests later this year, the central bank said Thursday. Unlike an earlier round of stress tests this year, the Fed will release the results of the tests for each bank, rather than providing aggregate results for the group. That means investors and the public will have a better understanding of the health of each of the 33 lenders when it comes to lending through the downturn. Designed to gauge the health of the nation's banking system, the stress tests were expanded this year to study the effect of downturn brought on by the pandemic. The Fed said in June that U.S. banks were strong enough to withstand the crisis, based on a series of hypothetical scenarios for the economy. In a sign of the uncertainty facing the industry and broader economy, the Fed required banks to resubmit updated capital plans this fall to reflect current stresses. On Thursday, the board said it would release the latest round of results by the end of the year. \"The Fed's stress tests earlier this year showed the strength of large banks under many different scenarios,\" said Randal Quarles, the Fed's point man on regulation, in a statement. \"Although the economy has improved materially over the last quarter, uncertainty over the course of the next few quarters remains unusually high, and these two additional tests will provide more information on the resiliency of large banks.\" An expanded version of this report appears on WSJ.com. Also popular on WSJ.com: iOS 14 review: Your iPhone will look completely different now, if you want. Defeated quarantine gardeners are throwing in the trowel."}]}