{"article": [{"url": "https://www.marketwatch.com/story/sending-your-kids-to-school-or-not-your-answer-could-be-related-to-how-much-money-you-make-2020-08-17", "published": 1597685120.0, "headline": "Wealthier parents are more likely to send their kids back to physical classrooms â\u0080\u0094 hereâ\u0080\u0099s why", "body": "Schoolâ\u0080\u0099s out, and for many kids this fall, itâ\u0080\u0099s going to stay out â\u0080\u0094 especially if theyâ\u0080\u0099re on the lower end of the income ladder. Thirty-one percent of parents say theyâ\u0080\u0099ll likely or definitely be keeping their kids home if their school physically reopens in the fall, according to a new survey by JAMA Pediatrics. Almost half of the parents (49%) in the 730-person survey conducted in early June said theyâ\u0080\u0099d likely or definitely be sending their kids to school. Another 20% said theyâ\u0080\u0099re equally likely to keep their kids home for virtual learning or send them to in-person instruction. “ The parents most likely to keep their kids home (38%) made less than $50,000. ” Researchers found financial differences between the families who were planning for their children to physically attend school and those who were not. The higher their income level, the more likely parents were to say that they planned to send their kids into the classroom. The parents most likely to keep their kids home (38%) made less than $50,000 a year. The second-most likely set of parents (29%) to consider keeping their kids home made between $50,000 and $100,000 a year. On the other end of the spectrum, 27% of parents making more than $150,000 a year will or likely will keep their kids home. They may be paying for â\u0080\u009cteaching podsâ\u0080\u009d and â\u0080\u009cprivate educatorsâ\u0080\u009d instead. In a distant fourth, only 21% of parents making between $100,000 and $150,000 a year are planning to keep their kids home, the study said. Nearly two-thirds (58%) of this demographic said they were planning to send their kids to school. Part of the discrepancy could also stem from how much money a school has, said study author Emily Kroshus, a professor in the University of Washingtonâ\u0080\u0099s Department of Pediatrics. The study suggested that parents with more money had more confidence their school was ready to teach in-person while preventing the spread of COVID-19. â\u0080\u009cThis finding really speaks to inequality in school experiences,â\u0080\u009d Kroshus told MarketWatch. “ Because property taxes and school funding are linked, lower-income parents are more likely to live in communities with poorly-funded schools. ” â\u0080\u0094 Emily Kroshus, a professor in the University of Washingtonâ\u0080\u0099s Department of Pediatrics Property taxes and school funding are linked in the U.S., and â\u0080\u009clower-income parents are more likely to live in communities with poorly-funded schools,â\u0080\u009d she said. Better funded schools are more likely to have a lower teacher-student ratio, and more staff to implement and enforce safety procedures in the fall, experts say. â\u0080\u009cIf schools have failed to meet their childâ\u0080\u0099s needs pre-pandemic, itâ\u0080\u0099s likely that parents will generalize those experiences to how the school will address the current situation,â\u0080\u009d Kroshus told MarketWatch. If parents also have older adults, like grandparents, living with them, that could complicate their decisions too. The elderly disproportionately account for COVID-19â\u0080\u0099s death toll, research shows. â\u0080\u009cMultigenerational householdsâ\u0080\u009d have been on the rise for years, going from 12% of the population in 1980 to 20% in 2016, according to the Pew Research Center. Asian-American, Black and Hispanic families are more likely to live in multigenerational households, Pew noted. Black and Hispanic communities are bearing an outsized share of COVID-19 related hospitalizations and deaths â\u0080\u0094 so much so, that there is some debate on whether these communities should be prioritized once a vaccine becomes available. No matter how much money they make, parents have a tough choice. If their childâ\u0080\u0099s school is open, they can keep their kids home for virtual learning, a repeat of the spring. Or they can send their kids to commingle in schools during a fall that will combine the coronavirus pandemic with the regular flu season. It will be â\u0080\u009cthe worst fall, from a public health perspective, weâ\u0080\u0099ve ever had,â\u0080\u009d according to Robert Redfield, director of the Centers for Disease Control and Prevention. Of course, as parents decide what to do, the study shows itâ\u0080\u0099s not a purely dollars-and-cents decision. After controlling for various factors, parent plans to keep kids home were associated with fears of coronavirus, fears of multisystem inflammatory syndrome â\u0080\u0094 a rare, but serious condition for children that could be linked to COVID-19 â\u0080\u0094 confidence in their school system and the challenges of homeschooling. Parents donâ\u0080\u0099t have a guarantee their childâ\u0080\u0099s school is even going to be physically open. “ Wealthier parents were more likely to say that they planned to send their kids into the classroom. ” The study comes while school districts across the country are grappling with the common question of whether to physically re-open facilities and, if so, to what extent. Los Angelesâ\u0080\u0099 700,000-student school system, the second largest in the country, will start the year with online-only instruction, after negotiations between the cityâ\u0080\u0099s education officials and its teachers union. Chicago, Miami and Houston are other major cities starting the year with remote learning. But New York City, the countryâ\u0080\u0099s largest school system, with 1.1 million students, is still planning a hybrid model where parents can choose from either a blend of remote and classroom instruction or all remote learning. More than 700,000 kids are planning for the blended model, New York City Mayor Bill de Blasio said on Twitter TWTR, -0.23% Â . Donâ\u0080\u0099t miss:Fauci urges schools to hold classes outdoors as much as possible Some school districts physically reopened and then had to temporarily shut their doors. Pictures of the crowded hallways in Georgiaâ\u0080\u0099s North Paulding High School bounced around the internet. Then the school had to close for several days in the wake of nine confirmed infections. Itâ\u0080\u0099s that fear of infection that is making many teachers view their job as perilous. Almost three-fourths (72%) of teachers said their job is at least somewhat risky because of COVID-19, according to a survey of approximately 200 K-12 teachers by the Center for State and Local Government Excellence, a nonprofit organization focused on state and local governments. Seventy percent of those teachers trust their local government â\u0080\u0094 presumably containing the schools where they work or send their kids â\u0080\u0094 to make the appropriate decisions on employee safety. Almost 60% have little, if any, trust that the federal government will make appropriate decisions about worker safety during the pandemic, the survey said. Earlier this month, President Donald Trump unveiled recommendations for schools that reopen this fall. â\u0080\u009cWeâ\u0080\u0099re looking for that responsible path forward to shelter those at highest risk while allowing those at lower risk to resume work in school and play football. Go play football,â\u0080\u009d Trump said at one point."}]}