{"article": [{"url": "https://www.marketwatch.com/story/we-want-casinos-upscale-shopping-and-less-extreme-weather-than-new-jersey-for-7000-a-month-where-should-we-retire-2020-08-27", "published": 1601135900.0, "headline": "'I hate the humidity and can do with a lot less snow and ice, and my husband hates the extreme heat' - where should we retire?", "body": "Dear MarketWatch, My husband and I are in our mid-50s and plan to retire in about 10 years. We live in northern New Jersey and want to move somewhere that has less extreme weather and lower taxes. We will have around $6,500-$7,500 a month in retirement, inclusive of Social Security (probably be around $3,000-$3,500 a month for both of us). We both can consult on the side if we want to make a few extra dollars, but that can be anywhere. We will have a house to sell and probably a new one to buy. The mortgage on the new one would be capped around $1,500, coming out of that $7,500. We would like to be within an hour of a casino and be in a gay-friendly area that has great options for shopping (a nice mall with good shops like Nordstrom, Bloomingdale's) and medical care and is in a tax-friendly area. I hate the humidity and can do with a lot less snow and ice, and my husband hates the extreme heatâ\u0080¦There must be a few places where we can both be happy! Somewhere west perhaps? Regards Sean Dear Sean, An upscale mall means living in or near an affluent, large city. So does great medical care. That doesn't necessarily come cheap, even without those infamous New Jersey property taxes. A big unknown is whether we will still be shopping the same way in a decade, given both COVID-19 and the growth of online shopping. See Lord & Taylor, which is shutting stores as part of its bankruptcy filing. And of course, a lot can change with taxes too - not just state income taxes but also property taxes, sales tax rates and how a state treats inheritances and estates. You may want to consult a tax professional to go over the numbers closer to your move. I'd also suggest you and your husband talk more about what your typical day will look like. If the focus is on shopping, going out and trips to the casino (and perhaps more travel?), be honest about how much that lifestyle costs you now, with less free time. If your income is at the lower end of your range and you subtract the mortgage, that's less than $60,000 a year (still got to subtract taxes) that you'd be living on. Is that realistic? Read:Health care will cost this much in retirement - but probably even more If your solution is to do consulting, ask friends who've been doing it for a few years about what to expect, both in terms of time and income. Be conservative, rather than optimistic, about your numbers to avoid unpleasant surprises. One risk we all face: being pushed out of a job before we're ready to retire. The good news is that you have plenty of time to adjust your lifestyle and savings rates now if needed. If it all looks good as is, congratulations. Read:Try these 10 easy things to improve your finances now You may have to compromise on the weather â\u0080¦ no extreme heat rules out the South and wanting less snow and less humidity rules out a lot of the rest of the country. What's left (San Diego is an obvious one) comes with a bigger price tag. On the other hand, when you're retired, you have freedom to travel to get a break from the snow or humidity without needing to consult the office vacation schedule. Based on today's tax rates, Nevada and Washington state are good fits (neither has a state income tax) and, with a bit of flexibility, could work on the weather side. But given that many states offer some kind of break on Social Security and pension income, you may be surprised at how little you could pay in, for example, Pennsylvania, Delaware and, yes, even California. Plug in different assumptions on Smart Asset's retirement tax calculator and see how you fare. Here are some suggestions to get you started. In Reno, Nevada, you can surf the Truckee River. VisitRenoTahoe.com Reno, Nevada If Nevada, then fast-growing Reno over Las Vegas because you'll like the weather better (though yes, it will still be hot - but an average July high of 93 sounds more pleasant than 107 in Vegas). It does get below freezing at night in December and January, but those daytime highs average 46 degrees. Reno has about 260,000 people (the broader metro area is about 500,000) and has the shopping, casinos and medical facilities you want. If you can, go closer to the California line so you're already at higher elevation and a bit cooler during the summer. Outdoor Magazine included Reno on its \"new adventure capitals\" list of best places to live in 2019. Indeed, you could be in Lake Tahoe in an hour. Yosemite National Park is three hours south. And in how many other places can you surf on the river? Not your thing? Reno has a month-long summer music festival called Artown that showcases local talent. The summertime Lake Tahoe Shakespeare Festival takes place in Incline Village less than an hour away. And Reno is the gateway to the Burning Man festival. In terms of gay-friendliness, Reno is one of 83 cities that gets a perfect 100 from the Human Rights Campaign's Municipal Equality Index. The HRC, a major gay-rights advocacy group, looks at factors like whether the city has nondiscrimination laws for housing, a human rights commission and an LGBTQ liaison in the mayor's office as well as whether it provides services to or supports LGBTQ elders. HRC is also developing a long-term care equality index and a health-care equality index. Here's what your money will buy, using current listings on Realtor.com (which, like MarketWatch, is owned by News Corp.) Global Gardens works with refugee farmers in Boise, including Chimwaga Six. Photo courtesy of Boise Convention & Visitors Bureau Boise, Idaho It would be easy to suggest an affluent and diverse suburb of Seattle, like Kent, Federal Way or Renton, that is close to the upscale shopping of more expensive Bellevue. But housing in the Seattle area is particularly pricey, and you'd face a lot of rainy days. Instead, consider the capital of Idaho, home to about 230,000 people (and just as many in the rest of the county). Mountains and desert meet here, so the climate is mild - probably much milder than you'd guess. (To put it in USDA hardiness zone terms that gardeners can appreciate, Boise reaches zone 7a, compared with 6b for much of North Jersey.) Average July highs are 93 and low humidity, compared with upper 70s in those Seattle suburbs. Average winter highs are above freezing. And you'll get less rain and less snow than in North Jersey. Boise's downtown is booming. The foodie scene garners James Beard nominations, complemented by about 20 craft breweries. Yes, there are even wineries. A quirky side? The city is home to the largest concentration of Basques per capita in the U.S. (cue restaurants, museum and festival). You'll also have a couple of big hospitals, and, in normal times, 22,000 students attending Boise State. Broadway touring companies make a stop here. Shopping won't match Seattle, but there is a Nordstrom Rack. Taxes? Unlike Washington, there's income tax, but the breaks on Social Security income suggest you won't be paying much. Unfortunately, you'll have to drive more than an hour to a casino (the nearest are 139 miles away in Jackpot, Nev.). The website Livability ranked Boise as the No. 1 place to live last year. Among the many outdoor options in the area are ski resorts, most notably Sun Valley (nearly three hours away). Or you can sand surf and sand ski at Bruneau Dunes States Park an hour away. Some of the best whitewater rafting in the Lower 48 is on the Payette River a half-hour out of town. And do you know about Idaho's hot springs? The bad part? Boise has been discovered. Housing prices are rising quickly. Here's what's on the market now, again using Realtor.com. Boise also doesn't rank as well on the HRC municipal equality index, with 80 points. And if you choose to live outside Boise, neither Ada County nor the state have antidiscrimination laws on the basis on sexual orientation or gender identity. That said, Boise isn't far from qualifying as an HRC \"all-star city\" given to municipalities in places that lack such statewide protections. Check out The Community Center for local resources. This historic market, located across the street from Independence Hall and the Liberty Bell in Philadelphia's Historic District, commemorates the Annual Reminders, the country's first annual demonstration led by gay activists. J. Fusco for VISIT PHILADELPHIA Philadelphia My wild-card pick: City living in America's fifth-largest city (1.5 million people). It's quite the foodie city featuring independent restaurants (bonus: many are BYOB), it has cultural activities galore as well as casinos, and its neighborhoods have different personalities - historic, modern, gentrifying, new high-rises loaded with amenities, townhouses, free-standing homes. Housing on average is much more affordable than North Jersey - or Boise or Reno. The Midtown Village and Rittenhouse Square areas would score big on shopping and restaurants, and both are close to some of the best medical care in the country. Gay-friendly? Not only does HRC give the city 100 points but the newer Pride flag with black and brown stripes originated in Philadelphia. You'd avoid much of that North Jersey snow. Winters will be warmer than you're used to and warmer than in Boise; the average high in January is 41 degrees. Average July highs are 89, but you'll get more humidity than in Idaho. Here's a perk for seniors, especially if you decide to go car-free: free bus and subway travel, and huge discounts on regional rail. A word of caution if you decide to WFH in Philly - the city's 3.8712% wage tax. If not the city, perhaps a suburb? Given the interest in shopping, start looking in a radius around King of Prussia mall. And how important is train service into Philadelphia? Just to get you started: Ardmore is the largest and most diverse town on the Main Line, and its open-air shopping center has just experienced a \"staggering face-lift.\" Phoenixville, once home to an iron and steel maker (it closed in 1987), is further out and has been revived with an \"artsy, low-key vibe.\" It's also become a destination for craft beer. If you want to look southwest of the city, begin with Media and Swarthmore. Here's what's on the market now in Philadelphia, Ardmore and Swarthmore. Readers, where should Sean and his husband retire? Leave your thoughts in the comments section."}]}