{"article": [{"url": "https://www.marketwatch.com/story/im-an-upper-middle-class-loner-entering-the-home-stretch-of-my-life-who-will-manage-my-last-wishes-2020-10-02", "published": 1601894180.0, "headline": "Iâ\u0080\u0099m an upper-middle-class â\u0080\u0098lonerâ\u0080\u0099 entering the â\u0080\u0098home stretch of my lifeâ\u0080\u0099 â\u0080\u0094 who will manage my last wishes?", "body": "Dear MarketWatch, I am entering the home stretch of my life. I am a loner with no close relatives and a few friends, but none really close. I will need to name an executor of my estate and will need a professional. Can you guide me to any resources or publications that can assist me? As background, I am solidly upper middle class and comfortable; certainly not rich. Thank you for any guidance or thoughts, P.F. See: Iâ\u0080\u0099m retired, my wife isnâ\u0080\u0099t â\u0080\u0094 how should we pay off our $60,000 mortgage before she retires Dear P.F., Thanks so much for your question â\u0080\u0094 choosing the right individual to manage your estate is such a crucial task when planning where and with whom to leave your assets, so itâ\u0080\u0099s great youâ\u0080\u0099re thinking about it. An executor must be someone you trust, and there are a few ways to narrow down who you end up using for this role. You mention you have no close relatives and a few friends, but is there anyone within this group that you would feel comfortable to have managing your plans when youâ\u0080\u0099re gone? If not, you can move on to a professional or institution for the job. â\u0080\u009cEspecially when there are no close relatives, you have to be careful with whom you chose to play those critical roles,â\u0080\u009d said Marianela Collado, chief executive officer and senior financial adviser at Tobias Financial. There are various types of professionals who can serve as an executor of your estate. Banks, trust companies and estate attorneys could take on the job, advisers said. Even financial advisers and Certified Public Accountants could act as executor. â\u0080\u009cIf you can trust the adviser with managing your money, you should also be able to trust them with the responsibility of acting as executor of an estate,â\u0080\u009d said Michael Simmons, director of financial planning at Transitions Wealth Management. â\u0080\u009cThe same can also be said of other trusted advisers with whom someone may work, such as a banker, CPA or estate planning attorney.â\u0080\u009d There are four key qualities to consider when choosing an executor, said Robert Pyle, founder of Diversified Asset Management. That person or entity should be: someone you can trust and know is willing to do the job; who understands your wishes and will see them through; who will be â\u0080\u009caround to do the job;â\u0080\u009d and who is in good financial health. â\u0080\u009cYour executor is the CEO of your estate,â\u0080\u009d Pyle said. â\u0080\u009cThis role of executor can mean handling everything from distributing assets to heirs to ensuring any taxes due are paid. In other words, your executor is a crucial player on your estate planning team, so choosing the person should not be taken lightly.â\u0080\u009d Donâ\u0080\u0099t miss: Whereâ\u0080\u0099s the best place for me to retire? Financial advisers may not be able to provide legal advice, but they can walk clients through key concepts and how to navigate certain decisions, said Brett Holmes, a financial adviser at financial firm Berman McAleer. They could also potentially prevent a mistake from occurring, such as choosing the wrong individual to manage your last wishes. The consequences of the wrong person taking the job could be dire. â\u0080\u009cSome examples include choosing an incompetent executor or choosing someone who is too emotional to be able to handle the estate and lets it drag out for years before acting,â\u0080\u009d he said. And the role of an executor, especially when that person is close, can be emotionally overwhelming, said Ben Simiskey, director of wealth management at Stegent Equity Advisors, who is also acting as an executor for two estates â\u0080\u0094 his fatherâ\u0080\u0099s and motherâ\u0080\u0099s. You said you donâ\u0080\u0099t have any close relatives to choose from, but other readers may want to consider the responsibilities they are leaving upon their loved ones. â\u0080\u009cBy naming someone you are very close to as executor, you are asking them to do perhaps the most difficult multitasking of their life,â\u0080\u009d he said. â\u0080\u009cInstead of being able to focus on mourning and processing and healing, they also must juggle extensive legal and financial commitments and may become the â\u0080\u0098bad guyâ\u0080\u0099 or punching bag for other family members and heirs.â\u0080\u009d Simiskey said heâ\u0080\u0099s always included someone close to him as an executor of his will, but this experience has made him shift perspectives, and he now recommends his clients and others consider someone outside of the family circle. â\u0080\u009cYou want someone who will be willing to serve and spend the time necessary to carry out their duties as executor,â\u0080\u009d he said. â\u0080\u009cWe need to consider the full impact of our passing on those who are closest to us and whether the burden of serving as executor would be detrimental to their emotional or mental well-being.â\u0080\u009d But there are other ways, outside of an executor, to get your assets where you want them to be. â\u0080\u009cThe executor controls the administration of oneâ\u0080\u0099s probate estate, but many clients prefer to minimize the portion of their estate that goes through the probate process,â\u0080\u009d said Christopher White, vice president of trusts and financial planning at Peoples Bank. â\u0080\u009cIn this individualâ\u0080\u0099s situation, he may want to have the lionâ\u0080\u0099s share of his estate outside of the probate process, which can significantly reduce (or even essentially eliminate) the importance of an executor as part of oneâ\u0080\u0099s estate plan.â\u0080\u009d The other benefits to avoiding probate: privacy, reduced administrative costs and a faster transfer of assets, White said. Also see: I have student debt, a mortgage, a growing family and Iâ\u0080\u0099m relocating for work â\u0080\u0094 how do I save for retirement? To do this, name and title beneficiaries to your assets, said Leslie Beck, owner and principal of Compass Wealth Management. Designate beneficiaries on investment accounts, life insurance policies, checking and savings accounts and other assets, which would reduce what of your estate goes through probate, she said. If youâ\u0080\u0099ve already named beneficiaries on anything, now would be a good time to review it so that everything is up-to-date â\u0080\u0094 otherwise, someone you did not intend to get your assets may still get them. You can also register property to a trust, and add a â\u0080\u009ctransfer on deathâ\u0080\u009d or â\u0080\u009cpayable on deathâ\u0080\u009d provision, so that these items go to a beneficiary, White said. â\u0080\u009cAlthough a client should have a valid will naming an executor (and probably a successor executor if the primary person is unable or unwilling to sere, the importance of this role can be greatly minimized through proper estate planning,â\u0080\u009d he said. Different assets may have varying terminology â\u0080\u0094 for example, bank accounts use the term â\u0080\u009cpayable on death,â\u0080\u009d whereas brokerage accounts use â\u0080\u009ctransfer on death,â\u0080\u009d said Mark Ziety, executive director of WisMed Financial. â\u0080\u009cTransfer on death deedâ\u0080\u009d would be used for real estate. Who you plan to give an inheritance to also matters. If you choose to leave money to a charity, for example, you can use a charitable remainder trust, which would provide you with an income stream during your retirement and give the rest to a charity upon death. The charity may also act as a trustee, similar to an executor, in this scenario, Ziety said. Estate planning must be comprehensive, and a lot of that involves paperwork: wills, beneficiary designations, trusts and documents that dictate how you want your affairs handled if you become incapacitated (such as in the form of a durable power of attorney or health care proxy). Without an estate plan in place, the government and courts decide what happens to your belongings, said Belle Schneider, a financial adviser at VLP Financial Advisors. â\u0080\u009cEstate planning is really to help the people you care about, not just yourself,â\u0080\u009d she said. Have a question about your own retirement savings? Email us at HelpMeRetire@marketwatch.com"}]}