{"article": [{"url": "https://www.marketwatch.com/story/shes-ready-to-do-this-job-on-day-one-biden-harris-debut-as-running-mates-2020-08-12", "published": 1597254920.0, "headline": "â\u0080\u0098Sheâ\u0080\u0099s ready to do this job on Day Oneâ\u0080\u0099: Biden, Harris debut as running mates", "body": "Joe Biden and Kamala Harris came out swinging at Donald Trump in their first public appearance as running mates on Wednesday, pledging to bring back jobs and prop up the middle class as the U.S. recovers from the coronavirus pandemic and grapples with a racial reckoning. Invoking her work taking on big banks, oil companies and the â\u0080\u009cgun lobby,â\u0080\u009d Biden called Harris a champion of the middle class and a fighter who â\u0080\u009cknows how to govern.â\u0080\u009d The pair spoke in Wilmington, Del., a day after Biden, the former vice president, announced heâ\u0080\u0099d chosen her. â\u0080\u009cIâ\u0080\u0099m ready to get to work,â\u0080\u009d said Harris, who slammed Trump over his handling of the pandemic, saying the U.S. leads the world in coronavirus cases â\u0080\u009cbecause of Trumpâ\u0080\u0099s failure to take it seriously from the start.â\u0080\u009d Biden called Harris â\u0080\u009cready to do this job on Day One,â\u0080\u009d as the California senator sat nearby. Biden is scheduled to accept the Democratsâ\u0080\u0099 nomination next week, via a video speech from Delaware instead of in-person in Milwaukee. The partyâ\u0080\u0099s convention is almost entirely virtual this year, as leaders urged participants to stay away over coronavirus fears. Now see:The Obamas, AOC and Kamala Harris: Hereâ\u0080\u0099s whoâ\u0080\u0099s speaking to the Democratic convention and when. Trailing Biden in the polls, Trump has accused Harris of pulling Biden to the left of his party and says itâ\u0080\u0099s he and the Republicans who can help bring the economy back. Also read:Kamala Harris is Bidenâ\u0080\u0099s running mateâ\u0080\u0094hereâ\u0080\u0099s what she means (and doesnâ\u0080\u0099t mean) for financial markets. â\u0080\u009cWith Kamala Harris by his side, the leftist takeover of Joe Biden is complete,â\u0080\u009d Trumpâ\u0080\u0099s campaign said in a statement on Wednesday. â\u0080\u009cOnly President Trump and his administration can be trusted to rebuild our economy, defend our national security, and put America First,â\u0080\u009d the statement said. Opinion:Biden lays a trap for Trump in picking Harris. Analysts have said health-care stocks XLV, +0.90% Â could benefit from a Biden-Harris win, while financials XLF, +0.11% Â would be negatively impacted. Harris, 55, is a daughter of Jamaican and Indian immigrants. The 77-year-old Bidenâ\u0080\u0099s age has prompted questions about whether he would serve two terms as president and put extra focus on his choice for vice president. Biden in late April said he viewed himself â\u0080\u009cas a transition candidateâ\u0080\u009d who would have young leaders in his administration."}]}