{"article": [{"url": "https://www.marketwatch.com/story/how-long-the-300-unemployment-benefit-lasts-all-depends-on-which-state-you-live-in-11600196626", "published": 1600964300.0, "headline": "Funding for the extra $300 unemployment benefit is nearing depletion - but it's lasting longer in some states", "body": "The airline industry, among several others, has been hit particularly hard by the pandemic. As a result, thousands of workers have been laid off or furloughed (Photo by KAMIL KRZACZYNSKI/AFP via Getty Images) AFP via Getty Images Jobless Americans in more than 22 states are now receiving an extra $300 a week in unemployment benefits under President Donald Trump's executive order. But how much money people will ultimately get and how long the benefit will last depends on which state they live in. In some states, the payments will cover six weeks retroactive to Aug. 1, but for unemployed Americans in other states, that won't be in the case. Nine states - Alabama, Arizona, Massachusetts, Missouri, New Hampshire, New Mexico, Rhode Island, Texas and Utah - have finished making the $300 payment to claimants for six weeks, as of Tuesday. Thirty-seven other states have been approved for six weeks' worth of funds and some are in the process of distributing it. Then there are states like Florida and Idaho, which have informed unemployment beneficiaries that they won't be receiving the enhanced benefit for six weeks. Arkansas and Wyoming are the only two states that are waiting to be approved by the Federal Emergency Management Agency, which oversees the Lost Wage Assistance program, for six weeks' worth of funds. But with just 6%, or $2.5 billion, of FEMA's $44 billion chest remaining to make LWA payments to states, residents of those states may not receive the $300 for the entire six weeks. Why Floridians are getting four weeks' worth of funds and not six On Sept. 14, Florida's Department of Economic Opportunity said eligible Floridians will receive only four weeks' worth of the additional $300 benefit. That's because Florida is no longer eligible to hand out the extra $300, which is being funded by $44 billion in federal disaster relief funds. To qualify for the extra $300, unemployed workers must already receive at least $100 a month in state-level unemployment benefits. States can chip in this $100 themselves, or pay 25% of all of their weekly unemployment claims using state funds to make their residents eligible for the extra $300. But as of Aug. 29, only about 368,000 unemployment claims in Florida were state-funded. That amounts to19% of Florida's total unemployment claims, First Coast News, a Florida news outlet, reported. States who met the 25% cost-sharing requirement or chipped in $100 extra, including Montana and Kentucky, were initially guaranteed at least three weeks of the $300 add-on benefit once approved by FEMA. Because unemployment beneficiaries are only eligible for the extra $300 if they receive at least $100 in state-level benefits, nearly 1 million Americans who receive less than $100 a week would be ineligible for the add-on benefit, Eliza Forsythe, a labor economist and assistant professor at the University of Illinois at Urbana-Champaign, calculated. But more recently, FEMA said that it will \"make grant awards to enable requesting states, territories and the District of Columbia to make $300 LWA supplemental wage payments to eligible claimants for a full six weeks.\" The percentage of Floridians receiving state unemployment benefits has continued to decline despite the significant number of new cases of coronavirus reported in the state. That's not necessarily a sign of economic recovery. It is likely occurring because Floridians are only eligible for 12 weeks of state unemployment benefits, the shortest span of time among all 50 states. \"Florida's historically low unemployment rate in 2019, pre COVID-19, set the number of weeks Floridians are eligible for state Reemployment Assistance in 2020,\" Paige Landrum, a DEO spokesperson said in a statement to MarketWatch on Sept. 14. At the federal level, Floridians could still be eligible for unemployment benefits through CARES Act funded programs such as Pandemic Emergency Unemployment Compensation or Pandemic Unemployment Assistance. But those payments won't count towards the 25% states are required to pay in weekly unemployment claims to qualify for the $300 add-on benefit. It's unclear whether that's also why Idaho is distributing the $300 for five weeks instead of six. \"Idaho completed the Lost Wages Program and will not be paying a 6th week,\" Craig Shaul, a spokesman at the Idaho Department of Labor, told MarketWatch. Shaul did not respond to multiple requests for comment regarding why the state won't be paying a sixth week. Related: The extra $600 in weekly unemployment benefits expired - but gig workers and self-employed Americans still qualify for benefits At least 27 states haven't started paying the $300 weekly benefit In total, 49 states have been approved by FEMA to start making payments. South Dakota was the only state that did not apply.  At least 22 states have either started or completed making the $300 payment to eligible claimants as of Sept. 24. Don't miss: U.S. jobless claims are rising again - and this state is a big reason for that Claimants in Alaska, which received FEMA's approval on Aug. 24, likely won't receive the $300 benefit for another month due to computer reprogramming challenges, the Alaska Department of Labor and Workforce Development said. However, the state has been approved for six weeks' worth of funds from FEMA to make the retroactive payments. For a while, it seemed as though states that began administering the $300 add-on benefits quickest would have access to FEMA's finite funds for a longer period of time than states like Alaska, said Michele Evermore, a policy expert at the National Employment Law Project, a nonprofit group that advocates for low-wage workers. That's why \"FEMA had to stop payment in some of the states that have been faster to pay benefits to make sure that the distribution of the benefits is equal across states,\" Evermore said. That doesn't appear to be case for residents of Arkansas and Wyoming given that the two states haven't been approved for six weeks' worth of funds. \"We have applied for all six available weeks of LWA funding, and we received approval for the first three weeks a few weeks ago,\" Ty Stockton, a spokesperson for Wyoming's Department of Workforce Services, told MarketWatch. \"We received approval for Week 4 [on Wednesday], and we are still waiting to hear whether we will be approved for Week 5 and Week 6. We will begin paying qualifying claimants for Week 4 immediately.\" Representatives from Arkansas' Division of Workforce Services did not respond to a request for a comment.West Coast wildfires and other natural disasters aren't eating into LWA funds, FEMA says There are also concerns that FEMA funds intended for the LWA program payments are being used to help fight the wildfires raging across the West Coast, among other natural disasters, before all states have the opportunity to distribute six weeks of the $300 add-on benefit given. A FEMA spokesperson said that wasn't the case. \"FEMA's funding of ongoing recovery projects from previous as well as new disasters has not been affected by the COVID-19 pandemic,\" the spokesperson told MarketWatch. “ Last month, the Committee for a Responsible Federal Budget, a nonpartisan think-tank, estimated that the FEMA funds weren't sufficient to fund more than five weeks of LWA payments. ” Evermore is skeptical of that. \"Who knows how fast it'll wind down,\" she said, referring to the FEMA fund. \"With all the wildfires it seems like a big promise to make,\" Evermore said, referring to funding six weeks' worth of the $300 benefit for 49 states. The looming question: What's next? As for what nearly 30 million unemployed Americans could expect after the FEMA funds are exhausted, absent of any Congressional or executive actions, they'll go back to receiving pre-pandemic amounts of unemployment benefits. In six states, the maximum amount of unemployment benefits one can collect equates to less than the $7.25 an hour federal minimum wage, CNBC reported. \"I'm terrified that Congress ignores this and then there's another wave of COVID and layoffs,\" Evermore said. That could prove to be the case given that senators' time in the coming weeks will likely be occupied by confirmation hearings for the next Supreme Court justice to fill Ruth Bader Ginsburg's seat. Trump tweeted TWTR, -0.23% on Tuesday that he will be announcing his nomination on Saturday."}]}