{"article": [{"url": "https://www.marketwatch.com/story/hurricane-laura-may-do-little-to-disturb-relative-calm-in-summer-gasoline-prices-2020-08-27", "published": 1598528780.0, "headline": "Hurricane Laura may do little to disturb relative calm in summer gasoline prices", "body": "Gasoline likely has experienced the most price-steady summer in at least a decade. And recent Atlantic storm-related refinery snags and the expected seasonal slowdown in fuel consumption may do little to shake things up for long. “Gasoline prices have seen little movement during summer, probably the most stability in at least 10 [to] 15 years,” says Patrick De Haan, head of petroleum analysis at GasBuddy, an app that tracks travel and navigation. “ ‘Gasoline prices have seen little movement during summer, probably the most stability in at least 10 [to] 15 years.’ ” — Patrick De Haan, GasBuddy The national average price for regular unleaded has generally stood between $2.16 and $2.20 in the last eight weeks, he says. That’s a “tremendous” feat given the “tug of war going on between market forces,” which include the pandemic. On Thursday morning, retail gasoline stood not far from that range, at $2.235 a gallon, according to GasBuddy. Prices are up by over a nickel from a month ago, but down about 35 cents from a year ago. On the futures market, front-month September gasoline US:RBU20 fell by more than 6% to $1.2733 a gallon in Thursday dealings, trading around 0.9% lower week to date. Read:U.S. oil futures set for first loss in 4 session as traders bet on a quick output recovery from Hurricane Laura Covid-19 has recently kept prices “largely quiet as we’ve seen little remarkable change in new cases,” says De Haan. Gasoline demand in the third week of August was down by a little over 1% from a week earlier, he says, as “summer fades and it’s back to school for many, even if it’s online only.” Compared with demand a year ago, “we’re in the ballpark of down 15%,” though demand did see a big increase in Louisiana over the Aug. 22-23 weekend when the storms known as Marco and Laura were headed toward the U.S. Gulf Coast, says De Haan. Marco made landfall as a tropical storm Monday, while Laura reached Texas and Louisiana with winds of as high as 150 miles an hour late Wednesday. Typically, demand climbs ahead of the storms, with much less demand after—usually leading to a “notable net loss in the affected area,” De Haan says. This year, however, it’s difficult to compare demand impact between the most recent Atlantic storms and past storms, because Covid-19 has “muted” consumption so much already. Storms can bring disruptions from rain, as well as power outages. Hurricane Harvey in 2017 led to a 14% jump in national average gasoline prices about two weeks after making landfall, says Ken Robinson, market research manager at reimbursement platform Motus. Harvey caused excessive flooding and “traversed most of the Gulf Coast’s refinery infrastructure.” More than 45% of total U.S. petroleum refining capacity is located along the Gulf Coast, according to the Energy Information Administration. As the region recovers from the latest storms, Robinson says key refineries to watch are the Motiva refinery in Port Arthur and Marathon Petroleum’s MPC, -3.21% at Galveston Bay, both in Texas. The fuel market, however, may not see a big supply shortage. With U.S. refineries operating in the low 80% range of capacity, and the other half of the nation’s refining capacity outside of the region, there’s likely to be available capacity to tap as needed, says Stewart Glickman, energy equity analyst at CFRA Research. Storms also “tend not to have long-lasting effects on prices,” which generally return to pre-storm levels in a “matter of weeks.” Though unlikely, if a quick post-hurricane restoration of refinery operations coincides with an acceleration in Covid-19 cases that subdues refined product demand, and refiners maintain or expand the amount of crude they process, gasoline prices would suffer, says Glickman. However, with demand already “abnormally low,” and assuming only short-lived supply disruptions, Robinson says prices may see a “slight increase” in the next few weeks, with no big swings on the horizon. “Until the surplus of both gasoline and crude oil is consumed and we move closer to a balance of supply and demand, prices will likely remain similar to where they’ve been in recent weeks,” says Robinson."}]}