{"article": [{"url": "https://www.marketwatch.com/story/these-homeowners-are-seeking-mortgage-forbearance-and-their-reasons-why-say-a-lot-about-the-economy-2020-06-16", "published": 1592393360.0, "headline": "These homeowners are seeking mortgage forbearance and their reasons why say a lot about the economy", "body": "As the COVID-19 crisis has metastasized into an economic recession, millions of Americans are struggling to keep up with their mortgage payments. I fundamentally believe that losing one’s job shouldn’t mean also losing one’s home. This is a core lesson that I learned from the 2008 financial crisis, when I was the CEO of CitiMortgage. In response, lenders such as the company that I lead, Caliber Home Loans, are partnering with homeowners to develop forbearance plans to allow borrowers to stay in their homes as they get back on their feet. Close to 5 million U.S. homeowners are currently on a forbearance plan. My firm alone has reviewed and processed tens of thousands of requests. After spending months listening to our customers, here are insights about who is seeking forbearance and their reasons why: 1. Homeowners seek forbearance as a precaution: Clearly, consumers realize that forbearance is the deferral, not the forgiveness, of payments. Many applying for forbearances are still making their monthly mortgage payments, as they view forbearance as a type of insurance in case their personal financial situation deteriorates. Some 32% of our customers who sought forbearances continued to make payments from March through May 2020. Consumers are incentivized to stay current, as they can make their payment at any time during the month without being charged late fees. 2. Homeowners would rather refinance than seek forbearance: Borrowers who have a higher likelihood to refinance are trying their best to stay on their current payment plan and avoid requesting forbearance. Remarkably, some 13.4 million homeowners are eligible to refinance. In addition, homeowners who have sufficient equity in their homes and are eligible are increasingly opting for cashout refinancings. 3. Self-employed individuals seek forbearances in higher rates: Some 58% of our borrowers who requested a forbearance said they had lost a job, suffered an illness, or been furloughed. Remarkably, self-employed individuals make up 42% of customers who seek forbearances — the largest group among our borrowers. Of course, our customers who work in sectors that were highly impacted by the coronavirus pandemic also applied for forbearances in greater numbers. These include workers who had jobs in casinos and gaming; travel and transportation; hospitality and retail. Read: ‘The housing emergency most harms people of color:’ Black Americans face an unequal housing market — and coronavirus could make it worse 4. The geography of homeowners is a factor in seeking forbearance: Where homeowners live influences whether they will apply for forbearances. Forbearance requests surged more than the unemployment rate during the first two weeks of the crisis in March until stabilizing. Though significant, the unemployment rate wasn’t the only explanatory variable in those seeking forbearance. We found that our borrowers in New York had the highest ratio (68%) of forbearance requests to the unemployment claim rate, compared to California, which had a ratio of 29%. A principal reason for this is that the effects of the pandemic were most acutely felt in New York. Those with high incomes who live in New York applied for forbearance, and those with low incomes had a higher forbearance request rate. Across the country, we found that our borrowers who live in cities have a higher ratio (just over 8%) than those who live in suburban (6%) or farm counties (just under 6%). 5. Millennials and Gen Xers are most impacted: Among generational cohorts, millennials and Gen Xers have the highest forbearance request rate. These younger generations are earlier in their careers and are more acutely affected by the ongoing financial troubles. That they need flexibility during the ongoing pandemic is understandable and even to be expected. Every forbearance plan is different, so it’s important for borrowers to speak directly to their mortgage providers to understand all available options. As millions of Americans evaluate their options amidst a slowing economy, mortgage forbearance is an opportunity to attain greater financial flexibility. But only the homeowner, working with their lender, will know whether it’s the right plan to take. Sanjiv Das is CEO of Caliber Home Loans. Previously, he was CEO of CitiMortgage. More: How the coronavirus pandemic could forever change home buying and mortgage lending Also read:The only way to truly solve the race problem in America is to narrow the wealth gap"}]}