{"article": [{"url": "https://www.marketwatch.com/story/beyond-meat-downgraded-at-jpmorgan-as-impossible-foods-snaps-up-share-11600440889", "published": 1600694780.0, "headline": "Beyond Meat downgraded at JPMorgan as Impossible Foods snaps up share", "body": "Beyond Meat and Impossible Foods are sharing grocery shelf space with a growing number of plant-based brands AFP via Getty Images Beyond Meat Inc.’s stock was downgraded to underweight from neutral at JPMorgan on Friday with analysts citing market share loss at grocery stores to its biggest competitor, Impossible Foods Inc. Analysts also cited a pullback at restaurants, which are slower to add “complexity” to the menu during the COVID-19 pandemic. JPMorgan has a $122 price target on Beyond Meat BYND, +0.80%. “In the long run, we believe Beyond Meat’s growth opportunity is excellent, and we see the company as well managed with strong innovation and marketing plans,” JPMorgan said. “But we believe Street estimates are a bit aggressive right now – especially with chief rival Impossible Foods making strong inroads into Beyond Meat’s on-shelf presence, and with many restaurants not adding menu items – and we think the stock is ahead of itself.” Beyond Meat shares have nearly doubled for the year to date, up 96.6%, while the S&P 500 index SPX, +0.87% has gained 0.6% for the period. CFRA also downgraded Beyond Meat, to sell from hold, and cut its 12-month target to $100 from $130. “Due to intensifying competition (both local and abroad) from other pure-play alternative meat companies and from larger packaged food companies, along with an expectation that Beyond Meat will continue to aggressively lower prices to reach price parity with traditional animal meat, we now find it difficult to believe Beyond Meat’s margins will exceed its packaged food peers,” Arun Sundaram wrote. Impossible Foods, home of the Impossible Burger, has made gains on Beyond Meat, and done it fast, according to JPMorgan. In just the past couple of months, Impossible Foods has expanded into Canadian retail, expanded its presence at Kroger Co. KR, +0.46% nationwide , and secured $200 million in funding. That’s on top of $500 million in funding earlier this year. See: Kraft Heinz stock upgraded twice with analysts upbeat about ongoing business transformation Certainly, Beyond Meat isn’t taking a rest. Just this week, the company expanded its lineup with Beyond Meatballs, the third launch this year after Beyond Sausage and Cookout Classic. The company has tried to use the increased demand during COVID-19 to its advantage, lowering prices on its product at a time when prices for beef have gone up. Moreover, Beyond Meat is thinking beyond the U.S. grocer’s shelf. The company has launched a direct-to-consumer operation that expands its reach. Impossible Foods launched a direct-to-consumer channel this summer as well. Canaccord Genuity applauded the move from Beyond Meat as one that’s expected to drive incremental revenue, deepen customer relationships and take advantage of the grocery shift to e-commerce. Canaccord Genuity rates Beyond Meat shares hold with a $140 price target. Beyond Meat has also brought its products to international markets like Brazil, and China, where Beyond Meat began selling at Shanghai grocery stores over the summer, and is launching manufacturing facilities. But these aren’t the only two plant-based meat options, as the category continues to grow and expand into new products. Kellogg Co.’s K, +0.96% Morningstar brand expanded its Incogmeato line of plant-based proteins with help from Walt Disney Co. DIS, +1.53% with the launch this week of Mickey Mouse shaped Chick’n Nuggets. The item is meant to appeal to families, and could create a market of lifelong plant-based meat eaters. Read: Kellogg’s Incogmeato partners with Disney for Mickey Mouse plant-based nuggets Dr. Praeger’s launched beef and chicken plant-based sliders this week. Meatless Farm, a British-based food company, has landed in the U.S. And another global plant-based food company, Chile-based NotCo, is planning to bring its products to the U.S. after recently closing an $85 million round of funding. Among NotCo’s investors is Bezos Expeditions, the investment group for Amazon.com Inc. AMZN, +3.01% founder Jeff Bezos. Even with all of this activity in the category, some analysts remain upbeat about Beyond Meat’s prospects. Baird initiated Beyond Meat at outperform earlier this month with a $160 price target. Baird forecasts that Beyond Meat will end the year with enough manufacturing capability for more than $1 billion in gross revenue. “We model substantial revenue growth over the next several years, driven by increasing distribution (domestically + internationally), increasing velocity per point of distribution, and introduction of new products,” Baird analysts led by Ben Kallo wrote. Don’t miss: Pactiv Evergreen begins trading below IPO price and sinks further “Ultimately, Beyond Meat aims to capture traditional beef consumers, thereby gaining share in the meat market (as opposed to solely vegan/vegetarian consumers). With growing mainstream consumer acceptance/awareness of the Beyond brand, as well as growing interest in health, wellness, and sustainability, we expect Beyond products will continue to gain share.”"}]}