{"article": [{"url": "https://www.marketwatch.com/story/the-fed-has-been-buying-etfs-what-does-it-mean-11600704182", "published": 1600690280.0, "headline": "The Fed has bought $8.7 billion worth of ETFs. Here are the details", "body": "Federal Reserve Chairman Jerome Powell (L) and Treasury Secretary Steven Mnuchin bump elbows Tasos Katopodis/Press Pool/AFP/Getty Images One of the biggest stories of the past year has been massive inflows into bond exchange-traded funds. In a lower-for-longer world, investors are looking for any edge they can find, and some ETFs may offer a bit more yield. But in addition to that fundamental backdrop, there may be a more straightforward explanation for investor interest in shares of bond funds: the Federal Reserve. In March, amid the coronavirus selloff, the central bank said it would buy ETFs in order to stabilize the financial system – namely, the bond market. Dave Nadig, an ETF industry veteran now at ETF Trends, set out to analyze the Fed’s footprint in the market. Read: The Fed is going to buy ETFs. What does it mean? The Fed may well have achieved its goal better than anyone could have expected, Nadig concluded. That’s because actual Fed purchases of ETFs has been a lot smaller than the overall inflows. “The Fed did exactly what it wanted to do here — buying just enough on the open market to convince the Street that they would be the buyer of first and last resort, and bringing investors along for the ride,” Nadig wrote. Here’s how the big numbers break down. There have been flows of $150.1 billion into bond ETFs through August 31 (about $132 billion of that is U.S. funds). As of the end of August, however, the Fed had only bought $8.7 billion worth of such funds. ETF name Fed holdings Fed % of May-Aug inflows VanEck Vectors Fallen Angel High Yield Bond ETF ANGL, +0.26% 34 3% iShares iBoxx $ High Yield Corporate Bond ETF HYG, +0.22% 330 3% Xtrackers USD High Yield Corporate Bond ETF HYLB, +0.12% 1,791 4% iShares Intermediate-Term Corporate Bond ETF IGIB, +0.08% 2,916 17% iShares Short-Term Corporate Bond ETF IGSB, +0.05% 3,908 18% SPDR Bloomberg Barclays High Yield Bond ETF JNK, +0.15% 2,006 28% iShares iBoxx $ Investment Grade Corporate Bond ETF LQD, +0.23% 7,932 31% iShares 0-5 Year High Yield Corporate Bond ETF SHYG, +0.18% 786 4% SPDR Bloomberg Barclays Short Term High Yield Bond ETF SJNK, +0.19% 77 41% iShares 0-5 Year Investment Grade Corporate Bond ETF SLQD, +0.09% -86 -51% SPDR Portfolio Intermediate Term Corporate Bond ETF SPIB, 584 83% SPDR Portfolio Short Term Corporate Bond ETF SPSB, +0.06% 450 63% iShares Broad USD High Yield Corporate Bond ETFUSHY 535 12% SPDR Portfolio Short Term Corporate Bond ETF USIG, +0.21% 803 23% Vanguard Intermediate-Term Corporate Bond ETF VCIT, +0.10% 9,356 15% Vanguard Short-Term Corporate Bond ETF VCSH, +0.04% 6,785 22% Source: ETF Trends analysis Perhaps more important, the Fed didn’t start buying until May, and paused in July. But overall inflows were strong in April, since the Fed had announced its intentions in the prior month. Flows did abate a bit in August, though. Now that some of the dust has settled since March, the bigger question remains: is it healthy for the central bank to have such an outsize impact on financial markets? That “will have to be settled over the long game,” Nadig wrote. “But short term? You’d have to say mission accomplished.” Read next: ETFs, born from 1987 market crash, are so far making 2020 less awful"}]}