{"article": [{"url": "https://www.marketwatch.com/story/are-stock-market-investors-overpricing-or-underpricing-a-potential-coronavirus-vaccine-2020-08-22", "published": 1598269820.0, "headline": "COVID-19 vaccine hopes are driving the stock-market rally â\u0080\u0094 hereâ\u0080\u0099s how much", "body": "This is an updated version of an article originally published on Aug. 22. The stock marketâ\u0080\u0099s rally back to all-time highs might not have been possible without optimism over a COVID-19 vaccine. And that means progress and setbacks toward that goal could continue to drive the market in the weeks and months ahead. Analysts at UBS rolled back the market tape to take a look at how stocks have reacted to positive and negative vaccine-related news since the coronavirus pandemic hit. They concluded that optimism around vaccine developments added around 6.5 percentage points to the S&P 500â\u0080\u0099s return since May. If so, that certainly helped the S&P 500 SPX, +0.87% Â to take back the ground it lost during the stock marketâ\u0080\u0099s pandemic-inspired plunge. The U.S. benchmark closed at record highs this past week, including in Fridayâ\u0080\u0099s session, returning to trade above levels seen before falling nearly 34% from a Feb. 19 record to its March 23 low as the spread of COVID-19 forced the near-shutdown of the U.S. and global economy. The UBS analysts calculated the impact by measuring the number of â\u0080\u009cshockâ\u0080\u009d days, in which the S&P 500 moved up or down by at least one standard deviation versus its average daily movement in reaction to positive or negative vaccine-related news. Using their model, which gauges how much positive vaccine news contributed to a fall in a closely followed economic policy uncertainty index, they concluded that investors had priced in a 33% to 40% probability of a vaccine. On an industry level, however, it appears prospects for a vaccine are less priced in, the analysts said. They noted that shares of companies with the most to gain â\u0080\u0094 such as hard-hit hospitality and leisure stocks â\u0080\u0094 from a vaccine have barely outperformed the S&P 500 since May, suggesting a vaccine isnâ\u0080\u0099t really priced in across industries, they wrote. Several companies are working toward a vaccine. The Wall Street Journal on Thursday reported that Johnson & Johnson JNJ, +1.39% Â plans to launch what could be the largest clinical trial of a COVID-19 vaccine seen so far, enlisting up to 60,000 people world-wide. That would be double the size of other pivotal studies that have started or are expected to begin soon for vaccines developed by Moderna Inc. MRNA, +0.09%, Pfizer Inc. PFE, -0.27% Â and AstraZeneca PLC AZN, +1.16%. The marketâ\u0080\u0099s sensitivity to news on the treatment front in general was on display Monday, with the S&P 500 climbing to another all-time high as global equities rallied following the U.S. Food and Drug Administrationâ\u0080\u0099s approval of convalescent plasma â\u0080\u0094 the antibody-rich blood component harvested from people who have recovered from COVID-19 â\u0080\u0094 for emergency use. Meanwhile, it might be small- and midcap stocks that would stand to benefit most from a vaccine breakthrough. The UBS analysts noted that small caps outperformed large-caps by around 2 percentage points on days when there was major vaccine news. If market participants currently see a 33% to 40% probability priced in for a vaccine, potential outperformance for small versus large-cap stocks stands at around 13 percentage points or more, they said. The relative performance of value stocks relative to growth stocks, however, has been subdued, they said. Cyclical stocks, which are more sensitive to the economic cycle, have solidly outperformed defensive stocks on days with big vaccine news, with even more variation at the industry and sub-industry level. UBS said that would indicate the potential for around 10 percentage points or more of outperformance by cyclicals over defensives if a vaccine is fully priced and implemented. Analysts and investors have pointed to optimism over a vaccine as insulating the market from disappointment on other fronts, including the inability of congressional Democrats and Republicans and the White House to come up with a plan for another round of coronavirus aid. Economists warned that concerns about the economic damage caused by the pandemic could overshadow those hopes. â\u0080\u009cLong-term optimism regarding a vaccine is secondary to near-term economic and health concerns: a jobs deficit of 13 million relative to pre-COVID, states facing budget crises, and still more than 50,000 daily COVID-19 infections,â\u0080\u009d said Gregory Daco, chief U.S. economist at Oxford Economics, in a Friday note. The S&P 500 rose 0.7% over the last week, with Fridayâ\u0080\u0099s close at a record 3,397.16. The Dow Jones Industrial Average DJIA, +0.56% Â was virtually flat on the week, finishing at 27,930.33, while the tech-heavy Nasdaq Composite COMP, +1.39% Â saw a weekly advance of 2.7%, closing Friday at 11,311.80, its 36th record finish of 2020."}]}