{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-inch-higher-as-traders-watch-for-us-inventory-report-2020-07-08", "published": 1594222160.0, "headline": "Oil prices at 4-month high as rise U.S. crude imports and a fall in gasoline supplies point to improving energy demand", "body": "Oil futures gained on Wednesday, lifting prices to their highest finish since March, as a rise in U.S. crude imports and a weekly fall in gasoline supplies suggested an improvement in energy demand, even as domestic crude inventories posted a surprise climb. A closer look at the data shows that the crude-oil build happened “due to higher crude oil imports,” said Manish Raj, chief financial officer at Velandera Energy. “This is a huge positive, since it suggests growing domestic oil demand and the U.S. acting as the market of last resort for this commodity.” Also, “gasoline inventory declined by nearly 5 million barrels, despite higher refinery runs and increased production,” Raj told MarketWatch. “As U.S. drivers are back on the roads, growing oil demand is highly positive.” The Energy Information Administration reported Wednesday that U.S. crude inventories rose by 5.7 million barrels for the week ended July 3. That followed a fall of 7.2 million barrels the week before and compared with a forecast by analysts polled by S&P Global Platts for an average decline of 3.7 million barrels. The American Petroleum Institute on Tuesday reported an increase of about 2 million barrels. Total net petroleum imports stood at 5.01 million barrels per day, up from 2.88 million a week earlier, EIA data show. Imports of commercial crude oil were at 7.39 million barrels per day, up from 5.97 million. “A pop in net imports above 5 million barrels per day for the first time since last August has led to a solid build in oil inventories, despite refining activity rising to a 14-week high at 14.3 million barrels per day,” Matt Smith, director of commodity research at ClipperData, told MarketWatch. “Offsetting this bearish build was the largest draw to gasoline inventories since early March, as implied demand gradually recovers,” he said. Gasoline supply fell by 4.8 million barrels, while distillate stockpiles climbed by 3.1 million barrels. The S&P Global Platts survey had shown expectations for supply declines of 1.2 million barrels for gasoline and 500,000 barrels for distillates. On Wednesday, West Texas Intermediate crude for August US:CLQ20 climbed by 28 cents, or 0.7%, to settle at $40.90 a barrel on the New York Mercantile Exchange, after ending virtually unchanged on Tuesday. US:CLQ20 Global benchmark Brent oil for September UK:BRNU20 tacked on 21 cents, or 0.5%, at $43.29 a barrel on the ICE Futures Europe exchange, following a decline of less than 0.1% in the previous session. The settlements for both WTI and Brent were the highest for front-month contracts since March 6, according to Dow Jones Market Data. The weekly fall in U.S. gasoline supplies came on the back of average implied demand of 8.5 million barrels a day over the four week period ended July 3, which is down 12.5% from the same period last year, EIA data show. That an improvement from the previous report, which showed the four-week implied demand down by 15%. On Nymex Wednesday, August gasoline US:RBQ20 rose by nearly 1.3% to $1.2909 a gallon, but August heating oil US:HOQ20 fell 0.7% to $1.2344 a gallon. August natural gas US:NGQ20 settled down 2.8% at $1.824 per million British thermal units, ahead of the EIA’s weekly update on supplies of the fuel due out Thursday. The EIA data Wednesday had also shown crude stocks at the Cushing, Okla., storage hub climbed up by about 2.2 million barrels for the week, while total oil production was unchanged at 11 million barrels per day. In a separate monthly report issued Tuesday, the EIA lifted its 2020 and 2021 forecasts for Brent and WTI oil, and U.S. crude production."}]}