{"article": [{"url": "https://www.marketwatch.com/story/opec-committee-expected-to-take-wait-and-see-approach-on-output-as-oil-prices-reflect-new-normal-2020-08-14", "published": 1597825220.0, "headline": "OPEC+ committee expected to take â\u0080\u0098wait-and-seeâ\u0080\u0099 approach on output as oil prices reflect â\u0080\u0098new normalâ\u0080\u0099", "body": "This is an updated version of an article originally published on Aug. 14. Prices for oil have stuck to a tight trading range since early July, with both U.S. and global benchmark crude futures holding ground above the $40-a-barrel markâ\u0080\u0094a credit to cuts in crude output by major producers who are set to discuss the latest developments and challenges in the market next week. The Joint OPEC-Non-OPEC Ministerial Monitoring Committee, or JMMC, which monitors compliance with production cuts among members of the Organization of the Petroleum Exporting Countries and their allies, known collectively as OPEC+, was meeting Wednesday, after the virtual gathering was pushed back by a day. The meeting comes as oil prices have managed to find some balance in the wake of the OPEC+ decision last month to allow production cuts to taper from a record level starting in August. Prices have had a tumultuous run this year, with benchmark West Texas Intermediate oil futures dropping in April into negative territory for the first time in history. â\u0080\u009cThe coordinated effort by OPEC+ and the market-driven curtailment in the U.S. have both played a big role in balancing the market,â\u0080\u009d said Greg Liebl, senior investment strategist at Parametric Portfolio Associates. Also, â\u0080\u009cas many lockdowns have been eased or lifted and economies have restarted, oil demand has come in a bit better than expected,â\u0080\u009d which he says may be a bigger story behind the oil-price move. At the July JMMC meeting, OPEC+ said it would allow record production cuts of 9.7 million barrels per day to decrease to 7.7 million barrels per day starting in August. That was in line with a previous OPEC+ agreement to gradually taper the reductions. OPEC+ had previously extended the 9.7 million-barrel cut by a month through July. The reductions werenâ\u0080\u0099t quite as large as they initially appeared. Saudi Arabiaâ\u0080\u0099s Minister of Energy Prince Abdulaziz bin Salman said actual cuts, including reductions from countries that agreed to compensate for producing oil above their quota limits, would be at roughly 8.1 million to 8.3 million barrels per day. OPEC+, U.S. output cuts Meanwhile, OPEC+ production quota compliance had already fallen to 96% in July, from 106% a month earlier, according to a survey from S&P Global Platts, with collective production among OPEC+ up by 1.1 million barrels per day. Oil prices have held ground close to where they stood on the day of the last JMMC meeting. Front-month WTI futures US:CLU20 CL.1, -1.62% Â settled at $41.20 a barrel on the New York Mercantile Exchange on July 15. They ended Friday at $42.01 a barrel, not far from that mid-July level. Brent crude UK:BRNV20 BRN.1, -0.07%, meanwhile, traded above $43 in mid-July, and finished Friday at $44.80 a barrel on ICE Futures Europe. â\u0080\u009cWe have now equalized in a â\u0080\u0098new normalâ\u0080\u0099 range of $40-$45 per barrel,â\u0080\u009d said Basil Karampelas, managing director at advisory firm SierraConstellation Partners, adding that the price range reflects overall decreased demand, as well as the curtailment in U.S. production. The U.S. doesnâ\u0080\u0099t take part in the OPEC+ agreement, but low prices have contributed to expectations for a drop in U.S. crude-oil production to 11.26 million barrels per day this year, according to an August report from the Energy Information Administration. The agencyâ\u0080\u0099s crude output forecast is down 3.2% from its previous forecast. For 2019, it estimated output at 12.25 million barrels per day. U.S. production cuts have helped to buoy oil prices quarter to date, with WTI futures up nearly 8%, while Brent has gained around 9%. â\u0080\u009cThe improvement in oil prices have been driven by fundamentals and an improving balance between supply and demand,â\u0080\u009d said Stacey Morris, director of research at Alerian. OPEC+ record production cuts began in May and were â\u0080\u009ccomplemented by curtailments in the U.S., Canada, and other countries,â\u0080\u009d she said. â\u0080\u009cMeanwhile, demand has steadily recovered,â\u0080\u009d with U.S. gasoline demand â\u0080\u009cfairly stableâ\u0080\u009d since mid-June at around 8.5 million to 9 million barrels per dayCOVID-19 demand impact Still, overall, oil demand has been hit hard by COVID-19â\u0080\u0099s impact on the global economy. In a monthly report released last Wednesday, OPEC forecast total global oil demand at 90.6 million barrels a day this year, with demand growth down 9.1 million barrels a day from a year earlier and 100,000 barrels a day lower than last monthâ\u0080\u0099s forecast. It cited mainly to lower economic activity levels in developing economies. Similarly, the International Energy Agency on Thursday said it expects 2020 global demand to contract by 8.1 million barrel a day year on year to 91.9 million barrels a day. OPEC said its forecast â\u0080\u009cassumes that COVID-19 will largely be contained globally, with no further major disruptions to the global economy.â\u0080\u009d “ â\u0080\u0098OPEC has to convince its members to toe the line for the time being as any cheating by cartel members will send prices tumbling.â\u0080\u0099 ” â\u0080\u0094 Basil Karampelas, SierraConstellation Partners In the near term, Karampelas said the virus is a â\u0080\u009cbig downward influence on prices.â\u0080\u009d The longer it exists as a problem, the more people will get used to working form home, traveling less and not going to things like conferences, he said. â\u0080\u009cThis will have decades-long effects on demand for motor fuels, aviation fuels and natural gas that powers and provides air conditioning for office buildings.â\u0080\u009d With the latest OPEC report pointing to steep decline in world oil demand this year, the JMMC will likely take a â\u0080\u009ccautious wait and see approach, which means trying to adhere to current supply cuts with perhaps an easing of the existing cut by perhaps 500,000 to 1 million barrels per day,â\u0080\u009d said Karampelas. â\u0080\u009cThere is clearly a concern over a second wave of infections and the fact that global stocks of crude and products are at high levels,â\u0080\u009d he said. â\u0080\u009cThe key issue is compliance,â\u0080\u009d and â\u0080\u009cOPEC has to convince its members to toe the line for the time being as any cheating by cartel members will send prices tumbling.â\u0080\u009d"}]}