{"article": [{"url": "https://www.marketwatch.com/story/why-you-should-stop-saying-stocks-are-not-the-economy-11598295686", "published": 1598284580.0, "headline": "Stop saying â\u0080\u0098stocks are not the economyâ\u0080\u0099", "body": "As the S&P 500 pushes further into record territory, more than erasing its pandemic-induced plunge despite a double-digit unemployment rate and uncertainty over the path of the COVID-19 pandemic, the reminder that â\u0080\u009cstocks are not the economyâ\u0080\u009d is in heavy rotation among investors and market pundits. But one economist is tired of hearing it. â\u0080\u009cWhile literally true, this platitude has long been used to imply the market is divorced from the fundamentals or ignoring the economy altogether. The reality, of course, is more nuanced,â\u0080\u009d wrote Neil Dutta, head of economics at Renaissance Macro Research, in a Monday note. Opinion: These 2 charts explain why the stock market is so strong while the economy is still so weak Market observers have regularly noted that the rally has been powered in large part by a narrow range of large-capitalization, tech-related winnersâ\u0080\u0094including behemoths Apple Inc. AAPL, +1.74% and Amazon.com Inc. AMZN, +3.01% â\u0080\u0094which have grown their businesses amid shutdowns and a shift to a work-from-home environment. Stocks more sensitive to the weakened economic cycle have seen periods of outperformance predicated on bouts of optimism over a vaccine or treatments, while suffering when pangs about the economic outlook are on the rise. Barronâ\u0080\u0099s: The â\u0080\u0098disturbing realityâ\u0080\u0099 fueling this bull market Dutta pointed to the chart below, which shows the market is rewarding companies doing well and punishing those doing poorly in the present economy. The chart plots the percent change since February of S&P 1500 subsectors against the comparable retail sales category. Those firms that have seen stronger sales have generally seen higher share prices, he said, which sends a clear message that â\u0080\u009cthe market is not ignoring the economy.â\u0080\u009d The S&P 500 SPX, +0.87% and the tech-heavy Nasdaq Composite Index COMP, +1.39% hit all-time highs on Monday. The S&P 500 reclaimed record territory last week, fully erasing the nearly 34% plunge that took it from its Feb. 19 finish to its March 23 low. The Nasdaq had long since returned to record territory and on Friday logged its 36th record close of 2020. Dutta acknowledged that there is much economic activity that isnâ\u0080\u0099t captured by the major stock indexes. While most listed companies are in the business of selling goods to other businesses and households, a trip to the barber or drycleaner doesnâ\u0080\u0099t show up in the stock market although people-to-people services make up a big chunk of U.S. gross domestic product, he wrote. But the stock market does serve as a â\u0080\u009cgrowth momentum barometer,â\u0080\u009d he said. â\u0080\u009cStocks tend to rise when the economy grows and fall as the economy slides into recession,â\u0080\u009d he said. â\u0080\u009cImportantly, markets tend to care less about whether the economy is â\u0080\u0098goodâ\u0080\u0099 or â\u0080\u0098badâ\u0080\u0099 but do care about whether conditions are â\u0080\u0098betterâ\u0080\u0099 or â\u0080\u0098worseâ\u0080\u0099. In other words, market participants care more about the rate of change in economic activity rather than the level of activity. And thatâ\u0080\u0099s what accounts for recent gains. The economy â\u0080\u009cis currently accelerating, and the recovery continues, supporting the stock market with the areas doing well in the market also doing well in the economy,â\u0080\u009d he said."}]}