{"article": [{"url": "https://www.marketwatch.com/story/asana-shares-surge-more-than-30-while-palantir-still-awaits-first-trade-11601485452", "published": 1601483420.0, "headline": "Asana, Palantir debut up more than 30%, well above reference prices in dual direct listings", "body": "MarketWatch photo illustration/iStockphoto Asana Inc. and Palantir Technologies Inc. both debuted Wednesday in dual direct listings with shares of the two software companies with ties to Facebook Inc. finishing up more than 30% above their reference prices. Asana ASAN, -3.12% began trading at 12:35 p.m. Eastern time at a price of around $27, for a valuation of roughly $4.1 billion. The New York Stock Exchange set a reference price of $21 for the stock. Less than 15 minutes after their first trade, Asana shares were up about 40%, and closed up 37% at $28.80, following an intraday high of $29.96. At 1:40 p.m. Eastern, Palantir PLTR, -0.50% shares started trading, bolting out of the gate, rising more than 50% higher than the reference price. Shares finished up 31% at $9.50, following an intraday high of $11.42. NYSE had set a reference price of $7.25 a share based on private-market trades of the stock, and The Wall Street Journal reported last week that the company expected shares to open around $10. Reference prices for direct listings are based on trading prices in private markets ahead of companies filing with the Securities and Exchange Commission for a public listing. Direct listings differ from IPOs because there is no capital raised, which is what places a dollar figure on shares in an IPO. Direct listings are largely expected to trade higher than the reference price. Asana is a collaboration-software company co-founded by Facebook co-founder Dustin Moskovitz, who serves as chief executive, while Palantir is a data-software company co-founded by early Facebook FB, +0.26% investor and board member Peter Thiel. Both companies chose to list their shares directly instead of selling new stock in an initial public offering, a route that was previously taken by Spotify Technology SA SPOT, +0.08% and Slack Technologies Inc. WORK, +3.36%, which were also mature startups that sold shares repeatedly in the private markets and were looking to provide investors with public trading options. In an interview Wednesday with MarketWatch, Palantir Chief Operating Officer Shyam Sankar said the company made the decision to go public about midway through 2019, with an eye on the back half of 2021. After the pandemic struck, he said the company sped up its timeline to Wall Street. “COVID really accelerated the business and it became clear it was a time for us to think about” going public sooner, Sankar said. Sankar called the direct listing “momentous” and “exciting,” and said the company made the decision to list instead of perform an IPO because it did not need capital but did want to offer investors a chance to cash in on their stake. “We have had incredibly patient investors — especially our most important ones, employees — and this gives them more access to the market immediately,” he said. Palantir launched its first software platform in 2008, and was long known as a secretive software startup focused on military and law-enforcement issues, courting controversy for its work with the Immigration and Customs Enforcement division of the U.S. government. The company has since launched a second offering that has attracted clients from the private sector, and grown much more vocal about its business, including a public divorce from Silicon Valley in which co-founder and Chief Executive Alexander Karp detailed a move away from California and defended his company’s work for the government. See also: Five things to know about the Palantir non-IPO Moskovitz launched Asana in 2008 as well, developing software tools that compete with Atlassian Corp.’s TEAM, +5.33% Trello. The San Francisco company registered $143 million in revenue in its 2020 fiscal year, up 86% year-over-year. The company also reported that losses grew, to $118.6 million in fiscal 2020 from $50.9 million in fiscal 2019. “We’re happy with the results, but truthfully it is one day of many,” Asana Chief Financial Officer Tim Wan told MarketWatch on Wednesday. “Our focus, long term, is providing value to our 82,000 customers.” COVID has presented both benefits and challenges, Wan said. An influx of so-called knowledge workers at home has put a premium on available digital tools to help them organize tasks efficiently, which is Asana’s business proposition. The challenge is that an unspecified number of Asana’s customers are small businesses that have adopted its technology and are suffering through an economic downturn caused by the pandemic. “Many of our customers adopt our technology in a bottoms-up manner, and there has been a churn among them because of the pandemic,” Wan said. Asana, a 900-person company based in San Francisco, reported revenue of $52 million for the three months ended July 31, up 57% year-over-year. Its net loss during the period jumped to $41.1 million, compared with a $15.6 million loss for the same period last year. The company has yet to turn a profit. For more: Five things you need to know about Asana’s direct listing Palantir is also far from profitable, revealing in its SEC filings that revenue grew to $742.6 million in 2019 from $595.4 million in 2018, while losses stayed even at more than half a billion dollars a year — $579.6 million in 2019 and $580 million in 2018. In the first six months of this year, Palantir recorded a loss of $164.7 million on revenue of $481.2 million, after recording a loss of $280.5 million on sales of $322.7 million in the same period of 2019. Choosing a direct listing instead of an IPO allowed both companies to publicly offer forecasts for future performance. Palantir calls for revenue growth of 46% to 47% in the third quarter, 41% to 43% for the full year of 2020, and greater than 30% in 2021. For fiscal 2021, Asana projects revenue of $210 million to $213 million, representing year-over-year growth of 47% to 49%. Read: Software companies trying to IPO like its 1999 Despite the COVID-19 pandemic, the market for IPOs has been strong in 2020. Aside from Wednesday’s direct listings, Wall Street was expecting 11 IPOs this week, wrapping up the busiest third quarter for offerings since the dot-com boom, according to Renaissance Capital. Software offerings have been a big part of that, as the pandemic has created demand for strong software offerings that can allow workers to continue performing tasks from home — Snowflake Inc. SNOW, -0.91%, Unity Software Inc. U, +8.43% and others have flourished in their market debuts. Exclusive: What happened as Unity Software went public during a pandemic MarketWatch staff writer Jonathan Swartz contributed to this article."}]}