{"article": [{"url": "https://www.marketwatch.com/story/no-stopgap-to-preserve-600-jobless-benefit-add-on-white-houses-meadows-says-11595462487", "published": 1595448560.0, "headline": "No stopgap to preserve $600 jobless benefit add-on, White Houseâ\u0080\u0099s Meadows says", "body": "White House chief of staff Mark Meadows leaves a Republican policy luncheon on Capitol Hill on Tuesday. AFP via Getty Images A senior White House official said Wednesday that a temporary extension of the extra $600 beneficiaries of unemployment insurance now receive weekly is not in the cards, as Republicans continued to work on a new COVID-19 aid bill. â\u0080\u009cWeâ\u0080\u0099re really looking at trying to make sure that we have a comprehensive bill that that deals with the issues. Any short-term extensions would defy the history of Congress, which would indicate that it would just be met with another short-term extension,â\u0080\u009d Mark Meadows, the White House chief of staff, told reporters after leaving a late-day meeting with Senate Republican appropriators at the U.S. Capitol. The $600 add-on, paid weekly on top of a stateâ\u0080\u0099s regular unemployment benefits, has provided much-needed support for poorer workers without jobs and boosted consumption, according to some economists. Many congressional Republicans, though, have said it encourages idleness because the amount can outweigh the wages earned in the old job. While this week is the last for which the jobless are eligible for the payment, next week will be the final time it is disbursed. But labor experts say the inability of state departments to reprogram their systems quickly means even a small lapse, if it is not renewed by Friday, will result in a two- to four-week gap for recipients. Mindful of the coming cliff, some Republican senators said Wednesday there had been discussion of a short-term extension of the unemployment insurance add-on. An extension raised concerns on both sides of the aisle, though, as Rep. Steny Hoyer, the second-ranking Democrat in the House, on Tuesday said it would be the â\u0080\u009cleast advisableâ\u0080\u009d option. Meadows and Treasury Secretary Steven Mnuchin were on the Hill on Wednesday to help Senate Republicans come up with a bill as a counteroffer to the Houseâ\u0080\u0099s $3.4 trillion coronavirus aid bill passed in May. A significant step was achieved Wednesday when top Senate Republican appropriators said theyâ\u0080\u0099d reached agreement with the White House on the part of the bill dealing with congressional spending. â\u0080\u009cWeâ\u0080\u0099ll have a package tomorrow,â\u0080\u009d said Sen. Richard Shelby, the chairman of the Senate Appropriations Committee. Sen. Roy Blunt, a Missouri Republican, said he hoped to see other parts of the GOP coronavirus bill come together Thursday as well. â\u0080\u009cTheÂ goalÂ isÂ tomorrowÂ toÂ getÂ allÂ ofÂ thoseÂ billsÂ outÂ there.Â SoÂ weâ\u0080\u0099llÂ haveÂ oneÂ aappropriatingÂ bill.Â Weâ\u0080\u0099llÂ haveÂ severalÂ authorizingÂ billsÂ thatÂ explainÂ inÂ moreÂ detailÂ howÂ thatÂ appropriatedÂ moneyÂ wouldÂ beÂ spent,â\u0080\u009d he said. Blunt said agreement between Senate Republicans and the White House had been reached on money for elementary and secondary schools dealing with coronavirus. He said the total amount would be $70 billion, evenly split between money paid out to schools on a per capita basis and money paid to schools that reopen with in-person classes, which Blunt said would require more money to operate."}]}