{"article": [{"url": "https://www.marketwatch.com/story/pelosi-says-sides-remain-miles-apart-on-stimulus-bargaining-11597354223", "published": 1597340300.0, "headline": "Pelosi says sides remain â\u0080\u0098miles apartâ\u0080\u0099 on stimulus bargaining", "body": "Speaker of the House Nancy Pelosi speaks in Washington in July. (Getty Images) Two trillion dollars or bust. Thatâ\u0080\u0099s what House Speaker Nancy Pelosi said she told Treasury Secretary Steven Mnuchin was the ante to restart stalled coronavirus-aid talks that appear likely to remain deadlocked for a while. â\u0080\u009cWe are miles apart in our values,â\u0080\u009d Pelosi said Thursday at her weekly press conference at the U.S. Capitol. Across the Capitol, Senate Majority Leader Mitch McConnell officially sent senators home for a three-week summer recess, joining House lawmakers who left Washington July 31 and again signaling the lack of progress in talks. â\u0080\u009cIf the Speaker of the House and the minority leader of the Senate decide to finally let another rescue package move forward for workers and for families, it will take bipartisan consent to meet for legislative business sooner than scheduled,â\u0080\u009d he said Thursday afternoon. The Senate had been formally in session this week, but with no votes scheduled, the chamber was largely empty. As in the House, senators would be given 24 hours advance notice of a vote if a deal was struck during the break, McConnell said. Pelosiâ\u0080\u0099s comments came a day after the only glimmer of progress in almost a week Wednesday, when Pelosi and Mnuchin spoke over the phone. But even that was snuffed out quickly, as both sides blamed the other for lack of progress in dueling press statements issued after the call. Asked when they may talk again, Pelosi said Thursday, â\u0080\u009cI donâ\u0080\u0099t know. Whenever theyâ\u0080\u0099re ready â\u0080\u0094 when they come in with $2 trillion.â\u0080\u009d The House passed an expansive $3.4 trillion aid bill in May. In the Senate, a raft of proposals that would cost an estimated $1.1 trillion has been floated. The difference has led Democrats to propose what they see as a compromise between the two figures, in the $2 trillion area, an approach Republicans reject. While Pelosi was holding her press conference, McConnell again called on Democrats to relent. â\u0080\u009cUnfortunately, the Democrats have continued to let working families down. They are still rejecting any more relief for anyone unless they get a flood of demands with no real relationship to COVID-19,â\u0080\u009d he said . McConnell also ridiculed Pelosiâ\u0080\u0099s offer of coming down to $2 trillion from the Democratsâ\u0080\u0099 $3.4 trillion price tag in the May bill. â\u0080\u009cThatâ\u0080\u0099s not negotiating. Thatâ\u0080\u0099s throwing spaghetti at the wall to see what sticks. People who have serious policy proposals that are fitted to actual needs cannot breezily knock off a trillion here, and add a trillion there,â\u0080\u009d McConnell said."}]}