{"article": [{"url": "https://www.marketwatch.com/story/ford-promises-you-can-return-your-car-within-the-first-year-if-you-lose-your-jobheres-how-it-works-2020-07-13", "published": 1595070380.0, "headline": "Ford promises you can return your car within the first year if you lose your job-here's how it works", "body": "Vehicle return program runs through September 30 Customers can return vehicles in first year after job loss Available only to Ford Credit loans and leases Eligible new and used models include 2019, 2020 and 2021 Ford announced that customers who buy or lease a new vehicle through Ford Credit can return it within the first year if they lose a job. The new program is called Ford Promise. This vehicle return policy builds on earlier offers by Ford F, -1.36%  to cover the first three monthly payments and defer three additional ones under the Built to Lend a Hand program. \"We feel like right now, the economy is at the stage of recovery where people want things to be back to normal, they want to buy, but they're still a little nervous about what the future holds,\" says Mark LaNeve, vice president, U.S. marketing, sales, and service. \"We want them to know we understand that, and we're here to support them in their buying decisions.\" Also see: 8 affordable new cars priced well below $20kDesigned to deal with an uncertain market Ford cites recent data that shows apprehension among car buyers. Cox Automotive data cited by Ford shows at least 32% of shoppers are delaying purchases due to economic and unemployment fears. Matt VanDyke, director of Ford's U.S. marketing, said, \"Customers are realizing it make take a while for things to completely feel normal again if in fact they ever do. They need our support now than ever.\" Also see:5 important facts about car insurance no one ever tells you Now, during their first year of a lease or loan, a Ford Credit customer who loses a job can return the vehicle. Ford Credit will then value the vehicle using National Automobile Dealers Association (NADA) average trade-in. That amount will reduce the outstanding balance of the loan or lease. Ford will also waive an additional $15,000. The customer is responsible for the difference, as well as any late or deferred payments and vehicle damage.Ford Promise offered through September The program runs through September 30, 2020. Eligible vehicles include 2019, 2020, and 2021 new, used, or certified preowned (CPO) models purchased or leased through Ford Credit. Vehicles must be for personal use only. The return policy begins 30 days after the deal is signed. Read: How to test drive a used car \"Ford Credit has a long history of helping customers affected by all types of economic setbacks,\" says Marion Harris, CEO, Ford Motor Credit Company. \"Now, we want to make sure that everyone who is considering purchasing or leasing a vehicle knows that this assistance is available.\" This story originally ran on Autotrader.com."}]}