{"article": [{"url": "https://www.marketwatch.com/story/chrysaor-takes-over-premier-oil-creating-largest-london-listed-independent-oil-and-gas-group-11601979148", "published": 1602057380.0, "headline": "Chrysaor takes over Premier Oil, creating new independent oil-and-gas group", "body": "Harbour CEO Linda Cook will move to London to head up the combined group. SUPPLIED BY CHRYSAOR Shares in Premier Oil soared more than 14% on Tuesday, after the oil explorer agreed a reverse takeover that will create the largest London-listed independent oil-and-gas group, producing more than 250,000 barrels of oil a day. Under the terms of the deal, privately-owned Chrysaor will own at least 77% of the combined group. Stakeholders in Premier Oil PMO, -0.27% will own up to 23% of the combined group, of which just under 6% are existing Premier shareholders. That values Premier’s equity at $200 million to $250 million, according to analysts at Jefferies. The remainder will be owned by Chrysaor’s biggest shareholder, Harbour Energy, an investment vehicle formed by U.S. private equity group EIG Global Energy Partners. Former Shell executive Linda Cook, the chief executive of Harbour, will move to London to head up the combined group. Cook joins Katherine Roe, the chief executive of Wentworth Resources WEN, +1.47%, as one of only two women heading up a U.K.-listed energy group. Premier’s boss Tony Durrant will step down from the oil group at the end of 2020. Shares in Premier, which rose more than 14% after the deal was announced, were trading 10% higher in early morning London trading. Premier, which has struggled with its balance sheet for several years, has been under pressure to reduce its $2.7 billion debt pile amid a collapse in oil prices. Read: Oil prices settle at lowest since June, with Brent prices below $40 In August, its shares fell by more than 18%, after it swung to a loss on lower production in the six months to June 30 and announced plans to raise up to £410 million by selling new shares. The deal with Chrysaor means it now won’t proceed with the refinancing. Instead, the company’s creditors, which need to approve the deal, receive a cash payment of $1.23 billion. Read: Premier Oil says price of BP acquisitions slashed Premier has also scrapped plans to buy BP’s BP, -0.74% interests in the Andrew and Shearwater fields in the U.K. North Sea, which had been contingent on the refinancing going through. Russ Mould, investment director at AJ Bell, said that after a long period where it felt like the business was being run in the interests of its creditors rather than its shareholders, Premier Oil has effectively been put out of its misery. “The company’s problems date all back to 2014 and the oil price crash which occurred that year. It simply had taken on too much debt when oil prices were above $100 per barrel and has been running to stand still ever since,” Mould said. He added: “With a big chunk of Premier’s debt being paid off on completion it certainly looks more sustainable than the previous plan to load up on more debt, ask for more money from the market and buy assets from BP to generate the cash flow to pay down borrowings.” The enlarged group will have production of more than 250,000 barrels a day and reserves of 717 million barrels of oil equivalent. Cook said the deal “significantly advances our leading position in the North Sea, where we will continue to reinvest, and expands our geographic footprint to Asia and Latin America.” Founded in 1934 in Scotland to pursue oil and gas exploration and production activities in Trinidad, Premier has interests in the North Sea, South East Asia, the Falkland Islands and Latin America. It also owns a 25% stake in Mexico’s Zama shallow water offshore project. Chrysaor, which produces just under 200,000 barrels of oil equivalent a day in the U.K, was founded in 2017 and has grown to become a major North Sea producer through acquisitions. These include the acquisition of certain fields from Royal Dutch Shell RDS.A, +0.83% for $3 billion in 2017 and ConocoPhillips COP, -1.12% for $2.675 billion in 2019. Chrysaor also holds 11 licenses across 18 blocks in Norway pursuing exploration opportunities."}]}