{"article": [{"url": "https://www.marketwatch.com/story/nasdaq-on-the-verge-of-closing-at-psychological-milestone-at-10000-even-as-the-economy-is-in-recessionheres-how-we-got-here-2020-06-09", "published": 1591806560.0, "headline": "Nasdaq closes above psychological milestone at 10,000, even as the economy is in recession-here's how we got here", "body": "The Nasdaq Composite Index closed at an important milestone for the first time on Wednesday, underscoring the rebound in technology-related stocks following the coronavirus rout that has helped to crystallize the view that parts of the stock market have entered a new bullish phase. The rally for the tech-laden index comes after a series of fresh record closing highs for the index. A finish at or above 10,000 represents the fastest 1,000-point milestone for the Nasdaq COMP, +1.39%, 114 trading sessions, since the 49 sessions the index took to surge from 4,000 to 5,000 in 2000, according to data from Dow Jones Market Data. The U.S. stock market, hit by an economy falling into recession as businesses were temporarily closed to combat the coronavirus pandemic, has staged a rapid rebound from its low in late March. The Nasdaq and its peer index, the Nasdaq-100, composed of the largest members of the Nasdaq Composite, is weighted heavily with technology businesses which have been viewed as more resilient to the COVID-19 pandemic that has rocked the economy and financial markets. Check out a table of the milestones in the attached table: The largest names by market value have helped to propel the recovery for the Nasdaq. Those companies include Facebook Inc. FB, +0.26%, Apple Inc. AAPL, +1.74%, Amazon.com Inc. AMZN, +3.01%, Netflix NFLX, +1.43% and Google parent Alphabet GOOG, +1.97%  GOOGL, +1.82%. To be sure, round numbers like 10,000 on the index aren't necessarily significant for the market, but they can help to reflect growing upbeat sentiment, despite a number of risks that have confronted investors including the viral epidemic and civil unrest that erupted over the death of unarmed black man George Floyd in Minneapolis. The Nasdaq closed on Wednesday at 10,020.35. The Dow, which was first published 124-years ago, hit 10,000 in March 29, of 1999 as the tech sector was in the throws of the dot-com boom. The Nasdaq Composite, meanwhile, was first published in 1971, so its traverse above the 10,000 mark comes at a relatively brisk half-century clip. Wednesday's trading for the Nasdaq comes as the Federal Reserve said that it would do whatever its takes to support the economy and financial markets. Still, there are growing concerns that the rebound from the rout induced by COVID-19 has come too fast and too furiously, making the equity market more vulnerable to a sharp pullback. The Dow Jones Industrial Average DJIA, +0.56% closed off 1% Wednesday, ending lower after it snapped a six-session rally on Tuesday, while the S&P 500 SPX, +0.87% finished off 0.5%. Indeed, the economy has tumbled into such a deep recession that some forecasters predict up to a record 40% decline in gross domestic product on an annualized basis in the second quarter. In the first quarter, the economy contracted by 4.8%, one of the deepest declines on record. The Fed on Wednesday said it doesn't expect to lift short-term rates through the end of 2022. In a statement, the Fed said again it would use its \"full range of tools\" to support the economy."}]}