{"article": [{"url": "https://www.marketwatch.com/story/trump-to-sign-order-on-pre-existing-conditions-as-he-gives-speech-on-health-care-2020-09-24", "published": 1600970780.0, "headline": "Trump addresses pre-existing conditions and surprise billing in North Carolina, as analysts say itâ\u0080\u0099s just a â\u0080\u0098photo opâ\u0080\u0099", "body": "President Donald Trump on Thursday signed executive orders touted as protecting people with pre-existing conditions and addressing surprise medical billing, with that action coming as he gave a speech on health care in the swing state of North Carolina. Trump also tackled topics such as drug prices and telehealthâ\u0080\u0099s rise during the coronavirus crisis, as he talked up a new â\u0080\u009cAmerica First\" health plan. â\u0080\u009cWeâ\u0080\u0099re delivering a healthier, safer, brighter and more prosperous future for every citizen in our magnificent land, because we are proudly putting America first,â\u0080\u009d he said in his speech in Charlotte, N.C. Analysts said the executive orders were unlikely to have a practical impact and had more to do with winning re-election. â\u0080\u009cWe believe the orders are aimed at bolstering the presidentâ\u0080\u0099s health-care XLV, +0.90% Â message before the Nov. 3 election and will not meaningfully impact providers, physicians or insurers, though the groups may publicly oppose the orders,â\u0080\u009d said Height Capital Markets analysts in a note on Thursday before the presidentâ\u0080\u0099s speech, which began around 5 p.m. Eastern Time. The president trails Democratic challenger Joe Biden â\u0080\u009cin polls on which candidate can best address health care, so he has scheduled a photo op today in North Carolina to address the issue,â\u0080\u009d said Greg Valliere, chief strategist at AGF Investments, in a note. Trump has repeatedly made efforts to address the concerns of Americans with pre-existing conditions who have health-insurance protections because of Obamacare and fear those safeguards will disappear because of the Trump administrationâ\u0080\u0099s legal push to scrap Obamacare. â\u0080\u009cThe president is declaring that it is the policy of the United States to provide protections to ensure that Americans with pre-existing conditions are protected, regardless of whether the Affordable Care Act is unconstitutional and its protections for pre-existing conditions invalidated,â\u0080\u009d Health and Human Services Secretary Alex Azar told reporters on a conference call before the Charlotte event. But a University of Michigan law professor, Nicholas Bagley, tweeted that unless Trump is â\u0080\u009cexercising a power thatâ\u0080\u0099s been specifically delegated to him, an executive order directed at private parties has no more legal weight than a press release.â\u0080\u009d Trump previously has talked up his recent executive orders on drug pricing, but analysts have dismissed them as â\u0080\u009clargely campaign fodder as each contains limitations or caveats, and is subject to further action.â\u0080\u009d His speech in North Carolina comes after he would not commit on Wednesday to a peaceful transfer of power in the event of his defeat in the White House race. A White House spokeswoman on Thursday said Trump â\u0080\u009cwill accept the results of a free and fair election,â\u0080\u009d as his stance sparked concern across the political spectrum. Ahead of his trip to Charlotte, Trump was met with boos and chants of â\u0080\u009cVote him out!â\u0080\u009d as he visited the late liberal Justice Ruth Bader Ginsburgâ\u0080\u0099s casket at the Supreme Court building in Washington, D.C., on Thursday morning. Trump suggested on Wednesday that the Supreme Court will have to make a ruling on the November election, so a new justice for the high court should be confirmed before Election Day. After speaking in North Carolina, the president is slated to give a campaign speech in the swing state of Florida, making remarks around 7 p.m. Eastern Thursday in Jacksonville. At 10 a.m. Friday, he was due to take part in a â\u0080\u009cLatinos for Trumpâ\u0080\u009d event in Miami. Related:Biden visits Florida as poll shows Trump leading among the crucial swing stateâ\u0080\u0099s Latino voters"}]}