{"article": [{"url": "https://www.marketwatch.com/story/citi-bumps-up-its-sp-500-forecast-but-warns-investors-to-stop-ignoring-these-risks-2020-07-07", "published": 1594117040.0, "headline": "Citi bumps up its S&P 500 forecast, but warns investors to stop ignoring these risks", "body": "Investors are waking up from a Monday hangover that sent stocks charging after a China stock rally, despite the U.S. struggle to contain coronavirus outbreaks across many states, and as earnings season looms. Offering up a fresh view of where stocks are headed is our call of the day from strategists at Citigroup, who have just bumped up their S&P 500 target to 2,900 from 2,700 — close to a 10% drop from the current level of 3,179. Still, “barring a big shock, it is improbable to think of a trading range for the S&P 500 in the 2,500-3,000 area, but more likely in the 2,700-3,200 vicinity as monetary policy will be in place to prevent a 20% or greater decline,” said a team led by chief U.S. equity strategist Tobias Levkovich. That doesn’t mean the strategists aren’t preaching some caution right now and see a bumpy second half, after that powerful second-quarter equity rebound. “We envision volatility for equities as good news is being priced in and problems are being overlooked,” Levkovich said, laying out some risks he thinks investors are ignoring. “A second wave of debilitating COVID-19 cases that causes either new shutdowns or slower economic recovery would be challenging, not to mention the U.S. elections, but these are not immediate threats, and investors appear to only have short-term time frames currently,” Levkovich and the team said. “We add that margin pressures from trade friction and weak year-over-year trends (despite better sequential activity) also matter.” “Ultimately, earnings have to come back in a very meaningful way, and the market already is anticipating that likelihood over time,” said Levkovich, who notes that as businesses try to absorb fixed overhead costs during the pandemic, “a much higher level of activity is required to generate incremental margins.” And more job losses may prevent that expansion, he and the team said. The Citi team also opines that investors may not be too panicked about a possible win for Democratic presidential contender Joe Biden in November. Chats with clients find they perceive “clearer and more predictable trade negotiations and less volatile overall policy shifts,” as an offset to higher taxes and more regulation.The market The Dow DJIA, +0.56% , S&P SPX, +0.87% and Nasdaq COMP, +1.39% are off to a mostly lower start, with European stocks SXXP, +0.55% also down after weaker-than-expected German production and the EU cut growth forecasts. China stocks continued to sizzle, with another 1.7% gain for the CSI 300 000300, +2.04%. The chart Our chart of the day from The Daily Shot shows how hiring at small businesses is hitting a rough patch: The buzz Novavax NVAX, +0.18% shares are shooting higher on news of $1.6 billion in funding for the biotech to develop a COVID-19 vaccine. That is as top disease specialist Dr. Anthony Fauci warned that any vaccine’s effects may be “finite.” Brazilian President Jair Bolsonaro is undergoing coronavirus testing, while Australia, which earned praise for keeping the virus under control, has put Melbourne on a six-week lockdown. And Atlanta Mayor Keisha Lance Bottoms, a potential running mate for Democratic presidential contender Joe Biden, has tested positive for the virus. Shares of residential solar-panel installer Vivint Solar US:VSLR are soaring after rival Sunrun RUN, +1.26% announced a $3.2 billion deal to buy its rival. Samsung 005930, -0.33% is forecasting a 23% second-quarter profit jump, after pandemic-driven gadget sales and memory chips lifted results. Social network TikTok says it is leaving Hong Kong, following a sweeping new security law that kicked in last week. Atlanta Federal Reserve President Raphael Bostic says he sees the U.S. economy leveling off. We’ll get May job openings later.Random reads A Kansas City Chiefs football player emptied out a local dog shelter. Actress Halle Barry offers apology and exits transgender film role. Scientists discover tiny, but colossal dinosaur. Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. Be sure to check the Need to Know item. The emailed version will be sent out at about 7:30 a.m. Eastern. Follow MarketWatch on Twitter, Instagram, Facebook."}]}