{"article": [{"url": "https://www.marketwatch.com/story/why-gold-may-not-climb-to-a-fresh-record-before-the-year-ends-11602261719", "published": 1602247820.0, "headline": "Why gold may not climb to a fresh record before the year ends", "body": "Gold futures trade around 24% higher year to date, but haven't hit a record high since August. martin abbugao/Agence France-Presse/Getty Images Gold was up by close to 40% for the year when it hit a record high in August, but it has since nearly halved that gain, and some analysts say a move to fresh all-time highs in the final quarter may be out of reach for the precious metal. “Gold has enjoyed a meteoric rise this year, hitting a record in early August on the back of a weak dollar and continued [Federal Reserve] support,” says Matt Orton, vice president at Carillon Tower Advisers. The Fed actions drove real rates lower, “making cash and Treasuries much less attractive, and gold a better alternative.” Futures prices for the precious metal GOLD, +2.86% GCZ20, +2.17% settled at a record $2,069.40 an ounce on Aug. 6. On Oct. 8, it settled at $1,895.10, up 24% year to date. “Negative U.S. real rates have stabilized and started to move higher in August,” with gold moving lower as a result, Orton says. The impact of real or inflation adjusted interest rates and movements in the U.S. dollar are key drivers of gold prices, not equity investor sentiment, and “with economic data continuing to show signs of a recovery, I would expect this rise in real rates to continue, as well as a general strengthening of the dollar—an additional headwind for gold.” Prices for the metal aren’t likely to reach new record highs in the near future, he says. The Federal Reserve pledged in September to hold its policy interest rate between zero and 0.25% until inflation was on track to moderately exceed its 2% target rate “for some time.” The change in policy came after U.S. inflation remained below the Fed’s target rate for many years despite the lowest unemployment rate in 50 years and in the wake of the recession caused by the coronavirus pandemic. The fed-funds rate is below zero in real terms, taking inflation into account. Real rates, however, stopped plunging after gold prices peaked in August, and the dollar “finally caught a bid,” says Adrian Ash, director of research at BullionVault, adding that gold prices have fallen by nearly $200 since then. Still, the Fed is “desperate to stop deflation taking hold, so it’s committed to devaluing the dollar and keep the United States’ existing mountain of debt from growing in real terms,” he says. “That makes gold a standout choice for investors wanting to protect their purchasing power.” Year to date, the ICE U.S. Dollar Index trades around 3% lower. Even so, Ash warned that short-term volatility around the U.S. presidential election in November cannot be discounted. If President Donald Trump is re-elected for four more years, that might not boost gold by the 70% it would need to repeat the gains since 2017. But a win by former Vice President Joe Biden would “continue today’s record deficits, and the negative real interest rates needed to finance them,” Ash says. That could lead to higher gold prices. For now, some analysts don’t expect to see any big upward move to record prices for the metal. The sky-is-the-limit scenario for gold would “require extraordinary events to take place,” says Darwei Kung, portfolio manager and head of commodities at DWS Group. That might include a Fed decision to move away from monetary policy anchored by an inflation target — triggering an inflation scare—or a sharp dollar depreciation because of “fundamental structural changes” to the U.S. economy, which leads to global investors losing faith in the dollar. Kung says the chances for these situations are very remote. Kung expects a more gradual price increase for gold “without additional monetary or large-scale fiscal stimulus that would drive [the dollar] exchange rate lower.” He says DWS Group forecasts gold prices at $2,100 at the end of the third quarter of next year, based on the expectation that Covid-19 vaccines would be widely available by then and the economy returns to its trend rate."}]}