{"article": [{"url": "https://www.marketwatch.com/story/great-the-economy-is-growing-again-but-dont-think-the-us-is-out-of-a-danger-zone-2020-06-20", "published": 1592685440.0, "headline": "Great, the economy is growing again. But don't think the U.S. is out of a danger zone", "body": "The economy snapped back in May after a two-month coronavirus lockdown, but make no mistake: the U.S. is still in a danger zone. The past several weeks has brought lots of good news about states allowing business activity to resume, several million people returning to work, and Americans getting out and spending more. Manufacturers cranked up the assembly lines again and many businesses welcomed back customers, albeit with masks, temperature checks and hand sanitizer. See: Marketwatch's Coronavirus Economic Recovery Tracker The upcoming week will include more confirmation of an economic rebound, largely through improved consumer spending and rising orders for durable goods in May. It's even possible that what's likely to be the deepest, and shortest, recession in American history also ended last month. See: MarketWatch Economic Calendar Yet Wall Street DJIA, +0.56%  is already putting May in the rearview mirror and watching closely for signs on how much of the momentum carried over into June. So far there's reason to be anxious. For one thing, coronavirus cases have surged in some of the states that were the first to partially reopen. Apple AAPL, +1.74%  on Friday said it would close almost a dozen stores again in Florida, Arizona and the Carolinas where some COVID-19 hotspots developed. If more companies do the same it would be a setback. \"Despite the encouraging bounce in several sectors of our economy over the past month and a half, our economic future beyond the next few weeks will still largely be determined by the course of the coronavirus,\" said Scott Anderson, chief economist of Bank of the West. \"On that front, there is a troubling resurgence of new cases coming from more than a handful of states.\" Perhaps almost as ominously, the number of people applying for unemployment benefits is still topping 2 million a week. What's more, there's been very little decline in how many people are getting benefits, known as continuing claims. Almost 28 million jobless workers were receiving unemployment checks in early June. The frustratingly slow decline in new jobless claims and continuing claims suggests that a second wave of layoffs is hitting the economy now as companies get a better grip on the damage done to their businesses. More firms may be permanently layoff off workers after realizing that sales and customers won't be coming back in the same numbers - or at all. Read: Unemployment rate falls in 43 states in May, but still topped 20% in these states If that's what is happening, other key economic indicators for June are also likely to show less improvement in June than they did in May. The biggest cue this week is a report little known to the broader public known as the IHS Markit flash survey. The Markit survey queries executives in manufacturing and the much larger service side of the economy to get a handle on how businesses are doing. In effect, they tell us whether business leaders are getting more or less confident. The Markit surveys are almost certain to rise, but investors will pay close attention not just to the size of the increase but what executives say about the recovery. See: Coronavirus update: 100 days since COVID-19 declared a pandemic, and U.S. has highest case and death tallies by a wide margin"}]}