{"article": [{"url": "https://www.marketwatch.com/story/new-york-city-on-track-to-reach-phase-3-of-reopening-on-july-6-2020-06-25", "published": 1593108320.0, "headline": "New York City on track to reach Phase 3 of reopening on July 6", "body": "New York City, once the nation’s viral epicenter, is poised to enter the third and penultimate phase of reopening on July 6, Mayor Bill de Blasio announced on Thursday. Restaurants and bars will welcome patrons to dine inside for the first time in four months, albeit at 50% capacity; public basketball and tennis courts will reopen; and New Yorkers will be able to get massaged, tweezed and waxed once again as part of Phase 3. De Blasio kept his Phase 3 announcement brief and is expected to provide more guidance on Friday. He didn’t say how many workers could return to the job in the next phase, but told businesses “to get ready.” As many as 700,000 workers in New York City have returned since Phases 1 and 2 began this month, according to city estimates. “The good news is we’re on track, and it is such an important step forward that this city keeps moving,” de Blasio said on Thursday. “It’s important for people trying to get their livelihoods back. It’s important for businesses that are trying so hard to survive. It’s important for the future of the city.” The latest data showed only 60 people walked into hospitals with suspected COVID-19 in the five boroughs on Tuesday, down from a daily high in late March of 850, while only 2% of the thousands of city residents tested for the virus on Tuesday were positive, according to the city’s health department. Separate data from the state looks even more promising, showing only 1.2% of tests in the five boroughs coming back positive on Wednesday. It reflects significant progress across the state, where there were fewer than 1,000 people hospitalized with the virus as of Wednesday, down from a peak in April of nearly 19,000. The state recorded 17 deaths Wednesday. Related: New York, New Jersey and Connecticut want people coming from hot spots to quarantine — but how will they enforce it? The return of more outdoor sports will provide particular relief to young people, who’ve been cooped up at home with few diversions since the city’s schools closed in mid-March. Basketball, tennis, volleyball, soccer, handball and bocce would all be allowed to resume on July 6, said the mayor, who also announced this week that the city’s beaches would open for swimmers on July 1. “We have to help our young people,” de Blasio said. “We have to make this summer better for them.” There are certainly signs people are looking for ways to release pent-up energy as reports of illegal fireworks have soared in recent weeks. The city’s strategy has been to root out illicit sales rather than go after those who set them off, de Blasio said. Police apprehended 12 illicit fireworks suppliers in the Bronx on Wednesday, and authorities caught another 11 dealers in Staten Island and Manhattan, the mayor said. Meanwhile, civilian agencies will continue to work with bars, restaurants and other businesses to make sure they follow state- and city-mandated guidelines as they reopen. The city would issue tickets to violators as a last resort, de Blasio said. See: These are your rights when a barber, gym owner or President Trump asks you to sign a COVID-19 waiver “We know it will take hard work. We know it will take a lot of education, but we can do this and keep moving forward,” de Blasio said. “No one wants to go backwards.” New York City will be the last region of the state to enter Phase 3 next month. Five regions, mostly rural areas in the central part of the state, will enter the fourth and final phase of reopening on Friday. They include the Mohawk Valley, North Country, Southern Tier, Finger Lakes and Central New York."}]}