{"article": [{"url": "https://www.marketwatch.com/story/oxford-astrazeneca-to-resume-coronavirus-vaccine-trial-after-reported-side-effect-in-uk-patient-2020-09-12", "published": 1599914240.0, "headline": "Oxford, AstraZeneca to resume coronavirus vaccine trial after reported side-effect in U.K. patient", "body": "Oxford University announced Saturday it was resuming a trial for a coronavirus vaccine it is developing with pharmaceutical company AstraZeneca AZN, +1.16% AZN, +0.63%, a move that comes days after the study was suspended following a reported side-effect in a U.K. patient. In a statement, the university confirmed the restart across all of its U.K. clinical trial sites after regulators gave the go-ahead following the pause on Sunday. “The independent review process has concluded and following the recommendations of both the independent safety review committee and the U.K. regulator, the MHRA, the trials will recommence in the U.K.,” it said. The vaccine being developed by Oxford and AstraZeneca is widely perceived to be one of the strongest contenders among the dozens of coronavirus vaccines in various stages of testing around the world. British Health Secretary Matt Hancock welcomed the restart, saying in a tweet that it was “good news for everyone” that the trial is “back up and running.” The university said in large trials such as this “it is expected that some participants will become unwell and every case must be carefully evaluated to ensure careful assessment of safety.” It said globally some 18,000 people have received its vaccine so far in Britain, Brazil and South Africa. Around 30,000 volunteers are being recruited in the U.S. Although Oxford would not disclose information about the patient’s illness due to participant confidentiality, an AstraZeneca spokesman said earlier this week that a woman had developed severe neurological symptoms that prompted the pause. Specifically, the woman is said to have developed symptoms consistent with transverse myelitis, a rare inflammation of the spinal cord. The university insisted that it is “committed to the safety of our participants and the highest standards of conduct in our studies and will continue to monitor safety closely.” Pauses in drug trials are commonplace and the temporary hold led to a sharp fall in AstraZeneca’s share price following the announcement Tuesday. The Oxford-AstraZeneca study had been previously stopped in July for several days after a participant developed neurological symptoms that turned out to be an undiagnosed case of multiple sclerosis that researchers said was unrelated to the vaccine. During the third and final stage of testing, researchers look for any signs of possible side effects that may have gone undetected in earlier patient research. Because of their large size, the studies are considered the most important study phase for picking up less common side effects and establishing safety. The trials also assess effectiveness by tracking who gets sick and who doesn’t between patients getting the vaccine and those receiving a dummy shot. Dr. Charlotte Summers, a lecturer in intensive care medicine at the University of Cambridge, said the pause was a sign that the Oxford team was putting safety issues first, but that it led to “much unhelpful speculation.” “To tackle the global COVID-19 pandemic, we need to develop vaccines and therapies that people feel comfortable using, therefore it is vital to maintaining public trust that we stick to the evidence and do not draw conclusions before information is available,” she said. Scientists around the world, including those at the World Health Organization, have sought to keep a lid on expectations of an imminent breakthrough for coronavirus vaccines, stressing that vaccine trials are rarely straightforward. Two other vaccines are in huge, final-stage tests in the United States, one made by Moderna Inc. and the other by Pfizer and Germany’s BioNTech. Don’t miss:Here’s what you need to know about clinical trials as drug makers push forward with coronavirus vaccine studies"}]}