{"article": [{"url": "https://www.marketwatch.com/story/us-closes-in-on-5-million-coronavirus-cases-too-many-people-are-selfish-2020-08-04", "published": 1596566900.0, "headline": "U.S. closes in on 5 million coronavirus cases: â\u0080\u0098Too many people are selfishâ\u0080\u0099", "body": "BOSTON â\u0080\u0094 Fourth of July gatherings, graduation parties, no-mask weddings, crowded bars â\u0080\u0094 there are reasons the U.S. has racked up more than 155,000 coronavirus deaths, by far the most of any country, and is fast approaching an off-the-charts 5 million confirmed infections, easily the highest in the world. Many Americans have resisted wearing masks and social distancing, calling such precautions an overreaction or an infringement on their liberty. Public health experts say the problem has been compounded by confusing and inconsistent guidance from politicians and a patchwork quilt of approaches to containing the scourge by county, state and federal governments. â\u0080\u009cThe thing thatâ\u0080\u0099s maddening is country after country and state after state have shown us how we can contain the virus,â\u0080\u009d said Dr. Jonathan Quick of the Duke Global Health Institute. â\u0080\u009cItâ\u0080\u0099s not like we donâ\u0080\u0099t know what works. We do.â\u0080\u009d Confirmed infections in the U.S. have topped 4.7 million, with new cases running at more than 60,000 a day. While thatâ\u0080\u0099s down from a peak of well over 70,000 in the second half of July, cases are on the rise in 26 states, many in the South and West, and deaths are climbing in 35 states. On average, the number of COVID-19 deaths per day in the U.S. over the past two weeks has gone from about 780 to 1,056, according to an Associated Press analysis. In Massachusetts, health officials are investigating at least a half-dozen new clusters of cases connected to such events as a lifeguard party, a high school graduation party, a prom party, an unsanctioned football camp and a packed harbor cruise trip. One recent house party on Cape Cod attended by as many as 60 people led to more than a dozen new cases and prompted some restaurants to close or limit service at the height of tourist season. Hot spots around the U.S. are popping up in what once seemed like ideal places to ride out the outbreak: rural, less populated and with lots of outdoor space. In South Dakota, a spike erupted at a Christian youth summer camp in the Black Hills, with cases growing to 96 among 328 people who attended. â\u0080\u009cWeâ\u0080\u0099re at a point where thereâ\u0080\u0099s enough spread of COVID-19 that people throughout the U.S. are at an increased likelihood of encountering the virus and getting exposed,â\u0080\u009d University of Florida epidemiologist Dr. Cindy Prins said. She added: â\u0080\u009cThis is a behavioral disease right now for a lot of people.â\u0080\u009d Prevention means â\u0080\u009cchanging our behavior, and itâ\u0080\u0099s so hard for humans to do. Weâ\u0080\u0099re social creatures.â\u0080\u009d In Mississippi, Republican Gov. Tate Reeves grudgingly reversed course and announced a statewide order requiring the wearing of masks because of a resurgence of the virus. He also delayed the start of the school year for upper grades in eight hard-hit counties. â\u0080\u009cWearing a mask â\u0080\u0094 as irritating as it can be, and I promise you I hate it more than anyone watching today â\u0080\u0094 is critical,â\u0080\u009d he said. In Virginia, cases have surged so much in cities like Norfolk and Virginia Beach that Democratic Gov. Ralph Northam placed limits there last week on alcohol sales and gatherings of more than 50 people. Northam, the nationâ\u0080\u0099s only governor who is a doctor, cited rising infections among young people and said the problem is that â\u0080\u009ctoo many people are selfish.â\u0080\u009d â\u0080\u009cWe all know that alcohol changes your judgment,â\u0080\u009d he said. â\u0080\u009cYou just donâ\u0080\u0099t care as much about social distancing after youâ\u0080\u0099ve had a couple of drinks.â\u0080\u009d Dr. Demetria Lindsay, the Virginia Department of Healthâ\u0080\u0099s district director for Virginia Beach and Norfolk, said there has been a pronounced spike among people ages 20 to 29. She said the factors behind the surge include gatherings of people not wearing masks or maintaining a safe distance. â\u0080\u009cFatherâ\u0080\u0099s Day, Memorial Day, graduations, birthdays, backyard barbecues, you name it,â\u0080\u009d Lindsay said. In Brandon, South Dakota, thousands of car racing fans packed the 9,000-seat Husetâ\u0080\u0099s Speedway over the weekend. Many did not cover their faces or stay away from others. â\u0080\u009cWeâ\u0080\u0099re kind of over this whole COVID thing. I wonâ\u0080\u0099t wear a mask unless I absolutely have to,â\u0080\u009d 21-year-old Veronica Fritz said. She added: â\u0080\u009cI am a very strong Christian and I know where Iâ\u0080\u0099m going, and I believe God will take me when Iâ\u0080\u0099m supposed to go. So if I get COVID and I die from COVID, itâ\u0080\u0099s not my decision.â\u0080\u009d Josie Machovec, a mother of three who is suing over a mask ordinance in Palm Beach County, Florida, said that she doesnâ\u0080\u0099t believe the government has the right to require people to wear medical devices, and that she hasnâ\u0080\u0099t seen clear evidence that masks stop transmission of the virus. â\u0080\u009cIâ\u0080\u0099m someone who has looked into this extensively and donâ\u0080\u0099t feel that itâ\u0080\u0099s the right thing for me and my kids. If we are healthy, we donâ\u0080\u0099t need to be wearing them,â\u0080\u009d she said, â\u0080\u009cand if weâ\u0080\u0099re not healthy, if weâ\u0080\u0099re sick, then we stay home.â\u0080\u009d Nearly a quarter of Wisconsinâ\u0080\u0099s more than 55,000 cases had been confirmed over the past 14 days. Much of the spike has occurred in the stateâ\u0080\u0099s densely urban southeastern corner, but the disease has also spread with amazing speed in rural and sparsely populated northern Wisconsin. Zona Wick, a spokeswoman and contact tracer for Iron Countyâ\u0080\u0099s health department, blamed July Fourth gatherings, birthday and graduation parties, out-of-county visitors and people crowding into bars. â\u0080\u009cThe Fourth of July was tough on us,â\u0080\u009d Wick said. â\u0080\u009cPeople had a bit of quarantine fatigue, is what Iâ\u0080\u0099m calling it. People got a bit tired of staying in. People just got together like they have for years on the Fourth of July and spread it to one another.â\u0080\u009d The wedding industry likewise is seeing no-mask receptions with busy dance floors and no social distancing. Wedding planner Lynne Goldberg has a December wedding scheduled for 200 guests at the home of the brideâ\u0080\u0099s parents in upstate New York. â\u0080\u009cThey have emphatically shared that this pandemic is not going to get in the way of their wedding plans and that there will be no masks handed out and no signs promoting social distancing at their wedding,â\u0080\u009d she said. â\u0080\u009cThe bride has said that when she shows her children her wedding video, she doesnâ\u0080\u0099t want it to be a documentary of the 2020 pandemic.â\u0080\u009d"}]}