{"article": [{"url": "https://www.marketwatch.com/story/8-in-10-americans-say-country-is-heading-down-wrong-path-new-poll-finds-2020-07-26", "published": 1595782880.0, "headline": "8 in 10 Americans say country is heading down wrong path, new poll finds", "body": "WASHINGTON — With the November election 100 days away, more Americans say the country is heading in the wrong direction than at any previous point in Donald Trump’s presidency, putting the incumbent in a perilous position as his reelection bid against Democrat Joe Biden enters a pivotal stretch. A new poll from The Associated Press-NORC Center for Public Affairs Research also finds Trump’s approval for his handling of the COVID-19 pandemic falling to a new low, with just 32% of Americans supportive of his approach. Even Trump’s standing on the economy, long the high water mark for the president, has fallen over the past few months after seeming ascendant earlier this year. Those political headwinds have sparked a sudden summer shift in the White House and the Trump campaign. After spending months playing down the pandemic and largely ignoring the virus’ resurgence in several states, Trump warned this past week that the situation is likely to get worse before it gets better. After repeatedly minimizing the importance of wearing masks to limit the spread of the virus, Trump urged Americans to do exactly that. And after insisting he would press forward with a large campaign convention in August, the president announced that he was scrapping those plans. Trump’s abrupt about-face underscores the reality of the situation he faces just over three months from Election Day. Even as he tries to refocus his contest with Biden on divisive cultural issues and an ominous “law and order” message, Trump’s reelection prospects are likely to be inextricably linked to his handling of the pandemic and whether voters believe the country will head back in the right direction under his leadership. The AP-NORC poll makes clear the challenge ahead for Trump on that front: 8 in 10 Americans say the country is heading in the wrong direction. That’s more than at any point since Trump took office. The poll also finds just 38% of Americans say the national economy is good, down from 67% in January, before the pandemic upended most aspects of everyday life. Biden’s campaign is eager to keep the final months of the campaign focused squarely on Trump, confident that the former vice president can emerge victorious if the contest is a referendum on whether the current commander in chief has succeeded during his four years in office. “People are sick and tired of a government that is divided and broken and unable to get things done,” said Kate Bedingfield, Biden’s deputy campaign manager. “What people feel like they’re getting from Trump right now is a hodgepodge mess of self-interested political talk.” The past few months have proved to be beneficial for Biden’s campaign. He managed to swiftly consolidate the Democratic Party in ways Hillary Clinton, the party’s 2016 nominee, struggled to do. Biden’s fundraising, a weakness for him in the primary, has surged, allowing his campaign to build out infrastructure and start ad spending in both traditional battleground states and more aspirational targets, including Texas and Georgia. Biden has also benefited from Trump landing on the wrong side of the public in his initial reactions to the pandemic. For example, 3 in 4 Americans back requiring people to wear masks in public, which Trump initially dismissed. Another pandemic test for the president lies ahead in August and September, as Trump and his administration aggressively try to sell a skeptical public on reopening schools. The poll finds that about third of Americans are opposed entirely to the idea, while close to half say major adjustments to instruction will be required. The limitations the pandemic placed on the candidates’ ability to travel and hold large rallies have also played more to Biden’s strengths. While Trump relishes headlining rallies at packed arenas, Biden is less adept in those settings. He’s instead spent the past several months delivering speeches to small groups of invited guests and journalists within driving distance of his home in Delaware, and holding virtual events with supporters and donors. Trump argues that shows Biden doesn’t have the stamina for a full-blown campaign; Biden’s advisers say voters want to see their leaders abide by the same public health guidelines they’re urging others to follow. Democrats have been buoyed by public polls finding Biden ahead of Trump both nationally and in some battleground states by a comfortable margin. However, Biden advisers caution that they expect the race to tighten in the final stretch before Election Day as more Republicans who may be dissatisfied with Trump’s job performance gravitate back to their party’s leader. Overall, 38% of Americans approve of the president’s job performance — well within the narrow range that Trump’s approval ratings have stayed throughout this presidency, but down slightly from earlier this year before the pandemic. Most Republicans — 81% — approve of Trump’s job performance, but just 68% of Republicans support his handling of the pandemic. Publicly, Trump and his advisers say they have been here before: underestimated and counted out. They point to public polls throughout the summer of 2016 that showed Trump trailing Clinton, only to eclipse her on Election Day. But privately, Trump’s political aides and allies have spent months trying to sound the alarm bells for the president, warning that he could lose the Midwestern battlegrounds he carried in 2016, as well as some reliably red states, if the trajectory — both of his campaign and the virus — continues. One of the most concrete signs that Trump recognized he had gone off course came this month, when he demoted longtime campaign manager Brad Parscale, replacing him with experienced GOP operative Bill Stepien. Stepien told reporters he expects the campaign to “be a knock-down, drag-out fight to the very end.”"}]}