{"article": [{"url": "https://www.marketwatch.com/story/heres-the-real-cost-of-stock-splits-that-buffett-knows-and-apple-and-tesla-ignored-2020-10-07", "published": 1602088100.0, "headline": "Hereâ\u0080\u0099s the real cost of stock splits that Buffett knows and Apple and Tesla ignored", "body": "Name three things these five companies have in common: AutoZone, Booking Holdings, Cable One, NVR and Seaboard.Â One: Their shares are among the priciest in the U.S. stock market â\u0080\u0094 all in four figures. Two: They have almost never split their stock. Three: All enjoy among the highest-quality shareholders measured by long-term horizon and portfolio concentration.Â These are not coincidences, yet the shared experience seems lost on the increasing number of companies doing stock splits, from Apple AAPL, +1.74% Â to Tesla TSLA, +1.89% Â . Both of these companies recently split their stock in order to cut share price. They apparently are trying to attract shareholders who will also be customers. But while that might be good product marketing, it is definitely bad investor stewardship: Stock splits degrade a companyâ\u0080\u0099s shareholder quality. Managers and investors alike should care about which shareholders grace a companyâ\u0080\u0099s shareholder list. At companies brimming with transient shareholders, managers bend toward a short-term focus, while those dominated by indexers get shareholder proposals and votes aligning with prevailing social and political fashions.Â Â Some companies attract a greater proportion than others of patient and focused shareholders â\u0080\u0094 what Warren Buffett has dubbed â\u0080\u009chigh-quality shareholdersâ\u0080\u009d (QSs for short). While all public companies have transients and indexers among their shareholders, those with a higher density of QSs get longer strategic runways that are associated with superior performance.Â Â “ Stock splits are riveted on stock price; managers who cultivate quality shareholders shun them. ” Companies shape their shareholder base through dozens of corporate practices. Actions that focus on stock price tend to draw transients while those emphasizing business performance attract QSs. Stock splits are riveted on stock price; managers who cultivate quality shareholders shun them.Â After all, stock splits are like exchanging a dime for two nickels. They produce no economic effect, but carry subtle psychological ones. Side-effects include increasing a companyâ\u0080\u0099s market capitalization, despite no change in fundamentals. This occurs because both the news of the split and the lower share price stimulate short-term interest.Â Â In contrast, companies that avoid splits and have the highest stock price boast the highest density of QSs.Â For example, Berkshire Hathawayâ\u0080\u0099s Class A shares BRK.A, +0.06% Â BRK.B, +0.24% Â take the cake, with a six-figure share price, and a greater proportion of QSs than any other company by far. While many factors contributed to Berkshireâ\u0080\u0099s multi-decade success story, its outstanding shareholder base is an important one.Â After Berkshire, the next tier of high-priced stocks and high-quality shareholder lists includes the five companies mentioned earlier. Their shareholder lists give a taste of who are todayâ\u0080\u0099s leading QSs â\u0080\u0094 the most patient and focused: AutoZone AZO, -1.06% Â , an automotive parts retailer, counts sizable QSs among its shareholders including institutional investors AllianceBernstein, Burgundy Asset Management, First Manhattan and Tweedy Browne. Booking BKNG, +1.62% Â Â , a travel fare aggregator and search engine, formerly known as priceline.com, has not split its stock since 1998. Its long list of QSs includes Capital Research Global Investors, Dodge & Cox, Edgewood Management, Fidelity Investments and Harris Associates. NVR NVR, +1.16% Â is a homebuilder and mortgage banker whose shares grew ten-fold in the decade before the housing bubble burst. The shares remain pricey and the stock has never split since its 1940 debut. Marquee QSs include Diamond Hill Capital, Smead Capital and Wellington Management. Seaboard SEB, +4.42% Â is a $6 billion (annual revenue) conglomerate that is 77% owned by the Bresky family. The stock has never been split since its 1959 launch and turnover is extremely low. Its recent trading price is also low by historic standards. Notable QSs include First Saberpoint Capital, Khan Brothers and Knightsbridge Asset Management.Â Cable One CABO, +0.31% Â is a broadband communications company spun off in 2015 from Graham Holdings (successor to The Washington Post Co.). Its QSs include Capital International Investors, D. F. Dent, Neuberger Berman, Rothschild & Co. and Wallace Capital. Consider what happened when the board of The Washington Post Co. prepared to spin off Cable One. Advisers predicted its shares would open for trading at more than $400 a share and they urged the board to split the stock to lower the price. The distinguished board, attuned to attracting QSs thanks to Buffettâ\u0080\u0099s longstanding service on it â\u0080\u0094 rejected the advice. Five years later, Cable One trades more than four times that estimated opening price and maintains its high-quality shareholder base.Â Research conducted by the Quality Shareholders Initiative at George Washington University shows that companies with the highest-priced shares tend to enjoy the greatest proportion of QSs. For instance, of the 100 highest-priced shares in the S&P 500 SPX, +0.87% Â , more than one-third are in the highest decile for QS density and more than half are in the top quarter.Â Â Leading names on both of these lists are corporate stalwarts, including American Tower REIT AMT, +0.46% Â , Avalonbay Communities AVB, -1.09% Â , Roper Technologies ROP, +2.65% Â , Stryker SYK, +1.75% Â , and Thermo Fisher Scientific TMO, +2.46% Â . Among companies with triple-digit share prices that lead the list of shareholder quality: Equinix EQIX, +0.60% Â , Intuitive Surgical ISRG, +2.09% Â , Mettler-Toledo International MTD, +1.32% Â and TransDigm Group TDG, -1.21% Â .Â Commentators predict more stock splits this quarter. The optics appear too good to some boards. Even companies with a high density of QSs can succumb, such as McCormick MKC, +0.91% Â . Directors weighing a stock-split decision should consider its impact on their shareholder list. Itâ\u0080\u0099s said that managers get the shareholders they deserve. Those focused on business performance tend to have a greater proportion of QSs, rather than transients or indexers, and prosper accordingly. Those focused on share price, exemplified by making stock splits, instead attract short-term transient interest, with corresponding effects. Managers and investors alike would do well to pay attention to corporate practices that QSs endorse, and where they invest.Â Lawrence A. Cunningham is a professor and director of theÂ Quality Shareholders InitiativeÂ at George Washington University. He owns Berkshire Hathaway shares. Cunningham has written dozens ofÂ booksÂ including the forthcomingÂ Quality Shareholders: How the Best Managers Attract and Keep ThemÂ (Columbia Business School Publishing, 2020). Cunningham also has authored scores ofÂ researchÂ papers, includingÂ Empowering Quality ShareholdersÂ andÂ Cultivating Quality Shareholders.Â SubscribeÂ hereÂ for updates.Â Â More: Warren Buffett knows these are the best investors to follow with your own money Also read: Why this frustrated value stock pro sees shades of 1999 in the market now â\u0080\u0094 and bargains in the future"}]}