{"article": [{"url": "https://www.marketwatch.com/story/bank-of-england-keeps-interest-rates-and-qe-program-unchanged-11600340676", "published": 1600331840.0, "headline": "Citing â\u0080\u0098unusually uncertain outlook,â\u0080\u0099 Bank of England keeps powder dry while discussing negative rates", "body": "The Bank of England is seen under a cloudy sky in central London on August 6, 2020. daniel leal-olivas/Agence France-Presse/Getty Images The Bank of England on Thursday unanimously decided to keep interest rates and its bond purchase program unchanged, giving the central bank two more months to decide whether to provide more stimulus to the U.K. economy. By a 9-0 vote, the Bank of Englandâ\u0080\u0099s monetary policy committee decided to hold interest rates at 0.1% and the size of its quantitative easing program at Â£745 billion. â\u0080\u009cThe outlook for the economy remains unusually uncertain,â\u0080\u009d said the statement from the Bank of England. â\u0080\u009cRecent domestic economic data have been a little stronger than the Committee expected at the time of the August Report, although, given the risks, it is unclear how informative they are about how the economy will perform further out. â\u0080\u009c The U.K. economy has had a slow recovery from the initial coronavirus lockdowns. The Office for National Statistics this week said payrolls last month were still down by around 695,000 compared with March. The U.K. economy, which is measured monthly, rose 6.6% in July, which nonetheless was 11.7% lower than pre-pandemic levels. Economists caution that the planned October expiration of a government furlough program could pressure the economy, as will new restrictions being put on various parts of the country due to a recent increase in coronavirus cases. The Bank of England also said its outlook was â\u0080\u009cconditioned on the assumption of an immediate, orderly move to a comprehensive free trade agreement with the European Union on 1 January 2021.â\u0080\u009d That has come into doubt after the recent actions from the Boris Johnson-led government, including introducing legislation that would defy arrangements on Northern Ireland it had previously accepted on a withdrawal agreement with the EU. The pound GBPUSD, +0.83% fell sharply after the decision, trading below $1.29 after closing on Wednesday at $1.2969. See London Markets. Minutes released from the meeting show it had been briefed on how negative interest rates could be implemented effectively, â\u0080\u009cshould the outlook for inflation and output warrant it at some point during this period of low equilibrium rates.â\u0080\u009d The Bank of England said it will begin â\u0080\u009cstructured engagement on the operational considerationsâ\u0080\u009d in the fourth quarter. â\u0080\u009cThe simple observation that there will be engagement with regulators about how to implement negative interest rates has already overhung the pound and influenced the gilt market, but thatâ\u0080\u0099s to be expected when a three hundred year old institution hints towards an inaugural negative interest rate policy,â\u0080\u009d said Chris Bailey, European strategist at Raymond James. â\u0080\u009cThe more established path remains boosting the size of the quantitative easing stimulus effort, but that will only happen if the Bank of England believes the combination of negligible inflation and rising unemployment over the next few quarters necessitates a further loosening of policy. All we can say for now is that the uniqueness of 2020 continues to build, and international investors who have found many reasons to avoid U.K. assets over recent years have yet another issue to worry about,â\u0080\u009d added Bailey."}]}