{"article": [{"url": "https://www.marketwatch.com/story/home-prices-could-fall-in-cities-across-the-u-s-as-americans-sour-on-urban-living-says-famed-economist-robert-shiller-11594685128", "published": 1594813100.0, "headline": "Home prices could fall in major cities as Americans sour on urban living, says Nobel Prize-winning economist Robert Shiller", "body": "Home prices in major cities across the country could fall as a result of the pandemic. Drew Angerer/Getty Images The coronavirus pandemic has many Americans heading for the hills — or the suburbs, as it were. And home prices in cities could decline as a result, says Nobel Prize-winning economist Robert Shiller. In an interview with CNBC CMCSA, -0.99%, Shiller outlined the broad risk to the economy posed by the spread of the novel coronavirus and the resulting impact on the global economy. “ ‘People won’t be willing to spend $1 million for a small condo in coming years if that’s the way they feel.’ ” — Robert Shiller, Nobel Prize winning economist at Yale University “We have highly priced markets in the stock market, the bond market and the housing market,” Shiller, who co-founded the S&P CoreLogic Case-Shiller National Home Price Index, said in the interview. “All of these markets could tumble in the coming months.” Where housing is concerned though, the impact of a decline wouldn’t be felt equally across all markets. Rather, Shiller laid out a worst-case scenario for urban markets around the U.S. “What’s nice about the city? It’s good restaurants, theaters, museums, art shows,” he said. “But if you’re afraid of people because you think you might catch something in the next epidemic then it may color your whole feeling about the city.” In addition to that fear, many employers have embraced remote working amid the coronavirus pandemic. Facebook FB, +0.26% has said it will ramp up hiring remote workers, while other firms have given workers the option to continue working from home indefinitely amid the pandemic. There’s even a “work-from-home” ETF that’s aiming to capitalize on the trend. With living close to work less of a necessity, many Americans may see less of a reason to pay a premium to live in the city. That could accelerate a trend of people fleeing major cities that existed before the pandemic began. Also see: More than 20 million Americans may be evicted by September “It may cause price declines,” Shiller said. “People won’t be willing to spend $1 million for a small condo in coming years if that’s the way they feel.” A drop in home prices would represent a major reversal. Data released last month showed that home prices continued to rise in April even as COVID-19 cases rapidly increased across the country. Economists have suggested that the low supply of homes for sale nationwide and the boost in demand prompted by low mortgage rates could keep prices elevated. On Tuesday, Fannie Mae FNMA, +0.73% upgraded its forecast for home price growth. Citing June housing data from CoreLogic CLGX, +0.86% that showed home prices rising at the fastest pace since November 2018, Fannie Mae now expects home prices to rise 4.4% this year. The mortgage giant’s forecast last month called for only a 0.4% increase. Fannie Mae expects home price appreciation to slow in 2021 due to persistent elevated levels of unemployment caused by the pandemic. While the forecast calls for an increase in home prices, Fannie Mae economists did acknowledge that price changes could vary due to migration patterns. Some researchers have predicted that home prices will fall overall. “It’s likely housing will feel the broader economy’s downturn eventually, though to a mild degree, and home values will fall in the coming months,” Zillow ZG, -0.42% senior principal economist Skylar Olsen said in a recent report."}]}