{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-cases-rise-toward-7-million-after-jumping-by-more-than-45000-in-a-single-day-2020-09-25", "published": 1601047340.0, "headline": "Coronavirus update: U.S. cases top 7 million, after jumping by more than 45,000 in a single day", "body": "A rising tide worldwide of new cases and deaths from the coronavirus-borne disease COVID-19 has prompted calls for new shutdown measures overseas and more political wrangling in the U.S., but also reignited efforts to produce a stimulus bill to fend off a renewed pandemic-induced economic slowdown. The global case tally reached 33,356,829 on Friday as deaths grew to 984,906, according to data aggregated by Johns Hopkins University. In the U.S., the case toll climbed to 7,005,746, and has doubled in a little over two months, while the death toll reached 203,240, the Johns Hopkins data show. There were 45,176 new cases reported in the U.S. on Thursday, according to New York Times data, up from 41,481 on Thursday. That was above the daily average of 41,859 over the past week, which was up 17% from the average two weeks earlier. There were at least 885 new coronavirus deaths over the past day, down from 1,091 a day before. The lack of much improvement in the U.S. numbers, which continues to lead the world in cases and deaths by a wide margin, has led New York Gov. Andrew Cuomo and Michigan Gov. Gretchen Whitmer to call for a congressional oversight investigation into whether President Donald Trump’s politicization of the pandemic has impeded his administration’s response. The governors’ call for an investigation noted the revelation that the White House blocked a Department of Health and Human Services plan for the U.S. Postal Service to ship face masks to every household in the country, free of charge, in April, and the news that political administration appointees, “over the strong objection of CDC scientists,” published the guidance that said people without symptoms did not need to get tested for COVID. “Coupled with the agency’s abrupt reversal this week on guidance related to the airborne transmission of the virus, it’s increasingly clear that the president and his advisers are trying to undermine the credibility of experts whose facts run counter to the administration’s political agenda,” the governors said in a statement. iframe.twitter-tweet { width: 100% !important; } Meanwhile, House Democratic leaders, led by Speaker Nancy Pelosi, have stepped up efforts to prepare a $2 trillion–plus bill to boost the economy. The bill is expected to include funding direct payments to households, a furtherance of the Paycheck Protection Program, a revival of a federal add-on to state unemployment benefits, and a renewal of aid to airlines and money to help restaurants stay in business. The renewed effort comes in the wake of data showing the pace of the economic recovery from its lowest levels of the pandemic period has slowed. On Friday, data showed durable-goods orders in August rose 0.4%, below expectations for a 1.5% increase, and well below the revised growth of 11.7% in July and 7.7% in June. See Economic Report. That seemed to give Wall Street investors a shot in the arm, as the Dow Jones Industrial Average DJIA, +0.56% was recently up nearly 270 points, or 0.98%, the S&P 500 index SPX, +0.87% tacked on 1.28% and the Nasdaq Composite COMP, +1.39% advanced 1.99%. The Dow remained on track for a fourth straight weekly loss, and its biggest weekly decline since the week ended June 26. In Brazil, which has the second highest death toll at 139,808 and third highest case count at 4,657,702, according to the Johns Hopkins data, Rio de Janeiro has reportedly delayed its annual Carnival for the first time in a century. Elsewhere, the government of Spain has recommended a complete lockdown of the capital city of Madrid, as the Guardian reported. The recommendation comes after restrictions were imposed in some areas of the region, and after data showing Madrid accounted for more than one-third of Spain’s hospital admissions. Despite the pressure from national leaders, authorities in Madrid are expanding restrictions, but will not include the entire city, as the Associated Press reported. Spain’s death toll was the ninth highest in the world at 31,232, while the case tally was the seventh highest at 716,481. The Netherlands and France both recorded record highs in new cases, with 2,777 new cases in the past 24 hours in the Netherlands and France recording 16,096 new infections. The U.K. led Europe, and was fifth in the world, with 42,025 deaths, but was fourth in Europe and 14th in the world in cases with 425,765. Russia paces Europe in cases with 1,131,088. Don’t miss:Italian president hits back at U.K.’s Boris Johnson over ‘freedom loving’ COVID-19 remarks Israel’s government reportedly issued more restrictive lockdown measures, a week after ordering a partial shutdown. Israel is 24th in the world with 215,273 cases and 47th in deaths with 1,405. On the bright side, Novavax Inc. NVAX, +0.18% announced a COVID-19 vaccine manufacturing deal with Endo International PLC ENDP, +2.68%, in which an Endo subsidiary will provide fill-finish manufacturing services at a factory in Rochester, Mich. The product being produced is expected to be used in Novavax’s Phase 3 trials of NVX-CoV2373 in the U.S., as well as for potential general distribution to the public if the vaccine candidate receives regulatory approval or authorization. Novavax CEO Stanley Erck said the company is preparing for its pivotal Phase 3 trial in the U.S. to “get under way very soon.” Separately, the company has started a Phase 3 trial in the U.K. Don’t miss: There are currently four coronavirus vaccines in late-stage studies; here’s how they differ.In other news: • Virginia Gov. Ralph Northam and first lady Pamela Northam tested positive for COVID-19. The Northams took PCR nasal swab test Thursday afternoon, after being notified that a member of the official residence staff had developed symptoms and tested positive for COVID-19. “As I’ve been reminding Virginians throughout this crisis, COVID-19 is very real and very contagious,” the Democratic governor said. • An Ohio mother was tasered and dragged away from a middle school football game, after refusing repeated requests to wear a mask. The woman said she refused to wear the mask because she has asthma. The police said she was arrested for criminal trespassing. • Hawaiian Airlines parent Hawaiian Holdings Inc. HA, +0.36% said, starting Oct. 15, it will offer those traveling to Hawaii from the international airports in Los Angeles and San Francisco the option to take drive-through COVID-19 tests before they fly, so those who test negative can be exempt from Hawaii’s 14-day quarantine requirement. To receive the results within 36 hours, the tests will cost $90, and will cost $150 for “day-of-travel” express service. • Luxury retailer Neiman Marcus Holdings Co. Inc., which was the first department store chain to go bankrupt following the COVID-19 outbreak, said it has emerged from bankruptcy. The company said it had “full support” of its creditors and new equity shareholders. The new owners, which include PIMCO, Davison Kempner Capital Management and Sixth Street, are funding a $750 million exit financing package."}]}