{"article": [{"url": "https://www.marketwatch.com/story/coca-cola-launching-topo-chico-hard-seltzer-as-brands-from-sam-adams-parent-and-molson-coors-soar-2020-08-03", "published": 1596559100.0, "headline": "Coca-Cola launching Topo Chico Hard Seltzer as brands from Sam Adams parent and Molson Coors soar", "body": "Coca-Cola Co. is jumping into the hard seltzer game with a new brand based on its popular sparkling mineral water, Topo Chico Hard Seltzer, which will launch in select Latin American cities later this year. Coca-Cola KO, +0.69% calls it an “experimental drink” that was inspired by the use of Topo Chico by many bartenders. The news comes days after the beverage giant said, during its second-quarter earnings announcement , that it would be shutting down brands and items that don’t have the growth potential of certain smaller brands or its core beverage items. The Odwalla brand of juices was shuttered on July 31. One of the brands that Coca-Cola Chief Executive James Quincey mentioned as having momentum is Topo Chico. Read: Coca-Cola plans to cut ‘zombie brands’ from its portfolio Coca-Cola’s entrance into the hard seltzer category comes at a time when the item is soaring. Bank of America analysts called 2019 “a breakthrough year for hard seltzers, as the sub category more than doubled in size.” “Consumer interest in hard seltzer is coming from a combination of health/wellness (low carbohydrate/calories) and mining a seam that exists between consumer demand for wine and spirits versus beer,” analysts wrote in a February note. More recently, both Boston Beer Co. Inc. SAM, -0.19% and Molson Coors Beverage Co. TAP, -1.87% said their respective hard seltzer brands, Truly Spiked & Sparkling and Vizzy Hard Seltzer, are flying off shelves. Boston Beer is the parent of Samuel Adams beer brands. “Since early January, Truly has significantly grown its velocity and has sequentially grown its market share, while many other hard seltzer brands have entered the category,” said David Burwick, chief executive of Boston Beer, during the company’s second quarter earnings call on July 23, according to a FactSet transcript. Truly and another hard seltzer brand, Market Anthony Brands International’s White Claw, had 80% of the hard seltzer market at the end of 2019, according to Bank of America. See: Chipotle customers are spending more to dine on queso and steak Other brands of hard seltzer include Bud Light Seltzer from Anheuser-Busch BUD, -0.21% and Corona Seltzer from Constellation Brands Inc. STZ, +0.81% . “Truly is the only hard seltzer not introduced this year to grow its share during 2020,” Burwick said. The company plans to continue to invest in the brand as new competitors launch. It is also looking at opportunities to be sold in bars and other venues, or “on-premise,” as those opportunities arise. On-premise business has come to a virtual halt due to the coronavirus pandemic. Boston Beer had expected to bring Truly to more bars and restaurants this summer. “[E]ven with the places that have opened their outdoor seating, it’s still distanced and it’s a fraction of what it used to be, and putting your products in is not high on their list,” said C. James Koch, Boston Beer’s founder, on the second-quarter earnings call. “So I think it’s going to be summer 2021 when we see a big penetration of hard seltzers, and I expect it will get to the point where you walk into a bar or a restaurant and you expect them to have some hard seltzer, probably either Truly or White Claw.” Molson Coors’ hard seltzer Vizzy launched this year. Don’t miss:Domino’s Pizza could snap up market share with ‘improved’ wings “Despite not launching nationally until April, it is already the number three seltzer in a number of markets, and is beating Bud Light Seltzer in repeat purchase rates,” said Gavin Hattersley, chief executive of Molson Coors, on the second-quarter earnings call last week, according to FactSet. Molson Coors has also acquired Atwater Brewing, a Midwest brewing company that makes craft seltzers. And the company has partnerships overseas to bring hard seltzer to Europe. Coors Seltzer is planned for August. “We’re going to make sure we’ve got strong pressure behind big trusted brands like Miller Lite and Coors Light,” Hattersley said. “And we’re going to drive trial and awareness behind our new innovations of Vizzy and Coors Seltzer and Blue Moon LightSky.” Blue Moon LightSky is brewed with tangerine peel and has 95 calories. Coca-Cola stock has slumped 15.7% for the year to date, Boston Beer shares have soared 119% and Molson Coors stock is down 31.8% for the period. The S&P 500 index SPX, +0.87% is up 2.3% for 2020 so far."}]}