{"article": [{"url": "https://www.marketwatch.com/story/trump-threatens-to-decouple-u-s-economy-from-china-accuses-biden-of-treachery-11599553852", "published": 1599539900.0, "headline": "Trump threatens to â\u0080\u0098decoupleâ\u0080\u0099 U.S. economy from China, accuses Biden of â\u0080\u0098treacheryâ\u0080\u0099", "body": "U.S. President Donald Trump speaks during a labor day press conference at the North Portico of the White House in Washington, DC on September 7, 2020. mandel ngan/Agence France-Presse/Getty Images President Trump on Monday vowed to â\u0080\u009cdecoupleâ\u0080\u009d the US economy from China and blasted his Democratic challenger, Joe Biden, for being a â\u0080\u009cstupid personâ\u0080\u009d whose â\u0080\u009ceconomic treacheryâ\u0080\u009d allowed the authoritarian nationâ\u0080\u0099s economic rise. Trump spoke to reporters on Labor Day from the North Portico of the White House â\u0080\u0094 a rare venue for a presidential press conference. â\u0080\u009cIf Biden wins, China wins, because China will own this country,â\u0080\u009d Trump said. â\u0080\u009cTodayâ\u0080\u0099s Labor Day â\u0080\u0094 itâ\u0080\u0099s a good time to talk about where weâ\u0080\u0099re being ripped off by countries, but nobodyâ\u0080\u0099s even close to China.â\u0080\u009d Trump spoke after aÂ New York Times reportÂ detailed the former vice presidentâ\u0080\u0099s longstanding belief that US industries and human rights in China would benefit from boosting Chinaâ\u0080\u0099s economy through trade. â\u0080\u009cThe New York Times has just published an entire story on Bidenâ\u0080\u0099s Chinaâ\u0080\u0099s sellouts, which is amazing for the New York Times. I appreciate that,â\u0080\u009d Trump said. â\u0080\u009cIn 2001 Biden said the United States welcomes the emergence of a prosperous integrated China at the global stage because we expect this is going to be a China that plays by the rules. They didnâ\u0080\u0099t play by the rules â\u0080¦ The World Trade Organization â\u0080¦ thatâ\u0080\u0099s why they became a rocket ship. They were flatline for years and years and years and they joined the World Trade Organization. And frankly they cheated.â\u0080\u009d Trump said, â\u0080\u009cI made a great trade deal with Chinaâ\u0080\u009d in January before the coronavirus pandemic and â\u0080\u009ctheyâ\u0080\u0099re buying [US products]. You know why? Theyâ\u0080\u0099re buying because they know Iâ\u0080\u0099m not happy. Thatâ\u0080\u0099s why they buy.â\u0080\u009d But Trump vowed to punish China for â\u0080\u009csendingâ\u0080\u009d COVID-19 overseas, including by â\u0080\u009cdecouplingâ\u0080\u009d economically. â\u0080\u009cWe will make America into the manufacturing superpower of the world and weâ\u0080\u0099ll end reliance on China once and for all, whether itâ\u0080\u0099s decoupling or putting in massive tariffs like Iâ\u0080\u0099ve been doing already. Weâ\u0080\u0099re going to end our reliance on China, because we canâ\u0080\u0099t rely on China,â\u0080\u009d Trump said. Democratic National Committee spokeswoman Lily Adams denounced Trumpâ\u0080\u0099s speech as â\u0080\u009cincoherent.â\u0080\u009d â\u0080\u009cTrump ignored the economic havoc heâ\u0080\u0099s created and lied his way through a series of debunked political attacks,â\u0080\u009d Adams said. Trumpâ\u0080\u0099s economic nationalism regarding China comes as he works to again win the Rust Belt states that struggled with globalization. â\u0080\u009cWe will manufacture our critical medical supplies in the United States, we will create Made in America tax credits and bring our jobs back from China to the United States and we will impose tariffs on companies that desert America to create jobs in China and other countries,â\u0080\u009d Trump said. â\u0080\u009cWe will prohibit federal contracts from companies that outsource to China, and will hold China accountable for allowing the virus to spread around the world. Now you can understand why China would much rather see Sleepy Joe than Donald Trump.â\u0080\u009d The Trump administration recently sanctioned Chinese officialsÂ for eliminating Hong Kongâ\u0080\u0099s political autonomyÂ and detaining Uyghur Muslims in re-education camps, as the COVID-19 pandemic contributed to a dramatic souring in relations. â\u0080\u009cBecause of Bidenâ\u0080\u0099s economic treachery was 60,000 shuttered American factories. I heard this morning that the real number is probably 70,000â\u0080¦ and heâ\u0080\u0099s talking about how wonderful it is with China. No, China has been very bad â\u0080\u0094 on top of which we had the China virus sent to usâ\u0080¦ We had other viruses sent in over the years that came from China. I wonder why.â\u0080\u009d"}]}