{"article": [{"url": "https://www.marketwatch.com/story/this-mans-estranged-wife-received-his-stimulus-check-and-spent-it-she-wont-pay-it-back-what-can-he-do-2020-07-01", "published": 1593783140.0, "headline": "This manâ\u0080\u0099s estranged wife received his stimulus check â\u0080\u0094 and spent it. She wonâ\u0080\u0099t pay it back. What can he do?", "body": "Dear Moneyist, I am asking this question for my friend. He and his wife separated in October 2019. They are trying to represent themselves to avoid costly attorney expenses. They do not have children nor any assets. She kept him in the dark about account numbers and log-in information. They filed jointly in 2018. The COVID-19 stimulus payment was deposited into their joint account, one that neither of them use anymore. As he was unable to check online banking, he did not know when this happened. He checked the balance at the ATM only to discover that she has withdrawn all of the $2,400 payment, leaving him with nothing. He has since confronted her and she has admitted it and told him she had already spent it. She refuses to give it back, and declines to even work out a payment plan. When trying to report it to the IRS, everything seems to come down to identity theft as being the reason it was stolen. What does he need to do to obtain the $1,200 stimulus payment she stole from him? What do you think? Concerned friend Dispatches from a pandemic: Letter from New York: â\u0080\u0098New Yorkers wear colorful homemade masks, while nurses wear garbage bagsâ\u0080\u0099 Dear Concerned, If this is the bank account the IRS has on file, this is where the IRS will deposit your friendâ\u0080\u0099s tax refund. So if he hasnâ\u0080\u0099t done so already, he needs to change this account. Otherwise, the same thing will happen again. Prevention is better than cure. I hate cliches, but this one is painfully true. Having your correct bank details on file will help speed the plow for a payment next year. If the IRS does not have your bank-account information on file, it will likely take longer. You can submit your bank-account and address information through the IRS tracking tool, â\u0080\u009cGet My Payment.â\u0080\u009d Your friendâ\u0080\u0099s dilemma is not the first one of this kind I have received. One husband actually refused to give the payment to his wife. That was a textbook case of financial abuse. Another husband filed a joint tax return and forged his estranged wifeâ\u0080\u0099s signature, and received her $1,200. Thatâ\u0080\u0099s fraud. Donâ\u0080\u0099t miss:â\u0080\u0098We will not have a vaccine by next winter.â\u0080\u0099 Like the 1918 Spanish flu, CDC says second wave of coronavirus could be worse. So what happens now? This, however, falls short of that. The account is in both their names and, as per the terms of most joint accounts, they both have access to the account and they are both entitled to withdraw money from the account. The money was his. Once it hits their joint account, itâ\u0080\u0099s theirs. This is a cautionary tale for anyone opening a joint bank account. Account passwords on emails can be changed, and so can the passwords for online banking. Your friend appears to portray himself as a hapless or, at the very least, passive player in this financial fudgery. He is not blameless. Not staying on top of your financial accounts, especially those connected with a former partner and the IRS and any other institution, is a choice. The lesson here is to be more assertive with the way he manages his life, so he doesnâ\u0080\u0099t end up in a situation like this again. He should inform his divorce lawyer, if he has one (if not, he should), and change any other direct deposits into this account. He can also take out a court order to freeze this or any other joint account to prevent his wife from withdrawing any other money that happens to be deposited into it. The Moneyist: My son is staying with me, yet my financially irresponsible ex-husband received his $500 stimulus check. Is my ex right to keep it? You can email The Moneyist with any financial and ethical questions related to coronavirus at qfottrell@marketwatch.com. Want to read more?Follow Quentin Fottrell on Twitterand read more of his columns here Would you like to sign up to an email alert when a new Moneyist column has been published? If so, click on this link. Hello there, MarketWatchers. Check out the Moneyist private Facebook FB, +0.26% Â group where we look for answers to lifeâ\u0080\u0099s thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}