{"article": [{"url": "https://www.marketwatch.com/story/washington-deadlock-on-jobless-benefits-coronavirus-aid-risks-economic-recovery-2020-08-22", "published": 1598115260.0, "headline": "Washington deadlock on jobless benefits, coronavirus aid risks economic recovery", "body": "Here’s the biggest unknown about the economy right now: Just how much will the loss of federal coronavirus aid for families and businesses stunt a recovery that already has lost steam. Democrats and Republicans ceased negotiations in early August and Congress adjourned after the two parties failed to break a deadlock on the next financial-relief package. The impasse resulted in the expiration of a $600 federal benefit each week for tens of millions of jobless Americans as well as massive subsidies for thousands of companies struggling to survive. With both party conventions under way ahead of the November elections, neither seems in a rush to strike a deal even as the coronavirus keeps spreading and mass unemployment casts a huge shadow over the economy. The latest increase in weekly jobless benefit claims, a proxy for layoffs, raised the possibility that companies could lay off more workers or decline to bring them back if sales don’t perk up. And sales are unlikely to improve if families don’t have money to spend. Read:Jobless claims climb back above 1 million as recovery in labor market slows “The sudden uptick is a reminder that the recovery is progressing unevenly and economic gains can be easily reversed if conditions worsen,” said Glassdoor economist Daniel Zhao. Gus Faucher, chief economist at PNC Financial Services, estimates the loss of the $600 federal stipend could rob the economy of about $70 billion in spending a month. President Trump has ordered a temporary $300 federal stipend, but it’s not being offered by most states yet and would only partially compensate for the loss of the full stipend. Read:Google searches on how to ‘file for unemployment’ is a crystal ball for jobless claims Many small companies, for their part, have relied on government subsidies to stay open when the economy was locked down and to continue to pay employees regardless of whether they were working. The business aid, known as the Paycheck Protection Program, stopped accepting applicants on Aug. 8. Has the economy improved enough for them to survive? The upcoming slate of economic reports mostly reflect the state of the economy in July — before the end of the government aid. Wall Street DJIA, +0.56% won’t find many clues in those reports next week. See:MarketWatch Economic Calender Here’s what we do know. Some industries such as manufacturing and construction have rebounded smartly, but lots of smaller firms like restaurants, retailers, personal-care stores and other Main Street businesses are still just barely scraping by. Anecdotal evidence is already pointing to rising business failures — and more to come. “With the government’s business and household income subsidies running out, it isn’t clear whether those firms that are just hanging on can make it,” said Joel Naroff of Naroff Economic Advisors. “Most economists believe as I do that more help is needed.” Read: Did the expired $600 federal jobless benefit keep people from going back to work? One potential saving grace, literally, is savings. The U.S. savings rate has soared to record levels as consumers and businesses sought to cushion themselves against future financial blows. So they’ve got a little extra cash to spend if necessary. Read: Americans worry the economy will suffer for a long time even as they keep spending The extra savings won’t last long, however. Either the economy will have to speed up soon and draw more Americans back to their jobs — or the government will have to approve another trillion-dollar relief bill to prevent the recovery from stalling. “Right now, the government’s failure to come to an agreement to extend the supplemental jobless benefits that expired at the end of July and a virus case resurgence across much of the country appear to be the biggest impediments to a stronger labor market recovery,” said chief economist Scott Anderson of Bank of the West."}]}