{"article": [{"url": "https://www.marketwatch.com/story/tesla-stock-gets-two-downgrades-falls-below-1000-2020-06-12", "published": 1592046140.0, "headline": "Tesla stock gets two downgrades, falls below $1,000", "body": "Tesla Inc. stock lost some of its luster Friday after Goldman Sachs and Morgan Stanley moved to downgrade the shares, saying there are risks investors might have ignored as they rewarded the company with a dizzying valuation. Tesla TSLA, +1.89% shares fell on Friday but garnered a weekly gain of 5.6%. The shares closed at a record $1,025.05 on Wednesday. Tesla’s valuation has swollen to more than $170 billion, and at the height of the week’s rally the company was briefly the world’s most-valued car maker after Toyota Motor Corp. TM, -0.65% 7203, -0.95%. Toyota’s valuation hovered at $208 billion on Friday. Wednesday’s surge came after a leaked memo from Elon Musk showed the chief executive urging the company to go “all out” on the Tesla Semi and bring the freight truck to volume production amid intense investor interest in competitor Nikola Corp. NKLA, -1.36%, an Arizona-based electric-truck startup that went public last week. The Goldman analysts said they continued to hold a “positive” long-term view of Tesla, but the shares are trading above their 12-month price target of $950, upped on Friday. Recent data points on Tesla have been mixed, the analysts said. Negatives include Tesla recently cutting prices on several models, which was unexpected, and compressed lead times for Model Y deliveries. On the other hand, there has been new government financing assistance for electric-vehicles in Europe, and Tesla had “solid” May deliveries in China. “We’d look to become more positive on Tesla stock again if we had more confidence in the near to intermediate term trajectory of fundamentals, or if valuation became more attractive,” the Goldman analysts said. The analysts, led by Mark Delaney, downgraded Tesla to neutral. In the same report, they also upgraded General Motors Co. GM, -0.15% to buy, saying GM is in a “solid position” in the U.S. pickup truck market as well as the Chinese market. Analysts at Morgan Stanley marked down Tesla for risks to the trade between the U.S. and China, for concerns about near-term demand, and the company’s ongoing capital needs. Those are “key bear vectors” markets might be ignoring, the analysts, led my Adam Jonas, said. Morgan Stanley downgraded Tesla stock to their equivalent of sell, from neutral, and shaved its price target on the shares to $650 from $680. Tesla shares have gained 121% so far this year, contrasting with losses of 4.6% and 11% for the S&P 500 index SPX, +0.87% and the Dow Jones Industrial Average DJIA, +0.56% in the same period."}]}