{"article": [{"url": "https://www.marketwatch.com/story/biden-raises-3645-million-in-august-breaking-record-for-a-white-house-campaign-2020-09-02", "published": 1599052280.0, "headline": "Biden raises $364.5 million in August, breaking record for a White House campaign", "body": "Democratic presidential nominee Joe Biden’s campaign and its affiliates on Wednesday announced they raised a record-breaking $364.5 million in August. President Donald Trump’s re-election campaign and its affiliates have not yet announced their fundraising haul for last month. The Republican side raised more money than Biden’s camp in July, but the two campaigns recently have shown an increasingly comparable amount of cash on hand. A New York Times report on Tuesday said Biden’s August fundraising would top $300 million, exceeding what is believed to be the previous monthly fundraising record for a White House campaign of $193 million, set by Barack Obama in September 2008. “We have to keep breaking records if we want to ensure a fighting chance at winning this thing,” Biden said on Wednesday in a fundraising message to supporters. The August fundraising came as both Democrats and Republicans held their national conventions, and as Biden announced Sen. Kamala Harris of California as his running mate. A campaign’s financial reports are a closely watched measure of viability, along with polling data. Trump also often touts the performance of the stock market SPX, +0.87% DJIA, +0.56%, which surged in August. In RealClearPolitics moving averages of polls as of Wednesday, Biden gets support of 48.9% of voters in nationwide surveys, ahead of Trump’s 42.6%, but the former vice president is up by just 48.0% to Trump’s 45.5% in top swing states that are likely to decide the Nov. 3 election. Betting markets give Biden just a 50.2% chance of winning vs. 61% a month ago. Biden plans to give a speech Wednesday in which he attacks Trump’s push for schools to reopen amid the coronavirus pandemic, while Trump is slated to make another visit to the swing state of North Carolina."}]}