{"article": [{"url": "https://www.marketwatch.com/story/10-year-treasury-yield-nears-0-80-level-as-november-election-draws-focus-11601987952", "published": 1602001580.0, "headline": "30-year Treasury yield marks sharpest drop in a month after Trump says he'll end stimulus talks", "body": "U.S. Treasury yields fell Tuesday, reversing course earlier in the day, after President Donald Trump said he would put an end to negotiations with Democrats over additional pandemic stimulus.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 1.9 basis points to 0.741%. The 2-year note yield TMUBMUSD02Y, 0.156% was steady at 0.147%. The 30-year bond yield TMUBMUSD30Y, 1.576% slipped 2.8 basis points to 1.537%, its biggest daily drop in a month, after trading as high as 1.61% earlier in the session Tuesday. Bond prices move in the opposite direction of yields. What's driving Treasurys? Safe-haven investments rallied following Trump's tweet on Tuesday said he would put off further stimulus negotiations until after the presidential election in November, citing differences with House Speaker Nancy Pelosi on aid to state and local governments. Although both Republicans and Democrats agree on the need for more stimulus, they disagree on the scope and size of a potential bill. Before Trump's announcement, yields were running high on the possibility that the Democratic Party might achieve a majority in both the U.S. House and Senate, along with the presidency, after next month's election. Recent polls have shown a widening lead by former Vice President Joe Biden since last week's first presidential debate. Momentum in the polls also sparked optimism about the prospects for Washington to pass a comprehensive fiscal stimulus package, while easing worries that the U.S. economy will be forced to muddle through the pandemic without further stimulus measures. Tuesday also saw the U.S. Treasury Department auction off $52 billion of 3-year notes, an increase of $2 billion from September's auction. In U.S. economic data, the U.S. trade deficit widened to $67.1 billion in August. The Labor Department's Job Openings and Labor Turnover Survey fell to 6.5 million in August. Federal Reserve Chairman Jerome Powell also reiterated a call for additional fiscal stimulus measures, without which he warned the economy will be at risk of slowing down. What did market participants say? \"We have a couple of debates left. You can still have some things happen over the month,\" said Frank Rybinski, chief macro strategist at Aegon Asset Management, referring to the potential for a Democratic clean sweep. Rybinski said it was too early to tell based on the polls how the November presidential election would pan out."}]}