{"article": [{"url": "https://www.marketwatch.com/story/bank-stocks-are-plunging-it-may-be-an-overreaction-longtime-analyst-says-2020-06-11", "published": 1591945040.0, "headline": "Bank stocks plunge - it may be an overreaction, longtime analyst says", "body": "Bank shares skidded Thursday as investors turned bearish after the Federal Reserve said it would keep official interest rates near zero for years amid lasting economic pain. Investors may be overreacting, according to at least one longtime bank analyst. The Fed predicted that the federal funds median target rate would be 0.10% through 2022. You can read the projections here and see related tables here. On Thursday, the Dow Jones Industrial Average DJIA, +0.56%  fell 1,862 points (or 6.9%) to 25,128.17, for its worst decline since March 16, when it dropped 2,997 points. The benchmark S&P 500 Index SPX, +0.87%  fell 5.9% and the Nasdaq Composite Index COMP, +1.39%  declined 5.3%. The Invesco KBW Bank ETF KBWB, -0.41%, which tracks the KBW Bank Index BKX, -0.33%, tumbled 9%. The KBW Bank Index comprises 24 stocks of universal and large regional U.S. banks. Here's how all 24 fared during the early minutes of trading Thursday, with Goldman Sachs GS, -0.21%  and Morgan Stanley MS, -0.34%  added to the list so that the \"big six\" U.S. banks are all included: Company Ticker Headquarters city Price change - June 11 Price change - 2020 Price change - 2019 Citigroup Inc. C, +0.47%  New York -13.4% -39.4% 53.5% CIT Group Inc. CIT, -1.31%  New York -12.6% -52.3% 19.2% Fifth Third Bancorp FITB, -1.39%  Cincinnati -11.8% -35.8% 30.6% Citizens Financial Group Inc. CFG, -2.10%  Providence, R.I. -10.2% -39.7% 36.6% Bank of America Corp BAC, +0.47%  Charlotte, N.C. -10.0% -32.1% 42.9% Regions Financial Corp. RF, -1.91%  Birmingham, A. -10.0% -33.6% 28.3% Wells Fargo & Co. WFC,  San Francisco -9.8% -50.2% 16.8% Comerica Inc. CMA, -1.76%  Dallas -9.8% -47.5% 4.5% Truist Financial Corp. TFC, +0.34%  Charlotte, N.C. -9.7% -33.5% 30.0% PNC Financial Services Group Inc. PNC, -0.91%  Pittsburgh -9.6% -32.7% 36.5% Goldman Sachs Group Inc. GS, -0.21%  New York -9.1% -15.6% 37.6% M&T Bank Corp. MTB, -0.40%  Buffalo, N.Y. -9.0% -37.4% 18.6% Huntington Bancshares Inc. HBAN, -1.79%  Columbus, Ohio -8.8% -37.1% 26.5% People's United Financial Inc. PBCT, -1.81%  Bridgeport, Conn. -8.8% -31.0% 17.1% KeyCorp KEY, -1.42%  Cleveland -8.5% -37.3% 36.9% Morgan Stanley MS, -0.34%  New York -8.5% -12.8% 28.9% Zions Bancorporation N.A. ZION, -1.75%  Salt Lake City -8.4% -35.2% 27.4% J.P. Morgan Chase & Co. JPM, -0.57%  New York -8.3% -30.3% 42.8% U.S. Bancorp USB, -0.83%  Minneapolis -8.1% -39.0% 29.7% SVB Financial Group SIVB, +0.52%  Santa Clara, Calif. -8.1% -18.8% 32.2% Capital One Financial Corp. COF, -0.49%  McLean, Va. -7.9% -35.7% 36.1% State Street Corp. STT, +2.20%  Boston -7.6% -22.7% 25.4% Northern Trust Corp. NTRS, +1.15%  Chicago -6.4% -22.8% 27.1% First Republic Bank FRC, -0.03%  San Francisco -6.3% -10.5% 35.2% Bank of New York Mellon Corp. BK, +1.39%  New York -5.7% -25.1% 6.9% New York Community Bancorp Inc. NYCB, -2.75%  Westbury, N.Y. -4.1% -13.6% 27.7% Source: FactSet Scroll the table to see the data. Click on the tickers for more about each bank, including news and business profiles.Varied sources of bank earnings Odeon Capital Group analyst Richard Bove quoted a colleague as saying: \"Apparently, it is true that the only factor that impacts bank stock prices is interest rates,\" in a report early Thursday. Bove refuted that assertion: \"For example, the period of lowest interest rates, in modern times, over a sustained period, in the United States was from 2008 to 2015. In this seven-year period, bank earnings declined in 2009 and 2014. They increased in 2010, 2011, 2012, 2013, and 2015. They hit all-time records in 2013 and 2015 and were close to an all-time record in 2014.\" Bove went on to point out that banks have differing business models and predicted that the best industry performers during the expected period of very low interest rates would be those with \"the ability to acquire resources and sell products,\" and those that could maintain the best loan quality. He cited the tremendous increase in money supply, from the action of the Federal Reserve and other central banks, which has helped lead to increased trading revenue and debt underwriting for investment banks. Bove has \"buy\" ratings on J.P Morgan Chase JPM, -0.57%, Bank of America BAC, +0.47%, Citigroup C, +0.47%, KeyCorp KEY, -1.42%, Goldman Sachs GS, -0.21%  and Morgan Stanley MS, -0.34%, among the banks listed on the table above, with \"sell\" ratings for M&T Bank Corp. MTB, -0.40%  and Capital One COF, -0.49%. Stress tests However, a factor that may weigh on bank stocks over the next two weeks is the annual stress tests and regulatory review of large banks' capital plans. The Federal Reserve will announce the results at 4:30 p.m. ET on June 25. KBW analyst Brian Kleinhanzl expects none of the 34 banks whose capital plans will be reviewed by the Fed to request permission to repurchase shares during the 12-month period ended June 30, 2021. He expects the total payout ratio (dividends on common shares plus stock buybacks divided by earnings) to be 56% over that period, declining from an estimated 139% for the previous 12-month period."}]}