{"article": [{"url": "https://www.marketwatch.com/story/10-easy-ways-to-save-870000-2020-09-17", "published": 1600944980.0, "headline": "Making these small spending and saving changes can buy you a better retirement", "body": "Sentences that begin with “I can’t” drive me nuts—and I especially dislike the sentence, “I can’t save.” “Pish-tosh,” I say. Every household in America earning at least the median income can save for the future. If they try hard, many lower-income Americans could also save. Of course, the amount saved will vary, but even small amounts can help over the long haul. If a household earning $40,000 a year can sock away enough to generate $300 or $400 in monthly retirement income to supplement whatever they get from Social Security, that’s significant. Saving early and regularly quickly makes life far less financially stressful. How can I be so confident that most Americans have the ability to save? Look around at the many nonessential businesses—including entertainment companies—that are sustained by the spending of the average American. I don’t advocate living like a hermit. But a touch of frugality and a sense of spending priorities wouldn’t go awry. Read: These 16 money wasters are why so many Americans can’t save for retirement Last year, I wrote about the ways many people waste money. Earlier this year, I suggested “financial fasting” as a way to accumulate funds to start investing. But enough of theory. Let’s look at some numbers. For the 10 examples below, I assume a 40-year saving period, with those savings earning a 5% annual return. 1. The pause that refreshes. It amazes me how much soda makes its way into shopping carts. Americans consume 39 gallons of soda per person per year. Who needs all of that? Where I live, a case of 12-ounce cans is about $25. Skip one case a month and you can accumulate $38,000 in 40 years. 2. Light up (or not). Yes, smoking is down. But there are still 34 million smokers and they spend an average $6.28 a pack. Eliminating one pack a day will get you $291,000 after 40 years. Do that in New York City, where cigarettes are even more expensive, and you’ll be in a penthouse in Palm Beach at age 65. 3. Your turn. Video games are big business. Americans spend about $43 billion a year on games. The average player is in his or her mid-30s. Assume a player skips buying just two new high-end games each year. That will net about $11,000 for retirement. 4. Ink. A skilled tattoo artist earns around $200 an hour. The cost of a tattoo ranges from $30 to thousands. About a third of Americans, most of them under age 55, have at least one tattoo. Those with a tattoo typically have more than one. Let’s assume a onetime total tattoo cost of $500. Skip that and you’ll add $3,500 to your pot of gold. 5. Fluffy or Fido. Nobody is giving up his or her fur baby to save money. But if you aren’t already supporting that dependent to the tune of $1,000 a year, avoiding the expense could get you $127,000 for retirement. 6. Transportation. Most people can get around town without a pickup or an SUV. Save $100 a month on your car payments and retirement gets easier with an extra $152,000. 7. Caffeine fix. Give up one grande caramel macchiato at $4.50 a week and you can add another $30,000 to your financial security. 8. What’s the special? Hey, we all enjoy a good meal at a nice restaurant once in a while, just make the “while” a tad farther apart. Skip one night out a month, so you save perhaps $35, and you’ll be dining in luxury at age 65 with an additional $53,000. 9. Cash in hand. Literally, that is. This is my favorite strategy and maybe the easiest: Simply save your change. Let’s be conservative and say 75 cents a day goes into a jar. After 40 years, almost $35,000 will be in your bank account. 10. You betcha. News flash: You aren’t going to win the big lottery and those occasional $30 “pick four” wins will be easily offset by your losses. While reports vary, it seems adults spend an average $1,000 a year on state lotteries. Invest that in a surer thing and you’ll have $127,000 in retirement. Don’t laugh. I know some of these daily and monthly amounts are modest, but they add up. Saving and investing is possible for just about everyone. The power of compounding is real. Indeed, if you followed all 10 of my examples, you’d have some $870,000 after 40 years. This column was originally posted on Humble Dollar. It was republished here with permission. Richard Quinn blogs at QuinnsCommentary.com. Before retiring in 2010, Quinn was a compensation and benefits executive. Follow him on Twitter @QuinnsComments."}]}