{"article": [{"url": "https://www.marketwatch.com/story/vindman-lawyer-says-trump-forced-a-choice-between-adhering-to-us-law-and-pleasing-a-president-2020-07-08", "published": 1594223360.0, "headline": "Vindman lawyer says Trump forced a choice between adhering to U.S. law and pleasing a president", "body": "WASHINGTON (AP) — Lt. Col. Alexander Vindman, a national-security aide who played a central role in President Donald Trump’s impeachment case, announced his retirement from the Army on Wednesday with a scathing statement that accused the president of running a “campaign of bullying, intimidation, and retaliation.” The statement from attorney David Pressman said Vindman was leaving the Army after more than 21 years after it had been made clear “that his future within the institution he has dutifully served will forever be limited.” “Through a campaign of bullying, intimidation, and retaliation, the President of the United States attempted to force LTC Vindman to choose: Between adhering to the law or pleasing a President. Between honoring his oath or protecting his career. Between protecting his promotion or the promotion of his fellow soldiers,” read the statement, first obtained by CNN. Vindman’s name was on a promotion list sent to Defense Secretary Mark Esper earlier this year, according to one U.S. official familiar with the matter. But that list was delayed for weeks because the White House asked for an investigation of Vindman. The Pentagon did a review and found that any suggestion of misconduct was unfounded. The Margin:Vindman lawyer accuses Trump of ‘bullying, intimidation, and retaliation’ as lieutenant colonel announces Army retirement The official said the list was resent to Esper about a month ago, but again was delayed. The official spoke on condition of anonymity to discuss internal deliberations. Another official said Esper signed the promotion list this week, with Vindman’s name included. That list was expected to be sent to the White House by the end of the week, according to the defense official, who also spoke on condition of anonymity to discuss an internal personnel matter. It’s not clear whether Esper already knew of Vindman’s plan to retire before he signed the list. The U.S. official said there was talk more than a week ago that he was planning to put in his retirement papers. Pressman said Vindman “did what the law compelled him to do; and for that he was bullied by the President and his proxies.” “LTC Vindman’s patriotism,” he said, “has cost him his career. Today our country loses a devoted soldier, but it is incumbent upon all of us to ensure it does not lose the values he represents.” The White House and the Pentagon did not immediately respond to requests for comment. Trump in February ousted Vindman from his job on the National Security Council, where he served as an expert on Ukraine, just two days after the president’s acquittal by the Senate. Vindman’s lawyer said then that his client had been told to leave in retaliation for “telling the truth.” Vindman’s twin brother, Lt. Col. Yevgeny Vindman, was also asked to leave his job as a White House lawyer. Both men were reassigned to the Army. Vindman had testified that he didn’t think it was “proper” for Trump to “demand that a foreign government investigate” former Vice President Joe Biden and his son’s work for the energy company Burisma in Ukraine. And he told impeachment investigators that he twice raised concerns over the administration’s push to have Ukraine investigate the Bidens. In the aftermath, senior Pentagon leaders insisted that Vindman would not see any retaliation as a result of the testimony. Talking to reporters in November, Esper said the department has protections for whistleblowers. Vindman “shouldn’t have any fear of retaliation. That’s DOD’s position,” Esper said, adding that he flatly rejected suggestions that the soldier’s career was over. He said he had spoken with Army Secretary Ryan McCarthy about the matter. McCarthy said in February that Vindman was not under investigation, and that he was serving in a Army headquarters job and would go on to senior service college in the summer. In gripping testimony, Vindman also spoke of his family’s story and his father bringing them to the U.S. from the Soviet Union when he was a young child. “Dad, my sitting here today in the U.S. Capitol, talking to our elected officials, is proof that you made the right decision 40 years ago to leave the Soviet Union and come here to United States of America in search of a better life for our family,” he testified. “Do not worry, I will be fine for telling the truth.” The lieutenant colonel, who served in Iraq and later as a diplomat, wore his uniform full of medals, including a Purple Heart. When a soldier requests retirement, it must be approved by the Army’s Human Resources Command, and normally can take months to process before the person actually leaves the military. Read on:What every whistleblower needs to know about employer retaliation"}]}