{"article": [{"url": "https://www.marketwatch.com/story/heres-how-top-fund-managers-see-the-market-ahead-of-the-u-s-election-11599663710", "published": 1599739640.0, "headline": "Ahead of the U.S. election, hereâ\u0080\u0099s how top fund managers see the market risks and opportunities", "body": "Former vice-president Joe Biden (left) is polling ahead of President Donald Trump with less than two months until the election. Robyn Beck/Agence France-Presse/Getty Images Investors worldwide are racing to understand what the looming U.S. presidential election will mean for their portfolios, while also juggling a concoction of factors and risks in the meantime. The recent technology-driven rally, which helped Apple AAPL, +1.74% briefly gain a market value of more than $2 trillion for the first time and the S&P 500 SPX, +0.87% and Nasdaq COMP, +1.39% hit record highs, has abated in recent days. Ahead of Novemberâ\u0080\u0099s election, investors are trying to work out which sectors will profit â\u0080\u0093 or lose â\u0080\u0093 depending on whether President Donald Trump wins another term or hands the reins over to his Democratic rival Joe Biden. The majority of polls and the betting markets suggest Biden holds the advantage, although Trump has seemingly closed the gap in recent weeks. The Association of Investment Companies (AIC) gathered the views of some of the top London-listed fund managers to gauge their outlook ahead of the closely-watched race to the White House. Hereâ\u0080\u0099s what they had to say:How could the election affect your portfolio? Democratic presidential nominee Joe Biden has proposed raising the corporate tax rate from 21% to 28% â\u0080\u0093 partially reversing the Republican corporate tax cut of 2017. The tax hike is a move widely viewed as being potentially negative for stocks. The AICâ\u0080\u0099s fund managers seem to broadly agree, but said there were also positives to a potential Biden win. Read: Biden announces new â\u0080\u0098offshoring tax penaltyâ\u0080\u0099 and minimum tax on foreign earnings Robert Siddles, Manager of Jupiter U.S. Smaller Companies JUS, +1.49% : â\u0080\u009cThe prospect of a Democratic clean sweep should make investors nervousâ\u0080¦Higher corporate taxes and tighter labor regulation would adversely affect corporate profits.â\u0080\u009d â\u0080\u009cOne positive of Democrats in government, however, is that they tend to spend a lot, which is good for the economy in the short term at least. We are trying to make sure that companies in key areas that are affected by government regulation, such as health and education, are closely aligned with public policy,â\u0080\u009d he added. Fran Radano, Manager of The North American Income Trust NAIT, +1.79%, said while a Democratic win was currently being forecast, whether the party could wrestle control of the Senate was crucial to implementing its agenda. â\u0080\u009cIf both of these events were to happen, you would expect higher taxation on both corporations and high net worth individuals. Additionally, increased regulation in the financial, energy and utility sectors is likely.â\u0080\u009d Radano added: â\u0080\u009cConversely, a Biden presidency would likely entail more favorable outcomes for both global trade and immigration, which are important for the long-term health of the economy.â\u0080\u009dWhat are the key risks in U.S. equities? Zehrid Osmani, Manager of Martin Currie Global Portfolio Trust MNP, +0.57%, said areas of the economy facing â\u0080\u009chigh degrees of uncertaintyâ\u0080\u009d included transportation, tourism and hospitality sectors, while real estate was also at risk due to questions over office space usage. â\u0080\u009cThere is also a higher likelihood of increased tax levels, both corporate and household, in the mid-term, which could weigh on economic activity. We have therefore already taken the prudent approach of increasing our corporate tax rate assumptions in our financial projections for all companies that we hold in the portfolio.â\u0080\u009d Tony DeSpirito, Co-manager of BlackRock North American Income Trust BRNA, +0.32%, said: â\u0080\u009cThe lockdown-driven decline in economic activity and spike in unemployment has left the U.S. economy more vulnerable, at a time where U.S. stock valuations are high versus their long-term history.Â â\u0080\u009cThere is less room for bad news should downside risks emerge or investor sentiment wane. We are mitigating these risks by ramping up our stock-level stress testing, and have assumed long lasting adverse scenarios when conducting research on companies.â\u0080\u009d Gary Robinson and Helen Xiong, Managers of Baillie Gifford U.S. Growth Trust USA, +0.72%, said long-term equity returns were dominated by a small handful of exceptional growth companies delivering outsized returns. â\u0080\u009cIn our search for exceptional growth companies, we will make mistakes. But the asymmetry inherent in equity markets, where we can make far more in a company if weâ\u0080\u0099re right than lose if weâ\u0080\u0099re wrong, tells us that the costliest of mistakes is excessive risk aversion.â\u0080\u009dThe U.S. has rallied very strongly: is there further to go? Paul Niven, Manager of F&C Investment Trust FCIT, +0.56%, said that while current valuations leave little room for disappointment, the pandemic has accelerated many previous trends and consolidated the position of companies with strong financial and market positions. â\u0080\u009cLooking forward, while there are clearly numerous risks, the dominance of the U.S. market will likely continue.â\u0080\u009d Jupiter U.S. Smaller Companies manager Robert Siddles said: â\u0080\u009cAlthough the overheated large-cap tech sector could be due for profit taking, the market is just fine at the moment given Fed support. â\u0080\u009cIt is a common misconception that stock market valuation affects the marketâ\u0080\u0099s direction: the key drivers are monetary policy, investor sentiment (a contrary indicator) and profits growth â\u0080\u0093 as long as we have at least two of the three, the market will be inclined to rise.â\u0080\u009dWhere are you seeing opportunities? Jonathan Simon, Manager of JPMorgan American Investment Trust JAM, +0.18%, said: â\u0080\u009cOn the value side of the portfolio, we like Booking.com. In March this company was in the eye of the storm, however it has responded to the challenges of COVID-19 effectively, adjusting its cost structure to the new reality. We believe the unique proposition of Booking.com, which includes apartment bookings, as well as their subsidiaries Open Table and KAYAK, will be well-placed to emerge on the front foot from the downturn.â\u0080\u009d Tony DeSpirito, Co-manager of BlackRock North American Income Trust, said: â\u0080\u009cExposure to high-quality sectors with good trends such as technology and health care offer us long-term growth potential, at valuations which in many cases are justified by the potential. Sectors with more deeply discounted valuations like financials and energy offer potential for outperformance, but selectivity is key given the inherent risks.â\u0080\u009d"}]}