{"article": [{"url": "https://www.marketwatch.com/story/top-college-football-commissioners-meet-amid-growing-concerns-about-playing-in-fall-2020-08-09", "published": 1597016420.0, "headline": "Top college football commissioners meet amid growing concerns about playing in fall", "body": "The Power Five conference commissioners met Sunday to discuss mounting concern about whether a college football season can be played in a pandemic, and players took to social media to urge leaders to let them play. Big 12 Commissioner Bob Bowlsby said no decisions on the season have been made, but conceded the outlook has not improved. “Are we in a better place today than two weeks, ago?” he said. “No, we’re not.” Bowlsby cited “growing evidence and the growing pool of data around myocarditis.” Myocarditis is inflammation of the heart and it has been found in some COVID-19 patients. There is concern it could be a long-term complication of contracting the virus even in young, healthy people, a group that has usually avoided severe cardiovascular symptoms. Also Sunday night, the Big Ten’s university presidents and chancellors held a previously unscheduled meeting, a person with knowledge of the meeting told The Associated Press. The person spoke on condition of anonymity because the meeting was not announced by the conference. Another person with direct knowledge of the meeting speaking on condition of anonymity said no votes were taken or decisions made about the college football season. The final call on whether major college football will played this season rests in the hands of the university presidents who oversee the largest conferences. All this activity comes a day after the Mid-American Conference became the first among 10 leagues that play at the highest tier of Division I college football to cancel fall sports because of concerns about keeping athletes from contracting and spreading COVID-19. The MAC’s decision came less than a month before the first games are scheduled to be played and raised questions if other conferences might follow. Also on Saturday, the Big Ten slowed its ramp up to the season, announcing its teams would not be permitted to start full contact practices until further notice. The Big Ten season is scheduled to start Labor Day weekend. Meanwhile, college football players took to social media Sunday to push for the season to go on, led by Clemson quarterback Trevor Lawrence with a series of tweets. “People are at just as much, if not more risk, if we don’t play,” Lawrence tweeted. “Players will all be sent home to their own communities where social distancing is highly unlikely and medical care and expenses will be placed on the families if they were to contract covid19.” Penn State tight end Pat Freiermuth had a similar message. “Since day one coming back to campus the Penn State Football staff and medical experts have put our health and safety first, above anything else,” he tweeted. “The guidelines put into place keep us safe while playing the game we love. We are ready to play and we want to play.” Other players tweeted with the hashtag #WeWantToPlay. The parents of Ohio State football players weighed in, too, posting a letter saying they were confident in the university’s plan to keep their sons safe. “We believe that this age group represents some of the healthiest individuals, while we recognize the risk cannot be eliminated, we believe the risk is minimal and the season can safely and responsibly occur,” wrote the Football Parents Association at Ohio State. Notre Dame athletic director Jack Swarbrick said he has heard the same from Fighting Irish football players. Notre Dame has had only two COVID-19 cases since it began testing athletes. “I’ve been around our guys and they thinks it’s safe and they want to try and play,” Swarbrick said. “If we change course, we better be able to articulate the reason for doing so to our student-athletes. They are going to want to know why.”"}]}