{"article": [{"url": "https://www.marketwatch.com/story/joe-biden-picks-kamala-harris-for-vp-heres-how-trump-and-other-politicians-are-reacting-2020-08-11", "published": 1597169540.0, "headline": "Joe Biden picks Kamala Harris for VP: Here's how Trump and other politicians are reacting", "body": "Ready or not, here comes #BidenHarris2020. Presumptive Democratic presidential nominee Joe Biden made history on Tuesday by selecting Sen. Kamala Harris of California as his running mate against President Donald Trump and Vice President Mike Pence in the November election. Read more: Joe Biden picks Kamala Harris as his running mate Harris, 55, is the first Black woman and the first person of Indian descent ever nominated for national office by a major political party. She's also not one to pull any punches, such as when she attacked Biden's record on race during a June 2019 Democratic presidential. Biden acknowledged as much in his tweet announcing her as his pick, calling her a \"fearless fighter\" and recalling how she worked closely with his late son, Beau. iframe.twitter-tweet { width: 100% !important; } Harris responded that Biden can unify the country \"because he's spent his life fighting for us,\" adding she is \"honored\" to join him in his campaign for the White House. iframe.twitter-tweet { width: 100% !important; } Clearly, Biden's announcement electrified politicians and voters on both sides of the aisle on social media on Tuesday afternoon, with their presidential ticket topping Google GOOG, +1.97%  searches and sending hashtags like #BidenHarris2020 trending on Twitter TWTR, -0.23%. The Trump camp was ready with an attack ad. Trump tweeted out a video that referred to his Democratic rivals as \"Slow Joe\" and \"Phony Kamala,\" stating they are \"Perfect together. Wrong for America.\" iframe.twitter-tweet { width: 100% !important; } In turn, the Lincoln Project - a super PAC run by current and former Republican and conservative political strategists who are working to keep Trump from being reelected - were ready with their own ad, which praised Harris as \"a strong voice for a better America; daughter of immigrants, a passion for justice.\" iframe.twitter-tweet { width: 100% !important; } Opinion: Why Joe Biden's pick of Kamala Harris for vice president won't make or break the 2020 election Former President Barack Obama tweeted out an official statement, as well. \"This is a good day for our country,\" he wrote. \"Now let's go win this thing.\" iframe.twitter-tweet { width: 100% !important; } Check out some of the responses from other politicians and pundits below. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Former vice presidential candidate Sarah Palin, who ran unsuccessfully with John McCain against Obama and Biden in 2008, also shared some advice on Instagram FB, +0.26%  for the next female VP nominee to \"climb upon Geraldine Ferraro's and my shoulders.\" What's more, after actress and comedian Maya Rudolph's convincing turn portraying Harris on \"Saturday Night Live\" during the Democratic nomination process last year, many on Twitter dubbed Harris' appointment as a win for Rudolph and the Comcast-owned CMCSA, -0.99%  \"SNL,\" as well. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } As for Rudolph's response? \"Oh s---,\" she told EW. Follow more of MarketWatch's election coverage here."}]}