{"article": [{"url": "https://www.marketwatch.com/story/eurozone-economy-barely-grew-in-september-pmi-data-show-11600848321", "published": 1600853120.0, "headline": "Eurozone economy barely grew in September, PMI data show", "body": "People pass by a store of women's ready-to-wear clothing retailer Camaieu in a shopping mall in Rennes, France, on August 18, 2020. damien meyer/Agence France-Presse/Getty Images The economic recovery in the eurozone took a hit in September after a new rise in coronavirus cases, according to purchasing managers data released on Wednesday. The IHS Markit flash eurozone manufacturing purchasing managers index rose to 53.7 from 51.7, while the flash eurozone services PMI fell to 47.6 from 51.9. Taken together, the composite PMI just barely was above the 50 mark indicating improving conditions, at 50.1. iframe.twitter-tweet { width: 100% !important; } Economists expected a eurozone manufacturing PMI of 51.9 and a services PMI of 50.5. The composite French PMI fell below the 50 mark for the first time in four months, while Germany’s slowed but stayed above 50. ”A two-speed economy is evident, with factories reporting that production growth was buoyed by rising demand, notably from export markets and the reopening of retail in many countries, but the larger service sector has sunk back into decline as face-to-face consumer businesses in particular have been hit by intensifying virus concerns,” said Chris Williamson, chief business economist at IHS Markit. The IHS/Markit/CIPS flash U.K. composite PMI fell to a 3-month low of 55.7. While that is a much stronger level than the eurozone figures, the U.K. had a worse second quarter. There were widespread reports that a lack of consumer confidence and persistent disruptions to business operations due to the pandemic had held back the recovery in September, IHS Markit said. “It was not surprising to see that the slowdown was especially acute in services, where the restaurant sector in particular saw demand fall sharply as the Eat Out to Help Out scheme was withdrawn. Demand for other consumer-facing services also stalled as companies struggled amid new measures introduced to fight rising infection rates and consumers often remained reluctant to spend,” said Williamson. The data didn’t have a big impact on financial markets, with the pound GBPUSD, +0.83% having already been hit over the last few days due to new restrictions imposed by the U.K. government. Economists caution that the PMI data might be difficult to interpret, on the theory that purchasing managers are really answering the question of their current production vs. normal times, and not versus the previous month. “For example, the sharp gyrations in the French composite PMI from a surprisingly strong 57.3 in July to a soft 48.5 in September probably reflects a serious turn in sentiment – from a relief that life is normalising (July) to renewed concerns (September) more than a huge swing in output from rapid growth to contraction,” said economists at Berenberg Bank."}]}