{"article": [{"url": "https://www.marketwatch.com/story/powell-to-speak-next-thursday-on-feds-new-inflation-friendly-strategy-11597951135", "published": 1597942280.0, "headline": "Powell to speak next Thursday on Fedâ\u0080\u0099s new inflation-friendly strategy", "body": "Fed Chairman Jerome Powell speaks during a virtual news conference last month seen on a laptop computer. Bloomberg News Fed Chairman Jerome Powell will speak next Thursday on how the central bank plans to achieve its twin goals of stable prices and maximum employment once the coronavirus pandemic has ended. The Fed has spent the past year reviewing its â\u0080\u009cmonetary policy framework.â\u0080\u009d The results were expected earlier this year but the process was derailed by the outbreak of COVID-19, which pushed the economy into its deepest post-war recession. But Fed officials want to move forward and codify changes to their strategy, based on what theyâ\u0080\u0099ve learned since 2012. Thatâ\u0080\u0099s when the Fed formally adopted a 2% inflation target. Since then, inflation has remained stubbornly below the target even as the economy was enjoying the longest expansion on record and the unemployment rate approached its lowest level in 50 years. Powell will deliver his remarks to the annual Jackson Hole, Wyo., economic symposium held by the Kansas City Fed. His remarks will be at 9 a.m. Eastern on Aug. 27. Usually, the event allows Fed officials and their guests to meet in the shadow of the Grand Teton mountains to enjoy fly-fishing and hiking. The event is being held virtually this year, and for the first time the proceedings will be open to the public on the regional Fed bankâ\u0080\u0099s YouTube page. Fed watchers think the central bank has decided to end the practice of raising interest rates at the first whiff of higher inflation. Under a new strategy, the Fed will allow inflation to run hot for a time â\u0080\u0094 to make up for the time that inflation was below the 2% target. This policy is called â\u0080\u009cinflation-averaging.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } In the past, the Fed didnâ\u0080\u0099t pay attention to where inflation had been, preferring to let bygones be bygones. Supporters of the practice think this will give investors confidence that the Fed will hit its 2% target. Other central banks, notably the Bank of Japan, have struggled to push inflation higher. Too-low inflation can be just as bad as too-high inflation, economists say. When inflation is low or falling, consumers hold off purchases waiting for lower prices. This weakens the economy and can start a downward spiral. Many Wall Street economists think the Fed has already adopted this strategy in practice. In remarks to reporters in July, Powell agreed. â\u0080\u009cTo a large extent, weâ\u0080\u0099re already doing the things that are in there,â\u0080\u009d Powell said. The central bank rejected a more radical idea of raising its inflation target to 4% as some prominent economists had suggested. Another idea discarded was pushing the Fedâ\u0080\u0099s benchmark rate into negative territory. At the moment, the economy is struggling to regain its footing. The Fedâ\u0080\u0099s interest rate is stuck at zero. One point of the framework review was the give the Fed more robust powers in this situation, noted David Beckworth, a senior research fellow at the Mercatus Center at George Mason University. iframe.twitter-tweet { width: 100% !important; }"}]}