{"article": [{"url": "https://www.marketwatch.com/story/social-security-could-be-vulnerable-under-president-trumps-plan-for-payroll-taxes-2020-08-10", "published": 1597240640.0, "headline": "Social Security could be vulnerable under President Trumpâ\u0080\u0099s plan for payroll taxes", "body": "President Trumpâ\u0080\u0099s executive order to defer payroll taxes may not hurt Social Security â\u0080\u0094 that is, if everything goes perfectly right, everyone pays back the money they owe and no plans change whatsoever. That may not happen, some economists say. As it stands, the executive order the president signed on Saturday says employers will be allowed to defer employeesâ\u0080\u0099 payroll taxes until Dec. 31 if they earned $104,000 or less. In a press conference Saturday night, the president said the order will be retroactively effective, beginning Aug. 1. Employees therefore may see extra money in their paychecks â\u0080\u0094 money which would normally be paid toward Social Security. (Employers have the option to ignore this order and continue withholding taxes as is, as they are ultimately responsible for their employeesâ\u0080\u0099 share.) See: Paul Krugman: Trumpâ\u0080\u0099s payroll tax cut is â\u0080\u0098the hydroxychloroquine of economic policyâ\u0080\u0099 But because itâ\u0080\u0099s a deferral â\u0080\u0094 not a cut â\u0080\u0094 those taxes will still be owed eventually. This could be good news for Social Security, since the money will still be paid into the trust funds (albeit delayed) and bad news for Americans who planned to keep the â\u0080\u009cbonusâ\u0080\u009d money from their paychecks to spend or pay down debts. When they would have to pay back the money is unclear â\u0080\u0094 it could be at the end of the year when the executive order expires, or during tax time next year. Employersâ\u0080\u0099 share of the payroll tax was deferred during the CARES Act. â\u0080\u009cThat means your tax liability accrues this calendar year and you owe all of that in a lump sum,â\u0080\u009d said Kathleen Romig, senior policy analyst at the Center on Budget and Policy Priorities, a progressive think tank. â\u0080\u009cThat is going to be a very unpleasant surprise.â\u0080\u009d As a deferral, and when all of the money is replaced, Social Security will not be substantially impacted. It may lose some of the interest it would have generated over the next couple of months, but it will still have the money it was initially owed, Romig said. Social Security will, however, be impacted if anything deviates from this current plan. Employees will need to have the money ready to pay back and employers will need all the logistics figured out for their payroll and paperwork â\u0080\u0094 assuming theyâ\u0080\u0099re still in business. â\u0080\u009cThe big question is will they recoup all of that?â\u0080\u009d Romig said. Businesses are defaulting because of the pandemic and Americans may need to use the money they receive from this deferral if theyâ\u0080\u0099re living paycheck to paycheck (as many people were even before the crisis began). Also see: Trumpâ\u0080\u0099s payroll-tax executive order could boost the stock market Thereâ\u0080\u0099s also a good chance the president will persuade Congress to shift this deferral into a full tax cut, said Andrew Biggs, a resident scholar at the American Enterprise Institute, a conservative think tank. If that were to happen, the program could lose roughly $150 billion from lost funding between now and Dec. 31, he estimated. Congress would likely vote to back-pay the trust fund with the general revenue, just as it had done after the financial crisis. President Obama had a payroll-tax holiday in 2011 and 2012 in response to the Great Recession. The cut was 2% for two years, and would have cost the equivalent of $300 billion to Social Security in todayâ\u0080\u0099s dollars. Congress paid back the trust funds with general revenue. â\u0080\u009cThe solvency date â\u0080\u0094 thatâ\u0080\u0099s something politicians are very sensitive to,â\u0080\u009d Biggs said. â\u0080\u009cThe issue is if this is a true payroll tax cut for workers or just a deferral â\u0080\u0094 and that we donâ\u0080\u0099t really know right now.â\u0080\u009d President Trump said over the weekend if he were reelected he would look into making payroll tax cuts permanent, but he alone does not have the authority to do that, Romig said. Congress has the authority to make changes to the tax laws, and many politicians for both the Democrats and Republicans have said they do not support a permanent payroll tax cut. â\u0080\u009cThatâ\u0080\u0099s why this is just deferred,â\u0080\u009d she said. â\u0080\u009cHe doesnâ\u0080\u0099t have the power to make up tax rules.â\u0080\u009d"}]}