{"article": [{"url": "https://www.marketwatch.com/story/mortgage-rates-drop-to-another-record-low-but-heres-why-americans-should-think-twice-about-waiting-to-lock-them-in-2020-06-18", "published": 1592815460.0, "headline": "Mortgage rates drop to another record low - here's why Americans may not want to wait too much longer before locking rates in", "body": "Mortgage rates have fallen to a new all-time low for the fourth time this year. But there's significant upside risk to the low rate environment, and Americans may not want to wait too much longer before locking rates in. The 30-year fixed-rate mortgage averaged 3.13% for the week ending June 18, down eight basis points from a week earlier, Freddie Mac FMCC, +0.52%  reported Thursday. The previous record low was 3.15% back at the end of May. A year ago, the 30-year home loan averaged 3.84%. The 15-year fixed-rate mortgage dropped four basis points to an average rate of 2.58%. The 5-year Treasury-indexed hybrid adjustable-rate mortgage dipped one basis point to 3.09%. \"Mortgage rates have hit another record low due to declining inflationary pressures, putting many home buyers in the buying mood,\" Freddie Mac's chief economist Sam Khater said in the report. The interest rates on home loans roughly track the direction of long-term bond yields, including the 10-year Treasury note. The 10-year Treasury yield TMUBMUSD10Y, 0.777%  has seesawed over the past week in response to weakness in the stock market driven by concerns about the rise in coronavirus infections across many parts of the country. Don't miss:Americans are eyeing homes in the suburbs as pent-up demand hits housing market \"Upticks in coronavirus cases across the country left market participants skeptical of the economic recovery's sustainability,\" said Matthew Speakman, an economist with Zillow ZG, -0.42%  . \"This sparked a sell-off in stocks and a flight to the safe haven of bonds - something that normally pushes mortgage rates lower.\" “ 'Rates could just as easily begin to trend upward again, particularly if key economic data or measures to contain or treat the virus show meaningful improvements. ” - Matthew Speakman, an economist with Zillow But now the mortgage market is at a turning point, Speakman said. And it all depends on what happens with the spread of COVID-19 from here on out. \"More bad news regarding the uptick in coronavirus cases would likely send rates back downward, possibly to new lows,\" Speakman said. \"However, rates could just as easily begin to trend upward again, particularly if key economic data or measures to contain or treat the virus show meaningful improvements.\" Rates going up could spell trouble for the broader housing market. Eager to lock in the cheap financing, buyers have flocked to apply for home loans to purchase property. There's evidence that the low rates, coupled with pent-up demand caused by the coronavirus stay-at-home orders, is driving a significant recovery across the housing market. An increase in rates would hamper the housing market's ability to rebound. But it's not the only headwind the market is facing. \"It would be difficult to sustain the momentum in demand as unsold inventory was at near record lows coming into the pandemic and it has only dropped since then,\" Khater said. In other words, with very few homes for sale, there's a rather low ceiling on how high sales activity can go for the foreseeable future."}]}