{"article": [{"url": "https://www.marketwatch.com/story/u-k-stocks-fall-as-big-names-trade-without-dividend-rights-and-travel-operator-tui-tumbles-11597324579", "published": 1597310660.0, "headline": "U.K. stocks fall as big names trade without dividend rights and travel operator Tui tumbles", "body": "London-listed travel operator Tui posted a €1.4 billion net loss in the third quarter. philippe huguen/Agence France-Presse/Getty Images U.K. stocks slid on Thursday, as some of the biggest names traded without rights to their dividend and travel operator Tui tumbled after posting heavy losses. After surging 2% on Wednesday, the FTSE 100 UKX, +0.64% gave back some of those gains, falling 1.4%. The blue-chip index was hit by a number of major stocks going ‘ex-dividend’ — meaning that investors who buy the stock from today aren’t entitled to the company’s next dividend payment. Oil giants BP BP, +0.56% and Shell RDSA, +2.08%, pharmaceuticals AstraZeneca AZN, +0.63% and GlaxoSmithKline GSK, +1.52% and drinks company Diageo DGE, -0.27% were among the stocks who went ex-dividend on Thursday, dragging the index lower. The FTSE 250 MCX, +0.71% index slipped 0.8%, while the pound GBPUSD, +0.83% rose 0.4% against the U.S. dollar, despite the U.K. economy’s record plunge in the second quarter. Signs of a recovery, with the economy bouncing back 8.7% in June, have offered hope that the U.K.’s recession may be short lived. U.S. stocks DJIA, +0.56% SPX, +0.87% COMP, +1.39% were mixed after the open as U.S. jobless claims data showed that initial claims for unemployment benefits declined to 963,000—the lowest number since the pandemic took hold. Economists had expected 1.1 million new claims. Stocks in focus London-listed travel operator Tui TUI, -0.92% was among the sharpest fallers in the U.K., as the German company swung to a €1.4 billion net loss in the third quarter. Tui, which was demoted to the FTSE 250 earlier this year, said dividend payments and share buybacks will be restricted to the term of the €1.2 billion stabilization package announced on Wednesday with the German government. The company said bookings for next summer were up 145%."}]}