{"article": [{"url": "https://www.marketwatch.com/story/red-robin-gourmet-burgers-cut-55-menu-items-due-to-coronavirus-and-doesnt-plan-to-bring-them-back-2020-06-10", "published": 1592210660.0, "headline": "Red Robin Gourmet Burgers cut 55 menu items due to coronavirus and doesn't plan to bring them back", "body": "Red Robin Gourmet Burgers Inc. cut 55 items from its menu due to the coronavirus outbreak, and now the restaurant chain said it won't be bringing those dishes back. With dining rooms closed after lockdown orders nationwide, Red Robin RRGB, +2.75%  like other restaurant companies, had to make adjustments to operate as a takeout and delivery business. One strategy at Red Robin was to reduce options on the menu. \"Our execution has also been enhanced by a simplified menu with one-third fewer items, yielding little-to-no negative guest feedback,\" said Paul Murphy III, chief executive of Red Robin, on the first-quarter earnings call, according to a FactSet transcript. \"Reducing our menu by 55 items has facilitated improved back-of-the-house speed and efficiency as restaurants have adjusted to reduced staffing levels and has improved food quality with consistency. Given this success, we plan to leverage a simplified menu as part of our ongoing business plan.\" See:Soaring demand for Campbell Soup products drove blowout earnings but also created inventory problems Murphy listed the benefits of the shorter menu, which cut across different parts of the business. \"We're seeing that really impact guest experience from faster cook times to higher quality food,\" he said, adding that the food is hotter when it gets to customers. \"We're seeing a reduction on the waste side. And we believe that, over time, it will help us on the supply chain side, as we have less SKUs [stock-keeping units] that we're having to manage and worry about the velocity to the distribution houses.\" Red Robin reported a first-quarter adjusted per-share loss of $6.66, well below the FactSet consensus for a loss of $1.34. Revenue of $306.1 million was just ahead of the FactSet consensus for $306.0 million. Shares sank nearly 14% in Wednesday trading after the results. Murphy said the company's carryout business is now its strongest, accounting for 62% of sales. The company now has about 270 dining rooms open, though they're seating up to half capacity. Red Robin had 554 restaurants as of April 19. Rethinking the menu is one of the major considerations for restaurants post-coronavirus, said Joe Jackman, chief executive of customer engagement company Jackman Reinvents. And:Hormel says the value of products like Spam and Skippy peanut butter rose alongside the unemployment rate \"Restaurants have already had to adapt to supply challenges, new traffic patterns (no lunch rush while schools and offices are shut down), shifting desires (think comfort food), and the reality of delivery (certain food just doesn't travel well),\" he said. Jackman compiled a list of suggestions for restaurants based on proprietary research. \"The current economic situation will also have an ongoing effect-88% of people we surveyed say the pandemic has had an impact on their financial situation, 49% realize that cooking at home is cheaper, and more than half expect to go to restaurants less frequently. Be flexible and don't be afraid to test recipes and price points to see what sticks.\" Other suggestions include offering meal kits, which have soared since the start of the pandemic, and make the new required face masks part of the restaurant uniform. Red Robin also began adding Donato's pizza at the beginning of the year, but put further rollouts on hold as part of its cost-cutting measures during the pandemic. Red Robin purchased equipment for 40 restaurants in the Seattle market. Don't miss:Hormel's $1 billion debt deal sees demand amid COVID-19 battle at meat processing plants Restaurants with the pizza option have outperformed others by 650 basis points, Murphy said. \"These restaurants have also experienced a 3.5% higher average check relative to restaurants that do not offer Donato's,\" he said. \"We look forward to continuing to expand our Donato's rollout in the future with a proven and compelling return on investment.\" Pizza chains, including Domino's Pizza Inc. DPZ, -2.50%  , Papa John's International Inc. PZZA, -1.18%  and Yum Brands Inc.'s YUM, +0.08%  Pizza Hut have fared well during the pandemic. \"While sales are improving as the company reopens dining rooms, they continue to lag broader industry trends (in part due to geographic footprint) and have yet to achieve breakeven profitability,\" wrote Raymond James analysts. Raymond James rates Red Robin stock market perform. Red Robin stock rallied 6% on Friday and has tumbled 62.8% for the year to date. The S&P 500 index SPX, +0.87%  is down 5.9% for the period."}]}