{"article": [{"url": "https://www.marketwatch.com/story/americans-worry-the-economy-will-suffer-for-a-long-timebut-it-hasnt-stopped-them-from-spending-2020-08-15", "published": 1597501520.0, "headline": "Americans worry the economy will suffer for a long time-but it hasn't stopped them from spending", "body": "If we go by what Americans feel, the economy stinks. If we go by the activity of average Americans, the economy is getting better. Which view is more accurate? Both. The economy is slowly on the mend after being devastated by the coronavirus pandemic. Yet millions are unemployed, people are still mostly stuck at home and the virus id far from eradicated after nearly a half-year of social-distancing protocols. No wonder people are pessimistic. The pessimism came through loud and clear from the most recent survey of consumer sentiment in August. It rose slightly, but was just barely above April's pandemic low. Most U.S. residents think it will take at least five years for the economy to normalize. At the same time, though, Americans have tried to get on with their lives. Sales at U.S. retailers, for example, rose in July for the third straight month even as the coronavirus rank amok in states such as California, Texas and Florida. Amazingly, retail sales are higher now than they were before the pandemic began. Few on Wall Street predicted such an outcome just a few months ago. Read: Retail sales climb again-and exceed precrisis levels What's far from clear, however, is whether consumers can keep spending at current levels. A $600 federal unemployment stipend and other government emergency-aid programs expired at the end of July and haven't been reauthorized. On top of that, talks are going nowhere between Democrats and Republicans over how much to spend and on what. Lawmakers are now in recess until Labor Day. \"With congressional talks deadlocked, the odds of a genuine stimulus being enacted ahead of the election are falling,\" said chief U.S. economist Paul Ashworth of Capital Economics. Read: Jobless claims fall below 1 million for first time since start of coronavirus pandemic And: Did the expired $600 federal jobless benefit keep people from going back to work? That's a big deal. Consumer spending was underpinned amid the pandemic by massive federal aid. Without that money, household incomes likely will fall by tens of billions of dollars in August alone. Even a $300 temporary federal benefit ordered by President Trump won't be enough. And it isn't certain that Trump's executive orders won't be met with legal challenges and other complications that would impede money finding its way into the hands of out-of-work Americans. \"With tens of millions of consumers set to see their incomes drop by $600 per week, that will undoubtedly have some impact on consumption,\" said chief economist Curt Long of the National Association of Federally-Insured Credit Unions. If lower incomes result in fewer sales at retailers, restaurants and other businesses, they could cut more jobs. \"If the economy doesn't pick up, you are going to see a lot more firms laying people off or stop hiring,\" said chief economist Scott Brown of Raymond James. \"We are still seeing job destruction.\" Another big setback for the U.S. labor market would just put more pressure on the economy and on politicians to do something to alleviate the pain. That said, don't expect lawmakers to do much this week, though. The Democratic and Republican conventions, taking place in abbreviated, virtual form, are scheduled for the next two weeks. The economic calendar, what's more, is very light this week and lacks any significant catalysts that might light a fire under Congressional lawmakers to act sooner. Read: 'A massive welfare economy' - federal aid prevents even steeper GDP collapse Weekly jobless claims take center stage again and the Federal Reserve will release the cliff notes of its last big meeting on the economy. Guess what? They are worried. And many of those policy makers have been insistent that fiscal stimulus is a key pillar of the next phase of the economy's recovery after the Fed has doled out trillions to prop up financial markets. Also worth watching: A pair of regional manufacturing surveys of the New York and Philadelphia regions. They'll give more clues on whether the revival in heavy industry accelerated in August, as is likely. In the absence of unanimity in Washington, that is probably all that can be expected. Slow, halting progress, punctuated by occasional setbacks. It could be worse-but it could also be better."}]}