{"article": [{"url": "https://www.marketwatch.com/story/theyre-buying-bikes-like-toilet-paper-pandemic-leads-to-a-bicycle-boom-shortage-2020-06-15", "published": 1592219720.0, "headline": "â\u0080\u0098Theyâ\u0080\u0099re buying bikes like toilet paperâ\u0080\u0099 â\u0080\u0094 pandemic leads to a bicycle boom, shortage", "body": "PORTLAND, Maine (AP) â\u0080\u0094 Fitness junkies locked out of gyms, commuters fearful of public transit, and families going stir crazy inside their homes during the coronavirus pandemic have created a boom in bicycle sales unseen in decades. In the United States, bicycle aisles at mass merchandisers like Walmart WMT, +1.00% Â and TGT, +1.14% Â have been swept clean, and independent shops are doing a brisk business and are selling out of affordable â\u0080\u009cfamilyâ\u0080\u009d bikes. Bicycle sales over the past two months saw their biggest spike in the U.S. since the oil crisis of the 1970s, said Jay Townley, who analyzes cycling industry trends at Human Powered Solutions. â\u0080\u009cPeople quite frankly have panicked, and theyâ\u0080\u0099re buying bikes like toilet paper,â\u0080\u009d Townley said, referring to the rush to buy essentials like toilet paper and hand sanitizer that stores saw at the beginning of the pandemic. The trend is mirrored around the globe, as cities better known for car-clogged streets, like Manila and Rome, install bike lanes to accommodate surging interest in cycling while public transport remains curtailed. In London, municipal authorities plan to go further by banning cars from some central thoroughfares. Bike shop owners in the Philippine capital say demand is stronger than at Christmas. Financial incentives are boosting sales in Italy, where the governmentâ\u0080\u0099s post-lockdown stimulus last month included a 500-euro ($575) â\u0080\u009cbici bonusâ\u0080\u009d rebate for up to 60% of the cost of a bike. But thatâ\u0080\u0099s if you can get your hands on one. The craze has led to shortages that will take some weeks, maybe months, to resolve, particularly in the U.S., which relies on China for about 90% of its bicycles, Townley said. Production there was largely shut down due to the coronavirus and is just resuming. The bicycle rush kicked off in mid-March around the time countries were shutting their borders, businesses were closing, and stay-at-home orders were being imposed to slow the spread of the coronavirus that has infected millions of people and killed more than 450,000. Sales of adult leisure bikes tripled in April while overall U.S. bike sales, including kidsâ\u0080\u0099 and electric-assist bicycles, doubled from the year before, according to market research firm NPD Group, which tracks retail bike sales. Itâ\u0080\u0099s a far cry from what was anticipated in the U.S. The $6 billion industry had projected lower sales based on lower volume in 2019 in which punitive tariffs on bicycles produced in China reached 25%. There are multiple reasons for the pandemic bicycle boom. Around the world, many workers were looking for an alternative to buses and subways. People unable to go to their gyms looked for another way to exercise. And shut-in families scrambled to find a way to keep kids active during stay-at-home orders. â\u0080\u009cKids are looking for something to do. Theyâ\u0080\u0099ve probably reached the end of the internet by now, so youâ\u0080\u0099ve got to get out and do something,â\u0080\u009d said Dave Palese at Gorham Bike and Ski, a Maine shop where there are slim pickings for family-oriented, leisure bikes. Bar Harbor restaurateur Brian Smith bought a new bike for one of his daughters, a competitive swimmer, who was unable to get into the pool. On a recent day, he was heading back to his local bike shop to outfit his youngest daughter, whoâ\u0080\u0099d just learned how to ride. His three daughters use their bikes every day, and the entire family goes for rides a couple of times a week. The fact that theyâ\u0080\u0099re getting exercise and enjoying fresh air is a bonus. â\u0080\u009cItâ\u0080\u0099s fun. Maybe thatâ\u0080\u0099s the bottom line. Itâ\u0080\u0099s really fun to ride bikes,â\u0080\u009d Smith said as he and his 7-year-old daughter, Ellery, pedaled to the bicycle shop. The pandemic is also driving a boom in electric-assist bikes, called e-bikes, which were a niche part of the overall market until now. Most e-bikes require a cyclist to pedal, but electric motors provide extra oomph. VanMoof, a Dutch e-bike maker, is seeing â\u0080\u009cunlimited demandâ\u0080\u009d since the pandemic began, resulting in a 10-week order backlog for its commuter electric bikes, compared with typical one-day delivery time, said co-founder Taco Carlier. The companyâ\u0080\u0099s sales surged 138% in the U.S. and rocketed 184% in Britain in the February-April period over last year, with big gains in other European countries. The company is scrambling to ramp up production as fast as it can, but it will take two to three months to meet the demand, Carlier said. â\u0080\u009cWe did have some issues with our supply chain back in January, February when the crisis hit first in Asia,â\u0080\u009d said Carlier. But â\u0080\u009cthe issue is now with demand, not supply.â\u0080\u009d Sales at Cowboy, a Belgian e-bike maker, tripled in the January-April period from last year. Notably, they spiked in Britain and France at around the same time in May that those countries started easing lockdown restrictions, said Chief Marketing Officer Benoit Simeray. â\u0080\u009cItâ\u0080\u0099s now becoming very obvious for most of us living in and around cities that we donâ\u0080\u0099t want to go back into public transportation,â\u0080\u009d said Simeray. But people may still need to buy groceries or commute to the office one or two days a week, so â\u0080\u009cthen theyâ\u0080\u0099re starting to really, really think about electric bikes as the only solution theyâ\u0080\u0099ve got.â\u0080\u009d In Maine, Kate Worcester, a physicianâ\u0080\u0099s assistant, bought e-bikes for herself and her 12-year-old son so they could have fun at a time when she couldnâ\u0080\u0099t travel far from the hospital where she worked. Every night, she and her son ride 20 miles or 30 miles (30 or 50 kilometers) around Acadia National Park. â\u0080\u009cItâ\u0080\u0099s by far the best fun Iâ\u0080\u0099ve had with him,â\u0080\u009d she said. â\u0080\u009cThatâ\u0080\u0099s been the biggest silver lining in this terrible pandemic â\u0080\u0094 to be able to leave work and still do an activity and talk and enjoy each other.â\u0080\u009d Joe Minutolo, co-owner of Bar Harbor Bicycle Shop, said he hopes the sales surge translates into long-term change. â\u0080\u009cPeople are having a chance to rethink things,â\u0080\u009d he said. â\u0080\u009cMaybe weâ\u0080\u0099ll all learn something out of this, and something really good will happen.â\u0080\u009d"}]}