{"article": [{"url": "https://www.marketwatch.com/story/westwater-resources-stock-rockets-again-on-massive-volume-as-company-praises-president-trumps-executive-order-11601919966", "published": 1601969240.0, "headline": "Westwater Resources stock rockets again on massive volume as company praises President Trump's executive order", "body": "Westwater Resources Inc. Shares of Westwater Resources Inc. rocketed Monday on heavy volume, again, as the battery-materials company praised the recent executive order signed by President Donald Trump supporting the development of a U.S. supply of graphite. The stock WWR, +2.56% shot up 87.3% to $8.28, as it rose for an eighth-straight session to the highest closing price since April 2019. Trading volume ballooned to a record 200.6 million shares, compared with the full-day average of about 9.3 million shares, and enough to make it the most active stock on the Nasdaq exchange. On Friday, the stock had run up 49.3% on volume of 101.7 million shares, after climbing 17.9% on 29.4 million shares the day before. In premarket trading on Tuesday, the stock soared 49%, which puts it on track to open at the highest price seen during regular-trading hours since November 2018. A ninth-straight gain would mark the longest win streak since the 10-day stretch that ended Dec. 1, 2010. The company said before Monday's open that it \"applauds\" Trump's executive order, signed Sept. 30, which addresses the threat to the U.S. supply chain from reliance on critical materials from foreign adversaries. Westwater said the U.S. is 100% dependent on imports for graphite, which is the primary material used in lithium-ion batteries that help power smartphones, laptops and electric vehicles, and help store power from renewable energy sources. The U.S. is heavily dependent on China for its graphite supply, as China produces more than 60% of the world's graphite, according to the order. \"The President's Executive Order opens up new avenues for financing and permitting our Coosa Graphite Project - this is good news for Westwater Resources and the United States,\" said Westwater Chief Executive Christopher Jones. The company's plan for its Coosa Graphite Deposit in east-central Alabama is to develop a U.S. domestic supply for natural graphite for use in all types of batteries. The President's order requires certain government agencies to provide guidance in determining which projects are eligible for government support, which can include loans or grants. The agencies are also directed to use available authorities to accelerate the issuance of permits in connection with the expansion the supply chain for specified minerals. Westwater said it is now evaluating the President's order, and how to emphasize to the appropriate government agencies, how its Coosa Graphite Project in Alabama fits into the enactment of the order. The stock had closed at a record low of 95 cents on March 16, then matched that close as recently as April 2. After soaring nearly sixfold (up 495.7%) during its current win streak, the stock has now soared 292.4% year to date through Monday. In comparison, the SPDR Materials Select Sector exchange-traded fund XLB, +0.77% has gained 5.0% this year while the S&P 500 index SPX, +0.87% has advanced 5.5%."}]}