{"article": [{"url": "https://www.marketwatch.com/story/refinancing-your-mortgage-will-cost-more-thanks-to-a-new-fee-from-fannie-mae-and-freddie-mac-2020-08-13", "published": 1597560320.0, "headline": "Refinancing your mortgage will cost more thanks to a new fee from Fannie Mae and Freddie Mac", "body": "If you’re in the process of refinancing your mortgage, you may end up paying more than you expected. Fannie Mae FNMA, +0.73% and Freddie Mac FMCC, +0.52% said Wednesday that they will start charging a 0.5% “adverse market fee” on all refinances, including both cash-out and non-cash-out refis. The new fee goes into effect Sept. 1. “As a result of risk management and loss forecasting precipitated by COVID-19 related economic and market uncertainty, we are introducing a new Market Condition Credit Fee in Price,” Freddie Mac said in a notice to lenders. Fannie Mae noted that its forecasts regarding the impact of COVID-19 could change substantially, making it difficult to predict the pandemic’s impact on the government-sponsored enterprise. The Federal Housing Finance Agency, which regulates Fannie and Freddie, said the two government-sponsored enterprises “requested, and were granted, permission from FHFA to place an adverse market fee on mortgage refinance acquisitions.” Fannie and Freddie are not lenders themselves — instead, they purchase loans from lenders, package them into mortgage-backed securities and then sell those securities to investors. Fannie and Freddie also provide guarantees to investors and advance payments even when borrowers are delinquent on the loans. Also see:Mortgage rates keep falling — so will they finally drop to 0%? The new fee could add up to a significant sum in many cases. The median home nationwide was worth $291,300 as of the second quarter, according to the National Association of Realtors. Therefore, if you applied this fee to a mortgage on a home worth that much, assuming a 20% down payment, the fee would cost over $1,100. The Mortgage Bankers Association, a trade group that represents lenders, said the fee would amount to around $1,400 per loan on average. It’s not the first time Fannie and Freddie have imposed a fee like this. In 2007, Fannie Mae imposed a 0.25% surcharge on all mortgages it bought from lenders in response to the burgeoning global financial crisis. “ ‘If you had a refi pending and didn’t lock or were just thinking about a refi and hadn’t acted yet, then the consumer pays thousands of dollars as long as this stays in effect.’ ” — Bob Broeksmit, president and CEO of the Mortgage Bankers Association The new fee quickly faced criticism. A group of 20 trade organizations and public interest groups called on the FHFA to reverse the fee. The group included the American Bankers Association, the Credit Union National Association, the Mortgage Bankers Association, the National Association of Realtors, the Center for Responsible Lending and the National Fair Housing Alliance. The group argued that the new fee conflicts with the Trump Administration’s actions urging federal agencies to support homeowners. “At a time when the Federal Reserve is purchasing $40 billion in agency mortgage-backed securities per month to help reduce the cost of buying or refinancing a home and stimulate the broader economy, this action by the GSEs raises those costs, contradicting and undermining Fed policy,” the group said in the statement. A senior White House official told The Wall Street Journal that the Trump administration “has serious concerns with this action” and would review the fee. Others pointed out inconsistencies in the timing and structure of the fee. NerdWallet home and mortgage expert Holden Lewis said it was “odd that they’re not charging the fee on purchase mortgages, too” if the fee was being implemented because of economic uncertainty. “It doesn’t make sense,” Bob Broeksmit, president and CEO of the Mortgage Bankers Association, told MarketWatch. “The implementation timeline is intentionally punitive and absurd.” As of June, it took 48 days on average to close a refinance loan, according to mortgage technology firm Ellie Mae. Therefore, lenders will have many loans already in the pipeline where borrowers have already locked in a rate and are just waiting to finalize the loan. If lenders cannot complete those loans by Sept. 1, they will be forced to pay the fee. However, if a borrower had not yet locked in a rate with their lender, the cost of the new fee would be passed on to them in most cases. (Fannie Mae noted that whether the fee is passed on to the consumer is up to the lender.) “If you had a refi pending and didn’t lock or were just thinking about a refi and hadn’t acted yet, then the consumer pays thousands of dollars as long as this stays in effect,” Broeksmit said. Broeksmit also called into question the necessity of the fee. Millions of borrowers nationwide have requested forbearance on their mortgages since the pandemic began, but that number has been falling in recent weeks. And roughly a quarter of the people who entered a forbearance agreement, which means they could skip their monthly payments, did make their July payment, Broeksmit said. Furthermore, borrowers applying for a refinance need to be current on their mortgage in the first place, making those loans arguably less risky. Many lenders have also implemented stricter requirements for borrowers to qualify for a mortgage. The new fee threatens to make refinancing a less lucrative proposition for homeowners who have yet to lock in the market’s rock-bottom rates. Refinance volume has been elevated in recent months because of the low mortgage rate environment. Since March, mortgage rates have dropped to record lows on eight separate occasions. But borrowers applying now won’t be as lucky. “By this artificial increase, it requires a larger drop in rates for it to be worthwhile for borrowers to refinance,” Broeksmit said."}]}