{"article": [{"url": "https://www.marketwatch.com/story/is-this-the-beginning-of-the-end-billionaire-bill-ackman-shares-his-thoughts-on-the-big-market-retreat-11599164769", "published": 1599294200.0, "headline": "Is this â\u0080\u0098the beginning of the end?â\u0080\u0099 Billionaire Bill Ackman shares his thoughts on the big market retreat", "body": "Bill Ackman, CEO of Pershing Square Capital Management Getty Billionaire hedge-fund giant Bill Ackman was asked on Thursday whether the nasty market rout that dragged the tech-heavy Nasdaq Composite down 5% is about to usher in a dark stretch for stocks. His answer was no. But also, maybe. “ â\u0080\u0098Itâ\u0080\u0099s certainly not the beginning of the end, but I would say weâ\u0080\u0099re coming upon one of the more uncertain periods in American history. Markets donâ\u0080\u0099t like uncertainty.â\u0080\u0099 ” The Pershing Square Capital CEO explained in an interview with Bloomberg TV that the upcoming presidential election and the fracture that itâ\u0080\u0099s already caused across the U.S. will only serve to create more uncertainty in the coming weeks and months. Most notably, tech stocks, with their â\u0080\u009cextraordinaryâ\u0080\u009d valuations could be vulnerable, he said. Apple AAPL, +1.74% and Tesla TSLA, +1.89% have been among the big leaders during the market rebound from the initial plunge in response to the coronavirus pandemic. But both were hit hard on Thursday. .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 500px; margin-bottom: 5px; } .at16units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 500px; } body.at12units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 500px; } body .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body .header .wsj-interactive.generic-iframe-embed[name=\"\"], body.at8units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 500px; } body.at4units .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .header .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 500px; } While the broader decline was certainly a steep one, Ackman said it shouldnâ\u0080\u0099t come as much of a surprise, considering how â\u0080\u009cremarkably strongâ\u0080\u009d stocks have been since getting crushed in March. Read: Hereâ\u0080\u0099s one way to save capitalism, according to Ackman Earlier this year, Ackman was credited inÂ an op-ed for the New York Times for nailing â\u0080\u009cthe single best trade of all timeâ\u0080\u009d when he set up a $27-million hedge against the market right before the March drop. Eventually, his relatively modest bearish bet turned into a $2.6-billion winner. Meawnhile, the Dow Jones Industrial Average DJIA, +0.56% closed just off session lows but still finished down more than 800 points. The S&P 500 SPX, +0.87% shed 125 points, while the Nasdaq Composite COMP, +1.39% gave up 598 points."}]}