{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-death-toll-tops-177000-as-fda-head-acknowledges-he-misspoke-on-convalescent-plasma-2020-08-25", "published": 1598364320.0, "headline": "Coronavirus update: U.S. death toll tops 177,000 as FDA head acknowledges he misspoke on convalescent plasma", "body": "The U.S. death toll from the coronavirus illness COVID-19 climbed above 177,000 on Tuesday, as experts continued to question claims made about the use of convalescent plasma as a treatment for hospitalized COVID-19 patients and a leading government official conceded he misspoke at a Sunday press briefing. Food and Drug Administration Commissioner Stephen Hahn acknowledged in a tweet posted late Monday that his comment that a study had shown plasma achieving a 35% improvement in survival was inaccurate. Hahn made the comment, accompanied by President Donald Trump, while announcing an emergency-use authorization for convalescent plasma. ”What that means is — and if the data continue to pan out — 100 people who are sick with COVID-19, 35 would have been saved because of the administration of plasma,” Hahn said at the White House news conference, where Trump described plasma as a “breakthrough.” Scientists and experts, including the World Health Organization, said Monday that was not correct and noted further clinical research was needed. The FDA commissioner confused absolute risk and relative risk, according to Peter Lurie, a former top FDA official who is president of the Center for Science in the Public Interest, the Washington Post reported. “I have been criticized for remarks I made Sunday night about the benefits of convalescent plasma. The criticism is entirely justified,” Hahn wrote. “What I should have said better is that the data show a relative risk reduction not an absolute risk reduction.” iframe.twitter-tweet { width: 100% !important; } Dr. Soumya Swaminathan, chief scientist at the WHO, told reporters at a Monday briefing that, while there are many clinical trials seeking to evaluate the use of blood plasma from patients of the deadly illness who have recovered, only a few have reported results, and those results “are not conclusive.” Others were concerned that the FDA is becoming politicized, with the EUA announcement coming on the eve of the Republican National Convention and a day after Trump accused government scientists of slowing research until after the November election. In other news: • A day after Hong Kong researchers confirmed a case of a patient who had been reinfected with COVID-19, two European patients were reported to have suffered the same fate, the Guardian reported, citing regional public broadcasters in the Netherlands and Belgium. Dutch broadcaster NOS cited virologist Marion Koopmans as describing the Dutch patient as an older person with a weakened immune system, the paper said. The Belgian patient had mild symptoms, according to virologist Marc Van Ranst. “That someone would pop up with a reinfection, it doesn’t make me nervous,” said Koopmans. “We have to see whether it happens often.” • Residents of Gaza are in lockdown after the first cases of COVID-19 were confirmed, raising fears given the densely populated nature of its refugee camps and limited medical facilities, the Guardian reported. Until now, the region has been protected from the virus by its restricted borders. About 2 million people live in Gaza. A Palestinian Authority spokesman said four cases were confirmed in a single family in a refugee camp. • South Korea is closing schools and resuming remote learning for students in the capital Seoul, after counting 280 new COVID-19 cases on Tuesday, a 12th straight day of more than 100 infections, the New York Times reported. South Korea had won praise for its early handling of the pandemic and success in containing it, but Seoul has been hit by a fresh set of infections, some tracked to schools and others to a church. • Concerns about a fresh cluster of cases in early hot spot Spain have led Prime Minister Pedro Sánchez to deploy about 2,000 troops to track outbreaks, the Wall Street Journal reported. Infections have started to climb again in many European countries, but Spain’s resurgence has it leading the pack, accounting for about a third of the Continent’s new daily cases. The news is a cautionary tale coming after hard-won progress in reducing the spread, including one of the world’s strictest lockdowns. In early June, new infections had fallen to fewer than 300 a day from a peak in March of nearly 8,000 a day. • U.S. universities are proving a hotbed for infections and colleges are cracking down on students who fail to socially distance and wear face masks, according to media reports. Ohio State University told 228 students to leave campus pending disciplinary investigations, according to school spokesman Ben Johnson. That was before the resumption of classes. See now: These schools have the largest endowments in the country — yet they’re still raising tuition during the COVID pandemic At least 531 University of Alabama students, faculty and staff have tested positive for COVID-19 since Aug. 19, the school said Monday. Syracuse University, meanwhile, published a letter on Aug. 1, slamming students for a gathering that is now being investigated: “A large group of first-year students selfishly jeopardized the very thing that so many of you claim to want from Syracuse University — that is, a chance at a residential college experience. I say this because the students who gathered on the Quad last night may have done damage enough to shut down campus, including residence halls and in-person learning, before the academic semester even begins.”Latest tallies There are now 23.7 million confirmed cases of COVID-19 globally, according to data aggregated by Johns Hopkins University, and at least 814,52 people have died. At least 15.4 million are confirmed to have tested positive and recovered. The U.S. added 40,351 cases on Monday and counted 504 new deaths, according to a New York Times tracker. The U.S. now has 5.76 million confirmed cases and 177,773 deaths, the highest in the world by a wide margin. Brazil is second with 3.6 million cases and 115,309 deaths. India is third as measured by cases at 3.2 million, followed by Russia with 963,655 and South Africa with 611,450. Mexico has had 563,705 cases and 60,800 deaths, the third highest in the world. India now has 58,390 deaths, putting it ahead of the U.K. That country has 328,620 cases and 41,519 fatalities, the highest in Europe and fifth highest in the world. China, where the illness was first reported late last year, has 89,718 cases, and 4,711 fatalitiesWhat’s the economy saying? Consumer confidence fell in August to a new pandemic low after a fresh rash of coronavirus cases during the summer caused Americans to turn more pessimistic about an economic recovery, according to a closely followed survey, MarketWatch’s Jeffry Bartash reported. The index of consumer confidence sank to 84.8 this month from a revised 91.7 in July, the Conference Board said Tuesday. Economists polled by MarketWatch had expected a reading of 93. The surprising decline in the index of consumer confidence index, however, was contradicted by a pair of other surveys. See:What could save the hotel industry amid the pandemic — a hub for work and play The consumer-sentiment index produced by the University of Michigan edged up slightly in August — though it was still quite low — while a daily tracker at Morning Consult has been creeping higher in the past two weeks. The level of confidence had risen in May and June after states reopened their economies, but it had faltered again in July after a fresh rash of coronavirus cases. It remains to be seen if confidence starts to rise again with case loads receding. “Consumer spending has rebounded in recent months, but increasing concerns among consumers about the economic outlook and their financial well-being will likely cause spending to cool in the months ahead,” said Lynn Franco, senior director of economic indicators at the board. A separate report found sales of new single-family homes increased markedly for a third month in a row, rising to their highest level since 2006, as MarketWatch’s Jacob Passy reported. Sales of new single-family houses rose 14% between June and July to a seasonally adjusted annual rate of 901,000, the U.S. Census Bureau reported Tuesday. Compared with a year ago, new-home sales were up 36%. Economists polled by MarketWatch had expected a median pace of new-home sales of 790,000. The government also revised June’s new home sales figure to a rate of 791,000, up from 776,000. The report’s small sample size has historically led to significant revisions. Read:Nouriel Roubini says reports of the dollar’s demise are greatly exaggerated “Builders are already having trouble keeping pace with demand, and materials costs are rising rapidly, which will add to upward pressure on new home prices, meaning affordability will be more sensitive to any given increase in mortgage interest rates,” Richard Moody, chief economist at Regions Financial Corp., wrote in a research note. “And, with the labor market still in a state of ill repair, it is reasonable to question how long the strength in demand seen over the past few months can be sustained, even absent a meaningful increase in mortgage interest rates.”What are companies saying? • Best Buy Co. Inc. BBY, +1.45% reported a second-quarter earnings and revenue beat, though it offered a cautious outlook. Best Buy stores were open by appointment only for the first six weeks of the quarter due to COVID-19. Online sales grew 242.2% for the period. Enterprise comparable sales rose 5.8% with domestic same-store sales up 5%. FactSet forecast comparable-sales growth of 2.3%, with domestic comparable-sales forecast to grow 2.9%. International comparable sales grew 15.1%, well ahead of the FactSet consensus for 8.8% growth. Tablets and appliances were some of the big sellers for the quarter, with large appliance and home-theater merchandise sales growing as stores opened, according to Best Buy Chief Executive Corrie Bary. For the first three weeks of the third quarter, sales are up about 20%, she said. Best Buy has declared a dividend of 55 cents per share payable on Oct. 6 to shareholders of record as of Sept. 15. The company did not give financial guidance due to uncertainty from the coronavirus pandemic. • Hormel Foods Corp. HRL, -0.28%, the parent of food brands including Skippy peanut butter, Spam and Applegate, posted better-than-expected earnings for its third fiscal quarter. Chief Executive Jim Snee said the company saw strength across its retail and deli businesses, along with a rebound in its food-service business. “We expect the fourth quarter to mirror many of the dynamics we saw in the third quarter,” Snee said. “However, the magnitude of additional recovery in the food-service industry, the performance of the entire food supply chain and the state of the broader economy remain highly uncertain” due to the pandemic. The company absorbed about $40 million in supply-chain costs related to lower production volumes, employee bonuses and enhanced safety measures at its production facilities. “On a year-to-date basis, total incremental costs were $60 million, and the range of incremental costs in the fourth quarter is $20 [million to] $40 million. The total incremental supply-chain costs are anticipated to be $80-$100 million in fiscal 2020,” it said in a statement. • J.M. Smucker Co. SJM, +1.32% posted better-than-expected earnings for its fiscal first quarter, as the parent of brands including Folgers, Smuckers and Café Bustelo got a boost from demand for coffee and consumer foods. “We expect continued momentum in the second quarter, and are pleased to raise our full-year guidance,” Chief Executive Mark Smucker said in a statement. The company is now expecting full-year sales to be flat to up 1%, versus prior guidance for a decline of 2% to 1%. It expects adjusted EPS to range from $8.20 to $8.60, compared with prior guidance of $7.90 to $8.30. • Medtronic PLC MDT, +0.81%, the Dublin-based medical-device maker, posted earnings for its fiscal first quarter that were down sharply from a year ago but ahead of the consensus estimate. Earnings were boosted by an estimated 6 cents to 10 cents a share by the extra week the quarter included versus a year ago, the company said. “Procedure volumes began to recover around the world, and we’re leveraging our pipeline of innovative products to drive share gains in a number of key businesses,” Chief Executive Geoff Martha said in a statement. • Royalty Pharma PLC RPRX, -0.04% priced a $6 billion bond offering on Tuesday, joining the many companies issuing record levels of debt during the pandemic. The company, a buyer of biopharmaceutical royalties that went public in June, said the deal was its first as a public company. It sold $1 billion in 0.75% notes that mature in 2023, $1 billion in 1.20% notes that mature in 2025, $1 billion of 1.75% notes due 2027, $1 billion of 2.20% notes due 2030, $1 billion of 3.30% notes due 2040 and $1 billion of 3.55% notes that mature in 2050. Proceeds will be used to repay Term Loan A and Term Loan B facilities and to pay fees. • Packaged-foods maker TreeHouse Foods Inc. THS, -2.01% is planning to offer $400 million in senior unsecured notes that mature in 2028 in an underwritten offering. Proceeds to will be used to redeem all of the $375.9 million in 4.875% notes due 2022, as well as for general corporate purposes. J.P. Morgan, Bank of America, Wells Fargo and BMO are joint book-running managers on the deal. TreeHouse, a private-label manufacturer, is joining the many companies issuing record levels of debt during the pandemic to bolster their liquidity positions."}]}