{"article": [{"url": "https://www.marketwatch.com/story/drive-in-theaters-and-4-more-nostalgic-businesses-that-are-making-a-comeback-2020-06-22", "published": 1592802620.0, "headline": "Drive-in theaters, and 4 more nostalgic businesses that are making a comeback", "body": "It seems that everything old has become new again amid the COVID-19 pandemic and the “new normal” we’re all adjusting to and creating every day. We’ve baked a whole lot of banana bread, started growing modern-day victory gardens and are selling out drive-in movie theaters faster than you can say “All Shook Up.” Here are five nostalgic businesses that have seen a surge in popularity in recent months, with no signs of slowing down...1. Seed companies Spring is always the most popular time of year for Baker Creek Heirloom Seeds, which sells 1,350 varieties of vegetables, flowers and herbs. But in March, as grocery store shelves became picked over and people began sheltering in place, seed sales tripled, says Kathy McFarland, a spokeswoman for the Mansfield, Mo.,-based company. The recent home gardening resurgence is somewhat reminiscent of the World War II victory gardens that promoted self-sufficiency to ease pressure on the country’s food supply chain and to boost morale. In the wake of the COVID-19 shutdown, people suddenly had more time on their hands, McFarland says, and heirloom varieties in particular became highly coveted because gardeners can save their own seeds for replanting. Also see: Spam, biscuits and crawfish: These are most popular pandemic food delivery orders by state Vegetable seeds — like tomatoes, cucumbers, green beans and peppers — have experienced the greatest increase in sales this spring, McFarland says. But flowers have been popular, too. “People have more time on their hands and are thinking ‘I want to do something beautiful in this world,’” she says.2. Sewing machines As the pandemic swept across the country, demand for masks — a new CDC-recommended accessory — skyrocketed. “Everyone felt a little bit helpless, and so they started pulling sewing machines out of their attics,” says Sarah Kaiser, store manager at Leabu Sewing Center, a family-owned business in Ann Arbor, Mich. And then, they began bringing their sewing machines in for tune-ups and repairs so they could get to making masks for those that needed them. At Leabu, 50 to 60 machines have been coming in every day — which is about the same amount of machines the store was accustomed to receiving in a busy week during normal times. For those looking to purchase sewing machines, it’s been hard to keep up with demand as the models in the sub-$500 price range have been selling out. Kaiser says if you’re looking to upgrade your sewing machine, now’s a good time to trade in your starter sewing machine given the high demand for them.3. Plexiglass manufacturing The demand for plexiglass has skyrocketed as we adjust to new norms of social distancing, with manufacturers increasing their output by as much as 300% in April and March compared with February, according to CNBC. As the country slowly reopens, sneeze guard-like partitions are popping up everywhere: checkout lines, nail salon booths, offices, and even in between Las Vegas slot machines. Joe Herres, the vice president of sales and marketing for Spartech, a plastic sheet supplier headquartered in Clayton, Mo., says the company has been flexible with its manufacturing, producing more clear products at plants that normally manufacture opaque products you’d see in recreation vehicles or heavy trucks.4. Drive-in movie theaters Drive-ins surged in popularity in the 1950s to the mid-1960s when there were 5,000 or so throughout the country. Now, drive-ins are getting a second run, which makes sense since traditional movie theaters shut down, Netflix NFLX, +1.43% queues started to dry up after the great American “Tiger King” binge, and people are looking for safe ways to savor summer nights. Now, nostalgic drive-in theaters have been reinventing themselves in the era of COVID-19, and many are selling out shows weeks in advance. See: What we do know — and don’t know — about the coronavirus at day 100 of the pandemic At Wilderness Theater near Chattanooga, Tenn., every other parking space is taped off to promote social distancing while you watch movies on a big screen under the stars and surrounded by trees. Hound’s Drive-In on Kings Mountain, about 30 minutes west of Charlotte, N.C., recently added a third day to its weekly screening lineup because of the moviegoer demand. Drive-In St. Louis, a new multisport complex that took over the site of the former St. Louis Mills Mall, has been hosting drive-in movies and concert experiences. 5. Milk delivery The milkman is back! When grocery stores started to run low on staple items, more households began turning to local dairy farms for guaranteed delivery at their doorsteps. Longmont Dairy, a third-generation, family-owned farm in Longmont, Colo., saw a surge in new customer sign-ups starting in mid-March, says co-owner Katie Herrmann. Over the course of three months, they’ve been able to make it through their waiting list, she says. Also see: How the pandemic has changed tech in its first 100 days In addition to the new milk delivery customers, existing customers started adding more to their orders, asking for staples like butter, eggs and bread, too, she says. Those receiving milk deliveries today are also enjoying the sustainability aspect of reusable glass bottles, Herrmann says. These are the Top 100 Best Places to Live in America in 2019 Read the original article on Livability."}]}