{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-case-tally-at-472-million-and-new-jersey-massachusetts-and-connecticut-see-infections-climb-again-2020-08-04", "published": 1596555920.0, "headline": "Coronavirus update: U.S. case tally at 4.74 million as New Jersey, Massachusetts and  Connecticut see infections climb again", "body": "The U.S. case tally for the coronavirus illness COVID-19 rose by fewer than 50,000 on Monday for a second straight day, data aggregated by Johns Hopkins University showed, although cases were rising in some states that had seemed to have gotten the spread under control earlier this year. The U.S. added about 48,000 new cases on Monday, and 524 fatalities, boosting the death toll to 156,133. A Wall Street Journal analysis of Johns Hopkins data found that while infections are slowing in recent hot spots including California and Florida, states in the Northeast and Midwest are seeing increases over a seven-day period. These include Connecticut, Massachusetts, Rhode Island and New Jersey, which were previously showing signs they were containing the spread. Florida’s numbers may be understated after the state closed testing sites over the weekend as Hurricane Isaías approached. The hurricane made landfall in North Carolina instead of Florida, and was causing floods, fires and power outages. President Donald Trump said in an interview with Axios that aired on HBO on Monday night that the virus is “under control as much as you can control it,” and reiterated his argument that greater levels of testing are behind rising case numbers. Experts have consistently provided the rebuttal that testing is not the reason for high figures and that the U.S. needs to step up the pace of testing, along with tracing contacts and isolating them to get the pandemic under control. Capitol Report:This is ‘the cognitive test Trump didn’t pass’: Internet reacts to president’s ‘shocking’ Axios interview A Harvard Global Health Institute tracker shows 10 states flashing red, meaning they have at least 25 new cases per 100,000 people over a seven-day period, which researchers say means they are at a tipping point, where stay-at-home measures are necessary again. Those states are Florida, Mississippi, Louisiana, Alabama, Georgia, Nevada, Tennessee, Arizona, South Carolina and Oklahoma. Dr. Ashish Jha, director of the Harvard Global Health Institute, expressed his frustration with this Trump tweet on testing that again called on schools to reopen: iframe.twitter-tweet { width: 100% !important; } “This is the kind of comment that makes it so hard to open schools safely,” he said. “We need to get our kids back to school. But we can’t do it with noise and bluster.” “We need to: stop polarizing the issue, stop pitting teachers against kids; and make this a science-based discussion,” Jha tweeted, adding: “So frustrating.” The head of the United Nations, António Guterres, said overnight that more than a billion children have had their educations disrupted by the pandemic and getting them safely back into classrooms is a priority. But a study from the U.K., which has the fourth highest death toll from COVID-19 in the world, found that without adequate procedures to test and trace positive cases, there could be a wave of COVID-19 cases later in the year. The study, which was published in the Lancet, used a model developed by researchers from University College London and the London School of Hygiene and Tropical Medicine, and found there could be twice as many infections in December as in the initial outbreak without a strategy to contain them. “To prevent a second COVID-19 wave, relaxation of physical distancing, including reopening of schools, in the U.K. must be accompanied by large-scale, population-wide testing of symptomatic individuals and effective tracing of their contacts, followed by isolation of diagnosed individuals,” the authors warned.Latest tallies There are now 18.36 million confirmed cases of COVID-19 worldwide, the Johns Hopkins data show, and at least 695,848 people have died. The data indicate that 10.9 million people have recovered. Brazil is second to the U.S. by case number at 2.75 million and by deaths at 94,665. Mexico has the third highest death toll at 48,012 and sixth highest case tally at 443,813. That’s after India, with 1.9 million cases, Russia with 859,762 cases and South Africa with 518,862. The U.K. has the highest death toll in Europe and fourth highest in the world at 46,295, and 307,256 confirmed cases. See:Dr. Osterholm: Americans will be living with the coronavirus for decades There was bad news from France when its COVID-19 scientific council said that country is at risk of losing control of the pandemic “at any moment.” The warning came as official data showed the first increase in intensive-care patients since April. The council said in a paper prepared for the French government that “the virus has recently been circulating more actively, with an increased loss of distancing and barrier measures” since France ended its lockdown in May. “The balance is fragile, and we can change course at any time to a less controlled scenario like in Spain, for example,” it said. See: Top coronavirus doctor in Spain has a message for revelers and tourists: ‘A couple of drinks, you take off your mask, you sing and you dance — that’s a problem’ In Australia, the state of Victoria reported 439 new cases and 11 deaths, and unveiled stiffer penalties for breaking the lockdown currently in place in the state’s capital, Melbourne. See:One of the world’s ‘most livable’ cities just went into full lockdown mode as coronavirus cases spikeWhat’s the latest medical news? A group of four former commissioners of the U.S. Food and Drug Administration made the case Tuesday for the use of convalescent blood plasma as a treatment for COVID-19. In an op-ed in the Washington Post, Mark McClellan, Margaret Hamburg, Robert Califf and Scott Gottlieb said that if the plasma does work, it could help mitigate the impact of the pandemic. Blood plasma has been used as a treatment for infectious diseases for a century, they explained, including during the 1918 flu pandemic. The idea is to use one patient’s successful defense system of antibodies to bolster the immune response of a newly infected person, they wrote. “But if this is going to work, we need to do it right,” they wrote. “We need a concerted effort to collect blood plasma, along with clinical trials to determine when its benefits outweigh the risks so we can treat the right people at the right time. With that evidence in hand, we need to maintain a highly synchronized distribution system to get the plasma to the right health-care facilities in a timely and equitable way.” The Wall Street Journal reported last week that the FDA is close to issuing an emergency-use authorization for blood plasma and an announcement could come as early as this week, and Trump on Monday called on Americans who have beaten the infection to consider a donation. Elsewhere, Abiomed Inc. ABMD, +0.87% said its Impella heart pump had received an emergency-use authorization from the Food and Drug Administration as a treatment for some COVID-19 patients. The heart pump can be used for patients who have heart or lung damage as a result of an infection with the coronavirus. This is the second time the FDA has authorized the pump for use in COVID-19 patients; in May, the FDA issued an EUA for patients suffering from COVID-19–related right ventricular complications. First Coronavirus Vaccine Could Be Russian, but Haste Raises Questions What are companies saying? The second-quarter earnings season brought the latest numbers from Cinemark Holdings Inc. CNK, -3.87%, and they were predictably grim. The third largest cinema chain in the U.S. swung to a loss as revenue fell 99%, amid theater closures due to the pandemic. “We believe the comprehensive cleaning and safety protocols we have established in the Cinemark Standard will enable us to effectively operate our theatres while prioritizing the health of our employees, guests and communities,” said Chief Executive Mark Zoradi. Shares of specialty-drug company Mallinckrodt PLC MNK, -31.19% plunged after the company said it is in talks with creditors and litigation claimants regarding the possibility of a bankruptcy filing. The news came as it reported a loss and a deep slump in sales. Mallinckrodt is also being hurt by outstanding opioid litigation. Booking Holdings Inc. BKNG, +1.62%, the former Priceline, said it will cut about 25% of its workforce as it grapples with the impact of the pandemic. And Ralph Lauren Inc. RL, -0.59% swung to a loss from a profit and said revenue fell to $487.5 million from $1.43 billion last year, below the $600.0 million FactSet consensus. Here’s the latest news on companies and COVID-19: • Cinemark swung to a loss as revenue dropped 99%, amid theater closures and layoffs as a result of the pandemic. The theater chain’s net loss for the quarter was $170.4 million, or $1.45 a share, after net income of $101 million, or 86 cents a share, in the year-ago period. The loss included $19.5 million in charges for the permanent reduction in head count and theater closures. The FactSet consensus for net per-share losses was $1.59. Sales fell to $9 million from $957.8 million, but topped the FactSet consensus of $5.4 million. Admissions revenue totaled $37,000, down from $521.1 million, while concession revenue fell to $124,000 from $345.3 million and other revenue dropped to $8.8 million from $91.4 million. • Lear Corp. LEA, -0.22% swung to a loss in the second quarter, and said its results were “significantly impacted by the COVID-19 pandemic,” which led to “unprecedented extended shutdowns” of car industry production. The Southfield, Mich.–based maker of car seats’ quarter “was one of the most challenging in our history,” Chief Executive Ray Scott said in a statement. “Our business was negatively impacted by unprecedented production shutdowns in our major markets in April and May. As restrictions and closures eased, we concentrated our efforts on safely and efficiently restarting operations, managing costs, and positioning the company to take advantage of growth opportunities.” Lear ended the quarter with $1.8 billion of cash and total liquidity of $2.5 billion. It is not providing guidance because of the uncertainty created by the pandemic. • Mallinckrodt PLC swung to a large net loss but reported an adjusted profit that beat expectations, while disclosing talks with creditors and litigation claimants regarding the possibility of a bankruptcy filing. A one-time Acthar Gel Medicaid liability lowered sales by $534.4 million. In its business and litigation update, the company stated: “Due to pressures from the Acthar Gel Medicaid matter, the ongoing opioid litigation and the company’s existing debts and the related risk of non-compliance with its financial debt covenant over the next 12 months, the company has been working with external advisers to explore a range of options and engage in dialogue with financial creditors and litigation claimants and their advisers, including the possibility of a filing for reorganization in bankruptcy under Chapter 11 by Mallinckrodt PLC and most of its subsidiaries in the near-term.” The company’s cash balance at the end of the second quarter was $818.3 million and the revolving credit facility was fully drawn, while total principal debt outstanding was $5.29 billion. • Mosaic Co. shares MOS, -0.05% rallied after the fertilizer maker’s results topped Wall Street expectations. As the pandemic “continued to impact the global economy, agriculture and food security continue to be global priorities resulting in limited impact to agricultural inputs, including fertilizer and its supply chains,” Mosaic said in a statement. • Ralph Lauren Inc. RL, -0.59% reported a wider-than-expected first-fiscal-quarter loss and revenue that missed expectations, as the pandemic kept stores closed. The majority of Ralph Lauren locations are open in North America, Europe and Asia, with stores in key markets closed for eight to 10 weeks during the quarter. Digital comparable sales grew 13%. Ralph Lauren did not give guidance due to coronavirus-related uncertainty. • Take-Two Interactive Software Inc. TTWO, +0.76% reported first-fiscal-quarter results that exceeded Wall Street’s revenue estimates as stay-at-home orders encouraged use of its videogames. Revenue soared 54% to a record $831.3 million from $540.5 million a year ago. Analysts surveyed by FactSet expected sales of $824 million. • Warner Music Group Corp. WMG, +0.54% swung to a bigger-than-expected loss for the second quarter in the midst of the pandemic, but revenue beat expectations. New York–based Warner Music is one of three large companies that dominate the recorded-music industry as the parent to record labels including Atlantic Records, Warner Records and Elektra Records, with a stable comprising such artists as Ed Sheeran, Bruno Mars, Cardi B, Twenty One Pilots, Lizzo and Katy Perry. The company returned to the public markets via an initial public offering in June. The company said it had a net loss of $519 million, or $1.03 a share, in the quarter, after income of $14 million, or 3 cents a share, in the year-earlier period. Revenue fell 5% to $1.01 billion from $1.058 billion. The FactSet consensus was for a loss of 2 cents a share and revenue of $980 million. Digital revenue rose 11% to $720 million and accounted for 71.3% of total revenue, up from 61.2% a year ago. “We’re very pleased with our performance this quarter, especially in light of the global pandemic,” CEO Steve Cooper said in a statement. “Our results highlight the underlying strength and resilience of our business. Streaming revenue grew double digits and our digital transformation continues.” The company ended the quarter with cash of $532 million and debt of $3 billion."}]}