{"article": [{"url": "https://www.marketwatch.com/story/though-new-york-city-rat-sightings-are-down-overall-there-could-soon-be-an-increase-2020-07-15", "published": 1594821560.0, "headline": "Though New York City rat sightings are down overall, there could soon be an increase", "body": "New York City is a place where urban legend suggests there are five times as many rats as people—a number that would hit 40 million, given the city’s human population. Even with that possible volume, reported sightings of the much-maligned creatures have fallen by one-fifth during the coronavirus pandemic. Fewer sightings is more a reflection of the city being shut down during the coronavirus pandemic than a drastic fall in rat population. In fact, when the city gets closer to normal activity, their numbers could jump. In the three months between March 22 — the start of New York’s statewide Pause order which closed down all nonessential business — and June 22, New York City’s 311 service recorded 4,003 rat sightings across the five boroughs, led by Brooklyn, which had the most reported. The number is a 20.8% decline from the 5,056 reports that were made in the same period last year, according to data from the city. The falls were most pronounced in Manhattan, where they fell 24.9%, and in Brooklyn, down 24.5%. Also read: Closed attractions and travel restrictions put New York City’s $70 billion tourism industry on hold indefinitely Though their numbers could be down, it’s a metric that’s impossible to track, according to urban rodentologist and pest management consultant Bobby Corrigan. Instead, the slump in 311 reports is “more of a reflection of what we’re living through than a rat decline,” he said. “Most people are so preoccupied these days with the drama we’re going through,” Corrigan said. “Now seeing a rat on the street, or running down Broadway, is not the biggest deal.” In the midst of a global pandemic, the “nuisance of rats has taken on a pretty minor role in people’s minds,” he added. Rats are likely relocating too, further explaining the fall in reported sightings across the city. Many are likely to have turned to “basic living,” which for rats, happens to be the sewers, where they’re protected and where there is food that drifts by, according to Corrigan. “Rat numbers would not have dropped immediately,” Jason Munshi-South, an urban evolutionary biologist and associate professor at Fordham University, wrote in an email. Though he expects “moderately lower rat numbers through 2020.” “With the shutdown of many restaurants and offices, food supplies would have dried up for rats living in areas that are primarily commercial,” he said. In areas with less food, rats would not have the resources needed to reproduce as much as they normally would in areas with more food. Also see: Even with reopening, New York still faces a future that looks very different However, when the city, and those food supplies, return to normal, “the rat population has the opportunity to rebound fairly quickly,” he said. Part of the reason rats are so prolific, is that “they have a very fast rate of reproduction when resources are abundant and easily available,” according to Corrigan. “Lots of resources means lots of kids.” Their numbers may be further buoyed in the future by a weaker effort than normal to control them, a result of the financial strain that the pandemic has put on the city, Munshi-South said. The city, facing $9 billion in lost revenue, recently agreed to an $88.1 billion budget, roughly $5 billion less than last year’s, with cuts across citywide sectors. “I expect that the amount spent on rat control by the city of New York, and by the private sector, will both decline,” Munshi-South said. What won’t happen though, is the arrival of larger, or more aggressive rats as a result of coronavirus lockdowns. Coming out of this situation, “I don’t think the rats are going to be any different,” Corrigan said. “The biggest [misconception] is that they’re getting more brazen, more daring and they’re not afraid of people.” “Are they evolving? The answer is no. That takes hundreds of years.”"}]}