{"article": [{"url": "https://www.marketwatch.com/story/apples-5g-iphone-launch-has-investors-hoping-for-unprecedented-upgrade-cycle-11602261668", "published": 1602248300.0, "headline": "Apple's 5G iPhone launch has investors hoping for 'unprecedented upgrade cycle'", "body": "Apple will be hosting a virtual event Oct. 13 that's expected to focus on the company's first 5G iPhones. Getty Images Apple Inc. has pulled off product virtual launches during the COVID-19 crisis, and now the company is gearing up for the most important one yet. The smartphone giant scheduled an online event for Oct. 13, which should bring the launch of the company's first 5G-enabled iPhones. Apple AAPL, +1.74%'s new phones will be rolling out a bit later than they did during last year's cycle, but the company is expected to have devices in stock heading into the holidays. People are increasingly holding on to their smartphones for longer periods of time, and the most important question for Apple investors is whether 5G connectivity will be enough to drive a big wave of upgrades. U.S. carriers continue to build out their 5G networks, though the initial rollouts of this new wireless standard may not bring the most dramatic enhancements to wireless speeds and lag times that are the ultimate promise of 5G. Nonetheless, Apple hinted that 5G may be the main selling point of its new phones with its invitations to Tuesday's event. The tagline for the launch, which will occur virtually beginning at 1 p.m. ET, is \"Hi, Speed.\" It remains unknown whether Apple will offer support for millimeter-wave spectrum, the faster type of 5G, or whether the phones will just be compatible with sub-6 5G, which is more widely available but offers less of a step up relative to 4G networks.  From the September event: Apple rolls out a cheaper Apple Watch, subscription bundles and more Apple is thought to be planning four \"iPhone 12\" devices for the coming rollout. Many expect that the company will debut two regular iPhone 12 models, in 5.4-inch and 6.1-inch screen size, as well as two \"Pro\" versions with screen sizes of 6.1 inches and 6.7 inches. The Pro models could have a third camera on the back as well as a 3-D Lidar sensing that allows for better augmented-reality capabilities, according to Deutsche Bank analyst Jeriel Ong. All four new phones should have 5G connectivity, Ong wrote, given the \"Hi, Speed\" name for the event. He expects the 5.4-inch model to be popular with consumers given that there's still a strong appetite for smaller screen sizes, even as Apple is increasingly moving toward larger form factors. Ong also anticipates that Apple will lower the price of older iPhone 11 devices and aim to offer six to eight different iPhone models while discontinuing some earlier versions. Apple made its new iPhones available 10 days after announcing them last year, but launches of some models were delayed longer in 2018 and 2017. It remains unknown when people will be able to actually obtain the new smartphones this year or what supply levels will be like. \"It is possible that certain models could either be more unit volume constrained or the new iPhone launch could be staggered similar to years past â\u0080¦ although this possibility appears to be fading, as we have heard less about the potential for further delays recently,\" Ong wrote. Production has already begun for all four models, according to Morgan Stanley's Katy Huberty, who cites her supply-chain checks, though the smallest and largest models are delayed two weeks relative to the middle two models, she said. Beyond 5G and camera upgrades, Huberty expects Apple to emphasize its faster processor and new entry-level storage configurations. From Barron's: Morgan Stanley Says iPhone Launch is a Bigger Deal Than Wall Street Thinks Wedbush analyst Daniel Ives wrote that Apple and its Asia supply chain \"anticipate stepped-up demand for the larger 6.7-inch model,\" which could help drive \"an unprecedented upgrade cycle\" for Apple as he estimates that there are 350 million iPhones currently ripe for upgrades. Aside from rolling out new iPhones, Apple could also launch its own over-the-ear headphones, a smaller version of its HomePod smart speaker, and tags that people could use to keep track of physical objects using Bluetooth. Apple has seen strong adoption of its AirPods ear buds, and the expectation is that the company plans to eventually roll out over-the-ear headphones under its own brand. A recent Bloomberg report highlighted Apple's decision to pull third-party speakers and headphones made by Sonos SONO, -1.07%Inc., Logitech International SA LOGI, +3.28% and Bose from its stores, suggesting that the company could be planning announcements in those categories. Deustche Bank's Ong said that the change to Apple's third-party sales strategy \"could signal an AirPods Studios imminent release,\" referring to the new headphones, though he said it was still unclear whether that would take place \"next week or later this year.\" See also: Investors need to rethink approach to Big Tech with potential selloff looming, Barclays strategist warns Apple-branded Bluetooth trackers have been the subject of rumors for more than a year now, and some expect Apple will finally launch the \"AirTags\" at its coming event. These would be trackers similar to offerings from Tile, which allow people to place little tags on objects like a purse or their keys so that they could use Bluetooth to locate these objects in the event of loss or theft. The Oct. 13 event follows one in mid-September, which saw the company roll out new Apple Watches, iPads, and subscription bundles that offer discounts to those who sign up for multiple Apple services. Apple may offer some sort of tie in with these new services bundles to those who purchase new iPhones. Morgan Stanley's Huberty models Apple shipping about 78 million iPhones in the December quarter and 220 million units for the full fiscal year, which ends next September. Apple shares have rallied 21% over the past three months as the Dow Jones Industrial Average DJIA, +0.56%, of which Apple is a component, has gained 9%."}]}