{"article": [{"url": "https://www.marketwatch.com/story/how-to-compare-medicare-part-d-plans-01600353975", "published": 1600340060.0, "headline": "How to compare Medicare Part D plans", "body": "MarketWatch has highlighted these products and services because we think readers will find them useful. This content is independent of the MarketWatch newsroom and we may receive a commission if you buy products through links in this article. Key Takeaways: Only the drugs covered under the Medicare Part D plan are listed on the formulary. All other medications are not covered. The formulary is organized into tiers, with each tier having a different cost. If you enroll in a standalone PDP, you can expect to pay a monthly premium. Prescription drug plans are allowed to have an annual deductible. For 2020, the deductible cannot be more than $435. Once your deductible is met, you will be charged a copayment or coinsurance for every prescription that you have filled throughout the rest of the year. Why you should compare Medicare Part D plans Prescription drug costs are a huge concern for people enrolled in Medicare. The good news is help is available thanks to Medicare Part D. Part D prescription drug plans are offered by private insurance companies. PDPs split the cost of prescriptions with you and help protect you from out-of-control drug costs. If you are comparing Medicare prescription drug plans and Medicare Advantage prescription drug plans, make sure to consider the following checklist. The plan provides coverage for all your prescription drugs. You’ve evaluated the copayment and coinsurance costs for your prescription drugs. You’ve weighed your options between a standalone Medicare prescription drug plan (PDP) as a supplement to Original Medicare or a Medicare Advantage prescription drug plan (MAPD). You’ve assessed the initial coverage and out-of-pocket limits. The monthly premium and annual deductible are worth it to you based on your healthcare needs. The Medicare plan includes a pharmacy network. You can also request a free plan quote from MedicareExpertUSA.com or by calling 214-817-3545 to speak with a licensed insurance agent.Medicare Part D plan finder: Coverage in 2020 When shopping for a PDP, it is important to know which medications are covered under each plan, and which are not. There are two reasons a drug would not be covered by a plan: The drug is not Medicare-approved The drug is Medicare-approved but is not on the plan formulary Non-Medicare-approved drugs Medicare has listed certain types of medications as being ineligible for Medicare Part D coverage, meaning no PDP will cover them. These include: Over-the-counter (OTC) drugs Sexual dysfunction drugs Fertility medications Cosmetic medications (such as those used to promote hair growth) Weight loss or weight gain drugs Part D drug plan formularies Every Part D drug plan must meet certain minimum coverage rules set by Medicare. However, PDPs are not required to cover every Medicare-approved drug. Instead, every plan publishes a list of the drugs they do cover, which is called a formulary. Only the drugs covered under the plan are listed on the formulary. All other medications are not covered. The formulary is organized into tiers, with each tier having a different cost: Tier 1 – Preferred generics Tier 2 – Non-preferred generics Tier 3 – Preferred brand-name drugs Tier 4 – Non-preferred brand-name or specialty drugs Compare Medicare Part D plans: Costs in 2020 As mentioned earlier, every Medicare Part D plan must meet certain requirements set by Medicare. Not only do these requirements include the kinds of drugs that must be covered but also the price structure. All of this criteria is set by Medicare. As such, with any Part D drug plan, you can expect to pay some or all of the following costs. Monthly premiums If you enroll in a standalone PDP, you can expect to pay a monthly premium. It is worth noting you may be able to obtain drug coverage from a Medicare Advantage plan if one is available in your area. Annual deductible Prescription drug plans are allowed to have an annual deductible. For 2020, the deductible cannot be more than $435. If your plan has a deductible, you will have to pay full drug costs until you have met the deductible. Many plans do not have a deductible. Coinsurance or copayments Once your deductible is met, you will be charged a copayment or coinsurance for every prescription you have filled throughout the rest of the year.Medicare drug plan coverage stages The copayment and coinsurance amounts you pay depend on the tier of the drug, and also on how much you and your plan have paid altogether for drugs during the year. As you and your plan pay more, you move through the following four coverage stages: Coverage Stage 1 – Deductible Stage: You pay full costs up to $435 for 2020 Coverage Stage 2 – Initial Coverage Stage: You pay small copayments or coinsurance until total drug costs exceed $4,020 during 2020 Coverage Stage 3 – Coverage Gap Stage: You pay 25% of the full price for each prescription until your total out-of-pocket costs plus drug company discounts exceed $6,350 Coverage Stage 4 – Catastrophic Stage: You pay no more than 5% of the full drug price for the rest of the year The coverage stages reset on December 31 each year, at which time you start over at Stage 1 on January 1. If your plan does not have a deductible, you begin the year in Coverage Stage 2.What about the Medicare donut hole? The “donut hole” is a nickname for Coverage Stage 3, the Coverage Gap Stage. The name arose from the fact that in the past, the coverage was not as comprehensive as it is now. Specifically, during the Coverage Gap Stage, Medicare Part D plans did not cover any portion of your drug costs. The donut hole has been closing over the last few years, and it finally closed for good in 2019. This closure of the donut hole was made possible through a combination of the following three factors: Medicare now covers 75% of the costs of generic drugs in the Coverage Gap Stage Drug manufacturers must provide a 70% discount on brand-name drugs when enrollees are in the coverage gap Drug plans must cover 5% of the costs of brand-name drugs when enrollees are in the donut hole Although you can still expect to pay more during the Coverage Gap Stage, the donut hole no longer exists. This means you will receive help paying for your drugs throughout the entire year, no matter how high your drug costs.Use a Medicare Part D plan finder Getting Medicare drug coverage is an important step in lowering your healthcare costs. As you are researching, make sure any plan you are considering covers the specific drugs you take. Review various plans’ formularies and compare drug costs in your area to find the right plan for you."}]}