{"article": [{"url": "https://www.marketwatch.com/story/30-to-watch-mulan-on-disney-is-either-outrageous-or-an-amazing-deal-depending-on-who-you-ask-2020-08-05", "published": 1599297200.0, "headline": "$30 to watch â\u0080\u0098Mulanâ\u0080\u0099 on Disney+ right now is either outrageous or an amazing deal, depending on who you ask", "body": "The battle lines have been drawn.Â Disneyâ\u0080\u0099s decision to release its live-action â\u0080\u009cMulanâ\u0080\u009d movie on Disney+ for a $30 fee on Friday has split audiences into two camps. They include those furious about being charged three Hamiltons to watch something on a service that they are already paying for, when other releases (like, well, â\u0080\u009cHamiltonâ\u0080\u009d) are included in the subscription price. And then there are those who say $30 is a lot less than they would have spent to bring their families to a theater to see the film in pre-pandemic times. And now thereâ\u0080\u0099s a new wrinkle: Disney+ subscribers willing to delay their gratification for another three months can stream the new â\u0080\u009cMulanâ\u0080\u009d for no additional cost as part of their subscription beginning Dec. 4. More on that further down. New Walt Disney Co. DIS, +1.53% Â Chief Executive Bob Chapek explained in a conference call with reporters recently that â\u0080\u009cMulanâ\u0080\u009d will stream on Disney+ on Sept. 4 in areas where movie theaters remain closed over coronavirus concerns. It will still open in theaters in areas where cinemas are open, however. Read more:Is â\u0080\u0098Mulanâ\u0080\u0099 worth $30? The answer, and other streaming picks for September 2020 And the $29.99 fee is not a one-time rental; Disney+ users will be able to watch the big-budget action movie as much as they want for as long as they are subscribed to the streaming service. So itâ\u0080\u0099s essentially paying to own the movie â\u0080\u0094 as long as you remain a Disney+ subscriber.Â â\u0080\u009cWe see this as an opportunity to bring this incredible film to a broad audience currently unable to go to movie theaters, while also further enhancing the value and attractiveness of a Disney+ subscription,â\u0080\u009d he said. Read more:Disney shakes up streaming approach after losing nearly $5 billion due to pandemic But many people canâ\u0080\u0099t get past the sticker-shock of paying $30 for a film during a pandemic that has cost more than 183,000 Americans their lives, and millions more their livelihoods. Besides, theyâ\u0080\u0099re already dropping $7 a month (or $70 a year) for Disney+. â\u0080\u009cWhat is Disney smoking to think Iâ\u0080\u0099d pay $30 to see â\u0080\u0098Mulanâ\u0080\u0099 on a streaming service that costs me $8 a month,â\u0080\u009d tweeted one disgruntled customer. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Still others noted that $30 is less than it would cost to bring a family of four to a blockbuster movie before, especially when factoring in the price of snacks, gas, parking or baby-sitters for younger kids. The average U.S. movie ticket was $9.16 last year, according to the National Association of Theatre Owners, although they can run considerably higher in some cities. For example, a family of four (two parents, two children) in the greater New York City area would pay closer to $41.65 for a night at the movies, not counting snacks, according to ValuePenguinâ\u0080\u0099s calculations. Tickets for adults at an AMC theater on the upper West Side were close to $18 apiece.Â iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Bernstein analyst Todd Juenger wrote in a note that he saw both sides. â\u0080\u009cCertainly, $30 for a family is significantly less expensive than it would cost to take that family to see this movie in a theater,â\u0080\u009d he said. â\u0080\u009cOn the other hand, the marginal cost of watching some other movie on Disney+ or Netflix NFLX, +1.43% Â is â\u0080\u0098zero.â\u0080\u0099 Or framed differently, a consumer could receive almost a half-year of Hulu SVOD ad-supported, or Disney+ at the annual discounted rate, for the same price as watching Mulan once.â\u0080\u009dÂ Read more:Disneyâ\u0080\u0099s streaming changes have â\u0080\u0098built a big enough life raftâ\u0080\u0099 to get through pandemic, analysts say as stock spikes The debate almost seems like a moot point after Disney announced earlier this week that â\u0080\u009cMulanâ\u0080\u009d would be included on Disney+ at no extra cost beginning Dec. 4. Several subscribers have suggested on Twitter that theyâ\u0080\u0099re happy to save the money and wait a few months to watch. â\u0080\u009cNot gonna pay $30 for a movie I can get for free in 3 months,â\u0080\u009d tweeted one subscriber, who also noted â\u0080\u009cearly reviews are very mixed.â\u0080\u009d â\u0080\u009cWhy would anyone pay $30 for Mulan when it will be free in December?â\u0080\u009d asked another. Disneyâ\u0080\u0099s â\u0080\u009cMulanâ\u0080\u009d move also has some viewers wondering about the future of other films with releases pushed back by the COVID-19 pandemic, such as Marvelâ\u0080\u0099s â\u0080\u009cBlack Widow.â\u0080\u009d Chapek said that â\u0080\u009câ\u0080\u0098Mulanâ\u0080\u0099 is a one-offâ\u0080\u009d during the recent call. â\u0080\u009cThat said, we find it very interesting to be able to ... learn from it and see what happens, not only in terms of the uptake of the number of subscribers that we get on the platform but the actual number of transactions on the Disney Plus platform that we get.â\u0080\u009d But Robert Thompson, a pop-cultural historian and director of the Bleier Center for TV & Pop Culture at Syracuse University, told MarketWatch that the move away from catching new releases in traditional cinemas to streaming them on-demand at home was already well underway before the pandemic. â\u0080\u009cThis was all going to happen anyway,â\u0080\u009d he said. â\u0080\u009cThe only thing this quarantine and this virus has done is accelerate the complete takeover of the digital distribution of content.â\u0080\u009dÂ And he noted that if you look at how movies are normally released, the number of tickets they expect to sell, and how many people are probably going to gather around a single streaming device at home to watch â\u0080\u009cMulan,â\u0080\u009d then the $30 price isnâ\u0080\u0099t so surprising.Â div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } â\u0080\u009cHowever, the average person is not going to do the math, and when you are presented with a product and a price tag, you are not going to do a cost-benefit analysis from the industry standpoint before you decide to get upset or not,â\u0080\u009d he said. â\u0080\u009cAnd a lot of people think they already paid for Disney+ and the amazing library itâ\u0080\u0099s going to open up to them â\u0080\u0094 but now they have to not only pay more to get â\u0080\u0098Mulan,â\u0080\u0099 but itâ\u0080\u0099s a lot more than several months of the subscription fee!â\u0080\u009dÂ And this sort of blowback is something that streaming services will have to sort out as they experiment with how much to charge for movies and documentaries that go straight to streaming. One early success story includes Universal Picturesâ\u0080\u0099 UVV, -0.39% Â â\u0080\u009cTrolls World Tourâ\u0080\u009d earlier in the pandemic, which was released to video-on-demand for $20. It grossed nearly $100 million, making it the biggest digital movie release ever. Jon Stewartâ\u0080\u0099s political comedy â\u0080\u009cIrresistible,â\u0080\u009d starring Steve Carrell, also pivoted to premiering via premium video-on-demand in July, dropping on Amazon Prime AMZN, +3.01%, Apple TV AAPL, +1.74%, Google Play GOOG, +1.97% and FandangoNow FHP, Â to rent for around $19.99.Â But â\u0080\u009cMulanâ\u0080\u009d is going for $30, which Thompson suggests could advertise that itâ\u0080\u0099s a premium title. â\u0080\u009cItâ\u0080\u0099s an experiment. What weâ\u0080\u0099re watching develop before our very eyes is the industry figuring out how much they could charge for this kind of giant picture,â\u0080\u009d Thompson said. â\u0080\u009cWhat Disney is doing now is feeling out whether the market will support that $30 price â\u0080\u0094 listening to how many complaints they get, but more importantly, seeing how many people actually put down the $30. â\u0080\u009cAnd a lot of people out there, despite all of the grumbling theyâ\u0080\u0099re doing â\u0080¦ theyâ\u0080\u0099re gonna have a house full of kids who want to see â\u0080\u0098Mulan,â\u0080\u0099â\u0080\u009d he added. This article was originally posted on Aug. 5, 2020, and has been republished closer to â\u0080\u009cMulanâ\u0080\u0099sâ\u0080\u009d opening date."}]}