{"article": [{"url": "https://www.marketwatch.com/story/student-debt-is-fueling-the-black-white-wealth-gap-and-pursuing-a-college-degree-has-become-racialized-this-professor-says-11599861959", "published": 1600161800.0, "headline": "Student debt is fueling the Black-white wealth gap â\u0080\u0094 and pursuing a college degree has become â\u0080\u0098racialized,â\u0080\u0099 this professor says", "body": "MarketWatch photo illustration/Hunter Stark| iStockphoto Over the past several years, policymakers and pundits have gained a greater understanding of the disproportionate impact the nationâ\u0080\u0099s debt-based college finance system has on Black families and borrowers.Â Thatâ\u0080\u0099s thanks in part to Fenaba Addo, an associate professor of consumer science at the University of Wisconsin-Madison who studies debt and its role in racial wealth inequality. Addoâ\u0080\u0099s research has shown, among other things, that the gap in student debt held by Black and white borrowers grows by 6.8% each year. As a result, Black young adults hold 10.4% less wealth on average than their white counterparts due to student debt.Â Addoâ\u0080\u0099s work has also highlighted dramatic disparities in millennialsâ\u0080\u0099 net wealth overall: White, older millennials with a bachelorâ\u0080\u0099s degree or more have a median net wealth of $60,030. Their Black counterparts have a median net wealth of $6,422. These disparities are the result of centuries of discrimination that have blocked Black familiesâ\u0080\u0099 access to the resources white families have typically used to build their wealth. Without resources like home equity and money or property inherited from previous generations, Black families have less to draw from to pay for college and pay off student loans. MarketWatch spoke with Addo for The Value Gap about this and some of her other work analyzing the role that debt plays both in society broadly and in interpersonal relationships. The conversation has been edited and condensed. MarketWatch: Can you walk me through some of your findings on student debt, and in particular how you feel those findings have changed the conversation or changed the way people understand this issue? Addo: Where do I start? I guess the work thatâ\u0080\u0099s gotten the most attention has been our work on racial disparities in student-loan debt and its relationship to wealth inequality. We find, as one might expect, that in aggregate, parental wealth is negatively associated with student debt accumulation among their children. However, when we disaggregate this by race, the relationship held among whites, but does not hold among Blacks â\u0080\u0094 and, in fact, at the higher end of the wealth distribution, Black children were taking on more amounts of debt. We started to unpack not only the role of increasing student-loan debt within our society and disparities within our society, but intergenerational stories of how wealth is created, or lack of wealth is created, and the potential for student-loan debt to be a new mechanism thatâ\u0080\u0099s contributing to ongoing racial wealth inequality. Thatâ\u0080\u0099s where our work has really been pivotal in this conversation. â\u0080¦ In additional work, we show that these disparities grow across the early and young-adult period. The mechanisms we see happening that explain that primarily hide the ability of the white young adults in our sample to pay off their debt quicker. [The work is] really trying to paint a picture of how the experience associated with pursuing a college degree within our society is racialized and the associated financial risk of having a college degree has very different implications for Black young adults compared to white young adults on average.Â MarketWatch: This may seem like a basic question, but why are these experiences different?Â Why is the experience of student debt different for Black and white young adults? And how does intergenerational wealth play into that?Â Addo: Even at the upper end of the Black wealth distribution, average and median wealth are significantly lower than that of white houses at the top of the wealth distribution. This manifests in differences in financial assets, home equity and access to resources that could potentially help their children to pay for college. As college costs have risen, the increasing burden of college costs has shifted from federal and state aid to students and families. People with more resources are able to contribute more.Â MarketWatch: Some of my friends and I have a joke about how thereâ\u0080\u0099s some people in your life that you wish just had a green checkmark next to their name. Theyâ\u0080\u0099re posting things online that signal some kind of level of money that has to mean itâ\u0080\u0099s from their family, but no one talks about it.Â This sort of reminds me of your research in the sense that youâ\u0080\u0099re talking about the role of parental wealth. On the flip side, if people have a lot of debt, then some people say thatâ\u0080\u0099s their fault. Or, â\u0080\u009cThey should have figured out how to save more; they should be paying it off quicker.â\u0080\u009d I think Iâ\u0080\u0099m trying to sort through the feelings that people have about debt accumulation versus what the research shows about why people take on debt. Addo: That does get at the heart and the root of why Iâ\u0080\u0099m so interested in understanding debt, because I think the context of debt accumulation matters in society, and it matters in particular in a society that has racist structures in place. In the higher education context itâ\u0080\u0099s tied to engines of social mobility that require either having a lot of money in order to be able to access them or require going into debt to do so. And itâ\u0080\u0099s not compulsory; itâ\u0080\u0099s not like elementary or high school. â\u0080¦ There is a choice for whether or not you want to continue paying for higher education.Â Because itâ\u0080\u0099s not compulsory, there are beliefs that if you have accumulated a lot of debt, it reflects poor decision making on your part; it reflects a lack of understanding and lack of financial education. But I think what our work has really done is challenged some narratives that are often applied to marginalized populations, like Black young adults, Black Americans in our society to say, â\u0080\u009cHey, wait a minute, we actually are showing that the intergenerational persistence of wealth inequality in our society is something that we can show has origins in policies that deny Black Americans the ability to accumulate wealth, and is associated with prophecies we see very present ongoing and persistent today.â\u0080\u009dÂ [My work is] directly addressing these narratives that people want to hold on to about individual failings related to debt, and that tend to be applied only to particular marginalized populations. You see wealthy individuals who have lots of debt, who are commonly declaring bankruptcy, but to whom these narratives are not applied. When theyâ\u0080\u0099re doing that, then itâ\u0080\u0099s a sound business decision, theyâ\u0080\u0099re doing it to build more wealth â\u0080\u0094 yet we canâ\u0080\u0099t even discuss or canâ\u0080\u0099t even have a bill that is willing to discuss discharging debt in bankruptcy or debt that was acquired through predatory means. MarketWatch: What has your research shown about the role of debt in peopleâ\u0080\u0099s lives, depending on race or income, or in the way that people use debt? Addo: It depends on what type of debt it is. Is it credit-card debt? Is it student-loan debt, mortgage debt? For example, in a paper that I did that was looking at debt and relationship outcomes, I actually compared credit-card debt and student-loan debt and found that student-loan debt was associated with a decreased likelihood of women moving from single into a marital union.Â Thereâ\u0080\u0099s an individualized understanding of student debt â\u0080\u0094 you are in that on your own. People are less likely to combine debt, even though they may have joint bank accounts or savings accounts and things like that. We know that thereâ\u0080\u0099s something different about the accumulation of debt or negative assets within a household, and the type of debt matters for how people decide their finances.Â MarketWatch: Why is debt viewed differently than other areas of a familyâ\u0080\u0099s financial life, like joining a bank account, when it comes to relationships?Â Addo: Itâ\u0080\u0099s a negative asset, so itâ\u0080\u0099s removing resources from the household. Itâ\u0080\u0099s not something thatâ\u0080\u0099s building wealth or growing resources. But this stuff varies; mortgage debt is tied to an asset that may be growing and/or appreciating over time. And itâ\u0080\u0099s a shared asset, whereas student-loan debt is acquired for oneâ\u0080\u0099s individual education. Itâ\u0080\u0099s still a debt that, yes, it was an investment â\u0080\u0094 but it was an investment in oneself, one could argue, rather than an investment in the household. That may change as weâ\u0080\u0099re examining adults going back to school, say a single mom who goes back to school.Â MarketWatch: Circling back to your findings on the difference in experience between Black and white borrowers, can you talk through the implications of that for the future? Addo: There is pretty consistent evidence that shows that Blacks with college degrees have less wealth than whites with less than a high-school degree. Thereâ\u0080\u0099s additional research that shows that the racial wealth gap is, in fact, larger amongst college graduates. So thereâ\u0080\u0099s something going on within our society. Theoretically, there is nothing to suggest that higher education should be wealth-improving â\u0080\u0094 only indirectly via income. However, because of the nature of how weâ\u0080\u0099re asking people to pay for higher education through the debt finance system, it has implications for wealth outcomes in our society.Â I say this not to say that we should only be looking at economic outcomes, but I think it is something that is important to understand.Â I also get pushback a lot when I present this work that someone could use these findings in a negative way to say, â\u0080\u009cWell, maybe Black Americans should not be going to college?â\u0080\u009d And I also want to push back against that narrative as well.Â There is lots of amazing work out there showing that the lifetime returns to a college education, particularly with regards to income, are quite large. Weâ\u0080\u0099re not saying that Black Americans should not be going to college. But we should be scrutinizing the amount of debt that young adults are taking on to go to college, and the implications of this amount of debt for populations that donâ\u0080\u0099t have a significant amount of wealth to help them navigate the process of higher education.Â Â A lot of people question why we look at wealth as an outcome when it comes to understanding the implications of higher education. But I think we should be, because the process of getting an education, the process of getting a college degree in our society, is tied to wealth via the other side of the balance sheet â\u0080\u0094 itâ\u0080\u0099s just the debt side.Â"}]}