{"article": [{"url": "https://www.marketwatch.com/story/ftse-100-nosedives-more-than-3-on-coronavirus-and-bank-compliance-concerns-11600688962", "published": 1600675040.0, "headline": "FTSE 100 nosedives more than 3% on coronavirus and bank compliance concerns", "body": "The biggest downward impact on the FTSE 100 came from the heavily weighted banking sector. ben stansall/Agence France-Presse/Getty Images U.K. stocks nosedived on Monday, on concern over a report alleging banks didn’t act on the suspicious activity reports they sent to regulators, and on fears of tightening restrictions due to rising COVID-19 cases. The FTSE 100 UKX, +0.64% fell 3.2% in midday trade, its worst single-day performance since June 11. The travel sector was the worst performer after the country’s chief scientific adviser warned the U.K.’s coronavirus cases could be doubling every seven days. British Airways owner International Airlines Group IAG, -3.72% fell by double digits, with easyJet EZJ, -4.22% and engine maker Rolls-Royce RR, +14.25%, which is considering a £2.5 billion million equity raise, also slumping. “British Airways’ owner IAG is one of the biggest fallers as tougher widespread restrictions on movement are likely to push any recovery for the airline industry even further into the future and that concern has had a domino effect on aircraft-engine manufacturer Rolls Royce, as investors see no end in sight for the falling demand for new planes,” said Susannah Streeter, senior investment and market analyst at Hargreaves Lansdown. Showing the new lockdown fears, the only FTSE 100 gainers were companies that have benefited from increased restrictions — food delivery company Just Eat Takeaway JET, +1.22%, and supermarkets Tesco TSCO, +1.80% and Wm Morrison MRW, +1.52%. The biggest downward impact on the FTSE 100 came from the heavily weighted banking sector. HSBC Holdings HSBA, -1.49%, Standard Chartered STAN, -1.38% and Barclays BARC, +0.16% were each mentioned in BuzzFeed’s report alleging banks didn’t act on the suspicious activity reports they filed with regulators. By law, banks aren’t allowed to comment on those SAR reports. Standard Chartered and HSBC have been filed previously over anti-money-laundering compliance. “The Panama Papers highlighted the issues of transparency and complex ownership structures, while 1MDB and the Luanda Leaks exposed political corruption. What we have now witnessed with the FinCEN Files is a systemic failure across the entire financial system and industry,” said Rachel Woolley, global director of financial crime at financial software maker Fenergo. Markets also were concerned with the impact of the death of Supreme Court associate justice Ruth Bader Ginsburg, with analysts saying the political fight over her successor will likely derail any chances of a new U.S. stimulus package until after the election."}]}