{"article": [{"url": "https://www.marketwatch.com/story/new-york-states-coronavirus-infection-rate-highest-since-july-2020-09-28", "published": 1601315960.0, "headline": "New York stateâ\u0080\u0099s coronavirus infection rate highest since July", "body": "New York state officials are looking to contain several alarming outbreaks of COVID-19 in Brooklyn and Rockland and Orange counties as the statewide infection hit 1.5% for the first time since mid-July, Gov. Andrew Cuomo announced Monday. In some areas, clusters of positive cases have caused infection rates to rise as high as 30%. â\u0080\u009cThe key with these clusters is to jump on them quickly [and] attack them from all sides,â\u0080\u009d the governor said in a conference call with the media. To help curb the increases, Cuomo also announced the state would make 200 rapid-testing machines immediately available for local governments and schools. Results are available in 15 minutes using these machines.Â â\u0080\u009cWe will be contacting the local governments and the schools, but to accelerate this, Iâ\u0080\u0099m calling on [them] to contact us if they need the machines...and weâ\u0080\u0099ll send staff,â\u0080\u009d he said.Â In addition, he asked officials to continue to make sure people are wearing masks and observing social distancing.Â Over the weekend, Cuomo announced that more than 1,000 New Yorkers tested positive for COVID-19 on Friday, the first time since June 5. The New York City health department threatened last week to shut down nonessential businesses and limit gatherings if infection rates continue to rise in certain neighborhoods that were seeing infection rate spikes. â\u0080\u009cIf the indicators continue to rise, there must be additional enforcement actions,â\u0080\u009d the department said Thursday. â\u0080\u009cFor the first time in the cityâ\u0080\u0099s recovery period, there could be the immediate scaling back of activities in these ZIP Codes.â\u0080\u009d Coronavirus update: Global death toll inches toward 1 million as hot spots emerge in India, Europe, South America and Israel More than one-quarter of all new cases on Sunday came from just 10 ZIP Codes, despite accounting for less than 3% of the stateâ\u0080\u0099s population, Cuomo said. Those 10 ZIP Codes had a positivity rate of about 15%, compared to a statewide rate of about 1% when excluding those areas, the governor explained.Â ZIP Codes with increased positivity rates in New York City. Gov. Andrew Cuomo Two areas in Rockland County had the highest infection rates, with 30% of those tested in ZIP Code 10977 now positive for the virus and 25% in ZIP Code 10952. The third highest infection rate, 22%, was in the Orange County ZIP Code of 10950. Schools in these counties have opened with face-to-face and remote options.Â Kings County, or Brooklyn, has also seen clusters of increased COVID-19 cases. Itâ\u0080\u0099s overall infection rate was 2.6% as of Sunday, according to state data. Clusters can be found in neighborhoods such as Borough Park and Midwood, with ZIP Codes 11219, 11210, 11204 and 11230, which have infection rates of 17%, 11%, 9% and 9%, respectively.Â The Queens ZIP Code of 11367, encompassing the neighborhood of Kew Gardens, had a rate of 6%.Other New York coronavirus developments The governor also announced the state will extend the Tenant Safe Harbor Act to Jan. 1, 2021, for residential occupants. The measure protects tenants from eviction because of financial hardship caused by the virus.â\u0080¨ The state will issue guidance on the reopening of homeless shelters on Tuesday. Cuomo called on shelters that have been closed because of COVID-19 to reopen, citing public concerns about homeless encampments in New York City and other metropolitan areas. â\u0080\u009cShelters have to open,â\u0080\u009d he said. â\u0080\u009cItâ\u0080\u0099s getting cold, and we have to get homeless people off the streets.â\u0080\u009d Read next: This universityâ\u0080\u0099s COVID-19 protocol reduced positivity cases after a recent spike â\u0080\u0094 but will it last?"}]}