{"article": [{"url": "https://www.marketwatch.com/story/judge-stops-federal-execution-amid-claims-inmate-has-dementia-2020-07-15", "published": 1594806200.0, "headline": "Judge stops federal execution amid claims inmate has dementia", "body": "TERRE HAUTE, Ind. (AP) — A judge on Wednesday halted the execution of a man said to be suffering from dementia, who had been set to die by lethal injection in the federal government’s second execution after a 17-year hiatus. Wesley Ira Purkey, convicted of a gruesome 1998 kidnapping and killing, was scheduled for execution Wednesday at the U.S. Penitentiary in Terre Haute, Indiana, where Daniel Lewis Lee was put to death Tuesday after his eleventh-hour legal bids failed. U.S. District Judge Tanya Chutkan in Washington, D.C., imposed two injunctions on Wednesday prohibiting the federal Bureau of Prisons from moving forward with Purkey’s execution. The Justice Department immediately appealed in both cases. A separate temporary stay was already in place from the 7th U.S. Circuit Court of Appeals. The early morning legal wrangling suggests a volley of litigation will continue in the hours ahead of Purkey’s scheduled execution, similar to what happened when the government executed Lee, following a ruling from the Supreme Court. Lee, convicted of killing an Arkansas family in a 1990s plot to build a whites-only nation, was the first of four condemned men scheduled to die in July and August despite the coronavirus pandemic raging inside and outside prisons. Purkey, 68, of Lansing, Kansas, would be the second, but his lawyers were still expected to press for a ruling from the Supreme Court on his competency. “This competency issue is a very strong issue on paper,” said Robert Dunham, executive director of the Death Penalty Information Center. “The Supreme Court has halted executions on this issue in the past. At a minimum, the question of whether Purkey dies is going to go down to the last minute.” Chutkan didn’t rule on whether Purkey is competent but said the court needs to evaluate the claim. She said that while the government may disagree with Purkey’s lawyers about his competency, there’s no question he’d suffer “irreparable harm” if he’s put to death before his claims can be evaluated. Lee’s execution went forward a day late. It was scheduled for Monday afternoon, but the Supreme Court only gave the green light in a narrow 5-4 ruling early Tuesday. The issue of Purkey’s mental health arose in the runup to his 2003 trial and when, after the verdict, jurors had to decide whether he should be put to death in the killing of 16-year-old Jennifer Long in Kansas City, Missouri. Prosecutors said he raped and stabbed her, dismembered her with a chainsaw, burned her and dumped her ashes 200 miles (320 kilometers) away in a septic pond in Kansas. Purkey was separately convicted and sentenced to life in the beating death of 80-year-old Mary Ruth Bales, of Kansas City, Kansas. But the legal questions of whether he was mentally fit to stand trial or to be sentenced to die are different from the question of whether he’s mentally fit enough now to be put to death. Purkey’s lawyers argue he clearly isn’t, saying in recent filings he suffers from advancing Alzheimer’s disease. “He has long accepted responsibility for the crime that put him on death row,” one of this lawyers, Rebecca Woodman, said. “But as his dementia has progressed, he no longer has a rational understanding of why the government plans to execute him.” Purkey believes his planned execution is part of a conspiracy involving his attorneys, Woodman said. In other filings, they describe delusions that people were spraying poison into his room and that drug dealers implanted a device in his chest meant to kill him. While various legal issues in Purkey’s case have been hashed, rehashed and settled by courts over nearly two decades, the issue of mental fitness for execution can only be addressed once a date is set, according to Dunham, who teaches law school courses on capital punishment. A date was set only last year. “Competency is something that is always in flux,” so judges can only assess it in the weeks or days before a firm execution date, he said. In a landmark 1986 decision, the Supreme Court ruled the Constitution prohibits executing someone who lacks a reasonable understanding of why he’s being executed. It involved the case of Alvin Ford, who was convicted of murder but whose mental health deteriorated behind bars to the point, according to his lawyer, he believed he was pope. Legal standards as to whether someone has a rational understanding of why an execution is taking place can be complex, Dunham explained. “I could say I was Napoleon,” he said. “But if I say I understand that Napoleon was sentenced to death for a crime and is being executed for it — that could allow the execution to go ahead.” Purkey’s mental issues go beyond Alzheimer’s, his lawyers have said. They say he was subject to sexual and mental abuse as a child and, at 14, was diagnosed with schizophrenia, bipolar disorder, major depression and psychosis. Last week, three mental health organizations urged U.S. Attorney William Barr to stop Purkey’s execution and commute his sentence to life in prison without possibility of parole. The National Alliance on Mental Illness, Mental Health America and the Treatment Advocacy Center said executing mentally ailing people like Purkey “constitutes cruel and unusual punishment and does not comport with ‘evolving standards of decency.’” The mother of the slain teenager, Glenda Lamont, told the Kansas City Star last year she planned to attend Purkey’s execution. “I don’t want to say that I’m happy,” Lamont said. “At the same time, he is a crazy mad man that doesn’t deserve, in my opinion, to be breathing anymore.” The runup to Lee’s execution demonstrated that a lot can still happen before Purkey’s scheduled one. On Monday, hours before Lee was set to be put to death, a U.S. District Court judge put the execution on hold over concerns from death row inmates on how executions were to be carried out, and an appeals court upheld it, before the Supreme Court overturned it early Tuesday."}]}