{"article": [{"url": "https://www.marketwatch.com/story/fed-extends-emergency-loan-programs-for-three-months-until-end-of-2020-2020-07-28", "published": 1595939600.0, "headline": "Fed extends emergency loan programs for three months until end of 2020", "body": "The Federal Reserve on Tuesday said its board of governors had decided to extend seven of its emergency loan programs until the end of the year. The programs had been set to expire on Sept. 30. “The three-month extension will facilitate planning by potential facility participants and provide certainty that the facilities will continue to be available to help the economy recover from the COVID-19 pandemic,” the Fed said in a statement. The programs were initially designed like facilities used in the financial crisis to keep credit flowing in the aftermath of the market disruption in the wake of the pandemic. More recently, the Fed went further and created new programs designed to lend to middle-sized businesses and buy corporate and municipal bonds. Overall, the Fed programs haven’t seen a lot of interest in recent weeks. The Fed’s balance sheet, which jumped to over $7 trillion as a result of the Fed’s asset purchase program, has shrunk since mid-June. For instance, the Fed’s lending to primary dealers has unwound from a peak of $33 billion on April 15 to $1.7 billion on July 15. To date, its Main Street Lending Program to businesses has been very small, with $14 million extended. The total amount of corporate bond purchases has been a relatively modest $11.8 billion, the vast majority being ETFs. Fed officials asserted the lack of activity is a healthy sign that credit was available from other sources. They argued it was important that the lending programs were in place in case financial conditions deteriorated again. Critics have countered that maybe the Fed programs are too complex. As a result of Tuesday’s decision, all of the Fed loan facilities expire at the end of the year, except the commercial paper loan program that expires next March. Treasury Secretary Steven Mnuchin tweeted that he was in favor of the extension. The decision comes at the start of a two-day Fed monetary policy committee meeting. Fed Chairman Jerome Powell will hold a news conference on Wednesday at 2:30 p.m. Eastern. Officials are expected to continue to signal a dovish stance on policy as cases of the coronavirus continue to spread across the country. The Fed’s interest-rate committee includes five presidents of the 12 regional Fed banks. But it is the Fed’s board of governors alone who control the emergency lending programs. Congress provided $450 billion of capital for the programs and White House officials talked about how the Fed programs could be levered up to $4 trillion in loans. “So far it has not happened,” said Jim O’Sullivan, chief U.S. macro strategist at TD Securities. O’Sullivan said he expected Congress to put pressure on the Fed in coming months to tweak the programs and actively make more loans. Lawmakers are going to say “we allocated this money -- what aren’t you using it. We still have a 9% or 10% unemployment rate,” O’Sullivan said. “I can see Powell being grilled in Congress about this,” he added. The Fed could structure the programs so they expect to lose the Treasury’s seed capital, he noted. Other economists, who worry more about the Fed’s independence from the Treasury, were hoping the Fed would soon let the programs expire. “The Fed needs to establish closure on its short-term liquidity facilities on a timely basis, as it did for its lending programs following the financial crisis,” said Mickey Levy, chief economist for the Americas at Berenberg Capital Markets, “Doing so would establish these programs as emergency facilities that are part of the Fed’s toolkit for crises, but not available during normal times,” Levy said in a note to clients."}]}