{"article": [{"url": "https://www.marketwatch.com/story/this-is-the-cognitive-test-trump-didnt-pass-internet-reacts-to-presidents-shocking-axios-interview-2020-08-04", "published": 1596612680.0, "headline": "Social media reacts to Trumpâ\u0080\u0099s â\u0080\u0098shockingâ\u0080\u0099 Axios interview with Jonathan Swan on HBO", "body": "Last week, Axios political reporter Jonathan Swan teased his HBO interview with President Trump as â\u0080\u009cone of the most shocking exchangesâ\u0080\u009d heâ\u0080\u0099s ever had with him. Now, with the whole thing having aired, what had been the signal â\u0080\u009cshockâ\u0080\u009d moment â\u0080\u0094 Trumpâ\u0080\u0099s claiming the intelligence that Russia was funding Taliban targeting of U.S. troops in Afghanistan never reached his desk â\u0080\u0094 just seems to blend in with all the other stuff. The exchange that gained the most traction on social media, where the chat went viral overnight, finds Trump talking about how his administration has done an â\u0080\u009cincredibleâ\u0080\u009d job of navigating the pandemic and how the outbreak is â\u0080\u009cunder controlâ\u0080\u009d despite surging infection numbers. Swan kicked off the interview by asking whether Trump was employing â\u0080\u009cwishful thinkingâ\u0080\u009d when it comes to a public health crisis that has left more than 155,000 in the U.S. dead. â\u0080\u009cI think you have to have a positive outlook â\u0080\u0094 otherwise you would have nothing,â\u0080\u009d Trump said, pointing again to the travel restrictions he says saved perhaps millions of lives. â\u0080\u009cThose people that really understand it, that really understand it, they said itâ\u0080\u0099s incredible the job that weâ\u0080\u0099ve done.â\u0080\u009d Swan asked how Trump could claim that the outbreak is â\u0080\u009cunder controlâ\u0080\u009d when the average daily number of deaths is again more than 1,000. â\u0080\u009cThey are dying â\u0080\u0094 thatâ\u0080\u0099s true. And it is what it is,â\u0080\u009d Trump said. â\u0080\u009cBut that doesnâ\u0080\u0099t mean we arenâ\u0080\u0099t doing everything we can. Itâ\u0080\u0099s under control, as much as you can control it.â\u0080\u009d This moment, in particular, was splashed across Twitter TWTR, -0.23% : iframe.twitter-tweet { width: 100% !important; } Later, the topic shifted to the legacy of late civil-rights hero John Lewis, and Trump wouldnâ\u0080\u0099t budge when it came to joining those across the political spectrum praising Lewisâ\u0080\u0099s impact. â\u0080\u009cI donâ\u0080\u0099t know. I donâ\u0080\u0099t know John Lewis. He chose not to come to my inauguration,â\u0080\u009d Trump said after being asked how he thought Lewis would be remembered. â\u0080\u009cI never met John Lewis, actually.â\u0080\u009d Key Words (January 2017):House veteran John Lewis says Trump wonâ\u0080\u0099t be a legitimate president Swan pushed ahead, asking if Trump found Lewis, who rose to prominence in the civil-rights movement in his early 20s and went on to represent his Atlanta-area district in Congress for more than three decades, to be an impressive figure. â\u0080\u009cI canâ\u0080\u0099t say one way or the other. I find a lot of people impressive. I find many people not impressive, but, no, he didnâ\u0080\u0099t come to my inauguration,â\u0080\u009d Trump said, adding that heâ\u0080\u0099s done more for Black Americans than another other president. â\u0080\u009cHe shouldâ\u0080\u0099ve come. I think he made a big mistake.â\u0080\u009d And when given the chance to perhaps adjust his earlier well-wishes for Ghislaine Maxwell, the former confidante of Jeffrey Epstein who has been charged with trafficking underage girls, Trump maintained his show of support and stoked the flames of a conspiracy theory. â\u0080\u009cHer boyfriend died in jail, and people are still trying to figure out how did it happen, was it suicide, was he killed?â\u0080\u009d he said. â\u0080\u009cI do wish her well. Iâ\u0080\u0099m not looking for anything bad for her.â\u0080\u009d Watch the full interview: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } How did social media rate Trumpâ\u0080\u0099s performance? Well, the reviews are in: iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Read on:What makes one person more likely than another to believe #fakenews and conspiracy theories about COVID-19? |"}]}