{"article": [{"url": "https://www.marketwatch.com/story/kim-kardashian-wests-beauty-business-is-valued-about-180-million-less-than-kylie-jenners-2020-06-29", "published": 1593506600.0, "headline": "Kim Kardashianâ\u0080\u0099s KKW Beauty gets a $1 billion valuation, but thatâ\u0080\u0099s 15% less than Kylie Jennerâ\u0080\u0099s beauty brand", "body": "The difference between being one of the most recognized people in the world and being one of the most admired is worth about $180 million dollars, according to global beauty company Coty. Inc. Coty COTY, -5.08% announced Monday a â\u0080\u009cstrategic relationshipâ\u0080\u009d in which it paid $200 million for a 20% stake in reality TV star Kim Kardashian Westâ\u0080\u0099s beauty business, KKW Beauty. Under terms of the deal, Coty will be responsible for the â\u0080\u009cportfolioâ\u0080\u0099s developmentâ\u0080\u009d in skin care, haircare, personal care and nail products, and Kardashian West will â\u0080\u009clead all creative efforts in terms of product and communication initiatives.â\u0080\u009d The investment implies a $1 billion valuation for KKW Beauty. Coty had disclosed earlier this month that it was in talks with Kardashian West regarding a possible collaboration. The deal comes less than a week after Kimâ\u0080\u0099s husband Kanye West and Gap Inc. GPS, -0.10% Â announced a partnership in which Kanye will launch a Yeezy Gap collection next year. Wells Fargo analyst Joe Lachky said he didnâ\u0080\u0099t expect the deal to have a material impact on Cotyâ\u0080\u0099s financials in the near term, given the small ownership stake, but he said it could become â\u0080\u009cmore materialâ\u0080\u009d over time as it includes a licensing agreement that puts Coty in charge of expanding the brand outside of cosmetics and fragrance. Cotyâ\u0080\u0099s stock COTY, -5.08% Â soared 13.4% to $4.74. It has lost 57.9% year to date, while the S&P 500 index SPX, +0.87% Â has slipped 5.5%. Meanwhile, the language in Cotyâ\u0080\u0099s release Monday was similar to that used in an investment the company closed six months ago with Kimâ\u0080\u0099s younger half sister, Kylie Jenner. In January, Coty said it closed on the â\u0080\u009cstrategic partnershipâ\u0080\u009d announced in November 2019, in which Coty said it paid $600 million for a 51% stake in Kylieâ\u0080\u0099s beauty business, Kylie Cosmetics. That implies a $1.18 billion valuation for Kylie Cosmetics. Donâ\u0080\u0099t miss: Cotyâ\u0080\u0099s $600 million deal with Kylie Jenner is designed to hang on to her social media star power. At that time, Coty said it would be responsible for the â\u0080\u009cportfolioâ\u0080\u0099s development,â\u0080\u009d while Jenner will â\u0080\u009clead all creative efforts in terms of product and communications initiatives.â\u0080\u009d There was a not-too-subtle difference, however, in the language Coty used to describe the sisters. On Monday, Coty said about Kim: â\u0080\u009cKaradashian West is one of the worldâ\u0080\u0099s most recognized personalities with 300 million followers across her personal and brand social media channels, as well as being an influential voice among beauty consumers globally,â\u0080\u009d Coty said in a statement. In November, Coty said about Kylie: â\u0080\u009cKylie is one of the worldâ\u0080\u0099s most admired personalities with over 270 million followers across her personal and brand social media channels, as well as being one of the most influential voices among beauty consumers globally.â\u0080\u009d Apparently, being admired is worth a lot more than being recognized."}]}