{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-group-of-ex-fda-commissioners-slam-political-interference-at-fda-and-cdc-us-death-toll-tops-260000-2020-09-30", "published": 1601472500.0, "headline": "Coronavirus update: Group of ex-FDA commissioners slam political interference at  FDA and CDC; U.S. death toll tops 206,000", "body": "The global death toll from the coronavirus-borne illness COVID-19 climbed to 1.009 million on Wednesday, while the U.S. death toll rose above 206,000, and the first presidential debate found President Donald Trump again blaming China for the outbreak, while opponent Democrat Joe Biden slammed Trump’s handling of the crisis. Trump said the damage to the U.S. economy during the pandemic can be blamed on China, where the illness was first reported late last year. Biden responded by using an expression used by Trump in a recent Axios interview regarding the U.S. death toll: “It is what it is because you are who you are,” Biden said. The debate came on a day with more than 43,000 new COVID-19 cases in the U.S. and 918 deaths, according to a New York Times tracker. In the last week, the U.S. has counted an average of 43,128 cases a day, up 13% from the average two weeks ago. The U.S. has the most cases and deaths of any country in the world at 7.2 million cases and 206,351 fatalities, according to data aggregated by Johns Hopkins University. That’s about a fifth of the global death toll. Experts have lamented the U.S. government’s handling of the crisis and failure to follow a consistent strategy on testing, contact tracing and isolation, and convince the public of the need to socially distance and wear face masks. A group of seven former U.S. Food and Drug Administration commissioners added their voices to the chorus on Wednesday in an op-ed in the Washington Post, in which they warned that political interference from Trump administration officials is undermining the credibility of the country’s leading public health agencies. That, in turn, could have dire consequences for the development and rollout of a coronavirus vaccine, said the op-ed, which was written by Robert Califf, Scott Gottlieb, Margaret Hamburg, Jane Henney, David Kessler, Mark McClellan and Andy von Eschenbach. “For decades, when we and our predecessors spoke as FDA commissioners about issues of regulation and people’s health, the public knew we were speaking on behalf of experts whose judgments were grounded in science,” they wrote. “That is changing in deeply troubling ways.” The group cited as examples statements from the White House that it may try to influence scientific standards for vaccine development followed by the FDA, or even prevent it from issuing further written guidance, despite key leaders of the FDA, Centers for Disease Control and Prevention and National Institutes of Health supporting the guidance. Then there was the move by Health and Human Services Secretary Alex Azar to remove the FDA’s authority to establish rules for food and drug safety, and make himself the sole authority. “This came in the wake of acknowledged acts of political influence on the FDA’s coronavirus communications, significant misstatements by the secretary and other political leaders about the benefits of hydroxychloroquine and convalescent plasma, and the overruling of FDA scientists on the regulation of covid-19 laboratory tests. At risk is the FDA’s ability to make the independent, science-based decisions that are key to combating the pandemic and so much more,” the doctors wrote. Polls consistently show that Americans are turning away from science as the number willing to take a vaccine is declining. A recent Pew Research Center report found 78% of those surveyed were concerned that the approval process will be rushed. Just 21% of those polled said they would definitely take a vaccine, or about half the percentage that said that just four months ago. Read:Trump, Xi and Putin are least trusted leaders during pandemic; Merkel is most trusted “If the FDA makes available a safe and effective vaccine that people trust, we could expect to meaningfully reduce Covid-19 risk as soon as next spring or summer. Without that trust, our health and economy could lag for years,” the commissioners wrote. In other news: • Belgium has recorded more than 10,000 deaths from COVID-19, according to local media reports. Belgium has the highest mortality rate in Europe, according to the Johns Hopkins data, at 87.44 deaths per 100,000 people. The country of about 11.5 million has 117,115 confirmed cases, the data show. That’s followed by Spain, with 67.33 deaths per 100,000 people, and the U.K, with 63.30 deaths per 100,000. • A number of countries in Central and Eastern Europe set record one-day new case tallies on Wednesday, the Guardian and news agencies reported. Slovakia counted 567 new cases, according to health ministry data, its highest number since the start of the outbreak. Ukraine registered 4,027 cases, according to its National Security Council, and Romania recorded a daily spike of 2,158 new cases, bringing its total to 127,572. • New York City will start fining people who do not comply with its face mask mandate, after the percentage of people who tested positive for COVID-19 surged above 3% for the first time since early June. The increase is being driven by a cluster of cases in a handful of Brooklyn and Queens ZIP Codes, according to Mayor Bill de Blasio. “We’re dealing with specific challenges in specific neighborhoods,” de Blasio said at his morning briefing, in which he and top health officials soberly raised the alarm about the cluster’s potential to lead to wider community spread. The latest data showed the city’s positivity rate rose to 3.25% on Sunday, doubling from the 1.41% recorded the previous day. England has introduced fines of up to 10,000 pounds ($12,852) for citizens who refuse to self-isolate when instructed to do so.Latest tallies There are now 33.7 million confirmed cases of COVID-19 worldwide, the Johns Hopkins data shows. At least 23.4 million people have recovered. Brazil has the second-highest death toll at 142,921, but third-highest case tally at 4.8 million. India is second to the U.S. by case tally at 6.2 million, and has the third-highest death toll at 97,497. Mexico is fourth with 77,163 deaths and seventh with 738,163 cases. The U.K. has 42,162 deaths and 448,734 cases, the highest death toll in Europe and fifth-highest in the world. China has 90,536 cases and 4,739 deaths, according to its official numbers. What’s the latest medical news? Regeneron Pharmaceuticals Inc. REGN, +0.36% said its trial antiviral drug cocktail reduced the coronavirus load and the time needed to ease symptoms in non-hospitalized patients with COVID-19. The cocktail, named REGN-COV2, also showed “positive trends in reducing medical visits,” the company said. The drug cocktail is under an ongoing, randomized trial that measures the effect of adding it to usual COVID-19 standard-of-care compared with adding a placebo. The “greatest improvements” were in patients “who had not mounted their own effective immune response prior to treatment,” Regeneron said. See also:There are four coronavirus vaccines in late-stage studies — here’s how they differ This trial is part of a larger program that also includes studies of REGN-COV2 for the treatment of hospitalized COVID-19 patients, and for prevention of infection in people exposed to COVID-19, the company said. Regeneron said it plans to “rapidly to discuss results with regulatory authorities.” Moderna Inc. MRNA, +0.09% said early-stage data suggests its COVID-19 vaccine can generate neutralizing antibodies in older and elderly adults at levels comparable to those in younger adults. The study was published in The New England Journal of Medicine. Quest Diagnostics Inc. DGX, +0.33% is now offering three panel tests that can detect COVID-19 as well as other respiratory infections, like the flu. Instead of ordering separate tests, a health care provider can now use a single specimen to test for different respiratory infections, “for potentially improved patient care,” Quest said. Quest is selling a Roche Holding AG’s ROG, +1.80% panel test that can detect flu and COVID-19, as well as two of its own panel tests that test for coronavirus infections as well as other respiratory infections.What’s the economy saying? The pace of U.S. private sector job growth in September was the strongest in three months, MarketWatch’s Greg Robb reported. Private-sector employment rose by 749,000 jobs, Automatic Data Processing Inc reported Wednesday. The gain was above the forecast from economists surveyed by Econoday of a gain of 650,000 jobs. Firms added a revised 481,000 jobs in August and 216,000 in July. By company size, job growth at small firms job continued to lag behind bigger firms. Small businesses added 192,000 jobs in September, while medium firms added 259,000 jobs and large firms adding 297,000 jobs. The service sector added 552,000 jobs, while goods-producing firms added 196,000. See:Protect the economy or the population? The coronavirus dilemma facing governments as protests escalate The report comes ahead of Friday’s September job report, the last before the November presidential election. Economists surveyed by MarketWatch expect job growth this month to moderate to 800,000 from 1.37 million in August. The jobless rate has fallen to 8.4% in August from nearly 15% in April. But the pace of improvement has slowed in recent month and jobless claims have remained elevated. Economists also note that ADP has undershot the government’s first estimate of job growth in each of the past five months. Separately, a record decline in the U.S. economy in the early stages of the coronavirus pandemic was lowered slightly to a 31.4% annual pace — setting the stage for a big rebound in the third quarter, MarketWatch’s Jeffry Bartash reported. The decline in gross domestic product, the official scorecard of the U.S. economy, was previously put at 31.7% during the months of April, May and June. See: Democrats are pushing for another round of stimulus checks and $600 in weekly unemployment benefits The economy has been on a comeback since the start of the summer and GDP is expected to show a big snapback in the third quarter. Economists polled by MarketWatch predict the U.S. is likely to expand at a record 25% annual clip during the July-to-September time frame. Third-quarter GDP will be released at the end of October. Finally, a measure of business conditions in the Chicago region surged in September to the highest level since the end of 2018. The Chicago PMI business barometer jumped to 62.4 in September from 51.2 in the prior month, MNI Indicators said Wednesday. Any reading above 50 indicates improving conditions. Wall Street had expected a reading of 52. The Chicago PMI report came out early before its normal 9:45 a.m. Eastern release time. “Manufacturing is still rising from low levels, but momentum has slowed in recent months,” said Rubeela Farooqi, Chief U.S. economist at High Frequency Economics. The Dow Jones Industrial Average DJIA, +0.56% was last up 1.3% and the S&P 500 index SPX, +0.87% was up 0.9%. Don’t miss:Temporary layoffs are becoming permanent job lossesWhat are companies saying? • Dow Inc. DOW, -0.04% expects to book restructuring charges of $500 million to $600 million in the third quarter, as the materials science company, which makes plastics and paints among other products, pushes ahead with a cost cutting program during the pandemic. The company said the charges will consist of severance and related benefit costs, exit and disposal activity costs and asset write-downs and write-offs. The company is on track to achieve its reduced target for capex of $1.25 billion in 2020, down from $2.0 billion in 2019. “Given the expected gradual and uneven global economic recovery from COVID-19, we announced in July that we are taking necessary actions to continue to optimize our asset footprint, reduce structural costs and enhance the competitiveness of our business over the long-term,” Chief Executive Jim Fitterling said in a statement. The company is expecting to close the sale of rail infrastructure assets at six North American sites to Watco three months earlier than planned for cash proceeds or more than $310 million. • Elanco Animal Health Inc. ELAN, +3.01% is restructuring its business just two months after closing the acquisition of Bayer Animal Health. The Greenfield, Indiana-based company expects to cut 900 jobs across nearly 40 countries, mostly in sales and marketing, but also in R&D, manufacturing and quality, and back office support. The company is aiming to generate at least $100 million in annual savings, and will start to de-lever, by paying $100 million on its term loan. Elanco is aiming to capture initial synergies from the deal, despite the challenges presented by the coronavirus pandemic. “After our early view of the combined business, we have full confidence in delivering $275 million to $300 million in synergies, with the first two-thirds coming in the first 30 months,” Chief Executive Jeff Simmons said in a statement. The restructuring is expected to cost $190 million to $210 million, and the company will book a restructuring charge of $130 million to $145 million in the third quarter, followed by $40 million to $45 million in the fourth quarter. • Oasis Petroleum Inc. OAS, -8.55% is filing for Chapter 11 bankruptcy with a prepackaged plan with creditors, aiming to reduce its debt by $1.8 billion. The company is the latest energy company to collapse beneath the weight of a weak oil price and constrained demand during the coronavirus pandemic. “In light of a volatile market environment that drove a severe downturn in oil and gas prices, as well as the unprecedented impact of the COVID-19 pandemic, Oasis Petroleum engaged with its lenders and an ad hoc committee of noteholders regarding restructuring alternatives to reduce debt, increase financial flexibility and position the business for long-term success,” the company said in a statement. Oasis has secured a $450 million debtor-in-possession loan and has sufficient liquidity to maintain operations. The company expects to emerge from bankruptcy in November, subject to court approval, and expects to have about $340 million of borrowings under a credit facility. • Progress Software Corp. PRGS, +1.79% reported better-than-expected fiscal third-quarter profit and raised its outlook for the year. “Our success in Q3 was driven by the incredible work and dedication of our employees under the challenging circumstances created by the continuing COVID-19 crisis,” Chief Executive Yogesh Gupta said in a statement. The company upped its revenue guidance for fiscal 2020 to between $438 million and $442 million, or for EPS between $1.63 and $1.66. • The Walt Disney Co. DIS, +1.53% announced 28,000 layoffs in its Parks, Experiences and Products segment on Tuesday, financial victims of protracted theme-park closures caused by the coronavirus pandemic that an executive says has been “exacerbated” by California’s refusal to allow Disneyland to reopen. The massive job reduction was the most eye-opening among several severe cost-cutting measures made by Disney, which has lost billions of dollars in potential revenue because of suspended operations at its amusement parks, live-production units and cruise lines since COVID-19-imposed closures dating back to March. Disney said in its most recent earnings report that COVID-19 had cost its theme-park business roughly $1 billion in operating income in its fiscal second quarter."}]}