{"article": [{"url": "https://www.marketwatch.com/story/5-things-you-need-to-know-about-asanas-direct-listing-2020-09-15", "published": 1601484560.0, "headline": "The Asana non-IPO: 5 things to know about direct listing of Facebook co-founderâ\u0080\u0099s software company", "body": "Asana Inc.â\u0080\u0099s planned direct listing comes with a lofty goal: To become the â\u0080\u009cpioneer in work managementâ\u0080\u009d through â\u0080\u009cthe pyramid of clarity.â\u0080\u009d Translating corporate-speak, Asana ASAN, -3.12% Â has a simple goal: To bring efficiency and streamlined work flow to small and big companies. Like Palantir Technologies, Asana is following the approach taken by Slack Technologies Inc. WORK, +3.36% Â and Spotify Technology Inc. SPOT, +0.08% Â , and going public through a direct listing, which allows existing investors to sell shares rather than issue new stock. Asanaâ\u0080\u0099s market valuation could range from $3.7 billion to $4.3 billion, analysts from MKM Partners wrote in a note, implying an initial price of $24 to $28 a share. The New York Stock Exchange established a reference price of $21 for shares Tuesday evening ahead of expected trading Wednesday. A Facebook legacy Company Chief Executive Dustin Moskovitz, who co-founded Facebook Inc. FB, +0.26% Â with Harvard University roommate Mark Zuckerberg, could have done anything when he left the social-networking giant. He chose to start Asana in 2008. Why Asana? â\u0080\u009cI could have done a lot of things. It is the ultimate meta-problem, making employees more efficient. 1%, 2%, 20%,â\u0080\u009d Moskovitz said during Asanaâ\u0080\u0099s virtual investor day Sept. 10. â\u0080\u009cOur tools helps link strategy and execution.â\u0080\u009d â\u0080\u009cWhen we started the company, there was a question about whether this would be a category,â\u0080\u009d Moskovitz said on investor day. â\u0080\u009cIt feels much more now that this is the future. Mass adoption of knowledge workers. 2020 is a catalyst year for a lot of performance products.â\u0080\u009d See also: IPO market is headed for busiest third quarter since the dot-com years â\u0080\u0094 and thereâ\u0080\u0099s lots more to come The product proposition The problem is as stark as the millions of Americans who are expected to work from home for the foreseeable future: The average knowledge worker spends 60% of their time working on work. They spend 28% on email, 19% gathering information, and 14% on internal communication, according to Asanaâ\u0080\u0099s S-1 filing on Aug. 24. Asana is workplace collaboration and planning software designed to help teams of employees orchestrate work to achieve their goals smoothly and efficiently. The companyâ\u0080\u0099s software helps coordinate workflows and increase productivity through what it calls the three Cs: content, communication, and coordination. Asanaâ\u0080\u0099s intent is to enhance the first two, leading to the whole becoming greater than the sum of its parts. Asanaâ\u0080\u0099s work-collaboration tools â\u0080\u009chelp link strategy and execution,â\u0080\u009d Alex Hood, head of product, said on investor day. It addresses the question of who is doing what and when. â\u0080\u009cSpreadsheets and email donâ\u0080\u0099t scale,â\u0080\u009d Hood said. Asana is â\u0080\u009cvery complementary to existing toolsâ\u0080\u009d like Slack Technologies Inc. WORK, +3.36% Â , one of its customers. Who uses the product Asana claims 82,000 paying customers, and 3.5 million free-activated accounts. Roughly 40% of revenue is from outside the U.S., with expansion of offices in Australia, Japan, Germany, and England. The number of customers spending $5,000 or more on an annualized basis grew to 7,933, an increase of 65% year over year. The number of customers spending $50,000 or more on an annualized basis jumped to 283, an increase of 160% year over year. The companyâ\u0080\u0099s paying customers include AT&T Inc. T, -1.01% Â , Alphabet Inc.â\u0080\u0099s GOOGL, +1.82% Â GOOG, +1.97% Â Google, NASA, Autodesk Inc. ADSK, +1.36% Â , and The Viesmann Group, a German manufacturer of heating, industrial, and refrigeration systems. About two-thirds of the Fortune 500 have free or paid Asana accounts, according to the company. Which leads to Asanaâ\u0080\u0099s business proposition. Most of its customers use the free service, usually through the advocacy of employees. As the productâ\u0080\u0099s use scales, it leads to premium (paid) services. â\u0080\u009cTraditional enterprise software is sold top-down,â\u0080\u009d Hood said. â\u0080\u009cAsana is built for individual workers, so it is adopted bottom-up.â\u0080\u009d The financial picture In fiscal 2020, Asana registered $143 million in revenue, up 86% year-over-year. The company also reported losses grew, to $118.6 million in fiscal 2020 from $50.9 million in fiscal 2019. Roughly 40% of total sales, or $59 million, came from abroad in 190 countries. Gross margins are a strength: 82% (in fiscal 2019), 86% (fiscal 2020), and 87% (first half of this year for fiscal 2021). â\u0080\u009cWeâ\u0080\u0099re still in the early stagesâ\u0080\u009d of fledgling market with movement to work from home,â\u0080\u009d Asana Chief Financial Officer Tim Wan said on the investor call. Customers who spend more than $50,000 a year like what they have used. Asanaâ\u0080\u0099s net retention rate among them is more than 140%, indicating the companyâ\u0080\u0099s biggest customers are spending significantly more than they did a year ago. The 900-person company, based in San Francisco, Asana reported revenue of $52 million for the three months ended July 31, up 57% year-over-year. Its net loss during the period jumped to $41.1 million, compared with a $15.6 million loss for the same period last year. The company has yet to turn a profit. For fiscal 2021, Asana projects revenue of $210 million to $213 million, representing year-over-year growth of 47% to 49%. It expects a non-GAAP operating loss of $136 million to $140 million, according to an updated S-1 filing. A potential $32 billion market The so-called work-management market is expected to grow to $32 billion in 2023 from $23 billion in 2020, according to market researcher IDC. An estimated 1.25 billion global-information workers are in play. â\u0080\u009cA vast amount of knowledge workers need clarity,â\u0080\u009d Chris Farinacci, head of business, said on investor day. â\u0080\u009cWe are mostly competing with the status quo (email, spreadsheets, sticky notes), and trying to change it.â\u0080\u009d In its S-1, Asana specifically spells out competition: â\u0080\u009cThe market for work management solutions is increasingly competitive, fragmented, and subject to rapidly changing technology, shifting user and customer needs, new market entrants, and frequent introductions of new products and services. We compete with companies that range in size from large and diversified with significant spending resources to smaller companies.â\u0080\u009d To that end, Asana acknowledges it needs to allocate a large portion of its revenue to customer acquisition strategies, which will likely lead to increased operating losses. A potential issue is that Asanaâ\u0080\u0099s sales growth decelerated in its most recent quarter to 71% from 86% in fiscal 2020. Should this trend continue, it becomes increasingly difficult for Asana to become profitable in the future."}]}