{"article": [{"url": "https://www.marketwatch.com/story/consumer-sentiment-improves-slightly-in-late-august-but-still-near-pandemic-low-2020-08-28", "published": 1598612360.0, "headline": "Consumer sentiment improves slightly in late August, but still near pandemic low", "body": "Americans regained a small amount of confidence in the path of an economic recovery in late August, but they are still quite pessimistic about how long it will take to get back to normal, a new survey showed. The final consumer sentiment survey in August rose to 74.1 from a preliminary reading of 72.8, the University of Michigan said Friday. It was also up from July’s 72.5 score. The survey is still near a pandemic low, however. The index bottomed out at 71.8 in April, just two months after it had reached a nearly two-year high of 101. Read:Consumer spending slows in July as economic recovery loses some momentum What happened: A fresh outbreak of the coronavirus during the summer dampened the spirits of Americans in July just as they were starting to feel a bit more optimistic. Consumers showed little change in their attitude in August about how the economy is doing right now An index that measures current conditions rose a just a touch to 82.9 from a preliminary 82.5 reading earlier in August. The latest results incorporate responses from consumers in the latter part of the month. Read: Did the expired $600 federal jobless benefit keep people from going back to work? They felt somewhat better about the rest of the year. An index that measures expectations for the next six months climbed to 68.5 from a preliminary 66.5 reading and 65.9 in July. Still, most Americans think it will be years before the economy returns to normal. “Although half anticipates an improved economy, when asked to judge the performance of the economy, 62% judged that the overall conditions in the economy could be best described as unfavorable,” said Richard Curtin, the chief economist of the sentiment survey. The big picture: The amount of confidence Americans have in the economy and their own financial security has a good record of predicting the future. The low level of sentiment points to a rockier road ahead for a U.S. recovery with unemployment still high, layoffs and furloughs on the rise again and Washington divided over what kind of additional aid to provide for the economy. Read:‘The recovery is going to be a slow one,’ Fed’s Mester says Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% rose in Friday trading."}]}