{"article": [{"url": "https://www.marketwatch.com/story/stock-buybacks-have-totaled-53-trillion-over-the-past-decade-has-that-contributed-to-us-pandemic-failures-2020-07-29", "published": 1596097940.0, "headline": "Stock buybacks have totaled $5.3 trillion over the past decade - has that contributed to U.S. pandemic failures?", "body": "Has the $5.3 trillion that U.S. companies have funneled to their shareholders in the past decade in the form of stock buybacks contributed to the federal government's failing management of the coronavirus pandemic? That's a question raised in an article titled, \"The $5.3 trillion Question behind America's COVID-19 Failure,\" that was published on Wednesday in the American Prospect, a progressive public-policy journal, based on a new working paper, \"How 'Maximizing Shareholder Value' Minimized the Strategic National Stockpile,\" published by the Institute for New Economic Thinking. Authors William Lazonick, professor emeritus of economics at the University of Massachusetts and the president of the Academic-Industry Research Network, and Matt Hopkins, a Ph.D. student at SOAS University of London and a senior researcher at the Academic-Industry Research Network, argue that share buybacks are a core tenet of \"maximizing shareholder value,\" which until last year was the Business Roundtable's definition of the purpose of a corporation. That changed last August, when 181 senior executives of top companies, led by J.P. Morgan Chase & Co.'s JPM, -0.57%  Jamie Dimon, agreed to change the Business Roundtable's stated purpose for a corporation to one that says companies should serve all of their stakeholders, including customers, employees, suppliers and communities, in addition to generating long-term value for shareholders. The change broke with the idea made famous by the legendary University of Chicago economist Milton Friedman that companies' primary purpose was to reward shareholders. “ 'For government-business collaborations, or GBCs, to be effective, companies need to abandon the ideology of maximizing shareholder value and shift to the idea of corporate governance for the common good.' ” \"Guided by this new purpose, a corporation could be a partner in a [government-business collaboration] and could respond effectively to the COVID-19 pandemic,\" the authors wrote. To really make that change, however, companies would need to stop distributing almost all their profit via share buybacks and dividends and instead show real commitment to a stakeholder model, they wrote. The main beneficiaries of buybacks are stock sellers, including companies' own executives and stock-market professionals, both of whom are positioned to know when such transactions will be executed and when to pocket gains. Companies paid out $3.8 trillion in dividends in the period from 2010 to 2019. Comparing those enormous numbers with the funds government agencies spent preparing the U.S. for a pandemic makes for grim reading; in that same period, the federal government allocated just $13.2 billion to research-and-development countermeasures, managed by the Biomedical Advanced Research and Development Authority, or Barda, and Project BioShield - and to procurement of countermeasures for the national stockpile. Read:Coronavirus update: U.S. death toll edges closer to 150,000, and White House Task Force says 21 states are in the 'red zone' \"These agencies depend on [government-business collaborations] for countermeasure development, production, and delivery. A business contribution to the pandemic preparedness effort of just 1 percent of the $5.3 trillion that the S&P 500 corporations dissipated on buybacks over the same ten years would have represented four times the countermeasure funding provided by the federal government,\" said the report. See also:Kodak's stock triples as company announces pandemic plan to start making pharmaceutical ingredients Lazonick and Hopkins analyzed two BARDA-led government-business collaborations to support their case. The first launched in 2010, the second in 2014 and aimed to develop a new kind of ventilator and deliver 10,000 units to the national stockpile. The former contract went to California-based Newport Medical Instruments, the second to Pennsylvania-based Respironics. But both of those companies were taken over by bigger, well-funded companies in the medical-device industry. Newport was acquired by Covidien in 2012, which was then acquired by Medtronic PLC MDT, +0.81%, both U.S.-based companies with tax-inversion deals in Ireland. Respironics was taken out by Royal Philips of the Netherlands in 2008. \"As of mid-July 2020, not a single ventilator from the contracts had been delivered to the [national stockpile],\" the authors wrote. The report notes the sums spent by the leading makers of PPE including N95 masks 3M MMM, +0.94%, Honeywell HON, +0.34%  and Kimberly-Clark KMB, +1.45%  on shareholder returns. From 2010 to 2019, 3M distributed 121% of its profits to shareholders, Honeywell gave 90% and Kimberly-Clark distributed 129%. The biggest U.S. PPE distributor, McKesson MCK, -1.75%, paid out 115% of its profits to shareholders in the same period, with 100% of profits distributed as buybacks. The second biggest, Cardinal Health CAH, -1.33%, paid out 101% and 57%, respectively, said the report. \"It's well past time for these executives and directors to recognize their responsibility for the failure of corporate America to deal with the key social crises of our times: pathogen pandemics, income equity, and climate change,\" the authors wrote. From the MarketWatch archives (December 2017):Share buyback machine now in overdrive - dropping a strong hint at what CEOs plan to do with savings from Republican corporate-tax cut"}]}