{"article": [{"url": "https://www.marketwatch.com/story/ford-sales-halved-in-the-second-quarter-2020-07-30", "published": 1596131060.0, "headline": "Ford sales halved in the second quarter", "body": "Ford Motor Co. late Thursday reported a narrower-than-expected adjusted loss in the second quarter, with sales halved in comparison with a year ago but in line with Wall Street forecasts. Ford F, -1.36% said it earned $1.1 billion, or 28 cents a share, in the quarter, including a $3.5 billion gain on investments in Argo AI, and compared with earnings of 4 cents a share in the year-ago period. Adjusted for one-time items, the company lost 35 cents a share in the quarter, contrasting with an adjusted profit of 28 cents a share a year ago. Revenue fell 50% to $19.4 billion from $38.9 billion a year ago. Analysts polled by FactSet had expected Ford to report an adjusted loss of $1.17 a share on sales of $19.4 billion. Ford shares rose nearly 4% in after-hours trading as the company also sought to assuage any concerns about its liquidity and said it remained focused on autonomous and electric vehicles. The stock pared gains as the extended session progressed. The second-quarter adjusted loss “wasn’t nearly as steep as the Street had anticipated,” said Garrett Nelson, an analyst with CFRA. “From our perspective, the biggest positive was guidance for Q3 adjusted EBIT” between $500 million and $1.5 billion, which is ahead of the current consensus of $477 million “and implies significant improvement from the Q2 loss of $1.95 billion.” Nelson cautioned, however, that while results were “solid,” Ford shares already had a sharp rebound from their March lows “and the company remains in the middle of an expensive, multi-year restructuring. “Additionally, we don’t see Ford’s sales returning to pre-pandemic levels anytime soon, but we think the buzz surrounding the Bronco and Mustang Mach-E are positives.” In a call with analysts following results, Chief Executive Jim Hackett said that the recently revealed, all-new Bronco has been received with an outpouring of enthusiasm, and reservations for the vehicle, at 150,000, are past even the company’s “most optimistic initial projections.” Hackett said that he feels “better and better” about the company’s decision to focus on SUVs and pickup trucks rather than on sedans two years ago. It was a controversial move at the time but it has paid off, he said. Ford delivered “a strong Q2 while keeping each other safe, caring for customers and neighbors, and assuring tomorrow,” Hackett said in a statement before the call. Ford highlighted “further progress” in cost-cutting moves and capital expenditures and said it clinched the deal with Volkwagen AG VOW, -0.20% for commercial vehicles, electric vehicles and pickups. See also:Chinese electric-car maker Li Auto soars 50% post IPO The auto maker said it had more than $39 billion in cash at end of the quarter, partly due to $10 billion in new debt during the three-month period, and this week repaid $7.7 billion against revolving credit lines. “The company’s almost $40 billion in liquidity today is expected to be sufficient to maintain or exceed a target cash balance of $20 billion through the second half of this year, even if global demand declines or there is another major wave of pandemic-related plant closures,” Ford said in a statement. Ford’s earnings comes as Tesla Inc. TSLA, +1.89% and General Motors Co. GM, -0.15% reported better-than-expected second-quarter earnings. GM earlier this week reported a narrower-than-expected loss mostly on the sales of its pickup trucks, and said nearly all its U.S. factories are running at pre-pandemic levels. Tesla last week reported a surprise quarterly profit, setting the stock on a course to join the S&P 500 index. Ford shares have lost 28% so far this year, compared with losses around 8% for the Dow Jones Industrial Average DJIA, +0.56% and contrasting with gains around 0.4% for the S&P 500 index SPX, +0.87% ."}]}