{"article": [{"url": "https://www.marketwatch.com/story/judge-tosses-princess-cruise-passenger-lawsuit-over-covid-related-emotional-distress-what-that-could-mean-for-other-coronavirus-court-battles-2020-07-24", "published": 1595777480.0, "headline": "Judge tosses Princess Cruise passenger lawsuit over coronavirus-related distress â\u0080\u0094 how that affects similar court battles", "body": "Months after a cruise ship was forced to dock amid a coronavirus outbreak on board, some of the passengers allegedly traumatized by that experience will not find any safe harbor with the courts. Central District of California Judge R. Gary Klausner dismissed the cases filed by a slew of Grand Princess passengers, saying that while they may have shared the boat with approximately 3,500 other people â\u0080\u0094 including 21 who contracted COVID-19 â\u0080\u0094 but they were not in the legal â\u0080\u009czone of dangerâ\u0080\u009d to recoup on claims of emotional distress. “ The ruling hinged on the â\u0080\u0098zone of dangerâ\u0080\u0099 test, which awards plaintiffs for emotional injury when they can show â\u0080\u0098physical impactâ\u0080\u0099 due the defendantâ\u0080\u0099s negligence. ” The decision by Klausner, who was appointed to the federal bench during George W. Bushâ\u0080\u0099s administration, is one of the first to weigh in on whether people can assert emotional distress for exposure to the coronavirus if they donâ\u0080\u0099t contract the virus, observers say. And the ruling arrives at quite a moment. As lawsuits pile up for all sorts of problems related to the coronavirus outbreak, Republican lawmakers want to tie another round of financial stimulus to liability shields for businesses, health-care providers and schools. If businesses have to cope with a deluge of cases, they might support a liability shield to avoid big legal costs or hits to their public image, said Carl Tobias, a professor at the University of Richmond School of Law. But when it comes to jurisprudence, businesses, on balance, may have â\u0080\u009cenough protection in the law as it presently exists,â\u0080\u009d he added. See also:Walmart hit with wrongful-death lawsuit by estate of worker who died of coronavirus The Grand Princess started its voyage on Feb. 21, bound for Hawaii. By March 9, it docked in Oakland, Calif., with 21 confirmed coronavirus cases. Attorneys for two passengers, Ronald and Eva Weissberger, filed a negligence lawsuit against Princess Cruise Lines CCL, +0.51% Â while they were still aboard the cruise. Ultimately, the Weissbergers did not test positive for the virus and didnâ\u0080\u0099t suffer symptoms, Klausner noted. Other passengers who also didnâ\u0080\u0099t contract the virus sued Princess Cruise Lines over their fears of infection in more than 10 similar lawsuits. There were approximately 50 plaintiffs in those cases. Sickened passengers and the survivors for several deceased passengers also have pending lawsuits against Princess Cruise Lines. “ If passengers prevailed, attorneys for the company said â\u0080\u0098businesses, school, churches and other venues across America will be forced to keep their doors closed long after state stay-at-home orders are lifted.â\u0080\u0099 ” â\u0080\u009cWe are grateful for the courtâ\u0080\u0099s decision which is consistent with established legal precedent,â\u0080\u009d the company said in a statement. A company spokesperson said Princess looked forward to â\u0080\u009conce again serving the millions of guests.â\u0080\u009d Ahead of Klausnerâ\u0080\u0099s decision last week, Princess Cruise Linesâ\u0080\u0099 attorneys said the cases werenâ\u0080\u0099t just about one ill-fated voyage. â\u0080\u009cPlaintiffsâ\u0080\u0099 claims threaten the ability of businesses to reopen and for the economy to resume,â\u0080\u009d lawyers said in court papers. If the passengers prevailed, the attorneys said â\u0080\u009cbusinesses, school, churches and other venues across America will be forced to keep their doors closed long after state stay-at-home orders are lifted, lest they risk crushing liability to each and every one of their invitees for emotional distress, based on the mere possibility of infection.â\u0080\u009d Donâ\u0080\u0099t miss:Going to the gym, salon or a political rally? Be warned: You may be asked to sign a coronavirus liability waiver That was an extreme argument, according to the passengersâ\u0080\u0099 attorneys. But Klausner said he did not believe that fears of unlimited liability are overblown. â\u0080\u009cThe risk of exposing individuals to COVID-19 is not unique to cruise ships â\u0080\u0094 quite the contrary,â\u0080\u009d he said. “ â\u0080\u0098Itâ\u0080\u0099s limited to negligent infliction of emotional distress under maritime law, and thatâ\u0080\u0099s as far as it goes.â\u0080\u0099 ” â\u0080\u0094 Christopher Kende, a member at Cozen Oâ\u0080\u0099Connor The ruling hinged on the â\u0080\u009czone of dangerâ\u0080\u009d test. The legal test awards plaintiffs for emotional injury when they can show â\u0080\u009cphysical impactâ\u0080\u009d because of the defendantâ\u0080\u0099s negligence, or when they can show â\u0080\u009cimmediate risk of physical harm by that conduct.â\u0080\u009d Passengers said they were at immediate risk of harm, but Princess Cruise said a 1997 Supreme Court decision about a workerâ\u0080\u0099s asbestos exposure shut down the argument. The 1997 ruling said plaintiffs needed to allege they contracted a disease or showed symptoms before they could successfully sue. Experts were split whether the decision carried broader significance. The decision was notable because it was one of the first on the question of emotional distress over coronavirus exposure, said Christopher Kende, an attorney with the Philadelphia-based law firm Cozen Oâ\u0080\u0099Connor, who represents ship owners, airlines and insurers. But it was just one decision, he said. â\u0080\u009cItâ\u0080\u0099s limited to negligent infliction of emotional distress under maritime law, and thatâ\u0080\u0099s as far as it goes,â\u0080\u009d Kende said â\u0080\u0094 but itâ\u0080\u0099s possible a different court could also take a broader view, he added. “ â\u0080\u0098If you canâ\u0080\u0099t win in California, or have a shot in California, that makes it tough.â\u0080\u0099 ” â\u0080\u0094 Carl Tobias, professor at the University of Richmond School of Law. As the pandemic continues, Tobias said there could be â\u0080\u009cplenty of peopleâ\u0080\u009d thinking about suing over worries about exposure. The decision in the Grand Princess lawsuit could make it a more difficult case. â\u0080\u009cItâ\u0080\u0099s not to say they couldnâ\u0080\u0099t win, but they have to show more than an â\u0080\u0098abstractâ\u0080\u0099 notion they were afraid,â\u0080\u009d Tobias said. It was notable the ruling came down in California because the stateâ\u0080\u0099s judiciary has historically been friendly to plaintiffs, Tobias added. â\u0080\u009cIf you canâ\u0080\u0099t win in California, or have a shot in California, that makes it tough.â\u0080\u009d Debi Chalik, lead attorney for the plaintiffs and other Princess Cruise Line passengers with pending cases, said she was disappointed, but decided not to appeal the decision. â\u0080\u009cI donâ\u0080\u0099t think allowing the case to go forward would in any way open any kind of door to incessant litigation.â\u0080\u009d Many consumers might not have the appetite for legal fights, one poll suggests: 70% of people said they would not sue if exposed to COVID-19, according to a Yahoo Finance and the Harris Poll conducted this month with 2,094 people, while 66% said they wouldnâ\u0080\u0099t consider a case against their employer if exposed to the virus on the job."}]}