{"article": [{"url": "https://www.marketwatch.com/story/the-decline-of-the-us-dollar-could-happen-at-warp-speed-in-the-era-of-coronavirus-warns-prominent-economist-stephen-roach-2020-06-22", "published": 1592948780.0, "headline": "The decline of the U.S. dollar could happen at 'warp speed' in the era of coronavirus, warns prominent economist Stephen Roach", "body": "Stephen Roach, a Yale University senior fellow and former Morgan Stanley Asia chairman, tells MarketWatch that his forecast for a sharp deterioration of the U.S. dollar could be a very near-term phenomenon, not an event that looms off in the distance. \"I do think it's something that happens sooner rather than later,\" the economist told MarketWatch during a Monday-afternoon interview. His comments come as the financial expert has been warning for weeks of an epic downturn of the buck that could signal the end of the hegemony of the greenback as a reserve currency - an event that would ripple through global financial markets. Check out: 'The dollar is going to fall very, very sharply,' warns prominent Yale economist \"In a COVID era everything unfolds at warp speed,\" Roach told MarketWatch on Monday. He pointed to the contraction of the U.S. economy from an employment rate that was hovering around a 50-year low at around 3.5% near the start of 2020 to one that shows some 49 million people unemployed since the pandemic took hold in March. He also noted the rapid and unprecedented fiscal and monetary response that has ballooned the Federal Reserve's balance sheet to more than $7.2 trillion from $4 trillion at the start of the year as examples of the celerity at which the currency market could change. Read: A by-the-numbers look at COVID-19's toll on American lives and livelihoods Roach is calling for the dollar to soon decline 35% against its major rivals, citing increases in the nation's deficit and dwindling savings. \"This massive shift to fiscal stimulus is going to blow out the national savings rates and the current-account deficit,\" he told MarketWatch, reiterating comments he has previously made in interviews and in an op-ed that published by Bloomberg News on June 14. Last week, the U.S. current-account deficit, a measure of the nation's debt to other countries, slipped 0.1% in the first quarter, falling to $104.2 billion from a revised $104.3 billion in the 2019 fourth quarter. The current account reveals if a country is a net lender or debtor. Roach said that his recent warnings about the dollar have garnered intense and emotional responses from readers and critics, because he believes that the U.S. is at a particularly sensitive time in history. He said the racial upheaval - sparked by the death of George Floyd - the pandemic and the intensity of the presidential election have combined to elicit powerful responses from readers that he hasn't gotten since his days writing financial commentary at Morgan Stanley. He said during this time you're going to get \"hair-trigger responses\" from people. \"We're at a critical point in the political cycle and the dollar is a relative price, so you're making a comparison to the United States and other countries and there are just really strong views against the analysts that\" call into question U.S. dominance, he explained. Asked if investors should be fearful of a downturn of the dollar, Roach said that this wouldn't be the first time the dollar has slumped meaningfully, and that \"fear is a question of context.\" Fear may be justified \"if they are unprepared and not hedged and have not thought about what some of the options are take advantage,\" he said, pointing to the euro as a possible alternative to dollars for currency buyers. In the past, he has said that China's yuan USDCNY, CNHUSD, +0.72%  may be viewed as increasingly appealing to investors, but that view is contingent on China following through with structural reforms the country is undergoing from a manufacturing-heavy economy to one focused more on services. One measure of the buck, the ICE U.S. Dollar Index DXY, -0.58%, has been weakening over the past 30 days, down 2.9%, but is up slightly on the year, rising 0.7%, according to FactSet data. The index measures the buck against a basket of six rival currencies, including the euro EURUSD, +0.60%, the pound GBPUSD, +0.83% and the yen USDJPY, -0.38%. A weaker dollar has implications for assets and the stock market, including the Dow Jones Industrial Average DJIA, +0.56% and S&P 500 index SPX, +0.87%, with most debts denominated in dollars. In addition, a majority of cross-border financing and international trade are conducted in dollars. Read Roach on Project Syndicate too: The COVID Shock to the Dollar"}]}