{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-struggle-for-direction-as-investors-weigh-us-china-tensions-against-improving-eurozone-data-2020-07-24", "published": 1595608820.0, "headline": "30-year Treasury yield falls below 1.25% as investors weigh geopolitical tensions against improving eurozone data", "body": "U.S. Treasury yields stood steady on Friday as investor worries around worsening relations between the world’s two largest economies was offset by signs that the eurozone economic recovery remained on track.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% was up 0.7 basis point to 0.589%, trimming the benchmark note’s weekly drop to 3.9 basis points. The 2-year note rate TMUBMUSD02Y, 0.156% was at 0.147%, and unchanged for the week. The 30-year bond yield TMUBMUSD30Y, 1.576% fell 1.1 basis points to an April low of 1.238%, contributing to a 9.1 basis point drop this week. Bond prices move in the opposite direction of yields. What’s driving Treasurys? Tensions between the U.S. and China heated up as Beijing ordered the closure of the U.S. consulate in Chengdu, retaliating against Washington’s move to close the Chinese consulate in Houston. On Thursday, Secretary of State Mike Pompeo called on governments around the world to join the U.S. in confronting China’s Communist Party leaders. The S&P 500 SPX, +0.87% stock index and Dow Jones Industrial Average DJIA, +0.56% finished lower Friday, but didn’t bolster prices for government bonds after a round of positive economic data from Europe. The eurozone flash purchasing managers indexes rebounded sharply in June, with the eurozone manufacturing PMI rising to 51.1 from 47.4 and the services PMI jumping to 55.1 from 48.3. Any reading above 50 indicates improving economic conditions. The 10-year German government bond rate TMBMKDE-10Y, -0.521% rose 3.7 basis points to negative 0.45%, while the equivalent Italian 10-year yield TMBMKIT-10Y, 0.722% rose 2 basis points to 1.00%. U.S. economic data on Friday suggested the housing industry could provide a significant tailwind for the economy as it looks to recover from the coronavirus crisis. New home sales for June rose 13.8% last month to an annualized pace of 776,000, the Commerce Department said Friday. Looking ahead, investors will eye the Federal Reserve’s two-day meeting next week where the central bank may announce further policy measures on its bond purchases and even open the door to capping bond yields for certain maturities, or yield curve control. But analyst warn any big changes to Fed policy are unlikely to come until it concludes its review of its inflation-fighting framework this year.What did market participants’ say? “We doubt the FOMC is ready to move forward with new policy tools. Just like no one would ever attempt to build a house from the roof down, it is extremely unlikely that the Fed announces yield-curve control or even quantitative easing before forward guidance,” said Aneta Markowska, chief financial economist for Jefferies, in a note."}]}