{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-hold-steady-after-trump-issues-stimulus-executive-order-2020-08-10", "published": 1597076000.0, "headline": "Long-term Treasury yields move higher as traders make room for record auctions", "body": "Long-term U.S. Treasury yields rose on Monday as traders made room for this week’s record auctions of government bonds, which will finance the response to the COVID-19 pandemic.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 1.1 basis points to 0.573%, compared with 0.562% on Friday. The two-year note TMUBMUSD02Y, 0.156% was at 0.129%, after trading at 0.127% at the end of last week. The 30-year bond yield TMUBMUSD30Y, 1.576% was virtually unchanged at 1.230%.What’s driving Treasurys? This week, bond traders will take down a wave of bond supply, after the Treasury Department increased the size of all of its major debt auctions to their highest levels last week. The U.S. Treasury will sell $112 billion of notes and bonds across maturities ranging between three years and 30 years this week. Without significant catalysts for trading, supply played a part in putting pressure on the bond market Monday as dealers and traders priced in a “concession,” in effect, lifting yields to accommodate the new issuance. President Donald Trump issued an executive order and memorandums over the weekend aimed at boosting the U.S. economy. He announced an extension of federal unemployment benefits to $400 a week and ordered that companies will be able to avoid paying payroll taxes. But economists say the order is likely to face legal challenges. However, the president’s moves may provide some incentive for congressional lawmakers to return to the negotiating table. On the data front, the Labor Department said job openings in the U.S. stood at 5.9 million, increasing for a second straight month. Still, that figure falls short of the 7 million seen before the pandemic. What did market participants say? “In the absence of any new salient information, the curve incrementally steepened ahead of $112 billion in coupon supply over the next 72 hours,” said Jon Hill, an interest-rate strategist at BMO Capital Markets."}]}