{"article": [{"url": "https://www.marketwatch.com/story/this-tearful-video-of-a-georgia-police-officer-accusing-mcdonalds-of-withholding-her-egg-mcmuffin-order-on-purpose-has-gone-viral-2020-06-17", "published": 1592576660.0, "headline": "This video of a tearful Georgia police officer accusing McDonaldâ\u0080\u0099s of withholding her Egg McMuffin order on purpose has gone viral", "body": "Thereâ\u0080\u0099s not much sympathy online for this cop crying over an Egg McMuffin. A video of a tearful Georgia police officer accusing McDonaldâ\u0080\u0099s MCD, -0.43% Â workers of withholding her breakfast order went viral on Twitter TWTR, -0.23% Â on Wednesday, leading the local franchisee to apologize to the officer and clarify to MarketWatch that she â\u0080\u009cwas never denied service.â\u0080\u009d A Twitter user who called herself â\u0080\u009cAnnâ\u0080\u009d and identified as a conservative Trump supporter in her profile, which has since been taken down, posted the clip of a woman that has been identified as Stacy Talbert, who sobs while recounting how the restaurant workers kept her waiting and withheld part of her breakfast order. Talbert suggests this was done on purpose as part of the growing backlash against officers and the calls for police reform in the weeks since Breonna Taylor, George Floyd and Rayshard Brooks were killed during their encounters with law enforcement. â\u0080\u009cStacey [sic] who has been a cop for 15 yrs went to @McDonalds,â\u0080\u009d Ann writes in her post, which has since been taken down. â\u0080\u009cShe paid for it in advance and this is how she gets treated for being a cop.â\u0080\u009d MarketWatch reached out to Ann, but she did not respond by press time. But the local McDonaldâ\u0080\u0099s owner/operators confirmed the incident to MarketWatch, and Talbert later verified the video to NBC News. Annâ\u0080\u0099s post was viewed at least 13.4 million times and retweeted tens of thousands of times by Wednesday evening; itâ\u0080\u0099s not clear when the post or the account was taken down. But it renewed a heated online debate about the relationship between police officers and the communities they serve. Talbert, a sheriffâ\u0080\u0099s deputy in McIntosh County, Ga., told NBC that she recorded herself on Facebook Live FB, +0.26% Â on Monday morning after finishing an overnight shift. The clip, which is just under 2Â½ minutes, features her explaining that she placed a mobile order for an Egg McMuffin meal. But her order wasnâ\u0080\u0099t ready when she went to pick it up. â\u0080\u009cAnd Iâ\u0080\u0099m waiting. And Iâ\u0080\u0099m waiting. And Iâ\u0080\u0099m waiting,â\u0080\u009d she says, noting that she was hungry because she had not eaten for a very long time. She was told to pull over to the side, and an employee eventually came over and gave her a coffee. But Talbertâ\u0080\u0099s order was supposed to include an Egg McMuffin and a hash brown, as well. â\u0080\u009cThatâ\u0080\u0099s all she hands me is the coffee,â\u0080\u009d she says, breaking down into tears. â\u0080\u009cI said, â\u0080\u0098Donâ\u0080\u0099t bother with the food because right now Iâ\u0080\u0099m too nervous to take it!â\u0080\u0099 It doesnâ\u0080\u0099t matter how many hours Iâ\u0080\u0099ve been up. It doesnâ\u0080\u0099t matter what Iâ\u0080\u0099ve done for anyone. Right now, Iâ\u0080\u0099m too nervous to take a meal from McDonaldâ\u0080\u0099s because I canâ\u0080\u0099t see it being made!â\u0080\u009d She pleaded with people watching the video to, â\u0080\u009cPlease, just give us a break. I donâ\u0080\u0099t know how much more I can take.â\u0080\u009d She added that she has never had such anxiety in all of her years of service, and asked people to say â\u0080\u009cthank youâ\u0080\u009d when they see cops. Related:The police officer crying in that viral Egg McMuffin video wants you to know sheâ\u0080\u0099s â\u0080\u0098sick of people being meanâ\u0080\u0099 The original poster, Ann, also shared the phone number of that particular McDonaldâ\u0080\u0099s restaurant at the Loveâ\u0080\u0099s Travel Stop in Richmond Hill, Ga. â\u0080\u009cCome on America. We are better than this,â\u0080\u009d she wrote. But many of the tens of thousands of comments beneath the video have taken a less supportive tone. In fact, some viewers claimed they were going to call the restaurant to demand raises for the workers who had to â\u0080\u009cdeal with Officer Karenâ\u0080\u009d instead. Some pointed out that Talbert had no idea what was going on inside the kitchen or restaurant while her order was being prepared. â\u0080\u009cShe thinks fast food workers have time to delay her order intentionally as if they arenâ\u0080\u0099t constantly being micromanaged, or that they can even keep track of who had a single egg McMuffin,â\u0080\u009d wrote one. AnotherÂ wrote,Â â\u0080\u009cMy first job was at McDonaldâ\u0080\u0099s. The drink always comes out first. Breakfast sandwiches are made in batches, unless you asked for something special the person in the back is just making batches of them. Hashbrowns are fried in the deep fryer & batches have to be made.â\u0080\u009d Local McDonaldâ\u0080\u0099s operator/owners Gary and Jill Stanberry told MarketWatch in an emailed statement that they have been in contact with Talbert to apologize. â\u0080\u009cUnfortunately, we were made aware of a local police officer who experienced a longer than usual wait time and did not receive her full order right away at one of our restaurants. We have been in contact with this officer to apologize for this unsatisfactory experience and let her know that we would love to correct the inaccurate order when she has time. We are happy to report that the officer was never denied service and also shared positive feedback on the employee with whom she interacted,â\u0080\u009d the owners told MarketWatch. â\u0080\u009cOur priority is for all customers to feel welcome and enjoy a great customer experience in our family-owned restaurants, including local law enforcement officers who protect and serve our community,â\u0080\u009d they added.Â Â â\u0080\u009cAs a locally owned and operated business, we work hard every day to treat all of our employees and customers with dignity and respect.â\u0080\u009d Other commentators highlighted the systemic injustices against people of color that have been highlighted and protested with renewed vigor in recent weeks. â\u0080\u009cImagine the worst oppression youâ\u0080\u0099ve ever felt is McDonaldâ\u0080\u0099s making you wait 10 minutes for a McMuffin,â\u0080\u009d wrote a user under the name Sarina. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Other critics questioned Talbertâ\u0080\u0099s ability to serve as an officer if she is this upset about her food being delayed. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Talbert countered those complaints in an interview with BuzzFeed News. â\u0080\u009cIt was exactly how every single officer feels,â\u0080\u009d she said, â\u0080\u009cand if they donâ\u0080\u0099t feel compassion or emotion, if they donâ\u0080\u0099t cry over anything, I promise you that is not the officer that you want on the street.â\u0080\u009d Still others just made fun of the clip, which led to terms such as â\u0080\u009cOfficer Karenâ\u0080\u009d and â\u0080\u009cMcMuffinâ\u0080\u009d trending on Twitter on Wednesday morning. â\u0080\u009cKarenâ\u0080\u009d has become a slang term for the stereotype of an entitled, privilege white woman. Talbert responded to these remarks by telling NBC sheâ\u0080\u0099s laughed at some of the jokes. â\u0080\u009cItâ\u0080\u0099s actually kind of funny,â\u0080\u009d she said. But she noted that the original intent of her post has been lost. â\u0080\u009cIâ\u0080\u0099m just so sick of people being mean ... I just wanted to share that I hurt, too.â\u0080\u009d There were also Twitter users expressing love and support for law enforcement officers with hashtags like #BackTheBlue and #DefendThePolice, or floating the idea of a boycott against McDonaldâ\u0080\u0099s. â\u0080\u009cCops are losing their confidence with so much hate around. Sheâ\u0080\u0099s exhausted and fear has crept in,â\u0080\u009d wrote one user under the name Jill Gooding. â\u0080\u009cWe are in a very sad state of affairs.â\u0080\u009d This video went viral just days after two New York Police Department Unions accused Manhattan Shake Shack SHAK, +1.82% Â employees of poisoning officers by mixing bleach into their milkshakes. But the NYPDâ\u0080\u0099s Chief of Detectives Rodney Harrison laterÂ tweetedÂ that there was â\u0080\u009cno criminalityâ\u0080\u009d involved, and in fact, the officers were inadvertently sickened as a result of the â\u0080\u009cfaulty cleaningâ\u0080\u009d of a machine. This article was originally published on June 17, and has been updated with the officerâ\u0080\u0099s identity and her comments. It also notes that the original Twitter post that went viral has been taken down, as has that account."}]}