{"article": [{"url": "https://www.marketwatch.com/story/10-year-treasury-yield-climbs-above-075-on-recovery-in-us-retail-sales-and-report-of-1-trillion-infrastructure-spending-plan-2020-06-16", "published": 1592325020.0, "headline": "30-year bond yield sees biggest jump in a month on recovery in U.S. retail sales", "body": "Treasury yields rose Tuesday, marking a three-day streak of increases, after data showed U.S. May retail sales recovered by more than expected, and in the wake of a report that the White House was contemplating a $1 trillion infrastructure spending plan to add to fiscal stimulus already approved by Congress.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 5.3 basis points to 0.754%, while the two-year note rate TMUBMUSD02Y, 0.156% was up 1.4 basis points to 0.203%. The 30-year bond yield TMUBMUSD30Y, 1.576% climbed 9 basis points to 1.538%, marking its biggest one-day increase since May 18. What’s driving Treasurys? A sharp surge in retail sales helped to underscore the rapid progress made by efforts to reopen the U.S. economy, showing signs that consumers were willing to spend despite a surge in unemployment. Sales at U.S. retailers rose 17.7% in May, compared with a forecast 8.5% increase and a revised 14.7% fall in April. Yet even after the rebound in May, sales were still 6% lower compared to the same month in 2019. In other U.S. data, industrial production rose by a slight 1.4% last month, after slumping 12.5% in April. The NAHB Homebuilders’ index rose 21 points to a reading of 58 in June. Earlier, Bloomberg News reported that the Trump administration is preparing a nearly $1 trillion infrastructure plan. Not only will infrastructure spending lift economic growth and inflation expectations, a bugaboo of bond investors, but it could also increase the amount of new long-dated government bond issuance, said analysts. Read: It’s ‘unrealistic’ for investors to bet on Trump administration’s $1 trillion infrastructure plan, analyst says Risk assets also received a boost after the Federal Reserve said Monday it would start buying corporate bonds from the market for the first time as part of its plans to buy a broad basket of corporate bonds based on an index of its own creation. But Fed Chairman Jerome Powell said the central bank was switching away from purchases of exchange-traded funds, and this would not necessarily lead to a change in the pace of corporate-bond purchases unless market conditions shifted. This appeared to dampen hopes that the Fed was using Monday’s announcement to allow the central bank to hoover up more corporate debt. Read: This ‘sticking point’ is holding back the Fed from hoovering up corporate debtWhat did market participants say? “This is good data for the equity and risk markets, which have been struggling with the FOMC rate decision and the surge in COVID-19 cases. It really shows that the reopening of the U.S. economy is happening, and the numbers support it,” said Kevin Giddis, chief fixed-income strategist at Raymond James, referring to May’s retail sales release."}]}