{"article": [{"url": "https://www.marketwatch.com/story/investing-legend-known-for-his-annual-predictions-says-the-world-could-be-in-for-a-big-surprise-in-a-good-way-11599595026", "published": 1599581660.0, "headline": "Investing legend known for his annual predictions says the world could be in for a big surprise â\u0080\u0094 in a good way", "body": "Byron Wien Bloomberg Blackstoneâ\u0080\u0099s BX, -0.67% Byron Wien has been offering up his list of potential surprises for decades now. As with even the most prescient of Wall Street pundits, heâ\u0080\u0099s got plenty of misfires to go along with his hits, but CNBCâ\u0080\u0099s Jim Cramer once said, â\u0080\u009cyou can make a fortuneâ\u0080\u009d from Wienâ\u0080\u0099s work. So, in that spirit, whatâ\u0080\u0099s his latest take on the market? Well, back in January, Wien was bearish on electric cars, bullish on the economy and predicted that volatility VIX, -5.15% would ultimately slam the markets. Now, with his batch of calls yielding mixed results, Wien offered up a taste of what he sees in the coming months. “ â\u0080\u0098A big surprise on a global level is if there were more harmony between China and the West. The hostility between the two largest economies in the world is not good for the markets. So if there would be some reconciliation or some rapprochement between the U.S. and China that would restore normal relations, it would be interpreted favorably by the financial markets. Thatâ\u0080\u0099s unlikely in a Trump presidency. Itâ\u0080\u0099s more likely, but not certain, in a Biden presidency.â\u0080\u0099 ” Thatâ\u0080\u0099s how Wien responded when asked his thoughts looking forward in an interview published over the long weekend. While thawing relations between China and the U.S. might eventually provide a boost to markets, for now, itâ\u0080\u0099s rough going out there. â\u0080\u009cThereâ\u0080\u0099s a lot of speculation going on. Thatâ\u0080\u0099s probably not a healthy thing,â\u0080\u009d he said, adding that he sees the economy rebounding more slowly than most expect. â\u0080\u009cThe market is vulnerable.â\u0080\u009d Wien said the common train of thought is that the economy isnâ\u0080\u0099t doing as well as the financial markets, but he doesnâ\u0080\u0099t see it that way. â\u0080\u009cThere really isnâ\u0080\u0099t a disconnect,â\u0080\u009d he said. â\u0080\u009cIndividual investors are propelling the market to new highs, and they are doing it by pushing up the prices of the internet related stocks, the stocks that are benefiting from people working at home. â\u0080\u009c Wien also threw water on the comparisons between today and the dot-com bubble, saying he believes every market cycle to be different. â\u0080\u009cIn the late nineties, the dot-com bubble was fueled by a real breakthrough in technology, the advent of the internet. It was changing peopleâ\u0080\u0099s lives, and that was a positive change. It just got carried to excess,â\u0080\u009d he said. â\u0080\u009cToday, this is a different thing. Itâ\u0080\u0099s a negative surprise: A virus that is going to change the way we live, and itâ\u0080\u0099s difficult to assess the long-term implications of it.â\u0080\u009d Wien said, from his perspective, that stocks are overpriced, but not as â\u0080\u009coutrageouslyâ\u0080\u009d as they were back then. Hence, he doesnâ\u0080\u0099t see an imminent bear market. As for the economy, the healing could take a while, and, according to Wien, it depends on an effective vaccine, which may or may not arrive by the end of the year â\u0080\u0094 a time frame that he believes the stock market is already pricing in. â\u0080\u009cThatâ\u0080\u0099s a realistic assumption,â\u0080\u009d he said. â\u0080\u009cBut I donâ\u0080\u0099t think that people like me will get it until the end of next year. So a return to normal is a 2022 phenomenon. At best, the economy is a quarter or one third of the way back to normal.â\u0080\u009d Whatâ\u0080\u0099s an investors to do in the meantime? â\u0080\u009cThere is a good part of the market thatâ\u0080\u0099s underpriced,â\u0080\u009d he said. â\u0080\u009cAirlines, transportation and hospitality have performed poorly, and some represent good value for patient investors who can tolerate the risk as a part of their portfolio.â\u0080\u009d Patience was needed Tuesday, as the Dow Jones Industrial Average DJIA, +0.56%, Nasdaq Composite COMP, +1.39% and S&P 500 SPX, +0.87% were all firmly in negative territory."}]}