{"article": [{"url": "https://www.marketwatch.com/story/gold-edges-toward-1900-an-ounce-as-us-china-tensions-mount-2020-07-24", "published": 1595600300.0, "headline": "Gold scores a record close as U.S.-China tensions mount", "body": "Gold futures on Friday scored a record finish, with prices up almost 5% for the week, as rising U.S.-China tensions and jitters about the economic outlook fueled haven-related demand for the precious metal. “Looking at the longer term outlook, the currently very uncertain macro backdrop paired with unprecedented stimulus measures and near record-low interest rates, the gold rally should be sustainable for months and likely quarters to come,” Tyler Richey, co-editor at Sevens Report Research, told MarketWatch. China on Friday ordered the U.S. to close its consulate in the western city of Chengdu, the latest salvo in a dispute between Washington and Beijing. The U.S. earlier this week ordered China to close its Houston consulate, alleging Chinese agents had tried to steal data from facilities in Texas. Tensions between the two of the world’s economic superpowers “prompted a risk-off move in markets,” analysts at UBS wrote in a research note dated Friday. The analysts said that while they expect gold to continue “to be supported by rising geopolitical tensions,” they believe the “primary drivers of the gold price are its negative correlation to real interest rates and the dollar.” Those factors, “in combination with limited supply growth as miners continue to restrain capex spending, will drive gold prices higher,” they said. August gold GC00, +2.17% US:GCQ20, the most actively traded contract on Comex, climbed by $7.50, or 0.4%, to settle at $1,897.50 an ounce. That surpassed the all-time closing high of $1,891.90 for a most active contract set in August 2011, according to Dow Jones Market Data. Read:‘I would be buying now and continue to buy’ gold, says Mark Mobius investing pioneer “The active August futures contract has still failed to break out to a fresh record [intraday] high north of $1,923,” said Richey. “Based on the bullish fundamentals, which include a downward trending dollar and falling real yields, it is only a matter of time until we see new all time highs though.” The all-time intraday high for a most actively traded contract stands at $1,923.70 an ounce from Sept. 6, 2011. On Friday, August gold climbed to as high as $1,904.60. The price move comes as the front-month contract notched a fresh all-time high for a second session. The front-month July gold contract US:GCN20, which trades on much lower volume, rose $8.20, or 0.4%, to $1,897.30 on Friday. That was a record for the front-month contracts, based on data going back to 1975. Read:Gold shatters ‘summer doldrums’ as it climbs to record territory Also Friday, September silver US:SIU20 fell 14 cents, or 0.6%, to $22.85 an ounce. Read:Why silver is trading at a nearly 4-year high For the week, based on the most-active contracts, gold futures saw a 4.8% gain, while silver surged 15.6%. “The sheer magnitude of economic stimulus already delivered, and to be distributed on a continuing basis, is filtering through the precious metals markets,” said Ryan Giannotto, director of research at GraniteShares, which offers the GraniteShares Gold Trust BAR, +1.88%. “While gold is inches from its 2011 all time high, silver is not even halfway to its previous highwater mark of $50” an ounce, but “been explosive retaking ground,” he told MarketWatch. “Curiously, gold and silver have emerged neck and neck for the title of best-performing asset class of 2020, up 24% and 27% [year to date], respectively, notwithstanding the latter’s 38% collapse in price through February and March,” said Giannotto. “Perhaps the best way to conceive of the Fed’s balance sheet expansion is a tax on cash,” he explained. “In such an environment, monetary metals may be expected to sharply rally not only as a potential dollar hedge, but as alternative stores of value in their own right.” In other metals action, September copper US:HGU20 fell 1.6% to $2.8925 a pound, ending around 0.4% lower for the week. October platinum PLV20, +3.99% lost 0.8% to $956 an ounce, but saw a weekly rise of more than 12%, while September palladium US:PAU20 settled at $2,294.10 an ounce, up 2.4%, for a weekly rise of nearly 11%. The gold-backed SPDR Gold Trust GLD, +1.81% traded up 0.8%, poised for a gain of 5% for the week."}]}