{"article": [{"url": "https://www.marketwatch.com/story/will-the-public-be-ready-for-a-vaccine-many-americans-say-they-wont-get-the-coronavirus-vaccine-if-one-is-developed-2020-08-06", "published": 1596885140.0, "headline": "â\u0080\u0098Will the public be ready for a vaccine?â\u0080\u0099 Many Americans say they wonâ\u0080\u0099t get the coronavirus vaccine if one is developed", "body": "In the race to develop a vaccine to stop the novel coronavirus thatâ\u0080\u0099s killed more than half a million people and crippled economies across the globe, we may be overlooking one very important question: Will people actually want to get the vaccine if one becomes available? Even before COVID-19 reached pandemic proportions, the growing anti-vaccination movement already saw one-fifth to two-fifths of Americans questioning the safety of vaccines. And these skeptics arenâ\u0080\u0099t the only ones now questioning how safe and effective a coronavirus vaccine developed at â\u0080\u009cwarp speedâ\u0080\u009d will be, considering vaccines normally take up to a decade to develop. Dr. Anthony Fauci, the nationâ\u0080\u0099s top infectious disease expert, told Reuters on Wednesday that a coronavirus vaccine could arrive in early 2021. But many Americans arenâ\u0080\u0099t ready for it. Yahoo News and YouGov have been polling Americans for the past few months, and the most recent survey released this week finds that the public embrace of a potential vaccine has hit a new low. Only 42% of Americans said they planned to get vaccinated if and when a vaccine becomes available, which is down from 55% in late May, and 46% in early July. Combining the number of Americans who said they wouldnâ\u0080\u0099t get vaccinated with the number who said they were unsure (36%) accounts for about three quarters of the population. This is notable because estimates suggest that 70% to 90% of the country would need to be vaccinated to achieve the herd immunity needed to stop COVID-19 from spreading. Now a new survey from a collaboration by Harvard, Rutgers, Northeastern and Northwestern universities digs even deeper into why some people are ready to give a future coronavirus vaccine a shot, and why others are much more skittish. And the willingness to get vaccinated differs greatly based on where people live, their political party and several social factors, including income. “ â\u0080\u009cHealth experts expect that a COVID-19 vaccine will be ready for the public in the first half of next year. But will the public be ready for a vaccine?â\u0080\u009d ” â\u0080\u0094 Katherine Ognyanova, Rutgers University Two-thirds of adults in this national survey of almost 20,000 people said that they were likely to vaccinate themselves and their children once a COVID-19 inoculation is developed. But the percentage of those willing to get vaccinated was below 60% in 11 states, mainly in the conservative South and Midwest. Yet it was above 70% in 11 states along the more liberal West Coast and in the Northeast. There was also correlation between education level and income with a willingness to get a coronavirus vaccine, as 78% of those who had obtained at least bachelorâ\u0080\u0099s degree said they planned to get vaccinated, compared to 58% of those who didnâ\u0080\u0099t finish high school. And a little more than half (59%) of those earning less than $25,000 intended to vaccinate, versus more than three quarters (78%) of those making six figures. Whatâ\u0080\u0099s more, while 67% of white Americans, 71% of Hispanics and 77% of Asian American respondents said they were likely to get the future vaccine, barely half of African American respondents (52%) agreed â\u0080\u0094 even though the minority population has been hit especially hard by the virus. And this aligns with a Reuters/Ipsos poll from May that found that only half of Black Americans were somewhat or very interested in a vaccine. The Reuters report suggested this distrust stems from incidents like the infamous U.S. government study at Tuskegee, which deliberately left Black men untreated for syphilis for decades to study its effects on them. The subjects thought they were getting free medical care, but they actually did not receive proper medical treatment. Indeed, trust is a major factor in whether or not the roughly 20,000 Americans in the new national survey said they would seek out a coronavirus vaccine. Those who trust doctors, hospitals, scientists and researchers â\u0080\u009ca lotâ\u0080\u009d were almost four times more likely to say they would consider getting a COVID-19 vaccination over those who trust them â\u0080\u009cnot at all.â\u0080\u009d And whether one believes the media is feeding them â\u0080\u009cfake newsâ\u0080\u009d also matters, as 82% of those who trust the news media would get vaccinated, compared to 48% of those who donâ\u0080\u0099t trust it. Related:This Seattle man volunteered to be injected with an experimental COVID-19 vaccine: â\u0080\u0098It was kind of my duty as a healthy individual to step upâ\u0080\u0099 The researchers found one notable exception to the trust rule, however, and that was President Donald Trump. People with the greatest trust in Trump were the least likely to seek vaccination (61%), while those with the least trust in him were more likely (72%) to get vaccinated. Three in four Democrats (75%) surveyed also said they would likely get vaccinated, compared to Republicans and Independents, who were both at 62%. â\u0080\u009cHealth experts expect that a COVID-19 vaccine will be ready for the public in the first half of next year,â\u0080\u009d said study co-author Katherine Ognyanova from Rutgers Universityâ\u0080\u0093New Brunswick in a statement. â\u0080\u009cBut will the public be ready for a vaccine?â\u0080\u009d Maybe not. A recent CBS News poll found that half of Americans said they are taking a â\u0080\u009cwait and seeâ\u0080\u009d approach, watching what happens to others before getting vaccinated, themselves. On Long Island, New York, almost one-third of residents are â\u0080\u009cunsureâ\u0080\u009d about getting a COVID-19 vaccine, according to a Newsday survey. A San Antonio, Texas, poll found one in five people are also uncertain about getting vaccinated. Related:Race for a COVID-19 vaccine has drug makers scaling up manufacturing â\u0080\u0094 before one is developed Indeed, vaccine researcher Natalie Dean, an assistant professor of biostatistics at the University of Florida, wrote in a New York Times op-ed this week that â\u0080\u009ceven I would place myself in the â\u0080\u0098not sureâ\u0080\u0099 bucket,â\u0080\u009d as, â\u0080\u009cthe evidence that would convince me to get a COVID-19 vaccine, or to recommend that my loved ones get vaccinated, does not yet exist.â\u0080\u009d Related:Should you volunteer for a COVID-19 vaccine trial? Who qualifies, and what are the side effects? The way things stand now, legacy drug makers and small startups alike are working feverishly to develop vaccines or treatments that target COVID-19. More than 150 potential coronavirus vaccines are being developed around the world, and 27 are in human trials, the New York Times reports. They include AstraZeneca AZN, +1.16%, Novavax NVAX, +0.18%, the Pfizer PFE, -0.27% Â and BioNTech BNTX, +1.23% Â project, and Moderna MRNA, +0.09% Â â\u0080\u0094 which is entering Phase 3 of its vaccine trial. On Wednesday, Johnson & Johnson JNJ, +1.39% Â said it will receive more than $1 billion from the U.S. government to manufacture 100 million doses of its investigational COVID-19 vaccine. But developing a vaccine in record time wonâ\u0080\u0099t amount to much if itâ\u0080\u0099s not safe and effective, and if the public doesnâ\u0080\u0099t trust it. One study found that a coronavirus vaccineâ\u0080\u0099s effectiveness may have to be higher than 70% or even 80% before Americans can safely stop social distancing. By comparison, the flu vaccine is just 20% to 60% effective. Debbie Kaminer, a law professor at Baruch College in New York who has written about the legal questions around vaccination laws, wrote in a recent column that, â\u0080\u009ca safe and effective vaccine could end the coronavirus pandemic, but for it to succeed,Â enough peopleÂ will have to get inoculated.â\u0080\u009d There are now at least 18.9 million confirmed cases of COVID-19 worldwide, and 708,540 people and counting have died, according to the latest tallies on Thursday afternoon. The U.S. death toll hit 158,300 after a 10th straight day in which more than 1,000 deaths were counted. Follow MarketWatchâ\u0080\u0099s coronavirus coverage here."}]}