{"article": [{"url": "https://www.marketwatch.com/story/a-light-at-the-end-of-the-pandemic-tunnel-rolls-royce-shares-double-in-a-week-11602248144", "published": 1602234200.0, "headline": "A light at the end of the pandemic tunnel? Rolls-Royce shares double in a week", "body": "Rolls-Royce engine pictured on an Air Europa flight in Madrid, August 2020. MarketWatch/Kollmeyer There has simply been no stopping shares of Rolls-Royce Holdings lately, with the FTSE 100 listed company set to double its fortunes this week, amid some hopes the aviation industry has passed through the worst of the pandemic. Rolls-Royce UK:RR shares jumped another 18% on Friday, the fifth-straight day of gains, and its third session of double-digit gains in that period. The FTSE 100 UK:UKX rose 0.7% to 6,018.63, and poised for a weekly gain of nearly 2%. The week has delivered a 100% gain for Rolls-Royce, though it remains down 66% on the year due to the harsh hit the aviation sector has taken from the COVID-19 pandemic. Shares got a boost earlier in the week on the news that the company had secured a £1 billion ($1.3 billion) convertible bond offering, and a contract to power a gas-based power plant in India. Stocks plunged on Oct. 1 after the embattled engineer announced it would seek £5 billion through a rights issue and debt to shore up its finances. The company has proposed to generate £2 billion through a 10-for-three rights issue. As painful for shareholders as it might be, the plan “sets up Rolls-Royce to sufficiently navigate an uncertain recovery and removes any lingering concerns about liquidity (and even solvency),” said a team of Berenberg analysts, led by Andrew Gollan, in a note to clients on Friday. Joshua Mahony, senior market analyst at IG, in a note to clients, said there is a “clear willingness to go bargain hunting as traders begin to see the light at the end of the tunnel,” even amid anxiety that rising COVID-19 cases could force another U.K. lockdown. “With Trump speculating that we will see a vaccine in the coming month, and the aviation stimulus package seemingly the only thing both sides of Congress can agree on, the recent resurgence in travel stocks does represent a punt on possibility that the sector has seen the worst,” Mahony said. Elsewhere, shares of British Land UK:BLND jumped 6% after the real estate property trust reinstated its dividend, and Land Securities UK:LAND climbed 4% after saying it has collected £68 million ($88 million) of rent due on Sept. 29 within five days. The London Stock Exchange UK:LSE has agreed to sell its entire shareholdering in the parent company of Borsa Italia to Euronext FR:ENX, in a deal valued at €4.33 billion ($5.09 billion). LSE shares rose 0.8%, while Euronext stock rose 0.9%. Data showed the U.K. economy grew just 2.1% in August, disappointing forecasts for growth of 4.6%, and the slowest monthly gain since the initial coronavirus lockdowns."}]}