{"article": [{"url": "https://www.marketwatch.com/story/mark-cuban-says-he-doesnt-trade-stocks-like-he-used-to-but-hes-still-loading-up-on-some-of-his-favorites-2020-08-26", "published": 1598693720.0, "headline": "Mark Cuban says he doesnâ\u0080\u0099t trade the stock market like he used to â\u0080\u0094 but heâ\u0080\u0099s still sticking with these favorites", "body": "“ â\u0080\u0098I used to trade a lot. I used to be very, very active as a trader. Back in the 90s and early 2000s, there was a lot less money chasing more stocks. And now thereâ\u0080\u0099s a lot more money chasing fewer stocks. Itâ\u0080\u0099s harder to trade and be successful.â\u0080\u0099 ” Thatâ\u0080\u0099s Mark Cuban, the billionaire owner of the Dallas Mavericks, talking with Bloomberg TV about why he doesnâ\u0080\u0099t trade the stock market like he did back in the dot-com days. â\u0080\u009cI stick to the companies I believe in,â\u0080\u009d Cuban explained, adding that heâ\u0080\u0099s owned shares of Netflix NFLX, +1.43% Â since they were trading around $50. At last check, the stock was all the way up at $528, rising almost 8% in Wednesdayâ\u0080\u0099s session alone. He also said he bought up chunks of Amazon AMZN, +3.01% Â between $500 and $700, and more recently added more at just under $2,000 a share. The stockâ\u0080\u0099s at $3,385 now. Cuban said he has some other scattered investments that heâ\u0080\u0099s held on to over the year, but, for the most part, heâ\u0080\u0099s no longer an active trader in the stock market. â\u0080\u009cThe Fed put is strong,â\u0080\u009d he said. â\u0080\u009cThat Fed inflation of financial assets gives us a tailwind.â\u0080\u009d The metaphorical Fed put refers to the notion that the Federal Reserve, with its steady flow of stimulus, is committed to taking action to keep asset prices moving higher. Watch the clip: Those tailwinds Cuban was referring to were blowing Wednesday for the S&P 500 SPX, +0.87% Â and Nasdaq Composite COMP, +1.39% Â , with both indexes firmly in the green. The Dow Jones Industrial Average DJIA, +0.56% Â , however, was slightly lower â\u0080\u0094"}]}