{"article": [{"url": "https://www.marketwatch.com/story/covid-19-infections-just-hit-20-million-worldwide-why-the-actual-number-of-cases-is-likely-much-higher-2020-08-11", "published": 1598244860.0, "headline": "This is when people with COVID-19 are at their most contagious", "body": "The number of coronavirus cases currently exceeds 23 million globally, according to the latest data aggregated by Johns Hopkins University’s Center for Systems Science and Engineering, but the actual number of cases is likely much higher. The Centers for Disease Control and Prevention estimate that 40% of people with COVID-19 are actually asymptomatic, which makes it difficult for health professionals to trace transmission. Other data have suggested that 16% of coronavirus transmission is due to carriers not displaying symptoms or only showing very mild symptoms who, while they’re contagious, may not believe they have the disease. “ Knowing when an infected person can spread SARS-CoV-2 is just as important as how the virus spreads so rapidly. ” One case study of the quarantined Italian town of Vò published in the peer-reviewed journal Nature in June revealed more than 40% of COVID-19 infections had no symptoms. With a population of approximately 3,200 people, Vò reported Italy’s first COVID-related death on Feb. 20. As a result, the residents of the town were placed in quarantine for 14 days. Some 2.6% of the town tested positive for SARS-CoV-2, the virus that causes COVID-19, at the beginning of the lockdown, but that figure fell to 1.2% after a couple of weeks. Throughout this time, 40% of those infections were people who displayed no symptoms. The researchers also concluded that it took 9.3 days for people who tested positive to be virus-free. “Someone with an asymptomatic infection is entirely unconscious of carrying the virus and, according to their lifestyle and occupation, could meet a large number of people without modifying their behavior,” found the study, which was carried out by researchers at Imperial College London and the University of Padua. “If we find a certain number of symptomatic people testing positive, we expect the same number of asymptomatic carriers that are much more difficult to identify and isolate,” according to Enrico Lavezzo, a professor in the University of Padua’s department of molecular medicine. Related: Was COVID-19 made in a lab? Will a vaccine protect you forever? Does the sun help? Coronavirus myths are spreading in 25 languages — here are the most popular That, health professionals say, raises questions about how contagious they are after contracting the virus, and for how long they remain so. Knowing when an infected person can spread SARS-CoV-2 is just as important as how the virus spreads so rapidly. WHO recently published a scientific brief on how the virus spreads, particularly among those who don’t show symptoms. The virus can be detected in people one to three days before their symptom onset, with the highest viral loads around the day of the onset of symptoms, followed by a gradual decline over time, according to the World Health Organization. This level of contagiousness appears to be one to two weeks for asymptomatic persons, and up to three weeks or more for patients with mild to moderate disease. “Preliminary data suggests that people may be more contagious around the time of symptom onset as compared to later on in the disease,” it added. “ The virus can be detected in people one to three days before their symptoms, with the highest viral loads on day one. ” “Transmission of SARS-CoV-2 can occur through direct, indirect, or close contact with infected people through infected secretions such as saliva and respiratory secretions or their respiratory droplets, which are expelled when an infected person coughs, sneezes, talks or sings,” WHO added. This makes asymptomatic transmission all the more prevalent, scientists say. However, all studies on asymptomatic people have limitations, the WHO added: “For example, some studies did not clearly describe how they followed up with persons who were asymptomatic at the time of testing to ascertain if they ever developed symptoms. Others defined ‘asymptomatic’ very narrowly as persons who never developed fever or respiratory symptoms, rather than as those who did not develop any symptoms at all.” The U.S. COVID-19 death toll could reach nearly 300,000 by Dec. 1, but consistent mask-wearing beginning today could save approximately 70,000 lives, according to the Institute for Health Metrics and Evaluation (IHME) at the University of Washington’s School of Medicine. “It appears that people are wearing masks and socially distancing more frequently as infections increase, then after a while as infections drop, people let their guard down and stop taking these measures to protect themselves and others,” IHME director Christopher Murray said. Dispatches from a pandemic:Ireland says people must wear masks in stores to stop COVID-19 — but why did it take so long? California Gov. Gavin Newsom, a Democrat, last month announced a rollback of operations statewide at restaurants as well as bars, zoos, wineries, museums, card rooms and movie theaters. “This is in every county in the state of California, not just those on the watch list,” he said. The shutdown also affected indoor operations of gyms, places of worship, offices for non-critical sectors, hairdressers, beauty salons, indoor malls and other places of businesses in 30 counties on California’s ”monitoring list,” which represent 80% of the state of California. On the anniversary of the 1918 flu, health writer Ed Yong warned of another pandemic and now says the U.S. must learn the lessons from the past seven months, adding, “COVID-19 is merely a harbinger of worse plagues to come.” “ New York City, the epicenter of the pandemic in the U.S., was a case study in how the virus is transmitted. ” “Despite ample warning, the U.S. squandered every possible opportunity to control the coronavirus. And despite its considerable advantages — immense resources, biomedical might, scientific expertise — it floundered,” he wrote in the September issue of The Atlantic. While South Korea, Thailand, Iceland, Slovakia, and Australia acted “decisively” to flatten and then bend the curve of new infections downward, “the U.S. achieved merely a plateau in the spring, which changed to an appalling upward slope in the summer,” he added. Yong said he had spoken to more than 100 health experts since the pandemic began and sums up the U.S.’s mistakes this way: “A sluggish response by a government denuded of expertise allowed the coronavirus to gain a foothold,” compounded by “chronic underfunding of public health.” “A bloated, inefficient health-care system left hospitals ill-prepared for the ensuing wave of sickness. Racist policies that have endured since the days of colonization and slavery left Indigenous and Black Americans especially vulnerable to COVID-19,” he added. New York City, the onetime U.S. epicenter of the pandemic, was a case study in how some Americans fared better than others and how the virus is transmitted. Black and Latino people were hospitalized at twice the rate of Caucasians during the peak of the crisis, data released in May by the city showed. Black New Yorkers were hospitalized at a rate of 632 per 100,000 people, while Caucasians were hospitalized at a rate of 284 per 100,000 people. One theory: More foreign-born Americans are likely to live in multi-generational households, and Asian and Hispanic people are more likely than white people to be immigrants, according to the Pew Research Center. People of color are more likely to work in frontline jobs that carry a greater risk of contracting COVID-19. Dispatches from a pandemic: A letter from Chennai as India tops 2 million COVID-19 cases: ‘In the midst of so much death, despair and depression, life does go on’ President Donald Trump earlier this month bypassed the nation’s lawmakers as he claimed the authority to defer payroll taxes and replace an expired unemployment benefit with a lower amount after negotiations with Congress on a new coronavirus rescue package collapsed. However, the executive order and memorandums ostensibly providing relief amid the intractable pandemic don’t seem feasible or legal, analysts said, adding that the wording of the orders raised more questions than answers. Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases and a member of the White House coronavirus task force, has been optimistic about a vaccine arriving at the end of 2020 or in early 2021, and says people must continue to practice social distancing and wear masks. Fauci has said he is hopeful that a coronavirus vaccine could be developed by early 2021, but has previously said it’s unlikely that a vaccine will deliver 100% immunity; he said the best realistic outcome, based on other vaccines, would be 70% to 75% effectiveness. Other epidemiologists are even more circumspect on a vaccine wiping out transmission of the virus anytime soon. Coronavirus update:As of Monday, COVID-19 has now killed at least 808,928 people worldwide. The U.S. has the world’s highest number of confirmed COVID-19 cases (5,703,586) and deaths (176,808). Worldwide, confirmed cases are now at 23,434,221, according to data aggregated by Johns Hopkins University, which does not, for the most part, account for asymptomatic cases. The Dow Jones Industrial Index DJIA, +0.56%, the S&P 500 SPX, +0.87% and the Nasdaq Composite COMP, +1.39% ended higher Friday. Last week, the Federal Reserve minutes urged Congress for more pandemic aid, underscoring the challenge to the country’s economic recovery as the world anxiously awaits a COVID-19 vaccine. AstraZeneca AZN, +1.16%, in combination with Oxford University; BioNTech SE BNTX, +1.23% and partner Pfizer PFE, -0.27% ; GlaxoSmithKline GSK, +1.10% Johnson & Johnson JNJ, +1.39% ; Merck & Co. MERK, +1.59% ; Moderna MRNA, +0.09% ; and Sanofi SAN, -1.48% are among those currently working toward COVID-19 vaccines. Related: Feeling lax about masks? Think again. Here’s how many lives could be saved if everyone wore a mask — starting today"}]}