{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-inch-higher-as-eurozone-retail-sales-returns-to-pre-crisis-levels-2020-08-05", "published": 1596646820.0, "headline": "Treasury yields climb on strong services data, increased debt issuance", "body": "Treasury yields rose Wednesday after signs of a pick-up in the U.S. services sector activity, the brunt of the U.S. economy, weighed on appetite for government bonds.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 2.7 basis points to 0.541%, while the 2-year note rate TMUBMUSD02Y, 0.156% was at 0.115%. The 30-year bond TMUBMUSD30Y, 1.576% climbed 2.7 basis points to 1.218%. Bond prices move inversely to yields.What’s driving Treasurys? Strong economic data from the U.S. services sector helped to spur selling in the bond market, while bolstering risky assets like stocks. The Institute for Supply Management’s index of nonmanufacturing companies edged up to 58.1 last month from 57.1, reaching its highest reading since November 2018. Any number above 50 represents an expansion in economic activity. On a more worrisome note, Automatic Data Processing Inc. reported private-sector employment rose by 167,000 in July. The gain was well below forecasts from economists surveyed by Econoday who expected a gain of 1.9 million jobs. This comes ahead of the more widely watched official employment report on Friday. In the eurozone, retail sales jumped 5.9% in June, returning back to levels last seen before the coronavirus crisis. Analysts said the rebound was driven by pent-up demand and income support schemes, two forces that are set to fade in the coming months. Struggles by the U.S. Congress to pass another fiscal relief package have weighed on the market’s optimism around a sharp recovery yet this year, following a plunge in economic activity in the second quarter. Related: Consumers hold the key to an economic recovery and right now they’re very anxious The 10-year German government bond yield TMBMKDE-10Y, -0.521% gained 4.5 basis points to trade at a negative 0.508%. Adding to the bearish trading, the U.S. Treasury Department announced Wednesday it will sell a record $112 billion in notes and bonds next week at its quarterly refunding auction. This is $16 billion larger than the package announced last quarter.What did market participants’ say? “The latest detail released by the Treasury concerning the third quarter borrowing plans suggests the recent focus on bill financing is starting to be shifted out the curve,” said Steven Ricchiuto, chief economist at Mizuho. “These increases exceed what was expected heading into this morning’s borrowing announcement,” he said."}]}