{"article": [{"url": "https://www.marketwatch.com/story/macys-thanksgiving-day-parade-to-go-virtual-this-year-2020-09-14", "published": 1600098620.0, "headline": "Macyâ\u0080\u0099s Thanksgiving Day Parade to go virtual this year", "body": "For the first time in nearly 100 years, the Macyâ\u0080\u0099s Thanksgiving Day Parade in New York City will be a virtual event this November because of the coronavirus pandemic, organizers announced on Monday.Â Typically one of the cityâ\u0080\u0099s biggest annual events, the downsized show will go on without the usual throngs of spectators. Instead, its signature features, from the enormous helium balloon characters to the dance performances, will be pretaped in Manhattanâ\u0080\u0099s Herald Square over two days and broadcast on Thanksgiving morning, Nov. 26, as a â\u0080\u009cspecial presentation,â\u0080\u009d Macyâ\u0080\u0099s M, -0.95% Â said.Â Sixty-foot balloons, the paradeâ\u0080\u0099s main attraction, were nearly its downfall last year, when dangerous winds threatened to rip the floating giants from the hands of volunteers. This year, each colossus will be rigged to a handful of approved vehicles, cutting out the need for the usual 80-100 handlers per balloon, the company said. â\u0080\u009cWhile it will certainly look different in execution, this yearâ\u0080\u0099s Macyâ\u0080\u0099s Parade celebration will once again serve its historical purpose â\u0080\u0094 to bring joy into the hearts of millions across the nation,â\u0080\u009d said Susan Tercero, executive producer of Macyâ\u0080\u0099s Thanksgiving Day Parade on Monday. She called the annual event the companyâ\u0080\u0099s â\u0080\u009clove letterâ\u0080\u009d to New York City.Â Â Organizers have reduced the total number of participants to one-quarter of the usual crew â\u0080\u0094 which count more than 8,000 in a normal year. All high school and college marching band performances are canceled, and the event will exclude performers under 18 years old, the company said in its announcement.Â Also see: â\u0080\u0098Itâ\u0080\u0099s a five-alarm fire, a 100-year fiscal tsunamiâ\u0080\u0099 â\u0080\u0094 N.Y. Transit boss wants subway riders to come back The parade, which began in 1924, has grown from a modest gathering of Macyâ\u0080\u0099s employees in costumes and floats to a massive multimillion-dollar event with thousands of volunteers and performers. Last year, the parade drew 3.5 million live spectators to Midtown Manhattan and 50 million television viewers, according to the company.Â You might like: Watch the balloons get ready for the parade in this time-lapse video â\u0080\u009cOne of the most beloved events every year is the Thanksgiving Day Parade,â\u0080\u009d Mayor Bill de Blasio said during a briefing on Monday. It wasnâ\u0080\u0099t immediately clear what the economic toll of the change will be on the city, which had to alter numerous tourist attractions â\u0080\u0094 from the U.S. Open Tennis Championships over the past two weeks to the annual September fashion shows â\u0080\u0094 in light of the health crisis. An email sent to the mayorâ\u0080\u0099s office on this was not immediately returned.Â Donâ\u0080\u0099t miss: It ainâ\u0080\u0099t over! Itâ\u0080\u0099s New York! The city will survive the virus despite the current tough times It will be the first time since World War II that Macyâ\u0080\u0099s paraders wonâ\u0080\u0099t march down New York City streets on Thanksgiving.Â â\u0080\u009cIt will not be the same event weâ\u0080\u0099re used to,â\u0080\u009d de Blasio said. â\u0080\u009cThey are reinventing the event for this moment in history.â\u0080\u009d"}]}