{"article": [{"url": "https://www.marketwatch.com/story/giant-trump-sign-snarls-traffic-deemed-a-traffic-hazard-in-los-angeles-11602104080", "published": 1602091340.0, "headline": "Giant â\u0080\u0098Trumpâ\u0080\u0099 sign snarls traffic, deemed a hazard in Los Angeles", "body": "YouTube/LA Times The Hollywood sign has been around for nearly a century. A Trump version of the classic Southern California symbol didnâ\u0080\u0099t even last a day. iframe.twitter-tweet { width: 100% !important; } Here are some other angles: iframe.twitter-tweet { width: 100% !important; } The president seemed to appreciate the effort: iframe.twitter-tweet { width: 100% !important; } Those five letters, prominently displayed Tuesday morning on the hills above the 405 Freeway in Los Angeles in what appeared to be the same font as the globally recognized Hollywood sign, were soon knocked down. The City of Angels, and the Golden State, are certainly isnâ\u0080\u0099t Trump country, of course, but thatâ\u0080\u0099s not why the sign was removed, apparently. Caltrans told KTLA the sign created a traffic hazard as drivers were slowing down to take pictures. The sign was on private property, but the party that called it in initially voiced concerns over a potential fire. Thatâ\u0080\u0099s the story, anyway. Trump supporter Ted Cruz wasnâ\u0080\u0099t buying it: iframe.twitter-tweet { width: 100% !important; } Officials reportedly couldnâ\u0080\u0099t identify who exactly put the sign in the prominent hillside property, but its up to the land owner to fully remove it. This isnâ\u0080\u0099t the first time a Trump symbol has run into problems in this bastion of the coastal liberal elite. Trump has a star on the Hollywood Walk of Fame that has been targeted several times. Years back, a suspect used a pickax and sledgehammer to carve the â\u0080\u009cTrumpâ\u0080\u009d name from the sidewalk. Then there was this artistic rendering of Trumpâ\u0080\u0099s long-advocated wall. The star was again vandalized just last week â\u0080\u0094 this time by the Incredible Hulk. The perp was eventually arrested. Hereâ\u0080\u0099s the footage: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; }"}]}