{"article": [{"url": "https://www.marketwatch.com/story/after-underperforming-the-stock-market-for-years-alternative-energy-is-red-hot-2020-09-25", "published": 1601027240.0, "headline": "After underperforming the stock market for years, alternative energy is red hot", "body": "Clean-energy stocks and exchange-traded funds are on a tear this year, sharply outperforming the broader market and traditional fossil-fuel investments. The clean-tech ETFs with the most powerful year-to-date rallies include Invesco Solar ETF TAN, +0.88%, up 81% through Thursday; First Trust NASDAQ Clean Edge Green Energy Index Fund QCLN, +2.26%, up 58%; and iShares Global Clean Energy ETF ICLN, +1.56%, up 41%. Compare that to SPDR S&P 500 ETF Trust SPY, +0.89%, which is up 1.99%, and the Technology Select Sector SPDR Fund XLK, +1.52%, up 23%. The promise of clean tech — creating energy from renewable resources — has lured investors to the space before, only to get burned. After years of underperformance is now different or are buyers once again flying too close to the sun? Energy-market watchers say what makes today different than 10 years ago, when interest in clean tech also was hot, is that these power sources are now economically viable as subsidies fall away. Peter McNally, global lead for industrials, materials and energy at research firm Third Bridge, says aggressive investment by utilities in renewable energy has lowered the cost of clean tech and showed it was viable at scale. Just as utilities invested in natural gas 20 years ago at the expense of coal, they are now doing the same with alternative energy. “Clean-tech businesses are starting to stand on their own, and I think they got a big boost from the utilities,” he says. Data from the U.S. Energy Information Administration, the statistical arm of the U.S. Department of Energy, shows as of 2019, 18% of the U.S.’s electricity generation came from alternative energy, versus 10% in 2009. Some of the big oil majors like BP BP, -0.74% BP, +0.56% are taking alternative energy seriously, McNally says, pointing to BP’s announcement that it will allow oil production to decrease by 40% over the next decade while investing $5 billion by 2030 in clean tech. “I am less cynical about the whole thing than I had been in the past (because of) big oil,” McNally says. “ In 2019, 18% of the U.S.’s electricity generation came from alternative energy. ” Another difference between now and then is clean tech is rallying as crude-oil flounders, says Jason Bloom, director of global macro ETF strategy at money manager Invesco. Until a few years ago, alternative-energy prices were significantly higher than fossil-fuel prices. Users would seek alternatives when fossil-fuel prices rallied, switching back when prices fell. While the cheapest fossil-fuel generation still beats out clean-tech energy, in some areas of abundant sun and wind, unsubsidized new-generation wind and solar prices are competitive at utility scale as clean-tech prices plummeted over the years, Bloom says. Over the past 10 years, the cost of solar panels has plunged 82%, while onshore wind costs have skidded 39% and the cost of offshore wind has fallen 29%, according to the International Renewable Energy Agency. Solar names are leading this year’s rally, says Angelo Zino, senior industry analyst at CFRA, a research firm. He attributes some of it to investor interest in Tesla’s TSLA, +1.89% electric vehicles and the ripple effect on other industries, plus increasing interest in environmental, social and governance investing. There may also be some investor bets that Joe Biden will win the White House in November and increase initiatives around clean energy, specifically solar. The First Trust NASDAQ Clean Edge Green Energy Index Fund has Tesla as its second-biggest holding, while the Invesco Solar ETF and iShares Global Clean Energy ETF have SunRun RUN, +1.26% as their No. 3 and No. 1 holding, respectively, according to their websites. Biden’s platform has ambitious targets to increase renewable energy production, including establishing national goals of 100% clean energy by 2035. “You’ve got the potential with him at the helm to really accelerate a ton of the initiatives and long-term objectives of clean energy,” Zino says. Because clean tech is a young space, investors need to brace for volatility. If a Biden presidency doesn’t occur, Zino expects the valuation of these stocks to fall back because Donald Trump won’t make renewable energy a priority. Read:The West burns, coastlines are threatened, and Trump and Biden are too quiet on climate change, say analysts For now, there are some limits to how much of power generation can come from renewables even at utility scale. Battery technology needs to improve so utilities can tap more stored electricity when the sun isn’t shining or the wind isn’t blowing. “They’re figuring ways to make it more reliable, but it’s not 100%,” Third Bridge’s McNally says. But even if the U.S. slows in renewables adoption, clean tech is a global business. Europe and China are pushing ahead on adoption, which supports the industry as a whole. For example, Germany gets nearly half of its energy from renewables, according to Clean Energy Wire, citing Germany’s energy industry association. McNally says the strength in clean-tech energy is more than just investor money inflating valuations, pointing utility NextEra Energy NEE, +0.62%, the world’s largest generator of renewable energy from wind and solar power. “The utilities themselves have made this part of their portfolio, and they are required to keep the lights on,” he says. “They’re investing real money in all kinds of ways to generate and distribute power to customers.” Now read:Warren Buffett-backed largest U.S. solar project approved as nation’s renewable use on track to pass coal Also:Here are two stocks that stand to benefit from California’s electric-vehicle push Debbie Carlson is a MarketWatch columnist. Follow her on Twitter @DebbieCarlson1."}]}