{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-skid-550-points-lower-as-fears-of-coronavirus-second-wave-resurface-2020-06-15", "published": 1592240840.0, "headline": "Dow closes 158 points higher after Fed further eases path for big corporations to borrow during pandemic", "body": "U.S. stocks benchmarks closed higher Monday, booking a sharp turnaround after the Federal Reserve took further steps to keep credit flowing to big businesses during the pandemic, amid signs of a resurgence of the deadly COVID-19 pandemic in parts of the world. Last week, concerns about the pandemic’s trajectory led major equity benchmarks to record their worst weekly performance since March.How did benchmarks fare? The Dow Jones Industrial Average DJIA, +0.56% closed 157.62 points higher, or 0.6%, at 25,763.16. The S&P 500 SPX, +0.87% added 25.28 points, or 0.8%, finishing at 3,066.59. The Nasdaq Composite Index COMP, +1.39% advanced 137.21 points. or 1.4%, ending at 9,726.02. On Friday, the Dow gained 477.37 points, or 1.9%, to close at 25,605.54. The S&P 500 index added 39.21 points, or 1.3%, closing at 3,041.31. The Nasdaq Composite Index climbed 96.08 points, or 1%, to 9,588.81. For the week, the Dow lost 5.55%, the S&P 500 fell 4.8%, and the Nasdaq was off 2.33%, marking its sharpest weekly fall since the period ended March 20, according to Dow Jones Market Data. What drove the market? Stocks rose Monday after the Federal Reserve said it is expanding the scope of its $750 billion emergency corporate debt loan facility to include individual corporate bonds, while also scrapping some earlier restrictions for potential borrowers. The tech-heavy Nasdaq ended the session less than 3% off its all-time closing high set on June 10, with its biggest gains coming from health-care stocks, amid fears that coronavirus infections are rising again. Nadsaq-listed Zoom Video Communications Inc. ZM, +2.89% saw its shares rally to a record high Monday on renewed pandemic fears amid a resurgence of COVID-19 cases in China, leaving shares of the videoconference provider up more than 251% for the year to date Monday. Beijing closed the city’s largest wholesale food market after scores of people tested positive for COVID-19. China on June 13 recorded its largest daily increase in cases since mid-April, Bloomberg News reported, citing National Health Commission data on Sunday. On top of that, Chinese economic data was weaker than expected, suggesting the road toward recovery from a coronavirus downturn may be a long one. Industrial output rose 4.4% in May from a year ago, while retail sales fell by 2.8% last month. Both came in below economists’ expectations. Meanwhile, increases in infections in Florida and Texas have raised fears about the success of efforts to gradually reopen the U.S. economy, with phased restarts of business activity in all 50 states. Reuters reported on Sunday that Alaska, Arizona, Arkansas, California, Florida, North Carolina, Oklahoma and South Carolina all had record numbers of new cases in the past three days. See:Coronavirus infections are surging in Arizona, but governor won’t rethink mask guidance Confirmed coronavirus cases in the U.S. are at around 2.1 million, with nearly 116,000 deaths, according to data compiled by Johns Hopkins University. Nearly 8 million people have been infected with COVID-19 globally, and the disease has claimed 434,000 lives worldwide, the data shows. And yet, the Fed has shown it still has more levers to pull as it seeks to soften fallout from the global pandemic. “The decision to buy a broad portfolio of corporate bonds represents a shift to a more active strategy for the secondary market corporate credit facility, rather than the passive approach originally envisioned,” said Steve Friedman, senior macroeconomist at MacKay Shields, adding that the Fed also signaled it would ramp up its purchases, if needed. “This change underscores the Federal Reserve’s commitment to supporting the flow of credit to large corporations,” said Friedman, a former director at the Federal Reserve of New York. “It may also reflect the committee’s view that the economic recovery from the ongoing COVID crisis will be an extended and challenging one, with credit markets requiring extensive support.” Dallas Fed President Dallas Fed President Robert Kaplan said Monday that he is skeptical of the central banking using so-called “yield-curve control” as a new tool to help the economy recover from the recession. “I wouldn’t rule it out, but right now Treasury yields are relatively muted,” Kaplan said. Meanwhile, White House economic adviser Larry Kudlow on Sunday played down the increase in coronavirus cases and said the country “has got to open.” In an interview with CNN’s “State of the Union,” Kudlow attributed the rise of new cases seen in a number of states to an increase in testing. “Testing is up five-fold,” said Kent Engelke, chief economic strategist at Capitol Securities Management. “Cases are up, but that’s a result of more testing,” he told MarketWatch. In economic data, the Empire State index, which tracks economic activity in New York region, surged 48 points to a reading of negative-0.2 in June. The report last month came in with a minus-48.5 reading, with any reading below 0 indicating a contraction in factory activity. The data suggested the highly cyclical manufacturing sector was on the road to recovery, and may reflect green shoots taking root in the economy. ”You just can’t just close down the economy again,” Engelke said. See:Yes, America does need to brace itself for a second wave of coronavirusWhich stocks were in focus? Cruise liner shares slumped Monday amid fears of rising COVID-19 infections in parts of the globe. Carnival Corporation’s CCL, +0.51% stock fell 2.7%, while shares of its largest peers, Royal Caribbean Cruises RCL, +2.59% and Norwegian Cruise Line Holdings ( NCLH, +2.91% , fell. Shares of Hertz Global Holdings Inc. HTZ, -1.78% tumbled 33.6% after it filed to issue $500 million of stock, despite having filed for chapter 11 bankruptcy in May. The move is unusual as any equity in a company after it completes the bankruptcy process often is worthless. United Airlines Holdings Inc. UAL, +0.32% fell 1.7% Monday, after the air carrier disclosed that it would issue 28 million shares of new common stock. The company also said it expects to have about $17 billion in liquidity by September, partially due to a federally back loan through the Cares Act, a deal similar to the one struck last week by American Airlines Group AAL, +0.34%. Walmart Inc. WMT, +1.00% said it was teaming up with Shopify Inc. SHOP, +2.50%, making the Walmart Marketplace available to Shopify’s 1- million-plus sellers. The news sent Shopify shares up 8.5% and Walmart’s up less than 0.3%. General Electric Co. shares GE, +2.85% shed 0.1% after it announced that the CEO of its conglomerate’s aviation arm would retire. U.S.-listed shares of BP Plc BP, -0.74% fell 1.6% after the oil giant said it was taking up to $17.5 billion in charges as it lowers its assumptions for the fossil fuels it sells. Electronic Arts Inc. EA, +1.15% shares gained 3.7%, booking its highest close since August 2018, according to Dow Jones Market Data. Shares of Genius Brands International Inc. GNUS, +8.52% surged 8.7% Monday, after the kids media company said Arnold Schwarzenegger has entered into an agreement to be a “significant investor.” Zoom Video Communications Inc. ZM, +2.89% shares climbed nearly 8.9% to a record high Monday on renewed pandemic fears on a resurgence of COVID-19 cases in China and in parts of the U.S. Softbank Group SFTBY, -1.46% said Monday it had completed the $4.7 billion (500 billion yen) stock repurchase plan that was announced in March. The program retired 107.7 million SoftBank shares. Its stock fell 2.2%. ViacomCBS Inc VIAC, -2.34% shares jumped 8.7%, making it the S&P 500’s biggest gainer on Monday. The company’s Chief Executive Bob Bakish told Barron’s that live sports will return to TV in June, starting with PGA golf. See: Bankrupt Hertz gets approval to sell up to $1 billion in stock — but experts expect equity to be wiped outHow did other assets fare? West Texas Intermediate U.S. crude US:CLN20 tacked on 86 cents, or 2.4%, to settle at $37.12 a barrel on the New York Mercantile Exchange. The greenback traded down 0.6%, as gauged by the ICE U.S. Dollar index DXY, -0.58% . In precious metals, August gold US:GCM20 on Comex settled down $10.10, or 0.6%, to finish at 1,727.20 an ounce. Bullion booked a weekly gain of 3.2% based on last Friday’s settlement of the most-active contract. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose less than 1 basis point to 0.701%. Bond prices move in the opposite direction of yields. In global equities, the Stoxx Europe 600 index SXXP, +0.55% finished 0.3% lower, while the FTSE 100 index UKX, +0.64% slipped 0.7%. China’s benchmark CSI 300 index 000300, +2.04% closed 1.2% lower on Monday, and the Japanese Nikkei NIK, -0.11% tumbled 3.5%. Read on:Trump rally next weekend in Tulsa labeled dangerous by public health experts Mark DeCambre contributed reporting"}]}