{"article": [{"url": "https://www.marketwatch.com/story/sp-500-earnings-set-to-plunge-as-the-coronavirus-batters-all-sectors-with-wall-street-counting-on-a-bounce-that-may-not-come-2020-07-11", "published": 1594711160.0, "headline": "S&P 500 earnings set to plunge as the coronavirus batters all sectors â\u0080\u0094 with Wall Street counting on a bounce that may not come", "body": "The one certainty about the outlook for companies in a COVID-19 world is that second-quarter earnings will be very bad â\u0080\u0094 the worst, in fact, in more than 10 years. Although Wall Street is betting that earnings will start bouncing off the bottom in the third quarter, the beginning point for that bounce is unknown, and early indications suggest the reboundâ\u0080\u0099s magnitude may not match investorsâ\u0080\u0099 hopes. As usual ahead of earnings season, since the reports cover the three-month period that has already passed, what companies say about the current quarter or the full year is more important than the results theyâ\u0080\u0099re reporting. But this earnings season may be different, as uncertainty over the impact of the COVID-19 pandemic has led many companies to withdraw guidance, leaving analysts more blinkered than usual when setting estimates. About a third of S&P 500 SPX, +0.87% Â component companies have pulled their financial guidance, and less than half the typical number of companies have so far provided quarterly updates ahead of earnings, according to Sebastian Leburn, senior portfolio manager at Boston Private. â\u0080\u009cThereâ\u0080\u0099s a deficit of information that needs to be filled at some point,â\u0080\u009d Leburn said in an interview with MarketWatch. That puts the trajectory of the anticipated earnings bounce, which stock investors are banking on, on unsure footing. â\u0080\u009cThatâ\u0080\u0099s why I think earnings will be very important, because theyâ\u0080\u0099ll provide a dose of reality,â\u0080\u009d Brad Cornell, professor emeritus of finance at UCLA, told MarketWatch. â\u0080\u009cThey are going to tell us exactly whether a company is on a path that justifies this run-up.â\u0080\u009d One aspect of the rally in stocks over the past few months is that it has been driven by a shrinking set of mega-capitalization companies expected to benefit in a postâ\u0080\u0093COVID-19 world. All five of the most highly valued companies in the S&P 500 index â\u0080\u0094 Apple Inc. AAPL, +1.74%, Microsoft Corp. MSFT, +2.48%, Amazon.com Inc. AMZN, +3.01%, Google parent Alphabet Inc. GOOGL, +1.82% Â GOOGL, +1.82% Â and Facebook Inc. FB, +0.26% â\u0080\u0094 have rallied by a double-digit percentage in 2020 through Friday, while the S&P 500 has lost 1.4%. “ â\u0080\u0098Thatâ\u0080\u0099s why I think earnings will be very important, because theyâ\u0080\u0099ll provide a dose of reality. They are going to tell us exactly whether a company is on a path that justifies this run-up.â\u0080\u0099 ” â\u0080\u0094 Brad Cornell, UCLA Those five companies have a combined weighting of more than 20% in the index, according to data provided by FactSet. That increases the risk for the broader stock market, as it heightens the importance of the earnings performance of a smaller set of companies. Disappointing results from other companies viewed as postâ\u0080\u0093COVID-19 winners could also sap the marketâ\u0080\u0099s strength. Itâ\u0080\u0099s not just the results that matter; so will any financial guidance they can provide to help justify the stocksâ\u0080\u0099 gains. â\u0080\u009cItâ\u0080\u0099s all about clarity and having some guidance,â\u0080\u009d said Boston Privateâ\u0080\u0099s Leburn. â\u0080\u009cWithout that, you have nothing to work with.â\u0080\u009dThe bad news is the actual numbers The second-quarter earnings reporting season for S&P 500 companies unofficially kicks off before Tuesdayâ\u0080\u0099s opening bell, when a number of banks reveal their results. Donâ\u0080\u0099t miss:What to expect as banks report earnings: more loan pain but plenty of fee income The aggregate blended year-over-year growth estimate for earnings per share, which includes some earnings already reported and the average analyst estimates of coming results, is negative 44.6% as of Monday morning, according to FactSet. That would be the biggest decline in earnings since the fourth quarter of 2008, when earnings fell 70% in the midst of the financial crisis. It would follow 1% earnings growth in the first quarter. â\u0080\u009cSecond-quarter earnings will likely be a â\u0080\u0098kitchen sinkâ\u0080\u0099 report from many companies,â\u0080\u009d said Marc Lichtenfeld, chief income strategist with the investment and business newsletter publisher the Oxford Club. â\u0080\u009cThey can throw in all of their write-offs and other expenses and know they will likely be forgiven for an earnings miss due to the extenuating circumstances.â\u0080\u009d The current estimate marks a sharp drop in expectations as the coronavirus pandemic took firmer hold: The estimate as of March 31 was for a decline of just 11.1%. All 11 S&P 500 sectors are expected to suffer negative earnings growth, led by energy, where earnings are projected to have fallen 152.6%, and consumer discretionary, which includes Amazon, where a 118.0% decline is forecast. Financials, which kicks off earnings reporting season on Tuesday, are expected to see a 55.3% earnings drop. Information technology, which includes Apple and Microsoft, is expected to show a 9.5% earnings decline, while communications services, which houses Alphabet and Facebook, is expected to fall 30.4%. The best performer is currently estimated to be the utilities sector, whose earnings are forecast to be down 1.8%. The outlook for sales is much better, with analyst expectations pointing to an 11.0% decline overall, with health care and utilities are the two sectors projected to see year-over-year sales growth. The outlook for the third quarter is also bleak, just not as bleak as the second quarter. The blended earnings-per-share estimate is for a drop of 24.4%, which compares with expectations of a decline of just 1% as of March 31. That would mark a second straight quarter of negative earnings growth, which by definition would mark the kickoff of an earnings recession. That implies a bounce that recovers less that half the earnings lost since the first quarter. In comparison, the S&P 500 has retraced about 82% through Friday, of the COVID-19 selloff from the Feb. 19 record-high close of 3,386.15 to the March 23 closing low of 2,237.40. All 11 S&P 500 sectors are currently projected to suffer negative third-quarter earnings growth, led by energy at down 113.5% and industrials at down 59.9%. The best expected performer is utilities, at a 0.1%earnings decline. Meanwhile, third-quarter sales are expected to decline at a 5.5% rate.Winners and losers in a new world Although the earnings outlook for the overall S&P 500 is uniformly negative, investors have made a clear distinction between companies expected to end up as winners in a postâ\u0080\u0093COVID-19 world and those that will struggle. Many believe the COVID crisis is creating a new world, while others believe the pandemic has just sped up the future. â\u0080\u009cHistorically speaking, crises have tended to accelerate macro trends already in place,â\u0080\u009d said Yancey Spruill, chief executive officer at DigitalOcean, a cloud infrastructure company. â\u0080\u009cThe clear winners are enterprise technology companies whose infrastructure or software supports the shift to remote work environments and deliver services to customers in a low-friction manner through an internet-based interface.â\u0080\u009d In this world, Spruill views Okta Inc. OKTA, -0.47%, Atlassian Corp. TEAM, +5.33%, Twilio Inc. TWLO, +2.38% and ServiceNow Inc. NOW, +2.43% Â as cloud productivity tools that will likely continue to see â\u0080\u009cimpressive growth.â\u0080\u009d â\u0080\u009cCoronavirus has split the stock market like never before,â\u0080\u009d said David Russell, vice president of market intelligence at TradeStation Group. â\u0080\u009cLarge swaths of the S&P 500 and even some members of the Dow Jones Industrial Average DJIA, +0.56% Â have become irrelevant as newer software companies break out.â\u0080\u009d A good example is Zoom Video Communications Inc. ZM, +2.89%, Russell said. The video meetings service, which went public just 15 months ago, has a market capitalization of about $78 billion, which is bigger than the market caps of two hotel stocks in the S&P 500 â\u0080\u0094 Marriott International Inc. MAR, -0.96% Â and Hilton Worldwide Holdings Inc. HLT, -1.26% Â â\u0080\u0094 combined, and bigger than the market caps of six Dow components, including Goldman Sachs Group Inc. GS, -0.21% Â and Caterpillar Inc. CAT, +1.45%. Investors also seem to be betting on socially conscious companies following environmental, social and governance, or ESG, criteria. â\u0080\u009cWe were already seeing a shift of money into ESG funds before coronavirus, and the trend has continued with an embrace of electric vehicles and solar energy,â\u0080\u009d Russell said. Opinion:Coronavirus can shake up ESG investing â\u0080\u0094 hereâ\u0080\u0099s what investors should demand For example, Tesla Inc. TSLA, +1.89% Â is not yet a member of the S&P 500, but with the stock more than tripling this year, the electric-vehicle makerâ\u0080\u0099s market cap of about $276 billion makes it the 15th most valuable company in the U.S.COVID trumps political unknowns One potential headwind for the stock market is the cloud of uncertainty blanketing the political landscape, in terms of what shape the next stimulus package, if one emerges, will take in the shorter term, and the Nov. 3 presidential election in the medium and longer terms. See:Goodbye, extra $600: Unemployment benefits wonâ\u0080\u0099t exceed former wages in next stimulus bill, Treasuryâ\u0080\u0099s Mnuchin says â\u0080\u009cPolitics will undoubtedly play a role in the outlook and guidance for Q3,â\u0080\u009d said Ken Van Leeuwen, managing director and founder of the financial adviser Van Leeuwen & Co. â\u0080\u009cThe current news cycle has been dominated by COVID-19â\u0080\u0093related [developments] and social unrest, but we feel that the election will be in the spotlight as we get closer to November.â\u0080\u009d This could make it difficult for companies to provide investors with the clarity theyâ\u0080\u0099re desiring. And a continued reluctance to provide guidance could shake the stock marketâ\u0080\u0099s foundation. â\u0080\u009cThe continued information deficit can get stocks in trouble,â\u0080\u009d said Boston Privateâ\u0080\u0099s Leburn. Others believe that politics is just a sideshow that can create short-term volatility for stocks, while lasting impacts are unlikely. Especially in the current environment. â\u0080\u009c[T]he tremendous health and economic challenges associated with the COVID-19 outbreak mean that election-related political uncertainty isnâ\u0080\u0099t the primary concern of business leaders,â\u0080\u009d said Mark Hamrick, senior economic analyst at Bankrate. â\u0080\u009cThey have other proverbial fish to fry at the moment.â\u0080\u009dCost cutting and capital raising Investors can brace for a fresh round of cost cuts and capital-raising activity to accompany earnings reports, as companies move to bolster liquidity and preserve cash as revenue shrinks. Companies in the hospitality sector â\u0080\u0094 restaurants, hotels, airlines, and rental-car companies â\u0080\u0094 are most at risk, said Anthony Denier, chief executive of Webull, a commission-free trading platform. â\u0080\u009cCompanies related to sports, such as Madison Square Garden Sports Corp. MSGS, -0.20%, will also take a hit. Entertainment companies like casinos and anything that puts on shows where large groups of people attend will also be hit hard.â\u0080\u009d The handful of companies that have already reported or updated guidance reflect the trend. Walgreens Boots Alliance Inc. WBA, -1.96% Â announced it plans to cut 4,000 jobs in the U.K., and United Airlines may furlough or fire up to 36,000 employees once the federal rules for accepting pandemic money expires on Oct. 1. â\u0080\u009cThis could expand throughout the entire airline sector,â\u0080\u009d said Denier. â\u0080\u009cAT&T also said it may cut jobs and close stores. Again, this might be a harbinger for the rest of the telecommunications industry.â\u0080\u009d “ â\u0080\u0098Thereâ\u0080\u0099s so much liquidity and capital to put to work and so much trading on short-term trends and issues. It belies the underlying weakness and problems to come and itâ\u0080\u0099s whitewashing many of those problems.â\u0080\u0099 ” â\u0080\u0094 James Gellert, Rapid Ratings Other companies to shrink head count include jeans maker Levi Strauss & Co. LEVI, -2.24%, audience-measurement company Nielsen Holdings PLC NLSN, -4.77%, motorbike maker Harley Davidson Inc. HOG, -3.31% Â and hamburger chain Shake Shack Inc. SHAK, +1.82%, which has failed to fully offset restaurant closures with delivery and pickup. James Gellert, CEO of Rapid Ratings, a data and analytics company that assesses the financial health of private and public companies, said the quarter will reveal just how much companies have been destabilized by the pandemic â\u0080\u0094 and it wonâ\u0080\u0099t be pretty. Rapid Ratings conducted stress tests on 40,000 public and private companies, reviewing their financial health ratings prior to their first-quarter earnings releases to establish a true preâ\u0080\u0093COVID-19 perspective and measure how much they deteriorated after stay-at-home orders were put in place. The stress tests showed deterioration in core health, which looks at longer-term stability, while shorter-term financial health ratings were not as badly impacted, â\u0080\u009cbut I suspect after the second quarter we will see a precipitous decline in both,â\u0080\u009d said Gellert. Overall, companies increased leverage, while revenue and profitability declined. That means higher interest costs but lower interest coverage amid a reduction in cash from operations. â\u0080\u009cThat combination of factors sets the stage for an enormously impactful second quarter,â\u0080\u009d he said. Even after raising money at record rates, companies are expected to continue to issue debt, equity and convertible bonds in the coming quarters, as long as capital markets remain open. U.S. companies issued a stunning $1.09 trillion of corporate bonds in 909 deals in the year through July 10, according to data provided by Dealogic. That shattered the previous record of $670.7 billion in 664 deals issued in 2015. Companies issued $252.2 billion of equity in 659 deals, the Dealogic data show, trouncing the previous record of $206.1 billion in 599 deals issued in 2000. Convertible bond issuance also set a record, of $180.4 billion in 543 deals, breaking the previous mark of $185.9 billion in 550 deals set in 2000. â\u0080\u009cThereâ\u0080\u0099s so much liquidity and capital to put to work and so much trading on short-term trends and issues,â\u0080\u009d said Gellert. â\u0080\u009cIt belies the underlying weakness and problems to come, and itâ\u0080\u0099s whitewashing many of those problems.â\u0080\u009d Crucially, buoyant capital markets are not reflecting the underlying weakness to come and the problem of long-term destabilization. â\u0080\u009cNobody should equate strength in the S&P 500 with underlying corporate strength,â\u0080\u009d Gellert said."}]}