{"article": [{"url": "https://www.marketwatch.com/story/quicken-loans-parents-stock-rises-as-company-looks-to-build-the-amazon-for-financial-services-2020-08-06", "published": 1596883940.0, "headline": "Quicken Loans parentâ\u0080\u0099s stock rises as company looks to build â\u0080\u0098the Amazon for financial servicesâ\u0080\u0099", "body": "Shares of Rocket Companies RKT, +1.01% Â , the parent of major mortgage lender Quicken Loans, gained over 20% after initially falling flat following its initial public offering. Rocket Cos. first traded at $18 when it debuted on the New York Stock Exchange Thursday morning, in line with its IPO price. The company said late Wednesday that it had sold 100 million shares in the offering at $18 a share. Last week, the company said it was aiming to offer $150 million shares priced between $20 and $22 a share. Rocketâ\u0080\u0099s stock rose 20% through Thursday afternoon to close above $21, within its initial target range. Rocket president and chief operating officer Bob Walters chalked up the lower-than-expected IPO price to the company being â\u0080\u009ca bit of an enigma for the public markets.â\u0080\u009d â\u0080\u009cIn the secondary markets weâ\u0080\u0099re seeing that trade up, so that gives us a bit of validation at least early on,â\u0080\u009d Walters told MarketWatch. Walters assumes the president mantle for the now-public company after holding the same title for many years at its largest subsidiary, Quicken Loans. Much of Quickenâ\u0080\u0099s leadership team took the top ranks at the new company, which was carved out of co-founder Dan Gilbertâ\u0080\u0099s empire, including CEO Jay Farner and chief financial officer Julie Booth. Donâ\u0080\u0099t miss:Quicken Loans is going public: 5 things to know about the mortgage lender The company made the decision to go public for two reasons. First, Gilbert wanted to take out a small amount of equity, which Walters said he will invest in Detroit and Cleveland. Rocketâ\u0080\u0099s prospectus noted that the proceeds of the offering would mainly go toward purchasing businesses and Class D stock from Rocket Cos.â\u0080\u0099 previous holding company, Rock Holdings Inc., which is owned by Gilbert. And following the deal, Gilbert will retain majority voting power in the company. But Walters also emphasized that the offering was done in order to award employees with stock. â\u0080\u009cThat may be fairly common in Silicon Valley, but itâ\u0080\u0099s not that common in Detroit,â\u0080\u009d he said. Quicken Loans rose to become the countryâ\u0080\u0099s largest mortgage lender in recent years following the debut of Rocket Mortgage, its digital mortgage application process. Rocket Mortgage proved especially popular among millennials, Walters said, who now form the largest generation of home buyers in the market. Read more:Foreign buying of American real estate plunged before the pandemic â\u0080\u0094 will COVID-19 push it even lower? Today, many lenders â\u0080\u009care working hard to have their own version of that,â\u0080\u009d Walters said. Rocket, meanwhile, is looking to enhance its technology so that it can make the mortgage process more efficient and scale up how many applications it can process. He compared the companyâ\u0080\u0099s ambitions to Amazon AMZN, +3.01%. â\u0080\u009cAmazon has a consumer-facing website where you can find goods and buy goods, but lots of companies have a consumer-facing website,â\u0080\u009d Walters said. â\u0080\u009cWhat Amazon has that no one else has is an unbelievable logistics platform,â\u0080\u009d he continued. â\u0080\u009cEssentially, weâ\u0080\u0099re building the Amazon for financial services â\u0080\u0094 building this leveragable, scalable platform that we can do significant amount of mortgages through and quite frankly also enable some of our other partners through our Rocket Pro channel to leverage that platform as well.â\u0080\u009d “ â\u0080\u0098These are really extraordinary times, very profitable times for us.â\u0080\u0099 ” â\u0080\u0094 Rocket Cos. president Bob Walters on the low interest rate environment. To accomplish that goal, the company will need to hire more tech talent, Walters said. The hope is that by going public and providing stock compensation, theyâ\u0080\u0099ll be about to poach workers from Silicon Valley. Currently, the company closes around 100,000 mortgages a month, Walters said. While he did not cite a specific target for the future, he suggested the company hopes to scale up to closing as many as 200,000 loans each month. Rocketâ\u0080\u0099s IPO occurred the same day that Freddie Mac FMCC, +0.52% Â announced that the average interest rate on the benchmark 30-year mortgage had fallen to a record low. It was the eighth time this year a record had been set. Earlier in the pandemic, Quicken CEO Farner predicted that rates would not end up dropping below 3% because of the pandemic â\u0080\u0094 though thatâ\u0080\u0099s just what happened. The ultra-low rate environment has been a boost for the mortgage industry, providing it with a steady flow of refinance applications. Walters estimated that within the $11 trillion mortgage market, around $9 to $10 trillion is tied up in loans where the homeowner could benefit financially from refinancing. It could take many years to work through all that demand if rates stayed that low. â\u0080\u009cWhether interest rates will stay or not nobody knows, but these are really extraordinary times, very profitable times for us,â\u0080\u009d he said. As interest rates fell because of the pandemic, the numbers of Americans requesting payment relief on their home loans initially rose significantly. Quicken escaped that trend, seeing about half of what the rest of the industry saw in terms of its forbearance rate. But even if the rate were to go up, the company is prepared, Walters said. â\u0080\u009cThereâ\u0080\u0099s no challenge at this point from a liquidity standpoint,â\u0080\u009d he said."}]}