{"article": [{"url": "https://www.marketwatch.com/story/trump-seeks-rapid-return-to-normal-including-tulsa-rally-whose-attendees-must-sign-a-health-release-2020-06-12", "published": 1591978640.0, "headline": "Trump seeks rapid return to normal, including Tulsa rally â\u0080\u0094 whose attendees must sign a health release", "body": "WASHINGTON (AP) â\u0080\u0094 At the White House, aides now routinely flout internal rules requiring face masks. The presidentâ\u0080\u0099s campaign is again scheduling mass arena rallies. And he is back to spending summer weekends at his New Jersey golf club. Three months after President Donald Trump bowed to the realities of a pandemic that put big chunks of life on pause and killed more Americans than several major wars, Trump is back to business as usual â\u0080\u0094 even as coronavirus cases are on the upswing in many parts of the country. See also: Joe Biden is the new favorite over Donald Trump in the 2020 election While the nation has now had months to prepare stockpiles of protective gear and ventilators, a vaccine still is many months away at best and a model cited by the White House projects tens of thousands of more deaths by the end of September. Amid renewed fears of a virus resurgence, financial markets â\u0080\u0094 frequently highlighted by Trump as a sign of economic recovery â\u0080\u0094 suffered their worst drop since March on Thursday. Coronavirus daily update:U.S. case tally passes 2 million mark and 21 states are still seeing increases in infections At the White House, though, officials played down the severity of the virus surge and sought to blame it on factors beyond Trumpâ\u0080\u0099s forceful push to reopen the economy, which heâ\u0080\u0099s counting on to help him win re-election. â\u0080\u009cThe data shows that we are moving in the right direction as a nation,â\u0080\u009d said Surgeon General Jerome Adams, who stressed the country has a positive testing rate under 6%. Still, Adams cautioned at a roundtable with Trump in Texas that while the country has flattened the curve on virus cases, â\u0080\u009cthat doesnâ\u0080\u0099t mean that COVID has gone away, that itâ\u0080\u0099s any less contagious, that itâ\u0080\u0099s any less deadly to vulnerable communities.â\u0080\u009d MarketWatch Forecaster of the Month:Itâ\u0080\u0099s â\u0080\u0098wishful thinkingâ\u0080\u0099 to believe the economy will get back to normal soon, says the monthâ\u0080\u0099s most accurate economic forecaster The White House was a late adopter of many of the safety proposals it recommended, eager to project a sense of normalcy even as it relied on strong testing capacity not available to the rest of the nation. Now Trump, who watched the human and economic toll of the virus take the wind out of his campaign sails, sees even greater urgency in returning to how things were â\u0080\u0094 no matter the state of the virus. At the White House, the coronavirus task force has dramatically scaled back both its visibility and its operations. It now meets once or twice a week on an as-needed basis instead of every day. White House officials say that, because response systems have already been put in place and a strategy developed, thereâ\u0080\u0099s no longer a need for a whole-of-government response. Still, the president receives regular briefings, and the vice president gets briefed multiple times a day. Yet Trump has taken to talking about the pandemic in the past tense â\u0080\u0094 an â\u0080\u009cinvisible enemyâ\u0080\u009d conquered â\u0080\u0094 rather than one still ravaging a nation that has, in recent weeks, also been consumed by mass protests following George Floydâ\u0080\u0099s killing by police. Within the White House complex, many staffers have been flouting directions issued last month to limit their entry to the West Wing and advising â\u0080\u009ceveryone who enters the West Wing to wear a mask or facial coveringâ\u0080\u009d unless they are sitting at their desks and at least 6 feet (1.8 meters) away from colleagues. The directive came after two White House officials â\u0080\u0094 the vice presidentâ\u0080\u0099s press secretary and a presidential valet â\u0080\u0094 tested positive for the virus, sending panic waves through the building. Weeks later, staff members are frequently seen walking around the West Wing without masks. That includes at meetings with the president, such as a Wednesday roundtable with African American supporters. White House staff have also declined to wear masks on Air Force One, even in close proximity to the president. Vice President Mike Pence, for his part, tweeted â\u0080\u0094 and then deleted â\u0080\u0094 a photo of himself posing with staff huddled together at the reelection campaignâ\u0080\u0099s headquarters. No one appeared to be wearing a mask. The White House and campaign did not respond to requests for comment. iframe.twitter-tweet { width: 100% !important; } The Margin:The internet gives Mike Pence the â\u0080\u0098Nobleâ\u0080\u0099 prize for arrogance after he toured the Mayo Clinic without a mask The visual return to normalcy comes as the country surpassed 2 million COVID-19 cases this week, with new hot spots emerging in battleground states like Arizona and cases rising in nearly half of states, according to an Associated Press analysis. Though some states that have moved quickly to reopen have not seen a surge, others have seen escalations. Yet Trump has continued to travel â\u0080\u0094 even to states that still have restrictions â\u0080\u0094 and announced this week that heâ\u0080\u0099ll resume his signature campaign rallies beginning next Friday in Tulsa, Okla. The state, which was among the earliest to begin loosening coronavirus restrictions, has a relatively low rate of infection but has seen cases rising. â\u0080\u009cTheyâ\u0080\u0099ve done a great job with COVID, as you know, the state of Oklahoma,â\u0080\u009d Trump said Wednesday. See:Black leaders call Trumpâ\u0080\u0099s Juneteenth rally in Tulsa â\u0080\u0098a slap in the faceâ\u0080\u0099 Campaign officials chose the location knowing Republican Gov. Kevin Stitt, who was actively encouraging restaurant attendance when much of the country was locking down as the U.S. coronavirus outbreak gathered force, would raise no objections. Stittâ\u0080\u0099s most recent reopening phase places no limits on the size of group gatherings. The campaign hopes the location will all but guarantee a large crowd, since Oklahoma is one of the most Republican states in the nation and Trump has never held a rally there as president. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Still, the reality could not be completely ignored. â\u0080\u009cBy clicking register below, you are acknowledging that an inherent risk of exposure to COVID-19 exists in any public place where people are present,â\u0080\u009d Trumpâ\u0080\u0099s campaign advised those signing up for the rally. â\u0080\u009cBy attending the Rally, you and any guests voluntarily assume all risks related to exposure to COVID-19 and agree not to hold Donald J. Trump for President, Inc.â\u0080\u009d liable for illness or injury. The arena where the Trump rally is to be held has postponed all other scheduled events â\u0080\u0094 Bon Jovi, Kiss and Poison concerts, for example â\u0080\u0094 till the end of July at the earliest. Trump is also planning events in Arizona and Florida â\u0080\u0094 states where cases are on the upswing. In Arizona, hospitals have been told to prepare for the worst as hospitalizations have surged. Opinion:Reopening all businesses would be an economic disaster if workers arenâ\u0080\u0099t safe Trump this month decided that he would no longer hold the marquee event of the Republican National Convention â\u0080\u0094- his acceptance speech â\u0080\u0094 in North Carolina after the state refused to guarantee that he could fill an arena to capacity with maskless supporters. Itâ\u0080\u0099s being moved to Jacksonville, Florida. For the White House, the priority is regaining economic momentum. Read on:The NBER is wrong â\u0080\u0094 the recession didnâ\u0080\u0099t begin in February, it began in March Also:"}]}