{"article": [{"url": "https://www.marketwatch.com/story/walgreens-stock-falls-after-reporting-2-billion-impairment-due-to-covid-19-2020-07-09", "published": 1594281440.0, "headline": "Walgreens stock falls after reporting $2 billion impairment due to COVID-19", "body": "Walgreens Boots Alliance Inc. WBA, -1.96% stock fell 3.1% in Thursday premarket trading after the pharmacy retailer reported third-quarter earnings that missed expectations and reported a COVID-19-related sales impairment. Net loss totaled $1.71 billion, or $1.95 per share, after net income of $1.03 billion, or $1.13 per share, last year. Adjusted EPS of 83 cents fell short of the FactSet consensus for $1.19 per share. Sales of $34.63 billion were up slightly from $34.60 billion last year and ahead of the FactSet consensus for $34.30 billion. COVID-19 hurt Walgreens sales by $700 million to $750 million, which was almost entirely non-U.S. business. The most significant impact was in the U.K., where sales were down 85% in April and Walgreens took $2 billion in non-cash impairment charges. The results also reflect a 61-cent-to-65-cent per share operational impairment from the pandemic. The pharmacy business around the world was hurt by fewer doctor visits and hospital admissions. Prescriptions filled in the U.S. were down 1.3%, and U.S. retail same-store sales were up 1.9% due to increased demand for vitamins and personal protective equipment (PPE). \"Shopping patterns are evolving more rapidly than ever as consumers further embrace digital options, spurring us to accelerate our ongoing investments in digital transformation and neighborhood health destinations,\" said Chief Executive Stefano Pessina in a statement. Those efforts include the expansion of the clinic collaboration with VillageMD and partnerships with Microsoft Corp. MSFT, +2.48% and Adobe Inc. ADBE, +2.30% for omnichannel service. Under the terms of the expanded deal with VillageMD, Walgreens will open 500 to 700 clinics in more than 30 markets over the next five years. Walgreens will invest $1 billion in equity and convertible debt in VillageMD over the next three years, with Walgreens holding 30% ownership interest in the company when the investment is complete. Walgreens completed a $250 million equity investment on Wednesday. Walgreens will close 48 Boots Opticians and cut office support headcount by 20% in U.K., impacting 4,000 jobs, or about 7% of the company's workforce. Walgreens expects 2020 adjusted EPS of $4.65 to $4.75, including $1.03 to $1.14 impact from COVID-19. The company forecasts additional impact from the pandemic in the fourth quarter. Walgreens raised its dividend 2.2% to 46.75 cents per share on Wednesday, payable Sept. 11, 2020 to shareholders of record as of Aug. 19 2020. Walgreens stock has tumbled 28.3% for the year to date while the S&P 500 index SPX, +0.87% is down nearly 2% for the period."}]}