{"article": [{"url": "https://www.marketwatch.com/story/even-with-reopening-new-york-still-faces-a-future-that-looks-very-different-2020-06-29", "published": 1593443660.0, "headline": "Even with reopening, New York still faces a future that looks very different", "body": "New York, the densest city in America, where crowds, lines and traffic jams are intrinsic to daily life, will be a fundamentally altered place even once it reaches its final phase of economic reopening. Broadway performances, a pillar of the city’s identity and which grossed nearly $2 billion last season, will be suspended until 2021, trade organization The Broadway League announced on Monday. Last week, organizers of the annual New York City Marathon, one of the biggest in the world, which draws cheering spectators shoulder to shoulder, said the event was no longer feasible. The November race has been canceled. So too have countless trips to the Big Apple from tourists both domestic and foreign, as air, bus and train passenger volumes remain at a sliver of pre-pandemic levels. The Yankees and the Mets will resume baseball games, likely next month, with zero fans in the seats. “I miss theater as much as our fans do,” said Charlotte St. Martin, president of the Broadway League said in an interview before the 2020 suspension was announced. St. Martin had hoped theaters would reopen in time for the busy November-December season. “But there’s no indication that we’ll have that magic bullet,” St. Martin said. Even with “the best medical information in the city.” While many states, much to their own detriment, rushed to reopen and are now suffering a surge in cases, New York’s leaders have reiterated time and again that the city would follow the lead of public health experts to prevent a second wave. The virus can easily prey on any number of vulnerabilities, as it has in other cities, silently spreading among religious congregants and workers in close proximity, between dance partners at a club and within packed homes and dormitories. Until there is a vaccine or effective treatment, those spaces and more will have to look very different if New York City is to prevent a future resurgence, say officials, public health experts and industry leaders. Glimmers of (a new) normalcy While theater lovers and avid runners nurse broken hearts, there are glimmers of normalcy on the horizon. Restaurants have reopened for outdoor dining, and starting July 6, if the city’s COVID-19 trends continue, basketball and tennis courts will reopen, and New Yorkers will be able to get massaged, waxed and have their nails done when the city begins Phase 3, Mayor Bill de Blasio announced last week. If containment stays on track, then museums, zoos and botanical gardens would eventually follow, albeit with far fewer patrons, according to Phase 4 guidelines devised by the state. “The good news is we’re on track, and it is such an important step forward that this city keeps moving,” de Blasio said at a briefing last week. “It’s important for everyone. It’s important for people trying to get their livelihoods back. It’s important for businesses that are trying so hard to survive. It’s important for the future of the city.” Still, the city’s future will look very different and, in some sectors, unrecognizable while the virus looms. Nightclubs — where spit, sweat and skin are in constant exchange — have proved a particular quagmire for other countries and states. Much of what characterizes a night out presents a possible flashpoint for transmission: People yelling over loud music and dancing in hot, enclosed spaces. In May, a flare-up of cases in South Korea, which has tightly controlled its outbreak, was tracked to nightclubs in Seoul’s hip Itaewon district, forcing both the bars and clubs in the city to close down again. In Florida, where some bars have reported clusters of cases, Miami Mayor Carlos Giménez halted the city’s gradual reopening, saying in comments this week that opening bars and nightclubs is “just asking for trouble.” On Friday, Texas Gov. Greg Abbott ordered the state’s bars to shut back down, as daily infections in the state hit all-time highs. New York City nightclubs are still awaiting guidance from the state on when and how to move forward. Some club owners reportedly said they don’t expect to open until 2021. They aren’t alone. Many of the city’s iconic diversions could be risky, particularly for older populations and those with underlying conditions, said Dr. Fred Pelzman, an internist at Weill Cornell — “any crowded situation be it a sports stadium, the opera, the philharmonic.” Such venues might be able to welcome customers again if widespread rapid testing were developed, Pelzman said. At a movie theater, for instance, patrons could be swabbed before concessions. “Then you stop at the counter to get your Goobers and your popcorn and your Raisinets” and your test result, Pelzman said. For now, movie theaters, as well as malls and gyms, remained closed even as other parts of the state entered the fourth and final phase of the reopening. That could change once public health experts have reviewed the data and can offer tailored guidance on how to safely resume those businesses, Gov. Andrew Cuomo said at a briefing on Monday. Air filtration systems that remove the pathogen from the air may be one way forward, he said. Don’t miss: Coronavirus vaccine still might not lead to herd immunity in U.S., Fauci warns “There are some things that don’t fit neatly into a phase that are going to require further study, and we’re going through that right now,” Rich Azzopardi, a senior adviser to the governor, said in an email through the governor’s office. “We’re not going to be like other states that are inviting a second wave.”Avoiding a second wave in New York Today, New York is now among a minority of states that have successfully controlled the virus. COVID-19 cases in the U.S. set a new record on Friday, rising above 45,000 in a single day, according to data from Johns Hopkins University. To prevent people in U.S. hotspots from inadvertently sparking infections in New York, Gov. Andrew Cuomo announced that travelers from places such as Texas, Florida and Arizona, must self- quarantine for 14 days when they arrive. “There is now undeniable, irrefutable evidence that the rushed reopenings, non-scientific-based reopenings were a mistake,” Cuomo said during a briefing on Friday. For some industries, such as Broadway and other performing arts, the decision to remain closed was more than a governmental one. Social distancing audience members would make most productions financially unfeasible, said St. Martin, who sits on COVID-related advisory councils for both the city and state. “We would have to break down the financial model that we have and start over,” she said. When they reopen, it will likely be with new technology, such as touchfree ticketing, mandatory masks and other safeguards. One promising option theaters have considered is a smartphone application that helps monitor the health of cast and crew, which could allow them to safely return to working in close quarters, St. Martin said. Indeed, technology, such as the “health code” apps deployed in more than 300 Chinese cities, could also help New York avoid a second wave while allowing some of these trickier settings to reopen, said Dr. Kairong Xiao, an economist and professor at Columbia Business School. In many Chinese cities, the public must enter their daily health information, such as temperature, into an application that tells them their risk level and then present that bill of good health in order to move freely in public. Also read: Letter from Arizona: Hospitals grapple with a surge in coronavirus cases, while life outside continues as normal Many have questioned whether the government can feasibly enforce such a program here, but some individual businesses, like office buildings and gyms, could use such a model to mitigate risk and boost confidence. “At any point, only a small fraction of people have the virus. The problem is we don’t know who they are,” Xiao said. “From the perception of the public, if we can better isolate those people, then everybody is feeling safe.” The pandemic has even challenged New York’s tagline as “the city that never sleeps” now that the subways stop for four hours every night for disinfecting. The system had been operating 24-hours a day since its creation in the 1880s, but round-the-clock service won’t be resuming anytime soon, according to Sarah Feinberg, interim president of the Metropolitan Transportation Authority. “We are absolutely going to wait at least to the end of the pandemic,” Feinberg said at a news conference earlier this month. Subways will remain emptier than they’ve ever been. Ridership, even at peak commute times, could stay below 40% of pre-pandemic levels in the final phase of reopening, according to the latest MTA surveys. For those remaining riders, mandatory masks and free hand sanitizer will become part and parcel of the daily commute. Perhaps the most tectonic shift will be in schools and universities, as millions of students, teachers and staff across the five boroughs prepare for a radically changed 2020-21 school year. The city’s 1 million public school students will likely return to in-person classes on a part-time basis, as part of a model the city’s education department has called “blended learning.” It would mean a mixture of in-person classes and remote learning in order to enable social distancing and mitigate spread. Also read: Gilead’s coronavirus drug will cost $2,340 — which sounds expensive, but here’s why it’s not It’s a hybrid teaching model the City University of New York, which has more than a quarter-million degree-seeking students, will also explore, said Dr. Ayman El-Mohandes, dean of the CUNY Graduate School of Public Health & Health Policy. “We can’t bring this number of people together without people getting sick,” El-Mohandes said. The city’s public university system is also unique from other universities in that it presents a unique public health vulnerability for the city. It has no centralized campus, and students often live at home with parents and siblings—and in many cases in neighborhoods hardest-hit by the coronavirus, El-Mohandes said. “It’s a problem because they are at greater risk of being exposed at home and bringing the infection to the classroom, and at the same time they are at risk of taking back to their families,” he said. Meanwhile, many students don’t have the technology to support full-time online learning. Plus many fields require both students and researchers to be in labs, he added. “You can’t simply say with a brush stroke to learn at home.” All of that is to say nothing of football games, dormitories, parties and other elements of college life. State guidance for higher education has mandated face coverings when people can’t remain six feet apart and regular disinfecting. The state also strongly recommends the use of signs to direct flow of foot traffic, limiting outside guests and closing on-campus facilities, such as libraries, to the general public. “It’s likely we’ll have another moment of spread,” El-Mohandes said. “The difference is that we now know social distancing, testing and so on is available.”"}]}