{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-resume-slump-ahead-of-eia-weekly-inventory-report-2020-09-10", "published": 1599750800.0, "headline": "Oil prices post a loss as EIA reports first weekly U.S. crude-stock climb in 7 weeks", "body": "Oil prices posted a loss on Thursday after U.S. government data revealed a weekly climb in U.S. crude inventories, on the heels of six consecutive weeks of declines, raising expectations of an oversupplied market as uncertainty continues to surround the outlook for demand. The Energy Information Administration reported Thursday that U.S. crude inventories rose by 2 million barrels for the week ended Sept. 4—the first weekly rise in seven weeks. Total U.S. crude inventories, excluding those in the Strategic Petroleum Reserve stood at 500.4 million barrels, about 14% above the five-year average for this time of year. That compared with an average forecast by analysts polled by S&P Global Platts for a fall of 500,000 barrels. The American Petroleum Institute on Wednesday reported a climb of 3 million barrels, according to sources. The supply reports were each delayed by a day due to Monday’s U.S. Labor Day holiday. U.S. refiners took an even bigger hit than expected from Hurricane Laura, which made landfall in late August on the U.S. Gulf Coast, Phil Flynn, senior market analyst at The Price Futures Group, told MarketWatch. The EIA reported a big drop of 1.1 million barrels per day in crude refinery runs for last week, leading to the first domestic crude-stock build in weeks, he said. On Thursday, West Texas Intermediate crude for October delivery CL.1, -1.62% US:CLV20 on the New York Mercantile Exchange fell 75 cents, or 2%, to settle at $37.30 a barrel. November Brent crude BRN.1, -0.07% UK:BRNX20, the global benchmark, lost 73 cents, or 1.8%, to reach $40.06 a barrel after a 2.5% gain in the previous session. Read:Volatility in oil and gold may offer more opportunity than risk Oil futures finished higher Wednesday, with U.S. prices reclaiming less than half of the more than 7% drop suffered in the previous session though worries over the demand outlook, driven by the pandemic, continued to limit crude’s upside potential. Thursday’s EIA data also showed crude stocks at the Cushing, Okla., storage hub edged up by about 1.9 million barrels for the week, while total domestic oil production climbed by 300,000 barrels to 10 million barrels per day. Gasoline supply, meanwhile, fell by 3 million barrels, while distillate stockpiles declined by 1.7 million barrels. The S&P Global Platts survey had shown expectations for a supply decline of 2.5 million barrels for gasoline, but distillates were expected to rise by 300,000 barrels. On Nymex, October gasoline US:RBV20 shed 1.9% to $1.0977 a gallon, while October heating oil US:HOV20 settled at $1.0824 a gallon, down 2.1%. The market is in the “midst of refinery maintenance season, which inherently causes a drop in refinery runs and ultimately finished products supplied,” a proxy for demand, said Tyler Richey, a co-editor at Sevens Report Research. “If we don’t see those demand metrics recover to where they were prior to Hurricane Laura’s landfall, then it will be very difficult for oil to revisit the recent highs in the low-mid $40s, especially given the global supply side uncertainties regarding OPEC+’s next policy moves,” he told MarketWatch. On Sept. 17, the Organization of the Petroleum Exporting Countries and its allies, which form a group known as OPEC+, will hold a market-monitoring meeting. The group in August trimmed supply cuts from earlier this year on hope of improved demand amid the pandemic. OPEC+ oil production climbed by 1.71 million barrels a day to 34.63 million barrels a day in August from a month earlier, according to an S&P Global Platts survey released Wednesday. Also Wednesday, in a monthly report, the EIA lowered its 2021 growth forecast for global consumption of petroleum and liquid fuels by 500,000 barrels per day from its August forecast, to about 99.6 million barrels a day, even as it raised its 2020 forecasts for WTI and Brent crude-oil prices, natural-gas prices, and U.S. crude production. Read:How a big decline in China’s oil imports may ‘test the resiliency of the market’ Rounding out action on Nymex, prices for the October natural gas contract US:NGV20 settled at $2.323 per million British thermal units, down 8 cents, or nearly 3.5%. The U.S. Energy Information Administration reported Thursday that domestic supplies of natural gas rose by 70 billion cubic feet for the week ended Sept. 4. That was a bit higher than the increase of 64 billion cubic feet forecast by analysts polled by S&P Global Platts."}]}