{"article": [{"url": "https://www.marketwatch.com/story/fda-broadens-u-s-safety-inquiry-into-astrazeneca-covid-19-vaccine-reuters-reports-11601552394", "published": 1601555360.0, "headline": "FDA broadens U.S. safety inquiry into AstraZeneca COVID-19 vaccine, report says, raising prospect of further delays", "body": "AstraZeneca’s large, late-stage U.S. trial has remained on hold since September, after a volunteer in the U.K. fell ill with an \"unexplained illness.\" vincenzo pinto/Agence France-Presse/Getty Images The U.S. Food and Drug Administration has widened its investigation into AstraZeneca’s COVID-19 vaccine study, according to a report, raising the prospect of further delays. AstraZeneca AZN, +1.16% and its partner, the University of Oxford, voluntarily paused its Phase 3 vaccine study worldwide on Sept. 9, after a volunteer in the U.K. developed an “unexplained illness.” Regulators in the U.K., Brazil, India and South Africa have since allowed AstraZeneca AZN, +0.63% to resume its clinical trials, but the British drugmaker’s late-stage U.S. trials have remained on hold. The FDA has requested further data, the Reuters report said, citing two sources. The data were expected to arrive this week, after which the agency would need time to analyze. When the British drugmaker paused its trials, it said that unexplained illnesses can happen “by chance” in large trials and must be independently reviewed. An information sheet for participants in the trial from the University of Oxford states that the “unexplained neurological symptoms,” which included changed sensation or limb weakness, were either considered unlikely to be associated with the vaccine or there was “insufficient evidence” to say for certain whether the illnesses “were or were not related to the vaccine.” Read: There are four coronavirus vaccines in late-stage studies — here’s how they differ Sources told Reuters that the FDA was interested in other vaccines developed by the Oxford researchers, which used an adenovirus found in chimpanzees. The news agency said that the regulator wants to look at whether similar side effects emerged in trials of other vaccines designed by the same researchers. However, the broadening of the investigation doesn’t show that the FDA believes there were safety issues associated with any of these vaccines, the report added, with one source saying that the regulator was “being thorough.” A spokesperson for AstraZeneca said: “We are continuing to work with the FDA to facilitate review of the information needed to make a decision regarding resumption of the U.S. trial.” The FDA declined to comment. Read: AstraZeneca vaccine ‘most likely’ to roll out in the U.K. early next year Dr. Anthony Fauci, director of the U.S. National Institute of Allergy and Infectious Diseases, said on Sept. 9 that AstraZeneca’s decision to pause global trials of its experimental coronavirus vaccine was “unfortunate” — but not an uncommon safety precaution in a vaccine development process. In June, the World Health Organization’s chief scientist Dr. Soumya Swaminathan described AstraZeneca’s experimental shot as probably the world’s leading candidate and the most advanced in terms of development. Swaminathan also said that Moderna’s MRNA, +0.09% COVID-19 vaccine candidate wasn’t “far behind” AstraZeneca’s. Read: Moderna climbs after saying COVID-19 vaccine generates antibodies in older adults However, on Thursday Moderna’s chief executive said the company wouldn’t be able to apply for emergency use FDA authorization before Nov. 25 at the earliest, dealing a blow to U.S. President Donald Trump’s hopes of having the vaccine ready ahead of the Nov. 3 election day. Shares in AstraZeneca were trading 2.20% higher in early European trading on Thursday. Analysts at Berenberg on Wednesday initiated coverage with Buy recommendations on AstraZeneca, GlaxoSmithKline GSK, +1.10%, Bristol-Myers Squibb BMY, +0.32% and Novartis NVS, +0.97%."}]}