{"article": [{"url": "https://www.marketwatch.com/story/is-election-year-a-portfolio-game-changer-2020-09-23", "published": 1601137220.0, "headline": "Should you change your investments because itâ\u0080\u0099s an election year?", "body": "Election years are scary. Many people feel the future of the country is hanging in the balance. Drama dominates the news, and social media intensifies it. Emotional spikes are the norm. Add to that a global pandemic, and you have the catalyst for the type of behavior that leads to the self-destruction of carefully planned portfolios. What behaviors cause a portfolio to veer off track? Well, Iâ\u0080\u0099m not a golfer, but I know enough to realize I wouldnâ\u0080\u0099t use a putter for my long-game. And for many, retirement is a long game of 20 to 30 years, maybe more. In life, the games donâ\u0080\u0099t get much longer than that. You can raise a child in less time than retirement may last. Read: Some wealthy Americans are already prepping their finances for a Joe Biden presidency â\u0080\u0094 hereâ\u0080\u0099s how When you build an investment strategy for retirement, ideally, you match your investment approach to the length of time it needs to last. You wonâ\u0080\u0099t consume your entire portfolio at once, so you choose drivers for a large portion of it. A driver is the type of golf club used to get the ball as far as possible toward the green from a long distance. While playing golf, you may be swinging from 200 yards; when investing, youâ\u0080\u0099re swinging for 10 to 20 years into the future. What if I'm in my 40s and don't have a retirement fund? There are numerous long-term investment approaches, or drivers, that are likely to work well for a 20 to 30 year retirement time horizon â\u0080\u0094 but they may not work at all if you interrupt their progress along the way. Itâ\u0080\u0099s like using a driver on the first through the fifth holes, then a putter for the sixth, then back to drivers, then back to a putter for the 13th. How well do you think that game will go? Most people invest carefully for retirement. Itâ\u0080\u0099s money you must be able to count on. Sure, you may have a small account where you day-trade or buy a few random stocks you love. But are you that nonchalant with your retirement portfolio? Hopefully not. Read: Social Security, Medicare, prescription drug prices â\u0080\u0094 Aging in America panel weighs in on election topics Then, election year rolls around. As emotions run across a broader range of the spectrum, suddenly, it seems like applying a short-term trading strategy to your long-term money makes sense. And thus, it is that every four years, I watch normally very rational long-term investors become unhinged and apply short-term thinking to their retirement portfolios. It might work. You might get lucky. Perhaps you can call who will win the election, what the markets will do, sell, then buy, at just the right time, to outperform what would have happened if you had remained invested with a long-term strategy, eyes focused on where things could be six, seven or eight years in the future. Yes, you might get lucky. And you might not. For investors who are considering changing approaches because of the election, ask yourself, what game are you playing? And do you have the tools and knowledge set to play that game well? For example, consider tactical asset allocation funds, where they â\u0080\u009caim to deliver better absolute or risk-adjusted returns than static allocation funds by deftly switching exposure among asset classes.â\u0080\u009d How successful are they? According to Morningstar, tactical allocation funds donâ\u0080\u0099t deliver. Professionals manage these funds with a wealth of technology tools, research, and staff at their disposal. Yet, they are not able to outperform a long-term strategic allocation approach. Strategic allocation is a strategy used to determine what percentage of your assets to place in various asset classes according to your goals and risk tolerance. Then you rebalance as needed, with no need to shift things around based on current events. Itâ\u0080\u0099s rather dull. Itâ\u0080\u0099s also rather effective. It requires mental discipline and the ability to set your emotions aside, or at the least, disconnect them from your portfolio decisions, during volatile times. Setting emotions aside is easier said than done. We are humans, not computers, which is why it is more important than ever that you know what game you are playing. I am not a good golfer. I donâ\u0080\u0099t enjoy it, and when Iâ\u0080\u0099ve tried it, Iâ\u0080\u0099m horrible. Then again, Iâ\u0080\u0099ve never put any effort into learning. But Iâ\u0080\u0099ll go out with friends for the camaraderie. I am clear about the game and how well I donâ\u0080\u0099t play. Investing should be the same. Be clear about what you are doing and why. If you donâ\u0080\u0099t like risk, better to maintain a more stable portfolio than try to time your risk decisions around events like the election. If you are a day-trader, and good at it, trade away. If youâ\u0080\u0099re a tactical allocator, and good at it, keep at it. And if youâ\u0080\u0099re playing the long game of strategic allocation, before you try to election-proof your retirement by changing games, consider that your long-term approach may be the strategy that is already perfectly aligned to your retirement goals."}]}