{"article": [{"url": "https://www.marketwatch.com/story/trump-administration-urges-supreme-court-to-invalidate-obamacare-even-as-coronavirus-cases-surge-in-south-west-2020-06-26", "published": 1593159980.0, "headline": "Trump administration urges Supreme Court to invalidate â\u0080\u0098Obamacareâ\u0080\u0099 even as coronavirus cases surge in South, West", "body": "WASHINGTON (AP) â\u0080\u0094 As coronavirus cases rise in more than half of the states, the Trump administration is urging the Supreme Court to overturn the Affordable Care Act. The administrationâ\u0080\u0099s high court filing Thursday came the same day the government reported that close to half a million people who lost their health insurance amid the economic shutdown to slow the spread of COVID-19 have gotten coverage through HealthCare.gov. The administrationâ\u0080\u0099s legal brief makes no mention of the virus. More than 20 million Americans could lose their health coverage and protections for people with preexisting health conditions also would be put at risk if the court agrees with the administration in a case that wonâ\u0080\u0099t be heard before the fall. House Speaker Nancy Pelosi blasted the administrationâ\u0080\u0099s latest move in a partisan battle over â\u0080\u009cObamacareâ\u0080\u009d that has stretched on for a full decade since the lawâ\u0080\u0099s passage in 2010. Pelosi is planning a floor vote early next week on her own bill to expand the ACA. â\u0080\u009cThere is no legal justification and no moral excuse for the Trump administrationâ\u0080\u0099s disastrous efforts to take away Americansâ\u0080\u0099 health care,â\u0080\u009d she said in a statement. Just as the nation seemed to be getting better control over the virus outbreak, states including Arizona, California, Florida, Georgia, Nevada and Texas are reporting a surge in cases. And more than half the states are seeing case increases. Anger over problems with â\u0080\u009cObamacareâ\u0080\u009d was once a winning issue for Republicans, helping them gain control of the House in 2010 and the Senate in 2014. But the politics of the issue flipped after President Donald Trump failed to deliver in 2017 on his vow to â\u0080\u009crepeal and replaceâ\u0080\u009d the health law. Democrats were energized by their successful defense of the ACA, and that contributed to their winning back the House. In the case before the Supreme Court, Texas and other conservative-led states argue that the ACA was essentially rendered unconstitutional after Congress passed tax legislation in 2017 that eliminated the lawâ\u0080\u0099s unpopular fines for not having health insurance, but left in place its requirement that virtually all Americans have coverage. Trump has put the weight of his administration behind the legal challenge. If the health insurance requirement is invalidated, â\u0080\u009cthen it necessarily follows that the rest of the ACA must also fall,â\u0080\u009d Solicitor General Noel Francisco wrote Thursday. Other prominent Republicans, including Sen. Lamar Alexander of Tennessee, have said Congress didnâ\u0080\u0099t intend to bring down the whole law by striking the coverage penalty. The Trump administrationâ\u0080\u0099s views on what parts of the ACA might be kept or replaced if the law is overturned have shifted over time. But in legal arguments, it has always supported getting rid of â\u0080\u009cObamacareâ\u0080\u009d provisions that prohibit insurance companies from discriminating against people on account of their medical history. Nonetheless, Trump has repeatedly assured Americans that people with preexisting conditions would still be protected. Neither the White House nor congressional Republicans have specified how. The government report showing rising sign-ups for health coverage under the ACA amid the coronavirus shutdown came from the Centers for Medicare and Medicaid Services. The figures are partial because they donâ\u0080\u0099t include sign-ups from states that run their own health insurance marketplaces. Major states like California and New York are not counted in the federal statistics. An estimated 27 million people may have lost job-based coverage due to layoffs, and itâ\u0080\u0099s unclear what â\u0080\u0094 if anything â\u0080\u0094 theyâ\u0080\u0099re turning to as a fallback. People who lose employer health care are eligible for a special sign-up period for subsidized plans under the Obama-era law. Many may also qualify for Medicaid. The Trump administration has been criticized for not doing as much as states like California to publicize these readily available backups. In response, administration officials say they have updated the HealthCare.gov website to make it easier for consumers to find information on special sign-up periods. Thursdayâ\u0080\u0099s report from the government showed that about 487,000 people signed up with HealthCare.gov after losing their workplace coverage this year. Thatâ\u0080\u0099s an increase of 46% from the same time period last year. Itâ\u0080\u0099s unclear from the government numbers how many of the new enrollees lost their coverage because of layoffs due to the pandemic. CMS also made no estimate of how many people will ultimately seek coverage through the Obama health law as a result of economic shock waves. Generally thereâ\u0080\u0099s a 60-day window to apply after losing coverage. However, the report found a clear connection. â\u0080\u009cWhile the magnitude may be unclear, job losses due to COVID-19have led to increased enrollments on HealthCare.gov,â\u0080\u009d it said."}]}