{"article": [{"url": "https://www.marketwatch.com/story/the-tension-behind-ok-boomerwhy-millennials-are-so-resentful-of-the-me-generation-2020-09-02", "published": 1599023180.0, "headline": "The tension behind â\u0080\u0098OK boomerâ\u0080\u0099â\u0080\u0094why millennials are so resentful of the â\u0080\u0098Me Generationâ\u0080\u0099", "body": "This article is reprinted by permission from NextAvenue.org. In her provocative new book,Â â\u0080\u009cOK Boomer, Letâ\u0080\u0099s Talk:Â How My Generation Got Left Behind,â\u0080\u009d millennial author and journalist Jill Filipovic argues that baby boomers are largely to blame for the financial, employment and health woes of millennials. So, as a boomer and editor of Next Avenueâ\u0080\u0099s Money & Policy and Work & Purpose channels, I wanted to take Filipovic up on her offer and talk. We did. During my interview with the 37-year-old CNN columnist and New York Times contributing opinion writer, and after reading her book, I discovered that Filipovicâ\u0080\u0099s condemnation of boomers was more nuanced than her title suggests. It turns out that Filipovic credits boomers (now age 56 to 74) for a few things and takesÂ millennialsÂ (now age 24 to 40) to task a bit, too. Also, I learned, some of her vitriol against boomers is really directed at conservative boomer commentators on Fox News and talk radio. “ I think the biggest misunderstanding is that a lot of boomers assume millennials came into adulthood facing a similar set of opportunities that boomers did. ” â\u0080\u0094 Jill Filipovic, author of â\u0080\u009cOK Boomer, Letâ\u0080\u0099s Talkâ\u0080\u009d Making serious allegations against boomers Still, she makes some serious allegations against boomers and challenges them to change their ways. To research her book, Filipovic sent out an online survey to a few hundred millennials, boomers, Gen Xers, Silent Generation and Gen Z members. Then, she held in-depth conversations with a few dozen of them; some of those people ended up in the book. Here are highlights of our spirited conversation: Next Avenue:Â What inspired you to write this book? Did it come out of theÂ â\u0080\u0098OK Boomerâ\u0080\u0099Â catchphrase and meme on TikTok, where younger people mocked the attitudes they attributed to boomers? Jill Filipovic:Â Iâ\u0080\u0099ve been thinking about a lot of the issues that I cover in the book for a while. And when that OK Boomer meme hit, I ended up writing a column about it for CNN that seemed to really touch a nerve. So I was interested in writing a book, not to look at the meme itself, but explore the tension behind it. Why millennials and younger folks in general were so resentful of baby boomers and then why baby boomers reacted with such a profound offense at being told â\u0080\u0098OK Boomer.â\u0080\u0099 The goal was to go beyond the tension and try to have a conversation.Describing the book as a â\u0080\u0098reckoningâ\u0080\u0099 and a â\u0080\u0098peace offeringâ\u0080\u0099 You call the book a reckoning, but also a peace offering to boomers. What do you mean? I didnâ\u0080\u0099t want to write a book that was just an indictment of baby boomers, although it certainly is an indictment of many of the decisions they made as they came into adulthood and took political control of the country. So, I wanted it to beÂ reckoning first of how we got here. It wasnâ\u0080\u0099t just an accident. There were political decisions made before boomers were born and when they were young that opened up a certain set of opportunities for them. And then, as baby boomers came into adulthood, there were choices made by politicians that many baby boomers voted for and eventually by baby boomers themselves that foreclosed upon some opportunities for millennials. I wanted to dig in very honestly to that history and essentially ask the boomer audience to look at that in its face and confront it. The peace offering comes from if we understand what happened, then we can move forward. And so it is asking baby boomers, OK, letâ\u0080\u0099s get past some of the silly generational warfare â\u0080\u0094 the â\u0080\u0098OK Boomerâ\u0080\u0099/ â\u0080\u0098Millennial Snowflakeâ\u0080\u0099 business â\u0080\u0094 and get to work on repairing some of the damage that has been done. You write that both boomers and millennials have been unfairly maligned. Weâ\u0080\u0099ll talk about millennials in a minute, but how do you think boomers have been maligned? Well, I think the stereotype about boomers is that theyâ\u0080\u0099re all these kind of reactionary, right-wing conservatives. (Laughs.) I think that is certainly not true. Boomers are the most politically polarized generation in America, cleaved pretty neatly down the middle, between left and right. While there have been conservative boomers who have had a disproportionate share of political power, the reality is there are also boomers who have been sounding the alarm on the exact same issues that millennials are now up in arms about. Boomers were not the founders of the civil-rights movement, theÂ feminist movementÂ or the antiwar movement but they certainly were many of those movementsâ\u0080\u0099 foot soldiers. And they continue to be many of the most notable, interesting, current advocates of things like feminism and racial justice. So, there are a lot of boomers who are doing incredible, important work who have spent their lives trying to improve things. They have not captured as much political power as the conservative Donald Trump baby boomers in the world. That doesnâ\u0080\u0099t mean that they donâ\u0080\u0099t exist. And I think that when we paint a generation with a broad brush, we miss the fact that baby boomer women entered the workforce in record numbers, which very much did open up a series of opportunities that women of my generation are getting to enjoy. Not everything that is wrong in America is the fault of the baby boomers and much of the progress that weâ\u0080\u0099ve seen in the last half-century is thanks to baby boomers. The progressive half of the boomer generation deserves quite a lot of credit.Conservative commentators But you also say boomers are largely responsible for the political and cultural backlash to the civil rights, feminists and LGBTQ rights movements. Arenâ\u0080\u0099t you really talking about conservative commentators and politicians? Thatâ\u0080\u0099s rightâ\u0080¦.You see conservative commentators on Fox News claiming the legacy of Martin Luther King Jr. and people like John Lewis. Thatâ\u0080\u0099s just not true. You say that millennials are â\u0080\u0098widely chastised but poorly understood.â\u0080\u0099 Why do you think boomers chastise millennials so much? Part of it is just the cyclical nature of generations and old versus young. (Laughs.) Boomers were certainly chastised when they were young as well and cast as The Me Generation and being sort of selfish narcissists. I think whatâ\u0080\u0099s different now is there is a boomer-targeted conservative media that really uses millennials as a scapegoat group and makes an example of us as sort of short hand for everything thatâ\u0080\u0099s wrong with America and all of the ways the young and the left, which they think are intertwined, are kind of trying to reshape the country into something unrecognizable. And what do you think boomers misunderstand most about millennials? I think the biggest misunderstanding is that a lot of boomers assume millennials came into adulthood facing a similar set of opportunities that boomers did. And that if we haveÂ failed to achieve the milestones of adulthoodÂ that boomers achieved, that that must an individual failing rather than society and an economy that looks completely different and does not have nearly as many open doors as boomers were able to walk through.What she thinks boomers get wrong about millennials and work You also think boomers have it wrong aboutÂ millennials and work. Some boomers think millennials hop around from job to job too quickly. What do you say? Thereâ\u0080\u0099s actually no evidence that millennials job hop more than boomers did. Young people job hop, right? And boomers did when they were young as well. I think what boomers are missing is that many boomers did have a ladder up to the middle class. Whereas I think many millennials feel we donâ\u0080\u0099t. We had to scramble and climb and really fight for scraps. We did not enter an economy where your employer is going to look out for you. Mention the word â\u0080\u0098pensionâ\u0080\u0099 to a millennial and theyâ\u0080\u0099re going to laugh in your face. Itâ\u0080\u0099s just a completely foreign concept to us. Many of us donâ\u0080\u0099t even have retirement accounts; many of us arenâ\u0080\u0099t even eligible to participate in employee retirement accounts. Many of us donâ\u0080\u0099t even have health insurance. So, I think we really are doing our best to scramble and scrounge and hustle. Boomers perceive it as disloyal and trying to rise too far, too fast and entitled. And I think millennials just see it as trying to survive. In one big theme of your book, you say millennials are suffering from a kind of â\u0080\u0098generation-wide cognitive dissonanceâ\u0080\u0099 â\u0080\u0094 a profound gap between the expectations they were raised to hold and the reality they experience. Can you talk about that? Definitely. Many millennials were raised with this promise that if we worked hard and did well in school, got a college education, that we would be on the path to a relatively stable life. That there would be a relationship between effort and outcome. And I think a lot of us are realizing that has turned out to not necessarily be true. A lot of us didnâ\u0080\u0099t have the basic markers of adulthood that our parents were able to accrue; we couldnâ\u0080\u0099t afford a house, we can barely afford the rent, weâ\u0080\u0099re living with roommates at 30. I think a lot of us internalized those failures as individuals and think that we must have done something wrong. And I think what youâ\u0080\u0099re seeing now is that a lot of millennials are having a collective awakening almost, and realizing: â\u0080\u0098Hey, wait a minute! This is a theme across our generation. It canâ\u0080\u0099t possibly mean that all of us are screw ups. Something else is going on here.â\u0080\u0099Boomers love their millennial kids, butâ\u0080¦ I thought it was fascinating that you say boomers tend to love their millennial kids and vice versa. But you say the generations have problems with each other as a whole. Why do you think thereâ\u0080\u0099s this disparity between the micro and the macro? A lot of baby boomers as parents did quite a bit for their kidsâ\u0080¦They looked at their relationships with their parents and said I donâ\u0080\u0099t want to have a very authoritarian Iâ\u0080\u0099m-the-parent-youâ\u0080\u0099re-the-kid kind of relationship. I want to do it better. All of which are good things. I, like so many millennials, benefited from my parentsâ\u0080\u0099 extending resources, helping me with my homework, buckling me into my car seat. Related: Millennials and younger Americans now constitute a majority of the U.S. population And the parents understand their childrenâ\u0080\u0099s individual struggles. They donâ\u0080\u0099t think their kid is lazy even if the kid is 32 and living at home or if youâ\u0080\u0099re still paying your sonâ\u0080\u0099s cellphone bill. I think where millennials become frustrated is them looking around and seeing how much it mattered who your parents were and what their resources were and how that set the trajectory of your life. My life is pretty good and I feel lucky and grateful for that. Iâ\u0080\u0099m aware at how profoundly unfair that is. And if I had been born into different circumstances, I couldâ\u0080\u0099ve wound up in a really different place. But where does the ire come from, blaming the other generation? Thatâ\u0080\u0099s a fair question. From the millennialsâ\u0080\u0099 side, yes thereâ\u0080\u0099s a sense of gratitude for the individual investments our parents made, but the ire comes from the political choices some parents made.What Filipovic blames boomers most for What do you blame boomers most for? I would say itâ\u0080\u0099s a long listâ\u0080¦ (Laughs.) One source of frustration is that baby boomers had a chance to both continue and expand the government programs that really did open so many doors to them and prop up the ladder to the middle class. But instead what happened is that boomers shut those doors and pulled the ladder up. When boomers were coming of age, there was significant investment in the future, in infrastructure, in building schools and roads and paying for higher education. As boomers have aged, that reversed. And now that agenda has been consolidated into entitlement programs for aging. See: Thereâ\u0080\u0099s only one generation in U.S. history thatâ\u0080\u0099s considered to be more unlucky than the â\u0080\u0098Lost Generationâ\u0080\u0099 I donâ\u0080\u0099t think millennials resent that weâ\u0080\u0099re paying for baby boomers and older folks to have Social Security and Medicare. We support those programs. We just resent that the largess is essentially being largely taken from our future and that we are not being invested in similarly. You write that â\u0080\u0098boomers, unfortunately, donâ\u0080\u0099t seem interested in sharing.â\u0080\u0099 What could boomers do to be sharing better? Ah, so much! I think first and foremost boomers need to be sharing powerâ\u0080¦ 2018 was a record year for millennials in Congress because they went from 1% to 6%. Weâ\u0080\u0099re 22% of the population! We would love to see political parties really investing in getting young people elected, not just to work on campaigns. Really giving us power. Being willing to step aside. Being willing to share that power. And not just in politics. But also in business and advocacy and nonprofits and newsrooms. All of the layers of work, society and civic alignment.Problems for millennials and for boomers Some of the problems you say millennials face are ones I think boomers also face. You say: â\u0080\u009cmillennials struggle to get decent health care.â\u0080\u009d Isnâ\u0080\u0099t that also true for boomers who arenâ\u0080\u0099t yet eligible for Medicare, if youâ\u0080\u0099re talking about health insurance premiums? These things are not unique to millennials, but I would say theyâ\u0080\u0099re pronounced for millennials. And you say â\u0080\u0098itâ\u0080\u0099s millennials who shoulder the demands of the new always-on lifestyle and feel all the exhaustion, anxiety and burnout that comes with it.â\u0080\u0099 Iâ\u0080\u0099m a boomer and many of my friends are and we feel this, too. Millennials have experienced this their entire working lives. You write that millennials â\u0080\u009clook forward to empty federal coffers when we retire.â\u0080\u009d I know theÂ Social Security trust fund is due to run short of moneyÂ in 2035, but donâ\u0080\u0099t you think between now and then, Congress and whomever the president is will come up with ways to shore it up like they did in the 1980s, the last time we were in this position? Of course, there is still time to fix that impending problem and Iâ\u0080\u0099d hope thatâ\u0080\u0099s the case. But millennials are cynical generally that theyâ\u0080\u0099ll be taken care of because we havenâ\u0080\u0099t been taken care of so far. Related: This depressing chart shows the jaw-dropping wealth gap between millennials and boomersWhere she says millennials screwed up You say that when it comes to the transformative power of technology and the internet, millennials â\u0080\u0098screwed this one up.â\u0080\u0099 Why do you say that? Well, that was â\u0080\u0094 as in other parts of the book â\u0080\u0094 hyperbolic and a little jokey. Millennials assumed tech would be an overwhelming good and many of us had a naive view of itâ\u0080¦Millennials invented companies [Mark Zuckerberg, founder and CEO of Facebook FB, +0.26% is a millennial] that being used to enable discord on a huge level, and bigotry and dissemination of false information. And on a smaller, personal level, facilitate isolation and other social ills. You wrote most of the book before theÂ pandemic.Â How do you think the pandemic has changed the way millennials look at boomers and the way boomers look at millennials? I hope it is changing some of the perceptions. I think the pandemic has made many of us feel a level of insecurity and hyperconnectiveness that for millennials has been normal for quite a long time. I would hope that engenders some sense of solidarity. Millennials lost more jobs in the pandemic than any generation. So, we are in big trouble. But boomers have lost jobs too and itâ\u0080\u0099s very hard to get hired if youâ\u0080\u0099re unemployed and over 50, due to age discrimination. Definitely. I donâ\u0080\u0099t mean to sound callous about the challenges that boomers face. Age discrimination is real. But itâ\u0080\u0099s important not to write off or negate the hardship that millennials are facing in this moment.What about Gen X? Your book is about boomers and millennials. Whatâ\u0080\u0099s your view aboutÂ Gen X, the generation in between boomers and millennials? Gen X is always totally angry at me on Twitter TWTR, -0.23% Â . They feel like theyâ\u0080\u0099ve been ignored. Theyâ\u0080\u0099re a smaller generation. But they are the bridge between what boomers experienced and what millennials did. In many ways, the challenges GenerationX faced were a preview of what was in store for millennials. But they didnâ\u0080\u0099t have it quite as bad as we did. You write that you hope well-meaning boomers will be inspired to do something before itâ\u0080\u0099s too late. What would you like them to do? Iâ\u0080\u0099d love to see boomers investing in the issues millennials care about most and listening to what millennials and Gen Zers are talking about. It matters for our futures. And whatâ\u0080\u0099s your advice for millennials? I think we would do well to recognize the tremendous amount of experience and wisdom so many boomers bring to the table and that, to some degree, a lot of boomers have been fighting these fights a long time. We can work intergenerationally to make something better for all of us and our kids. Itâ\u0080\u0099s hugely important. Richard Eisenberg is the Senior Web Editor of the Money & Security and Work & Purpose channels of Next Avenue and Managing Editor for the site. He is the author of â\u0080\u009cHow to Avoid a Mid-Life Financial Crisisâ\u0080\u009d and has been a personal finance editor at Money, Yahoo, Good Housekeeping, and CBS Moneywatch. Follow him onÂ Twitter. This article is reprinted by permission from NextAvenue.org, Â© 2020 Twin Cities Public Television, Inc. All rights reserved."}]}