{"article": [{"url": "https://www.marketwatch.com/story/southampton-concert-featuring-chainsmokers-goldman-sachs-chief-could-result-in-fines-criminal-penalties-2020-07-28", "published": 1595961080.0, "headline": "Southampton concert featuring Chainsmokers, Goldman Sachs chief could result in fines, criminal penalties", "body": "Organizers of a charity concert featuring the Chainsmokers and Goldman Sachs GS, -0.21% CEO David Solomon spinning tracks, as well as the town of Southampton, New York, where the event was held, could face civil fines and criminal penalties for the mass gathering, Gov. Andrew Cuomo said on Tuesday. Fallout and public scrutiny continue to ramp up in the wake of the “drive-in” concert that took place in a Hamptons sculpture park on Saturday night, after viral photos and videos of the event showed guests crowding in front of the stage without masks during a Chainsmokers performance. The New York State Department of Health has since opened an investigation into the event. “I want local governments to understand that we take this very seriously,” Cuomo said during a conference call with media members on Tuesday morning. “The department of health is going to do a full investigation as to why the town of Southampton issued a permit; what promoters thought they were doing; how the event, as it went on, was allowed to get out of control; and why the local law enforcement didn’t do anything when they saw they had an event that was out of control with all the rules being violated.” Secretary to the governor Melissa de Rosa added that other local governments or event organizers “should see what happened in the Hamptons and be forewarned.” iframe.twitter-tweet { width: 100% !important; } Opening acts for the concert, which was called “Safe & Sound,” included Southampton Town Supervisor Jay Schneiderman and his band, as well as Solomon, performing under his D.J. alias. D-Sol. A spokesperson for Goldman Sachs told MarketWatch in an emailed statement that Solomon agreed to perform with the understanding that “organizers worked closely with the local government and put strict health protocols in place.” Goldman Sachs CEO David Solomon Getty Images Solomon performed early in the show and left before the event ended, the spokesperson said. “The vast majority of the audience appeared to follow the rules, but he’s troubled that some violated them and put themselves and others at risk.” Schneiderman, the town supervisor, did not immediately respond to requests for comment. Nor did In the Know Experiences, which helped organize Safe & Sound, or JAJA Tequila, which partnered with In the Know on the event. The governor’s office did not immediately provide clarification on who specifically may face criminal penalties as a result of the state investigation. State officials gave no indication that the performers faced penalties. JAJA Tequila is co-owned by Alex Pall and Drew Taggart of the Chainsmokers, as well as Elliot Tebele, whose company, Jerry Media, was heavily involved in promotion of the Fyre Festival in 2017. The event itself was a fundraiser for causes including No Kid Hungry and Children’s Medical Fund of NY, and was originally envisioned as a socially distanced drive-in, where guests could watch the stage from in or near their vehicles, which were parked in designated, safely spaced out areas. Tickets reportedly went for as much as $25,000. Cuomo blasted the concert as “a gross violation of not only the public health rules, but a gross violation of common sense, and grossly disrespectful to fellow New Yorkers.”Other New York news: • COVID-19 infection rates across the state remain low; out of 57,000 tests conducted yesterday, 0.93% came back positive. Intubation rates are also encouraging, Cuomo said, with a total of 81 people intubated across the state yesterday, the lowest number since March 15. Intubations are often considered an early indicator of future coronavirus deaths. Statewide, nine people died from the virus on Monday. • The governor also extended an offer to Major League Baseball teams to hold games in New York instead of high-risk states, provided that players travel on private planes, stay in designated hotels, and undergo testing before games. “New York state could host any Major League Baseball games that any teams want to play and they could play those games in our stadiums,” Cuomo said. The offer came as the MLB suspended the Miami Marlins season as 15 players tested positive for the coronavirus."}]}