{"article": [{"url": "https://www.marketwatch.com/story/this-new-study-shows-how-well-a-coronavirus-vaccine-must-work-before-we-can-stop-social-distancing-2020-07-15", "published": 1594890320.0, "headline": "This new study shows how well a coronavirus vaccine must work before we can stop social distancing", "body": "The U.S. is pinning its hopes on a COVID-19 coronavirus vaccine, but will a vaccine alone be enough to stop the pandemic and allow life to return to normal? The answer depends on a how “good” the vaccine ends up being. In a study published July 15 in the American Journal of Preventive Medicine, my colleagues and I used a computer simulation of every person in the country to show how effective a vaccine would have to be and how many people would have to get vaccinated to end the pandemic. We found that a coronavirus vaccine’s effectiveness may have to be higher than 70% or even 80% before Americans can safely stop relying social distancing. By comparison, the measles vaccine has an efficacy of 95%-98%, and the flu vaccine is 20%-60%. That doesn’t mean a vaccine that offers less protection would be useless, but it would mean social distancing in some form may still be necessary.What is vaccine ‘effectiveness’ anyway? Some political leaders have suggested that society will return to normal soon, especially if a vaccine becomes available by the end of the year or early in 2021. Some vaccines are currently in early-stage trials, but that timeline would still be very optimistic. Read:Moderna stock surges 17% on coronavirus vaccine trial news However, it is important to remember that a vaccine is like many other products: What matters is not just that the product is available but also how effective it is. Take clothing for example. If you are going to a formal dinner, underwear alone may partially cover you but probably not well enough for the occasion. This doesn’t mean underwear is useless. Similarly, different vaccines may offer different levels of protection. Scientists talk about this as the vaccine’s efficacy or effectiveness. If 100 people who haven’t been exposed to the virus are given a vaccine that has an efficacy of 80%, that means that on average 80 of them would not get infected. The difference between efficacy and effectiveness is that the former applies when vaccination is given under controlled circumstances, like a clinical trial, and the latter is under “real-world” conditions. Typically, a vaccine’s effectiveness tends to be lower than its efficacy.Computer simulations show what could happen Since COVID-19 coronavirus vaccines are still under development, now is the time to set vaccine efficacy levels to aim for, as well as to manage expectations. Running computer simulations is really the only way to ethically do this. For the study, our PHICOR team at the City University of New York Graduate School of Public Health and Health Policy, working with scientists from the National School of Tropical Medicine at the Baylor College of Medicine, developed a computer simulation model of the entire United States and its population interacting with each other. Using that model, we were able to introduce the COVID-19 virus into this virtual population in different ways and have it spread from person to person in various pandemic scenarios. Each simulated person who gets infected has probabilities of being hospitalized, placed on a ventilator or dying based on the severity of the problems just as in the real world. Experiments using this simulated population can represent the different vaccines and what is likely to happen if different proportions of the population are vaccinated at different times during the pandemic. The results show how vaccines with different levels of efficacy would affect the pandemic and can be used to estimate the impact on things such as number of people who get infected, health outcomes and costs. In this case, we assumed that only one vaccination would be required.What will it take to stop the pandemic? Typically, in an epidemic or pandemic, as more people are exposed to the virus, the number of new infections per day steadily increases until it reaches a peak and begins to drop. Of course, how long this takes depends upon how the virus and the response to it may evolve over time. To stop the pandemic, the number of new infections per day needs to drop to zero, or at least to a very low number, as quickly as possible. If the COVID-19 pandemic was just beginning and the population infected was close to 0%, the simulations show that vaccine efficacy would have to be at least 60% to stop the coronavirus if the entire population was vaccinated. Given the number of susceptible people who couldn’t be vaccinated because of age or health problems and the number who would refuse to be vaccinated, that’s probably impossible. If only 75% of the population gets vaccinated, the vaccine efficacy would have to be around 70%. If only 60% of people get vaccinated, the threshold goes even higher, to around 80%. It’s all about making sure the virus can’t find more people to infect. Those numbers assume that a person infected with the virus infects 2.5 other people on average. If the virus is more contagious, the vaccine has to be more efficient. Now, the further along the pandemic is, the less the height of the peak can be reduced. It’s like climbing a mountain — you are already at a certain height. Plus, it is harder to shut a pandemic down when there are more infectious people running around. So, when 5% of the population has already been infected with the virus, the best that you can do is reduce the peak by around 85%. The difference between 0% and 5% can add up to millions of infections. So far, about 1% of the U.S. population has been confirmed to have been infected, but officials estimate the actual percentage is much higher. How many people get vaccinated is crucial Based on these findings, a vaccine with an efficacy as low as 60% could still stop the pandemic and allow society to return to normal. However, most if not all of the population would have to be vaccinated. This seems unlikely, given polls showing that only about three-quarters of Americans say they would get a coronavirus vaccine if assured that it was safe. With fewer people protected, a vaccine would have to have an efficacy of at least 80% to be able to stop the pandemic by itself, meaning social distancing could be completely relaxed. This can provide a target to aim for when developing COVID-19 coronavirus vaccines. Again, all of this doesn’t mean that a vaccine with a lower efficacy would not be useful. It would mean that social distancing and mask-wearing likely would have to continue until the pandemic runs its course or a vaccine that is actually “good enough” arrives. Bruce Y. Lee is a professor of health policy and management at City University of New York. This was first published on The Conversation — “How ‘good’ does a COVID-19 coronavirus vaccine need to be to stop the pandemic? A new study has answers” Now read:Your personality traits explain whether you follow or flout coronavirus mask-wearing and social-distancing guidelines"}]}