{"article": [{"url": "https://www.marketwatch.com/story/under-proposed-plan-nyc-students-to-attend-in-person-classes-two-or-three-times-a-week-in-september-2020-07-08", "published": 1594233260.0, "headline": "Under proposed plan, NYC students to attend in-person classes two or three times a week in September", "body": "Most of New York City’s 1.1 million public school children will return to classrooms only two or three days a week in September under a preliminary plan Mayor Bill de Blasio unveiled on Wednesday. “We know that we cannot maintain proper physical distancing and have 100% of our students in school buildings five days a week. It’s just geographically, physically not possible,” de Blasio said, as he and city schools Commissioner Richard Carranza outlined a proposal for so-called “blended learning,” where students learn remotely at home for part of the week. The plan still needs state approval, a decision expected early next month. New York City is the largest school district in the country, where roughly three-fourths of students are economically disadvantaged. The vast majority of families — 75% — have said they want their children to return to in-person learning in the fall, according to an education department survey of hundreds of thousands of parents in New York. Families can decide to keep their children at home and distance learning five days a week, with the option to return to the classroom later in the school year. The city is asking those parents to sign up for 100% remote learning by the first week of August. For everyone else, ambitious preparations are under way across the city to get ready for schools to reopen at reduced capacity and with a slew of new health protocols Carranza outlined on Wednesday. Schools are updating HVAC systems with higher-grade filters to reduce the potential spread of the coronavirus through the air. Classrooms will expand into auditoriums, gyms and cafeterias, and even into enclosed school yards, where possible, to spread children out, he said. The city’s School Construction Authority is also looking to expand into other city buildings and even lease property near schools. See: Coronavirus can spread in the air ‘beyond any reasonable doubt,’ over 200 scientists tell the World Health Organization “We’re going to get our hands on any and all space we can to maximize the options,” de Blasio said. Many questions remain outstanding, not the least of which is what options working parents will have when their children are remote learning at home. Working groups under the education department are also addressing issues like band and music classes, where health considerations and social distancing might present major challenges, as well as after school programs and other extracurricular activities, Carranza said. The plan still needs approval from the state and its bevy of public health experts, said Gov. Andrew Cuomo at his own briefing on Wednesday. New York will issue general guidance to public schools on Monday and expects its 700 school districts to submit reopening plans by the end of July. The state will review and approve or make recommendations on those plans in the first week of August, Cuomo said. As the virus surges in other parts of the country, Cuomo said the state is waiting to make the final decision on schools until it has the best and most up-to-date health data. “I understand there’s a drop-dead date where you have to make a decision,” Cuomo said. “But wait until that date to make a decision because the facts may change. As we see, a week can be a lifetime with this COVID virus.” He suggested there may be different models for different school districts, though the state will release a single set of guidance for public schools on Monday. One of the biggest unions representing teachers in the state voiced its support for a public health-first reopening in response to the news on Wednesday. Andy Pallotta, New York State United Teachers president, said districts must make masks available to students and staff, disinfect schools adequately, enforce 6 feet of social distancing and make accommodations for teachers and students at higher risk. “Parents and school staff must have a seat at the table locally to work out the details,” he said. “Second we need the federal and state funding.” Both Pallota and Cuomo pushed back against President Donald Trump’s calls this week for all schools to reopen in September. Cuomo said Trump doesn’t have the legal authority or the power to threaten states who don’t comply. See: Trump threatens federal funding for schools, says he disagrees with CDC over reopening guidelines “School reopenings are a state decision, period,” he said. “That is the law, and that is the way we’re going to proceed.”Other New York developments: • Shopping malls in most of New York state can reopen on Friday as long as they have enhanced air-conditioning filtration systems, Cuomo also announced on Wednesday. Malls must update HVAC filters to those with at least a MERV-11 rating to capture the potentially airborne coronavirus. The reopening applies to every region of the state outside of New York City, which is still in Phase 3. • As daily case numbers continue to rise in most other states, New York’s daily metric held steady with 1.2% of the 60,000 tests coming back positive. In total, the state recorded 692 new cases on Tuesday and 11 deaths. • Airlines have agreed to distribute forms to people landing in New York in order for the state to keep track of those coming from high-risk areas and required by law to quarantine for 14 days."}]}