{"article": [{"url": "https://www.marketwatch.com/story/us-retail-sales-climb-12-in-july-and-return-to-precrisis-levels-but-growth-slowing-2020-08-14", "published": 1597398740.0, "headline": "Retail sales climb 1.2% in July and return to precrisis levels, but growth slows as stimulus fades", "body": "The numbers: Sales at U.S. retailers rose modestly in July and returned to precrisis levels, but growth has tapered off since the economy reopened and could soften again in the months ahead in the absence of another major federal-relief package, experts say. Retail sales rose 1.2% in July, the government said Friday. Economists polled by MarketWatch had forecast a 2% advance. Receipts have slowed from a 8.4% increase in June and a record 18.3% gain in May when an economic rebound began. Retailers have been on a roller-coaster ride since the pandemic began, sinking in March and April and recovering rapidly in the following two months as the economy reopened. The more mild increase in sales in July might be a sign of what lays ahead, however. The resurgence of coronavirus cases this summer sapped the economy of momentum, delayed the return of people to their jobs and in some cases spurred more layoffs. At the same time, a $600 federal unemployment benefit expired at the end of last month and Washington is deadlocked over another major aid for the economy. The added uncertainty and potential loss of income for millions of Americans still out of work could undercut retail sales and make it harder for the economy to recover from the deepest recession in modern American history. Chief economist Gus Faucher of PNC Financial Services calculates that reduced jobless benefits could shrink household income by $70 billion in August. Read:Did the expired $600 federal jobless benefit keep people from going back to work? What happened: Sales surged almost 23% at stores such as Best Buy BBY, +1.45% that sell electronics and appliances, marking the third straight strong gain in a row. It’s a good sign for the economy when consumers are buying discretionary items like computers or new fridges. In another positive sign, spending at bars and restaurants climbed 5% despite renewed restrictions in some states on indoor dining after the jump in confirmed infections of the novel strain of coronavirus that causes COVID-19. Sales had popped nearly 27% in June. What’s more, recent evidence from OpenTable, the restaurant-booking site, suggest diners began to return again in August. Sales also rose at clothing stores, pharmacies, groceries, internet retailers and gas stations. Internet-store receipts rose a meager 0.7%, however, after declining in June. internet shopping had soared during the pandemic, but it is possible that flat sales in the past two months is a sign that people are buying more products at bricks-and-mortar stores. Gas receipts increased 6.2%, mostly reflecting higher oil prices. Americans aren’t commuting to work or driving out of town as much during the pandemic. Oil prices have partly rebounded from an 18-year low earlier in the year. Sales fell 1.2% at auto dealers after a string of increases. Car and trucks sales have been surprisingly strong, benefiting from ultra-low interest rates. Sales also declined at home centers. Read:Jobless claims fall below 1 million for first time since start of coronavirus pandemic Big picture: The amount of money being spent at retailers is back to precrisis levels owing to massive federal stimulus. Sales are higher now than they were in February and they are 2.7% higher compared with the same month a year ago. Yet sales could slow further in the next few months if the coronavirus keeps spreading. A slower recovery, in turn, could force companies to cut jobs and put even more stress on the economy. Much will depend on how states and the federal government respond. Another federal relief package, for instance, or lighter state restrictions on business could nurture a fragile recovery. What they are saying? “From here on, the recovery in consumer spending as measured in the retail sales report is likely to be a lot more grudging,” said chief economist Joshua Shapiro of MFR Inc. “The deceleration in spending still suggests that the economy requires a broad fiscal support package,” said economist Katherine Judge of CIBC Economics. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% opened modestly lower on Friday."}]}