{"article": [{"url": "https://www.marketwatch.com/story/women-money-managers-have-an-edge-over-men-during-the-pandemic-of-2020-thank-tech-stocks-for-that-2020-08-31", "published": 1598930780.0, "headline": "Women money managers have an edge over men during the pandemic of 2020. Thank tech stocks for that", "body": "A century after winning the right to vote and in the midst of a pandemic, female fund managers are outperforming their male colleagues on Wall Street. That is according to a team of equity strategists at Goldman Sachs, who crunched the numbers in honor of 2020, which marks the 100th anniversary of the 19th amendment’s ratification, which affirmed a woman’s right to vote. Goldman found that year-to-date, 43% of female-managed mutual funds outperformed their benchmarks on a year-to-date basis, versus 41% of funds beating their benchmarks with no female managers. From the start of the year, up to March 28, when markets were swinging wildly on pandemic panic, Goldman found the median female-managed fund outperformed its benchmark by 50 basis points, whereas the typical fund lacking a female at the top, underperformed its benchmark by 20 basis points. And the reason for the better performance comes down to stock picking, said chief U.S. equity strategist, David Kostin and the team: “Men may be from Mars and women from Venus, but female-managed funds tilt toward Info Tech while non-female managed funds prefer Financials,” said the strategists. “At the stock level, female—managed funds have higher relative exposure to highfliers Amazon AMZN, +3.01%, Apple AAPL, +1.74%, Microsoft MSFT, +2.48%, AbbVie ABBV, +0.41% and Tesla TSLA, +1.89%, but lower exposure to Berkshire Hathaway BRK.B, +0.24% Wells Fargo WFC, , Visa, UnitedHealthcare UNH, +1.68% and Exxon Mobil XOM, -1.47%, which have underperformed those buzzier names. Clearly, betting on tech has paid off so far this year, with the tech-laden Nasdaq Composite COMP, +1.39% up 30% versus roughly 9% for the S&P 500 and a slightly negative Dow industrials DJIA, +0.56% (but it ended last week trade in positive territory). The SPDR S&P Bank ETF KBE, -0.69% and Energy Select Sector SPDR ETF XLE, -1.59% are each down over 30% year to date, representing to of the weakest sectors of the S&P 500’s 11. Read:Now that Apple and Tesla’s stock has split, here’s what individual investors should know before they jump in To qualify as a female managed fund, at least one third of managerial positions had to be held by women. Of the 496 large-cap U.S. mutual funds with $2.3 trillion in assets under management, 13% of the total, with $261 billion in assets exceeded that threshold. Only 14, or 3%, have an all-female fund manager team, managing just 2% of total assets. That is against 380 funds, 77% of the total, which are run by an all-male team, accounting for 57% of domestic equity mutual fund assets. The outperformance by female-led funds seems to have something to do with the historic nature of 2020. From 2017 to 2019, Goldman found that return volatility and the Sharpe ratio, which measures the risk-adjusted returns of a fund, were even across funds run by all women, men and a mix of the two. But portfolios with more women, year-to-date, have seen stronger Sharpe ratios. After adjusting for volatility, the median all-female managed fund returned more than 2 times that of the typical all-male fund. Males did have a slight edge when it came to outflows. The median female-managed fund saw slightly larger outflows year-to-date of around 5.7% of starting assets under management since the beginning of the year. The median fund with no female managers saw outflows of 5.5%. Meanwhile, female-managed funds oversee more than twice the assets as those without women at the helm — $1.1 billion versus $500 million. Opinion:New bull market in stocks could last three years and produce another 30% in gains, say veteran strategist"}]}