{"article": [{"url": "https://www.marketwatch.com/story/service-side-of-the-us-economy-shows-surprising-growth-in-july-ism-finds-but-employment-worsens-2020-08-05", "published": 1596627440.0, "headline": "Service side of the U.S. economy show surprising growth in July, ISM finds, but employment worsens", "body": "The numbers: Retailers, health-care providers and most other service-oriented businesses expanded in July for the second month in a row, suggesting the economy showed more resilience than expected even after a spike in coronavirus cases caused many states to reimpose restrictions. The Institute for Supply Management’s index of nonmanufacturing companies edged up to 58.1% last month from 57.1% in June. That topped the 55% forecast of economists polled by MarketWatch. Any number above 50% indicates more companies are expanding. Fifteen of the 18 service industries tracked by ISM grew in July. Although last month’s reading is the highest since November 2018, businesses aren’t actually doing as well as they were a few years ago. The ISM survey basically asks executives if things are better or worse than they were in the prior month, not how much business they are conducting. Sales are running well below precrisis levels. In a worrisome sign, the improvement didn’t lead to more companies bringing back workers. A gauge of employment deteriorated again. Read: Economy suffers titanic 32.9% plunge in 2nd quarter, points to drawn-out recovery Also:‘A massive welfare economy’ - federal aid prevents even steeper GDP collapse What happened: New orders and production both rose. The index of new orders climbed to 67.7% from 61.6% while the gauge for production edged up to 67.2% from 66%. Respondents remain concerned about the pandemic,” said Anthony Nieves, chairman of the survey. “However, they are mostly optimistic about business conditions and the economy as businesses continue to reopen.” The employment gauge, however, slipped to 42.1% from 43.1%. Some companies had to lay off or furlough workers again last month in states such as California where business restrictions were reimposed to slow the latest outbreak of the virus. The weak level of employment in the ISM’s manufacturing and service surveys signals that U.S. employment growth in July is likely to soften after big gains in June and May. “Phased opening of businesses continues at a slow pace. Spending is down. Unemployment is up this year,” said an executive at a government agency. See:Manufacturers expand in July for third straight month, but not all jobs are coming back Also:Job trouble? Wave of rehiring after economy reopened to fade in July after viral spiral Big picture: The service side of the economy employs more than 80% of all American workers. So long as the coronavirus is running amok, companies can’t bring back all their employees and are likely to experience weaker sales, making it harder for the U.S. economy to recover. What they are saying? “This is, frankly, a bit surprising given that July was a rough month, with reports of record high virus-related hospitalizations, and how big cities, normally well-entrenched in high tourist season, rolled back their reopenings,” said Jennifer Lee, senior economist at BMO Capital Markets. “But there was one area that does not sit well,” she added. “The employment component weakened for the first time since April.” Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 index SPX, +0.87% rose in Wednesday trades. Stocks have traded in a narrow range for the past few weeks."}]}