{"article": [{"url": "https://www.marketwatch.com/story/trump-threatens-to-decouple-u-s-economy-from-china-accuses-biden-of-treachery-11599553852", "published": 1599539900.0, "headline": "Trump threatens to 'decouple' U.S. economy from China, accuses Biden of 'treachery'", "body": "U.S. President Donald Trump speaks during a labor day press conference at the North Portico of the White House in Washington, DC on September 7, 2020. mandel ngan/Agence France-Presse/Getty Images President Trump on Monday vowed to \"decouple\" the US economy from China and blasted his Democratic challenger, Joe Biden, for being a \"stupid person\" whose \"economic treachery\" allowed the authoritarian nation's economic rise. Trump spoke to reporters on Labor Day from the North Portico of the White House - a rare venue for a presidential press conference. \"If Biden wins, China wins, because China will own this country,\" Trump said. \"Today's Labor Day - it's a good time to talk about where we're being ripped off by countries, but nobody's even close to China.\" Trump spoke after a New York Times report detailed the former vice president's longstanding belief that US industries and human rights in China would benefit from boosting China's economy through trade. \"The New York Times has just published an entire story on Biden's China's sellouts, which is amazing for the New York Times. I appreciate that,\" Trump said. \"In 2001 Biden said the United States welcomes the emergence of a prosperous integrated China at the global stage because we expect this is going to be a China that plays by the rules. They didn't play by the rules â\u0080¦ The World Trade Organization â\u0080¦ that's why they became a rocket ship. They were flatline for years and years and years and they joined the World Trade Organization. And frankly they cheated.\" Trump said, \"I made a great trade deal with China\" in January before the coronavirus pandemic and \"they're buying [US products]. You know why? They're buying because they know I'm not happy. That's why they buy.\" But Trump vowed to punish China for \"sending\" COVID-19 overseas, including by \"decoupling\" economically. \"We will make America into the manufacturing superpower of the world and we'll end reliance on China once and for all, whether it's decoupling or putting in massive tariffs like I've been doing already. We're going to end our reliance on China, because we can't rely on China,\" Trump said. Democratic National Committee spokeswoman Lily Adams denounced Trump's speech as \"incoherent.\" \"Trump ignored the economic havoc he's created and lied his way through a series of debunked political attacks,\" Adams said. Trump's economic nationalism regarding China comes as he works to again win the Rust Belt states that struggled with globalization. \"We will manufacture our critical medical supplies in the United States, we will create Made in America tax credits and bring our jobs back from China to the United States and we will impose tariffs on companies that desert America to create jobs in China and other countries,\" Trump said. \"We will prohibit federal contracts from companies that outsource to China, and will hold China accountable for allowing the virus to spread around the world. Now you can understand why China would much rather see Sleepy Joe than Donald Trump.\" The Trump administration recently sanctioned Chinese officials for eliminating Hong Kong's political autonomy and detaining Uyghur Muslims in re-education camps, as the COVID-19 pandemic contributed to a dramatic souring in relations. \"Because of Biden's economic treachery was 60,000 shuttered American factories. I heard this morning that the real number is probably 70,000â\u0080¦ and he's talking about how wonderful it is with China. No, China has been very bad - on top of which we had the China virus sent to usâ\u0080¦ We had other viruses sent in over the years that came from China. I wonder why.\""}]}