{"article": [{"url": "https://www.marketwatch.com/story/10-year-treasury-yield-flirts-with-record-low-ahead-of-weekly-jobless-claims-2020-08-06", "published": 1596729200.0, "headline": "Treasury yields bounce off lows as stocks recover after Trump administration rescinds global travel warning", "body": "Treasury yields came off their intraday lows on Thursday after the Trump administration rescinded its global travel warning, inspiring a late-day recovery in risk assets and erasing the government bond market’s earlier gains. Investors also saw a snapshot of the labor market’s health that suggested a full recovery in the U.S. remains far away as coronavirus cases rise in many states. What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 0.6 basis point to 0.535%, after touching a low of 0.504% earlier, while the 2-year note rate TMUBMUSD02Y, 0.156% was at 0.117%. The 30-year bond yield TMUBMUSD30Y, 1.576% slipped 1.8 basis points to 1.200%. See: Here’s why the 10-year yield is a whisker away from setting a new record lowWhat’s driving Treasurys? Treasurys came under pressure later on Thursday after the Trump administration lifted its blanket warning against all global travel. The State Department had posted the warning on March 19 when the coronavirus trajectory started accelerating in the U.S. Stocks rose on the hopes that Americans may start traveling again and that the U.S. would see a normalization of some social activities. The S&P 500 SPX, +0.87% inched closer to its all-time high of 3,393.52 set on February 19. On the data front, the number of Americans filing for jobless benefits for the week ended Aug. 1 fell to 1.186 million, down from the previous week’s reading of 1.435 million. Economists polled by Econoday had forecast a weekly increase in new claims to 1.442 million. The number of people receiving traditional jobless benefits through the states, known as continuing claims, dropped by a seasonally adjusted 844,000 to 16.1 million in the week ended July 25. Despite the decrease, investors noted the U.S. recovery had a long way to go as unemployment claims still remain far above pre-pandemic levels. Investors will now turn their attention to the official monthly employment report on Friday. Analysts warn other employment indicators could point to fewer job gains in July, a risk to investors who have been betting on a sharp economic rebound after a dismal second-quarter this year. See: Economists predict U.S. added 1.7 million jobs in July, but admit it’s largely a guess. Here’s what worries them Job cuts announced by U.S.-based employers jumped in July to 262,649, the third-largest monthly total ever, according to global outplacement firm Challenger, Gray & Christmas. These concerns were shared by senior Federal Reserve officials. Cleveland Fed President Loretta Mester on Wednesday said the U.S. labor market is even weaker than the data indicates. The Bank of England held interest rates at zero and did not expand the size of its bond-buying program. Their policy making committee noted it might take the U.K.’s annual economic output until the end of next year to return to levels last recorded at the end of 2019. Negotiations over another fiscal stimulus package ran on in Congress. White House officials said that if a deal is not reached by Friday, talks are likely to stop during the summer recess. What did market participants’ say? “The jobless claims numbers have been showing weakness in the past several weeks. Now we see some improvement. It’s a series we’re going to watch more carefully,” said Jim Caron, a senior portfolio manger at Morgan Stanley Investment Management, in an interview. Amid the growing expectation for a poor jobs report on Friday, Caron said the monthly employment numbers could be highly erratic and, therefore, it would be important to watch how the labor market recovery progresses over the coming weeks and months."}]}