{"article": [{"url": "https://www.marketwatch.com/story/fauci-takes-aim-at-trump-administration-state-lawmakers-and-young-americans-youre-propagating-the-pandemic-2020-07-17", "published": 1595231780.0, "headline": "Fauci takes aim at Trump administration, lawmakers and young Americans: 'You're propagating the pandemic'", "body": "Anthony Fauci has taken off the gloves. \"The citizenry of the state or the city had the impression you went either from lock down to caution to the wind,\" he said. The director of the National Institute of Allergy and Infectious Diseases for three decades also took aim and lawmakers and young people: \"You're propagating the pandemic.\" The Trump administration is trying to block $25 billion for states to conduct testing and contact tracing in the next coronavirus relief bill, people involved in the talks told the Washington Post on Saturday. Wait times vary from a matter of hours to up to 26 days in some extreme cases. Quest Diagnostics Inc. DGX, +0.33%  one of the largest labs in the U.S. performing coronavirus tests, said that the average turnaround time for non-priority patients is \"seven or more days\" and \"slightly more than one day\" for priority patients. \"We will not be in a position to reduce our turnaround times as long as cases of COVID-19 continue to increase dramatically across much of the United States,\" the company told MarketWatch. \"This is not just a Quest issue. The surge in COVID-19 cases affects the laboratory industry as a whole.\" In an hour-long interview with Mark Zuckerberg on Facebook Live FB, +0.26% on Thursday, Fauci said, \"When you looked at what happened in European counties, when they had their peak, they locked down.\" He added, \"I say OK, time out. Everybody regroup.\" \"You have got to do it correctly,\" he said. \"You can't jump over steps, which is very perilous when you think about rebound. The proof of the pudding is. Look what has happened. There really is no reason that we are having 40,000, 50,000, 60,000, other than we are not doing something correctly.\" Fauci recently said that the U.S. government had not been doing well with contact tracing, the process of tracing people who have been in contact with someone identified to have the virus, instructing them to stay home, and connecting them with the resources they need to do so. \"I don't think we're doing very well, for a number of reasons, and not all of which is the fault of the system,\" he said in an interview last month with CNN T, -1.01%. Fauci previously said the virus may be mutating to become more transmissible. Young people should not be sanguine, Fauci warned, particularly those who are hit badly and/or require hospitalization. \"It's going to take months to a year or more to determine if there are any long-lasting, deleterious consequences of the infection,\" he said on the Facebook Live. As of Sunday, COVID-19, the disease caused by the virus SARS-CoV-2, had infected at least 14.5 million people globally and 3.8 million in the U.S. It had killed over 606,206 people worldwide and at least 140,534 in the U.S., according to Johns Hopkins University. Florida reported 12,478 new cases on Sunday. Texas reported over 10,000 new cases for the fifth consecutive day. The day before, the U.S. recorded over 70,000 new cases, exceeding previous records for the second consecutive day. Last week, Trump took aim at Fauci. \"Dr. Fauci's a nice man, but he's made a lot of mistakes,\" Trump said on Sean Hannity's Fox News show. \"Like you don't have to ban them coming in from very infected China. I did it anyway and we saved hundreds of thousands of lives.\" Fauci said he did recommend restricting travel, and said pitching economic recovery at the expense of public health and the likely surge to levels seen at the beginning of the pandemic was \"an unfortunate mindset.\" He told Zuckerberg, \"You can't jump over steps.\" The Dow Jones Industrial Index DJIA, +0.56%  closed lower Friday though stocks post modest weekly gains, as investors tracked round two of the potential fiscal stimulus. The S&P 500 SPX, +0.87%  and Nasdaq Composite COMP, +1.39%  ended the week up slightly. Related: Here's one 'remarkable' difference between COVID-19 and the 1918 Spanish flu How COVID-19 is transmitted"}]}