{"article": [{"url": "https://www.marketwatch.com/story/game-on-unity-software-prices-ipo-at-52-to-raise-at-least-1-3-billion-11600386580", "published": 1600372640.0, "headline": "Game on: Unity Software prices IPO at $52 to raise at least $1.3 billion", "body": "Unity Software Inc. said in a filing with the Securities and Exchange Commission that these are some of the games that run on its software. Unity Software Inc. is adding a lot of fuel to its financial engine, as yet another strong software IPO gets underway. The San Francisco company, which makes a software engine that designers use to create videogames, priced its initial public offering at $52 a share Thursday evening, according to a person familiar with the matter, higher than an already elevated target range. Unity U, +8.43% stands to bring in at least $1.3 billion at a valuation of $13.7 billion at that price, and is expected to begin trading Friday morning on the New York Stock Exchange under the ticker symbol U. Unity offers its gaming engine — a software system that provides a framework in which developers can build their games without having to reinvent the wheel — free to developers, and only starts charging a licensing fee after a certain revenue milestone has been crossed. “Unity is very attractive to independent developers,” Forrester research director Chris Gardner told MarketWatch. Launched in Denmark in 2004 as Over the Edge Entertainment, Unity moved to the U.S. and changed its name in 2009, when it attracted $5.5 million in investment from Sequoia Capital. Unity has stayed private for more than a decade since, with continuing funding rounds moving its valuation up to $6 billion on the private markets as of July 2019. The company lost $163.2 million last year on revenue of $541.8 million, with sales growing 42.2% and losses increasing by 24% from the year before. For more: 5 things to know about the Unity Software IPO Unity is going public as its biggest competitor, Epic Games Inc., faces a fight with two of the biggest platforms for videogames, Apple Inc.’s AAPL, +1.74% iOS and Alphabet Inc.’s GOOGL, +1.82% GOOG, +1.97% Android. Epic, known for its popular “Fortnite” game as well as the Unity rival Unreal Engine, has sued Apple and Alphabet’s Google after being booted from their respective app stores for openly attempting to bypass their payment systems and avoid paying them a cut of “Fortnite’s” proceeds. Apple also attempted to boot the Unreal Engine, which could have blocked developers from using the software, but a judge barred that from happening, while allowing “Fortnite” to remain banned from Apple’s App Store. See also: Will videogames be the Achilles heel for Apple, Google in antitrust investigations? Unity also goes public amid a wave of hot software IPOs. Snowflake Inc. SNOW, -0.91% recorded the biggest IPO for a software company on record earlier in the week, and has been joined by JFrog Inc. FROG, +0.85% and Sumo Logic Inc. SUMO, +0.33%. All three enjoyed strong debuts on Wall Street, with Snowflake more than doubling, JFrog increasing nearly 50% and Sumo Logic jumping more than 20% in their respective first days of trading this week. Read: IPO like it’s 1999: Market is hitting dot-com-boom levels as software debuts keep popping Unity planned to sell at least 25 million shares in the offering, and underwriting banks — led by Goldman Sachs and Credit Suisse — have access to an additional 3.8 million shares that could push the total take higher. MarketWatch staff writers Jon Swartz and Wallace Witkowski contributed to this article."}]}