{"article": [{"url": "https://www.marketwatch.com/story/teslas-board-chair-faces-opposition-from-proxy-advisers-2020-06-16", "published": 1592374400.0, "headline": "Tesla's board chair faces opposition from proxy advisers", "body": "Institutional Shareholder Services Inc. and Glass Lewis, the two largest independent services meant to advise investors on crucial shareholder votes, have come out against the reelection of Tesla Inc.'s board chair on concerns about executive compensation and board independence. Robyn Denholm, named chair in November 2018, is also chair of the audit committee. Tesla has scheduled its shareholder meeting for July 7 in Mountain View, Calif. Glass Lewis concerns centered around the company's directors and officers liability insurance policy and Tesla's approval of an \"unorthodox and potentially conflicting arrangement\" not in the best interest of shareholders. Tesla has disclosed it did not renew its directors and officers liability insurance policy for the 2019-2020 year due to high premiums. Instead, Chief Executive Elon Musk agreed to personally provide equivalent coverage, with the other board members as third-party beneficiaries. Related:Tesla's Elon Musk gets performance-based payday worth nearly $800 million \"The board concluded that because such arrangement is governed by a binding agreement with the company ... and is intended to replace an ordinary course insurance policy, it would not impair the independent judgment\" of the other board members, Glass Lewis said. \"We are concerned that this D&O arrangement gives the company's independent directors a direct, personal financial dependency upon the CEO they are tasked with overseeing,\" the adviser said. This is \"particularly concerning\" because of Tesla's ongoing shareholder concerns with the board's independence, it said. ISS called for a shareholder vote against Denholm on concerns over the pledging of \"significant\" amounts of stock by Tesla executives as collateral for personal loans. That calls into question the audit committee's \"ability to effectively oversee risk at the company,\" and poses a risk to the investments of outside shareholders, ISS said. \"Directors and executives with a pledged position may be forced to sell company stock (for example, to meet a margin call),\" the adviser said. \"The forced sale of a significant amount of company stock may negatively impact the company's stock price and may violate insider trading policies.\" Musk as well as directors Antonio Gracias, Musk's brother Kimball Musk, and Chief Financial Officer Zach Kirkhorn have pledged shares as collateral to secure personal loans, and the aggregate number of pledged shares, about 4.9 million shares, has increased by 36% year-on-year, ISS said. Based on recent trading volumes, the market could absorb a sale of the pledged shares, \"however, the number of pledged shares as a percentage of the total shares outstanding is excessive and the value of the pledged shares, at approximately $7.9 billion, is significant,\" ISS said. Tesla has a policy limiting pledging of company stock. Directors and executive officers may pledge their stock as collateral for loans and investments, and the maximum aggregate loan or investment amount collateralized cannot exceed 25% of the total value of the pledged stock. See also:Tesla's Fremont factory: Here's what Wall Street is watching as standoff ends According to the board, the policy provides directors and executives financial flexibility without having to rely on large cash compensation or sale of company shares, keeping their interests aligned with shareholders' interests. The policy notwithstanding, \"the aggregate value of the pledged position and the percentage of outstanding shares that is pledged raise significant concerns, which are exacerbated by the high degree of volatility in Tesla's share price,\" ISS said. \"The increase in pledging activity at the company with the absence of a clear rationale and lack of a more robust anti-pledging policy call into question the audit committee's ability to effectively oversee risk,\" ISS said. Denholm and newcomer Hiromichi Mizuno are the only audit committee members standing for election, but since Mizuno was appointed to the board in April, he should not be held accountable at this time, the adviser said. And shareholder votes against Denholm \"are further warranted due to consecutive years of high director pay without a reasonable rationale disclosed,\" ISS said. Both advisers recommended to shareholders to vote for Musk and Mizuno as board members. Mizuno most recently served as executive managing director and chief investment officer of Japan's Government Pension Investment Fund. Denholm, a former telecommunications executive, was named board chair in November 2018 in the wake of a settlement between Musk and the U.S. Securities and Exchange Commission over the CEO's \"going private\" tweets earlier that year. That deal required Musk to step aside as chairman for three years. Shares of Tesla have gained 135% this year, contrasting with losses of 3% and 8% for the S&P 500 index SPX, +0.87%  and the Dow Jones Industrial Average. DJIA, +0.56%  The stock ended at a record high last Wednesday, and has given back some of those gains recently."}]}