{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-expert-calls-for-radical-transparency-on-trumps-coronavirus-treatment-and-progress-as-more-in-presidents-circle-test-positive-2020-10-04", "published": 1601831300.0, "headline": "Coronavirus update: Expert calls for â\u0080\u0098radical transparencyâ\u0080\u0099 on Trumpâ\u0080\u0099s coronavirus treatment and progress as more in presidentâ\u0080\u0099s circle test positive", "body": "MARKETWATCH FRONT PAGE The number of confirmed U.S. cases of the coronavirus that causes COVID-19 rose to 7.4 million on Sunday and now includes President Donald Trump and first lady Melania and at least eight others in their circle, with more people expected to test positive from a Rose Garden event last weekend and others over the past week. See full story.These money and investing tips can help you build a portfolio that can stand the test of time Money and investing stories popular with MarketWatch readers over the past week. See full story. Iâ\u0080\u0099m an upper-middle-class â\u0080\u0098lonerâ\u0080\u0099 entering the â\u0080\u0098home stretch of my lifeâ\u0080\u0099 â\u0080\u0094 who will manage my last wishes? Have a question about retirement, including where to retire? Email HelpMeRetire@marketwatch.com See full story.Professional investors have their eye on these eight stocks as the used-car market in the U.S. moves online Carvana, for now, leads the way in a used-car market thatâ\u0080\u0099s fragmented. See full story.When is the Mike Penceâ\u0080\u0093Kamala Harris debate? Next up on the debate stage: Mike Pence and Kamala Harris. Donald Trumpâ\u0080\u0099s vice president and Joe Bidenâ\u0080\u0099s running mate will face off against each other in Salt Lake City on Oct. 7, in the sole vice-presidential debate of Campaign 2020. See full story.MARKETWATCH PERSONAL FINANCE â\u0080\u0098My mother-in-law has dementia and relies on her husband as a caretaker. We cannot rely on her help in this matter at all.â\u0080\u0099 See full story."}]}