{"article": [{"url": "https://www.marketwatch.com/story/consumer-spending-jumps-record-82-in-may-as-economy-reopens-unemployment-benefits-surge-2020-06-26", "published": 1593165440.0, "headline": "Consumer spending jumps record 8.2% in May as economy reopens, unemployment benefits surge", "body": "The numbers: Consumer spending leaped a record 8.2% in May to mark the first increase since the coronavirus pandemic drubbed the economy, but fading government stimulus payments, still-high unemployment and a fresh viral outbreak are likely to muzzle similarly large gains in the months ahead. The increase in spending fell short of the 10% forecast of economists polled by MarketWatch. The reopening of business activity in May in several states released a barrage of pentup demand as Americans were able to get out and about for the first time in several months. What also allowed them to spend more were generous unemployment benefits, a federal loan program to encourage small businesses to keep paying workers, and onetime stimulus checks for most families. Spending is unlikely to continue to increase rapidly as the summer wears on, though. For one thing, incomes remained depressed with tens of millions of people still out of work. They sank 4.2% last month, reflecting mass unemployment and receding federal aid after a big flush of financial relief in April. Another wave of coronavirus cases, what’s more, is causing some states to hit the pause button on reopening their economies and deterring people from leaving their homes. What Happened: Americans spent more on a variety of goods and services such as new cars, clothes, recreation and even eating out. Spending on health care also increased. The increase in outlays was fueled by massive government financial aid. Unemployment-compensation payouts, for example, nearly tripled as tens of millions of people lost their jobs. More employees returning to work after a brief hiatus also led to a small increase in wages and salaries. The savings rate, after soaring early in the pandemic as Americans hoarded their cash, fell to 23.2% from 32.2%. Before the pandemic savings averaged around 7% a month. Inflation barely rose in May, up just 0.1% as expected The rate of inflation as measured by the PCE price index slipped to 0.5% in the past 12 months from 0.6% in the prior month — well below the Federal Reserve’s 2% target. The rate of inflation has fallen sharply during the pandemic. See: MarketWatch Economic Calendar Another measure of inflation that strips out food and energy, known as the core rate, also rose 0.1% last month. It’s up only 1% in the past year, unchanged from the prior month. The devastation caused by the coronavirus epidemic has forced many companies to cut prices to try to drum up sales, especially in industries such as travel that have been the hardest hit. Analysts predict inflation will remain low until the economy recovers despite all the trillions of dollars spent by the government to prop it up. Read:Slow decline in jobless claims signals choppy recovery Big picture: The economy turned the corner in May after the sharpest and fastest downturn in U.S. history, but further progress in recovering from the pandemic is likely to come much slower. Millions of Americans remain out of work, businesses are struggling to back to normal and the U.S. simply doesn’t need as many employees with the domestic and global economies mired in a deep slump. Economists say the government will likely have to provide more money to families and businesses to maintain the recent momentum. If federal aid dries up, the economy could suffer another setback. Read:U.S. durable-goods orders rebound 15.8%, but manufacturers face long struggle What they are saying? “Consumer spending sprung back to life in May as the nation reopened. But, don’t be fooled, the rebound was only partial and largely supported by April’s massive fiscal stimulus injection,” Gregory Daco and Lydia Boussour of Oxford Economics told clients. “Consumers are still fearful.” “The rebound in May spending alongside substantial income support is encouraging, but the outlook now will be guided by how quickly the nation can suppress the recent flare-up in infections,” said senior economist Sal Guatieri of BMO Capital Markets. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% were set to open lower in Friday trades."}]}