{"article": [{"url": "https://www.marketwatch.com/story/should-you-be-a-day-trader-2020-07-20", "published": 1595250740.0, "headline": "Should you be a day trader?", "body": "I was startled to read a recent New York Times article about some risky trading activity that’s apparently gained favor with young people: day trading. Day trading could be right for you if: • You have money to burn, and • You hope (against all odds) to turn its ashes into riches, and • You love the prospect of getting into deep financial trouble. But even if you satisfy those three conditions, I hope you’ll consider donating your money (which you’ll probably lose otherwise) to a reputable cause instead. The Times article described some ultra-risky trading behavior that’s been happening with Robinhood, an app that offers commission-free trading in stocks, ETFs, and options. The article had a subhead saying that these traders “buy and sell the riskiest financial products and do so more frequently than customers at other retail brokerage firms, but their inexperience can lead to staggering losses.” Apparently this platform can turn the activity of trading stocks into an easy one-click “game” that results in huge volumes of trades, often including risky options contracts. Worse, the article details how some customers did all this on borrowed money. The average customer is 31 years old, and half of them are first-time investors, according to the story. Compounding the trouble these traders face, the company’s website has been unreliable, the Times reported. One version of its software reversed the direction of trades initiated by its customers, giving them the opposite of the result they were seeking. “They make it so easy for people that don’t know anything about stocks,” one customer told the newspaper. “Then you go there and you start to lose money.” That could be an extreme understatement. I think that particular customer bears some responsibility in the matter. According to the article, he funded his trading with $15,000 in credit-card advances plus two home-equity loans totaling $60,000. In March, he lost $860,000. When I read about this, one of my first thoughts was: “Wow! John Bogle must be spending long hours rolling over in his grave.” This isn’t the only company encouraging trading. A popular consumer technology blog runs frequent ads that offer “free live training…How to know 72 hours in advance which stocks to pick.” The fine print (gray lettering over a black background) warns of “substantial risk of loss” and advises: “Don’t trade with money you can’t afford to lose.”The rules of investing — and common sense Although you, dear reader, are undoubtedly too savvy to fall for such things, I think this calls for a review of some basic lessons every investor should know. Don’t take it just from me. Here’s Berkshire Hathaway’s BRK.A, +0.06% Warren Buffett, who isn’t a fan of frequent trading: • “Our favorite holding period is forever…Our stay-put behavior reflects our view that the stock market serves as a relocation center at which money is moved from the active to the patient.” • Here’s another Buffet gem: “Inactivity strikes us as intelligent behavior.” Many young people think they’re smart enough to ignore the advice of old timers like Buffett, Vanguard’s Bogle, and Paul Merriman. But Buffett, one of the world’s richest individuals and who is certainly no dummy, said this: • “Once you have ordinary intelligence, what you need is the temperament to control the urges that get other people in trouble investing.” Bogle didn’t think much of trading either: • “The idea that a bell rings to signal when investors should get into or out of the market is simply not credible. After nearly 50 years in this business, I do not know of anybody who has done it successfully and consistently.” In 2015, Bogle said annual stock trading in recent years averaged about $30 trillion…while only about $250 billion went into new businesses, new technology, medical breakthroughs, and modernizing plants and equipment. In other words, more than 99% of the activity on Wall Street essentially amounts to speculation, “pushing poker chips around the table,” with less than 1% aimed at “creating new poker chips.” That’s a sad commentary on this huge industry. I have a couple more Bogle quotes to share, but let’s see what stock traders themselves have to say. According to his website, Daily Price Action, Justin Bennett is “an internationally recognized Forex trader with 10+ years of experience. He’s been interviewed by Stocks & Commodities Magazine as a featured trader for the month and is mentioned weekly by Forex Factory…Justin created Daily Price Action in 2014 and has since grown the monthly readership to over 100,000 Forex traders and has personally mentored more than 3,000 students.” Sounds like somebody who knows trading. Bennett had this to say recently: • “At the end of the day, every time you buy or sell, there is someone out there doing the exact opposite.” Here are three more quotes worth sharing with anybody you might know who’s tempted by the “easy money” that is supposedly available from trading: • Bogle: “Time is your friend. Impulse is your enemy.” • Bogle (I’m paraphrasing): Wall Street profits from the advice “Don’t just stand there, do something!” Investors, on the other hand, profit from the advice “Don’t do something. Just stand there!” • Michael Lewis, author of “Liar’s Poker”: “The men on the trading floor may not have been to school, but they have Ph.D.’s in man’s ignorance.” • Back to Buffett: “You only have to do a very few things right so long as you don’t do too many things wrong.” Everything I know tells me that day trading qualifies as one of the really “wrong” things investors can do. For some investing perspective, check out my latest video, “The past, present, and future of investing.” Richard Buck contributed to this article."}]}