{"article": [{"url": "https://www.marketwatch.com/story/more-than-33000-tips-25-billion-in-financial-remedies-and-500-million-in-awards-to-investors-the-secs-whistleblower-program-turns-10-years-old-today-2020-07-21", "published": 1595314940.0, "headline": "More than 33,000 tips, $2.5 billion in financial remedies and $500 million in awards to investors â\u0080\u0094 the SECâ\u0080\u0099s whistleblower program turns 10 years old today", "body": "Tuesday marks the 10th anniversary of the Dodd-Frank Act, the landmark financial-reform legislation passed in the wake of the Great Recession. What weâ\u0080\u0099ve learned during this time is that thereâ\u0080\u0099s strong consensus that the whistleblower-rewards provisions are effective in detecting and combatting fraud and conserving limited public resources. Using financial incentives to motivate potential whistleblowers to take the risk of coming forward has strengthened not only Securities and Exchange Commission (SEC) enforcement, but also corporate-compliance programs. While both the SEC and corporate-compliance programs could do better in investigating and remedying the issues raised by whistleblowers, the SEC whistleblower program is an effective model that should be used by other enforcement agencies. Madoff scandal The SEC whistleblower program was spurred, in part, by the Madoff investment scandal, in which thousands of investors suddenly lost their life savings, and a financial crisis that cost the U.S. economy around $22 trillion, according to the Government Accountability Office. Congress modeled the program on the successful qui tam provisions of the False Claims Act (FCA) that permit whistleblowers to sue fraudsters on behalf of the government. Since 1986, FCA whistleblower complaints have recovered more than $40 billion for taxpayers. A decade after it was created, the SEC whistleblower program has enabled the SEC to take enforcement actions resulting in over $2.5 billion in financial remedies and putting about $500 million in the pockets of defrauded investors. In addition, the incentives have generated more than 33,300 tips. The monetary recoveries resulting from whistleblower tips reflect only a portion of the likely success of the program because there are more than 1,000 ongoing matters in which a whistleblower tip has prompted the SEC to open an investigation. To date, the SEC has paid whistleblowers more than $500 million in awards, none of which comes from taxpayer funds. Instead, whistleblowers are paid from an investor-protection fund, an account at the U.S. Treasury funded entirely by the monetary sanctions the SEC collects in judicial or administrative actions. And since whistleblower tips help the SEC take enforcement actions that result in the SEC sending billions to the Treasury, the program pays for itself.Promoting the public interest There are at least five ways in which the SEC whistleblower-reward program promotes the public interest. 1. It protects investors. In a statement introducing proposed amendments to SEC whistleblower rules, SEC Chairman Jay Clayton observed: â\u0080\u009cThe Commissionâ\u0080\u0099s whistleblower program has contributed significantly to our ability to detect wrongdoing and better protect investors and the marketplace, particularly where fraud is well-hidden or difficult to detect. As we continue our pursuit of enforcement initiatives focused on misconduct that impacts the retail investor, the strength of our whistleblower program is a critical component in our investor protection tool box.â\u0080\u009d 2. It detects violations, strengthens capital markets and diverts investment resources to more productive uses. Reduced theft, fraud, manipulation, insider trading and conflicting investment advice increases trust in the markets. In addition, the SEC whistleblower program promotes fair competition by curbing companiesâ\u0080\u0099 ability to use unlawful tactics to get ahead, such as bribing a foreign government to purchase products or services. 3. It conserves precious enforcement resources. According to former SEC Chair Mary Jo White, â\u0080\u009c[a]s the [whistleblower] program has grown, not only have we received more tips, but we also continue to receive higher-quality tips that are of tremendous help to the Commission in stopping ongoing and imminent fraud, and lead to significant enforcement actions on a much faster timetable than we would be able to achieve without the information and assistance from the whistleblower.â\u0080\u009d In other words, whistleblower tips enable the SEC to enforce anti-fraud laws more effectively and efficiently. But, in contrast to the qui tam provisions of the FCA, the SEC whistleblower program gives the SEC sole discretion in whether to act on a tip. Congress should consider whether whistleblowers should be permitted to independently prosecute violations that the SEC does not prosecute. 4. Whistleblower rewards strengthen corporate compliance and deter fraud. Thatâ\u0080\u0099s because companies know that whistleblower tips can enable the SEC to promptly identify fraud schemes that might otherwise go undetected. The financial incentive to report fraud to the SEC essentially forces companies to do a better job investigating and remedying violations that employees report internally. Stronger compliance programs in turn benefit shareholders by increasing the likelihood that companies will detect and halt fraud. 5. Incentives compensate whistleblowers for the enormous risk to their career and livelihood. Whistleblowers often face retaliation for reporting fraud, including harassment, termination, blacklisting and alienation. Indeed, most of the SEC orders granting awards to whistleblowers in 2020 note the retaliation or other hardship that whistleblowers endured. When a senior corporate official is deciding whether to risk millions of dollars in lost future earnings by reporting fraud, the prospect of a whistleblower reward can encourage that official to speak up and assist the SEC by providing critical information. The current chairperson of the Consumer Financial Protection Bureau (CFPB) has recommended that Congress enact a whistleblower program similar to that of the SEC, and legislation creating such a program was recently introduced in the Senate. Although the SEC whistleblower program could be improved in several respects, it has achieved success in its first decade and should spur other agencies to employ whistleblower incentives to promote efficiency and deter fraud. Matt Stock and Jason Zuckerman are whistleblower attorneys at Zuckerman Law in Washington, D.C."}]}