{"article": [{"url": "https://www.marketwatch.com/story/fauci-says-some-states-should-pause-reopening-but-hopes-to-avoid-another-shutdown-2020-07-09", "published": 1594322540.0, "headline": "Fauci says some states should pause reopening, but hopes to avoid another shutdown", "body": "Dr. Anthony Fauci said Thursday that the U.S. is not doing great at containing the spread of COVID-19, but stopped short of saying parts of the country might need to shut down again. “ “I don’t think you can say we’re doing great. I mean, we’re just not.” ” — Dr. Anthony Fauci, to FiveThirtyEight.com In separate interviews Thursday, the nation’s top infectious-disease specialist said that the coronavirus pandemic is every public-health official’s “worst nightmare,” but stepped back from comments he made the day before. “Rather than think in terms of reverting back down to a complete shutdown, I would think we need to get the states pausing in their opening process,” Fauci said at an event hosted by The Hill. “I would think we need to get the states pausing in their opening process, looking at what did not work well and try to mitigate that . . . I don’t think we need to go back to an extreme of shutting down.” “I would hope we don’t have to resort to shutdown,” he said. On Wednesday, Fauci told a Wall Street Journal podcast that states experiencing serious problems with new infections “should seriously look at shutting down,” a position contrary to President Donald Trump’s desire to quickly reopen the country. At Thursday’s event, Fauci said problem states, such as California, Florida, Texas and Arizona, can likely get a handle on the spread of the virus through more limited measures, such as closing bars, banning large gatherings and urging face masks, social distancing and hand-washing. “If we can do that consistently, I would tell you almost certainly you’re going to see a downturn in those infections,” he said. Separately, in an interview Thursday with FiveThirtyEight’s PODCAST-19, Fauci said that compared to other parts of the world, the U.S. is not doing well. “As a country, when you compare us to other countries, I don’t think you can say we’re doing great. I mean, we’re just not,” he said. He added that partisanship has made the fight against coronavirus tougher. “When you don’t have unanimity in an approach to something, you’re not as effective in how you handle it,” he said. “So I think you’d have to make the assumption that if there wasn’t such divisiveness, that we would have a more coordinated approach.”"}]}