{"article": [{"url": "https://www.marketwatch.com/story/why-a-100-billion-covid-package-may-fall-short-as-paris-is-placed-on-red-alert-2020-10-05", "published": 1601994020.0, "headline": "With Paris now on 'red alert,' Macron's â\u0082¬100 billion COVID-stimulus package may prove a bit short", "body": "The French government on Monday toughened its coronavirus-related restrictions in the capital, with Parisian bars notably ordered to close. This follows a record spike of COVID-19 infections in the country, notably among younger people. Restaurants will be allowed to remain open until 10 p.m. on the condition that they put in place stricter sanitary protocols. - An aide to President Emmanuel Macron told Le Monde that France is currently facing \"a really major second wave\" of the pandemic. Marseille, the country's second-largest city, was already placed on red alert along with a few other major urban centers. - The number of total infections in France is now nearing 630,000, second only in Europe to Spain, and ahead of the U.K. - The Macron government has pledged to avoid a new national lockdown similar to the one enforced between March and May this year. It is currently eyeing decisions that would be reviewed fortnightly, depending on the pandemic's progression. - Only 2 million French people have downloaded the COVID control app since its launch in June. That compares with more than 12 million downloads of a similar app in just four days in the U.K., and more than 20 million in Germany. French Prime Minister Jean Castex last week was forced to admit in a television interview that he didn't have the software on his phone. Read:Trump's Coronavirus News Adds New Layer of Uncertainty Around the World The outlook: The Macron government is launching a â\u0082¬100 billion stimulus package just as the progression of the pandemic may mean that it is already insufficient, considering the current spike's additional and unexpected impact on the economy. The French president has let his prime minister take the lead on the coronavirus response, on both the health and economic fronts, but he will not be able to escape blame if the pandemic keep spreading at the current rate, and if he is forced to take even more stringent measures, which many think are unavoidable. Read: Lockdown fatigue and rising protests against new coronavirus restrictions are becoming tougher for governments to manage"}]}