{"article": [{"url": "https://www.marketwatch.com/story/florida-gov-ron-desantis-likens-reopening-schools-to-killing-osama-bin-laden-2020-08-13", "published": 1597340420.0, "headline": "Florida Gov. Ron DeSantis likens reopening schools to killing Osama bin Laden", "body": "“ “Just as the SEALs surmounted obstacles to bring Osama bin Laden to justice, so too would the Martin County School system find a way to provide parents with a meaningful choice of in-person instruction or continued distance learning.” ” — Gov. Ron DeSantis That was Florida Gov. Ron DeSantis comparing the coordination needed to bring kids and teachers safely back into classrooms during the coronavirus pandemic with the May 2011 Navy SEALs strike in Pakistan that killed Osama bin Laden, the mastermind behind the Sept. 11, 2001 terrorist attacks. He said that Martin County Superintendent Laurie Gaylord had told him that she viewed reopening her schools as “a mission akin to a Navy SEAL operation,” and he ran with the mixed metaphor in his address regarding schools reopening during the COVID-19 outbreak on Wednesday evening. DeSantis said that another county superintendent also told him that “never before in his 26-year career had he witnessed what he saw during the first day of school: parents not only bringing their kids to school, but also bringing presents and supplies for the teachers as a way to say thank you.” But viewers were struck by the less than reassuring metaphor, especially since Florida is still averaging almost 7,000 positive COVID-19 tests a day, according to New York Times tracking data, and more than 8,700 Floridians have died from the coronavirus. In fact, DeSantis’ remarks came the same day that a new Politico/Morning Consult poll found that 59% of surveyed Americans oppose the Trump administration’s call to fully reopen K-12 schools, which is up 6 percentage points from the 53% who were against this just last month. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } This led “Bin Laden” to trend on Twitter TWTR, -0.23% overnight Wednesday into Thursday morning. Read more:More and more Americans don’t want Trump fully reopening schools yet Others used the odd juxtaposition of killing a mass-murdering terrorist with reopening schools during a pandemic that has killed more than 166,000 Americans as a means to mock the Republican governor. (In fact, a New York Times analysis of data provided by the CDC found that at least 200,000 more Americans than usual have died since March, or about 60,000 more than the official data is linking to COVID-19.) iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Sorting out how and when to reopen schools as coronavirus cases continue to climb nationwide is a complicated issue. Many parents struggled to work from home while also home schooling their kids when the pandemic first shut down schools in the spring. As a result, women have been more likely to drop out of the labor force or pare back their hours to make educating their kids at home work. People who can afford it are hiring expensive private tutors and “teaching pods” to manage the workload, but what about those who can’t? Parents and educators are also worried about kids falling behind in their studies, as well as the long-term effects of interrupted learning. For example, the NWEA academic assessment organization has estimated that kids are starting this fall school year with 63% to 68% of the learning gains in reading relative to a typical school year, and just 37% to 50% of the typical learning gains in math. What’s more, the Brookings Institution think tank estimates that losing four months of school closures, including universities, could cost the U.S. $2.5 trillion or 12.7% of its annual gross domestic product. Its reasoning: missing school hurts students’ future earning potential, as these institutions prepare students to enter the workforce and be productive members of the economy. Read more:Here’s how much school closures will cost parents in lost wages, reduce GDP — and negatively impact the nation’s education system But there’s also a very real risk that reopening schools before the community spread of COVID-19 is under control could lead to more outbreaks. As schools in Georgia, Tennessee and Mississippi have begun reopening, some have already been forced to close again after students and teachers have tested positive for COVID-19. One school in Georgia’s Cherokee County has ordered more than 900 students and staff to quarantine after 59 people tested positive. Follow MarketWatch’s coronavirus coverage here."}]}