{"article": [{"url": "https://www.marketwatch.com/story/its-official-the-us-open-tennis-tournament-will-go-on-at-the-end-of-august-2020-06-16", "published": 1592331980.0, "headline": "The U.S. Open tennis tournament will go on at the end of August, but without fans and perhaps without stars", "body": "New York Gov. Andrew Cuomo gave the go-ahead Tuesday for the U.S. Open tennis tournament to be held in his state starting in late August — but without spectators — as part of the reopening from shutdowns caused by the coronavirus pandemic. “You can watch it on TV, and I’ll take that,” Cuomo said at his daily briefing in Albany. Now that the U.S. Tennis Association’s proposal to hold its marquee event has been accepted — including a “bubble” setup with designated hotels, limited player entourages and a facility closed to the hundreds of thousands of people who usually attend the U.S. Open — the key question becomes: Who actually will end up competing on the blue hard courts in Flushing Meadows from Aug. 31 to Sept. 13? Some of the sport’s top names, including defending U.S. Open men’s champion Rafael Nadal along with No. 1-ranked players Novak Djokovic and Ash Barty, have expressed reservations about heading somewhere that was a hot spot for the COVID-19 outbreak. An indoor tennis facility at the Billie Jean King National Tennis Center temporarily housed hundreds of hospital beds at the height of New York’s coronavirus crisis. Others expressed an eagerness to return to action: Both the ATP and WTA tours have been suspended since early March because of the virus. The U.S. Open normally is the fourth and final Grand Slam tournament of each season but would be the second major of 2020, following the Australian Open, which concluded in early February. The start of the clay-court French Open was postponed from May and currently is scheduled to begin a week after the U.S. Open ends. Wimbledon was canceled altogether for the first time since World War II in 1945. “Well done @usta for being so forward thinking in getting this done. A great achievement. Players and fans alike are thrilled with this development,” tweeted John Isner, the top U.S. man in the rankings at No. 21. “Time to get back on the courts!” Another American, No. 195 Mitchell Krueger, quoted Isner’s comment and wrote: “I can find you about 140+ players that are most certainly not ‘thrilled’ with this development.” That’s a reference to the USTA’s decision to eliminate qualifying rounds that normally give lower-ranked singles players a chance to earn a spot — and extra money — in the U.S. Open field. The USTA is getting rid of qualifying and instead moving the Cincinnati hard-court tournament that it owns to New York ahead of the start of the U.S. Open. Another reduction for 2020: The men’s and women’s doubles draws for the U.S. Open each will have 32 teams instead of 64. Overall player compensation for the U.S. Open and Cincinnati tournament, which includes prize money and hotel costs and $6.6 million to compensate players who would have been in qualifying in Flushing Meadows, will be $60 million; that’s about $7 million less than in 2019. The tours are expected to reveal the restructured 2020 tennis calendar within the week. More than 40 tournaments at the sport’s highest levels have been scrapped so far and there likely will not be any sanctioned play until early August, although various exhibition matches with no rankings points at stake have been taking place around the world in recent weeks. “We recognize the tremendous responsibility of hosting one of the first global sporting events in these challenging times,” USTA CEO Mike Dowse said in a statement released shortly after Cuomo’s announcement, “and we will do so in the safest manner possible, mitigating all potential risks.” With international TV contracts — including an annual average of $70 million from ESPN alone — helping offset the loss of money from ticket sales and other onsite revenue, and facing a recession that already led to the elimination of more than 100 jobs at the USTA, the association’s board decided to go forward with the U.S. Open. “We can showcase tennis as the ideal social distancing sport,” Dowse said. Cuomo opened Tuesday’s news conference by touting “good news on the numbers, good news on the facts” in New York, which he said has its lowest number of coronavirus-related hospitalizations since the outbreak began. Last week, Djokovic said the restrictions that would be in place for the U.S. Open because of the virus would be “extreme.” “Most of the players I have talked to were quite negative on whether they would go there,” Djokovic said. He hosted exhibition matches with packed stands last week in his home country of Serbia, where the government lifted most virus restrictions last month."}]}