{"article": [{"url": "https://www.marketwatch.com/story/the-coronavirus-pandemic-made-it-more-obvious-than-ever-that-we-cant-agree-on-what-families-are-actually-buying-when-the-pay-or-borrow-for-college-2020-05-29", "published": 1592044880.0, "headline": "â\u0080\u0098At the most elite institutions, college can basically be a finishing school:â\u0080\u0099 Coronavirus casts light on the value of higher education", "body": "Like many college students, Alexa Edwardsâ\u0080\u0099 immediate future is in flux. Just a few months ago, the 20-year-old was sure sheâ\u0080\u0099d be enrolling at Western Oregon University in the fall. There, Edwards could easily continue studying elementary education, the degree she was pursuing at Concordia University in Portland until the college abruptly closed in February.Â But with questions still swirling as to whether colleges will be able to offer classes on campus given concerns about in-person interactions during the coronavirus pandemic, Edwards is reconsidering her plans.Â â\u0080\u009cI never would have thought about taking a year off, thatâ\u0080\u0099s one thing I didnâ\u0080\u0099t want to do,â\u0080\u009d Edwards said through a Zoom ZM, +2.89% Â screen, sitting in her childhood bedroom. â\u0080\u009cBut that might be an option.â\u0080\u009dÂ What would push Edwards towards attending school in the fall is a guarantee that class would be mostly in-person â\u0080\u0094 a promise thatâ\u0080\u0099s difficult to make and trust, given the evolving nature of the pandemic. (Sheâ\u0080\u0099s monitoring announcements from Western Oregon, which has said more than 60% of its courses will be offered with an in-person component in the fall).Â Â Alexa Edwards is still mulling her plans for the fall. Courtesy of Alexa Edwards Edwards is cognizant of the cost of college; sheâ\u0080\u0099s used a combination of enrolling a few semesters at a community college, working multiple jobs, living at home for part of her schooling, and some assistance from her parents to keep her debt burden down to a relatively low $9,000. With her father recently out of a job, financial considerations loom even larger.Â Taking a year off and hopefully finding a way to work and save some money feels like a more attractive option than paying full tuition for courses that could wind up online, Edwards said. (Western Oregon will be charging its in-person tuition rate for classes that were developed to be delivered in person, which is about $339 more in tuition and fees than its online courses).Â Â Are you a student or parent thinking about their college plans in the fall? We want to hear from you! Email: jberman@marketwatch.com. When Edwards and her family pay for college she believes theyâ\u0080\u0099re paying for professors to deliver the material in an interactive and discussion-based way that she says is difficult to replicate online, particularly given that you can find online courses taught by experienced professors for free. But sheâ\u0080\u0099s also interested in more than the classroom experience.Â â\u0080\u009cLiving with people and being around other people, it teaches you how to navigate all types of situations and how to navigate them as an adult,â\u0080\u009d she said. â\u0080\u009cWeâ\u0080\u0099re built for interaction and so when thatâ\u0080\u0099s stripped away itâ\u0080\u0099s really hard to imagine doing school and life without it.â\u0080\u009dÂ Lawsuits raise questions about collegesâ\u0080\u0099 value proposition Skyrocketing college costs and increasing student debt over the past several years had already prompted students, families and economists to ask whether a college degree is worth the investment. On average, the answer to that question is yes â\u0080\u0094 workers with a college degree typically earn significantly more over their lifetimes than those without one.Â But the changes to college over the past several months have raised a more nuanced version of that question â\u0080\u0094what does the money students and families pay (or often borrow) actually buy? In a rash of recent lawsuits asking colleges to refund a portion of tuition after the move to online-only coursework in the spring, students and families have argued that the price theyâ\u0080\u0099re paying covers more than instruction and progress towards a degree.Â Colleges are hesitant to drop their prices because many of their major costs, including faculty salaries, havenâ\u0080\u0099t actually decreased during this period. In addition, the pandemic has also meant schools are facing revenue pressures both in the short and long-term. In some cases though, theyâ\u0080\u0099re also arguing that their fundamental value proposition â\u0080\u0094 providing students with an education and a degree with a recognized brand â\u0080\u0094 hasnâ\u0080\u0099t diminished from the change in environment.Â This dynamic reveals that â\u0080\u009cthereâ\u0080\u0099s a disconnect here, schools think that theyâ\u0080\u0099re charging for X, students think that theyâ\u0080\u0099re buying Y,â\u0080\u009d said Michael Sorrell, the president of Paul Quinn College, a historically black college in Dallas. Sorrell has been critical of collegesâ\u0080\u0099 rush to reopen. Though his school hasnâ\u0080\u0099t decided its fall plans, he said the decision will be based on keeping students safe, which requires widespread testing and a vaccine.Â If courses are all online in the fall, tuition will drop from nearly $16,000 per year to about $12,000 per year, he said. “ â\u0080\u0098To be successful academically you need a support network, you need friends, you need classmates.â\u0080\u0099 ” â\u0080\u0094 Kevin Stange, a professor at the University of Michiganâ\u0080\u0099s Gerald Ford School of Public Policy The question of what exactly students are paying for varies by student, major and school. For students attending a community college, theyâ\u0080\u0099re often buying a degree and experience with value in the labor market at a relatively modest price. Similarly, for some students at four-year schools studying a subject thatâ\u0080\u0099s clearly tied to a vocation, like engineering, much of the value proposition of their degree comes directly from what they learn and the degree they receive.Â But for many students at residential-four year colleges, part of whatâ\u0080\u0099s included in the price tag is â\u0080\u009cthe college experienceâ\u0080\u009d â\u0080\u0094 a nebulous term thatâ\u0080\u0099s usually defined as some mix of meeting new people, exploring new ideas with them and getting a taste of adult independence in a relatively safe environment.Â Colleges have refunded some of the fees associated with that broader experience, like the room and board students pay to live in dorms and eat in cafeterias, and the money students pay to take advantage of gyms, printers and other facilities.Â Still, other less financially tangible aspects are hard to replicate online and are certainly some of the value proposition for students. Part of what students are paying for is â\u0080\u009caccess to other smart people, students and college employees,â\u0080\u009d said Robert Kelchen, a professor of higher education finance at Seton Hall University. â\u0080\u009cThat access has declined.â\u0080\u009d â\u0080\u009cAt the most elite institutions, college can basically be a finishing school,â\u0080\u009d Kelchen noted. At these schools, the opportunity to get to know a student whose parent may offer a connection to a job in a prestigious field or a robust alumni network can be a key component to the value students derive from attending.Â Â Expectations of college differ elsewhere That combination of wrap-around services and branding is a particularly American conception of what higher education should look like. Dieter Dohman, the founder and director of the Berlin-based Research Institute for the Economics of Education and Social Affairs, noted that in Germany, where public universities are free, thereâ\u0080\u0099s been little complaint about the move to distance education during the pandemic.Â Under normal circumstances, students expect the universities to deliver quality coursework and thatâ\u0080\u0099s about it, Dohman said. Even when schools fail to deliver, thereâ\u0080\u0099s often little complaint. â\u0080\u009cPeople are a little bit more passive in demanding certain quality of services,â\u0080\u009d he said. â\u0080\u009cItâ\u0080\u0099s not the normal client-supplier relationship.â\u0080\u009dÂ Even assuming that the bulk of what students and families are paying for in the U.S. is essentially a pathway to a successful career, itâ\u0080\u0099s not clear that students are still getting the bulk of that value during this experience, said Doug Webber, an economics professor at Temple University.Â “ â\u0080\u0098Part of what students are paying for is â\u0080\u0098access to other smart people, students and college employees.â\u0080\u0099 That access has declined.â\u0080\u0099 ” â\u0080\u0094 Robert Kelchen, a professor of higher education finance at Seton Hall University Thereâ\u0080\u0099s a robust debate about whether the premium college graduates earn over a lifetime is more related to the signal the degree sends to employers or to what students actually learn while in school.Â â\u0080\u009c119 credits and no degree is very different from 120 credits and a degree,â\u0080\u009d Webber said.Â Still, he adds, â\u0080\u009cyou can have a world where having 120 credits and getting the degree gets you a massive pay bump, but the value of the college degree is still predominantly in valuable skill building rather than just having a diploma.â\u0080\u009dÂ Webber estimates that the skill-building represents about 65% of the value of the degree and that skill-building is likely to be impacted by this period, he said. â\u0080\u009cAt least as of right now, the average quality of online classes this spring was far lower than the average quality of face-to-face learning.â\u0080\u009dÂ Â In addition, in an online environment, students likely have more limited access to professors, and academic support services that can help them get through college and glean valuable knowledge from the experience.Â â\u0080\u009cTo be successful academically you need a support network, you need friends, you need classmates,â\u0080\u009d said Kevin Stange, a professor at the University of Michiganâ\u0080\u0099s Gerald Ford School of Public Policy. â\u0080\u009cYou need faculty that care and that know a little bit about you â\u0080\u0094 some of that happens in the classroom, some of it happens outside the classroom.Â All of those things are quite central to a residential college experience and even a commuter in-person college experience.â\u0080\u009d"}]}