{"article": [{"url": "https://www.marketwatch.com/story/this-mutual-fund-may-have-cracked-the-buffett-code-berkshire-hathaways-secret-sauce-2020-09-21", "published": 1601123780.0, "headline": "This mutual fund may have cracked the 'Buffett Code' - Berkshire Hathaway's secret sauce", "body": "For the 55 calendar years from 1965 through 2019, Berkshire Hathaway's stock rose at an 18.6% annualized pace, versus 11.8% for the S&P 500 SPX, +0.87%  . (Both returns reflect reinvested dividends.) Warren Buffett can take credit for this, and he appears to be very much in charge of Berkshire. But, given that he just celebrated his 90th birthday, it's clear that Buffett won't be at the helm forever. But if you invest in Berkshire B, +0.33%  BRK.B, +0.24%  or by following Buffett's well-known investing principles, your portfolio returns likely won't suffer after Buffett stops analyzing the markets and offering his insights. How can I be so certain? Because some years ago a group of researchers broke the Buffett Code. They devised a mechanical investing strategy that would have done every bit as well as Buffett over the long term. It is testament to Buffett's accomplishments that it took many researchers many attempts over many years before they figured out the Oracle of Omaha's secrets. The researchers who succeeded were three principals at AQR Capital Management, each of whom has strong academic credentials: Andrea Frazzini; David Kabiller, and Lasse Pedersen. The study, entitled \"Buffett's Alpha\", began circulating in academic circles in early 2012. (Berkshire Hathaway did not respond to an email seeking comment about this study.) The exact specifics of the formula the researchers derived are beyond the scope of this column. In general it focuses on what might be called \"cheap, safe stocks.\" The formula favors issues that have low price-to-book-value ratios, have exhibited below-average volatility, and are from companies whose profits have been growing at an above-average pace and pay out a significant portion of their earnings as dividends. One mutual fund that perhaps comes closest to employing the formula the researchers derived is offered, not surprisingly, by AQR: The AQR Large Cap Defensive Style Fund AUEIX, +0.94%  . The fund's inception was in July 2012, soon after the research was completed. The researchers don't expect their formula to replicate a portfolio that is identical to Berkshire Hathaway's stock holdings, by the way. But, based on the researchers' results, it should produce a list of stocks that are similar to those Berkshire has owned over the years - similar both in terms of characteristics as well as long-term performance. An example is Kraft Heinz KHC, -0.35%  , which was one of the stocks the fund invested in when it was formed. At the time Berkshire Hathaway had no position in the stock. Not long after, Buffett announced that his company had acquired a 50% stake in Heinz. That's just one data point, of course. But since inception, the AQR fund has produced a 14.4% annualized return versus 12.5% for Berkshire Hathaway stock, according to FactSet. Both of these returns reflect the reinvestment of dividends. It would be going too far to expect the AQR fund to continue outperforming Berkshire shares over the long term. There are major differences between the fund and Berkshire, and there inevitably will be some periods in which the fund won't come out ahead. But, assuming the future is like the past, the fund (as well as anyone else following the research) should at least match Berkshire's stock performance over the long term - with Buffett or without. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com More:Bill Gates says this might be 'the most important thing' he's learned from Warren Buffett, who just turned 90 Plus: Value stocks will rise again, but we just don't know when"}]}