{"article": [{"url": "https://www.marketwatch.com/story/we-cant-just-sit-by-wait-and-hope-for-racial-equity-in-america-say-atlanta-feds-bostic-11602118994", "published": 1602157820.0, "headline": "We can't just 'sit by, wait and hope' for racial equity in America, say Atlanta Fed's Bostic", "body": "The Federal Reserve is embarking on a series of virtual events aiming to help uproot structural racism and inequality in the U.S. economy. Daniel Slim/Agence France-Presse/Getty Images America was built on stolen land and by slave labor. Those facts helped U.S. corporations prosper and the well-connected amass riches, but also led to a legacy of U.S. racial inequality that the coronavirus pandemic has made far worse. Wrong lane for the Federal Reserve? Think again. \"We can't just sit by, wait and hope\" for racial equity in America to take shape, Raphael Bostic, president of Federal Reserve Bank of Atlanta, said Wednesday. \"This is a time for us to not shy away, we need to step forward.\" The call to action underpins a new series of virtual events hosted by the central bank as it seeks ways to uproot structural racism and inequality in the U.S. economy. \"We recognize that we have a role to play,\" said Neel Kashkari, the Minneapolis Fed president, during the first leg of the series on Wednesday. \"It's not OK to say it's someone else's problem to improve outcomes for all Americans.\" Kashkari helped organize the Fed program following the death of George Floyd, an unarmed Black man, in May after a white, Minneapolis police officer pressed his knee against Floyd's neck for at least eight minutes. The act was filmed and widely broadcast, sparking outrage and worldwide protests against police brutality, while swaths of America hunkered down at home during the pandemic. To help find a more equitable path forward, Fed officials have been reaching out to business, community and academic leaders for ideas on what actions they might take to help reverse structural challenges to low-income and minority communities. Ursula Burns, a Black businesswomen and former chief executive officer at Xerox Holdings Corp. XRX, -1.38%, urged the Fed on Wednesday to use its regulatory, monetary and data-gathering tools to focus on building a more inclusive society. \"Everybody is passing this big load of misery on,\" Burns told Kashkari, while pointing to essential workers who, eight months into the pandemic, barely are scraping by. \"We need to build a nation back,\" she said, adding that the Fed should focus its monetary policy on helping \"not just the rich guys, but the poor people.\" When the central bank cut interest rates to near-zero in March as the pandemic bore down on the U.S., it kept credit flowing. As a result, there's been record U.S. corporate borrowing this year and fewer defaults than initially feared. Read: U.S. corporate debt soars to record $10.5 trillion But slashing rates can hurt savers, the elderly and minority communities, where access to affordable credit already has been a longstanding scourge. Geoffrey Canada, an educator and social activist and president of the Harlem Children's Zone, said during Wednesday's event that the Fed should examine how its policy of low rates for a longer period hurts the poorest people in the country. \"Can't we think more creatively about how banks are handling savings for these communities?\" he asked, while also pointing out that low rates discourage saving and encourage risk taking, at a time when many young people aren't taught about how markets work. \"Right now they are teaching them you're going to get nothing for putting your money in the bank,\" Canada said, also warning that the federal government's pandemic response is sowing the seeds of the next generation of inequity. \"There's a certain portion of America that's going to be devastated, unless we act quickly,\" he said. U.S. stocks were modestly higher Thursday, a day after the Dow Jones Industrial Average DJIA, +0.56% advanced 530 points, on renewed hopes that Washington might pass additional fiscal stimulus to help shore up households, states and businesses during the pandemic, just a day after a tweet from President Donald Trump called for an end to negotiations on pandemic relief and set off a sharp late-day market selloff. Federal Reserve Chairman Jerome Powell has made it a mantra over the past several months that the shape of the U.S. economic revival from the pandemic will hinge in part on the fate of America's hardest-hit populations, including essential workers. Related: Frontline workers in eye of pandemic storm for months, now fending off repo man But Powell also repeatedly has stressed that his emergency tool kit consists of \"lending, not spending\" powers, and that Congress would need to provide additional fiscal stimulus that puts money directly in the pockets of workers impacted by the pandemic. Yet the Fed's series on racism and the economy already has highlighted how the Fed might harness some of its tools to spur economic opportunity in communities that have been left behind. Eric Rosengren, president of the Boston Fed, said on Wednesday that the central bank's extensive data and research efforts show racial disparities in wages and employment. He pointed to a recent Fed study that showed how its efforts in the realm of monetary-policy easing haven't reached many Black homeowners, mainly because few rushed out to refinance their homes at today's historically low rates. White homeowners, meanwhile, lined up to refinance soon after the Fed announced it would resume buying government-backed mortgage securities, which helped lower borrowing costs. The Fed's takeaway: that it needs better ways to get information into the hands of all consumers, so they can make the most of its policies."}]}