{"article": [{"url": "https://www.marketwatch.com/story/what-you-need-to-know-about-covid-19-health-care-rationing-2020-07-15", "published": 1594900040.0, "headline": "What you need to know about COVID-19 health care rationing", "body": "This article is reprinted by permission from NextAvenue.org. It is part of The Coronavirus Outbreak: What You Need To Know Special Report. The following article represents the views of Dr. Jan Gurley and not the San Francisco Department of Public Health, where she works in communicable disease and prevention during the COVID-19 pandemic. The information included is rapidly evolving and applies to the current situation. Due to the COVID-19 pandemic, Arizona has become the first state in U.S. history to implement what’s known as Crisis Standards of Care, which some refer to as a way of rationing health care. This policy kicks in when a health care system is overwhelmed and expected to be severely impacted for a sustained period of time. As a patient, or a potential patient, learning that your doctor and hospital system are operating under Crisis Standards of Care can be alarming. Many people believe it could mean that some older people, particularly those who are sickest, will be denied health care resources, such as ventilators, in favor of others. Here’s a Q and A to help address questions you or your loved ones may have about Crisis Standards of Care:What are Crisis Standards of Care? Local and state jurisdictions know that planning in advance for disasters can save lives. During normal operations, health care is a highly regulated and slow-moving system that often can compete for patients. In a pandemic or a disaster, those same characteristics can cost lives. Crisis Standards of Care plans are a way for hospitals and health care systems to decide in advance how to move faster and work more closely together during a crisis. Their goals are to improve communication, optimize and share resources, including staff, and identify which regulations and standards might need to change to save as many lives as possible when a health care system is overwhelmed. Also read: Survivors talk about the aftereffects of COVID-19 Crisis Standards of Care plans often have some common elements. These can include: Triage: A key component of Crisis Standards of Care is that the focus moves from delivering individual patient care to delivering the best care for the patient population. Crisis Standards of Care will often have three stages of triage: at the ambulance level, at the hospital level and at the ICU level. Each stage will assess a patient to see if there is a likelihood that the patient would substantially benefit from the treatment that is available. Treatments and supplies: Crisis Standards of Care can mean using alternate drugs or devices when shortages occur to save lives. Re-using equipment, such as N95 masks, is also a way to extend scarce supplies. Liability: Hospitals and health care systems are given broad protection and even qualified immunity from liability during Crisis Standards of Care. In addition to liability protection, there can be financial implications for reimbursing hospitals. Although Crisis Standards of Care are meant to save the most people possible, it can mean a big change for individuals and their health care needs compared to the traditional approach.How do Crisis Standards of Care work? Exactly what Crisis Standards of Care might mean if they’re activated where you live depends on how your state defines them and how the standards would be implemented. Although Arizona has activated its Crisis Standards of Care, it has not yet implemented triage. See:Letter from Arizona: Hospitals grapple with a surge in coronavirus cases, while life outside continues as normal In California, another COVID-19 hotpot, its Crisis Standards of Care guidelines (which have not yet been activated) emphasize equity, including the need to avoid discrimination based on age. The guidelines also state that it is important to avoid resource-allocation decisions that make assumptions about a person’s quality of life, which might discriminate against people with disabilities. The guidelines also emphasize the risk of moral distress for the health care team. When or if California — or other states — will activate Crisis Standards of Care is unknown. But many states have prepared a crisis plan if they’ll need it. Both Arizona and California have Crisis Standards of Care approaches that encourage using an “organ system” approach to triage. It’s not based on gender, race or many other potentially discriminatory characteristics. An organ system approach looks at how many organs are impacted, or even failing in a patient, in order to help a health care team decide who might benefit from scarce resources, and who may not. Some states, like Arizona, use what’s known as a SOFA Score, for “sequential organ failure assessment.” Patients are assigned points according to their SOFA Score, with priority treatment given to people with lower scores. Medical staff remove a deceased patient from a COVID-19 intensive care unit in Houston June 30. Getty Images As a family member, caregiver or a loved one of a patient who is very sick, you may have a doctor or member of the health care team talk to you about how sick your loved one is based on their organ system score. While hearing your loved one discussed in terms of their “organs” may feel abstract and impersonal, it is important to remember that an organ system approach is our best measure for avoiding discrimination and avoiding making value-based judgments about who gets care.What should a patient expect when a health care system is in crisis care? Doctors, nurses and other health care professionals may be repositioned into roles they would not normally perform. For example, an internal medicine outpatient doctor might be working in an ICU or an emergency room nurse might be assisted by EMTs. You might be sent somewhere you might not expect, like an alternative care site in a parking lot or a newborn ICU instead of an adult ICU. Also see: Travelers from four more states added to N.Y.’s mandatory quarantine You may be given something like a home kit with a pulse oximeter to self-monitor until there are signs, like a low oxygen saturation, indicating it’s time to get more advanced care.How should I manage my care without normal standards of care? Don’t avoid getting health care until the last minute. If you do, care that could save your life might not be available because you’re at the extreme end of sickness and your organs may be failing. On the other hand, none of us want to go to a hospital too early or unnecessarily overload a health care system that is already struggling. The best advice for yourself and your loved ones is to call your clinic and outpatient doctor early if you have a health problem. Stay in communication. You want to make a plan for when symptoms are serious enough to mean it is the best time to get the lifesaving care you need.What can you do to help your health care system when it’s struggling? Stay home whenever and however you can. And don’t schedule elective procedures or surgeries that can wait. Also, don’t do risky things, like cleaning gutters on a shaky ladder. Right now, we save lives when we avoid getting sick. Also see: Health officials clamor for U.S. states to pause reopenings amid spikes in COVID-19 infections When you must go out, wear a mask and stay six feet away from others, wash your hands often. Our health care system needs us to do our part to help those who are sickest.How can I learn more about Crisis Standards of Care? The Arizona Crisis Standards of Care Plan spells out in detail many steps that are being taken. The California Crisis Care Guidelines are also very detailed, with a significant portion devoted to equity and non-discrimination. And the U.S. Department of Health and Human Services’ Guidance on Non-Discrimination covers rights and expectations. Dr. Jan Gurley works in communicable disease and prevention during the COVID-19 pandemic for the San Francisco Department of Public Health. She was formerly director of public health emergency preparedness and response for that department. Gurley has been the medical director of clinics serving communities disproportionately impacted by structural racism, homeless and trauma. She has been medical director of Curry Senior Health Center and the Potrero Hill Health Center. This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}