{"article": [{"url": "https://www.marketwatch.com/story/oil-under-pressure-on-us-china-tensions-rising-coronavirus-cases-2020-07-14", "published": 1594739960.0, "headline": "Oil end higher as traders weigh uncertainty over next move for OPEC+", "body": "Oil futures erased earlier losses to end higher on Tuesday, getting a boost from some weakness in the U.S. dollar, as traders weighed uncertainty over the next move for OPEC+ on production levels, and a forecast for a weekly decline in U.S. supplies. Prices for oil remained vulnerable to losses in the wake of mounting tensions between the U.S. and China, as well as a continued rise in COVID-19 infections in the U.S. and elsewhere — both of which can hurt energy demand. “Crude prices reversed earlier losses as a weaker U.S. dollar persisted and gave most commodities a boost,” Edward Moya, senior market analyst at Oanda, told MarketWatch. U.S. benchmark crude futures are back above the $40 level, but still below the last week’s key high of $41.08, he added. In a note, Moya attributed earlier price declines to “concerns OPEC+ could trigger a taper tantrum,” reducing the size of the current cuts of 9.7 million barrels per day to 7.7 million barrels per day, even as coronavirus restrictions are no longer steadily easing. “WTI crude will not be able to stay near the $40 level if coronavirus spread continues to damage reopening efforts that will be accompanied with much softer demand for crude,” he said. West Texas Intermediate crude for August delivery CL.1, -1.62% on the New York Mercantile Exchange rose 19 cents or 0.5%, to settle at $40.29 a barrel after trading as low as $39.07. September Brent crude BRN.1, -0.07%, the global benchmark, climbed by 18 cents or 0.4% at $42.90 on ICE Futures Europe. Analysts said the Monday decision by California Gov. Gavin Newsom to reverse the reopening of indoor operations at restaurants, bars, movie theaters and other venues in the state dented sentiment and could make a meeting this week by members of the OPEC+ alliance’s monitoring committee more interesting. “With the California soft lockdown now framing the picture, July could be an even more challenging month for oil than expected with even more demand woes emanating from coronavirus-linked uncertainty. So, it will be especially necessary for OPEC+ to present a centralized front while addressing these and other issues that may pop up,” said Stephen Innes, global chief market strategist at AxiCorp, in a note. The Joint Ministerial Monitoring Committee, which reviews the report on the oil market prepared by the Joint Technical Committee and oversees compliance with output cuts, will meet Wednesday. An agreement to cut production by 9.7 million barrels a day may give way to cuts of 7.7 million barrels in August as Saudi Arabia and its allies have pushed to stick to that schedule ahead of this week’s meeting, news reports said. In a monthly report released Tuesday, OPEC said it now sees 2020 oil demand falling by around 8.9 million barrels a day versus a June forecast for a fall of around 9 million barrels a day. It also said, however, that “uncertainty regarding the outlook assumptions both for this year and the next remain unusually high, particularly with regard to economic growth...as well as the [COVID-19] pandemic developments, related restrictions and their impact on oil consumption.” Meanwhile, the U.S. on Monday announced its formal opposition to a number of Chinese claims in the South China Sea. China on Tuesday described the U.S. rejection of its maritime claims as completely unjustified and as an attempt to stir discord between China and Southeast Asian countries. China also announced it will impose unspecified sanctions on defense contractor Lockheed Martin Corp. after the U.S. approved a possible $620 million deal to supply missile parts to Taiwan, marking the latest in a volley of punitive actions by the superpowers as relations grow colder. News from Delta Air Lines DAL, +0.39%, which slashed its August flight schedule in half, likely also contributed to crude’s price declines Tuesday, said Moya. “Air travel demand is not coming back anytime soon and this will heavily weigh on the crude demand outlook for the next 12 months.” On Nymex, August gasoline US:RBQ20 fell by 2% to $1.2474 a gallon and August heating oil US:HOQ20 shed 0.2% to $1.2208 a gallon. Read:Higher gas and food prices trigger first increase in U.S. consumer inflation in 4 months August natural gas US:NGQ20 settled at $1.746 per million British thermal units, up 0.4%. The Energy Information Administration will release weekly data on petroleum supply Wednesday, with data from trade group the American Petroleum Institute due out late Tuesday. On average, the EIA is forecast to report a decline of 2.1 million barrels in U.S. crude supplies for the week ended July 10, according to a poll of analysts conducted by S&P Global Platts. The government agency reported a climb of 5.7 million barrels for the previous week. The survey also showed expectations for a decline of 2 million barrels in gasoline inventories, while distillate stocks are seen 1.1 million barrels higher."}]}