{"article": [{"url": "https://www.marketwatch.com/story/increasing-funding-for-public-colleges-may-improve-students-educational-outcomes-and-their-credit-scores-11602103457", "published": 1602137360.0, "headline": "Increasing funding for public colleges may improve studentsâ\u0080\u0099 educational outcomes â\u0080\u0094 and their credit scores", "body": "College students carry their dinners across campus at the University of South Carolina. New research suggests that cuts to state funding for colleges amid the COVID-inducted downturn could have financial and educational consequences for students. (Photo by Sean Rayford/Getty Images) Published Credit: Sean Rayford/Getty Images Sean Rayford/Getty Images Public colleges and universities are bracing for cuts as the pandemic-induced downturn threatens state coffers, a key source of funding for schools.Â And if the past is any indication, those funding declines could have consequences for students, new research suggests.Â At four-year public colleges, increases to state funding are associated with students taking less time to earn their degrees and accruing less student debt, according to a working paper circulated by the National Bureau of Economic Research this week.Â The paper, authored by economists at the Federal Reserve Bank of New York, Cornell University and the University of California Los Angeles, finds that for students attending two-year public colleges, an uptick in state funding increases the likelihood theyâ\u0080\u0099ll transfer to a four-year school and obtain a bachelorâ\u0080\u0099s degree. In addition, the research shows that among these students, higher levels of state funding are associated with higher credit scores and the likelihood of living in higher-income neighborhoods after graduation. â\u0080\u009cState appropriations matter for student outcomes,â\u0080\u009d said Michael Lovenheim, the chair of the economics department at Cornell and one of the authors of the paper.Â That finding likely has implications for the next several years. In the wake of the Great Recession, states cut funding to higher education institutions. In 2018, state funding for two and four-year public colleges was still $6.6 billion below 2008 levels, according to the Center on Budget and Policy Priorities. Historically, following these cuts, state funding increases slowly as the economy recovers and on average donâ\u0080\u0099t return to their pre-recession levels, the paper indicates.Â Â As state lawmakers stare down depleted coffers from declines in sales and income tax revenue this year, funding to public colleges and universities is likely to be on the chopping block. With stimulus talks collapsed in Washington, it seems unlikely colleges and universities will get any more help from the federal government.Â Given these trends, the future â\u0080\u009cdoesnâ\u0080\u0099t look good,â\u0080\u009d for students, Lovenheim said. â\u0080\u009cThatâ\u0080\u0099s what our results suggest.â\u0080\u009d For every extra $1,000 per student a state spends on its public, four-year colleges, the likelihood that a student attending one of those schools earns their bachelorâ\u0080\u0099s degree by age 25 increases by 1.5 percentage points, their research shows.Â Â An extra $1,000 in per-student appropriations also decreases the likelihood that a student attending a four-year college will take on student debt by about 2 percentage points, and the amount they borrow falls too. The research indicates that a $1,000 bump in state appropriations also reduces the amount of money these students borrow by age 22 by $640 and the amount they borrow by age 35 by $5,363.Â Community college students fare differently than their counterparts at four-year public schools, but they still appear to benefit from increases in state funding.Â For every extra $1,000 per-student state funding allocated while a community college student is enrolled, the likelihood theyâ\u0080\u0099ll transfer to a four-year school increases by 3.5 percentage points and the likelihood theyâ\u0080\u0099ll earn a bachelorâ\u0080\u0099s degree goes up by 2.5 percentage points, the paper finds.Â Community college students tend to borrow more when state appropriations go up, the research indicates, but thatâ\u0080\u0099s likely because theyâ\u0080\u0099re pursuing more education. The likelihood that they are delinquent or default on their loans goes down as state appropriations go up. In addition, a $1,000 increase in state appropriations is associated with a 13-point increase in credit scores for community college students and an increase of $3,359 in average income of the ZIP code where they live.Â The researchers were able to observe these connections thanks to a unique merger of de-identified enrollment records from the National Student Clearinghouse and credit report data from the New York Fedâ\u0080\u0099s consumer credit panel. In addition to highlighting the broad consequences of cuts to state funding on public colleges, the research indicates that these cuts will likely exacerbate the inequality already present in the higher education system.Â Community colleges and less-selective four-year public colleges educate a large swath of American college students and in particular, low-income students and students of color. Theyâ\u0080\u0099re also likely to suffer more acutely from state funding cuts.Â This dynamic shows up in the working paper. The impact of state funding cuts on four-year public schools is to increase debt loads among students, but it doesnâ\u0080\u0099t appear to affect the educational outcomes, other than increasing time to degree. Thatâ\u0080\u0099s not the case at community colleges, which have less room to raise tuition. Instead, a decline in state funding may mean slashing the kinds of academic and support services that help students get to and through school.Â â\u0080\u009cChange in quality of instruction is a major factor that leads to bigger impacts not just on educational outcomes of community college students, but that actually translates to their financial outcomes later in life,â\u0080\u009d said Rajashri Chakrabarti, a senior economist at the New York Fed and one of the authors of the study. â\u0080\u009cThat has clear implications on inequality.â\u0080\u009dÂ"}]}