{"article": [{"url": "https://www.marketwatch.com/story/us-retail-sales-rise-in-august-for-third-month-in-a-row-and-top-precrisis-levels-2020-09-16", "published": 1600251320.0, "headline": "U.S. retail sales climb in August for third straight month, but momentum is slowing", "body": "The numbers: Sales at retail stores across the country rose in August for the third month in a row in another display of the economy’s resilience, but the momentum appears to be waning after a big burst of demand earlier in the summer once the U.S. reopened for business in the wake of the coronavirus crisis. Retail sales increased 0.6% last month, the government said Wednesday, a tick below the forecast of economists polled by MarketWatch. Yet the pace of sales has slowed from earlier in the summer, when the economy reopened and many retailers experienced a sharp rebound in customer traffic. Sales gains are likely to be harder to come by in the months ahead, especially after the end of generous federal aid for the unemployed and businesses struggling to survive. Retail sales are a big part of consumer spending and typically increase when the economy improves and Americans feel more confident to spend. Sales have exceeded pre-crisis levels since June, a turnaround that few economists would have predicted early in the pandemic. What happened: Sales rose 0.2% at auto dealers, which account for about one-fifth of all retail spending. Gas station receipts also increased 0.4%, largely reflecting an increase in the cost of gasoline. Yet it still costs a lot less to fill a tank than it did last summer. People aren’t driving as much because of ongoing economic restrictions and tens of millions of people working from home. If autos and gas are excluded, retail sales rose a slightly higher 0.7%. Sales rose 4.7% at bars and restaurants as people went out to eat more or ordered more takeout food. Higher spending at restaurants even in the face of ongoing limits on indoor seating is a good sign. People tend to spend less at restaurants when they are more worried about the economy. Sales rose more modestly at home centers, pharmacies, electronic and appliance stores and clothing outlets. Internet retailers saw basically no change in sales levels, though receipts are up 22% from a year earlier. Online sales have soared during the pandemic with most people working at home and limiting their trips out of the house. Sales fell last month at department stores and groceries. Grocery sales are still up 9% from a year earlier though. See: MarketWatch Economic Calendar Big picture: Retail sales are about 2% higher now compared to pre-pandemic levels in February, but they would almost certainly be higher still had there been no viral outbreak. While some retail segments have performed surprisingly well, many still have a long way to go. Sales at restaurants are down 15% from a year earlier, for example, and receipts at clothing stores are off 20%. These businesses simply can’t get back to normal until the coronavirus fades. The end of federal benefits, meanwhile, could make it harder for retailers to keep up the momentum. The massive infusion of federal aid gave a boost to consumer spending after the economy reopened. Now it’s gone. What they are saying? “The recovery is still on track,” said senior economist Jennifer Lee of BMO Capital Markets. “It is swaying a little, from left to right, but it is still on track.” “The big picture is that the expiry of the enhanced unemployment benefits at the start of the month did not have the catastrophic impact on spending that some analysts were predicting,” said senior U.S. economist Andrew Hunter of Capital Economics. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% rose in Wednesday trades."}]}