{"article": [{"url": "https://www.marketwatch.com/story/russia-stoking-coronavirus-disinformation-online-us-says-2020-08-05", "published": 1596657320.0, "headline": "Russia stoking coronavirus disinformation online, U.S. says", "body": "CHICAGO — The State Department says Russia is using a well-developed online operation that includes a loose collection of proxy websites to stir up confusion around the coronavirus by amplifying conspiracy theories and misinformation. The disclosure on Wednesday was rare for the Trump administration, which has been cautious about blaming the Kremlin for disinformation campaigns, especially around the U.S. election. Despite evidence that Russia launched a divisive disinformation operation on social media during the 2016 U.S. presidential election, the State Department’s report did not examine how — if at all — Russia is waging another online influence campaign in this year’s election. Secretary of State Mike Pompeo did, however, announce Wednesday that the U.S. would offer a reward of up to $10 million for information that identifies people working with foreign governments to interfere in the U.S. election through illegal cyber activity. The department detailed a Russian-backed misinformation cycle that spreads false information online through state officials and state-funded media reports, by infiltrating U.S. social media conversation, and leveraging a deceptive internet framework of websites. The Kremlin’s efforts have most recently focused on conspiracy theories around the pandemic, the report found. “Russia is playing a significant role in creating and spreading misinformation and propaganda around many topics,” said Lea Gabrielle, head of the State Department’s Global Engagement Center. The department named more than a half-dozen websites that, serving as “proxies” for Russia, have peddled a series of conspiracy theories about the pandemic that have been widely spreading and hotly debated across social media platforms like Facebook, Twitter and Instagram. The online news outlets appear independent from the Russian government, but in reality serve as a “connective tissue” between the Kremlin and state-funded media that often promote the same misinformation from their own channels, Gabrielle said. “That’s what makes them effective,” Gabrielle said. “It’s difficult for the average person online to look at these sites and know the Russian affiliation.” Russia has regularly denied claims from the U.S. that it is behind online disinformation campaigns, last week calling similar assertions “persistent phobia.” The websites the State Department identified Wednesday have promoted unsupported conspiracy theories that allege COVID-19 was created in a lab as a bioweapon, billionaire Bill Gates is plotting to use the pandemic as an excuse to microchip people, and that plans for a coronavirus vaccine are simply a ploy for pharmaceutical companies to make money. There is no evidence behind those claims. The origin of the novel coronavirus remains unknown, but the emerging scientific consensus is that humans were first infected in China, at a Wuhan animal market. Around the globe, leaders are investing in a vaccine as the best bet to beat the virus. And Gates has repeatedly rejected that he wants to start tracking people. “Russia has a long history of spreading disinformation around health and science issues,” Gabrielle said. “The Russian disinformation ecosystem exploits fear and confusion.” While building up a following on Facebook and Twitter, some of the websites have downplayed their ties to Russian intelligence or concealed funding from the Kremlin, the State Department’s report found. One of the sites, Canadian-based Global Research, has amassed an audience of nearly 300,000 followers on Facebook. The website regularly publishes articles from fictitious personas created by Russia’s military intelligence service, the GRU. The headline of a recent Global Research article suggested the coronavirus originated in the U.S., and it was shared by a Chinese spokesman on Twitter before the website took the unsubstantiated claim down. Chinese, Iran and Russian government leaders have regularly echoed one another on social media and in state media reports. Another website, NewsFront, pitches itself as an “alternative” news source to Western audiences, despite its reported Kremlin funding and being registered with the Russian government, according to the State Department’s report. Facebook removed dozens of accounts and pages associated with NewsFront for inauthentic, coordinated behavior in April. Most of the other websites are far more fringe, with only small social media followings and articles pushing coronavirus conspiracy theories that have only been shared by the dozens. Last week, U.S. officials told The Associated Press that Russian intelligence are using another trio of English-language websites to push disinformation about the pandemic."}]}