{"article": [{"url": "https://www.marketwatch.com/story/target-to-focus-on-fulfilling-digital-orders-from-stores-contactless-options-this-holiday-season-11600961076", "published": 1601367020.0, "headline": "Target to host Deal Days shopping event during Amazon Prime Day", "body": "Target plans to use its stores to fulfill many online orders this holiday season AFP via Getty Images Target Corp. said Monday that it will host its Deal Days shopping event on Oct. 13 and Oct. 14, the same days that Amazon.com Inc. is having its delayed Prime Day event. Amazon AMZN, +3.01% also announced the dates for Prime Day on Monday. Target Deal Days will feature digital promotions on “hundreds of thousands of items,” according to a statement sent to MarketWatch from the company. Read: Amazon will host its delayed Prime Day shopping event on Oct. 13 and 14 Target TGT, +1.14% has already begun to detail some of its plans for the holiday. The company teased an October launch of holiday season deals back in July. The company announced Tuesday that it will be offering Black Friday deals throughout the month of November and extending its price match guarantee beyond 14 days for the first time. The retailer is focusing its holiday staffing on the consumer desire for e-commerce and contactless purchasing, with plans to double the number of workers supporting Order Pickup and Drive Up, which allows consumers to have purchases placed in their cars. Target seeks to hire about the same number of seasonal workers as last year, according to a company statement, about 130,000. About 40% of seasonal hires stay on once the season is through. Target says it has added 10 million new e-commerce customers and has seen the demand for same-day fulfillment quadruple during the first half of fiscal 2020. The company aims to fulfill 90% of its digital orders from stores, a strategy that has helped the company’s bottom line. See: Holiday sales forecast to grow 1% to 2.6% during new October-to-December shopping season: AlixPartners The retailer plans to rely heavily on its existing workers, giving them the chance to work additional hours, something that executives say Target associates have asked for. The company will also give workers the option to train for work in areas of the store they aren’t usually in so they can move to busy spots if necessary. There will be additional seasonal hires, as well as full-time hires, in distribution centers, and there will be workers dedicated to the front of the store in order to help direct shoppers, clean carts and hand out masks to those who need them. Key to the holiday strategy will be flexibility. Also: Halloween sales forecast could be frightful to companies trying to create holiday season momentum “We want to empower store and distribution teams to take a market by market approach,” said Melissa Kremer, Target’s chief human resources officer, on a Thursday call with the media. Worker minimum wage at Target is $15 per hour and the company is extending benefits to seasonal workers, including free access to virtual doctor visits, free backup child care to U.S. workers and discounts on educational services. Walmart Inc. WMT, +1.00% says it will hire 20,000 seasonal workers. And: Walmart to hire 20,000 seasonal workers, stocks up on TVs for the holidays And Radial, a company that provides fulfillment services, supply chain services and other retail services, will hire 25,000 seasonal workers across North America. According to data provided by Incisiv, a retail industry insights firm, and technology company Manhattan Associates, 80% of shoppers are expecting to increase their use of buy-online-pickup-in-store services this holiday season, and 90% would prefer home delivery over a store visit for the next six months. More than three-quarters (79%) say contactless store pickups are very important to them. “We are not expecting long line on Black Friday morning, but we expect an active and engaged guest,” Target’s Chief Executive Brian Cornell said on a call with reporters. Target stock has gained 22% for the year to date while the S&P 500 index SPX, +0.87% has increased 3.7% for the period. This article was originally published on Sept. 24, 2020."}]}