{"article": [{"url": "https://www.marketwatch.com/story/how-nyc-hospitals-have-become-better-equipped-to-treat-covid-19-patients-2020-07-22", "published": 1595440700.0, "headline": "How NYC hospitals have become better equipped to treat COVID-19 patients", "body": "After treating tens of thousands of COVID-19 patients, health-care workers in New York City have gained a wealth of knowledge of and experience with the virus. That’s one of the main reasons survival rates are so much higher than they were when the first cases were reported in New York, experts said. “Your chance of dying is significantly lower now than it was in March,” said Dr. Daniel Griffin, a practicing physician and an associate research scientist in the Department of Biochemistry and Molecular Biophysics at Columbia University. “We have gotten so much better at managing COVID-19 patients.” The virus has caused 55,797 hospitalizations in New York City alone, according to city data. There have been 219,128 reported cases of the virus as of Wednesday, with 18,803 confirmed deaths and 4,625 probable deaths, according to city data. At its peak in early April, there were 6,377 cases of the virus reported in one day. That same day, April 6, there were 1,723 hospitalizations and 574 deaths. Three months later, on July 6, there were 118 positive cases reported, 15 hospitalizations and four fatalities. To combat the virus, researchers have been pushing innovations in testing, drugs and blood plasma and other treatments. Many hospitals have also reorganized their physical spaces to create more room for both patients and physical distancing within facilities. Another big reason for the higher survival rate recently: the patients are younger. Mayor Bill de Blasio announced last week that the city has seen an uptick in positive cases of the virus in 20- to 29-year-olds, with the rate of positive cases rising from 26.6 for every 100,000 people the first week of June, to 34.6 the week ending June 27. There’s also been a slight increase in cases in those in their 30s. “So I think we can take some of the credit in saying that we’ve got much better at reducing the risk, but we’re also seeing a younger, healthier population that one would anticipate having better outcomes,” he said.Evolving patient protocol Having now treated so many COVID-19 patients, health-care workers have a better sense of what to expect. In fact, there’s a four-week calendar of symptoms that is associated with many typical cases. The first week symptoms are typical of the flu, with the more serious issues—such as trouble breathing, clotting or bacterial infections—arriving in the second and third weeks, Griffin explained. That means people in the early phase can be more closely monitored from home, instead of coming to the hospital. Knowing how the virus is likely to behave has also been key to doctors prescribing the right medications. For example, blood thinners to help prevent clotting were added to the protocol at Mount Sinai hospitals, according to Dr. David Reich, president of the Mount Sinai Hospital and Mount Sinai Queens. “The vast majority of COVID patients received blood thinners, which further benefited the rate of survival,” he said. Other drugs that have been breakthroughs in treatment include steroids, such as Dexamethasone, and the antiviral drug remdesivir, for which the FDA issued an emergency use authorization in May. The manufacturer of remdesivir donated hundreds of doses of the drug to the federal government in May, which were then allocated to state governments. “We are currently well supplied and appreciate the donation by Gilead,” GILD, +0.82% Reich said. “It is my understanding that other hospitals in New York City are also well supplied and are likely going to be able to purchase the drug shortly, when more need arises.” Accessing remdesivir was a challenge before the federal government was in charge of allocating it, according to Dr. Robert J. Cerfolio, the chief of hospital operations at NYU Langone Health. In May, it started giving state health departments the drug so it could be sent to hospitals. “Now that it is centralized with the state Department of Health, it is going much better,” he said, adding that NYU Langone also has had sufficient supplies of the drug. Separately pulmonary support became a crucial area of care for COVID-19 patients with respiratory issues. Doctors and nurses have developed new protocols for putting patients on ventilators, as well as noninvasive methods of assisting breathing, according to Reich. Coronavirus update: U.S. case tally climbs above 3.9 million and Trump’s late move on face masks criticized by health experts These include high-flow nasal cannulas, tubes inserted into a patient’s nose, or CPAP and BiPAP machines, which go over the mouth and nose. These methods don’t require deep sedation, Reich pointed out, and can be combined with proning — the positioning of a patient on his or her stomach — for the best results. These treatments can be less traumatic for patients than putting them on ventilators, which require deep sedation and can be harmful to the lungs of COVID-19 patients. Researchers have also been working to create better testing and therapies to treat the coronavirus. In addition, antibody therapies like convalescent plasma treatment — in which the blood plasma of a recovered COVID patient is transfused into someone who is currently sick — are being refined at Mount Sinai, according to Reich. Mount Sinai initiated a convalescent plasma program in late March, and has been working with the New York Blood Centers to collect and store plasma for the research and treatment. However, by refining the plasma, they can create hyperimmune globulin, a concentrated antibody product derived from convalescent plasma. Other viruses have been successfully treated using hyperimmune globulins, and it is more universal than plasma transfusions, Reich said. “With plasma, you still need to match the blood type,” he said, adding that that is not a concern with hyperimmune globulins. “There are also fewer side effects.” Earlier this month, the Mount Sinai Health System announced that it will partner with Maryland-based Emergent BioSolutions and ImmunoTek Bio Centers in Louisiana to develop, manufacture and conduct clinical trials to evaluate Emergent’s COVID-19 hyperimmune globulin product, COVID-HIG. If proven to be effective, the therapy can be a passive form of immunity for health care or essential workers who are at higher-risk of infection. It can be used both pre- and post-exposure to help fend off the virus. Also see: New York state reports just two deaths in one day—its lowest total since March “If we’re sending someone in to treat COVID patients, we can give that person a shot so he or she will be more protected,” Reich said. “Or if a family member has COVID and another family member is exposed, we can give them a shot to help prevent the clinical disease.” This could be a good option in the absence of a vaccine, “particularly for patients who do not develop immunity from a vaccine,” Reich noted in the announcement of the partnership. “It is imperative that we have more options to prevent this terrible disease in front-line workers and other high-risk populations and to potentially decrease the severity of illness in those infected.”Keeping a distance Hospital facilities have also had to change to adapt not only to the staggering number of COVID patients, but also the need to keep a distance. That’s meant better workflows, fewer places to congregate and more space in areas like the nurses’ station. Across the Mount Sinai hospital system, negative-pressure isolation rooms for COVID patients were created, allowing air to flow into the room but not escape it. These rooms also had HEPA filters, Reich noted, and staff members felt safer going in and out of them. Newer hospitals such as NYU Langone Health’s Kimmel Pavilion in Kips Bay, which opened in 2018 and has private rooms for all patients, did not have to make many changes, Cerfolio said. At older buildings, like NYU’s adjacent Tisch Hospital, rooms were partitioned to create isolated spaces. Both treat COVID-19 patients. Next steps Meanwhile, health-care workers are not letting their guard down. “The virus is likely to be with us for years,” Reich noted. And the next wave could be more brutal than the last. “Some [doctors], myself included, predict that this winter will make the spring look pretty mild, and that this will be one of the darkest winters,” Griffin said, adding that health-care workers will be battling both the flu and the coronavirus. He says testing remains a critical issue for keeping the virus under control and helping patients survive. And despite the need, federal assistance is being pulled back instead of escalated. The state tested 67,000 people on Tuesday, according to Gov. Andrew Cuomo. See: ‘Don’t be stupid’ — New York governor warns bars and restaurants can be closed again if street partying continues “If we can really identify who has COVID-19 and really stop the spread, that makes a lot more sense to me...than shutting down the economy again and locking people in their homes,” Griffin said."}]}