{"article": [{"url": "https://www.marketwatch.com/story/kamala-harris-blasts-trumps-coronavirus-response-he-was-fixated-on-the-stock-market-over-fixing-the-problem-2020-08-27", "published": 1598545820.0, "headline": "Kamala Harris blasts Trump's coronavirus response: 'He was fixated on the stock market over fixing the problem'", "body": "“ \"Here's why Trump has been so unwilling and unable to deal with this crisis. First, he was fixated on the stock market over fixing the problem.\" ” - Kamala Harris The line above came Thursday from Kamala Harris, Democratic presidential nominee Joe Biden's running mate, as she delivered a speech in which she attacked President Donald Trump's handling of the coronavirus crisis. Harris went on to say that Trump tweeted about the market \"consistently during this period. He was convinced that if his administration focused on this virus, it would hurt the market and hurt his chances of being re-elected.\" \"Second, right at the moment we needed Donald Trump to be tough on the Chinese government, he caved,\" she added, noting that Trump praised Beijing's response to COVID-19 in January. Related:Trump says his executive actions on coronavirus aid led to stock market's gain In her roughly 20-minute speech from Washington, D.C., the Democratic vice presidential nominee also said a pandemic is \"relentless - you can't stop it with a tweet.\" In addition, she criticized this week's Republican National Convention, a four-day event that ends tonight with a speech from Trump. \"The Republican convention is designed for one purpose - to soothe Donald Trump's ego, to make him feel good,\" Harris said. \"But here's the thing. He's the president of the United States, and it's not supposed to be about him. It's supposed to be about the health and the safety and the well-being of the American people. And on that measure, Donald Trump has failed.\" See: Trump to attack Biden tonight as a 'weak candidate with a poor record' Harris also addressed the recent shooting by police in Kenosha, Wis., of a Black man, Jacob Blake, saying it was \"sickening\" and she supported those protesting peacefully. She said the country must have criminal-justice reform and address systemic racism. The main U.S. stock gauges DJIA, +0.56%  mostly finished with gains on Thursday, with the S&P 500 SPX, +0.87% notching a fresh record close while the Nasdaq Composite COMP, +1.39% pulled back."}]}