{"article": [{"url": "https://www.marketwatch.com/story/first-week-of-coronavirus-aid-talks-in-congress-make-no-progress-11596227176", "published": 1596270620.0, "headline": "First week of coronavirus aid talks in Congress make no progress", "body": "A store advertises a sale on July 7, 2020 in the Brooklyn borough of New York City. (Photo by Spencer Platt/Getty Images) In-person meetings held: four. Issues resolved: apparently none. That’s the takeaway from the first week of negotiations so far between the White House, the Republican party and Democrats in Congress on another big coronavirus financial aid bill. The impasse has already claimed one casualty: the extra $600 a week the unemployed were getting from the federal government on top of their state jobless benefit payments. Those payments stopped this week. Beyond the unemployment add-on is a long waiting list of equally thorny issues on which the gulf between Democrats, the White House and the Republican-led Senate is large: liability protection for businesses and institutions who fail to protect people from COVID-19, money for cash-strapped states and cities, money to help schools reopen, and extending the Paycheck Protection Program before its authorization lapses Aug. 8. “I think it has a potential of helping a bipartisan deal if we can address the enhanced unemployment issue and get that addressed now,” Mark Meadows, the White House’s chief of staff, told reporters Thursday night. “Then we have a greater chance of negotiating a bipartisan deal on all of the remaining issues. Not just state and local, but PPP, the checks – the $1,200 dollar checks – so there’s a number of things I think that would be welcome, that have some bipartisan support.” But after four face-to-face meetings between Meadows and his fellow Trump administration negotiator Treasury Secretary Steven Mnuchin on one side and House Speaker Nancy Pelosi and Senate Democratic Leader Chuck Schumer on the other, the outlook for a deal, small or large, looks grim. “Understand this: passing something for a week without all the other things that should go with it is not any path that we will go down,” Pelosi said on CNN Friday afternoon, when asked about the administration’s offer to briefly revive the unemployment supplement as they work on a bigger deal. At the White House, Meadows said Democrats have rejected several offers to revive the unemployment benefit add-on. “And those four different offers have been actually rejected, but more importantly than that, they’ve not even been countered with a proposal,” he said. A fifth in-person meet of the Democratic party leaders and Trump administration representatives is set for Saturday, according to a Democratic congressional aide. House lawmakers left Washington Friday, but were told by Majority Leader Steny Hoyer they would get a 24-hour headsup to return when the House would vote again. The Senate will be back next week, but is scheduled to leave Aug. 7 for its summer break. Liam Donovan, a principal with Bracewell LLP’s Policy Resolution Group, a Washington-based lobbying and public relations firm, said it’s hard to figure out how a deal gets done quickly. “It still takes some magical thinking to figure out, working backward, how do they get to a deal,” he said. “If we’re talking a week from now and they somehow got to a deal, was it simply the pressure of taking off? Was it the threat of losing recess time? I don’t quite know.” But Donovan said Democrats are holding the upper hand now in bargaining because of Republican disunity. That could change though, he said, as the Republican Senate begins finally taking votes on policies. The Senate, on a 47-42 vote Friday, began the procedural process to begin to debate the unemployment add-on. And while resolving that issue would be major progress, Donovan said he still thinks the liability provisions that Senate Majority Leader Mitch McConnell has called a “red line” are an even bigger hurdle. “That was always going to be the trickiest piece to sort out,” he said."}]}