{"article": [{"url": "https://www.marketwatch.com/story/one-way-to-end-coronavirus-aid-standoff-add-parts-of-a-deal-to-stopgap-funding-bill-11600371127", "published": 1600357220.0, "headline": "One way to end coronavirus aid standoff? Add parts of a deal to stopgap funding bill", "body": "(FILES) In this file photo taken on October 17, 2019, shows the US Capitol in Washington, DC. (Photo by Brendan Smialowski / AFP) (Photo by BRENDAN SMIALOWSKI/AFP via Getty Images) Talks to find the funds to keep the U.S. government open past Sept. 30 are going well, lawmakers say, but talks to settle on a bill to boost the economy in the wake of the coronavirus pandemic are stalled. So why not put them together and pass some of the fiscal stimulus with the must-pass government funding bill? That idea remains on the shelf, at least for now, but could find renewed interest as the clock ticks closer to the end of the federal government’s budget year and a potential shutdown. To be clear, House Speaker Nancy Pelosi said the talks on a stopgap funding bill, or continuing resolution in Capitol Hill-speak, would remain separate from stimulus talks when she said she and Treasury Secretary Steven Mnuchin agreed to work together on the funding bill. A spokesman for Pelosi repeated that was still her stance Thursday. But with the number of days Congress is in session before Sep. 30 dwindling, the idea of at least trying to attach portions of a stimulus deal with widespread support to the funding bill could become more attractive. The House is scheduled for six days before month end, while the Senate for five if it, as usual, does not meet for business on Fridays. “Both sides appear perfectly content to head into the election thinking that the politics hurts the other side worse. Realistically, the best hope going forward is that a handful of these consensus provisions might be cherry-picked and incorporated into a clean-ish CR,” wrote Liam Donovan, principal at Bracewell LLP’s Policy Resolution Group ina note to clients. But Donovan said in email the odds remain low, “maybe 25%.” On the other hand, another round of $1,200 stimulus checks, reviving the federal add-on to state unemployment benefits, and bringing back the Paycheck Protection Program, which has $134 billion in unused lending authority, all have bipartisan support among Congress’ rank-and-file members. “If you can’t figure out how to turn PPP back on with $100 billion just sitting there and bipartisan consensus, they have a lot of soul searching to do!” Donovan said. Sen. Roy Blunt, a Missouri Republican, said Tuesday that at the very least there will be efforts to add provisions to a standalone funding bill negotiated between congressional leaders and the White House. “No question, there will be people that will want to put things on that CR or, at the very least, would want to offer to put things on the CR so that they could go home and say ‘here’s what would have gone on if they had accepted my amendment,'” he said. Negotiating a funding bill is by no means a slam dunk. Democrats and Republicans have to agree on how long the temporary funding – usually at current levels – should last and what one-off items, so-called anomalies like the U.S. Census, for example – should be included. Republicans want a short-term CR that would keep the government’s lights on past the election and into December, when the issue could be revisited. Democrats have been talking about extending it into next year, possibly February or March. On the other hand, failing to get a CR done would not help Congress’ approval ratings, which have fallen from the spring when an initial burst of COVID-19 bills was passed. “I don’t think anybody wants to be responsible for shutting down the government on the eve of an election in the middle of a pandemic,” said Rep. Tom Cole, an Oklahoma Republican. “It’s certainly possible” stimulus items could be added at the end of the CR talks, he said, but they would need to be blessed by party leaders. “I think the main thing is just to make sure the government is funded and if we have more promising talks, then this certainly could be a vehicle where we can put other things in,” he said. Ron Johnson, the Wisconsin Republican who has been among the loudest voices in his caucus against higher federal spending, said Wednesday it was possible something could be added in the CR process. “Yeah, I don’t want to see anything big and ugly,” he said."}]}