{"article": [{"url": "https://www.marketwatch.com/story/covid-19-propels-an-already-surging-secondhand-clothing-market-2020-06-23", "published": 1592894300.0, "headline": "The shift to thrift: COVID-19 propels an already surging secondhand clothing market", "body": "Sustainability-minded younger shoppers and bargain-hunting consumers of all ages who are feeling the economic pinch of the COVID-19 pandemic are increasingly giving up new clothes for resale items that sometimes still have their tags. In fact, according to thredUP, a major online secondhand shopping site, a surge in demand for resale — a $28 billion market already — was underway well before the pandemic crisis hit. The resale market is projected to reach $64 billion in five years. “We were already starting to see a resale generation, emerging players and a market growing, including with [luxury resaler] RealReal going public. What happened was COVID-19 put a fine point on it,” said thredUP CEO James Reinhart. Related:Newly public luxury secondhand retailer the RealReal says it occupies a ‘space of one’ With the pandemic closing down much of the economy, “the consumer felt like their wallets might get squeezed and moved to the value,” Reinhart said. “The same thing happened with [the financial crisis of] 2008-2009. And certainly some consumers are shopping secondhand for first time during COVID. There are big dislocations, big changes, new experiences, the world turned upside down.” The flow of clothing onto the secondary market was more robust as well, as home-bound consumers cleaned out closets and sold what they no longer wanted. For resale, the crisis “accelerated what was already going to be true over the next few years,” Reinhart added. Some 70% of consumers say they are now open to buying secondhand, and 64 million bought secondhand products last year, thredUp claims in its 2020 Resale Report, created with help from third-party research and analytics firm GlobalData. Resale grew 25 times faster than new retail in 2019, a trend not ignored by traditional retailers who are linking up with resellers. Among them, Walmart Inc. WMT, +1.00% said last month it has partnered with ThredUp to bring secondhand clothing and a variety of new brands to the Walmart website. Macy’s Inc. M, -0.95% and J.C. Penney Co. Inc. JCP, -2.53% have also added secondhand clothing to their merchandise lineups, and major retailers have started to focus on recycling and other sustainability measures. The resale market hasn’t completely survived the pandemic unscathed, however. RealReal REAL, -0.51% in April said in response to the negative effects of the COVID-19 pandemic, it cut its overall workforce by 10% and furloughed about 15% of its staff, as it temporarily closed its stores and luxury consignment offices. Moves by the high end of the market aside, players in the space remain generally optimistic about what’s expected this year and in coming years. Select findings from the report: Resale avoids the “COVID retail slump” as shoppers bargain-hunt from home: thredUP saw increased activity during lock-down, with record site visitors in May. Those visitors spent 37% more “time on site” treasure hunting than pre-COVID. Online secondhand is set to grow 27% in 2020, while broader retail sector is projected to shrink 23%. Shoppers are buying secondhand more than ever before: 70% of women have or are open to shopping secondhand, and 62 million women bought secondhand products last year (up from 56 million in 2018). As fast fashion falls, secondhand soars: Resale is expected to be bigger than fast fashion by 2029, with resale projected to be $44 billion and fast fashion at $43 billion. Fast fashion is the industry term for mass-market timely adoption of runway trends. Consumers want eco-friendly retail practices: 70% of all consumers agree that addressing climate change is more important now than ever. Nearly 2.5x more consumers plan to shift their spend to sustainable brands from 18% in 2018 to 43% in 2019. Eco-brands like Patagonia and Allbirds are churning up 57% more interest on thredUP since COVID-19. In 10 years, closets will have more used and off-price clothing than any other category. Some 67% of people who haven’t are open to reselling their clothing as it becomes easier to do so, with more outlets. Some brands (in the chart below) considered perennial resale favorites."}]}