{"article": [{"url": "https://www.marketwatch.com/story/wildly-out-of-context-navarro-on-his-own-words-and-the-markets-in-relation-to-the-economy-2020-06-23", "published": 1592892560.0, "headline": "â\u0080\u0098Wildly out of contextâ\u0080\u0099 â\u0080\u0094 Navarro on his own words, and the markets in relation to the economy", "body": "We got a taste of things to come when White House China hawk Peter Navarro stated to the press that the U.S.-China trade deal was â\u0080\u009cover.â\u0080\u009d Cue a plunge in stocks ES00, +1.13% Â Â and in CNY USDCNY, Â and in bond yields and general risk-off. Then cue the inevitable rapid winding-back of those comments from Navarro and Kudlow and Trump, with the former saying his comments had been taken â\u0080\u009cwildly out of contextâ\u0080\u009d (they hadnâ\u0080\u0099t given he was talking about the total collapse of U.S. trust in China) and the latter tweeting â\u0080\u009cThe China Trade Deal is fully intact. Hopefully they will continue to live up to the terms of the Agreement.â\u0080\u009d The problem is that this upbeat assessment is also wildly out of context. There appears no realistic way China is either willing or able to stick to the dealâ\u0080\u0099s terms. Even Democrat Chuck Schumer has just retweeted Trump with a few amendments: â\u0080\u009cThe China Trade Deal is fully intact. Hopefully they will start to live up to the terms of the â\u0080\u0098Agreement.â\u0080\u0099â\u0080\u009d Of course, at this stage Trump is desperate to maintain some semblance of a â\u0080\u0098winâ\u0080\u0099. Yet if no U.S. soybean sales are made in bulk soon could he then turn the trade bazooka on China â\u0080\u0093 perhaps handily timed around the date of one of the planned Trump-Biden debates? Donâ\u0080\u0099t rule it out. China certainly isnâ\u0080\u0099t doing much to help on a related front. It has just been announced that the controversial new Hong Kong national security law will not be made public in full until AFTER it has been passed in Beijing - within a week it appears. Suffice to say that the details revealed so far certainly tick all the boxes for other U.S. China hawks, such as Secretary of State Pompeo. Perhaps not only him. Yesterdayâ\u0080\u0099s virtual EU-China summit was summarized by the Global Times thus: â\u0080\u009cChina, EU seeks to inject momentum in recoveryâ\u0080\u009d. The New York Times says: â\u0080\u009cBetraying Frustration with China, EU Leaders Press for Progress on Trade Talksâ\u0080\u009d. The European angle, from DW, is â\u0080\u009cEU chiefs press China on trade, Hong Kong security lawâ\u0080\u009d, adding â\u0080\u009cTensions have been risingâ\u0080¦Top EU officials struck a tough tone during talks Monday, pressing China on its trade and investment relationship and warning of â\u0080\u009cvery negative consequencesâ\u0080\u009d if it goes ahead with a proposed controversial security law for Hong Kong.â\u0080\u009d The EU also added that China needs to â\u0080\u009credressâ\u0080\u009d the trade relationship and â\u0080\u009cresolve concrete problemsâ\u0080\u009d. China is not unaware of where this could all lead above and beyond the threat of seeing exports to the U.S. and India and the EU start to level off or decline. As the South China Morning Post says: â\u0080\u009cChina warned to prepare for being cut off from U.S. dollar payment system as part of sanctions like Russiaâ\u0080\u009d. Yes, thatâ\u0080\u0099s still a tail risk; yes, the EU wonâ\u0080\u0099t be leading that charge; and, yes, Trump clearly wants to win re-election and taking this kind of step wonâ\u0080\u0099t help his farm base. But if his farm base isnâ\u0080\u0099t being helped and he continues to trail in all polls, even in battleground states, do you really want to bet against that trigger being pulled as a conversation/world changer? Of course, it would mean U.S. stocks SPX, +0.87% Â plunging. Which might be the trigger for what markets are already eager for: Fed yield curve control (YCC). Will it be a 0.5% or a 1.00% 10-year TMUBMUSD10Y, 0.777% Â forever, or a 0.30% 5-year TMUBMUSD05Y, 0.338% Â , or both? Bloomberg merrily flags this will be the starting gun for a Buy Everything rally â\u0080\u0093 as if we arenâ\u0080\u0099t in one already. Yet how has YCC worked out for Japan so far? It remains mired in structural deflation and slow decline, with crisis only being averted by dint of its accumulated savings and large external surpluses. Do we all want to repeat that? It seems we do. Of course, this presupposes that what the economy does has any bearing on markets â\u0080\u0093 which clearly is no longer the case. Markets remain wildly out of context when one considers that global virus infections are over 9 million and rising, with no sign at all of being brought under control, and with millions more out of jobs. Yes, London pubs might be about to re-open under strange new conditions, as will New York bars. Clearly in Mr. Marketâ\u0080\u0099s mind a cheeky pint or brewski clearly outweighs the global picture. You know what they say: a recession is when someone you know loses their job, and a depression is when you lose yours. Likewise, the virus is an â\u0080\u009cinvisible enemyâ\u0080\u009d when someone you know gets sick, and itâ\u0080\u0099s just one of those things when it is happening in another country. (Or, in the case of the U.S. and Brazil, in oneâ\u0080\u0099s own country â\u0080\u0093 or so government critics allege.) Anyway, itâ\u0080\u0099s all going to be risk-on until the next attempt to get markets closer to their actual context. Which will come. That Hong Kong law will be in place in days. Trump just used an executive order to expand U.S. visa restrictions until end-2020, closing loopholes deliberately left in the last such visa-related order. Egypt is talking about squaring up to Turkey in Libya. And itâ\u0080\u0099s 40C/101F in the Arctic circle today. Michael Every is global strategist at Rabobank."}]}