{"article": [{"url": "https://www.marketwatch.com/story/there-are-seven-coronavirus-vaccine-candidates-being-tested-in-the-us-heres-where-they-stand-2020-09-08", "published": 1601495180.0, "headline": "There are seven coronavirus vaccine candidates being tested in the U.S. - here's where they stand", "body": "The race to develop a safe and effective COVID-19 vaccine is well under way, setting the stage to bring to market the fastest vaccine in history. There are dozens of coronavirus vaccines in development, primarily in the preclinical phase when they are tested on animals. In the U.S., there are seven vaccine candidates that have moved into clinical trials with human participants, including four that have moved into the crucial Phase 3 development phase. Read: Here's what you need to know about clinical trials as drug makers push forward with coronavirus vaccine studies The first and second phases of clinical studies are primarily conducted to test for safety, while the third and final stage is used to determine whether vaccines are efficacious and can prevent infection among participants. At that point, the vaccine makers will decide when to pursue an emergency-use authorization from the Food and Drug Administration and/or a full approval. The majority of the vaccines in development have received funding from the U.S. government, either to help support clinical development or pay for manufacturing and distribution of the vaccines as part of the Trump administration's \"Operation Warp Speed\" program. MarketWatch will update this tally as the vaccines move through development.Vaccines in Phase 3 trials in the U.S. (cited in alphabetical order, by company name): â\u0080¢ AstraZeneca AZN, +1.16%  AZN, +0.63%, in partnership with the University of Oxford Year-to-date stock performance: Up 7.8%. Name: AZD1222. Type: Vector-based. Phase 1/2: Data from the Phase 1/2 trial, which is being conducted in the U.K., was published July 20 in the Lancet. It reported neutralizing antibody responses in 91% of 35 patients when using one test and 100% of 35 patients when using a different test. Phase 3: This trial, which will be held in the U.S., is expected to enroll up to 30,000 participants. (Late-stage studies are also being conducted in Brazil, South Africa and the U.K.) Data are expected by the end of the year. However, trials were halted in early September over concerns about a serious adverse event; the U.K. trial was restarted but the U.S. trial has not yet resumed. This is the trial protocol. Target effectiveness: 50% Clinical development and manufacturing funding from the U.S. government: up to $1.2 billion. U.S. dose promise: 300 million doses. Dosing: 2 doses. â\u0080¢ BioNTech BNTX, +1.23%  and Pfizer Inc. PFE, -0.27%  Year-to-date stock performances: BioNTech, up 75%; Pfizer, down 8.3%. Name: BNT162b2. Type: mRNA. Phase 1: The companies published preliminary data on July 1 for BNT162b1 as a preprint. They said then that 24 participants in the study who received two doses of the lower-dose vaccine developed neutralizing antibodies. A second preprint was published on Aug. 28 for BNT162b2 that found this candidate produced similar levels of antibodies but participants reported fewer reactions. Phase 2/3: This trial is expected to focus on BNT162b2. It is expected to enroll up to 30,000 participants in Argentina, Brazil and the U.S. This is the trial protocol. Target effectiveness: 60% Manufacturing funding from the U.S. government: $1.95 billion. U.S. dose promise: 100 million doses, with option to buy up to 500 million more doses. Dosing: 2 doses. â\u0080¢ Johnson & Johnson JNJ, +1.39%  Year-to-date stock performance: Up 1.2%. Name: Ad26. COV2. S or JNJ-78436735 Type: Vector-based. Phase 1/2a: The study began in the second half of July. J&J said Sept. 23 that the vaccine candidate demonstrated a \"safety profile and immunogenicity after a single vaccination were supportive of further development\" and preprint results would be published imminently. Phase 3: It said Sept. 23 it plans to enroll up to 60,000 people in the late-stage trial, which began dosing participants in September, in partnership with BARDA. This is the trial protocol. Target effectiveness: 60%. R&D funding from BARDA: $456 million U.S. government funding for manufacturing and delivery:More than $1 billion (from BARDA and the Department of Defense). U.S. dose promise: 100 million doses, with option to buy up to 200 million additional doses. Dosing: 1 dose. â\u0080¢ Moderna Inc. MRNA, +0.09%  Year-to-date stock performance: Up 187.8%. Name: mRNA-1273. Type: mRNA. Phase 1: Preliminary data were released May 18; more detailed data published July 14 in the New England Journal of Medicine. Moderna's vaccine candidate elicited neutralizing antibodies in all 45 participants in this trial, which was conducted in the U.S. in partnership with the National Institute of Allergy and Infectious Diseases. It later released additional data about older participants on Aug. 26 at a public meeting and again on Sept. 29 in a publication in the New England Journal of Medicine. Phase 2a: This study closed enrollment of 600 participants on July 8. This trial is also focused on the U.S. Phase 3: This study is expected to complete enrollment of up to 30,000 people some time in September. This is the trial protocol. Target effectiveness: 60% R&D funding from BARDA: $955 million. Supply funding from the U.S. government: Up to $1.525 billion. U.S. dose promise: 100 million, with option to acquire up 400 million additional doses. Dosing: 2 doses.Vaccines in Phase 1 and 2 trials in the U.S. (cited in alphabetical order, by company name): â\u0080¢ Inovio Pharmaceuticals Inc. INO, -1.36%  Year-to-date stock performance: Up 191.2%. Name: INO-4800. Type: DNA. Phase 1: The company released some preliminary data on June; it has not yet shared the full data but has submitted the results for publication in a peer-reviewed medical journal. The trial is being conducted in the U.S. Phase 2/3: Inovio had previously said it planned to launch this phase of the study in September, if it is given the go-ahead by the FDA. However, on Sept. 28, it said the Phase 2/3 clinical trial for its COVID-19 vaccine candidate was in a \"partial clinical hold,\" pushing back the timeline for the vaccine candidate. U.S. government funding: It received $71 million from the Department of Defense to make and buy the devices that will be used to dispense the company's vaccine if it is authorized or approved. â\u0080¢ Novavax Inc. NVAX, +0.18%  Year-to-date stock performance: Up 2,167.6%. Name: NVX-CoV2373. Type: Protein subunit. Phase 1: Preliminary data from a trial conducted in Australia were published Sept. 2 in the New England Journal of Medicine. Phase 1/2: The second phase of the Phase 1/2â\u0080\u0082trial started in August and will be conducted in Australia and the U.S. Phase 3: TBD. Clinical development and manufacturing funding from the U.S. government:$1.6 billion. U.S. dose promise: 100 million doses. â\u0080¢ Sanofi SNY, +0.89%  SAN, +1.20% , in combination with GlaxoSmithKline's GSK, +1.10%  GSK, +1.52% adjuvant technology Year-to-date stock performance: Up 0.6%. Name: TBD. Type: Protein-based. Phase 1/2 study: The trial was initiated Sept. 3, with a goal of enrolling 440 adults in the U.S. Results are expected in December. Phase 3: This study is expected to launch by the \"end of 2020.\" Clinical development and manufacturing funding from the U.S. government: Up to $2.1 billion. U.S. dose promise: Up to 100 million doses, with option to buy up to 500 million doses. Sources: Company websites, federal data, the World Health Organization, RBC Capital Markets."}]}