{"article": [{"url": "https://www.marketwatch.com/story/stock-futures-point-higher-as-optimism-rises-over-potential-coronavirus-treatment-2020-08-24", "published": 1598287280.0, "headline": "Dow ends above 28,000 for first time in 6 months, S&P 500 and Nasdaq clinch new records on coronavirus treatment hopes", "body": "The S&P 500 and Nasdaq Composite clinched fresh closing and intraday records on Monday, as hopes for a potential COVID-19 treatment bolstered trading for more growth-sensitive sectors that have lagged the rest of the market.What did major benchmarks fare? The Dow Jones Industrial Average DJIA, +0.56% surged 378.13 points, or 1.4%, to end at 28,308.46, finishing above 28,000 for the first time in six months and only 4.2% away from its Feb. 12 record closing high. The S&P 500 SPX, +0.87% gained 34.12 points, or 1%, closing at a record 3,431.28, near its fresh intraday record. The Nasdaq Composite COMP, +1.39% rose 67.92 points, or 0.6%, ending at a record 11,379.72, following its intraday all-time high at 11,462,05. The S&P 500 on Friday drifted higher by 0.3% in light volume to end at a record 3,397.16, marking a 0.7% weekly advance. The Dow rose 190.60 points, or 0.7%, on Friday to end the week with a gain of less than one point at 27,930.33. The tech-heavy Nasdaq Composite logged a 2.7% weekly rise, finishing Friday at 11,311.80, its 36th record finish of 2020.What drove the market? Equity investors snapped up a broad range of U.S. stocks on Monday, from airlines to technology darlings, a day after the Food and Drug Administration said it approved the use of convalescent plasma, the antibody-rich component of blood taken from recovered COVID-19 patients, as a treatment for serious coronavirus cases. “It does seem to be related to potentially favorable news over the weekend regarding treatments, and general optimism about the possibility of a coronavirus vaccine,” John Carey, Amundi Pioneer’s director of U.S. equity Income, told MarketWatch. “It’s a broader-based market advance, with both cyclicals and growth stocks moving upward.” The World Health Organization on Monday warned that the plasma therapy hailed by President Donald Trump Sunday still is unproven and cautioned that the there is “very low evidence” that it is safe and effective. Medical experts said the potential plasma treatment may provide benefits to those battling the disease, while questions remain about when it should be administered and dosage. AstraZeneca AZN, +0.63% AZN, +1.16% shares rose 1.9%, even after the drugmaker denied talks with U.S. government about emergency use authorization of its coronavirus vaccine, a day after the Financial Times reported that Trump may order the FDA to grant the same type of approval for its vaccine, which is being developed by University of Oxford researchers. The new bout of optimism helped beaten-down cyclical sectors, including shares of energy and industrials, areas that would benefit from a faster economic rebound. Energy shares led gains on the Nasdaq and S&P 500 Monday. “There is a rationale for some of these cyclical stocks to do better on the hopes or expectations of vaccines being developed. But I do think it’s still a bumpy road” for the economic recovery, said Yung-Yu Ma, chief investment strategist at BMO Wealth Management, in an interview. Read:Are stock market investors overpricing or underpricing a coronavirus vaccine? The S&P 500 returned to record territory last week, erasing a nearly 34% plunge that took the U.S. benchmark from a record Feb. 19 close to its March 23 low, in a rally driven largely by shares of big tech companies that have seen their businesses benefit from the pandemic, while shares of companies whose performance is tied more closely to the economic cycle have continued to lag despite some recent stretches of outperformance. Related: Trees don’t grow to the sky: tech stocks can’t outperform forever, BCA Research argues Investors also are looking forward to hearing dozens of central bankers speak later in the week during the Kansas City Federal Reserve Bank’s annual symposium. The event, typically held in Jackson Hole, Wyo., will be conducted via webcast this year. Fed Chairman Jerome Powell is slated to speak Thursday on how the central bank plans to achieve its twin goals of stable prices and maximum employment once the coronavirus pandemic has ended. “I believe Powell may go so far as to announce a new inflation targeting policy, or at least hint at it,” wrote Kristina Hooper, Invesco’s chief global market strategist, in a note Monday. “We could also hear central bankers from around the world discuss how they would respond monetarily to trade policy, which I believe is worth addressing given the current state of trade tensions.” In economic data, the Chicago Fed’s national activity index fell to 1.18 in July from a revised record-high of 5.33 in June. A zero value of the index indicates the national economy is expanding at its historic trend rate of growth. Which stocks were in focus? Blackstone Group Inc. BX, -0.67% shares rose 0.6%, after Takeda Pharmaecutical Co. announced it would sell its consumer health care business for 242 billion yen ($2.3 billion) to the U.S. private equity giant, The Wall Street Journal reported Monday. Shares of diversified industrial company NN Inc. NNBR, -1.84% fell 7.7%, after the company said it has agreed to sell its life sciences business of units of American Securities LLC in a deal worth $825 million. Twitter Inc. TWTR, -0.23% shares rose 3.2% Monday to its highest close since Oct. 7, 2019 when the stock ended at $40.80, according to Dow Jones Market Data. Zoom Video Communications, Inc. ZM, +2.89% shares slumped 2.6%, after the company confirmed an outage that was preventing users from being able to join and start meetings on the service. Apple Inc. AAPL, +1.74% shares added 1.2% Monday, after analysts shrugged off claims of “monopolistic practices” made by “Fortnite” developer Epic Games, while the stock is also a week away from its 4-for-1 stock split. PainReform Ltd. PRFX, +1.63%, an Israeli start up that is aiming to develop non-opioid post-surgery pain treatments, set terms for its initial public offering on Monday, with plans to offer 2.55 million units priced at $8 to $10 each. Rio Tinto shares RIO, +0.92% shares rose 1% Monday, after the mining giant released a report saying the company had the legal authority to blow up two ancient West Australian caves, but conceded it was wrong to do so. Airlines shares surged Monday, lifting the U.S. Global Jets ETF JETS, +0.16% 5.5%, an exchange-traded fund tracking the global airline industry, following the decision of the Food and Drug Administration over the weekend to approve the use of convalescent plasma for use as a potential treatment for COVID-19. Blank-check company Executive Network Partnering Corp. ENPC.U, set terms for its initial public offering on Monday, with plans to raise about $300 million. The company is chaired by former House Speaker Paul Ryan. How did other markets fare? The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% TMUBMUSD10Y, 0.777% rose 0.6 basis points to 0.645%. Bond prices move inversely to yields. Gold futures GCZ20, +2.17% slumped, with the December contract finishing 0.4% lower at $1,939.20 an ounce on Comex, the lowest close in about a month. Oil futures CL.1, -1.62% advanced 0.7% to settle at $42.62 a barrel, as a pair of tropical storms converged on the Gulf of Mexico, forcing the closure of offshore oil rigs accounting for more than half of the region’s production. The greenback was 0.1% higher, after erasing its early losses based on trading in the ICE U.S. Dollar Index DXY, -0.58%. In global equity markets, China’s CSI 300 000300, +2.04% rose 0.8%, the Shanghai Composite SHCOMP, +1.67% ended 0.2% higher, and Japan’s Nikkei NIK, -0.11% closed with a gain of 0.3%. The Stoxx Europe 600 SXXP, +0.55% jumped to close up 1.6% and U.K.’s FTSE benchmark UKX, +0.64% advanced 1.7%, getting a boost after the FDA announcement. William Watts contributed reporting"}]}