{"article": [{"url": "https://www.marketwatch.com/story/stock-futures-point-higher-after-tech-rout-drives-nasdaq-into-correction-2020-09-09", "published": 1599669440.0, "headline": "Dow ends 439 points higher as stocks snap three-day losing streak on heavy tech buying", "body": "U.S. stocks booked sharp gains Wednesday, snapping a three-day selloff that a day earlier drove the Nasdaq Composite into a correction at the fastest pace in history, following its record high last week. On Wednesday the Nasdaq posted its largest one day point and percentage gain since Wednesday, April 29, according to Dow Jones Market Data. How did major benchmarks fare? The Dow Jones Industrial Average DJIA, +0.56% rose 439.58 points, or 1.6%, to end at 27,940.47, while the S&P 500 SPX, +0.87% closed at 3,398.96, an increase of 67.12 points, or 2%. The Nasdaq Composite COMP, +1.39% jumped 293.87 points, 2.7%, to finish at 11,141.56, while booking its best daily percent gain since April 29, according to Dow Jones Market Data. The Nasdaq Composite on Tuesday ended with a loss of 465.44 points, or 4.1%, at 10,847.69—marking a pullback of slightly more than 10% over three trading sessions for its fastest ever fall from a record into correction territory. The Dow fell 632.42 points, or 2.3%, ending at 27,500.89, while the S&P 500 dropped 95.12 points, or 2.8%, to close at 3,331.84.What drove the market? Technology, and stocks that benefited from the work-from-home trend in recent months, recovered some ground Wednesday. “Broadly, the technology sector is leading the recovery,” said James Ragan, director of Wealth Management Research at D.A. Davidson, in an interview with MarketWatch, adding that early signs of a rotation into downtrodden stocks has fizzled. “We could say that today, any rotation has stalled out,” he said. “Over the past few months, any time we get a little more strong performance from value groups, it doesn’t really last.” At the same time, concerns have been mounting that valuations for top performers have gotten euphoric, leaving the market vulnerable to a near-term pullback and more volatile trade. “Those gains didn’t make a lot of sense,” said Donald Calcagni, chief investment officer with Mercer Advisors, in an interview with MarketWatch. “When you have Amazon trading at 120 times earnings and the economy is contracting 32%, that just doesn’t make sense.” Calcagni spent the past several months with a healthy respect for the coronavirus. “If there are businesses, communities, states, that say, to hell with it, let’s reopen, I share that emotion, but people are still getting sick,” he pointed out. “And the reality is that’s going to spook consumers. If the consumer is spooked they’re not going to spend. That’s going to weigh on the economy.” He calls himself “bearish” over the next few months as those economic headwinds continue and the likelihood of a contested U.S. presidential election looms in November. In pandemic news, the global death toll edged toward 900,000 and a trial for a potential COVID-19 vaccine being developed by AstraZeneca PLC AZN, +0.63% AZN, +1.16% was halted after a participant was struck by an unexplained illness. The drugmaker, in what it described as a “routine action,” paused late-stage trials of its vaccine candidate. Need to Know:Why an approved coronavirus vaccine may not end the pandemic quickly In politics, a new book by journalist Bob Woodward suggests that President Donald Trump deliberately tried to underestimate the severity of the coronavirus pandemic in public briefings, based on a series of interviews Woodward conducted with Trump between December and July. Also Wednesday, Democratic presidential nominee Joe Biden rolled out his “Made in America” tax policy, while campaigning in Michigan, which includes a proposed new offshoring penalty and a minimum 21% corporate tax on all foreign earnings, but a 10% tax credit for any companies making investments to create U.S. jobs, such as by revitalizing existing facilities that have been closed. Economic data showed that U.S. employers posted more job openings in July but hired fewer workers than in June, the Labor Department reported, as early-summer optimism about reopening businesses faded. There were 6.6 million job openings posted, not far off the pre-pandemic average. Which companies were in focus? Shares of Tesla Inc. TSLA, +1.89% charged 10.9% higher Wednesday after dropping 21.1% on Tuesday for its largest one-day drop since going public. Lululemon Athletica Inc. LULU, +2.52% shares fell 7.4% after the athletic apparel company late Tuesday reported results that beat Wall Street estimates. Slack Technologies Inc. WORK, +3.36% shares slid 13.9%, despite results late Tuesday that unexpectedly showed the collaboration software company broke even in its latest quarter. Shares of Tiffany & Co. TIF, +0.37% slumped 6.4% after LVMH Moet Hennessy MC, +1.15% said it wouldn’t be able to complete the previously announced takeover of the U.S. luxury goods retailer “as it stands.” LVMH cited a letter from the French government asking for a delay in light of the threat of tariffs on French products by the U.S., as well as Tiffany’s request to extend the deadline from Nov. 24 to Dec. 31. Snowflake Inc.outlined plans to raise up to $2.74 billion in its initial public offering, which includes orders from Berkshire Hathaway Inc. BRK.B, +0.24% BRK.B, +0.24% and Salesforce.com Inc. CRM, +2.21%, in a filing with the Securities and Exchange Commission late Tuesday. Walmart Inc. WMT, +1.00% shares rose 1% Tuesday after the retailer announced it was testing a drone delivery program. J.C. Penny Co. JCP, -2.53% has come closer to locking down buyers, The Wall Street Journal reported, noting that mall operators Simon Property Group SPG, -3.35% Brookfield Property Partners BPY, -0.72% and were set to buy the struggling retailer out of bankruptcy for about $800 million. How did other markets trade? The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% was up 2 basis point at 0.702% as investors prepared for a heavy week of supply that could push prices lower. Bond prices move inversely to yields. The ICE U.S. Dollar Index DXY, -0.58%, which tracks the performance of the greenback against its major rivals, was down 0.2% to 93.25, reversing earlier gains. Gold futures GCZ20, +2.17% rose 0.6% to settle at $1,954.90 an ounce. U.S. crude oil benchmark futures CL.1, -1.62% jumped 3.5% to end at $38.05 a barrel, while global benchmark Brent crude BRN.1, -0.07% gained 2.5% to settle at $40.79, putting it back over the key $40 a barrel threshold, despite questions about the demand outlook. The Stoxx Europe 600 index SXXP, +0.55% ended 1.6% higher, while the U.K.’s benchmark FTSE UKX, +0.64% gained 1.4%. In Asia, Hong Kong’s Hang Seng Index HSI, -0.30% fell 0.6% to close at 24,468.9, while Japan’s Nikkei NIK, -0.11%, settled at 23,032.5, down 1%. William Watts contributed reporting"}]}