{"article": [{"url": "https://www.marketwatch.com/story/we-cant-let-our-guard-down-scientists-say-some-children-simultaneously-tested-positive-for-covid-19-antibodies-and-coronavirus-2020-09-03", "published": 1599547820.0, "headline": "As schools reopen, scientists say some children could spread COVID-19 even if they already have the antibodies", "body": "As schools and colleges reopen across the country, scientists say social distancing remains a critical public-health response to COVID-19. New research released Thursday sheds more light on children who test positive for COVID-19, and the contagiousness of coronavirus. Children often remain asymptomatic or display very few symptoms, and the research also offers insights into the course of the disease at an important time for families and communities. A study published in the latest edition of the Journal of Pediatrics finds that the virus and antibodies can coexist in young patients. “With most viruses, when you start to detect antibodies, you won’t detect the virus anymore. But with COVID-19, we’re seeing both,” says Burak Bahar, lead author of the study and director of Laboratory Informatics at Children’s National Hospital in Washington, D.C. “This means children still have the potential to transmit the virus even if antibodies are detected.” “ ‘Children still have the potential to transmit the virus even if antibodies are detected.’ ” — Burak Bahar, director of Laboratory Informatics at Children’s National Hospital in Washington, D.C. The researchers reviewed an analysis of 6,369 children tested for SARS-CoV-2, the virus that causes COVID-19, and 215 patients who underwent antibody testing at Children’s National between March 2020 and June 2020. Out of these 215 young patients, 33 tested positive for both the virus and antibodies during the course of the disease. Nine of those 33 also showed presence of antibodies in their blood while also later testing positive for the virus. What’s more, researchers found that patients aged 6 years through 15 years old took a longer time (a median time of 32 days) to clear the virus, meaning that it had left their systems, versus patients aged 16 years through 22 years old (a median of 18 days). Females in the 6 to 15 age group also took longer to clear the virus than males: A median of 44 days for females versus 25.5 days for males. “We can’t let our guard down just because a child has antibodies or is no longer showing symptoms,” Bahar said. The study also found that 25 days was the median time from viral positivity to negativity — the moment when the virus can no longer be detected; it took 18 days to go from viral positivity to seropositivity — or the presence of antibodies in the blood — and it took 36 days to reach adequate levels of neutralizing antibodies. These “neutralizing antibodies” are important in potentially protecting a person from reinfection of the same virus, the researchers wrote. Four important caveats: Firstly, the study looked at a relatively small number of children. Secondly, the next phase of research will be to test whether coronavirus that is present along with the antibodies for the disease can be transmitted to other people. Thirdly, scientists need to explore whether antibodies correlate with immunity and, fourthly, they need to establish how long antibodies and potential protection from reinfection actually lasts. As such, Bahar reiterates the need for social distancing. Related:Dr. Fauci: It’s ‘conceivable’ we’ll know by November if a safe, effective vaccine is coming A separate study published last week in JAMA Pediatrics suggests that children can spread SARS-CoV-2, even if they never develop symptoms or even long after symptoms have cleared. It found a significant variation in how long children continued to “shed” the virus through their respiratory tract and, therefore, could potentially remain infectious. The researchers also found that the duration of COVID-19 symptoms also varied widely, from three days to nearly three weeks. “A recent systematic review estimated that 16% of children with SARS-CoV-2 infection are asymptomatic, but evidence suggests that as many as 45% of pediatric infections are asymptomatic,” according to the Centers for Disease Control and Prevention. “The signs and symptoms of COVID-19 in children are similar to other infections and noninfectious processes, including influenza, streptococcal pharyngitis, and allergic rhinitis. The lack of specificity of signs or symptoms and the significant proportion of asymptomatic infections make symptom-based screening for identification of SARS-CoV-2 in children particularly challenging.” “ A separate study in JAMA Pediatrics said children may spread SARS-CoV-2, even if they never develop symptoms or even long after symptoms have cleared. ” Under pressure from the teachers union to delay the start of the school year, New York City Mayor Bill de Blasio announced last week that in-person classes will be pushed back until Sept. 21, 11 days later than planned. Remote learning, also originally slated to start on Sept. 10, will now commence on Sept. 16. Other countries have not fared so well with school reopenings. Israel, which also reopened schools this week, experienced outbreaks when it reopened schools on May 17. Bahar also advised teachers and students to wear masks. To reduce the risk of spreading COVID-19, it may be preferable to use high-quality cloth or surgical masks that are of a plain design instead of face shields and masks equipped with exhale valves, according to an experiment published Wednesday by Physics of Fluids, a monthly peer-reviewed scientific journal covering fluid dynamics that was first established by the American Institute of Physics in 1958. COVID-19 has now killed at least 892,880 people worldwide, and 189,215 in the U.S., Johns Hopkins University says. As of Tuesday, the U.S. still has the world’s highest number of COVID-19 cases (6,301,320). Worldwide, there have been at least 27,351,624 confirmed cases, which mostly does not account for the number of asymptomatic cases. The Dow Jones Industrial Index DJIA, +0.56%, the S&P 500 SPX, +0.87% and the Nasdaq Composite COMP, +1.39% ended lower Friday. Doubts about traction for further fiscal stimulus from Washington may be one factor discouraging investors who have been betting on Republicans and Democrats striking a deal to offer additional relief to consumers and businesses. India has reported 4,280,422 COVID-19 cases, surpassing Brazil (with 4,147,794) as the country with the second highest number of coronavirus cases in the world behind the U.S. India has a rate of COVID-related death per 100,000 people of 5.3 and a case-fatality rate of 1.7%. In contrast, the U.S. has a fatality rate of 57.7 per 100,000 people and a case-fatality rate of 3%."}]}