{"article": [{"url": "https://www.marketwatch.com/story/heres-what-you-need-to-know-about-clinical-trials-as-drug-makers-push-forward-with-coronavirus-vaccine-studies-2020-09-11", "published": 1600150880.0, "headline": "Here's what you need to know about clinical trials as drug makers push forward with coronavirus vaccine studies", "body": "Whether you're new to investing in pharmaceutical or biotechnology companies or simply paying close attention to the race to develop a COVID-19 vaccine, questions may have occurred about how clinical trials work - here's what you need to know to understand the process. The first thing is that we've never seen vaccines developed as quickly as what is happening right now. It took a year and a half to develop a Zika vaccine, four years for a mumps vaccine, and 10 years for a flu vaccine. The COVID-19 vaccines being developed by AstraZeneca AZN, +1.16% AZN, +0.63%  and the University of Oxford, BioNTech BNTX, +1.23%  and Pfizer Inc. PFE, -0.27%, and Moderna Inc. MRNA, +0.09%  are well into Phase 3 clinical trials in the U.S., with the makers of all three claiming it's possible to have clinical data from the late-stage studies for their vaccine candidates during this calendar year. It's been nine months since Chinese authorities first notified world health officials about the presence of the virus. What each clinical-trial phase means Preclinical studies: These are studies that test how a drug or vaccine fares in animals, often macaques, a kind of monkey, or mice. These studies are traditionally performed before a therapy or vaccine moves into clinical trials with humans; however, in the pandemic, some preclinical trials for COVID-19 vaccines have been conducted concurrently with Phase 1 trials. \"I don't think proving this in an animal model is on the critical path to getting this to a clinical trial,\" Dr. Tal Zaks, Moderna's chief medical officer, told Stat News in March. Phase 1 clinical trial: These are small studies designed to evaluate the safety and efficacy of a drug or vaccine in healthy adults. In the case of the COVID-19 vaccine candidates, this means fewer than 200 people were enrolled in the early-stage studies in the U.S., including ones conducted by BioNTech and Pfizer, Inovio Pharmaceuticals Inc. INO, -1.36%, and Moderna Inc. Inovio's early-stage study enrolled 40 people. These trials focus on safety; assess immunogenicity, which is the ability to generate an immune response; and help researchers better understand the correct dosing amount. (Based on the Phase 1 findings, for example, BioNTech and Pfizer plan to advance a two-dose regimen of 30 micrograms of their candidate, BNT162b2, into the Phase 2/3â\u0080\u0082trial.) Phase 2 clinical trial: The midstage studies also assess dosing amounts and enroll hundreds of participants. In some cases, the trials overlap, such as Novavax Inc.'s NVAX, +0.18%  Phase 1/2â\u0080\u0082study for its experimental COVID-19 vaccine, which has enrolled 131 healthy adults between the ages of 18 and 59. (The first two phases of the study are being conducted in Australia, but the late-stage trial is expected to be conducted in the U.S.) \"This phase includes studies that may provide additional information on common short-term side effects and how the size of the dose relates to immune response,\" the Food and Drug Administration has stated in public documents. It's common for phases to overlap, said Dr. Henry Miller, a former FDA official. \"Phase 1 merges almost imperceptibly into Phase 2 very often,\" he said. Phase 3 clinical trial: This is the crucial phase. The goal is to enroll thousands of people, to better evaluate how a vaccine candidate performs in a significantly larger patient population. AstraZeneca, BioNTech, Pfizer and Moderna have all committed to enrolling up to 30,000 participants in their late-stage trials. \"Phase 3 is the final and most important phase where the vaccine candidate is tested in the field, if you will,\" said Dr. Howard Koh, professor of public health leadership at the Harvard T.H. Chan School of Public Health and a former U.S. health official. Postmarketing surveillance: In short, this is a way to track the product's effectiveness as well as any potential side effects once it is distributed in the real world. \"Monitoring is essential for two reasons,\" the FDA has said. \"First, even large clinical trials may not be big enough to reveal side effects that do not happen very often. ... Second, vaccine trials may not include groups (including pregnant women or older adults) who might have different types of side effects or who might have a higher risk of side effects than the volunteers who got the vaccine during clinical trials.\"Other terms and distinction you should be aware of What is an adverse event? These are negative reactions or side effects to drugs or vaccines being tested. In vaccines, adverse events usually crop up within two months of dosing, according to Sept. 10 remarks by Dr. Peter Marks, director of the FDA's Center for Biologics Evaluation and Research. An adverse event recently caused AstraZeneca to halt the Phase 3 study of its vaccine candidate, citing a \"potentially unexplained illness\" in one of the trial's participants. According to RBC Capital Markets analyst Brian Abrahams, the participant in the study whose health triggered the hold reportedly was diagnosed with transverse myelitis, a rare spinal disorder potentially associated with vaccines. (AstraZeneca has not confirmed the type of illness, which was first reported by the New York Times.) \"It's important to point out that that's the reason why you have various phases of trials, to determine if, in fact, these candidates are safe,\" Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, told \"CBS This Morning\" on Wednesday. \"This particular candidate from the AstraZeneca company had a serious adverse event, which means you put the rest of the enrollment of individual volunteers on hold until you can work out precisely what went on ... [and] then you proceed cautiously as you go forward, making sure you're on the alert for this type of an adverse event.\" Another concern is that experimental vaccines that have been tested in the past to protect against infections with SARS and dengue fever have caused an enhanced version of the disease in some people who have been vaccinated. This has not been reported in any of the COVID-19 vaccines being tested. Common but less concerning side effects often include pain in the area where the vaccine is injected into the body, as well as fatigue and fever. What's the difference between an emergency-use authorization and an approval? EUAs, as emergency-use authorizations are commonly known, are the primary way that the FDA is handling regulatory authorization of medical products used to prevent or treat infections caused by the coronavirus under authority granted during the U.S. public health emergency. However, an EUA is no longer valid once the U.S. government declares that the emergency is over. That's why some drug makers have said they would pursue full FDA approval for their COVID-19 vaccines and treatments following emergency authorization. Gilead Sciences Inc. GILD, +0.82%, which received an EUA for its COVID-19 treatment remdesivir on May 1, formally filed for full FDA approval on Aug. 10 for remdesivir. Some public health experts have warned, however, that, when it comes to vaccines, the limitations of the EUA process may be misunderstood by the public. \"Such an approach should only be used cautiously for COVID-19 vaccines because the public may perceive an EUA as the same as approval,\" experts from Georgetown, Johns Hopkins and Penn wrote in a JAMA viewpoint in July. \"If a vaccine used under EUA were to encounter safety problems, be ineffective, or be perceived as experimentation without consent, the FDA will be challenged about why the agency did not wait for more data before wide vaccine release, and trust in all vaccines may be seriously compromised.\" The FDA issued guidance in June that recommends COVID-19 vaccines meet a threshold of being effective 50% of the time, which would make a coronavirus vaccine similar in effectiveness to a flu vaccine and not a sure shot like the measles vaccine, which provides protection more than 95% of the time, said Mizuho Securities managing director Difei Yang. What's the difference between a preprint and peer-reviewed medical study? How clinical-trial data for vaccines are being shared with the public is changing radically during the pandemic. Reporters, including those at Stat News, have broken stories citing anonymous sources about COVID-19 trials. Preprint servers, like BioRxiv and MedRxiv, which have been in operation for less than two years, have published thousands of pieces of research about the virus in recent months. \"What we've seen during the pandemic is a lot of preprints and news releases,\" FDA commissioner Dr. Stephen Hahn has said. \"We can't make a decision based upon a preprint or a press release.\" There is also no standard for how companies release information. Some have published news releases and others have published preprints, though most aim to eventually publish research in peer-reviewed medical journals like the Lancet or the New England Journal of Medicine. (Some journals are also publishing preprints.) \"I ask investors to be patient,\" Yang said. \"Don't jump the gun just because we see a new piece of data.\" What are neutralizing antibodies, and why are they different from the T-cell response? Analysts caution against apples-to-apple comparisons for clinical data from different vaccine candidates. However, there are two points of interest: neutralizing antibody titers, which can demonstrate immunity against future infections and are measured against antibody levels tracked in the plasma of patients who have recovered from COVID-19, and T-cell response, which is believed to help prevent disease in the long term, according to a recent note published by RBC."}]}