{"article": [{"url": "https://www.marketwatch.com/story/trump-leads-july-fundraising-but-biden-has-closed-the-gap-2020-08-05", "published": 1596669800.0, "headline": "Trump leads July fundraising, but Biden has closed the gap", "body": "WASHINGTON — President Donald Trump took in $165 million for his reelection effort in the month of July, a sum that surpasses what his Democratic rival, Joe Biden, raised during the same period. But a massive cash-on-hand advantage that once gave the Republican a significant competitive edge has largely been closed, with Biden and the Democratic Party reporting that they are just $6 million shy of the $300 million that the president and the Republican National Committee have banked. The money puts the two on a virtually even footing that will allow both to saturate the airwaves with advertising, fund get-out-the-vote efforts and mobilize supporters — even if it has to be done virtually in many cases due to the coronavirus. The sums also suggest that even in the midst of a pandemic that has curtailed conventional campaign activities, Trump has continued to spend at a vigorous pace while Biden has cut expenses and stockpiled cash. Trump’s large haul was welcomed by his campaign, which had been bested in fundraising by Biden, the former vice president, over the past two months. His advisers said they didn’t just beat Biden — they boasted that they’ve raised a staggering $1.1 billion this cycle. “The president’s support continues to increase while Joe Biden just posted a down fundraising month from his basement,” campaign manager Bill Stepien said, referring to the basement studio where Biden has been attending many of his digital-only campaign events. Campaigns often tout small contributions from grassroots donors as a sign of enthusiasm and Biden’s campaign is no exception. They claim support from ordinary people has swelled and point to an average online contribution of $34.77 as proof. Campaign manager Jen O’Malley Dillion called it a “lights-out fundraising month” and said the money will help Democrats build support “to defeat Donald Trump this fall and win the battle for the soul of our nation.” The fundraising totals include donations collected by each candidate, national political parties and a series of joint fundraising committees both contenders have set up in conjunction with their parties. These financial arrangements allow donors to contribute six-figure sums."}]}