{"article": [{"url": "https://www.marketwatch.com/story/heres-the-big-secret-of-how-the-richest-americans-made-their-wealth-2020-09-15", "published": 1600186100.0, "headline": "Here's the big secret of how the richest Americans made their wealth", "body": "Don't look to the richest Americans for investment advice. That's the conclusion I draw from the latest edition of the Forbes 400 list of richest Americans, which was released earlier this month. Over the past year, the wealthiest Americans on balance did not do as well with their investments as the S&P 500 SPX, +0.87%  . In fact, they didn't even do as well as a standard 60/40 portfolio of stock- and bond index funds. This puts in a different light the $240 billion by which the richest Americans became richer over the last year. Some commentators have made a big deal out of this big increase coming while much of the U.S. economy is struggling from the pandemic. But in percentage terms this increase amounts to 8.1%, which is not as good as the stock market. Between September 6, 2019 and July 24, 2020, the dates on which Forbes calculated their 2019 and 2020 lists, the S&P 500 (with dividends reinvested) gained 9.8%. A 60% stock/40% bond portfolio that invested the fixed-income portion in the Vanguard Total Bond Market Index Fund VBMFX,  would have made 8.8% over this period. (See chart below.) “ The rich view the stock market primarily as a vehicle for preserving the purchasing power of their already-amassed fortunes. ” So there's nothing particularly noteworthy that these richest Americans did to increase their net worth over the past year. The disconnect that commentators should be focusing on is between the U.S. economy and the stock market, rather than with the super wealthy in particular. Nor is it a fluke that these richest Americans didn't beat the market. According to my calculations, the same has been true in each of several previous years as well: Increase over previous year of the combined wealth of those on the Forbes 400 list Comparable gain of S&P 500 Forbes 2020 list 8.1% 9.8% Forbes 2019 list 2.2% 3.7% Forbes 2018 list 7.0% 14.8% Forbes 2017 list 12.5% 14.4% Are you surprised by these results? You will be only if you make the mistake of thinking that these richest Americans acquired their wealth on Wall Street. But my analysis of the Forbes 400 lists over the years reveals that almost all of them made their fortunes either through starting a company that eventually made it big or through inheritance. As far as I can tell, the rich view the stock market primarily as a vehicle for preserving the purchasing power of their already-amassed fortunes rather than for creating those fortunes in the first place. Warren Buffett of Berkshire Hathaway BRK.A, +0.06%  BRK.B, +0.24%  is an exception, of course. But his investment return is so much better than anyone else's that I consider him the exception that proves the rule. So keep these results in mind the next time your eye is drawn to a headline touting the investment secrets of the super wealthy. To the extent they have a secret, it is that you should log off your day-trading app, get up out of your chair, and go create something that the world wants and needs. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com More:Should I still use the 60/40 investing rule for retirement? Plus:Do you really need $8 million saved up for retirement?"}]}