{"article": [{"url": "https://www.marketwatch.com/story/trump-blasts-biden-in-his-pennsylvania-hometown-hours-before-former-vp-accepts-democratic-nomination-for-president-2020-08-20", "published": 1597940180.0, "headline": "Trump blasts Biden in his Pennsylvania hometown hours before former V.P. accepts Democratic nomination for president", "body": "President Donald Trump attacked Joe Biden in a speech Thursday just outside his Pennsylvania birthplace, blasting his rival hours before he was to accept the Democratic nomination for president. “Joe Biden is a puppet of the radical left movement that seeks to destroy the American way of life,” said Trump in Old Forge, Pa., which is just outside Biden’s hometown of Scranton. Now see:Joe Biden to give speech of a lifetime as he accepts Democratic presidential nomination. Trump’s visit to Pennsylvania capped a week of visits to four battleground states, in which he is polling behind the Democratic nominee. Surveys of swing-state voters as well as betting markets have Trump behind Biden in the race for the White House. Trump’s strategy is to blast Biden as beholden to the far left of the Democratic Party, and in his speech he noted Pennsylvania is a fracking state and charged Biden would use tax increases to fund the “Green New Deal.” Biden has not fully embraced that plan to fight climate change and says he’d ban fracking for oil and gas production only on federal lands. Biden’s acceptance speech on Thursday night will conclude the Democrats’ four-day convention, which this year was almost entirely virtual due to coronavirus health concerns. Republicans will renominate Trump next week in much the same format. Trump plans to speak Aug. 27 from the White House. Also read:Why stock-market investors are bracing for the ‘most litigated’ election in U.S. history. Shortly before Trump was scheduled to leave for Pennsylvania, his former adviser Steve Bannon was arrested on charges that he and three others ripped off donors to an online fundraising scheme “We Build The Wall.” Trump told reporters that he felt “very badly” but hadn’t “been dealing with [Bannon] for a very long period of time, haven’t been dealing with him at all.” Separately, a federal judge rejected Trump’s latest effort to block the Manhattan district attorney from obtaining his tax returns. Trump’s lawyers quickly appealed. The Associated Press contributed to this story. Sign up for Trump Today and more MarketWatch newsletters."}]}