{"article": [{"url": "https://www.marketwatch.com/story/how-to-build-an-investment-portfolio-that-supports-racial-justice-2020-06-29", "published": 1593420380.0, "headline": "How to build an investment portfolio that supports racial justice", "body": "In the wake of widespread outrage and protests about racial injustice, many people are looking at their stock portfolio and wondering: what can I do to support racial justice with my dollars? If you are an investor of any type — whether you have a 401(k), IRA, or trading account — there are a few things you could do to promote racial equity. ESG investing: the basics You may have heard of ESG investing, which stands for “environmental, social and governance.” It is also often called sustainable, socially responsible or simply “values” investing. It’s an investment strategy that selects stocks and bonds based not only on traditional financial criteria, but also based on the impact of different companies on society and the environment. Proponents of ESG investing point to a growing body of evidence that suggests sustainable investing may actually improve a portfolio’s performance, while also serving the greater good. Over the past five years, sustainable funds have outperformed their conventional peers in both up and down markets, according to a Morningstar report. Also, as markets tumbled during the first quarter of 2020, almost 60% of the biggest U.S. sustainable mutual funds and exchange-traded funds lost less in market value than the S&P 500. The popularity of socially responsible investing has exploded in recent years. In early 2020, around 74% of global investors said they plan to increase their ESG allocation over the next year. In the first quarter of 2020, U.S., sustainable funds saw inflows of $10.5 billion, according to Morningstar — a more than 10-fold increase from the first quarter of 2010. And even as markets tumbled due to the coronavirus crisis, global demand for ESG proved resilient. The global sustainable-fund universe saw inflows of over $45 billion in the first quarter, while the overall fund universe saw outflows of more than $380 billion, according to Morningstar. The challenges of measuring social impact What exactly goes into an ESG portfolio? Environmental factors often include things like carbon emissions and water usage. Social impact may involve working conditions for a company’s employees and gender or racial equity. And governance criteria often have to do with board oversight and transparency. In light of recent events, the “S” — or social — part of ESG has come into focus, as more and more people are looking at the social impact of large corporations, specifically from a racial justice standpoint. That’s where things get a little tricky. There are more than 300 funds marketed as ESG in the U.S., according to Morningstar. But there’s no official definition of “socially responsible” investing. To further complicate the issue, there are dozens of different companies that issue ESG ratings, ranging from large data providers, like MSCI and Sustainalytics, to smaller companies and even nonprofits that focus on topics like gender-pay equity and civil liberties. Unlike accounting standards, there is not one unique methodology. Some of the data is self-reported by the companies, and some of it is done by third parties, who are often estimating. There are of course some broad principles, like how the company treats its workers — but these are often hard to quantify. For example, companies can get a high score for having anti-harassment policies in place, without tracking how well the policies are actually implemented. “There are not yet clear apple-to-apple comparisons across the board even for public companies, let alone private companies,” said Andrei Cherny, CEO of Aspiration, an online “financial firm with a conscience,” which offers a variety of banking and investing products focused on environmental and social impact. Cherny has called for regulators to require public companies to report ESG-related data, such as carbon emissions, diversity of their workforce, and how they pay their employees — just like they have legal obligations to report their financial performance. “Those are factors that investors need to know just as much as they need to know the price-to-earnings ratio,” he said. Other industry leaders echo Cherny’s thoughts. For instance, in the wake of recent events, Calvert Research & Management, a prominent sustainable-investing shop, called for companies to “accurately assess their racial diversity” and make it public, provide pay equity disclosure across race and gender, and publicly state what they are doing to combat racism and police brutality. Meanwhile, some asset managers have decided to influence change from the inside. Neuberger Berman, which manages $330 billion, decided to use its shareholder status to drive governance and sustainability practices. In April 2020, the company announced that it would publicly disclose and explain the firm’s voting rationale and intentions at more than 25 key annual shareholder meetings. “Normally shareholders vote quietly behind the scenes,” said Jonathan Bailey, Head of ESG at Neuberger Berman. Instead, by providing advance vote disclosure, Neuberger Berman intends to educate investors and the public on “why we’re voting a particular way,” Bailey said. For example, ahead of Marriott International’s MAR, -0.96% May 8 shareholder meeting, Neuberger Berman announced it intended to vote in favor of a proposal to enhance diversity reporting, along with an explanation of why that could affect the company’s financial performance. “We have a responsibility, as market participants, to take [these issues] seriously; they’re financially material issues,” Bailey said. The proposal did not end up passing, as it gathered about 30% shareholder support, according to a Neuberger Berman spokesperson. Niche products focusing on racial justice While there are currently no industry-wide standards around social impact, a few companies have launched niche products specifically targeted at race and equality. For example, OpenInvest, a company that builds indexes and other investing tools around social causes, has created an index specifically on racial justice. It screens for metrics like board member inclusion, workforce diversity and which companies pollute the most in communities of color. Similarly, Impact Shares, a nonprofit provider of exchange-traded funds, partnered with the NAACP to launch a first-of-its-kind racial empowerment ETF. But what the ESG industry has been missing is that “your social priorities may be drastically different from my social priorities,” said Ethan Powell, CEO of Impact Shares. For example, some ESG funds hold shares of liquor or gaming companies. These holdings might be a problem for some investors, but not others. Powell envisions a future where “effectively every social issue will be reflected with a separately investible fund,” so that investors can create portfolios that are reflective of their individual social priorities. Partnering with nonprofits could play a key role in the development of such products, according to Powell, because social-advocacy organizations are in a better position to understand the particular social issues at hand. What many experts agree on is that growing investor demand will inevitably push the industry to innovate. Years ago socially-responsible investing offered just a few options to cover a small piece of investors’ stock portfolios. Today, there are hundreds of different mutual and exchange-traded funds to pick from, not just in equities but also in fixed income and even junk bonds. One study showed that around $12 trillion of assets in the U.S. are managed under some sustainable investing strategy. So while you wait for the industry to establish widely-accepted standards, you could start building your own socially-responsible portfolio by looking at the ratings and methodology of different funds and companies and picking what aligns best with your values and financial goals."}]}