{"article": [{"url": "https://www.marketwatch.com/story/the-extra-600-americans-get-in-weekly-unemployment-benefits-ends-next-month-heres-what-lawmakers-are-proposing-to-replace-it-2020-06-09", "published": 1595498360.0, "headline": "The extra $600 Americans get in weekly unemployment benefits ends this month â\u0080\u0094 how lawmakers are proposing to replace it", "body": "Americans who have been laid off from their jobs because of the coronavirus pandemic have been able to collect an additional $600 a week in unemployment benefits on top of what they get from their state. That extra relief was part of the $2.2 trillion stimulus package known as the CARES Act. But if lawmakers fail to act by the end of this month, Americans who are out of work will see that $600 a week disappear from their unemployment checks. That could strip more than 20 million Americans of nearly $842 billion to spend, according to data released by the Bureau of Economic Analysis, a U.S. government agency that provides official macroeconomic and industry statistics. The supplemental $600 Americans receive has been controversial, especially given that two-thirds of laid-off workers receive more money from their unemployment benefits than they did from their jobs. But at the same time, proponents of the extra $600 say that decreasing those benefits could cost the country even more jobs. As lawmakers consider a new round of stimulus funding, there are four major proposals on the table on how to replace the extra $600, two of which would allow unemployed Americans to receive additional funds on top of state unemployment benefits. Another calls for capping the benefits at the amount equivalent to a workerâ\u0080\u0099s prior wages. One calls for just the opposite of unemployment benefits â\u0080\u0094 a return-to-work bonus. As the July 31 deadline approaches, Senate Republicans hinted at a temporary resolution to buy lawmakers more time ahead of their August recess.Temporarily extend the extra $600 through August Senate Republicans indicated Wednesday that discussions were taking place to keep the status quo with unemployment benefits through August. â\u0080\u009cItâ\u0080\u0099s still in the mix and the discussions come down to both the duration, how long and at what price point,â\u0080\u009d said Sen. John Barrasso, a Republican from Wyoming, on Wednesday. Ohio Republican Sen. Rob Portman confirmed that, but urged lawmakers to work on finishing â\u0080\u009cthe entire [stimulus] packageâ\u0080\u009d by the end of the week rather than implementing temporary fixes. â\u0080\u009cIf we canâ\u0080\u0099t get it all done by next week we canâ\u0080\u0099t allow there to be a cliff in unemployment insurance,â\u0080\u009d he said. White House Chief of Staff Mark Meadows echoed Portmanâ\u0080\u0099s views, saying that â\u0080\u009chaving some short term of [unemployment insurance] just to allow for longer negotiation is certainly not worthy of consideration,â\u0080\u009d Politco reporter Jake Sherman tweeted Wednesday evening. Unemployment benefits equal to a workerâ\u0080\u0099s previous wages Treasury Secretary Steven Mnuchin said he supports a new stimulus package that would provide â\u0080\u009cno more than 100%â\u0080\u009d of jobless workersâ\u0080\u0099 former wages. â\u0080\u009cEnhanced unemployment is intended for people who donâ\u0080\u0099t have jobs, particularly in industries that are harder to rebound, so we will not be doing it in the same way,â\u0080\u009d Mnuchin said on CNBC on last week. Mnuchin added that he had a â\u0080\u009cproductive callâ\u0080\u009d with Senate Majority Leader Mitch McConnell regarding another stimulus package, which could include another round of direct payments checks. Like Mnuchin, President Donald Trump has said heâ\u0080\u0099s against extending the $600 past July, saying that it gives Americans â\u0080\u009ca disincentive to work.â\u0080\u009d However, Trump said Tuesday that those benefits wonâ\u0080\u0099t go away completely. He said he was against the original decision to offer an additional $600 in federal benefits to unemployed Americans on top of their state benefits, adding that â\u0080\u009cit still worked out well because it gave people a lifeline.â\u0080\u009d â\u0080\u009cNow weâ\u0080\u0099re doing it again,â\u0080\u009d he said. â\u0080\u009cTheyâ\u0080\u0099re thinking about doing 70% of the amount.â\u0080\u009d Itâ\u0080\u0099s unclear whether Trump meant extra benefits could drop to $420 extra a week on top of state unemployment benefits, or if the benefits would be equal to 70% of a personâ\u0080\u0099s prior income.Extending the supplemental $600 through Jan 2021 In May, the Democratic-run House passed the $3 trillion HEROS Act, which would, among other things, extend the extra $600 federal unemployment benefit to January 2021. The Congressional Budget Office found that if these benefits were extended through January 2021, an estimated five of every six recipients would receive more in benefits than they would from working those six months. “ If these benefits were extended through January 2021, five of every six recipients would receive more in benefits than they would from working those six months, according to the Congressional Budget Office. ” â\u0080\u009cIf the benefit of $600 per week was extended, fewer than one in thirty recipients would receive benefits â\u0080\u0094 generally the maximum amount in their state â\u0080\u0094 that were less than 50% of their potential earnings,â\u0080\u009d the CBO report states. Some have argued those generous benefits will keep people from seeking new jobs. But extending the $600 unemployment benefit would mean that Americans would have more money to spend in stores, and that could ultimately lead to lower unemployment, Heidi Shierholz, an economist at the Economic Policy Institute, a left-leaning think-tank based in Washington, D.C., said. â\u0080\u009cItâ\u0080\u0099s not true that thereâ\u0080\u0099s a pool of jobs out there that people would fill if they werenâ\u0080\u0099t receiving unemployment benefits,â\u0080\u009d she said. Related: â\u0080\u0098We are saving every penny we canâ\u0080\u0099: What life could look like for this 66-year-old man when he loses all his unemployment benefits next month For every dollar spent on unemployment insurance, thereâ\u0080\u0099s a multiplier effect leading to a 1.64 increase in GDP, according to a 2008 study published by Mark Zandi, chief economist at Moodyâ\u0080\u0099s Analytics MCO, +0.88%. Meanwhile, for every dollar spent on infrastructure projects, U.S. GDP could be expected to increase by a multiple of 1.59. McConnell said in May that the HEROS Act â\u0080\u009creads like the speaker of the House pasted together random ideas from her most liberal members and slapped the word â\u0080\u0098coronavirusâ\u0080\u0099 on top of it.â\u0080\u009d He also referred to it as a Democratic â\u0080\u009cwish-list.â\u0080\u009d A sliding scale of unemployment benefits tied to state unemployment rates Unlike the HEROS Act, one Democratic proposal which has bicameral support calls for additional unemployment benefits that are tied to state unemployment rates. The proposal, introduced by Senate Minority Leader Chuck Schumer and Oregon Sen. Ron Wyden in early July would extend the $600 unemployment benefit â\u0080\u009cuntil a stateâ\u0080\u0099s three-month average total unemployment level falls below 11%.â\u0080\u009d â\u0080\u009cOnce the unemployment rate falls below 11%, the benefit amount reduces by $100 for each percentage point decrease in a stateâ\u0080\u0099s unemployment rate,â\u0080\u009d the proposal states. These enhancements would remain in place until March 2021. For instance, beneficiaries in a state with an unemployment rate between 7% to 8% would receive an additional $200 a week on top of their stateâ\u0080\u0099s unemployment benefits. Schumer and Wydenâ\u0080\u0099s proposal shares similarities with a separate proposal Rep. Don Beyer, a Virginia Democrat, introduced last month. That proposal garnered support from Former Federal Reserve Chairmen Ben Bernanke and Janet Yellen. The main difference between the two is that Beyerâ\u0080\u0099s would allow Americans to continue to receive the additional $600 benefit for as long as the national emergency or state emergency for COVID-19, the disease caused by the novel coronavirus, is in effect. Once the national or state emergency is terminated, jobless Americans would receive benefits based on their stateâ\u0080\u0099s unemployment level. “ â\u0080\u0098We continue to push for inclusion of automatic stabilizers in relief legislation, and I feel it is a top priority because it would help to prevent some of the political obstruction that unnecessarily prolonged the Great Recession.â\u0080\u0099 ” â\u0080\u0094 Rep. Don Beyer, a Virginia Democrat and sponsor of the Worker Relief and Security Act â\u0080\u009cWe continue to push for inclusion of automatic stabilizers in relief legislation, and I feel it is a top priority because it would help to prevent some of the political obstruction that unnecessarily prolonged the Great Recession,â\u0080\u009d Beyer, who supports the Schumer-Wyden proposal, told MarketWatch. Proposals that tie unemployment benefits to a statesâ\u0080\u0099 unemployment rate are the most logical, said Michele Evermore, a senior policy analyst at the National Employment Law Project, an advocacy organization focused on workersâ\u0080\u0099 rights. “ â\u0080\u0098Unemployment benefits should always be pegged to economic conditions.â\u0080\u0099 ” â\u0080\u0094 Michele Evermore, a senior policy analyst at the National Employment Law Project â\u0080\u009cUnemployment benefits should always be pegged to economic conditions,â\u0080\u009d she said. When the CARES Act passed in March, the economic impacts of coronavirus â\u0080\u009cdidnâ\u0080\u0099t seem like it would go on as long as it has or be as bad as it is.â\u0080\u009d So at that time, it seemed reasonable to provide the additional $600 through July. But even though 2.5 million workers went back to work last month, more than 21 million Americans are out of work, which is a sign that additional support is needed, Evermore said.A return-to-work bonus The most recent unemployment report was surprisingly positive and showed that 4.8 million Americans had gone back to work â\u0080\u0094 a sign that there are more job openings as states reopen parts of their economy. Extending the $600 weekly benefit past July would disincentive Americans from returning to work if they receive more money from remaining unemployed, says Portman. Heâ\u0080\u0099s proposing a back-to-work bonus, which would provide an additional $450 a week for Americans who return to work. â\u0080\u009cNot only is the return-to-work bonus proposal the right policy in terms of incentivizing people to safely return to work and allowing businesses to reopen, but it could also benefit the American taxpayer through significant cost savings compared to the current money weâ\u0080\u0099re spending on the CARES Act unemployment benefits,â\u0080\u009d Portman said in a statement to MarketWatch. “ â\u0080\u0098We need to be sure that thereâ\u0080\u0099s no financial disincentive for these individuals to get back into the workforce when those jobs become available to them again.â\u0080\u0099 ” â\u0080\u0094 Sen. Rob Portman, a Republican from Ohio â\u0080\u009cMoving forward, it is critical that we have a workforce thatâ\u0080\u0099s ready to step into their old jobs or newly available jobs now that the economy is safely reopening,â\u0080\u009d Portman said previously. â\u0080\u009cGiven that more than 15 million unemployed Americans are categorized as â\u0080\u0098temporary layoffs,â\u0080\u0099 we need to be sure that thereâ\u0080\u0099s no financial disincentive for these individuals to get back into the workforce when those jobs become available to them again.â\u0080\u009d National Economic Council Director Larry Kudlow has said that the Trump administration is looking â\u0080\u009cvery carefullyâ\u0080\u009d at Portmanâ\u0080\u0099s proposal, which Portman said he plans to introduce more formally this week. Beyer said this proposal â\u0080\u009cinherently misunderstands the root cause of unemployment: a deadly pandemic, and also fails to look ahead to the looming demand crunch which will fuel new rounds of job cuts.â\u0080\u009d The return-to-work bonus could end up incentivizing people to take â\u0080\u009cthe wrong jobs,â\u0080\u009d Evermore said. â\u0080\u009cPeople will take the first job they get,â\u0080\u009d she said, which could mean settling for a job that pays less or one for which theyâ\u0080\u0099re overqualified. This story was updated on July 22, 2020."}]}