{"article": [{"url": "https://www.marketwatch.com/story/low-information-investors-rule-the-stock-market-at-least-until-they-lose-every-cent-2020-06-11", "published": 1592035100.0, "headline": "Low-information â\u0080\u0098investorsâ\u0080\u0099 rule the stock market â\u0080\u0094 at least until they lose every cent", "body": "In 1929, the story goes, Joseph P. Kennedy, patriarch of the Kennedy clan, went for a shoeshine not far from his Wall Street office. Kennedy was stunned when the shoeshine man gave stock tips to him, a leading trader. He immediately returned to his office and aggressively short-sold stocks, making a fortune in the Great Crash. This is probably an apocryphal tale that points to a larger truth: When even shoeshine men are so confident in their bullishness they give stock tips to the pros, itâ\u0080\u0099s time to run for the hills. This week weâ\u0080\u0099ve seen plenty of signs of this. As the Nasdaq Composite COMP, +1.39% Â hit all-time highs, briefly closing above 10,000 (nearly double its bubble top from the year 2000), and the Dow Jones Industrial Average DJIA, +0.56% Â and S&P 500 SPX, +0.87% Â both came within shouting distance of their February record peaks, day traders and newbies emerged, proclaiming their stock-picking genius. This testosterone-driven overconfidence â\u0080\u0094 and research shows men are more reckless investors than women â\u0080\u0094 has been most pronounced on Robinhood, the commission-free stock trading app preferred by millennials who can make all the trades they want at the tap of their thumbs. The tale of Robinhood According to Crunchbase, the Menlo Park, Calif.-based brokerage has raised $1.2 billion altogether. On the strength of three million new customers in the first quarter, it just raised $280 million in a late funding round led by Silicon Valley heavyweight Sequoia Capital. Robinhood has more than 10 million customers whose average age is 31. It has been having an outsized impact on stock trading. An analyst at Deutsche Bank recently examined Robinhood trading data and found that small investors were behind much of the recent buying in the stock market, so that what we used to call the â\u0080\u009csmart moneyâ\u0080\u009d is â\u0080\u009cnow chasingâ\u0080\u009d the day traders. Talk about the caboose pulling the train! Gone are the days of COVID-19 lockdowns and fears of bodies piling up in emergency rooms. Long forgotten are the 40 million unemployed Americans, the 40% of businesses that may not reopen and the â\u0080\u009clong roadâ\u0080\u009d to recovery that a gloomy Federal Reserve Chairman Jerome Powell laid out in his news conference Wednesday. And donâ\u0080\u0099t even think about the new wave of coronavirus cases and hospitalizations weâ\u0080\u0099re seeing in at least a dozen U.S. states. Oh, no, instead the day traders are sampling and remixing those hits of the 1930s, â\u0080\u009cWeâ\u0080\u0099re in the Moneyâ\u0080\u009d and â\u0080\u009cHappy Days Are Here Again.â\u0080\u009d And these mini-Masters of the Universe arenâ\u0080\u0099t just buying the Apples AAPL, +1.74% Â and Teslas TSLA, +1.89% Â of the world; theyâ\u0080\u0099re gobbling up stocks of bankrupt companies like Hertz HTZ, -1.78% Â and those whose businesses are in deep trouble, like American Airlines Group AAL, +0.34%. Both of those stocks and others beaten down badly in the coronavirus bear market have rallied sharply over the past few weeks.Better than Buffett? No doubt these very astute people have done deep dives into balance sheets, loan covenants and capital structures the way distressed debt and deep value investors do to make sure theyâ\u0080\u0099re protected on the downside. Oh, wait. Screw the guardrails. Damn the torpedoes. Traders on Robinhood and other instant-trading platforms are wagering hundreds maybe a few thousand bucks at a time and are beating the pants off the pros. One leading day trader whoâ\u0080\u0099s particularly proud of himself is Dave Portnoy, the successful founder of Barstool Sports, who thinks his prowess over the last, oh, six weeks or so, has made him better than â\u0080¦ Warren Buffett. â\u0080\u009cIâ\u0080\u0099m the new breed. Iâ\u0080\u0099m the new generation,â\u0080\u009d he crowed. â\u0080\u009cThereâ\u0080\u0099s nobody who can argue that Warren Buffett is better at the stock market than I am right now. Iâ\u0080\u0099m better than he is. Thatâ\u0080\u0099s a fact.â\u0080\u009d This column has recently taken Buffett to task for his performance over the past decade. Three of his recent investments lost at least $7 billion, and he clearly sold airline stocks at the bottom. But really, Dave, really? He sounds like heâ\u0080\u0099s auditioning to host a revival of â\u0080\u009cThe Apprentice.â\u0080\u009d The day trading is definitely a sign of the times. As Anthony Denier, CEO of trading platform Webull, told the New York Post: â\u0080\u009cWeâ\u0080\u0099re all home. Some people are making bread, and some are saying, â\u0080\u0098Hey, how can I make the stock market work for me?â\u0080\u0099 And with the Fed [pumping money] into the markets, theyâ\u0080\u0099re thinking â\u0080\u0098How can I lose?â\u0080\u0099 â\u0080\u009d How? Let me count the ways, starting with today, with the Dow down 1,862 points, the biggest drop since the dark days of March. Who knows if this is profit taking or whether weâ\u0080\u0099re heading for another leg down in stocks? But some of us remember the 1990s, the days of theglobe.com and â\u0080\u009cboot your brokerâ\u0080\u009d and guys in their basements trading Yahoo stock dozens of times a day. You can â\u0080\u009cOK boomerâ\u0080\u009d me all you want, but Iâ\u0080\u0099ve seen this movie many times and it never has a happy ending. Howard R. Gold is a MarketWatch columnist. Follow him on Twitter @howardrgold."}]}