{"article": [{"url": "https://www.marketwatch.com/story/asian-markets-surge-after-fed-increases-its-bond-buys-2020-06-16", "published": 1592267000.0, "headline": "Asian markets surge after Fed increases its bond buys", "body": "Asian shares rose Tuesday, cheered by fresh moves by the U.S. Federal Reserve to support markets battered by the coronavirus pandemic. Japan’s benchmark Nikkei 225 NIK, -0.11% gained 3.2% and South Korea’s Kospi 180721, +0.21% gained 4.5%, while Australia’s S&P/ASX 200 XJO, +0.00% jumped 3.7%. Hong Kong’s Hang Seng HSI, -0.30% added 2.6% while the Shanghai Composite SHCOMP, +1.67% edged up 0.9%. “In case the generosity of the Fed was in any doubt, it is not. Global equity markets are recovering quickly,” after the Fed announcement, Stephen Innes, chief global markets strategist at AxiCorp, said in a report. Market players were also awaiting a Bank of Japan policy board meeting that ended Tuesday without a change to its minus 0.1% benchmark interest rate and ultra-lax monetary stance. However, the central bank did expand its “Special Program,” including purchases of commercial paper and corporate bonds and its lending programs for commercial banks from 75 trillion yen to 110 trillion yen ($690 billion to $1.02 trillion). In a statement, the Bank of Japan said the economy “is likely to remain in a severe situation for the time being due to the impact of COVID-19,” though it expects economic activity to resume gradually. Overnight, the Fed’s move earlier brightened sentiment on Wall Street, which rallied back from a sharp, early slump on Monday to notch modest gains. The Fed announced in the afternoon that it will buy individual corporate bonds. as part of its previously announced program to keep lending markets running smoothly and allow big employers to get access to cash. The move was the latest reminder the Fed is doing everything it can to help support markets, analysts said. Central banks have repeatedly come to the economy’s rescue over the years, and it was huge, unprecedented moves by the Fed earlier this year that helped put a halt to the S&P 500’s nearly 34% sell-off on worries about the recession coming out of the coronavirus pandemic. The S&P 500 SPX, +0.87% rose 0.8% to 3,066.59, which is 9.4% below its record set in February. The Dow Jones Industrial Average DJIA, +0.56% gained 0.6%, to finish at 25,763.16 after earlier falling as much as 762 points. The Nasdaq composite COMP, +1.39% added 1.4% to 9,726.02. “Volatility is here to stay, at least for a little while,” said Jason Pride, chief investment officer of private wealth at Glenmede. “Nobody in the financial industry has a good way to forecast this.” Still, the number of COVID-19 cases is still growing in states across the country and nations around the world. Governments are relaxing lockdowns in hopes of nursing their devastated economies back to life, but without a vaccine, the reopenings could bring on further waves of COVID-19 deaths. Just a week ago, investors seemed ebullient with expectations for a recovery. Those hopes got a shot of adrenaline earlier this month when a report showed U.S. employers added jobs to their payrolls in May, a big surprise when economists were expecting to see millions more jobs lost. That optimism sent the stock market on a second leg of its rally, which began in March after the Federal Reserve and Congress promised unprecedented amounts of aid to support the economy. Besides its corporate bond buying program, the Fed has also cut interest rates back to nearly zero and expects to keep them there through 2022. Its chair, Jerome Powell, may offer more details about the Fed’s outlook in scheduled testimony before Congress this week. Benchmark U.S. crude US:CLN20 lost 47 cents to $36.65 a barrel. It rose 86 cents to $37.12 a barrel on Monday. Brent crude UK:BRNQ20 , the international standard, fell 48 cents to $39.24 a barrel. The dollar USDJPY, -0.38% rose to 107.55 Japanese yen from 107.38 yen on Monday."}]}