{"article": [{"url": "https://www.marketwatch.com/story/the-coronavirus-recession-is-destroying-millennials-social-security-benefits-and-they-need-to-act-now-2020-06-17", "published": 1592423360.0, "headline": "The coronavirus recession is destroying millennials' retirement dreams and they need to act now", "body": "“ As millennials approach middle age, they are in a financially precarious situation - more economically unstable than older generations ” Millennials are feeling a frightening sense of economic deja vu nowadays. As my generation enters middle age, we've already experienced two \"black swan\" events - one recession sparked by a global financial crisis and now another recession sparked by a global pandemic. Let's face it, millennials' economic outlook has been fragile at best. We graduated from high school and college into a weak job market. The most educated generation in history entered the workforce with unprecedented student debt thanks to soaring education costs. We missed out on wages and benefits because of the 2008 recession. We're delaying home ownership due to debt and an expensive housing market. Now, just when things seemed to be turning around, millennials are grappling with massive layoffs sparked by the COVID-19 pandemic. Of course, every generation is impacted by these economic crises. But as millennials approach middle age, they are in a financially precarious situation - more economically unstable than older generations. In addition to near-term financial worries, millennials also are concerned about retirement, a worry that usually doesn't arise until workers are close to retiring. A 2019 national survey found that 72% of millennials are \"very\" or \"somewhat\" concerned about their ability to achieve a secure retirement. And millennials have many reasons to be concerned. “ The people who should care the most about retirement, especially retirement policy, are millennials. ” The oldest millennials, like me, are in their late 30s. We have about 30 more years before we reach Social Security's new full retirement age of 67. Thirty years may seem like a long time, and it is, but when it comes to preparing for retirement, now is the time to chart a better course. Most people would say that older Americans should care the most about retirement, but in truth the people who should care the most about retirement, especially retirement policy, are millennials.Wealth inequality slams millennials The U.S. has experienced a marked increase in both income and wealth inequality since the 1980s when most millennials were born. The Census Bureau recently reported that U.S. income inequality reached its highest level in 50 years in 2018. And the Government Accountability Office (GAO) revealed in a new report that disparities in income and wealth among older households have become greater over the past three decades. My organization, the National Institute on Retirement Security (NIRS), found in a report last year that millennials in 2016 reached comparable levels of wealth inequality to baby boomers in 2004, but nearly two full decades earlier in their life cycles. Given that wealth inequality tends to compound over time, the implications of this finding are staggering. The widening chasm between the haves and the have-nots has clear implications for millennials' retirement security. Retirement income is closely tied to income and occupation during one's career. While the overwhelming majority of older Americans will receive income from Social Security in retirement, Social Security functions as a floor to prevent elder poverty; it is not meant to provide full retirement income. Accordingly, working Americans - the largest share of whom are now millennials - must earn retirement income from another source, most likely either a defined benefit pension or individual savings. However, a recent study found that 40% of older Americans only receive retirement income from Social Security, and lack income from either a pension or other retirement plan. Unfortunately, few private companies still offer defined benefit pensions to their workers, especially younger workers who may not be eligible to participate in pension plans. Federal Reserve data show that the percentage of those ages 25-35 with a pension declined to just over 15% in 2016 from more than 25% in 1989. The majority of millennials will enter retirement without the security of a defined benefit pension absent a renewed interest in rebuilding our retirement infrastructure. This leaves individual savings, most likely through an employer-provided defined contribution plan, such as a 401(k). While the number of Americans who own assets in defined contribution plans has grown significantly since the 1980s, this account-based retirement savings system has inefficiencies that particularly harm younger workers. A major hindrance to retirement savings for many workers is plan access. Workers are much more likely to save if they are offered a plan through their employer, but workers may be ineligible to participate if they work part-time or haven't worked for their employer long enough to be eligible. Previous NIRS research found only one-third of millennials participate in their employer's retirement savings plan due to low eligibility. Millennials will likely gain access to employer plans as they continue to age into the workforce, but two-thirds of working millennials in 2014 had nothing saved for retirement. “ Millennials will see a smaller share of pre-retirement income replaced than previous generations. ” The bottom line: The retirement outlook for millennials is bleak. Widening inequality is driving wealth to the very top. Unless lawmakers in Washington act soon, the Social Security trust fund will be depleted in 2035 and everyone who won't have retired yet, not just millennials, will experience a sharp cut in their benefits. The recent passage of multiple pieces of legislation to address the COVID-19 pandemic demonstrates that Congress can act quickly when motivated. But even if Congress acts to restore the Social Security trust fund, under current program rules, millennials will see a smaller share of pre-retirement income replaced than previous generations. The shrinking availability of pensions and lack of access to other employer-provided plans, coupled with lingering financial and economic burdens from two recessions, makes it difficult for millennials to prepare for retirement. It's a myth that Social Security will not be there when millennials retire, as minor adjustments can solidify the program's future for many decades. That said, there is only a small window of time to address these challenges - and millennials must use their political power to push for them. In 2020, millennials will nearly equal baby boomers for the largest slice of eligible U.S. voters. Millennials, as a voting bloc, must immediately embrace the cause of Social Security expansion. They should collectively work to restore Social Security's trust fund and strengthen and expand the program. Organizations like Social Security Works are leading the charge in this effort. Millennials should also advocate for major structural changes to the U.S. retirement savings system. This means improving the inefficient tax incentives for retirement savings that mostly benefit high-income earners and expanding access to plans for those who do not have one through their employer. Millennials may think that retirement is far away and they have more pressing financial worries. But waiting to address America's broken retirement system will only exacerbate the challenge and could make working forever the new normal. We can do better. But policymakers must act now to save the American Dream of retirement for millennials. Tyler Bond is the manager of research at the National Institute on Retirement Security, a non-partisan, non-profit think tank in Washington, D.C. More: There's only one generation in U.S. history that's considered to be more unlucky than the 'Lost Generation' Plus: Are millennials fooling themselves with their retirement-savings strategy?"}]}