{"article": [{"url": "https://www.marketwatch.com/story/gold-heads-for-back-to-back-loss-amid-vaccine-hope-us-dollar-strength-2020-09-03", "published": 1599142400.0, "headline": "Gold prices settle at 1-week low as U.S. stock market tumbles", "body": "Gold futures fell Thursday to settle at their lowest level in a week, as some traders look to the precious metal to cover losses in other assets on the heels of a drop in U.S. benchmark stock indexes. U.S. stock indexes traded sharply lower, poised to erase their gains for the week. Sharp losses in the stock market can send traders scrambling to cover losses by selling other assets, such as gold. Read:Dow slumps with stocks on pace to erase weekly gains This “jumpy” gold price and market is “going to grind the emotion of traders, on both sides of the market in the coming weeks,” said Peter Spina, who is president of GoldSeek.com and SilverSeek.com, providers of news and analysis for the precious metals. He told MarketWatch that he sees strong support in the $1,900 area for gold prices, and believes the metal will “soon again try to push back up” towards $2,000. For now, December gold GCZ20, +2.17% GC00, +2.17% fell $6.90, or nearly 0.4%, to settle at $1,937.80 an ounce. That was the lowest finish for a most-active contract since Aug. 27, according to FactSet data. Prices declined by 1.7% on Wednesday. December silver SIZ20, +5.96% SI00, +5.96%, meanwhile, dropped 52 cents, or 1.9%, at $26.875, following its 4.4% skid in the previous session. Gold had struggled for direction early Thursday, pressured by a fall in weekly U.S. jobless claims, but had also found some support from data showing a monthly jump in the U.S. trade deficit. “The U.S. jobless claims number was “better but the trade balance data was really awful,” said Naeem Aslam, chief market analyst at AvaTrade. Initial jobless claims fell by 130,000 to a seasonally adjusted 881,000 in the last week of August, the Labor Department said Thursday. Government data, however, revealed that the trade deficit jumped 18.9% in July owing to a big snapback in imports. Gold is still trading above $1,900 and “this is keeping the hope alive for the price to target the $2,000 mark,” Aslam told MarketWatch. The “biggest risk event for the gold rally” is Friday’s U.S nonfarm payrolls data and “only a strong reading can break the back” of a gold rally. Meanwhile, “the U.S. dollar index has fallen significantly over the last five months,” said Spina. “Should there be stronger economic data as we move into the Fall, then this will help spur a rally in the U.S. dollar from these oversold conditions.” A strong dollar “could put a bit of pressure on the gold price and keep it in a sideways market near $2,000,” he said. “But that is just short-term noise. The bigger picture is what is important and those fundamental drivers are significantly in gold’s favor.” In Thursday dealings, the U.S. dollar traded little changed, as gauged by the ICE U.S. dollar index DXY, -0.58%, a measure of the buck’s strength against a half-dozen currencies. After touching a two-year low, the index has gained 0.5% so far this week. Gold, which is priced in dollars, often trades inversely with the dollar, as moves in the U.S. unit can influence the attractiveness of the metal to holders of other currencies. For now, gold is in a “healthy consolidation phase after a quick price run-up,” Spina said. “Gold is priming for its next move above $2,000 to fresh record highs.” Given all that, Spina believes “this is an excellent time to be accumulating, specifically the miners,” pointing out that they are “trading very cheaply compared to historic ratios, they have yet to catch up to even these new higher prices.” However, growing expectations for a vaccine or effective remedies against the COVID-19 pandemic, also have weighed on precious metals’ pricing lately, experts say. Bullion has been boosted by economic uncertainty stoked by the pandemic and by the outsize monetary efforts implemented by central bank’s to stem the harm to business activity across the world, but a cure or treatment for the deadly disease could dislodge gold from its bullish perch. “If a vaccine is imminent, it is safe to assume that central bankers will take their foot off the policy accelerator,” wrote Stephen Innes, chief global markets strategist at AxiCorp, in a daily note. Among other metals traded on Comex, December copper HGZ20, +1.38% fell 1.5% to $2.975 a pound. October platinum PLV20, +3.99% fell 1.6% to $889.60 an ounce, but December palladium PAZ20, +2.31% added 2.4% to $2,321.60 an ounce."}]}