{"article": [{"url": "https://www.marketwatch.com/story/united-airlines-posts-wider-loss-in-most-difficult-second-quarter-2020-07-21", "published": 1595401460.0, "headline": "United Airlines hit with $1.6 billion GAAP loss in â\u0080\u0098most difficultâ\u0080\u0099 second quarter", "body": "United Airlines Holdings Inc. late Tuesday reported a billion-dollar quarterly loss, giving investors a look into financials thoroughly wrecked by the pandemic and the near standstill on air travel. United UAL, +0.32% Â said it lost $1.6 billion, or $5.79 a share, in the second quarter, contrasting with a profit of $1.05 billion, or $4.02 a share, in the year-ago quarter. Adjusted for one-time items, United said it lost $2.6 billion, or $9.31 a share, versus an adjusted profit of $4.21 a share a year ago. Revenue fell 87% to $1.5 billion from $11.4 billion a year ago. Analysts polled by FactSet had expected the company to report an adjusted loss of $8.96 a share on sales of $1.3 billion. See also:Airline stocks drop as travel demand declines for first time in 13 weeks The company called the quarter â\u0080\u009cthe most difficultâ\u0080\u009d financial period in its 94-year history. Liquidity as of Monday was about $15.2 billion, and the company said it expects liquidity at the end of the third quarter to be more than $18 billion. Cash burn during the quarter averaged $40 million a day, including $3 million in principal payments and severance expenses, United said. It forecast its average daily cash burn to be about $25 million during the third quarter, including $6 million of principal repayments and severance expenses. United said it believes that average to be the lowest among large air carriers as it did â\u0080\u009cthe best job of matching actual capacity to demand among its largest network peers.â\u0080\u009d â\u0080\u009cWe accomplished this by quickly and accurately forecasting the impact that COVID would have on passenger and cargo demand, accurately matching our schedule to that reduced demand, completing the largest debt financing deal in aviation history, and cutting expenses across our business,â\u0080\u009d Chief Executive Scott Kirby said in a statement accompanying results. â\u0080\u009cWe believe this quick and aggressive action has positioned United to both survive the COVID crisis and capitalize on consumer demand when it sustainably returns.â\u0080\u009d Donâ\u0080\u0099t miss:Delta Air stock slips after wider-than-expected loss Unitedâ\u0080\u0099s stock rose 1.3% in the extended session after ending the regular trading day up 2.3%. The airline said it would discuss the second-quarter results and the outlook for fiscal third quarter and 2020 at a call with analysts on Wednesday at 10:30 a.m. Eastern. The call will be webcast. United shares have lost 63% this year, compared with losses of 6% for the Dow Jones Industrial Average DJIA, +0.56% Â and contrasting with gains of 0.7% for the S&P 500 index SPX, +0.87% Â in the same period."}]}