{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-edge-up-as-stock-market-aims-for-best-august-return-in-36-years-2020-08-31", "published": 1598893040.0, "headline": "Dow, S&P 500 end lower, but book best August in 36 years. Nasdaq clinches another record", "body": "U.S. stocks closed mostly lower Monday, but with Wall Street recording its strongest August return in decades, as vaccine hopes kept investors pushing equities to fresh highs. Shaking off moderate weakness elsewhere, the tech-heavy Nasdaq Composite ended higher, pushing further into record territory.How did stock benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% shed 223.82 points, or 0.8%, to end at 28,430.05. The S&P 500 SPX, +0.87% fell 7.70 points, or 0.2%, ending at 3,500.31, after touching an intraday record of 3,514.77. The Nasdaq Composite COMP, +1.39% rose 79.82 points, 0.7%, to end at a record 11,775.46, after also setting a new intraday all-time high of 11,829.84. Over the past five months, the Dow’s advanced 29.7%, its biggest 5-month percent gain since July 2009, while the S&P 500 added 35.4%, its best 5-month run since October 1938. The Nasdaq outperformed, advancing 52.9%, booking its strongest 5 months since March 2000, according to Dow Jones Market Data. What drove the market? The S&P 500 clinched its best August return since 1986 and the Dow its best return for that month since 1984, while the Nasdaq recorded its strongest August since 2000. Much of the strength has been attributed to hopes for vaccines and treatments for the COVID-19 pandemic that has debilitated economies across the globe. The S&P 500 and Nasdaq have continued to notch records as risk assets shrug off the economic damage wrought by the coronavirus. Read:COVID-19 vaccine hopes are driving the stock market rally — here’s how much “Over the course of the next eight weeks, we’re going to have a raft of announcements on a vaccine. If they are all positive, it’s going to trump everything,” said Quincy Krosby, chief market strategist at Prudential Financial, in an interview. Adding to the optimism around potential coronavirus cures, the Food and Drug Administration’s commissioner, Stephen Hahn, said the U.S. could fast-track a trio of vaccines. The FDA boss, in a weekend interview with the Financial Times, insisted there are safe ways to make a vaccine available before the end of final stage trials—potentially by issuing an emergency authorization for use by certain groups, rather than achieving a blanket approval. Still, this comes ahead of a seasonally weak month for stocks in September, which could be amplified by worries about a COVID-19 resurgence in the fall and winter, by the stalemate in Congress over additional pandemic aid and by turbulence fostered by the U.S. presidential election race between former Vice President Joe Biden and incumbent President Donald Trump. Mark Hulbert: The stock market is on a tear, but now comes September, the worst month of the year “As some of the fiscal measures put in place begin to wear off, the need for additional fiscal stimulus only increases,” Charlie Ripley, senior investment strategist at Allianz Investment Management, wrote Monday. “At the end of the day, the speed of the recovery rests in the hands of politicians as they wrangle over the details in the next round of fiscal stimulus spending.” What’s more, the closely tracked CBOE Volatility Index, or VIX VIX, -5.15% rose 14.5% Monday, and also has climbed in October ahead of each of the past seven presidential election years since 1992, according to Keith Lerner, chief market strategist at SunTrust Advisory Services, who notes that “some observers are now questioning whether a pullback at some point is even possible while the Federal Reserve’s policy remains so accommodative. “Our response is an unequivocal yes,” Lerner wrote in a client note Monday. Trading on Monday also followed last week’s important declaration by the Federal Reserve that it would use an average inflation target as a part of its monetary-policy. The shift implies the central bank would pursue lower rates for a longer period, even if the unemployment rate, which is historically associated with rising price pressures, started to fall substantially. Read: Fed adopts new strategy to allow higher inflation and welcome strong labor markets Fed Vice Chairman Richard Clarida on Monday defended the central bank’s shift to average inflation targeting. He said the link between inflation and the unemployment rate, known to economists as the Phillips Curve, began to lose its predictive power more than a decade ago. “For a long time now, many have been asking whether the Phillips curve is dead,” wrote Kristina Hooper, Invesco’s chief global market strategist, in commentary Monday. “Last week, the Fed answered affirmatively — at least it believes that’s what recent history has proven.” See: Fed’s Clarida says new inflation-fighting strategy has roots in failure of old approach Meanwhile, China on Friday unveiled new restrictions on artificial-intelligence technology exports that could further complicate the sale of TikTok’s U.S. operations, as the Trump administration tries to quickly find a buyer. Microsoft Corp. MSFT, +2.48%, Walmart WMT, +1.00% and Oracle Corp. ORCL, +0.42% each have been reported to have an interest in acquiring pieces of the popular social-media company. The latest curtailments on the ByteDance-owned TikTok highlights growing worries about tensions between Beijing and Washington. Monday also marked key changes to the Dow precipitated partly by Apple Inc.’s AAPL, +1.74% 4-for-1 stock split, which prompted the Dow’s owners, S&P Dow Jones Indices, to add Salesforce.com Inc. CRM, +2.21%, Amgen Inc. AMGN, -1.41% and Honeywell International Inc. HON, +0.34% to the index, replacing iconic Exxon Mobil Corp. XOM, -1.47%, Pfizer Inc PFE, -0.27%, and Raytheon Technologies Corp. RTX, -1.46%. Also read:Of all the major changes to the Dow on Monday, this may be the most important Separately, Warren Buffett’s Berkshire Hathaway conglomerate BRK.B, +0.24% disclosed recent stakes in Japanese investment firmsMitsubishi Corp. 8058, -0.48%, Mitsui & Co. 8031, +0.08%, Sumitomo Corp. 8053, -1.02%, Itochu Corp. 8001, -1.43% and Marubeni Corp. 8002, -0.88% ahead of the Tokyo stock market open Monday.Which stocks were in focus? Shares of Tesla Inc. AAPL, +1.74% rose 12.6% Monday, amid the electric car maker’s 5-for-1 stock split. Shares of Apple rallied 3.4% amid its 4-for-1 stock split. Shares of Vir Biotechnology Inc. VIR, -1.94% fell 2.8% even after the company and GlaxoSmithKline GSK, +1.10% said they had begun dosing patients in a clinical study for their experimental COVID-19 antibody treatment. Wish.com said Monday that it “confidentially” submitted a draft registration with the Securities and Exchange Commission related to a proposed public offering of Class A common stock. GameStop Inc. shares GME, -10.89% soared 23.9% Monday after RC Ventures LLC disclosed that it has taken a 9% stake in the gaming retailer. Potato chip maker Utz Brands Inc. UTZ, -0.60% shares rose 12.6% Monday, following its initial public offering that lets fans the century-old Pennsylvania firm trade shares on the New York Stock Exchange. Shares of AT&T T, -1.01% shed 0.8% Monday, after a report from The Wall Street Journal on Friday that said it is again shopping for a buyer for DirectTV. Beyond Meat Inc. BYND, +0.80% shares were up 4.1% after an upgrade to hold from a bearish Citigroup analyst who revised her price target to $141 from $123. Shares of Amazon.com AMZN, +3.01% rose 1.5% higher after the e-commerce and cloud-computing giant received Federal Aviation Administration approval to fly is fleet of Prime Air delivery droves, opening up the skies, or at least the area “beyond the visual line of sight,” to drone delivery of its packages to customers. How did other markets fare? In Asia, China’s CSI 300 000300, +2.04% fell 0.6% and Hong Kong’s Hang Seng HSI, -0.30% shed 1%. The Stoxx Europe 600 SXXP, +0.55% closed down 0.6%, contributing to a monthly drop of 2.9%, while U.K.’s FTSE 100 benchmark UKX, +0.64% closed up 1.1% this month. The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% fell 3.2 basis points to 0.695%, but rose 15.9 basis points during August. Bond prices move inversely to yields. Gold GCZ20, +2.17% finished 0.2% higher to settle at $1,978.60 an ounce, up almost 0.4% for the month. West Texas Intermediate crude for October delivery CL.1, -1.62% closed 0.8% lower to settle at $42.61 a barrel on the New York Mercantile Exchange. The ICE U.S. Dollar Index DXY, -0.58%, which tracks the currency versus a basket of six major rivals, fell 0.2% to extend its decline this year. Sunny Oh contributed reporting"}]}