{"article": [{"url": "https://www.marketwatch.com/story/melania-trump-says-the-president-is-not-traditional-but-he-gets-results-as-she-appeals-for-votes-2020-08-25", "published": 1598399240.0, "headline": "Melania Trump says the president is not traditional but he â\u0080\u0098gets results,â\u0080\u0099 as she appeals for votes", "body": "Melania Trump on Tuesday night described her husband as unconventional but able to â\u0080\u009cget things done,â\u0080\u009d as the first lady urged voters to support President Donald Trump while delivering the keynote speech on the Republican National Conventionâ\u0080\u0099s second night. â\u0080\u009cAs you have learned over the past five years, heâ\u0080\u0099s not a traditional politician,â\u0080\u009d she said. â\u0080\u009cHe doesnâ\u0080\u0099t just speak words. He demands action, and he gets results.â\u0080\u009d The Slovenian-American former model is among a half-dozen Trump family members speaking on the presidentâ\u0080\u0099s behalf during a four-day GOP convention that has become mostly virtual due to the coronavirus pandemic. Ahead of the first ladyâ\u0080\u0099s keynote from the White Houseâ\u0080\u0099s Rose Garden, her moment in the spotlight was described as another opportunity to put her 2016 convention speech behind her, after that address mirrored language used in 2008 by Michelle Obama, her predecessor. â\u0080\u009cIn my husband, you have a president who will not stop fighting for you and your families,â\u0080\u009d Melania Trump said Tuesday, during an address that ran for more than 25 minutes. â\u0080\u009cDespite the unprecedented attacks from the media and opposition, he will not give up. In fact, if you tell him [it] cannot be done, he just works harder.â\u0080\u009d In addition, the first lady portrayed her husband as providing â\u0080\u009ctotal honesty.â\u0080\u009d â\u0080\u009cWhether you like it or not, you always know what heâ\u0080\u0099s thinking, and that is because heâ\u0080\u0099s an authentic person who loves this country and its people and wants to continue to make it better,â\u0080\u009d she said. She also said she has â\u0080\u009creflected on the racial unrest in our country.â\u0080\u009d â\u0080\u009cIt is a harsh reality that we are not proud of parts of our history. I encourage people to focus on our future, while still learning from our past,â\u0080\u009d the first lady said. Two of the presidentâ\u0080\u0099s children, Eric and Tiffany Trump, spoke on Tuesday night as well. Their remarks followed a speech on Monday night by the presidentâ\u0080\u0099s oldest son, Donald Trump Jr., who said Democratic challenger Joe Bidenâ\u0080\u0099s policies â\u0080\u009cwould stop our economic recovery cold.â\u0080\u009d Bidenâ\u0080\u0099s campaign pushed back late Monday on Trump Jr.â\u0080\u0099s attack, saying he and other speakers have delivered â\u0080\u009cdark and divisive fear-mongering designed to distract from the fact that Donald Trump does not have an affirmative case to make to the American people about why he should be re-elected.â\u0080\u009d Among the other speakers at the GOP event on Tuesday night were Secretary of State Mike Pompeo, Sen. Rand Paul of Kentucky and Nicholas Sandmann, a teen who sued media outlets over how they portrayed his 2019 interaction with a Native American man at the Lincoln Memorial. Sandmann said: â\u0080\u009cI believe we must join a president who will challenge the media to return to objective journalism.â\u0080\u009d Ahead of Pompeoâ\u0080\u0099s speech from Jerusalem, the Biden campaign and other critics accused him of inappropriate political behavior and treating Israel like a prop, as his State Department predecessors havenâ\u0080\u0099t spoken at their partiesâ\u0080\u0099 conventions. The Democratic-controlled House Foreign Affairs Committee has launched an investigation into whether Pompeoâ\u0080\u0099s speech is illegal. â\u0080\u009cEvery day Americaâ\u0080\u0099s diplomats abroad proudly represent our country â\u0080\u0094 not a political party â\u0080\u0094 but Mike Pompeoâ\u0080\u0099s repeated and blatant use of his office for overtly political purposes only serves to undercut their work, and it further weakens the critical alliances and global relationships that have already been so badly damaged by this administrationâ\u0080\u0099s recklessness,â\u0080\u009d said Bidenâ\u0080\u0099s deputy campaign manager and communications director Kate Bedingfield, in a statement on Tuesday. From the archives:U.N. rebukes Trump for recognizing Jerusalem as Israelâ\u0080\u0099s capital Also read:Israeli soccer team plans to take Trumpâ\u0080\u0099s name after presidentâ\u0080\u0099s â\u0080\u0098courageous moveâ\u0080\u0099 â\u0080\u009cThe president has held China accountable for covering up the China virus and allowing it to spread death and economic destruction in America and around the world, and he will not rest until justice is done,â\u0080\u009d Pompeo said in his pre-recorded speech. The former Kansas congressman also praised how Trump has approached North Korea, Iran and Israel. â\u0080\u009cIf you hate war like I hate war, if you want us to quit sending $50 billion dollars every year to Afghanistan to build their roads and bridges, instead of building them here at home, you need to support President Trump for another term,â\u0080\u009d Paul said. The president starred in some video footage that aired on Tuesday night, in a repeat of how he was featured in Monday nightâ\u0080\u0099s programming. Trump, who is slated to speak on Thursday night, appeared in one clip in which he pardoned convicted bank robber Jon Ponder, a Black man who has founded a group that helps ex-prisoners rejoin society. He appeared in another in which he was praised as a â\u0080\u009cchampion for womenâ\u0080\u009d by women from his administration and campaign, and one video showed him at a naturalization ceremony, where he congratulated five new U.S. citizens who originally hailed from Bolivia, Ghana, India, Lebanon and Sudan. In RealClearPolitics averages of polls as of Tuesday, Biden is leading Trump by 7.6 percentage points in nationwide surveys and by 4.2 points in key swing states that are likely to decide the November election. Opinion:Trump, running for re-election, is faking it on the economy and the pandemic Counterpoint:Donâ\u0080\u0099t count Trump out â\u0080\u0094 hereâ\u0080\u0099s how he can still win in November The main U.S. stock gaugesÂ mostly finished with gains on Tuesday, with the S&P 500 SPX, +0.87% and Nasdaq Composite COMP, +1.39% closing at fresh all-time highs."}]}