{"article": [{"url": "https://www.marketwatch.com/story/bed-bath-beyond-turnaround-under-way-but-analysts-say-outside-forces-are-also-giving-the-company-a-boost-11601660158", "published": 1601716520.0, "headline": "Bed Bath & Beyond turnaround under way, but analysts say outside forces are also giving the company a boost", "body": "Bed Bath & Beyond shares have soared since earnings beat expectations Getty Images Bed Bath & Beyond Inc. is reaping the rewards of an ongoing turnaround, but analysts say the company is also getting a boost from a coronavirus-impacted environment that has been favorable to the home space. Bed Bath & Beyond BBBY, -1.37% shares are soaring after second-quarter earnings beat expectations, with the company reporting the first same-store sales increase since 2016. Shares were up nearly 9% in Friday trading, and have rallied more than 40% for the week. Many research groups have raised their price target on Bed Bath & Beyond shares. But UBS says the results need to be put in the context of a strong home furnishings category. “It’s clear to us that the rising tide is lifting all boats,” analysts led by Michael Lasser wrote. “However, Bed Bath & Beyond also executed more effectively to take advantage of this tailwind.” Read: Amazon will host its delayed Prime Day shopping event on Oct. 13 and 14 UBS rates Bed Bath & Beyond shares neutral with a $20 price target, up from $13. “While we are impressed by the progress made, clearly the environment is helping with many of Bed Bath & Beyond’s key categories,” wrote JPMorgan analysts in a note. “This suggests ongoing share loss and there remains a lot of work to fix the company’s operating foundation while the COVID-induced nesting lap looms. As such, we remain neutral.” JPMorgan moved its price target to $21 from $10. Prior to the earnings announcement, retailers across the home design, home goods, and home improvement space were experiencing high demand from consumers who are spending more time in their houses due to the pandemic. Watch: Why retail bankruptcies won’t necessarily create a ‘retail apocalypse’ RH RH, -1.22% was upgraded last week on analyst expectation that high-end home investment would benefit the retailer. And rivals Lowe’s Cos. LOW, +1.38% and Home Depot Inc. HD, +0.49% have been hot as more consumers tackle home projects. “We keep a sell [stock rating] on the view that August quarter’s beats are reflective of low-hanging fruit from unprecedented stimulus and tailwinds from COVID-19 cocooning (which has temporarily shifted wallet share to home) and make Bed Bath & Beyond’s transformation appear more robust than reality,” wrote Camilla Yanushevsky for CFRA. “Recent efforts to improve fulfillment (e.g. Shipt; Instacart) are commendable, but the company still lacks distinctive positioning.” CFRA’s price target on Bed Bath & Beyond was moved to $8 from $3. Don’t miss: Walmart unveils digital-focused store redesign Wedbush analysts are far more upbeat, calling out gross margin benefits from fewer markdowns, the recent launch of buy-online-pickup-in-store and other same-day services, the “impressive” $750 million in cash flow, and more. “Most importantly, many of the underlying drivers of these results should persist in the near-term, with easy comparisons providing additional support, while drivers of much stronger profit in the medium term are becoming clearer,” analysts led by Seth Basham wrote. “As investors better understand the potential of this merchandising-led transformation and the company continues to execute on its plans under CEO Mark Tritton, we expect further share price gains.” Wedbush rates bed Bath & beyond shares outperform with a $25 price target, up from $18. Raymond James also raised its price target to $22 from $16. Analysts rate Bed Bath & Beyond stock strong buy. Bed Bath & Beyond shares have rallied 18.4% for the year to date while the S&P 500 index SPX, +0.87% is up 4.5% for the period."}]}