{"article": [{"url": "https://www.marketwatch.com/story/the-beginning-of-a-horror-movie-disney-world-slammed-as-doors-reopen-amid-spiking-coronavirus-cases-2020-07-12", "published": 1594579040.0, "headline": "â\u0080\u0098The beginning of a horror movieâ\u0080\u0099? Disney World slammed as doors reopen amid spiking coronavirus cases", "body": "Florida on Sunday broke the national record for the biggest single-day number of positive coronavirus cases in any state since the beginning of the pandemic, following a week in which the Sunshine State saw 514 people die of the disease, or 73 each day, on average. Also, Disney World is now open! The idea that the park would open in the face of a raging outbreak in the area sparked backlash across social media. The critiques really began to pile up after the companyâ\u0080\u0099s official â\u0080\u009cDisney Parks Jobâ\u0080\u009d account posted this short video promoting the big event on Instagram. CNN business editor Alexis Benveniste said it â\u0080\u009cfeels like the beginning of a horror movie,â\u0080\u009d and the internet mostly agreed, considering the creative edits that began popping up all over Twitter. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } That video aside, the actual open also came under fire: iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Of course, not everybody was complaining. â\u0080\u009cItâ\u0080\u0099s the chance to come back and be in the magic,â\u0080\u009d Diane Watkins, who visits the park about eight times a year, told the Associated Press. â\u0080\u009cHot or not, mask or not, weâ\u0080\u0099re just happy to be here. I feel like everybody here is in the same frame of mind. Everybody is just so excited to be here.â\u0080\u009d Lori Lovell of Evansville, Ind., also cheered the reopening. â\u0080\u009cI have missed coming here. It just feels really good to be back,â\u0080\u009d she said. â\u0080\u009cThis is where Iâ\u0080\u0099ve made so many memories. Itâ\u0080\u0099s kind of our second home. Not being able to come here was hard.â\u0080\u009d Meanwhile, in California, where coronavirus cases are also surging, Disneyland is still in a holding pattern after delaying its original July 17 reopening plans. Disney shares DIS, +1.53% Â gained Friday, but are down 17% year to date."}]}