{"article": [{"url": "https://www.marketwatch.com/story/day-trader-who-slammed-warren-buffett-represents-an-unholy-speculative-mix-that-should-keep-investors-out-of-stocks-former-top-strategist-warns-2020-06-14", "published": 1592229680.0, "headline": "â\u0080\u0098Thereâ\u0080\u0099s absolutely no reason to own U.S. equities right now,â\u0080\u0099 strategist says, citing â\u0080\u0098an unholy speculative mixâ\u0080\u0099", "body": "Barstool Sports founder Dave Portnoy, ever the carnival barker, has been stirring it up in the virtual trading pits lately. Flipping stocks is easy, he shouts from his desk. â\u0080\u009cIâ\u0080\u0099m just printing money... I should be up billions!â\u0080\u009d Warren Buffett BRK.A, +0.06% BRK.B, +0.24% Â is â\u0080\u009cwashed up!â\u0080\u009d Read:Itâ\u0080\u0099s like the Wild West with â\u0080\u0098get-rich-quick crowdâ\u0080\u0099 vs. Wall Street pros, but itâ\u0080\u0099s too easy to blame retail investors for â\u0080\u0098rampant speculationâ\u0080\u0099 Here is just one of the rants he dropped on his 1.5 million Twitter followers last week: iframe.twitter-tweet { width: 100% !important; } But itâ\u0080\u0099s exactly that kind of bullish mania that spells doom for this stock market, according to Peter Cecchini, former top strategist at Cantor Fitzgerald. In fact, he warned in a note posted on LinkedIn that we could be looking at a â\u0080\u009cPortnoy Topâ\u0080\u009d in this market. â\u0080\u009c[Portnoyâ\u0080\u0099s] attention-getting, wild style is emblematic of just how emotional and extreme equity markets are now,â\u0080\u009d he said. â\u0080\u009cItâ\u0080\u0099s both impulsive and compulsive. His behavior really just explains everything. It doesnâ\u0080\u0099t even matter if heâ\u0080\u0099s serious or not.â\u0080\u009d Cecchini isnâ\u0080\u0099t the only one raising a red flag on Portnoyâ\u0080\u0099s antics: iframe.twitter-tweet { width: 100% !important; } Regardless of whether Portnoyâ\u0080\u0099s just engaging in his latest attention grab, he represents a groundswell of retail investors emboldened by the current climate of staying at home, free-flowing Fed money and easy access through platforms like Robinhood, Cecchini wrote. â\u0080\u009cItâ\u0080\u0099s an unholy speculative mix,â\u0080\u009d he said. â\u0080\u009cItâ\u0080\u0099s not about him; itâ\u0080\u0099s about what the rants represent.â\u0080\u009d Cecchiniâ\u0080\u0099s takeaway is that the stock market is no place to be at the moment, even with some of the recent spikes investors have seen of late. On Friday, the Dow DJIA, +0.56% bounced back from a day-earlier decline of nearly 2,000 points with a 477-point rally, and both the S&P 500 SPX, +0.87% and Nasdaq Composite COMP, +1.39% also logged gains. Still, itâ\u0080\u0099s going to get ugly out there, Cecchini warns. â\u0080\u009cThereâ\u0080\u0099s absolutely no reason to own U.S. equities right now â\u0080\u0094 unless one likes low to negative future returns.â\u0080\u009d In Mondayâ\u0080\u0099s trading action, the major indexes managed to bounce off the lows of the session, but the Nasdaq was the only one in positive territory, at last check."}]}