{"article": [{"url": "https://www.marketwatch.com/story/asian-markets-mixed-as-traders-seek-direction-2020-06-21", "published": 1592783420.0, "headline": "Asian markets mixed as traders seek direction", "body": "Asian markets were mixed in early trading Monday, after the World Health Organization reported a record single-day total of new coronavirus cases around the world. Japan’s Nikkei 225 NIK, -0.11% inched up 0.1% while Hong Kong’s Hang Seng index HSI, -0.30% slipped 0.4%. The Shanghai Composite SHCOMP, +1.67% advanced 0.2% while the smaller-cap Shenzhen Composite 399106, +3.09% gained 0.4%. South Korea’s Kospi 180721, +0.21% dipped 0.1%, while benchmark indexes in Taiwan Y9999, +1.10% , Singapore STI, -0.39% and Indonesia JAKIDX, +0.28% were little changed. Australia’s S&P/ASX 200 XJO, +0.00% rose 0.2%. “It has been a relatively limp start to the Asia session as it seems like investors who have been trading mostly on momentum appear waiting for someone to take charge and shrug off Friday markets weakness,” Stephen Innes, chief global markets strategist at AxiCorp, wrote in a note. “The market is caught between fears of a second COVID wave and improving [economic] data.” On Sunday, WHO reported more than 183,000 new cases in the latest 24 hours, with Brazil and the U.S. having the most new cases. Former U.S. Food and Drug Administration chief Scott Gottlieb told CBS News on Sunday and more states need to mandate the use of face masks in public in an effort to slow the spread of the disease. “It’s a tool that we have [and] a tool has been demonstrated to have an impact if everyone does it, or most people do it,” he said. U.S. stock futures rose after initially falling in electronic trade late Sunday. Last week, all three equity benchmarks made weekly gains, though the Dow Jones Industrial Average ended the week on a three-day losing streak. On Friday the Dow DJIA, +0.56% closed 208.64 points lower, down 0.8%, at 25,871.46, after being as much as 371 points higher at an intraday peak. The S&P 500 index SPX, +0.87% fell 17.60 points, or 0.6%, to close at 3,097.74, and the Nasdaq Composite Index COMP, +1.39% gained 3.07 points, less than 0.1%, to close at 9,946.12. Benchmark U.S. crude US:CLN20 slipped to $39.58 per barrel in electronic trading on the New York Mercantile Exchange, while Brent crude UK:BRNQ20 , the international benchmark, was little changed. The dollar USDJPY, -0.38% was about flat against the Japanese yen."}]}