{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-head-for-second-weekly-fall-on-demand-worries-2020-09-11", "published": 1599838880.0, "headline": "Oil prices suffer a second weekly fall on demand worries", "body": "Oil futures suffered from a second consecutive weekly decline on Friday, pressured by worries over the outlook for demand and a climb in U.S. crude supplies. U.S. and global benchmark crude took different paths for the session, with U.S. prices tacking on a few pennies, and global prices posting a loss. “Demand woes” returned, as inventories rose and the dollar staged a comeback, said Edward Moya, senior market analyst at Oanda. U.S. jobless claims rose for a fourth week in a row in data published Thursday, signalling that a summer improvement in the labor market has stalled, feeding worries about the economy and energy demand. Meanwhile, the Energy Information Administration reported an increase in domestic crude supplies for the first time in seven weeks. And on Friday, the dollar looked to end higher for the week, with the ICE U.S. Dollar Index DXY, -0.58% up 0.7% from last Friday. Against this backdrop, oil marked its “first consecutive weekly slide since the April collapse” to a negative price settlement for the U.S. benchmark, said Moya, in a market update. West Texas Intermediate crude for October delivery CL.1, -1.62% US:CLV20 edged up by 3 cents, or 0.08%, to settle at $37.33 a barrel on the New York Mercantile Exchange, with prices logging a decline of 6.1% for the week, according to Dow Jones Market Data. November Brent BRN.1, -0.07% UK:BRNX20, the global benchmark, fell 23 cents, or 0.6%, to $39.83 a barrel on ICE Futures Europe, for a weekly loss of 6.6%. Read: Volatility in oil and gold may offer more opportunity than risk Also see:How a big decline in China’s oil imports may ‘test the resiliency of the market’ “Crude and product prices remain intricately tied to the health and sentiment surrounding the broader global economy; a situation that has shown periods of strong recovery in recent months, but in which optimism is being tested and downside risk heightened,” said Robbie Fraser, senior commodity analyst at Schneider Electric, in a daily note. Oil posted a loss on Thursday as investors focused on government data that showed a 2 million-barrel climb in U.S. crude inventories for the week ended Sept. 4. The end of U.S. driving season, which runs from Memorial Day to Labor Day, has heightened worries over near-term domestic demand, while uncertainty also lingers over the outlook for global demand as COVID-19 cases continue to rise. On Friday, October gasoline US:RBV20 lost 0.3% at $1.0949 a gallon, ending around 7% lower for the week, while October heating US:HOV20 rose 0.7% to $1.0896 a gallon, with prices posting a weekly fall of 5.4%. “Higher crude prices amidst weak product demand this summer inadvertently crushed refining margins that resulted in economic run cuts,” leaving U.S. refinery runs around 2.7 million barrels a day below normal levels,” said Michael Tran, analyst at RBC Capital Markets in a note. Earlier a plunge by crude prices on Tuesday was accompanied by lower gasoline and distillate crack spreads — the difference between the price of crude and the products refined from it — a signal that end-user demand has been unable to absorb product balances, he said. “To call an inflection point, we are laser focused on two indicators: The Atlantic Basin marginal barrel to tell us when buying patterns pick up, and global refining margins to indicate when demand is truly increasing,” Tran said, in a note. “Both of these indicators must turn the corner meaningfully in order for the oil market to structurally rebalance.” Data from Baker Hughes BKR, -1.34% Friday, meanwhile, showed a modest decline of 1 in the number of active U.S. rigs drilling for oil to total 180. Rounding out Nymex action, October natural-gas futures US:NGV20 lost 2.3% at $2.269 per million British thermal units, contributing to a 12.3% drop for the week. The weekly decline was the largest since November 2019 for a front-month contract. Short-term weather forecasts have turned cooler again for some parts of the country, “after a storage injection was announced by the EIA [Thursday] which was slightly above consensus,” said Christin Redmond, commodity analyst at Schneider Electric, in a note. Also read:Lumber futures climb to a record and more than double for the year, as pandemic boosts demand"}]}