{"article": [{"url": "https://www.marketwatch.com/story/heres-how-goldman-says-the-sp-500-would-react-to-more-us-china-tariffs-and-why-novembers-election-result-is-key-2020-08-11", "published": 1597226120.0, "headline": "Hereâ\u0080\u0099s how Goldman says the S&P 500 would react to more U.S.-China tariffs and why Novemberâ\u0080\u0099s election result is key", "body": "Bubbling tensions between the U.S. and China, reignited by a dispute over video-sharing app TikTok and further escalated through Hong Kong sanctions, have seemingly taken a back seat for now but are never far away from investorsâ\u0080\u0099 minds. Goldman Sachs analysts have mapped out the expected responses of key assets to various trade war scenarios, including more tariffs. The estimates are based on analysis of seven tariff announcements aimed at China in 2019, three of them intensifying and four reducing the tariff risk. They said an unexpected $10 billion increase in U.S. tariffs on China would lead to an estimated 1.2% decline in the S&P 500 SPX, +0.87% Â and a 2.2% fall in Chinese equities, while USD/CNH USDCNH, -0.71% Â would rise 0.7%. The 1.2% decline in the S&P 500 was large in comparison to the tariff threat itself, they said, as a $10 billion increase in U.S. tariffs would only account for 0.5% of corporate profits. The disproportionate response was down to the perceived threat of Chinese retaliation and broader risks to trade policy. Conversely, a $30 billion reduction in tariff revenue would lead to an estimated 4% rise in the S&P 500. Analysts Dominic Wilson and Vickie Chang said the estimates could be used to benchmark the potential impact of a Joe Biden presidency versus a Trump second term. â\u0080\u009cA second Trump term would likely see some prospect of continued, and perhaps increased, fear of ongoing tariff increases, particularly given the deterioration in U.S.-China relations over the course of the last few months,â\u0080\u009d they said. â\u0080\u009cWhile a Biden presidency is unlikely to improve the outlook for the broader U.S.-China relationship, it is less likely a new administration would regard tariffs threats as the â\u0080\u009cweapon of choiceâ\u0080\u009d and might instead favor a more multilateral approach,â\u0080\u009d they added. Goldman said the impacts estimated were only those due to trade policy alone, but also said trade policy shifts under Biden could mitigate pressure on U.S. stocks from potential corporate tax changes. The chart This chart from Fundstrat Global Advisors shows that daily cases in the U.S. are continuing to fall week on week, with yesterday being the lowest Monday in six weeks, and the lowest overall since June 29. Source: COVID-19 Tracking Project and Fundstrat."}]}