{"article": [{"url": "https://www.marketwatch.com/story/do-these-simple-things-to-turn-your-retirement-savings-into-big-money-2020-07-02", "published": 1594486460.0, "headline": "Do these simple things to turn your retirement savings into big money", "body": "There isn’t much about the future that I can predict, much less guarantee to investors. But here’s one thing I can guarantee: If you achieve as little as 0.5% extra annualized return on your portfolio while you’re accumulating assets — and continue to do so while you’re retired — you will be many, many dollars ahead. The difference can change your life as well as the lives of your eventual heirs. Much of your investment returns will be determined by things outside your control. • Were you fortunate enough to be born into a family that provided you with a good education, good financial examples, and maybe even a trust fund? • Or did you have to scramble for every dollar and every advantage? • When you’re near retirement or when you finally do make the leap, does the market suddenly take a big turn for the worse and force you to say goodbye to a lot of the money you have saved? Those and other major factors such as your health certainly shape your financial future. But how well you do financially over a lifetime is also affected by how well you play whatever cards fate deals you. A good place to start is to grasp just how big a deal that paltry 0.5 percentage point of long-term really is in the long term. Imagine you and your twin sister are celebrating your 21st birthday together. You decide you’ll each invest $5,000 at once and add the same amount on every subsequent birthday until you reach the “new” expected retirement age of 67. Now imagine that — for whatever reason — your sister achieves an annual return of 8.5% for that whole period, while your own retirement money earns only 8%. Let’s ignore taxes and assume you’ll each do this within a Roth IRA. Your first investment occurs on your 21st birthday, your final one on your 66th birthday. Those 46 investments cost each of you $230,000. On your 67th birthday, you and your sister compare notes as you prepare to take your first annual retirement withdrawal. You both agree that on this and every subsequent birthday, you’ll each take out 4% of the balance in your account. If you have carried out this plan faithfully, your Roth IRA should be worth about $2,259,500; your sister’s should be worth about $2,657,300. Just that difference, nearly $400,000, is considerably more than all the annual savings that either of you added over the years. Your sister’s higher portfolio value on your shared 67th birthday is the first of three financial results she gets for earning an extra 0.5% along the way. The other two are bigger. You withdraw 4%, or $90,380, for the following year to supplement your Social Security (which we hope will be there) and the other resources you have to support your retirement. Your sister’s first 4% withdrawal is $106,292 — giving her noticeably more for that first year of retirement. (Maybe she’ll pick up the bill the next time the two of you go to dinner!) Let’s assume you and your sister are in good health and can expect to live another 30 years, until you’re 97. Let’s assume also that once you’re retired, you each scale back your investment portfolios to take less risk by investing more in bond funds and less in equities. And (this is crucial) let’s assume your sister continues for whatever reason to earn 0.5% more than you during retirement. If your Roth IRA earns 6% during retirement and you continue taking out 4% every year, by your 96th birthday you will have taken out a total of $3.54 million — a huge return on those $5,000 investments you made over the years. This is the second of the three financial results from your long-term plan. And your sister? She will have been able to take you out to dinner many, many times during retirement. Her total withdrawals will equal $4.48 million. So far, that extra 0.5% return has been worth nearly $950,000 to her. The third financial result from all this is the amount each of you has left on your 97th birthday when (for purposes of this example only) we will assume your lives end. Your Roth IRA will be worth $3.81 million at that point, making your heirs very grateful for your long-term investment success. Your sister’s account will be worth $5.16 million, amply rewarding her heirs for that extra 0.5% return over many, many years. Here’s what could be considered the “final score” between these two portfolios: • The total of all your retirement withdrawals plus what’s left is $7.35 million. • The comparable total for your sister: $9.64 million. That difference — about $2.3 million — resulted from just one thing: the extra 0.5% of return over a long lifetime. I can’t guarantee you (or your sister, for that matter) will be able to achieve returns of 8.5% or 8% or 6.5% or 6%. But I CAN guarantee that an extra 0.5% return will make an enormous long-term difference. And I can guarantee you’ll get at least that much extra return (and perhaps considerably more) from doing a few relatively simple things that are under your control. Here are three places to get that 0.5% advantage. • First, invest in mutual funds with lower expenses. A typical actively managed fund charges annual expenses of 1%. A typical index fund charges much less than one-half that amount. Check. • Second, bump up your portfolio’s equity allocation by 10 percentage points. Over the past half a century, for example, a switch from 50% in equities to 60% has added more than 0.5% in extra return. Check. • Third, invest in the S&P 500 index SPX, +0.87%, but add equity asset classes that have long histories of outperforming that index with little or no extra risk. Here’s an easy and very effective way to do that. And here’s an even simpler way. That third step is called diversification, and it’s one of the smartest things investors can do. Just these three simple steps, all completely within your control, will make a huge difference in the long term. As these numbers show, little things can mean a lot. Guaranteed. Richard Buck and Daryl Bahls contributed to this article."}]}