{"article": [{"url": "https://www.marketwatch.com/story/the-world-is-on-the-cusp-of-a-new-era-says-deutsche-strategist-and-heres-what-it-means-for-markets-11599589831", "published": 1599902360.0, "headline": "Millennials to redistribute wealth from older generations to the young in new 'age of disorder,' warns Deutsche strategist", "body": "It probably won't take a great deal of persuasion to convince investors that there's an \"age of disorder.\" That's the title of a new Deutsche Bank research note, which says the world is entering its sixth distinct era of modern times. So say goodbye to the \"era of globalization\" and brace yourself for the \"age of disorder\" where millennials, firmly established as the generation of 'have nots', take their revenge and redistribute wealth from the old to young. Millennials are usually defined as those between the ages of 22 and 38 years old in 2019, according to Nielsen Media Research . The note by strategist Jim Reid warns the discussion of inequality within and between countries will not be limited to wealth and income. \"In fact, an issue that is quickly emerging as a political force is the intergenerational gap,\" the report says. \"Assuming life does not become more economically favourable for Millennials as they age (many find house prices increasingly out of reach), this could be a potential turning point for society and start to change election results and thus change policy.\" Read: Millennials' shifting tastes are boosting sales of whiskey and tequila The votes for Brexit in the U.K. and President Donald Trump in the U.S. in 2016 left many younger people feeling angry and alienated by political decisions that a sizable majority of them were against, the report says. This could see the revenge of the millennials as they take more control and skew policies to redistribute wealth away from older generations to the young. \"Such a shift in the balance of power could include a harsher inheritance tax regime, less income protection for pensioners, more property taxes, along with greater income and corporates taxes . . . and all-round more redistributive policies\", the Deutsche Bank report said. The 'new' generation might also be more tolerant of inflation insofar as it will erode the debt burden they are inheriting and put the pain on bond holders which tend to have a bias towards the pensioner generation and the more wealthy. \"The older generation may also have to be content with lower (or even negative) asset price growth if the younger generation does not have a sudden income boost. This will be a big break from the status quo and lead to far more disorder than in the prior era of globalisation.\" Read: Gen Z, Millennial Investors Embrace Risk Amid Covid: E*Trade The report suggests 2020 may be the start of a new era, as the coronavirus pandemic brings the era of globalization since 1980 to a close. \"The era of globalisation to we are likely waving goodbye saw the best combined asset price growth of any era in history, with equity and bond returns very strong across the board. The Age of Disorder threatens the current high global valuations, especially in real terms,\" said the report. What will this new age bring? â\u0080¢ Deteriorating US/China relations and the reversal of unfettered globalisation. â\u0080¢ A make-or-break decade for Europe, with muddle-through less likely following the economic shock of COVID-19. â\u0080¢ Even higher debt. â\u0080¢ Inflation or deflation? As a minimum, it is unlikely it will calibrate as easily as we saw over the last few decades. â\u0080¢ Inequality worsening before a backlash and reversal takes place. â\u0080¢ The intergenerational divide also widening before millennials and younger voters soon start having the numbers to win elections and, in turn, reverse decades of policy. â\u0080¢ Linked to the above, the climate debate will build, with more voters sympathetic and thus creating disorder. We're in the midst of a technology revolution with astonishing equity valuations reflecting expectations for a serious disruption to the status quo, the report says, questioning whether this is a revolution or bubble? Much depends on whether working from home becomes more permanent, and if so it predicts it will cause major changes to societies and economies. Tesla TSLA, +1.89%, Amazon AMZN, +3.01% and Facebook FB, +0.26% are all companies that have seen their valuations soar in recent times on Nasdaq COMP, +1.39%. Read: Opinion: China's economy may be back on track, but problems plague it elsewhere The most worrying prediction is an economic battle between the U.S. and China. \"The result of the US election in November is unlikely to change the direction of travel,\" the report says. \"Over the course of this decade, relations will likely deteriorate into a bipolar standoff as both the US and China seek to prevent encirclement by the other. Companies that have embraced globalisation will be stuck in the middle if relations sour as we fear.\" There have been 16 occasions over the last 500 years, when a rising power has challenged the ruling one, and on 12 occasions it ended with war. One piece of solace is the report notes that military conflict is unlikely. Watch: Donald Trump suggests 'decoupling' US economy from China div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; }"}]}