{"article": [{"url": "https://www.marketwatch.com/story/uk-edges-closer-to-second-national-lockdown-to-help-contain-second-coronavirus-wave-2020-09-18", "published": 1600435400.0, "headline": "U.K. edges closer to second national lockdown to help contain second coronavirus wave", "body": "The U.K. government has been advised by its leading scientific experts to proclaim a national lockdown to help contain a second coronavirus spike, as health secretary Matt Hancock declined on Friday to comment on whether such a measure would have to be taken in the coming weeks. - Many U.K. regions and cities are currently under local lockdowns, after infections started rising significantly in August, following other European countries such as Spain and France. The latest restrictions were ordered in Newcastle and other English northeast cities on Thursday. But the government had until now pledged to do everything possible to avoid such measures on a national scale. - According to the Financial Times, the government’s scientific advisers have suggested a two-week lockdown that would coincide with the October school holiday, to avoid the punitive economic price inflicted on the country by the first lockdown, which lasted from March to May. - The government’s hope is that the new restrictions, which will involve the renewed closure of restaurants and other hospitality businesses, might act as a ‘circuit break’ while schools and workplaces would remain open. There is already a ban on social gatherings of more than six people, with limited exceptions. - The U.K. is also trying to cope with insufficient testing capacity amid a surge in demand for tests. Officials said the situation may last until the end of October, which will make it difficult in the next few weeks to assess the actual impact of the pandemic. Read: WHO warns of ‘serious situation unfolding’ in Europe as COVID-19 cases climb The outlook: Prime Minister Boris Johnson has said that he would do the utmost to try to “protect the economy,” after the U.K. suffered Europe’s most severe gross domestic product decline on the virus’ impact. And Hancock insisted on Friday that a return to drastic restrictions would be “the last line of defense.” But the government will be struggling to avoid painful measures if infections keep rising, especially if it is deprived of the indicators it needs to accurately assess the situation. Read:Biden to Brexit Britain: No trade deal with U.S. if you mess with Ireland"}]}