{"article": [{"url": "https://www.marketwatch.com/story/beyond-meat-partners-with-alibaba-for-new-china-push-2020-06-30", "published": 1593584420.0, "headline": "Beyond Meat partners with Alibaba for new China push", "body": "Beyond Meat Inc. is making its retail-store debut in China through a partnership with Alibaba Group Holding Ltd. The maker of plant-based meat announced late Tuesday that it plans to make its Beyond Burger available in 50 Freshippo stores in Shanghai starting this weekend. Freshippo stores are Alibaba’s BABA, -0.26% futuristic supermarkets that aim to better merge the physical and digital shopping experiences. Beyond Meat BYND, +0.80% intends to expand the partnership as the year goes on, bringing the Beyond Burger to 48 more Freshippo locations in Beijing and Hangzhou. The product will be available on Freshippo’s app as well so that customer can arrange for on-demand delivery. The move is Beyond Meat’s latest in China, following recent partnerships with Starbucks Inc. SBUX, +0.53% as well as Yum Brands Inc. YUM, +0.08% chains KFC, Pizza Hut and Taco Bell. The company also has an agreement with Sinodis, a food distributor. Read: Starbucks teams with Beyond Meat and others to launch plant-based menu in China “We know that retail will be a critical part of our success in China, and we’re pleased to mark this early milestone within a few months of our market entry,” Beyond Meat Chief Executive Ethan Brown said in a release. He said that retail stores mark the “natural next step in building our market presence” as they introduce the Beyond Burger to “home cooks throughout China.” A Freshippo executive hinted at a further expansion of the partnership down the line. “We have seen a growing interest in plant-based meat among our shoppers and look forward to offering more Beyond Meat products in the future,” said Freshippo merchandising chief Jiayu Zhao, in a statement. BTIG analyst Peter Saleh had expressed optimism about Beyond Meat’s potential in China prior to the latest announcement. “We believe China will be a strategic growth market for Beyond Meat for many years to come,” Saleh wrote in a June 8 note as he cheered “the sales potential from future partnerships around the globe.” Don’t miss: Impossible Foods, Beyond Meat see spike in demand as coronavirus wreaks havoc on meat supply Beyond Meat shares have doubled over the past three months as Alibaba shares have added 13%. The S&P 500 SPX, +0.87% is up 18% in that span."}]}