{"article": [{"url": "https://www.marketwatch.com/story/after-seeing-the-highest-daily-spike-in-coronavirus-cases-california-made-face-masks-mandatory-heres-why-other-states-may-want-to-follow-its-lead-2020-06-19", "published": 1592924240.0, "headline": "As coronavirus cases surge, California is the latest state to require face masks â\u0080\u0094 why other states may want to follow its lead", "body": "There are several reasons why some Americans might refuse to wear a face mask, even in states where it is required. It could be an act of rebellion, which is not an uncommon response in times of heightened uncertainty. It could be related to oneâ\u0080\u0099s gender, political affiliation, or because of skepticism about whether wearing masks limits the spread of the coronavirus. For people in that last camp, thereâ\u0080\u0099s new evidence to consider. At least 230,000 cases of coronavirus may have been prevented due to government orders requiring face masks in 15 states and the District of Columbia, according to a new study by two University of Iowa professors, Wei Lyu and George Wehby, published in â\u0080\u009cHealth Affairs,â\u0080\u009d a peer-reviewed journal. (A second more fully edited version of the study is set to appear in the August issue of Health Affairs.) Last week, California became the latest state requiring masks, issuing a state mandate that most of the stateâ\u0080\u0099s nearly 40 million residents wear face masks in public. Previously only essential-business employees had been required to wear them. Donâ\u0080\u0099t miss: Wearing masks is â\u0080\u0098all we haveâ\u0080\u0099 to try to reduce the spread of coronavirus, former FDA commissioner says However, over the weekend, the state reported 4,515 new cases of coronavirus, a daily record., and similar levels in subsequent days, bringing the number of cases in that state to over 178,000, Gov. Gavin Newsom, a Democrat, said Monday. Thus far, 5,521 people have died from the disease. States including Arizona, Florida and Texas â\u0080\u0094 where daily cases of coronavirus have all recently hit record highs â\u0080\u0094 donâ\u0080\u0099t have state-wide mask mandates and all reported new daily cases at or above 4,000. In Arizona and Texas, Republican governors have given mayors the authority to mandate masks in their respective cities, but mayors in Florida have not been given the same authority. “ The study estimates that after 21 days after mandating facial covers in public, daily cases of coronavirus declined by 2% ” The study estimated the effects of face mask mandates on the daily county-level growth rate of COVID-19 cases in states that issued face mask rules between April 1 to May 21. Researchers looked at county-level case data in these states starting on March 25, nine days before the U.S. Centers for Disease Control and Prevention recommended that Americans wear face cloth coverings in places where it is hard to maintain six feet of distance from other people. Related: Some Americans are more likely to socially distance and wear face masks than others â\u0080\u0094 hereâ\u0080\u0099s why Based on the model the authors created, which controlled for factors such as shelter-in-place orders and the effect of other social distancing measures, â\u0080\u009cwe can simulate how the number of [coronavirus] cases might have changed without these mandates in place,â\u0080\u009d Wehby said. Ultimately, the study estimated that 21 days after mandating facial covers in public, daily cases of coronavirus declined by 2%. In total, that amounts to â\u0080\u009cas many as 230,000 â\u0080\u0093 450,000 cases may have been averted due to these mandates by May 22,â\u0080\u009d the study states. New York requires all residents to wear masks in public and in places where they canâ\u0080\u0099t practice social distancing. But many states only require masks for essential-business employees and their patrons while on the premises. Some states only require essential employees to wear them. Meanwhile, many states donâ\u0080\u0099t have any mask requirements and instead just recommend that they are worn in public places. In the case of employee-only face mask mandates, the study found â\u0080\u009cno evidence of declines in daily COVID-19 growth rates.â\u0080\u009d â\u0080\u009cAs countries worldwide and states begin to relax social distancing restrictions and considering the high likelihood of a second COVID-19 wave in the fall/winter, requiring use of face masks in public might help in reducing COVID-19 spread,â\u0080\u009d the study concludes."}]}