{"article": [{"url": "https://www.marketwatch.com/story/facebooks-zuckerberg-was-reportedly-talked-out-of-making-moves-against-trump-as-far-back-as-2015-2020-06-28", "published": 1593373640.0, "headline": "Facebook's Zuckerberg was reportedly talked out of making moves against Trump as far back as 2015", "body": "Facebook Inc. Chief Executive Mark Zuckerberg reportedly wanted to remove an incendiary post by then-candidate Donald Trump as far back as 2015, but was convinced instead to change Facebook's rules to allow such posts in the name of political discourse. The Washington Post reported Sunday that Trump's 2015 video post calling for a ban on Muslim immigrants drew outrage by many senior Facebook leaders, including Zuckerberg, who at first wanted it to be taken down. But Zuckerberg was talked out of removing the post by other senior executives, including Joel Kaplan, Facebook's vice president of global policy and its most prominent Republican executive, and the company instead created an allowance for controversial political discourse that prevented such posts from violating community standards, the Post reported, citing sources and internal documents. Among the issues debated during discussions over the posts were \"PR risks,\" the Post reported. The Post also reported that in 2016, Zuckerberg was also talked out of writing a post condemning Trump's call to build a border wall with Mexico, after advisers warned Zuckerberg that it would look like he was taking sides. Such moves to appease paved the way for Trump and other world leaders, such as Brazil's President Jair Bolsonaro, to post inflammatory content with little consequence. For years, Facebook has stood by its approach despite much criticism. \"Facebook shouldn't be the arbiter of truth,\" Zuckerberg told Fox News during a May interview. The Post's report Sunday came as Facebook FB, +0.26%  is facing a growing employee revolt and advertiser boycott over its hands-off policy toward misinformation and inflammatory speech. On Friday, Zuckerberg announced policy changes intended to reduce hateful content and misinformation on the platform, saying Facebook will now block content that is hateful or intended to hinder the voting process, even in posts by politicians. Still, major advertisers are yanking their Facebook ads, at least temporarily, following pressure from the #StopHateforProfit campaign started by civil rights groups. On Sunday, Starbucks Corp. SBUX, +0.53%  announced it will \"pause\" all advertising on social-media platforms, following similar recent announcements by companies such as Coca-Cola Co. KO, +0.69%  , Verizon Communications Inc. VZ, +0.23%  and Unilever NV UN, +2.49%  . PepsiCo Inc. PEP, +0.42%  has also \"quietly\" joined the ad boycott, Fox Business reported. Facebook makes nearly all its money on advertising, and its shares sank more than 8% on Friday as the boycott list grew. Facebook shares are up 5.3% year to date, compared to the S&P 500's 6.9% decline this year."}]}