{"article": [{"url": "https://www.marketwatch.com/story/us-oil-prices-tumble-4-as-investors-fret-over-new-cases-of-coronavirus-2020-06-15", "published": 1592234180.0, "headline": "Oil settles higher as global production declines outweigh pandemic-related demand concerns", "body": "Oil futures gave up earlier losses to settle higher Monday, buoyed by declines in global crude production even as the potential for a fresh hit to energy demand climbed on the back of apparent global increases in new cases of coronavirus. “Traders in general seem to see upside risk from lower production and downside risk from the virus impact on the economy, and high stocks of crude close to parity,” said James Williams, energy economist at WTRG Economics. “So really, most moves [Monday] seem to be in the range of a relatively a neutral outlook.” West Texas Intermediate crude for July delivery CL.1, -1.62% US:CLN20, the U.S. benchmark, tacked on 86 cents, or 2.4%, to settle at $37.12 a barrel on the New York Mercantile Exchange after trading as low as $34.36. WTI had marked a weekly slide of 8.3% on Friday. Global benchmark Brent oil for August delivery UK:BRNQ20 rose 99 cents, or 2.6%, at $39.72 a barrel on ICE Futures Europe. Prices reversed course after a drop to as low as $37.24 in Monday’s session, which followed a 8.4% decline last week. Both Brent and WTI last week posted their first weekly loss in 7 weeks. Earlier declines in prices followed a warning from oil giant BP PLC that the COVID-19 pandemic will have a lasting economic impact, hurting demand for oil and weighing on energy prices. The energy giant also wrote down as much as $17.5 billion of its assets, noting that the public health crisis may force it to leave fallow some of its energy production assets. “Beijing is having a resurgence of the pandemic, casting doubts that the Americans and Europeans will see much of a break from the virus as it is expected to be back this Fall,” said Edward Moya, senior market analyst at Oanda, in a market update. “If the coronavirus continues to see a scattered number of new hotspots, global air travel will not return to pre-pandemic levels anytime soon.” China shut down a produce market in Beijing after a number of new coronavirus infections, while U.S. states, including Florida, California, and Arizona, among others, were seeing infections increase, raising fresh doubts about reopenings and the path for recovery from countries that are facing a recession due to efforts to limit the spread of the deadly pathogen. Still, in a daily report, Phil Flynn, senior market analyst at The Price Futures Group, said it is “too early to predict another shutdown of the global economy.” “Oil should focus on what seems to be a better outlook when it comes to a rebalancing of global oil supply,” he said, pointing out that the market is seeing “better compliance with the most significant [OPEC+] production cut in history, which increases the odds that the reduction will be extended until the end of the year.” Earlier this month, the Organization of the Petroleum Exporting Countries and its allies extended production cuts of 9.7 million barrels a day by one month, through July. Moya said Monday that oil’s rebound from the lows also “came from reports that Iraq was living up to their end of the OPEC+ production cuts.” Meanwhile, production in the U.S., which isn’t part of the OPEC+ output agreement, has shown signs of further declines, with the Energy Information Administration on Monday forecasting a July decline of 93,000 barrels per day in oil production from seven major U.S. shale plays. Some economic data, meanwhile, have improved. In the U.S. Monday, the New York Fed’s Empire State Manufacturing Survey showed that business activity steadied in New York in June. The Empire State business conditions index rose 48 points to negative 0.2 in June. “Looking ahead, we expect some consolidation in oil prices here as economic data has been largely better than feared, while the future remains very uncertain regarding the prospects of a ‘second wave’ that could cripple the energy supply chain for a second time in just three months...especially with the July WTI contract set to expire next week,” said Tyler Richey, co-editor at Sevens Report Research. Back on Nymex, prices for petroleum products ended higher along with oil. July gasoline US:RBN20 rose 3.7% to $1.1657 a gallon and July heating oil US:HON20 added 3.2% to $1.137 a gallon. July natural gas US:NGN20 settled at $1.669 per million British thermal units, down 3.6%. Read:Why natural-gas prices haven’t yet bottomed despite this year’s 20% drop"}]}