{"article": [{"url": "https://www.marketwatch.com/story/imf-study-says-lockdowns-may-pay-off-in-the-long-run-for-economy-but-are-a-drag-now-11602164769", "published": 1602151700.0, "headline": "IMF study says lockdowns may pay off in the long run for economy but are a drag now", "body": "Students maintain social distancing in a large marquee erected by the university to create an additional socially distanced rest area to help mitigate the spread of the novel coronavirus COVID-19, at the University of Bolton, in Bolton, northern England on October 7, 2020. oli scarff/Agence France-Presse/Getty Images The stricter the lockdown, the greater the impact on the economy, the International Monetary Fund said Thursday in a new study that nonetheless argues the restrictions may pay off in the long run for the economy. The IMF examined 52 countries, across advanced, emerging and developing economies, and a variety of economic statistics. Even controlling for how bad the COVID-19 situation is, lockdowns had a negative impact on the economy. More stringent lockdowns are associated with lower consumption, investment, industrial production, retail sales, purchasing managers’ indexes for the manufacturing and service sectors, and higher unemployment rates, the IMF found. But the IMF also notes that voluntary social distancing also changes behavior. The IMF found a doubling of daily cases leads to a contraction in mobility by around 2%, and that particularly in advanced economies, voluntary social distancing had roughly the same impact on mobility as lockdowns. People feel uncomfortable with resuming mobility when lockdowns are lifted if they still perceive a considerable risk of contracting or spreading the virus, the IMF said. “The importance of voluntary social distancing coupled with the modest boost to mobility from easing lockdowns suggest that economies will likely operate below potential as long as health concerns persist,” the IMF found. The IMF said “policymakers should be wary of removing policy support too quickly and consider ways to protect the most vulnerable and support economic activity consistent with social distancing.” The IMF study found that lockdowns do work in reducing COVID-19 infections. A stringent lockdown leads to a reduction in cumulated infections of about 40% after 30 days. “By bringing infections under control, lockdowns may thus pave the way to a faster economic recovery as people feel more comfortable about resuming normal activities. In other words, the short-term economic costs of lockdowns could be compensated through higher future economic activity, possibly even leading to positive net effects on the economy,” the IMF said. Drawing on data from mobile operator Vodafone VOD, +0.41%, the IMF also found that lockdowns tend to have a greater impact on mobility for women than men, as well as the young. The IMF said lockdowns disproportionately impact women because of their greater share in caring for children, and on the young because they are more likely to rely on labor income and have less stable jobs."}]}