{"article": [{"url": "https://www.marketwatch.com/story/these-boomers-just-made-massive-retirement-mistakes-dont-be-one-of-them-2020-08-03", "published": 1596888260.0, "headline": "These boomers just made massive retirement mistakes â\u0080\u0094 donâ\u0080\u0099t be one of them", "body": "Remember that 1980s Pat Benatar anthem â\u0080\u009cLove Is a Battlefieldâ\u0080\u009d? Well, someone ought to cover it and change the lyrics to â\u0080\u009cRetirement Is a Minefield.â\u0080\u009d Read: Boomers are doing retirement their own way Thatâ\u0080\u0099s what many baby boomers are learning or relearning the hard way. Already out of the workforce or on the brink of retirement, these folks have been hit by the triple whammy of the coronavirus pandemic, the deepest recession since the Great Depression, and a huge market selloff that took the Dow Jones Industrial Average DJIA, +0.56% Â and S&P 500 index SPX, +0.87% Â down by a third (though both have recovered nearly all their losses). 80% of older Americans can't afford to retire - COVID-19 isn't helping This has sent professional investors scurrying, although the omniscient millennial day traders on Robinhood might be raking in hundreds and saying â\u0080\u009cno problemo.â\u0080\u009d The rest of us, who have to figure out how to make our money last through an indeterminate lifespan, are, to put it mildly, confused. And when people are confused, they make mistakesâ\u0080\u0094sometimes big ones. An article in The Wall Street Journal recently illustrated that perfectly (subscription required). It focused on two 60-something boomersâ\u0080\u0094an ophthalmologist and a contractorâ\u0080\u0094who made the polar opposite errors. One owned too much stock and sold nearly all of it at the bottom in March. The other got out of stocks during the last crash of 2008-2009 and never got back in. What these mistakes have in common is that the two boomers lacked a clear financial plan or the discipline to stick with one. And in an all-too-human way, they let their emotions get the best of them. Dr. Craig Sklar, the Journal reported, â\u0080\u009csold much of his stockholdings at a loss between January and early March.â\u0080\u009d He still holds some stock now, but how has â\u0080\u009cmore cash as a percentage of his portfolio than he has in decades.â\u0080\u009d He wasnâ\u0080\u0099t alone. According to Fidelity Investments, of the 7.4% of investors ages 65 and up who made a change to their portfolio between February and May, nearly a third moved some money out of stocks. That means they panicked and sold at the very worst time, missing the snapback stock rally engendered by Congressâ\u0080\u0099s fiscal stimulus and the Federal Reserve. Boomers took a disproportionate hitâ\u0080\u0094of the 6.9% of investors across all age groups who made a change to their portfolio between February and May, 18% moved some money out of stocks, Fidelity reported. â\u0080\u009cI donâ\u0080\u0099t have 10 to 15 years left to recover my losses,â\u0080\u009d Sklar explained to The Journal, a rationale that must have motivated many boomersâ\u0080\u0099 panic sales. â\u0080\u009cAt some point, Iâ\u0080\u0099ll need my cash to live on.â\u0080\u009d At some point. But not now. Weâ\u0080\u0099ll get back to that later. The story did not say what percentage of his retirement portfolio Sklar held in stock, but he recommends his 30-something children keep 100% of theirs in equities. In the first quarter of 2019, only 7% of Fidelityâ\u0080\u0099s investors had their 401(k)s invested 100% in stocks, half the percentage it was in 2009. Thatâ\u0080\u0099s progress, but who knows how many boomers had 80% or more invested in equities whose risk they had discounted or downplayed? The other boomer featured in the story, Phillip Eberlin, 66, owns a woodwork-restoration business in the Chicago area. He planned to retire in a couple, of years but work has dried up with the coronavirus lockdowns and bad economy. â\u0080\u009cWhat Iâ\u0080\u0099d rather not do is invest at this point and then see the market plunge 40 to 50%,â\u0080\u009d said Eberlin, who has much of his retirement money in certificates of deposit and cash, which earn almost nothing. And there you have the conundrum for people close to retirementâ\u0080\u0094how much to risk in a stock market that has seen two 50% crashes and one 30% selloff over the last 20 years? Granted, things may be even more out of whack now, with what seems like a permanent Fed â\u0080\u009cputâ\u0080\u009d on the stock market. But the answer to that question is not 100% in stocks (way too risky) or zero (you miss any opportunity to see your money grow over time). I think itâ\u0080\u0099s closer to 50% stocks if youâ\u0080\u0099re in your 60s or approaching your retirement target year. Thatâ\u0080\u0099s actually what most Americans own, especially as they age. But Iâ\u0080\u0099d also keep at least three years of projected expenses in cash or liquid assets. One way to determine that is by calculating your annual Required Minimum Distributions (RMDs) from your retirement accounts. For every 5% more in stock you want to hold, Iâ\u0080\u0099d keep an additional year of expenses in cash. So, if you have 60% in stock, you should have five yearsâ\u0080\u0099 worth of cash. But no more. The cash is there for psychological reasons as well, to keep you from selling at the bottom or not investing in stocks at all. As we age, we donâ\u0080\u0099t have the time to recoup our losses. But we still canâ\u0080\u0099t afford to stay out of the game entirely. So, youâ\u0080\u0099ll need a plan and the cash that allows you to stick to it. Note: An earlier version of this column contained Fidelity data that was incorrectly reported in a Wall Street Journal article. It has been corrected."}]}