{"article": [{"url": "https://www.marketwatch.com/story/the-extra-600-in-weekly-unemployment-benefits-expired-but-gig-workers-and-self-employed-americans-still-qualify-for-benefits-2020-08-13", "published": 1597560500.0, "headline": "The extra $600 in weekly unemployment benefits expired â\u0080\u0094 but gig workers and self-employed Americans still qualify for benefits", "body": "For the first time during the pandemic, weekly jobless claims dipped below 1 million, but there are likely many more Americans who qualify for unemployment benefits who didnâ\u0080\u0099t apply. When the $2 trillion CARES Act passed in March, self-employed, independent contractors, gig workers and other nontraditional workers became eligible for unemployment benefits. Even though the federally-funded $600 a week in enhanced unemployment benefits, which was also part of the CARES Act, expired on July 31, these types of workers can still collect state-level unemployment benefits through the end of the year. “ â\u0080\u0098There is definitely a chance that the loss of the $600 is changing claimant behaviorâ\u0080\u0099 ” â\u0080\u0094 Michele Evermore, a senior policy analyst at the National Employment Law Project This nuance may have been lost in translation when the $600 benefit expired, said Michele Evermore, a senior policy analyst at the National Employment Law Project, an advocacy organization focused on workersâ\u0080\u0099 rights. â\u0080\u009cThere is definitely a chance that the loss of the $600 is changing claimant behavior,â\u0080\u009d she said, meaning that unemployed workers may have wrongly assumed that they would no longer be eligible for unemployment benefits after July 31. A total of 10 million Americans have already been approved for unemployment benefits who otherwise would have been ineligible if not for the CARES Act, Evermore said. Unemployment benefits are based on how much money a worker earned while they were employed. For traditional salaried workers, that amount gets automatically reported to state workforce agencies. But self-employed and gig workers often lack the ability to provide an exact net earnings amount, Evermore said. â\u0080\u009cBut if they can prove that they worked and got income or were offered a job and that job offer was rescinded due to COVID-19,â\u0080\u009d she said, they can collect what amounts to half of the average weekly unemployment benefit in their state. “ In all 50 states and Washington D.C., the minimum amount is over $100 a week ” In many cases that will enable them to collect more in unemployment benefits than they would if they had a traditional job where their earnings were reported automatically, Evermore told MarketWatch. At a minimum, gig workers, independent contractors and other self-employed workers can collect the equivalent of the average weekly benefit in their state. In all 50 states and Washington D.C., the minimum amount is over $100 a week, according to the Department of Labor. Thatâ\u0080\u0099s especially important because it means these types of workers will be eligible for an additional $300 a week under President Donald Trumpâ\u0080\u0099s executive order. (Anyone who gets at least $100 in unemployment benefits from their state would qualify for the extra $300.) However, it could be some time before these workers actually get those benefits. State governors have said that state workforce agencies are not properly equipped to quickly implement the changes Trumpâ\u0080\u0099s executive order calls for. Evermore said she hopes that Congress will consider extending the period of time gig and self-employed workers can collect unemployment benefits, but she is â\u0080\u009cworried we will reach a deadlock on this in December like we are seeing now with the $600.â\u0080\u009d"}]}