{"article": [{"url": "https://www.marketwatch.com/story/after-his-latest-firing-this-cannabis-entrepreneur-raised-150-million-for-a-hemp-venture-during-a-pandemic-2020-07-08", "published": 1594466900.0, "headline": "After his latest firing, this cannabis entrepreneur raised $150 million for a hemp venture - during a pandemic", "body": "After being fired from his last two jobs, Canadian entrepreneur Bruce Linton is back with a new venture and a new goal: to disrupt the industrial supply chain. The co-founder and former co-chief executive of Canopy Growth Corp. CGC, +2.49%  WEED, +1.80%, the Canadian cannabis market leader, raised $150 million in an initial public offering of a special-purpose-acquisition corporation, or SPAC, called Collective Growth Corp. CGROU, -1.17%, with the intent of using the proceeds to acquire hemp companies. Collective Growth started trading on the Nasdaq on May 1, and Linton and his partners rang the opening bell virtually. SPACs, or blank-check companies, have no business until they acquire or invest in one or more. The coronavirus pandemic had one positive effect on fundraising, Linton told MarketWatch in an interview. \"People have been at home, and they've been seeing the blue skies with less traffic and pollution,\" he said. \"It makes them think more of sustainability, and that's where the hemp plant comes in. If you deconstruct the plant, it can be used for sustainable building materials, and that's good at a time when people are aware there's a problem with the supply chain and the environment.\" The hemp plant has far less THC than related plants that produce cannabis and has long been used for industrial purposes. THC is the ingredient in cannabis that produces the high associated with cannabis use. The hemp plant can be used to make different kinds of fiber for use in paper and fabric and to make building blocks. Until late year, hemp was illegal in the U.S., classified as a controlled substance along with cannabis plants, but that was changed in the Farm Act of 2018, which legalized hemp but left cannabis's status intact as a Schedule I drug. See also: Attorney General Barr ordered antitrust probes of 10 cannabis mergers, because he dislikes the industry, prosecutor says The challenge now is to find companies to acquire, and Linton has set his sights firmly on Europe, which has a less rigorous regulatory regime. Europe never imposed the kind of ban on the hemp plant that the U.S. did. \"The best technology is in Europe,\" he said. \"Because they didn't get around to banning hemp, they have the best in field and some small and medium-size companies doing really interesting things in hemp.\" See: Leading Kentucky hemp processor GenCanna files for bankruptcy As a Nasdaq-listed company, Collective Growth has to remain in compliance with U.S. federal regulations. Bruce Linton on how to make money in the cannabis industry In addition to his hemp plans, Linton is also pursuing an interest in psychedelics, an area he believes has huge potential as a treatment for mental-health disorders such as depression, PTSD and opioid addiction. Linton is currently a director of Mind Med MMED, , which listed on the Canadian NEO Exchange on March 3, the first psychedelics company to do so. The company raised $24.2 million in a pre-IPO financing round and is backed by \"Shark Tank\" investor Kevin O'Leary. Mind Med is researching the use of drugs including LSD and MDMA as treatments for ailments such as anxiety. Linton is the chairman of Mind Med's compensation and governance committee. A typical week sees Linton talking to researchers in Switzerland, Ph.D.s in Paris and London, lawyers in Toronto and cannabis entrepreneurs across the U.S., he said. Linton admitted he did not resign from Vireo Health International Inc. VREO, +6.50% in June, as the company announced, but was fired. Linton had taken on the role of executive chairman last year, his first move after being fired from Canopy Growth in July 2019. That move came after pressure from Canopy's biggest investor, Corona brewer Constellation Brands Inc. STZ, +0.81%, which had pumped $4 billion into Canopy to make it the cannabis market leader. So has he had a moment of self-reflection after being pushed out of two companies in such a brief span of time? \"They are not similar events,\" he said. In the case of Canopy, Linton and co-founder Mark Zekulin founded and built a company with a $16 billion market cap that operated in 16 countries. \"The last funds of $4 billion came with operating directions that did not align with my vision,\" he said. \"Fired.\" Vireo, meanwhile, \"chased me for six months, as they needed help.\" Linton joined the company and drummed up an investment of more than $8 million during the pandemic, he said. \"They want to do things differently than me. They did not need to fire me, but they chose to, as I would have been happy to leave. Not a standard method of exiting people consistent with my prior practice of exiting people with respect,\" he said. Vireo announcing Linton's departure simply said he had resigned. In the meantime, Linton is also involved in Ruckify.com, which he co-founded and in which he has a roughly 40% stake. Ruckify is an online peer-to-peer rental marketplace that allows people to rent equipment, household items, and other categories of goods that are rarely used but take up space. The company has been performing strongly during the pandemic, he said, sharing items including laptops, gym equipment, camping gear, trailers and tents. Collective Growth shares have gained 6% in the month to date, matching the Renaissance IPO ETF's IPO, +1.98%  gains. The S&P 500 SPX, +0.87%  has fallen 0.7%, and the Dow Jones Industrial Average DJIA, +0.56% has lost 3.7% [ See:Cannabis producer Canopy Growth reports another billion-dollar loss"}]}