{"article": [{"url": "https://www.marketwatch.com/story/the-irs-says-it-still-hasnt-opened-more-than-2-million-returns-this-tax-season-and-thats-an-improvement-2020-10-07", "published": 1602154580.0, "headline": "The IRS says it still hasnâ\u0080\u0099t opened more than 2 million returns this tax season", "body": "The Internal Revenue Service still has to process an estimated 2.5 million hard copy income tax returns within a pile of unopened mail that stands at 5.3 million pieces. Thatâ\u0080\u0099s according to IRS Commissioner Charles Rettig, who testified Wednesday on the agencyâ\u0080\u0099s efforts to dig out from a mountain of unopened mail that accumulated during coronavirus-related IRS office shutdowns in the spring. Rettig spoke to lawmakers, who have been getting an earful about the backlog. â\u0080\u009cWe are hearing from our constituents right and leftâ\u0080\u009d about the status of returns and refunds, said Rep. Jody Hice, a Republican from Georgia. Though thereâ\u0080\u0099s still a ways to go, the IRS has come a long way from the spring. There was a time in the March and April period when the IRS had 23 million pieces of unopened mail, Rettig noted. As of late June, the IRS had 12.3 million pieces of mail to work through. â\u0080\u009cI can certainly tell you our people are working really hard,â\u0080\u009d Rettig said at the U.S. House of Representativesâ\u0080\u0099 Subcommittee on Government Operations within the Committee on Oversight and Reform. Tax collection staff goes through 1.3 million pieces of mail a week, Rettig said, and it puts a priority on spotting hard copy returns and processing a refund, if one is due. Rettig didnâ\u0080\u0099t say how many of those still pending returns had refunds coming. But most returns result in a refund. Last year, more than 70% of returns ended with a refund for overpayment of income tax. The average refund this tax season was $2,741 as of late July, according to the most recently available IRS statistics. At that time, the IRS had received 152.8 million returns, which was up from the 146.3 million received at the same time last year. (However, the 2020 statistics also lump in the nominal returns generated this year when people who wouldnâ\u0080\u0099t typically file a tax return registered with the IRS for a $1,200 stimulus check.) By late July, the IRS had distributed 3.3 million fewer refunds than it had at the same point last year. This yearâ\u0080\u0099s tax filing and payment deadline was pushed to July 15, though taxpayers can also seek an extension until Oct. 15. The IRS has been juggling tax return processing with an earlier effort to churn out more than 160 million stimulus checks totaling over $270 billion, Rettig noted. The IRS is still trying to reach approximately 9 million people who are eligible for stimulus checks but havenâ\u0080\u0099t received theirs. See also: Good news: You now have until Nov. 21 to claim your stimulus check But some lawmakers said the agencyâ\u0080\u0099s hard work was no satisfaction to constituents in their districts who are still waiting for refunds. Hice wondered whether the IRS could clean up the backlog by the end of October, given its current rate. Rettig said he couldnâ\u0080\u0099t be sure because the IRS still receives between 300,000 and 500,000 pieces of mail each week. â\u0080\u009cI can vouch for the effort and I can vouch for the desire,â\u0080\u009d to process all the pending returns and potential refunds, Rettig said. â\u0080\u009cI thank you for your effort,â\u0080\u009d Hice said, â\u0080\u009cbut effort doesnâ\u0080\u0099t resolve the issue for people who are waiting.â\u0080\u009d Gerry Connolly, a Democrat from Virginia who chairs the subcommittee, said the current lags in service are the result of an IRS budget thatâ\u0080\u0099s been cut, aging computer systems and a workforce thatâ\u0080\u0099s shrunk over the years. â\u0080\u009cToday, when the American people are relying on the IRS the most, the agency is gasping for air.â\u0080\u009d He added, People canâ\u0080\u0099t afford to just wait. They need this financial assistance now.â\u0080\u009d"}]}