{"article": [{"url": "https://www.marketwatch.com/story/red-sweatered-midwesterner-ken-bone-isnt-voting-for-trump-but-hes-still-getting-blasted-by-biden-supporters-11602092368", "published": 1602082400.0, "headline": "Red-sweatered Midwesterner Ken Bone isn't voting Trump, but he's still getting blasted by Biden backers", "body": "Ken Bone Getty Images \"What does Ken Bone think of all this?\" asked nobody ever. Well, almost nobody. Newsweek just checked in with Bone, whose 2016 \"15 minutes of fame\" as an undecided voter was sullied by the discovery of his icky Reddit history, and found he's pretty much sticking to the same message he espoused four years ago. Basically, neither candidate excites him. \"To be perfectly honest, I'd say I'm uncommitted again,\" Bone explained. \"Very, very few people in either of these election cycles were truly undecided. They're uncommitted, which means that you don't really have a positive opinion of either candidate.\" Bone, who endorsed Andrew Yang earlier this year, slammed President Trump as a \"master of manipulating people\" and said Joe Biden isn't worthy of his support, either. The first presidential debate debacle only solidified his \"uncommitted\" stance. \"We kind of got what we expected. In a way, we almost got what we deserved, because we've all played our part in raising the temperature of political discourse,\" he said. \"It leads to a couple of people who are probably older than your grandparents, yelling at each other and telling each other to shut up, and talking over each other like drunk relatives at Thanksgiving. It was insanity.\" Here's the video of his comments: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } With that, \"Ken Bone\" quickly emerged as one of Twitter's TWTR, -0.23% top trending topics. As it often does with these things, it got ugly in a hurry. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Bone, after responding to several of the tweets, shared his conclusion with his 163,500 followers. iframe.twitter-tweet { width: 100% !important; } Bone eventually got off the \"uncommitted\" fence and announced his pick for 2020. \"I voted Clinton in '16 and this morning I sealed my mail in ballot having voted for Jo Jorgensen,\" he said. \"I don't agree with either of them 100% but felt they were the best options available to me at the time.\" Jorgenson, the Libertarian Party nominee, gladly accepted his vote: iframe.twitter-tweet { width: 100% !important; } -"}]}