{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-case-tally-climbs-above-48-million-as-trump-contradicts-health-experts-to-claim-virus-will-go-away-2020-08-06", "published": 1596721820.0, "headline": "Coronavirus update: U.S. case tally climbs above 4.8 million as Trump contradicts health experts to claim virus will 'go away'", "body": "The number of confirmed cases of the coronavirus that causes COVID-19 in the U.S. rose above 4.8 million on Thursday, a day after President Donald Trump again said the virus would just \"go away,\" while one of his leading public health experts said the virus is unlikely to be under control until late 2021. Dr. Anthony Fauci, head of the National Institute for Allergies and Infectious Diseases, told Reuters it's unlikely that the virus will be eradicated, as it is highly transmissible. His comments come after Dr. Deborah Birx, coordinator of the White House task force created to manage the pandemic, said this week that the deadly illness has become \"extraordinarily widespread\" in the U.S. - drawing a public rebuke from Trump - and urged Americans in states with rising cases to socially distance, wash their hands frequently and wear face masks. Facebook and Twitter removed a Trump post of a video clip from a Fox News interview, in which he said that children are almost immune to COVID-19, saying it breached their policies on coronavirus misinformation. Trump has made that argument several times as he pushes states to reopen schools on time and in person, often contradicting his own health experts. He reiterated the claim at midday Thursday outside the White House, saying that newspapers and \"the medical reports\" support his position. Children, including babies, have been infected with COVID-19. Some have died. Tom Frieden, a former head of the Centers for Disease Control and Prevention, told MSNBC on Thursday that \"anyone can open a school in a pandemic; keeping them open is going to be the challenge, and school systems and communities will need to do two things for that to happen successfully. \"First is control COVID in the community,\" said Frieden. \"If COVID is out of control, then you won't be able to keep the schools open. Second, make a number of adjustments in the school, keeping vulnerable old people out of the school, making sure that you're distancing, having mask use as near to universal as possible, going outside whenever you can, moving in pods or smaller groups, so that if there is a case it doesn't spread like wildfire throughout a school, but only affects a smaller group.\" In One Chart:'It spread like wildfire': This 'very scary' chart might have you reconsidering your plans for Sunday morning The topic of testing remains a concern after the Associated Press found that testing in the U.S. is actually falling even as infections remain high and the pandemic's death toll continues to rise by more than a 1,000 a day. An AP analysis found the number of tests being performed a day fell 3.6% in the last two weeks to 750,000, with the count falling in 22 states. Those include places like Alabama, Mississippi, Missouri and Iowa where the percentage of positive tests is high and continuing to climb, an indicator that the virus is still spreading uncontrolled. Read now:Russia stoking coronavirus disinformation online, U.S. says Plus:CDC warns that people are going blind and dying from drinking hand sanitizer Trump repeated his argument in an interview with Axios that aired on HBO earlier this week that testing is behind the rise in cases, yet again contradicting his own experts. On Tuesday, a group of six governors said they were joining forces to purchase millions of coronavirus tests in an effort to reduce the turnaround time that is making their testing efforts all but useless. In some instances, test results are taking two weeks to come back. The six states - Louisiana, Maryland, Massachusetts, Michigan, Ohio and Virginia - are working with the Rockefeller Foundation to expand the use of rapid point-of-care antigen tests in what they called the first interstate testing compact of its kind. Mike DeWine, the Republican governor of Ohio, went into self-isolation on Thursday after testing positive for the coronavirus in advance of Trump's visit to his state. Fauci Explains Why the U.S. Lags in Curbing Coronavirus Cases Latest tallies There are now 18.9 million confirmed cases of COVID-19 worldwide, according to data aggregated by Johns Hopkins University, and at least 708,540 people have died. The data show that 11.4 million people are confirmed to have recovered. The U.S. death toll stands at 158,300 after a tenth straight day in which more than 1,000 deaths were counted. Brazil is second to the U.S. with 2.9 million cases and 97,256 deaths. India is third measured by cases at 1.9 million, followed by Russia with 870,187 and South Africa with 529,877. Mexico has 456,100 cases and 49,698 deaths, the third highest in the world. The U.K. has 307,271 cases and 46,295 fatalities, the highest in Europe and fourth highest in the world. China, where the illness was first reported late last year, recorded 88,423 cases and 4,678 fatalities.What's the economy saying? There was a surprise in the latest weekly jobless data that showed new unemployment claims declining by 249,000 in early August to 1.19 million, touching the lowest level since the pandemic began, MarketWatch's Jeffry Bartash reported. New applications for unemployment benefits, a rough gauge of layoffs, slipped for the first time in three weeks, the Labor Department said Thursday. A week earlier, 1.44 million people applied for benefits. It was the biggest one-week decline since early June. Data from the outplacement firm Challenger, Gray & Christmas, meanwhile, showed job-cut announcements surging 54% in July to the third highest level on record. Economists polled by MarketWatch had forecast 1.4 million new unemployment claims in the seven days ended Aug. 1. These seasonally adjusted figures reflect applications filed the traditional way through state unemployment offices. The big drop in claims might stem in part from the pending expiration of a $600 federal unemployment stipend at the end of July, economists say. The program's lapse could have led some people to believe they were no longer eligible to file. Read also: 'It spread like wildfire' - This 'very, very scary' chart might have you reconsidering your Sunday plans Another possibility is that the spike in coronavirus cases since Memorial Day began to wane toward the end of last month, potentially helping to stabilize the labor market. \"The story here, we think, is that layoffs triggered by the second wave of COVID-19 in the South and West are now falling,\" said Ian Shepherdson, chief economist at Pantheon Macroeconomics. See also:Job trouble? Wave of rehiring after economy reopened to fade in July after viral spiral The Challenger job-cut data were less cheery, with layoffs announced by U.S.-based employers jumping in July to 262,649, the third-largest monthly total ever. July's total was 54% higher than the 170,219 job cuts announced in June. Last month's cuts bring the yearly total so far to 1.85 million, up 212% from the 592,556 cuts at this time last year, Challenger said. Investors are awaiting Friday's July nonfarm-payrolls report which is expected to show the economy created 1.75 million new jobs, about two-thirds fewer than the increase in June. What are companies saying? The second-quarter earnings season continued to reveal exactly how companies are faring in the pandemic and show which are being hit hardest by changing consumer behavior. There was predictably grim news from Norwegian Cruise Line Holdings Ltd., which swung to a bigger-than-expected loss as revenue fell 99% from a year ago as sailings were suspended. See now:Going cashless during the COVID pandemic makes life even more difficult for the 14 million unbanked Americans Elsewhere in the hospitality sector, Hilton Worldwide Holdings Inc., too, posted a wider-than-expected loss and said the pandemic had a \"significant adverse impact\" on occupancy. Total revenue dropped to $564 million from $2.48 billion, below the FactSet consensus of $818.8 million. Revenue per available room (RevPAR) sank 81%, as occupancy fell 56.1 percentage points to 22.3% and the average daily rate declined 33.2% to $97.18. Hilton said, however, that RevPAR and occupancy rates have increased each month since April. Pizza chain Papa John's International Inc. disappointed with a revenue miss, despite the apparent popularity of delivered pizza during the pandemic. North American comparable sales rose 28%, while international comparable sales were up 5.3%. The FactSet consensus was for domestic growth of 11.1% and international growth of 3%. Papa John's hired 20,000 workers during the quarter and said it expects to add another 10,000. See: Domino's Pizza could snap up market share with 'improved' chicken wings Media company ViacomCBS Inc. beat profit and sales expectations, although the pandemic hurt advertising revenue, which fell 27%. Domestic streaming and digital video revenue rose 25% to $489 million. Content-licensing revenue was flat, and theatrical revenue was \"immaterial\" with cinemas closed during the pandemic. Publishing revenue fell 8%, driven by lower print book sales. See: Disney has 'built a big enough life raft' with streaming changes, analysts say as stock enjoys best day in months Crafts marketplace Etsy Inc. got a boost from demand for face masks, which helped it more than double revenue. Revenue rose 137% to $429 million, from $181 million a year ago, well above the $330 million FactSet consensus. Blue Apron Holdings Inc., another pandemic beneficiary amid a surge in demand for its meal kits as people dine more at home, is planning to sell another 4 million shares. Blue Apron shares have gained 175% in the year to date. Here's the latest news about companies and COVID-19: â\u0080¢ ADT Inc. ADT, -0.83% is planning to offer $750 million in first-priority senior secured notes due 2027, joining the many companies issuing record levels of debt during the pandemic. Proceeds will be used to redeem $750 million of 6.250% notes that mature in 2021. ADT also reported earnings, showing a loss but higher-than-expected revenue. â\u0080¢ Blue Apron Holdings Inc. APRN, +1.60% plans to sell more shares after a pandemic-fueled gain in its previously woeful stock price. Blue Apron plans to sell at least 4 million shares at a yet-to-be-disclosed price, with all the proceeds going to the company. The book-running banks, Morgan Stanley and Cannacord Genuity, will have access to an additional 600,000 shares. â\u0080¢ Child-care services company Bright Horizons Family Solutions Inc. BFAM, +0.52% results topped Wall Street expectations amid the pandemic. The company said that more than 400 of its 1,076 centers are currently open using safety protocols, and expects more than 85% of its centers to be open by Sept. 30. â\u0080¢ Bristol-Myers Squibb BMY, +0.32% posted better-than-expected earnings and a positive patent ruling for its blockbuster blood thinner Eliquis that was announced Wednesday evening. The drugmaker swung to a loss, but sales jumped to $10.1 billion for the quarter, up from $6.2 billion in the same quarter in 2019, and above the FactSet consensus of $10 billion. The revenue increase was primarily driven by the company's acquisition of Celgene, which closed in November. Bristol had expected a $600 million hit to sales for the quarter as a result of lower demand for its products during the pandemic. Sales of Eliquis gained 6% to $2.1 billion during the quarter, while revenue for the cancer therapy Opdivo tumbled 9% to $1.6 billion. Read: 'Clueless' investors just keep driving this 'stupidly bullish' stock market higher, CNBC's Jim Cramer says â\u0080¢ RV retailer Camping World Holdings Inc. CWH, -0.29% missed earnings expectations though revenue rose because of a surge in demand during the pandemic. Revenue rose to $1.6 billion from $1.47 billion in the year-ago quarter. â\u0080¢ Cardinal Health Inc. CAH, -1.33% reported better-than-expected earnings for its fiscal fourth quarter, despite a net negative impact of approximately $130 million as a result of people avoiding visits to the doctor and delaying elective procedures during the pandemic. It had also a $579 million pre-tax gain due to the sale of its stake in a company that owned NaviHealth, a post-acute care company that was sold to UnitedHealth Group's UNH, +1.68% Optum in May. Cardinal reported $36.7 billion in revenue for the quarter, down 2% from $37.4 billion in the quarter a year ago. The FactSet consensus was $36.8 billion in revenue. Pharmaceutical sales were flat, at $33.2 billion, while medical segment sales fell 13% to $3.5 billion. â\u0080¢Etsy Inc. ETSY, +5.11% said its second-quarter revenue more than doubled as more people shopped online due to the pandemic and some shopped for COVID-19-related items such as masks. Etsy said it saw an influx of 18.7 million new buyers and reactivated buyers, or those who hadn't bought on Etsy in a year or more. Etsy didn't give guidance for the year, citing the pandemic, but guided for third-quarter revenue growth between 85% and 115%. \"Events of the last few months have driven dramatic shifts in consumer shopping habits, which we believe will increase the total available market opportunity for Etsy,\" CEO Joel Silverman said. The positive trends in the second quarter are likely to have extended through July, he said. â\u0080¢ USA Today parent Gannett Co. Inc. GCI, -4.00% swung to a large second-quarter loss after an impairment charge, while revenue rose 90%, boosted by the Legacy Gannett acquisition. Revenue rose to $767 million from $404.4 million, as advertising and marketing services revenue grew 74% to $356.9 million and circulation revenue jumped 127% to $342.6 million. The one analyst surveyed by FactSet was expecting revenue of $744 million. Digital advertising and marketing revenue totaled $168.8 million, or 22% of total revenue, while digital-only subscribers increased 31% to 927,000. â\u0080¢ Kontoor Brands Inc. KTB, +1.89%, parent of Wrangler's and other denim brands, reported a narrower-than-expected second-quarter loss and revenue that exceeded expectations. Revenue fell due to COVID-19-related wholesale retail closures and a shift of shipments totaling $33 million from the second quarter to the third quarter. Wrangler revenue fell 31% to $252 million while Lee revenue sank 58% to $86 million. At the end of the quarter, Kontoor had $256 million in cash and equivalents, and $1.1 billion in long-term debt. As of June 2020, the company had $225 million of outstanding borrowings from its credit revolver with $273 million available. â\u0080¢ Hilton Worldwide Holdings Inc. HLT, -1.26%  reported a second-quarter loss that was wider than expected, with revenue dropping 77%, as the pandemic had a \"significant adverse impact\" on occupancy. Revenue per available room (RevPAR) sank 81%, as occupancy fell 56.1 percentage points to 22.3% and the average daily rate declined 33.2% to $97.18. Hilton said, however, that RevPAR and occupancy rates have increased each month since April. Total cash and cash equivalents totaled $3.58 billion as of June 30, while Hilton had $10.3 billion in long-term debt. â\u0080¢ MetLife Inc. MET, -0.92% reported a second-quarter profit that missed Wall Street expectations. Revenue fell 20% to 14.1 billion. Due to COVID-19, global face-to-face sales remain \"challenging,\" with continued sales pressure in most segments, MetLife said. Underwriting margins are mostly offsetting global claims impact from COVID-19, the company said. â\u0080¢ Mylan NV MYL, -0.50% said Thursday it had net income of $39.4 million, or 8 cents a share, in the second quarter, after a loss of $168.5 million, or 33 cents a share, in the year-earlier period. The company said its adjusted net income came to $574.3 million compared with 532.8 million a year ago, but did not offer an adjusted per-share figure. Revenue fell to $2.731 billion from $2.852 billion. The FactSet consensus was for EPS of 99 cents and revenue of $2.735 billion. \"We now expect the overall COVID-19 recovery efforts will occur slower than anticipated and may continue throughout the rest of the year,\" the company said in a statement. \"As a result, we expect total revenues, which absorbed a 2% net decline related to COVID-19 in the first half of the year, to have an overall similar negative impact for the second half of the year.\" â\u0080¢ Norwegian Cruise Line Holdings Ltd. NCLH, +2.91% swung to a wider-than-expected loss with revenue tumbling 99.0% to miss forecasts, as operations remain suspended amid the pandemic. Revenue fell to $16.9 million from $1.66 billion, as passenger ticket revenue declined 98.8% to $13.8 million and onboard and other revenue sank 99.4% to $3.1 million. The company now expects monthly cash burn of $160 million during the suspension of operations, which is at the high end of previous expectations due to additional interest expense related to a July capital raise, maintaining more ships in warm layup, increased costs associated with travel restrictions for crew and additional marketing investments. â\u0080¢ Papa John's International Inc. PZZA, -1.18% reported second-quarter revenue that was below expectations. North American comparable sales rose 28% while international comparable sales were up 5.3%. The FactSet consensus was for domestic growth of 11.1% and international growth of 3%. Papa John's hired 20,000 workers during the quarter and will add another 10,000. â\u0080¢ Potbelly Corp. PBPB, +12.36% reported a wider second-quarter loss but said that its same-store sales improved toward the end of the quarter and that it now expects to have to permanently close fewer restaurants. Its weekly cash burn also trended lower throughout the quarter and is down about 75% from the early weeks of the pandemic, the company said. Same-store sales \"steadily improved throughout the quarter,\" from a late March low of down 68%, to a decline in the mid-20% range for June, the company said. Potbelly had $29.1 million in cash and kept $16.7 million available under a revolving credit facility, it said. Its total liquidity was $45.8 million, flat compared with $45.8 million at the end of the first quarter. Potbelly said it \"continues to have constructive discussions\" with landlords, resulting in 16 permanent shop closures and 187 leases renegotiated as of early August. It now expects to have to permanently close fewer than 50 stores, compared to up to 100 as it previously expected. â\u0080¢ Burger King parent Restaurant Brands International Inc. QSR, -0.60% reported Thursday second-quarter profit that beat expectations, as revenue fell 25% but topped forecasts. Burger King same-store sales fell 13.4%, to beat the FactSet consensus for a 15.7% decline; Tim Hortons same-store sales declined 29.3% to miss expectations of a 29.1% drop; and Popeyes Louisiana Kitchen same-store sales rose 24.8% to come up short of expectations of 27.3% growth. \"The COVID-19 pandemic has introduced a host of unprecedented challenges, but our proactive and coordinated response across the globe has helped drive a significant recovery in performance since March,\" said Chief Executive Jose Cil. \"By the end of the quarter, we were back to 90% of our prior year system-wide sales with 93% of our restaurants open worldwide, which speaks to the strength and resilience of our three amazing brands and business model.\" â\u0080¢ ViacomCBS Inc. VIAC, -2.34% posted better-than-expected profit and sales for the second quarter, even as the coronavirus pandemic hurt advertising revenue. \"Despite the impact of COVID-19 on revenue in the quarter, we're successfully managing through the effects of the pandemic, reaffirming the strength of our combined operations,\" Chief Executive Bob Bakish said in a statement. â\u0080¢ Vista Outdoor Inc. VSTO, -1.96%, the ammunition and outdoor gear seller, reported a surprise fiscal first-quarter profit and sales that rose well above expectations, and provided an upbeat second-quarter outlook. Shooting sports sales increased 8% to $334 million, driven by continued demand for personal protection and a resurgence in outdoor recreation activities, to offset a 4% decline in outdoor products sales to $145 million, as the pandemic hurt hydration and golf sales. For the fiscal second quarter, Vista expects sales of $495 million to $515 million, above the current FactSet consensus of $468 million. \"We had an incredible start to our fiscal year, and we see continued strength going forward in both our Outdoor Products and Shooting Sports segments, with increasing participation rates across all of our categories,\" said Chief Executive Chris Metz. â\u0080\u0083"}]}