{"article": [{"url": "https://www.marketwatch.com/story/the-ma-surge-is-it-rational-exuberance-or-a-frenzy-before-the-market-falls-2020-09-15", "published": 1600242680.0, "headline": "The M&A surge: Is it rational exuberance or a frenzy before the market falls?", "body": "The second Monday of September set deal makers’ pulses racing with a flurry of deals announced. The rise in equity markets and low funding costs encouraged chief executives with strong balance sheets to spend their cash on buying growth. In one day alone, companies across a range of sectors and geographies announced deals worth more than $89.5 billion, according to financial data provider Refinitiv. Nvidia NVDA, -0.54%, which makes the microchips used for games, said it was buying U.K.-based chip designer Arm from SoftBank 9984, -1.24% for $40 billion; U.S. drugmaker Gilead Sciences GILD, +0.82% paid $21 billion to acquire biotech Immunomedics IMMU, +0.31% and Verizon Communications VZ, +0.23% snapped up Tracfone, a unit of Mexican telecom América Móvil AMOV, +0.31%, for $6.25 billion. That made it the highest Monday total since June 10, 2019 — and has provided a welcome boost to M&A levels, which sank at the height of the coronavirus pandemic as companies preserved their cash. Now, global mergers and acquisitions volumes have reached $1.97 trillion, down 28% compared with the same period in 2019. Technology deals are soaring, rising 18.6% in value from a year ago to mark the highest level since 2000, Refinitiv data shows. Read:Surge in megadeals points to M&A recovery as tech sector dominates The shopping spree may not yet be over. Buyout groups, which are hoarding $1.5 trillion in unspent capital, according to data provider Preqin, should send deal making activity even higher. “With vast sums of private equity to be deployed, there may be many deals and takeovers as we head into the autumn,” said Neil Wilson, chief market analyst for Markets.com. The immediate winners of the M&A frenzy are the shareholders of the acquired companies. But beyond the rush of excitement lies the question of whether chief executives have now entered into a cycle of excess and are launching bids at the top of the market. According to Goldman Sachs, there have been three moments of significant M&A downturns in the last 30 years — in 1990-1991; 2001-2002; and 2008-2009. “During each of those periods, M&A volumes declined by about 50% over a two-year period followed by another three to six years before volumes recovered to their prior peaks,” the U.S. bank said in its Global M&A outlook in June. Michael Carr, global co-heads of M&A at Goldman Sachs, said that while every cycle is unique, recoveries after severe downturns tend to follow three types of “waves,” with the first characterized by involuntary M&A deals, such as bankruptcy sales or forced asset sales to generate liquidity. “We believe we’ve entered the second wave of M&A, known as “near-in M&A,” where management teams are looking close to home for potential combinations or joint ventures as a way to reduce transaction risks,” Carr added. A look back in history shows that AOL’s $164 billion takeover of Time Warner marked the apex of the late 1990s equity boom, while Royal Bank of Scotland’s €71 billion takeover of ABN Amro and Rio Tinto’s $38 billion acquisition of Alcan were struck at the height of the 2007 debt boom. Neither of those deals was a success and all symbolized executive hubris. Shortly after they were announced, stock markets peaked and M&A activity dropped sharply. They also wiped out so much shareholder value that they ultimately cost the CEOs of the bidding companies their jobs and triggered huge write downs when it became clear that the promised synergies were unattainable. Professor Scott Moeller, director of the M&A research center at The Business School (formerly Cass), said that, in terms of returns to shareholders, there is clear evidence that the best time for deals is early in the cycle. “Even though we’ve seen a huge surge in deals in recent weeks, we could be at the beginning of the wave that marks the peak,” Moeller said. “The end of the wave tends to produce financially-driven deals and we are still seeing strategic deals which is encouraging,” he added. There is one certainty for investors: the longer the cycle, the deeper the trough. And that is when M&A becomes no different to any other time."}]}