{"article": [{"url": "https://www.marketwatch.com/story/new-analysis-estimates-the-financial-cost-and-benefits-of-bidens-free-college-plan-11601962724", "published": 1602154760.0, "headline": "Joe Biden's free college plan could pay for itself within 10 years, Georgetown University analysis says", "body": "Democratic presidential nominee and former Vice President Joe Biden speaks at the Little Haiti Cultural Complex in Miami, Fla. on Oct. 5.(Photo by ROBERTO SCHMIDT/AFP via Getty Images) As part of his campaign for president, the Democratic nominee, Joe Biden, has vowed to make college free for a large swath of American families, but he hasn't said much about how much that plan would cost. A report released Tuesday by Georgetown University's Center on Education and the Workforce offers some insight. Researchers estimate that Biden's plan would cost taxpayers $49.6 billion in its first year, with the federal government paying $33.1 billion and states spending $16.5 billion. But the plan would pay for itself, the report finds, because yearly tax revenue generated as a result of the free college program would outweigh the annual cost within the first 10 years. The Georgetown researchers' estimate is based on the idea that Biden's free college program would encourage more students to earn college credentials, leading to jobs that would generate an additional $371.4 billion in federal and state tax revenue. Biden is proposing to make public college tuition-free for students who come from families earning $125,000 a year or less. Biden would achieve that aim through a partnership, whereby the federal government would use funding to incentivize states to invest in their higher education institutions to eliminate tuition at those schools. The Georgetown researchers' model estimates that public college enrollment could increase by anywhere between 6% and 14% as a result of the program, while enrollment at private colleges could decline by between 7% and 14%. Biden's proposal comes after years of momentum building among Democratic presidential candidates for some kind of free college program. Many states already offer their own versions of free college. The plan also arrives amid an unprecedented period of challenge for higher education. The pandemic has stretched many schools' already precarious business models even further and higher education is staring down a future with a smaller pool of 18-to-24-year-olds to enroll. Anthony Carnevale, the director of the Georgetown center and one of the authors of the report, said he believes the combination of the momentum surrounding free college in the Democratic party and schools' financial challenges mean that a free college program will become a reality if Biden wins the presidential election and Democrats take the Senate. \"It makes the federal government a partner to the states, which means in the end this is an institutional agreement, not just an agreement with students,\" Carnevale said. The institutions are \"going to be looking for money,\" he added, \"they're going to be willing to make a deal.\" But how a free college program is designed can have a big impact on its cost and who it benefits. Over the past several years, policymakers have proposed a myriad of versions. The Georgetown analysis finds that a debt-free college program, where lawmakers vow to ensure students graduate from public colleges without debt, would both be more generous and more costly than a tuition-free plan, like Biden's.  Supporters of debt-free college also argue that it could make more of a dent in reducing equity gaps, than a plan that simply provides anyone with free tuition to a public college, because it's better targeted towards students who need the funds. Though the Georgetown analysis finds Biden's program is less-generous than a debt-free college proposal, the researchers found it would more directly benefit Black, Hispanic and low-income students than many other tuition-free college proposals.  That's because Biden's proposal caps the income of those eligible for the program and because it's \"first-dollar,\" meaning that the funds students get as part of the initiative would be added on top of any financial aid or scholarships they're already eligible for. Still, some proponents of tuition-free college initiatives have been critical of restricting the program to certain income groups, arguing that it muddies simple messaging of \"free,\" which could deter students who need it from taking advantage of it. In addition, they say, making the program available to all students, regardless of income, provides the political buy-in necessary to make it a reality. Where once students could pay for public college with a minimum wage job, now costs are so high that that's basically impossible. That's in part because cuts to state funding of public higher education have pushed costs on to students and families. The trend comes at a time when public colleges are also becoming more diverse. That means this generation of college students, which includes more students of color than in the past, are less likely to benefit from a government commitment to funding public higher education. In some ways, free college proposals are viewed as a return to the affordable public college system more familiar to the parents and grandparents of today's students. Research suggests that today's system, where students finance their degrees largely through debt, is fueling racial inequality. Our colleges and universities also compound other inequalities present in the kindergarten through 12th grade school system; students from under-funded schools have less access to the kinds of resources that would help them get into the types of colleges that typically offer the best chances of financial success. \"We've got a device that we tend to think is merit-based and is fair and everybody has access to it, which is baloney,\" Carnevale said. \"It is reproducing race and class privilege across generations.\" \"I think this is a good idea,\" Carnevale said of Biden's plan. \"It is far from something that will change the justice equation in America.\"  Still, Carnevale says, it's a step in the right direction that could help the nation compete with other, large economies by investing resources in a broader swath of talent.  \"The way things work in America is that, with brutal efficiency, we always invest the next education dollar in the highest performing kid, which is the kid from the most affluent family who tends to be white,\" Carnevale said. \"That strategy is not going to work going forward.\" Even if Biden and the Democrats don't have the kind of governing majority necessary to push through this type of free college plan, Carnevale predicts that there will be a fundamental change in the way the federal government relates to higher education institutions over the next several years. \"There's really a choice between getting lots of regulation with money or without,\" Carnevale said. \"With Biden they'll get regulation with some money.\""}]}