{"article": [{"url": "https://www.marketwatch.com/story/derek-chauvin-the-ex-cop-charged-in-george-floyds-death-posts-1-million-bond-to-leave-minnesota-prison-01602093925", "published": 1602081740.0, "headline": "Derek Chauvin, the ex-cop charged in George Floydâ\u0080\u0099s death, posts $1 million bond to leave Minnesota prison", "body": "Derek Chauvin AFP PHOTO / Hennepin County Jail MINNEAPOLIS (AP) â\u0080\u0094 The former Minneapolis police officer charged with murder in the death of George Floyd posted bail on Wednesday and was released from prison. According to court documents, Derek Chauvin posted $1 million bond, and the Department of Corrections confirmed he was no longer in custody at the stateâ\u0080\u0099s facility in Oak Park Heights, where he had been detained. Hennepin County jail records show he was released shortly before 11:30 a.m. Floyd, a Black man in handcuffs, died May 25 after Chauvin, who is white, pressed his knee against Floydâ\u0080\u0099s neck for several minutes as Floyd said he couldnâ\u0080\u0099t breathe. Floydâ\u0080\u0099s death was captured in widely seen bystander video that set off protests around the world. Chauvin and three other officers were fired. Chauvin is charged with second-degree murder, third-degree murder and manslaughter; Thomas Lane, J. Kueng and Tou Thao are charged with aiding and abetting both second-degree murder and manslaughter. It was not immediately clear where Chauvin got the money to pay his bond. The Minnesota Police and Peace Officers Association, which has a legal defense fund, did not provide any money for bail, a spokeswoman said. A message left with the union representing Minneapolis police officers was not returned. Chauvin had the option of posting bail for $1.25 million without conditions or $1 million with conditions. Under the conditions of his release, he must attend all court appearances, cannot have any direct or indirect contact â\u0080\u0094 including social media â\u0080\u0094 with any members of Floydâ\u0080\u0099s family, cannot work in law enforcement or security, and must not possess any firearms ammunition. The other three officers previously posted bail amounts of $750,000 and have been free pending trial. Currently, all four men are scheduled to face trial together in March, but the judge is weighing a request to have them tried separately."}]}