{"article": [{"url": "https://www.marketwatch.com/story/billionaire-investor-ray-dalio-on-capitalisms-crisis-the-world-is-going-to-change-in-shocking-ways-in-the-next-five-years-2020-09-17", "published": 1600437380.0, "headline": "Billionaire investor Ray Dalio on capitalism's crisis: The world is going to change 'in shocking ways' in the next five years", "body": "Ray Dalio certainly is no radical idealist, but in his frequent writings and media appearances the veteran investor consistently calls for Americans to rewrite their longstanding contract with capitalism so that it is fairer and more generous to more people. Otherwise, he predicts, life in the U.S. could become more difficult: mountainous debt that stunts economic growth; fewer opportunities for ordinary citizens to get ahead financially; and a worldwide lack of trust in the U.S. dollar that diminishes Americans' purchasing power and could lower their standard of living. Dalio is the founder of Bridgewater Associates, the world's largest hedge-fund firm, which has made him a billionaire. So it's not surprising that he champions capitalism as a proven way to expand economic growth and living standards. \"Capitalism and capitalists are good at increasing and producing productivity to increase the size of the economic pie,\" he says. Then Dalio stands this tenet on its head. Capitalists don't divide the economic pie very well, he says, and so today the capitalist system, the foundation of the U.S. economy, is not working efficiently and effectively enough for all. \"Capitalism also produces large wealth gaps that produce opportunity gaps, which threaten the system,\" Dalio says - a system that has been and still is key to the health and success of U.S. business, workers, government and investors alike. Unless the U.S. takes steps to make systemic repairs designed to provide greater opportunity for more Americans to achieve personal growth and financial security, the consequences likely will be painful for the country, as Dalio explains in this recent telephone interview, which has been edited for length and clarity: MarketWatch: You have written and spoken about three big domestic and international problems facing the U.S. over the next five to 10 years and how a failure to address these challenges could threaten America's standing in the world. What are these three pressing problems? Ray Dalio: I look at it mechanically, like a doctor looking at a disease. If asked what is the issue here, I would say that it is a certain type of disease that has certain patterns which are timeless and universal, and the United States is broadly following that progression. There are three problems that are coming together, so it's important to understand them individually and how they collectively make a bigger problem. There is a money and credit cycle problem, a wealth and values gap problem, and an emerging great power challenging the existing dominant power problem. What's going on is an economic downturn together with a large wealth gap and the rising power of China challenging the existing power of the United States. It's a fact that there has been a weakening of the competitive advantages of the United States over the last couple of decades. For example, the United States lost a lot of the education advantage relative to other countries, our share of world GDP is reduced, the wealth gap has increased which has contributed to our political and social polarization. But we haven't lost all of our competitive advantages. For example in innovation and technology, the United States is still the strongest, but China is coming on very strong and at existing rates will surpass the United States. Militarily, the U.S. is stronger but China also has come on very strong and is probably stronger in the waters close to China that include Taiwan and other disputed areas. Finances for both countries are challenging, but for the U.S. more so. The U.S. is in the late stages of a debt cycle and money cycle in which we're producing a lot of debt and printing a lot of money. That's a problem. As a reserve currency status, the U.S. dollar DXY, -0.58%  is still dominant though its being threatened by its central bank printing of money and increasing the debt production problem. “ 'The United States is a 75-year-old empire and it is exhibiting signs of decline.' ” MarketWatch: Focusing on the money and credit problem, excessive debt can be a killer for businesses and families, but most people don't seem to recognize that debt plays havoc with their country's finances as well. Government runs the money printing press, which buys time, but eventually something's got to give. Dalio: If you look at the history - for example, the Dutch Empire, the British Empire - both experienced the creation of debt and the printing of money, less educational advantages, greater internal wealth conflict, greater challenges from rival countries. Every country has stress tests. If you look at British history, the development of rival countries led them to lose their competitive advantages. Their finances were bad because they had accumulated a lot of debt. So, after World War II those trends went against them. Then they had the Suez Canal incident and they were no longer a world power and the British pound is no longer a reserve currency.  These diseases almost always play out the same way.  The United States' relative position in the world, which was dominant in almost all these categories at the beginning of this world order in 1945, has declined and is exhibiting real signs that should raise worries. There's a lot of baggage. The U.S. has a lot of debt, which is adding to the hurdles that typically drag an economy down, so in order to succeed, you have to do a pretty big debt restructuring. History shows what kind of a challenge that is. I just want to present understanding and facts. There's a life cycle. You're born and you die. As you get older you can see certain things that are symptoms of being later on in life. To know the life cycle and to know that these symptoms are emerging is what I'm trying to convey. The United States is a 75-year-old empire and it is exhibiting signs of decline. If you want to extend your life, there are clear things you can do, but it means doing things that you don't want to do. “ 'Wealth cannot be created by creating debt and money.' ” MarketWatch: Let's put it bluntly: Is capitalism broken? Dalio: I wouldn't say broken as much as I'd say it has problems that have to be fixed. As I said, I'm not ideological, I'm mechanical. I look at everything operationally like a machine and what has been shown is that capitalism is a fabulous way of creating incentives and innovation and of allocating resources to create productivity. All successful countries have uses for it. For example, communist China has chosen capitalism, which has been essential to its growth. But capitalism also produces large wealth gaps that produce opportunity gaps, which threaten the system in the ways we are seeing now. Wealth gaps give unfair advantages to the children of rich people because they get a better education, which undermines the equal opportunity notion. As the number of people who get equal opportunity diminishes, this reduces the possibility of finding talented people in that population, which isn't fair and undermines productivity. Then the have-nots want to tear down the capitalist system at a time of bad economic conditions. That dynamic has always existed in history and it's happening now. The capitalist system is based on profit-seeking being the resource allocation system, which generally works well but doesn't always. So, capitalism and capitalists are good at increasing and producing productivity to increase the size of the economic pie, but they're not good at dividing the economic opportunity pie. Socialists are generally not good at increasing productivity and the size of the economic opportunity pie, but they are better at dividing the pie. We now have too much emphasis on distributing wealth and getting it from producing debt and printing money, and not enough from increasing productivity. Wealth cannot be created by creating debt and money. We have to be productive together, so we have to look at the good investments that we can make together that make total sense, like in education, and create equal opportunity in order to be productive. We have to be in this together. The system needs to be reengineered to do this. But if we don't do this engineering well, we're going to spend in an unlimited way and deal with that by creating debt that won't ever be paid back, and we will risk losing the reserve currency status of the dollar. If we get into that position - and we're very close - things will get much worse because we are living on borrowed money that's financing our consumption. “ 'Within the next five years you could see a situation in which foreigners who have been lending money to the United States won't want to.' ” MarketWatch: About the dollar being threatened as the world's reserve currency - what does \"close\" mean, and what would the decline of this status mean for Americans? Dalio: Within the next five years you could see a situation in which foreigners who have been lending money to the United States won't want to, and the dollar would not be as readily accepted for making purchases in the world as it is now. We have to realize that we're spending more than we're earning. Every individual, every company and every country has an income statement and a balance sheet. The income statement is how much is your earnings are relative to your expenses. If your earnings are greater than your expenses, great, you will increase your balance sheet. If your earnings are less than your expenses, then you have to draw on your balance sheet. The United States doesn't have a good income statement and balance sheet in dealing with the rest of the world. It is running a deficit to the rest of the world that is financed by borrowing money so that we are producing liabilities. Our living standards are based on our spending, not on our income statement or balance sheet. If the U.S. loses that ability and it doesn't force itself to be more productive, one day it will lose that ability to borrow and then will have to cut spending, which is painful. When that pain happens at a time when you have the population at each other's throats over money, that's a toxic combination. People can't take a downturn and have less buying power. So, necessarily the poor will have to be getting money from the rich and the rich are going to want to prevent that, and then if it gets bad enough, that it messes up productivity. Read: The Fed is 'fighting the last battle,' and here are the risks to its new strategy Also read: This new ETF is made for \"black-swan\" moments like now “ 'When the causes people are fighting for are more important to them than the system that binds them together, the system is in jeopardy.' ” MarketWatch: What steps do politicians and business leaders need to take now to create and implement reforms that will fortify the U.S. balance sheet and the dollar's status? Dalio: In brief, productivity and equal opportunity are most needed. If we could at least agree that we must have these things, that would be great. What we have now is a situation in which we're fighting each other, we are not providing equal opportunity, and we are losing our productivity gains. One of the greatest problems is that everybody's fighting for their cause. When the causes people are fighting for are more important to them than the system that binds them together, the system is in jeopardy. This seems to now be happening. Everybody has their cause and they're almost losing sight of the overall picture. Democracy depends on compromise. It's the notion of compromise and working together and being able to have a negotiation to get what the most people want rather than have one side beat the other. You really have to take the relative parties and make them agree on what's going to be best. The group has got to be bipartisan and they have to be knowledgeable. Bring together parties of opposing ideologies who are also knowledgeable, not just smart but who are on the ground, to come up with a  plan together that all can support so that we're productive, increasing the size of the pie and dividing it well. It would be great if whoever the president is could draw upon people from both parties and different perspectives. MarketWatch: As Americans prepare for a presidential election in November, the three major problems you mentioned earlier would seem to be important factors for voters to consider. Dalio: Yes. The world is going to change in the next five years in shocking ways in relation to the three big issues we have been talking about. First, there's a debt-money cycle - what is the value of money? What will happen to the debt? Will the dollar retain its value? The finances of this - who is going to pay for it? How? What will work? That's number one. Second, the wealth, opportunity and values gaps will have to be dealt with. Are we going to be at each other's throats in a way that is harmful or are we going to be working together even if things get worse? Third is the rising of a great power in China to challenge the existing power of the United States. Will this be well handled? We will be dealing with these issues in the next presidential term, which will have a huge effect on our outcomes. The last time those three things existed as they do now was the 1930 to 1945 period. That's the last time you had zero interest rates and money printing. That's the last time you had the wealth and political gaps as large as they are today, and it was the last time you had rising powers challenging the existing world order. This and many analogous times before it help to give us perspective. “ 'Worry as much about the value of your money as you worry about the value of your investments.' ” MarketWatch: These and other domestic and international challenges will clearly affect Americans financially. What would be a smart, proactive strategy for investors to both protect a portfolio and take advantage of market opportunities? Dalio: First, worry as much about the value of your money as you worry about the value of your investments. The printing of money and the debt should make you aware of that. That's why financial asset prices have gone up - stocks, gold - because of the debt and money creation. You don't want to own the thing you think is safest - cash. Second, know how to diversify well. That includes diversification of countries, currencies and assets, because wealth is not so much destroyed as it shifts. When something goes down, something else is going up so you have to look at all things on a relative basis. Diversify well and worry about the value of cash. Americans look at the value of everything in U.S. dollars, but they don't look at the value of the dollar. You're in an environment where you have to be cautious about that, because the easiest way out for government is to do what the U.S. just did, which is to borrow and print a lot of money. They don't have to get it from anyone, because when they raise taxes they have to get it from somebody and that somebody squawks. The population doesn't pay much attention to the debt and the printing of money. They all appreciate the giving of money. So you hear the population say, \"I need more money,\" and get angry if they don't get it. So you've got to give them more money, and it's easier not to take it away from someone else. Read: Billionaire investor Ray Dalio fears for the dollar and the 'soundness of our money,' and here's why Plus: Investors could be looking at a 'lost decade' in the stock market, the world's biggest hedge fund warns"}]}