{"article": [{"url": "https://www.marketwatch.com/story/walmart-is-hiring-20000-seasonal-workers-heres-how-a-seasonal-job-could-affect-your-unemployment-benefits-2020-09-24", "published": 1601383820.0, "headline": "Walmart is hiring 20,000 seasonal workers  â\u0080\u0094 hereâ\u0080\u0099s how a seasonal job could affect your unemployment benefits", "body": "Fall just started, but in the retail sector, that means the holiday season is just around the corner â\u0080\u0094 and that means new job openings. Walmart WMT, +1.00% Â announced it will start its holiday hiring process by bringing aboard 20,000 seasonal workers for its e-commerce fulfillment centers. Target TGT, +1.14% Â said it is seeking 130,000 seasonal workers for openings across the entire company, a number on par with its seasonal hiring last year. Earlier this month, 1-800-Flowers.com said it planned to hire 10,000 seasonal workers, up from the 8,000 temporary workers it hired in the 2019 holiday season. Overall, holiday retail sales are expected to grow between 1% and 1.5% year-over-year, according to forecasters at the consulting firm Deloitte. This is no ordinary holiday season of course. The jobless rate remains high, even if it is coming off from double-digit jobless rates in the spring, when the coronavirus pandemic initially roiled the economy. An estimated 3.5 million homeowners are in mortgage forbearance because of their suddenly rocky finances. And on Capitol Hill, the prospect of a deal for another round of fiscal stimulus â\u0080\u0094 including more stimulus checks and enhanced unemployment benefits â\u0080\u0094 seems dim for now. So how does that play out for a person whoâ\u0080\u0099s thinking about applying right now for a seasonal position? Hereâ\u0080\u0099s a look: Whatâ\u0080\u0099s the pay? The hourly rate ranges from $15.75 to $23.75 for the Walmart positions, depending on location. Many of the positions may turn into permanent jobs, the company noted. At Target, worker minimum wage is $15, and workers get certain benefits including access to virtual doctor visits and backup childcare. Thatâ\u0080\u0099s right around the average hourly pay for all retail-sector workers, according to federal data. Between October 2019 and December 2019, the average hourly pay for all retail sector workers was just under $20, according to information from the Bureau of Labor Statistics. A company spokeswoman for 1-800-Flowers.com FLWS, +3.90% did not specify what the exact pay is for seasonal workers, but said wages are competitive and positions are still available. Last year, the retail industry hired an estimated 562,000 people to help with the holiday rush in November and December, according to a spokeswoman for the National Retail Federation, a retail-sector trade association. The organization hasnâ\u0080\u0099t yet released its 2020 holiday forecast, which includes hiring projections, but the spokeswoman noted â\u0080\u009csurprisingly robust spendingâ\u0080\u009d in holidays, like Motherâ\u0080\u0099s Day and Fatherâ\u0080\u0099s Day, so far this year. What do I need to know if Iâ\u0080\u0099m on unemployment benefits? â\u0080\u009cItâ\u0080\u0099s really in a personâ\u0080\u0099s interest to look for, and take work, if possible,â\u0080\u009d said Michele Evermore, Senior Policy Analyst at the National Employment Law Project. For one thing, she noted, if a worker still hasnâ\u0080\u0099t exhausted the state-level unemployment insurance they are eligible for in their â\u0080\u009cbenefit yearâ\u0080\u009d â\u0080\u0094 generally, the 52-week span that starts from an initial jobless claim â\u0080\u0094 they can resume receiving those benefits if their seasonal job ends and they cannot find other work. Another important point is that if a job seeker getting unemployment benefits turns down a job offer, the employer is obligated to notify the state labor department â\u0080\u0094 and that can jeopardize someoneâ\u0080\u0099s potential for future benefits. The $300 a week federal benefits resulting from President Donald Trumpâ\u0080\u0099s executive order have ended, even though some states are still in the process of retroactively distributing the supplemental federal unemployment pay. So if someone still hasnâ\u0080\u0099t received that pay, Evermore said they can still take a job now and get the benefit. Does a seasonal job mess up my mortgage forbearance agreement? Not necessarily, according to Karan Kaul, senior research associate in the Urban Instituteâ\u0080\u0099s Housing Finance Policy Center. Under the current laws, lenders can authorize forbearance for up to one year if a homeowner is experiencing financial hardship related to the pandemic. Hardship doesnâ\u0080\u0099t hinge on whether someone has a job or not, he said. A borrower could land a seasonal job to help them and their family make ends meet, but they could still be facing financial hardship, Kaul noted. The question of whether homeowners have to notify lenders about new jobs or sources of income may vary by agreement terms, he said."}]}