{"article": [{"url": "https://www.marketwatch.com/story/armed-couple-who-confronted-racial-injustice-march-on-gated-st-louis-street-facing-assault-and-weapons-charges-2020-07-20", "published": 1595267900.0, "headline": "Armed couple who confronted racial-injustice march on gated St. Louis street facing assault and weapons charges", "body": "ST. LOUIS (AP) — St. Louis’ top prosecutor on Monday charged a white husband and wife with felony unlawful use of a weapon for displaying guns during a racial injustice protest outside their mansion. Mark and Patricia McCloskey, who are both personal-injury attorneys in their 60s, also face a misdemeanor charge of fourth-degree assault. Circuit Attorney Kim Gardner told the Associated Press that the McCloskeys’ actions risked creating a violent situation during an otherwise nonviolent protest. “It is illegal to wave weapons in a threatening manner — that is unlawful in the city of St. Louis,” Gardner said. An attorney for the couple, Joel Schwartz, in a statement called the decision to charge “disheartening as I unequivocally believe no crime was committed.” Supporters of the McCloskeys said they were legally defending their $1.15 million home. “ The investigation of the McCloskeys’ actions has been condemned by President Donald Trump, Missouri Gov. Mike Parson and Sen. Josh Hawley, who has urged Attorney General William Barr to undertake a civil-rights investigation of Circuit Attorney Kim Gardner. ” Gardner is recommending a diversion program such as community service rather than jail time if the McCloskeys are convicted. Class E felonies could typically result in up to four years in prison. Several Republican leaders have condemned Gardner’s investigation, including President Donald Trump, Missouri Gov. Mike Parson and Sen. Josh Hawley, who has urged Attorney General William Barr to undertake a civil-rights investigation of Gardner. Parson said in a radio interview Friday that he would likely pardon the couple if they were charged and convicted. Gardner said Trump, Parson and others are attacking her to distract from “their failed approach to the COVID-19 pandemic” and other issues. St. Louis, like many cities across the country, has seen demonstrations in the weeks since George Floyd’s death in Minneapolis, and the McCloskeys’ home was initially incidental to the demonstration on June 28. Several hundred people were marching to the home of Democratic Mayor Lyda Krewson, a few blocks from the McCloskeys’ home. Krewson had angered activists by reading on Facebook Live the names and addresses of some who had called for defunding police. The McCloskeys live on a private street called Portland Place. A police report said the couple heard a loud commotion and saw a large group of people break an iron gate marked with “No Trespassing” and “Private Street” signs. A protest leader, the Rev. Darryl Gray, said the gate was open and that protesters didn’t damage it. Mark McCloskey confronted protesters with a semi-automatic rifle, screamed at them and pointed the weapon at them, according to a probable statement. The statement said Patricia McCloskey then emerged with a semi-automatic handgun, yelling at protesters to “go” and pointing it at them. No shots were fired. Photos emerged as memes on both sides of the gun debate. Trump spoke by phone with Parson last week to criticize Gardner’s investigation. Parson, when he was in the Legislature, co-authored Missouri’s “castle doctrine” law that justifies deadly force for those who are defending their homes from intruders. He has said that the McCloskeys “had every right to protect their property.” Gardner declined to discuss why she decided the castle doctrine didn’t apply. Schwartz said the McCloskeys “support the First Amendment right of every citizen to have their voice and opinion heard. This right, however, must be balanced with the Second Amendment and Missouri law, which entitle each of us to protect our home and family from potential threats.” Gardner, St. Louis’ first Black circuit attorney, has been at odds with some in the St. Louis establishment since her election in 2016. Most notably, her office charged then-Gov. Eric Greitens with felony invasion of privacy in 2018 for allegedly taking a compromising photo of a woman during an extramarital affair. The charge was eventually dropped, but Greitens resigned in June 2018. A private investigator Gardner hired to investigate the claims against Greitens was later indicted for perjury for allegedly lying during a deposition. His case is pending. Gardner also has butted heads with police leaders, especially after she developed an “exclusion list” of more than two dozen officers who were barred from serving as primary witnesses in criminal cases over what Gardner called credibility concerns. The move angered Police Chief John Hayden, who also is Black. In January, Gardner filed a federal lawsuit accusing the city, the police union and others of a coordinated and racist conspiracy aimed at forcing her out of office. The lawsuit also accused “entrenched interests” of intentionally impeding her efforts to change racist practices. Several Black leaders in St. Louis have expressed support for Gardner, including Democratic U.S. Rep. William Lacy Clay, who has said protesters “should never be subject to the threat of deadly force, whether by individuals or by the police.”"}]}