{"article": [{"url": "https://www.marketwatch.com/story/us-tiktok-ceo-kevin-mayer-resigns-saying-the-political-environment-has-sharply-changed-2020-08-27", "published": 1598498060.0, "headline": "U.S. TikTok CEO Kevin Mayer resigns, saying 'political environment has sharply changed'", "body": "Just three months after taking the job, TikTok Chief Executive Officer Kevin Mayer announced his resignation in an internal memo to employees late Thursday, where he spoke of a changing political landscape. “ \"In recent weeks, as the political environment has sharply changed, I have done significant reflection on what the corporate structural changes will require, and what it means for the global role I signed up for. Against this backdrop, and as we expect to reach a resolution very soon, it is with a heavy heart that I wanted to let you all know that I have decided to leave the company.\" ” - Kevin Mayer, outgoing CEO of TikTok Mayer's announcement comes amid intense pressure for the wildly popular app, which President Donald Trump has vowed he will ban in the U.S. unless parent company Beijing-based ByteDance Inc. sells it within 90 days. Mayer said his decision had \"nothing to do with the company, what I see for our future, or the belief I have in what we are building.\" He added that the chairman of ByteDance, Zhang Yiming, understood and support his decision. The outgoing CEO said he remains upbeat on the company's future, which he described as \"incredibly bright.\" A spokesperson from the company said that Vanessa Pappas, general manager for TikTok U.S., will be the interim head. Mayer said any potential structural changes should not affect the experience of users - 100 million in the U.S. - and the platform \"will continue to provide our global community an amazing and integrated experience as it does today.\" He joined TikTok in May, after a stint in charge of Walt Disney Co's DIS, +1.53%  streaming service. TikTok announced Monday that it would file a complaint in federal court over Trump's attempt to ban the service in the U.S., arguing that it has \"taken extraordinary measures to protect the privacy and security of TikTok's U.S. user data.\" The company claims U.S. data is stored outside of China, while \"software barriers\" help ensure it's stored separately from that of other ByteDance products. Software giant Microsoft Corp. MSFT, +2.48%  has indicated it may be interested in buying TikTok's U.S. operations, while Oracle ORCL, +0.42%  and Twitter TWTR, -0.23%  have also reportedly expressed interest."}]}