{"article": [{"url": "https://www.marketwatch.com/story/exxon-getting-booted-from-the-dow-jones-industrial-average-may-be-a-blessing-in-disguise-for-its-investors-2020-08-25", "published": 1598780240.0, "headline": "Exxonâ\u0080\u0099s getting booted from the Dow Jones Industrial Average may be a blessing in disguise for its investors", "body": "CHAPEL HILL, N.C. â\u0080\u0094 Exxon Mobilâ\u0080\u0099s fall from grace has been stunning. But maybe, just maybe, being kicked out of the Dow Jones Industrial Average DJIA, +0.56% will prove to be a blessing in disguise. The company XOM, -1.47% has been part of this bluest of blue-chip averages for 92 years. It joined in October 1928, when it was called Standard Oil of New Jersey. For decades the company was one of the 10 most valuable publicly traded companies, and for six straight years â\u0080\u0094 from 2006 through 2011 â\u0080\u0094 it was at the top of the market-cap rankings. The primary reason S&P Dow Jones Indices gave for removing Exxon Mobil is that the indexâ\u0080\u0099s sector weightings were slated to otherwise become particularly skewed when Appleâ\u0080\u0099s shares split four-for-one at the end of August. Since the DJIA is a price-weighted index, this would have reduced Appleâ\u0080\u0099s weight in the index by 75%. To at least partially restore the information-technology sectorâ\u0080\u0099s weight, Exxon Mobil was replaced by Salesforce.com CRM, +2.21%, a company that develops enterprise cloud-computing solutions with a focus on customer relationship management. S&P Dow Jones Indices also is replacing Pfizer PFE, -0.27% with Amgen AMGN, -1.41% and Raytheon Technologies RTX, -1.46% with Honeywell International HON, +0.34%. It nevertheless canâ\u0080\u0099t have escaped S&P Dow Jones Indicesâ\u0080\u0099 notice that Exxon Mobilâ\u0080\u0099s stock has been suffering for the better part of a decade. Its shares traded for more than $104 in June 2014, versus $42 today. Even taking dividends into account, it has lagged the Dow by an annualized margin of plus 11% to minus 10.3%, according to FactSet â\u0080\u0094 a spread of 21.3 annualized percentage points. To appreciate why being booted out of the Dow might just turn out to be a blessing, consider what happened to IBM IBM, -2.81% in 1939. That was when it was removed from the DJIA, and it didnâ\u0080\u0099t make it back in until 1979. Over those 40 years it outperformed the market by a large margin. It outperformed by so much, in fact, that Norman Fosback, the former head of the Institute for Econometric Research, calculated that the DJIA would today be more than twice as high had IBM not been kept out of the Dow for those four decades. To put that another way: But for IBMâ\u0080\u0099s being out of the Dow for those 40 years, the Dow today would be approaching 60,000. This is just one example, of course, but more systematic studies of index deletions have also found that stocks deleted from an index tend to do more than just hold their own. One such study conducted by Wharton University finance professor Jeremy Siegel measured the impact of all additions and deletions to the S&P 500 since its creation in the 1950s. He found that the deletions, on average, outperformed the additions. Another study, by Jie Cai of Drexel University and Todd Houge of the University of Iowa, focused on the Russell 2000 RUT, +0.55% Â between 1979 and 2004. The pair found that a portfolio of stocks deleted from the index outperformed a second portfolio of the added stocks â\u0080\u0094 and not by just a little bit, either, but by nine annualized percentage points. To be sure, getting kicked out of a major market benchmark isnâ\u0080\u0099t a guarantee that a stock will outperform the market. General Electric GE, +2.85%, for example, has produced an annualized loss of 21.4% since it was removed from the Dow in June 2018, in contrast to a 9.1% annualized gain for the Dow itself. But the overall pattern is clear.Why being part of the DJIA might not be all that itâ\u0080\u0099s cracked up to be An academic study from earlier this summer provides several clues as to why being part of a major market average doesnâ\u0080\u0099t give companies much more than bragging rights. The study, by Rene Stulz of Ohio State, Benjamin Bennett of Tulane and Zexi Wang of Lancaster University, found that companies typically change their behavior after becoming part of the S&P 500 SPX, +0.87% â\u0080\u0094 the blue-chip benchmark favored by money managers â\u0080\u0094 for reasons having nothing to do with economic fundamentals. On average in recent years, in fact, companies added to the index experienced a decline in return on assets. It should also be pointed out that an index of just 30 stocks is hardly representative of the overall market. With such a small number, the decision makers at S&P Dow Jones Indices are given excessive power to define the market. Why, for example, did they choose Salesforce instead of Facebook FB, +0.26%, as Barronâ\u0080\u0099s columnist Andrew Bary is already asking? They no doubt had good reasons, but â\u0080\u0094 as IBMâ\u0080\u0099s example between 1939 and 1979 reminds us â\u0080\u0094 this one decision could very well have a huge long-term impact. If investors focused instead on the combined market capitalizations of all publicly traded stocks â\u0080\u0094 which, by definition, is the entire stock market â\u0080\u0094 then we wouldnâ\u0080\u0099t find ourselves in a situation in which a simple stock split can have such momentous consequences. Mark Hulbert was the founder of Hulbert Financial Digest, which closed in 2016. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com."}]}