{"article": [{"url": "https://www.marketwatch.com/story/voucher-or-not-brits-overwhelmingly-say-theyre-reluctant-to-eat-out-2020-07-10", "published": 1594370420.0, "headline": "Six in ten still reluctant to eat out, study finds", "body": "The U.K.’s new incentive to get people to eat out at restaurants and bolster the beleaguered hospitality industry is confronting a hard reality — consumers are still unwilling to confront the coronavirus pandemic. A new survey released on Friday by the Office for National Statistics finds 60% would be uncomfortable or very uncomfortable eating out, compared with just 21% who would be comfortable or very comfortable. The discomfort in leaving home isn’t limited to restaurants. Only 9% said they were likely or very likely to go on vacation abroad this summer. Just 14% of adults also said they had shopped for nonessential items such as clothes and furniture, and 6% said they left their home that week did so to visit an outdoor beauty spot or beach. The survey received 1,788 responses and was conducted between July 2 and 5. It comes as the Chancellor of the Exchequer Rishi Sunak unveiled a new incentive measure to get Brits to eat out. Starting in August, the U.K. Treasury will reimburse up to £10 per meal on Mondays through Wednesdays, as part of a broader £30 billion spending plan. Related:British government says it will pick up half the checks at restaurants to help boost economy The Restaurant Group RTN, on Friday said 10% of its restaurants won’t open at all this year. The publicly traded operator of the Wagamama and Chiquito chains said it was aiming to have 25% of its estate open by the end of July, and 90% by the end of September. The U.K. has been one of the hardest-hit countries by the pandemic, trailing only Belgium in deaths per capita of major European countries. At 666, the U.K.’s deaths per million is far above the U.S. figure of 400, according to data from the European Centre for Disease Prevention and Control."}]}