{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-cases-of-covid-19-edge-closer-to-14-million-as-us-sets-record-case-tally-brazil-tops-2-million-2020-07-17", "published": 1594999040.0, "headline": "Coronavirus update: Global cases of COVID-19 edge closer to 14 million as U.S. sets record case tally, Brazil tops 2 million", "body": "The number of confirmed cases of the coronavirus illness COVID-19 edged closer to 14 million on Friday, as the U.S. counted a record number of cases in a single day and regions around the world resumed restrictions on movement in a battle to contain the spread. Brazil’s case tally rose above 2 million overnight, while India’s rose above 1 million, according to data aggregated by Johns Hopkins University. In Spain, an early hot spot in the pandemic, residents of Barcelona were being asked to stay at home and avoid gathering after a rise in new cases. Israel reimposed lockdown measures and ordered shops, hairdressers and gyms to close, as the Guardian reported. Hong Kong recorded a record of 63 new cases, Bloomberg reported, and the government moved ahead with shutdowns of bars and beaches. The U.S. counted more than 70,000 cases overnight to set a new world record for most in a single day. Florida, the new U.S. hot spot, added almost 14,000 new cases overnight, and now has 315,767 with 4,676 deaths, or 22 per 100,000, according to a New York Times tracker. Miami-Dade Country, the state’s epicenter, has 72,316 cases, 1,202 deaths and a mortality rate of 44 per 100,000 people. iframe.twitter-tweet { width: 100% !important; } Texas added more than 10,000 new cases for a third straight day. In Georgia, Gov. Brian Kemp sued Atlanta Mayor Keisha Lance Bottoms and the city council to block the city from enforcing its mandate to wear a mask in public and other rules related to the pandemic, the Associated Press reported. Kemp is out of step with other states that are struggling with rising cases and are moving to mandating face masks. The latest to take the step include Colorado and Arkansas. Companies, including Walmart, Kroger Co., Target Co. and Best Buy have announced new policies that oblige shoppers to wear face masks, which public health experts say is a vital step in stopping the spread of the virus, along with regular hand washing and social distancing. A new Washington Post-ABC Poll found most Americans are unhappy with President Donald Trump’s handling of the pandemic and their attitude is hardening as cases climb across the country. A full 66% of those polled said they disapprove of his management of the outbreak, up from 53% in May and 45% in March. More than half of those polled, or 52%, said they disapprove “strongly,” about double the number counted in March. Dr. Ezekiel Emanuel of the University of Pennsylvania, an oncologist, bioethicist and senior fellow at the Center for American Progress, said the U.S. has squandered the last four months, with the possible exceptions of finding dexamethasone works and that Gilead Science Holdings Inc.’s remdesivir can shorten hospital-stay durations. In an interview with MSNBC, Emanuel said he does not expect the U.S. to be back to normal until November of 2021, “in an optimistic scenario.” Emanuel is one of the signatories of an open letter to America’s leaders saying it’s time to shut down, start over and do it right this time. The letter was also signed by Harvard T.H. Chan School of Public Health’s William Hanage, PhD, Northwestern University’s Seth Trueger, MD, MPH and Yale School of Medicine’s Reshma Ramachandran, MD, MPP. “Our decision makers need to hit the reset button,” said Matt Wellington, U.S. PIRG’s (Public Interest Research Groups) Public Health Campaigns Director. “Continuing on the path we’re on now will result in widespread suffering and death. And for what? Health experts laid out criteria for how to reopen safely. It’s time to listen to them.” U.S. PIRG is planning to garner more signatures in the coming week before delivering the letter to a set of governors, leadership in Congress and the Trump administration. A document prepared for the White House Task Force created to manage the crisis that was obtained by the nonprofit Center for Public Integrity is recommending that 18 states with rising cases roll back their reopening measures. The states have been determined to be in a red zone, defined as “those core-based statistical areas (CBSAs) and counties that during the last week reported both new cases above 100 per 100,000 population, and a diagnostic test positivity result above 10%.” The states referred to are Alabama, Arkansas, Arizona, California, Florida, Georgia, Iowa, Idaho, Kansas, Louisiana, Mississippi, North Carolina, Nevada, Oklahoma, South Carolina, Tennessee, Texas and Utah. The document does not match the rhetoric from the White House, with Trump mostly focused on pushing for schools to reopen in the fall, against the advice of his own health experts. Latest tallies There are now 13.9 million confirmed cases of COVID-19 world-wide and at least 592,719 people have died, according to the Johns Hopkins data. At least 7.8 million people have recovered. The U.S. accounts for about a quarter of the case tally at 3.60 million and has the highest death toll of 138,784. Brazil is second with 2.01 million cases and 76,688 deaths. India is third measured by cases at 1.00 million, followed by Russia with 758,001 and Peru with 341,586. The U.K. has 45,318 fatalities, the highest in Europe and third highest in the world. China, where the illness was first reported late last year, has 85,314 cases and 4,644 fatalities. South Korea’s Key Weapon to Stop the Pandemic? Smartphones What’s the latest medical news? The National Governors Association is asking the Trump administration to delay a rapidly implemented rule that changes how hospitals report COVID-19 data to the federal government for 30 days, MarketWatch’s Jaimy Lee reported. The rule, issued July 10, went into effect July 15. It tells hospitals to now report data to the Department of Health and Human Services rather than to the Centers for Disease Control and Prevention, as they have done since March. The reporting change has been met with concern that the decision is politically motivated and there has been a lack of transparency about how the change will improve the government’s data-gathering process. There are also worries that data about hospital capacity and other metrics used by researchers will no longer be made public. Read more: Rule change for how hospitals report coronavirus data to government comes under fire “Governors are requesting a 30-day delay of these new requirements, in order for hospitals to learn a new system, as they continue to deal with this pandemic,” the organization said. “In addition, governors urge the administration to make this information publicly available.” Separately, a clinical trial testing hydroxychloroquine in 491 people with mild cases of COVID-19 found that the antimalarial drug did not decrease the severity of symptoms when compared to placebo. The randomized, placebo-controlled, conducted by the University of Minnesota Medical School, was published Thursday in the Annals of Internal Medicine. The trial enrolled people within the first four days of showing symptoms of an infection. The study’s authors said there was one limitation to the research; only about 60% of the participants were tested for COVID-19 due to “severe U.S. testing shortages” when the trial took place. The remaining participants had symptoms as well as reported exposure to someone who had tested positive for the virus. “There is no convincing evidence that hydroxychloroquine can either prevent COVID-19 after exposure or reduce illness severity after developing early symptoms,” Dr. Caleb Skipper, lead author on the study. paper and infectious diseases fellow studying under Boulware. A growing body of research indicates hydroxychloroquine is not an effective treatment for COVID-19 patients.What are companies saying? The earnings season continued with the latest numbers from streaming giant Netflix Inc. NFLX, +1.43%, one of the clear winners of the pandemic as subscriptions have soared as stay-at-home orders encouraged many to turn to the service’s massive library of content. Netflix posted better-than-expected new subscriber numbers at 10.1 million, ahead of the 8.21 million FactSet analysts were expecting. The company also topped revenue estimates, although its profit number fell short. But it was a weaker-than-expected forecast for the rest of the year that sent its stock down in after-hours trade, a trend that continued into Friday’s session. In a letter to shareholders, Netflix executives admitted that the gains in the first half of the year were likely pulled forward from later in the year, which means fewer new subscribers in the rest of 2020, MarketWatch’s Jon Swartz reported. “In Q1 and Q2, we saw significant pull-forward of our underlying adoption leading to huge growth in the first half of this year (26 million paid net adds vs. prior year of 12 million),” executives said in the letter. “As a result, we expect less growth for the second half of 2020 compared to the prior year.” Deepening concerns, Netflix expects “paused productions” on original shows and films in the first half of 2021, based on its long lead-time content production schedule. Netflix also announced a big change in its executive suite: Ted Sarandos, who has led their original-content efforts, was named co-CEO to share the top spot with co-founder Reed Hastings. “This change makes formal what was already informal — that Ted and I share the leadership of Netflix,” Hastings said in the letter. Read now:Netflix promotes its Mr. Hollywood to co-CEO, showing importance of original content Elsewhere, shares of cruise operators tumbled after the CDC extended its cruise ship “no sail order” through September, amid the surge in new cases. The CDC’s previous order was set to expire on July 24. Norwegian Cruise Line Holdings Ltd. NCLH, +2.91% , Royal Caribbean Cruises Ltd. RCL, +2.59% and Carnival Corp. CCL, +0.51% all moved lower. SunTrust Robinson Humphrey analyst Patrick Scholes said the CDC’s extended order “should not be too much of a surprise,” as it comes after the last month’s announcement by Cruise Lines International Association of an agreement to voluntarily extend the suspension of operations from U.S. ports until Sept. 15. “We continue to believe that sailings will not resume in quantity in North America until at least 2Q21,” Scholes wrote in a note to clients. “Subsequently, we reiterate our belief there will be continued investor disappointment as further starting date delays are announced.” Here’s the latest news about companies and COVID-19: • LendingTree Inc. TREE, -0.37% is raising its outlook for the quarter as low interest rates drive mortgage refinancing. The company forecast revenue of $182 million to $186 million, up from its previous forecast range of $160 million to $175 million. Analysts surveyed by FactSet expect revenue of $170.8 million. “Across our three reportable segments, much of the strength was driven by our home segment, where low interest rates have driven robust consumer interest in refinancing and product innovation has enabled us to retain greater capacity with our lenders than we’ve historically seen,” said J.D. Moriarty, LendingTree chief financial officer. • PPG Industries Inc. PPG, +0.65%, the paint and coatings maker, reported second-quarter adjusted profit and sales that were above Wall Street expectations in part as do-it-yourselfers sought more of its home paints during the pandemic. Selling prices increased by nearly 2%, but sales volumes were down 24%, reflecting the economic impact of the pandemic. The strongest performance came from its global architectural coatings businesses, thanks to increased do-it-yourself demand for PPG paint products in all major regions. Demand for its architectural coatings is expected to continue but at a more moderate pace. “We expect continued, solid recovery patterns in automotive OEM and general industrial coatings demand in the U.S. and Europe, but still below 2019 levels,” it said. PPG ended the quarter with about $2.3 billion in cash and short-term investments, and it reduced its net debt by about $300 million compared with the previous quarter. • Regions Financial Corp. RF, -1.91% reported a surprise second-quarter loss, as credit loss provisions exceeded expectations, although revenue rose more than forecast. The bank swung to a net loss of $237 million, or 25 cents a share, from net income of $374 million, or 37 cents a share, in the year-ago period. The FactSet consensus was for a loss of 5 cents a share. Total revenue grew 7.6% to $1.55 billion, as net interest income increased 3.0% to $985 million to beat the FactSet consensus of $969.5 million and noninterest income rose 16% to $573 million to top expectations of $489.6 million. Net interest margin fell to 3.19% from 3.45% to miss expectations of 3.26%. Provision for credit losses increased to $882 million from $92 million, above the FactSet consensus of $514.2 million. COVID-19-related expenses for the quarter were $19 million, up from $4 million in the first quarter. • Credit Suisse doubled its stock price target on Tesla Inc. TSLA, +1.89% to $1,400 from $700 on Friday, and said the stock is “priced to perfection,” meaning any material upset would drive a correction. Tesla shares have gained a stunning 259% in the year to date, while the S&P 500 SPX, +0.87% has fallen 0.5%, driven by “euphoria’ about electric vehicles during the pandemic, a run of promising datapoints and heightened interest from retail investors, who have become more active during the pandemic. Coming positive catalysts include Battery Day, when Tesla is expected to unveil a long-lasting battery for its future vehicles, and second-quarter earnings that may show a profit, said analysts Dan Levy and AJ Denham. The company is expected to reveal plans to expand capacity, and could double it from its current level of about 700,000 vehicles to 1.3 million, the analysts wrote. To justify its current share price, Tesla needs to clear a raised bar and show that by 2025, it will be producing 2.2 million cars, putting it on par with German car makers. As the world’s most valuable car brand, it needs to deliver to lofty expectations, they wrote. • Vox Media is laying off about 70 people, as a result of the economic effects of the COVID-19 pandemic, according to a Wall Street Journal report. That represents about 6% of the workforce of the publisher of New York magazine, SB Nation and the Verge. The cuts will mostly affect those who were furloughed in April, as a result of the pandemic, but will include some employees who weren’t furloughed. Chief Executive Jim Bankoff told staff that the second half of the year will not rebound anywhere near pre-COVID forecasts, and there is limited visibility into the timing and strength of a recovery as new cases rise and many elected leaders avoid decisive action. Additional reporting by Tim Rostan"}]}