{"article": [{"url": "https://www.marketwatch.com/story/the-most-important-covid-19-related-federal-tax-relief-measures-including-some-that-can-result-in-hefty-tax-refunds-2020-04-10", "published": 1594641380.0, "headline": "Here are the most important coronavirus-related federal tax relief measures to know ahead of the July 15 tax deadline", "body": "The $2.2 trillion Coronavirus Aid, Relief, and Economic Security Act (CARES Act) delivers good news to individuals and businesses, including meaningful tax relief. The tax relief offered by the CARES Act is over and above the tax relief offered by the earlier Families First Coronavirus Response Act (FFCRA). Finally, the IRS has graciously postponed some federal tax payment deadlines and some federal tax return filing deadlines. Thank you for that, but we think there’s more that needs to be done and we think more probably will be done. Stay tuned. As this is written, here’s the up-to-date story on what I think are the most important COVID-19-related federal tax relief measures. Postponed federal tax payment deadlines Individual taxpayers can defer until July 15 federal income tax payments that would otherwise be due on April 15. This relief covers any remaining amount owed with your 2019 Form 1040 and any estimated 2020 tax payment that would otherwise be due on April 15 Ditto for federal income tax payments that would otherwise by due on April 15 for C corporations, trusts, and estates that use the calendar year for tax purposes. Individuals who owe federal gift tax and generation-skipping transfer tax (GSTT) for the 2019 tax year can defer payments of those taxes that would otherwise be due on April 15. There are no limits on the amount of tax payments that can be deferred, and no interest or penalties will be charged during the deferral period. Postponed federal tax returns filing deadlines Deadlines to file the following returns that would otherwise be due on April 15 are postponed to July 15. • 2019 individual federal income tax returns (Form 1040) • 2019 federal income tax returns for C corporations (Form 1120) that use the calendar year for tax purposes • 2019 federal income tax returns for trusts and estates (Form 1041) that use the calendar year for tax purposes. • 2019 federal gift tax and GSST returns (Form 709). These returns would otherwise be due on April 15, but you now have until July 15 to file them without having to submit an extension request to the IRS.More payment and filing postponements The IRS just announced that almost all federal tax payment and filing deadlines that would otherwise fall between April 1 and July 15 are automatically postponed to July 15 without any taxpayer action needed. This new relief mainly affects 2020 estimated tax payments that would otherwise be due on June 15 and federal income tax returns for taxpayers that use a fiscal year (rather than the calendar year) for tax purposes.Postponed deadlines for making 2019-tax-year contributions to IRAS and HSAs The normal April 15 deadline for making IRA and health saving account (HSA) contributions for your 2019 tax year is postponed to July 15.Economic impact payments for individuals These are the highly-publicized checks from the federal government. They can be up to $1,200 for an individual or $2,400 for a married couple. Folks with under-age-17 dependent children can receive up to another $500 per kid. However, these payments are phased out at higher levels of adjusted gross income (AGI). For details, go to the IRS website at www.irs.gov to access Information Release IR-2020-61 for FAQs and answers about economic impact payments. Borrow $100,000 from your IRA and pay it back three years later with no tax consequences IRA owners who are adversely affected by the coronavirus pandemic (and there will be plenty of them) will be eligible to take tax-favored coronavirus-related distributions from their IRAs. To keep things simple, let’s call these distributions CVDs. They can add up to as much as $100,000. You can recontribute a CVD back into your IRA within three years of the withdrawal date and treat the withdrawal and later recontribution as a totally tax-free rollover. In effect, the CVD drill allows you to borrow up to $100,000 from your IRA(s) and recontribute (repay) the amount(s) any time up to three years later with no federal income tax consequences. And there are no limitations on what you can use CVD funds for during the three-year period. If you’re cash-strapped, you can use the money to pay the bills and recontribute later when your financial situation has improved. You can help your adult kids out. You can pay down your HELOC. Whatever. For details, see this previous Tax Guy column. Small employer tax credits and payroll tax relief to cover required COVID-19-related employee paid leave For details on this relief, which was part of the FFCRA and which can also help out self-employed individuals, see this previous Tax Guy column. Employee retention tax credit for all eligible employers The CARES Act grants the so-called employee retention credit. The credit amount equals 50% of eligible employee wages paid by an eligible employer in a 2020 calendar quarter. The credit is subject to an overall wage cap of $10,000 per eligible employee. For details, see here. Warning: no double tax benefit allowed: The 50% employee retention credit cannot be claimed for COVID-19-related required employee leave payments mandated by the FFCRA for which the aforementioned federal payroll tax credits are claimed. Also, the 50% employee retention credit cannot be claimed for employee wages taken into account in claiming the pre-existing work opportunity tax credit or the pre-existing tax credit for paid family and medical leave. Payroll tax deferral relief for all employers and self-employed individuals Under the payroll tax deferral relief offered by the CARES Act, your business can defer the 6.2% employer portion of the Social Security tax component of FICA tax owed on the first $137,700 of an employee’s 2020 wages — for wages paid during the deferral period. The deferral period began on the 3/27/20 and will end on 12/31/20. Your business must then pay the deferred payroll tax amount in two installments: * Half of the deferred amount must be paid in by 12/31/21 * The remaining half must be paid in by 12/31/22. This payroll tax deferral deal is available to all employers, with no requirement to show any specific COVID-19-related impact. If you are self-employed, you can defer half of your liability for the 12.4% Social Security tax component of the self-employment (SE) tax for the deferral period. The deferral period began on 3/27/20 and will end on 12/31/20. You must then pay the deferred SE tax amount (we don’t yet know how to calculate that amount) in two installments: * Half by 12/31/21 * The remaining half by 12/31/22. Warning: forgiveness of PPP loans precludes eligibility for payroll tax deferral privilege The payroll tax deferral privilege is unavailable to any small employer, sole proprietor, or self-employed individual that receives forgiveness of SBA loans issued under the Payment Protection Program (PPP) offered by the CARES Act. The PPP has already been funded with $349 billion, with more funding sure to come. PPP loans are almost certainly more valuable than the payroll tax deferral deal, because the rules that allow PPP loans to be forgiven are very liberal. So, go for the forgivable PPP loan option if you can. For details on PPP loans and forgiveness, see here. Retroactive tax relief measures open up opportunities to file amended returns and recover taxes paid in earlier years Some of the tax relief measures offered up by the CARES Act are retroactive. Retroactive relief can affect 2018 and 2019 returns that have already been filed for you or your business. One retroactive relief provision can, in some cases, go all the way back to 2013. Here’s a quick summary of the CARES Act retroactive tax relief measures that can potentially benefit you or your business entity after amended prior-year returns have been prepared and filed. Liberalized rules for deducting net operating losses Business activities that generate tax losses can cause you or your business entity to have a net operating loss (NOL) for the year. The CARES Act significantly liberalizes the NOL deduction rules and allows NOLs that arise in 2018-2020 to be carried back five years. So, an NOL that arises this year can be carried back to 2015. An NOL that arose in 2018 can be carried back to 2013. Such NOL carry-backs allow you to claim refunds for taxes paid in the carry-back years. Because tax rates were higher in pre-2018 years, NOLs carried back to those years can result in hefty tax refunds. Better depreciation rules for real estate qualified improvement property The CARES Act includes a retroactive correction to the 2017 Tax Cuts and Jobs (TCJA) that allows much faster depreciation for real estate qualified improvement property (QIP) that is placed in service after 2017. QIP is defined as an improvement to an interior portion of a nonresidential building that is placed in service after the date the building was first placed in service. However, QIP does not include any improvement for which the expenditure is attributable to the enlargement of the building, any elevator or escalator, or the internal structural framework of the building. The retroactive correction allows you to claim 100% first-year bonus depreciation for QIP placed in service in 2018-2022. Alternatively, you can depreciate QIP placed in service in 2018 and beyond over 15 years using the straight-line method. Amending a 2018 or 2019 return to claim 100% first-year bonus depreciation for QIP placed in service in those years could result in an NOL that can be carried back to a prior tax year to recover taxes paid in that prior year, as explained earlier. Suspension of excess business loss disallowance rule An unfavorable TCJA provision disallowed current deductions for so-called excess business losses incurred by individuals and other noncorporate taxpayers in tax years beginning in 2018-2025. An excess business loss is one that exceeds $250,000 or $500,000 for a married joint-filing couple. The $250,000 and $500,000 limits are adjusted annually for inflation. The CARES Act suspends the excess business loss disallowance rule for losses that arise in tax years beginning in 2018-2020. Amending a 2018 or 2019 return to reflect the suspension of the excess business loss disallowance rule could result in a 2018 or 2019 NOL that could then be carried back to a prior tax year to recover taxes paid in that prior year, as explained earlier. The bottom line There you have it: the most important COVID-19-related federal tax relief measures IMHO. So far. I’m sure there will be more, so please stay tuned for updates. And be safe out there."}]}