{"article": [{"url": "https://www.marketwatch.com/story/to-defeat-covid-19-we-need-a-unified-national-strategy-says-public-health-expert-dr-howard-koh-2020-09-03", "published": 1599546860.0, "headline": "To defeat COVID-19, â\u0080\u0098we need a unified national strategy,â\u0080\u0099 says public health expert Dr. Howard Koh", "body": "This interview is part of a series of conversations MarketWatch is conducting with some of the leading voices in the U.S. on the COVID-19 pandemic. Dr. Howard Koh knows what itâ\u0080\u0099s like to be a government official running a pandemic response. In 2009, while he served as assistant secretary of health in the Department of Health and Human Services, the H1N1 flu virus was detected in the U.S. More than 60 million people in the U.S. were thought to have contracted the novel form of the influenza A virus, with at least 12,469 people succumbing to it. While there are marked differences between a flu pandemic and this coronavirus pandemic, Koh thinks many of the lessons he learned back in 2009 are missing today. â\u0080\u009cWhen crises occur, what people expect and deserve is a one-government approach: federal, state and local officials working together to protect the American people,â\u0080\u009d Koh, now a professor of public health leadership at the Harvard T.H. Chan School of Public Health, said Wednesday during an interview. In 2009, â\u0080\u009ceverybody saw that government was working together. And thatâ\u0080\u0099s what has been absent this time, and in my view has allowed this pandemic to persist for way too long.â\u0080\u009d MarketWatch: What are some things youâ\u0080\u0099d like Americans to better understand about how we develop drugs and vaccines in the U.S.? Dr. Howard Koh: With respect to vaccines, particularly, thereâ\u0080\u0099s a very well-described, carefully followed process for vaccines through [clinical] testing protocols, having them approved by the FDA, and then disseminated broadly to the public. Thatâ\u0080\u0099s a process thatâ\u0080\u0099s been respected over a number of decades for a whole host of vaccines that have saved millions of lives. We need to hold the standards high now for any potential COVID vaccine. MarketWatch: Does the focus on speed worry you? Koh: This current vaccine effort is being conducted in the fastest timetable in history. Vaccines can sometimes take a decade, and this vaccine is being developed over a matter of months. Along with speed, which is very much needed in a crisis like this, we also need attention to safety. And the public needs to hear more about the attention to safety. “ â\u0080\u0098If we skip the science now, it could cost us many lives later.â\u0080\u0099 ” â\u0080\u0094 Dr. Howard Koh MarketWatch: You recently tweeted about the need for clear, consistent standards for an emergency-use authorization, or EUA. What brought that up? Koh: It was fairly clear to me and many of my scientific colleagues that the data on [convalescent plasmaâ\u0080\u0099s] effectiveness was not strong enough to proceed with an EUA. There have been no definitive outcomes from randomized, placebo-controlled trials. The Mayo Clinic data that was held up as justifying authorization were analyses where everybody got convalescent plasma and there was no control arm. They tried to say that people who got it earlier did better than those who got it later, and those who got higher doses did better than those who got the lower doses of antibodies. But thatâ\u0080\u0099s not the gold standard for creating definitive evidence. At some point, randomized clinical trials are going to try to answer [whether] patients receiving convalescent plasma do better than those who donâ\u0080\u0099t. [But] itâ\u0080\u0099s very hard to have anybody agree to enter that trial because everybody will want the plasma, and no one will want to be randomized through a placebo-controlled arm. This announcement, ironically, is impeding the science. If we skip the science now, it could cost us many lives later. MarketWatch: Just to clarify: the EUA means that any COVID patient who fits that profile or the indication can now receive plasma. So there would be no need to enroll in a trial? Koh: Thatâ\u0080\u0099s the fear. An emergency use authorization is not approval. [FDA commissioner Dr. Stephen Hahn] did say that, in his defense. But I donâ\u0080\u0099t think people understand that distinction right now. The standard is much lower for issuing an EUA than a full FDA approval. In a time like this, where trust and confidence is everything, that bar has got to be held really high. MarketWatch: Earlier this summer, the surge of cases in July seemed to catch a lot of Americans off guard after the lockdown. Weâ\u0080\u0099re seeing some leveling now. What do you predict for the fall? What are you looking out for? Koh: Well, itâ\u0080\u0099s true that the cases have dropped by about a third from the peak in midsummer, but we still have a long way to go. Hospitalizations have declined. Deaths are starting to drop a little bit. That reflects the sacrifices of millions of Americans to adhere to these public health standards, and people should be thanked and supported for following those new norms. But weâ\u0080\u0099ve got a long way to go. In every step of this pandemic, our country has underestimated the tenacity of this virus and overestimated our ability to contain it. As a result, weâ\u0080\u0099re into month eight of the â\u0080\u009cfirst waveâ\u0080\u009d whereas so many countries around the world got through this in two and a half to three months. We opened up too early. We let down our guard. Thereâ\u0080\u0099s not been a coordinated national strategy. Every state is pursuing their own strategy. And itâ\u0080\u0099s led to this protracted first wave. People ask me regularly, is this a second wave? And I say, no, you have a second wave by definition only when the first wave comes and goes. The first wave has come and never left. Other countries are having small second waves [and] have aggressively tackled them in a way that our country has not. A second wave of COVID, plus seasonal flu, in the middle of schools and colleges [reopening], are all converging for this fall, and thatâ\u0080\u0099s the issue before us. MarketWatch: If you could set a national coronavirus plan, what do you see as the key pillars of what the U.S. needs to do in terms of its response? “ â\u0080\u0098The first wave has come and never left [in the U.S.]. Other countries are having small second waves [and] have aggressively tackled them in a way that our country has not.â\u0080\u0099 ” â\u0080\u0094 Dr. Howard Koh Koh: Weâ\u0080\u0099ve never had a national strategy. Itâ\u0080\u0099s always been 50 states. Itâ\u0080\u0099s late but still not too late to say we need a unified national strategy going forward: on testing, not just harder but smarter; on supporting contact-tracing efforts, which in too many parts of the country are overwhelmed right now because the case loads are so high; and on making sure that states are cooperating and not competing with each other for supplies and [personal protective equipment], to assure the hospital capacity is ready to go this fall. There should be a national requirement for masks. We still have only 35 states with requirements. And then itâ\u0080\u0099d be really important to have a daily briefing from the White House where top health officials, like Dr. Anthony Fauci [the director of the National Institute of Allergy and Infectious Diseases], were allowed to address the press and public directly, every day, starting with the explanation of trends and data and evidence. The president restarted these briefings after a couple of months of hiatus. But we need the highest-level health officials who are trusted, so that people realize thereâ\u0080\u0099s a unified response and thereâ\u0080\u0099s a system trying to protect everybody. The messaging has been so mixed. Confusion has been allowed to grow, and thatâ\u0080\u0099s just unacceptable, in the worst pandemic that our country has seen this century. MarketWatch: What do you think have been the biggest issues in this pandemic? Koh: Well, in the last 10 days, there was not just the FDA announcement [on convalescent plasma], which was then partially walked back by the commissioner, but then the [Centers for Disease Control and Prevention] changed guidelines on the need for asymptomatic contacts to be tested. And that appears to have been walked back, too, although last I heard the written guidance hadnâ\u0080\u0099t been changed back. What bothered me about the CDC development is that testing guidelines having to be revised is absolutely appropriate in a dynamic situation like this, with more evidence and data coming forward. We need constant revisiting of testing guidelines so we can focus on high-risk populations. But to do it just because the information was discovered on a website â\u0080\u0094 it just creates confusion and questions. In the future, when such guidance needs to be revised, it should be done in a proactive way, with a formal press conference, with the director of the CDC explaining why the change was made, with the evidence and the data to support it. And if that were done, the scientific community would rally around whatâ\u0080\u0099s changing. But that did not occur. MarketWatch: Following up on what you said earlier when we were talking about your national plan ideas, you mentioned testing not just harder but smarter. Can you explain that? Koh: We now know that there are certain high-risk groups for COVID. Nursing homes, thatâ\u0080\u0099s absolutely front and center. Frontline health-care workers. Essential workers in key businesses. And, very importantly, communities of color. Homeless shelters. And now potentially schools and colleges. Theyâ\u0080\u0099re trying to send more rapid tests to nursing homes, and thereâ\u0080\u0099s more attention to testing for asymptomatic and symptomatic patients and staff in nursing homes. Thatâ\u0080\u0099s a step forward. It came a little late, but at least it occurred. We want to see that process continue and then similar efforts for those other high-risk groups. The principle is always [to] go for the high-risk populations, and prioritize them. And we havenâ\u0080\u0099t done that in a systematic way in this response at all. This Q&A has been edited for clarity and length. Read more A Word from the Experts interviews: â\u0080¢ A lung doctor on what sheâ\u0080\u0099s learning about coronavirus â\u0080\u0098long haulersâ\u0080\u0099: shortness of breath, fatigue, and depression but also â\u0080\u0098improvement over timeâ\u0080\u0099 â\u0080¢ This Seattle man volunteered to be injected with an experimental COVID-19 vaccine: â\u0080\u0098It was kind of my duty as a healthy individual to step upâ\u0080\u0099 â\u0080¢ Dr. Osterholm: Americans will be living with the coronavirus for decades"}]}