{"article": [{"url": "https://www.marketwatch.com/story/pelosi-rejects-idea-of-a-stand-alone-fiscal-stimulus-bill-11602173955", "published": 1602173540.0, "headline": "Pelosi rejects idea of a stand-alone fiscal stimulus measures", "body": "Speaker of the House Nancy Pelosi, D.-Calif., speaks during her weekly news conference at the U.S. Capitol on July 31. (Photo by Drew Angerer/Getty Images) Hopes for a restart of talks over a large-scale U.S. economic stimulus package, or even more targeted aid for the troubled airline industry, took a big hit Thursday after Democrat House Speaker Nancy Pelosi said she still wanted a bigger bargain. “There is no stand-alone bill without a bigger bill. There is no bill,” Pelosi told reporters at her weekly press conference at the U.S. Capitol. Pelosi was responding to a question asking if she would accept a stand-alone bill aimed at providing a second round of grants to passenger and cargo airlines to help them retain workers. She softened the stance slightly later in an interview with Bloomberg Television, allowing that an airline bill could possibly move at a different time than a more comprehensive measure but only if that companion piece of legislation was also agreed. “We can do that separately, but we cannot do it unless there’s a big bill,” she said. “So, it can be part of a big bill or it could be separate from a big bill from a timing standpoint, but there won’t be anything unless we crush the virus, put money in the pockets of the American people. “ “We can do that separately, but we cannot do it unless there’s a big bill.” – House Speaker Nancy Pelosi Still, after President Donald Trump said he was pulling out of talks Tuesday, then reversed course and tweeted he wanted to sign smaller measures for the airlines and for direct payments to households, and Pelosi said she was only conditionally open to airline help Wednesday, talks looked to be stalled again as they have been since early August. Pelosi’s counterpart in the Senate, Republican Majority Leader Mitch McConnell, told reporters at a Kentucky campaign appearance Thursday that he was not upbeat about the prospects for a deal before the elections in November. “I think it’s uncertain, but we’re still talking, ” he said. “I do think the proximity to the election has made this much more challenging.” Trump earlier Thursday, in a phone interview with Fox Business Network, had said stimulus talks were going well, raising hopes for either an airline package or a renewal of talks for a bigger package. Read more: Trump says stimulus talks have turned ‘very productive’ after he called off negotiations Pelosi spent much of her time at the press conference touting a Democratic proposal to provide $75 billion for coronavirus testing and tracing, an issue she pointed to as a sticking point in talks because of administration recalcitrance. “We have our differences in numbers, but it’s no use of having just a numbers discussion unless we know what that money is spent on,” she said. The political popularity of moving another package before the election instead of waiting for the post-election lame duck session has made both sides reluctant to be seen publicly as the one ending talks. But Trump provided an advantage for Democrats with his Tuesday tweet saying the Senate should give priority to confirming a new U.S. Supreme Court justice rather than another fiscal stimulus package. Trump later reversed himself with the tweets saying he wanted legislation on aid to airlines and payments to households. Similarly, Pelosi appeared to leave some room open to more talks as well as she left the press conference. “We’ve told the White House we’re at the table. We’re at the table,” she said. “We want to continue the conversation. We’ve made some progress, we’re exchanging language. And then, so, we’ll see how they come back.” Rep. Josh Gottheimer, a Democratic representative from New Jersey and a leader of bipartisan group called the Problem Solvers Caucus that pitched its own package, said he is not giving up hope. But he said some of his colleagues worried what issues might get left out of a piecemeal approach. The risk, he said, is “you end up leaving pieces out that need to get done.” Read more: Coronavirus relief effort stalled because only the poor are hurting: former Fed economist"}]}