{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-sink-270-points-after-best-quarter-in-three-decades-ahead-of-adp-jobs-fed-minutes-2020-07-01", "published": 1593622760.0, "headline": "Nasdaq sets record close, Dow ends lower to kick off July after Fed vows to guide markets on rates path", "body": "The Dow finished lower Wednesday, but the tech-heavy Nasdaq was vaulted to a fresh record close, giving the year’s second half a mixed start as investors focused on signs of economic recovery from the coronavirus crisis and a new Fed promise for clarity on the path of rates. Improving data on employment and the manufacturing sector helped buttress markets in the first trading day of July, even while nearly a dozen American states have hit pause or halted plans to allow more businesses to reopen. How did benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% fell 77.91 points, or 0.3%, to end at 25,734.97, snapping a two-day win streak. The S&P 500 SPX, +0.87% added 15.57 points, or 0.5%, to close at 3,115.86. The Nasdaq Composite COMP, +1.39% rose 95.86 points, or 1%, closing at a record 10,154.63. The Dow gained 17.8% in the second quarter, its best quarter since 1987; the S&P 500 rose nearly 20%, marking its best since 1998; while the Nasdaq Composite soared nearly 31% over the period for its sharpest quarterly return since 1999.What drove the market? Market participants parsed minutes from the Fed’s June 9-10 meeting, where the rate-setting Federal Open Market Committee agreed to provide clarity in future communications about what would cause the central bank to keep rates close to zero or move them higher. The committee kept federal-funds rates at a range between 0% and 0.25% and signaled that it might hold levels there until at least 2022. So-called “forward guidance” can help stabilize the market at a moment of fragility as the economy attempts a fitful rebound from the impact of the deadly coronavirus pandemic. Policy makers also discussed yield-curve control, a strategy of maintaining a fixed rate for yields that entails capping short- and intermediate-term debt at a desired level to help provide additional support for the market amid the COVID-19 crisis. The Fed did not appear to be close to making any near-term changes to policy. “The minutes from the early-June FOMC meeting suggest that the Fed is still a long way from rolling out explicit targets for longer-term Treasury yields,” wrote Andrew Hunter, senior U.S. economist at Capital Economics in a research note on Wednesday. Even though the blue-chip Dow ended the day lower, its biggest gainer was Pfizer Inc. PFE, -0.27%, which reported positive results from its clinical trial for a COVID-19 vaccine candidate, saying all 24 participants in the trial had developed neutralizing antibodies, but the data hasn’t been peer-reviewed. Also bolstering investor sentiment, the Institute of Supply Management said its manufacturing purchasing managers index climbed to 52.6% from 43.1% in May and from an 11-year low of 41.5% in April. Any reading above 50 represents an expansion in economic activity. “A better-than-expected pickup in the manufacturing sector is another positive sign that the economy is recovering more rapidly than expected,” said Jim Baird, chief investment officer for Plante Moran Financial Advisors. “Still, the ongoing spread of COVID-19, and the policies targeted at containing it, present significant risks to the path forward for the economy. The rebound clearly underway creates reason for hope; the ongoing health risk provides reason for caution,” he said. In other data, Automatic Data Processing Inc.’s private-sector employment report showed the U.S. added 2.37 million jobs in June. More important, ADP raised May’s numbers to reflect that 3.06 million jobs were, in fact, added that month, instead of a loss of 2.76 million jobs. The Labor Department’s nonfarm payrolls data for June will be published Thursday ahead of the July Fourth holiday observed on Friday. The U.S. is now recording roughly 40,000 new coronavirus cases a day and the nation’s top infectious disease expert, Dr. Anthony Fauci, warned a Senate committee on Tuesday that daily cases could hit 100,000 if people continue to flout public-health recommendations on social distancing and wearing face masks to limit the spread of the infection. See: Coronavirus update: U.S. case tally climbs above 2.6 million, and top Republicans now call on Americans to wear face masks “I think the relentless press coverage of the new cases has been one of the things that’s driven markets,” said Rich Sega, global chief investment strategist at Conning, in an interview with MarketWatch. “But the recovery has been better so far — not great — but better than most had anticipated.” Which stocks were in focus? General Mill’s shares GIS, +0.78% fell 2% after the company beat earnings estimates for its fiscal fourth quarter, boosted by strong demand for at-home food during the coronavirus pandemic. Macy’s M, -0.95% reported fiscal first-quarter results that matched Wall Street expectations. Shares of the department-store chain slipped 4.4%. Shares of Michael Kors parent Capri Holdings Ltd. CPRI, +2.55% retreated 1.9% after the luxury fashion group reported a fiscal fourth-quarter adjusted profit that missed expectations, while revenue fell less than forecast. Lemonade LMND, +12.82% Insurer raised the price range for its initial public offering to $26 to $28 a pop from an earlier range of $23 to $26 each. The company is planning to sell 11 million shares, to raise would raise $308 million at the top of the range. FedEx shares FDX, +0.18% surged 11.7% after the deliveries-and-logistics company reported better-than-expected adjusted profit and sales in its fiscal fourth quarter, as the surge in online buying amid the coronavirus pandemic offset higher costs and thinner margins. Apple Inc. AAPL, +1.74% on Wednesday said it has decided to re-close 30 of its retail stores in the U.S., bringing the nationwide total to 77, citing a spike in coronavirus cases in parts of the U.S. Shares ended 0.2% lower. How did other assets perform? West Texas Intermediate U.S. crude US:CLQ20 for August delivery gained 55 cents, or 1.4%, to settle at $39.82 a barrel on the New York Mercantile Exchange, August gold futures US:GCQ20 lost $20.60, or 1.1%, to finish at $1,779.90 an ounce. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% was 2.9 basis points higher at 0.682%. Bond prices move inversely to yields. The greenback fell 0.2% against a basket of its major rivals, based on trading in the ICE U.S. Dollar Index DXY, -0.58%. In European equities, the Stoxx Europe 600 index SXXP, +0.55% closed up 0.2% and London’s FTSE 100 UKX, +0.64% retreated to end 0.2% lower. In Asian markets, the Japanese Nikkei NIK, -0.11% declined 0.8%, while South Korea’s Kospi finished the session 0.1% lower. China’s CSI 300 000300, +2.04% rallied 2%, while the Shanghai Composite Index SHCOMP, +1.67% advanced 1.4%."}]}