{"article": [{"url": "https://www.marketwatch.com/story/lessons-learned-from-being-laid-off-in-the-last-recession-2020-07-24", "published": 1595344880.0, "headline": "Lessons I learned from being laid off in the last recession", "body": "This article is reprinted by permission from NextAvenue.org. I remember well the shock of being suddenly laid off during the Great Recession of 2007-09. I was in my mid-50s when my good job disappeared, my income fell to zero and I was suddenly on the outside looking in at a life that was no longer mine. I learned some hard lessons from this experience. There’s a lot I would have done differently if I knew then what I know now. I’d like to share my experience and what I learned because I think it could help you if you’ve lost your job due to the coronavirus pandemic — or fear you will. There’s still time to avoid making the mistakes I made when I found myself suddenly jobless in early 2009. While Washington debates whether to further assist unemployed Americans, and how, here are a few things to consider if you’re out of work right now:Plan on being unemployed much longer than you expect That’s especially true if you are over 50. It took me over two years to find work commensurate with the job I left in 2009. I was not ready for that dry spell. I’d never had trouble landing a job before. I had a strong network and excellent credentials — Harvard MBA, Johns Hopkins, employment at The World Bank. I was used to getting assignments before they were even posted. What I had not counted on was the extent that being in my 50s would hinder my job search. It felt like hiring managers would see me coming and pull up the drawbridge. And that’s on those rare occasions I even got a call back. It was hard not to take this personally. What I didn’t know then is that it wasn’t personal, it was systemic. A 2018 study by the Urban Institute think tank and the nonprofit journalism outlet ProPublica found that over half of workers over 50 will, at some point, be jettisoned from their jobs (fired outright) or forced to resign (jumping before they’re pushed). And among those 50 and over who’ve lost their jobs, only 10% ever found work paying what they used to make. This was pre-pandemic. COVID-19 may further dampen job prospects for older out-of-work adults. Age is one of the risk factors for severe COVID-19 illness and older adults are disproportionately targeted by the virus. As COVID-19 spreads, I would expect employers and hiring managers to take workplace age demographics into account as a way to manage health care costs. So, the risk of the coronavirus becomes one more strike against older applicants. Related: Over 50 and looking for a job? Here’s the smart way to pitch yourself What’s more, as coronavirus restrictions ease and the economy reopens, most employers won’t immediately hire back 100% of the employees they let go. They’ll more likely calibrate hiring to their expectations about the new normal. A recent study by three economists estimated that 42% of recent pandemic-induced layoffs will result in permanent job loss. That means two out of every five people laid off during the lockdown will not be rehired. Sobering, I know.Reduce your expenses Believing I would find a job quickly because of my education, work history and professional network, I maintained my old standard of living for too long. I cut out some things, but was not nearly aggressive enough, a mistake that drained my savings. When I recommend aggressive cost cutting, I mean going beyond the usual things. Cancel all your subscriptions, scrutinize nonessential automatic payments, pause things like gym memberships, switch to a cheaper cellphone plan, start buying generic brands. Also, call your creditors to see what kind of debt relief you can negotiate. There is a lot of good information on the internet on ways to cut monthly expenses and live low to the ground. One of my favorite resources is “The Financial Diet,” from personal finance writer Chelsea Fagan. See: Why COVID-19’s impact on the job market is far worse for older workers Cost-cutting is easier when nothing’s open and everyone is under quarantine. But as stores and restaurants return, there will be more pressure to spend what you don’t have. Conserve your cash. It’s hard. But I found that the momentary cringe from turning down an invitation (yet, again) stings less with practice.Think strategy, not failure Many people who lose their jobs have no qualms about applying for unemployment benefits. But applying for SNAP (formerly called food stamps), Medicaid, energy assistance or other safety net programs often gives them pause. I get it. The first time I used my SNAP card, I drove across town to an out of the way grocery store. There is stigma and shame attached to applying for these programs. Get over it. Don’t your tax dollars fund these programs? Get whatever support you need. Your objective now is to survive, to do what you need to do, to go another round. That might mean taking in a roommate, moving in with your parent or child or crashing in your neat nut brother’s basement for a few months. You’re not going to love any of this; you’re going to feel like you’re moving backward. But think of what you’re doing as strategy, not failure — a way to manage through this crisis. One of my favorite help tools to find useful benefits is the National Council on Aging’s BenefitsCheckUp site. It scours 2,500 benefit programs across the country to see what you might qualify for in the areas of food, rent, transportation and medication.Find your people When I was unemployed in 2009, I began meeting and corresponding with women friends in the same boat. I called them my resilience circle and we helped each other, shared information, insights, resources and contacts. With them, I didn’t have to pretend I was OK when I wasn’t. A resilience circle can be very beneficial because as the months drag on, being unemployed can be lonely and stressful with its own parade of horribles to process and manage. I had some dreary, down days. What made all the difference for me was having a place where I could share honestly what was going on and where I could get perspective from others navigating the same waters. My resilience circle did that for me. To create your own resilience circle, you’ll just need three to eight people who are tired of going it alone on the job search and see value in sharing life hacks and information as well as being a support to each other. In my book “55, Underemployed and Faking Normal,” I go into detail on how to form a resilience circle and include questions at the end of each chapter to get your group’s discussion going. If you feel like you don’t know anyone to invite into a group or would prefer being in a group with others who don’t know you, post your interest in forming a resilience circle on Facebook or LinkedIn. You’re sure to get some takers.Get off your throne With so much uncertainty about how fast the economy will recover, you may be jobless for a while or experience a cut in pay if you’re called back to work. My advice is to do what I did: get off your throne. During my years working overseas, I did a lot of first class and business class travel. But the last time I traveled to New York City, I put my behind on the bus for a tiny fraction of what it would have cost me to take the Acela or fly. In recent years, I’ve accepted assignments that have paid a quarter of what I’m used to making and done small gigs I would have given to interns in my old life. It’s all about lowering your expectations around compensation. I’ve found it’s important to consider the nondollar benefits of job offers. I once took an assignment that paid a quarter of what I was used to making but let me travel around the country to talk about my work — a huge plus at the time. I also came to realize that getting practical about my job search and options didn’t mean I was destined to do work I hated forever. I just had to let go of this notion that my worth and value are based solely on my title and income. These days, I think in terms of creating an interesting casserole of work with two- or three-income streams. Whether you consider it the sharing economy or the sharing the crumbs economy, freelance, part-time work is where a lot of us are headed. Interesting enough, I’ve found that the best place to look for a gig or part-time consulting assignment is often at the 9-to-5 job you just left. Gig work will likely not pay what you’re used to earning. But you may find, as I have, that you need a lot less these days to be happy. Also see: COVID-19 will force older workers into early retirement That’s been one of the silver linings of the pandemic lockdown. I chuckled when a friend said: “It’s like God sent us all to our rooms to think.” A lot of us have come back with a better understanding of who and what matters to us.You’re not alone I remember that in the aftermath of the 2007-09 recession, as the weeks and months passed and some people began to return to work, patience waned and generosity hardened. What I’ve learned is that as a country these days, we’re not having a jobs crisis–we’re having a good jobs crisis. That’s a systemic problem, not a personal one. And if you are one of the millions of unemployed workers who don’t find a job right away, know that you’re not alone by a long shot and that where you’ve landed is not your fault. Elizabeth White is a Next Avenue Influencer in Aging, an aging advocate, a consultant and author of “55, Underemployed and Faking Normal.” Follow her on Twitter @55fakingnormal and on Facebook at 55 & Faking Normal. This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}