{"article": [{"url": "https://www.marketwatch.com/story/got-regrets-so-does-everyone-heres-how-to-minimize-them-11597333412", "published": 1597406540.0, "headline": "Got regrets? So does everyone. Here's how to minimize them", "body": "Choose wisely, and then don't worry about it. Getty Images/iStockphoto  Last week, I learned the disappointing news that our next-door neighbors-possibly the nicest people in the world-have put their house on the market. While I'm sorry to see them go, I understand their decision. With a growing family, they're looking for more room. During the pandemic, in fact, many people are making changes of one sort or another. Will they be happy with their choices? That brings me to a new project, developed by author Daniel Pink, called the World Regret Survey. The goal: to better understand the dynamics of decision-making and regret by collecting and cataloging regrets shared by people around the world. Interestingly, Pink has made his initial data available online. It is, in essence, a giant database of regrets. Many of them, as you might imagine, have to do with career and personal finance. While some amount of regret in life is inevitable, there are certain strategies that can help keep it to a minimum. Here are six such strategies: 1. Rules. It's common sense that decisions made under stress generally have worse outcomes. But sometimes, decisions can't wait and need to be made amid stressful circumstances. What's the solution? In my view, it comes down to one word: rules. Or maybe two words: decision rules. To the extent possible, try to write out a set of financial rules for yourself. For example, if the stock market declines again, what will you do-sit tight, rebalance, complete a Roth conversion or perhaps contribute to your children's 529 accounts? While no one can conceive of every possible eventuality, you can still cover the big ones. This will make it easier to make logical decisions when the time comes. 2. Records. It might seem tedious, but there's a lot of value in keeping a log of financial decisions. Whether a decision goes well or poorly, you'll be able to revisit your initial thinking after the fact. Since no one's memory is flawless, I've found logs like this to be helpful. In some cases, as you review your records, you'll want to congratulate yourself. In other cases, you'll want to beat yourself up. But either way, you're almost guaranteed to learn something that will help the next time around. 3. Information. A month ago, mortgage rates were at all-time lows. Where are rates today? Even lower. Does that mean that, if you refinanced your mortgage a month ago, you should regret it? To be sure, it would be easy to regret not waiting a month, but no one could have known that rates would go lower-and they could easily have gone the other way. That's why I think it's so important to exclude from decision-making what you think could happen in the future. If you make the best decision you can with the information available today, that's the best you can do. And if you keep that information in your log, as recommended above, that will go a long way toward not second-guessing yourself later. 4. Devil's Advocate (Part I). Psychiatrist Viktor Frankl advocated this approach to decision-making: \"Live as if you were living a second time, and as though you had acted wrongly the first time.\" In other words, to avoid regret after the fact, try to think through all of the possible outcomes of a decision before the fact. As I noted above, it's impossible to see the future. But it is possible to make some educated guesses. Ask yourself: If something went wrong with the decision I'm about to make, what would it be? In a sense, you want to play devil's advocate with yourself. You might not change your mind, but at least you'll have considered a wider range of potential outcomes. 5. Devil's Advocate (Part II). Two heads are better than one, or so the saying goes. But if you ask a friend to weigh in on a financial decision, take his or her response with a grain of salt-because what you may hear is some pithy aphorism. I've heard dozens during my career: \"Don't fight the Fed.\" \"Your first trade is your best trade.\" \"Never try to catch a falling knife.\" \"Trees don't grow to the sky.\" \"Don't cut your flowers and water your weeds.\" \"No one ever went broke taking profits.\" What's dangerous about these sayings is that they sound wise-and, as a result, they can be convincing. But beware: Many of them justsound wise. In fact, there's usually another equally pithy saying that perfectly contradicts many of these common sayings. 6. Quantify. To the extent possible, understand the type of decision you're making. Specifically, try to quantify what the benefit might be if the decision goes well and what's at risk if it goes poorly. You can't know these numbers in advance with any precision. But I nonetheless recommend this as a thought experiment. In racetrack terms, you want to understand the odds. With some investments, the potential risk and return are about even, but in other cases, it is skewed one way or the other. You might still choose to make some bets that are risky-and I'm not suggesting you shouldn't-but I think it's a good regret-minimization technique to at least go through this exercise. Adam M. Grossman's previous articles include Don't Be That Person, Skewed Impression and What to Worry About. Adam is the founder of Mayport, a fixed-fee wealth management firm. In his series of free e-books, Adam advocates an evidence-based approach to personal finance. Follow Adam on Twitter @AdamMGrossman. This column originally appeared on Humble Dollar and was republished with permission."}]}