{"article": [{"url": "https://www.marketwatch.com/story/attorney-general-barr-ordered-antitrust-probes-of-10-cannabis-mergers-because-he-dislikes-the-industry-prosecutor-says-2020-06-24", "published": 1593154460.0, "headline": "Attorney General Barr ordered antitrust probes of 10 cannabis mergers, because he dislikes the industry, prosecutor says", "body": "A federal prosecutor told House lawmakers on Wednesday that Attorney General William Barr ordered antitrust staffers to investigate 10 proposed mergers in the cannabis sector because of his personal dislike of the industry. John Elias, a member of the Justice Department’s antitrust division, told the House Judiciary Committee in prepared testimony that the investigations were carried out even after staffers had determined that the cannabis business is highly fragmented with many market participants in the states that have legalized cannabis. Read Elias’ statement. Mergers are usually only subjected to antitrust investigations if they are likely to have an impact on competition or create a monopoly. “While these were nominally antitrust investigations, and used antitrust investigative authorities, they were not bona fide antitrust investigations,” said Elias. “Nonetheless, they accounted for 29% of the Antitrust Division’s full-review merger investigations in Fiscal Year 2019.” The testimony is part of the committee’s probe into whether the Justice Department under Barr has been improperly politicized. Elias and Aaron Zelinsky, a career Justice Department prosecutor, were subpoenaed by House Democrats to testify. Zelinsky worked on cases as part of special counsel Robert Mueller’s investigation, including the case against Roger Stone, an ally of President Donald Trump. See now:Career prosecutor set to tell Congress that Trump ally Roger Stone got special treatment from the Justice Department Elias explained that the antitrust division’s manual instructs staffers to first look at market share as an indicator of whether a deal needs to get routine clearance or be subjected to the fullest review, by issuing what is called a “Second Request” subpoena. Typically, a company would need at least double-digit market share to merit that subpoena, which can lead to demands for hundreds of thousands or even millions of documents. See also:Mueller said to have weighed possibility Trump lied in written responses to investigators Merging companies must comply with a Second Request subpoena, as they cannot close a deal until they have complied. The prosecutor said in the case of a review of a proposed merger between cannabis retailer MedMen Enterprises Inc. and PharmaCann LLC, staffers found the deal did not raise any significant competitive concerns. But on March 5, 2019, Barr called the antitrust division leadership to his office and ordered them to issue Second Request subpoenas. The division went ahead and did so and said the reason was that it had not “evaluated this industry before.” “This rationale — standing alone, without reference to a competition problem — is not described in the Merger Guidelines as a basis for investigating a transaction,” said Elias. The companies were then asked to provide 1.3 million documents from the files of 40 employees. The investigation then found that the markets were indeed “unconcentrated” and was closed without enforcement action. By then, however, the deal had collapsed with MedMen citing delays in obtaining regulatory approval. The company’s stock price had lost about a third of its value while the investigation was being conducted. See also:U.S. pot retailer MedMen says it’s trying to use stock to pay its bills amid cannabis industry’s cash crunch The antitrust division went on to investigate another nine deals, including one in which staffers determined the post-merger market share would be just 0.35%, said Elias. When prosecutors brought their concerns to the head of the Antitrust Division, Assistant Attorney General Makan Delrahim, he responded by saying the investigations were motivated “by the fact that the cannabis industry is unpopular ‘on the fifth floor,’” a reference to Barr’s offices in the DOJ headquarters building. “Personal dislike of the industry is not a proper basis upon which to ground an antitrust investigation,” said Elias. Barr said in April of 2019 that he would “favor one uniform federal rule against marijuana but, if there is not sufficient consensus to obtain that, then I think the way to go is to permit a more federal approach so states can make their own decisions within the framework of the federal law and so we’re not just ignoring the enforcement of federal law,” he said. The Justice Department did not immediately respond to a request for comment. MedMen shares MMNFF, +0.84% were last trading at 23 cents, and have lost 56.5% in 2020 to date. The Cannabis ETF THCX, +3.21% was down 4% Wednesday, and has lost 22.5% in the year to date, while the S&P 500 SPX, +0.87% has fallen 5.7%."}]}