{"article": [{"url": "https://www.marketwatch.com/story/california-reaches-a-temporary-eviction-relief-deal-just-ahead-of-deadline-11598659629", "published": 1598645720.0, "headline": "California reaches a temporary eviction-relief deal just ahead of deadline", "body": "Renters and housing advocates attend a protest to cancel rent and avoid evictions in front of a courthouse on Aug. 21 in Los Angeles. Valerie Macon/AFP via Getty Images California’s governor, legislators and other stakeholders on Friday agreed to an emergency measure to try to stave off evictions in the state, where a statewide moratorium is set to expire Sept. 1. Assembly Bill 3088, which extends protections for tenants until Jan. 31, 2021, is a compromise bill revised after negotiations on Friday, with stakeholders agreeing to the new terms. Lawmakers must pass it by Monday, when the state’s current legislative session ends. Under the proposal, tenants can be sued in civil court for back rent they owe through Aug. 31, but they cannot be evicted. For rent owed after August and through the end of January, tenants must pay 25% by Jan. 31 — 75% will be treated as civil debt — or risk eviction. There are different requirements for high-income tenants, defined as those who make 130% of the median income in their part of the state. Tenants must show proof that their income has been affected by the COVID-19 pandemic. See: Thousands in Silicon Valley in danger of eviction as end of California moratorium nears The proposal falls short of the tenant protections of a previous bill, AB 1436, by Assemblyman David Chiu, a San Francisco Democrat, which would have prohibited evictions through April. He is co-author of the compromise bill but expressed disappointment. “What the governor has announced today is an imperfect but necessary solution to a colossal problem,” Chiu said in a statement Friday. “I want to be clear that this is a temporary fix. As we track the impact of the pandemic and recession on tenants, we will have to revisit this conversation early next legislative session.” Advocacy groups, which have estimated that millions of renters in the state could be at risk of eviction, are calling for further action. See: Judges end California’s statewide moratorium, landlords could seek evictions in a couple of weeks “Unless it is paired with a blanket eviction moratorium, COVID-impacted renters could be evicted by landlords using other excuses to get rid of tenants [whom] AB 3088 is supposed to protect,” Public Advocates said in a statement urging Gov. Gavin Newsom to issue an executive order next week to extend the statewide eviction moratorium through at least the end of the year. During a Friday press conference Newsom referred to difficult negotiations but said, “I don’t know that there’s another state leaning in [and] doing more to protect tenants than the state of California.” Landlord groups voiced their support for the compromise: “We applaud the Legislature and governor for advancing legislation with protections for tenants truly harmed by COVID, while ensuring that owners can evict nuisance tenants and residents who can afford to pay rent but choose to game the system instead,” said Tom Bannon, chief executive of the California Apartment Association, in a statement. That’s language that tenant advocates are worried about. “There is a huge racial-justice component to this,” Sam Tepperman Gelfant, managing attorney for Public Advocates, told MarketWatch on Friday. “Black and Latino households are more likely to be renters, more likely to impacted by COVID, and may be more subject to arbitrary evictions.”"}]}