{"article": [{"url": "https://www.marketwatch.com/story/robinhood-investors-are-beating-the-stock-market-and-heres-the-data-that-proves-it-2020-08-06", "published": 1596881720.0, "headline": "Robinhood investors are beating the stock market - and here's the data that proves it", "body": "It is hard to go an hour without seeing another headline related to Robinhood cross the screen, as the investing world has been captivated by the motley crew of investors that call the Reddit stock and option trading community r/wallstreetbets home. What piqued my interest was Hertz HTZ, -1.78% attempting to raise money by selling equity (later quashed by the Securities and Exchange Commission) after filing for bankruptcy, with the sole goal of selling worthless equity to Robinhooders. As a chartered financial analyst with over a decade of capital markets experience, this raised two specific questions in my mind. How good or bad are these investors? And are these amateur investors responsible for the recent run-up in securities prices? To gain insights on investor performance and market influence, I analyzed stocks that trade on the platform within the Russell 1000 index RUI, +0.88% using publicly available tracking information. First, are Robinhood users successful investors? To answer this, I analyzed the widely held Robinhood stocks within the Russell 1000 and compared them to the median results of the stocks within the Russell 1000. This process essentially takes the median volatility and return profile of the widely held (defined as more than 10,000 holders) stocks of Robinhood investors and compares them to the median return and volatility of the Russell 1000 constituents. Robinhood investors do have a reputation as risk-takers, and the data proves this. In fact, as shown in the chart below, on average Robinhood investors take significantly more risk than your average Russell 1000 stock - a risk appetite that seems to have grown since the COVID-19 crisis began. But has their risk appetite translated into worse future returns for their holdings? To answer this, we looked at the future 1-month returns at each point in time to see if the increased risk-taking was resulting in worse returns for Robinhood investors. For example, if we looked at the 54 securities that had over 10,000 Robinhood holders on March 8, 2018, we see they had a median return from March 5, 2018, to June 3, 2018, of 4.73% vs the Russell 1000 median return of 2.97%. The chart below shows those future results over time: Shockingly, there are very few times that Robinhood investors (on average) performed materially worse than the market - and they appear to have done better than the market during the COVID-19 crisis. Robinhood investors have been buying riskier stocks, but have also been performing slightly better than the market. As for our second question, is Robinhood responsible for moving the market? This query can be answered easily by tracking the minimum value of accounts over time. As each Robinhood holder of a specific stock must hold at least 1 share of that stock, we can analyze the minimum dollar value of Robinhood accounts. For example, if Tesla has 300,000 holders, we know the minimum number of shares held is going to be 300,000 (1 per holder). In reality, this number is much higher, at least on a notional level, since it isn't clear if this data includes options or not - and one cannot be hard-pressed to believe that in companies with lower share prices (such as Ford or Hertz), the average Robinhood holder will have many more than one share. According to that simple methodology, the minimum dollar value of Robinhood holdings has jumped by 396% since the COVID lowâ\u0080¦ which makes it seem pretty obvious that Robinhood investors are having a major impact on the market. What does this mean for other investors? Retail investing has come into its own during the pandemic. With more people social distancing in their homes, the market has seen an unprecedented uptick in day-trading from everyday investors. Markets are now faced with a less disciplined albeit riskier faction of investors ready to take immediate action on the household names they are familiar with. This leaves more sophisticated investors with the added responsibility of following the swings resulting from Robinhooders investing in well-known companies. Luckily, there seems to still be a sense of normalcy for lesser-known and high-growth-potential companies that are not experiencing the same phenomena. All that we know for sure is that Robinhood investors are doing slightly better than average, and in much riskier stocks than average. It also does not look like the rapid growth in Robinhood accounts and the minimum dollar value invested is decreasing. I would personally expect these trends of Robinhood investors outperforming the market and the number of Robinhood investors increasing to continue until the market goes \"risk-off\". Until then, it might not make sense to bet against Robinhood. Nicholas Abe, CFA, is the COO of Boosted.ai, an artificial intelligence firm that helps institutional investors implement machine learning in their portfolios."}]}