{"article": [{"url": "https://www.marketwatch.com/story/mega-polluter-china-sets-date-for-curbing-emissions-dialing-up-the-pressure-on-the-u-s-11600876359", "published": 1600862420.0, "headline": "Mega-polluter China sets date for curbing emissions, dialing up the pressure on the U.S.", "body": "A Chinese man wears a mask to help protect himself from COVID-19 and pollution during rush hour in Beijing. Getty Images China, the world’s largest polluter, says it will try to flip to carbon-neutral by 2060, a nonbinding pledge that nonetheless raises the pressure on the U.S. to toughen its national response to man-made climate change. President Xi Jinping told the U.N. General Assembly that his country will embrace a “green revolution” as the global economy emerges from the coronavirus pandemic, which has renewed worries that biodiversity loss helps spread contagion from animals to humans. “Humankind can no longer afford to ignore the repeated warnings of nature,” Xi said. Read: COVID-19’s animal origins remind us that biodiversity and wildlife are disappearing at an alarming rate Citing the outline of the voluntary Paris Agreement created in 2015, Xi said his country will “aim to have CO2 emissions peak before 2030 and achieve carbon neutrality before 2060.” Greenpeace Executive Director Jennifer Morgan called the announcement “an important signal” that showed climate change is “top of agenda for China.” Other observers were quick to point out China’s coal reliance, which they expect to make for tough sledding toward a green conversion. China released the equivalent of 10 billion tons of carbon dioxide, or CO2, into the atmosphere in 2018, according to the Global Carbon Project that tracks emissions worldwide. That was almost twice as much as the U.S. and three times as much as the European Union; the latter has made its own pledge to be carbon neutral by 2050. Carbon-neutrality pledges usually encompass reducing or eliminating CO2 into the atmosphere, though most emitters take on such promises only by leaning on carbon capture techniques to offset their continued pollution. This might include a pledge to plant more trees. “China has wanted to be a global leader in clean technology, it has channeled spending to develop domestic solar and battery industries,” said Randeep Somel, associate fund manager at M&G Investments. “The scale of the investments required to reach carbon neutrality by 2060 will be a big positive, not only for domestic Chinese industries to grow but also for global companies that produce clean technology/sustainability products,” The U.S. may cede ground in novel green technologies and China’s environmental move could leave the U.S. vulnerable on the trade front unless climate-change is given greater importance in such talks. “This announcement by Chinese President Xi exposes President Trump at a time when the U.S. is in a protracted trade war with China,” Somel said. Somel said green hydrogen is one newly revived energy pursuit in which China may lead. Increasingly, the private sector has called for the need for a stronger U.S. response to climate change. The leading CEO group Business Roundtable wants the federal government, including Congress, to enact market-based climate-change policies largely in line with those laid out in the voluntary Paris pact that President Trump has abandoned. That includes attaching a price to carbon. Read: CEOs from GM, ConocoPhillips and more defy Trump’s climate-change stance, push for carbon price “If Democratic presidential nominee Joe Biden wins the election in November, the United States will have to work quickly to restore its reputation as a global arbiter of climate resolutions. If President Trump is reelected, then China has adeptly positioned itself as the global leader on climate action,” wrote Miro Korenha and Monica Medina, in their Our Daily Planet newsletter. “As China is not only the world’s biggest contributor to climate change but is also the biggest financer of energy projects as well as the world’s biggest market, whatever path it sets forward will be crucial for the rest of the world to follow,” they added. With China now among them, the 30 countries that have various carbon- neutrality pledges account for about 43% of the world’s carbon dioxide emissions from the burning of fossil fuels, according to the Carbon Neutrality Coalition. The largest polluting countries not on the list are the U.S., India, Russia, Iran, Saudi Arabia, Indonesia, South Africa, Turkey, Brazil and Australia. If China fulfills Xi’s goal, it could prevent 0.4 to 0.7 degrees Fahrenheit (0.2 to 0.4 degrees Celsius) further warming for the world, according to “very rough estimates” by MIT management professor John Sterman, who models and tracks emission reductions and pledges with Climate Interactive. “Emissions that don’t happen between now and 2030 are going to reduce warming a lot more than the same emission reductions after 2060,” Sterman told the Associated Press. The Associated Press contributed to this article."}]}