{"article": [{"url": "https://www.marketwatch.com/story/pac-12-football-players-threaten-to-sit-out-season-over-covid-19-concerns-2020-08-02", "published": 1596388340.0, "headline": "Pac-12 football players threaten to sit out season over COVID-19 concerns", "body": "A group of Pac-12 football players on Sunday threatened to opt out of the coming season unless its concerns about competing during the COVID-19 pandemic and other racial and economic issues in college sports are addressed. The players posted a statement and list of demands on The Players’ Tribune website and social media with the hashtag #WeAreUnited and sent out a news release to reporters. The release listed the names of 13 Pac-12 players from 10 schools, including Oregon star safety Jevon Holland, and provided a statement from each one. Arizona State offensive lineman Cody Shear told The Associated Press the players began connecting about a month ago and have been communicating through the text messaging app GroupMe. He said the number of players in the group has grown to more than 400, though it’s impossible to gauge everyone’s level of commitment. “We can’t control that,” said Shear, a junior from Eugene, Oregon, who transferred from the Ducks to ASU this year. “To have that many players, we have a pretty good idea there’s a lot of kids and college athletes in this conference that agree with some if not all that we’re asking as far as the player demands. I can’t give you a number, but there’s an abundance of players that are messaging in that GroupMe consistently. It feels like the phone’s blowing up every second.” The public demands from the Pac-12 players follow a surge in athlete empowerment across college football. Players have called out coaches at Iowa, Oklahoma State and Florida State. Players have led demonstrations, marches and rallies on campuses all over the country to protest racial injustice and police brutality in the aftermath of the killing of George Floyd. Now, as college sports leaders work to salvage a football season being threatened by the pandemic, more players are demanding to be heard. “We believe a football season under these conditions would be reckless and put us at needless risk,” the players said in their news release. “We will not play until there is real change that is acceptable to us.” The Pac-12 on Friday released a revised football schedule for the coming season. Officials across college football anticipate disruptions related to COVID-19. The Atlantic Coast Conference and Southeastern Conference also announced plans last week for truncated seasons. The NCAA has released guidelines for COVID-19 testing and other health and safety protocols to be used by schools, and Power Five conferences — the Pac-12, Big Ten, Big 12, ACC and SEC — are finalizing their own similar recommendations. The Pac-12 also announced Friday that 20 hours per week of mandatory team activities for football, including weight training, meetings and unpadded walk-through practices, will be permitted to begin Monday. Preseason football practice for Pac-12 schools is set to begin Aug. 17. The states of Arizona and California, home to half the Pac-12 schools, have been hit by some of the most severe surges in COVID-19 cases over the last month. California-Berkeley has announced the fall semester will begin with all classes being taught online. USC said most of its classes will be online for the coming semester. “Since the system is willing to risk our health and safety in the midst of the global pandemic, we must look out for each other,” Oregon State defensive back Jaydon Grant said in a statement. Pac-12 spokesman Andrew Walker directed requests for comment from the conference to a statement released Saturday. “Neither the Conference nor our university athletics departments have been contacted by this group regarding these topics,” the Pac-12 said. “We support our student-athletes using their voices, and have regular communications with our student-athletes at many different levels on a range of topics.” The players’ list of demands addresses healthy and safety protections related to COVID-19; protection for all college sports programs from being eliminated by budget cuts; racial injustice in college sports; and economic rights and compensation for college athletes. “This is important to me because I want to see the young men that are being exploited by the PAC12 & NCAA have the right to earn money for their families,” Holland said in his statement. “I want the safety of my peers lives to be placed higher than the sport they play. If we are treated like employees then we should be compensated as such.” Among the specifics are: — Player-approved health and safety standards enforced by a third party selected by players to address COVID-19 and serious injury, abuse and death. — 50% of a sport’s revenue distributed evenly to athletes. — Medical insurance for six years after college. — Reduced pay of Pac-12 Commissioner Larry Scott, coaches, administrators. — 2% of revenue to support financial aid for low-income Black students and community initiatives. The other players listed were: Treyjohn Butler of Stanford; Jake Curhan, Joshua Drayden and Valentino Daltoso of California; Nick Ford of Utah; Elisha Guidry of UCLA; Malik Hausman of Arizona; Dallas Hobbs of Washington State; and Ty Jones and Joe Tryon of Washington. Oregon offensive lineman Penei Sewell, who is projected to be one of the first players selected in the next NFL draft, was among the college players who showed support for the movement on social media. The group said it was committed to forming alliances with athletes from other conferences and that some players from outside the Pac-12 acknowledged the movement. “#WeAreUnited in our commitment to secure fair treatment for college athletes,” it said. “Due to COVID-19 and other serious concerns, we will opt out of Pac-12 fall camp and game participation unless the following demands are guaranteed in writing by our conference to protect and benefit both scholarship athletes and walk-ons.”"}]}