{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-face-headwinds-as-risk-assets-score-a-fillip-from-retail-sales-report-talk-of-coronavirus-drug-2020-06-16", "published": 1592316920.0, "headline": "Gold prices settle higher as Fed Chair Powell says uncertainty surrounds economic recovery", "body": "Gold futures settled higher Tuesday, finding support after Federal Reserve Chairman Jerome Powell said that despite some upbeat U.S. economic data, uncertainty continues to surround the timing of a recovery. In testimony prepared for the Senate Banking Committee Tuesday, Powell acknowledged that some economic indicators have pointed to a stabilization in activity and other have suggested “a modest rebound,” but “significant uncertainty remains about the timing and strength of the recovery.” He said the Fed was committed to using its full range of tools to assure the recovery from the recession will be as robust as possible. U.S. retail sales data for May showed that sales activity jumped by 17.7%, the government said Tuesday. Economists polled by MarketWatch had forecast an 8.5% increase. The report indicates that U.S. retailers began to recover as the economy started to reopen following record sales declines in the prior two months triggered by the coronavirus pandemic. Data on industrial production, also released Tuesday, revealed a rise of 1.4% in May. Meanwhile, a report that North Korea blew up an inter-Korean liaison office in the western border town of Kaesong, suggesting rising tensions in the region between South and North Korea. That provided support for haven gold, particularly given that the metal has posted declines in each of the last two trading sessions. In a daily note, analysts at Zaner Metals suggested the possibility that the market saw “some flight to quality buyers” move into gold and silver following reports that North Korea had bombed a South Korean installation. August gold US:GCQ20 rose $9.30, or 0.5%, to settle at $1,736.50 an ounce on Comex, posting a gain for the first time in three sessions. Gold futures have been trading in a $1,670 to $1,770 range for about two months despite a sharp fall in the U.S. dollar DXY, -0.58% against major currencies in that time. Gold has been stuck in a roughly $120 range since early April, Michael Armbruster, managing partner at Altavest, told MarketWatch. “The fact that gold has been unable to break out to the upside despite dollar weakness, ZIRP [zero interest-rate policy] and promises of unlimited liquidity from central banks may be a warning sign for bullish gold investors,” he said. “If gold can’t rally under these conditions, gold bugs should be prepared for the possibility of a shake-out to the downside.” “We remain bullish gold in the long-run, but we sense short-run risks to the downside,” Armbruster said. U.S. benchmark stock indexes traded broadly higher, and the dollar strengthened in Tuesday dealings following the upbeat retail sales data. That led to some weakness in gold prices earlier in the session. The ICE U.S. Dollar index DXY, -0.58% traded up by 0.3%. A report of a potential steroidal treatment for the illness derived from the novel strain of coronavirus also gave a boost to assets considered risky. Other metals finished higher on Comex, with the exception of copper. July copper US:HGN20 fell 0.1% to $2.5645 a pound. July silver US:SIN20 added 25 cents, or nearly 1.5%, at $17.652 an ounce, following a 0.5% decline on Monday. July platinum US:PLN20 rose 2.7% to $843.90 an ounce and September US:PAU20 added 0.5% to $1,942.70 an ounce."}]}