{"article": [{"url": "https://www.marketwatch.com/story/why-this-is-a-great-time-for-buying-a-pickup-truck-2020-07-09", "published": 1594271480.0, "headline": "Why this is a great time to buy a pickup truck", "body": "In June Ford Motor Company F, -1.36% revealed a version of perhaps the most important vehicle in the world: The all-new, full-size F-150 pickup truck. In truth, it’s not as all-new as Ford claims, as the basic formula—a winning one for the Blue Oval—hasn’t changed drastically, but everything about the truck got serious going-over and update. This all-new 2021 F-150 will likely be on sale in the fall. A new F-series from Ford is a moment, as the Blue Oval’s big truck has long been what David is to statues or Pat’s is to Philly cheesesteaks: the genre’s best example. It is frequently, if not always, the most searched and researched vehicle on Autotrader. Plus, it’s appeared on numerous “Best” lists on sites like Autotrader and KBB.com.Golden age of pickups The new F-150 arrives during a Golden Age of pickups. Right now, the mix of available trucks has never been wider. Or better. There are 13 models available today, both full- and midsize, and that does not even begin to count the endless stream of cab, bed and engine configurations. Prices stretch from the $31,000 Nissan NSANY, -1.50% Frontier to the GMC Sierra, which starts close to $60,000 and is really a luxury vehicle that happens to be a pickup truck. Load in a diesel engine and all the options and you can spend near $75,000 on a pickup truck if your wallet is willing. See: What’s hot, what’s not: How to buy a car in an uncertain market Relatively speaking, pickup truck sales have been fantastic in 2020. In a market down 23% through May, pickups are down only 7%. Midsize trucks—think Ford Ranger, Toyota TM, -0.65% Tacoma, Chevy Colorado, etc.—and their larger full-size brethren—Chevy Silverado, Ram pickups, Toyota Tundra, etc.—are shining bright in an otherwise dismal market. In fact, in April, pickup trucks outsold traditional sedans for the first time ever. Pickup trucks are useful tools, that is known. But considering the available content, safety equipment, and performance of the current crop of truck, it’s hard to argue that pickups are not in fact the perfect vehicle. Consider the interior appointments of a Ram Laramie Longhorn Crew Cab. Light Mountain Brown leather all over the place, with ventilated front- and rear seats. Dual-pane sunroof. 19-Speaker Harman Kardon Premium Sound. Adaptive cruise control. Blind-spot monitoring. All that. We’re hoping the F-150 rises to that level. Or consider the sheer breath-grabbing look of the Jeep Gladiator Mojave or the Raptor, or the fact you can buy a full-size Ford pickup that delivers nearly 30 mpg on the highway, if you have a light foot. This is the Golden Age.Truck life There are two influences driving the popularity of pickups in the U.S. right now. First, with COVID-19 concerns forcing all of us to rethink life in general, there’s a run on activities that help us get away – bikes are sold out, campers sales are strong, boats and trailers are now in short supply. And these are all activities done better with a pickup truck. Secondly, there has been plenty of incentives in place to help motivate truck sales. Pickups are wonderful, but they can also be very expensive. In May, according to an estimate by Kelley Blue Book, the average full-size pickup cost $51,240. Midsize trucks, fortunately, are far less at $36,482, just below the industry average for a new vehicle. Read: Rethinking big city life? Here are 8 smaller places that still have the urban perks In April, when pickups outsold traditional sedans, many automakers were running 0% financing deals for 84 months, which can spread out and lower monthly payments. But automakers have been pulling back on those deals as inventory thins. Vehicle production was mostly halted in late March and is only now getting back up to speed. This means low inventory will likely dampen truck-buying momentum. Chevrolet, GMC and Toyota are particularly low, and that means less choice for consumers and fewer incentives.Smart money But smart shoppers can still find good models out there. In full-size, there are many still-new 2019 models available and dealers will be more motivated to move those. Shoppers might consider a Ram 1500 Classic, which is not as luxurious as the new Ram 1500, but stock is plentiful and the vehicle is plenty capable to haul or tow all the important social-distancing tools—kayaks, bikes, tents, campers, you name it. Also see:5 important facts about car insurance no one ever tells you Also consider the Toyota Tundra or Nissan Titan. Both are good choices, although neither has been able to make a dent in the full-size pickups segment. But that doesn’t mean the products are vastly inferior. To the contrary. Both are excellent vehicles that are sure to satisfy. Be aware: Toyota is short on inventory; Nissan Titan inventory is plentiful. With so many good choices out there in the full-size market, we haven’t even touched on the variety of good midsize trucks that are fully capable and more likely to fit comfortably in a regular-sized garage. But that’s another story for another time. Focus has been on the launch of Ford’s new F-150 and full-size pickups. But in the Golden Age of pickups, we’d expect nothing less. There are no bad choices out there and there are plenty more good trucks coming, including an update to the Nissan Frontier, a new 2022 Toyota Tundra and an all-new entry from Hyundai, the Santa Cruz, scheduled to launch in 2021. At this pace, the Golden Age of pickup trucks may be here to stay. This story originally ran on Autotrader.com."}]}