{"article": [{"url": "https://www.marketwatch.com/story/initial-jobless-claims-fall-130000-to-881000-decline-tied-to-change-in-statistical-change-2020-09-03", "published": 1599134660.0, "headline": "Initial jobless claims fall 130,000 to 881,000, but drop tied to change in statistical method", "body": "The numbers: New applications for unemployment benefits fell sharply last week to a fresh pandemic low, but the entire decline stemmed from a major change in how the data is reported instead of more people finding jobs. The labor market showed no progress absent the change. Initial jobless claims fell by 130,000 to a seasonally adjusted 881,000 in the last week of August, the Labor Department said Thursday. These figures reflect applications filed the traditional way through state unemployment offices. Economists polled by MarketWatch had forecast 940,000 new claims in the seven days ended Aug. 29. Yet not all of the estimates took into account the change in the government’s formula for seasonal adjustments. The Bureau of Labor Statistics said last week it would alter its adjustment process to make the report more accurate. The level of seasonally adjusted new claims has run notably higher than the real or actual number of people applying for benefits each week, a problem that became more pronounced in the past month. The new method began with this week’s report. The BLS does not plan to revise previous data to reflect its new statistical approach. For a fuller explanation, read about the big change in jobless claims The unadjusted or real number of new jobless claims, meanwhile, suggest there was barely any change last week in how many people are applying for benefits. They rose slightly to 833,352 from 825,761. It was the fifth straight week in which unadjusted claims have been below 1 million. By any measure, though, jobless claims are still exceedingly high. They ran in the low 200,000s and stood near a half-century low shortly before the coronavirus epidemic broke out. Also: Did the expired $600 federal jobless benefit keep people from going back to work? What happened: New jobless claims rose the most in California (40,000), with smaller increases in Texas and Louisiana. Notably they fell in Florida and Georgia, states that suffered a big increase in coronavirus cases earlier in the summer. Adding in self-employed workers who filed under a separate federal program, actual or unadjusted new claims totaled 1.59 million last week. That marks a sizable increase from 1.43 million the prior week and reflects a potentially worrisome upturn Continuing jobless claims, or the number of people already receiving benefits, fell to a seasonally adjusted 13.25 million in the week of Aug. 22 from 14.49 million. The raw or actual number was somewhat smaller. Altogether, the number of people getting benefits through eight state and federal programs rose to an unadjusted 29.2 million as of Aug. 15 from 27 million in the prior week. The data is released with a two-week delay. Read: ADP says private sector added a less-than-expected 428,000 new jobs in August Big picture: The big wave of people returning to work at the start of the summer appears to have faded more into a trickle, making it harder for the economy to recover. Some companies are also laying off more workers permanently or warning they might do so unless sales pick up soon or the government comes to their rescue again. Read:Economy softened in August as some temporary layoffs turn permanent The odds of another government financial bailout soon aren’t favorable. An extra $600 in weekly federal benefits for the unemployed ran out at the end of July and a program that paid small businesses to keep employees on their payrolls also lapsed after Democrats and Republicans failed to agree on another aid package. Neither side has budged much recently. What they are saying? “The data show that layoffs remain widespread and the recovery in the labor market is occurring at a frustratingly slow pace,” said lead U.S. economist Nancy Vanden Houten of Oxford Economics. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% were set to open mixed in Thursday trades."}]}