{"article": [{"url": "https://www.marketwatch.com/story/are-democrats-wavering-on-oil-subsidies-biden-harris-climate-platform-remains-fluid-2020-08-19", "published": 1597853840.0, "headline": "Are Democrats wavering on oil subsidies? Biden-Harris climate platform remains fluid", "body": "Democratic Presidential nominee Joe Biden and running mate Sen. Kamala Harris have called for cutting oil-industry subsidies and limiting production at various times in the run-up to the November election. But now, with some anti-oil language already softened by the party, the future of the influential fossil fuel industry remains one of the stickier features in the duo’s climate approach. Adding to the uncertainty, say environmental advocates, is the broader Democratic party’s apparent tweak on fossil fuels in the platform it’s advancing as it seeks to unseat Donald Trump and gain seats on Capitol Hill. And the fact that Harris and Biden are still reconciling some of their positions. The Democratic National Committee dropped a call to eliminate fossil-fuel tax breaks and other subsidies from its official platform, telling the Huffington Post that the stiffer language was unintentionally added during a later phase, the so-called manager’s mark. In other words, party officials now allege, it’s not a position change on the fuels whose emissions are linked to global warming, but a miscommunication. It is, however, a position change from 2016. Fracking state Pennsylvania remains a key target of both parties in 2020 and even reliably “red” oil state Texas has been described lately as increasingly “purple.” Trump has rolled back several Environmental Protection Agency regulations — some decades old — that have generally favored U.S. oil. Read:Here’s where Joe Biden has moved to the left — and where he hasn’t And:Preserving some drilling, Pelosi and climate panel push Congress to get nation to net-zero emissions by 2050 The newly bubbling confusion prompted a tweeted response Wednesday afternoon from the Biden campaign. “Joe Biden continues to be committed to ending U.S. fossil fuel subsidies and then rallying the rest of the world to do the same — as was outlined in his climate plan last year,” said Stef Feldman, policy director for the campaign. But party wavering isn’t sitting well with some who promote more aggressive policy to curb man-made climate change. Without the explicit aim to take away fossil-fuel support, activists say the party manifesto is now weaker than what Biden and Harris initially campaigned on. “If [Biden] wants to retain the credibility he’s gained so far on climate, he must [provide clarification on the oil stance]. Because the fossil fuel industry’s crushing grip on our political system is, and will always be, the biggest obstacle to meaningful climate action,” said Emily Akin, writing in her Heated newsletter before the Biden campaign update. “There is no physically possible way to solve the climate crisis without winding the fossil fuel industry down.” iframe.twitter-tweet { width: 100% !important; } Estimates from last year put U.S. direct subsidies to the fossil fuel industry at roughly $20 billion per year, with about 80% going to natural gas and crude oil. OpenSecrets.org shows that some $125.7 million was spent on oil and gas lobbying last year, outspent by only pharmaceuticals, electronics and insurance. Solar, wind and other alternative energy also receive government support, but their overall cost trend has drifted down, making them more competitive with oil and natural gas to power the nation’s electricity grid. Alternative-energy advocates like to point out that these choices — relying on nature’s elements but also storable — are not as sensitive to global market ups-and-downs as the oil patch. Oil CL00, -1.62% is currently trending down, as is the energy sector; the Dow Jones U.S. Oil & Gas Total Stock Market index DWCOGS, -1.43% has lost 33% over the past year. Read:Trump wants ‘perfect’ hair from stronger water flow in the shower — his Energy Department delivers There has also been some difference between the top Democrats on the practice of fracking, the controversial oil-and-gas extraction technique that has made the U.S. more competitive with OPEC and Russia. Harris said during a debate that there was “no question” she was in favor of banning fracking; Biden would do that only for oil and gas production from federal lands. In a March 15 primary debate, Biden misstated his fracking policy and his campaign quickly corrected the record. Biden has otherwise been consistent on his middle-of-the-road position, going so far as to tell an anti-fracking activist that he “ought to vote for somebody else” if he wanted an immediate fracking ban, the Associated Press reports. The Trump campaign still often revives Biden’s brief anti-fracking position. Related:Trump’s Interior Department set to approve oil drilling in Alaska’s Arctic refuge Harris’s primary addition to the pair’s climate stance has been her desire to link climate-change policy to greater economic equity. She is backing the newly submitted Climate Equity Act, which aims to ensure that environmental regulation or legislation would be rated based on its impact on low-income communities, similar to a Congressional Budget Office score. The left-leaning political group Climate Power 2020 said a heavy lineup of climate mentions at the Democratic convention from Michelle Obama to Pennsylvania state officials is by design. “There is a reason for this intense focus on climate. The politics of climate have changed and Joe Biden needs climate voters to show up in November if he hopes to win the White House,” the group said in a release. They cited their own July poll that found that voters, especially young and Latino voters, overwhelmingly support government action to combat climate change. These voters would vote for a Democrat who supports taking such action over a Republican who does not by 24 points, outpacing the standard generic ballot by 14 points. Some of the energy-sector policy targets are concerning to Republican lawmakers and right-of-center trade groups that are seeking their own approach to slowing man-made climate change, including Citizens for Responsible Energy Solutions, the R Street Institute and others. They desire a unified federal carbon-credit program, more balance in keeping heating and cooling costs low for Americans by including fossil fuels in a diverse energy mix and they promote carbon sequestration as a way to harness emissions. Those issues are among the key facets of the proposed GOP-led Growing Climate Solutions Act, a main challenger to Democratic ideas more closely resembling the Green New Deal."}]}