{"article": [{"url": "https://www.marketwatch.com/story/you-can-still-claim-social-security-spousal-benefits-even-if-your-spouse-is-gone-2020-10-08", "published": 1602236420.0, "headline": "You can still claim Social Security spousal benefits - even if your spouse is gone", "body": "If you're married, you'll often do better with a joint claiming strategy for Social Security benefits. As I wrote last time, that usually works best if the two spouses are close in age and if one spouse earned considerably more than the other did during their work lives. But sometimes loved ones leave us way too soon and marriages end. These major life events can take a big emotional toll, but at least financially, Social Security can help cushion the blow. Divorced and widowed spouses can collect spousal or survivors' benefits-benefits based on a spouse's lifetime earnings-with some restrictions. For a spouse who has been out of the workforce for a long time (traditionally the woman, though it can apply to husbands of higher earners as well) it can mean the difference between a decent standard of living in retirement and living from hand-to-mouth. But there are some rules you need to know. And again, according to the Social Security Administration (SSA), the same laws apply to same-sex married couples as to opposite sex spouses. Claiming strategies for widows and widowers Assuming the deceased spouse worked at least 10 years, a widow or widower can apply for survivor benefits if he or she is at least 60 years old. If you're disabled and your disability began within seven years of your spouse's death, you can get benefits as early as 50. But you won't qualify for full benefits unless you apply by your full retirement age (66 or 67). If you are already getting spousal benefits (which pay up to 50% of your spouse's Social Security benefits at full retirement age), that will convert to survivors' benefits upon notification of your spouse's death, and you can collect 100% of your deceased spouse's benefits. If the deceased waited until 70 to start taking Social Security, the surviving spouse is eligible to get 100% of the higher benefit as long as he or she has reached full retirement age. But you need to know the difference between how much you would get in survivors' benefits and how much you would get on your own. So if, say, you haven't reached full retirement age yet, you can apply for your regular retirement or survivors' benefits now and switch to the higher-paying benefit when you turn 66 or 67 or even hold out until the maximum age of 70 (if your own benefits would be higher than survivors' benefits based on your late spouse's monthly payout). But if your spouse dies after you've started taking your own retirement benefit, you can apply for survivors' benefits only if that would exceed what you get now. Read: The COLA increase for next year doesn't look good If you're divorced You can claim Social Security benefits based on an ex-spouse's earnings, too. If your ex is still alive, you must be at least 62 years old, currently unmarried, and your previous marriage must have lasted at least 10 years. Also, your own retirement benefits must be less than one half of your ex-spouse's projected payout at full retirement age. And, of course, your ex-spouse must be eligible for benefits even if he or she hasn't started taking them. If your ex-spouse has died, a lot of the same rules for widows and widowers apply: You must be at least 60 (50 if you're disabled), have been married to your ex for 10 years, and your own Social Security retirement benefit must be less than what your ex-spouse earned. And you can't remarry until you turn 60, but you can afterward and collect 100% of your deceased ex-husband or ex-wife's benefits. So, if you want to get married again, it makes sense to wait-or shack up until you hit the magic milestone. Read: The solution to the retirement crisis is still in its infancy Minor children If you're taking care of your former spouse's natural or legally adopted child who is either disabled or under 16, you're exempt from the requirement that your marriage had to last 10 years, and you can receive survivors' benefits at any age (if you have not remarried). Unmarried children of deceased workers also can get survivors' benefits of their own (75% of their deceased parent's benefit) if they're under 18, or under 19 and still in secondary school. Read: The problems with 'aging in place' These days, more people are remarrying and having second or even third families, so when they take retirement benefits, their children are eligible to get benefits as well. According to the SSA, in July 2020, some 697,000 children received those benefits (in addition to 1.9 million children of deceased workers). Their monthly benefits averaged less than half that of their retired parent, and Social Security has a maximum family limit of 150% to 180% of a parent's full benefit to keep beneficiaries from feeding too much at the government trough."}]}