{"article": [{"url": "https://www.marketwatch.com/story/feds-bullard-says-us-economy-within-reach-of-full-recovery-this-year-2020-09-24", "published": 1600958240.0, "headline": "Fedâ\u0080\u0099s Bullard says U.S. economy within reach of full recovery this year", "body": "The U.S. economy is within reach of a nearly full recovery by the end of the year, said St. Louis Fed President James Bullard on Thursday. The economy is expected to have rapid growth in the third quarter, reversing the steep decline in the April-June quarter when the pandemic shut down the economy. Economists now expect strong growth in the July-September quarter. If this continues in the fourth quarter, Bullard said the U.S. could return to the average level of national income, one way to measure the broader economy, in 2019. For instance, if GDP grows at a 35% rate in the third quarter, it would need growth at a 10% rate in the final three months of the year to hit that level. Such a forecast is â\u0080\u009ca little bit outside of what even the optimistic forecasters are saying but I wouldnâ\u0080\u0099t put it out of the realm of possibility that you could have the fourth quarter GDP close to our average for 2019 and that would be a great outcome for the U.S. economy,â\u0080\u009d Bullard said in a speech to the Global Interdependence Center. Economists surveyed by MarketWatch expect third quarter GDP will grow at a 25% annual rate as it snaps back from the worst of the shutdown, and they believe the fourth quarter will see growth at a slower 6% pace. The economy plummeted by a record 31.7% rate in the April-June quarter. The government wonâ\u0080\u0099t release the first estimate for third quarter growth until Oct. 29. Bullard said the fact that hitting the 2019 average income level is a possibility â\u0080\u009cshows you how far weâ\u0080\u0099ve come.â\u0080\u009d He said a second wave of the pandemic was possible but that it shouldnâ\u0080\u0099t dominate forecasts. â\u0080\u009cWhat Iâ\u0080\u0099m kind of pushing gently back against in the forecasting community and maybe showing my colleagues, is that the baseline case is really that the private sector is adapting,â\u0080\u009d Bullard said. He said he didnâ\u0080\u0099t think the U.S. was â\u0080\u009cthat far from having simple, easy, technological solutionsâ\u0080\u009d that could lead to a return to activity, pointing to advances in rapid testing. The St. Louis Fed president cautioned that downside risks remain substantial and things could go wrong. He said he wasnâ\u0080\u0099t advocating a change in the Fedâ\u0080\u0099s low-interest-rate policy and agreed with other Fed officials that the economy was still in a deep hole. Earlier this week, Bullard said he didnâ\u0080\u0099t think a new Congressional coronavirus relief package was as much of an â\u0080\u009cimperativeâ\u0080\u009d as it might have been in July or August. â\u0080\u009cIt seems like, at least in some broad macroeconomic type of calculation, we have enough resources to cover this,â\u0080\u009d Bullard told Bloomberg. Many other Fed officials, including Fed Chairman Jerome Powell, have urged Congress to pass another spending package. â\u0080\u009cIâ\u0080\u0099m more optimistic than most,â\u0080\u009d Bullard said. Another fiscal package might come early next year, he noted. He said more congressional grants to small businesses hit hard by the pandemic might be a good idea. During a discussion with reporters after his speech, Bullard said he thinks inflation might exceed the Fedâ\u0080\u0099s 2% target next year. â\u0080\u009cThis is not an economy thatâ\u0080\u0099s designed to grow at a 30% rate...and you would expect to see certain kinds of supply constraints,â\u0080\u009d Bullard said. This will put upward pressure on prices. Bullardâ\u0080\u0099s forecast is well above his colleagues. The median forecast of 17 Fed officials is for inflation not to hit 2% until 2023. The Fed would like to see the return of higher inflation. They are more worried now about the persistence of low inflation, which saps energy from the economy. Stocks, which have been volatile this week, moved higher in afternoon trading, with the Dow Jones Industrial Average DJIA, +0.56% Â up 232 points."}]}