{"article": [{"url": "https://www.marketwatch.com/story/stocks-in-europe-rally-on-economic-optimism-2020-07-06", "published": 1594013660.0, "headline": "Stocks in Europe rally and Dow futures climb on economic optimism", "body": "European stocks rose on Monday, as signs of economic progress offset worries about growing coronavirus cases in the U.S. as well as India. Up 2% last week, the Stoxx Europe 600 SXXP, +0.55% rose 1.2%. London-listed shares of HSBC Holdings HSBA, -1.49% and Standard Chartered STAN, -1.38% jumped, responding to the big rally in Asian stocks. The Shanghai Composite SHCOMP, +1.67% surged as a front-page editorial in the Securities Journal said a “healthy” bull market after the pandemic is now more important to the economy than ever. The German DAX DAX, +0.06%, French CAC 40 PX1, +0.71% and the U.K. FTSE UKX, +0.64% all advanced by more than 1%. Futures on the Dow Jones Industrial Average YM00, +0.82% gained 315 points after the three-day weekend. Markets continue to advance on signals of an economic recovery. Nonfarm payrolls expanded by 4.8 million in June, the U.S. Labor Department said last week. Germany on Monday reported a 10.4% gain in new manufacturing orders for May, which nonetheless was 29.3% lower than a year ago. Via Davy Research, Google Mobility data suggest continental Europe is ahead of the U.K. and Ireland in the economic recovery. In Ireland, the seven-day average of credit and debit card transactions are now just 4% below early March levels, according to Davy Research, citing central bank data. Pubs and hairdressers reopened in England over the weekend, and Springboard reported that in England pedestrian activity, or footfall, shot up by 19.7% on Saturday compared with last week. The question is whether the economic progress can continue with rising coronavirus numbers. States containing over half the U.S. population now meet one or none of the Centers for Disease Control and Prevention-recommended gating criteria for reopening, point out analysts at Goldman Sachs, who separately downgraded their U.S. economic growth view for the year to a 4.6% contraction from a 4.2% downturn. U.K. home builders rose. Barratt Developments BDEV, +0.11% rose 6% as it said net private reservations per active outlet per average week were 0.63 for the last six weeks, compared with 0.69 last year. Rivals Persimmon PSN, -1.33% and Taylor Wimpey TW, -0.86% also jumped. Commerzbank CBK, +0.38% rallied nearly 7% as Germany’s number-two lender said on Friday that its chief executive and chairman have submitted their resignations."}]}