{"article": [{"url": "https://www.marketwatch.com/story/controversial-trump-fed-nominee-shelton-may-move-forward-as-senate-panel-sets-vote-2020-07-10", "published": 1594404200.0, "headline": "Controversial Trump Fed nominee Shelton may move forward as Senate panel sets vote", "body": "The stalled nomination of Judy Shelton, President Donald Trump’s controversial pick for the Federal Reserve, got a potential boost Friday when the Senate Banking Committee announced a July 21 vote on her nomination. Shelton’s bid has languished since her confirmation hearing in February amid talk she didn’t have enough committee support. Shelton, who was an informal Trump adviser during his presidential campaign, has been a longtime advocate for some form of tying the dollar’s value to gold. She likely faces unanimous opposition from Democrats and some Republicans were on the fence. The committee will also vote on a second Trump Fed nominee, Christopher Waller, the director of research at the St. Louis Fed. Waller is expected to be confirmed easily. It was unclear whether Shelton had won over Republican skeptics or if Sen. Mike Crapo, the Republican from Idaho who chairs the committee, is trying to force the issue. A spokesman for Crapo was unavailable for comment. Crapo has previously hesitated to bring her nomination to a committee vote because Sen. John Kennedy, a Louisiana Republican, remained undecided. If Kennedy voted with all the Democrats on the panel, Shelton’s nomination would be defeated 13-12. Asked last month why he’s taking so long to make up his mind, Kennedy replied: “I’m a slow reader.” “I think unfortunately the last three or four months has demonstrated just how important the Federal Reserve is,” he added. “And Dr. Shelton has written a book and a number of white papers and a number of op-ed pieces and I’m going to try to read as many of them as I can.” A spokesman for Kennedy was unavailable to comment this afternoon. In reaction to the news of that the vote on Shelton had been set, all the Senate Democrats on the panel wrote a letter urging Crapo to hold another hearing on the nomination. Based on her answers at the February hearing, “we are deeply concerned that the situation we are in today would have been worse if Dr. Shelton were sitting on the Board of Governors,” the Democrats wrote. Announcement of the Shelton vote came after the market close. Stocks finished strongly higher on Friday as investors pushed aside worries about the pandemic. The Dow Jones Industrial Average DJIA, +0.56% finished up 369 points, or 1.4% to 26,075."}]}