{"article": [{"url": "https://www.marketwatch.com/story/6-ways-to-invest-in-racial-justice-2020-07-13", "published": 1594632080.0, "headline": "6 ways to invest in racial justice", "body": "This article is reprinted by permission from NerdWallet. Antiracism protests have called for action and change in our police departments and other systems that have historically oppressed people of color — including the financial system. In addition to joining those protests, donating to organizations that fight for racial justice or shopping at Black-owned businesses, you can put your investment dollars to work for the cause. “What comes after protests is money, and money is what will make change sustainable,” says Tiffany Aliche, a financial educator and founder of The Budgetnista. Here are six ways to support racial justice with your investment portfolio.1. Invest in Black-owned companies and funds that support racial justice Kenneth Chavis, a certified financial planner at Mercer Advisors in Scottsdale, Arizona, says investing in stock of Black-owned companies can have two major advantages for investors: diversification and the potential for strong performance. Diversification — which involves spreading your investment portfolio across companies of different industries and locations — is key to reducing risk in your portfolio, as is choosing companies of different sizes. As Chavis notes, small companies are often known for their growth potential. “Keeping in mind that some of the Black-owned companies are smaller, there is a ton of research that shows that over long periods of time, on average, the probability that a smaller company will outperform the average large company — or just the broad market — is extremely high.” Of course, small companies are also known to be much higher risk, so as always, you’ll want to vet your investment carefully. Unfortunately, there are only a handful of these stocks listed on public exchanges, and weeding through individual stocks to build a portfolio requires research and expertise. So another option is to use your dollars to invest in mutual funds or exchange-traded funds that will do that work for you. The Impact Shares NAACP Minority Empowerment ETF NACP, +0.41% tracks the Morningstar MORN, +1.07% Minority Empowerment Index and provides exposure to companies that meet the NAACP’s guidelines (though the fund itself is not sponsored, endorsed or promoted by the NAACP). Plus, all net advisory profits from the fund’s management fee are donated to the NAACP.2. Explore peer-to-peer lending Peer-to-peer lending companies like SoLo Funds give people who have historically been overlooked by financial institutions and traditional loan programs the ability to access capital. SoLo borrowers can set the terms of their loan themselves, and there is no formal approval process. Lenders earn “appreciation tips,” and there are no minimum requirements, so you can get started with any amount. Also read: 5 ways to support Black-owned businesses The benefit of peer-to-peer lending, Chavis says, is asset class diversification: P2P loans are typically not correlated to the stock market. “It’s also a good way to help disadvantaged communities get access to capital, either for business reasons or personal reasons,” he adds. P2P lending comes with one main risk: There is always a chance the borrower may not be able to repay the loan. SoLo attempts to counteract this by providing every borrower a “SoLo score,” which acts as a platform-specific credit score and is based on your initial registration and how you handle your loans. To further reduce risk, Chavis strongly advises diversifying the loans you offer by lending to multiple people and allocating no more than 10% of your overall portfolio to this practice.3. Invest in companies that financially support racial justice You can reward public companies that donate money to support racial justice with your own investment dollars. Over the past few months, several large corporations have pledged money toward antiracism efforts. By investing in companies that are committed to putting their money where their mouth is, you are letting those companies know you support their decisions. Remember, too, that “spending money is investing money,” says Aliche. “You might not be seeing a return if you’re not an actual stock shareholder, but you’re putting money into those companies.” Don’t miss: Venture funding remains elusive for Black tech entrepreneurs Before spending your dollars, she advises looking at a company’s social media, their website and reviewing who is on their team. “Spending your money with companies that are in alignment is critically important,” says Aliche.4. Explore startups or real estate crowdfunding You may not have angel investor status yet, but you can still invest in some cool startups that aren’t yet publicly traded. Republic allows investors to find emerging businesses and get in on the ground floor for as little as $10. The site also lets you filter listed businesses to those with Black founders (as well as to those with female founders and other socially responsible investing criteria). You can also invest in real estate (and in some cases, the businesses those buildings will house) with Buy the Block, a crowdfunding platform that is all about providing people with an equity stake in their communities and working to stop gentrification. You can invest on Buy the Block for a minimum of $100 (which is significantly less than most real estate crowdfunding platforms). Many of the projects listed on Buy the Block are in historic Black neighborhoods or benefit a local Black community (such as markets that aim to bring produce grown by Black farmers into food deserts). Investing in startups and real estate crowdfunding carries a significant amount of risk, and you may lose your entire investment. As always, do your research before making any investment.5. Rethink your bank If your current bank doesn’t meet your needs, consider a Black-owned bank. According to a 2019 FDIC study, minority deposit institutions originate a greater share of their mortgage loans to minorities than non-MDIs. Some are also designated Community Development Financial Institutions, which means 60% of their financing activities are targeted to low- and moderate-income populations. “I really like small, local banks,” says Aliche. “Put your money toward banks that are reinvesting back into the community where you are, and don’t be afraid to ask what initiatives they have for the African-American community. Even if it’s not an African American-owned bank, they might have more community-focused initiatives than a larger bank.”6. Learn from and work with Black financial professionals Working with a Black financial adviser not only invests your money back into the community, it helps that adviser continue adding their perspective to the predominantly white space of financial advice. You can find a directory of Black financial advisers through the Association of African-American Financial Advisors. You can also opt to invest and get financial guidance through a Black-owned investment platform. For example, Freeman Capital is a Black-owned and -founded investment platform that recognizes that the wealth gap is hurting women and people of color, and offers everything from automated investing to consultations with CFPs.More from NerdWallet: How to Invest in Stocks How to Choose a Financial Advisor How to Invest in Real Estate Alana Benson is a writer at NerdWallet. Email: abenson@nerdwallet.com."}]}