{"article": [{"url": "https://www.marketwatch.com/story/fbi-says-review-of-national-security-surveillance-applications-found-only-minor-errors-2020-07-30", "published": 1596133640.0, "headline": "FBI says review of national-security surveillance applications found only minor errors", "body": "WASHINGTON (AP) — The FBI said Thursday that it found mostly minor errors during a review of more than two dozen applications for national-security surveillance warrants, suggesting the problems were less serious than the Justice Department inspector general had made them out to be earlier this year. The FBI statement appeared aimed at countering the findings of a harshly critical audit issued in March by the Justice Department’s watchdog, which identified problems in all 29 wiretap applications that it had reviewed, including apparent errors or inadequately supported facts in 25 of them. “ Each of the applications with which issues were found was submitted before FBI Director Chris Wray announced more than 40 changes aimed at improving the process and fixing problems identified by inspector general Michael Horowitz. ” The audit came months after an inspector general report on the FBI’s Russia investigation found significant errors and omissions in applications the agency had submitted to wiretap a former Trump campaign aide. Taken together, the reports fueled criticism from Democrats and Republicans alike that the FBI’s process for applying for surveillance warrants in terrorism and espionage investigations is riddled with significant errors that undermine the bureau’s credibility. But the FBI said Thursday that it and Justice Department lawyers had conducted their own review of the same 29 applications that the inspector general had examined. The FBI said it found only two material errors, and neither was believed to have affected a judge’s decision that there was probable cause for the surveillance. The FBI said that out of nearly 7,000 facts in the applications, there were rough 200 nonmaterial errors, such as typographical errors, misspelled words and date inaccuracies. The FBI also said that each of the applications was submitted before FBI Director Chris Wray announced more than 40 changes aimed at improving the process and fixing problems identified by the inspector general. The statement comes amid an effort by the FBI to shore up the accuracy of applications submitted to the secretive Foreign Intelligence Surveillance Court, which processes requests to eavesdrop on American soil in national-security investigations. A December report from the watchdog office found errors and omissions during applications submitted to eavesdrop on former Trump campaign associate Carter Page, and said the FBI had failed to update the court when it received new information that undercut the premise for the surveillance. That report, though, found that the FBI had not acted in a biased manner in the Trump-Russia probe. After that report was issued, Inspector General Michael Horowitz announced a broader review of how the FBI uses its spy powers under the Foreign Intelligence Surveillance Act, often known by the acronym FISA. Market Pulse (November 2019):Russia-inquiry review expected to undercut Trump’s FBI spying claim: report Also see (April 2020):Contrary to DOJ’s findings, Barr claims Russia probe was started ‘without basis’ “The FBI considers FISA an indispensable tool to protect the United States against national security threats and is dedicated to the continued, ongoing improvement of the FISA process to ensure all factual assertions contained in FISA applications are accurate and complete,” the FBI said in a statement. From the archives (April 2020):Trump fires the inspector general of the intelligence community, Michael Atkinson"}]}