{"article": [{"url": "https://www.marketwatch.com/story/ups-stock-rockets-toward-best-day-ever-as-surprisingly-strong-consumer-demand-produces-big-earnings-beat-2020-07-30", "published": 1596183020.0, "headline": "UPS stock rockets to best day ever as surprisingly strong consumer demand produces big earnings beat", "body": "Shares of United Parcel Services Inc. rocketed to their best day ever Thursday, as surprisingly strong consumer demand in the face of the COVID-19 pandemic offset weakness in business demand, and helped prepare the package delivery giant for the coming peak shopping season. Christmas came early for UPS and its investors, as Chief Financial Officer Brian Newman said U.S. volumes surged significantly off the April lows to reach “peak-like levels” in May and June. “ “At the beginning of the second quarter, we assumed demand would slow. Instead, we saw just the opposite.” ” — New Chief Executive Carol Tomé The stock UPS, +0.27% soared 14.4% to close at a record close of $141.46, well above its previous record of $134.09 on Jan. 12, 2018. That was stock’s biggest one-day percentage gain since it went public in November 1999, surpassing the previous record of a 13.1% rally on Oct. 19, 2000. UPS’s stock has run up 20.8% year to date, while rival shares of rival FedEx Corp. FDX, +0.18% have advanced 14.2%, the Dow Jones Transportation Average DJT, +0.84% has lost 9.1% and the Dow Jones Industrial Average DJIA, +0.56% has declined 7.8%. Before Thursday’s open, UPS reported net income that rose to $1.77 billion, or $2.03 a share, from $1.69 billion, or $1.94 a share, in the year-ago period. Excluding non-recurring items, such as a $112 million transformation charge, adjusted earnings per share rose to $2.13 from $1.96, nearly double the FactSet consensus of $1.07. Total revenue grew 13.4% to $20.46 billion, well above the FactSet consensus of $17.50 billion, as U.S. domestic package revenue increased 17.3% to $13.07 billion to trounce expectations of $11.15 billion. “At the beginning of the second quarter, we assumed demand would slow,” said new Chief Executive Carol Tomé, according to a FactSet transcript of the post-earnings conference call with analysts. “Instead, we saw just the opposite.” Well, Tomé, who succeded David Abney to became CEO on June 1, after 17 years as a board member, was partly right. The downturn in the industrial sector caused by the pandemic led to a 21.9% drop in business-to-business (B2B) volume, but did show some signs of improvement as the quarter progressed. B2B shipments represented 27% of total volume in early May, but grew to 37% of total volume by the end of June. In comparison, B2B volume was about 46% of the total in 2019. The real star was the consumer, as B2C volume soared 65.2%, which equates to 5.8 million additional pieces delivered per day, and represented 69% of total volume, with ground residential volume increasing 63.8%. See related: FedEx, UPS stocks surge as investors cheer news of Amazon pausing test of competing service. FactSet, MarketWatch What helped UPS meet this increased demand was adding nearly 40,000 new employees to its small-package business in recent months, flying about 635 extra flights, and the boosting of its e-commerce market capabilities, as UPS added 120,000 new customers through its digital access program. “No complaints here, just a great quarter,” said Cowen analyst Helane Becker. “No outlook is being provided, but we expect a continuation of similar trends in 3Q20.” For the rest of the year, Tomé said it was hard to know how B2B demand would unfold, especially given the recent jump in new COVID-19 cases, new containment measures and uncertainty with regards to fiscal stimulus programs. However, she expects B2C demand to remain “strong” into the holiday season. “As the leadership team, we’re agreed we are going to have an outstanding peak season,” Tomé said in the analyst call. “I participated in my first peak planning committee several weeks after I joined the company, and very impressed by how we are planning to manage through what could be a very peaky season.”"}]}