{"article": [{"url": "https://www.marketwatch.com/story/this-is-the-best-state-to-retire-but-you-may-not-want-to-go-there-just-yet-2020-06-23", "published": 1593265400.0, "headline": "This is the best state to retire - but you may not want to go there just yet", "body": "The best state for retirees to live these days is also one many Americans might want to avoid - at least for now. Florida topped the list of the best states for retirees to live, in a recent study from Blacktower Financial Management Group. A quarter of the state's population is age 60 or older, and it boasts sandy beaches and warm temperatures. The average home price is $252,000, and life expectancy is just shy of 80 years old there, the analysis found. The sunshine state jumped nine places from where it ranked in 2019. Florida may be a hotspot for retirees - but it's also one of the states that has seen a troubling spike in coronavirus cases, the governor confirmed this week. Other states with rising numbers of cases include Oklahoma, Texas, Idaho and South Carolina, according to NPR. See:Here's exactly where you should retire - based on what's important to you The southern state surpassed 100,000 total COVID-19 cases on Monday, and saw its highest peak in cases since the pandemic first began. More than 98,000 residents tested positive for the virus, and more than 3,000 people died from it. Most patients who recently tested positive were in their 20s and 30s, down from the average age of age 65 a few months ago, the governor said. Overall, the U.S. has had 2.3 million cases, with a slight uptick in the last three weeks. Minnesota ranked second, followed by Iowa, Ohio and Texas. The remaining top 10 states included Wisconsin, Nebraska, Pennsylvania, Illinois and Idaho. Blacktower analyzed and weighted crime, cost of living, older populations, average property prices and life expectancy to create its ranking. The worst state to retire was Alaska, which had the highest crime rate, the firm found. Hawaii had the highest life expectancy in the U.S. and Mississippi had the best cost of living for retirees, with its inexpensive food and property prices. West Virginia had the lowest average property prices. Also see:Hot springs in January, no traffic and universal health care. The best retirement escape you've never heard of Though rankings can be helpful, these lists are usually only one step in determining where to move for retirement. There is so much to consider when choosing where to retire, such as income and property taxes, proximity to family, as well as lifestyle and entertainment. Another factor is health care, and being close to facilities that cater to specific health concerns. Some retirees may not want to move to another state, but another country entirely, which comes with its own list of factors to weigh. A few examples: health insurance, off-season weather and earning active or passive income."}]}