{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-rise-with-nike-rivals-and-automakers-advancing-11600849217", "published": 1600835300.0, "headline": "European stocks rise, with Nike rivals and auto makers advancing", "body": "People wearing face masks wait in line in front of a medical laboratory to get tested for COVID-19, in Paris, France, on September 18, 2020. olivier morin/Agence France-Presse/Getty Images European stocks rose on Wednesday, as investors brushed off a mixed batch of purchasing managers data and shares of sportswear makers and automobile makers rose. The Stoxx Europe 600 index SXXP, +0.55% rose 1.1% to 361.58, after rising 0.2% on Tuesday. The German DAX DAX, +0.06% climbed 1.4%, the French CAC PX1, +0.71% rose 1.6% and FTSE 100 index UKX, +0.64% gained 1.7%. The euro EURUSD, +0.60% fell 0.1% against the dollar, while the pound was even weaker GBPUSD, +0.83%, dropping 0.3%. Dollar strength can help European and U.K. exporters by making their prices more competitive overseas. The IHS Markit flash eurozone manufacturing purchasing managers index rose to 53.7 from 51.7, while the services PMI dropped to 47.6 from 51.9 in September. The composite PMI was barely above 50, indicating a hit to the overall economy as coronavirus cases increased across the region. But there were some improvements in manufacturing. Elsewhere, data from market-research group GfK showed German consumer sentiment is set to stabilize in October, after a sharp fall in September. Investors continue to watch the rise in coronavirus cases across Europe, with U.K. Prime Minister Boris Johnson announcing new restrictions for the country on Tuesday. He spoke of “unquestionably difficult months to come,” and warned that if people refuse to cooperate, the government will take measures further. Italy has reportedly shut its borders with France, saying it will now require COVID-19 tests for those travelers. Stock futures YM00, +0.82% ES00, +1.13% NQ00, +1.63% were higher, boosted by supportive comments from Federal Reserve Chairman Jerome Powell, who testified on Capitol Hill over the central bank’s pandemic response. Powell will make a second appearance in D.C. on Wednesday. U.S. PMI data is ahead, as well as appearances by other Fed speakers. Shares of Nike NKE, +0.97% rallied 8% in late trading on Tuesday after the sportswear maker blew past analysts forecasts for the quarter. Shares of rival Adidas ADS, +1.87% gained 4%, and Puma also PUM, -0.07% rose 3.9%. Auto makers are also climbing, with shares of Peugeot UG, -1.83% rising over 3%. The company said it would buy back 10 million of its own shares from Dongfeng Motors. Elsewhere, Renault rose over 3%,"}]}