{"article": [{"url": "https://www.marketwatch.com/story/another-coronavirus-aid-package-is-probably-not-happening-after-august-jobs-report-and-deal-to-avoid-government-shutdown-analyst-says-2020-09-04", "published": 1599294740.0, "headline": "Another coronavirus aid package is probably â\u0080\u0098not happeningâ\u0080\u0099 after August jobs report and deal to avoid government shutdown, analyst says", "body": "Fridayâ\u0080\u0099s jobs report makes it more likely that Washington wonâ\u0080\u0099t deliver another big coronavirus aid package before the November election, according to some analysts. The better-than-expected report showed the U.S. economy regained 1.4 million jobs in August as unemployment fell to 8.4% from 10.2%. See:U.S. regains 1.4 million jobs in August, unemployment falls to 8.4% And read:â\u0080\u0098Whatâ\u0080\u0099s concerning is that the pace of jobs growth is slowing downâ\u0080\u0099 â\u0080\u0094 economists react to August jobs report â\u0080\u009cFor those who, after having voted to explode the budget deficit, have suddenly remembered that they donâ\u0080\u0099t like government welfare payments, this report could strengthen their resolve to deny another package gets passed, since the need is not nearly as great as it had been,â\u0080\u009d said Joel Naroff, president and chief economist at Naroff Economics, in a note. The report on nonfarm payrolls â\u0080\u009calso undercuts the arguments of those who support additional massive government stimulus, that the economy is a disaster,â\u0080\u009d Naroff added. â\u0080\u009cIt is, when looked at on an absolute basis, but relatively speaking, it is not as big a disaster as it had been.â\u0080\u009d Related:U.S. budget deficit to hit record $3.3 trillion this year, CBO says Also:Coronavirus update â\u0080\u0094 U.S. official sees very low chance of vaccine by late October Henrietta Treyz, director of economic policy research at Veda Partners, told clients in a note that they should â\u0080\u009cassumeâ\u0080\u009d another aid package is â\u0080\u009cnot happening.â\u0080\u009d She said sheâ\u0080\u0099s downbeat on the chances for more fiscal stimulus both because of Fridayâ\u0080\u0099s jobs report and because of the news late Thursday that House Speaker Nancy Pelosi and Treasury Secretary Steven Mnuchin have agreed to try to avoid a federal government shutdown. Pelosi, a California Democrat, and Mnuchin, one of the Trump administrationâ\u0080\u0099s negotiators, are aiming to avoid a shutdown when current funding expires on Sept. 30 by working on a â\u0080\u009ccleanâ\u0080\u009d continuing resolution rather than allowing the issue to be linked to pandemic aid talks. See:Shutdown prospects dim, but so do fiscal-stimulus odds as Pelosi, Mnuchin eye separate tracks ahead of September free-for-all If the Pelosi-Mnuchin deal holds and a continuing resolution funding the government passes, â\u0080\u009cthere is no other must-pass legislation for another stimulus bill to hitch a ride on before Congress recesses for the election,â\u0080\u009d Treyz wrote. In addition, â\u0080\u009cRepublicans in the U.S. Senate are already very uncomfortable with the record high deficit spending Congress has agreed to this year, and a sub 10% unemployment rate gives them more reason to reject further deficit spending from here,â\u0080\u009d she said. â\u0080\u009cWe are formally dropping our odds of another $1.5T+ stimulus package this morning from their previous 60-75% rate to 20-30%,â\u0080\u009d Treyz said. She added that her firm believes â\u0080\u009cit is prudent for investors to position their portfolios with the assumption that no more federal stimulus will be delivered from Congress until after the November 3 election, at the earliest.â\u0080\u009d Eight to 12 Republicans in the Senate, where the GOP has a 53-to-47 majority, will â\u0080\u009cnot vote for any further stimulus, even if the overall spending was as low as $500B,â\u0080\u009d she also said. Senate Republicans have been working on a â\u0080\u009ctargetedâ\u0080\u009d or â\u0080\u009cskinnyâ\u0080\u009d aid bill with a possible price tag of $500 billion. The next relief package is an â\u0080\u009call or nothing proposition,â\u0080\u009d so if there is no major deal on fiscal stimulus, there wonâ\u0080\u0099t be an extension for the Paycheck Protection Program and no additional aid for airlines, restaurants, cruise operators and hotels, according to the Veda Partners analyst. U.S. stocks SPX, +0.87% Â DJIA, +0.56% Â COMP, +1.39% Â were recently trading sharply lower Friday in the wake of the August jobs report."}]}