{"article": [{"url": "https://www.marketwatch.com/story/think-its-too-late-to-buy-big-tech-stocks-heres-an-overlooked-comeback-play-with-a-5-dividend-2020-06-16", "published": 1592646980.0, "headline": "Think itâ\u0080\u0099s too late to buy big tech stocks? Hereâ\u0080\u0099s an overlooked comeback play with a 5% dividend", "body": "(This is the first in a series of stories about technology stocks that investors may be overlooking.) International Business Machines Corp. has suffered disparagement like no other large-cap tech name because the 109-year-old company has seemingly failed to innovate, while tens of billions of dollars spent on stock buybacks didnâ\u0080\u0099t help investors. But the company appears to be moving in the right direction, setting up a potentially attractive long-term investment for those with patience, according to Victoria Greene, a portfolio manager at G Squared Private Wealth. G Squared is based in College Station, Texas, and has about $500 million in assets under management in private accounts. “ â\u0080\u0098IBMâ\u0080\u0099s artificial intelligence is leaps and bounds ahead of competitors, since they have invested heavily in it for 10 years.â\u0080\u0099 ” â\u0080\u0094 Victoria Greene, founding partner and portfolio manager, G Squared Private Wealth In an interview, Greene discussed IBMâ\u0080\u0099s new direction under Arvind Krishna, who stepped up to become CEO in April, after leading IBMâ\u0080\u0099s acquisition of Red Hat in July 2019. She touted the companyâ\u0080\u0099s â\u0080\u009cblue chip dividendâ\u0080\u009d yield of more than 5%, which is well-supported by cash flow, and pointed to â\u0080\u009ca transformative three to five years as it sheds its older legacy business and refocuses on growth.â\u0080\u009d Before looking further at IBM IBM, -2.81%, letâ\u0080\u0099s consider valuations for big tech stocks.Familiar tech giants FAANG stocks have dominated financial news reporting for a reason: significant, consistent sales growth. FAANG stands for Facebook Inc. FB, +0.26%, Amazon.com Inc. AMZN, +3.01%, Apple Inc. AAPL, +1.74%, Netflix Inc. NFLX, +1.43% Â and Google holding company Alphabet Inc. GOOGL, +1.82% GOOG, +1.97%. FAANGs, plus Microsoft Corp. MSFT, +2.48%, have outperformed in a year of what could mildly be called uncertain: Company Ticker Total return - 2020 through June 12 Total return - 2019 Forward P/E ratio Forward P/E ratio - year earlier Facebook Inc. Class A FB, +0.26% Â 11% 57% 31.9 21.9 Amazon.com Inc. AMZN, +3.01% Â 38% 23% 112.5 65.0 Apple Inc. AAPL, +1.74% Â 16% 89% 25.8 16.1 Netflix Inc. NFLX, +1.43% Â 29% 21% 60.9 84.6 Alphabet Inc. Class C GOOG, +1.97% Â 6% 29% 33.0 22.9 Alphabet Inc. Class A GOOGL, +1.82% Â 5% 28% 33.0 23.0 Microsoft Corp. MSFT, +2.48% Â 21% 58% 31.8 27.0 Â Source: FactSet Scroll the table to see all the data â\u0080\u0094 especially the price-to-earnings ratios. Cheap stock In a partially shuttered economy, earnings estimates are suspect, but the largest of the rapidly growing tech companies have been sailing through. The group above is up by double digits, except for Alphabet. For most, forward P/E ratios (based on consensus estimates for 12 forward rolling months among analysts polled by FactSet) have increased considerably. Meanwhile, the S&P 500 information technology sector has returned 9% this year (including reinvested dividends), the only sector with a gain through June 12. The S&P 500 Index SPX, +0.87% Â has declined 5%. Shares of IBM are down 7% this year through June 12. The stock features a quarterly dividend of $1.63 a share, for a yield of 5.35%, based on the closing price of $119.33 on June 12. Over the past 12 months, IBM has generated $13.55 a share in free cash flow (remaining cash flow after planned capital expenditures), for a free cash flow yield of 11.36%. Thatâ\u0080\u0099s tremendous coverage of the dividend. In fact, IBM is one of the highest-yielding components of the S&P High Yield Dividend Aristocrats Index SPHYDA, -0.13%, which includes companies that have increased their regular dividend payouts for at least 20 consecutive years. IBMâ\u0080\u0099s shares trade at a forward P/E of only 10.9, compared with much higher valuations for the FAANGs (plus Microsoft), but also below the P/E valuation of 21.7 for the S&P 500 and 23.6 for the S&P 500 IT sector.Whatâ\u0080\u0099s going on at IBM? For the first quarter, IBM reported total revenue of $17.6 billion, down 3.4% from a year earlier. Of course you never want to see a sales decline for a tech company youâ\u0080\u0099re invested in. Here are first-quarter sales growth rates for the FAANG plus Microsoft group: Company Increase in first-quarter sales from year-earlier quarter Facebook Inc. Class A 17.6% Amazon.com Inc. 26.4% Apple Inc. 0.7% Netflix Inc. 27.6% Alphabet Inc. Class C 13.6% Microsoft Corp. 14.8% Source: FactSet So all of the FAANGs plus MSFT group grew first-quarter sales by double-digit percentages except for Apple, which suffered from the closure of its stores and the iPhone production decline in China. But there is a silver lining in IBMâ\u0080\u0099s numbers â\u0080\u0094 the Red Hat unitâ\u0080\u0099s sales were up 18% from a year earlier (before the company was acquired by IBM). G Squared Wealthâ\u0080\u0099s Greene, a former broker and portfolio manager at Merrill Lynch, is a believer in CEO Krishnaâ\u0080\u0099s plan to pivot the company toward the cloud industry. She sees â\u0080\u009chugeâ\u0080\u009d potential for growth in IBMâ\u0080\u0099s artificial intelligence/Watson business. â\u0080\u009cIBMâ\u0080\u0099s AI is leaps and bounds ahead of competitors, since they have invested heavily in it for 10 years,â\u0080\u009d she said. Investments include the Weather Channel, which IBM acquired in 2016, â\u0080\u009cfor its data and machine-learning tools.â\u0080\u009dCulture change An important argument against IBM as an investment over the past 10 years has been the apparent lack of focus in new areas for growth. For 10 years through 2019, the company spent $88.2 billion on share repurchases, but the share price increased only 2%. Of course, shareholders continued to enjoy an increasing dividend, but with dividends reinvested, the stock still returned only 37.5% for that 10-year period, while the S&P 500 Index returned 257%, according to FactSet. (IBM suspended buybacks last year to reduce debt. Over the five years through 2019, the company spent $18.2 billion in buybacks, down from $70 billion in the previous five-year period.) For eight of those 10 years, Virginia Rometty was in charge as IBMâ\u0080\u0099s CEO. She stepped down from that role when Krishna took over in April, but she remains the companyâ\u0080\u0099s executive chairman. Sell-side analysts arenâ\u0080\u0099t thrilled with IBM. Of 20 polled by FactSet, only five rate the shares â\u0080\u009cbuy,â\u0080\u009d or the equivalent. In contrast, all of the FAANG stocks (plus Microsoft) have majority â\u0080\u009cbuyâ\u0080\u009d ratings. In May 2017, Berkshire Hathaway Inc. BRK.B, +0.24% Â CEO Warren Buffett, known for his patience with long-term investments, said he was â\u0080\u009cwrongâ\u0080\u009d years earlier when he decided to begin purchasing shares of IBM, and that Berkshire had been selling some of its shares. Buffett confirmed a year later that Berkshire had exited its IBM investment completely. While acknowledging that many investors arenâ\u0080\u0099t buying IBMâ\u0080\u0099s culture change yet â\u0080\u0094 the stock is down 7% this year, including reinvested dividends â\u0080\u0094 Greene is in it the for the long haul, as well as the solid dividend. â\u0080\u009cIBM bought the right thing,â\u0080\u009d she said, referring to the Red Hat purchase. The unitâ\u0080\u0099s area of expertise, hybrid cloud, is critical, as many companies still need to integrate legacy systems and physical infrastructure for cloud functionality. And that could be an important opportunity for IBM to swing back to revenue growth."}]}