{"article": [{"url": "https://www.marketwatch.com/story/suze-orman-urges-investors-to-stay-away-from-traditional-401ks-2020-06-17", "published": 1592840660.0, "headline": "Suze Orman: 'You have to be crazy' to put your money in this investment", "body": "“ 'Please, if you have the ability to do a Roth 401K, 403B, or a TSP, or a Roth IRA, those are the type of retirement accounts that you want to be in. Stay away from the traditional ones.' ” That's personal-finance celebrity Suze Orman offering some advice on the \"Pivot\" podcast this week about what investors should be doing during the coronavirus pandemic. With traditional IRAs or 401(k)s, savers get the tax break immediately upon the contribution, allowing their investments to grow tax-free, and then have to pay the taxes upon withdrawal. But there are better ways to save for retirement, considering the current climate, Orman explained. \"With a Roth, you pay taxes today, and in the long run, when you take it out, it's tax-free,\" she said. \"Why? Do you really think that tax brackets aren't going to have to go up five, 10, 15 years from now in order to pay for all the debt that we're carrying? Of course they're going to have to.\" Bottom line: Take advantage of \"the lowest tax brackets\" we're likely to see for a long time. As for where to put the cash, Orman said she sees a sideways stock market for a while, with investors essentially forced to partake, in light of the alternatives. \"Are they going to put it in a 10-year Treasury at 0.76%? The possibility of negative interest rates?\" she said. \"You have to be crazy, if you ask me, to be in bonds at this point in time.\" For most people, her suggestion is just to stick with the Vanguard Total Stock Market ETF VTI, +0.84%  . Don't even consider individual stocks, she said, unless you're super rich. The broad market has been holding up nicely this week, though the Dow Jones Industrial Average DJIA, +0.56% was down slightly Wednesday, giving back gains from earlier in the session."}]}