{"article": [{"url": "https://www.marketwatch.com/story/modernas-stock-extends-rally-as-experts-look-to-the-coming-phase-3-study-of-the-coronavirus-vaccine-candidate-2020-07-15", "published": 1594881080.0, "headline": "Moderna's stock extends rally as experts await details of the coming Phase 3 study of the coronavirus vaccine candidate", "body": "Shares of Moderna Inc. rallied 10% Wednesday, the day after the drugmaker shared that its COVID-19 vaccine candidate produced neutralizing antibodies - thought to be a key benchmark for an effective coronavirus vaccine - in all 45 participants in a Phase 1 clinical trial. Moderna's MRNA, +0.09%  stock price closed at $75.04 on Tuesday, its second highest in the decade that the company has been in business, after an interim analysis detailing the early-stage clinical trial for its COVID-19 vaccine candidate was published in the New England Journal of Medicine (NEJM). The preclinical company had previously released snippets of data, demonstrating how its experimental coronavirus vaccine had fared in the first phase of clinical research, saying May 18 it had identified neutralizing antibodies in eight of the 45 participants. (With most viruses, antibodies indicate some level of immunity, though it is still unclear whether antibodies can make people immune to COVID-19 infections or re-infection.) See also:Race for a COVID-19 vaccine has drugmakers scaling up manufacturing - before one is developed \"We still do not know what level of antibodies is needed for protection (the correlate of protection),\" Raymond James analyst Vincent Chen wrote in a note to investors. \"But these levels look to be above the benchmark provided by the FDA's guidelines for convalescent sera donation.\" Since the coronavirus first grabbed the attention of investors in January, Moderna's shares have soared 283.6%, far outpacing the stock performance of other COVID-19 vaccine makers as well as the Health Care Select Sector SPDR Fund XLV, +0.90%, which has gained 1.4%, and the S&P 500 SPX, +0.87%, which is down 1.0%. Shares of Pfizer Inc. PFE, -0.27%, for example, have declined 9.3%, while BioNTech's BNTX, +1.23%  stock is up 151.8%, since the start of the year. “ \"We must bear in mind the complexity of vaccine development and the work still to be done before COVID-19 vaccines are widely available.\" ” - Dr. Penny Heaton, CEO, Bill & Melinda Gates Medical Research institute More than 13 million people have tested positive for the coronavirus and at least 580,000 have died worldwide, according to data aggregated by Johns Hopkins University. About one-quarter of the world's deaths and infections are in the U.S. There are no vaccines proven to prevent infection with the virus, though at least 192 vaccine candidates are being tested, including three that have moved into the clinic in the U.S. Yet even the Wall Street analysts and the medical experts who largely lauded Moderna's Phase 1 findings as positive say there are a still a number of unknowns about how vaccine candidates will perform during the mid- and especially crucial late-stage trials. \"We must bear in mind the complexity of vaccine development and the work still to be done before COVID-19 vaccines are widely available,\" Dr. Penny Heaton, CEO of the Bill & Melinda Gates Medical Research Institute, wrote in an opinion piece accompanying the study's publication in the NEJM. \"Many Phase 3 studies fail because of incorrect identification of the dose that best balances safety and efficacy. The dosing regimen for this mRNA vaccine is still under study.\" J.P. Morgan analysts told investors on Wednesday that there are still questions whether neutralizing antibody levels are relevant to immunity, whether T-cell responses matter, what dosing regimen will work best in what age group, and how a vaccine will perform in the elderly or people with co-morbidities. (Moderna's Phase 1 trial tested the vaccine candidate in people between the ages of 18 and 55 years old.) \"While a meaningful step forward, we stress this is still far from a done deal,\" they wrote. \"Many of these questions will likely be answered by the pivotal Phase 3 trial.\" Moderna's investigational vaccine is currently in a Phase 2 trial, with 600 participants split between two age cohorts - 18 to 55-year-olds and 55 years old and older - and is expected to proceed to a late-stage randomized, placebo-controlled clinical study on July 27, with up to 30,000 people enrolled. The primary endpoint in the Phase 3 trial will test whether the vaccine can prevent symptomatic COVID-19 disease, Moderna said. It seems that company executives are thinking through the same concerns raised by medical experts and analysts, including the durability of immunity that may come from antibodies generated by the vaccine candidate. \"Neutralizing antibodies may wane over time,\" Dr. Tal Zaks, Moderna's chief medical officer, said on Wednesday, according to a FactSet transcript of an investor call. \"I think my takeaway is that it's entirely plausible. But it also seems that those who start with asymptomatic infection or start with lower levels of antibodies, they seem to lose them more quickly, which probably speaks to the quality and type of the immune response to begin with.\" Read:After months of speculation, investors get excited about Pfizer, BioNTech's coronavirus vaccine candidate The race to develop a COVID-19 vaccine has been well under way for months. While Moderna was the first company to disclose clinical trial findings in humans in early May, BioNTech and Pfizer Inc. recently shared promising findings from their Phase 1 trial. According to a preprint, the vaccine candidate triggered neutralizing antibodies at a higher level than what has been reported in people recovering from a COVID-19 infection. Another preclinical player, Inovio Pharmaceuticals Inc. INO, -1.36%, said June 30 in a vaguely worded announcement that its experimental vaccine produced \"overall immunological response rates\" in 94% of 36 trial participants, though it did not provide additional details. It is expected to publish more information in a peer-reviewed medical journal. Data from the first phase of a much anticipated Phase 1 vaccine trial being conducted in the U.K. by AstraZeneca AZN, +1.16%  and the University of Oxford may also be released this week, according to an unnamed source cited by British news channel ITV. \"Apparently the vaccine is generating the kind of antibody and T-cell (killer cell) response that the researchers would hope to see,\" editor Robert Peston wrote on Wednesday. The speed at which coronavirus vaccines are being developed and moved into clinical trials has been met with both applause and skepticism, with a vaccine timeline becoming a political linchpin in a divisive U.S. that has fumbled its economic and scientific response to the pandemic. The Trump administration has promised a vaccine by January as part of its \"Operation Warp Speed\" program. It has traditionally taken between five to seven years to develop a vaccine, and many fail along the way. \"We still believe that the 'end of 2020' timeline is unrealistically aggressive for the availability of a general use vaccine, but do expect a vaccine to be approved on an [emergency use authorization] basis by year-end for high-risk populations,\" SVB Leerink's Geoffrey Porges wrote on Wednesday."}]}