{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-slip-as-worries-about-a-resurgence-in-coronavirus-fuels-bond-buying-2020-06-15", "published": 1592238500.0, "headline": "Treasury yields come off lows after Fed makes tweak to how it snaps up corporate bonds", "body": "Treasury yields came off their lows Monday, after U.S. equities rebounded following the Federal Reserve’s announcement that it would tweak one of its lending programs to enable the central bank to buy a broad basket of corporate bonds. What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% was off 0.3 basis points to 0.701%, following its biggest weekly drop since March, while the two-year note rate TMUBMUSD02Y, 0.156% was virtually unchanged at 0.189%. The 30-year bond yield TMUBMUSD30Y, 1.576% was flat at 1.448%. Bond yields fall as prices rise. What’s driving Treasurys? Gains from the overnight bond-market rally were eroded after the Fed said it would buy a broad basket of corporate bonds, based on an index of its own creation. Though the move was in line with the Fed’s previous plan to buy corporate debt, risk assets rallied and haven assets retreated on the news. The S&P 500 SPX, +0.87% and Dow Jones Industrial Average DJIA, +0.56% closed higher Monday. See: Fed announces plans to buy broad basket of corporate bonds The bond market had initially taken on a bullish tone at the start of the session amid worries that a spate of new coronavirus cases in Beijing pointed to how even countries that appeared to have controlled their own outbreaks could still see a resurgence. Local health officials say the outbreak occurred in a wholesale food market and may have come from imported salmon. The U.S. is also grappling with its own concerns of a resurgence of coronavirus infections, as some states report an uptick in cases and hospitalizations associated with the disease. Dallas Fed President Robert Kaplan said Sunday that public health procedures to combat the coronavirus were just as important as government funding for the nascent economic recovery and that, to date, the efforts to reduce coronavirus infections have been “uneven.” In economic data, the Empire State manufacturing survey showed factory activity in New York state was stabilizing. The June index rose 48 points to negative-0.2. A reading close to zero indicates steadying conditions What did market participants say? “It’s an incremental step. It’s not clear why stocks are rallying on this much as they have,” said Tom Graff, head of fixed income at Brown Advisory, in an interview. He said the Fed’s tweak to its secondary market facility could be meaningful if it paved the way to an increase in bond purchases, but it’s unclear if it will do so."}]}