{"article": [{"url": "https://www.marketwatch.com/story/feds-kaplan-says-hes-skeptical-of-yield-curve-control-2020-06-15", "published": 1592236640.0, "headline": "Fedâ\u0080\u0099s Kaplan says heâ\u0080\u0099s skeptical of yield-curve control", "body": "Dallas Fed President Robert Kaplan said Monday that he is skeptical of the central banking using so-called â\u0080\u009cyield-curve controlâ\u0080\u009d as a new tool to help the economy recover from the recession. In a talk with the Money Marketeers of New York University, a forum for economic and finance, Kaplan said he hadnâ\u0080\u0099t completely made up his mind, but didnâ\u0080\u0099t seem eager for any swift decision to use the tool. â\u0080\u009cI wouldnâ\u0080\u0099t rule it out, but right now Treasury yields are relatively muted,â\u0080\u009d Kaplan said. Advocates of so-called yield-curve control argue that it would be a useful tool to help the central bank keep interest rates low while the economy recovers. Rising rates can choke off growth in a recovering economy because they make borrowing unaffordable. The Fed has signaled its intention to hold its benchmark, overnight, federal-funds rate at zero until 2023. Those rates presently stand at a range between 0% and 0.25%. Some economists worry that using yield-curve control would remove important market signals, leaving the Fed and investors in the dark about the economyâ\u0080\u0099s health. Read: Fedâ\u0080\u0099s Kaplan worries economyâ\u0080\u0099s recovery may be slowed if coronavirus health practices remain â\u0080\u0098unevenâ\u0080\u0099 Kaplan said he shared this concern. â\u0080\u009cI worry about creating more distortions in financial markets,â\u0080\u009d Kaplan said. â\u0080\u009cIâ\u0080\u0099m not saying we shouldnâ\u0080\u0099t do it, but Iâ\u0080\u0099d have to see evidence that there is a reason to do it,â\u0080\u009d he added. The Dallas Fed president is seen by economists and market experts as an important bellwether of the center of the spectrum of views held by members of the policy-setting Federal Open Market Committee. He is a voting member of the that committee this year. In a separate interview, San Francisco Fed President Mary Daly was also cautious about yield-curve control, calling it was a possible â\u0080\u009clittle helperâ\u0080\u009d that could underline what the Fed tells the market about its plans for its benchmark federal-funds rate. â\u0080\u009cYield-curve control isnâ\u0080\u0099t in my first-use tool kit,â\u0080\u009d Daly said. â\u0080\u009cBut Iâ\u0080\u0099m eagerly reading and looking at research that talks about the costs and benefitsâ\u0080\u009d of it, she added. In other comments, Kaplan said he was worried about the high level of spending and the debt burden resulting from the response to the coronavirus pandemic. He said the central bank was running some version of Modern Monetary Theory, the controversial idea that a surge in spending and higher budget deficits wonâ\u0080\u0099t necessarily result in higher inflation for major developed economies. Before the crisis, Kaplan said most economists believe that MMT wasnâ\u0080\u0099t well thought out and even dangerous. â\u0080\u009cUnfortunately because of the crisis, we have actually taken a number of steps which are heading into new territory â\u0080\u0094 and so weâ\u0080\u0099ve done some version of MMT to some extent to deal with this crisis,â\u0080\u009d Kaplan said â\u0080\u009cThe challenge is, I donâ\u0080\u0099t think the implications of MMT were well understood before and I was concerned about them, and now that weâ\u0080\u0099ve done some of these things, I continue to be concerned and weâ\u0080\u0099re going to have to reckon with the implications,â\u0080\u009d he added. That means the government should show some â\u0080\u009crestraintâ\u0080\u009d and assess the implication of what has been done before we make additional moves, he explained. In her speech, Daly said Congress should get ready to spend more money if warranted. â\u0080\u009cWeâ\u0080¦need fiscal policy makers to commit to sustained investments in our economic future,â\u0080\u009d she said in a speech to the National Press Club in Washington. â\u0080\u0098The need for this was evident before the crisis, and itâ\u0080\u0099s even more evident now,â\u0080\u009d she said. During his interview, Kaplan reiterated his thought that it was important that Americans wear masks to reduce the spread of the coronavirus. Efforts by the public, in addition to better and more testing, would help the economic recovery, he said. So far, these efforts have been â\u0080\u009cuneven,â\u0080\u009d he said. U.S. equity benchmarks were off their morning lows and moved into positive positive territory. The S&P 500 index SPX, +0.87% and the Nasdaq Composite COMP, +1.39% Â were trading in positive territory after opening Monday trade sharply lower."}]}