{"article": [{"url": "https://www.marketwatch.com/story/asian-markets-advance-tracking-wall-streets-tech-rally-2020-06-22", "published": 1592870540.0, "headline": "Asian markets advance, tracking Wall Streetâ\u0080\u0099s tech rally", "body": "TOKYO â\u0080\u0094 Asian shares were mostly higher on Tuesday, recovering from some early losses as regional markets tracked a late rally on Wall Street led by technology shares. Japanâ\u0080\u0099s benchmark Nikkei 225 NIK, -0.11% Â surged 1%. Hong Kongâ\u0080\u0099s Hang Seng index HSI, -0.30% Â jumped 0.8% and South Koreaâ\u0080\u0099s Kospi 180721, +0.21% Â climbed 0.3%. Australiaâ\u0080\u0099s S&P/ASX 200 XJO, +0.00% Â inched up 0.1% to 5,950.50, while the Shanghai Composite SHCOMP, +1.67% Â gained 0.2%. Shares fell in Jakarta JAKIDX, +0.28% Â but rose in Singapore STI, -0.39% Â and Taiwan Y9999, +1.10% Â . â\u0080\u009cItâ\u0080\u0099s back to the regular order of business, which is trying to figure out why stocks are so high!â\u0080\u009d Stephen Innes of AxiCorp said in a commentary. â\u0080\u009cYou can add the resurgence of COVID-19 to the laundry list of things the market doesnâ\u0080\u0099t care about, so it seems.â\u0080\u009d On Wall Street, the S&P 500 SPX, +0.87% Â rose 0.6% to 3,117.86 after initially sliding 0.6% following weakness in overseas markets as the global tally of coronavirus infections surpassed 9 million. Investors are weighing the risks that rising coronavirus cases could pose to hopes for an economic recovery. Thatâ\u0080\u0099s led traders to bid up stocks in technology companies that offer services online, a thriving conduit of commerce through the outbreak. â\u0080\u009cIn an environment where the WHO had only recently announced on Sunday a record increase in global Covid-19 cases, sentiment can certainly still turn very promptly with the flick of the switch,â\u0080\u009d Jingyi Pan, a market strategist with IG in Singapore said in a report. Overnight, the head of the World Health Organization, Tedros Adhanom Ghebreyesus, warned that the coronavirus pandemic â\u0080\u009cis still acceleratingâ\u0080\u009d around the globe. He noted that the most recent 1 million cases of the virus were reported in just the last eight days. Asian markets initially opened lower, spooked by reported comments by White House trade adviser Peter Navarro suggesting the U.S. trade deal with China was in trouble. However, Navarro said his comments were taken out of context, and President Donald Trump tweeted that the agreement with China, the basis for a truce in a tariff war over technology and other problems, is still on. Trump tweeted: â\u0080\u009cThe China Trade Deal is fully intact. Hopefully they will continue to live up to the terms of the Agreement!â\u0080\u009d Investors are favoring retailers and other companies that are poised to do well now that more businesses have been given the go-ahead to reopen. But traders are also continuing to hedge their bets by snapping up traditionally less risky assets, such as government bonds and gold, which also rose. Bond yields were mixed. The Dow Jones Industrial Average DJIA, +0.56% Â picked up 0.6%, to 26,024.96 after earlier sliding 203 points. The Nasdaq composite COMP, +1.39% Â , which is heavily weighted with technology stocks, climbed 1.1%, to 10,056.47, extending its winning streak to a seventh day. While recent U.S. economic data have shown improvement as businesses reopened, it may take years for the economy to fully recover. In contrast, it took just a few months for the stock market to rally back to within 9% of its record. David Kelly, chief global strategist at JPMorgan Funds, sees a disconnect between the marketâ\u0080\u0099s recent gains and what the economic data show. He says the markets seem to be straying further and further from fundamentals, which is making him â\u0080\u009cmore distrustful of markets as an economic barometer.â\u0080\u009d New data on U.S. home sales Monday showed the virus outbreak continues to disrupt the U.S. housing market. Sales of previously occupied homes plunged 9.7% in May, according to the National Association of Realtors. The May slide pushed sales down to a seasonally adjusted annual rate of 3.91 million, the slowest pace since 2010. Still, the median home price rose 2.3% from a year ago, a sign that demand could pickup up in coming months. Investors will get a broader look at the state of the economy toward the end of this week, when the government issues data on consumer spending, weekly unemployment aid applications and durable goods orders. On Tuesday, the Commerce Department serves up new home sales figures for May. Benchmark U.S. crude oil US:CLN20 Â was unchanged at $40.46 per barrel in electronic trading on the New York Mercantile Exchange. It rose 71 cents on Monday. Brent crude UK:BRNQ20 Â , the international standard, edged 1 cent higher to $43.08 per barrel. The dollar USDJPY, -0.38% Â rose to 107.17 Japanese yen from 106.90 yen late Monday."}]}