{"article": [{"url": "https://www.marketwatch.com/story/a-starter-guide-to-supporting-black-owned-businesses-its-not-rocket-science-people-just-choose-not-to-do-it-2020-06-15", "published": 1592560880.0, "headline": "5 ways to support black-owned businesses: â\u0080\u0098Itâ\u0080\u0099s not rocket science â\u0080\u0094 people just choose not to do itâ\u0080\u0099", "body": "Weeks of protests over George Floydâ\u0080\u0099s killing in police custody have many Americans wondering whether this moment will lead to lasting change that finally reduces the nationâ\u0080\u0099s long-standing racial disparities. Individuals have been donating money to nonprofits and signing petitions, while corporations from Apple AAPL, +1.74% Â to Zappos have publicly pledged support for the Black Lives Matter movement. But thereâ\u0080\u0099s another way Americans can continue to address inequality over the long term: They can put their money where their mouth is and spend their cash at black-owned businesses. â\u0080\u009cYou start feeling a bit helpless in times like this â\u0080\u0094 â\u0080\u0098What can I do? Iâ\u0080\u0099m only one person,â\u0080\u0099â\u0080\u009d said Khadijah Robinson, the founder of The Nile List, an online directory of black-owned businesses. â\u0080\u009cSupporting black-owned business is a small piece, but itâ\u0080\u0099s something that people can do consistently, even when people are not protesting anymore.â\u0080\u009d â\u0080\u009cItâ\u0080\u0099s not going to fix everything overnight, obviously,â\u0080\u009d Robinson added. â\u0080\u009cBut itâ\u0080\u0099s something you can do and be a little conscientious about on a consistent basis and make a small difference.â\u0080\u009d Hereâ\u0080\u0099s how consumers can support black-owned businesses â\u0080\u0094 and why itâ\u0080\u0099s important:Understand the history of black-owned businesses in the U.S. This month marked the 99th anniversary of the Tulsa, Okla. race massacre, when white rioters looted and burned the Greenwood District, a prosperous African-American area known as â\u0080\u009cBlack Wall Street.â\u0080\u009d The episode is just one example of how black businesses have been targeted by either hostile individuals or government policy. â\u0080\u009cIf you pay attention to the literal campaign of terror against black Americans in this country, what youâ\u0080\u0099ll see is a lot of it was carried out against black business owners or anyone who was perceived as accumulating wealth,â\u0080\u009d Robinson said. In the 1850s, New York City used eminent domain to destroy a village of black property owners on land that later became Central Park. After emancipation, former slave owners were compensated for the loss of their free labor, while freed slaves were given no money to start new lives, despite the promise of â\u0080\u009c40 acres and a mule.â\u0080\u009d Lynching victims were often successful black business owners who posed a threat to white economic interests, a phenomenon documented by the journalist Ida B. Wells. After World War II, the GI Bill helped veterans buy homes, but black people were effectively excluded from its benefits. “ â\u0080\u0098If you pay attention to the literal campaign of terror against black Americans in this country, what youâ\u0080\u0099ll see is a lot of it was carried out against black business owners or anyone who was perceived as accumulating wealth.â\u0080\u0099 ” â\u0080\u0094 Khadijah Robinson, founder of The Nile List Time and again, opportunities for black Americans to build wealth have been thwarted, said Kathryn Orr, the director of entrepreneurship at the National Community Reinvestment Coalition. â\u0080\u009cThere have been concerted efforts to make it more difficult,â\u0080\u009d Orr said. Speaking of the period after emancipation, she said, â\u0080\u009cHad that wealth started then and built and become generational wealth, then things would be easier for people starting businesses now. Generational wealth creates more and more and more and without that, it makes it very difficult to compete at that same level. If your grandparents have owned homes and businesses, you have more experience, better connections, and a stronger safety net.â\u0080\u009d The racial wealth gap in the U.S. is stark: As of 2016, a white familyâ\u0080\u0099s median net worth was $171,000, while a black familyâ\u0080\u0099s was $17,600, according to the Survey of Consumer Finances. Understand the obstacles black-owned businesses face today Black women business owners are the fastest-growing group of entrepreneurs in the U.S., according to a 2019 report by American Express. But they face an uphill battle: Theyâ\u0080\u0099re more likely to rely on credit cards and personal savings rather than outside investors to start their businesses, and more likely than their white counterparts to be denied a bank loan, according to the U.S. Department of Commerceâ\u0080\u0099s Minority Business Development Agency. The hurdles that black business owners face with lenders can be more subtle than outright denial of loans, Orr noted. In a â\u0080\u009cmystery shopperâ\u0080\u009d experiment in which the NCRC sent men and women of different races -â\u0080\u0094 but with similar credit profiles â\u0080\u0094 to apply for small business loans at 32 different banks, white borrowers consistently received better customer service than black and Hispanic borrowers. Bank staff were 18% more likely to introduce themselves to white borrowers, for example. See also: VIDEO:How to build an investment portfolio that supports racial justice In one instance, a white female tester â\u0080\u009creceived about 22 minutes of face time with a banker who introduced herself by name, asked her about her needs and took down the general information about her business,â\u0080\u009d the NCRC found. Bank personnel guided the white female tester through calling the bankâ\u0080\u0099s â\u0080\u009cbusiness direct centerâ\u0080\u009d and gave her a private room where she could speak to the centerâ\u0080\u0099s representative. Meanwhile, bank staff told the black female tester that the branch did not have a business specialist, and suggested she visit another branch. Unequal treatment is so common, Orr said, that many black business owners donâ\u0080\u0099t even consider getting a bank loan to start their business. â\u0080\u009cThe stats are so bad that itâ\u0080\u0099s not worth the risk to try,â\u0080\u009d she said. â\u0080\u009cIt really is pulling yourself up by your bootstraps â\u0080\u0094 you build your boot and you do it yourself.â\u0080\u009d The coronavirus pandemic has thrown a fresh set of challenges at black-owned businesses. Lockdown orders hit black-owned businesses especially hard, and though the $2.2 trillion CARES Act handed out forgivable loans to shore up businesses, an estimated 90% of black-owned firms were either ineligible for the money or denied loans. â\u0080\u009cHere was an opportunity for the U.S. to once again help us reset some of the ways racism operates in our society, and we swung and missed again,â\u0080\u009d said Rashawn Ray, a sociology professor at the University of Maryland and a fellow at the Brookings Institution, a center-left think tank.Find black-owned businesses Since the protests over Floydâ\u0080\u0099s killing, crowd-sourced lists of black-owned businesses â\u0080\u0094 including candlemakers, goth clothing brands and doughnut shops â\u0080\u0094 have been circulating on Twitter TWTR, -0.23% Â and Instagram FB, +0.26%. Local business groups such as the Washington D.C. Economic Partnership and the Central Ohio African-American Chamber of Commerce also maintain lists of black-owned businesses. There are also apps, such as EatOkra for black-owned restaurants, and websites like We Buy Black and Official Black Wall Street. One of the newest tools for finding black-owned businesses is The Nile List, which went live in March. Robinson, a 31-year-old lawyer who specializes in international trade issues, created the site with the millennial consumer in mind. â\u0080\u009cI want to find new and innovative ways to make buying black normalized and part of peopleâ\u0080\u0099s daily routine,â\u0080\u009d Robinson told MarketWatch. “ â\u0080\u0098Generational wealth creates more and more and more and without that, it makes it very difficult to compete at that same level.â\u0080\u0099 ” â\u0080\u0094 Kathryn Orr, director of entrepreneurship, National Community Reinvestment Coalition All of the businesses on The Nile List sell their products online, and users can filter results to find businesses that are LGBTQ-owned, vegan or cruelty-free. Robinson vets businesses to make sure the owners really are black, and keeps an eye out for â\u0080\u009cblackfishing,â\u0080\u009d when businesses market to black consumers on the false premise that theyâ\u0080\u0099re black-owned.Hold corporations accountable when they say theyâ\u0080\u0099ll support black businesses Some of Americaâ\u0080\u0099s biggest companies have promised to either â\u0080\u009csupportâ\u0080\u009d or directly spend money at black-owned businesses. Hyatt Hotels H, -2.69% Â said this week that it would expand â\u0080\u009cpurchasing with minority-owned businesses, and especially those that are Black-owned.â\u0080\u009d Bank of America BAC, +0.47% Â announced a $1 billion â\u0080\u009ceconomic opportunity initiativeâ\u0080\u009d that will include funding for lenders that focus on low-income communities and minority-owned banks, a spokeswoman said. The beauty chain Sephora LVMH, +0.61% Â signed the 15% Pledge, a campaign asking retailers to devote 15% of their shelf space to black-owned brands. But companiesâ\u0080\u0099 public displays are â\u0080\u009chollow,â\u0080\u009d Ray said, unless theyâ\u0080\u0099re backed up by measurable actions. â\u0080\u009cI want to see an action plan for diversifying your workforce, diversifying your upper management, and using black-owned businesses as contractors,â\u0080\u009d he said. Harry Alford, co-founder of humble ventures, a venture development firm focused on â\u0080\u009cdiverse founders,â\u0080\u009d says thereâ\u0080\u0099s a strong business case for companies to follow through on these promises. The U.S. will be â\u0080\u009cmajority-minorityâ\u0080\u009d in about 20 years, he said. â\u0080\u009cIt just makes the most financial sense to not only make more diverse hires, but to also start tapping new consumer groups,â\u0080\u009d Alford told MarketWatch. â\u0080\u009cIf you have the same people from the same background at the table, no one is going to go unchallenged and there are also going to be innovation blind spots. A lot of these tech companies donâ\u0080\u0099t represent how the world looks right now. Theyâ\u0080\u0099re leaving money on the table.â\u0080\u009dChoose to change your habits as a consumer Many black-owned businesses have suffered during the pandemic, and in some cities, theyâ\u0080\u0099ve been victims of looters during recent protests. To give hurting black-owned businesses a quick cash infusion immediately, try buying gift cards, Orr suggested. Want to make an event out of it? Attend a black business crawl. The digital platform Official Black Wall Street has previously hosted black business crawls where attendees visit brick-and-mortar black-owned businesses in certain cities during the holiday shopping season. This yearâ\u0080\u0099s plans for a crawl are up in the air because of COVID-19, a spokeswoman said. But Official Black Wall Street is planning a 30-day â\u0080\u009cBuy Black Challengeâ\u0080\u009d starting on Juneteenth (June 19). â\u0080\u009cThe way I think about change is that we all play a role in it,â\u0080\u009d Ray said. â\u0080\u009cThere are things that people can do and often times they know the things they can do, they just have chosen not to do it. Thatâ\u0080\u0099s whatâ\u0080\u0099s key, to put your money where your mouth is. ... Itâ\u0080\u0099s not rocket science â\u0080\u0094 people just choose not to do it.â\u0080\u009d"}]}