{"article": [{"url": "https://www.marketwatch.com/story/slavery-ended-a-long-time-ago-but-racism-didnt-says-amazon-ceo-as-he-urges-employees-to-cancel-meetings-on-juneteenth-2020-06-18", "published": 1592551520.0, "headline": "'Slavery ended a long time ago, but racism didn't,' says Amazon CEO Jeff Bezos as he urges employees to cancel meetings on Juneteenth", "body": "Billionaire CEO Jeff Bezos is honoring Juneeteeth on Friday as a day of edification at Amazon.com and urging employees to attend \"learnings opportunities,\" to recognize the end of slavery in America. Juneteenth, which is celebrated annually by many on June 19, is a day commemorating the end of slavery in the U.S. in 1865. It was on that date that Union Gen. Gordon Granger read the Emancipation Proclamation to African Americans, roughly 2½ years after the proclamation was issued on Jan. 1, 1863. Bezos issued a memo to employees on Tuesday, imploring them to cancel meetings, if they can, and attend online sessions to presumably learn about the history of structural racism in the U.S. \"Please take some time to reflect, learn and support each other. Slavery ended a long time ago, but racism didn't,\" the memo read, according to a copy published by CNBC. Amazon.com AMZN, +3.01% employs some 798,000 full- and part-time workers, with around 400,000 located in the U.S., according to FactSet data. Since the height of the COVID-19 pandemic that has disrupted global economies, the company said it has hired some 175,000 additional workers. Its workforce makes it the second-largest employer in the country behind Walmart WMT, +1.00%, which has more than 2 million workers. The e-commerce giant's efforts to commemorate Juneteenth come amid a period in which calls for racial justice have reached a crescendo in America, in the aftermath of a series of deaths of blacks at the hands of police officers, and other racially charged incidences, highlighted by the killing of George Floyd, a black man, who died as a police officer knelt on his neck for 8 minutes and 46 seconds, even as the unarmed man said he couldn't breathe. That death helped to spark a wave of national protests about racial equality and police brutality. Other tech companies, including Twitter Inc. TWTR, -0.23% and Square Inc. SQ, +2.06%, say they will observe Juneteenth as a company holiday in the U.S. Bezos, who founded Amazon in 1994, is worth $158.2 billion, according to a Forbes ranking, making him the richest man on the planet. Amazon has announced it would donate $10 million to \"organizations supporting justice and equity,\" and is implementing on a one-year moratorium on police use of its facial-recognition technology, Rekognition. Beyond racial justice, however, Amazon has faced criticism from lawmakers and lawsuits from employees for not doing enough to prevent the spread of COVID-19 in its warehouses. The company has said that it has spent, and will spend, billions of dollars on efforts to protect workers. Check out:This is one Amazon customer that Jeff Bezos is 'happy to lose'"}]}