{"article": [{"url": "https://www.marketwatch.com/story/if-donald-trump-has-a-plan-to-save-social-security-he-should-tell-voters-what-it-is-11600955896", "published": 1600955720.0, "headline": "Does Donald Trump have a plan to save Social Security? If so, he should tell voters what it is", "body": "U.S. President Donald Trump should spell out his plan to save Social Security Drew Angerer/Getty Images What is President Donald Trump’s plan to save Social Security? Does he have one? If so, what is it? I’ve been trying to find out for nearly two weeks, but with everything going on neither the campaign nor the White House has been able to give me a solid answer so far. It’s not ideal, really. Our national retirement program could start running out of money as early as a decade from now. Yes, really. Social Security was already due to start paying out more this year than it took in. The Trustees were formally predicting insolvency around 2035. And that was before the coronavirus crisis and lockdowns struck. The Congressional Budget Office warns that the Social Security trust funds may become insolvent as early as 2031. “The total reduction in annual benefits necessary for the trust funds’ outlays to match their revenues in each year after the OASDI trust funds were exhausted would be about 25 percent in 2032 and would rise to about 31 percent in 2050,” it says. Yikes. By early next decade about 80 million senior Americans — nearly one quarter of the entire country — will be living on Social Security payments. For most of them, that will be their main source of income. For many, it will be their only source of income. And unless something changes, and soon, they’ll be looking at a 25% across the board cut in monthly payments — from an average monthly check of $1,500 to just $1,200. Good luck with that. This isn’t me saying this. It’s the CBO. It’s the Social Security Administration’s trustees, led by president Trump’s Treasury Secretary Steve Mnuchin. It’s the Congressional Research Service. Among the main presidential candidates, Democrat Joe Biden has said what he’ll do. He says he won’t cut benefits (he actually has plans to increase them, for the very old and for the lowest earners). Instead, he’ll raise taxes on incomes over $400,000 a year to ensure the checks keep going out. But I can’t find out what President Trump’s plan is to save it, or if he even has one. I asked Trump’s campaign more than 10 days ago. They replied (mostly) by attacking Joe Biden. Fair enough. But that doesn’t really help retirees and would-be retirees. They added that, “President Trump has spent his presidency preserving Social Security and strengthening Medicare,” that “President Trump…is protecting benefits by fighting to rebuild our economy, restore jobs, and ultimately deliver the Great American Comeback,” and that in his second term he would “Protect Social Security and Medicare.” But what does that mean? Does it just mean Social Security benefits won’t be cut in the next four years? No one was really expecting them to be. The trust fund’s insolvency is about a decade away. Or does it mean he’ll refuse to sign any bill cutting future benefits? PolitiFact argues it’s only happenstance that Trump hasn’t signed Social Security benefit cuts into law so far. The campaign has referred me to the White House press office, who in turn included the Office of Management and Budget. Social Security is paying out way more than it is taking in each year. There are only two solutions: Raise taxes or cut benefits. (Or, I suppose, the third solution, which is to rely on Magic Monetary Theory, and borrow and print the money.) The trustees wrote earlier this year that to restore solvency, “revenue would have to increase by an amount equivalent to an immediate and permanent payroll tax rate increase of 3.14 percentage points to 15.54 percent, [or] scheduled benefits would have to be reduced by an amount equivalent to an immediate and permanent reduction of about 19 percent applied to all current and future beneficiaries, or about 23 percent if the reductions were applied only to those who become initially eligible for benefits in 2020 or later [or] some combination of these approaches would have to be adopted.” So: Payroll taxes up by about a quarter, benefits down by around a quarter or a fifth, or some combination of the two. The Congressional Research Service warns that the longer Congress and the president delay fixing this situation, the worse it becomes. So what’s the plan? Will he raise taxes, or cut benefits? There are multiple plans wafting around Washington to try to save the system, either by cutting expected benefits, raising taxes or some combination. And if he cuts benefits, where will be the cut off points? Who will be protected and who won’t? Will someone who is counting on a Social Security check of $1,500 a month now be looking at a $1,200 check? As most of them have little or nothing else to live on, they probably ought to know now. Making the situation more complicated is President Trump’s recent move to suspend payroll taxes—in other words, payments into the Social Security trust fund—to help the economy. Some experts are seriously alarmed, and fear it is part of a move to cut Social Security payments ahead. Joe Biden’s campaign has claimed that this will deplete the Social Security trust fund within three years. But Trump’s campaign argued that’s a misrepresentation and FactCheck.org agrees. President Barack Obama signed a payroll tax holiday eight years ago to help the economy back then, and few argued that was also an attack on the system. As payroll taxes are flat and regressive taxes, suspending them is probably the quickest way for the federal government to put money in the pockets of tens of millions of ordinary workers without actually mailing checks. But without a clear explanation of what Trump’s actual plan for Social Security is, people are going to wonder, and ask awkward questions. Especially when he talks about “terminating” payroll taxes. The AARP, the interest group focused on people over 50, sent a letter to the White House about this on Aug. 13, and so far there’s been no public response. That’s not me, that’s the AARP. In “Time To Get Tough,” in 2011, Trump wrote that he supported gradually raising the full retirement age to 70. He also pinned his hopes for helping Social Security on faster economic growth. But also wrote, “Now I know there are some Republicans who would be just fine with allowing these programs to wither and die on the vine. The way they see it, Social Security and Medicare are wasteful ‘entitlement programs.’ But people who think this way need to rethink their position. It’s not unreasonable for people who paid into a system for decades to expect to get their money’s worth—that’s not an ‘entitlement,’ that’s honoring a deal.” Adding, “[W]hen someone has worked for 40 years and seen the government deduct 6 percent out of each of the 480 paychecks they received over those years, it’s perfectly understandable that they would want the money they are owed. It’s only fair.” So what does that mean? Who will face Social Security cuts? Are the only people to be protected to be the ones who’ve already retired? A 20% or 25% collapse in the stock market would certainly get everyone’s attention. So should a similar potential plunge in Social Security — especially as 90% of the American people have way more riding financially on the federal retirement program than they do on stocks or anything else. There’s an election coming up and this is important. I think readers would like to have some idea before they vote."}]}