{"article": [{"url": "https://www.marketwatch.com/story/top-manhattan-prosecutor-leaves-job-after-standoff-with-barr-2020-06-21", "published": 1592732720.0, "headline": "Top Manhattan prosecutor leaves job after standoff with Attorney General William Barr", "body": "WASHINGTON (AP) — An extraordinary standoff between the Justice Department and Manhattan U.S. Attorney Geoffrey S. Berman ended Saturday when the prosecutor agreed to leave his job with an assurance that his investigations into allies of President Donald Trump would not be disturbed. The announcement capped two days of conflicting statements, allegations of political interference in prosecutions, and defiance from Berman. On Saturday, Attorney General William Barr said Berman’s refusal to resign under pressure prompted Trump to fire him. Trump, speaking briefly to reporters at his rally venue in Tulsa, Okla., tried to distance himself from the dispute, saying the decision “was all up to the attorney general.” This episode deepened tensions between the Justice Department and congressional Democrats, who have accused Barr of politicizing the agency and acting more like Trump’s personal lawyer than the country’s chief law-enforcement officer. It also raised questions about ongoing investigations in the Southern District of New York, notably a probe into Rudy Giuliani, the president’s personal attorney. Barr set off the whirlwind chain of events on Friday night with a surprise announcement that Berman was resigning, without explanation. But Berman insisted that he had not resigned, that was not stepping down and that his investigations would continue. On Saturday morning, he showed up to work, telling reporters, “I’m just here to do my job.” Hours later, Barr announced Berman’s firing. “Unfortunately, with your statement of last night, you have chosen public spectacle over public service,” Barr wrote in a letter released by the Justice Department. He said the idea that Berman had to continue on the job to safeguard investigations was “false.” Although Barr said Trump had removed Berman, the president told reporters: “That’s all up to the attorney general. Attorney General Barr is working on that. That’s his department, not my department.” Trump added: “I wasn’t involved.” Legal experts were quoted as saying that only the president has the authority to remove a person in Berman’s position, not the attorney general. The administration’s push to cast aside Berman amounted to a political and constitutional clash between the Justice Department and one of the nation’s top districts, which has tried major mob, financial crimes and terrorism cases over the years. Only days ago, allegations surfaced from former Trump national-security adviser John Bolton that the president sought to interfere in an investigation by Berman’s office into the state-owned Turkish bank in an effort to cut deals with Turkish President Recep Tayyip Erdoğan. See:Bolton book adds urgency to Trump bid to depict himself as a China hawk and to paint Biden as a Beijing apologist Berman initially vowed to stay on the job until a replacement was confirmed. He changed his mind late Saturday after Barr said he would allow Berman’s second in command, Deputy U.S. Attorney Audrey Strauss, to become acting U.S. attorney. Berman said Strauss’s appointment signaled that Barr had decided “to respect the normal operation of law.” He said he was stepping down immediately. The administration’s efforts to replace Berman with a handpicked replacement, however, were already running into roadblocks before Barr agreed to install Strauss. After announcing Berman’s resignation, the White House said it was nominating Securities and Exchange Commission Chairman Jay Clayton, a well-connected Wall Street lawyer with virtually no experience as a federal prosecutor, for the job. But Sen. Lindsey Graham, R-S.C., the chairman of the Senate Judiciary Committee and a close Trump ally, said he was unlikely to proceed with Clayton’s nomination unless New York’s senators, Democrats Chuck Schumer and Kirsten Gillibrand, gave their consent to the pick. Schumer said the bid to oust Berman “reeks of potential corruption of the legal process,” and Gillibrand said she would “not be complicit” in helping fire a prosecutor investigating corruption. Both lawmakers called for Clayton to withdraw from consideration. Schumer also called for the department’s inspector general and Office of Professional Responsibility to investigate Berman’s ouster. And the chairman of the House Judiciary Committee, Rep. Jerry Nadler, D-N.Y., said Berman has an open invitation to testify before his panel. Berman, a Republican who contributed to the president’s election campaign, worked for the same law firm as Giuliani and was personally interviewed by Trump before being tapped as U.S. attorney. But he won over some skeptics after overseeing numerous prosecutions and investigations with ties to Trump. Though Berman is said to be unclear about the exact reason he was fired, people familiar with his thinking said his job had always seemed in jeopardy and he never had the sense it was secure. Among the most high profile investigations he was overseeing was into Giuliani’s business dealings, including whether he failed to register as a foreign agent. Charges in the case do not appear imminent, according to people familiar with the matter. They were not authorized to discuss the investigation publicly and spoke on the condition of anonymity. The Southern District has also prosecuted a number of Trump associates, including Trump’s former personal lawyer and fixer Michael Cohen, who served a prison sentence for lying to Congress and campaign finance crimes. Cohen was recently released from a federal prison to continue serving his sentence on home confinement over coronavirus concerns. Berman has overseen the prosecution of two Florida businessmen, Lev Parnas and Igor Fruman, who were associates of Giuliani and tied to the Ukraine impeachment investigation. The men were charged in October with federal campaign finance violations, including hiding the origin of a $325,000 donation to a group supporting Trump’s reelection. Under Berman’s tenure, his office also brought charges against Michael Avenatti, the combative lawyer who gained fame by representing porn actress Stormy Daniels in lawsuits involving Trump. Avenatti was convicted in February of trying to extort Nike after prosecutors said he threatened to use his media access to hurt Nike’s reputation and stock price NKE, +0.97% unless the sportswear giant paid him up to $25 million."}]}