{"article": [{"url": "https://www.marketwatch.com/story/remember-covid-19s-animal-origins-vital-biodiversity-and-wildlife-are-disappearing-at-an-alarming-rate-2020-09-10", "published": 1599921140.0, "headline": "COVID-19's animal origins remind us that biodiversity and wildlife are disappearing at an alarming rate", "body": "In the last 50 years, Earth has been transformed by an explosion in global trade, consumption and human population growth, which has promoted urbanization and lifted many out of poverty. But there's a cost to progress: a dangerous loss of biodiversity and depletion of the animal kingdom. That loss is ultimately a human cost, evidenced right now in 2020's dominant headlines: wildfires, locust plagues and the deadly COVID-19 pandemic. Read:'Still no sign of the sun': Dense smoke from wildfires causes dark, orange skies over West The Living Planet Index, which tracks some 4,000 species of vertebrates, suggests that increasing deforestation and agricultural expansion were the key drivers behind a 68% average decline in animal populations between 1970 and 2016. 2020's Living Planet Report, a collaboration between World Wildlife Fund International and the Zoological Society of London, is the 13th edition of the biennial release that tracks wildlife populations around the world. World Wildlife Fund International and Zoological Society of London The links between biodiversity and health are diverse, from traditional medicines and pharmaceuticals derived from plants to water filtration by wetlands. Key benefits are gained from a distinct habitat separation between wild species and humans in order to contain disease spread. What's more, biodiversity will be key to feeding the planet of the future. Up until 1970, the human ecological footprint was smaller than the Earth's ability to regenerate resources, but the WWF now calculates that mankind is over-using the planet's capacity by more than half. Factors impacting regeneration include invasive species and pollution, but the biggest single driver of wild species loss is land-use changes, such as forests or grasslands being converted into farms, the researchers argue. In the ocean, 75% of fish stocks are over exploited, according to the index.COVID-19 connection An animal-to-human infection is behind the COVID-19 pandemic, most researchers says, stirring increased concern that lost biodiversity brings a clash between humans and animals that can have dire consequences. \"COVID-19 is nature sending us a message. In fact, it reads like an SOS signal for the human enterprise, bringing into sharp focus the need to live within the planet's 'safe operating space.' The environmental, health and economic consequences of failing to do so are disastrous,\" the scientists warned in the summary of their report. World Wildlife Fund International and Zoological Society of London The Centers for Disease Control and Prevention estimates that three out of every four new or emerging infectious diseases in people come from animals. Most scientists see a link between deforestation/habitat change and pandemics, while cultural cuisine choices, Chinese wet markets for instance, have featured in the discussion as well. There are regional differences worth noting. The index shows that the tropical regions of Central and South America had seen a 94% fall in species since 1970. There is a chance for reversal, however, if action is taken. The scientific groups are well into a program they've designed aimed at \"bending the curve\" to limit biodiversity and species loss: 1. An increased conservation effort scenario that has included an increase in the extent and management of protected areas, and increased restoration and landscape-level conservation planning; 2. The more sustainable production (supply-side efforts) scenario including higher and more sustainable increases in both agricultural productivity and trade of agricultural goods; 3. The more sustainable consumption (demand-side efforts) scenario focusing on reduced waste of agricultural goods from field to fork and a diet shift to a lower share of animal calories in high meat-consuming countries. The scientists also emphasized the increased impact of combining these efforts, with much greater likely outcomes. \"The Bending the Curve modelling tells us that, with transformational change, we can turn the tide of biodiversity loss. It is easy to talk about transformational change, but how will we, living in our complex, highly connected modern society, make it a reality? We know that it will take a global, collective effort; that increased conservation efforts are key, along with changes in how we produce and consume our food and energy,\" WWF and the Zoological Society of London said. \"Citizens, governments and business leaders around the globe will need to be part of a movement for change with a scale, urgency and ambition never seen before.\" World Wildlife Fund International and Zoological Society of London U.S., Russia, China among nations tagged to lead In separate research, Greg Asner of Arizona State University and conservation biologist and strategist Eric Dinerstein and colleagues, suggest that action by key industrial and industrializing areas could be vital to shoring up all of Earth's biodiversity. By setting aside half of Earth's lands for nature, nations can save our planet's rich biodiversity, prevent future pandemics and meet the Paris climate target of keeping warming in this century below less than 2.7 degrees F (1.5 degrees C), they suggest. To meet these goals, 20 countries must contribute disproportionately. Much of the responsibility falls to Russia, the U.S., Brazil, Indonesia, Canada, Australia and China. Why? Because these countries contain massive tracts of land needed to reach the dual goals of reducing climate change and saving biodiversity, the scientists said."}]}