{"article": [{"url": "https://www.marketwatch.com/story/powell-says-economic-activity-far-below-pre-pandemic-levels-despite-modest-rebound-in-some-areas-2020-06-16", "published": 1592380760.0, "headline": "Powell says economic activity far below pre-pandemic levels despite 'modest rebound' in some areas", "body": "Federal Reserve Chairman Jerome Powell on Tuesday suggested investors shouldn't overreact to surprisingly good economic data like the May retail sales report. In testimony prepared for the Senate Banking Committee, Powell acknowledged some economic indicators have pointed to a stabilization in activity and others have even suggested \"a modest rebound.\" Live blog:Fed Chairman Powell testifies before Senate on economic outlook \"That said, the levels of output and employment remain far below their pre-pandemic levels, and significant uncertainty remains about the timing and strength of the recovery,\" Powell said. The Fed chairman said until the coronavirus disease is contained, a full recovery is unlikely. U.S. equity indexes DJIA, +0.56%  SPX, +0.87%  jumped on Tuesday in part after the government reported retail sales surged a record 17.7% in May. But the level of sales remains below February's pre-pandemic level. The U.S. regained 2.5 million jobs in May and the unemployment rate fell to 13.3%, confounding Wall Street expectations for another big wave of layoffs. Stocks had fallen last week with some analysts blaming Powell for a grim outlook at his press conference. The Fed announced last week that it would keep buying Treasurys and agency-backed mortgage securities. The central bank's balance sheet has swelled by $3 trillion since early March, mainly from these purchases. The Fed has also set up 11 lending programs to get credit flowing in all corners of the financial markets, including corporate bonds. When a few Senators expressed concern with the Fed's asset purchases, Powell tried to mollify them. Sen Pat Toomey, a Republican of Pennsylvania, said the Fed's corporate bond purchases were unnecessary and were distorting market signals. \"I don't see us as wanting to run through the bond market like an elephant...snuffing out price signals and things like that,\" Powell said. \"We just want to be there if things turn bad for the economy,\" he added. Read:Dovish Fed to continue asset purchases Later, Powell said the central bank wasn't buying asset to make it easier for the U.S. Treasury Department to sell the increased debt. This is known as \"monetizing the debt.\" \"That is certainly not our intention,\" Powell replied. The Fed's asset purchases were needed because financial markets stopped working when investors all decided to move to cash. \"It wasn't in any way about meeting Treasurys supply. We really don't think of that,\" he said, adding there is a lot of demand for Treasurys. Economists think the indicators could show a strong rebound in May and June but then the economy might falter. \"The early part[s] of this recovery are going to be in a way easy because they are coming off such low levels,\" and this might last through July, said Mike Feroli, chief U.S. economist at J.P. Morgan Chase. \"After that, the story gets a little more interesting,\" Feroli added. In his testimony, Powell said he thought the economy would go through three stages. The first stage was the shutdown with a sharp drop in activity and that may end at the end of June. The second part will be the \"bounceback\" with people going back to work. \"We're seeing apparently the beginning of that,\" Powell said. The third stage will be the economy \"well short\" of the pre-pandemic level in February. \"Much of that economic uncertainty comes from the uncertainty about the path of the disease and the effects of measures to contain it,\" Powell said. He said the Fed was committed to using its full range of tools to assure the recovery from the recession will be as robust as possible. Powell did not say Congress needed to pass another emergency funding package to help the economy but he gently pushed lawmakers, saying more spending \"can make a critical difference not just in helping families and businesses in a time of need, but also in limiting long-lasting damage to our economy.\" Several Democrats pressed Powell on the issue of inequality. Asked if the Fed was responsible for unequal outcomes for black people, Powell said everyone could do more. The central bank would be looking for ways to do just that, he added."}]}