{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-slashes-deal-making-globally-what-to-expect-next-2020-07-13", "published": 1594725740.0, "headline": "Coronavirus slashes deal-making globally: What to expect next", "body": "The “art” of deal-making has become a pretty tough sell this year. Rainmakers in the global mergers-and-acquisitions business saw the tally of completed deals plunge to $1.11 trillion in the year’s first six months — about half of the volume seen during the same period of 2019 — for the worst first half in at least 15 years, according to Dealogic data. After all, how does one go about buying or selling a company after a pandemic has littered the globe with shuttered businesses, travel bans and uncertainty? Harris Arch, DuPont Capital Management’s lead portfolio manager for the firm’s merger arbitrage strategy, said that even though the sharp, mid-March credit freeze has passed and the reality of negative corporate earnings has sunk in, the pandemic still means challenges when it comes to the M&A basics. ”We’ve heard from bankers, on calls, of due diligence being conducted by drones,” Arch told MarketWatch, referring to the typical process whereby interested buyers would go out and “kick the tires” of a prospective business before making any offers. Now it’s become yet another task taking place in the virtual world. And for transactions that get beyond the “browsing” phase to an actual agreement, parties have been boning up on what events could morph into deal-breakers in the months before a transaction can be completed, Arch said, including adding specifics around COVID-19 fallout, not just generic warnings of a “pandemic,” that could materially impact a business. In other words, after several high-profile transactions fell apart, the new playbook means thinking about the unthinkable. L Brands Inc. LB, -0.98% and Sycamore Partners in May agreed to walk away from their pre-COVID plans to take Victoria’s Secret private, after the lingerie seller shut its U.S. stores and furloughed many of its workers in March in response to the pandemic. More recently, Simon Property Group Inc. SPG, -3.35% in June said it was ending its deal to buy a fellow real-estate investment trust Taubman Centers Inc. TCO, +0.88%, claiming in court that there was a breach by Taubman in terms of its failure to mitigate the pandemic’s impact. Taubman’s lawyers responded in court, saying that Simon knew “a pandemic was raging in the world,” and called the breakup “a classic case of buyer’s remorse.” “ ‘Unlike in 2008 and 2009, there was a lot of pretend and extend. Here, there is no pretend. There’s just extend.’ ” — Cynthia Romano, a global director at CohnReznick Advisory The companies involved in those deals either didn’t respond for a request for comment, or declined to comment beyond what already was in the public realm, for this report. Neil Hennessy, chief investment officer of mutual-fund operator Hennessy Funds HFCSX, -0.17% of Novato, Calif., said there is more to getting the numbers to line up right when merging, buying or selling companies. While he said Zoom videoconferences can offer an alternative to conducting business mostly by phone or email during the pandemic, he also thinks they are a poor substitute for sitting across the table with someone when negotiations heat up. M&A has been a big part of the mutual-funds industry for several years, particularly as firms have looked to grow scale to compete with the “mega managers.” Hennessy doesn’t expect the coronavirus pandemic to slow that trend overall, but he does look forward to the return of in-person meetings to better hash out what partnerships might be possible. “I like to get a sense of who I’m dealing with,” he told MarketWatch. An upward surge in cases in California prompted Gov. Gavin Newsom on Monday to order every county in the state — the nation’s largest economy — to shutter bars, indoor dining, movie theaters and wineries. Major U.S. stock benchmarks were mixed Tuesday, with the Nasdaq Composite Index COMP, +1.39% trading lower and the S&P 500 index SPX, +0.87% up slightly as big banks kicked off earnings season. Meanwhile, Mergermarket, an industry news and data service, pointed to a surge in “second thoughts” among active buyers and sellers in the U.S. market in the year’s first half, tracking $77.3 billion worth of deals that either were withdrawn or terminated in total. Their summary of M&A in the year’s first half described a “bleak environment” for deal makers that rivaled the wake of the 2007-’08 global financial crisis, but also said there have been more recent signs of thawing. Clearly, the COVID crisis didn’t start within the banking system, as did the last crash. And this time around, the response from regulators has been to help prevent a cycle of defaults, layoffs and fire sales. Coronavirus update:Global case tally edges toward 13 million, and Florida trounces one-day case record set by California last week “Unlike in 2008 and 2009, there was a lot of pretend and extend,” said Cynthia Romano, a global director in CohnReznick Advisory’s restructuring and dispute-resolution group. “Here, there is no pretend. There’s just extend.” Specifically, Romano said banks, with the blessing of regulators, since March have been offering most companies a series of 90-day debt extensions. “On the distress side, everybody is gearing up,” she said. “But it’s probably the third quarter or fourth quarter when the conversations start to happen about what lenders want to do.” In March, the Federal Reserve also announced a more-than-$2 trillion raft of emergency lending facilities to keep credit flowing through the financial system during the pandemic. The injections not only calmed debt and equity markets, but also led to record corporate borrowing sprees by investment-grade and “junk-rated” companies racing to stash away cash for lean times ahead. Notably, on the equity side there also has been some recent M&A activity, such as Uber Technology Inc.’s UBER, -0.18% $2.65 billion all-stock purchase of Postmates Inc, a food-delivery service. Read: Uber bets on delivery with $2.65 billion acquisition of Postmates as ride-hailing stalls Jonathan Knee, a senior adviser at Evercore, which focuses on M&A and restructurings, and a professor at Columbia Business School, sees three main areas where M&A has continued and could hit an upswing. Distressed situations, particularly where there have been liquidity problems, have led to some deals, he said. But companies with high public-market valuations through the pandemic also have been buyers. And stock-for-stock discussions have been happening as companies focus on core business lines. “There’s nothing like a crisis to make you focus on what’s important in life,” he told MarketWatch. “That’s true for people and companies.” Knee still expects there to be challenges ahead. “When you are not able to tell your board with confidence what your own results are going to be for the year, it’s very hard to pound the table to make an acquisition of somebody else,” he said."}]}