{"article": [{"url": "https://www.marketwatch.com/story/moderna-stock-rally-fades-as-analysts-weigh-in-on-what-us-government-supply-deal-means-for-covid-19-vaccine-pricing-2020-08-12", "published": 1597301240.0, "headline": "Moderna stock rally fades as analysts weigh in on what U.S. government supply deal means for COVID-19 vaccine pricing", "body": "The rally in Moderna Inc. shares sparked by news late Tuesday that the U.S. government has ordered 100 million doses of its COVID-19 vaccine candidate dissipated on Wednesday, as analysts weighed in on what the order means for pricing. Moderna MRNA, +0.09% is widely viewed as a front-runner in the race to develop a COVID-19 vaccine as it is currently enrolling patients for a Phase 3 trial, after a Phase 1 trial produced neutralizing antibodies — thought to be a key benchmark for an effective coronavirus vaccine — in all 45 participants. The government agreed to pay the biotech $1.525 billion including incentive payments, and has an option to purchase an additional 400 million doses of the vaccine. That bring’s the government’s total commitment to Moderna to $2.48 billion, or $15.50 a dose. SVB Leerink analysts said that is “materially below” their model of $22 a dose, and below the implied price in the supply agreement that Pfizer Inc. PFE, -0.27% and its partner BioNTech SE BNTX, +1.23% have with the government of $19.50 a dose. See now:Race for a COVID-19 vaccine has drug makers scaling up manufacturing — before one is developed Because the Moderna award includes incentive payments for timely delivery, some part of that pricing would be at risk if Moderna were to fail to secure emergency use authorization (EUA) of biologics license application approvals by Jan. 31 of 2021, the Leerink analysts wrote in a note to clients. However, “we see EUA by this time horizon as likely, given the flexibility of U.S. and global regulatory bodies concerning SARS-CoV-2 vaccine candidates, though it does introduce an element of downside risk should Moderna see delays in clinical trial execution or disappointing interim data from their ongoing Phase 3 study later this year,” said the note. The lower price point and risk-sharing with the US government are more evidence of the competitive pressure building in the COVID-19 vaccine market, which is driving price erosion, they wrote. It is also consistent with comments from Moderna that larger government contracts would be priced materially lower than the $32-37/ dose disclosed for initial supply agreements at smaller volumes. Read also:This Seattle man volunteered to be injected with an experimental COVID-19 vaccine: ‘It was kind of my duty as a healthy individual to step up’ While the decision to offer a discount is rational in the competitive landscape — and appropriate given the amount of government funding going toward vaccine development—“we continue to see more downside than upside risks to our base assumptions for the stock,” the analysts wrote. Leerink was expecting the stock to behave as it did, trading up initially, despite the negative implications for pricing. The company rates the stock as market perform and has a stock price target of $58 to $60, which is below its current price of around $69. The stock was last up just 0.3%, but has gained more than 250% in the year to date, causing its market capitalization to balloon to above $27 billion from about $6.90 billion at end-January, before the pandemic broke out across the world. The stock has handily outperformed the iShares Nasdaq Biotech ETF IBB, +0.81%, which is up 11% in the year to date, and the S&P 500 SPX, +0.87%, which has gained 4.7%. Don’t miss:Dr. Osterholm: Americans will be living with the coronavirus for decades Moderna, which was founded in 2010, is considered a preclinical company because it doesn’t market any approved medical products. “As we pivot to a commercial-stage company, we recognize the need for responsible pricing in the face of the pandemic,” CEO Stephane Bancel said in an early August update on the company’s Phase 3 trial of the vaccine. Moderna expects to complete enrollment for the pivotal Phase 3 trial in September. Morgan Stanley analyst Matthew Harrison said the price per dose of the Moderna vaccine would rise to about $25, once funding from BARDA is included. BARDA, or the Biomedical Advanced Research and Development Authority, is a division of the Department of Health and Human Services, and the National Institute of Allergy and Infectious Diseases, or NIAID, a division of the National Institutes of Health. BARDA granted Moderna $483 million in April to support its vaccine development program and followed up in July with another $472 million. Morgan Stanley rates the stock as overweight with a $90 price target that is 30% above its current level. Chardan Global Insights said the investment leaves the Moderna vaccine “at the top of the range of disclosed agreements, and above our expectations of “mid-high teens” pricing. “We now await visibility on what agreements with other countries might look like but see the news as a positive signal re: Moderna’s potential entry into a commercial space often dominated by big-cap,” analysts led by Geulah Livshits wrote in a note. See now:Dr. Fauci recommends wearing goggles to prevent catching the coronavirus"}]}