{"article": [{"url": "https://www.marketwatch.com/story/gold-futures-trade-higher-for-day-poised-for-modest-weekly-gain-2020-09-18", "published": 1600438460.0, "headline": "Gold futures tally a second straight weekly gain", "body": "Gold futures finished on Friday to tally a second weekly gain in a row, though prices only scored a modest boost from Federal Reserve policy that signaled a lower-for-longer path for interest rates for the next three to four years. “Bullion is waiting for new market drivers, as investors seem to have fully priced in the current scenario and the hyper-expansive monetary policies of central banks,” wrote Carlo Alberto De Casa, chief analyst at ActivTrades in a research note on Friday. December gold GCZ20, +2.17% GC00, +2.17% rose $12.20, or 0.6%, to settle at $1,962.10 an ounce, following a 1.1% slide on Thursday. December silver SIZ20, +5.96% SI00, +5.96% added 3 cents, or 0.1% to finish at $27.129 an ounce, following a 1.4% drop in the previous session. For the week, gold notched a weekly gain of 0.7%, following a similar climb the week before, and silver futures saw a 1% advance from last Friday’s settlement, according to FactSet data. Gold prices added to earlier gains after the August leading economic index data from the Conference Board revealed a rise of 1.2% in August, lower than the revised 2% climb in July—suggesting a slowdown in the economic rebound. The September preliminary reading of the University of Michigan’s U.S. consumer sentiment index, which stood at 78.9, was up from 74.1 the prior month. Monetary policy changes were expected to hold a potential fresh catalyst for gold and silver but the precious metal has failed to see a spark from the Federal Reserve’s decision on Wednesday to keep its policy interest rate near zero at least through the end of 2023 to help the economy recover from the coronavirus pandemic. The Fed’s forecasts for 2023, released for the first time, also show the rate staying near zero from now until at least 2024. Trade for both gold and silver has been mostly range-bound since a burst higher back in July, fostering some concerns that the bullish trend for the precious metals, which has been supported by the economic uncertainty created by the COVID-19 pandemic, may be losing some steam. Some strategists argue that price moves for gold and silver off central bank news were already factored as they have been mostly telegraphed by the likes of the Fed and other global monetary policy makers. A note from technical analysts at SentimenTrader indicates that there are some bearish patterns forming in metals that usually are followed by a retreat in prices, but the analysts at the research platform acknowledge there is nothing definitive about the outlook for the commodities in recent trade. “After a spike in July, precious metals have calmed down and mostly swung sideways,” wrote the SentimenTrader analysts. “Some bullish traders see this as a consolidation pattern before gold and silver surge to new highs,” they said. Meanwhile, copper futures marked their highest settlement since June 2018. The December HGZ20, +1.38% rose 5 cents, or 1.5%, to settle at $3.116 a pound, the highest for a most-active contract in over two years, according to FactSet data. Copper logged a weekly rise of around 2.5%. The industrial metal has found support from “both a weaker U.S. dollar and after Chinese industrial production data topped expectations” when they were released earlier this week,” said Fawad Razaqzada, market analyst at ThinkMarkets, in a Friday note. Round out action on Comex, October platinum PLV20, +3.99% settled at $938.50 an ounce, up 0.8% for the session, paring the weekly loss to about 0.1%. December palladium PAZ20, +2.31% climbed almost 2% to $2,380.80 an ounce, contributing to a gain of nearly 2.2% for the week."}]}