{"article": [{"url": "https://www.marketwatch.com/story/us-poverty-rate-fell-to-record-low-in-2019-but-the-coronavirus-is-reversing-the-gains-2020-09-15", "published": 1600187360.0, "headline": "U.S. poverty rate fell to record low in 2019 but the coronavirus is reversing the gains", "body": "The share of Americans living in poverty in 2019 fell for the fifth year in a row and dropped to the lowest level on record, but all the gains in recent years are being jeopardized by the widespread economic devastation caused by the coronavirus pandemic. The poverty rate slid to 10.5% last year from 11.8% in 2018, the U.S. Census Bureau said Tuesday, marking the lowest level since the government began publishing the data in 1959. The poverty rate had been as high as 14.8% as recently as 2014. The number of Americans living in poverty sank by 4.2 million to 34 million last year. The coronavirus has thrown millions of Americans out of work and reversed recent gains fighting poverty. Getty Images Incomes also rose sharply and the number of people lacking health insurance fell, broad improvements that stemmed from steady hiring, a tumbling unemployment rate, and the longest economic expansion in U.S. history. The 11-year expansion ended in March when the coronvirus epidemic erupted. All major groups saw notable declines in poverty. The poverty rate fell by 2.8 points last year to 7.3% for Asian Americans, by 1.0 point to 9.1% for whites, by 1.8 points to 15.7% for Hispanic Americans and by 2 points to 18.8% for Blacks. The poverty rate for children also slipped to 14.4% from 16.2%. A separate measure of poverty that takes into account government aid for the poor and certain critical expenses showed the poverty rate in 2019 was somewhat higher at 11.7%. Still, that’s the lowest reading since the Census began reporting the “supplemental” poverty rate in 2009. Some and perhaps most of the gains in the past five years, however, are in danger of being reversed by the coronavirus pandemic. The viral outbreak has thrown tens of millions of people out of work. The government’s monthly scorecard for the U.S. labor market shows 13.6 million are unemployed. And an even larger 29 million people are collecting benefits though state and federal unemployment programs. Economists say it will take several years or longer to make up all the ground lost in the past six months alone. The pandemic also made it harder for the Census to conduct is annual survey of poverty. The response rate to its telephone interviews was about 10 percentage points lower than normal, potentially making its 2019 report somewhat less accurate. Read:Jobless claims rise fourth straight week in sign of stalling labor market Median household income, adjusted for inflation, also improved in 2019 after being nearly stagnant the year before. It jumped 6.8% to $68,703 from a revised $64,324 in 2018. The inflation-adjusted median income of all workers increased by a smaller 1.4%. The number of people without health insurance also fell slightly to 26.1 million from 27.5 million in the prior year, reflecting an improved economy. About 8% of the population did not have health insurance at any point during 2019. More than two-thirds of Americans relied on private health insurance. A little over 34% received their insurance from the government. What might keep more Americans from falling back into poverty, at least temporarily, are massive government benefits for the unemployed. Yet those benefits could run out unless a stalemated Congress agrees to another aid package. Democrats and Republicans are deadlocked on how much to spend and where the money should go."}]}