{"article": [{"url": "https://www.marketwatch.com/story/republicans-and-democrats-are-split-over-whether-estate-and-income-taxes-are-unfair-2020-08-17", "published": 1597756640.0, "headline": "Republicans and Democrats are split over whether estate and income taxes are 'unfair'", "body": "Talk of tax rates and big-picture economic efficiencies may quickly glaze over plenty of eyes. But when you talk about tax rates and someone's fair share, you're likely get plenty of people fired up. There are several different ways to think about tax policy, but a new study suggests many Americans view the topic of taxation through the lens of fairness. That could be helpful context for viewers as the Democratic and Republican national conventions approach and talk of taxes and economy recovery from the coronavirus will surely be a theme. The shared feelings about fairness is good news for a deeply-divided country. The bad news is, there's a deep divide on what counts as fair when it comes to income taxes and estate taxes. “ 'While everyone cares about fairness, the meaning of this concept greatly differs across respondents: fairness truly is in the eye of the beholder.' ” - Harvard University Professor of Economics Stefanie Stantcheva. \"'Fairness' is highly-mentioned and evenly distributed across the political spectrum,\" wrote Harvard University economist Stefanie Stantcheva. \"But while everyone cares about fairness, the meaning of this concept greatly differs across respondents: fairness truly is in the eye of the beholder.\" Two different profiles of taxpayers emerge, Stantcheva said, working off two 2019 surveys, each with more than 2,000 participants. (The economist conducted the survey two years after President Donald Trump enacted tax cuts that lowered the rates for most income brackets and lowered the corporate tax rate.) Don't miss:This is how much American workers saved during the first year after Trump tax overhaul On income taxes, one profile typically says the tax code is unfair, adding that money in the country should be more evenly distributed. The other doesn't think the tax code is unfair or that inequality is a serious problem. Republican affiliation was the strongest predictor for someone to fall into the second profile, she said. As for estate taxes, one group of taxpayers didn't worry about the personal effects on them and their family - but they were worried about rich-poor divides when thinking about the tax. The other side thought most people were being wronged by estate taxes, which they viewed as unfair. Again, Republican affiliation was the strongest predictor for fitting the second profile, Stantcheva said. Using open-ended questions and word clouds, Democrats' key words about income taxes touched on words and phrases like \"fair share,\" \"rich,\" \"lower class,\" \"middle class,\" \"tax wealthy\" and \"loopholes.\" Republicans focused on phrases like \"hard work\" or phrases that referenced government spending and waste. “ Democrats used words like \"middle class\" and \"rich\" when talking about estate taxes, while Republicans used words like \"already taxed/paid\" and \"grieve.\" ” On estate taxes, Democrats' key words included \"middle class\" and \"rich.\" But Republicans focused on phrases like \"already taxed/paid,\" and words capturing the personal effect, like \"grieve\" or \"bury.\" Under the Trump 2017 tax overhaul, the 40% federal estate tax starts at estates valued above $11.4 million and $22.8 million for couples. In 2026, it reverts back to 2017's exclusion of estates under $5 million, adjusted for inflation. Americans have been linking taxes with fairness since before they were Americans: Patrick Henry's 1765 argument of \"no taxation without representation\" became a rallying cry for the 13 colonies. Meanwhile, well over 90% of taxpayers have consistently told the Internal Revenue Service that every American has a civic duty to pay taxes, according to the tax collector's annual data. But the study, circulated Monday by the National Bureau of Economic Research, lands just ahead of the Democratic National Convention. Joe Biden, the former vice president under Barack Obama and presumptive Democratic nominee, wants to increase the top income bracket from 37% to 39.6%, the Obama-era rate. He wants to raise the corporate income rate from 21% to 28%, which is underneath the 35% Obama-era rate. He would put the estate tax rate exemption at \"historical norms\" and get rid of the \"step up in basis\", where an asset's value resets in tax purposes when an heir receives it. On Biden's own website, he says he'll bring on economic recovery with programs and funds that come by \"reversing some of Trump's tax cuts for corporations and imposing common-sense tax reforms that finally make sure the wealthiest Americans pay their fair share.\" On the other side of the aisle, Trump has floated the idea of fewer taxes on capital gains and an income tax cut for the middle class. \"We are looking at expanding the cuts that we have already done, but specifically for middle -income families, and you will be hearing about that in the upcoming few weeks,\" Trump said at a news conference last week. Earlier this month, he signed an executive order that would defer the payroll tax that employees have to pay, beginning in Sept. 1 and ending Dec. 31. The tax helps fund Social Security and the payroll tax deferral has critics on both sides. Biden says the payroll tax should be applied to people making more than $400,000. Right now, the tax exemption starts for people making $137,700."}]}