{"article": [{"url": "https://www.marketwatch.com/story/dont-assume-this-stock-market-value-rotation-will-stick-j-p-morgan-says-11597160307", "published": 1597146380.0, "headline": "Don't assume this stock-market value rotation will stick, J.P.Morgan says", "body": "Is it a full-blown rotation or just a little shimmy? Getty Images for Bustle Is the rotation for real? In recent trading sessions, investors have moved toward beaten-down stocks in sectors that only stand to gain if an economic recovery is truly underway, and away from the pricey tech names that have flown high all year. Many observers believe that shift - a so-called value rotation - is finally at hand, signaling that markets have confidence in the durability of the recovery. Not J.P.Morgan equity analysts. \"Within our medium term preference for Growth and Defensives, we argued that any rebound in Value style, such as the one we called for on 18th May due to the expected PMI rebound, will not be able to sustain beyond a few weeks\" wrote the team,  led by Mislav Matejka, in a Sunday research note. The rotation head fakes that characterize the recovery from the March market mayhem are familiar to many investors, but Matejka and his team note that the last rotation that lasted longer than just a few weeks was in 2016-2017, a very different economic and market backdrop than the current moment. At that time, they write, U.S. bond yields surged - it was called the \"reflation trade\" - taking the 10-year Treasury note TMUBMUSD10Y, 0.777% from 1.5% to 3.2%. The dollar was declining, China was stimulating its economy, the global economic landscape was brightening, and tax cuts - not increases - were on the horizon. \"These catalysts, rather than the extreme positioning or cheap valuations, facilitated the rotation,\" the analysts write. \"The latter are never enough.\" It may go without saying that conditions could hardly be more different now. Tax increases seem more likely than cuts. Bond yields are \"stuck in a range,\" in the words of the J.P.Morgan analysts, and if anything seem more likely to deflate than rise. They also believe that the dollar may not weaken further, although some analysts disagree. China is being cautious with its stimulus - and an added wrinkle that didn't exist back in 2016-2017 is the rising trade tensions between it and the U.S. \"For these reasons, among other, we held a view that market leadership will be Growth and Defensives driven this year, both in the selloff and in the subsequent market recovery, beyond a few tactical Value snapbacks,\" they write. Time will tell if the current moment is such a \"snapback,\" or a more enduring transition. As of Tuesday, the Dow Jones Industrial Average DJIA, +0.56% had gained nearly 8% in the month to date, the S&P 500 SPX, +0.87% was up nearly 6% - and the tech-heavy Nasdaq Composite COMP, +1.39% index, which had seemed indestructible through most of 2020, was up only 2.6%. All were trounced by the Russell 2000 RUT, +0.55%, an index of smaller company stocks. See: 'The stock market no longer thinks it needs the economy if it has the Fed,' David Rosenberg says"}]}