{"article": [{"url": "https://www.marketwatch.com/story/ubers-abandonment-of-grubhub-deal-is-a-clear-negative-analysts-say-2020-06-11", "published": 1591885160.0, "headline": "'What a lost opportunity': Uber's abandonment of GrubHub deal is a 'clear negative,' analysts say", "body": "The food-delivery landscape is getting a shakeup, but not in the way investors had been expecting over the past few weeks. European player Just Eat Takeaway.com N.V. JET, +1.22%  TKWY, +1.00%  confirmed Wednesday afternoon that it would be acquiring GrubHub Inc. GRUB, +0.83%  in an all-stock deal. Uber Technologies Inc. UBER, -0.18%  was thought to be close to its own deal for GrubHub recently, but the ride-hailing giant reportedly backed away due to the potential for antitrust opposition to the combination. Opinion: Uber plus Grubhub called 'a new low in pandemic profiteering,' and that's not the only problem Analysts mostly agreed that missing out on a GrubHub deal was unfortunate for Uber, even though some saw a few silver linings. \"Uber walking away at the altar from the GrubHub deal is a clear negative as competition and pricing pressure will be fierce going forward,\" Wedbush analysts Daniel Ives and Ygal Arounian. \"GrubHub being acquired by a larger competitor will only embolden the market-share battle just at the same time that the regulatory environment around delivery fees across cities is becoming a larger headwind.\" They continue to rate Uber's stock at outperform with a $47 price target. Deutsche Bank's Lloyd Walmsley also wrote that the lack of an Uber-GrubHub deal is a \"clear negative\" for Uber that will slow down \"what looked likely to be a fast-track towards rationalization in the market and path towards profitability.\" \"What a lost opportunity,\" he said in his note to clients. At the same time, he wrote that he spoke with Uber's investor relations team after the Just Eat Takeaway.com announcement took place and \"came away with a better understanding for their rationale and some confidence that this is mostly a bump in the road.\" He wrote that in his view, Uber's inability to reach a deal with GrubHub seemed to hinge on more than just disputes about a reverse break-up fee. Other concerns may have included \"unsavory tactics at GrubHub that might have to be discontinued\" and \"marketplace fee caps in NYC and elsewhere that could ultimately get made permanent,\" he argued. Walmsley rates Uber shares a buy with a $40 price target. Todd Holman, a director at Union Square Advisors, said that for Uber Eats and Doordash, GrubHub's tie up with a well-funded European player is \"if not the worst case scenario, one they don't want to wake up and see.\" Consolidation to only two major players would've allowed those two companies to focus on the cities where they were already best positioned and then \"really begin to crank on profitability,\" he told MarketWatch. GrubHub seemed to be letting up on some of its marketing efforts in recent months in an attempt to control spending, but Just Eat Takeaway is \"much better prepared an willing to continue this market-share battle.\" MKM Partners analyst Rohit Kulkarni called the GrubHub-Just Eat merger a \"a marginal negative for Uber shares over the near-term as we think this was a lost opportunity to become a market share leader in the U.S.,\" though he still sees a window for Uber Eats to grow its share over the next year as the GrubHub's new merger arrangement \"goes through the digestion process.\" He rates Uber shares a buy with a $38 target price. Opinion: IBM, Amazon moves on facial recognition are good baby steps toward removing bias Bernstein's Mark Shmulik was more mixed on the situation. \"Our confidence in Uber management continues to grow,\" he wrote. \"We didn't want to see Uber overpay for GrubHub, particularly given uncertainty around how regulators would respond to the deal, and we're happy to see that management stood its ground.\" Shmulik said that Just Eat's offer \"feels expensive\" given that it and GrubHub operate in different geographies, limiting the opportunity for obvious synergies. Still, he's concerned that this deal won't lead to rationalization in the food-delivery industry like there could have been if Uber or a different U.S. player chose to purchase GrubHub. \"It's unlikely that Just Eat would be happy buying the #3 player in the US without wanting to gain share - a new player stepping in is probably bad for competition,\" he wrote, while reiterating an outperform rating and $35 target price on Uber's stock. Uber shares are down about 8% in Thursday trading, while Lyft Inc.'s stock LYFT, +2.16%  is off roughly 6%. Both companies were dealt a blow to their business models late Wednesday after the California Public Utilities Commission said that ride-sharing drivers were to be classified as employees under the state's new law governing gig-economy work. This determination is a \"real headwind to [Uber and Lyft] from a unit-economics standpoint\" and will force the companies to determine whether they should make company-wide changes to how drivers are treated or move toward a \"potential patchwork approach\" by preparing to deal with each state's potential regulations independently, Holman said. Uber's stock has added 1.6% over the past month as the S&P 500 has increased 4%."}]}