{"article": [{"url": "https://www.marketwatch.com/story/mnuchin-calls-for-extending-ppp-but-targeting-it-at-smaller-companies-and-restaurants-hotels-2020-07-17", "published": 1594994360.0, "headline": "Mnuchin backs extending PPP but targeting it at â\u0080\u0098smaller companiesâ\u0080\u0099 and restaurants, hotels, as he also talks up loan forgiveness", "body": "U.S. Treasury Secretary Steven Mnuchin on Friday signaled the Trump administration was interested in giving new life to a coronavirus aid program for small businesses but making it more targeted, as he spoke at a House hearing about what may go in Washingtonâ\u0080\u0099s next coronavirus aid package. â\u0080\u009cA next phase of relief should extend the PPP, but on a more targeted basis for smaller companies and those that are especially hard hit, such as restaurants, hotels and other travel and hospitality businesses,â\u0080\u009d Mnuchin said, referring to the Paycheck Protection Program. He also said that â\u0080\u009ccertain industries, such as construction, are recovering quickly,â\u0080\u009d but travel and retail are facing longer-term challenges. In addition, the Treasury secretary expressed some support for blanket forgiveness of smaller PPP loans, after one lawmaker asked about a proposal to forgive all such loans under $150,000. â\u0080\u009cI know one of the things weâ\u0080\u0099ll talk about is should we just have forgiveness for all the small loans. I think thatâ\u0080\u0099s something we should consider,â\u0080\u009d Mnuchin said. â\u0080\u009cWe should obviously make sure thereâ\u0080\u0099s some fraud protection.â\u0080\u009d Related:â\u0080\u0098My PPP loan allowed me to reopen, but it is not going to allow me to stay openâ\u0080\u0099 â\u0080\u0094 restaurant owner lobbies Congress for $120 billion relief fund The Democratic-run House and Republican-run Senate are on break and largely away from Washington, D.C., but lawmakers are set to return Monday and ramp up their negotiations with the Trump administration over what will go in the federal governmentâ\u0080\u0099s next big coronavirus relief package, which is now expected to become reality around early August. Mnuchinâ\u0080\u0099s comments came during a hearing held by the House Small Business Committee on the federal governmentâ\u0080\u0099s coronavirus aid programs. In another exchange with a lawmaker, the Treasury secretary appeared to suggest a communications campaign was coming to address a drop in supplies of coins due to virus lockdowns. â\u0080\u009cWe are working very closely with the Mint and the Federal Reserve on the coin shortage,â\u0080\u009d he said. â\u0080\u009cAs a result of COVID, a lot of the coinage is stuck, but we are working on a public messaging.â\u0080\u009d The PPP, which has received $670 billion in funding through Aprilâ\u0080\u0099s $484 billion relief package and Marchâ\u0080\u0099s $2.2 trillion CARES Act, has drawn criticism over how public companies scored loans, as well as over sending money to less hard-hit areas and allegedly discriminating against businesses owned by women and minorities. The program has provided about 5 million loans worth $518 billion, according to Small Business Administration data as of Thursday. U.S. stocks SPX, +0.87% DJIA, +0.56% have rallied from their March lows thanks in part to optimism around Washingtonâ\u0080\u0099s aid efforts, and the S&P 500 and Dow industrials on Friday were on track to post weekly gains."}]}