{"article": [{"url": "https://www.marketwatch.com/story/heres-how-you-can-get-foreign-citizenship-and-a-second-passport-in-as-little-as-two-years-11601480137", "published": 1601732300.0, "headline": "Here's how you can get foreign citizenship and a second passport in as little as two years", "body": "Lima, Peru iStockphoto Second passports and legal residence in other countries have long been appealing to Americans for any number of reasons. These days, that interest is rising - sharply. All over the internet you'll find resources to help you with this process, whether that means buying a passport or tracing your genealogy in hopes that a relative's original citizenship will magically descend upon you, too. Those are tried-and-true paths, for sure. But one - buying a passport - requires a minimum of $100,000. And the genealogy route is hit or miss, depending on country. There is, however, a less costly, more organic and nearly certain path: Move somewhere and gain citizenship - and a passport - via the naturalization process. That's not as difficult as it might sound. While lots of countries require that you live within their borders for a decade or longer before you can apply for citizenship, several impose a much shorter timeline of between two and five years. And as a U.S. expat who's lived in Prague now for nearly two years, I can tell you those years fly by quickly. Read: Here are the countries with the most U.S. retirees collecting Social Security So, if you've ever given consideration to securing citizenship and a second passport, here are several countries where the process of citizenship-by-naturalization is relatively quick.Argentina: 2 years You will find lots of misinformation on the internet regarding Argentina. These are the definitive requirements: â\u0080¢ Proof that you've lived continuously in Argentina for two years. â\u0080¢ Minimum age of 18.â\u0080¢ Proof of adequate income or employment.â\u0080¢ Passport.â\u0080¢ A DNI card - an Argentine residence permit.â\u0080¢ Proof of no serious criminal record. And that's it. Two short years in one of the world's truly beautiful countries and you can apply for citizenship and, thus, an Argentine passport-the 19th most powerful passport on the planet in that it gives you access to 170 countries without needing a visa. Yes, Argentina seems to face continual economic crises. Still, if your life is denominated in dollars, your lifestyle in the land of tango will be pretty sweet. Argentina allows you to hold dual nationality as an American.Peru: 2 years* The asterisk here ties to Peru's requirement that a non-Peruvian can apply for citizenship two years after taking up residence in the country. That's not hard; with the correct documents you can apply for Peruvian residence while you're visiting on a tourist visa. But it could take several months to complete the residency process. Once you've been a resident for two years, you can apply for citizenship. The necessary documents are similar to those in Argentina, but there are also requirements that you: â\u0080¢ Write an application to the president of Peru.â\u0080¢ Prove you're healthy.â\u0080¢ Can communicate in Spanish, and pass an exam about Peruvian history, culture and geography.Ecuador, Honduras, Poland, Paraguay: 3 years Ecuador demands three continuous years of residency, and if there is an interruption of more than 90 days you have to start over. Honduras shortens the requirement to two years if you are Ibero-American (from a Spanish- or Portuguese-speaking country). Poland is interesting because it's a European Union member, meaning this is perhaps the quickest path to an EU passport. You'll also need proof of a stable source of income, such as Social Security or a pension. Arguably the hardest requirement: proof - by way of official certificate - that you can speak Polish, not one of the world's easiest languages for native English speakers. Paraguay is straightforward: Live there for three years as an upstanding citizen. Read: A record number of Americans are renouncing their citizenship - here's why Brazil: 4 years Very much like Paraguay in terms of ease. Four years of continuous residence in the country is required, along with a command of Portuguese and no criminal record.Australia, Barbados, Belize, Chile, Colombia, Czech Republic, Finland, France, Ireland, Jamaica, Latvia, Mexico, Netherlands, New Zealand, Panama, Singapore, Sweden, Taiwan, Thailand, Turkey, United Kingdom, Uruguay: 5 years This is not a complete list of the five-year countries. Quite a few others impose requirements that make them less appealing (Indonesia and Japan require that you relinquish your U.S. nationality), or they're countries many might hesitate to relocate to, such as Iran, Congo or Afghanistan. Most of these countries are straightforward: five years of continuous residence. Finland requires you speak Finnish or Swedish, the Netherlands requires you're conversant in Dutch, and Thailand demands you speak Thai (again, quite a challenging language). Panama wants to know you can speak Spanish and have a basic understanding of Panamanian history, geography and politics. Read: Hot springs in January, no traffic, and universal health care - the best retirement escape you've never heard of Also: These retirees left their pricey life in Santa Cruz, Calif. - and now live on a lake in Mexico on $1,750 a month And: How this couple retired to Spain's gorgeous Andalusia region on about $40,000 a year - and you can, too This was first published by International Living - A Second Passport Without Having to Buy or Inherit It"}]}