{"article": [{"url": "https://www.marketwatch.com/story/gold-futures-inch-near-psychologically-important-1800-price-2020-06-29", "published": 1593440660.0, "headline": "Gold futures end higher, but silver declines as investors eye impact of COVID-19's rapid spread", "body": "Gold futures on Monday ended higher as evidence of a rapid spread in coronavirus cases supported buying the haven metal to start the week, but investor worries over industrial demand for silver pressured prices for the white metal. \"Lingering risks across the global risk markets and sliding sovereign yields continue pushing capital into gold,\" wrote Ipek Ozkardeskaya, senior analyst at Swissquote Bank, in a Monday research note. The death toll from the coronavirus pandemic surpassed 500,000 and infections topped 10 million over the weekend, according to data compiled by Johns Hopkins University researchers. Health and Human Services Secretary Alex Azar warned on Sunday during NBC's \"Meet the Press\" that \"the window is closing\" for the U.S. to take action to curb the virus, as he predicted rising deaths and hospitalizations in the next couple of weeks. Against the backdrop, August gold US:GCQ20  rose 90 cents, or 0.05%, to settle at $1,781.20 an ounce, after gold saw an advance of 1.6% last week, its third weekly rise in a row. Early last week, gold touched its highest level since 2012 as infections of COVID-19 accelerated. Year to date, prices based on the most-active contracts traded about 17% higher, according to data from FactSet. The dollar was up 0.1% at 97.55 in Monday dealings, as measured by the ICE U.S. Dollar Index DXY, -0.58%, while U.S. benchmark stock indexes traded broadly higher. A stronger dollar can make assets priced in the currency, like gold, less attractive to buyers using alternative monetary units. Gains in the stock market, meanwhile, can lure investors away from haven gold. Prices for the yellow metal finished off the session's high of $1,790.40. The front-month July silver US:SIN20 fell by 5 cents, or 0.3%, at $17.98 an ounce, while September silver US:SIU20 which is the most-active contract, lost 10 cents, or 0.6%, to $18.064. Silver futures tallied a climb of nearly 1.1% last week, based on the most-active contracts, according to Dow Jones Market Data. \"Silver's remarkable recovery after its vicious falls during the height of the coronavirus pandemic suggests more gains are on the way due above all to momentum buying,\" said Fawad Razaqzada, market analyst with ThinkMarkets, in a note Monday. \"And with gold also breaking out, the gray metal should get some tailwind from the yellow metal,\" he said. Both precious metals are \"finding good support from falling yields amid expectations central banks will keep their respective monetary policy stances extraordinary loose for some time yet, as they try and combat the economic slump caused by the pandemic and reduce deflationary risks.\" Low and negative interest rates \"tend to boost the appeal of noninterest-bearing precious metals as investors are forced to look for alternative investments with benchmark bond yields being so low,\" he said, adding that safe-haven demand has also been supportive. Investors now wonder \"whether industrial demand will recover quickly and stay positive in order to keep silver prices supported,\" said Razaqzada. \"With the global economy coming out of lockdown, industrial demand for the gray metal is likely to increase.\" However, \"the key risk of course is widespread lockdowns being re-introduced if there is a second wave of COVID-19 infections in parts of the worldâ\u0080¦\" Read:Silver, copper prices mark an impressive recovery from March lows Rounding out action on Comex, the most-active September copper contract US:HGU20  added 0.5% to $2.6925 a pound. October platinum PLV20, +3.99%  edged up by 1.1% to $828.20 an ounce and September palladium US:PAU20  settled at $1,933.10 an ounce, up 2%."}]}