{"article": [{"url": "https://www.marketwatch.com/story/the-market-is-tuning-out-coronavirus-so-stocks-will-head-higher-until-theres-another-reason-to-stop-one-analyst-says-2020-08-26", "published": 1598431580.0, "headline": "Stocks will head higher until thereâ\u0080\u0099s a reason, besides COVID-19, to stop, one analyst says", "body": "Itâ\u0080\u0099s the last shopping day before Jackson Hole. On Thursday, market attention will turn to the Jackson Hole conference held every year by the Kansas City Federal Reserve, with the event this time being held online rather than in the mountains, and the focus being how tolerant Federal Reserve Chairman Jerome Powell will say the central bank will be toward inflation. Michael Brown, senior market analyst at currency card provider Caxton, says markets at the moment are simply riding a wave of momentum. â\u0080\u009cThese quiet summer markets appear to have brought out the worst in some market observers â\u0080\u0094 with endless talk about dismal breadth, how medical optimism is fueling the risk rally, or even how a mere phone call between U.S. and Chinese trade negotiators has given us a few more points of upside,â\u0080\u009d he writes. â\u0080\u009cFor anyone who possesses an ounce of reason, it is clear that what the market is doing is simply following the path of least resistance. Naturally, in markets trading on near nonexistent volumes, overflowing with unprecedented amounts of stimulus, we are going to head higher, all else equal.â\u0080\u009d To spark a pullback, there would have to be a negative catalyst â\u0080\u0094 and Brown doesnâ\u0080\u0099t expect one from the coronavirus pandemic. â\u0080\u009cThe pandemic is now a â\u0080\u0098known knownâ\u0080\u0099 to investors and, barring a more significant second wave in the winter, it is difficult to envisage the market being spooked by the virus itself in a similar manner to March. Furthermore, a return to nationwide lockdowns is off the table, and the â\u0080\u0098central bank putâ\u0080\u0099 remains alive and well. It is, therefore, no surprise to see that the marketâ\u0080\u0099s sensitivity to news about infectious diseases has been in decline since March, and is now not far from its pre-pandemic levels,â\u0080\u009d he writes. That catalyst could be anything from the U.S. political landscape, to events in Belarus, to another â\u0080\u009ctrue black swan event,â\u0080\u009d he added. The buzz Salesforce.com CRM, +2.21% jumped 15% premarket, after the enterprise software maker and soon-to-be component of the Dow Jones Industrial Average more than doubled analyst estimates on earnings and hiked its sales outlook for the year. Hewlett Packard Enterprise HPE, -1.80% Â rose 7%, after the enterprise software and services provider reported fiscal third-quarter results that soundly beat Wall Street estimates. Pure Storage PSTG, -1.07% Â may drop, after the data storage companyâ\u0080\u0099s outlook disappointed investors. Urban Outfitters URBN, +0.53% Â may climb after the retailer swung to a surprise second-quarter profit. Durable-goods orders jumped 11.2% in July, the Commerce Department said, for the third gain in a row. Excluding transportation, orders rose a more modest 2.4%. Hurricane Laura is expected to strengthen into a Category 4 hurricane, the National Hurricane Center said. It is forecast to produce a â\u0080\u009clife-threateningâ\u0080\u009d storm surge, extreme winds and flash floods over eastern Texas and Louisiana later on Wednesday. Media attention continued to be divided between the Republican National Convention, where First Lady Melania Trump stated her case for keeping her husband in office, and the protests in Kenosha, Wisconsin, which continued for a third night after the shooting of a Black man by police in front of his children. Vanguard, the worldâ\u0080\u0099s second largest fund manager, is ending its presence in Hong Kong. The markets U.S. stock futures ES00, +1.13% Â YM00, +0.82% Â NQ00, +1.63% Â were mixed and suggested another sluggish day for stocks. The euro EURUSD, +0.60% Â slipped, while gold GC00, +2.17% fell. The yield on the 10-year Treasury TMUBMUSD10Y, 0.777% Â was 0.72%. The tweet Tesla TSLA, +1.89% Â Chief Executive Elon Musk is bullish â\u0080\u0094 on Mars, speculating that one day there could be an ocean on the northern part of the Red Planet. iframe.twitter-tweet { width: 100% !important; } The chart Julien Bittel, a fund manager for Pictet Asset Management, points out the disconnect between stock-market valuations and the real economy, after Tuesdayâ\u0080\u0099s report showing a slide in consumer confidence. iframe.twitter-tweet { width: 100% !important; } Random reads Xi Jinping may resurrect the â\u0080\u0098chairmanâ\u0080\u0099 title created by Mao. Soccer star Lionel Messi wants out of Barcelona and may join Manchester City. A mysterious space signal has returned â\u0080\u0094 right on schedule. Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. The emailed version will be sent out at about 7:30 a.m. Eastern."}]}