{"article": [{"url": "https://www.marketwatch.com/story/hertz-seeks-bankruptcy-court-approval-to-offer-1-billion-in-stock-but-experts-expect-equity-to-be-wiped-out-2020-06-12", "published": 1592063900.0, "headline": "Bankrupt Hertz gets approval to sell up to $1 billion in stock - but experts expect equity to be wiped out", "body": "The market dislocation wrought by the coronavirus pandemic has a poster child in Hertz Global Holdings Inc. A bankruptcy court late Friday approved Hertz's HTZ, -1.78%  request to sell up to $1 billion in stock. The car-rental company appears to be seizing on a wave of intense, speculative interest in its shares since it declared bankruptcy late last month, drowning in debt and hit hard by the global restrictions on travel designed to slow to spread of the coronavirus. Hertz stock topped a popularity chart among Robinhood app users on Friday. The selling of new shares would be \"a head scratcher,\" analysts at Credisights said in a note before the court decision. Hertz got a delisting notice this week and an even more compelling negative is \"being in chapter 11 with unsecured bonds at a very steep discount,\" the analysts said. \"Unless a genie or a lamp showed up the collateral pool, we expect the eventual equity value will be zero,\" the CreditSights analysts said. Investors eyeing Hertz might be some of the same who have been buying \"deep value 'penny-like' stocks\" on Robinhood, said Nancy Tengler, chief investment officer at Laffer Tengler Investments, also ahead of the decision. \"This is not investing. It is gambling,\" she said. \"This is for the quick buck crowd, not long-term investors,\" Tengler went on. Before Friday's decision, there was no similar precedent, she said. Even so, the proposed stock sale still needs to spell out that \"any money put into this company could be a total loss,\" said Amy Lynch, a former U.S. Securities and Exchange Commission staffer and founder of FrontLine Compliance, which advises institutional money managers on compliance issues. \"The disclosures would have to be air tight in order to avoid lawsuits in the future,\" Lynch told MarketWatch. Hertz stock has nearly tripled in June, and gained 10% this week, the Wednesday delisting notice from the New York Stock Exchange notwithstanding. The stock fell around 3% in the extended session on Friday after the court decision's news, but ended the regular trading day up 37%. The shares hit an all-time closing low of 56 cents on May 26, a few days after the company's May 22 bankruptcy filing and a far cry from their Aug. 2014 record closing high of at $110.61. The next day, they logged their largest one-day increase ever, jumping 136%. Recent average volume has been more than 16 times the volumes before the filing. Notably, Carl Icahn took the first opportunity after the filing to sell all of his stake at a steep loss. Hertz's motion to the bankruptcy court characterized the potential equity sale as an opportunity for the debtors to raise capital on better terms. The company did not immediately reply to a request for comment. Hertz is No. 1 at a popularity list at Robintrack, a site that tracks activity on the Robinhood app. \"From our vantage point, the 30-handle unsecured bond prices should create some reconsideration of equity upside for a company in chapter 11. We are old fashioned that way,\" the CreditSights analysts said. Hertz's most widely traded October 2022 corporate bonds were changing hands at an average price of about 40.50 cents on the dollar Friday, a plunge from nearly 100 cents on the dollar at the start of March, according to bond trading and pricing platform MarketAxess. Bonds often are considered distressed once they trade below 70 cents on the dollar. \"We think this deal would be more robbing from the misinformed to give to the senior secured,\" they said."}]}