{"article": [{"url": "https://www.marketwatch.com/story/dollar-could-be-a-crash-risk-if-u-s-loses-credibility-analyst-warns-11596490402", "published": 1596477680.0, "headline": "Dollar could be a 'crash risk' if U.S. loses 'credibility,' analyst warns", "body": "Getty Images The U.S. dollar began August with a bounce after suffering its worst monthly fall in just shy of a decade, but it did little to dissuade bears who are looking for further weakness in the greenback. \"We expect the currency to be undermined by an ebbing of safe-haven flows, a reduction in the U.S. rate advantage, and political uncertainty ahead of the November presidential election,\" wrote analysts at UBS, in a note last week. The ICE U.S. Dollar Index DXY, -0.58%, a measure of the currency against a basket of six major rivals, fell 4.2% in July, its biggest one-month decline since September 2010, according to FactSet data, trading Friday at its lowest in more than two years. The index caught a 0.3% bounce on Monday to around 93.599. Data last week from the Commodity Futures Trading Commission, meanwhile, showed that the dollar is well out of favor with speculative traders - a factor that may have left the currency ripe for at least a near-term bounce. Extreme speculative positioning is often a contrarian signal. But what may be unnerving over the long term, argued Steven Barrow, head of G-10 strategy at Standard Bank, is that the dollar's weakness versus developed currencies comes at a time of heightened global uncertainty surrounding the COVID-19 pandemic. Usually, the dollar behaves \"a bit better\" against its developed-economy peers during a crisis, he said, in a Friday note. Barrow worried that the combination of rising economic and political uncertainty amid the COVID-19 pandemic and ahead of the November presidential election could pose a \"crash risk\" - a danger more often associated with emerging-market currencies. The dollar has held up well versus emerging-market currencies, Barrow acknowledged, which means the risk may be mainly against other developed-world currencies, like the euro EURUSD, +0.60%, Japanese yen USDJPY, -0.38% and Swiss franc USDCHF, -0.81%, Why the danger? Barrow argued that rate cuts and other easing measures by the Federal Reserve and the drop in Treasury yields to or near all-time lows has significantly reduced the U.S. rate premium versus other \"safe\" currencies. But what's really important, he said, are other factors, like the liquidity of assets, particularly government bonds. The near-freeze-up of the U.S. Treasury market at the height of the coronavirus crisis earlier this year marked a \"bit of a wobble,\" he said, which could be a problem if it makes traders and investors reluctant to head for Treasurys in the event of another risk-off event - a development that would allow the dollar to suffer. And then there's the election. President Donald Trump on Thursday raised the question of delaying the vote, alleging the potential for fraud around mail-in ballots despite a lack of evidence. While the vote is virtually certain to proceed on Nov. 3, the suggestion \"is just another indication that the election won't be as smooth as we're used to in a developed country ,\" Barrow said. \"And, if [Trump] refuses to leave office after a - disputed - defeat, it could really damage the credibility of the U.S. on a global scale. \" Barrow pointed to the chart below, tracking the popular Economic Uncertainty Index, which shows U.S. uncertainty has soared to levels similar to those in the rest of the world. U.S. uncertainty had been significantly below global levels before the pandemic. There are other factors that could lead to dollar weakness, as well, but the underlying question is, \"Can the dollar be trusted?\" he said. \"For if trust has disappeared in the U.S.'s economy, policy making, election credibility and more, then the dollar could be in for a slump, at least against other major currencies. \""}]}