{"article": [{"url": "https://www.marketwatch.com/story/eu-takes-legal-action-against-uk-for-breach-of-ireland-protocol-heres-why-that-doesnt-mean-a-trade-deal-cant-still-happen-2020-10-01", "published": 1601562080.0, "headline": "EU takes legal action against U.K. for breach of Ireland protocol. That doesn't mean a trade deal won't happen", "body": "European Commission President Ursula von der Leyen said on Thursday that the European Union has sent a formal notice to the U.K. government, after London failed to respond to its demand to drop a controversial bill reneging on last year's agreement over the U.K.'s exit from the union. - The move is the first step of an infringement procedure and comes in the last stretch of the U.K.-EU negotiations over a trade deal that would set the basis for their future relationship. - \"The deadline lapsed yesterday. The problematic provisions have not been removed,\" von der Leyen said in a terse statement, demanding \"the full and timely implementation of the withdrawal agreement\" struck last year after Prime Minister Boris Johnson conceded in a U-turn that no border should separate the two Irelands. - The U.K. draft bill \"is by its very nature, a breach of the obligation of good faith,\" the head of the EU's top executive body said. London now has a month to respond to the EU's queries. A spoikesman for UK prime minister Boris Johnson said Thursday that the government was \"committed to working (...) to find a solution that is satisfactory to both sides\" through a joint UK-EU committee tasked with settling the dispute. - The so-called internal-market bill has raised an uproar even in the U.S., prompting Democratic presidential contender Joe Biden to warn the U.K. that it would not be able to conclude a trade deal with the U.S. if it sought to re-establish a hard border with the Republic of Ireland. iframe.twitter-tweet { width: 100% !important; } Read: No U.S.-U.K. trade deal if Brexit undermines Good Friday accord, Pelosi warned in 2019 The outlook: The U.K.'s surprise initiative had been fiercely criticized even within the ruling Conservative Party, with all five living former prime ministers condemning it as a breach of international obligations. But the legal dispute will disappear if negotiators manage to agree on a trade deal, even though the bill has poisoned the political context and lowered the level of trust between the two sides. A rare sense of guarded optimism seemed to surface in the last few days among the negotiators on the two main bones of contention. The U.K. is said to be offering concessions on fisheries, and a solution could be found on rules to govern U.K. state aid in the future, on which the EU side insists. Read:Pound volatile amid speculation over whether U.K.-EU trade deal will be reached"}]}