{"article": [{"url": "https://www.marketwatch.com/story/trump-shares-chuck-woolery-tweet-that-says-everyone-is-lying-about-the-coronavirus-2020-07-13", "published": 1594642460.0, "headline": "Trump shares Chuck Woolery tweet that says â\u0080\u0098everyone is lyingâ\u0080\u0099 about the coronavirus", "body": "The original â\u0080\u009cWheel of Fortuneâ\u0080\u009d host knows how to spin. Chuck Woolery, who also once hosted â\u0080\u009cLove Connectionâ\u0080\u009d and now leads the conservative podcast â\u0080\u009cBlunt Force Truth,â\u0080\u009d accused everyone from the CDC to the Democratic Party of lying about the novel coronavirus that causes COVID-19 in a pair of tweets on Sunday night â\u0080\u0094 which were later retweeted by President Trump. â\u0080\u009cThe most outrageous lies are the ones about Covid 19. Everyone is lying. The CDC, Media, Democrats, our Doctors, not all but most, that we are told to trust,â\u0080\u009d Woolery wrote in a Twitter TWTR, -0.23% Â post. He speculated that coronavirus coverage has been spun to slow down economic recovery in order to influence the U.S. presidential election in November. In a follow-up tweet, he added that there is â\u0080\u009cscientific evidenceâ\u0080\u009d that schools should reopen this fall. U.S. Education Secretary Betsy DeVos also pushed for reopening schools over the weekend, despite coronavirus cases surging in states like Florida. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } President Trump retweeted both posts, which have been shared tens of thousands of times on Twitter and drawn thousands of comments, leading Wooleryâ\u0080\u0099s name and some of the game shows that he had stints on to trend on Monday morning. Trump also retweeted an April 11 post from Wooleryâ\u0080\u0099s â\u0080\u009cBlunt Force Truthâ\u0080\u009d co-host Mark Young questioning the expertise of Dr. Anthony Fauci, one of the nationâ\u0080\u0099s leading authorities on infectious diseases. â\u0080\u009cSo based on Dr. Fauci and the Democrats, I will need an ID card to go shopping but not to vote?â\u0080\u009d reads Youngâ\u0080\u0099s tweet. A White House official also told NBC News on Sunday that â\u0080\u009cseveral White House officials are concerned about the number of times Dr. Fauci has been wrong on things,â\u0080\u009d such as his March guidance that â\u0080\u009cpeople should not be walking around wearing masks.â\u0080\u009d Guidance on facial coverings has been adjusted, of course, as more evidence has revealed that wearing masks significantly slows the spread of COVID-19. In fact, wearing face masks between April and May averted 230,000 coronavirus cases, according to one study. The president even wore a mask in public for the first time during the pandemic on Saturday, covering up while visiting a military hospital. More than 3.3 million coronavirus cases had been confirmed in the U.S. as of Monday morning, with Florida counting a record of over 15,000 new cases on Sunday. More than 135,205 Americans have died from the coronavirus, and the death toll is rising again after it had started to flatten in mid-to-late April. Read MarketWatchâ\u0080\u0099s coronavirus coverage here."}]}