{"article": [{"url": "https://www.marketwatch.com/story/utah-and-oregon-put-reopening-of-economies-on-hold-amid-spike-in-coronavirus-cases-but-texas-arkansas-and-arizona-press-on-despite-warning-signs-2020-06-13", "published": 1592079920.0, "headline": "Utah and Oregon put reopening of  economies on hold amid spikes in coronavirus cases, but Texas, Arkansas and Arizona press on despite warning signs", "body": "Utah and Oregon put any further reopening of their economies on hold Saturday amid a spike in coronavirus cases, but there was no turning back in such states as Texas, Arkansas and Arizona despite warning signs flashing there too. One by one, U.S. states are weighing the health risks from the virus against the economic damage from the stay-at-home orders that have thrown millions out of work over the past three months. And many governors are coming down on the side of jobs, even though an Associated Press analysis this week found that cases are rising in nearly half of U.S. states — a trend experts attributed in part to the gradual reopening of businesses over the past few weeks. Texas hit highs this week for hospitalizations and new COVID-19 cases, prompting Houston’s top county official, Lina Hidalgo, to warn that “we may be approaching the precipice of a disaster.” Meanwhile, the state went ahead with allowing restaurants to expand eat-in dining Friday to 75% of capacity, up from 50%. “Oh, yeah, I’ve been concerned,” 32-year-old Renata Liggins said as she settled in front of a plate of brisket at Black’s Barbecue in Austin and the number of people now hospitalized with COVID-19 in Texas climbed to its highest level yet, at more than 2,100. But “it just feels I can finally breathe a little bit.” Alabama, which began reopening in early May, has seen more than a quarter of the state’s 23,000 cases come in the past two weeks as Republican Gov. Kay Ivey emphasized personal responsibility. Arkansas, which has seen both hospitalizations and active cases more than double since Memorial Day, reported its largest one-day spike in new coronavirus cases Friday. Gov. Asa Hutchinson said at least 11,547 people in the state have tested positive for the virus, an increase of 731 cases over Thursday. Hutchinson said he expected more increases in the coming week but would press ahead with plans to further ease virus restrictions on businesses starting Monday. Capacity limits will be increased for restaurants, bars, theaters and other businesses while other social distancing restrictions remain in place. “Regardless of what we see in the next week, we made the right decision to go ahead and lift some of these restrictions so we don’t cause more damage to people’s lives and their livelihood,” Hutchinson said. Arizona has become one of the most troubling hot spots in the U.S. as new cases have surged to more than 1,000 a day, up from fewer than 400 before stay-at-home orders expired in mid-May. Republican Gov. Doug Ducey has given assurances the health-care system can handle it, and Arizona Health Director Dr. Cara Christ said: “We are not going to be able to stop the spread, and so we can’t stop living as well.” California, which implemented the country’s first statewide stay-at-home order, entered the most expansive phase of its gradual reopening Friday. Wineries started uncorking their bottles and welcoming people back to their tasting rooms, and hotels, zoos, museums and aquariums were also allowed to reopen. San Francisco restaurants resumed outdoor dining, and the San Diego Zoo opened on a limited basis. Cases are rising as the state expands testing, but health officials say key metrics to watch are the positivity rate among those tested and hospitalizations, and both have remained relatively steady in recent weeks as businesses gradually reopened. The state has “guardrails and cautions” in place that give officials confidence to continue reopening, said Mark Ghaly, the state’s health and human services secretary. Health officials in Oklahoma warned Friday that a spike in coronavirus cases in the Tulsa area is linked to indoor events and people who attend such gatherings should take health precautions. Tulsa Health Department spokesperson Leanne Stephens said an undetermined number of cases were linked to two recent indoor gatherings but declined to name them. The warning comes a week before President Donald Trump is scheduled to hold a campaign rally at the city’s BOK Center, which has a listed seating capacity of more than 19,000. Stephens said the warning was unrelated to the rally. So far, only a small number of governors have shown a willingness to retreat, or at least hit pause. Republican Gov. Gary Herbert of Utah and Democratic Gov. Kate Brown of Oregon said they would halt lifting further restrictions for the time being as new cases flare. “As I’ve said before, reopening comes with real risk,” Brown said in announcing a one-week pause that will affect, among other places, Portland, the state’s biggest city. She said the increase in positive test results was caused in part by the reopening of some counties. Oregon reported 178 new cases Thursday, the highest count since the outbreak began. Elsewhere across the country, Iowa allowed bars, restaurants, theaters and other businesses to pack in more customers. Swimming pools, senior centers and adult day care centers were also cleared to open back up. Iowa is still seeing hot spots, especially near meatpacking plants. In Texas, Republican Gov. Greg Abbott “is making pretty clear at this point he wants the economy to open,” a worried Austin Mayor Steve Adler said. “My hope is that when he sees what kind of surge there’s going to be, he does act at a state level.” See also: Coronavirus update: Global case tally tops 7.68 million as countries push ahead toward phased reopenings — with mixed results ____"}]}