{"article": [{"url": "https://www.marketwatch.com/story/trumps-stimulus-orders-dont-seem-to-be-feasible-or-legal-experts-say-2020-08-08", "published": 1597142240.0, "headline": "Republican senator calls Trumpâ\u0080\u0099s stimulus executive order â\u0080\u0098unconstitutional slopâ\u0080\u0099", "body": "President Donald Trumpâ\u0080\u0099s executive order and memorandums ostensibly providing relief amid the intractable coronavirus pandemic donâ\u0080\u0099t seem feasible or legal, experts said Saturday. One Republican lawmaker, Sen. Ben Sasse of Nebraska, called Trumpâ\u0080\u0099s unilateral moves â\u0080\u009cunconstitutional slop.â\u0080\u009d â\u0080\u009cPresident Obama did not have the power to unilaterally rewrite immigration law with DACA and President Trump does not have the power to unilaterally rewrite the payroll tax law,â\u0080\u009d Sasse said in a statement. Former Secretary of State Hillary Clinton, Trumpâ\u0080\u0099s rival in the 2016 presidential election, in an MSNBC interview called the executive actions signed on Saturday at Trumpâ\u0080\u0099s golf club in Bedminster, N.J., â\u0080\u009ca stunt.â\u0080\u009d Trump made an end run around Congress on Saturday with an executive order and three memoranda aimed at boosting the economy, but analysts said the wording of the orders raised more questions than the answers provided. Read:Trump extends unemployment benefits, defers payroll tax For instance, the executive order will allow companies to avoid collecting payroll taxes, but analysts said workers would still be on the hook to pay the taxes by next April 15. iframe.twitter-tweet { width: 100% !important; } Trump, prodded by some of his economic advisers, has been a vocal fan of a payroll-tax holiday, but the tax break is not popular among Republicans and Democrats on Capitol Hill, as these taxes fund the Social Security program. One Trump memorandum would provide $400 a week in extra unemployment benefits. The federal money would come from disaster relief funds. Analysts questioned the wisdom of using such funds with the U.S. hurricane season ahead. Cash-strapped states would be required to chip in $100 of the extra benefit. The program could last just four weeks before it runs out of money, Ernis Tedeschi, a former Treasury Department economist, tweeted that he didnâ\u0080\u0099t think the unemployment insurance plan would work: iframe.twitter-tweet { width: 100% !important; } The Trump memorandum that on its face extends the CARES Actâ\u0080\u0099s eviction moratorium merely asks whether certain agencies could â\u0080\u009cmaybe do somethingâ\u0080\u009d about evictions, said Bharat Ramamurti, a member of the COVID-19 Congressional Oversight Commission, in a tweet: iframe.twitter-tweet { width: 100% !important; } Congressional Democratic leaders issued a joint statement condemning the executive actions as feckless and urging Republicans to return to the negotiating table. Sen. Charles Schumer, Democrat of New York, and Speaker of the House Nancy Pelosi, from California, called Trumpâ\u0080\u0099s actions â\u0080\u009cunworkable, weak and narrow.â\u0080\u009d Diane Swonk, chief economist at Grant Thornton, agreed that Congress needs to pass legislation. The July employment report showed that job growth is slowing as the coronavirus pandemic spreads. â\u0080\u009cThe crisis is real, while the economy has already shown signs of losing momentum.â\u0080\u009d Swonk said in a tweet. The House passed a next-phase coronavirus relief package called the HEROES Act in May, but the Senate and White House opted to remain on pause till public pressure built when the benefits provided by the prior program expired at the end of July. Trump on Monday hit back at Sasseâ\u0080\u0099s â\u0080\u009cunconstitutional slopâ\u0080\u009d assessment, calling the Nebraskan a â\u0080\u009cRINOâ\u0080\u009d who could not have won his primary in May â\u0080\u0094 he got more than three in four votes â\u0080\u0094 without Trumpâ\u0080\u0099s endorsement but who has â\u0080\u009cgone rogue again.â\u0080\u009d Sasse later replied that heâ\u0080\u0099d have preferred to keep the conversation private but that Trump had negated that option. â\u0080\u009cOn the topic that had you mad this weekend: No president â\u0080\u0094 whether named Obama or Trump or Biden or AOC â\u0080\u0094 has unilateral power to rewrite immigration law or to cut taxes or to raise taxes. This,â\u0080\u009d read a statement posted on the Sasse campaign account, â\u0080\u009cis because America doesnâ\u0080\u0099t have kings.â\u0080\u009d Read on:Members of Trump golf club in New Jersey enlisted as audience for impromptu press conferences and inking of executive actions"}]}