{"article": [{"url": "https://www.marketwatch.com/story/thinking-about-taking-an-early-retirement-account-withdrawal-here-are-10-ways-to-avoid-a-penalty-in-the-covid-19-era-2020-08-26", "published": 1598864000.0, "headline": "10 ways to avoid a penalty for taking an early retirement-account withdrawal because of COVID-19", "body": "If you’re facing a cash shortfall, you may think about taking an early withdrawal from your IRA or qualified retirement plan account. By early withdrawal, I mean one that occurs before age 59½. Needless to say, there are federal income tax implications, including the possibility of getting socked with the dreaded federal 10% early withdrawal penalty tax. Here’s what you need to know. Early withdrawals are usually taxable, but penalty tax can often be avoided In most cases, all or part of any withdrawal from a traditional IRA or qualified retirement plan, such as a company-sponsored 401(k) or profit-sharing plan, counts as taxable gross income. The taxable percentage depends on whether you’ve made any nondeductible contributions to the account. If you have, each withdrawal consists of a proportionate amount of your total nondeductible contributions, and that part is tax-free. The proportionate part of each withdrawal that consists of deductible contributions and accumulated earnings is taxable. If you’ve never made any nondeductible contributions, 100% of any withdrawal is taxable. While it might be impossible to avoid triggering some taxable income by taking an early withdrawal (before age 59½), you might be able to avoid the federal 10% penalty tax on early withdrawals by taking advantage of the exceptions explained below. Penalty tax exceptions for early withdrawals from traditional IRAs The following exceptions to the 10% federal penalty tax are available for early withdrawals (before age 59½) from traditional IRAs, which for this purpose include simplified employee pension (SEP-IRA) accounts and SIMPLE-IRA accounts. 1. Withdrawals for medical expenses For 2020, if you have qualified medical expenses in excess of 7.5% of adjusted gross income (AGI), early IRA withdrawals up to the amount of the excess are exempt from the 10% penalty tax. However, the medical costs must be paid in the same year you take the early withdrawal (2020). 2. Substantially equal periodic payments (SEPPs) These are annual annuity-like withdrawals that must be taken for at least five years or until the you reach age 59½, whichever comes later. The rules for SEPPs are complicated. You may want to get your tax advisor involved to avoid pitfalls. 3. Withdrawals after death Amounts withdrawn from an IRA after the account owner’s death are always free of the 10% penalty tax. However, this exception won’t be available for funds rolled over into a surviving spouse’s IRA or if the surviving spouse elects to treat the inherited IRA as his or her own account. If the surviving spouse needs some of the inherited funds, they should be left in the inherited IRA (i.e., the one still treated as having been set up for the deceased spouse). Then the surviving spouse can withdraw the needed funds from the inherited IRA without any 10% penalty tax, thanks to this exception. 4. Withdrawals after disability This exception applies to amounts paid to an IRA owner who is found to be physically or mentally disabled to the extent that he or she cannot engage in his or her customary gainful activity or a comparable gainful activity. In addition, the disability must be expected to: (1) lead to death or (2) be of long or indefinite duration. However, the disability need not be expected to be permanent to satisfy the preceding requirement. 5. Withdrawals for first-time home purchases ($10,000 lifetime limit) This exception allows penalty-free IRA withdrawals to the extent of money spent by the account owner within 120 days to pay for qualified acquisition costs for a principal residence. However, there is a lifetime $10,000 limit on this exception. The principal residence can be acquired by: (1) the account owner or the account owner’s spouse; (2) the account owner’s child, grandchild, or grandparent; or (3) the spouse’s child, grandchild, or grandparent. The buyer of the principal residence (and the spouse if the buyer is married) must not have owned a present interest in a principal residence within the two-year period that ends on the acquisition date. Qualified acquisition costs are defined as costs to acquire, construct, or reconstruct a principal residence — including closing costs. 6. Withdrawals for qualified higher education expenses Early IRA withdrawals are penalty-free to the extent of qualified higher education expenses paid during the same year. The qualified expenses must be for the education of: (1) the account owner or the account owner’s spouse or (2) a child, stepchild, or adopted child of the account owner or the account owner’s spouse. 7. Withdrawals to pay health insurance premiums during unemployment This exception is available to an IRA owner who has received unemployment compensation payments for 12 consecutive weeks under any federal or state unemployment compensation law during the year in question or the preceding year. If this condition is satisfied, the IRA owner’s early withdrawals during the year in question are penalty-free up to the amount paid during that year for health insurance premiums to cover the account owner and his or her spouse and dependents. However, early withdrawals after the account owner has regained employment for at least 60 days don’t qualify for this exception. Key Point: This exception obviously has increased relevance in the COVID-19 era. 8. Withdrawals by military reservists called to active duty This exception applies to certain early IRA withdrawals taken by military reserve members who are called to active duty for at least 180 days or for an indefinite period. 9. Withdrawals to satisfy IRS levies This exception applies to early IRA withdrawals taken to pay IRS levies against the account. However, this exception is unavailable when the IRS levies against the IRA owner (as opposed to the IRA itself), and the owner then withdraws IRA funds to pay the levy. 10. Coronavirus-related distributions For 2020, an eligible individual (one who is deemed to have been adversely affected by the coronavirus crisis) can take one or more so-called corona-virus related distributions from one or more IRAs, totaling up to $100,000. Subject to the $100,000 limit, such distributions are exempt from the 10% early withdrawal penalty tax. Under complicated rules, you can recontribute coronavirus related distributions to your IRA(s) within three years after they are received and eventually avoid any federal income tax hit. For details, see my earlier column. Penalty tax exceptions for early withdrawals from qualified retirement plans Oddly enough, the list of exceptions to the federal 10% early withdrawal penalty tax for qualified retirement plans, such as 401(k) and profit-sharing plans, is not exactly the same as the list of exceptions for IRAs. In another oddity, there’s no specific penalty tax exception for early retirement plan withdrawals due to general financial hardship. So-called hardship withdrawals are sometimes the only way to get money out of a company plan without permanently leaving your job. However, you may find that one of the penalty exceptions explained below applies to a hardship withdrawal. If so, you won’t get hit with the 10% early withdrawal penalty tax. With those thoughts in mind, here’s the list of penalty exceptions for early qualified retirement plan withdrawals. 1. Withdrawals after separating from service After separating from service at age 55 or older (due to quitting, retiring, getting laid off, or permanently leaving your job for any reason), you are exempt from the 10% penalty tax. If you are a qualified public-safety employee who separates from service at age 50 or older, you can receive penalty-free payments from a governmental defined benefit plan. Key point: If you qualify for the separation-from-service exception, you should not roll over retirement plan money that you expect to need in the relatively near future into a traditional IRA. Why? Because early IRA withdrawals (before age 59½) will be hit the 10% penalty tax unless one of the IRA exceptions listed earlier is available. 2. Substantially equal periodic payments (SEPPs) See the earlier explanation under the list of IRA exceptions. 3. Amounts paid under qualified domestic relations orders Early retirement plan withdrawals paid to your spouse or ex-spouse or dependent pursuant to a qualified domestic relations order (QDRO) issued by a court during divorce proceedings are exempt from the 10% penalty tax. 4. Withdrawals to cover medical expenses See the earlier explanation under the list of IRA exceptions. 5. Withdrawals after death See the earlier explanation under the list of IRA exceptions. 6. Withdrawals after disability See the earlier explanation under the list of IRA exceptions. 7. Withdrawals by military reservists See the earlier explanation under the list of IRA exceptions. 8. Withdrawals to satisfy IRS levies See the earlier explanation under the list of IRA exceptions. 9. Corona-virus related distributions For 2020, an eligible individual (one who is deemed to have been adversely affected by the coronavirus crisis) can take one or more so-called corona-virus related distributions from one or more qualified retirement plans, such as a 401(k) plan or profit-sharing plan, totaling up to $100,000. Subject to the $100,000 limit, such distributions are exempt from the 10% early withdrawal penalty tax. Under complicated rules, you can recontribute corona-virus related distributions to an IRA or qualified plan account within three years after they are received, and eventually avoid any federal income tax hit. However, company plans are not required to allow corona-virus related distributions. Consult your tax advisor if you think you might qualify for this exception and are interested. The bottom line You can always take an early withdrawal from your IRA. Just make sure you understand the tax implications, including possible exposure to the 10% penalty tax. Before attempting to take an early withdrawal from a company retirement plan, you must do two things. First, make sure it’s even possible. Some company plans only allow so-called hardship withdrawals while you are still employed. Second, make sure you understand the tax implications, including whether you qualify for an exception to the 10% penalty tax."}]}