{"article": [{"url": "https://www.marketwatch.com/story/10-year-treasury-yield-extends-climb-after-biggest-daily-rise-in-two-months-2020-08-12", "published": 1597249760.0, "headline": "10-year, 30-year Treasury yield hits five-week high as supply weighs on market", "body": "U.S. Treasury yields rose on early Wednesday’s trade, extending the climb in yields for long-dated debt to a five-week high as new debt issuance this week weighed on trading, driving prices lower and yields higher.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 1.2 basis points to 0.669%, marking the highest yield since July 6, according to Dow Jones Market Data. The move comes a day after it recorded its biggest daily rate increase in two months; while the 2-year note rate TMUBMUSD02Y, 0.156% was virtually unchanged at 0.157%. The 30-year bond yield TMUBMUSD30Y, 1.576% added 1.8 basis points to 1.365%, marking its highest yield since July 8, according to Dow Jones Market Data. Bond prices move inversely to yields. What’s driving Treasurys? Treasury prices followed the pattern of previous days as investors made way for an influx of debt supply this week, with broker-dealers bidding yields higher to ensure a successful auction. The Treasury Department sold a record $38 billion of its benchmark 10-year notes in the afternoon to strong demand. Like, Tuesday’s 3-year auction, an early selloff helped to cheapen Treasurys, luring investors who were attracted by the higher yields and the lower prices. Adding to the bearish pressure on the bond market, the July U.S. consumer-price index rose 0.6% versus expectations for a rise of 0.4%. Inflation is the bugaboo of bond investors and can corrode the value of a bond’s fixed-interest payments. The 10-year break-even rate, or what holders of Treasury inflation-protected securities anticipate inflation will shape up over the next decade, rose more than 2 basis points to 1.66% on Wednesday. San Francisco Fed President Mary Daly said they didn’t expect the U.S. to have V-shaped recovery, that is, a swift rebound from the downturn in the second-quarter. Meanwhile, Dallas Fed President Robert Kaplan said the economy wasn’t rebounding as quickly as he had hoped. What did market participants’ say? “Treasuries sold off throughout most of the session; pricing in a good concession for a refunding auction that was a solid takedown by most measures. The long-bond continued to underperform ahead of its day in the supply spotlight – a classic example of an accommodation trade,” said Ian Lyngen, head of U.S. rates strategy at BMO Capital Markets, in a note."}]}