{"article": [{"url": "https://www.marketwatch.com/story/netflix-adds-more-than-10-million-new-subscribers-and-names-sarandos-co-ceo-but-stock-is-tanking-2020-07-16", "published": 1594966940.0, "headline": "Netflix adds more than 10 million new subscribers and names Sarandos co-CEO, but stock is tanking", "body": "Netflix Inc. logged another blockbuster quarter Thursday with the addition of 10.1 million new paid subscribers and a significant jump in revenue, and rewarded one of its most important executives with a promotion, but shares declined in after-hours trading on fears of slowing second-half growth. Netflix NFLX, +1.43% reported 10.1 million new subscribers in the second quarter, topping the 10 million mark for a second consecutive quarter amid shelter-in-place orders related to the COVID-19 pandemic. The company reported net earnings of $720 million, or $1.59 a share, compared with net income of $270.7 million, or 60 cents a share, in the year-ago quarter. Revenue improved to $6.15 billion from $4.92 billion a year ago. Analysts surveyed by FactSet had expected adjusted earnings of $1.82 a share on sales of $6.08 billion. They also expected the addition of 8.21 million paid subscriptions, higher than Netflix’s forecast of 7.5 million in April. Netflix’s shares have soared 64% this year, while the broader S&P 500 index SPX, +0.87% has declined 0.5% in 2020. Netflix’s second-quarter results sent shares of the video-streaming giant down more than 8% in after-hours trading Thursday, following a four-month surge that has propelled its stock ($527.39 at the close) and market valuation (more than $230 billion) to record highs. In a letter to shareholders, Netflix executives admitted that the gains in the first half of the year were likely pulled forward from later in the year, which means fewer new subscribers in the rest of 2020. “In Q1 and Q2, we saw significant pull-forward of our underlying adoption leading to huge growth in the first half of this year (26 million paid net adds vs. prior year of 12 million),” executives said in the letter. “As a result, we expect less growth for the second half of 2020 compared to the prior year.” Investors are selling off in anticipation of a turbulent year ahead, beginning with a tepid third-quarter forecast. Netflix offered revenue guidance of $6.33 billion, below FactSet analyst estimates of $6.4 billion, and EPS of $2.09 versus analyst estimates of $2. The company expects 2.5 million net subscriber additions in Q3; analysts predict 5.4 million. Deepening concerns, Netflix expects “paused productions” on original shows and films in the first half of 2021, based on its long lead-time content production schedule. Netflix also announced a big change in its executive suite: Ted Sarandos, who has led their original-content efforts, was named co-CEO to share the top spot with co-founder Reed Hastings. “This change makes formal what was already informal — that Ted and I share the leadership of Netflix,” Hastings said in the letter. The company also said Chief Product Officer Greg Peters has added chief operating officer to his job title. He indicated in a Netflix’s video interview with an analyst late Thursday that the company would look internationally for productions and more members. Netflix reported a record 15.77 million net paid subscription additions from the same period a year earlier in the first quarter. Netflix achieved the cereal spoon-dropping feat despite acute competition from the likes of Walt Disney Co.’s DIS, +1.53% Disney+, which debuted the highly-anticipated “Hamilton” movie earlier this month; Apple Inc.’s AAPL, +1.74% Apple TV+; Amazon.com Inc.’s AMZN, +3.01% Prime Video; and AT&T’s T, -1.01% HBO Max, which launched May 27. Comcast Corp.’s CMCSA, -0.99% Peacock debuted in the U.S. on Wednesday. In its letter Thursday, Netflix added TikTok to its list of rivals, calling its growth “astounding, showing the fluidity of internet entertainment.” See also: Netflix pulled off a showstopper early in the pandemic, but will the sequel deserve the price? More important, the Silicon Valley company’s popularity among consumers illustrates its vast menu of original content and ability to amass a massive pipeline of content it had already filmed when the pandemic shut down production. Of the 20 most-watched TV shows in the U.S. in the second quarter, 11 were on Netflix (eight of them originals), and of the 20 most-watched movies in the U.S. in the second quarter, seven were on Netflix, according to data from Reelgood for MarketWatch. The question for Netflix is how long the fresh pipeline of content will gush, and whether net paid subscription additions will erode as professional sports leagues like Major League Baseball (July 23), the NBA (July 30) and the NHL (Aug. 1) return to ballparks and arenas. This was a hot topic during Netflix’s video interview. Sarandos said extra time is being spent on scripts and pre-production during the months-long hiatus from filming live content, which should help shorten productions once they ramp up. He said shooting has resumed on several projects, including one in Los Angeles, and that production was far along on others before the COVID-19 outbreak in March. That should lead to more original content in 2021 than in 2020. “I feel excellent about some of the big bets that Ted has in store for the next three to four years,” Hastings said, acknowledging the occasional mega-programming event like “Hamilton” that draws customers to another service. So far, Netflix has been able to sate the insatiable appetites of homebound-consumers. It has replenished programming with game shows, a reboot of the 1980s TV series “Unsolved Mysteries,” and a new series adapted from the popular teen book franchise, “The Baby-Sitters Club.” See also: Here’s everything coming to Netflix in July 2020 — and what’s leaving As a result, Netflix’s engagement has increased “significantly” since the COVID-19 outbreak, a Jefferies analyst reported. The percentage of subscribers in the U.S. viewing the service for more than 10 hours a week has soared to 38% from 16% pre-COVID-19, according to a survey of 1,500 Netflix customers cited by Jefferies analyst Alex Giaimo. He maintained a buy rating and price target of $520, on July 10. “We expect Netflix to add its 200 millionth member this year, an astonishing level of scale in television and just over three years after crossing the 100mm mark,” Morgan Stanley analyst Benjamin Swinburne said in a July 15 note, underlining Netflix’s surge in growth in 2020. Still, in the days leading up to Netflix’s report, at least one analyst warned that investors seemed to have already priced in the benefits of a COVID-19-forced lockdown to Netflix shares following a strong June quarter. In his note Tuesday, UBS analyst Eric Sheridan downgraded Netflix’s stock to neutral from buy. See also: Netflix stock falls after downgrade at UBS"}]}