{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-100-days-since-covid-19-was-declared-a-pandemic-and-us-has-highest-case-and-death-tally-by-a-wide-margin-2020-06-18", "published": 1592493320.0, "headline": "Coronavirus update: 100 days since COVID-19 declared a pandemic, and U.S. has highest case and death tallies by a wide margin", "body": "A full 100 days since the start of the coronavirus pandemic and the U.S. death toll is approaching 118,000, with new cases still climbing in 20 states, even as governors push to reopen more businesses. The U.S. has the highest case tally in the world by a wide margin at 2.2 million, and the highest death toll, according to data aggregated by Johns Hopkins University, and experts now say the number of COVID-19–related deaths could surpass 200,000 by Oct. 1. From the MarketWatch archives (March 11, 2020):World Health Organization declares that the coronavirus is a pandemic The White House has been criticized for its slow initial response to the crisis, and for playing down the risks ever since, which experts say is sending the wrong message to Americans, who are increasingly resisting wearing face masks in public or socially distancing, measures that public health experts insist are keys to containing the spread. President Donald Trump, who is pressing ahead with plans to restart his campaign rallies starting in Tulsa, Okla., on Saturday night, said this week that the rise in cases is due to more testing, and mused that “if we stop testing right now we’d have very few cases.” “There are fears of a second wave of the coronavirus; the president can barely acknowledge that this remains a problem, a problem that continues to kill thousands of Americans each week,” MarketWatch commentator Paul Brandus, White House bureau chief for West Wing Reports, wrote on Thursday. Tulsa County recorded its biggest one-day rise in new cases on Wednesday, at 96, bringing the number of confirmed cases in the county to 1,825. The rally is to be held in a 19,000-seat indoor center, which had long ago postponed all other events — including Bon Jovi, Kiss and Justin Bieber concerts — through at least the end of July. Those requesting tickets to the Trump rally have been required to sign a waiver releasing the campaign from liability in case of illness or injury. Read:Despite concerning data, White House continues to play down coronavirus worries The reopening of the economy is not the only reason for the rise in new cases. The protests that have erupted across the U.S. following the deaths of George Floyd and Rayshard Brooks, and others, are likely to cause some spread. While many of the protesters are young and are using face coverings, they are gathering in large numbers too great to enable social distancing, and the use of tear gas to disperse crowds is causing coughing and respiratory distress that can spread infection. See:Will the protests lead to a spike in coronavirus cases? That depends Americans are also more mobile, since most restrictions on movement have been lifted, Fundstrat Global Advisors analysts noted in commentary. And there’s a “lack of ‘herd immunity’ in most states,” with possible exceptions in the Tri-State region and other hard-hit locations, they wrote. New York has a confirmed case count of 19,798 cases per 1 million residents, while New Jersey has a confirmed case count of 18,881 per million residents. That’s equal to about 2% of the combined population of the two states. That compares with California at 3,974 per million residents, Texas at 3,332 and Florida at 3,851. “COVID-19 has run through NY/NJ and potentially, given seroprevalence tests, the residents of those two states have herd immunity. In other words, NY/NJ may be the safest places in the U.S. and the citizens might be immune. This similar collapse in cases is seen in Italy, France and Spain, so what we are seeing in these 6 states could remind us that the respective curves are simply flatter.” “ Anthony Fauci, the head of the National Institute for Allergies and Infectious Diseases, told NPR this week that he hasn’t spoken to President Donald Trump in two weeks. ” The White House Task Force created to manage the pandemic have made fewer public appearances in recent weeks as Trump and Vice President Mike Pence shrug off the import of the virus to focus instead on economic recovery, even as experts warn that failure to manage the crisis will cause further economic pain. Dr. Anthony Fauci, the head of the National Institute for Allergies and Infectious Diseases, told NPR this week that he hasn’t spoken to Trump in two weeks. But state officials are starting to promote the measures Fauci has consistently recommended, including mandatory mask wearing. On Wednesday, Arizona Gov. Doug Ducey, a Republican, reversed course to authorize local governments to mandate mask wearing in public in response to a spike in cases. See also:‘We’re still in a first wave,’ Fauci says, noting precautions can prevent second wave of coronavirus Wildfires Rage Across Arizona as State’s Covid-19 Cases Surge Oregon Gov. Kate Brown, a Democrat, made masks mandatory for parts of her state. And Southern cities such as Memphis, Tenn., and Montgomery, Ala., have also moved to mandate face coverings this week, as the Washington Post reported. In the U.K., the world’s top soccer league, the English Premier League, returned to action after a 100-day layoff on Wednesday, with a pair of matches. Those were the first of 92 league matches set to be played in the next 40 days. Face masks are optional for players and coaching-staff members, while medical staff are outfitted with PPE. Goal celebrations are to abide by social-distancing guidelines.Latest tallies There are now 8.4 million confirmed cases of COVID-19 worldwide and at least 450,435 people have died, the Johns Hopkins data show. At least 4.1 million people have recovered. Brazil has the second highest case tally and death toll in the world, and President Jair Bolsanaro has been widely criticized his chaotic approach to the crisis. Brazil has 955,377 cases and 46,510 fatalities. Don’t miss:How Brazil’s uncoordinated approach to COVID-19 gave the country the second highest death toll in the world Russia has 560,321 cases and 7,650 fatalities. India has 366,946 cases and 12,237 deaths. The U.K. has 300,935 cases and 42,373 deaths, the highest death toll in Europe and now third highest in the world. Spain has 245,268 cases and 27,136 deaths, while Italy, also an early European hot spot, has 238,159 cases and 34,514 deaths. Peru moved past Italy by case number, with 240,908 cases; it’s recorded 7,257 deaths. Chile, Iran, France, Germany, Turkey, Pakistan, Mexico, Saudi Arabia, Canada and Bangladesh are next and all ahead of China, where the illness was first reported late last year. China has 84,462 cases and 4,638 deaths. China has shut down parts of Beijing and grounded flights after the emergence of a fresh cluster of cases. See: Beijing cancels 60% of flights to contain fresh coronavirus outbreaks: reportWhat’s the economy saying? About 1.5 million people applied for traditional jobless benefits in mid-June, but the high number of people still seeking or receiving financial aid suggests a fresh wave of layoffs may be crashing over the economy and stunting an embryonic recovery, as MarketWatch’s Jeffry Bartash reported. Initial jobless claims for the week through June 13 filed in the traditional way fell slightly from the prior week, according to Labor Department data. Economists polled by MarketWatch had forecast a seasonally adjusted 1.35 million new claims. If people who applied for unemployment benefits through a temporary federal program are included, new claims totaled an unadjusted 2.19 million in mid-June. Read:U.S. entered recession in February after end of longest expansion in history Yet the number of people who are actually receiving traditional jobless benefits edged down slightly to 20.54 million in the week ended May 30. These so-called continuing claims, reported with a one-week lag, had peaked in the middle of May at nearly 23 million and are declining at an agonizingly slow pace. About 49 million new jobless claims have been filed since the start of the pandemic. Don’t miss:Coronavirus Recovery Tracker “Claims are slowly, stubbornly falling back toward a ‘normal’ level, but it is taking a frustratingly long time and, seemingly, momentum is stalling out,” wrote Thomas Simons, money-market economist at Jefferies LLC, in a note to clients. See also:Mortgage rates drop to another record low — here’s why Americans may not want to wait too much longer before locking rates inWhat are companies saying? Cruise stocks came under pressure after a disappointing earnings report from Carnival Corp., which posted a far wider-than-expected loss during the pandemic. The sector, along with airlines, has been slammed by the crisis, which has forced companies to suspend all voyages for months. In the food sector, grocer Kroger Co. had a better-than-expected quarter, buoyed by strong demand for staples, including pasta and packaged products, along with fresh produce and meat. Shoppers are eating in more during the crisis and getting their groceries delivered to avoid the risk of exposure to others. Read now: Zoom Video backtracks, will offer end-to-end encryption to all users Specialty retailer Francesca’s warned that it may not be able to stay in business if the disruption from the pandemic continues to hurt its operations and supply chain. The Houston-based company said sales fell 50% in the second quarter and used “going concern” language in a release. Elsewhere, the record pace of bond issuance continued, and companies focused on five-year paper, which will be eligible for inclusion in the Federal Reserve’s expanded corporate-bond-buying program. See: How the pandemic has changed tech in its first 100 days Here are the latest things companies have said about COVID-19: • 1-800-Flowers.com Inc. FLWS, +3.90% raised its full-fiscal-year outlook for profit, revenue and free cash flow, as consumer demand started accelerating in late March amid the pandemic. The company now expects adjusted earnings per share for the fiscal year ending in June to grow 75% to 85% from a year ago, compared with previous guidance of a rise 15% to 17%. The FactSet EPS consensus of 62 cents implies 19% growth. The company expects revenue growth of 16% to 18%, up from 8% to 9%, and its estimate for free cash flow is now $75 million to $85 million, up from $45 million to $50 million. Accelerated consumer demand, which included a record for the Easter holiday period, continued through May to include a “very strong” Mother’s Day and into the first two weeks of June. The company said reduced marketing costs contributed to the increased EPS growth outlook. • Carnival Corp. CCL, +0.51% CCL, +1.26% reported a wider-than-expected second-fiscal-quarter loss and revenue that fell more than forecast, but said it was seeing growing demand from new bookings for next year. As of May 31, about half the guests with bookings have requested cash refunds. For 2021, capacity available for sale is within historical ranges, but at prices that are down in the low to mid-single digit percentage ranges. Booking volumes for 2021 for the six weeks ended May 31 were “meaningfully behind” the prior year, but volumes for the six weeks ended May 31 saw an improvement over the prior six weeks. Separately, Carnival said it plans to accelerate the removal of ships this year which were previously expected to be sold in coming years, with 6 ships expected to be disposed of in the next 90 days. • CryoLife Inc. CRY, +3.26% is planning to offer $100 million in convertible senior notes that mature in 2024 in a private placement, joining the many companies issuing debt to bolster liquidity during the pandemic. The maker of medical devices for cardiac and vascular surgical procedures said it would use the proceeds for general corporate purposes, including repaying about $30 million outstanding under its revolving credit facility. • Car technology maker Dana Inc. DAN, +0.33% launched a registered offering of an additional $100 million of its existing 5.375% senior notes due 2027. Proceeds of the deal will be used for general corporate purposes. There are 12 banks underwriting the deal, led by Citigroup. On Tuesday, Dana launched a $400 million offering of bonds that mature in 2028. • Francesca’s Holdings Corp. FRAN, +2.49% is seeing some bright spots after reopening 593 of its 703 boutiques as states lift restrictions on movement imposed during the pandemic. However, the Houston-based company’s second-quarter sales are down 50% to $43.8 million and the crisis is hurting results, cash flows and disrupting its supply chain. The resulting impact “continues to raise substantial doubt about its ability to continue as a going concern.” Chief Executive Andrew Clarke said about half of the company’s furloughed workers have been recalled and the company will continue to reopen boutiques as local mandates are lifted. The retailer had about $21 million in cash as of June 12, up from $14.3 million as of May 2. The company expects to delay the filing of its 10-Q for the second quarter. • Hertz Global Holdings Inc. HTZ, -1.78% is suspending its controversial share offering after pushback from the SEC. Hertz filed to offer up to $500 million in shares, aiming to cash in a surge in the stock’s popularity despite having filed for bankruptcy protection on May 22. In a filing, Hertz said it had been “advised orally” by employees with the Securities and Exchange Commission’s division of corporation finance on Monday afternoon that they planned to review the offering’s prospectus supplement. After discussions with the SEC employees, sales “were promptly suspended pending further understanding of the nature and timing of the staff’s review.” The company’s advisers “have been in regular contact with the Commission” since that initial contact, Hertz said. • JetBlue Airways Corp. JBLU, -0.07% is adding 30 new domestic flight routes to markets where leisure travel is showing signs of strength, as it looks to operate more than half of its typical capacity this summer. “Coronavirus has transformed airline route maps, and as we begin to see small signs of recovery, we continue to be flexible with our network plans to respond to demand trends and generate cash in support of our business,” said Scott Laurence, head of revenue and planning at JetBlue. The air carrier also said it was launching premium-service Mint flights between Newark, New Jersey and Los Angeles and San Francisco. • Kroger Co. KR, +0.46% first-quarter earnings that blew past estimates, boosted by demand during the pandemic. Identical sales excluding fuel soared 19%, well ahead of the FactSet consensus for 13.8% growth. Kroger did not provide guidance due to coronavirus-related uncertainty. Among the measures Kroger has taken amid the pandemic are acceptance of Supplemental Nutrition Assistance Program (SNAP) for low-contact pickup service, expansion of contactless Kroger Pay and introduction of one-way aisles in some markets. • Medical device company Medtronic PLC MDT, +0.81% and Foxconn 2354, +1.36% unit Foxconn Industrial Internet, have received the regulatory approval needed to start making ventilators in the U.S. for use during the pandemic. The partners are working on plans to product 10,000 PB560 ventilators in the next year at Foxconn’s Wisconsin facility. The PB560 is a lightweight, portable ventilator that can be used in both adults and children. The companies said they can increase production capability to more than double their current commitment. Foxconn makes Apple Inc.’s iPhones at plants in China. • NetApp Inc. NTAP, -0.84% is offering $2 billion in senior notes, with maturities ranging from 2025 to 2030. The cloud data services company is selling $750 million in 1.875% notes due 2025, $500 million in 2.375% in notes due 2027 and $700 million in 2.700% notes due 2030. In comparison, 5-year Treasury notes yielded 0.34% as of Wednesday’s close and the 10-year notes yielded 0.74%. Proceeds will be used for general corporate purposes, including repaying $500 million in 3.375% senior notes due 2021. • Nikola Corp. shares NKLA, -1.36% fell after a report that the electric-truck company’s chief executive exaggerated capabilities of a prototype that was displayed in 2016. Bloomberg News reported that Nikola CEO Trevor Milton suggested at a 2016 event that a prototype big-rig “fully functions and works,” but anonymous sources said that it did not have a fuel cell nor other parts that would have allowed it to be operable. “I never deceived anyone,” Milton told Bloomberg. At the time of the Nikola One unveiling, Milton said that deliveries of the truck would begin in 2020, but the company now says it expects no revenue this year. Nikola went public through a special acquisition company, or SPAC, earlier this year and shares have roared higher since, gaining 184% in the past month. • Nucor Corp. NUE, -1.17% provided an upbeat second-quarter earnings outlook, citing “resilient” demand in nonresidential construction in the face of the pandemic. The company expects earnings per share of 10 cents to 15 cents, down from $1.26 in the same period a year ago. The average of the two analysts providing net EPS estimates to FactSet was a loss of 4 cents. The pandemic has most negatively impacted its sheet and plate mills given weak oil and gas market activity and production disruptions. The company said it is witnessing a “strong rebound” in automotive-related steel demand. T • T-Mobile U.S. Inc. TMUS, +1.50% is offering of senior secured debt in a private offering but did not provide an expected amount or maturity. The telecommunications company expects to use the proceeds for “ongoing liability management,” including paying off existing unsecured notes. • U.S. Steel Corp. X, -1.99% filed to offer 57.5 million shares, including underwriter options, and said it would use the proceeds to “strengthen its balance sheet, increase liquidity and for general corporate purposes.” Morgan Stanley is the offering’s underwriter."}]}