{"article": [{"url": "https://www.marketwatch.com/story/gold-edges-higher-as-investors-await-additional-fiscal-stimulus-2020-07-17", "published": 1594995140.0, "headline": "Gold, silver futures settle higher to tally a sixth weekly gain in a row", "body": "Gold futures on Friday registered a sixth weekly gain in a row, buoyed by a combination of rising expectations for additional fiscal stimulus in Europe and the U.S. as well as uncertainty over the global economic outlook as the COVID-19 cases continue to rise. Both gold and silver traded up for the sixth straight week, trying to “establish a base” around $1,800 for gold and around $19 for silver, said Fawad Razaqzada, market analyst at ThinkMarkets. Investment demand for the metals “should offset any weakness for jewelry purchases, due to ongoing economic uncertainty and, more to the point, a prolonged period of zero or sub-zero interest rates,” he said in a market update. “What’s more, the U.S. dollar remains out of favour despite bouncing here and there.” Given that, “noninterest-bearing and buck-denominated gold and silver stand ready to benefit further,” said Razaqzada. Meanwhile, “silver, which is also and industrial material, could experience relatively higher demand compared with gold as the world economy recovers from the pandemic.” Gold for August delivery GC00, +2.17% on Comex rose $9.70, or 0.5%, to settle at $1,810 an ounce, while September silver US:SIU20 added 19 cents, or 1%, at $19.764 an ounce. Gold logged a nearly 0.5% weekly rise and was up 18.8% for the year to date after hitting its highest level since 2011 earlier this month and moving within striking distance of its all-time high. Silver ended more than 3.7% higher for the week. Most-active gold and silver contracts logged a sixth straight weekly rise, according to FactSet data. “Gold prices are steadily rising as investors start to raise their stimulus expectations on coronavirus second wave fears,” said Edward Moya, senior market analyst at Oanda, in a note. “Gold is also starting to benefit from election risk, as Wall Street can’t ignore the polls anymore and is starting to price in the risk of a Biden presidency,” given presumptive Democratic nominee Joseph Biden’s lead over President Donald Trump in the polls. The White House and lawmakers face increasing pressure to come up with an additional fiscal stimulus plan ahead of the expiration of supplemental unemployment benefits at the end of the month. Meanwhile, European Union leaders on Friday kicked off a two-day summit aimed at reaching an agreement on a €750 billion recovery fund. Read:European Union leaders say they are far apart on COVID-19 bailout deal Christopher Louney, analyst at RBC Capital Markets, argued that gold’s gains have been fueled in large part by the “inherent uncertainty” that has accompanied volatility in equity markets. “Risk overlays are playing a role in the stickiness of recent moves in gold flows and prices, but in our view, it is uncertainty that brought investors to the gold space in size this year and it is likely what is going to keep them there,” he said, in a note. Among other Comex metals, September copper US:HGU20 rose 0.1% to $2.9045 a pound and ended the week about 0.2% higher. October platinum PLV20, +3.99% rose 1.5% to $849.60 an ounce, up around 0.4% for the week, while September palladium US:PAU20 ended at $2,071.70 an ounce, up 2.3% for the session and posting a weekly rise of 3.9%."}]}