{"article": [{"url": "https://www.marketwatch.com/story/another-warning-from-1918-spanish-flu-for-covid-19-survival-does-not-mean-that-individuals-fully-recovered-2020-08-18", "published": 1599478220.0, "headline": "Another warning from the 1918 flu for COVID-19: â\u0080\u0098Survival does not mean that individuals fully recoveredâ\u0080\u0099", "body": "Thereâ\u0080\u0099s still so much we donâ\u0080\u0099t know. There is a cautionary note from the 1918 flu that has resonance in 2020, and it could reinvigorate social-distancing and mask-wearing behavior among those people who are feeling the fatigue of disruption to their daily lives: â\u0080\u009cWhile 1918 was deadly, most that contracted the virus survived. But survival does not mean that individuals fully recovered.â\u0080\u009d “ â\u0080\u0098The range of lingering health effects for those that contract COVID-19 and survive remains to be seen.â\u0080\u0099 ” â\u0080\u0094 Economists Brian Beach, Karen Clay and Martin Saavedra in a working paper analyzing impact of the 1918 flu Thatâ\u0080\u0099s according to a review of literature and studies on the 1918 flu by economists at Vanderbilt University in Nashville, Oberlin College in Oberlin, Ohio, and Carnegie Mellon University in Pittsburgh. â\u0080\u009cThe evidence suggests that, in 1918, those that survived the initial infection faced an elevated mortality risk and some physiological conditions never fully healed.â\u0080\u009d â\u0080\u009cThe first lesson from 1918 is that the health effects were large and diffuse. We may never know the true mortality consequences of 1918 because of incomplete or inaccurate record keeping, issues that also undermine our ability to quantify the impact of COVID-19,â\u0080\u009d they wrote. â\u0080\u009cThe range of lingering health effects for those that contract COVID-19 and survive remains to be seen.â\u0080\u009d The 2020 coronavirus and 1918 influenza are two highly contagious respiratory diseases that spread around the world in months. For the 1918 flu, healthier, younger people were most at risk. In 2020, itâ\u0080\u0099s older people with preexisting conditions. But even fit people have had problems long after theyâ\u0080\u0099ve developed the antibodies to the virus. SARS-CoV-1 in 2003 may provide more clues to what some patients can expect in 2020. This two-year study in the journal Respirology of a selected population published in 2010 of SARS survivors â\u0080\u009cshowed significant impairmentâ\u0080\u009d of diffusing capacity for carbon monoxide or lung function, exercise capacity and health status with a more significant adverse impact for health-care workers. A separate 2009 analysis of patients in Hong Kong in the aftermath of SARS-CoV-1 found that â\u0080\u009cpsychiatric morbiditiesâ\u0080\u009d (including anxiety and depression) and chronic fatigue among up to 40% survivors almost four years after falling ill. They recommended more long-term, public-health mental-health strategies to deal with the aftermath of such epidemics or pandemics. And SARS-CoV-2? A recent study of 60 COVID-19 patients published in the peer-reviewed medical journal Lancet this month found that 55% of patients in one study were still displaying neurological symptoms during follow-up visits three months later, including confusion and difficulty concentrating, as well as headaches, loss of taste and/or smell, mood changes and insomnia. Related:COVID-19 and 1918 flu have one depressing thing in common: exacerbating social and economic inequality Younger COVID-19 patients who were otherwise healthy are suffering blood clots and strokes. Many â\u0080\u009clong-haulersâ\u0080\u009d â\u0080\u0094 COVID-19 patients who have continued showing symptoms for months after the initial infection passed â\u0080\u0094 report neurological problems including confusion, difficulty concentrating, headaches, extreme fatigue, mood changes, insomnia, plus loss of taste and/or smell. Some 500 million people, or one-third of the worldâ\u0080\u0099s population, became infected with the 1918 â\u0080\u009cSpanish flu.â\u0080\u009d An estimated 50 million people died worldwide, with about 675,000 deaths occurring in the U.S., according to the Centers for Disease Control and Prevention. COVID-19 has now killed at least 889,542 people worldwide, and 188,954 in the U.S., Johns Hopkins University says. As of Labor Day, the U.S. still has the worldâ\u0080\u0099s highest number of COVID-19 cases (6,280,400). Worldwide, there have been at least 27,152,445 confirmed cases, which mostly does not account for asymptomatic cases. “ â\u0080\u0098Based on early clinical reports, significant cardiovascular complications with COVID-19 infection are expected.â\u0080\u0099 ” â\u0080\u0094 A study on long-term effects of COVID-19 published in JAMA Cardiology in March A review of cases published last March in the medical journal JAMA Cardiology concluded: â\u0080\u009cCoronavirus disease 2019 is associated with a high inflammatory burden that can induce vascular inflammation, myocarditis, and cardiac arrhythmias.â\u0080\u009d It added, â\u0080\u009cCardiovascular risk factors and conditions should be judiciously controlled per evidence-based guidelines.â\u0080\u009d COVID-19 may induce new cardiac issues and/or exacerbate underlying ones, the researchers said. â\u0080\u009cDuring most influenza epidemics, more patients die of cardiovascular causes than pneumonia-influenza causes. Given the high inflammatory burden of COVID-19, and based on early clinical reports, significant cardiovascular complications with COVID-19 infection are expected.â\u0080\u009d During the 1918 influenza pandemic as with COVID-19, wealthier people had a better chance of survival: Individuals of moderate and higher economic status had a mortality rate of 0.38%, versus 0.52% for those of lower economic status and 1% for those who were â\u0080\u009cvery poor,â\u0080\u009d economists Brian Beach, Karen Clay and Martin Saavedra wrote in the paper published this week. â\u0080\u009cCompared to individuals who lived in one-room apartments, individuals who lived in two-room, three-room, and four-room apartments had 34%, 41%, and 56% lower mortality, respectively,â\u0080\u009d they added. In 2020, multigenerational households have also faced similar challenges, especially those with elderly inhabitants and younger people who show no symptoms of the virus, experts say. Though the 1918 pandemic is forever associated with Spain, this strain of H1N1 was discovered earlier in Germany, France, the U.K. and the U.S. But similar to the Communist Partyâ\u0080\u0099s response to the first cases of COVID-19 in China and, some commentators say, the early days of the virus in the U.S., World War I censorship buried or underplayed those reports in an effort to maintain morale. President Woodrow Wilson did not make any public statements on the 1918 influenza in the early days of the pandemic. Surgeon General Rupert Blue said, â\u0080\u009cThere is no cause for alarm if proper precautions are observed.â\u0080\u009d Chicagoâ\u0080\u0099s director of public health said: â\u0080\u009cIt is our job to keep people from fear. Worry kills more than the disease.â\u0080\u009d Woodrow fell ill himself and later suffered a stroke. The Dow Jones Industrial Index DJIA, +0.56%, S&P 500 SPX, +0.87% and Nasdaq Composite COMP, +1.39% Â ended lower Friday ahead of the Labor Day Weekend. Doubts about traction for further fiscal stimulus from Washington may be one factor discouraging investors betting on Republicans and Democrats striking a deal to offer additional relief to consumers and businesses. AstraZeneca AZN, +1.16% Â , in combination with Oxford University; BioNTech SE BNTX, +1.23% Â and partner Pfizer PFE, -0.27% ; Johnson & Johnson JNJ, +1.39% ; Merck & Co. MERK, +1.59% ; Moderna MRNA, +0.09% ; and Sanofi SAN, -1.48% with GlaxoSmithKline GSK, +1.10% are among those currently working toward COVID-19 vaccines."}]}