{"article": [{"url": "https://www.marketwatch.com/story/most-people-dont-want-to-be-called-average-says-dan-egan-who-designs-financial-tools-for-them-anyway-2020-06-05", "published": 1592296460.0, "headline": "'Most people don't want to be called average,' says Betterment's Dan Egan, who designs financial tools for them anyway", "body": "Dan Egan's formal title right now is Director of Behavioral Finance and Investing at robo-advisor Betterment, but on his personal web site, he describes his life's work as \"helping us lead more fulfilling, smarter lives by understanding how psychology interacts with design, money, investing, spending and randomness.\" In practice, that means Egan helps design portfolios and other aspects of the way Betterment's nearly half a million customers interact with the platform. Egan says he's proud that Betterment investors have the lowest \"behavior gap\" he knows of - that is, the smallest gap between the potential returns they could ideally realize in the markets and the returns they actually wound up with. MarketWatch spoke with Egan in early June, a few months after the market shocks of the spring, which many observers believe had an outsized impact on individuals, for better and worse. The company says new accounts were up 25% in the first quarter compared to Q1 of 2019 - perhaps in part because Betterment rolled out a new banking product in the early months of the year. The interview that follows was edited for clarity. MarketWatch: What is the demographic of Betterment investors? Dan Egan: It's widespread. We have some as young as 18, and I know of one who's 92. About one-third are over 55. (If there's a typical client), it's someone in his or her mid-30s, living in a city, saving for both retirement and one to two other shorter term goals. MarketWatch: Could you talk about how you select exchange-traded funds for the portfolios? Egan: Most of it comes down to, how much return do we think the client is going to keep. One (other consideration) is the purpose or the target of the fund. We have some very vanilla market-cap based funds, some that tilt toward value or small cap. We have ones that target quantitative strategies like smart beta or income-oriented. Given a portfolio strategy mandate, we look at what are the best ways of fulfilling the mandate so the investor keeps as much as possible. Can get the exact same theme for a lower price, and we want a general form of liquidity: how easy is it to move in and out of the fund without losing value along the way. Read:ETFs behaving badly: 'exactly what they are supposed to do' or 'just what we feared'? MarketWatch: What did you observe among Betterment's investors through the market SPX, +0.87%  volatility in March and April? Egan: Since the disruption, we've been opening accounts at a quicker rate. Part of that is that we're offering a cash reserve product that's independent of a bank, with a good yield. (It can be) integrated with customers' investments. There were definitely people who'd been, for lack of a better word, waiting to buy the dip. If you were waiting, this removed the excuse not to get in. Also, a lot of people realized that we are entirely online. In a time when you're not going to be meeting with a financial advisor in person any time soon, we've been doing it this way for years. MarketWatch: There's recently been a push by ETF industry leaders to suggest a more comprehensive ETF labeling process. What are your thoughts? Egan: A big part of this is in the details, the delivery mechanism. A financial advisor who I know once said, the average person should be using Betterment. It was a great intent on his part. But most people don't want to be called average! If you label these things in some way that implies this is, say, a \"power tool,\" if you make complexity a good unto itself a lot of people will be attracted to it. While I think it's a good push to try to prevent retail investors from losing their life savings, making it seem exclusive negates that. Usually brokerage platforms don't have a good incentive to provide feedback loops because that would involve trading less, investing in things like simple low-cost index funds. They will make less money off that. They are good at encouraging speculative, concentrated investing. They're designed in a way that encourages improving their bottom line, not yours. (MarketWatch note: Egan wrote an opinion piece for MarketWatch a few years ago that outlined many of these principles.) “ \"If you make complexity a good unto itself a lot of people will be attracted to it.\" ” - Dan Egan, Betterment MarketWatch: There have been two stories recently about individual investors. One is that they're piling into the markets, understanding the notion that we may be a historical low that a savvy investor should take advantage of - but then at the same time, there have been lots of accounts of retail investors losing a lot of money in some fairly sophisticated products that maybe they shouldn't have been in. You have a lot of interest in how individual investors behave, so I'm curious about your take. Which group do you worry about more? What can we learn from both of them? Egan: One of the more interesting things is that there's no professional sports on to watch and casinos are closed. There is an aspect of this which is, this is entertainment. In order for it to feel exciting and fun it needs to be speculative. I think a lot of investors when they start getting into it, they want something very specific that they can have an opinion on. Like oil. it's easy to put into a construct and say it's going to go back up. Unless it blows up. For some investors, when they are sold complex products, they don't realize the inherent risks in themâ\u0080¦. What Betterment tries to do is make good, solid, unexciting investing be a little more fun and educational. We are not a trading platform, not a gambling hub. You are not going to lose all your money but you're probably not going to have a wild ride. Related:Are ETFs safe... for retail investors? MarketWatch: Could we talk a little about direct indexing? It seems like a really interesting idea that's beneficial to the end investor and pretty disruptive for Wall Street. I assume you're thinking about ways to offer it. Is it feasible? What would it allow? Egan: That's exactly that sort of thing we want to do. I look forward to the day when people can come in and tell us in human terms what they want to achieve. People are not all the same. Different people have different priorities even if they have the same rough values. People may be willing to take on more concentrated or expensive portfolios that have a better reflection of the way the world should be run. Figuring out how to connect the investors with the investments that really match them, allowing them to express themselves and we can match them with the set of investments that can match their values. The more clients that we have the more able we are to do that at scale. See:It's 'no fun' to be a small fund manager most of the time, Jan van Eck says - but right now is an exception"}]}