{"article": [{"url": "https://www.marketwatch.com/story/its-going-to-be-a-long-up-and-down-go-nowhere-summer-in-the-stock-market-but-dont-sell-yet-2020-06-29", "published": 1594366160.0, "headline": "Itâ\u0080\u0099s going to be a long, hot, up-and-down, go-nowhere summer in the stock market, but donâ\u0080\u0099t sell yet", "body": "Are stocks going to go up or down? Yes. Should you be risk-on or risk-off? Yes. Will COVID-19 headlines continue to batter the market, keeping uncertainty high and assets moving violently back and forth? An even more emphatic yes. Are we in a â\u0080\u009cconviction-lessâ\u0080\u009d market in which investors are grappling with what may feel like the greatest number of unknowns in history? You get where this is going. While it is admittedly hard to quantify whether there are more unknowns now than before, â\u0080\u009cinvestors remain wary,â\u0080\u009d as the team at research provider DataTrek put it in a Monday note. Combine that notion with the emerging consensus that markets are likely to remain volatile yet range-bound for some time, and you get that most uncomfortable of regimes: a market landscape with no momentum, no progress and, perhaps worst of all, no clear narrative. Evercore ISI analyst Dennis DeBusschere has been predicting â\u0080\u009cviolently flat marketsâ\u0080\u009d for some time now. In a note out Monday, DeBusschere added this: â\u0080\u009cInvestors should [expect] more sharp reversals in factor performance as the COVID narrative shifts.â\u0080\u009d Analysts at BCA Research said much the same thing in a Monday note titled â\u0080\u009cLimbo.â\u0080\u009d â\u0080\u009cNeutral is dull, neither hot nor cold, neither here nor there, and recommending a benchmark equity weighting in a balanced portfolio makes us restless,â\u0080\u009d wrote the analysts, led by Doug Peta. But, they added, thereâ\u0080\u0099s no reason to shift allocations until risk-reward dynamics become clear enough â\u0080\u009cto merit an underweight or an overweight.â\u0080\u009d Read:A â\u0080\u0098Hippocratic oathâ\u0080\u0099 for financial advisers? The SECâ\u0080\u0099s new â\u0080\u0098Regulation Best Interestâ\u0080\u0099 gets mixed reviews. Neither group thinks stocks have no chance of going up. â\u0080\u009cAs long as fatalities remain low and there are signs that re-openings can be managed, downside risk is limited,â\u0080\u009d DeBusschere said. â\u0080\u009cUltimately, job growth needs to accelerate and economic activity needs to return to something resembling normal, but in the near term, fiscal and monetary supports combined with low fatality data cold help push risk assets higher.â\u0080\u009d And BCA had this to say: â\u0080\u009cOver a one-year horizon, we remain overweight equities as we do not see the pandemic exerting a permanently negative impact on corporate earnings.â\u0080\u009d As for DataTrek, their view comes from a survey they conducted during the week of June 22. In response to the question, â\u0080\u009cwhere do you think the S&P 500 SPX, +0.87% Â will end the year?â\u0080\u009d The results: â\u0080¢ Up over 10% from current levels: 20% â\u0080¢ +5% to +10% from current levels: 21% (most popular by just 2 votes) â\u0080¢ Within 5% up or down from current levels: 21% â\u0080¢-5% to -10% from current levels: 18% â\u0080¢ Down more than 10% from current levels: 19% â\u0080\u009cWeâ\u0080\u0099ve never seen or done an investor survey over our many years in the business when every option from â\u0080\u0098really badâ\u0080\u0099 (down +10% from here) to â\u0080\u0098really goodâ\u0080\u0099 (+10%) got basically the same number of votes, and weâ\u0080\u0099re only talking about the next 6 months,â\u0080\u009d DataTrek co-founders Nicholas Colas and Jessica Rabe wrote. Despite all the uncertainty: the known unknowns, the unknown unknowns, and on and on, they remain just as cautiously optimistic as DeBusschere and BCA. â\u0080\u009cOur take has been that corporate profits are more knowable than economic conditions and equities should continue to rally after a several-week pause,â\u0080\u009d Colas and Rabe wrote. See:Hereâ\u0080\u0099s a hedge fund strategy that just might work for you"}]}