{"article": [{"url": "https://www.marketwatch.com/story/gileads-covid-19-drug-costs-2340-experts-say-thats-a-responsible-price-2020-06-29", "published": 1593497960.0, "headline": "Gileadâ\u0080\u0099s coronavirus drug will cost $2,340 â\u0080\u0094 which sounds expensive, but hereâ\u0080\u0099s why itâ\u0080\u0099s not", "body": "Gilead Sciences Inc.â\u0080\u0099s COVID-19 drug remdesivir will cost much less than Wall Street analysts had predicted in a move that likely points to a more measured, responsible approach to the pricing of treatments and vaccines during the pandemic. Shares of Gilead GILD, +0.82% Â gained 0.9% in trading on Monday following the pricing announcement made before the market opened. U.S. health officials separately said Monday morning that the government had reserved 500,000 courses of remdesivir for Americans through September, to be purchased by hospitals. The cost of remdesivir for a 5-day course of treatment is $2,340 in all developed countries, a price tag that is similar to cost-effectiveness estimates previously shared by a drug-pricing watchdog organization. There is one exception, however; in the U.S., the cost for a patient who has commercial health insurance, including a plan through their employer and purchased on the health exchanges, is $3,120. â\u0080\u009cBecause of the way the U.S. system is set up and the discounts that government health care programs expect, the price for U.S. private insurance companies will be $520 per vial,â\u0080\u009d Gilead CEO Daniel Oâ\u0080\u0099Day said in a statement. (The cost per vial for people covered by government health plans, including Medicare, Medicaid, and the Department of Veterans Affairs, is $390.) Read: U.K. trial sparks interest in dexamethasoneâ\u0080\u0099s potential as a treatment for severely ill COVID-19 patients While nearly 80% of roughly 2.1 Americans who have tested positive for COVID-19 are 64 years old or younger, according to the Centers for Disease Control and Prevention, older Americans who are likely covered by Medicare tend to develop more severe forms of the disease that require hospitalization. Severely ill patients who are on mechanical ventilators or oxygen support are indicated by the Food and Drug Administrationâ\u0080\u0099s emergency use authorization to receive remdesivir. Wall Street analysts view the price points as â\u0080\u009creasonableâ\u0080\u009d and â\u0080\u009cin line with expectations,â\u0080\u009d though SVB Leerinkâ\u0080\u0099s Geoffrey Porges said he had previously expected a U.S. price that was 75% higher than the Medicare price and 33% higher than the commercial health insurance price. Still, heâ\u0080\u0099s bullish at wider spread use of remdesivir among less severely ill COVID-19 patients, as well. In the U.S., physicians can prescribe drugs â\u0080\u009coff-labelâ\u0080\u009d at their discretion. â\u0080\u009cAt this price we expect routine adoption of remdesivir for almost all moderate to severe COVID patients in the U.S.,â\u0080\u009d he wrote in a note to investors. Gilead is also running clinical trials for an inhaled version of remdesivir and for its use in children. Analysts have largely been split on whether remdesivir will be a financial boon to Gilead. When Oâ\u0080\u0099Day told investors in May that the drugmaker spent $50 million in clinical-trial and manufacturing costs on remdesivr in the first quarter of 2020, that development costs for remdesivir could top $1 billion, and it had donated more than 100,000 doses of the drug because â\u0080\u009cit is the right thing to do,â\u0080\u009d at least three analysts downgraded the stock. Some, like Porges, had predicted a higher price point. â\u0080\u009cMany Wall Street analysts were urging and citing probable figures around $5,000 per treatment course,â\u0080\u009d Steven Pearson, president of the Institute for Clinical and Economic Review, which studies cost-effectiveness in medicine, said in a statement. â\u0080\u009cTodayâ\u0080\u0099s announced price can be viewed as a responsible decision from Gilead and a promising sign for pricing decisions of other treatments for COVID-19 on the horizon.â\u0080\u009d See also: Gilead expects to spend up to $1 billion on coronavirus drug this year, will donate 1.5 million vials Itâ\u0080\u0099s a sharp turn for Gilead, a company that became known in mainstream medical circles for its decision to price its hepatitis-C cure Sovaldi at $84,000 for a course of treatment back in 2013. The price tag was met with criticism â\u0080\u0094 journalist Steven Brill famously asked, â\u0080\u009cCan some reporter please take us into the meeting where the Gilead executives decided to charge a flat $1,000 per pill?â\u0080\u009d â\u0080\u0094 and set off a still going debate about how drugs are priced in the U.S. â\u0080\u009cGILD also appears to have done a more careful job articulating the rationale for pricing than in the past withâ\u0080\u009d hepatitis C, RBC Capital Markets analyst Brian Abrahams told investors. Based on this price point, Abrahams predicts $2.3 billion in revenue in 2020. That said, Rep. Lloyd Doggett (D-Texas) called the price â\u0080\u009coutrageousâ\u0080\u009d for â\u0080\u009ca very modest drug.â\u0080\u009d Remdesivir was authorized for its ability to speed up recovery and more quickly get people out of the hospital. It has not been proven to reduce death. Shares of Gilead are up 14.7% year-to-date. Since the start of the year, the Health Care Select Spector SPDR Fund XLV, +0.90% Â has declined 3.3% and the S&P 500 SPX, +0.87% Â is down 6.8%."}]}