{"article": [{"url": "https://www.marketwatch.com/story/the-military-is-giving-me-retirement-and-disability-pay-but-will-it-be-enough-to-retire-at-48-2020-07-22", "published": 1596279020.0, "headline": "The military is giving me retirement and disability pay â\u0080\u0094 but will it be enough to retire at 48?", "body": "Dear MarketWatch, Iâ\u0080\u0099m a 44-year-old military officer planning to retire in four years after 30 years of service. My retirement pay should be about $76,000 a year, with an additional $16,000 a year in disability pay, based on my previous disability rating. I have a mortgage on my current home, but Iâ\u0080\u0099ll likely sell it when I retire and move to a state with no tax on military retirement pay. Medical will be inexpensive for my wife and I, but my daughter will be starting college and Iâ\u0080\u0099m responsible for half of that cost. I only have about $50,000 in savings with no retirement accounts (a Thrift Savings Plan or 401(k) plan). Watch video: 80% of older Americans canâ\u0080\u0099t retire â\u0080\u0094 COVID-19 isnâ\u0080\u0099t helping My wife recently started working for the federal government and hopes to stay on with them after I retire from the military. Sheâ\u0080\u0099s also starting a doctoral program at USC that will cost about $115,000. Iâ\u0080\u0099m still considering retirement in the next four or five years, but sheâ\u0080\u0099s planning on staying in the workforce a little longer. Can I retire at 48 and have my retirement and disability pay alone cover us for life? Or should I work another 10 years and save more money? Thanks for your help. See: Iâ\u0080\u0099m a 32-year-old stay-at-home mom, and my husband earns $150,000 a year. Will I ever be able to enjoy a retirement? Dear Military Officer, Thank you for your service, and for your question. Military officers have so much to think about when theyâ\u0080\u0099re retiring, especially the overall shift toward a civilian lifestyle and what theyâ\u0080\u0099ll do in that time. With so many decisions to make, itâ\u0080\u0099s important you have a comfortable nest egg to fall back on â\u0080\u0094 especially if you have so many responsibilities you want, or need, to fund. The fact that you will receive retirement and disability pay for your service after you retire is great â\u0080\u0094 not many people have that opportunity and it will certainly help you in retirement. But the main question financial advisers had when we discussed your question is this: will that monthly income be sufficient to meet your current cost of living? You didnâ\u0080\u0099t provide how much you earn at your current job, or how much you and your wife earn jointly now that she is working for the federal government. To answer this question, youâ\u0080\u0099ll have to take a hard look at your current spending and compare it to the income you expect youâ\u0080\u0099ll receive in retirement between all of your future anticipated income combined. Considering you intend to help your daughter through college and the two of you will also have your wifeâ\u0080\u0099s doctoral program to pay for, as well as a potential move on the horizon, the answer to this question may be no. â\u0080\u009cHeâ\u0080\u0099ll never have to worry about putting food on the table, but he may not be able to fix a hole in the roof,â\u0080\u009d said Curtis Sheldon, president and lead planner of financial advisory firm C.L. Sheldon & Company, which works primarily with military professionals and veterans. In this vein, to answer one of your questions: Entering retirement with $50,000 in savings at such a young age may not be the best choice if it can be avoided. But donâ\u0080\u0099t be discouraged. There are a few considerations you can make to offset those expenses, and itâ\u0080\u0099s not too late to save more for retirement. Plus, you have so many important skills and qualities from your service to help you as you transition to a new lifestyle. The fact that you ask the question now is great, as many military service members only question their retirement security as theyâ\u0080\u0099re transitioning, said George Reilly, founder of Safe Harbor Financial Advisers, who works primarily with military members and previously served in the Navy. â\u0080\u009cI commend him for thinking about these things four years out,â\u0080\u009d he said. â\u0080\u009cThereâ\u0080\u0099s still time.â\u0080\u009d Financial advisers suggested you get started with a retirement account, such as the Thrift Savings Plan. There are myriad reasons why someone isnâ\u0080\u0099t able to fund a retirement account, but if youâ\u0080\u0099re able to do so, start as soon as you can. These investment vehicles work best the longer they exist because of the time value of money and compounding interest. The financial advisers I spoke with suggested you choose the Roth version, which is funded with after-tax dollars, because of your earnings pre- and postretirement (taking into account your wifeâ\u0080\u0099s wages too). A traditional account is funded with pretax dollars and the money is taxed at withdrawal. Hereâ\u0080\u0099s more on the pros and cons of either choice. The earlier you start to use these accounts, the more time and opportunity they have to grow with contributions and investment returns. Should you choose to work after the military, you can roll your TSP into another retirement account with your new employer or into an individual retirement account, Reilly said. Your wife should also look into enrolling in an employer-sponsored retirement account, if she hasnâ\u0080\u0099t already. You mention moving to a state that doesnâ\u0080\u0099t tax retirement income. Thatâ\u0080\u0099s definitely an option, but donâ\u0080\u0099t let it anchor you in your decision of where to live. There are so many other factors to consider when relocating, such as the cost of the new home and mortgage, transportation, proximity to good health care and family, and the recreation and entertainment the new spot offers. Moving to a state that doesnâ\u0080\u0099t tax retirement pay will save you about 5%, which is of course money well saved, but that shouldnâ\u0080\u0099t automatically merit a move on its own, said Christy Raines, president and founder of Azimuth Wealth Management, who works with military service members and whose husband retired from the Air Force. Retirement pay is taxable on the federal level, and state depending on where you live (as you know), but disability pay is not taxable â\u0080\u0094 so some of that money wonâ\u0080\u0099t be taxed regardless where you live. Also, calculate how much your home equity is now and how you anticipate using that if you move. Investing in a retirement plan is important, but if you donâ\u0080\u0099t have much in terms of home equity, you may want to divert some of that savings to go toward a 20% down payment in another housing market, she said. As for your daughter and wifeâ\u0080\u0099s education, have you used all of the credits under the Post-9/11 GI Bill, and if not, are you eligible to transfer it to either person before you retire? Try finding the answer to that question as soon as you can, Raines said. Transferring the credits to a dependent triggers a four-year service obligation, which would fall right around the time of your retirement. If thatâ\u0080\u0099s not an option, and you have excess cash flow to save, Reilly suggests using a 529 plan, which is administered by the state and is used to pay for education expenses. There are more options for grants for graduate programs versus undergraduate studies, he said, so itâ\u0080\u0099s worth searching for one for your wife. There are a few other things you might want to consider: life insurance and the spousal survivor benefit. When you retire, you have an option to get life insurance from the Veteransâ\u0080\u0099 Group Life Insurance, but that may not be the best option for you. You get a lower benefit at a higher cost, the advisers said. Depending on your insurability, such as if you have health issues and what they are, you may not qualify for more cost-effective life insurance policies outside of the VGLI, but it is worth looking into. The spousal survivor benefit election, which determines if you pay a premium for an annuity-like benefit for your spouse should you pass prematurely in retirement, is made at the time of retirement, but itâ\u0080\u0099s something to start thinking about now. â\u0080\u009cIf you donâ\u0080\u0099t choose wisely on those, you may regret it,â\u0080\u009d Reilly said. Also see:Iâ\u0080\u0099m retired, my wife isnâ\u0080\u0099t â\u0080\u0094 how should we pay off our $60,000 mortgage before she retires? Not only should you think about what your current spending is compared with your retirement income, but you should also try to estimate what your expenses will be like postretirement. Military service members are offered numerous benefits, such as housing allowances, while on active duty, which â\u0080\u009cartificially inflates earnings,â\u0080\u009d Reilly said. When you exit the military, your cost of living may change with it â\u0080\u0094 all while seeing a reduction in wages too. A cash buffer will help substantially, especially if you take your time to find a new job, Sheldon said. â\u0080\u009cA cash buffer reduces stress,â\u0080\u009d he said. â\u0080\u009cIn his case, heâ\u0080\u0099s talking about stopping something that has defined him for 30 years of his life and moving to a different state. Thatâ\u0080\u0099s a lot of stress.â\u0080\u009d Finances aside, you should also ask yourself what you plan to do in retirement. You would be retiring at a pretty early age if you left the workforce at 48. Taking on another job would not only help you pay down some education expenses, but if you weigh your options and choose a new job you really love, you might be happier than if you entered retirement with no concrete plans of how to spend that time. â\u0080\u009cRetiring from the military is a massive opportunity to hit that hard reset on their finances,â\u0080\u009d Raines said. For the last three decades, many of your decisions have been made for you, such as where you live and how much youâ\u0080\u0099ll earn, she said. Now, you get to design your life exactly as you wish, and choose where your money will come from and where it will go. Ask questions like where do you want to live, whatâ\u0080\u0099s important to you and your family and how would you like this next chapter to play out. â\u0080\u009cVeterans who are transitioning from the military have so many opportunities career-wise,â\u0080\u009d she said. As retirement gets closer, juggling all of these questions and choices may become very overwhelming. â\u0080\u009cItâ\u0080\u0099s a balance of patience and persistence as you go through the retirement process,â\u0080\u009d Raines said. â\u0080\u009cThe most important thing in transitioning is that the core qualities that made you that officer youâ\u0080\u0099re taking with you to the next chapter.â\u0080\u009d Have a question about your own retirement savings? Email us at HelpMeRetire@marketwatch.com."}]}