{"article": [{"url": "https://www.marketwatch.com/story/biden-says-very-top-of-government-should-call-for-mask-wearing-in-jab-at-trump-2020-06-30", "published": 1593528140.0, "headline": "Biden says â\u0080\u0098very topâ\u0080\u0099 of government should call for mask wearing, in jab at Trump", "body": "Joe Biden on Tuesday said that the â\u0080\u009cvery topâ\u0080\u009d of the U.S. government should signal decisively that wearing a mask can help to slow the spread of the coronavirus, reflecting unambiguous guidance from public health experts. â\u0080\u009cWe absolutely need a clear message from the very top of our federal government that everyone needs to wear a mask in public,â\u0080\u009d said presumptive Democratic presidential nominee Biden in a speech in Wilmington, Del. The former vice presidentâ\u0080\u0099s comments appeared to be a thinly veiled criticism of President Donald Trumpâ\u0080\u0099s stance on mask wearing and the commander-in-chiefâ\u0080\u0099s expressed reluctance in donning personal protective equipment amid the worst public health crisis in a more than a century. Trump has mostly said he is disinclined to wear a mask in public, even as the Centers for Disease Control and Prevention recommends wearing them. Goldman Sachs GS, -0.21% has projected that a lack of a national policy mandating the use of facial coverings throughout the U.S. is delivering an unnecessary hit to the domestic economy. Mask wearing could save the U.S. economy from a 5% hit to GDP, researchers at the investment bank said in a recent report. Read:Goldman Sachs has done the math and a national mask mandate to halt the spread of coronavirus would have a big impact on the U.S. economy Biden made his remarks during a broad speech on U.S. policy on the response to the spread of COVID-19, which is transmitted primarily via droplets carrying the novel strain of coronavirus that causes the deadly illness. On Monday, Jacksonville, Fla., put in place a mask requirement. The city is hosting the Republican National Convention on Aug. 27. Jacksonville was selected as the site of speeches and other RNC events, following Trumpâ\u0080\u0099s complaints over rules for the long-planned convention in Charlotte, N.C. Charlotte will still host some official convention business. Now see:Republican convention host city Jacksonville, Fla., to require mask wearing In Charlotte, Trump and the RNC had demanded that the convention be allowed to move forward with a full crowd and no face coverings. Asked about Trumpâ\u0080\u0099s view on masks, White House press secretary Kayleigh McEnany said it was the presidentâ\u0080\u0099s choice. â\u0080\u009cHe encourages people to make whatever decision is best for their safety, but he did say to me he has no problem with masks and to do whatever your local jurisdiction requests of you,â\u0080\u009d she told reporters on Monday. In his comments, Biden said that a state-by-state approach to public health policy hasnâ\u0080\u0099t worked to sufficiently tamp down the outbreak thus far. Check out a video of his comments about the response to the pandemic via CNN: iframe.twitter-tweet { width: 100% !important; }"}]}