{"article": [{"url": "https://www.marketwatch.com/story/best-buy-reports-earnings-beat-and-declares-dividend-but-shares-fall-after-cautious-look-ahead-2020-08-25", "published": 1598341580.0, "headline": "Best Buy reports earnings beat and declares dividend but shares fall after cautious look ahead", "body": "Best Buy Co. Inc. BBY, +1.45% shares fell 3.8% in Tuesday premarket trading after the company reported a fiscal second-quarter earnings and revenue beat, but took a cautious tone for the future. Net income of $432 million, or $1.65 per share, was up from $238 million, or 89 cents per share, last year. Adjusted EPS of $1.71 blew past the FactSet consensus for $1.04. Revenue of $9.91 billion was up from $9.54 billion last year and also ahead of the FactSet consensus of $9.73 billion. Best Buy stores were open by appointment only for the first six weeks of the quarter due to COVID-19. Online sales grew 242.2% for the period. Enterprise comparable sales rose 5.8% with domestic same-store sales were up 5.0%. FactSet forecast comparable sales growth of 2.3% with domestic comparable sales forecast to grow 2.9%. International comparable sales grew 15.1%, well ahead of the FactSet consensus for 8.8% growth. Tablets and appliances were some of the big sellers for the quarter, with large appliance and home theater merchandise sales growing as stores opened, according to a statement from Best Buy Chief Executive Corrie Bary. For the first three weeks of the third quarter, sales are up about 20%, she said. Best Buy has declared a dividend of 55 cents per share payable on October 6 to shareholders of record as of September 15. However the company did not give financial guidance due to uncertainty from the coronavirus pandemic. \"Overall, as we plan for the back half of the year, we continue to weigh many factors including potential future government stimulus actions, the current shift in personal consumption expenditures from areas like travel and dining out, the possible depth and duration of the pandemic, the risk of higher unemployment over time, and the availability of inventory to match customer demand,\" said Best Buy's Chief Financial Officer Matt Bilunas in a statement. Experts and other retailers have talked about the slow start to the back-to-school season and the impact that the ongoing pandemic will have on the shopping calendar heading into holiday shopping. Best Buy shares have rallied 33.7% for the year to date while the S&P 500 index SPX, +0.87% has gained 6.2% for the period."}]}