{"article": [{"url": "https://www.marketwatch.com/story/ocasio-cortez-thanks-tiktok-teens-who-tricked-trump-campaign-2020-06-21", "published": 1592774720.0, "headline": "Ocasio-Cortez thanks â\u0080\u0098TikTok teensâ\u0080\u0099 she says â\u0080\u0098trickedâ\u0080\u0099 Trump campaign", "body": "Kids these days. Trumpâ\u0080\u0099s big campaign rally in Tulsa wasnâ\u0080\u0099t as big as promised â\u0080\u0094 the arena seats more than 19,000 people but only a reported 6,200 Trump supporters occupied the general admissions sections. Why? Both sides of the political aisle were armed with answers. The man leading the presidentâ\u0080\u0099s re-election efforts explained away the no-shows. â\u0080\u009cRadical protestors, fueled by a week of apocalyptic media coverage, interfered with @realDonaldTrump supporters at the rally,â\u0080\u009d Brad Parscale explained. â\u0080\u009cThey even blocked access to the metal detectors, preventing people from entering.â\u0080\u009d Trump, for his part, took to the stage and backed that assessment, saying the mediaâ\u0080\u0099s urging of his supporters not to attend on top of the protesters outside kept the crowds away. â\u0080\u009cWe begin our campaign,â\u0080\u009d Trump said. â\u0080\u009cThe silent majority is stronger than ever before.â\u0080\u009d But New York Democrat Alexandria Ocasio-Cortez isnâ\u0080\u0099t buying it, and she shared her appreciation with those she believes duped the Trump administration: iframe.twitter-tweet { width: 100% !important; } Ocasio-Cortz was referring to the teenage TikTok users and K-pop fans who were reportedly behind the â\u0080\u009cmillionsâ\u0080\u009d of ticket requests ahead of the event. After the Trump campaignâ\u0080\u0099s official account posted a tweet asking supporters to register for free tickets earlier this month, the youngsters decided to prank the administration by pushing followers to sign up but not show. If true, it sure seemed to work: iframe.twitter-tweet { width: 100% !important; } â\u0080\u009cIt spread mostly through Alt TikTok â\u0080\u0094 we kept it on the quiet side where people do pranks and a lot of activism,â\u0080\u009d YouTuber Elijah Daniel, 26, told the New York Times. â\u0080\u009cK-pop Twitter and Alt TikTok have a good alliance where they spread information amongst each other very quickly. They all know the algorithms and how they can boost videos to get where they want.â\u0080\u009d Daniel, who took part in the prank, said most of the people deleted the evidence after the first day so that the Trump campaign wouldnâ\u0080\u0099t catch wind. â\u0080\u009cThese kids are smart and they thought of everything,â\u0080\u009d he said. Erin Hoffman was one of those â\u0080\u009ckids,â\u0080\u009d apparently. â\u0080\u009cTrump has been actively trying to disenfranchise millions of Americans in so many ways, and to me, this was the protest I was able to perform,â\u0080\u009d she told the Times. â\u0080\u009cHe doesnâ\u0080\u0099t deserve the platform he has been given.â\u0080\u009d Hoffman also persuaded her parents to reserve two tickets. With all the buzz over the prank, #TikTokTeens was trending on Twitter TWTR, -0.23% Sunday: iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Meanwhile, Team Trump focused on the positives: iframe.twitter-tweet { width: 100% !important; } And Parscale followed up denying the validity of the reports. â\u0080\u009cLeftists and online trolls doing a victory lap, thinking they somehow impacted rally attendance, donâ\u0080\u0099t know what theyâ\u0080\u0099re talking about or how our rallies work,â\u0080\u009d he said. â\u0080\u009cRegistering for a rally means youâ\u0080\u0099ve RSVPed with a cell phone number and we constantly weed out bogus numbers, as we did with tens of thousands at the Tulsa rally, in calculating our possible attendee pool.â\u0080\u009d He added that the â\u0080\u009cphony ticket requestsâ\u0080\u009d didnâ\u0080\u0099t factor into the calculations."}]}