{"article": [{"url": "https://www.marketwatch.com/story/gold-gains-ground-as-coronavirus-cases-continue-to-increase-2020-07-13", "published": 1594649000.0, "headline": "Gold tallies first gain in 3 sessions as coronavirus infections extend rise", "body": "Gold prices tallied their first gain in three sessions on Monday, with analysts tying support to a global rise in the number of COVID-19 cases and strong investment in gold-backed exchange-traded funds. With ETF investment continuing to flow in, “uncertainty from expanding second wave of infections and U.S. [Treasurys] last week returning to the vicinity of the ‘panic highs’, we leave the bull camp with an edge,” analysts at Zaner Metals, wrote in a note Monday, adding that Friday marked an 11th straight daily inflow to gold-backed ETFs. Gold for August delivery US:GCQ20 on Comex rose $12.20, or 0.7%, to settle at $1,814.10 an ounce. Gold pulled back Thursday and Friday after ending Wednesday at its highest level since September 2011. The yellow metal remained positive for the week, rising 0.7% for its fifth straight weekly gain to leave it up by around 18% for the year to date. Monday’s gain “shows that price falls such as that on Friday are still being viewed as buying opportunities and that the market wants the price to climb even further,” said Carsten Fritsch, analyst at Commerzbank, in a note. “While gold has already achieved all-time highs in virtually all major currencies this year, it is still a good $100 from doing so in U.S. dollar terms,” he said. “There are plenty of arguments in favor of further price rises: the number of new [coronavirus] cases is still soaring at a record rate, both world-wide and in the U.S. This increases the potential for stock market corrections.” Read:Why gold has become a ‘weapon of choice’ for investors Total U.S. coronavirus cases exceeded 3.3 million on Monday and the nation’s death toll topped 135,000, the Wall Street Journal reported, citing data compiled by Johns Hopkins University. Silver futures, meanwhile, settled a nearly four-year high Monday, with the September silver contract US:SIU20 up 73 cents, or 3.9%, to finish at $19.788 an ounce. That was the highest most-active contract settlement since September 2016, according to Dow Jones Market Data. “While silver could be subjected to aggressive physical selling in the event of a worldwide economic letdown from surging infections, its charts remain very bullish,” analysts at Zaner Metals said. “Furthermore, on Friday, silver [exchange-traded funds] saw a massive single day inflow of 9.5 million ounces” bringing the year to date purchases up to 211.3 million ounces. Among other metals traded on Comex, September copper US:HGU20 tacked on 2% to $2.955 a pound. October platinum PLV20, +3.99% rose 2% to $863 an ounce and September palladium US:PAU20 settled at $2,040.90 an ounce, up 2.3%. Most-active palladium futures haven’t settled above $2,000 since June 8, FactSet data show. “While we remain highly skeptical of the palladium bull market, the charts over the past two weeks have shifted positive with the highest trade since early June seemingly linking the market back with gold and silver,” said analysts at Zaner Metals. “Unfortunately as in other physical commodity markets, the trade could be threatened with a downward adjustment in physical/industrial demand expectations in the event a risk off week unfolds in the wake of the infect[ion] surge,” they said. Still, it’s possible that the platinum group metals market “could suddenly join ranks with gold and silver as a part of the safe haven sector…”"}]}