{"article": [{"url": "https://www.marketwatch.com/story/the-euro-is-at-its-highest-since-may-2018-heres-why-that-means-more-stimulus-may-be-on-the-way-2020-08-18", "published": 1597830560.0, "headline": "Euro's two-year high nudges ECB toward more bond-buying", "body": "The European currency traded at $1.19 on Tuesday EURUSD, +0.60%, up almost 7% since the beginning of the year and more than 11% since March 20, around the time lockdowns were being implemented throughout the continent. - The European currency is now at its highest since May, 2018, and was boosted last month by the European Union's agreement on a â\u0082¬750 billion ($820 billion) coronavirus recovery fund financed by joint borrowing. It has also risen 7% EURGBP, -0.26%  against the pound sterling since the beginning of the year. - The euro's strengthening poses a challenge to current monetary policies. It keeps a lid on inflation, because prices of imported goods decline. But the European Central Bank has been for years at pains to reach its \"below but close to\" 2% annual target (its only official remit), and is trying, on the contrary, to boost inflation - and growth. It estimates that inflation is now at an annual 0.4%. - Furthermore, the currency's appreciation makes exports more expensive on foreign markets, which could weaken the recovery in the trade-oriented European economy. So far, the recovery in most European countries is mostly based on domestic consumption; households resume spending after three months of forced savings, and find their way back to shops or restaurants. But the strong euro will start to hurt European companies when the economy returns to normal and world trade picks up. The outlook: Officially, the ECB doesn't target the exchange rate, as its officials keep repeating. But that doesn't mean it is indifferent. And the central bank's level of discomfort tends to rise when the euro rises above the $1.15 mark. What matters here is that a strong currency gives ammunition to the advocates of more monetary stimulus down the line, notably in the form of additional bond-buying - on top of the â\u0082¬1,350 billion it is already spending to fight the recession. And more monetary stimulus will also make it cheaper for governments to finance their deficits on financial markets."}]}