{"article": [{"url": "https://www.marketwatch.com/story/airlines-confirm-fears-that-travel-demand-dropped-as-new-covid-19-cases-rose-again-in-july-2020-07-23", "published": 1595577080.0, "headline": "Airlines confirm fears that travel demand dropped as new COVID-19 cases rose again in July", "body": "Several airlines have confirmed what many have feared, that the recent spike in COVID-19 cases in many U.S. states has caused consumers to rethink their travel plans, just as the economy was starting to recover from the business lockdowns in the spring. It was no surprise that airlines swung to large losses in the second quarter as they operated just a fraction of the flights they did a year ago, with the coronavirus crisis in high gear early in the quarter. But the carriers reported significant improvements in results as the quarter progressed, as lockdown measures were gradually lifted across the country helping to fuel the release of pent-up demand for travel. Also read: Coronavirus update: Global COVID-19 cases top 15 million as U.S. edges closer to 4 million, and California has more cases than New York. “ “Although it is natural to expect the large growth bounce in May and June that resulted from reopenings to fade, we believe the signal that July spending gains are moderating also reflects drags related to failures to break the link between mobility and the virus.” ” — J.P. Morgan’s Michael Hanson in his “Daily Economic Briefing” research note. But heading into mid-July as many states started reporting record daily increases in new COVID-19 cases, government data showed that the number of travelers had started declining again last week, snapping a long weekly streak of increases. Here’s what the airlines that reported earnings results since Wednesday said about July demand: • American Airlines Group Inc. AAL, +0.34% — “While May and June revenue trends were encouraging, demand has weakened somewhat during July as COVID-19 cases have increased and new travel restrictions have been put into place.” • Southwest Airlines Inc. LUV, +1.89% — “We were encouraged by improvements in May and June leisure passenger traffic trends, compared with March and April; however, the improving trends in revenue and bookings have recently stalled in July with the rise in COVID-19 case.” • Alaska Air Group Inc. ALK, +0.15% , from Alaska Airlines President Benito Minicucci in the post-earnings conference call with analysts, according to a FactSet transcript — “[W]e’ve seen some of these upward trends stall more recently as many of the geographies where we fly have experienced an increase in case levels which caused many of the local reopening plans.” • Spirit Airlines Inc. SAVE, +1.35% , from Chief Commercial Officer Matt Klein in a post-earnings call with analysts, according to a FactSet transcript — “We were very encouraged by the trends we were seeing for summer travel throughout the month of June. But unfortunately, as the headlines turned negative in mid-June regarding the increase of COVID-19 cases, demand for July pulled off a bit.” • United Airlines Holdings Inc. UAL, +0.32% Chief Commercial Officer Andrew Nocella in a post-earnings call with analysts, according to a FactSet transcript — “The recent uptick in COVID cases in late June and early July have temporarily stalled demand improvements we were seeing in June.” United also said in its earnings press release — “The company will continue to pro-actively evaluate and cancel flights on a rolling 60-day basis until it sees signs of a recovery in demand, and expects demand to remain suppressed until the availability of a widely accepted treatment and/or vaccine for COVID-19.” This commentary followed data from the U.S. Transportation Security Administration showing travel demand declined last week to snap a 12-week streak of increases since the COVID-19 bottom in mid-April. Don’t miss: Airline stocks drop as travel demand declines for first time in 13 weeks. And so far this week, the daily average of people going through TSA checkpoints has fallen further, to 598,901 from an average of 664,022 for the week ended Sunday, and from 609,179 during the first three weeks of last month, according to a MarketWatch analysis of TSA data. And there is some concern that the pullback in consumer demand has started spreading to other areas of the economy. • J.P. Morgan’s Michael Hanson, in his “Daily Economic Briefing” note on Thursday -- “Although it is natural to expect the large growth bounce in May and June that resulted from reopenings to fade, we believe that the signal that July spending gains are moderating also reflects drags related to failures to break the link between mobility and the virus.” Meanwhile, the airline sector held up well amid a broad stock market selloff on Thursday, with the U.S. Global Jets exchange-traded fund JETS, +0.16% rising 0.6% while the S&P 500 index SPX, +0.87% sank 1.2%. Year to date, however, the Jets ETF has tumbled 48.3% while the S&P 500 has inched up 0.2%."}]}