{"article": [{"url": "https://www.marketwatch.com/story/5-things-to-know-about-tesla-ahead-of-its-5-for-1-stock-split-2020-08-28", "published": 1598858660.0, "headline": "Five things you should know about Tesla ahead of its 5-for-1 stock split", "body": "Tesla Inc.shares will start trading Monday after a 5-for-1 stock split. The electric-vehicle maker TSLA, +1.89% announced the split on Aug. 11, saying it would “make stock ownership more accessible to employees and investors.” Shareholders of record as of last Friday will receive a dividend of four additional shares of common stock for each then-held share; these new shares were formally distributed after the closing bell Friday. Apple Inc. AAPL, +1.74% also begin trading on a split-adjusted basis on Monday. Here are five things to know about the Silicon Valley car company ahead of the split. A record stock run has boosted market cap to $409 billion Tesla shares have gained more than 400% this year, hitting 33 record closes in the process. The stock reached the latest on Thursday, when it closed at $2,238.75 and notched an intraday record of $2,295.60. The stock is up 56% in August, which is shaping up to be its best month since May 2013 and its third best month on record. See also:Tesla stock propelled higher by BofA and Morgan Stanley upgrades The stock rally has boosted the company’s market valuation to around $409 billion on Friday, and made it the eighth biggest company in the U.S. by market cap. Tesla’s market valuation places it between Dow Jones Industrial Average components Johnson & Johnson’s JNJ, +1.39% and Visa Inc. V, +1.80%. The latest string of records for Tesla came ahead of the stock split as well as a “battery day” that Tesla has set for Sept. 22. Wall Street views the event, a showcase of Tesla’s battery technology, as another potential catalyst for the stock.Wall Street remains cautious on the stock, for the most part For all the heady stock-market gains, most Wall Street analysts maintain a cautious view of Tesla. Of the 36 analysts covering Tesla’s stock and surveyed by FactSet, 19% rate the stock a buy, and 31% rate the stock a sell; the other 50% rate it a hold. The average share-price target on Tesla is $1,288.87, or around 42% below its latest pre-split level.Tesla’s stock run has lifted the shares of other EV makers These are heady days for shares of electric-vehicle makers, which several market observers pin at least in part on Tesla’s recent successes and ability to generate a fan base. Massive investment flows have gone to EV companies such as Nikola Corp. NKLA, -1.36% and China’s Nio Inc. NIO, +0.14%, Li Auto Inc. LI, -1.84% and X Peng Inc. XPEV, +0.70% have soared post their initial public offering prices. EV maker Fisker Inc. has filed for an IPO. Analysts at Deutsche Bank have called for General Motors Co. to spin off its electric-vehicle operations and capabilities into a stand-alone company, “which could force the market to recognize its robust EV technology and coming [vehicle] lineup,” they said in a note earlier this month. GM was said to be considering the option. Wall Street expects S&P 500 inclusion soon Tesla is slated to become part of the S&P 500 index SPX, +0.87% in the coming months. The company cleared a major hurdle to index inclusion when it reported in late July its fourth straight quarterly GAAP profit. Joining a major stock-market index would automatically get Tesla shares into the portfolios of thousands of index-tracking mutual funds, and send actively managed funds scrambling to catch up with it as well.What else changes on Monday? Monday will bring changes for the Dow Jones Industrial Average DJIA, +0.56% as well as the Apple and Tesla stock splits. S&P Dow Jones Indices announced a shake-up this month that goes into effect at the opening bell Monday. ExxonMobil Corp. XOM, -1.47%, a Dow component since 1928, will be replaced in the index by Salesforce.com Inc. CRM, +2.21% CRM, +2.21%. Pfizer Inc. PFE, -0.27% and Raytheon Technologies Corp. RTX, -1.46% are out, as well, replaced by biotech Amgen Inc. AMGN, -1.41% and industrial conglomerate Honeywell International Inc. HON, +0.34%. S&P Dow Jones said the changes were prompted by the Apple stock split, and energy investors have called Exxon’s removal from the index a “sign of the times.” Integrated energy company Chevron Corp. CVX, -1.62% remains a Dow component."}]}