{"article": [{"url": "https://www.marketwatch.com/story/97000-kids-tested-positive-for-the-coronavirus-in-just-two-weeks-in-july-2020-08-10", "published": 1597080560.0, "headline": "97,000 kids tested positive for the coronavirus in just two weeks in July", "body": "Children can indeed get the coronavirus. The American Academy of Pediatrics (AAP and the Children’s Hospital Association analyzed publicly reported data on kids and COVID-19 from 49 states, Puerto Rico and Guam, as well as New York City and Washington, D.C. Their report found that as of July 30, at least 338,982 children have tested positive for COVID-19 since the pandemic began. But the caseload could well be higher, as this report is missing complete data from Texas and parts of New York state outside of NYC. While that number may seem small compared to the overall 5 million confirmed cases of COVID-19 in the U.S., what’s quite alarming is that more than a quarter of those cases in children — or a little more than 97,000 kids — were reported in just the last two weeks of July. That marks a 40% increase in the number of American kids testing positive between July 16 and July 30 alone. And at least 86 children have died of COVID-19 since May. This spike in confirmed cases among children is happening as schools across the country are beginning to reopen for the fall. More than seven out of 10 of these new child cases were recorded in states in the south and west, according to the report, with Missouri, Oklahoma, Alaska, Nevada, Idaho and Montana among the states with the highest percent increase of kid infections. Many of these states also saw infections in the overall population spike toward the end of July, according to the New York Times tracker of cases by state. Northeast states and cities, including New Jersey, as well as NYC, showed more hopeful signs in containing the virus in the AAP report, as well as having the lowest percentage increase of child cases, despite being an early epicenter of the U.S. epidemic in March and April. In fact, New York Gov. Andrew Cuomo announced Monday that COVID-19 hospitalizations and ICU patients within the state have dropped to their lowest levels since March. iframe.twitter-tweet { width: 100% !important; } It should be noted that the age in which patients are considered “children” varied across states. While some states consider children to be anyone under 17 or 19, Florida and Utah capped the age limit at 14, while Alabama counted anyone under 24 as a child. The new report found that children overall rarely became severely ill with COVID-19, and they were hospitalized less frequently than adults. But the AAP also warned last week that Black and Hispanic children suffer much higher rates of infection and hospitalization with COVID-19, as well as more severe illness and coronavirus-related complications, compared to non-Hispanic white children. That’s akin to others studies that have shown adult minority populations, and Americans from lower socioeconomic backgrounds, have been hit much harder during the pandemic. The CDC also recently reported that Black and Hispanic children remain more likely to suffer the rare, but potentially fatal multisystem inflammatory syndrome in children (MIS-C) that is believed to result from kids being exposed to the coronavirus. Of the 570 cases of MIS-C reported to the CDC by July 29, almost three in four (more than 74%) were in Black and Hispanic children. Related:What parents should know about the mysterious coronavirus-related disease affecting kids: multisystem inflammatory syndrome in children The barrage of new studies and reports about kids and COVID-19 come as cities and states grapple with whether to reopen schools, and how to do so in a safe manner. Meanwhile, parents are deliberating whether to trust sending their children back into classrooms, or opt to spend big money cobbling together teaching pods and homeschooling programs to educate their kids in smaller groups. In fact, some schools that have already attempted to reopen have had to close again as students and staff have tested positive for the coronavirus. They include the Georgia high school that went viral last week after students posted pictures of crowded hallways and largely maskless students on social media. Read more:‘It was chaos!’ Students get suspended for posting pictures of packed halls — now the high school is closing after 9 people were infected One small study released earlier in August suggested that while kids might not get as sick or symptomatic as adults, little ones under age five may carry up to 100 times more of the virus in their noses than older kids or adults do. “People thought maybe [young children] can’t get infected, and that is not the case. They definitely do get infected,” study author and pediatric infectious diseases specialist Dr. Taylor Heald-Sargent recently told MarketWatch. “And once they get infected, they have rip-roaring amounts of virus.” Related:Kids under age 5 may carry a much higher coronavirus viral load than older children and adults: study A recent study of 47 COVID-19 infected children between the ages of 1 and 11 in Germany also found that even asymptomatic kids had viral loads on par with those of adults — if not higher. And a French study found that children without symptoms appear to have COVID-19 viral loads similar to those of children with symptoms. “So what I think our paper adds [to the discussion of kids and coronavirus] is this answer to whether children can get infected. They can,” Heald-Sargent said. “We don’t know that they’re spreading it, but we need to be cautious. It doesn’t mean schools can’t open; we just need to be safe about it.” Follow more of MarketWatch’s coronavirus coverage here."}]}