{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-retreat-amid-rising-coronavirus-cases-and-pickup-in-us-supplies-2020-06-24", "published": 1593012260.0, "headline": "Oil prices drop over 5% on rise in coronavirus cases and a third straight weekly climb in U.S. supplies", "body": "Oil prices lost more than 5% on Wednesday as evidence of rising coronavirus cases in many countries raised questions about efforts to restart global economies and U.S. government data reveal a third straight weekly climb in domestic crude inventories. “The real concern is the rise of [COVID-19] cases in several states,” including California, Texas and Florida, Tariq Zahir, managing member at Tyche Capital Advisors told MarketWatch, adding that these are not small states. There are concerns over a potential scale back on reopening the economy and worries about consumer demand, he said. The World Health Organization pointed to rising cases of coronavirus in the U.S., China, Latin America, reigniting worries of a possible second wave of the epidemic. The International Monetary Fund on Wednesday also slashed its economic forecast for 2020 to negative 4.9%, saying that the coronavirus pandemic has caused an unprecedented decline in global activity. “If the pandemic triggers a second round of lockdowns, [oil] storage will struggle to accommodate the unused oil and the gasoline uptick that we currently see will be scrapped if new travel restrictions are put in place,” wrote Paola Rodriguez Masiu, senior oil markets analyst at Rystad Energy, in a Wednesday report. West Texas Intermediate crude for August US:CLQ20 fell $2.36, or nearly 5.9%, to settle at $38.01 a barrel on the New York Mercantile Exchange. That was the lowest finish for a front-month contract in a week, according to Dow Jones Market Data. Global benchmark Brent oil for August delivery UK:BRNQ20 declined by $2.32, or 5.4%, at $40.31 a barrel on ICE Futures Europe, the lowest since June 15. “Oil became an easy target for anxious investors…thanks to rising coronavirus cases across the globe and a reported increase in crude inventories,” said Lukman Otunuga, senior research analyst at FXTM. The recent decline in oil prices “remains heavily influenced by demand-side dynamics” despite efforts by the Organization of the Petroleum Exporting Countries and their allies to rebalance markets, he told MarketWatch. The Energy Information Administration reported Wednesday that U.S. crude inventories rose for a third week in a row, by 1.4 million barrels for the week ended June 19. That compared with a forecast by analysts polled by S&P Global Platts for an average decline of 100,000 barrels. The American Petroleum Institute on Tuesday reported a climb of roughly 1.7 million barrels. The EIA data also showed crude stocks at the Cushing, Okla., storage hub fell by about 1 million barrels for the week, but total domestic oil production climbed by 500,000 barrels a day to 11 million barrels a day. Gasoline supply declined by 1.7 million barrels, while distillate stockpiles rose by 249,000 barrels. The S&P Global Platts survey had shown expectations for a supply decline of 1.9 million barrels for gasoline and an increase of 100,000 barrels for distillate inventories. On Nymex, July gasoline US:RBN20 fell by 7.9% to $1.1964 a gallon and July heating US:HON20 settled at $1.1508 a gallon, down 4.3%. Ahead of an EIA supply update due Thursday, July natural gas US:NGN20 lost 2.4% to $1.597 per million British thermal units."}]}