{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-steady-after-big-rally-to-start-august-11596527330", "published": 1596520160.0, "headline": "European stocks and Dow futures edge lower after big rally to start August", "body": "Workers assemble the powertrain with an electric motor and battery of a VW ID.3 electric cars at the Volkswagen factory on July 31, 2020, in Zwickau, Germany. Volkswagen has started taking orders for the car and is hoping the ID.3 will be an effective competitor to Tesla. Jens Schlueter/Getty Images European stocks edged back on Tuesday after the previous day’s rally, after a wave of manufacturing reports suggested a stronger economic recovery across the globe. After a 2% gain on Monday, the Stoxx Europe 600 SXXP, +0.55% slipped 0.3%. The French CAC 40 PX1, +0.71% added 0.3% while the German DAX DAX, +0.06% and U.K. FTSE 100 UKX, +0.64% declined. The moves came after the 29th record close for the Nasdaq Composite COMP, +1.39% on Monday, as the S&P 500 SPX, +0.87% added 0.7%. Futures on the Dow Jones Industrial Average YM00, +0.82% fell 45 points. Investors reacted to manufacturing surveys of purchasing managers, which were stronger than forecast in the U.S., China and Europe. “August is normally a difficult month for stocks but in the year of COVID no trends are sacred and equities are proving to be very resilient with the Nasdaq hitting an all-time high, whilst the S&P is knocking on the 3000 level,” said Rony Nehme, chief market analyst at Squared Financial. Further adding to optimism was the declaration from U.S. Vice President Mike Pence, who told Fox News in an interview that a coronavirus vaccine could come in the fall. BP BP, +0.56% shares rose over 6%, as investors looked past the $16.8 billion loss for the second quarter and the decision to cut its dividend in half. BP outlined a new plan to reduce oil and gas exploration by 40% over a decade while boosting spending on low-carbon activities. “We await more granular detail on the growth plans, but expect the market to react positively to the ambition and direction of travel,” said Henry Tarr, an analyst at Berenberg Bank. EasyJet EZJ, -4.22% shares surged 10%, as the airline said it spent £774 million in the June-ending quarter when it barely flew, versus previous guidance of £1 billion in costs. EasyJet said its load factor in July, when it flew more than two million people, was 84%. Diageo DGE, -0.27% shares slumped 5%, as the alcoholic-beverage maker said sales during the fiscal year fell a worse-than-forecast 9% and it didn’t offer up sales guidance for the current year."}]}