{"article": [{"url": "https://www.marketwatch.com/story/nearly-half-of-all-professional-women-make-this-money-mistake-and-its-easy-to-fix-2020-10-06", "published": 1602086300.0, "headline": "Nearly half of all professional women make this money mistake â\u0080\u0094 and itâ\u0080\u0099s easy to fix", "body": "More than one married female friend has confided in me she leaves the â\u0080\u009cmoney stuffâ\u0080\u009d to her husband. My professional self shakes her head â\u0080\u0094 these women are giving their financial power away, jeopardizing their retirement and making themselves ill-prepared for the realities of daily life without a partner. Unfortunately, these friends are not alone; among well-educated professional women almost half defer to their partners on financial decisions. This is true across ages and professions, even 29% of those in financial services do this, according to a recent UBS study. Though many enter marriage with the intention of sharing financial responsibility, they change course once married. This is true even for millennials, who defer to their spouses even more than Boomers (54% vs. 39%, according to the study). This issue goes beyond men and women, as 41% of women in same-sex relationships defer financial responsibility to their partner. The reasons for this range from lack of confidence to complacency to entrenched roles or to keep the peace in their relationships. Most women believe their spouse knows more, according to UBS. In fact, a partner doesnâ\u0080\u0099t always know what is best for the couple unless both speak up. Indeed, women often are better long-term investors. Some discussion and disagreement are necessary to come to the best financial decision for you as a couple. Deferring to anyone to prevent difficult conversations starts you on the path to financial problems, not a solution. Compromise and communication may lead to healthy trade-offs, better intimacy and accomplishing joint goals like an earlier retirement. One partner carrying all of the investment, financial and estate-planning decisions is a burden in a partnership. Even when the woman is the one who takes on all of this responsibility â\u0080\u0094 16% of the cases, according to UBS â\u0080\u0094 they are not being fair to themselves or their partner. In my 30 years of experience as a financial planner, I have heard the financial leader in the couple often say, â\u0080\u009cYou do not need to know the details. If something happens to me, call our financial advisor.â\u0080\u009d Thatâ\u0080\u0099s not a good answer, especially when eight of 10 women will be alone and financially responsible for themselves at some point. “ Change is a step-by-step process. ” A partnership is a partnership. A team works together and knows the plays, and all are prepared to jump into the big game because they practice together. Are you standing on the sidelines? With some questions and reflection, a couple can dive deep and change this approach. Start make a change with these steps: 1. Ponder why you are not involved. Are you following a pattern set by your family of origin? Is fear preventing you from financial matters, whether an emotional fear or math anxiety? Do spreadsheets make you cringe? Or do you believe money causes fights? (This is an emotional belief some hold because of witnessing parents or a previous marriage or viewing cultural norms.) 2. Ask yourself the bigger questions: Where would you like to be in 10 years? How would you like your financial picture to look? What would be different if you were in charge of the money? 3. Ask your partner to answer the same questions about what their money behaviors and patterns says about them. Then, share your answers â\u0080\u0094 discussing your history and feelings rather than finances. 4. Have a conversation with your partner what the two of you could do differently, from managing money to moving to a smaller house to buying a cabin as a second home or taking more vacations (after the pandemic, of course). Removing the details allows for a free flow of discussion and time to practice less intense money conversations. For years, Martha attended annual financial meetings with her husband, Sam. When I asked her questions, she would answer and offer her opinion; otherwise, she remained quiet and in full agreement with whatever Sam said. Then, one day, she was engaged, asked questions and was offering input without being asked. I was amazed at the change and told her I was impressed with her growth and interest. What was the impetus? â\u0080\u009cMy sister lost her husband suddenly,â\u0080\u009d she told me. â\u0080\u009cWatching her suffer and have to figure out where everything was financially made me realize I had to step up my financial game.â\u0080\u009dThe money date Change is a step-by-step process. Once you are in the habit of discussing your money together, plan a â\u0080\u009cmoney dateâ\u0080\u009d for more detailed sharing. Take an hour to do one of the following (marathon sessions accomplish little but exhaustion): 1. Gather your financial information. Know how to get into your investment and retirement accounts online. Ask your partner to set aside time to share all of the information for joint accounts and his or her benefit plans at work and retirement plans. Do the same with your work benefits. Establishing all the facts sets the stage for being well-informed partners. 2. File your financial information from debt to investments to insurance policies somewhere where you both have ready access. Choose what is comfortable for both of you: on the home computer or in a paper folder. Review together at least once a year. 3. Learn about personal finance by finding an article or two of interest, reading a book, or watching some videos online. Information is power My all-time favorite is â\u0080\u009cCouples and Moneyâ\u0080\u009d by Victoria Collins, who coined the term â\u0080\u009cmoney dateâ\u0080\u009d. Be wary if your partner wonâ\u0080\u0099t share the financial information or discuss money attitudes with you; he or she may be hiding a financial situation from you. This may be a red flag for more issues down the road. A study by the Centers for Financial Security found that 99% of domestic violence cases also involved financial abuse. Every true partnership means both people know where the information is and share in its responsibility. One person may pay the bills, but that is only one aspect of financial life. A full view is as easy as the steps above and take no more time than planning a vacation. CD Moriarty, CFP, is a columnist forMarketWatch and a personal-finance speaker, writer and coach. She blogs at Money Peace. You can ask questions that may be published by clicking here."}]}