{"article": [{"url": "https://www.marketwatch.com/story/warren-buffett-just-turned-90-heres-a-video-of-bill-gates-baking-him-a-cake-11598811211", "published": 1599309200.0, "headline": "Bill Gates says this might be â\u0080\u0098the most important thingâ\u0080\u0099 heâ\u0080\u0099s learned from Warren Buffett, who just turned 90", "body": "“ â\u0080\u0098Warren has the mental sharpness of a 30-year-old, the mischievous laugh of a 10-year-old, and the diet of a 6-year-old.â\u0080\u0099 ” Thatâ\u0080\u0099s Bill Gates ringing in his longtime pal Warren Buffettâ\u0080\u0099s 90th birthday on Sunday in a blog post that includes a video of the Microsoft MSFT, +2.48% co-founder baking a cake. â\u0080\u009cHe once told me that he looked at the data and discovered that first-graders have the best actuarial odds, so he decided to eat like one,â\u0080\u009d Gates wrote. â\u0080\u009cHe was only half-joking.â\u0080\u009d Hereâ\u0080\u0099s the video: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Gates went on to talk about one of their shared interests â\u0080\u0094 the love of math and numbers â\u0080\u0094 and related them to their friendship. 30: Number of years Warren has spent sleeping in his lifetime 10,649: Days since we met for the first time, on July 5, 1991 2: Phone numbers I have on speed dial at my officeâ\u0080\u0094Melindaâ\u0080\u0099s and Warrenâ\u0080\u0099s Incalculable: The impact Warren has had on the world by committing to give virtually all of his wealth back to society Gates said that the â\u0080\u009cunshakable sense of right and wrongâ\u0080\u009d is one of Buffettâ\u0080\u0099s most admirable qualities, and that he also has a â\u0080\u009cphenomenal eye for talentâ\u0080\u009d when it comes to building his business. Gates shared this photo of Buffett and his first wife and kids from the mid-1950s, which was around the time the Buffett Partnership was launched. â\u0080\u009cFor as long as Iâ\u0080\u0099ve known Warren, his approach to life and work has stayed constant,â\u0080\u009d Gates wrote in the blog post. â\u0080\u009cItâ\u0080\u0099s amazing, in fact, how little he has changed even as Berkshire Hathaway BRK.A, +0.06% has become wildly successful.â\u0080\u009d The most important thing Gates said he learned from him is the value of friendship, and he pointed to one quote in particular that Buffett once told a group of college students. â\u0080\u009cYou will move in the direction of the people that you associate with. So itâ\u0080\u0099s important to associate with people that are better than yourself. The friends you have will form you as you go through life,â\u0080\u009d Buffett said. â\u0080\u009cMake some good friends, keep them for the rest of your life, but have them be people that you admire as well as like.â\u0080\u009d"}]}