{"article": [{"url": "https://www.marketwatch.com/story/salesforces-nearly-30-stock-rally-this-week-is-a-possible-nightmare-scenario-for-the-dow-committee-11598473166", "published": 1598518640.0, "headline": "Salesforceâ\u0080\u0099s 30% stock rally this week is a possible â\u0080\u0098nightmareâ\u0080\u0099 scenario for the Dow committee", "body": "As part of a shake-up in the stocks comprising the Dow Jones Industrial Average announced earlier this week, Salesforce.com Inc. was among a trio of companies included in the venerable benchmark, but now its stock is soaring. Shares of Salesforce.com Inc. CRM, +2.21% were up 26% Wednesday and 30% so far this week. That run-up puts the companyâ\u0080\u0099s share price at $272, with the business-software provider picking up a cool $55 billion in market value since the end of last week, according to FactSet data. However, the share price jump could create a problem for S&P Dow Jones Indices, which announced that the 124-year old price-weighted Dow DJIA, +0.56% would be getting a makeover, effective Monday. Being added to the index are Salesforce, AmgenÂ Inc. AMGN, -1.41% Â andÂ Honeywell InternationalÂ Inc. HON, +0.34%, while Â Exxon Â Mobil Corp.,Â PfizerÂ Inc. PFE, -0.27% Â andÂ Raytheon TechnologiesÂ Corp. RTX, -1.46% are being jettisoned to reconfigure the blue-chip index in the wake of Apple Inc.â\u0080\u0099s decision to split its stock 4-for-1. The issue for the Dow however is that the rapid acceleration of Salesforceâ\u0080\u0099s price in a price-weighted benchmark could quickly make Salesforceâ\u0080\u0099s stock too influential, too fast, in the popular index. To be sure, that depends on the other price moves in the Dow. The Dow is a price-weighted measure, meaning the higher the stock price, the larger the sway for a particular component stock, and vice versa. That is different from indexes such as the S&P 500 SPX, +0.87% which is weighted by the market capitalization of the components. The shrinking influence of Apple AAPL, +1.74% on the Dow after its stock split effective next Monday means that the Dow needed more technology sector representation in its benchmark. Saleforce.com would enter the Dow on Monday as the fourth-most influential component by dint of the current share price, after having picked up nearly $65 in less than a week, assuming it holds its value into next week. Asked about the rapid surge in the price of Salesforce over the past several days, Howard Silverblatt, senior index analyst at S&P Dow Jones Indices, had this to say to MarketWatch during a Wednesday interview: â\u0080\u009cThat is whatâ\u0080\u0099s called the nightmareâ\u0080\u009d scenario. â\u0080\u009cWhat would we do if any [component of the Dow] takes over?â\u0080\u009d Silverblatt said that is something the committee which helps to select entrants into the Dow must contend with even as the group aims to tweak the storied index to best reflect the current landscape in the market and the economy. â\u0080\u009cThat is something that S&P monitors. However, the index has to represent the market,â\u0080\u009d he said. Salesforce is involved in a number of different aspects of tech that include software as a service, or SAAS, and cloud computing. The surge in Salesforceâ\u0080\u0099s shares, late Tuesday, also come after it posted record quarterly sales and raised its full-year guidance. It wouldnâ\u0080\u0099t be the first time, an index operator or provider was forced to quell the rapid rise of a companyâ\u0080\u0099s shares in a given index. Back in 2011, Nasdaq NDAQ, +0.36% announced a rare rebalancing of its Nasdaq-100 index NDX, +1.51% that reduced the weighting of Apple , which had surged fourfold over a two-year period to make up more than 20% of the entire index. That unusual rebalancing reduced the weighting of Apple in that market-weighted index to 12% at the time. Read: Why Dowâ\u0080\u0099s shake-up is bad for stocks added to itâ\u0080\u0094and less bad for those booted Thereâ\u0080\u0099s no guarantee that Salesforce will continue to see its shares climb, but factoring the price of its stock, as well as managing the rapid evolution of technology as a bona fide powerhouse of the economy in the era of a pandemic, is just one of the things that complicates the committeeâ\u0080\u0099s decisions to remove and exclude companies in the Dow. And those decisions arenâ\u0080\u0099t taken lightly. The Dow has made only 56 changes to its composition since 1896, Silverblatt said. Before the S&P Dow Jones Indicesâ\u0080\u0099 announcement at the end of Monday, the Dow hadnâ\u0080\u0099t seen a change of that magnitude until a similar move in 2013, when Goldman Sachs Group Inc.Â GS, -0.21% Â Visa Inc. V, +1.80% Â Â and Nike Inc.Â NKE, +0.97% Â were added. Â"}]}