{"article": [{"url": "https://www.marketwatch.com/story/this-70-year-old-lifelong-supersaver-has-a-new-habit-spending-like-crazy-11601992734", "published": 1602261080.0, "headline": "What should you with all that money you saved for retirement? This man is spending it, and it feels great", "body": "Getty Images/iStockphoto I woke up one morning, looked in the mirror and didn’t recognize the person looking back at me. Who is this person? It can’t be me. I’m not the same person I was five or six months ago. I don’t know if it’s the pandemic that caused me to behave differently or if I’m going through some kind of midlife crisis. No, it can’t be a midlife crisis. I’m almost 70 years old, plus I don’t feel my life is boring, empty or meaningless. In fact, I actually feel good about myself and my life. Read: The problem with aging in place Instead, what I don’t understand is why I have a different attitude toward money. All my life, I’ve been a supersaver. It was the main reason I was able to retire early. It sure wasn’t because of my investing skills. I was, at best, just an average investor. But recently, I’ve been spending gobs of money in ways I never would have in the past. I’m doing a complete remodel of my house. Of course, some of the work needed to be done, but not everything. If it didn’t involve a mountain of building permits and other paperwork, I’d probably have added on to the house, too. Oh, did I tell you I bought all new appliances and furniture for the house? If I were my younger self, I would say it was wasteful spending. But I’m not my younger self anymore. I’m someone else. I’m not just spending money on the house. I bought a car and I’m planning to buy another vehicle later this year. If it weren’t for COVID-19, I would be on my way to Europe for a month or two. In fact, I charged so much on my credit cards that I received a notice my credit score has dropped. I don’t care. That won’t stop me from spending. Read: Half of Americans over 55 may retire poor I’ve got a list of things I want to see and do when this pandemic is over. It’s going to take more money, but I’m not stressed about it. I’ve got all these retirement accounts to finance my new spending habit: a traditional IRA, rollover IRA, Roth IRA and an old 401(k). And don’t forget Social Security, which will kick in next year at age 70. It’s baffling. I don’t know what suddenly brought on this impulse to spend without hesitation, but I have no regrets about it. My wife is right there with me, spending left and right, so it can’t be just me going through some sort of crisis. She, like me, was always a cautious spender. In fact, that’s one of many reasons we get along so well. I have a theory about why I’m behaving the way I am. When you’re young, you play the long game. You save and invest for your future, knowing you may live another 40 or 60 years. But when you’re older, you play the short game. Your timeline is condensed and you’re more willing to spend down your savings to live an enjoyable and comfortable retirement. I’m playing the short game. I’m in spending mode. There’s no reason my wife and I should adhere to our past behavior of saving and pinching pennies for the future. The future is now. Why not spend in a way that’ll allow us to enjoy life to the fullest? We have no family obligations, except for a son who doesn’t need our financial help. Still, we’re planning to leave him some money. We saved our whole life to get where we are. We aren’t irresponsible spenders aiming to die penniless, but we’re going to make sure we enjoy the rest of our life as best we can. If that means spending down our retirement savings, so be it. This column originally appeared on Humble Dollar. It was republished with permission. Dennis Friedman retired from Boeing Satellite Systems after a 30-year career in manufacturing. A self-described “humble investor,” he likes reading historical novels and about personal finance. His previous articles include It Sure Adds Up, 11 Remodeling Tips and Trust but Verify. Follow Dennis on Twitter @DMFrie."}]}