{"article": [{"url": "https://www.marketwatch.com/story/vaping-makes-teens-up-to-7-times-more-likely-to-catch-covid-19-study-2020-08-12", "published": 1597245140.0, "headline": "Vaping makes teens up to 7 times more likely to catch COVID-19: study", "body": "Here’s another cloud on the horizon for e-cigarette companies. A new Stanford study links vaping to a “substantially increased risk” of COVID-19 in teens and young adults. The national sample of more than 4,000 participants conducted in May found that people who vaped were five to seven times more likely to become infected with the novel coronavirus, compared with those who did not vape. Among the subjects tested for COVID-19, those who had ever used e-cigarettes were five times more likely to test positive for the virus than the non-users. And those who had used both e-cigarettes and conventional tobacco cigarettes within the last month were 6.8 times more likely to be diagnosed with the disease. Teens who smoked and vaped were also five times more likely to report coronavirus symptoms, including coughing, fever, tiredness and difficulty breathing, compared with those who never smoked or vaped. And this same group was about two to nine times more likely to get tested for the virus than non-vapers and non-smokers, probably because they were more likely to exhibit symptoms. “Young people may believe their age protects them from contracting the virus or that they will not experience symptoms of COVID-19, but the data show this isn’t true among those who vape,” the study’s lead author, Dr. Shivani Mathur Gaiha, wrote in a statement. “This study tells us pretty clearly that youth who are using vapes or are dual-using [e-cigarettes and cigarettes] are at elevated risk, and it’s not just a small increase in risk; it’s a big one.” Some limitations include the fact that the study relied on self-reports from online surveys, and it also didn’t offer a reason why vaping would make young people more susceptible to the virus that has infected at least 20 million and killed 743,599 and counting worldwide as of Wednesday morning. “ “It’s not just a small increase in risk; it’s a big one.” ” — Study author Dr. Shivani Mathur Gaiha A recent University of San Francisco report did suggest that smoking, including e-cigarettes, doubled the risk of young adults (ages 18 to 25) getting severely ill from COVID-19, however. “A key finding is that the most prevalent factor conferring medical vulnerability to severe COVID-19 illness among young adults is smoking,” the authors wrote. And previous research has suggested a link between vaping and both lung and heart disease. The American Heart Association also recently recommended that people “not smoke or vape any substance, including cannabis products, because of the potential harm to the heart, lungs and blood vessels.” Research has also warned that e-cigarettes actually encourage teens to try traditional cigarettes, even though the products are often marketed as an alternative to cigarettes and a means to quit smoking. In fact, the odds of ever smoking a cigarette were four times higher if the teenager used an e-cigarette as their first tobacco product, one study of 6,000 young people found. Read more:Vaping may be more harmful to teens than we thought Theories for why vaping could leave adolescents more susceptible to COVID-19 include the potential damage that it does to the lungs and immune system, the Stanford study noted, or the possibility that the aerosols emitted from an electronic vaping device could include droplets contaminated with COVID-19. What’s more, the researchers wrote that COVID-19 is known to spread through respiratory droplets, and repeatedly touching your mouth and your face — which is a habit common among cigarette and e-cig users. Perhaps worse, teens often share their vape pens and other e-cig devices with each other, which could also possibly spread the virus. Related:Dr. Fauci recommends wearing goggles to prevent catching the coronavirus Rep. Raja Krishnamoorthi (D-Ill.) sent a letter to the FDA on behalf of the House Subcommittee on Economic and Consumer Policy on Tuesday calling for vaping products to be temporarily removed from the market. He noted that he had warned the FDA about a potential link between vaping and COVID-19 in April, but the agency cited the need for more evidence that vaping was a risk. “That failure to act cost us four months of harm to Americans that we cannot get back,” Krishnamoorthi wrote. “I respectfully reiterate my call on FDA to clear the market of all e-cigarettes for the duration of the coronavirus crisis. It is the only responsible path forward,” he added. The FDA was not immediately available for comment. Its COVID-19 FAQ warns that people who smoke traditional cigarettes may be more vulnerable to respiratory illness, including COVID-19, as smoking causes lung disease and can also create inflammation and cell damage throughout the body. But it has less to say about e-cigarettes. For now, the FDA warns that vaping tobacco or nicotine can expose the lungs to toxic chemicals. “Whether those exposures increase the risk of COVID-19 or the severity of COVID-19 outcomes is not known,” the FDA site says. Indeed, COVID-19 is a never-before-seen virus that health experts are still learning about. E-cigarettes were a $25 billion market last year, dominated by Juul, which is 35% owned by Altria Group MO, +0.76%. Juul did not immediately respond to a MarketWatch request for comment about the new study or Krishnamoorthi’s call to temporarily suspend vaping products. But the industry came under fire last year after a mysterious illness called E-cigarette or Vaping Product Use-Associated Lung Injury (EVALI) sickened Americans, with the CDC reporting 2,807 hospitalizations for the vaping-related illness as of late February of this year. The surge in teens and tweens vaping also became a cause for concern before the pandemic, as 5 million high school and middle-school students reported using e-cigarettes in the FDA’s 2019 National Youth Tobacco Survey, including one in four high schoolers. In January, the Trump administration banned fruit, candy, mint and dessert e-cig flavors popular with teenagers to deter them from vaping. But menthol and tobacco flavors were allowed to remain on the market. “We have to protect our families,” Trump said at the time. “At the same time, it’s a big industry. We want to protect the industry.” Keep up with MarketWatch’s ongoing coronavirus coverage here."}]}