{"article": [{"url": "https://www.marketwatch.com/story/goopa-mawpaw-and-grandma-duck-how-do-grandparents-get-their-names-2020-09-17", "published": 1600340360.0, "headline": "Goopa, Mawpaw and Grandma Duck? How do grandparents get their names?", "body": "This article is reprinted by permission from NextAvenue.org. Bigi. Gigi. Babcia (pronounced bahp-cha). Dziadziu (pronounced JAH-Joo). Donk. Meema. Popeye (a boat was involved). Welcome to the interesting world of naming grandparents. Susan OHara has eight grandchildren; the two eldest chose her name. “They call me Mom Mom Cherry because when my two oldest granddaughters were little and I would visit, they would always go into my purse and put on my lipstick which was cherry flavored, and that’s how they knew me from the other grandmoms,” explained OHara of Millsboro, Del. When it comes to grandparent names, you don’t always have a choice, as Lord Grantham of PBS’ “Downton Abbey” realized. His granddaughter, Sibbie, addressed him as Donk. The nickname was a reference to a donkey, as in Pin the Tail on the Donkey. Your moniker in the world of tiny toes and wide-eyed smiles is not always dignified, accurate or expected. Grandparent names can originate from mispronunciations, locations, the need for differentiation, traditions, ethnic backgrounds, creative responses to family conflicts and a multitude of other reasons. See: 10 life-defining lessons I learned from my grandparents While the names Grandma and Grandpa aren’t history, I’ve seen the future of grandparent coinage and it’s LaLa and G-Pa.Kids make interesting connections Ellen Hammonds’ name was predetermined when her daughter started sending mail addressed to Pop and NJ Grandma; they were living in Toms River, N.J. Hammonds said, “Once my grandson started talking, I officially became NJ, no matter where I eventually moved!” When the boy told one of his first grade classmates, they thought he said his grandmother was a Ninja. Linda Huhn’s five grandchildren are lucky to have a grandmother living in a coastal area; she previously lived inland in Elsmere, Del. “Because they have several grandparents, I told them to call me MomMom Linda,” Huhn said. But her granddaughter dubbed her Beach MomMom. Kids make connections, and suddenly that’s your name. “I’m known to eight grandkids as Grandma Duck,” said Kathie Meredith. “Our home was full of decoys, mallard and mandarin carvings, Audubon art — generally a tidewater theme,” she said of her home in Harford County, Md. where the kids enjoyed fishing off their pier on the Gunpowder River. “When our first grandkid could talk and came to visit, he smiled through the screen door and said, ‘Duck!’ I loved it. From then on, there was no mistaking which grandma they were going to visit,” said Meredith. Also read: Trump’s idea on changing Social Security funding has the potential to break an impasse on much-needed reformsNames that are easy to pronounce Phonetics often dictate a name. It’s all about making the name an easy fit for little lips. “I am Grammy Pammy,” said Pamela Okolowicz. “My daughter started it with the kids because it rhymed with my name.” With their daughter in Virginia and their son in Pennsylvania, Okolowicz and her husband moved to southern Delaware to be equidistant to both families. “We now have Camp Grammy Pammy every summer,” Okolowicz said. DeeDee Hoover of Sussex County, Del., became Deena, a combination of her given name and Nana. “We moved from South Carolina to be close to these wonderful grandchildren,” she said. Some grandparents stack the odds by choosing a name that’s easy to pronounce, then coach the kiddies. “I asked to be called Nana because I knew they could learn to say it way sooner than Grandma,” declared Pat Nucatola, a native New Yorker. “I would hold the baby to my face and say, ‘OK, let’s practice: nananana…!’”Traditions and family dynamics If you’re in the market for names that are easy on the ears, I’m hearing lots of grandmothers answering to Mimi and Gigi and grandfathers responding to Poppy and PopPop. Mary Beth Jones went traditional, with a twist. “I called both my grandmothers Nana and my mother was a Nana,” said Jones, who is known to her six grandchildren — and four great grandchildren– as Nana MB. Heritage often plays a role in grandparent naming. “I am Oma,” said Kathleen Carroll of Millsboro, Del. “It means grandma in German, and I am part German. My husband is plain ol’ Poppop. He didn’t want to be called Umpa, can’t understand why!” “I’m called Babcia,” (pronounced bahp-cha) said Sharon Bezak. “Our daughter wanted to carry on with some Polish.” But Bezak’s husband is simply Grandpa. Since grandparents tend to come in pairs, some approach naming as a couple. Gramms partners perfectly with Gramps. Patti Miller and her husband of Sussex County, Del., chose Gooma and Goopa, and all five granddaughters approve. When step-grandparents are part of the family dynamics (and un-pairing and re-pairing having occurred) it’s a mixed bag of names and relationships. Barbara Sarubbi of Lewes, Del., went with an easy adaptation. “I chose Gee Ma since I am a step-grandmother and did not want to offend Grandma 1 and Grandma 2,” she said. “We are Lolly and Pop,” said Stacy Aaronson. “My stepdaughter let everyone choose.” Due to divorce on both sides, there are four grandmothers and three grandfathers: Grammy and Pappy; Nanny K; G-Ma and G-Pa. “Of course, as they begin to talk, it will be however the kids can pronounce it,” said Aaronson, formerly of Phoenixville, Pa., where the children and grandchildren still live.Cherished, but not always chosen Differentiating is important, whatever the reason. “We didn’t want any repeats,” explained Cindy Summers, who raised her children in Fairfax, Va. and goes by Nanie. “We discussed and chose it because all the normal grandmother names were already taken in the family.” Coming up with creative names for everyone can be complicated. “I’m called Grandmom by my four grandchildren and that differentiates me from the other grandparents who are Mommom, Poppop and Googa,” said Janet Chubrick of Long Neck, Del. “When our first grandson started to talk, he would get confused between Grandma and Grandpa and would call us Mawpaw.” Names are cherished, but not always chosen. Inevitably, there are names left unspoken. Perhaps they were deemed inappropriate by the parents, criticized by the other grandparents or too difficult for the grandkids to grasp. Karen Tighe’s name game began when she was only 43, in North Plainfield, N.J. “I was struggling with being called Grandma,” she said. Her daughter, trying to help, started calling her The Lady. However when Tighe’s grandson started to speak, she didn’t think The Lady was appropriate and suggested Grandma Lady. “But since he called me lady for such a long time, lady came out first, so I’m known as Lady Grandma by all four of my grandchildren,” said Tighe. Read next: COVID-19 has dashed the retirement dreams of these people Tighe’s search didn’t end there. When her last two grandchildren, Athena and Zoe, were born, their other grandma, who is Greek, was referred to as Yaya. “So I said to them, ‘You can call me Lady Yaya.’ But it didn’t stick,” said Tighe. Paula Ganzi McGloin (formerly Paula Ganzi Licata) is an award-winning journalist and essayist whose work has appeared in the New York Times, Newsday, Los Angeles Times, Chicago Tribune and other publications. She blogs about surviving life with an alcoholic, navigating widowhood and dating after 50 at paulalicata.com. Most recently, she completed a manuscript, “Last Call: Surviving an Alcoholic—A Widow’s Memoir.” This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}