{"article": [{"url": "https://www.marketwatch.com/story/want-to-be-a-poll-worker-in-the-2020-election-read-this-before-applying-to-become-a-front-line-customer-service-face-of-our-democracy-2020-09-28", "published": 1601544260.0, "headline": "How to sign up to be a poll worker in 3 swing states â\u0080\u0094 Ohio, Florida and Arizona", "body": "America could be short on poll workers on Election Day, voting experts say â\u0080\u0094 but they emphasize that thereâ\u0080\u0099s still time for volunteers to fill the ranks. They hope youâ\u0080\u0099ll give the idea some serious thought. “ â\u0080\u0098Poll workers are the front-line custom service face of our democracy. ... Youâ\u0080\u0099ve got the ability to make a difference in your community, make a positive impact.â\u0080\u0099 ” â\u0080\u0094 Benjamin Hovland, chairman of the U.S. Election Assistance Commission â\u0080\u009cPoll workers are the front-line custom service face of our democracy,â\u0080\u009d said Benjamin Hovland, chairman of the U.S. Election Assistance Commission, whoâ\u0080\u0099s volunteered for poll work 10 to 15 times himself. â\u0080\u009cYouâ\u0080\u0099ve got the ability to make a difference in your community, make a positive impact.â\u0080\u009d President Donald Trump and Democratic challenger Joe Biden are locked in a tight race, even as certain polls and pundits give Biden an edge. But volunteering isnâ\u0080\u0099t about pushing for one side to prevail, added Hovland, who leads the bipartisan federal agency responsible for distributing $1.2 billion for election administration over the past several years. â\u0080\u009cItâ\u0080\u0099s just about having the process work and having a positive experience.â\u0080\u009d The coronavirus pandemic is putting that process to the test this year. “ In the 2016 election, more than half of all poll workers were age 61 and above, statistics show. ” When Trump won in 2016, almost 920,000 poll workers â\u0080\u0094 many of them senior citizens â\u0080\u0094 supervised ballot boxes and staffed polling places across the country, according to the U.S. Election Assistance Commission. Almost 32% of poll workers in that election were between the age of 61 and 70 and another 24% were above age 71, the independent, bipartisan commission said. Four years later, in the midst of the pandemic that puts people in their 60s and older especially at risk, organizations such as Power the Polls and The Poll Hero Project are sprouting up to turn younger people into poll working-volunteers. “ â\u0080\u0098I am so encouraged by how people are answering the call.â\u0080\u0099 ” â\u0080\u0094 Myrna Perez, director of the Voting Rights and Elections Program at New York University School of Lawâ\u0080\u0099s Brennan Center for Justice â\u0080\u009cWe are in better place than we were a couple months ago,â\u0080\u009d Hovland said, but he didnâ\u0080\u0099t want to guess how many more people were needed. Some counties may be fully staffed by now while others are still looking, he said. â\u0080\u009cThe target goal is probably pretty close to the 2016 number, but, again, I think thereâ\u0080\u0099s a difference between optimal and what you can do.â\u0080\u009d The amount of poll workers lined up now is â\u0080\u009cnot actually a knowable number at this point in time,â\u0080\u009d according to Myrna Perez, director of the Voting Rights and Elections Program at New York University School of Lawâ\u0080\u0099s Brennan Center for Justice. Volunteer numbers are collected in local jurisdictions and the staffing goals can be based on best guesses and projections, she noted. At least anecdotally, Perez has seen a lot of enthusiasm for poll work this year. â\u0080\u009cI am so encouraged by how people are answering the call.â\u0080\u009d Who can be a poll worker? Poll worker requirements can vary, but there are some common themes. In many states, you need to be a registered voter, which means you need to be at least 18. Yet some states allow high schoolers to work as well, Perez noted. Some states may also ask for an applicantâ\u0080\u0099s party affiliation. Thatâ\u0080\u0099s so when voting officials devise staffing, they can have equal numbers of registered Republicans and Democrats at a site to avoid even the appearance of bias. In many places, a felony conviction can be a disqualifier. The majority of people working the polls should be ready for a very long day that starts in the early morning and concludes in the evening. Many jurisdictions donâ\u0080\u0099t schedule poll working shifts, Hovland said. “ Poll worker pay can range from around $80 to around $350. ” Many poll workers are paid, Hovland noted. The money can range from around $80 up to around $350 in some jurisdictions, Hovland said. The Election Assistance Commissionâ\u0080\u0099s own website has a section where users can check poll working requirements and pay in particular counties. The 2020 election may entail some extra job duties. Traditional poll worker detail includes greeting voters, looking up their name on the rolls, pointing them to the voting booth and handing them an â\u0080\u0098I votedâ\u0080\u0099 sticker on the way out. The job may still include that, and some more too. â\u0080\u009cThere may be some work to help with social distancing, making sure thereâ\u0080\u0099s limited congestion in polling places,â\u0080\u009d Hovland said. It may also mean constantly wiping down often-touched surfaces and making sure the hand sanitizer containers arenâ\u0080\u0099t getting low, he added. (The CARES Act earmarked $400 million to help states with 2020 election costs that could include face masks and cleaning supplies.) Donâ\u0080\u0099t miss:What COVID-19 precautions should you take while voting? How many people will vote by mail? Answers to your 2020 election questions Volunteers may also have to be ready to know their particular state rules if a voter requested a mail-in ballot and still shows up at the polling place, Perez said. All states have pre-existing laws to deal with the scenario, she said, but they will come into hard focus during an election when people might cast their ballot by mail, and then wonder if it will arrive to local election officials on time, and in the correct format. See also:Opinion: Iâ\u0080\u0099m the Republican secretary of state in Washington â\u0080\u0094 and I believe voting by mail works “ â\u0080\u0098I would suspect that some of training is going to include how you keep people happy and what you do with people who are grouchy â\u0080¦ You donâ\u0080\u0099t know whoâ\u0080\u0099s going to be yelling at somebody about a mask policy.â\u0080\u0099 ” â\u0080\u0094 Myrna Perez, director of the Voting Rights and Elections Program at New York University School of Lawâ\u0080\u0099s Brennan Center for Justice Perez hopes workers will get some training on the particular protocols in order to achieve a smooth and time efficient voting experience. She also hopes they get some practice on a less technical skill: putting potentially on-edge voters at ease. â\u0080\u009cI would suspect that some of the training is going to include how you keep people happy and what you do with people who are grouchy,â\u0080\u009d she said. â\u0080\u009cYou donâ\u0080\u0099t know whoâ\u0080\u0099s going to be yelling at somebody about a mask policy.â\u0080\u009dWhat it takes to be a poll worker in the battleground states of Florida, Ohio and Arizona Potential poll workers can learn how to apply for a position in their state, using this drop-down menu from the National Association of Secretaries of State. But hereâ\u0080\u0099s a look at the specifics for three swing states, Florida, Ohio and Arizona, where a comprehensive vote count is especially critical for both the Trump and Biden campaigns. In Ohio, more than 44,000 residents in the crucial Midwest swing state had signed up to be Nov. 3 poll workers as of earlier this week, according the Ohio Secretary of State. Though Ohio has surpassed the minimum of 37,057 workers, it still wants another 20,000 people to meet its staffing goals. To be a poll worker in Ohio, you must also be at least 18 years old, or age 17 and a high school senior. You have to live in the county where you want to serve and you canâ\u0080\u0099t be a candidate for an election on the ballot. A felony conviction disqualifies an applicant. Poll workers get paid at least the federal minimum hourly wage ($7.25) and up to $133.72 a day. In Florida, thereâ\u0080\u0099s no statewide tally yet on the poll workers volunteering in the pivotal swing stateâ\u0080\u0099s 67 counties, a spokesman for the Florida Department of State said. The state had 46,484 poll workers in the 2016 election, agency data said. Florida poll workers need to be at least 18, or age 16 and 17 and pre-registered to vote, according to state law. They also need to be a county resident where they want to work. If you have a felony and havenâ\u0080\u0099t had your right to vote â\u0080\u009crestored pursuant to law,â\u0080\u009d you are barred from the position. Pay is set by the counties. In Miami-Dade County, for example, you can make $40 for training and $160.68 to work Election Day. An Election Day workerâ\u0080\u0099s stipend in Broward County is between $180 and $250. In Arizona, poll workers need to be at least 18, though some counties allow 16- and 17-year-olds. Pay rates are set by individual counties. In Phoenixâ\u0080\u0099s Maricopa County, the hourly rate is between $12 and $13.50. A felony can bar an applicant. “ Curbside voting is already allowed in Arizonaâ\u0080\u0099s elections and it will be expanded this year. ” The website alone for the stateâ\u0080\u0099s Secretary of State has received almost 15,000 applications for the primary and general elections. The agency forwards the forms on to county election officials, according to Secretary of State Katie Hobbs. One pre-existing part of Arizonaâ\u0080\u0099s election process is curbside voting. One Republican and one Democratic poll worker bring a ballot out to the car, where the driver casts their vote. Election officials will be expanding that procedure this year, Hobbs said. Though election officials throughout the state havenâ\u0080\u0099t a large drop-out of older volunteers, Hobbs said, â\u0080\u009cthere are so many people stepping up. â\u0080¦ They want to do something to help protect democracy.â\u0080\u009d"}]}