{"article": [{"url": "https://www.marketwatch.com/story/we-ought-to-build-an-economy-that-provides-jobs-public-health-and-a-sustainable-environment-11594740585", "published": 1594888460.0, "headline": "We deserve an economy that provides jobs, public health and a sustainable environment", "body": "The private sector by itself cannot reliably provide public goods such as jobs, public health and a livable world. Spencer Platt/Getty Images LONDON (Project Syndicate)—The COVID-19 pandemic has had an immense, unpredictable, and lasting impact on economies around the world. As a result, governments have been given an opportunity—and an imperative—to rethink the role and purpose of fiscal policy. A new approach is long overdue. Since the era of British Prime Minister Margaret Thatcher and U.S. President Ronald Reagan, the prevailing economic orthodoxy has effectively denied the state’s potential investment function and made balancing the budget an end in itself. This indifference to both the direction and level of economic activity rendered the 2008-09 crash all but inevitable, and the subsequent rush to austerity weakened the recovery. Now, the simultaneous collapse of supply and demand following the arrival of COVID-19 has made neoliberal orthodoxy doubly untenable. “ We need to become more ambitious about supplying what citizens need to prosper. ” There is, however, little evidence that any new fiscal thinking is under way. Yes, emergency financing is being deployed. But unless this spending is structured, the post-2008 outcome will be repeated, with the liquidity driving up asset prices in financial markets but doing little to help the real economy. In the United Kingdom, Prime Minister Boris Johnson may aspire to the mantle of President Franklin D. Roosevelt. But his touted “new deal” comes nowhere close to the scale or ambition of FDR’s original. None of the government spending announced so far goes beyond “ambulance work.” What the emergency response has highlighted is the immense fiscal power of the state, which, when circumstances demand, is perfectly capable of keeping households provisioned through a monthslong standstill of private enterprise. Accordingly, the goal in the months and years ahead should not be to jettison the subsidy economy as quickly as possible, but rather to transform it into a new lasting partnership between the state, private enterprise, and workers. A New Baseline Just as the path out of the Great Depression and World War II required political collaboration and the adoption of ideas that in the 1920s and 1930s had been considered radical and “antibusiness,” so must the post-pandemic recovery go beyond mere crisis management. It is time to embrace the state’s unique and profound capacity for steering economic life in the interest of the common good. After all, there is no shortage of long-run challenges that will require proactive political leadership and mission-driven public investment. In the face of a historic Arctic heat wave, the need to reorient the economy toward clean, sustainable growth has never been more urgent or more obvious. And while calls for a “Green New Deal” on the scale of the WWII-era socioeconomic transformation had already gained traction, the COVID-19 crisis has shown that “business as usual” is unfit for purpose. When push comes to shove, states—not private companies—are the primary economic actors. The socioeconomic and climate dimensions of the current crisis are closely related. The legacy of laissez-faire policies had left key sectors and large swaths of the labor force chronically underemployed and undervalued. As the U.K. Committee on Climate Change has shown, the current economic downturn is thus the perfect time to accelerate “the transition to a cleaner, net-zero emissions economy and strengthen the country’s resilience to the impacts of climate change.” But any modernized version of the New Deal must include a new fiscal constitution. Otherwise, there will be no guarantee against a resumption of financial orthodoxy when the current emergency is deemed to be over. The state must be given a permanent, continuing role in guiding, stabilizing, and—if need be—transforming economic life. Intervening only in bad times to fix the system guarantees another crisis. On the supply side, there should be more attention on steering production toward long-term development needs—toward a more sustainable, innovative, and inclusive economy. And on the demand side, it is time to reaffirm the Keynesian commitment to full employment, by establishing a job-guarantee scheme to ensure that human capital is neither wasted nor eroded during the coming economic transformation. More to the point, a modernized New Deal means paying as much attention to the direction of growth as to its rate. It means actively tilting the playing field in a greener direction, which calls not only for “shovel-ready” projects in clean infrastructure, renewable energy, and other forms of decarbonization, but also for a vision of how to design and coordinate such projects as part of a new sustainable growth path. New incentives to drive private investment in the right direction are also needed. Taxes, regulations, and other public policies must be aligned to foster long-term planning and reduce greenhouse-gas (GHG) emissions across the entire economy. Such a mission-oriented approach to economic management would yield a bigger bang for the public’s buck, both decreasing the negative multiplier of any business downturn and increasing the positive multiplier of any business upturn. The Hollow State As John Maynard Keynes observed in the mid-1930s, “The difficulty lies, not in the new ideas, but in escaping from the old ones, which ramify, for those brought up as most of us have been, into every corner of our minds.” Today, the key failure of the prevailing economic model—particularly in the United States and the U.K.—has been its neglect of public goods. While these are essential to the proper functioning of the economy, the private sector lacks any incentive to supply them. That is why Adam Smith argued in The Wealth of Nations that the state bears the duty of furnishing the infrastructure upon which the market economy relies. And as the list of public goods expands to include access to data and digital technologies, we need to become more ambitious about supplying what citizens need to prosper. The contemporary orthodoxy, however, subordinates this duty to that of balancing the government’s budget. The responsibility of developing the economy’s real resources is simply abandoned in the name of a financial imperative that, in truth, applies only to households. While households need to balance budgets over time, governments should be creating budgets to balance the economy, ensuring full capacity utilization. Crucially, to resurrect the notion of public goods, we must ensure that they are not merely “corrections” for market failures, but rather central elements in the interplay between government and private enterprise. A narrow market-maintenance logic must give way to a more proactive market-creating and market-shaping logic. The prevailing orthodoxy rests on two supposedly axiomatic assumptions: that public investment is a form of waste and should therefore be minimized; and that market economies have a spontaneous tendency to achieve full employment (defined as the “natural” rate of unemployment). From these axioms it follows that only when markets cannot allocate resources efficiently should public investment be used to smooth out “frictions.” The 2008-09 financial crisis already exposed the weakness of this model. Between 1975 and 2000, gross public investment as a share of GDP in the U.K. fell from 8.9% to 1.7%. As a result, more investment spending shifted toward speculation, where it was not only wasted but destabilizing, contributing to a sequence of financial crises. The COVID-19 crisis has made the orthodox model’s flaws even more obvious, not least by highlighting the severe deficiency of public goods, from basic health infrastructure to personal protective equipment. Orthodoxy had prescribed privatization, patent protection, and the outsourcing of critical government functions across almost every relevant domain, from research and development in medicine and technology to transportation, health care, and education. After years of spending cuts, many Western governments were completely unprepared to manage a shock such as the one that struck this year. As soon as COVID-19 emerged, so, too, did the signs of rot, from gaps in critical supply chains to inadequate state capacity. Across the Western world, governments have mustered everything they have in responding to the pandemic, but it has been too little, too late. Building up sufficient state capacity takes years of patient investment, not just helicopter money dumped on the economy in response to an emergency. Moreover, this undersupply is a product of under-demand. Economies have operated well below full capacity ever since the 2008 crisis. In 2018, the U.K. may have had a “headline” unemployment rate of 4.2%, but its underemployment rate—which includes those working part-time and unable to secure full-time jobs—was closer to 8% (and that figure excludes those who have been forced to work below their skill level). Lessons Learned? Because governments remained beholden to financial rather than real resource accounting during the Great Recession, they missed an opportunity to start shifting economic activity in a more sustainable, inclusive direction. Worse, many abandoned stimulus measures for growth-inhibiting fiscal consolidation. In the U.K.’s case, Simon Wren-Lewis of the University of Oxford estimates that austerity delayed the economy’s recovery for up to three years, exactly as elementary Keynesianism would have predicted. And though monetary policy remained expansive, it did not offset the country’s contractionary fiscal policy. To be sure, the Bank of England claimed that the situation would have been even worse had it not been priming the pump. And yet, by pursuing asset purchases, policy makers were simply putting “new” money into the hands of existing asset holders, who were least likely to spend it. Unless money creation is linked to opportunity creation in the real economy, most of the liquidity provided by the central bank will end up back in the financial sector—exactly as happened after 2008. The lessons from the last crisis are clear: the marginalization of the state’s investment function deprived policy makers of the tools needed to deal with an unexpected event or to stabilize the economy, let alone position it for sustained growth. Public investment is essential not just to “fix” market failures, but also to drive the high-risk, capital-intensive spending that is necessary for innovation—and thus for capital development itself. It can be leveraged both on the supply side—through investments in transformative projects with risks too large for a private firm to bear—and on the demand side, through public-procurement policies. Under the neoliberal Washington Consensus, it was these state functions that were largely “outsourced” to markets—voluntarily in the case of developed countries, and as a condition of financial support in developing countries (which were then relabeled “emerging markets”). Financial-sector and labor-market deregulation, privatization of state-owned enterprises, and fiscal austerity were the prescriptions of a supposedly universal formula that conflates micro- and macroeconomics and is to be applied regardless of a country’s stage of development. Neoliberal economics adheres to the early-19th-century economist Jean-Baptiste Say’s “law” that supply creates its own demand. The implication is that by eliminating undue political influence on economic incentives, the market will ensure optimal value creation. Politics thus becomes a race to diminish the state’s market-shaping role, while largely ignoring the real-world relationship between supply and demand—particularly undersupply and under-demand. But the neoliberal dispensation also drew selectively from “welfare economics,” which ascribes a role for governments to patch things up when outcomes deviate from the ideal of the perfect market. This analytical benchmark, combined with the fear of inevitable “government failure,” ensured that market repair never rose to the level of market renovation. The market, not the state, always received the benefit of the doubt. Markets with a Mission Now that COVID-19 has exposed the damage wrought by the previous paradigm, it is time to start mapping out a new era of public investment to reshape our technological, productive, and social landscape. The new model should embrace the realization that our economies are always evolving in some direction, rather than merely expanding in a vacuum. Left on their own, market economies tend to favor short-term or value-extracting activities—hence the sweeping trends in financialization and deindustrialization witnessed over the past four decades. By contrast, in market economies with a mission-oriented government, public spending and policy making will steer activity toward achieving socially desirable goals beyond mere growth for its own sake. Aside from New Deal-era America, a good real-world example of the new model is New Zealand, whose government has adopted a “well-being budget” to align public spending decisions with broader objectives. A mission-oriented approach also allows for a new form of targeted fiscal stimulus. The point is to start with a large-scale challenge such as climate change and break it down into concrete policy goals, such as achieving net-zero emissions in a given region by a specific date. With targets in place, the full force of government grants, loans, and procurement contracts can be deployed to leverage the combined potential of the public, private, and nongovernmental sectors. To head off foreseeable objections, this mission-oriented approach does not involve picking winners and losers in terms of sectors, technologies, or firms; rather, the idea is to pick specific problems and allow solutions to emerge through a bottom-up process of experimentation and innovation across sectors. The same process also will create new employment opportunities. Achieving carbon neutrality within a particular region, for example, would require new forms of collaboration among energy, transportation, materials, digital, technology, infrastructure, and other sectors, as well as new types of jobs to repurpose, re-use, and recycle existing resources and capital. Job creation, and the demand side more generally, is where the second pillar of the new fiscal constitution kicks in. A smooth economic transition will require a public-sector job program that seeks to generate a sustainable tax base by “crowding in” economic activity that the crisis will have otherwise rendered idle. Indeed, genuine full employment should be thought of as a public good. After all, a fully employed person augments not just their own income, but also that of the wider community through increased purchases. When people are under- or unemployed, they have less income with which to drive demand in the economy, leaving everyone worse off. Writing in 1948, the (future) Nobel laureate economist Paul Samuelson pointed out that “the modern fiscal system has great inherent automatic stabilizing properties.” When the economy turns down, the budget deficit automatically increases; when the economy recovers, the deficit automatically falls. To preserve this inbuilt stability, he argued that “no attempt should be made to balance the budget in a downturn.” But, as Samuelson himself noted, “a built-in stabilizer acts to reduce part of any fluctuations in the economy, but does not wipe out 100% of the disturbance. It leaves the rest of the disturbance as a task for fiscal and monetary discretionary action.” The Ultimate Market Fix In the case of today’s recovery, such discretionary action should include a public employment program (PEP), along the lines of what the U.S.-based Levy Economics Institute has outlined. This would constitute a much more powerful countercyclical stabilizer than the system described by Samuelson, but it also would represent a continuation of policies inaugurated by Roosevelt’s New Deal. Between 1935 and 1943, the Works Progress Administration (WPA) employed 8.5 million Americans, and provided almost every type of work imaginable, from infrastructure construction and pest extermination to manufacturing Braille books and performing in the world’s greatest symphonies. Similarly, the Civilian Conservation Corps (CCC) was designed to provide around 1 million young unemployed men with work on projects that included “the prevention of forest fires, floods, and soil erosion, plant pest and disease control, the construction, maintenance, or repair of paths, trails and fire-lanes in the national parks and national forests, and such other work…as the President may determine to be desirable.” In our own sketch for a PEP, the U.K. government would guarantee a job at a fixed hourly rate (not lower than the national minimum wage rate) to any job seeker or working-age adult who cannot find employment in the private sector. It would focus on creating jobs in areas that are critical to steering the economy toward a green transition, and it would provide training programs so that PEP workers could build or maintain their skill sets, thus preparing them for private-sector employment. Moreover, a robust PEP would offer four important advantages over the status quo. First, it would create a labor-market buffer stock that expands and contracts automatically with the business cycle, limiting discretionary variations in expenditure. It therefore would support aggregate demand while safeguarding against the possibility of mistimed public spending (owing to bad forecasts or undue political interference). Second, a PEP would maintain workers’ employability better than an unemployment benefit would, and could readily be coupled with on-the-job training—an important factor in economic recovery and long-term growth. Third, those PEP employees would be paid at a fixed rate, thus setting a floor for private-sector wages. If the PEP wage was set at the national minimum wage, there would be no need for minimum-wage legislation and all the attendant compliance costs. And, as Pavlina R. Tcherneva of the Levy Economics Institute argues, if the PEP wage were to be set above the minimum wage, it would even have a beneficial distributional effect. Finally, a PEP can be used to influence the structure of employment overall, tilting talent and resources toward the objectives envisioned in the Green New Deal. The PEP Paradigm In our outline for the U.K., the program would be funded nationally, but would be administered locally by a variety of agencies: local governments, NGOs, and social enterprises. Each would be tasked with creating “on the spot” employment opportunities where they are most needed (environmental, civic, and human care), matching unfilled community needs with un- or underemployed people. There will be snags, of course; and such as all new ideas, this one will have to break through the barrier of entrenched thinking. The notion that economies naturally tend toward full employment is one bit of orthodoxy that events should have fully discredited by now. Yet it remains ingrained in the increasingly stringent conditions required for the receipt of unemployment benefits, the underlying assumption being that the problem is always unemployed people’s reluctance to work rather than job scarcity. In any case, a PEP would overcome these moral debates by providing work or training to all who are willing and able, thereby alleviating the need for unemployment benefits in the first place. A PEP is, finally, an inherently green idea, because it addresses two critical forms of economic neglect and devastation in the economy: that of natural and human capital. Hence, it should not be seen as only a countercyclical consumption program, but also as an essential ingredient in what the technology scholar Carlota Perez calls “smart green growth.” The economy will lack up-to-date productive capacity so long as a large share of its workforce remains underemployed and under-waged. But with inclusive wage policies and stronger aggregate demand, companies will have to reinvest in smarter equipment. Squeezing precarious workers will no longer be a viable option for sustaining corporate profits. The information-technology revolution and major advances in renewable energy in recent years have shown that innovation spawns new products, services, materials, and ways of living—all of which generates jobs. Neoliberal orthodoxy ignored the need to transform old capital into new, and we are now economically and socially poorer for it. It is time to restart the virtuous cycles of strong demand and high investment, with a focus on green growth and a proper alignment of the economy’s supply and demand sides. A new fiscal constitution, secured through a PEP, provides the basis for such an economy. We must not squander this chance to reform capitalism for the sake of people and the planet. Mariana Mazzucato, professor of economics of innovation and public value and director of the UCL Institute for Innovation and Public Purpose, is the author of The Value of Everything: Making and Taking in the Global Economy. Follow her on Twitter: @MazzucatoM. Robert Skidelsky, a member of the British House of Lords, is professor emeritus of political economy at Warwick University. This article was published with permission of Project Syndicate — Toward a New Fiscal Constitution. More from Project Syndicate: Robert Shiller explains the pandemic stock market and why it’s decoupled from the economy COVID-19 spreading fast in countries with lots of economic inequality The United States of Despair is gripped by two simultaneous pandemics that expose a widening inequality gap"}]}