{"article": [{"url": "https://www.marketwatch.com/story/virgin-galactic-stock-gets-boost-from-2-buy-ratings-2020-09-28", "published": 1601295980.0, "headline": "Virgin Galactic stock gets boost from 2 buy ratings", "body": "Shares of Virgin Galactic rallied nearly 20% Monday after two Wall Street analysts started covering the stock with a buy rating, with one calling its growth potential “unparalleled.” That boost put Virgin Galactic stock SPCE, -3.12% on track for its highest close in eight weeks and its largest one-day increase since April 14. Monday’s gains also stretched the shares’ winning streak to a third session. The stock has gained 72% this year, compared with gains of around 4% for the S&P 500 index. SPX, +0.87% All seven analysts surveyed by FactSet rate it a buy, with an average price target of $25.43, representing an upside around 27%. Virgin Galactic “has a unique business with leading market position (no operating competition) and an experienced management team,” B. of A. analyst Ronald Epstein said in a note Monday. He also highlighted Virgin Galactic’s vertical integration capabilities, calling them “unparalleled.” Most of its rocket and spaceship components, from carbon-fiber structures to avionics and flight simulators, are done in house. See also:Virgin Galactic raises more than $450 million in secondary offering priced at $19.50 a share The business is not without risk, however. “A fatal accident, though unlikely, could compromise the business model. As of today, Virgin Galactic has only flown the full mission (to space) two times,” Epstein said. Related: SpaceX successfully launches U.S. astronauts into space The company plans to launch its first customers to space out of its New Mexico base by next year, first taking four of its employees to space in early 2021, then flying founder Richard Branson to space to mark the start of commercial operations. In June, it inked a deal with NASA to train and outfit future space travelers in a bid to boost space tourism. Its closest competitors are privately held Blue Origin, founded by Amazon.com Inc.’s AMZN, +3.01% Jeff Bezos, and SpaceX, founded and led by Tesla Inc.’s TSLA, +1.89% Elon Musk. Analyst Charles Minervino at Susquehanna Financial also started covering the stock at the equivalent of a buy rating, with a $20 price target. “We see (Virgin Galactic) as an innovator of space technology with a truly unique offering that will allow civilians and professionals alike to access space for entertainment and research purposes,\" he said in a note. The company is set to tap into “significant latent demand for space tourism,” he said. It is still in early stages, and Minervino said he doesn’t expect ”positive EBITDA or free cash flow until 2023 and 2024, respectively, which certainly serves as a fundamental risk.” The company’s “future business opportunities can spread considerably wider than what is seen at the moment – ranging from public leisure and professional space travel to government contracting and future highspeed commercial travel,” he said."}]}