{"article": [{"url": "https://www.marketwatch.com/story/us-regains-14-million-jobs-in-august-and-unemployment-drops-to-84-as-economic-recovery-shows-resilience-2020-09-04", "published": 1599241940.0, "headline": "U.S. regains 1.4 million jobs in August and unemployment drops to 8.4% as economic recovery shows resilience", "body": "The numbers: The U.S. regained 1.4 million jobs in August and the unemployment rate posted a surprisingly large drop to 8.4%, suggesting an economic recovery is still plowing ahead even if the pace of growth has slowed since the start of the summer. The increase in hiring last month exceeded Wall Street’s forecast. Economists polled by MarketWatch had forecast a 1.2 million gain. U.S. stocks fell in Friday trades. The employment picture was a bit softer after stripping out the hiring of 238,000 temporary Census workers and those who work in public education. Private-sector hiring rose by 1 million, down from 1.48 million in July, the government said Friday. The most positive news was a big reduction in the official jobless rate to 8.4% from 10.2%, marking the fourth straight decline from a pandemic peak of 14.7%. A separate survey of households showed a much larger number of people returning to work (3.76 million) and a sharp decline in the unemployed (-2.8 million). “I would say today’s jobs report was a good one,” Federal Reserve Chairman Jerome Powell told NPR in an interview. One caveat: The jobless rate would have been closer to 9% if households gave an accurate description of their employment status, the Bureau of Labor Statistics said. Some survey respondents have mistakenly classified themselves as absent from work instead of unemployed, a problem that has plagued the BLS survey since the pandemic began. Several million Americans still haven’t returned to the labor force, however, since the start of the pandemic and some 29 million were reportedly receiving jobless benefits as of the middle of last month. Read: Initial jobless claims fall to new pandemic low of 881,000 — but there’s a big catch The start of the school year, what’s more, has also spawned fresh problems for companies and their employers.Many parents lack day-care options and are grappling with how to care for their school-age children learning at home while they work at the same time. A new Federal Reserve study found the new school year has made it harder for businesses that are hiring to attract workers. Read:Economy softened in August, Fed says, as some temporary layoffs turn permanent A stalemate in Congress over another financial-rescue package has also left many unemployed Americans in a more precarious financial position. A $600 federal unemployment stipend expired at the end of July and small businesses can no longer apply for loans to help cover payroll costs. Read: Did the expired $600 federal jobless benefit keep people from going back to work? A spate of companies such as American Airlines AAL, +0.34%, United UAL, +0.32% and MGM Resorts MGM, -2.59%, meanwhile, have announced new furloughs and layoffs with their businesses still in a deep slump. A United Airlines ticket agent helps a passenger check in for a flight at San Francisco International Airport. United Airlines announced plans to furlough over 16,000 workers including pilots, flight attendants and technicians. Getty Images Some companies warn job losses could become permanent without more government help or a faster rebound in the economy. The U.S. shed more than 22 million jobs during the worst of the pandemic. So far it’s restored about 10.7 million jobs, leaving about half of the people who were laid off still out of work. What happened: The number of peopled employed by government jumped by 344,000, largely because of a big increase in temporary Census workers. In the private sector, retailers led the way in hiring again as they brought back almost one-quarter of a million workers. Restaurants also added 134,000 jobs. Retailers, restaurants and hotels have borne the brunt of the U.S. effort to contain the coronavirus. The number of customers they can allow has been restricted and many Americans are still too worried about the coronvirus to eat out, go to stores or travel. Even after a spate of rehiring, for instance, some 2.5 million restaurants jobs still haven’t returned. The rest of the hiring was scattered in a variety of industries. White-collar businesses added almost 200,000 jobs, though more than half were temporary. Transportation and warehousing jobs increased by 78,000. Health-care providers boosted payrolls by 75,000. Financial firms hired 36,000 workers. And manufacturers added 29,000 people. Average hourly wages rose 11 cents to $29.47 an hour. The yearly rate of pay appeared to soar early in the pandemic, but only because more lower-paid workers lost their jobs than higher paid ones. The normally slow-changing wage data is likely to be less useful until the economy is mostly recovered. Wages were growing about 3% a year before the pandemic. The increase in employment in July marked down slightly to 1.73 million. The increase in June was little changed at 4.79 million. How many people are really unemployed, though, is still a bit of a mystery. The monthly employment survey puts the number at 13.6 million, but the weekly jobless-claims report indicates it could be closer to 30 million. A broader measure of unemployment known as the U6 suggests the “real” rate was 14.2% in August, down from 16.5% in the prior month. The U6 rate includes workers who can only find part-time work and those who have become too discouraged to look for jobs because so few are available. Big picture: The U.S. economy have proven quite resilient, expanding again in August despite the summer viral outbreak and the end of massive federal benefits. A variety of reports such as restaurant reservations, retail spending and in-store shopping also suggest an increase in consumer spending and steady if slower growth in the economy. What’s less clear is whether the economy can sustain its foward progress. Unemployment remains sky-high, the threat of a fresh wave of layoffs is rising and the coronavirus is still very much a threat. A divided political leadership in Washington and one of the most divisive presidential elections in history is unlikely to help, either. See:Marketwatch’s Coronavirus Economic Recovery Tracker What they are saying? “The August employment report was stronger than we expected,” said chief economist Richard Moody of Regions Financial. “ That said, while the labor market is clearly healing, it remains far from healthy.” “There are certain industries that are essentially stuck until the virus recedes further, such as air travel, sporting event and concert admissions,” said chief economist Stephen Stanley. “But for most of the economy, the return to normal is occurring inch by inch and day by day, with plenty more to come.” Market reaction: The Dow Jones Industrial Average DJIA, +0.56%, S&P 500 SPX, +0.87% and Nasdaq COMP, +1.39% all declined in Friday trades."}]}