{"article": [{"url": "https://www.marketwatch.com/story/british-american-tobacco-reports-first-half-profit-rises-despite-volume-decline-11596176603", "published": 1596172520.0, "headline": "British American Tobacco reports first-half profit rises despite volume decline", "body": "A packet of Camel cigarettes, taken on September 25, 2014. joel saget/Agence France-Presse/Getty Images British American Tobacco said its first-half profit edged higher, as sales of higher-priced items and cost cuts offset a fall in volume. British American Tobacco BATS, -0.73% BTI, -0.17% said its profit from operations rose 3.3% to £5.37 billion, with revenue up 1.1% to £12.27 billion. Its adjusted earnings per share of 157.8 pence came in ahead of a FactSet-compiled analyst estimate of 156.54 pence on sales of £12.16 billion. In early London trade, British American Tobacco shares rose 1%. Volume fell 6.3%, which the company blamed on international travel restrictions, but a greater proportion of higher-priced cigarette sales helped revenue to rise. The company highlighted its “new categories” revenue growth of 14.7%, which includes 9.1% growth for tobacco heated products, 41% growth in vapor and 67% growth in what it calls “modern oral.” Kingsley Wheaton, the company’s chief marketing officer, in an interview with MarketWatch said that was a sign its multicategory strategy was working. The company reiterated it expects revenue growth between 1% and 3% for the year at constant currencies — it had lowered that target in June — and mid-single figure adjusted EPS growth. The company said U.S. industry volumes will fall 2.5% instead of a previously estimated 4%, citing the continued resilience of consumer demand and higher trade stock levels being maintained as a result of COVID-19. Its Kentucky BioProcessing division has applied and is awaiting U.S. Food and Drug Administration approval to start a trial of its COVID-19 vaccine, Wheaton said. He said that approval to begin testing could be “pretty imminent.” The unit already has FDA approval to test an influenza vaccine. British American Tobacco had announced in April that it was trying to create a COVID-19 vaccine and that its work there would be on a not-for-profit basis."}]}