{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-rise-as-europe-forges-historic-coronavirus-aid-package-and-coca-cola-delivers-upbeat-results-2020-07-21", "published": 1595352740.0, "headline": "Dow, S&P close higher as Covid-battered stocks surge, but off session's best levels as tech sector sinks", "body": "U.S. stock-indexes finished mostly higher Tuesday as investors snapped up beaten-down energy and financial stocks amid a slate of corporate earnings reports, including Coca-Cola and Lockheed Martin's second-quarter results. Market sentiment also was encouraged by the promise of additional U.S. fiscal stimulus, after the European Union forged a historic budget package intended to dampen the economic impact of the effects of the COVID-19 pandemic. How did benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56%  added 159.53 points, or 0.6%, to end at 26,840.40, after hitting an intrasession peak at 27,025.38, powered by Chevron Corp. CVX, -1.62%  and Boeing Co. BA, -0.39% . The S&P 500 index SPX, +0.87% rose 5.46 points, or 0.2%, at 3,257.30, with the energy sector SP500.10, -1.59% rising 6.2% and the financial sector SP500.10, -1.59% up 1.9%, but the technology sector SP500.45, +1.54%  capped gains in the broad-market index, off 1.1%, the worst performer among the benchmark's 11 sectors. Meanwhile, the Nasdaq Composite Index COMP, +1.39%  closed 86.73 points, or 0.8%, lower at 10,680.36, ending solidly lower after hitting an intraday record at 10,839.93 near the open. Despite the pullback, the S&P 500 marked its highest close since Feb. 21. The S&P 500 is 3.8% from its Feb. 19 closing high, while the Dow is off 9.2% from its Feb. 12 all-time closing peak.What's driving the market? Investors staged a tepid rotation to other under-loved parts of the stock market on Tuesday, with buyers scooping up downtrodden shares in banks and oil-and-gas producers, which have been battered during the coronavirus pandemic. The move come a day after the technology-laden Nasdaq Composite delivered its 28th record close of 2020, with Tuesday's gains helping to lift the S&P 500 out of a range that it has been trading since early June, experts said. \"The S&P 500 is breaking out of trading range,\" Crista Huff, founder of hedge fund Freedom Investment Partners, told MarketWatch. \"We are beginning a bull run.\" But \"clearly we have some massive problems in the economy and there are so many people that are unemployed and 10 or 20 million aren't going to have an easy time finding a new job,\" she added. Corporate earnings still look dire when considering the sharp hit many businesses have taken during the pandemic, although they are mostly better-than-feared. \"In the cyclical parts of the market, there was pessimism heading into earnings,\" said Matt Stucky, equity portfolio manager at Northwestern Mutual Wealth Management, in an interview. But with growing optimism about potential coronavirus vaccines and therapeutics, as well as continuing fiscal and monetary stimulus, Stucky sees a case to be made for downtrodden stocks that have yet to join the Nasdaq at record levels. While the staying power of the pandemic is unknown, he expects the Federal Reserve and other global central banks to keep their feet \"all the way down to the accelerator for awhile, which will permeate into equity prices.\" Early Tuesday, the European Union reached an agreement on a â\u0082¬750 billion ($860 billion) coronavirus rescue fund after four days of intense negotiations among officials from the 27-nation bloc. The recovery package comprises â\u0082¬390 billion in grants and the remainder in loans as a part of a compromise with Denmark, Sweden, Austria and the Netherlands, which had been reluctant to push for a larger package of funds via grants. The leaders also agreed on a multiyear EU budget of over â\u0082¬1 trillion that will run from next year to 2027. In the U.S., investors were awaiting developments on another fiscal stimulus plan by Congress as a $600 per-week federal unemployment package is set to expire at the end of the month. The reports come as a number of corporations are reporting second-quarter results, including Coca-Cola Co. KO, +0.69%,  which presented results that were better than expected early Tuesday. The action on Wall Street comes as the global tally for confirmed cases of the coronavirus that causes COVID-19 climbed to 14.8 million on Tuesday, according to data aggregated by Johns Hopkins University, and the death toll rose to 610,292. The U.S. has the world's highest death toll at 141,426, according to data aggregated by Johns Hopkins University. \"Today, you're seeing optimism around a potential vaccine and also around further economic stimulus,\" said Mike Skillman, chief executive officer at Cadence Capital. \"Cyclical industries have seen the most damage from the coronavirus, with revenue down 30-40%, and earnings down even more,\" he said. \"But there are a few data points, maybe not enough to draw a conclusion, but perhaps signs that we already have seen the bottom.\" On the economic front, the Chicago Fed National Activity Index for June, a composite of 85 indicators, rose to a fresh record 4.11, marking a record high going back to 2000, from a 3.5 in May- representing a level that was raised from the previous May reading. A zero value for the index indicates the national economy is expanding at its historical trend rate of growth. The report highlights that some aspects of the economy are attempting to come off its coronavirus lows. Joe Biden, the presumptive Democratic presidential nominee, also unveiled an $775 billion plan to revive the economy during the pandemic, called the \"21st Century Caregiving and Education Workforce,\" with a promise to bring 3 million new jobs to workers, while also helping fortify universal child and elder care in the U.S. The Senate Banking Committee on Tuesday approved the nomination of Judy Shelton to a seat on the Federal Reserve board of governors, an early supporter and adviser to President Donald Trump, with a controversial record as a gold standard proponent. The committee also approved a second Trump Fed nominee, Christopher Waller, the director of research at the St. Louis Fed, to fill a vacancy on the Fed's seven-member board. Which stocks were in focus? Shares of Coca-Cola Inc. rose 2.3% Tuesday, after the beverage and snack giant reported a second-quarter profit to topped expectations but revenue that fell a bit shy, amid challenges resulting from the coronavirus pandemic. International Business Machines IBM, -2.81% shares retreated 0.3%, after the tech giant reported another decline in revenue but produced more profit and sales than Wall Street expected amid the COVID-19 pandemic. Shares of Lockheed Martin Corp. LMT, -0.68%  rallied 2.6% Tuesday, after the aerospace and defense company reported second-quarter profit and sales that rose above expectations, and lifted its full-year outlook. Philip Morris International Inc. shares PM, +0.70%  rose 4.2% in Tuesday trading after the Marlboro parent reported second-quarter earnings and revenue that beat expectations. Tapestry Inc. TPR, +0.80%, parent of the Coach, Stuart Weitzman and Kate Spade brands, said Chief Executive Jide Zeitlin is resigning from his role and from the board for personal reasons. The company named Chief Financial Officer Joanne Crevoiserat as interim CEO. Its stock was rose 4% Job-networking site LinkedIn is cutting about 960 jobs, or 6% of its work force, as it moves to align the business with the new COVID-19 world. In a message posted on the Microsoft Corp.-owned MSFT, +2.48%  company's website, Chief Executive Ryan Roslanksy said LinkedIn isn't immune to the effects of the pandemic. Shares of Microsoft closed 1.4% lower. Shares of small-cap Moleculin Biotech Inc. MBRX, -0.77%  soared 21% Tuesday, after the company said a second round of laboratory testing confirmed antiviral activity for WP1122, its candidate as a treatment for COVID-19. Its stock surged 20.9%. EBay Inc. EBAY, +6.47%  said it's selling its classified ad business to Norway's Adevinta ADE, +1.25%  for $9.2 billion in cash and stock. Shares of eBay declined 3.2%, while shares of Oslo-listed Adevinta shares closed up 26%. Shares of Tailored Brands Inc. US:TLRD  rose 3.4% Tuesday, after the parent of apparel retailers Men's Wearhouse and Jos. A. Bank said it expects to cut about 20% of its corporate workforce and close up to 500 stores. Amazon.com's stock AMZN, +3.01%  retreated 1.8% Tuesday, after surging on Monday. Exchange-traded funds with energy exposure, the Energy Select Sector SPDR ETF XLE, -1.59%  and the SPDR S&P Oil & Gas Exploration & Production ETF XOP, -1.53%  roared over 6% to their best day in about six weeks Tuesday as investors bet on undervalued sectors amid a surge in crude-oil demand prompted by hope that stimulus measures implemented by developed nation governments will lift demand for crude and its byproducts. Shares of Immuron Ltd. IMRN, +5.56%  soared 42% Tuesday, but pulled back sharply from earlier highs, after the Australia-based biopharmaceutical company announced a registered direct offering of 1.07 million American depositary shares. Wells Fargo & Co. WFC,  named Mike Santomassimo as chief financial officer effective in the fall, replacing John Shrewsberry, who is retiring. How did other markets trade? Germany's DAX 188658, +0.18%  finished 1% higher on Tuesday after the EU forged its landmark recovery package, the gains for the index of Europe's largest economy were helping to erase most of the year-to-date losses for the gauge. Stoxx 600 Europe index SXXP, +0.55%  gained 0.3%, while the U.K.'s FTSE UKX, +0.64%  picked up 0.1%, but the European benchmarks finished off their best levels. In Asia, the Nikkei NIK, -0.11% closed 0.7% higher, while China's CSI 300 gauge 000300, +2.04%  added 0.2% after jumping nearly 3%. South Korea's Kospi 180721, +0.21%  rose 1.4% and Hong Kong's Hang Seng HSI, -0.30%  gained 2.3%. Gold futures US:GCQ20  climbed $26.50, or 1.5%, to settle at $1,843.90 an ounce on the New York Mercantile Exchange, the highest level for the most-active contract since Sept. 2011. August futures for the U.S. crude benchmark US:CLQ20  surged 2.8%, or $1.15, to finish at $41.96 a barrel, the highest level for a front-month contract since March 5, according to Dow Jones Market Data. The 10-year Treasury note yield TMUBMUSD10Y, 0.777%  edged 1.3 basis points lower to around 0.606%. Bond prices move in the opposite direction of yields. In currency markets, the dollar was softening for a second session this week, off 0.7%, against its six major rivals based on trading of the ICE U.S. dollar index. DXY, -0.58% "}]}