{"article": [{"url": "https://www.marketwatch.com/story/this-is-the-age-group-most-affected-by-the-covid-crisis-2020-07-28", "published": 1596042080.0, "headline": "This is the age group most affected by the COVID crisis", "body": "The coronavirus crisis is affecting all age groups, but one in particular is suffering from all aspects of life. Their health and leisure haven’t been safe, and neither have their jobs. Workers 65 and older saw a steep rise in unemployment claims — from 3% in January to 11% in June, according to a report from United Income, an automated investment service owned by Capital One. The firm analyzed the Current Population Survey, a monthly survey from the Census Bureau and Bureau of Labor Statistics. While the senior population represents only 7% of the overall workforce, any job loss could drastically alter their nest egg and retirement security if they’re not otherwise prepared. 80% of older Americans can't afford to retire - COVID-19 isn't helping Unemployment is just one of the many ways in which the coronavirus has upended the comfort of older Americans. This age group has been warned since the beginning of the pandemic that they are most at risk of complications if they contract the coronavirus, and they’ve seen their demographic make up a significant portion of COVID-related deaths across the country. Much of their entertainment and leisure has also been curtailed. Some have been cutoff entirely from visits with their loved ones. See: Be on the lookout for COVID-19’s hidden cost to older people Some seniors have been harder hit by the crisis than others. Unemployment claims for workers 65 and older with lower earnings (defined as less than $50,000 a year) jumped from 8% in January to 17% in June. Comparatively, seniors who earned $100,000 or more a year saw an increase of only 4 percentage points, from 1% to 5% during the same time frame. The percentage of senior workers in each sector of the economy is relatively consistent, the report found. Across the 10 supersectors, including education and trade, the number of workers in retirement age is roughly between 5% and 15%, according to the report. The number of layoffs in these sectors, however, has been inconsistent. The leisure and hospitality sector had the largest spike in unemployment — 21 percentage points. Construction held strong during the crisis, with only an increase of 1 percentage point. United Income Also see: In this COVID climate, should I just retire? Seniors without a college degree also saw a disproportionate disadvantage. These workers had unemployment rise from 3% in January to 12% in June. Alternatively, seniors with a college degree saw a slightly lower uptick, from 3% to 9%. The somewhat good news: workers between the ages of 55 and 64 years old have seen the smallest climb in unemployment between January to June, from 3% to 9%. The overall bad news: the state of additional unemployment benefits is uncertain after July. As part of the CARES Act, workers affected by the crisis were eligible for an additional $600 a week in unemployment benefits, set to expire July 31. Congress is currently discussing a second stimulus package, but Democrats and Republicans do not agree on how this benefit should be handled. Democrats say the extra $600 a week should be extended until January, while Republicans argue it should be lowered."}]}