{"article": [{"url": "https://www.marketwatch.com/story/cuomo-to-allow-new-york-schools-statewide-to-open-in-the-fall-2020-08-07", "published": 1596802100.0, "headline": "Cuomo to allow New York schools statewide to open in the fall", "body": "ALBANY, N.Y. (AP) — New York’s governor said Friday that he would allow children statewide to return to classrooms for the start of the new school year, citing the state’s success in battling the coronavirus pandemic. The announcement by Democratic Gov. Andrew Cuomo clears the way for schools to offer at least some days of in-person classes, alongside remote learning. “Everywhere in the state, every region is below the threshold that we established,” Cuomo said during a conference call with reporters. “If there’s a spike in the infection rate, if there’s a matter of concern in the infection rate, then we can revisit.” Many New York school districts have planned to start the year with students in school buildings only a few days a week, while learning at home the rest of the time. The largest school district in the U.S., New York City’s more than 1 million public school students had their last day of in-class instruction on March 13, just as waves of sick people were beginning to hit city hospitals. All schools statewide were closed by March 18. The city’s mayor, Bill de Blasio, has been saying since the spring that his goal for fall was to bring students back on schedule, with as much classroom time as possible while still allowing for social distancing. That plan has looked exceedingly ambitious as other large school systems have backed away from in-person instruction in recent weeks. Chicago, Los Angeles, Miami and Houston, among other places, all announced they would start the school year with students learning remotely. De Blasio, while cautioning that he could change course at any time, had expressed hope that the relatively low rate of transmission of the virus in the city would allow students and staff to return safely. He had also said a return to classroom instruction is vital to jump-starting the city’s economy, now hobbled by parents being forced to stay home with their children. School reopening plans, though, face enormous hurdles. The outbreak, while reduced, is not over in New York. Around 10,000 New York City residents tested positive for the virus in July. On Wednesday, two unions, New York State United Teachers and the United Federation of Teachers, demanded clearer health protocols dictating that schools should shut down immediately for two weeks if any student or member of the staff contracts the virus. Teachers are prohibited from striking in New York, but it has been unclear whether large numbers would either opt out of classroom instruction for medical reasons or simply refuse to work. Parents, too, have struggled to decide whether to send their children to school or opt solely for online instruction at home. Schools have spent the summer coming up with safety plans, securing protective gear and figuring out how to fit fewer students into classrooms and school buses. Cuomo required all school systems to submit plans detailing their reopening plans, saying that the state would not allow any district with an unsafe plan to bring students back to classrooms. State Health Commissioner Howard Zucker warned this week that “an ill-prepared reopening could put students, staff and parents in peril.” Earlier this summer, Cuomo set a general metric to help measure when it was safe to bring students back, saying the state would allow a return in regions where fewer than 5% of people tested for COVID-19 came back positive. The entire state has been well under that threshold all summer, but Cuomo had also recently stressed that, even if he allowed schools to reopen, it wouldn’t work if parents and teachers aren’t sure they are safe."}]}