{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-point-to-lackluster-stock-market-open-as-investors-await-weekly-jobs-data-11594293039", "published": 1594324760.0, "headline": "Dow ends 360 points lower but Nasdaq notches 26th record of 2020 as investors find safety in tech", "body": "U.S. stocks closed mostly lower Thursday, but off the low of the day, as investors sought safety in technology and tech-related investments amid rising cases of coronavirus in states like Arizona and Florida. A 7-2 Supreme Court decision ruling that a New York prosecutor could have access to President Donald Trump’s tax returns, also was parsed by Wall Street. How are benchmarks performing? The Dow Jones Industrial Average closed 361.19 points, or 1.4%, to end at 25,706.09, but had been down by as many as 544 points at the day’s low. The blue-chip index was weighed down by component Walgreens. The S&P 500 index lost 17.89 points, or 0.6%, at 3,152.05, after touching an intraday low at 3,115.70. The Nasdaq Composite Index resumed its advance following a stint in negative territory, with the tech-laden index closing up 55.25 points, or 0.5%, at 10,547.75, marking its second record in a row and its 26th of 2020. The Nasdaq-100 index NDX, +1.51%, consisting of the largest companies within the Nasdaq by market value, closed up 0.8% at 10,754.59, while the small-cap Russell 2000 index RUT, +0.55%, more sensitive to the economic outlook, finished off 2% at 1,398.92.What’s driving the market? It was a bumpy ride for stocks Thursday, with investors clutching for a handful of technology stocks amid resurgent concerns about the shape of the economic recovery from the COVID-19 pandemic that continues to wreak havoc on the domestic economy. Investors are betting that large-cap tech names will be the clear winners in the aftermath of the viral pandemic, supported by a heavy dose of stimulus by the Federal Reserve and the U.S. government. Stocks may have taken a leg lower late-morning after the Supreme Court ruled 7-2 that the president lacks immunity to withhold his tax returns from prosecutors. It was a bit of a “knee-jerk” reaction, said Joe Saluzzi, co-manager of trading at Themis Trading. “Markets are a bit more friendly to the president and his policies,” Saluzzi said in an interview, “so anything that’s seen as negative to him might provoke a tiny reaction. “ The moves come after a report on weekly jobless claims showed that another 1.3 million Americans filed for first-time employment benefits in the most recent week, below the 1.4 million forecast in the MarketWatch survey, and down from 1.43 million in the prior week. That keeps intact a decelerating trend since peaking last March, but still marks the 15th straight week of claims of at least a million. “Initial claims remain very high and the improvement since late March has almost come to a halt,” wrote analysts at UniCredit in a daily research note. “The re-imposition of restrictions in several states facing growing numbers of new COVID-19 cases could have already had an effect,” the analysts said. The jobless claims report came about a week after the monthly nonfarm-payroll report showed that U.S. economy regained 7.5 million jobs in May and June. That pales compared with the 22 million jobs lost during the first two months of the pandemic. Against that backdrop, infections derived from the novel strain of coronavirus haven’t abated. Bloomberg News reported that Florida saw records in both new hospitalizations and deaths, while Arizona added 4,057 new cases. Overall, the U.S. reported more than 58,000 new cases on Wednesday, according to data compiled by Johns Hopkins University, down slightly from the previous day. The country’s death toll stands at more than 132,309. During a podcast with the Wall Street Journal on Wednesday, Dr. Anthony Fauci , the foremost expert on infectious diseases in the U.S., said that we remain in the throes of the first wave of the deadly pandemic. “We have never gotten out of the first wave,” he said. “So I wish we would stop talking about waves and just look at the reality of where we are right now. ” Indeed, cases in California, Texas and Florida, hot spots in this resurgence, also hit new daily record highs on Wednesday. That said, Florida Gov. Ron DeSantis has encouraged Walt Disney Co DIS, +1.53%. to proceed with its phased plan to reopen its theme parks starting on Thursday and through July 15. In New York, indoor shopping malls outside of New York City are eligible to reopen Friday, New York Gov. Andrew Cuomo said. Meanwhile, Treasury Secretary Steven Mnuchin told CNBC during an interview on Thursday that the Trump administration supports a narrower aid package for Americans hurt by the pandemic. Mnuchin said that the White House backs a further extension of the Paycheck Protection Program, which has been extended to Aug. 8, and stimulus checks for individuals but at lesser level than the initial phases of recovery aid. “The market has priced in the reality that virus is something we have to live with, mortalities are under control, and we’re not going back to a full societal lockdown,” said David Bahnsen, chief investment officer of Newport Beach, Calif.-based The Bahnsen Group, with over $2.25 billion in assets. “The market’s much more focused on the Fed,” Bahnsen said in an interview, “which is not necessarily a good thing but it’s sure hard for the market to form an opinion against risk assets with the liquidity and tight spreads that the Fed has produced.” Check out: Coronavirus tally: Global cases of COVID-19 top 12 million; 549,846 deaths and 38 U.S. states still see rising casesWhich stocks are in focus? Shares of Bed Bath & Beyond BBBY, -1.37% sank 24.5% after the retailer said it would close 20% of its stores. U.S.-listed shares of Hexo Corp. HEXO, +1.66% rose by about 6% Thursday, after the Canada-based cannabis company said it would start selling medical cannabis in Israel, marking the first time its medical cannabis products will be available outside of Canada. Shares of Allegiant Travel Co. ALGT, +2.16% slid 7.7% even though the company said its bookings averaged $4 million a day, “exceeding” its expectations. Tesla Inc. TSLA, +1.89% shares powered 2.1% higher on the back of a Wedbush analysis suggesting the car company may see a “snapback of demand.” Shares of Harley-Davidson Inc. HOG, -3.31% rose 0.6% Thursday after the motorcycle maker disclosed that it will cut about 14% of its workforce as part of a restructuring, and said Chief Financial Officer John Olin is stepping down, effective immediately, after 10 years in the role. Walgreens Boots Alliance WBA, -1.96% stock closed down nearly 8% after the pharmacy chain said it would cut 4,000 jobs. Shares of Wells Fargo & Co. WFC, fell 2.1% on reports that the bank is seen cutting thousands of jobs. How are other assets performing? West Texas Intermediate U.S. crude futures for August delivery fell by $1.28, or 3.1%, to settle at $39.62 a barrel on the New York Mercantile Exchange, as virus concerns dogged demand on the New York Mercantile Exchange. In precious metals, August gold futures GOLD, +2.86% fell $16.80, or 0.9%, to settle at $1,803.80 an ounce, after hitting its highest level since Sept. 2011 on Wednesday. The 10-year Treasury note yield was down fell 3.6 basis point to 0.617%, around its lowest level since May 14. Bond prices move inversely to yields. The greenback rose 0.4% against a basket of its major rivals, based on trading in the ICE U.S. Dollar Index. In European equities, the Stoxx Europe 600 index closed 0.8% lower, and London’s FTSE 100 fell 1.7%. In Asian markets overnight, China’s benchmark CSI 300 Index gained 1.4%, extending its weekly rally. Hong Kong’s Hang Seng Index rose 0.3%. See also: ‘The market isn’t pricing in an all-clear on the economy,’ say BofA analysts, who say the S&P 500 will end the year at 2900"}]}