{"article": [{"url": "https://www.marketwatch.com/story/teslas-stock-sinks-into-correction-territory-after-disclosure-of-another-large-seller-2020-09-02", "published": 1599063800.0, "headline": "Tesla's stock sinks again to kick off a correction after disclosure of another large seller", "body": "Shares of Tesla Inc. took another dive Wednesday to kick off a correction, after the electric vehicle maker disclosed that one of its largest shareholders sold off a chunk of stock, although the sale was effectively just a rebalancing as the value of the stake has actually increased. What may be unnerving investors is the disclosure comes a day after the company itself said it would sell up to $5 billion worth of its stock. Separately, although BofA Securities analyst John Murphy raised his price target to imply a near-30% gain from current levels, he stopped short of recommending investors buy the stock. Tesla's stock TSLA, +1.89%  dropped 5.8% to $447.37 in active trading, to mark the biggest one-day decline in about six weeks. The stock has now tumbled 11.4% since it closed at a record $498.32 on Monday, when its 5-for-1 stock split took effect. Many on Wall Street label a decline of at least 10% to up to 20% from a significant peak as a correction, while a decline of 20% or more is defined as a bear market. Wednesday's close below $448.49 makes the correction \"official;\" a close above Monday's record would wipe away the correction label. Meanwhile, the stock has still rocketed fivefold (up 434.7%) year to date, while the S&P 500 index SPX, +0.87%  has gained 10.8%. Also read: Only 19% of Tesla analysts say buy the stock while investors remain 'insatiable.' “ \"It is important to recognize that the higher the upward spiral of [Tesla's] stock goes, the cheaper capital becomes to fund growth, which is then rewarded by investors with a higher stock price.\" ” - BofA Securities analyst John Murphy Tesla disclosed in an SC-13G/A filing with the Securities and Exchange Commission that Scotland-based Baillie Gifford & Co. had reduced its stake to 39.63 million shares, or 4.25%. That would drop the 112-year-old investment firm to fourth on the list of Tesla's largest shareholders. Baillie Gifford had previously disclosed a stake of 58.86 million shares as of June 30, or 6.32% of the shares outstanding according to FactSet. That made Baillie the second-largest shareholder, behind only Chief Executive Elon Musk's 18.3% stake. Based on Tuesday's stock closing price of $475.05, the approximately 19.23 million shares Baillie Gifford sold would be valued at about $9.14 billion. Baillie Gifford said it sold the stock to meet internal guidelines that limit the percentage of the portfolio that could be invested in a single stock, according to a report in The Wall Street Journal. As of June 30, Baillie's Tesla stake was valued at about $12.7 billion. As of Tuesday's closing price, which was 120% above the June 30 closing price of $215.96, the value of the decreased stake increased by 48% to $18.8 billion. Baillie said it remains optimistic about Tesla's future, and would buy the stock again if its sold off, the WSJ report said.Don't buy the stock even if it can rally more than 20% BofA's Murphy raised his stock price target to $550, which implies a 23% gain from current levels, from $350, citing the logic of the EV maker's bulls that a rising stock price begets a rising stock price. Meanwhile, Murphy reiterated the neutral rating he's had on the stock since Aug. 14, which reflects his skepticism around fundamentals and opportunities for the company. Murphy said Tesla's stock-sale announcement on Tuesday corroborated his view that Tesla will take advantage of the rally to raise \"low-cost equity capital\" to fund accelerated growth. \"It is important to recognize that the higher the upward spiral of [Tesla's] stock goes, the cheaper capital becomes to fund growth, which is then rewarded by investors with a higher stock price,\" Murphy wrote in a note to clients. He cautioned, however, that the inverse of that logic is also true, so that the lower the stock goes, the lower the stock could go. Murphy said it is this \"self-fulfilling framework\" that appears to explain the extreme moves in the stock, to both the upside and downside."}]}