{"article": [{"url": "https://www.marketwatch.com/story/joe-biden-to-give-speech-of-a-lifetime-as-he-accepts-democratic-presidential-nomination-2020-08-20", "published": 1597968260.0, "headline": "â\u0080\u0098Iâ\u0080\u0099ll be an ally of the light, not the darknessâ\u0080\u0099: Joe Biden pledges to rebuild economy as he accepts Democratic nomination", "body": "Joe Biden pledged to rebuild the battered U.S. economy and tackle the coronavirus pandemic as he accepted the Democratic Partyâ\u0080\u0099s nomination for president on Thursday night, casting himself as a salve to a nation wounded by the policies of President Donald Trump. In a speech that veered between lofty rhetoric and specific proposals, Biden said the U.S. will overcome what he called a â\u0080\u009cseason of darknessâ\u0080\u009d that has blossomed under Trump. He said there was a battle for the soul of the country, as Americans struggle with COVID-19, a shattered economy, racial justice and climate change. â\u0080\u009cIâ\u0080\u0099ll be an ally of the light, not the darkness,â\u0080\u009d said Biden from Wilmington, Del. Capping the Democratsâ\u0080\u0099 almost-entirely virtual convention, and coming in the midst of a global pandemic that has claimed more than 173,000 American lives, Bidenâ\u0080\u0099s address followed testimonials earlier in the week from party luminaries including former Presidents Barack Obama and Bill Clinton, former first lady Michelle Obama, and vice-presidential nominee Kamala Harris, who spoke Wednesday night. Now see:â\u0080\u0098We have a chance to change the course of historyâ\u0080\u0099: Kamala Harris accepts Democratic vice-presidential nomination With Biden as their nominee, the Democrats put up a united front against Trump, saying the Republican president has bungled the pandemic and treated the White House as a reality show. â\u0080\u009cOur current president has failed in his most basic duty to this nation,â\u0080\u009d Biden said. â\u0080\u009cHe failed to protect us.â\u0080\u009d Democrats also drove home a get-out-the-vote message, as Trump has alleged that more mail-in voting would result in fraud. There is no evidence of widespread voter fraud through mail-in voting. Trump staged an event Thursday just outside the former vice presidentâ\u0080\u0099s birthplace in Scranton, Pa. The Republican charged that Biden â\u0080\u009cis a puppet of the radical left movementâ\u0080\u009d who is a threat to investors DJIA, +0.56% Â and the economy. Trump Today: Trump blasts Biden in his Pennsylvania hometown hours before former V.P. accepts Democratic nomination for president. Bidenâ\u0080\u0099s proposals include expanding Obamacare by offering a public-insurance option; increasing the federal minimum wage to $15 an hour; spending $2 trillion over four years on clean-energy projects; and free COVID-19 testing. In the wake of the killings of George Floyd and other Black Americans, moreover, Biden has vowed investment in Black-owned businesses and said the Federal Reserve must address racial economic gaps as part of its mission. Also read:Hereâ\u0080\u0099s where Joe Biden has moved to the left â\u0080\u0094 and where he hasnâ\u0080\u0099t. With unemployment above 10% as the U.S. struggles amid the coronavirus pandemic, Biden and Harris have been pushing a message of job creation through investing in areas like infrastructure. Biden has said heâ\u0080\u0099d roll back Trumpâ\u0080\u0099s tax cuts to pay for his plans. â\u0080\u009cMy economic plan is all about jobs, dignity, respect, and community,â\u0080\u009d said Biden. Full text:Bidenâ\u0080\u0099s speech to the convention. Should Biden win the presidency, many of his big policy proposals could be stymied without Democrats in control of both chambers of Congress. Republicans currently control the Senate, and Democrats during the convention urged voters to help the party flip the chamber. Stocks SPX, +0.87% Â have reclaimed their perches at all-time highs, but other grim statistics give Biden an opening in November, Widener University political scientist J. Wesley Leckrone recently told MarketWatch. â\u0080\u009cNow, [Biden] can start reaching out and saying, â\u0080\u0098I know what youâ\u0080\u0099re going through right now, I grew up in that environment, and weâ\u0080\u0099re going to build back,â\u0080\u0099â\u0080\u009d said Leckrone. Biden frequently references his middle-class upbringing, and called Harris a â\u0080\u009cfearless fighter for the little guyâ\u0080\u009d when he announced her as his running mate. Barronâ\u0080\u0099s:How a Biden win would affect different market sectors â\u0080\u0094 and stock picks for both election outcomes Trump is trailing Biden in polls of battleground states including Pennsylvania, Florida and Wisconsin. Betting markets are pointing to a Biden victory. Next week, Republicans will renominate Trump during their own largely virtual convention, and shift the spotlight back to the president. Trump reportedly wants a program heavy with live programming and plans to deliver his address from the White House."}]}