{"article": [{"url": "https://www.marketwatch.com/story/a-small-subset-of-vanguard-investors-moved-entirely-into-cash-when-the-market-tumbled-heres-how-they-did-2020-08-13", "published": 1597317560.0, "headline": "A small subset of Vanguard investors moved entirely into cash when the market tumbled. Here's how they did", "body": "The thought must've crossed many investors' minds during the pandemic. Why not just get out of the markets entirely and switch into cash? Fund management giant Vanguard Group looked at the investors who did exactly that, in a study recently published. Now, the Vanguard crowd isn't exactly that of Robinhood-between Feb. 19 and May 31, only 5% of self-directed defined-contribution plan participants traded at all. The proportion was somewhat higher among retail self-directed households, with 17% making some trades during that time period. For both sets of investors, less than 0.5% of clients moved into all-cash portfolio, Vanguard said. The defined contribution cash panickers went from having 69% of their $105,000 portfolios in stocks at the end of 2019, and the retail cash panickers went from having 77% of their $70,000 portfolios in stocks. In both cases, these investors were typically in the mid-50s and held accounts for over a decade. About two-thirds of the defined contribution cash panickers were female; the retail cash panicker split was 46% male, 29% female and 25% a household of two or more members. Vanguard then went and compared the distributions of their actual realized returns to their personal pre-pandemic benchmark returns. At the end of March, the cash panickers had done better, with 56% of defined contribution and 58% of individual investors sporting better returns. That changed as the market rebounded. By the end of May, 84% of the defined contribution cash panickers had worse returns than their pre-pandemic portfolio, with 86% of retail cash panickers doing worse. Those numbers are likely more lopsided now, as the S&P 500 SPX, +0.87%  has added another 11% between the end of May and Wednesday, according to FactSet data. The S&P 500 has surged over 50% from its March lows, and the Nasdaq Composite COMP, +1.39% has gained over 60% from the depths of March."}]}