{"article": [{"url": "https://www.marketwatch.com/story/brainard-says-fed-should-shift-to-more-aggressive-strategy-to-boost-the-economy-2020-09-01", "published": 1598970080.0, "headline": "Brainard says Fed should shift to more aggressive strategy to boost the economy", "body": "Federal Reserve Governor Lael Brainard on Tuesday said the central bank should “pivot” to providing more support for U.S. economic growth in the months ahead after introducing a flurry of unprecedented programs earlier in the year when the coronavirus epidemic broke out. Brainard suggested a more aggressive approach would be needed to help Americans get back to work, reduce a high unemployment rate, and nudge inflation closer to the central bank’s goal. With interest rates already at record lows, presumably the Fed would accomplish that goal through the purchase of more assets such as U.S. Treasurys or privately held bonds. Such a strategy has pushed more investors into equities, analysts say, and contributed to a big rebound in the U.S. stock market. The S&P 500 index SPX, +0.87%, for instance, has set fresh records and the Dow Jones Industrial Average DJIA, +0.56% is not far from an all-time high. The Fed has already ramped up asset purchases to stabilize financial markets and pull down long-term interest rates. The lowest mortgage rates in modern times have spurred a rapid increase in homes sales even as the coronavirus continues to depress large swaths of the economy. Auto sales have also boomed. Yet Brainard also cautioned that low interest rates stemming from the Fed’s looser inflation-fighting strategy could entice investors to take more risks in search of returns and destabilize asset prices once the economy expands again. The Fed would need to be vigilant, she said, and use all its tools to prevent asset volatility from derailing a recovery. In remarks to the Brookings Institution, Brainard became the latest Fed official to argue vociferously in favor of the central bank’s historic shift to inflation averaging. The Fed broke with decades of tradition last week to adopt an inflation-averaging strategy that could result in interest rates staying low for longer periods. The bank would strive for an average 2% inflation rate over an undetermined period of time instead of a hard 2% target before raising rates. Senior Fed officials, including Chairman Jerome Powell and Vice Chairman Richard Clarida, have come out in force in the past week to argue on behalf of the change. Read: Fed’s Clarida says new inflation-fighting strategy has roots in failure of old approac Brainard said the new strategy will help support an economic recovery from the coronavirus pandemic and boost hiring in the long run, especially for less-skilled Americans on the fringes of the labor market. Echoing comments from her colleagues, Brainard said the Fed may have erred by raising interest rates as much as it did from 2015 to 2018. The central bank lifted its benchmark fed funds short-term rate to as high as 2.5% from the near-zero level that long prevailed in the aftermath of the 2007-09 Great Recession. The cost of many business and consumer loans are tied to the fed-funds rate. Although millions of Americans still found jobs, Brainard suggested hiring “would have been greater” had the Fed’s new inflation-averaging strategy been in place several years ago. See:MarketWatch Coronavirus Recovery Tracker Brainard said the Fed’s old approach to measuring inflation and deciding when to raise interest rates had become less effective because of major changes in the U.S. and global economies that have swept in an era of low inflation. The Fed used to raise interest rates when the unemployment rate fell, but the longstanding relationship, known to economists as the Phillips curve, began to break down more than a decade ago. Even as unemployment fell to record lows, inflation barely rose. For most of the past decade inflation has persistently run below the Fed’s 2% target, raising the specter of an even more damaging bout of deflation. The last time the U.S. experienced a serious bout of deflation was in the early stages of the Great Depression almost a century earlier. The new strategy, Brainard said, could “arrest any downward drift in inflation expectations.”"}]}