{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-climb-as-hope-for-v-shaped-recovery-overshadows-rise-in-coronavirus-cases-2020-06-22", "published": 1592845460.0, "headline": "Dow ends above 26,000 as rally in tech-related stocks propels Nasdaq to fresh record close", "body": "Major stock indexes closed higher Monday, led by technology-related shares, as investors weighed optimism over a quick recovery for the domestic economy, or V-shaped rebound, against evidence of an acceleration of COVID-19 infections in half of all U.S. states and elsewhere in the world. How did benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% advanced 153.50 points, or 0.6%, to end at 26,024.96, after starting the session down nearly 204 points. The S&P 500 SPX, +0.87% rose 20.12 points, or 0.7%, to finish at 3,117.86, off its intraday low of 3,079.26, and powered by a 1.9% jump in information technology SP500.45, +1.54%. The tech-heavy Nasdaq Composite COMP, +1.39% picked up 110.35 points, or 1.1%, closing at a record high of 10,056.47, while booking its seventh day in a row of gains and clinching its longest win streak since Dec. 26, 2019, according to Dow Jones Market Data. On Friday, the Dow booked a weekly gain of 1%, the S&P 500 gained 1.9%, and the Nasdaq returned 3.7%.What drove the market? High-flying technology companies that outshined the market during the pandemic helped propel major stock indexes higher on Monday, after the weekend saw cases of the disease caused by the novel strain of coronavirus pick up momentum as more U.S. states and businesses reopened. Investors still view local governments as reluctant to reinstitute restrictions on social activities or stall plans to ease lockdown measures further, as the economy shows signs of improvement from the depths of the COVID-19 crisis. “Virus numbers are picking up,” said Bruce Bittles, chief investment strategist at Robert W. Baird & Co. “But it’s not to the extent that we’re looking at a shutdown again.” Bittles said investors have become upbeat about better-than-expected U.S. economic data and hopes that Congress will pass another nearly $1 trillion fiscal stimulus package this summer. “That’s all a big positive for the economy,” he said. Shares of Nike, Inc. NKE, +0.97% Apple Inc. AAPL, +1.74% and Microsoft Corp. MSFT, +2.48% led the Dow higher on Monday. U.S. stocks booked gains, despite briefly pulling back late in the session, following multiple reports that President Donald Trump plans to sign an executive order Monday to temporarily halt workers with visas in the H-1B category, and others, from coming to the U.S. amid the pandemic. The order also is expected to extend to January a pause on issuing “green cards” to new immigrants, an NPR report said. The World Health Organization on Sunday reported the largest single-day increase in global COVID-19 cases, more than 183,000, while South Korea on Monday declared its resurgence of the deadly virus a “second wave.” Domestically, there are 24 states that showed an increasing trend in cases this past week, with California, Texas and Florida continuing to lead the way, each with more than 4,000 new cases on Sunday alone, according to data aggregated by Johns Hopkins University. The global tally for COVID-19 has topped 9 million. “The biggest uncertainty surrounds the potential for a renewed and sharp pick-up in COVID-19 cases,” wrote Ben May, Oxford Economics’ director of global macro research, in a note Monday. “While concerns about a second wave have grown recently sparked by a rise in case numbers in some regions, it’s too early to conclude that another wave is coming.” New York City started allowing companies to reopen their offices Monday after a three-month lockdown because of the pandemic. White House trade adviser Peter Navarro said the Trump administration is preparing for a second wave, but isn’t anticipating one. “We don’t necessarily expect a second wave, but prudence dictates that we plan for it. There is no contradiction,” he told CNN’s Jake Tapper on CNN’s “State of the Union” on Sunday. A number of strategists, however, are betting that the economy will stage a sharp rebound out of recession, even as infections pick up. “History is not on the side of investors expecting anything less than a V-shape,” wrote analysts at Jefferies, led by global equity strategist Sean Darby, in a research note anticipating improvement in earnings as manufacturing data steadies from coronavirus lows. Looking ahead, the Federal Reserve will release the results of its annual stress tests on the nation’s largest banks next Thursday. The Fed has conducted stress tests on the biggest banks every year since 2009 and this year is particularly important in the wake of the coronavirus pandemic. Read:Volatility could spell trouble for bank stocks In economic data, the Chicago Fed’s national activity index rebounded to a reading of 2.61 in May from a revised minus-17.89 in April. A number above a zero value for the index, which is a weighted average of 85 economic indicators, indicates that the national economy is expanding at its historical trend rate of growth. Negative values indicate below-average growth. Existing home sales fell 9.7% compared with April, to a seasonally adjusted annualized rate of 3.91 million units, according to the National Association of Realtors.Which stocks were in focus? Shares of Apple Inc. AAPL, +1.74% were in focus as the iPhone maker this week holds the first-ever virtual version of its Worldwide Developers Conference, an annual event that began in 1987. Its shares closed 2.6% higher. American Airlines Group’s stock AAL, +0.34% tumbled 6.8% after the air carrier announced Sunday that it would raise $3.5 billion in new financing. Tripadvisor Inc. TRIP, +0.74% said Monday that it expects June revenue to be about 20% of last year’s comparable period total. The stock gained 0.1%. Bed Bath & Beyond Inc. BBBY, -1.37% said it added a $850 million credit facility, and that it expected nearly all stores to reopen by July. The stock rose 1.3%. Shares of Biogen Inc. BIIB, -0.13% fell on Monday, after Barclays downgraded the biotech, arguing that investors are right to be concerned after courts last week dealt a blow to the patent on its most valuable drug, Tecfidera, raising the prospects for generic competitors to the multiple-sclerosis drug. Shares dipped 2.3%. Shares of Alphabet Inc. GOOG, +1.97% GOOGL, +1.82% were in focus after Google’s ad revenue was projected to fall in 2020, according to eMarketer. Shares rose 1.4% and 1.8%, respectively. Shares of Sonos Inc. SONO, -1.07% climbed 17.8% after Citron Research chimed in with a bullish view of the smart-speaker company. Nikola Corp. NKLA, -1.36% is “poised to disrupt the transportation industry,” analysts at J.P. Morgan said in a note Monday. Shares advanced 6.2%. Shares of Gilead Sciences Inc. GILD, +0.82% fell 2.3% Monday, after the drugmaker said it plans to start Phase 1 clinical trials for an inhaled version of remdesivir, its treatment for severely ill COVID-19 patients. How did other markets trade? West Texas Intermediate U.S. crude US:CLN20 erased early losses, adding 71 cents, or 1.8%, to settle at $40.73 a barrel. In precious metals, gold futures for August US:GCM20 gained $13.40, or 0.8%, to finish at $1,766.40 an ounce, on the New York Mercantile Exchange, its highest level in nearly 10 weeks. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose less than 1 basis points to 0.704%. Bond prices move inversely to yields. The greenback was down 0.6% against basket of its major rivals, based on trading in the ICE U.S. Dollar Index DXY, -0.58% . In global equities, the Stoxx Europe 600 index SXXP, +0.55% closed down 0.8%, while the FTSE 100 index UKX, +0.64% also fell 0.8%. In Asian markets, China’s benchmark CSI 300 index 000300, +2.04% gained 0.1%, and the Japanese Nikkei NIK, -0.11% closed 0.2% lower. Sunny Oh contributed reporting"}]}