{"article": [{"url": "https://www.marketwatch.com/story/commercial-real-estate-somehow-has-been-skipped-over-for-covid-19-aid-heres-a-plan-to-change-that-through-equity-investments-2020-07-02", "published": 1594036520.0, "headline": "Commercial real estate â\u0080\u0098somehow has been skipped over,â\u0080\u0099 for COVID-19 aid. Hereâ\u0080\u0099s a plan to change that through equity investments", "body": "Commercial real estateâ\u0080\u0099s COVID-19 woes canâ\u0080\u0099t be patched up with more debt. Thatâ\u0080\u0099s Lisa Pendergast, executive director of the CRE Finance Council, an industry group focused on the $4.6 trillion commercial real estate finance market, on the pile of problems confronting properties as a result of the coronavirus pandemic. â\u0080\u009cMy general view is that commercial real estate has somehow been skipped over,â\u0080\u009d she told MarketWatch, speaking of the Federal Reserveâ\u0080\u0099s more than $2 trillion slate of pandemic funding programs that in March were created to bolster U.S. corporations, small-business owners, municipalities and a limited segment of commercial real estate during the COVID-19 crisis. Clearly, the Fedâ\u0080\u0099s lending programs have kept financial markets flush with credit. Highly rated U.S. companies borrowed a record amount of debt in the yearâ\u0080\u0099s first half. Less risky parts of the commercial mortgage-backed securities (CMBS) market, where loans on hotels, malls, office buildings and other properties are packaged into bond deals, recovered from what investors said briefly felt like the â\u0080\u009cdarkest daysâ\u0080\u009d of the 2007-08 global financial crisis. But what the Fedâ\u0080\u0099s programs havenâ\u0080\u0099t reached is distress at the commercial property level, where building owners now face litigious tenants, vanishing rents and mortgages that look more likely to turn toxic with each passing month of the pandemic. Read: Lockdowns ease in New York City and other major cities, but commercial real estate still tied in knots Itâ\u0080\u0099s not only that properties must remain closed, or only partially occupied, as more states reverse plans to reopen amid surging COVID-19 infections, but also that owners have little clarity on when cash flows on properties might improve. “ â\u0080\u009cThe ideal solution is to get everybody back to work and this economy functioning the way it was on January 1, 2020.â\u0080\u009d ” â\u0080\u0094 Patrick Sargent, partner at law firm Alston & Bird, in Dallas â\u0080\u009cFor hospitality, bars, hotels and travel, it is just tough to see how they generate much earnings momentum at all,â\u0080\u009d Rich Sega, global chief investment strategist at Conning, said in an interview with MarketWatch.The preferred equity plan Across much of the U.S., itâ\u0080\u0099s now the fourth month of working from home, grueling limitations on social interactions and curbs on business operations. Commercial mortgage late payments during this period have skyrocketed. In June, the delinquency rate for property loans that were bundled into commercial mortgage-backed securities deals hit a near all-time high of 10.3%, a jump from only 2.8% a year prior, according to Trepp, a CMBS data tracker. Goldman Sachs analysts expect the rate to hit a record 11.3% in July. â\u0080\u009cThe numbers are truly eye popping,â\u0080\u009d Pendergast said of the rapid pace of building owners falling behind of their mortgages. During the global financial crisis it â\u0080\u009cwas kind of a rolling disaster that was slower to materialize,â\u0080\u009d she said, speaking of the distress that eventually hit commercial properties a decade ago. â\u0080\u009cHere, it was overnight.â\u0080\u009d Pendergast had a front-row seat to the 2007-08 market crash, which was sparked by risky subprime lending on homes and derivative side bets, but ended up crippling global financial markets. In the run-up to the crisis, and its immediate aftermath, she was a CMBS strategist at the Royal Bank of Scotland Group US:RBS, a major player in the market, until 2009 when she moved to the Jefferies Financial Group, before taking the reins of the CRE Financial Council in 2016. â\u0080\u009cWe are talking with regulators and trying to get them to consider what can be done,â\u0080\u009d Pendergast said of her COVID-19 proposal. â\u0080\u009cWe want to find a means that delivers cash to borrowers directly.â\u0080\u009d Specifically, Pendergast would like U.S. Treasury Secretary Steven Mnuchin and Federal Reserve Chairman Jerome Powell to consider injecting $250 billion to $300 billion worth of equity into commercial properties, giving the government what is known as a preferred equity stake. The fresh capital would be earmarked for property owners to cover 12 months of debt service payments, plus pay operating expenses and taxes. The goal would be to prevent a wave of mortgage defaults and property foreclosures, which a decade ago helped derail the U.S. economy and led prices on both residential and commercial properties into one of the worst downward spirals on record. During the COVID-19 crisis, the U.S. housing market has seen price gains, while commercial property prices have fallen 11% on the year to date, according to the latest Green Streetâ\u0080\u0099s Commercial Property Price Index. Meanwhile, U.S. stocks have staged a dramatic recovery, with the Dow Jones Industrial Average down DJIA, +0.56% Â on Monday trading nearly 16% higher over the past three months and the tech-heavy Nasdaq Composite Index COMP, +1.39% Â 32% higher for the period. What does the Fed or Treasury get for its investment? The plan is to charge a roughly 2% fee to borrowers for the equity injections, as well as returning the initial equity investment once borrowers repay their mortgage debts. It also could be a more direct means of stabilizing property prices, and therefore communities. Importantly, the equity also would sit below any mezzanine or senior debt on a property, which provides a work around to the limits embedded in the roughly $550 billion CMBS financing market that bar additional debt on properties. Typically, those limits even prohibit forgivable grants, such as the loans made to small-business owners through the Treasury Departmentâ\u0080\u0099s hallmark $670 billion Paycheck Protection Program, which could be extended through early August. See: House passes bill extending Paycheck Protection Program, sending to Trump for signature â\u0080\u009cThere are contractual requirements that canâ\u0080\u0099t be set aside,â\u0080\u009d said Patrick Sargent a partner at law firm Alston & Bird in Dallas, of the preferred equity approach to shoring up commercial real estate. â\u0080\u009cItâ\u0080\u0099s not just that we donâ\u0080\u0099t want to burden the borrower with more debt.â\u0080\u009d Still, the preferred equity plan has its risks, including that regulators wielding taxpayer funds could lose their entire investment on some properties if a yearâ\u0080\u0099s worth of relief isnâ\u0080\u0099t enough to offset what could be a new era for building use. Retail and hotel properties have been the hardest-hit sectors by the coronavirus thus far, as travel for business and leisure dried up and likely stay that way for some time. Powell said the next stimulus legislation should find ways to help hotels and other industries hit hardest by the pandemic, during a congressional hearing this week on the federal response to COIVD-19. But Morgan Stanley analysts also said they expect the trend of working from home to triple by 2024, a shift they see pushing office rents lower in New York City and San Francisco and vacancies higher over roughly the next five years. â\u0080\u009cThe ideal solution is to get everybody back to work and this economy functioning the way it was on January 1, 2020,â\u0080\u009d Sargent said, while also pointed out thatâ\u0080\u0099s hard to see happening in Texas, where heâ\u0080\u0099s located, and in other states now battling surging infections. â\u0080\u009cPeople here two weeks ago thought we had a handle on things,â\u0080\u009d he said. â\u0080\u009cBut we have not done a good job reopening responsibly.â\u0080\u009d"}]}