{"article": [{"url": "https://www.marketwatch.com/story/nasdaq-composite-exhibiting-signs-of-panic-like-buying-as-stock-market-trades-off-its-lows-on-thursday-2020-07-30", "published": 1596111500.0, "headline": "Nasdaq Composite exhibiting signs of panic-like buying as stock market trades off its lows on Thursday", "body": "Trading in the Nasdaq Composite late-morning Thursday was exhibiting panic-like-buying behavior, as the stock-market benchmarks, weakened after the worst GOP report on record, came off their lows of the session. The Nasdaq Composite COMP, +1.39% was up less than 0.1% at 10,560 after touching a low at 10,412.09 earlier. The Nasdaq Arms Index, a volume-weighted breadth measure, fell to 0.395, with many on Wall Street see declines below 0.500 as suggesting panic buying. The Arms Index is calculated by dividing the ratio of the number of advancing stocks over decliners by the ratio of the volume of advancing stocks over declining volume. As the stock market rises, the Arms often falls below 1.000, as the buyers rush into advancing stocks. The current dynamic suggests that investors may continue to adhere to a trend of buying large-capitalization technology-related names that have helped the Nasdaq and the Nasdaq-100 index NDX, +1.51% outperform their peer indexes over the past several weeks. The trading in the tech index also comes as investors await a hectic week of corporate earnings, with results from dozens of high-profile companies due after the bell on Thursday, including Google parent Alphabet Inc. GOOG, +1.97% GOOGL, +1.82%, Apple Inc. AAPL, +1.74% Facebook Inc. [s :FB] and Amazon.com Inc. AMZN, +3.01%. Meanwhile, the Dow Jones Industrial Average DJIA, +0.56% was down 316 points, or 1.2%, at 26,233, while the S&P 500 index SPX, +0.87% was off 0.7% at 3,235. The Dow was flirting with a close below its 50-day moving average at 26,039.97 for the first time since April 24, according to Dow Jones Market Data. Stocks on Thursday opened lower after a first-reading of for the second quarter GDP fell at a 32.9% annualized pace, the Commerce Department said, a bit better than the 34.6% annual decline forecast in a MarketWatch survey, but still the worst in history. Separately, first-time claims for unemployment benefits rose slightly last week, to 1.43 million from an upwardly-revised 1.42 million, while continuing claims also rose to 17 million in the week ended July 18."}]}