{"article": [{"url": "https://www.marketwatch.com/story/hahn-fda-wont-make-regulatory-decisions-based-on-preprints-or-news-releases-2020-08-05", "published": 1596695000.0, "headline": "Hahn: FDA won't make regulatory decisions based on preprints or news releases", "body": "The COVID-19 pandemic has upended the long standing model for publishing clinical data as researchers and drugmakers race to share the latest findings about treatment and vaccine candidates at a time when case counts and deaths are still rising. Many of the medical and scientific findings during the pandemic have been published in news releases or in preprint format, meaning they haven't been peer reviewed, on sites like bioRxiv and medRxiv, both of which were founded last year by Cold Spring Harbor Laboratory and the BMJ medical journal. This kind of research is closely watched by Wall Street since many of the early findings about experimental drugs and vaccines can move the stocks of the companies developing those products. See also: Why virus stocks are driving market volatility Yet Dr. Stephen Hahn, commissioner of the Food and Drug Administration (FDA), is clear that the rise of preprint culture isn't part of regulatory decision making. \"What we've seen during the pandemic is a lot of preprints and press releases,\" Hahn said last week in an interview with the medical journal JAMA. \"We can't make a decision based upon a preprint or a press release, and that's because we insist upon seeing all of the raw clinical trial data.\" Traditionally, medical and scientific research goes through a peer-review vetting process before being published in medical or scientific journals. Preprints have come into question, as has the speed in which medical journals are publishing research and the volume of news releases issued by companies developing treatments or vaccines. Each manufacturer that has put a COVID-19 vaccine candidate into the clinic in the U.S. has taken a slightly different approach to publishing data from their Phase 1 clinical trials. Moderna Inc. MRNA, +0.09%  first issued a press release with interim results on May 18 and a study was published in the New England Journal of Medicine a month later, on July 14. Inovio Pharmaceuticals Inc. INO, -1.36% so far has only issued a news release, on June 30. When BioNTech SE BNTX, +1.23%  and Pfizer Inc. PFE, -0.27% released the first data from the Phase 1 clinical trial of their COVID-19 vaccine candidate on July 20, they published a preprint and issued a news release at the same time. Don't miss:Dr. Osterholm: Americans will be living with the coronavirus for decades That said, the pace at which information is discovered and shared during the unprecedented time is staggering. As of June 1, at least 42,000 papers on COVID-19 have been published, 272 patents have been issued, and more than 3,100 clinical trials have been initiated, according to the Digital Science platform. The Chan Zuckerberg Initiative, a company founded by Facebook Inc. FB, +0.26%  founder Mark Zuckerberg and his wife Priscilla Chan, gave $2 million in June to medRxiv. The company said that more than 7,000 preprints about COVID-19 have been published, including 5,500 on bioRxiv and medRxiv. But it's not just the volume of research, it's how quickly scientific or medical consensus is shifting. Three months ago, there was heightened concern about the virus spreading on surfaces. Now that focus has shifted to the dynamics of airborne transmission and growing worries about transmission via the eye. Once-hyped drugs like Roche Holding AG's ROG, +1.80%  rheumatoid-arthritis drug Actema failed to successfully treat COVID-19 patients and others like hydroxychloroquine have moved out of favor in clinical settings as evidence has emerged that they don't work. Read: Dr. Fauci recommends wearing goggles to prevent catching the coronavirus JAMA, for example, has received at least 7,000 additional submissions during the pandemic, Editor in Chief Dr. Howard Bauchner said during the interview with Hahn. He also asked Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, a similar question during a live-streamed interview this week. \"Do you think it's even reasonable to ask that they restrain themselves from press releases about early examination of data?,\" Bauchner asked. \"I actually think that that's a very good idea,\" said Fauci. \"[But] the companies, sometimes, [they] tell us they have to do that. They have to make something public, even though it isn't in the arena of the normal academic circles that you and I work in.\""}]}