{"article": [{"url": "https://www.marketwatch.com/story/asian-markets-mixed-ahead-of-fed-announcement-2020-07-29", "published": 1595984960.0, "headline": "Asian markets mixed amid gloomy earnings and pandemic concerns", "body": "Asian shares were mixed Wednesday as reports of dismal company earnings add to pessimism over the widespread economic fallout from the coronavirus pandemic. Tokyo’s Nikkei 225 index lost 1% after Fitch Ratings downgraded its outlook for Japan to “negative” from “stable.” “The coronavirus pandemic has caused a sharp economic contraction in Japan, despite the country’s early success in containing the virus,” Fitch said in announcing its decision. Japanese automaker Nissan Motor Co. 7201, -0.90% reported a loss for the fiscal first quarter and projected to remain in the red for the second year straight. Other big-name Japanese companies such as camera company Canon 7751, -1.96% and robot manufacturer 6954, -1.06% lso reported weak results. Earnings reports overnight also discouraged investors, pulling shares lower on Wall Street. Market players are awaiting the outcome of a U.S. Federal Reserve policy meeting that began Tuesday. Gold prices US:GCQ20 moderated their steep climb, adding 0.3% to $1,949.70 by midday Asia time. The Nikkei 225 NIK, -0.11% gave up 1%, while South Korea’s Kospi 180721, +0.21% added 0.1%. Australia’s S&P/ASX 200 XJO, +0.00% was flat. Hong Kong’s Hang Seng HSI, -0.30% was up 0.1%, while the Shanghai Composite SHCOMP, +1.67% jumped 1%. Jingyi Pan, market strategist with IG in Singapore, said market players also were watching for Hong Kong’s second quarter economic growth data. The Federal Reserve began a two-day meeting on interest rates Tuesday, with an announcement scheduled for Wednesday. Investors largely expect the central bank to keep short-term rates at their record, near-zero low, but they’re also looking to hear what it says about how long they may stay there. The Fed helped launch the stock market’s recovery in late March after slashing interest rates and promising to buy Treasurys, corporate bonds and other debt to prop up the economy. On Tuesday, the Fed said it will extend the lives of seven of the lending programs by three months through the end of the year, an acknowledgment of the severity of the recession. Still, sentiment on Wall Street was downbeat. The S&P 500 SPX, +0.87% fell 0.6% to 3,218.44 after a last-hour slide erased a small gain from earlier in the day. The Dow Jones Industrial Average DJIA, +0.56% dropped 0.8%, to 26,379.28, and the Nasdaq Composite COMP, +1.39% lost 1.3%, to 10,402.09. This week marks the heart of earnings reporting season for the S&P 500, and several big companies gave results that fell short of analysts’ already lowered expectations as the pandemic stole customers away and increased some costs. 3M MMM, +0.94% , a maker of N95 masks and various other products for consumers and businesses, fell 4.8% after reporting a profit for the latest quarter that fell shy of analysts’ expectations. McDonald’s MCD, -0.43% lost 2.5% after its earnings during the spring plunged by more than two-thirds from a year earlier. Losses for big technology stocks also helped to drag the market lower. The CEOs of Amazon AMZN, +3.01% , Apple AAPL, +1.74% , Facebook FB, +0.26% and Google’s GOOGL, +1.82% parent company are all set to give testimony Wednesday to a House of Representatives committee investigating Big Tech’s market dominance. Pfizer PFE, -0.27% climbed 3.9% after reporting a profit for the latest quarter that exceeded expectations, even though it was down by nearly a third from a year earlier. It also nudged up its profit forecast for the full year after announcing the start of a late-stage trial of an experimental COVID-19 vaccine that it’s developing with German partner BioNTech. Rising coronavirus counts in many states are bringing a new wave of shutdowns and investors are hopeful that Democrats and Republicans can reach a deal on more aid for the 16 million or so Americans who are getting unemployment benefits, even though the two sides still seem to be far apart. Benchmark U.S. crude oil CL00, -1.62% eased slightly to $40.95 a barrel in electronic trading on the New York Mercantile Exchange. It lost 56 cents to $41.04 per barrel on Tuesday. Brent BRN00, -0.07% the international standard, gained 3 cents to $43.64 per barrel. The U.S. dollar USDJPY, -0.38% slipped to 105.04 Japanese yen from 105.07 yen on Tuesday. The euro EURUSD, +0.60% cost $1.1728, up slightly from $1.1718."}]}