{"article": [{"url": "https://www.marketwatch.com/story/its-not-safe-to-leave-the-house-and-its-not-safe-to-stay-in-the-house-how-coronavirus-could-exacerbate-domestic-violence-2020-03-20", "published": 1592560220.0, "headline": "'We've seen an alarming spike in domestic violence reports:' For some women, it's not safe to leave the house OR stay home", "body": "New York Gov. Andrew Cuomo said the state has seen an \"alarming spike\" in domestic violence reports during the COVID-19 crisis. \"The COVID-19 DV task force chaired by @melissadderosa has issued recommendations that NY will adopt. We will make services more survivor centered and individualized,\" the Democratic lawmaker tweeted TWTR, -0.23% on Saturday. Mentions of the new coronavirus have cropped up in calls, texts and online chats to the National Domestic Violence Hotline in recent months, as public-health experts urge social distancing and staying home to stem the disease's spread. One woman told an advocate that COVID-19 had impacted her plans to leave her relationship upon her graduation in May, according to excerpts from the hotline's log shared with MarketWatch. Her abusive partner was now home 24/7 after being laid off from his job, she said, and had also prohibited her from going to work. “ Domestic-violence advocates worry that confining people with their abusers could exacerbate the frequency and intensity of abuse, as the pandemic's economic fallout further threatens survivors' financial stability. ” A female caller in California self-quarantining due to her asthma said she was afraid to go to the emergency room after her partner strangled her, citing fear of catching COVID-19. Another contact also expressed coronavirus-related misgivings about seeking medical care after being strangled; the person said they were taking online classes due to a college-campus closure, making it more difficult to maintain distance from their abusive partner. \"He threatened to throw me out if I didn't work from home the rest of the week,\" one contact said, according to the advocate log. \"He demanded I stay in a hotel and said, if I started coughing, he was throwing me out in the street and that I could die alone in a hospital room. I feel like he will lock me out if I leave for work. My husband won't let me leave the house.\" Secretary to the Gov. Cuomo, Melissa DeRosa, told Vogue magazine that the New York task force will endeavor to improve domestic violence services, shelters, support groups and advocacy. \"In every crisis there's an opportunity,\" she said. \"We're learning in real time from this pandemic, and it's exposing the fissures in the system and where we are, where we're headed, and what needs to change around the way we address domestic violence writ large.\" She told the magazine that there was a 30% rise in calls to the New York State Domestic Violence hotline. Domestic-violence advocates worry that confining people with their abusers could exacerbate the frequency and intensity of abuse, as the pandemic's economic fallout further threatens survivors' financial stability. Some people have even advocated for banning alcohol sales to reduce the potential for domestic violence in confinement. \"The CDC is encouraging folks to stay at home; self isolate,\" Allison Randall, the vice president for policy and emerging issues at the National Network to End Domestic Violence, told MarketWatch. \"But home is not a safe place for survivors of domestic violence.\" Indeed, activists in China, where the disease caused by the novel coronavirus was first discovered in December, have told media outlets that reports of domestic-violence cases rose as residents faced lockdowns and quarantines in the epicenter of the outbreak. “ 'Our experience informs us that in homes where domestic violence is occurring and there is a negative financial impact or added stress in the home, we typically see a higher frequency of incidents of abuse and severity of abuse.' ” - Katie Ray-Jones, CEO of the National Domestic Violence Hotline Intimate-partner violence - that is, physical or sexual violence, psychological aggression or stalking by a current or former intimate partner - impacts millions of Americans annually, according to the Centers for Disease Control and Prevention: Around one in four women and one in 10 men over their lifetime have experienced physical violence, contact sexual violence and/or stalking by an intimate partner, and reported an intimate partner-related impact, per a 2015 CDC report.How the pandemic could make domestic violence worse Katie Ray-Jones, the CEO of the National Domestic Violence Hotline, said that her organization didn't necessarily expect to see new domestic-violence cases. But \"our experience informs us that in homes where domestic violence is occurring and there is a negative financial impact or added stress in the home, we typically see a higher frequency of incidents of abuse and severity of abuse,\" she said. \"With COVID-19, there's both the physical isolation together but also increased stress and fear because we are experiencing a pandemic,\" Sonya Passi, the founder and CEO of the organization FreeFrom, which works to establish financial security for domestic-violence survivors, said in an email. \"This is a dangerous mix, which I expect will leave survivors in an incredibly difficult situation - it's not safe to leave the house, and it's not safe to stay in the house.\" Some advocates fear that abusers might wield the coronavirus pandemic as yet another means of control over their victims. Ray-Jones said she believed abusive partners might try to interfere with a person's plans to stay safe during the current public-health emergency, such as by sharing misinformation to create fear or by not allowing them to wash their hands. “ 'If an abuser will take your checkbook from you so that you don't have access to your own finances, if an abuser will take your cellphone and your keys, why wouldn't they prevent you from having access to things that will ensure your healthiness?' ” - Ruth Glenn, president and CEO of the National Coalition Against Domestic Violence \"If an abuser will take your checkbook from you so that you don't have access to your own finances, if an abuser will take your cellphone and your keys, why wouldn't they prevent you from having access to things that will ensure your healthiness?\" said Ruth Glenn, the president and CEO of the National Coalition Against Domestic Violence. \"That's what power and control is about.\" Survivors who already found their movements restricted might find that their abusers have a new opportunity to exercise control, Glenn added. And some people might be unsure of what self-isolation or quarantine means for planning their potential escape, she said - increasing uncertainty about their changing financial situation or access to a shelter, for example. \"When you have COVID-19 as an element of risk to what's already a risky endeavor, it adds that much more strain, that much more thinking, that much more element of risk for a survivor when they're trying to leave - if that is their plan,\" Glenn said. Social-distancing restrictions could make it even harder for domestic-violence survivors, whose abusers may already isolate them from family, friends and coworkers, to get the social support they need, Randall said. Staying at the home of an elderly parent, who might be at especially high risk for a severe case of the virus, may also be out of the question. Meanwhile, widespread school closures spurred by the spread of COVID-19 could negatively impact children who experience or witness abuse at home. \"Often times, schools are the children's refuge away from a violent home,\" Ray-Jones said. Childhood exposure to intimate-partner violence is linked with a range of negative physical, emotional, behavioral and educational outcomes in the short and long term, according to the National Child Traumatic Stress Network.The additional financial toll coronavirus could take The lifetime economic cost of intimate-partner violence to society totals $3.6 trillion, according to the CDC, including the cost of medical services, criminal justice and lost productivity. Intimate-partner violence costs about $103,767 for women and $23,414 for men over a victim's lifetime, the agency estimates. Financial or economic abuse is also quite common among domestic-abuse survivors: One 2008 Michigan State University study of 103 survivors found that \"almost every woman had been involved with a partner who controlled her use of or access to economic resources and/or took advantage of her economically.\" \"Coronavirus is exacerbating a problem that already exists and hasn't been adequately addressed: Survivors of domestic violence cannot afford to leave the abuse,\" Passi said. \"For those that do leave, rebuilding their lives is often so expensive that they just end up having to go back.\" “ 'COVID-19 is going to financially impact almost all of us, but this will be that much more exacerbated for survivors who are already trying to recover from the impact of economic abuse and dealing with the costs of being harmed.' ” - Sonya Passi, founder and CEO of the domestic-violence organization FreeFrom The food and hospitality sector, airlines and other entire industries have cratered under the financial strain imposed by the coronavirus, with some people forecasting a soaring unemployment rate and possible recession. \"COVID-19 is going to financially impact almost all of us, but this will be that much more exacerbated for survivors who are already trying to recover from the impact of economic abuse and dealing with the costs of being harmed,\" Passi said. \"Imagine having six figures in debt after being harmed by someone else, no job or cash because both were taken from you, a damaged credit score because of fraud and coerced debt and then a recession on top of that.\" Study results released by the hotline during the 2009 financial crisis showed that 54% of participants who had called between Nov. 12, 2008 and Dec. 31, 2008 said their household's financial situation had changed in the past year. Some 64% also indicated they believed the abusive behavior had increased over the past year. A 2016 study of intimate-partner violence in the Great Recession, meanwhile, concluded that \"economic upheaval continues to have a disruptive effect on male-female relationships.\" \"In particular, the rapid worsening of local economies in the Great Recession led to an increase in men's controlling behavior toward their wives and romantic partners,\" said the study, which was published in the peer-reviewed journal Demography. Ray-Jones called the present situation \"a survivor's worst nightmare on all fronts.\" \"Now we're preparing for not-the-best economic circumstances, potentially significant financial impact to homes, and being isolated with an abusive person,\" she said.'This is stressful for everyone, but especially survivors' Nonprofits serving vulnerable populations like domestic-violence survivors may be challenged right now, Randall added, by staff that might become sick and a lack of sufficient financial resources. Shelters \"are doing their very best,\" she said, \"but they definitely need support from their communities right now.\" While Ray-Jones said she wasn't expecting any significant lapses in the hotline's services, she added that \"some local programs will absolutely be impacted.\" “ 'We expect survivors to help themselves out of these situations but we all have a responsibility, now more than ever, to support survivors and do our part to address this systemic issue.' ” - Sonya Passi Kavita Mehra, the executive director of the New York-based Sakhi for South Asian Women, said that if her organization were fully operational now, it would have a full team available to support a survivor through experiences with police, family court, doctor visits and benefit-seeking. \"None of those things can happen right now,\" she said. The organization has, however, shifted to offer remote tele-therapy and legal services over the phone, and its food justice and cash-assistance programs remain available. Ray-Jones said survivors might find it harder to have private conversations at home at this time, she said, but the organization will be monitoring contact volume, as well as the possibility of text or chat contacts increasing over calls. \"Because we expect that people are spending more time at home, possibly not leaving the home for work each day, for example, we know survivors are spending more time in closer proximity to their abusers,\" she said. \"This is stressful for everyone, but especially survivors.\"How survivors can get help \"The ability to reach outreach, whether it's the hotline or your local domestic-violence organization, has not changed,\" Glenn said. \"We would encourage survivors to do all that they can to remain safe and know that resources are still available to them.\" Organizations are devising creative ways to deliver services during this time, she said. Ray-Jones echoed the sentiment: \"This is a time to get connected to resources, because there are a lot of programs across the country who are strategizing to continue to provide some level of support in this incredibly stressful time,\" she said. Glenn also advised that survivors make sure that whatever means they have been employing to stay safe are still in place. \"Every survivor is dealing with a different situation, and they've done their own individual assessment about their safety,\" she said. A safety plan - that is, a personalized plan to stay safe - must be even \"more vigorous\" in the current situation, given the need to limit interactions with the outside world, Mehra said. The \"luxury\" of being able to go to multiple locations may no longer exist, she said. So keep important documents handy, know the address of your nearest precinct, have some money on hand (if you have access to money) for calling an Uber UBER, -0.18%, keep a phone on hand, and know which friend or family member's house you can go to if a shelter is unable to accept you, she said. With that said, domestic violence is a \"societal problem,\" not a personal issue, Passi said. \"We expect survivors to help themselves out of these situations but we all have a responsibility, now more than ever, to support survivors and do our part to address this systemic issue,\" she said. Employers must step up and offer cash support to workers who will be saddled with increased expenses due to quarantines, she said; they should provide paid sick leave to all workers, as well as additional leave for domestic-violence survivors so they can relocate, apartment-hunt and meet with an attorney. Banks and financial institutions also need to lend their support to customers experiencing domestic violence, she said. \"We all have someone in our community whom we know or suspect is in an abusive situation,\" Passi said. \"We need to be checking in on folks - asking if they want to talk, asking if they need a couch to crash on, letting them know we are here.\""}]}