{"article": [{"url": "https://www.marketwatch.com/story/why-would-anyone-own-bonds-now-there-are-at-least-five-reasons-2020-08-04", "published": 1596876860.0, "headline": "Why would anyone own bonds now? There are at least five reasons", "body": "Here’s 2020 finance trivia for you: What’s the better performer this year — the red-hot Nasdaq 100 index of tech behemoths or boring, old long-term bonds? The Nasdaq 100 ETF QQQ, +1.52% is up an astonishing 25.5% this year during a pandemic, and that’s including a 29% peak-to-trough drawdown. But the long-term treasury ETF TLT, -0.01% is up 27.3%. Long-term bonds are outperforming tech stocks in one of the weirdest years ever in the market. Stocks get all the love and attention because they’re more exciting and sexier, but bond returns this year are off the charts when you consider how low yields were coming into 2020: These were the starting yields for these funds coming into 2020: And now the current yields following the run-up in performance: According to Deutsche Bank, we’re now looking at the lowest government bond yields in well over 200 years: Many investors have been saying for years that rates can only go up from here, and they’ve done nothing but fall more. And maybe they’ll fall even further and possibly go negative (something I would not rule out if the pandemic worsens). But eventually short-term movements in rates will wash out and the long-term returns will be based more on the current bond yields. When you consider how paltry those yields are, investors in fixed-income are guaranteed to see minuscule returns from here over the long haul. So why would you even own bonds with rates this low? It’s a fair question a number of investors are asking themselves as we stare at generationally low yields in safe assets. Some thoughts: Bonds hedge stock-market volatility: Here are the returns for the Vanguard total stock and bond funds from the time the stock market peaked in late-February until the time it bottomed in late-March: Even though they were down slightly, bonds did their job as the anchor in a portfolio. Not only do bonds hedge against stock market downturns, but they also provide an emotional hedge to any diversified portfolio. Some investors simply cannot accept the volatility you experience with all of their portfolio in the stock market. Bonds can bring your overall portfolio volatility down by using asset allocation as a lever to de-risk. The trade-off here is you lower your long-term expected returns to accept less short-term risk. Bonds can be used to rebalance: When the stock market sells off, that’s the time you want to dive in and buy with both hands. The only problem is you need capital to buy. That could come from new savings out of your paycheck or a cash hoard or the bond portion of your portfolio. Diversification doesn’t work if you don’t have a target asset allocation, and a target asset allocation doesn’t work if you don’t occasionally rebalance back to your target weights. Rebalancing is a systematic way to buy low and sell high. One of the simplest ways to buy when there is blood in the streets is to sell some bonds and buy some stocks when the market falls. Bonds can be used for spending purposes: Cash was king in the midst of the stock market crash for a number of reasons. People were losing their jobs. Businesses were locking up or going under. If you needed to tap your portfolio as a lifeline, it would have been tough to stomach if you had to sell your stocks while they were down more than 30%. Bonds provide stability for those who need to use their portfolio for living expenses or large purchases. Bonds protect against deflation: The biggest risk to bonds over the long term is inflation. That’s always a risk. But bonds also help protect you against deflation. When there’s inflation, your bond income is worth less over time, but in a deflationary environment, they’re actually worth more. This is one of the reasons bonds tend to do so well during a recession. There are other options, but there aren’t many: You could create a similar hedge using money market funds, certificates of deposits (CDs) or online savings accounts. Those places don’t yield much either, but they also don’t have nearly as much interest rate risk. Then again you wouldn’t benefit as much as you would if bond yields were to contract further, but that’s the price you pay for safety. (It’s hard to believe rates could continue to fall, but they’re negative in a number of developed markets around the globe.) Anything beyond these safe investment vehicles and you’re introducing additional risks to your portfolio. More risk isn’t necessarily always bad, but it is something you have to think about when venturing outside your comfort zone. Dividend-paying stocks or corporate bonds or high-yield or alternative investments could offer you more yield right now, but those investments have many different characteristics than high-quality bonds. There are no easy answers in the low-rate world we’re living in. You can either earn less income to better protect your capital or earn more income to accept more risk in your portfolio. Ben Carlson is the author of the blog “A Wealth of Common Sense,” where this was first published. It is reprinted with permission. Follow him on Twitter @awealthofcs."}]}