{"article": [{"url": "https://www.marketwatch.com/story/pompeo-says-us-should-limit-which-human-rights-it-defends-2020-07-16", "published": 1594927760.0, "headline": "Pompeo says U.S. should limit which human rights it defends", "body": "WASHINGTON — Secretary of State Mike Pompeo argued Thursday for a more limited U.S. view of global human rights advocacy based on the principals laid out by America’s Founding Fathers, a suggestion critics assumed meant stepping away from more modern concepts such as support for women and the LGBQT communities around the world. Pompeo, speaking in Philadelphia, singled out property rights and religious freedom as “foremost” principals in a speech that elsewhere complained about the “proliferation” of protections in international agreements related to human rights. “We are forced to grapple with tough choices about which rights to promote and how to think about this,” he said. “Americans have not only unalienable rights, but also positive rights granted by governments, courts and multilateral bodies. Many are worth defending in light of our founding; others aren’t.” Pompeo on Thursday released a report produced by the Commission on Unalienable Rights, which he tasked last year with conducting a broad review of U.S. human rights policy, arguing at the time that it had “lost its bearings.” Before its release, many human rights groups were skeptical of the commission, whose chairwoman was conservative legal scholar Mary Ann Glendon, a former U.S. ambassador to the Holy See. Pompeo noted that the report emphasizes property rights and religious liberty. “No one can enjoy the pursuit of happiness if you cannot own the fruits of your own labor. And no society can retain its legitimacy or a virtuous character without religious freedom,” he said. The report did not produce any specific recommendations and steered clear of endorsing policy proposals. But experts who parsed it for direction noted, for example, that it referred to abortion and same-sex marriage not as rights but “divisive social and political controversies.” Critics such as Sen. Bob Menendez, the ranking member of the Senate Foreign Relations Committee, said the report would damage the United States’ reputation as a champion of human rights around the world by narrowing the scope of who deserves protection. “As feared, Secretary Pompeo used his speech to insinuate a hierarchy of rights where property rights and religious liberty are ‘foremost’ rights and some rights are not ‘worth defending,’’’ said the New Jersey Democrat. Critics also faulted the makeup of the commission, saying it was weighted with conservatives, and the public did not have sufficient opportunity to weigh in on its findings before the report’s release. “As was clear from the start, Secretary Pompeo’s Commission on Unalienable Rights was designed to challenge the international consensus with a narrow view of human rights, that among other things would leave LGBTQ people even more vulnerable to violence and discrimination,” said David Stacy, government affairs director of Human Rights Campaign. Pompeo also took aim in his speech at demonstrators “pulling down statues” and “desecrating monuments,” in echoes of President Donald Trump’s recent speech at Mount Rushmore. The secretary of state said it was an attack on the people who fought for the rights laid out in the Declaration of Independence. He also criticized The New York Times for its 1619 Project, an award-winning explanation of the persistent legacy of slavery in the United States. “America is fundamentally good and has much to offer the world because our founders recognized the existence of God-given unalienable rights and designed a durable system to protect them,” he said. “But these days I must say even saying America is fundamentally good has become controversial.”"}]}