{"article": [{"url": "https://www.marketwatch.com/story/tesla-stock-rally-accelerates-further-into-record-territory-after-split-takes-effect-2020-08-31", "published": 1598950340.0, "headline": "Tesla stock rally accelerates further into record territory after split takes effect", "body": "Shares of Tesla Inc. shot up into split-adjusted record territory Monday, and briefly topped the $500 mark intraday, as the lower price did not change the trajectory of the parabolic uptrend. The stock TSLA, +1.89% charged 12.6% higher to $498.32 in active trading, surpassing the previous record closing price of $447.75 — $2,238.75 pre-split — on Aug. 27. Earlier in the session, the stock was up as much as 13.0% at its intraday peak of $500.14, which topped the previous all-time intraday high of $463.70 — $2,318.50 pre-split — reached on Friday. Trading volume swelled to 115.1 million shares, compared with the full-day average calculated by FactSet of 73.4 million shares. After closing at $2,213.40 on Friday, Tesla’s 5-for-1 stock split went into effect at Monday’s open. The opening price post split was $444.61, or 0.4% above Friday’s split-adjusted closing price of $442.68. For Tesla shareholders, the only change is that the number of stocks owned multiplies by five, but the price of the shares owned is divided by five. Don’t miss: Five things you should know about Tesla ahead of its 5-for-1 stock split. Analyst Dan Ives at Wedbush said as a result of the stock split, he was adjusting his stock price target to $380, which is about 31% below current prices, from $1,900, while maintaining his neutral rating. “We believe the stock split decision was a smart move by Tesla and its board, given the parabolic move in shares over the past six months, with another stock split by Apple and likely other larger tech stalwarts will follow this same path over the coming months, in our opinion,” Ives wrote in a note to clients. Also read: Now that Apple and Tesla’s stock has split, here’s what retail investors should know before they jump in. FactSet, MarketWatch He said the next major catalyst for Tesla’s stock is the ”battery day” scheduled for Sept. 22, followed by third-quarter deliveries data. Read more about recent bullish analyst calls referencing the battery day. Meanwhile, there are signs suggesting some investors are starting to worry that the stock split highlights how the stock rally, which has sent it rocketing more than fivefold this year, may have gone a bit too far. Stock and options trading platform iVest+ said recent data indicates that the number of investors hedging the downside, or even betting on a decline, increased “significantly” ahead of the stock split taking effect. “Our data show that while investors were heavily bullish on [Tesla’s stock] all quarter, as the stock jumped several hundred points leading up to the ex-dividend date, we started to see a change,” said iVest+ Chief Executive Rance Masheck. “A significant percentage of traders either shifted to looking to make money on the downside of the stock moving forward or continued to place bullish bets, but using more complicated strategies that limit downside even more than just buying your typical calls and puts.” From July 1 through Aug. 10, 79.2% of options trades in Tesla’s stock were bullish, iVest+ said, with 72.1% of those trades being the simplest call purchases. An option call gives the buyer the right to purchase shares at a specific price, usually above the levels seen when the options are priced, at a specific date in the future. From Aug. 11 to Aug. 21, the percentage of bullish option bets that were basic calls fell to 59.8%. “This is a significant shift in trader mentality about the future of the stock following the stock split,” iVest+ said. Tesla announced its plan to split its stock after the Aug. 11 close. Since then, the stock has run up 81.3%. Over the same time, the S&P 500 index SPX, +0.87% has gained 5.0%."}]}