{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-fall-to-one-month-low-as-us-dollar-bounces-2020-09-03", "published": 1599147080.0, "headline": "Oil prices fall, with Brent at lowest finish since July on prospects for weak demand", "body": "Oil futures declined on Thursday, with prices for the global Brent crude benchmark marking their lowest settlement since July as concerns remained over the outlook for demand. Oil prices saw even steeper losses early Thursday as the U.S. stock market sold off sharply on the heels of a tech selloff. The “energy space has stabilized,” however, partially thanks to the fact that the day’s equity market volatility was “not a function of a materially negative headline regarding the global economy, the coronavirus, or stimulus but rather overextended valuations,” Tyler Richey, co-editor at Sevens Report Research, told MarketWatch. West Texas Intermediate crude for October delivery CL.1, -1.62% US:CLV20 on the New York Mercantile Exchange edged down by 14 cents, or 0.3%, to settle at $41.37 a barrel, paring losses after trading as low as $40.22. The U.S. benchmark was down a second straight session, holding ground at the lowest finish since Aug. 7, according to Dow Jones Market Data. November Brent UK:BRNX20 BRN.1, -0.07%, the global benchmark, declined 36 cents, or 0.8%, to $44.07 a barrel on ICE Futures Europe. That marked the lowest front-month contract settlement since July 31. On Wednesday, the Energy Information Administration on reported a hefty, 9.4 million-barrel weekly drop in U.S. crude supplies, along with a fall of 4.3 million barrels in gasoline inventories, but that failed to provide a lift to oil prices as demand remained weak. The data “showed a hit to demand, and the reduction in inventories is being attributed to a Hurricane Laura once-off drop,” said Phil Flynn, senior market analyst at The Price Futures Group, in a daily report. Over the past four weeks, the amount of gasoline product supplied, a proxy for demand, was down 8.9% for the same period last year. For distillate fuels, which include heating oil, it was down 5.1%, and for jet fuel product, it was down 47.1%, the EIA reported. Meanwhile, oil production in the Gulf of Mexico region has seen a significant recovery since the hurricane made landfall on Aug. 27. The Bureau of Safety and Environmental Enforcement on Thursday estimated that 16.3% of current oil production in the Gulf of Mexico was shut in, rebounding from about 84% around the time Laura reached the Gulf Coast. Traders looked to the latest U.S. economic data for hints on the outlook for energy demand. On Thursday that data were mixed, with a decline in weekly jobless claims and a jump in the trade deficit in July. A closely followed index of non-manufacturing companies — retailers, banks, airlines, health-care providers and the like — fell in August. “Economic data has been mixed this week but on balance, it could be described as ‘Goldilocks’,” or not too hot and not too cold, which is “a good thing for most risk assets as it keeps pressure on Congress to pass another stimulus package sooner than later,” said Richey. “If data was any worse, we could see sentiment towards the recovery deteriorate and traders de-risk,” he said. “Conversely, if recent economic data was much better, odds of another coronavirus relief bill being passed in the near term would fall and that would also trigger a move out of risk assets.” A rebound by the U.S. dollar has also limited the upside for commodities. Oil had previously found support as the ICE U.S. Dollar Index DXY, -0.58%, a measure of the U.S. currency against a basket of six major rivals, fell to a more-than-two-year low earlier in the week, but it now trades around 0.4% higher for the week so far. A stronger dollar can pressure commodity prices, making them more expensive to users of other currencies. On Nymex, October gasoline US:RBV20 added 0.2% to $1.2049 a gallon, while October heating oil US:HOV20 declined nearly 1.8% to $1.1677 a gallon. October natural gas US:NGV20 ticked 0.04% higher to $2.487 per million British thermal units. Read:Natural-gas futures gain nearly 50% in August, but rally may be ‘short-lived’ The U.S. Energy Information Administration reported Thursday that domestic supplies of natural gas rose by 35 billion cubic feet for the week ended Aug. 28. That was generally in line with the increase of 34 billion cubic feet forecast by analysts polled by S&P Global Platts."}]}