{"article": [{"url": "https://www.marketwatch.com/story/house-democrats-to-probe-whether-officials-meddled-with-cdc-coronavirus-data-2020-09-14", "published": 1600174940.0, "headline": "House Democrats to probe whether officials meddled with CDC coronavirus data", "body": "WASHINGTON — A House subcommittee examining President Donald Trump’s response to the coronavirus pandemic is launching an investigation into reports that political appointees have meddled with routine government scientific data to better align with Trump’s public statements. “ Health and Human Services communications aide Michael Caputo and scientific adviser Paul Alexander reportedly complained about a CDC report that explained children can transmit the coronavirus and Alexander asked the CDC to alter it or pull it down, saying the report could impact school reopening and hurt Trump politically ” The Democrat-led subcommittee said Monday that it is requesting transcribed interviews with seven officials from the Centers for Disease Control and Prevention and the Department of Health and Human Services, including communications aide Michael Caputo. Caputo has often publicly pushed back on CDC statements about the coronavirus and said falsely in a Facebook video on Sunday that the CDC has a “resistance unit” to undermine Trump, according to the New York Times. His page has since been made private. According to a report in Politico, Caputo, along with scientific adviser Paul Alexander, pressured officials to alter the CDC’s Morbidity and Mortality Weekly Reports, a long-running weekly journal that features the latest science-based research and data on infectious diseases. Known as MMWR, the report has long been a sacred government information resource for doctors, scientists and researchers tracking outbreaks. The officials pressured CDC to change the reports, at times retroactively, to better align them with Trump’s often rosier public statements about the coronavirus, Politico reported. Also see:Trump Administration threatens to start fining hospitals that fail to report daily coronavirus data to HHS In a letter to Health and Human Services Secretary Alex Azar and CDC Director Robert Redfield, the Democratic members of the subcommittee said they are “gravely concerned” about the reports of political meddling in a journal that has long been free of political interference. “With nearly 200,000 Americans killed and hundreds more dying each day from the coronavirus pandemic, the public needs and deserves truthful scientific information so they can keep themselves and their families healthy,” the Democrats wrote. The panel is also demanding documents from the department, including communications sent or received by Redfield, Azar, Caputo and Alexander regarding the MMWR and other matters. HHS did not immediately respond to a request for comment on the letter. On the other side of the Capitol, Sen. Patty Murray, a Democrat from Washington state, called for Azar to fire Caputo immediately, while Minority Leader Chuck Schumer called on Azar himself to step down, citing the Trump administration’s chaotic response to the public health emergency. iframe.twitter-tweet { width: 100% !important; } According to Politico, Caputo and Alexander complained about a report that explained children can transmit the coronavirus and Alexander asked the CDC to alter it or pull it down, saying the report could impact school reopening and hurt Trump politically. In the Facebook Live video, reported by The New York Times, Caputo warned that left-wing hit squads would engage in armed insurrection after the election and said officials were engaging in “sedition” as they handled the pandemic. “You understand that they’re going to have to kill me, and unfortunately, I think that’s where this is going,” Caputo said, according to the Times. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Caputo is a longtime confidant and fierce defender of Trump who worked on his presidential campaign. MarketWatch contributed."}]}