{"article": [{"url": "https://www.marketwatch.com/story/adobe-stock-trades-at-record-as-coronavirus-work-from-home-trend-boosts-subscriptions-2020-06-12", "published": 1592043620.0, "headline": "Adobe stock closes just shy of record as coronavirus work-from-home trend boosts subscriptions", "body": "Adobe Inc. shares traded at their highest price ever during the regular session Friday and closed just short of a record as most analysts raised their target on the stock with the software company navigating the COVID-19 pandemic by taking advantage of the work-from-home trend. Adobe ADBE, +2.30% shares closed up 4.9% at $406.54, just short of its record high closing price of $406.82 set on Wednesday, after rising as much as 6% to an all-time high of $411.72. The company released earnings late Thursday, reporting record annual recurring revenue (ARR), a software-as-a-service metric that shows how much revenue the company can expect based on subscriptions for digital media of $9.17 billion. Of the 28 analysts who cover Adobe, 19 have buy or overweight ratings, eight have hold ratings, and one has an underweight rating. Of those, 15 analysts hiked their price target, resulting in an average price target of $414.44, up from a previous average of $365.65, according to FactSet data. JPMorgan analyst Sterling Auty, who has an overweight rating and raised his price target to $430 from $325, said that investors were willing to overlook revenue that came in light for the quarter as they were “prepared for worse.” What really mattered, Auty said, were the ARR numbers. “The beat in ARR and durability of Creative Cloud is likely to be well received by investors, as will the impressive margins and upside in EPS,” Auty noted. That Adobe pulled its guidance for the year did not matter much as many of companies he covers have done the same given the uncertainty created by COVID-19, he said. J. Derrick Wood, who has a market perform rating and raised his price target to $400 from $365, characterized the quarter as “mixed.” While he was impressed with ARR and the work-from-home benefits, the company’s third-quarter outlook suggests “there are still macro pressures at hand.” Adobe forecast third-quarter adjusted earnings of about $2.40 a share on revenue of about $3.15 billion, when analysts had been forecasting earnings of $2.46 a share on revenue of $3.26 billion. By Friday, the Wall Street consensus was $2.41 a share for earnings and $3.16 billion for revenue, according to FactSet data. Jefferies analyst Brent Thill, who has a buy rating and raised his price target to $470 from $450, likened Adobe’s management to “highly experienced pilots, flying deftly around pockets of turbulence.” As millions work from home and shelter in place as result of the coronavirus pandemic, Adobe software “is proving critical for online content, paperless workflows, and digital customer experiences (incl. e-commerce),” Thill said, adding that he’s confident about Adobe’s “market leadership and superior fundamentals.” Wedbush analyst Daniel Ives, who has a neutral rating and raised his price target to $410 from $315, said Adobe delivered “an ARR Masterpiece.” “As we have seen from other tech stalwarts during earnings season, Adobe continued the trend as the strong get stronger with the company’s Creative and Digital product footprint seeing no signs of slowing down,” Ives said. “The subscription and sticky element of the company’s product portfolio on both the consumer and enterprise front are key strengths enabling Adobe to show the Street that its business model can withstand this unprecedented backdrop without skipping a beat,” Ives said Adobe shares are up 23% for the year, contrasting with a 6% decline in the S&P 500 index SPX, +0.87% and compared with a 7% rise in the tech-heavy Nasdaq Composite Index COMP, +1.39% and a nearly 14% increase in the iShares Expanded Tech-Software Sector ETF IGV, +1.85%."}]}