{"article": [{"url": "https://www.marketwatch.com/story/palantir-takes-swings-at-silicon-valley-on-its-way-to-wall-street-2020-08-25", "published": 1598425640.0, "headline": "Palantir takes swings at Silicon Valley on its way to Wall Street", "body": "Palantir Technologies Inc., a software company founded in Silicon Valley to help governments and companies collect and parse data, used its Tuesday filing for a direct listing to confirm a move away from the California technology hub and declare that “we seem to share fewer and fewer of the technology sector’s values and commitments.” The controversial and secretive software company, co-founded by Facebook Inc. FB, +0.26% board member and Donald Trump supporter Peter Thiel, made its filing with the U.S. Securities and Exchange Commission public Tuesday. The document begins with a letter from Chief Executive Alexander Karp that defends Palantir’s work with governments and militaries around the world and declares its differences with Silicon Valley, which the company has left for Denver. “Our company was founded in Silicon Valley,” Karp wrote. “But we seem to share fewer and fewer of the technology sector’s values and commitments.” Read:Palantir plans to go public as it moves away from reliance on government work CEO letters are rather common in filings for initial public offerings and direct listings, but Palantir took the approach one step further by making Karp’s letter the first section of its filing. Karp’s letter called out advertising-based business models such as Facebook and Alphabet Inc.’s GOOGL, +1.82% GOOG, +1.97% Google for their data practices while defending Palantir’s use of data for surveillance and other purposes. “From the start, we have repeatedly turned down opportunities to sell, collect, or mine data. Other technology companies, including some of the largest in the world, have built their entire businesses on doing just that,” Karp wrote. “Software projects with our nation’s defense and intelligence agencies, whose missions are to keep us safe, have become controversial, while companies built on advertising dollars are commonplace. For many consumer internet companies, our thoughts and inclinations, behaviors and browsing habits, are the product for sale. The slogans and marketing of many of the Valley’s largest technology firms attempt to obscure this simple fact.” Palantir has faced acrimony and anger far beyond Silicon Valley for its secretive work with powerful entities. The company has contracts with the Department of Homeland Security and U.S. Immigration and Customs Enforcement, including for software used to track migrants at the border. Because of that, it has been targeted by protesters and activists including Mijente, an immigration advocacy group. “This is not just a question of one pocket of the country, the protests are happening nationwide,” said Jacinta Gonzalez, senior campaign director at Mijente, adding that advocacy groups in Colorado had already contacted her about Palantir. “Palantir is complicit in the surveillance, arrest and deportation of our communities through their work with ICE,” Gonzalez said. “Their S-1 recognizes that these are risky contracts to take on. We’re calling on investors everywhere not to invest when the IPO happens.” See also: The CEO who made one of Silicon Valley’s worst acquisitions wants a $400 million blank check Employees at large tech companies including Google, Amazon.com Inc. AMZN, +3.01% , Microsoft Corp. MSFT, +2.48% and Salesforce.com Inc. CRM, +2.21% have protested some of their companies’ contracts with the federal government, including ICE. But Karp said that Palantir employees “embrace the complexity” of federal work that includes surveilling enemies and developing war plans. “The construction of software platforms that enable more effective surveillance by the state of its adversaries or that assist soldiers in executing attacks raises countless issues, involving the points of tension and tradeoffs between our collective security and individual privacy, the power of machines, and the types of lives we both want to and should lead,” Karp wrote. “The ethical challenges that arise are constant and unrelenting. We embrace the complexity that comes from working in areas where the stakes are often very high and the choices may be imperfect.” Chris Hoofnagle, the faculty director for UC Berkeley’s Center for Law & Technology and who sits on the Palantir Council on Privacy and Civil Liberties, said Tuesday that he is “perplexed” by tech companies’ resistance to work with the federal government, which contributed to the rise of Silicon Valley before the boom in venture-capital investors. He chalked it up to “reaction formation or some other juvenile confusion.” “Silicon Valley wouldn’t even exist without the Department of Defense,” Hoofnagle said. “Most of the technologies developed here are dual-use and cannot be created without contributing to military strength.” Irina Raicu, the director of internet ethics at Santa Clara University’s Markkula Center for Applied Ethics, told MarketWatch on Tuesday that Karp’s letter “includes some very old (and repeatedly debunked) Silicon Valley tropes,” and pushed back against three specific points the CEO made. “For example, that ‘[t]he bargain between the public and the technology sector has for the most part been consensual, in that the value of the products and services available seemed to outweigh the invasions of privacy that enabled their rise,’” Raicu wrote in an email, quoting Karp’s letter. “It has become very clear, over the past several years, that the public had no understanding of the privacy-invasive practices behind many of the services it was offered; had assumed that laws were in place to prevent such practices; and has been pushing for new laws to prevent them.” Read: Facebook and Twitter are worried about the day after Election Day In response to Karp’s claim that Americans will not “remain tolerant of the idiosyncrasies and excesses of the Valley,” Raicu said that Americans have not been tolerant of the Valley’s actions for years, adding “Surely Palantir has crunched enough data to be aware of that.” As to Karp’s statement that Palantir has “chosen sides” between Silicon Valley and the government, Raicu said Palantir’s “clients in law enforcement and intelligence agencies do not represent a different ‘side’ from the American public.”"}]}