{"article": [{"url": "https://www.marketwatch.com/story/facebook-hardens-digital-defense-for-misinformation-ahead-of-elections-2020-08-13", "published": 1597326620.0, "headline": "Facebook hardens digital defense for misinformation ahead of elections", "body": "U.S. users of Facebook Inc. who post about voting may soon start seeing fact-checking notes added to their messages about the presidential election on Nov. 3. The addendum will link to a new voter information hub similar to one about COVID-19 that Facebook says has been seen by billions of people globally. The labels will read, “Visit the Voting Information Center for election resources and official updates.” Facebook expects the voter hub to reach at least 160 million people in the U.S. It’s Facebook’s FB, +0.26% latest stab to combat election-related misinformation, building off a move in July when the company began adding similar links to posts about balloting by federal politicians, including President Donald Trump. “Facebook must do more to combat the weaponization of voting and election disinformation and misinformation on its platform. Our democracy depends on it,” Vanita Gupta, chief executive of The Leadership Conference on Civil and Human Rights, said in a statement that called the Voting Information Center a “welcome step.” Facebook is making a concerted effort to address widespread criticism about how it handles misinformation around elections, among other topics. Fueling the antagonism has been the company’s hesitancy to fact-check ads by politicians, leading to a two-year audit of its civil rights practices that faulted Facebook for leaving U.S. elections “exposed to interference by the President and others who seek to use misinformation to sow confusion and suppress voting.” Some of tech’s largest companies, already under heat for their role in spreading misinformation during the 2016 presidential election, are taking steps to avoid blame for a similar fate later this year. On Thursday, Google parent Alphabet Inc. GOOGL, +1.82% GOOG, +1.97% announced new Google Search features that direct voters to verified information when they search for “how to vote” or “how to register.” Additionally, a new information panel on candidates will pop up when people search for federal or presidential candidates on YouTube. Twitter Inc. TWTR, -0.23% has said it would roll out tools, policies and partnerships to help users register and prepare to vote by mail, and find local early-voting options. In January, the company created a feature that lets users report voter suppression and misinformation. Snap Inc. SNAP, -0.18% , meanwhile, unveiled the “Voter Registration Mini” tool so users can register to vote directly in Snapchat. It also posted a “Voter Guide” with information about topics such as voting by mail and voter registration."}]}