{"article": [{"url": "https://www.marketwatch.com/story/u-k-s-johnson-to-order-pubs-to-close-at-10-p-m-in-attempt-curb-climbing-virus-cases-01600760269", "published": 1600746320.0, "headline": "U.K.'s Johnson to order pubs to close at 10 p.m. in attempt curb climbing virus cases", "body": "Prime Minister Boris Johnson arrives for a service to mark the 80th anniversary of the Battle of Britain at Westminster Abbey on September 20, 2020 in London, United Kingdom. WPA Pool/Getty Images LONDON (AP) - British pubs will have to close early and people who fail to obey quarantine rules will face stiff fines under new lockdown restrictions to curb a surging wave of new coronavirus infections. British Prime Minister Boris Johnson is to announce the new measures Tuesday, a day after the U.K.'s chief medical officers raised the nation's COVID-19 alert level, saying the virus is in general circulation and spreading fast. Other top medical experts said Britain's number of daily new infections - which stood Monday at 4,300 - could rise as high as 50,000 a day in October if immediate action is not taken. The prime minister's office said starting Thursday, pubs, bars and other hospitality venues will be restricted to table service only and will have to close at 10 p.m. Johnson is due to update Parliament on the coronavirus situation Tuesday after meetings of his Cabinet and the government's crisis committee, COBRA. He will also make a televised address to the nation about efforts to combat the virus. The U.K. has gradually been increasing restrictions as cases rise, with people barred from meeting in large groups. But the measures are far less stringent than a nationwide lockdown imposed in March that saw restrictions on movement and most businesses closed. It was eased starting in June as cases began to fall, but that trend has now been reversed. On Monday, the chief medical officers of England, Scotland, Wales and Northern Ireland raised the virus alert from three to four, the second-highest level, on the advice of the Joint Biosecurity Center. They said cases of COVID-19 were rising \"rapidly and probably exponentially.\" In a live televised briefing, Chief Scientific Officer Patrick Vallance and Chief Medical Officer Chris Whitty said after a slow rise in new infections over the summer, the number of new COVID-19 cases is now doubling every seven days. They said new infections could increase tenfold to almost 50,000 a day next month if nothing is done now. In other countries, such an increase has soon led to a rise in deaths, Whitty said, adding \"we have, in a very bad sense, literally turned a corner\" after weeks of rising infections. Whitty stressed that infection rates are rising among all age groups and infections among the young and healthy will inevitably spread to friends, family and ultimately to the most vulnerable in society. \"This is not someone else's problem,\" he said. \"This is all of our problem.'' To persuade people to stay home if they test positive, the government announced it would pay low-income workers 500 pounds ($639) if they are told to self-isolate for 14 days. It also said those breaking quarantines could face fines up to 10,000 pounds ($12,800). Britain has Europe's highest death toll in the pandemic, with over 41,800 deaths, according to a tally by Johns Hopkins University. Experts say all such figures understate the true impact of the pandemic. The 4,300 new infections reported Monday hit a level not seen since early May. Britain's highest daily number of new infections peaked at 6,199 cases on April 5. While death rates remain relatively low so far, Whitty warned that deaths are likely to rise. The U.K. reported a seven-day average of 21 deaths a day last week, compared with a peak of 942 deaths on April 10. These numbers include only deaths that are directly related to COVID-19. The real toll could be much higher if emergency services are overwhelmed by coronavirus cases and the National Health Service has to divert resources from treating other diseases, Whitty said. But Whitty said new restrictions have to be balanced against the impact on the economy and society, because increased deprivation and mental illness will also lead to deaths. \"If we do too little, this virus will go out of control and you will get significant numbers of increased direct and indirect deaths,'' he said \"But if we go too far the other way, then we can cause damage to the economy, which can feed through to unemployment, to poverty, to deprivation.\" Vallance said efforts to find a vaccine are continuing and while it is still not clear they will work, the research is pointing in the right direction. He said some vaccine could be available by the end of the year \"in small amounts for certain groups.\" Lockdown fears hit stocks on Monday as shares in companies in aviation, hospitality and travel took a beating. Shares in IAG, the parent company of British Airways, fell 11.3%, while pub company Mitchells & Butlers fell 11% and Intercontinental Hotels Group fell 4%. Dr Michael Head, a global health expert at the University of Southampton, noted that Monday's warning highlighted the worst possible situation and did not take into account local lockdowns that could stem the spread of the virus. \"It is important to note that the chief medical (officer) did say the potential for 50,000 cases a day is a 'worst-case scenario',\" he said, but added \"it's a timely reminder that the pandemic is accelerating, both globally and also here in the U.K.\" The rise in U.K. infection rates comes as lawmakers across the political spectrum have criticized the Conservative government's testing program. While ministers tout the record numbers of tests being performed, there are widespread reports of people having to travel hundreds of miles for tests or tests being voided because it's taking labs too long to process them. An app meant to bolster virus contact tracing efforts is to be released this week after months of delay."}]}