{"article": [{"url": "https://www.marketwatch.com/story/i-wasnt-feeling-so-well-i-feel-much-better-now-full-transcript-of-trumps-video-address-from-walter-reed-2020-10-04", "published": 1601831120.0, "headline": "'I wasn't feeling so well. I feel much better now': Full transcript of Trump's video address from Walter Reed", "body": "President Donald Trump released a video statement from Walter Reed medical center late Saturday, telling the public that he was now feeling much better. \"I came here, I wasn't feeling so well, I feel much better now. We're working hard to get me back. I have to get all the way back because we still have to make America great again,\" he said on the video released via Twitter TWTR, -0.23%. Trump, 74, was moved from the White House to Walter Reed medical center late Friday, the same day that he and first lady Melania Trump had tested positive for coronavirus. His medical regimen highlighted how the president is in a high-risk group for more serious illness from COVID-19, the disease caused by SARS-CoV-2, observers say. He was given a dose of Regeneron Pharmaceuticals Inc.'s REGN, +0.36%  experimental neutralizing antibody cocktail, in addition to Gilead Sciences Inc.'s GILD, +0.82%  remdesivir. The president also received supplemental oxygen at least once, and dexamethasone, Dr. Sean Conley, Trump's physician, said Sunday. Six months into the pandemic, there are precious few treatments available for patients with COVID-19, and if a vaccine becomes available, it's unlikely to be readily ready until 2021. During a news conference on Sunday, Conley confirmed for the first time that the president had received oxygen support, at least once. There have been conflicting reports about the president's health. White House chief of staff Mark Meadows told reporters outside Walter Reed, \"We're still not on a clear path yet to a full recovery,\" and said the president went through a \"very concerning\" period on Friday evening prior to his removal to Walter Reed. On Saturday, the Navy Commander Dr. Sean Conley, the president's doctor, said, \"At this time, the team and I are extremely happy with the progress the president has made.\" Also Saturday, Dr. Sean Dooley, another doctor at Walter Reed, said Trump was no longer on oxygen, and said his cardiac function, liver function and kidney function were all normal. \"He's in exceptionally good spirits.\" Dooley said the president told him, \"I feel like I could walk out of here today.\" Here's the president's address: iframe.twitter-tweet { width: 100% !important; } The number of confirmed U.S. coronavirus infections also include first lady Melania, and at least nine others in their circle, including close aide Hope Hicks, with more people expected to test positive from a White House Rose Garden event last weekend announcing the nomination of Amy Coney Barrett as a Supreme Court Justice. That ceremony was attended by more than 200 people with people sitting outside less than six feet apart, and many without masks. \"The positive diagnosis puts the President and many of the nation's leaders at risk,\" said Dr. Ashish Jha, dean of the Brown University School of Public Health, in a statement. \" Already, additional White House staffers and visitors to the White House, have tested positive. What action is taken now and over the next week will determine whether more cases can be avoided or if this will lead to a broader outbreak.\" Dr. Sean Conley, physician to President Donald Trump, briefs reporters at Walter Reed National Military Medical Center in Bethesda, Md., Oct. 3. Trump was admitted to the hospital after contracting the coronavirus. (Photo: Susan Walsh/AP.) Here is a full transcript of the president's address from Walter Reed: \"I want to begin by thanking all of the incredible medical professionals, the doctors, the nurses, everybody at Walter Reed Medical Center - I think it's the finest in the world - for the incredible job they've been doing. I came here. I wasn't feeling so well. I feel much better now. We're working hard to get me back. I have to get all the way back because we still have to make America great again. “ 'We're working hard to get me back. I have to get all the way back because we still have to make America great again.' ” We've done an awfully good job of that but we still have steps to go and I have to finish that job. I'll be back, I think, I'll be back soon and I look forward to finishing up the campaign the way it was started, the way we've been doing and the kind of numbers we've been doing. We've been so proud of it. But this was something that's happened and it was something that happened to millions of people all over the world and I've been fighting for them, not just in the U.S., I'm fighting for them all over the world. We're going to beat the coronavirus, or whatever you want to call it, and we're going to beat it soundly. So many things are happening, if you look at the therapeutics, which I'm taking right now some of them, and others that are coming out soon that are looking like, frankly they're miracles, if you want to know the truth. They're miracles. Related: Here's how Trump's positive coronavirus test has shaken up the campaign - plus what could happen next People criticize me when I say that but we have things happening that look like they're miracles coming down from God, so I just want to tell you that I'm starting to feel good. You don't know the next period of a few days. I guess that's the real test so we'll be seeing what happened over those next couple of days. I just want to be thankful for all the support I've seen whether it's on television, or reading about it. I most of all I appreciate what's been said by the American people, almost by a bipartisan consensus, by the American people. It's a beautiful thing to see, and I very much appreciate it, and I won't forget it. I promise you that.\"'I just didn't want to stay in the White House' \"I also want to thank the leaders of the world for their condolences, and they know what we're going through. They know as your leader what I have to go through. But I had no choice because I just didn't want to stay in the White House. I was given that alternative: Stay in the White House, lock yourself in, don't ever leave, don't even go to the Oval Office, just stay upstairs and enjoy it. Don't see people, don't talk to people, and just be done with it, and I can't do that. “ 'I can't be locked up in a room upstairs, totally safe and just say 'Hey, whatever happens, happens'. I can't do that. We have to confront problems.' ” I had to be out front and this is America, this is the United States. The greatest country in the world. This is the most powerful country in the world. I can't be locked up in a room upstairs, totally safe and just say 'Hey, whatever happens, happens'. I can't do that. We have to confront problems. As a leader, you have to confront problems. There's never been a great leader that would have done that. So that's where it is. I'm doing well. I want to thank everybody. Our first lady is doing very well. Melania asked me to say something as to the respect that she has for our country, the love that she has for our country, and we're both doing well. Melania is really handling it very nicely. As you've probably read, she is slightly younger than me, just a little tiny bit. And therefore, we know the disease, we know the situation with age versus younger people and Melania is handling it statistically like it's supposed to be handled, and that makes me very happy and it makes the country very happy. But I'm also doing well, and I think we're going to have a very good result. Again, over the next few days we're going to probably know for sure, so I just want to thank everybody out there, everybody, all over the world, specifically the United States. The outpouring of love has been incredible. I will never forget. Thank you very much.\"COVID-19 has now killed over 1 million people worldwide The Dow Jones Industrial Index DJIA, +0.56%, the S&P 500 SPX, +0.87%  and the Nasdaq Composite COMP, +1.39% all closed lower Friday in the wake of the president's diagnosis; the Nasdaq was down 2.2% at day's end. Doubts about traction for further fiscal stimulus from Washington may be another factor discouraging investors who have been betting on Republicans and Democrats striking a deal to offer additional relief. As of Sunday, COVID-19 has now killed at least 1,034,865 people worldwide, and 209,749 in the U.S., according to data aggregated by Johns Hopkins University. The U.S. still has the world's highest number of COVID-19 cases (7,412,911), just ahead of India (6,549,373) and Brazil (4,906,833). Worldwide, there has been at least 35,011,322 confirmed cases, which mostly does not account for asymptomatic cases. Several companies in the U.S. and overseas are working on a vaccine. AstraZeneca AZN, +1.16%  , in combination with Oxford University; BioNTech SE BNTX, +1.23%  and partner Pfizer PFE, -0.27% ; GlaxoSmithKline GSK, +1.10% ; Johnson & Johnson JNJ, +1.39% ; Merck & Co. MERK, +1.59% ; Moderna MRNA, +0.09% ; and Sanofi SAN, -1.48%  are among those working to get a vaccine through trials, in the hope one will be read in and/or by 2021."}]}