{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-see-tepid-rise-after-sharpest-daily-plunge-in-6-weeks-and-may-close-week-with-a-loss-2020-06-12", "published": 1591976000.0, "headline": "Oil prices end slightly lower, post first weekly loss in 7 weeks", "body": "Oil futures settled at a modest loss on Friday, with U.S. and global benchmark prices suffering their first weekly decline in seven weeks on worries about oversupply and a resurgence of coronavirus cases in the U.S. Oil is likely to “remain vulnerable and exposed to downside shocks thanks to coronavirus-related concerns,” said Lukman Otunuga, senior research analyst at FXTM. “The possibility of renewed lockdowns and delayed global economic recovery is bad news for oil, which remains one of the biggest causalities of the coronavirus menace,” he told MarketWatch. Although OPEC+ agreed to extend production cuts by another month, in the grand scheme of things this may offer little support to oil, which is in “a losing battle with COVID-19 and world growth fears,” he said. West Texas Intermediate crude for July delivery CL.1, -1.62% US:CLN20, the U.S. benchmark, fell 8 cents, or 0.2%, to settle at $36.26 a barrel on the New York Mercantile Exchange—the lowest finish for a most-active contract since June 1, according to Dow Jones Market Data. The contract tumbled 8.2% on Thursday to mark the sharpest one-day fall since April 27. Global benchmark Brent oil for August delivery UK:BRNQ20, however, added 18 cents, or 0.5%, to end at $38.73 a barrel on ICE Futures Europe, following a 7.6% plunge Thursday, its steepest such slide since April 21, that took it to its lowest finish since June 1. For the week, WTI marked weekly slide of 8.3%, while Brent saw a decline of 8.4%. That represented the first weekly losses for the two crude benchmarks since the week ended April 24. Read:Why natural-gas prices haven’t yet bottomed despite this year’s nearly 20% drop Also see:Rice futures slice year-to-date gain in half over the course of a week Concerns over further weakness in the global economy has raised expectations for weaker energy demand, pressuring prices for oil. The International Monetary Fund’s Gita Gopinath said that the global economy is recovering more slowly than expected and faces “significant scarring,” Bloomberg News reported. Worries of a resurgence of the pandemic has added to recent concerns about the ability of the Organization of the Petroleum Exporting Countries and its allies, in a group known as OPEC+, to curtail global production by 9.7 million barrels a day through July. In the U.S., which isn’t part of the output reduction pact, the number of active rigs drilling for oil edged down by seven to 199 this week, according to Baker Hughes BKR, -1.34% on Friday.The number has been falling on a weekly basis since mid-March, but the rig count has seen much larger declines in recent weeks. Meanwhile, analysts at Barclay remain bullish on the outlook for the oil market, even if they expect the pace of recovery from the depths of oil’s rout in April to slow. “As we mark to market our [second quarter] estimates and account for a potentially larger [second half] deficit, we raise our 2020 oil price forecasts by $4 [a barrel] but remain cautious with respect to the curve over the near term,” wrote Amarpreet Singh, vice president of oil strategy at Barclays, in a late Thursday research note, referring to their upwardly revised Brent oil forecast of $41 a barrel and WTI forecast of $37a barrel. On Nymex, July gasoline US:RBN20 rose 0.5% at $1.1243 a gallon, for a weekly loss of 7.4%, while July heating oil US:HON20 added 1.2% to $1.1014 a gallon, ending 4.3% lower for the week. July natural gas US:NGN20 shed 4.5% to $1.731 per million British thermal units, with prices registering a loss of 2.9% for the week."}]}