{"article": [{"url": "https://www.marketwatch.com/story/amazon-hiring-100000-workers-in-us-and-canada-to-meet-surge-in-lockdown-shopping-2020-09-14", "published": 1600110800.0, "headline": "Amazon hiring 100,000 workers in U.S. and Canada to meet surge in lockdown shopping", "body": "Amazon stepped up its hiring spree on Monday, saying it would recruit 100,000 more workers to meet the growing demand for online shopping, which has spiked during the pandemic. The world’s biggest online retailer, which is run by Jeff Bezos, said the new positions are for full and part-time work across the U.S. and Canada, and include roles at 100 package sorting centers and other facilities it is opening in September. The roles offer a starting wage of at least $15 per hour, and Amazon AMZN, +3.01% is offering sign-on bonuses up to $1,000 to new hires in select cities. The news marks Amazon’s fourth hiring spree in the U.S. so far this year, and comes ahead of what it expects to be one of the busiest holiday shipping periods ever. United Parcel Service UPS, +0.27% said last week it expects to add more than 100,000 extra workers to help handle an increase in packages during the peak festive season. Amazon’s latest recruitment drive comes just days after it announced the creation of 33,000 corporate and technology jobs. In March and April it also said it would add 100,000 and 75,000 new operations jobs, respectively. “We are opening 100 buildings this month alone across new fulfillment and sortation centers, delivery stations, and other sites,” said Dave Clark, senior vice president of worldwide operations at Amazon. Read:Amazon promised to spend its profit amid pandemic, but ended up with record earnings anyway Shares in Amazon have surged almost 70% in the year to date, according to FactSet, as hundreds of millions of people stuck at home during the pandemic turn to the delivery giant to keep them fed, clothed and entertained. Lockdown shoppers helped drive a 40% rise in sales in the second quarter to $88.9 billion, as the company recorded $5.2 billion in net income for the three months to the end of June 2020. The rise in Amazon’s share price meant Bezos, 56, already the world’s richest man, saw his personal fortune soar above the $200 billion threshold on Aug. 26 after a sharp rally in U.S. tech stocks, to become the first person to surpass the $200 billion threshold, according to the Bloomberg Billionaires Index. On Monday, his net worth stood at $184 billion, ahead of Microsoft MSFT, +2.48% founder Bill Gates at $122 billion and Facebook FB, +0.26% founder and Chief Executive Mark Zuckerberg with a net worth of $101 billion. Read:The Tech-Stock Rally Is Taking a Breather Since 2010, Amazon has directly created more than 600,000 jobs in the U.S. across its corporate offices and operations sites, and invested more than $350 billion across more than 40 states, including infrastructure and compensation. That makes the Seattle-based group one of the world’s biggest private sector employers. Read:Amazon reaches 1 million workers amid pandemic hiring frenzy Last week the tech giant also said it was adding 7,000 permanent jobs to its U.K. workforce by the end of 2020, bringing its total British workforce to more than 40,000. Clark said Amazon’s expansion comes with an “unwavering commitment” to safety. “Collectively, our new team members have already completed more than 1,200,000 hours of safety training, with over 500,000 more hours expected, to ensure that in addition to fast and efficient delivery for our customers, we’re providing a safe and modern environment for our employees and partners,” he said."}]}