{"article": [{"url": "https://www.marketwatch.com/story/fox-news-removes-digitally-altered-misleading-photos-of-seattle-protest-zone-2020-06-14", "published": 1592152100.0, "headline": "Fox News removes digitally altered, misleading photos of Seattle protest zone", "body": "SEATTLE — Fox News has removed digitally altered photos from its website after the Seattle Times on Friday noted misleading images used in the network’s coverage about a Seattle neighborhood that’s become a protest center against police brutality and racial injustice. As of Saturday, Fox News included an editors note posted at the top of at least three stories on its website covering the protest zone, saying it replaced a “home page photo collage” because it “did not clearly delineate between these images” and that it mistakenly included a St. Paul, Minnesota, photo in a slideshow about Seattle. The Seattle Times reports Fox News’ website featured at least two photos on Friday that inserted an image of a man standing with a military-style rifle, and that there were no disclaimers on how they were manipulated when featured on the network’s website for most of the day Friday. The image of the gunman is from a Getty Images photo that was taken on June 10 at what is known as the “Capitol Hill Autonomous Zone” protest area. The original photo showed an unidentified man wearing a green mask who was carrying a weapon while standing in front of a car. The Seattle Times said Fox’s website used that gunman image for the network’s coverage of the protest zone, but the image was included in a mashup of other photos from May 30 that depicted smashed windows in downtown Seattle — before the protest zone was set up and in a different neighborhood. The Seattle Times said Fox took down the photos after the newspaper inquired and a Fox News spokeswoman acknowledged the issue in a statement that falsely claimed all photos were from the same week and the same location. “We have replaced our photo illustration with the clearly delineated images of a gunman and a shattered storefront,” the Fox statement read in part. The standards of journalism require photo illustrations to be clearly marked, and caution against using photos from different times and locations unless they are clearly marked because it can be misleading to the reader or viewer. The gunman image was also inserted into a different June 10 Getty Images photo showing a sign from the protest zone that reads: “YOU ARE NOW ENTERING FREE CAP HILL.” The gunman and sign photos were taken by Seattle freelance photographer David Ryder, who then distributed the photo through Getty Images. “It is definitely Photoshopped,” Ryder told the Seattle Times. “To use a photo out of context in a journalistic setting like that seems unethical.” The Seattle Times also reported that Fox’s package of stories on Seattle’s protest zone included a May 30 photo taken by an Associated Press photographer depicting a burning building and car that was in St. Paul, Minnesota. Fox has also since removed that image. The Capitol Hill protest zone east of downtown Seattle has evolved this week into a festival-like scene after police on June 8 removed barricades near the East Precinct and largely abandoned the station in an effort to de-escalate tensions between officers and demonstrators. The largely peaceful zone has drawn the ire of President Donald Trump, who fumed on Twitter that the city had been taken over by “anarchists.” Meanwhile, a U.S. judge on Friday ordered Seattle police to temporarily stop using tear gas, pepper spray and flash-bang devices to break up largely peaceful protests."}]}