{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-death-toll-edges-toward-117000-and-oklahoma-is-one-of-9-states-that-are-still-setting-case-records-2020-06-17", "published": 1592404820.0, "headline": "Coronavirus update: U.S. death toll edges above 117,000; Oklahoma is one of 9 states that are still setting case records", "body": "The U.S. death toll from the coronavirus illness COVID-19 climbed above 117,000 on Wednesday, amid reports that nine states are recording either single day record numbers of cases or their highest seven-day new case averages, indicating they are not managing to contain the spread. Alabama, Arizona, Florida, Nevada, North Carolina, Oklahoma, Oregon, South Carolina and Texas are seeing infections climb, according to a Washington Post analysis. The news comes a day after Vice President Mike Pence said in a Wall Street Journal op-ed that worries about a second wave of cases later in the year were “overblown” and due to the media trying to scare Americans. His comments were dismissed by health care experts, who continue to urge people to wear face masks, wash their hands frequently and socially distance to avoid further economic hardship and unnecessary deaths. iframe.twitter-tweet { width: 100% !important; } “Dr. Pence would not be someone I’d go to for a medical checkup, or for medical advice,” said Chuck Schumer, the Senate Democratic minority leader Dr. Anthony Fauci, head of the National Institute for Allergies and Infectious Diseases, said he would not be attending the rally in Tusla, Oklahoma planned for Saturday by President Donald Trump, telling the Daily Beast that he is in the high-risk category given he is 79 years old. Fauci also said the current talk of a second wave of infections is redundant as the U.S. is still dealing with the first wave. “We are seeing infections to a greater degree than they had previously seen in certain states, including states in the southwest and in the south,” Fauci said. “I don’t like to talk about a second wave right now, because we haven’t gotten out of our first wave.” See also:‘We’re still in a first wave,’ Fauci says, noting precautions can prevent second wave of coronavirus Fauci said he is nervous about states that are reopening aggressively, especially when he sees images on TV of people gathering closely in bars with no masks. Regarding the Tulsa rally, he said outside is better than inside, no crowd is better than a crowd, and a crowd is “better than big crowd.” The Trump campaign is planning to hold the rally indoors in a 19,000-seat arena, that has canceled all other events through the end of July. The campaign has acknowledged the risk of infection by insisting that those who attend sign legal waivers absolving Trump and his staff of any blame, if people get sick or are injured. The virus is spread by droplets of moisture that are released when people cough, sing or shout and it moves rapidly in indoor spaces. Trump rallies tend to include a lot of cheering, shouting and chanting. The Centers for Disease Control and Prevention released its guidelines for reopening safely on Friday, and identified the highest risk of spreading the virus as stemming from, “large in-person gatherings where it is difficult for individuals to remain spaced at least 6 feet apart and attendees travel from outside the local area.” See:Considerations for Daily Life and Considerations for Events and Gatherings A group of Tulsa city residents and business owners filed a suit seeking to bar Trump from hosting the rally, but their suit was denied by a judge, according to media reports. Read:There’s a one-in-three chance of a ‘massive’ disaster that could be worse than COVID-19, says Deutsche BankLatest tallies There are now 8.3 million confirmed cases of COVID-19 worldwide and at least 445,468 people have died, according to data aggregated by Johns Hopkins University. At least 4.0 million people have recovered. The U.S. has the highest case tally in the world at 2.15 million and the highest death toll at 117,290. Brazil is second with 923,189 cases and 45,241 deaths. The U.K. has 300,715 cases and 42,238 fatalities, the highest in Europe and the third highest in the world. A chart published Wednesday by Our World in Data was the subject of social media buzz, as it showed the difference in the rolling three-day average of confirmed cases of COVID-19 in the European Union and the U.S. EU countries moved faster to enforce restrictions on movement when the pandemic first created hot spots in Spain and Italy and has made far greater progress in flattening its infection curve than the U.S. The EU has a population of 446 million, compared with the U.S. population of about 330 million. iframe.twitter-tweet { width: 100% !important; } China, where the illness was first reported late last year, is introducing further restrictions on movement in Beijing, a city of about 21.5 million, after a fresh cluster of cases that is understood to be linked to a wholesale food market. Officials have barred unessential travel, canceled hundreds of flights and suspended schools, the Guardian reported. Health authorities reported 31 new cases of COVID-19 as of Tuesday, bringing the total number of new infections to 137 in just six days. The outbreak could cause more disruption than the initial one in the city of Wuhan, which has a population of 11 million. See: Beijing cancels 60% of flights to contain fresh coronavirus outbreaks: report “A lockdown of Beijing would be a Wuhan on steroids, being a governmental and commercial centre of China, and much more massive on any measure then Wuhan,” said Jeffrey Halley, senior market analyst, Asia Pacific, at foreign exchange services company OANDA. “The economic implications would be profound in China, and by default, the rest of Asia.” See: Coronavirus tally: Global cases of COVID-19 at 8.19 million, 444,076 deaths and 6 U.S. states see record new casesWhat’s the economy saying? There was good news for the housing market on Wednesday in numbers from the Commerce Department, showing construction of new houses rose 4.3% in May. Housing starts climbed to an annual rate of 974,000 last month from a five-year low of 934,000 in April, to mark the first increase since January. Construction rose as the reopening U.S. economy and ultra-low mortgage rates drew buyers and spurred builders to speed up work. Economists polled by MarketWatch forecasted starts to rise to a 1.13 million rate. That’s how many new homes would be built in a year if the level of construction was the same each month. Although the increase was less than expected, a sharp rise in builder permits indicates construction is on track to expand more rapidly soon. Permits to build new houses jumped 14.4 % to a 1.22 million annual pace. Read also: Retail sales surge a record 17.7% in May, but coronavirus wounds still visible “We aren’t much bothered about the undershoot in starts,” wrote chief economist Ian Shepherdson of Pantheon Macroeconomics. “The outlook is very positive, given the astonishing surge in mortgage demand.” Not everyone was sanguine. “Interest rates are going to stay low for a long time, but they are staying that way because of record numbers of unemployed. And that will be the biggest constraint on stronger housing activity,” said senior economist Jennifer Lee of BMO Capital Markets. What are companies saying? U.S. Steel Corp. X, -1.99% disappointed investors with the news that its second-quarter losses would be much worse than expected after a “significant” portion” of steelmaking operations have been idled during the quarter as a result of the pandemic. The company reiterated its view that the second quarter will mark the bottom for the year, with demand starting to show improvement in June. Results for the company’s flat-rolled business are expected to be “significantly lower” than the first quarter as a result of the pandemic, but demand has begun improving. The tubular business remains “challenged,” however, with demand for welded and seamless pipe declining significantly, as rig counts continue to decline and oil prices remain low. There was better news from mattress company Tempur Sealy International Inc. TPX, +1.16% , which reported a strong rebound in orders in May and early June after a “very difficult” April. See: COVID-19 will force older workers into early retirement “This has been a very difficult period to forecast as shelter-in-place orders and other COVID-19 related issues impact the bedding market,” Chief Executive Scott Thompson said in a statement. “But there is no question that post-April order trends have been strong.” The improvement has been broad-based across geographies, driving by improvements in the wholesale channel and robust growth in e-commerce, he said. Elsewhere, companies rushed to issue debt mostly in the form of bonds, continuing a trend seen for months as they seek to bolster liquidity during the downturn. Here are the latest things companies have said about COVID-19: • Abercrombie & Fitch Co. ANF, -3.02% is planning to offer up to $300 million of senior secured notes that mature in 2025. Proceeds will be used to repay an existing senior secured term loan facility, to repay part of the outstanding borrowings under its Amended ABL Facility to pay fees. • Alcoa Corp. AA, -1.65% is planning to begin on June 25 a formal process at its San Ciprian aluminum facility in Spain that could lead to up to 534 jobs being cut. The company started in May talks with the workers’ representatives regarding the “significant and unsustainable circumstances” at the plant. The aluminum smelter has suffered “significant and recurring financial losses,” which the company expects to continue. The alumina refinery at San Ciprian is not affected by the restructuring. • Chembio Diagnostic System Inc. shares CEMI, +1.00% tumbled after the Food and Drug Administration (FDA) revoked an emergency use authorization for its antibody test. An antibody test doesn’t test for a current COVID-19 infection; it instead assesses whether an individual has been exposed or been previously infected with the virus. The FDA has concerns about the accuracy of the test, which was one of the first serologic tests to receive emergency authorization during the COVID-19 pandemic, on April 14. The test reportedly generates “higher than expected” false results.” The company previously said it plans to distribute the test in the U.S. and abroad, and it had announced a public offering in May to raise about $27.5 million, saying it would use proceeds in part to support the manufacturing and commercialization of the test. Read:Why do so many Americans refuse to wear face masks? Politics is part of it — but only part • Energizer Holdings Inc. ENR, +0.36% launched a $600 million bond offering on Wednesday, joining the many companies issuing debt during the coronavirus pandemic. Proceeds will be used to fund the purchase of the battery maker’s 5.500% senior notes that mature in 2025. • Groupon Inc. GRPN, -0.33% reported a narrower-than-expected adjusted loss in the first quarter and sales were above expectations even after the company suffered a “major impact” from the pandemic. Groupon lost $213.5 million, or $7.53 a share, in the quarter, compared with a loss of $42.5 million, or $1.49 a share, in the first quarter of 2019. Adjusted for one-time items, Groupon lost $46.2 million, or $1.63 a share, in the quarter, contrasting with adjusted profit of 58 cents a share a year ago. Sales fell 35% to $374.2 million. Analysts polled by FactSet expected an adjusted loss of $1.92 a share on sales of $365 million. Interim Chief Executive Aaron Cooper Groupon has “distinct competitive advantages” to gain market share in its “highly fragmented” market. It ended the quarter with $667 million in cash, including $150 million in borrowings from its revolving credit facility. Layoffs and furloughs earlier this year are expected to result in about $100 million in cost savings this year, and more than $125 million cost savings beginning in 2021. • Merck & Co. Inc. MRK, -0.14% priced a $4.5 billion, four-part bond offering on Wednesday, joining the many companies issuing debt to bolster liquidity during the pandemic. The company sold $1 billion of 0.750% notes due 2026, $1.25 billion of 1.450% notes due 2030, $1.0 billion of 2.350% notes due 2040 and $1.25 billion of 2.450% notes due 2050. Proceeds will be used for general corporate purposes, including repaying commercial paper and other debt with pending maturities. BNP Paribas, BofA, Citigroup and Deutsche Bank were joint bookrunners on the deal. • Cruise line stocks took a hit Wednesday, after Norwegian Cruise Line Holdings Ltd. NCLH, +2.91% said it was extending the suspension of voyages to at least October because of the pandemic. Norwegian’s stock led the way lower, dropping 7.9% in premarket trading. The company had previously canceled cruise departures through July, then said late Tuesday that all cruises would be suspended through the end of September, with some destinations held until at least November. • Southwest Airlines Co. LUV, +1.89% raised its outlook for June revenue and capacity, citing continued improvement in passenger demand and bookings. The company now expects June revenue to be down 70% to 75% from a year ago, compared with previous projections for a decline of 80% to 85%. The outlook for June capacity has improved to a decline in the 40%-to-50% range from 45% to 55%, while the expectation for load factor has increased to 40% to 50% from 35% to 45%. For July, Southwest expects revenue to be down 65% to 70%, capacity to be down 25% to 35% and load factor to be in the 45%-to-55% range. Meanwhile, Southwest raised its estimate for second-quarter economic fuel costs to $1.25 to $1.35 a gallon from $1.00 to $1.10. Southwest now estimates it has 24 months of liquidity, compared with the previous estimate of 20 months. The company has 140 aircraft in long-term storage, including 34 of Boeing Co.’s BA, -0.39% 737 MAX aircraft. Late Tuesday, Southwest said it would extend its policy to leave middle seats open through at least Sept. 30. • Target Corp. TGT, +1.14% will permanently raise its starting U.S. hourly wage to $15, beginning July 5. Target set the goal of raising its minimum wage in 2017, with the last increase to $13 in 2019. The company will also be giving a one-time bonus of $200 to frontline store workers and hourly distribution center workers for their efforts during the pandemic. Target will now also offer free virtual doctor visits to all team members through the end of the year, whether or not they are members of the company’s health care plan. Extended benefits also include a one-time 30-day leave for vulnerable workers, including those who are pregnant or 65 and over; free backup care for children and adults through the end of August; and free mental health counseling. • Tempur Sealy revised second-quarter guidance and said orders had “significantly improved” from previous expectations. The Lexington, Ky.-based mattress company now expects second-quarter sales to fall 15%, as strong sales in May and early June offset a “very difficult” April. “This has been a very difficult period to forecast as shelter-in-place orders and other COVID-19 related issues impact the bedding market,” Chief Executive Scott Thompson said in a statement. “But there is no question that post-April order trends have been strong.” The improvement has been broad-based across geographies, driving by improvements in the wholesale channel and robust growth in e-commerce, he said. The company expects to generate at least $50 million in EBITDA and to achieve a ratio of consolidated indebtedness less netted cash to adjusted EBITDA within the Company’s target range of 2.5 to 3.5 times. Operating cash is expected to be positive. • XpresSpa Group Inc. XSPA, -0.84% announced a registered direct offering of 7.6 million shares of common stock, to be priced at the market. That represents about 26% of the shares outstanding. The company has entered into purchase agreements with several institutional investors. As part of the agreements, XpresSpa will issue short-term warrants to buy up to 7.6 million shares of common stock, with an exercise price of $5.25. The combined purchase price for one common stock and warrant to buy a stock is $5.253, which is 2.1% below Tuesday’s stock closing price of $5.35. Beijing’s Coronavirus Cases Spoil Its Return to Normal"}]}