{"article": [{"url": "https://www.marketwatch.com/story/general-mills-and-tractor-supply-among-the-companies-that-stand-to-make-long-term-gains-from-covid-related-pet-boom-11600978313", "published": 1601110580.0, "headline": "General Mills and Tractor Supply among the companies that stand to make long-term gains from COVID-related â\u0080\u0098pet boomâ\u0080\u0099", "body": "Pet adoption had jumped during the pandemic. AFP via Getty Images Companies in the pet care category are poised to benefit from what Bank of America analysts call the current â\u0080\u009cpet boomâ\u0080\u009d: As more people move out of cities and work from home due to COVID-19, they have the time and space to adopt an animal. Consumer businesses that could reap the rewards now and into the future include food company General Mills Inc. GIS, +0.78%, rural lifestyle retailer Tractor Supply Co. TSCO, +0.47% and e-commerce pet supply company Chewy Inc. CHWY, +4.96% â\u0080\u009cAmericans spending more time at home have taken on projects from home improvement to crafting, and have also been adopting new pets,â\u0080\u009d analysts led by Elizabeth Suzuki wrote.Â â\u0080\u009cWe expect the pet boom to provide a multi-year tailwind to these sectors.â\u0080\u009d Read: Some pet owners are spending more than $2,000 a year on their dogs People starved for companionship in a time of greater isolation, those taking advantage of the greater space in homes outside of major cities, and new pet owners who are using the extra time that the coronavirus affords to train a pet are driving an increase in pet adoption, according to Bank of America. According to the latest poll of more than 1,000 U.S. consumers in its â\u0080\u009cHome Workâ\u0080\u009d series, 69% have at least one animal and 37% adopted a pet in the six months leading up to September 2020. There are about 95 million cats and 90 million dogs in the U.S. COVID-19 has also accelerated the trend towards online retail. And: Retailers are shutting stores amid COVID-19 but could be getting stronger in the process, says BMO â\u0080\u009cFor pet food and products specifically, online retailers are becoming increasingly important to pet parents,â\u0080\u009d Bank of America said. Online pet spending reached its peak growth, up 57% year-over-year, in April. It has remained up, with the year-over-year increase as of Sept. 12 at 36%, based on a seven-day moving average. â\u0080\u009cWhile pet specialty stores were still the preferred channel for pet products per our survey (36% of respondents preferred over other channels), 22% of respondents stated that they prefer to buy pet food and supplies online.â\u0080\u009d General Mills said during its earnings announcement on Wednesday that it gained market share in the pet category during the fiscal first quarter. The Blue line of pet food is part of the General Mills portfolio. â\u0080\u009cIn pet, weâ\u0080\u0099re reaching out to first-time Blue e-commerce buyers to encourage them to transition to subscription-based purchases to help keep these new consumers in the Blue franchise,â\u0080\u009d said Chief Executive Jeffrey Harmening, according to a transcript of prepared statements provided by the company. General Mills reported an earnings beat and raised its dividend. And: Walmart+ will add 10 million members by the end of 2021: UBS Tractor Supply can serve customers whose stable of animals goes beyond dogs and cats. â\u0080\u009cAlmost half of Tractor Supplyâ\u0080\u0099s annual sales are in pet and animal categories, and Tractor Supply serves rural lifestyle customers who are generally homeowners/property owners and often have a large animal in addition to companion animals,â\u0080\u009d Bank of America said. Read: Tractor Supply benefitting from consumer trends like gardening and the move to rural communities, analysts say And Chewy had been steadily building its company online before the pandemic. â\u0080\u009cChewy has been able to achieve scale despite going toe-to-toe with behemoth Amazon by differentiating itself with 1600+ pet specialist customer reps,â\u0080\u009d Bank of America said.Â Other companies like Clorox Co. CLX, +0.90% and Church & Dwight Co. CHD, +1.77% offer items like cat litter and cleaners that pet owners will seek out. Animal health companies like Idexx Laboratories Inc. IDXX, +1.81% stand to make gains as well. The pet category is poised to only get more competitive. Sustainable brand Public Goods recently released a pet supply line. Natural pet food company Wellpet, said sales of its puppy and kitten products grew 15% during the pandemic. And Chewy has expanded with new offerings in areas like virtual pet care. Seeing an opportunity, Walmart Inc. WMT, +1.00% also made pets part of its holiday announcement on Wednesday. â\u0080\u009cAnd, to ensure it has great gifts for the newest member of many families since the pandemic began â\u0080\u0093 pets â\u0080\u0093 Walmart has increased its assortment and supply of pet products in its stores and online and is ready to sell over 3 million comfy pet beds,â\u0080\u009d the retail giant said."}]}