{"article": [{"url": "https://www.marketwatch.com/story/consumer-confidence-wanes-in-july-and-points-to-rockier-economic-recovery-2020-07-28", "published": 1595933060.0, "headline": "Consumer confidence wanes in July and points to rockier economic recovery", "body": "The numbers: Consumer confidence swooned in July amid a rash of new coronavirus cases in many U.S. states, signaling a rockier economic recovery in the months ahead. The index of consumer confidence fell to 92.6 this month from a revised 98.3 in June, the Conference Board said Tuesday. Economists polled by MarketWatch had expected a reading of 96.0. The level of confidence is still above its pandemic low of 85.7, but it’s likely to be a long time before it returns to its pre-crisis peak. The index stood near a 20-year high at 132.6 in February before the pandemic struck. The economy is not expected to make a full recovery for at least a year or two. “Consumers have grown less optimistic about the short-term outlook for the economy and labor market and remain subdued about their financial prospects,” said Lynn Franco, senior director of economic indicators at the board. “Such uncertainty about the short-term future does not bode well for the recovery, nor for consumer spending.” What happened: An index that gauges how consumers feel about the economy right now actually rose to 94.2 in July from 86.7. Massive federal aid and other measures to prop up the economy have helped stave off worse financial straits for million of Americans already struggling to get by. More than 30 million people are receiving unemployment benefits. Yet Americans have gotten more pessimistic about the near future. Another gauge that assesses how Americans view the next six months — the so-called future expectations index —sank to a four-month low 91.5 from 106.1 in June. Congress is weighing a new financial-relief bill this week, but the outcome is unclear and it’s possible that emergency unemployment benefits could be reduced. Washington has kicked in up to $600 in extra benefits for jobless Americans on top of what state plans pay, but the measure ends July 31. Big picture: Hopes for a quick economic recovery from the coronavirus have been dashed by an explosion in new cases in Texas, California, Florida and other hotspots. The economy is likely to suffer regular ups and downs until the virus is brought under control again or a treatment is discovered. What they are saying? “American consumers lost confidence in July amidst the acceleration in new virus cases,” said economist Katherine Judge at CIBC Economics. “This data suggests that the recovery has shifted into a lower gear, as consumers became more cautious about the outlook as virus cases continued to escalate.” Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 index SPX, +0.87% fell in Tuesday trades."}]}