{"article": [{"url": "https://www.marketwatch.com/story/shares-of-tesla-have-surged-on-hope-of-inclusion-in-the-sp-500-but-does-being-added-to-an-index-help-a-stock-2020-07-27", "published": 1595925440.0, "headline": "Tesla shares have surged on hope of inclusion in the S&P 500. But does being added to an index help a stock?", "body": "What happens when a stock joins a benchmark index? It isn’t just an academic question. Shares of Tesla Inc. TSLA, +1.89% have surged in recent weeks as observers speculated about whether a fourth straight quarterly profit would put the electric-vehicle maker on track to be added to the S&P 500 SPX, +0.87%. But being added to an equity index isn’t such a great thing for most stocks, according to a new working paper. Tulane University’s Benjamin Bennett, Zexi Wang of the Lancaster University Management School, and René M. Stulz of Ohio State University analyze about 20 years of history, and find that while stocks may have benefited from being added to indexes at one time, that is changed in the past decade or so. “The positive announcement effect on the stock price of index inclusion has disappeared and the long-run impact of index inclusion has become negative,” write Bennett, Wang, and Stulz. “Inclusion worsens stock price informativeness and some aspects of governance.” From 1997 until about 2008, they find, a stock’s price would jump an average of 4.7% to 4.9% from the day before the index announcement to five or 21 days later. But since 2008, those increases decline markedly—to 0.6%-0.7%. In fact, when the sample period is elongated to one calendar month after the stock is added to the index, the stock sees a decline of 2.1%-2.3%, in the period since 2008. In the 1997-2008 period, prices increased from 2.0% to 2.4%. It is worth noting that the latter period they analyze, the decade or so since 2008, coincides with the enormous investor influx into passively managed funds. Indeed, Bennett, Wang and Stulz note that inclusion in an index by necessity means that a stock will be held by far more passive investors than before. But just as earlier research has found that such inclusion doesn’t increase overall investor demand, the researchers find that holdings by active funds decrease when a stock is added to an index. “This implies that when institutional investors tracking the S&P 500 index closely (e.g., passive mutual funds) have to buy newly added stocks mechanically, other institutional investors tend to sell their holdings,” they write. Related:Three fund managers may soon control nearly half of all corporate voting power, researchers warn One theoretical outcome of having more passive investors in a stock is that its price contains less information for market participants, the researchers note. That is because prices of individual securities tend to move in line with the other stocks in the index. What’s more, owners of passive funds are “indifferent” to the price of the stock: it is purchased simply because it is part of an index, not on its own merits. The researchers’ analysis does confirm that added firms’ stock prices do become “less informative,” in their words. But why does that matter? Existing research suggests that firm managers may use their stock price as a gauge for understanding investment efficiency: whether more capital spending is necessary, for example. An increase in passive ownership of the stock “decreases the quality of the governance of the firm both because passive investors have little incentives to invest in governance activities and because the increase in passive holdings decreases the potential gains to investors from actively trying to influence a firm’s activities,” the researchers write. See:Investing legend Burton Malkiel on day-trading millennials, the end of the 60/40 portfolio and more How else does governance change? The analysis shows that after firm are added to an index, boards tend to use other firms within the same index more as peers for comparisons on things like compensation. “A firm’s investment, funding, and (shareholder) payout policies become more correlated with the policies of its index peers.” In fact, their work confirms earlier research that finds weaker governance goes hand in hand with relying less on private information, in favor of replicating public, peer policies, they note. The results presented in the paper raise a fresh set of questions, the researchers note: “Further research should attempt to explain why and how markets and investors appear to have adjusted to the increase in passive investing so that the real effects of passive investing have become somewhat weaker.” Read next:Coronavirus was the perfect storm for tech innovation, and this fund manager made out"}]}