{"article": [{"url": "https://www.marketwatch.com/story/bjs-is-adding-a-ton-of-new-members-to-its-roster-and-many-are-young-and-digitally-savvy-customers-2020-08-21", "published": 1598263220.0, "headline": "BJ's is adding a ton of new members to its roster, and many are young and digitally-savvy", "body": "BJ's Wholesale Club Holdings Inc. says the coronavirus pandemic has accelerated the number of new members joining the warehouse retailer, particularly among the young and digitally-savvy. BJ's BJ, +1.19%  says it now has more than six million paid members. \"To put this in perspective, in the past six months, we acquired and retained approximately 18 months' worth of members,\" said Lee Delaney, BJ's chief executive, on the Thursday earnings call. \"This pace, should it continue, would have us experience three years of membership growth in this one transformative year. Not only are new members joining at elevated levels, they skew younger and are more digitally engaged.\" Delaney thinks these customers are likely to stick around. To raise that likelihood, the company says it's paying close attention to consumer behavior and investing in marketing to interact with shoppers. Read:Walmart says government stimulus money bolstered Q2's blowout results and analysts are concerned now that it's been spent To meet the new demands driven by both COVID-19 and these new customers, Delaney says BJ's revamped its merchandise assortment \"in real time, selling through old inventory at a rapid pace\" and expanding in categories that were previously not the company's strongest. BJ's added 32 new vendors for food, paper goods and cleaning supplies, brought in more healthy and organic items and added to the lineup on names like Sony and Puma PUM, -0.07%  . Digitally-enabled sales soared 300% over the second quarter, and on Friday the retailer launched curbside pickup at all of its clubs. BJ's operates 219 clubs and 148 BJ's Gas locations in 17 states. The membership-only warehouse club chain based in Massachusetts, operates on the East Coast and the states of Ohio and Michigan, but along with its growing membership rolls, BJ's is also growing its footprint, with a new Michigan club opening in July, two new clubs planned for New York by the end of the fiscal year, and six new clubs next year. BJ's stock rose 3.6% in Friday trading, and has more than doubled, up 102%, for the year to date. The S&P 500 index SPX, +0.87%  is up nearly 6% for 2020 so far. See:Target reports record-setting quarterly profits and comparable sales, $5 billion in market share gains for first half of 2020 \"Over time, we believe these changes will increase the value of a BJ's membership and keep the flywheel moving,\" wrote UBS analysts in an upbeat note. \"It's potential in this environment and beyond is extensive. We think BJ's remains attractive.\" UBS rates BJ's stock buy and raised its price target by $4 to $50. MKM Partners is much less optimistic, not just about BJ's but also Costco Wholesale Corp. COST, +1.19%  and others in the warehouse retail space. \"The COVID-19 disruption benefit has lasted longer than we expected for BJ's and the sector, but we still believe the traffic will moderate and shopping consolidation will reverse,\" wrote BIll Kirk, an executive director at MKM. \"Specific to the warehouse/clubs, we consider the need for bulk shopping to decrease as consumers resume more normal daily activities. We believe decreased bulk shopping and geographic exposure to states re-opening, combine for an emerging headwind for BJ's.\" MKM also warns that BJ's is exposed to competition with Walmart Inc. WMT, +1.00%  with locations that overlap in some zip codes and in states that have had challenged reopenings. MKM rates BJ's stock sell with a $33 price target, up from $30."}]}