{"article": [{"url": "https://www.marketwatch.com/story/women-and-credit-in-the-2010s-the-credit-card-act-is-amended-and-more-women-are-breadwinners-2020-08-07", "published": 1596815540.0, "headline": "Women and credit: In the 2010s, the Credit Card Act is amended and more women are breadwinners", "body": "This article is reprinted by permission from NerdWallet. This series examines the financial progress made by women in the U.S. since the Equal Credit Opportunity Act was passed in 1974. In this installment: the 2010s, when the Credit Card Act was amended to allow stay-at-home moms to get their own credit cards and the percentage of female breadwinners hit an all-time high.The Credit Card Act amendment The Credit Card Act of 2009 aimed to increase fairness and transparency to consumers by issuers. Part of the act called for issuers to determine whether cardholders could reasonably pay before extending them a credit card or increasing their credit limit. However, this determination was made by considering the individual applicant’s assets and income, making it hard for stay-at-home parents to get their own cards. But in 2013, an amendment to the act changed the rules to include income and assets the stay-at-home parent has access to. This means that stay-at-home mothers over the age of 21 can use their household assets and income — as opposed to individual assets and income — to prove they can pay off their credit cards. Read: Here are 8 recent laws helping women in the workplace This is a major win for women because they are more likely than men to stay at home with children, despite the number of stay-at-home dads rising in recent years. According to a Pew Research analysis of Census Bureau data, 7% of dads stayed at home compared with 27% of moms, as of 2016. Most stay-at-home parents do so in order to care for family members, but regardless of the reason they’re staying home they can use their spouse’s income to apply for credit because of this amendment. Nerd tip: You and your spouse don’t share a credit score, and this amendment doesn’t change that. You still need to have your own sufficient credit to get approved for a credit card. If you don’t have a credit score yet, or your credit is poor, you can ask your spouse to add you as an authorized user on his or her card until you’ve built a good enough score to get your own.Women and finance: Female breadwinners Let’s jump to women who work outside the home: Women are earning more degrees than men and closing the breadwinner gap. In the 2016-2017 school year, women were awarded more than half of degrees at every postsecondary education level – 60.8% of associate degrees, 57.3% of bachelor’s degrees, 59.4% of master’s degrees and 53.3% of doctorates. More than 2 in 5 mothers (41%) are the sole or primary breadwinners for their families, and more than two-thirds of Black mothers (68.3%) are the breadwinners for their families, as of 2017. Read more from this series: In the 1970s, the Equal Credit Opportunity Act became law— a key step in financial freedom for women In the ’80s, women gained career options and financial clout In the 1990s, women made strides in politics, and pop culture rewrites what it means to be a girl In the 2000s, the fight against pay discrimination continues Women still earn less, on average, than men, with Black and Latina women making significantly less, on average, than white and Asian women in the U.S. We have a long way to go to reach income parity between men and women, but we’ve made a lot of progress since the Equal Credit Opportunity Act was passed and will continue to advance in the decades to come.More from NerdWallet: Can a Credit Card Company Lower My Credit Limit? Is It OK to Never Have a Credit Card? Today’s Definition of Financial Adulthood Is More Flexible Than Ever Erin El Issa is a writer at NerdWallet. Email: erin@nerdwallet.com. Twitter: @Erin_El_Issa."}]}