{"article": [{"url": "https://www.marketwatch.com/story/sustainable-investing-flows-have-smashed-all-records-in-2020-whats-going-on-2020-07-07", "published": 1594913780.0, "headline": "Sustainable-investing flows have smashed records in 2020. What's going on?", "body": "Is 2020 the year ESG came of age? Flows into investment products with an environmental, social, or governance focus - also sometimes called sustainable investments - are topping earlier records, gathering over $15 billion in just the first six months of the year, according to research provider ETF Flows. Investors have long expressed interest in ESG products, but rarely put their money where their mouths were, noted Dave Nadig, a longtime veteran of the exchange-traded fund industry now serving as ETF Flows' chief investment officer and director of research. \"The dam has broken. This is the year it came out of the backroom and became a reality.\" On Tuesday, investment titan BlackRock also said that sustainable ETFs in its iShares suite had gathered $11 billion so far in 2020, more than doubling the $5 billion of inflows in the full year 2019. See also:As boomers hand over the keys to the stock market, sustainability-minded younger investors let their consciences lead 2019 was \"an inflection point,\" said Armando Senra, head of iShares Americas, in an interview with MarketWatch. \"There had been a lot of interest, but not necessarily flows.\" Senra points to the firm's commitment to sustainable investing, most notably expressed by CEO Larry Fink in his annual letter, released in January, in which Fink pledged more disclosure as part of a broader commitment to tackling climate change. Senra also believes that the worldwide coronavirus pandemic helped accelerate the pivot. \"There's been an increased interest in companies that can better manage social issues: how they're treating their employees, working with communities, and so on.\" The experience has also helped financial services firms make the case that sustainably-managed companies are also better investment prospects, he said. ETF Flows' Nadig thinks there's a more straightforward explanation. Investors have indeed been interested in sustainable strategies for years, but after a decade-long bull market, most were reluctant to take the capital gains impact that would come with transitioning their portfolios. The market carnage of March provided the perfect opportunity to rotate, Nadig noted. What's more, the ESG category is also getting a performance boost this year. By design, it largely excludes energy and industrial stocks, both of which have lagged the technology and consumer-oriented post-pandemic economy. The table below shows the top holdings of two popular ESG exchange-traded funds. iShares ESG MSCI USA ETF ESGU, +0.93%  Xtrackers S&P ESG ETF SNPE, +1.08%  Apple Inc. AAPL, +1.74%  Apple Inc. AAPL, +1.74%  Microsoft Corp. MSFT, +2.48%  Microsoft Corp. MSFT, +2.48%  Amazon.com Inc. AMZN, +3.01%  Amazon.com Inc. AMZN, +3.01%  Facebook Class A Inc. FB, +0.26%  Facebook Class A Inc. FB, +0.26%  Alphabet Inc. Class C GOOG, +1.97%  Alphabet Inc. Class A GOOGL, +1.82%  Alphabet Inc. Class A GOOGL, +1.82%  Alphabet Inc. Class C GOOG, +1.97%  Johnson & Johnson JNJ, +1.39%  Visa Inc. V, +1.80%  Visa Inc. V, +1.80%  Procter & Gamble PG, +0.89%  Procter & Gamble PG, +0.89%  JPMorgan Chase & Co. JPM, -0.57%  Home Depot Inc. HD, +0.49%  UnitedHealth Group Inc. UNH, +1.68%  Source: company web sites Much of iShares' success comes from BlackRock's position as a provider of products that meet the mandates of institutional investors like pension funds, Nadig noted. Still, he said, for investors across the spectrum, the demand seems real: flows into ESG-themed products have consistently made up a solid chunk of all investment dollars every month in 2020. \"This time really is different,\" Nadig said. Read next:Coronavirus was the perfect storm for tech innovation, and this fund manager made out"}]}