{"article": [{"url": "https://www.marketwatch.com/story/toyota-brings-back-the-venza-as-a-hybrid-only-and-it-has-a-lot-going-for-it-2020-08-13", "published": 1597295480.0, "headline": "Toyota brings back the Venza as a hybrid only, and it has a lot going for it", "body": "After discontinuing it in 2015, Toyota TM, -0.65% is bringing back its 2-row Venza crossover. The new 2021 Toyota Venza is more of an urban SUV than its previous more wagonlike model. Slotted between the 3-row midsize Toyota Highlander and the compact RAV4, the 2021 Toyota Venza comes as a hybrid only with standard all-wheel drive. Toyota decided to bring the Venza back as a proper SUV to compete with existing models like the Ford F, -1.36% Edge and Nissan NSANY, -1.50% Murano as well as new rivals like the Chevrolet Blazer and Honda HMC, -1.21% Passport. These new 2-row crossovers are sportier takes on their larger 3-row midsize SUV siblings. The Venza is no exception sharing a family resemblance to the recently redesigned Toyota Highlander. By forgoing the utility of a 3-row layout, the Venza emphasizes the use of upscale materials as a big part of its appeal as a 5-passenger vehicle.What’s new for 2021? The Venza rides on an all-new platform that’s is a blend of RAV4 and Highlander. This 2-row SUV has sophisticated, sleek styling that gives it a sporty flair. In addition to the new styling, the Venza sports options like the Star Gaze Panoramic roof, a glass panel that can be instantly changed from translucent to opaque to block out the sun. Also see: The 10 best new car models of 2020 The Toyota Hybrid System II in the new Venza combines a 2.5-liter 4-cylinder engine with three electric motors (two on the front axle and one in the rear) to provide AWD. Total system output is 219 horsepower, and Toyota expects a combined 39 miles per gallon from the setup. It’s the same powertrain found in the 2020 Toyota RAV4 Hybrid. Toyota has also added a selectable regen braking mode to the shifter. What we like New entry in the 2-row midsize SUV segment Standard hybrid powertrain Standard all-wheel drive High level of active and passive safety What we don’t No plug-in hybrid variant Only one powertrain offering Limited off-road capability How much? $32,470–$39,800Fuel economy There is only one powertrain available on the 2021 Toyota Venza: a 2.5-liter 4-cylinder engine mated to three electric motors, two on the front, and one on a rear axle. The engine produces 176 horsepower and 163 lb-ft of torque and runs on regular unleaded gasoline. The three electric motors make 118 horsepower and 149 lb-ft of torque. Toyota says the combined output produces 219 combined net horsepower. Fuel economy of 37 mpg highway and 40 mpg city for an estimated combined rating of 39 mpg. The powertrain employs a continuously variable transmission with a sequential shift mode. Also read: 5 auto tech features that improve fuel efficiencySleek styling Unlike the previous generation, which had a boxier profile, the 2021 Toyota Venza features sleek, coupe styling. The nose features Toyota’s signature trapezoid-shaped lower grille, softened up by rounded corners. A small upper inlet is flanked by slim headlamps that wrap into the front fenders and contain LED daytime running lights. The sides are clean, and while it has a distinctive SUV-like stance, the overall look is more refined than muscular. There’s chrome surrounding the window openings and small wheel arch extensions that give the Venza the look of a luxury cruiser than an off-road basher. A spoiler tops the rear lift gate, and the LED taillamps extend from side to side. Base LE models are equipped with 18-in wheels, while the upper trim XLE and Limited ride on 19-in rims.Interior refinement The cabin also projects an upscale feel with a large center console that sweeps up into the standard 8-in center infotainment touchscreen. A 12.3-in touchscreen is available on higher trim levels. The look is clean and uncluttered, incorporating traditional controls. Venza features an 8-way power adjustment for the driver’s seat and 3-across seating in the rear. Behind the second row is 36.3 cu ft. of cargo space. The standard power rear liftgate features hands-free operation. The 2021 Venza is also a showcase for the optional Star Gaze panoramic glass roof. This fixed panel of electrochromic glass allows the driver to switch it from transparent to frosted mode within a second. The frosted setting keeps out direct sunlight while giving off light that brightens the interior.Standard features and options The 2021 Toyota Venza is offered in three trim levels, LE, XLE, and Limited. All models come with the hybrid powertrain and AWD as standard equipment. The base LE ($32,470) comes with power windows, an 8-way power driver’s seat, fabric upholstery, and a hands-free power liftgate. For entertainment and information, you can enjoy an AM/FM sound system with six speakers, an 8.0-inch infotainment touchscreen, and Android Auto/Apple AAPL, +1.74% CarPlay/Amazon AMZN, +3.01% Alexa compatibility. And for driving confidence, you get all-wheel drive and a backup camera with projected path and dynamic gridlines. Moving up to the XLE ($36,000) adds a 7-inch Multi-Information Display in the instrument cluster, 19-inch chrome alloy wheels, front and rear parking assist with automatic braking, projector LED headlamps, cloth seat inserts with SofTex leatherette bolsters, heated front seats, 5-door smart key, roof rails, auto-dimming rearview mirror, and gloss black exterior accents. You might like:The all-new Ford Bronco still has its off-road chops, but with plenty of creature comforts The top of the line Limited ($39,800) features a 12.3-inch touchscreen, 9-speaker JBL premium audio, digital review mirror, 4-way power-adjust passenger seat, SofTex upholstery, heated/ventilated front seats, heated leather-trimmed steering wheel, all-around view camera. The Limited is the only model on which you can order the Star Gaze Panoramic roof, which is a $1,400 option.Safety All Venza models come with Toyota Safety Sense II, a suite of active safety and driver assists. The package includes full-speed range adaptive cruise control, lane-departure alert with steering assist, automatic high beams, and road sign assist. Its pre-collision warning system also includes pedestrian detection, even in low-light situations, as well as daytime bicycle detection.Behind the wheel The 2021 Venza offers a pleasant driving experience with good visibility from its high seating position. The hybrid powertrain delivers decent power; it feels more muscular than the official 219 combined horsepower. That’s due in part to the instant torque response of the electric motors, which allows the Venza to step smartly off the line. The hybrid setup is seamless in operation operating primarily in front-drive and sending torque to the rear axle under hard acceleration or when there’s some slippage from the front wheels. The continuously variable transmission works well. Unlike CVTs mated to conventional engines that have a rubbery feel to acceleration and a constant drone at highway speeds, the electric motors do their part to mask these characteristics. See: The 15 best midsize SUVs of 2020 A new feature is the ability of the driver to sequentially select the level of regenerative braking via a gear lever switch. By increasing the level, the driver experiences the same kind of engine braking that a traditional drivetrain produces when downshifted on a downhill stretch. In standard highway cruising, all the powertrain’s torque is directed to the front wheels, while in slippery conditions, up to 80% can be sent to the rear axle. The Venza features three driving modes — Normal, Eco, and Sport. Sport mode sharpens throttle response, while Eco uses less aggressive mapping to boost mileage. An EV mode also enables the vehicle to operate in electric-only at low speeds for short distances. Also see: These 3 EVs are the lowest cost to own over 5 years Overall, the Venza is easy to drive, with light, precise steering, decent acceleration, and better than average fuel economy for a vehicle its size. It offers a comfortable, quiet cabin wrapped in a sporty exterior.Other cars to consider 2021 Honda Passport — This new 2-row entry in Honda’s lineup offers standard V6 power and a chassis tuned to do some off-roading. While it’s not as sleek as the Venza, its boxier design has a roomier cabin and greater cargo capacity. 2021 Chevrolet Blazer — Also relatively new to the scene is the Blazer. Like the Venza, it is a sportier-looking alternative to the larger 3-row Traverse. The Chevy also offers three powertrains, including an optional V6 along with a 9-speed automatic transmission. 2021 Ford Edge — The Edge has been around a lot longer than any other 2-row midsize SUVs, but even this old dog is learning new tricks. The Ford Edge ST boasts 400 horsepower from its turbocharged V6 and is the best in the segment when it comes to putting the sport in sport-utility. Used Lexus RX350 — Much of the new Venza’s appeal comes from its use of upscale materials and a quiet cabin. You can experience the same luxury from Toyota’s sister division Lexus in an RX350, which also comes in a 2-row 5-passenger configuration.Questions you may ask Where does the 2021 Venza slot in Toyota’s lineup? The 2021 Toyota Venza is a midsize 2-row crossover SUV that is positioned between the compact 2-row RAV4 and the midsize 3-row Highlander. Wasn’t there a Toyota Venza before? Yes, Toyota offered the Venza until 2015. A true crossover using a car platform, it was more of a tall station wagon than a traditional SUV. What competes with 2021 Toyota Venza? The Venza competes with the 2020 Chevrolet Blazer, 2020 Honda Passport, and 2020 Hyundai Santa Fe. It also rivals established models like the 2020 Ford Edge and 2020 Nissan Murano. What makes the 2021 Toyota Venza distinct? The 2021 Venza is available as a hybrid-only with all-wheel drive. Where is the 2021 Toyota Venza built? The Venza is built at Toyota’s Takaoka assembly plant in Toyota City.Autotrader’s advice The Venza is a welcome addition to the Toyota lineup for those who want the style and comfort of the Highlander but don’t need a third row. This reincarnation has a lot going for it, including its styling, standard AWD, and fuel-efficient hybrid powertrain. By putting style above function here, we’d recommend going with the Limited trim level to get all the goodies, including the 12.3-inch touchscreen, the larger wheels, and tires and the heated/ventilated front seats. he Star Gaze Panoramic roof is also a slick option, even though it doesn’t open, it will amaze your friends with the way it instantly switches from transparent to opaque. All that said, if you’re looking for more power, more space, or even better fuel economy, you might take a second look at either the Highlander or the upcoming RAV4 Prime, a plug-in hybrid that promises 42 miles of pure electric range. Check out: A first look at Toyota’s new RAV4 plug-in hybrid This story originally ran on Autotrader.com."}]}