{"article": [{"url": "https://www.marketwatch.com/story/forget-value-vs-growth-were-in-a-quarantine-vs-recovery-paradigm-now-this-analyst-says-11599750206", "published": 1599913400.0, "headline": "Forget value vs. growth. Weâ\u0080\u0099re in a quarantine vs. recovery paradigm now, this analyst says", "body": "Is Target, with its fun clothing and shiny new electronics, a consumer discretionary play, or a bet on consumer staples, because of its toothpaste and paper towels? paul j. richards/Agence France-Presse/Getty Images If youâ\u0080\u0099ve been struggling to make sense of markets in recent weeks, youâ\u0080\u0099re not alone. Investors seem to want to embrace a value tilt â\u0080\u0093 stocks that will do well as an economic recovery gathers steam â\u0080\u0093 but then fall back on the tried-and-true growth stocks that have done well so far, through more uncertain times. But what if those old â\u0080\u009cvalueâ\u0080\u009d and â\u0080\u009cgrowthâ\u0080\u009d frameworks are the wrong way to measure market moves? â\u0080\u009cThe recent market volatility is more about Quarantine vs. Recovery and Cyclicals vs. Defensives than Value vs. Growth,â\u0080\u009d argues Evercoreâ\u0080\u0099s Dennis DeBusschere in a Thursday note. Read: Donâ\u0080\u0099t assume this stock-market value rotation will stick, J.P.Morgan says Value stocks have traditionally belonged to sectors like retail, financials XLF, +0.11%, Â energy XLE, -1.59% Â and industrials XLI, +0.37%. And in past cycles, companies in areas like technology and consumer discretionary have typically been classified as growth plays. Those broad categories donâ\u0080\u0099t quite capture the current moment, though. In the past, for example, households and businesses may have opted to spend more on technology when the economy was picking up, and to tighten their wallets when things were getting slow. But now, the migration to work-from-home for so many people has changed that calculus. In fact, other than in technology â\u0080\u0093 which is likely to keep outperforming â\u0080\u0093 and financials, which are likely to stay depressed for some time, most stocks have attributes of both value and growth, DeBusschere points out, as seen in his chart, below. *** ONE-TIME USE *** â\u0080\u009cBroad economic reopening, positive COVID trends, and supportive monetary and fiscal policy will benefit a rotation into more economically sensitive stocks, but not necessarily out of the mega cap, cash-returning stocks that have led the S&P higher this year,â\u0080\u009d he wrote. Of course, for some investors, the best stocks may be the ones that straddle both worlds. Related: Wall Streetâ\u0080\u0099s road warriors have spent the past three months grounded. Howâ\u0080\u0099s that working out?"}]}