{"article": [{"url": "https://www.marketwatch.com/story/amazon-promised-to-spend-all-its-profit-but-pandemic-sales-grew-too-fast-and-it-still-earned-billions-2020-07-30", "published": 1596279980.0, "headline": "Amazon promised to spend its profit amid pandemic, but ended up with record earnings anyway", "body": "Amazon.com Inc. Chief Executive Jeff Bezos promised to spend expected profits amid a huge boost in sales related to the COVID-19 pandemic, but sales grew so fast that he ended up with record earnings instead. Amazon AMZN, +3.01% reported second-quarter profit of $5.2 billion, or $10.30 a share, Thursday afternoon, nearly doubling from $5.22 a share a year ago to a fresh quarterly record amid a huge boost in revenue. Amazon reported sales of $88.9 billion, up 40% from $63.4 billion a year prior and well ahead of Amazon’s prediction of $75 billion to $81 billion. Analysts on average had predicted earnings of $1.48 a share on sales of $81.45 billion. Three months ago, Bezos said that he expected to spend billions in expected operating profit that is flooding in as Americans sheltered-in-place due to the coronavirus pandemic purchase more goods online and businesses spend more on cloud computing to support workers stuck at home. “If you’re a shareowner in Amazon, you may want to take a seat, because we’re not thinking small,” Bezos said in May. Shareholders did not run away, however. Amazon’s stock has instead continued to run to record highs, gaining more than 24% in the past three months and pushing the company’s market capitalization higher than $1.5 trillion. Shares increased more than 4% in after-hours trading Thursday immediately following the release of the results and were up 6.3% premarket Friday. “This was another highly unusual quarter, and I couldn’t be more proud of and grateful to our employees around the globe,” Bezos said in Thursday’s announcement. “As expected, we spent over $4 billion on incremental COVID-19-related costs in the quarter to help keep employees safe and deliver products to customers in this time of high demand — purchasing personal protective equipment, increasing cleaning of our facilities, following new safety process paths, adding new backup family-care benefits, and paying a special thank-you bonus of over $500 million to front-line employees and delivery partners.” The gains in Amazon’s core business show why investors are sticking by Amazon, and more are joining them. The company said that its e-commerce business grew 47.8% from last year in the second quarter to revenue of $45.9 billion from $31.05 billion, while analysts were expecting $39.89 billion. In North America, net sales online and at physical Amazon stores such as its Whole Foods Markets grew to $55.44 billion from $38.65 billion a year ago, while sales overseas grew to $22.67 billion from $16.37 billion. Unit sales, which tracks the actual physical orders from Amazon, jumped 57% in the quarter, a sharp increase from growth of 18% in the year-ago quarter. In a conference call Thursday afternoon, Chief Financial Officer Brian Olsavsky noted that online grocery sales tripled in the quarter and worldwide video streaming doubled from a year ago. Amazon’s physical stores saw a 13% decline, however. Amazon Web Services, the company’s cloud-computing arm, saw revenue jump to $10.8 billion from $8.38 billion, while analysts on average were expecting $11 billion. As usual, AWS was the biggest profit driver for Amazon, delivering operating profit of $3.36 billion while Amazon reported overall operating income of $5.84 billion. Even before the pandemic, Amazon had been spending on ramping up its logistics operations to handle faster shipping for customers of its Prime subscription service, and COVID-19 has pushed that spending streak into hyperdrive. Amazon has now passed 1 million employees, Bezos revealed in planned testimony for a Wednesday antitrust hearing in front of a congressional subcommittee, though because many are still listed as temporary, Amazon reported the number as 876,800 Thursday. “Our combined number of regular and seasonal employees is currently over 1 million,” Olsavsky confirmed in prepared remarks Thursday. Amazon said it expects revenue to be between $87 billion and $93 billion in the third quarter, and learned from its previous guidance to expect profit, forecasting operating income of $2 billion to $5 billion even as it accounts for $2 billion in costs related to COVID-19. Amazon typically hosts its Prime Day sale in the third quarter, but Olsavsky announced in his conference call Thursday that Prime Day will now be scheduled for the fourth quarter in all areas except India, where it will take place in August."}]}