{"article": [{"url": "https://www.marketwatch.com/story/unity-stock-surges-in-ipo-debut-this-is-not-a-normal-company-ceo-says-11600446186", "published": 1600450640.0, "headline": "Unity stock surges in IPO debut: 'This is not a normal company,' CEO says", "body": "Unity Software Inc. Chief Executive John Riccitiello rings the opening bell at the New York Stock Exchange remotely from the company's San Francisco headquarters Friday morning. “The virtual bell ringing is a manifestation of the world moving to real-time interactive 3-D,\" he told MarketWatch. NYSE The software IPO market remained hot Friday as Unity Software Inc. shares headed higher in their public debut. Shares of Unity U, +8.43% opened at $75 in Friday morning trading, up 44% from its initial-public-offering price of $52 a share, which itself came above a raised expected range of $44 to $48 a share. The first trade was executed for 3.36 million shares at 11:55 a.m. ET. Shares pulled back a bit but still ended their first trading session up 31.4% at $68.35. Unity, which makes software tools used by videogame designers, raised at least $1.3 billion at a valuation of $13.7 billion through the offering by selling 25 million shares. Underwriters have the option to purchase about 3.8 million additional shares, which could increase the amount that Unity rakes in from its public-market debut. The company fetched a $6 billion private-market valuation back in July 2019. Unity Software IPO: 5 things to know about the videogame-engine company An IPO in the grips of a pandemic presented a \"parallel universe\" for Chief Executive John Riccitiello and his executive team. Rather than standing at the bell-ringing platform at the New York Stock Exchange with a few members of his team, the 61-year-old veteran executive who cut his teeth at Electronic Arts Inc. EA, +1.15% had to pivot. What his company came up with was a virtual bell ringing, in which the faces of the company's 3,700 employees were superimposed at the NYSE platform. \"The virtual bell ringing is a manifestation of the world moving to real-time interactive 3-D,\" he said. Unity is calling its offering a \"UPO,\" which the CEO said is illustrative of its egalitarian corporate culture. \"It was designed from the ground up, to reflect what we do as a company,\" Riccitiello told MarketWatch. \"This is not a normal company. We are building a broad platform at the individual level. Hundreds of people here make consequential decisions.\" See also: Will videogames be the Achilles heel for Apple, Google in antitrust investigations? Unity has seen growing revenue and widening losses while catering mainly to smaller and midsize game developers. The company generated $541.8 million in revenue for 2019, up from $380.8 million a year earlier, while posting a net loss of $163.2 million. That compared with a net loss of $131.6 million for 2018. \"We expect the public markets will find the 'theme' and scarcity value of the stock alluring-the chance to participate in the global growth of the end market of videogaming, without having to take the creative risk on any particular game, studio, or publisher,\" Bernstein analyst Todd Juenger wrote in a note to clients ahead of the offering, though he worried about commoditization potential for Unity's Operate segment, which offers monetization tools like the ability for publishers to sell advertising inventory. Unity went public in what was expected to be the busiest week for initial public offerings since May 2019, when Uber Technologies Inc. UBER, -0.18% made its debut. Snowflake Inc. SNOW, -0.91% produced the largest software offering in history earlier in the week, and JFrog Ltd. FROG, +0.85% and Sumo Logic Inc. SUMO, +0.33% also went public. Don't miss: IPO like it's 1999 - Market hitting dot-com-boom levels Unity's offering comes as the Renaissance IPO ETF IPO, +1.98% has gained 58% on the year and as the S&P 500 SPX, +0.87% has added about 3% in that span."}]}