{"article": [{"url": "https://www.marketwatch.com/story/trump-floats-pausing-student-loan-payments-for-additional-periods-of-time-11596209113", "published": 1596288560.0, "headline": "Trump interested in extending suspension of student-loan payments as advocates warn: 'Economic crisis has no end in sight'", "body": "In a briefing Thursday, President Donald Trump said he was looking to pause student-loan payments for additional time. (Photo by Alex Wong/Getty Images) Alex Wong/Getty Images President Donald Trump is considering extending the pandemic-related pause on student-loan collections and payments Thursday, just days after Senate Republicans released a stimulus bill that would allow these activities to resume on Oct. 1. \"We also suspended student-loan payments for six months,\" Trump told reporters Thursday, \"and we're looking to do that additionally, and for additional periods of time.\" In March, Trump used his executive authority during a national emergency to waive interest on federal student loans. Later that month, Congress passed the CARES Act, which paused payments and collections on federal student loans and set their interest rate to 0% for six months. If the government doesn't take action, the CARES Act pause will end on Sept. 30 - about a month before the presidential election - and payments and collections on student loans will resume. Consumer advocates have worried that given the continued economic downturn, borrowers aren't ready to resume making payments. In addition, they've warned that the student-loan system isn't ready for the likely flood of requests borrowers will be making to their student-loan companies to move to more affordable repayment plans. Advocates criticize Republicans' stimulus proposal The stimulus bill Senate Republicans released Monday, titled the HEALS Act, includes provisions that would cut down on the number of student-loan repayment plans available permanently, with the goal of streamlining the system. As part of the plan, borrowers who aren't making any money wouldn't have to make student-loan payments, an option that is already available to federal student-loan borrowers under the current system. Borrower advocates criticized the bill, saying it doesn't provide the relief borrowers need during this time, and that in some ways, it's worse than what's already available. A group of 56 consumer-advocacy groups wrote to Senate leaders this week calling on lawmakers to extend the CARES Act payment pause for at least one year. They also asked Congress to expand eligibility for the payment pause to include borrowers who graduated in 2020 and the estimated 9 million borrowers with certain types of federal student loans who were left out of the initial CARES Act payment pause. \"Given that the current health and economic crisis has no end in sight, Congress should provide real relief for student borrowers and work to strengthen borrower protections, not roll them back,\" the letter reads. Democrats released their own proposal in May The HEROES Act, the stimulus bill passed by the Democratic-led House of Representatives in May, included a provision to cancel $10,000 in student debt for economically distressed borrowers and extended the CARES Act payment pause until Sept. 30, 2021. At the time, some borrower advocates criticized the debt-cancellation provision, arguing that it didn't go far enough. In their letter, advocates reiterated their call for student-debt forgiveness to be included in a coronavirus relief package. \"Any modification should be paired with retroactive action cancelling loan balances and freeing capital for millions of people being held back by their student loan debts,\" they wrote. Momentum has been building over the past few years to broadly cancel student debt as a way to boost the economy and narrow the racial wealth gap, among other goals. Both Sen. Bernie Sanders, a Vermont independent, and Sen. Elizabeth Warren, a Massachusetts Democrat, proposed broadly canceling student debt as part of their presidential campaigns. Warren repeated that call in a July New York Times op-ed outlining her priorities for coronavirus relief. Former Vice President Joe Biden, the presumptive Democratic nominee for president, has endorsed the idea of offering up to $10,000 in student-debt cancellation per borrower."}]}