{"article": [{"url": "https://www.marketwatch.com/story/biden-to-address-how-hed-fight-systemic-racism-2020-07-28", "published": 1595952980.0, "headline": "Biden vows investment in Black-owned businesses as he unveils plan to fight systemic racism", "body": "Joe Biden on Tuesday unveiled a plan to fight systemic racism as president, calling for investment in Black-owned businesses and affordable housing. With racial-justice issues a major theme in the presidential campaign, the former vice president used a speech in Wilmington, Del., to detail the newest part of his “Build Back Better” plan. It includes pressing the Federal Reserve to address racial economic gaps as part of its mission. “We’re going to strengthen the Federal Reserve’s focus on racial economic equity,” he said. “The Fed should add to that responsibility and aggressively target persistent gaps,” Biden added. iframe.twitter-tweet { width: 100% !important; } The Democratic candidate is promising to dramatically spur investment in Black-owned small businesses and encourage homeownership while closing wealth gaps among minority communities. Now see: Joe Biden wants a $15 minimum wage — will the coronavirus pandemic make that more likely? Biden wants to take $30 billion, or 10% of federal investment he’s already promised as part of larger economic plans, and funnel it into a “Small Business Opportunity Fund” designed to leverage $5 of private investment for minority-owned enterprises for each $1 in public funds allocated. The former vice president also plans to spend $50 billion to provide startup capital that can help entrepreneurs of color start businesses in disadvantaged areas. Last week, Biden called President Donald Trump the first racist to become president. Trump campaign adviser Katrina Pierson shot back that the president “loves all people” and said “no one should take lectures on racial justice from Joe Biden.” Biden on Tuesday said Trump is “determined to stoke division and chaos. It’s not good for the country, but Donald Trump doesn’t care. His campaign is failing and he’s looking for a political lifeline.” Biden has previously announced plans to boost manufacturing, fight climate change and improve child care and elder care. Also read:As Biden says four Black women are on his VP list, here’s who he could choose. The Associated Press contributed to this article."}]}