{"article": [{"url": "https://www.marketwatch.com/story/wirecard-shares-plunge-after-saying-auditor-cant-find-billions-of-missing-cash-2020-06-18", "published": 1592480720.0, "headline": "Wirecard shares plunge after saying auditor canâ\u0080\u0099t find billions of missing cash", "body": "Shares in Wirecard lost nearly two-thirds of their value as the German payment processor said on Thursday its auditor canâ\u0080\u0099t find evidence for a quarter of the cash on its balance sheet. Wirecard WDI, +0.14% Â WCAGY, +2.06% Â shares close 63% lower as the firm said Ernst & Young said it didnâ\u0080\u0099t have sufficient audit evidence for â\u0082¬1.9 billion euros in cash. â\u0080\u009cThere are indications that spurious balance confirmations had been provided from the side of the trustee,â\u0080\u009d the company said. â\u0080\u009cPreviously issued confirmations by the banks were no longer recognized by the auditor. All parties involved are endeavoring to clarify the matter as quickly as possible,â\u0080\u009d said Markus Braun, Wirecard chief executive, in a statement. â\u0080\u009cIt is currently unclear whether fraudulent transactions to the detriment of Wirecard AG have occurred.â\u0080\u009d Wirecard said the banks managing the escrow accounts are two Asian banks that have investment grade ratings. The trustee, who has been in office since 2019, holds numerous mandates in Asia, Wirecard said. The DAX DAX, +0.06% Â component postponed its 2019 annual financial statements for a fourth time, and if not completed by Friday, some â\u0082¬2 billion of loans can be terminated. It is the latest twist in a long-running saga. The Financial Times reported in October that Wirecard staff appeared to have conspired to fraudulently inflate sales and profit at subsidiaries. Wirecard has denied those charges, while KPMG has conducted a special investigation and said it couldnâ\u0080\u0099t prove the revenue of its third-party acquiring business. Many short-sellers had bet against the company, including Marshall Wace and TCI Fund Management, according to regulatory disclosures. â\u0080\u009cEven today Wirecardâ\u0080\u0099s long standing CEO Marcus Braun has brazenly tried to portray the company as a victim of fraud and instead tried to focus investors on apparently strong reported revenue growth,â\u0080\u009d said Barry Norris, manager of the Argonaut Absolute Return Fund, who said the stock was his biggest short position. â\u0080\u009cDuring our first-quarter conference call we previously described the company as â\u0080\u0098having more red flags than you would see at a communist rally.â\u0080\u0099â\u0080\u009d Wolfgang Donie, an analyst at NordLB, cut the stockâ\u0080\u0099s rating to sell from hold, and his target price to 20 euros from 80 euros, saying the new allegations are leading to an â\u0080\u009cexistential crisis.â\u0080\u009d Germanyâ\u0080\u0099s stock-market regulator separately is investigating Braun over insider-trading allegations. Braun held 7% of the stock, according to FactSet data, making him the largest shareholder."}]}