{"article": [{"url": "https://www.marketwatch.com/story/wisconsin-republican-ron-johnson-on-defensive-over-probe-of-biden-and-ukraine-in-wake-of-intelligence-assessment-on-ongoing-russian-election-interference-2020-08-13", "published": 1597392200.0, "headline": "Wisconsin Republican Ron Johnson on defensive over probe of Biden and Ukraine in wake of intelligence assessment about ongoing Russian election interference", "body": "WASHINGTON (AP) — Even before last week’s intelligence assessment on foreign election interference, Republican Sen. Ron Johnson was facing criticism from Democrats that his investigation of presidential candidate Joe Biden and Ukraine was politically motivated and advancing Russian interests. But the stark warning that Russia is working to denigrate the Democratic presidential candidate adds to questions about the probe by Johnson’s Senate committee and whether it is mimicking, even indirectly, Russian efforts and amplifying its propaganda. The investigation is unfolding as the country, months removed from an impeachment case that had centered on Ukraine, is dealing with a pandemic and confronting the issue of racial injustice. Yet allegations about Biden and Ukraine remain a popular topic in conservative circles, pushed by Russian media and addressed regularly by President Donald Trump and other Republicans as a potential path toward energizing his supporters. Johnson’s own interest in the topic, from his perch as chairman of the Senate Homeland Security and Governmental Affairs Committee, has drawn concerns during a presidential election that U.S. intelligence officials warn is ripe for foreign disinformation. “Particularly as a public official and somebody who’s responsible for keeping the country safe, you should always be suspicious of narratives that are trying to sort of damage or target the electoral process in your country,” said former CIA officer Cindy Otis, a foreign disinformation expert and vice president of analysis at Alethea Group. “You should always be suspicious of narratives that foreign countries are pumping out.” The intelligence assessment has put Johnson on the defensive, with the Wisconsin Republican issuing a 5,000-word open letter Monday in which he laid out what he said was the basis for scrutinizing both the FBI’s Russia investigation and the dealings of Biden and his son Hunter with Ukraine. See:Wisconsin lawmaker’s Homeland Security and Governmental Affairs Committee is one of multiple Republican-led Senate panels scrutinizing the FBI’s investigation into ties between the Trump campaign and Russia Sen. David Perdue, R-Ga., speaks to Sen. Ron Johnson, R-Wis., before a Senate Foreign Relations committee hearing last month. Associated Press In an interview Wednesday, Johnson said his investigation was rooted in facts, not Russian propaganda, and that the “American people deserve the truth” about his probe and what he said were its damning findings. He said he hoped to get the information out, in report form, before November’s vote. Johnson said that though he was sensitive to the threat of Russian interference, he was not responsible for peddling any disinformation in his investigation and described as “completely false” the idea that he is pushing foreign propaganda. “I completely reject this entire narrative, this coordinated attack on me,” he said. “It’s ridiculous if it weren’t so serious.” The statement last Friday from William Evanina, the government’s top counterintelligence official, made no reference to Johnson in particular but did allude to foreign efforts to smear Biden that in some ways parallel Johnson’s own probe. That includes the work of Andrii Derkach, a member of Ukraine’s parliament and 1993 graduate of a Russian spy academy, who has disclosed leaked recordings of Biden meant to cast the candidate in a negative light. Johnson suggested he was not willing to unequivocally trust the assessment without seeing the underlying intelligence. In his open letter, he distanced himself from Derkach, saying he had never received any information from him and “almost all of the documents we are seeking and will make public are from U.S. sources.” But, Otis said, given how easily Russia launders its information, and how swiftly material originating in Russia can get picked up and spread to English-language forums, “it is very difficult to peel back the origination point for this stuff, even with the aid of having technology on our side.” Johnson’s preoccupation with Biden has dismayed Democrats on the committee who view it as a politically motivated distraction at a time when the panel, which oversees the response to national disasters, should be focused on the coronavirus outbreak. “At this moment when Americans need us to work together, this extremely partisan investigation is pulling us apart,” Sen. Gary Peters of Michigan, the committee’s top Democrat, said at a May 20 meeting at which the panel authorized a subpoena related to the Biden investigation. Democratic Sen. Kamala Harris of California, now Biden’s running mate, at the same session accused Johnson of shirking his oversight responsibilities related to the pandemic response in favor of forcing a vote on “a purely political matter that will do absolutely nothing for those at risk of contracting COVID-19.” Johnson said those attacks were unfair because his committee has taken up multiple pandemic-related bills and devoted most of its time to the outbreak. Saying that “a couple of investigators” were devoted to the Ukraine probe, he added, “We literally can chew gum and walk at the same time.” Democrats have repeatedly sounded the alarm about the committee’s work, including by requesting briefings from law enforcement and intelligence officials, given the extent of Russia’s own interest in pushing the anti-Biden narrative. Central to that narrative are allegations that Hunter Biden used his influence with his father to aid a Ukrainian natural gas company, Burisma, and that Joe Biden, as vice president, pressured the Ukrainian government to fire its top prosecutor, who had led an investigation into Burisma. Hunter Biden, with no expertise in the country or the natural gas industry, had joined the Burisma board in 2014 during the latter part of his father’s tenure in the Obama administration. Biden has said he never speaks to his son about his overseas business dealings. His position on Ukraine’s prosecutor, who was seen by critics as soft on corruption, was the official position of the U.S. government and was also supported by other Western governments and many in Ukraine. Evanina said Russia disapproved of Biden because of his role in shaping Obama administration policies supporting Ukraine and opposing Russian leader Vladimir Putin. Though the allegations of corruption have not been substantiated, they have long been of interest to Trump. His request last year to Ukraine’s president that he announce an investigation of Burisma and the Bidens, tying it to U.S. support of the fledgling democracy, formed the basis of the impeachment case against him. In the Senate, the Johnson-led investigation has proceeded this election year, but with some delay. In May, the committee authorized a subpoena for Blue Star Strategies, a lobbying firm that was a consultant to Burisma. But just months earlier, Johnson postponed a vote on a subpoena to interview and obtain documents from Andrii Telizhenko, a consultant to Blue Star, “out of an abundance of caution” after committee staff received a classified briefing. Johnson, meanwhile, announced this week a subpoena for the FBI for documents in its investigation into the Trump campaign and Russia. His committee isn’t the only one undertaking such a probe. Sen. Lindsey Graham, R-S.C., a Trump ally and chair of the Senate Judiciary Committee, has for months scrutinized the Russia investigation. He has released a series of previously secret documents, most targeting the legitimacy of a dossier of research on Trump’s ties to Russia compiled by a British ex-spy that was financed by a conservative organization and later, in the run-up to the 2016 general election, Democrats."}]}