{"article": [{"url": "https://www.marketwatch.com/story/covid-19-turned-the-hotel-industry-upside-down-but-it-wont-change-what-people-want-2020-08-23", "published": 1598857400.0, "headline": "COVID-19 hit the hotel industry hard. Hereâ\u0080\u0099s how hotels are pivoting in the new reality", "body": "MarketWatch photo illustration/iStockphoto This article is part of a series tracking the effects of the COVID-19 pandemic on major businesses, and will be updated. The COVID-19 pandemic shook the lodging industry particularly hard, and turned many hotel businesses upside down. But, like a shaken snow globe, the post-COVID-19 landscape may be as good or even better than before the pandemic â\u0080\u0094 because people are, and will always be, social animals. And whether they prefer a big-city hotel run by a global chain, a lodge at a ski resort, or a quiet bed-and-breakfast, people will always want to â\u0080\u009cget away.â\u0080\u009d Hotels will first have to focus on cleanliness and safety certifications, and technology will be a big part of how that is achieved, said Gilda Perez-Alvarado, chief executive for the Americas at JLL Hotels and Hospitality Group. â\u0080\u009cPre-COVID, all these tech features were offensive in nature,â\u0080\u009d Perez-Alvarado said. â\u0080\u009cTheyâ\u0080\u0099re defensive now. You better get on it.â\u0080\u009d As data from travel advertising technology company Koddi show, safety matters: Koddi But eventually, that might change, as people will likely start refocusing on convenience, if they havenâ\u0080\u0099t already. Basically, what COVID-19 did was remind those in the hotel business of a fundamental business principle: Listen to the customer. â\u0080\u009cMaking the guest feel comfortable, no matter the situation, is and always will be the aim of a hotel and its staff,â\u0080\u009d said Terry King, a regional director at the technology, security and investigative consulting firm Guidepost Solutions.The knockdown punch Itâ\u0080\u0099s easy to quantify how hard the pandemic hit the largest hotel chains, as S&P 500 index SPX, +0.87% Â components like Hilton Worldwide Holdings Inc. HLT, -1.26% Â and Marriott International Inc. MAR, -0.96% Â have to publicly disclose quarterly results. For Hilton, which offers nearly a million rooms in more than 6,200 properties across 118 countries, second-quarter revenue per available room â\u0080\u0094 or RevPAR, a key financial metric in the hotel industry â\u0080\u0094 tumbled 81% from the same period a year ago, as the company swung to a net loss of $430 million from net income of $260 million. As travel restrictions and lockdown measures spread across the globe, Hilton was forced to play defense, by temporarily closing hotels, furloughing employees, cutting salaries and other costs, and borrowing money to provide some financial breathing room. â\u0080\u009cNever in Hiltonâ\u0080\u0099s 101-year history has our industry faced a global crisis that brings travel to a virtual standstill,â\u0080\u009d Chief Executive Christopher Nassetta said in June. The pandemic hit other places differently, but it hurt just as much, if not more. Jeff Bay, managing director of HayMax Capital LLCâ\u0080\u0099s HayMax Hotels, which operates four boutique hotels in Aspen, Colo., and Sun Valley, Idaho, said at first the pandemic seemed like something that would affect the big cities, and smaller cities might be spared. But then ski resorts were required to cease operations. â\u0080\u009cAll of a sudden, it became glaringly obvious that we would be impacted,â\u0080\u009d Bay told MarketWatch. â\u0080\u009cOur primary driver of business had been removed, and our world as we knew it had been turned completely upside down.â\u0080\u009d The pandemicâ\u0080\u0099s punch also reached those in more remote locations. At the 257-year-old Historic Smithton Inn, with seven rooms and a guesthouse in Ephrata, Penn., in Pennsylvania Dutch Country, the old-school way of doing business stopped, and owner and innkeeper Rebecca Gallagher looked for something new to survive. â\u0080\u009cMoney was coming in one way before, [and] I realized it canâ\u0080\u0099t come in that way anymore,â\u0080\u009d Gallagher said. â\u0080\u009cI had to duck and roll.â\u0080\u009dHow a centuries-old inn ducks and rolls Before Gallagher could figure out how to survive the damage COVID-19 was exacting on her business and community, her first thought was preservation. In other words, she had to duck. â\u0080\u009cIf you canâ\u0080\u0099t make money, you have to save money,â\u0080\u009d Gallagher said. She mows the lawn herself now, and is still doing the payroll. At the same time, Gallagher applied for every grant, aid program and loan available to small businesses, so she could roll with any opportunity that presented itself. She was approved for a Small Business Administration disaster loan. â\u0080\u009cEvery crisis has an opportunity, if youâ\u0080\u0099re able to see it when it happens,â\u0080\u009d Gallagher said. â\u0080\u009cTry to keep your eyes open ... [asking] how am I going to pivot?â\u0080\u009d And then the opportunity came. Pennsylvania shut down liquor stores, but that didnâ\u0080\u0099t mean alcoholic beverages couldnâ\u0080\u0099t be sold. The Historic Smithton Inn had a wine bar. There had never before been any reason, or method, to sell the wine curbside or to-go â\u0080\u0094 till now. With help from point-of-sale technology already in use, she was able to create e-commerce sites within hours of hearing that liquor stores were closed, to sell not just her wine but also branded sheets, candles and soaps, figuring people may want a piece of the vacation they could no longer take. “ â\u0080\u0098Even though this terrible thing happened, thereâ\u0080\u0099s a sense of hope that 20 years from now, something good will have come of it.â\u0080\u0099 ” â\u0080\u0094 Rebecca Gallagher, Historic Smithton Inn Although revenue was still much less than pre-pandemic levels, Gallagher said it was â\u0080\u009cpsychologically awesomeâ\u0080\u009d because, by acting quickly, she was able to create new ways to make money. â\u0080\u009cWe were still making less money than before the shutdown, but I was busy,â\u0080\u009d Gallagher said. â\u0080\u009cIt helped my stomach from being queasy. I felt like I was doing something.â\u0080\u009d As lockdown measures started to ease, she saw another opportunity, but also a problem. She saw evidence that a â\u0080\u009cwork-cationâ\u0080\u009d trend was emerging, but, given that the walls of the inn were 18 inches thick, her Wi-Fi wasnâ\u0080\u0099t robust enough for coverage in all rooms. Gallagher used the money from the SBA disaster loan to hardwire every room with internet access and invest in larger, smart TVs. She also bought smaller individual coffee pots for each table in the dining area, since the bigger, public coffee urn could no longer be used. And she bought plate covers and trays, so she could deliver food to rooms for people who wanted to remain socially distanced. Two electric-vehicle chargers are now available, one an 80-amp Tesla TSLA, +1.89% Â Supercharger and the other a 32-amp Clipper Creek universal charger, free of charge to guests. Historic Smithton Inn Although the innâ\u0080\u0099s e-commerce business slowed as lockdown measures eased, different revenue streams started to flow, ones that can be expected to last a lot longer. So sheâ\u0080\u0099s starting to spend on marketing again. Gallagher said her inn has in the past appealed mainly to people in their 50s, 60s and 70s. â\u0080\u009cNow, they are much younger than they used to be.â\u0080\u009d And before, the typical guest would travel from relatively greater distances and would only stay for two nights. â\u0080\u009cNow, weâ\u0080\u0099re seeing people not from as far away, but they are staying longer,â\u0080\u009d Gallagher said. With the new room upgrades, she can even consider marketing to guests wanting to work for a day, but not stay the night. But with all the changes that have happened so far, she could see that one important thing hasnâ\u0080\u0099t changed. â\u0080\u009cPeople want to be safe and social distance, but they still want to be around people,â\u0080\u009d Gallagher said. â\u0080\u009cI have not had anyone take me up on delivering food to their rooms.â\u0080\u009dNo resort is an island HayMax Hotelsâ\u0080\u0099 Bay found different ways to deal with different issues, while focusing on the same principle: Respond quickly to what the customer wants. â\u0080\u009cBecause of the situation, the consumerâ\u0080\u0099s voice is louder and easier to hear, and weâ\u0080\u0099re forced to react to it,â\u0080\u009d Bay said. First was to help guests feel more safe and secure when they entered the hotels, by making the check-in process more efficient. HayMax quickly invested in technology so door locks could accept digital keys. â\u0080\u009cIt was technology we kicked the tires on about a year ago,â\u0080\u009d Bay said. â\u0080\u009cIt was hugely accelerated because of COVID-19.â\u0080\u009d There was an unexpected benefit: Something that was implemented for safety reasons was, all of a sudden, a nice convenience that guests appreciated. â\u0080\u009cThe public wanted many of these things for many years, but the hotel industry was slow to adopt them,â\u0080\u009d he said. â\u0080\u009cThe old days of checking in at the front desk and ringing the bell are kind of nostalgic.â\u0080\u009d But as safety protocols helped ease some fears of infection, the guestsâ\u0080\u0099 worries started to shift. People were becoming more concerned about going to a place where they felt the community as a whole was practicing safety protocols rather than individual hotels, Bay said. That helped bring his focus back to the fact that people go to resort hotels for different reasons than a bed-and-breakfast, or a hotel in a big city. â\u0080\u009cPeople donâ\u0080\u0099t come to Aspen to stay at our lodge,â\u0080\u009d Bay said. â\u0080\u009cItâ\u0080\u0099s a foundation for people to enjoy the area.â\u0080\u009d The good thing was that other area businesses quickly refocused on the same thing. So rather than adopt an â\u0080\u009cisland mentality,â\u0080\u009d the community came together to set up a lodging task force, said Bay. â\u0080\u009cThere was a great sense of cooperation [among] the retail community, the lodging community and the local government,â\u0080\u009d Bay said. The thought being: â\u0080\u009cIf we canâ\u0080\u0099t get people to come back to Aspen as a whole, none of us will be successful.â\u0080\u009d Itâ\u0080\u0099s been working, because Bay said the hotels were seeing an exponential increase in demand, with people wanting to stay longer than originally planned. â\u0080\u009cWeâ\u0080\u0099re seeing a lot of â\u0080\u0098within-stayâ\u0080\u0099 extensions,â\u0080\u009d Bay said. â\u0080\u009cWeâ\u0080\u0099re seeing people who book for two nights end up staying for four.â\u0080\u009dHilton gets back to basics The pandemic was always going to affect Hilton in very different ways than it affected a ski lodge or a bed-and-breakfast. But thereâ\u0080\u0099s one commonality: It is still about people. â\u0080\u009cMore than ever, itâ\u0080\u0099s about focusing on the basics,â\u0080\u009d said Phil Cordell, global head of lifestyle brands and new brand development at Hilton Worldwide Holdings Inc. â\u0080\u009cWhat does the guest want?â\u0080\u009d For Hilton, the technology others have recently invested in has been available for several years. Members of the hotel chainâ\u0080\u0099s loyalty program already had the ability to check in digitally and access digital keys, and they can choose the room they want to stay in. So Hilton started focusing on making sure customers could trust the entire brand, and not just each individual hotel, to be clean and safe. So the company announced working relationships with other trusted brands like Reckitt Benckiser Group PLCâ\u0080\u0099s RBGLY, +0.82% Â RB, +0.48% Â Lysol and Dettol, and with the Mayo Clinic. â\u0080\u009cCleanliness has always been implied and behind the scenes, but not always advertised and celebrated,â\u0080\u009d Cordell said. Next is to think of new ways to demonstrate hospitality, as the traditional methods may no longer work in the current environment, given that a global hotel brandâ\u0080\u0099s bread and butter â\u0080\u0094 business travel and events â\u0080\u0094 may never return to pre-pandemic levels with the proliferation of videoconferencing and growth in working from home. Cordell said that could mean providing hybrid work environments, leaning into the local community and staycation customers. â\u0080\u009cNecessity is the mother of invention,â\u0080\u009d Cordell said. â\u0080\u009c[W]hat happens in the room might be different. Rooms may not just be for sleeping.â\u0080\u009d Hilton may also have to reconsider how its loyalty programs are used. Len Covello, chief technology officer at the loyalty-rewards-program technology company Engage People, said that when the pandemic first hit, a lot of companies went on the defensive and let redemption options disappear. Now, theyâ\u0080\u0099re moving into customer-acquisition mode again. â\u0080\u009cTheyâ\u0080\u0099re going to have to innovate their programs to attract customers,â\u0080\u009d Covello said. â\u0080\u009cTheyâ\u0080\u0099re removing restrictions, removing cancellations.â\u0080\u009dCOVID-19 as a kick-start As disruptive as COVID-19 has been for the hotel industry, the ultimate effect will be to speed up the evolutionary process. In many cases, the cure for COVID-19 was already there; hotels just needed something to accelerate its adoption. â\u0080\u009cThere are things coming into place now that were talked about at conferences four and five years ago,â\u0080\u009d said John Niser, director of the International School of Hospitality and Tourism at Fairleigh Dickinson University. â\u0080\u009cThis has just kicked them in the butt, basically.â\u0080\u009d Itâ\u0080\u0099s like the work-from-home trend, which was emerging among many workforces before COVID-19. Many companies were reluctant to let the trend grow, however, without first knowing how it would affect productivity. But after several productive months of remote work, the hotel industry saw a huge opportunity, now and post-COVID. â\u0080\u009cWeâ\u0080\u0099ve witnessed a surge of â\u0080\u0098work from hotelâ\u0080\u0099 bookings â\u0080\u0094 from 12% pre-pandemic, to over 30% of our bookings now,â\u0080\u009d said Yannis Moati, CEO of the hotel booking platform HotelsByDay. â\u0080\u009cWe see a really massive opportunity for hotels to leverage their core competency â\u0080\u0094 providing memorable experiences in spaces that adhere to safety and cleanliness standards â\u0080\u0094 into a larger addressable market than ever before.â\u0080\u009d The ability to see these trends as they emerge, while being nimble and bold enough to move quickly to ride a trend as it starts, wonâ\u0080\u0099t only provide hotels with a path to survival, but allow them to emerge stronger than they were pre-pandemic. As Historic Smithton Innâ\u0080\u0099s Gallagher said, â\u0080\u009cEven though this terrible thing happened, thereâ\u0080\u0099s a sense of hope that, 20 years from now, something good will have come of it.â\u0080\u009d"}]}