{"article": [{"url": "https://www.marketwatch.com/story/stanley-druckenmiller-says-stock-market-is-in-an-absolute-raging-mania-and-fears-fed-raised-risk-of-inflation-and-deflation-11599657928", "published": 1599644000.0, "headline": "Stanley Druckenmiller says stock market is in â\u0080\u0098an absolute raging maniaâ\u0080\u0099 and fears Fed raised risk of inflation and deflation", "body": "A day after the highflying Nasdaq Composite index tumbled to its fastest correction from a record in history, Stanley Druckenmiller has some thoughts to share. “ â\u0080\u0098Right now, weâ\u0080\u0099re in an absolute raging mania.â\u0080\u0099 ” â\u0080\u0094 Druckenmiller The famed former hedge-fund manager, who with George Soros famously broke the Bank of England by shorting the pound in 1992, told CNBC in an interview on Wednesday that the Federal Reserve has inspired a â\u0080\u009cbig partyâ\u0080\u009d in financial markets that has powered the stratospheric climb for U.S. stocks which he says eventually leads to a â\u0080\u009changover.â\u0080\u009d Some signs of that hangover were on display on Tuesday when the Nasdaq COMP, +1.39% tumbled by 10% from its Sept. 2 record high, meeting the commonly used definition for a correction. Technology stocks have been at the vanguard of the rally in U.S. equities since the lows seen in March after the coronavirus pandemic first hit and the tech-heavy Nasdaq has led the recovery among stock benchmarks, outstripping the performance of the Dow Jones Industrial Average DJIA, +0.56% and the S&P 500 index SPX, +0.87%. Read: Why Stanley Druckenmiller says the risk-reward of investing in stocks has never been worse Some semblance of a rebound was taking shape early Wednesday but Druckenmiller says that the Fed may have set the stage for the possibility of surging inflation or deflation as it changes its policy framework to allow for average-inflation targeting. â\u0080\u009cLook what theyâ\u0080\u0099re risking in terms of financial stability to get that 2% markâ\u0080¦and my own sort of central case, for the first time in a long long time, Iâ\u0080\u0099m actually worried about inflation,â\u0080\u009d Druckenmiller said. The chairman and chief executive of Duquesne Family Office says he thinks that the current stance of the Fed is â\u0080\u009cdangerous.â\u0080\u009d â\u0080\u009cWe actually have the chairman of the Federal Reserve with a $3.5 trillion deficit out lobbying Congress to do more spending and then guaranteeing those of us on Wall Street that heâ\u0080\u0099ll underwrite it,â\u0080\u009d he told the business network. â\u0080\u009cI think itâ\u0080\u0099s dangerous. I think we could easily see 5 to 10% inflation in the next four or five years. Ironically, I also think heâ\u0080\u0099s raised the risk of deflation becauseâ\u0080¦everyone was proceed by an asset bubble and heâ\u0080\u0099s created this massive asset bubble.â\u0080\u009d See: Investing legend known for his annual predictions says the world could be in for a big surprise â\u0080\u0094 in a good way Check out: Why an approved coronavirus vaccine may not end the pandemic quickly"}]}