{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-head-for-a-second-straight-decline-as-covid-19-cases-rise-11601470125", "published": 1601479400.0, "headline": "Oil prices settle higher as U.S. supplies fall a third week", "body": "U.S. oil futures settled higher Wednesday after U.S. government data showed a third consecutive weekly decline in domestic crude supplies. Prices, however, still suffered their first monthly decline since April as concerns persist about the global economic outlook and its impact on demand. The Energy Information Administration reported Wednesday that U.S. crude inventories fell for a third straight week, down by 2 million barrels for the week ended Sept. 25. That compared with an average climb of 1.9 million barrels expected by analysts polled by S&P Global Platts, while the American Petroleum Institute on Tuesday had reported a fall of 831,000 barrels. The data revealed an unexpected draw in crude oil, but traders should “definitely take note of the large build” at the trading hub in Cushing, Okla., Tariq Zahir, managing member at Tyche Capital Advisors, told MarketWatch. The EIA data showed crude stocks at the Cushing, Okla., storage hub rose by 1.8 million barrels for the week. Overall, the risk for oil prices is to the downside, with another wave of the coronavirus impacting demand as the market goes through the fourth quarter, said Zahir. “Couple that with additional supply that has come back to the market from Libya,” following the recent lift of a months-long blockade on crude exports. West Texas Intermediate crude for November delivery CLX20, -1.62% CL.1, -1.62% rose 93 cents, or 2.4%, to settle at $40.22 a barrel on the New York Mercantile Exchange. Prices based on the front-month contracts saw monthly fall of 5.6%, but ended 2.4% higher for the quarter, according to Dow Jones Market Data. They had posted gains in each of the last four months. The December Brent crude contract BRNZ20, -0.07%, which became the front month at the end of the session, tacked on 74 cents, or 1.8% at $42.30 an ounce. November Brent crude UK:BRX0, which expired at the end of the day’s regular trading, edged down by 8 cents, or 0.2%, at $40.95 a barrel. Based on the front months, Brent prices were down 9.6% for the month and posted a quarterly loss of 0.5%. “It is the same story with oil as rising coronavirus cases fuel concerns over slowing global growth and pace of demand recovery,” said Lukman Otunuga, senior research analyst at FXTM. “As long as there is no working vaccine against the coronavirus menace, oil remains threatened by negative demand-side factors.” The global tally for confirmed cases of the coronavirus that causes COVID-19 climbed to 33.8 million on Wednesday, according to data aggregated by Johns Hopkins University, while the death toll rose to 1.01 million. The U.S. has the highest case tally at 7.2 million, and highest death toll at 206,494. U.S. gasoline supply, meanwhile, climbed by 700,000 barrels, while distillate stockpiles declined by 3.2 million barrels last week, the EIA reported Wednesday. The S&P Global Platts survey had shown expectations for supply declines of 1.3 million barrels for gasoline and 1.7 million barrels for distillates. On Nymex, October gasoline RBV0 fell 0.07% to $1.2008 a gallon and October heating oil HOV0 added 3.3% at $1.1454 a gallon. The October contracts expired at the end of the session. For the month, gasoline futures based on the most-active contracts settled 5.9% lower, while heating-oil futures fell 4.2%. Also on Nymex, November natural gas NGX20, +5.17% fell 1.3% at $2.527 per million British thermal units, with front-month prices losing 3.9% for the month of September. For the quarter, they were down over 44%."}]}