{"article": [{"url": "https://www.marketwatch.com/story/americans-frustrated-with-testing-delays-as-coronavirus-surges-2020-07-08", "published": 1594245140.0, "headline": "Americans frustrated with testing delays as coronavirus surges", "body": "AUSTIN, Texas — With a cough and shortness of breath, it took Austin, Texas, resident Sam Lee three tries to get a COVID-19 test. The first time, he showed up an hour before the public testing site was set to close and was told they had reached capacity. He was turned away from a second center when rain shut it down, and voluntarily left a third after someone ahead of him said they had been waiting in line for more than three hours. “If you have symptoms and you are just driving around the city trying to figure out how you can get a test, for people who are positive, it is not ideal,” said Lee, who finally got a test on June 29 after he showed up at a site before dawn and waited for more than two hours. Another five days passed before he was able to view the results online, and he didn’t receive a text with the results until seven days after being tested. Four months, 3 million confirmed infections and over 130,000 deaths into the coronavirus outbreak in the U.S., Americans confronted with a resurgence of the scourge are facing long lines at testing sites in the summer heat or are getting turned away. Others are going a week or more without receiving a diagnosis. Some sites are running out of kits, while labs are reporting shortages of materials and workers to process the swabs. Some frustrated Americans are left to wonder why the U.S. can’t seem to get its act together, especially after it was given fair warning as the virus wreaked havoc in China and then Italy, Spain and New York. “It’s a hot mess,” said 47-year-old Jennifer Hudson of Tucson, Arizona. “The fact that we’re relying on companies and we don’t have a national response to this, it’s ridiculous. … It’s keeping people who need tests from getting tests.” It took Hudson five days to make an appointment through a CVS pharmacy near her home. She booked a drive-up test over the weekend, more than a week after her symptoms — fatigue, shortness of breath, headache and sore throat — first emerged. The clinic informed her that her results would probably be delayed. Testing has been ramped up nationwide, reaching about 640,000 tests per day on average, up from around 518,000 two weeks ago, according to an Associated Press analysis. Newly confirmed infections per day in the U.S. are running at over 50,000, breaking records at practically every turn. More testing tends to lead to more cases found. But in an alarming indicator, the percentage of tests coming back positive for the virus is on the rise across nearly the entire country, hitting almost 27% in Arizona, 19% in Florida and 17% in South Carolina. While the U.S. has conducted more tests than any other nation, it ranks in the middle of the pack in testing per capita, behind Russia, Spain and Australia, according to Johns Hopkins University. “I am stunned that as a nation, six months into this pandemic, we still can’t figure out how to deliver testing to the American people when they need it,” said Dr. Ashish Jha, director of Harvard’s Global Health Institute. “It is an abject failure of leadership and shows that the federal government has not prioritized testing in a way that will allow us to get through this pandemic.” Testing alone without adequate contact tracing and quarantine measures won’t control the spread of the scourge, according to health experts. But they say delays in testing can lead to more infections by leaving people in the dark as to whether they need to isolate themselves. In other developments: • While the number of confirmed cases in the U.S. hit 3 million Wednesday by Johns Hopkins’ count, health officials have said that because of inadequate testing and the many mild infections that have gone unreported, the real number is about 10 times higher, or almost 10% of the U.S. population. • A crowd of thousands attending President Donald Trump’s campaign rally in Tulsa, Oklahoma, in late June, along with large groups of people who showed up to protest, “likely contributed” to a dramatic surge in new coronavirus cases in the area, Tulsa City-County Health Department Director Dr. Bruce Dart said Wednesday. Tulsa County reported 261 confirmed cases on Monday, a new record one-day high, and another 206 confirmed cases on Tuesday. A spokesman for the Trump campaign didn’t immediately respond to a request for comment. • Most New York City students will return to school in the fall two or three days a week and learn online the rest of the time under a plan announced by Mayor Bill de Blasio. He said schools can’t accommodate all their students at any one time and maintain social distancing. The school system in New York is the biggest in the nation, with 1.1 million students. It has been closed since March. In New York City, the most lethal hot spot in the nation during the spring, testing was scarce early on but is now widely available. As many as 35,000 tests are conducted daily through a combination of private health organizations and city agencies, according to the city Health Department. “Widespread testing holds the key to reopening our city safely,” de Blasio said. The U.S. Department of Health and Human Services this week said it will open free “surge testing” sites in three hard-hit cities: Jacksonville, Florida; Baton Rouge, Louisiana; and Edinburg, Texas. The sites will be able to conduct as many as 5,000 tests a day in each city, with results in three to five days, officials said. In Georgia, one of the states where cases are surging, officials are rushing to expand testing capacity as demand threatens to overwhelm six major sites around Atlanta, said DeKalb County CEO Michael Thurmond. “If you project this out over the next three weeks, we can’t handle it,” he said. In New Orleans, people were turned away from a free testing site for a third consecutive day after it reached its daily allotment of tests. Health care providers are running low on trays and chemicals needed to run machines used in the tests. Phoenix Mayor Kate Gallego called the situation there “desperate” as residents have sat in sun-baked cars for up to 13 hours to get drive-thru testing. Robert Fenton, head of the Federal Emergency Management Agency, said FEMA is doubling the testing supplies it plans to ship to Arizona. Patrick Friday, a United Methodist minister in Alabama, went to several hospitals and clinics in Birmingham this week to get checked after his school-age son tested positive. But he was told that unless he had a preexisting condition, he didn’t qualify. Finally, he ended up at a site offering rapid-result tests and his negative result came back quickly. “We are several months into this,” he said. “How can it be that we can’t go in and get a test?”"}]}