{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-edge-lower-as-rise-in-coronavirus-cases-stokes-demand-worries-2020-07-17", "published": 1594999460.0, "headline": "Oil settles lower, posting modest change for  week as rise in coronavirus cases stokes demand worries", "body": "Oil futures ended lower Friday, not far from where they settled at a week ago, as the number of COVID-19 cases continued to rise in the U.S. and around the world, adding to uncertainty over the outlook for crude demand. The market appears to be “unfazed and unamused” by the Organization of the Petroleum Exporting Countries and their allies’ decision to taper production cuts from 9.7 million barrels per day to 7.7 million barrels starting from August, said Lukman Otunuga, senior research analyst at FXTM. “Although oil demand has jumped in recent weeks due to easing lockdown restrictions, tapering production cuts may be premature given the state of the global economy and rising coronavirus cases in the United States,” he told MarketWatch. “Any signs of lockdown measures being reinstated or global growth crumbling even further could trigger demand side fears—ultimately exposing WTI and Brent crude to downside shocks.” The U.S. counted more than 70,000 coronavirus cases Thursday to set a new record for the most in a single day, while the number of confirmed cases of COVID-19 edged closer to 14 million and regions resumed restrictions on movement in a battle to contain the spread. Read:OPEC+ move to taper output cuts may ‘keep a floor’ under prices West Texas Intermediate crude for August delivery CL.1, -1.62% on the New York Mercantile Exchange fell by 16 cents, or 0.4% to settle at $40.59 a barrel. September Brent crude BRN.1, -0.07%, the global benchmark on ICE Futures Europe, declined by 23 cents, or 0.5% at $43.14 a barrel. For the week, WTI crude rose 0.1%, or 4 cents a barrel, while Brent declined 0.2%, or by a dime, according to Dow Jones Market Data. Read:Why Shanghai oil futures won’t become a global crude benchmark anytime soon Looking at the technical picture, WTI oil is “struggling to push beyond $41 on the daily charts,” said Otunuga. “Sustained weakness below this point could see a move back towards $36.” At least for now, the market seems “comfortable” that an OPEC+ tapering of output “will not overwhelm demand recovery, and compensation by early period cheaters will help in that regard,” said Jason Gammel, analyst at Jefferies, in a note. “OPEC+ discipline has been strong and if a COVID second wave reverses demand gains we expect the group will then take incremental oil out of the market. We also expect U.S. production declines to continue given low activity levels,” he said, noting that Jefferies raised its second-half 2020 Brent forecast to $43 a barrel from $37 a barrel, while leaving its 2021 and 2022 forecasts unchanged at $48 a barrel and $55 a barrel, respectively. U.S. crude supplies fell by 7.5 million barrels for the week ended July 10, the Energy Information Administration reported Wednesday, helping to lift WTI and Brent prices for that session to their highest settlements in more than four months. Baker Hughes BKR, -1.34% on Friday reported that the number of active U.S. rigs drilling for oil edged down by 1 to 180 this week. That number has now fallen for 18 weeks in a row, suggesting upcoming production declines. Back on Nymex, August gasoline US:RBQ20 lost 0.8% at $1.2245 a gallon, posting a weekly loss of 4.6%, while August heating oil US:HOQ20 shed 0.7% to $1.2191 a gallon, losing 1.8% for the week. August natural gas fell by 0.3% to $1.718 per million British thermal units. For the week, it lost 4.8%."}]}