{"article": [{"url": "https://www.marketwatch.com/story/did-you-miss-out-on-teslas-big-run-there-are-still-good-alternatives-to-play-the-electric-car-revolution-2020-09-09", "published": 1600064180.0, "headline": "Did you miss out on Tesla's big run? There are still good alternatives to play the electric-car revolution", "body": "The electric-car revolution appears to be just getting started. Tesla Inc. TSLA, +1.89%  has delivered a stunning stock-market performance, even with this month's plunge, while many other electric vehicle makers have gone public and many more are planning to do so. Meanwhile, large, traditional auto makers are getting ready to bring scores of new models to the market - real electric vehicles (EVs), not simply those designed for gasoline engines that have electric motors shoved into them. The long-term bull case for Tesla is well-known. Then again, Tesla may still be too pricey for you. The smaller pure-plays, including several pre-revenue companies, may be as well. Several analysts working for money-management firms shared their favorite ways to invest in this long-term trend, from key suppliers, companies beefing up charging capability and battery manufacturers to European car giants muscling into the market. Even with a 34% decline so far this month (through Sept. 8), Tesla shares are up 295% this year and 626% over the past 12 months. That is such a tremendous run-up that it defies conventional fundamental valuation methodology. The shares trade for 138 times the consensus earnings estimate for the next 12 months, among analysts polled by FactSet. To be sure, Tesla is focused on growth - investing in new factories and ramping up production as quickly as possible, so a sky-high valuation to earnings may not worry many investors (except the ones who have been in a hurry to sell this month). “ It feels like we are in a bit of a bubble. ” - Lux Research analyst Christopher Robinson Tesla's pure-play competitors may be the riskiest way to play the EV trend, because of high valuations and the risk of getting steamrolled. Here's a partial list of them, along with Tesla, sorted by market capitalization. Scroll the table to see all the data: Company U.S. Ticker Country Market cap. ($mil) Forward price/ earnings ratio Total return - 2020 Share 'buy' ratings Tesla Inc. TSLA U.S. $307,693 137.7 295% 22% Nikola Corp. NKLA U.S. $18,968 N/A 385% 40% Nio Inc. ADR Class A NIO China $18,420 N/A 324% 53% Li Auto Inc. ADR Class A LI China $10,397 N/A N/A 88% BYD Co. Class H BYDDF China $9,571 54.4 111% 73% XPeng Inc. ADR Class A XPEV China $7,367 N/A N/A N/A Source: FactSet You can click the tickers for more about each company. ADR stands for American depositary receipt. If you are a trader, rather than a long-term investor, daily volume for some ADRs may be relatively thin, meaning lower liquidity may hinder your pricing when you are in a hurry to buy or sell. With the U.S.-listed Chinese companies, longer-term investors may be concerned with a refusal to comply with the Securities and Exchange Commission's rules about access to audit documents. Illustrating just how dynamic this market is, on Sept. 8, the same day Tesla's shares plunged 21%, shares of Nikola shot up 41% after General Motors Co. GM, -0.15%  agreed to invest $2 billion in newly issued shares of the pre-revenue electric-truck maker. GM's shares rose 8% on the news. (More about GM below.) BYD Co.'s main listing is in Hong Kong 1211, -4.67%.  This is a very large state-sponsored manufacturer of internal-combustion-engine (ICE) vehicles as well as EVs. The EV market in China is a gold mine because of the government's commitment to the industry and focus on cutting pollution. But when the government effectively controls the local industry, there can be special risks to investors who cannot know which of the early-stage pure-play EV makers will rise to the top. Gabelli Funds analyst Shawn Kim called the Chinese companies on the above list \"basically government plays\" and said he preferred investing in large suppliers of components and technology to electric-car makers. Some of those are listed below. Two of the Chinese companies were taken public in the U.S. this year. â\u0080¢â\u0080\u0089Li Auto's LI, -1.84%  initial public offering was on July 30 at a price of $11.50. The stock shot to an intraday high of $24.48 on Aug. 26, then fell back down to close at $15.79 on Sept. 8. â\u0080¢â\u0080\u0089XPeng's XPEV, +0.70%  IPO price was $15 a share. When the stocks started trading on Aug. 31, it climbed as high as $22.79. It closed at $17.73 on Sept. 8. It is interesting to see that on the table above Tesla has the lowest percentage of \"buy\" ratings among Wall Street analysts. An analysis of S&P 500 ratings by sell-side analysts last week showed that Tesla was the largest company with \"sell\" ratings outweighing \"buy\" ratings. Even as a U.S. company, Tesla may still pose the biggest risk to the Chinese EV makers. \"Tesla has advantages over Chinese EV companies in terms of brand recognition, product quality and sales,\" Robert Cowell, and analyst with 86Research in Shanghai, wrote in an email exchange. \"We think the impact of trade tensions on Tesla is limited, as Tesla China is well positioned to produce vehicles locally, benefiting Chinese industry, consumers and long term development goals,\" he added. Kim agrees, because of Tesla's positioning in China as a trendy brand with affluent consumers. Cowell wrote that \"Tesla deserves a premium,\" because it has provided \"a proof of concept\" that is supporting the valuation of the Chinese EV makers. He expects China's EV market to grow at a compounded annual rate of 20% from 2020 through 2025 and projects that \"Nio and Li Auto will gain share, selling around 130k and around 160k vehicles in 2025, respectively.\" Several of the pre-revenue companies (including those controlled by the Chinese government) have been brought to market through special purpose acquisition corporations, known as SPACs, or blank-check company. Here are four upcoming SPAC deals to keep an eye on (click the manufacturers' names for details): â\u0080¢â\u0080\u0089Fisker, which will merge with Spartan Energy Acquisition Corp. SPAQ, +4.73%, a SPAC with backing from Apollo Global Management Inc. APO, -0.85%. â\u0080¢â\u0080\u0089Canoo will go public through a reverse merger with Hennessy Capital Acquisition Corp. HCAC, -0.65%.  â\u0080¢â\u0080\u0089Lordstown Motors will be acquired by DiamondPeak Holdings Corp., another SPAC. â\u0080¢â\u0080\u0089Hyliion will merge with Tortoise Acquisition Corp. US:SHLL, and the combined company will continue to trade on the New York Stock Exchange. A word of caution from Christopher Robinson, an analyst with Lux Research in Boston: \"It is pretty concerning to see so many pre-revenue companies going public. It feels like we are in a bit of a bubble.\" Robinson also pointed to Nio Inc. NIO, +0.14%  as an innovator helping consumers afford electric cars. While an argument can easily be made that electric cars can lower a consumer's total cost to operate a vehicle, the sticker prices can be prohibitive. Nio and Renault SA RNO, -3.35%  RNLSY, -3.27%  both offer battery leasing options to car buyers that \"reduce the vehicle cost by roughly $10,000 and are leased for between $100 and $150 per month,\" Robinson said. He also said that Nio's battery-swapping network not only makes it easier for a customer on a long trip to quickly switch to a new battery and move on, it can enable the customer to switch battery sizes without buying a new car. These may be excellent selling points even over Tesla. Suppliers Kim advised against trying to pick winners among expensively-priced EV stocks and instead named three large suppliers of parts and technology to EV manufacturers and noted that these suppliers also benefit from the trend toward higher-tech driver-assist and safety features in all cars. Also included in this table is Infineon Technologies AG IFNNY, +3.03% IFX, +2.51%  , a German semiconductor company cited by Simon Webber, a portfolio manager with Schroders in London. Company Ticker Forward price/earnings ratio Total return - 2020 through Sept. 8 Share 'buy' ratings Aptiv PLC APTV, +0.09%  27.0 -11% 79% Lear Corporation LEA, -0.22%  10.5 14% 44% Continental AG ADR CTTAY, -0.91%  15.5 -4% 28% Infineon Technologies AG ADR IFNNY, +3.03% 28.1 16% 59% Source: FactSet On the table above, Contental AG's ADR is included. The main ticker is in Germany CON, -1.71%.  Kim called Aptiv APTV, +0.09%  a \"global tier 1 supplier\" of electronic systems and components, as well as safety systems, around the world. Even buyers of traditional cars are clamoring for as many safety features as possible. Aptiv's major competitors in the safety space are Bosch, which is privately held, and Continental AG, Kim said. Lear LEA, -0.22%  is one of the largest suppliers of vehicle seats. But the company also has an electronics business competing with Aptiv, Kim said. The stocks have been under pressure this year because of volume declines at major traditional manufacturers given the Covid-19 crisis, he said. Aptiv, Lear and Continental are among suppliers that \"have important roles to play, especially around things like autonomous vehicles,\" Robinson of Lux Research said. Webber called Infineon Technologies a global leader in semiconductors that manage power coming out of a motor. \"When you transition from a combustion vehicle to an EV, you need three or four times the power management content,\" he said. His fund owns shares in the company.A beefed-up electric grid and batteries Webber co-manages the Hartford Schroders International Stock Fund SCIEX, +0.82%, which is rated five stars (the highest rating) by Morningstar. Even though shares of EV makers have performed so well, investors are underestimating the potential size of the EV market, he said. \"If you are brave enough to imagine a different future and look where policy makers are setting medium to long-term targets, it is clear that in large parts of Europe and America, in 10 to 15 years time, it can be close to 100% penetration for electric vehicles,\" he said in an interview. For the new car market, in Europe especially, \"if you are not able to drive your [ICE] vehicle into certain places, or face [an onerous] tax regime, then simply the economics will point you in a certain direction,\" he added. Webber said that in Norway, more than half of new car sales are now EVs, because of \"a really big package\" of government incentives. Despite a global decline in EV sales in 2019 and during the first quarter of 2020, sales in Europe continued to rise rapidly, according to this McKinsey report. When discussing range anxiety, a common sticking point for people in the U.S. considering electric cars, Webber said that in Europe, Tesla's charging network can now take him \"anywhere,\" and that recent recharging at the Tesla stations had taken about a half-hour, including the wait time for the charger. But putting a practical charging network in place in the U.S. is going to take longer, he said. In Europe, Webber sees opportunities for investors in electric companies, including National Grid, and Red Electrica, which are electric utilities, Schneider Electric S.E. and Eaton Corp. PLC, which make electric components, and Alfen NV, which designs and builds vehicle charging equipment and energy storage systems. This table includes the above five companies with their local tickers: Company Ticker Country Total return - 2020 Share 'buy' ratings National Grid PLC NG, -0.70%  U.K. -7% 78% Red Electrica Corp. SA REE, -1.46%  Spain -6% 28% Schneider Electric SE SU, +1.07%  France 18% 57% Eaton Corp. PLC ETN, +0.04%  Ireland 9% 56% Alfen NV ALFEN, +5.66% Netherlands 220% 0% Source: FactSet Three of the above also trade under ADRs: Company ADR National Grid PLC NGGTF, +3.95%  Red Electrica Corp. SA RDEIY, -0.74%  Schneider Electric SE SBGSY, +1.50%  Webber also sees \"a long runway for growth\" for battery manufacturers. Company Ticker Country Forward price/ earnings ratio Total return - 2020 Share 'buy' ratings Samsung SDI Co. 006400, +1.25% South Korea 28.8 85% 91% LG Chem Ltd. 051910, +1.76% South Korea 28.3 123% 91% Contemporary Amperex Technology Co. Class A 300750, +7.49% China 59.6 92% 86% Panasonic Corp ADR PCRFY, -1.44% Japan 22.2 -3% 24% Source: FactSet The above tickers are all for the main listing, except for Panasonic, which is an ADR. Tesla's battery-making partner's home market is the Tokyo exchange 6752, -1.98%. Traditional auto manufacturers take on Tesla Kim expects to see a \"duopoly\" between Tesla and Volkswagen VWAGY, +0.14% VOW3, -0.23%  VOW, -0.20%. \"VW has scale, clearly, and Tesla is synonymous with EVs, particularly with younger consumers,\" he said. Among traditional car manufacturers moving into EVs, Webber believes BMW BMW, -1.55% BMWYY, -1.10%  will be one of the dominant players, along with Tesla and Volkswagen. He has \"higher conviction\" for BMW than he has for VW, because of its long investment in the EV space. \"BMW with the I series and the MINI have are already selling quite significant electric volumes,\" Webber said. \"They are well ahead in this transition. It is the companies trying to make money with gasoline vehicles that worry you.\" George Schultze, CEO of Schultze Asset Management, based in Rye Brook, N.Y., favors General Motors Co. GM, -0.15%  as a value play on the transition to electric vehicles. For one thing, GM's shares trade for only 6.6 times the consensus forward earnings estimate among analysts polled by FactSet. Among 18 analysts covering GM, 15 rate the stock the equivalent of a \"buy.\" During an interview, Schultze, who owns GM shares in the accounts he manages, described the company as \"a hybrid between old and new\" that has deep pockets to fund continued development in EVs and autonomous vehicles. The Nikola deal supports that idea, he said. In addition, GM is refurbishing a plant in Detroit to build electric vehicles and expects to roll out electric pickup trucks for sale next year. Schultze expects GM to set trends with autonomous vehicles, in part because it can funnel its cash flow from traditional vehicles into new areas. This could lead to an unlocking of value if the company decides to spin off its EV unit. When asked during GM's second-quarter earnings call on July 29 about whether the company was considering such a spinoff, especially in light of investors' appetite for EV stocks, CEO Mary Barra said \"nothing is off the table,\" and that she and her team were \"open to looking at and [evaluating] anything that we think is going to drive long-term shareholder value,\" according to a transcript provided by FactSet. Also read:E-bike growth was supposed to take 10 years - here's why it soared in six months and the firms to invest in"}]}