{"article": [{"url": "https://www.marketwatch.com/story/the-work-from-home-etf-is-here-get-ready-for-some-surprises-2020-06-25", "published": 1594454420.0, "headline": "The 'work-from-home' ETF is here. Get ready for some surprises.", "body": "For all the weirdness of the past few months - the Zoom fatigue, the challenge of caring for children and pets and aging parents alongside co-workers - the coronavirus pandemic that's kept millions of white-collar workers in their homes, not their offices, has presented new opportunities. It seemed only a matter of time before someone launched an ETF for that, and on Thursday, that fund, the Direxion Work From Home exchange-traded fund - sporting the ticker WFH WFH, +1.46%  , naturally - will start trading. As it does, a look at what's inside the portfolio shows some surprises. For such a clearly delineated theme that squares so neatly with the reality of life for so many right now, one of the biggest ironies is how nuanced the fund's holdings actually are. The fund is made up of 40 equally-weighted companies ranging from old standbys like Amazon.com Inc. AMZN, +3.01%  and Microsoft Corp MSFT, +2.48%  to the lesser-known, like Proofpoint Inc. PFPT, +1.40%  and Perficient Inc PRFT, +1.03%. It has of-the-moment pandemic darlings, like Zoom Video Communications Inc. ZM, +2.89%  - and some old guards like Hewlett Packard Enterprise Co HPE, -1.80%. And its reach stretches from Shenzen, China, with companies like Xunlei Ltd. XNET, -2.84%  , to Cincinnati Bell Inc. CBB, +0.13%  \"This is global in nature, and the benefit of what they've done is not just picking the poster children of the working-from-home phenomenon,\" said Todd Rosenbluth, head of ETF and mutual-fund research for CFRA. \"This fund gives you a mixture of up-and-comers whose business model is being driven by that theme, and some megacaps that will get stock price growth from many things. This is not really a pure-play work-from-home ETF, which I think is positive.\" Direxion says the fund will focus on companies that fall into four buckets representing sub-themes: remote communications, cyber security, project and document management, and cloud technologies. Rosenbluth also thinks WFH should sit in an investing sweet spot. As an index-based fund, it offers more diversification, and the benefit of stock-picking from an experienced management team, than if investors were to try to select individual stocks themselves. But it's a lot less idiosyncratic than many actively-managed funds, most notably some of the ones run by a company like ARK Invest, which represent strong convictions by a small management team about clear winners among innovative technology leaders. Related: Wall Street's road warriors have spent the past three months grounded. How's that working out? Still, this ETF, like any fund, will have to prove itself. \"I don't think any investors would dispute that we are going to be working from home and thus using the benefits of cloud computing and telecoms,\" Rosenbluth said in an interview. Investor interest and flows into the fund will likely be robust because most people agree with that thesis, he noted. But what will keep people invested is the performance of the individual companies, and thus the fund's overall returns, Rosenbluth said. As ARK's CEO, Cathie Wood, told MarketWatch in early June, even her team struggles to understand how much of a moat some of the early technology winners really have. WFH will charge a 45-basis point fee, track the Solactive Remote Work Index, and rebalance semiannually. See:The first - and only - negative-fee ETF didn't make it. Here's what that tells us about investing."}]}