{"article": [{"url": "https://www.marketwatch.com/story/grubhubs-acquisition-by-just-eat-takeawaycom-creates-global-restaurant-delivery-giant-2020-06-10", "published": 1591819880.0, "headline": "Grubhub's acquisition by Just Eat Takeaway.com creates global restaurant-delivery giant", "body": "Two pioneers in restaurant delivery - Just Eat Takeaway.com and Grubhub - are combining in a $7.3 billion deal that will create one of the world's largest delivery companies. Amsterdam-based Just Eat Takeaway.com TKWY, +1.00%  said late Wednesday that it was acquiring Chicago-based Grubhub GRUB, +0.83%  , snatching it away from ride-hailing giant Uber UBER, -0.18%  , which had been reportedly seeking to team Grubhub with its Uber Eats business. The deal is expected to close in the first quarter of 2021. The combined company will be headquartered in Amsterdam, with its U.S. headquarters in Chicago. Just Eat Takeaway.com and Grubhub processed 593 million restaurant orders in 2019 and have about 70 million users worldwide. Combined, they will be the largest restaurant delivery company outside China. Just Eat Takeaway.com said it will acquire 100% of Grubhub's shares at an implied value of $75.15 per share. Grubhub shareholders will receive depository receipts representing a portion of shares in the new company. Grubhub shares closed at $59.05 Wednesday. If Uber had succeeded in buying Grubhub, it would have given the companies control over a majority of the U.S. food delivery business, but could have run into snags with regulators. Just Eat Takeaway.com doesn't operate in the U.S. \"Like ridesharing, the food delivery industry will need consolidation in order to reach its full potential for consumers and restaurants. That doesn't mean we are interested in doing any deal, at any price, with any player,\" Uber said in a statement. Matt Maloney, Grubhub's founder and CEO, will join Just Eat Takeaway.com's board and will lead the company's North American business, the companies said. The merger will let the companies share technology and marketing costs and provide the broadest range of services to restaurants and consumers, the companies said. Takeaway.com and Grubhub, both founded in the early 2000s, were some of the earliest entries in the sector. But they've been joined by a host of others, including Uber Eats, DoorDash, Deliveroo and Postmates. Customers jump freely between the services, which makes it difficult to deliver stable sales. Aggressive discounting and heavy marketing costs to win new users have also taken a toll on profits, and restaurants have been pushing for lower fees. As a result, consolidation has been a constant in the industry. Grubhub acquired Seamless in 2013, while DoorDash bought the upscale service Caviar last year. In January, Takeaway.com bought its British rival Just Eat for $7.8 billion. Combined, those companies have 48 million active users and reported revenue of $1.7 billion in 2019. Grubhub has 23 million active users and reported revenue of $1.3 billion. The coronavirus pandemic has boosted sales for both Just Eat Takeaway.com and Grubhub, with restaurants shuttered, more people staying home and ordering takeout food. Grubhub's orders grew 28% over the prior year in April and May, while Just Eat Takeaway.com's orders grew 41%. Just Eat Takeaway.com provides deliveries in Europe, Australia, Israel, New Zealand, Canada, Mexico and Brazil. Grubhub operates in 4,000 U.S. cities. It holds around 30% of the U.S. food delivery market, according to Second Measure, a data analysis company. That's less than the 37% controlled by DoorDash, but more than Uber Eats' 20% share. Grubhub is the leader in key markets like New York, Boston and Chicago. Despite winning new customers, Grubhub struggled to remain profitable as competition heated up. The company reported a net loss of $18.6 million in 2019. In the first quarter of this year, Grubhub's revenue rose 12% to $363 million, but it reported a net loss of $33.4 million."}]}