{"article": [{"url": "https://www.marketwatch.com/story/women-and-credit-in-the-2000s-the-fight-against-pay-discrimination-continued-2020-08-06", "published": 1596815480.0, "headline": "Women and credit: In the 2000s, the fight against pay discrimination continues", "body": "This article is reprinted by permission from NerdWallet. This series examines the financial progress made by women in the U.S. since the Equal Credit Opportunity Act was passed in 1974. In this installment: the 2000s, when a Supreme Court ruling led to historic fair-pay legislation.The Lilly Ledbetter Fair Pay Act The first bill that President Barack Obama signed into law was the Lilly Ledbetter Fair Pay Act in 2009. The law bolstered the protection against pay discrimination for women that had been badly undermined by a Supreme Court ruling. Lilly Ledbetter was a manager at Goodyear Tire & Rubber GT, who had experienced sexual harassment and pay discrimination. Ledbetter complained to the Equal Employment Opportunity Commission, and she initially won her case. That victory was later reversed by an appeals court. Also see: This is what it would take to close the gender pay gap The case went all the way to the Supreme Court, which ruled in favor of Goodyear in 2007. The court said that existing federal law required employees to challenge wage discrimination within 180 days of the discrimination occurring — even if the employee didn’t find out about it until later. In effect, as long as an employer kept the discrimination under wraps for six months, it was OK to pay women unfairly compared with men. There were eight men and one woman on the Supreme Court at this time, and that female justice, Ruth Bader Ginsburg, wrote a dissent and read it from the bench when the court’s opinion was shared. The 2009 Lilly Ledbetter Fair Pay Act law has given employers strong incentive to eliminate discriminatory practices in compensation and has allowed employees to call out employers who aren’t adhering to these rules. It also encourages employees to challenge compensation discrimination by reporting it as soon as they see it. This is a huge win for women, who still earn less, on average, than men.Strides in the workplace, CEO-style In 2000, there were two female CEOs of Fortune 500 companies. By the end of the decade, that number grew to 15. One of those CEOs, Ursula Burns of Xerox XRX, -1.38% , was the first Black woman to become a CEO of a Fortune 500 company. Only one other Black woman has been a Fortune 500 CEO since — Mary Winston held the role of interim CEO at Bed Bath & Beyond BBBY, -1.37% for around six months of 2019. See more from this series: In the 1970s, the Equal Credit Opportunity Act became law— a key step in financial freedom for women In the ’80s, women gained career options and financial clout In the 1990s, women made strides in politics, and pop culture rewrites what it means to be a girl In the 2010s, the Credit Card Act is amended and more women are breadwinners In the past decade, the number of female CEOs has more than doubled, but still makes up a paltry percentage of the Fortune 500. As of 2020, there are 37 female CEOs of Fortune 500 companies, representing 7.4% of the top spots. Most of these women are white; there are just three women of color on this year’s list. The advancement of women at every corporate level and in independent businesses has driven up their earning power. Women are increasingly family breadwinners and despite egregious wage gaps that still exist today, hopefully women in leadership roles beget more women leaders.More from NerdWallet: Can a Credit Card Company Lower My Credit Limit? Is It OK to Never Have a Credit Card? Today’s Definition of Financial Adulthood Is More Flexible Than Ever Erin El Issa is a writer at NerdWallet. Email: erin@nerdwallet.com. Twitter: @Erin_El_Issa."}]}