{"article": [{"url": "https://www.marketwatch.com/story/charting-market-cross-currents-sp-500-survives-test-of-200-day-average-2020-06-30-121034413", "published": 1593521720.0, "headline": "Charting market cross currents, S&P 500 maintains 200-day average", "body": "Editor’s Note: This is a free edition of The Technical Indicator, a daily MarketWatch subscriber newsletter. To get this column each market day, click here. Technically speaking, the major U.S. benchmarks are poised to conclude the second quarter against an increasingly uneven, but still generally bullish, bigger-picture backdrop. On a headline basis, the S&P 500 has survived a jagged retest of its 200-day moving average, while the Nasdaq Composite continues to digest last week’s break to record territory. Before detailing the U.S. markets’ wider view, the S&P 500’s SPX, +0.87% hourly chart highlights the past two weeks. As illustrated, the S&P has weathered a jagged retest of the 200-day moving average, currently 3,021. From current levels, initial overhead matches the December low (3,070) and is followed by the recent breakdown point, circa 3,090. Meanwhile, the Dow Jones Industrial Average DJIA, +0.56% continues to lag behind. Nonetheless, the index has survived an initial test of its 50-day moving average, currently 24,992. This area closely matches important support, better illustrated on the daily chart. Slightly more broadly, the Dow remains capped by its 200-day moving average while the S&P 500 has effectively maintained a posture atop its 200-day. True to recent form, the Nasdaq Composite COMP, +1.39% remains the strongest major benchmark. Its prevailing pullback from record highs has been punctuated by a jagged retest of the breakout point (9,838). Major support is better illustrated below. Widening the view to six months adds perspective. On this wider view, the Nasdaq has absorbed a bearish reversal from record highs. Recall last week’s gravestone doji at the June peak, a bearish single-day pattern resembling an inverted letter T. The downturn has been punctuated by a jagged retest of the breakout point (9,838) amid thus far limited technical damage. Delving deeper, the ascending 50-day moving average, currently 9,350, is closely followed by former gap support (9,323). The Nasdaq’s intermediate-term bias remains bullish barring a violation. Looking elsewhere, the Dow industrials’ backdrop remains weaker. The prevailing downturn punctuates a failed test of its 200-day moving average, a level defining the early-June island reversal. Also recall that last week’s rally attempt stalled at the breakdown point — better illustrated on the hourly chart — an area matching the February gap (25,752) and the May peak (25,758). Bearish price action. On further weakness, familiar inflection points remain in play: The June closing low (25,128). The ascending 50-day moving average, currently 24,992. The absolute June low (24,843). Tactically, a close under this area would mark a “lower low” — combined with a violation of the 50-day moving average — raising the flag to an intermediate-term trend shift. The slightly deeper breakout point likely marks last-ditch support, an area closely matching the June 2019 low (24,680) and the February 2020 low (24,681). Meanwhile, the S&P 500 has weathered a downturn from major resistance. Recall that last week’s high (3,154.9) matched the November peak (3,154) to punctuate the third recent failed retest. The index has subsequently registered a jagged retest of the 200-day moving average, currently 3,021, and the 3,000 mark. Monday’s session low (2,999.7) matched the round number.The bigger picture Collectively, the U.S. benchmarks are closing out June, and the second quarter, amid uneven price action. The bigger-picture backdrop is not one-size-fits-all. On headline basis, the Nasdaq Composite continues to outperform — staging a relatively orderly pullback from record highs — while the Dow Jones Industrial Average has not acted well across the prior two weeks. The Dow’s bearish island reversal has been punctuated by consecutive failed tests of its 200-day moving average and the breakdown point (25,750). The S&P 500’s backdrop splits the difference between the two benchmarks. Moving to the small-caps, the iShares Russell 2000 ETF IWM, +0.51% has pulled in from the 200-day moving average. To reiterate, trendline support tracks the 50-day moving average, currently 135.20, and is rising toward the breakout point (136.20). Consecutive session lows last week — Wednesday (136.31) and Thursday (136.29) — effectively matched support to punctuate a successful retest. (Also see last Tuesday’s review.) Similarly, the SPDR S&P MidCap 400 ETF has pulled in from the 200-day moving average. Tactically, the June low closely matches the breakout point and the ascending 50-day moving average. An eventual violation would punctuate a “lower low” raising a caution flag. Looking elsewhere, the SPDR Trust S&P 500 SPY, +0.89% has weathered a jagged test of its 200-day moving average, currently 301.70. The late-June downturn punctuates a failed test of gap resistance spanning from 312.15 to 313.00. The SPY has not closed atop this area since June 10. Delving slightly deeper, the ascending 50-day moving average, currently 298.50, is increasingly within view. Moving to the four-year view, the S&P 500 has whipsawed of late to punctuate a massive bullish reversal. Recall that the June low (2,965) registered slightly atop major support (2,954). This area remains a bull-bear inflection point. Placing a finer point on the S&P 500, selling pressure has resurfaced near major resistance (3,155) to conclude June and the second quarter. Moreover, last week’s lukewarm rally attempt was punctuated by a failed test of the breakdown point (3,090) from underneath. A consolidation phase is underway. The next question is the point at which “consolidation phase” morphs into technical damage sufficient to signal a trend shift. Tactically, the S&P’s 50-day moving average, currently 2,989, is rising toward the 200-day moving average. A golden cross — or bullish 50-day/200-day moving average — will likely signal late next week. (The crossover is frequently a lagging signal. For instance, the prior bearish crossover registered on March 30, after the 2020 low had been established.) Delving deeper, the June low (2,965) has registered slightly atop major support (2,954) an area also detailed on the four-year chart. As always, it’s not just what the benchmarks do, it’s how they do it. But generally speaking, the S&P 500’s intermediate- to longer-term bias remains bullish barring a violation of the 2,954 support. Also see: Charting a bullish summer start, Nasdaq takes flight to record territory.Tuesday’s Watch List The charts below detail names that are technically well positioned. These are radar screen names — sectors or stocks poised to move in the near term. For the original comments on the stocks below, see The Technical Indicator Library. Drilling down further, the SPDR S&P Homebuilders ETF XHB, +0.54% is acting well technically. As illustrated, the group has asserted a June holding pattern, digesting a rally atop the 200-day moving average. Delving slightly deeper, the breakout point (40.50) closely matches trendline support. A sustained posture atop this area signals a bullish bias. Also notice the pending golden cross — or bullish 50-day/200-day moving average crossover — signaling that the intermediate-term uptrend has overtaken the longer-term trend. Moving to specific names, Boeing Co. BA, -0.39% is a Dow 30 component setting up well for the near-term. Technically, the shares have rallied from the breakout point, rising amid reports that the FAA and Boeing have started a series of tests flights for the 737 MAX. The shares are lower early Tuesday amid reports that Norwegian Air Shuttle has canceled an order for 92 jets. More broadly, the tandem strong-volume June rallies are technically constructive. The breakout point (166.00) marks a well-defined floor, and the prevailing recovery attempt is intact barring a violation. Dell Technologies, Inc. DELL, -0.39% is a well positioned large-cap name. As illustrated, the shares have recently gapped to seven-month highs, rising amid reports that the company is considering a spinoff of its stake in VMware, Inc. The subsequent pullback has been comparably flat, positioning the shares to build on the initial strong-volume spike. Tactically, the breakout point (50.80) is closely followed by trendline support and the 200-day moving average, currently 47.40. The prevailing rally attempt is intact barring a violation. Zebra Technologies Corp. ZBRA, +1.75% is a large-cap developer of automatic-identification and data-capture solutions, including barcode technologies. Late last month, the shares knifed to record highs, clearing resistance matching the early-May peak. The subsequent pullback places the shares at an attractive entry near the breakout point and 10.5% under the June peak. Tactically, trendline support closely tracks the 50-day moving average, and currently matches the breakout point, circa 243.00. A sustained posture higher signals a bullish bias. Initially profiled May 15, Halozyme Therapeutics, Inc. HALO, +2.47% has edged slightly higher and remains well positioned. As illustrated, the shares have asserted a bull flag, digesting a strong-volume mid-June spike to record territory. Tactically, the breakout point (24.40) is followed by the ascending 50-day moving average, a recent bull-bear inflection point. The prevailing uptrend is firmly-intact barring a violation. Editor’s Note: This is a free edition of The Technical Indicator, a daily MarketWatch subscriber newsletter. To get this column each market day, click here.Still well positioned The table below includes names recently profiled in The Technical Indicator that remain well positioned. For the original comments, see The Technical Indicator Library. Company Symbol* (Click symbol for chart.) Date Profiled Box, Inc. BOX June 29 Yeti Holdings, Inc. YETI June 25 Arrowhead Pharmaceuticals, Inc. ARWR June 25 Danaher Corp. DHR June 24 RH RH June 24 Hologic, Inc. HOLX June 23 First Solar, Inc. FSLR June 22 Momenta Pharmaceuticals, Inc. MNTA June 22 SPDR S&P Biotech ETF XBI June 19 Lowe’s Companies LOW June 19 Fiverr International, Ltd. FVRR June 19 Chegg, Inc. CHGG June 18 Fastly, Inc. FSLY June 18 Arena Pharmaceuticals, Inc. ARNA June 18 Dollar Tree, Inc. DLTR June 17 Etsy, Inc. ETSY June 17 Skyworks Solutions, Inc. SWKS June 16 Lululemon Athletica, Inc. LULU June 16 Carvana Co. CVNA June 10 Williams-Sonoma, Inc. WSM June 9 HubSpot, Inc. HUBS June 8 Square, Inc. SQ June 8 United Parcel Service, Inc. UPS June 5 Micron Technology, Inc. MU June 5 Xilinx, Inc. XLNX June 4 KLA Corp. KLAC June 4 VMware, Inc. VMW June 3 FedEx Corp. FDX June 3 SPDR S&P Retail ETF XRT June 3 ASML Holding N.V. ASML June 1 Datadog, Inc. DDOG June 1 iShares MSCI Japan ETF EWJ May 29 SolarEdge Technologies, Inc. SEDG May 29 Splunk, Inc. SPLK May 28 Microchip Technology, Inc. MCHP May 27 Synopsis, Inc. SNPS May 27 SSR Mining, Inc. SSRM May 27 Twilio, Inc. TWLO May 26 Take-Two Interactive Software, Inc. TTWO May 26 Lam Research Corp. LRCX May 26 Marvell Technology Group, Ltd. MRVL May 26 Cisco Systems, Inc. CSCO May 21 Beyond Meat, Inc. BYND May 21 Agios Pharmaceuticals, Inc. AGIO May 20 Cree, Inc. CREE May 20 Applied Materials, Inc. AMAT May 19 Fortinet, Inc. FTNT May 18 II-VI, Inc. IIVI May 18 Alteryx, Inc. AYX May 18 iShares Silver Trust SLV May 15 Agnico Eagle Mines, Ltd. AEM May 15 Agilent Technologies, Inc. A May 15 Halozyme Therapeutics, Inc. HALO May 15 Wix.com, Ltd. WIX May 13 Extreme Networks, Inc. EXTR May 13 Qualcomm, Inc. QCOM May 12 Zynga, Inc. ZNGA May 12 Kinross Gold Corp. KGC May 11 Avalara, Inc. AVLR May 8 Salesforce.com, Inc. CRM May 8 Facebook, Inc. FB May 7 Spotify Technology S.A. SPOT May 5 CrowdStrike Holdings, Inc. CRWD May 4 iRobot Corp. IRBT May 4 Inphi Corp. IPHI Apr. 29 Qorvo, Inc. QRVO Apr. 29 Old Dominion Freight Line, Inc. ODFL Apr. 29 Dollar General Corp. DG Apr. 28 AngloGold Ashanti Ltd. AU Apr. 28 Cadence Design Systems, Inc. CDNS Apr. 27 ServiceNow, Inc. NOW Apr. 27 Snap, Inc. SNAP Apr. 27 Five9, Inc. FIVN Apr. 24 Chewy, Inc. CHWY Apr. 24 Tesla, Inc. TSLA Apr. 23 Shopify, Inc. SHOP Apr. 23 iShares Nasdaq Biotechnology ETF IBB Apr. 21 Teradyne, Inc. TER Apr. 20 Electronic Arts, Inc. EA Apr. 20 VanEck Vectors Semiconductor ETF SMH Apr. 17 Coupa Software, Inc. COUP Apr. 17 Veeva Systems, Inc. VEEV Apr. 17 American Tower Corp. AMT Apr. 17 Okta, Inc. OKTA Apr. 16 Target Corp. TGT Apr. 16 Netflix, Inc. NFLX Apr. 14 VanEck Vectors Gold Miners ETF GDX Apr. 14 Invesco QQQ Trust QQQ Apr. 14 Ciena Corp. CIEN Apr. 6 Seattle Genetics, Inc. SGEN Apr. 6 DocuSign, Inc. DOCU Apr. 3 Zscaler, Inc. ZS Apr. 3 Moderna, Inc. MRNA Apr. 3 RingCentral, Inc. RNG Mar. 30 Activision Blizzard, Inc. ATVI Mar. 30 Regeneron Pharmaceuticals, Inc. REGN Mar. 30 Apple, Inc. AAPL Mar. 27 Nvidia Corp. NVDA Mar. 27 Dexcom, Inc. DXCM Mar. 27 Amazon.com, Inc. AMZN Mar. 26 Stamps.com, Inc. STMP Mar. 26 Quidel Corp. QDEL Mar. 26 Domino’s Pizza, Inc. DPZ Mar. 20 Kroger Co. KR Mar. 19 Zoom Video Communications, Inc. ZM Mar. 19 iShares MSCI Emerging Markets ETF EEM Mar. 19 Newmont Corp. NEM Jan. 13 Atlassian Corp. TEAM Jan. 7 SPDR Gold Shares ETF GLD Jan. 2 Teledoc Health, Inc. TDOC Nov. 1 Microsoft Corp. MSFT Feb. 22 * Click each symbol for current chart."}]}