{"article": [{"url": "https://www.marketwatch.com/story/trump-to-sign-executive-order-suspending-h-1bs-other-visas-2020-06-22", "published": 1592852540.0, "headline": "Trump signs executive order suspending H-1Bs, other visas", "body": "WASHINGTON — The Trump administration on Monday extended a ban on green cards issued outside the United States until the end of the year and added many temporary work visas to the freeze, including those used heavily by technology companies and multinational corporations. The administration cast the effort as a way to free up jobs in an economy reeling from the coronavirus. A senior official who spoke to reporters on condition of anonymity predicted it will open up to 525,000 jobs for Americans. The ban, while temporary, would amount to major restructuring of legal immigration if made permanent, a goal that had eluded the administration before the pandemic. Long-term changes that would prevent many asylum seekers from getting work permits and would allocate high-tech worker visas differently are also being sought. Business groups pressed hard to limit the changes, but got little of what they wanted, marking a victory for immigration hardliners as Trump seeks to further solidify their support ahead of the November election. The ban on new visas applies to H-1B visas, which are widely used by major American and Indian technology company workers and their families, H-2B visas for nonagricultural seasonal workers, J-1 visas for cultural exchanges and L-1 visas for managers and other key employees of multinational corporations. There will be exemptions for food processing workers, which make up about 15% of H-2B visas, the official said. Health care workers assisting with the coronavirus fight will continue to be spared from the green-card freeze, though their exemption will be narrower. “In the administration of our Nation’s immigration system, we must remain mindful of the impact of foreign workers on the United States labor market, particularly in the current extraordinary environment of high domestic unemployment and depressed demand for labor,” Trump wrote in his presidential proclamation. Trump imposed a 60-day ban on green cards issued abroad in April, which was set to expire Monday. That announcement, which largely targeted family members, drew a surprisingly chilly reception from immigration hardliners, who said the president didn’t go far enough. The new steps to include non-immigrant visas went a long toward appeasing hardliners. “This is a bold move by the Trump administration to protect American jobs,” said Mark Krikorian, executive director of the Center for Immigration Studies, which advocates for restrictions. “Not all the items on our checklist of needed actions are included in today’s announcement, but the corporate lobbyists who were desperately fighting for exceptions to protect their clients’ access to cheap foreign labor have largely been rebuffed.” Thomas J. Donohue, the U.S. Chamber of Commerce’s chief executive officer, said the measures will harm, not help, the American economy. “Putting up a ‘not welcome’ sign for engineers, executives, IT experts, doctors, nurses and other workers won’t help our country, it will hold us back,” he said. “Restrictive changes to our nation’s immigration system will push investment and economic activity abroad, slow growth, and reduce job creation.” BSA, a group that represents major software companies, urged the administration to reconsider, particularly changes to the H-1B program, saying they will hinder economic recovery by making it harder to fill critical positions. “Filling these roles that are more abundant than the number of U.S. employees qualified to fill them means these jobs can be kept in the U.S.,” the group said. “This allows companies based in the U.S. to remain globally competitive, which in turn boosts the U.S. economy, creating jobs for millions of Americans.” The freezes on visas issued abroad are designed to take effect immediately. Other changes, including restrictions on work permits for asylum seekers, will go through a formal rule-making process that takes months. The administration is proposing a new way of awarding H-1B visas, the official said, awarding them by highest salary instead of by lottery. H-1B visas are capped at 85,000 a year for people with “highly specialized knowledge” and minimum of a bachelor’s degree, often in science, technology, engineering, teaching and accounting. Critics say high-tech companies have used the visas as a tool to outsource jobs to foreigners, replacing Americans. Cognizant Technology Solutions Corp. was the largest H-1B employer in the 2018 fiscal year, followed by Tata Consultancy Services Ltd., Infosys Ltd., Deloitte Consulting LLP and Microsoft Corp. Other major employers include Amazon.com Inc., Apple Inc., Google and Facebook Inc. The rule against asylum seekers, scheduled to take effect Aug. 25, would make it much more difficult for them to get work permits by, among other things, lengthening the waiting time to apply from 150 days to a year and barring applicants who cross the border illegally. The 328-page regulation — signed by Chad Mizelle, the Homeland Security Department’s acting general counsel, who is considered an ally of White House adviser Stephen Miller — says limiting work permits will remove a major incentive for people to come to the United States for asylum. It is the latest in a long string of measures that make asylum more difficult to get — almost unattainable, according to some immigrant advocacy groups. “The rule will prevent many refugees from feeding, supporting, and housing themselves and their families,” said Eleanor Acer, Human Rights First’s senior director for refugee protection. “Asylum seekers and their families already struggle to survive under existing work authorization wait times. But this rule will make survival impossible for many.” ___ Spagat reported from San Diego."}]}