{"article": [{"url": "https://www.marketwatch.com/story/what-you-should-know-about-buying-a-used-rental-car-2020-07-01", "published": 1593580280.0, "headline": "What you should know about buying a used rental car", "body": "Buying a used rental car is top of mind among shoppers hearing news of the financial woes of major rental companies. With the lack of business and pleasure travel by air, many of these firms like Hertz HTZ, -1.78% and Avis CAR, +1.28% are selling off significant portions of their fleets, usually through their own retail outlets. Here are 5 tips on buying a used rental car that shoppers should keep in mind:Set reasonable expectations on price While rental companies are hurting, they’re not about to give the store away when it comes to retailing their stock. They’ve been selling their out-of-service units for many years, and watch the market closely. The prices may be at the bottom of the scale, but don’t expect bargain basement stickers when perusing their inventories. Most of these retail sales outlets operate on a one-price, no-haggle basis, so don’t expect to get a lowball offer accepted. Do your homework Even before setting your foot on a rental company’s lot to buy a used rental car, do some basic research on the particular model you’re considering. Go to sites like Kelley Blue Book to determine a vehicle’s value from private parties and dealers as both Certified Preowned and non-CPO units. Once you have a feel for the market pricing, you’ll be in a much better position to determine whether or not what the rental company is offering is a good deal. Also read: The pros and cons of buying a certified used carWhat’s different between a dealer CPO and a used rental sale? Buying a car from a rental company is similar to a dealer CPO unit in that both are typically one to three years old with relatively low mileage. Both the dealer and the rental car company inspect the vehicles, refurbish them if necessary, and usually throw in some warranty coverage. They differ, however, in that often the dealer CPO unit is an off-lease return driven by one customer. A used rental unit is just that, a car that has had many drivers. Be clear in either case of the vehicle’s use. Some dealers may also use their CPO program to sell off old service loaners or rentals from the dealership.What are the advantages of buying a used rental car? In addition to an attractive price, rental companies typically keep their units on strict maintenance schedules. They can’t afford the downtime from unscheduled repairs, so you can be fairly sure that the vehicle is in top shape. Also, to maximize returns on their investment, these companies will only retail vehicles that are in above average condition. They will wholesale off less desirable ones to non-franchised used car dealers. Also see: These 3 EVs are the lowest cost to own over 5 years What are the pitfalls of buying a used rental car? While the pricing on the used rental car might look attractive, keep in mind mileage and other factors such as wear and tear from many different drivers as part of your value equation. Also, reliability, dependability, and cost of operation factor into your total ownership costs. Some rental cars might look like a good deal. But if it needs frequent and costly repairs, especially on a high-end luxury vehicle, it may end up costing you more in the long run than a higher-priced model with better quality ratings. Read next: How to test drive a used car This story originally ran on KBB.com."}]}