{"article": [{"url": "https://www.marketwatch.com/story/tesla-stock-is-overheated-remain-cautious-despite-hype-bofa-analysts-say-2020-07-22", "published": 1595418440.0, "headline": "Tesla stock is 'overheated;' remain cautious despite hype, BofA analysts say", "body": "Tesla Inc.'s TSLA, +1.89% stock valuation is \"overheated,\" analysts at BofA Securities said in a note on Wednesday, outlining several reasons to \"to remain cautious despite hype and momentum.\" The analysts increased their price target on the shares to $800, from $500, but kept their equivalent of a sell rating. The mean price target on Tesla from 31 analysts polled by FactSet is $912, with the top of the range being above $1,500. The \"hyperbolic\" rise in Tesla shares \"appears to be building on itself with similar moves in stocks of newer/niche technology companies\" like Nikola Corp. NKLA, -1.36% and \"the ongoing rotation into and momentum of growth stocks in the market,\" with technical buying ahead of Tesla's potential addition to the S&P 500 index\" adding fuel to the run, the analysts said. \"However, in our view, the $1,500+ stock price is not supported by fundamentals, with valuation driven largely by momentum and low rates.\" Among 10 reasons to remain cautious on Tesla, the analysts said that while volume growth is real, it is constrained by capacity expansion and capital availability; the EV market is likely smaller than appreciated; and Tesla's profitability and cash flow \"are not great or consistent, and are major risks.\" Moreover, while Tesla is often compared to technology companies and industry disruptors like the FAANG stocks, Tesla's business model is capital intensive, which \"makes its business much less scalable than that of a technology company.\" Tesla is slated to report second-quarter earnings after the bell, with the analysts surveyed by FactSet expecting an adjusted loss of 2 cents a share on sales of $5.2 billion. The shares have gained 280% this year, compared with gains of 1% for the S&P 500 index SPX, +0.87% and contrasting with a loss around 6% for the Dow Jones Industrial Average. DJIA, +0.56%"}]}