{"article": [{"url": "https://www.marketwatch.com/story/bill-gates-poor-us-response-is-making-pandemic-picture-more-bleak-than-i-would-have-expected-2020-06-25", "published": 1593249440.0, "headline": "Bill Gates: Poor U.S. response is making pandemic picture â\u0080\u0098more bleak than I would have expectedâ\u0080\u0099", "body": "“ â\u0080\u009cThe global picture and the U.S. picture are both more bleak than I would have expected.â\u0080\u009d ” Thatâ\u0080\u0099s Bill Gates, the Microsoft Corp. MSFT, +2.48% co-founder whose philanthropic foundation has long funded the global fight against infectious diseases, speaking about the coronavirus pandemic Thursday night during a virtual town hall on CNN. Appearing with anchor Anderson Cooper and Dr. Sanjay Gupta, Gates said the U.S. is â\u0080\u009cnot even closeâ\u0080\u009d to doing everything it can to battle the pandemic, and said the global response is worse off because of a lack of leadership from the U.S. â\u0080\u009cThe U.S. in particular hasnâ\u0080\u0099t had the leadership messages or coordination that you would have expected,â\u0080\u009d he said. â\u0080\u009cIâ\u0080\u0099m still pretty disappointed. Without U.S. leadership, itâ\u0080\u0099s been hard to pull together a response, and now the developing countries are bearing the brunt of the burden.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } Gates said he talks regularly to Dr. Anthony Fauci, the governmentâ\u0080\u0099s top infectious disease expert, and even implied that he talks to Fauci more often than President Donald Trump does. Fauci, who is on the White House coronavirus task force, said earlier this month that he hadnâ\u0080\u0099t spoken to Trump in two weeks. iframe.twitter-tweet { width: 100% !important; } Gates noted that there has been real progress in treatments for COVID-19, and that should help lower the death toll as the pandemic drags on. He also expressed optimism that a vaccine will be developed, though he warned the biggest problem may be convincing vaccine skeptics to get it. â\u0080\u009cItâ\u0080\u0099s a challenge to get that safety database to build up the confidence,â\u0080\u009d he said, adding that he thinks ultimately most people will choose to get the vaccine."}]}