{"article": [{"url": "https://www.marketwatch.com/story/us-records-most-daily-coronavirus-cases-since-april-we-are-in-deep-trouble-2020-06-24", "published": 1593078080.0, "headline": "U.S. records most daily coronavirus cases since April: â\u0080\u0098We are in deep troubleâ\u0080\u0099", "body": "HOUSTON â\u0080\u0094 A coronavirus resurgence is wiping out two months of progress in the U.S. and sending infections to dire new levels across the South and West, with hospital administrators and health experts warning Wednesday that politicians and a tired-of-being-cooped-up public are letting a disaster unfold. The U.S. recorded a one-day total of 34,700 new confirmed COVID-19 cases, the highest level since late April, when the number peaked at 36,400, according to a count kept by Johns Hopkins University. “ â\u0080\u0098People got complacent. And itâ\u0080\u0099s coming back and biting us, quite frankly.â\u0080\u0099 ” â\u0080\u0094 Marc Boom, Houston Methodist hospital system While newly confirmed infections have been declining steadily in early hot spots such as New York and New Jersey, several other states set single-day records this week, including Arizona, California, Mississippi, Nevada, Texas and Oklahoma. Some of them also broke hospitalization records, as did North Carolina and South Carolina. â\u0080\u009cPeople got complacent,â\u0080\u009d said Dr. Marc Boom, CEO of the Houston Methodist hospital system. â\u0080\u009cAnd itâ\u0080\u0099s coming back and biting us, quite frankly.â\u0080\u009d Stocks slid on Wall Street as the news dampened hopes for a quick economic turnaround. The Dow Jones Industrial Average DJIA, +0.56% Â lost over 700 points for a drop of 2.7%. The broader S&P 500 SPX, +0.87% Â fell 2.6%. Futures YM00, +0.82% Â ES00, +1.13% Â pointed to further declines on Thursday. The virus has been blamed for over 120,000 U.S. deaths â\u0080\u0094 the highest toll in the world â\u0080\u0094 and more than 2.3 million confirmed infections nationwide. On Wednesday, the widely cited University of Washington computer model of the outbreak projected nearly 180,000 deaths by Oct. 1. California reported over 7,100 new cases, and Democratic Gov. Gavin Newsom said he would withhold pandemic-related funding from local governments that brush off state requirements on masks and other anti-virus measures. Floridaâ\u0080\u0099s single-day count surged to 5,500, a 25% jump from the record set last week. In Texas, which began lifting its shutdowns on May 1, hospitalizations have doubled and new cases have tripled in two weeks. Gov. Greg Abbott told KFDA-TV the state is facing a â\u0080\u009cmassive outbreakâ\u0080\u009d and might need new local restrictions to preserve hospital space. The Houston areaâ\u0080\u0099s intensive care units are nearly full, and two public hospitals are running at capacity, Mayor Sylvester Turner said. Houston Methodistâ\u0080\u0099s Boom said Texans need to â\u0080\u009cbehave perfectly and work together perfectlyâ\u0080\u009d to slow the infection rate. â\u0080\u009cWhen I look at a restaurant or a business where people ... are not following the guidelines, where people are just throwing caution to the wind, it makes me angry,â\u0080\u009d he said. Just 17 percent of intensive-care beds were available Wednesday in Alabama â\u0080\u0094 including just one in Montgomery â\u0080\u0094 though hospitals can add more, said Dr. Don Williamson, head of the Alabama Hospital Association. â\u0080\u009cThere is nothing that Iâ\u0080\u0099m seeing that makes me think we are getting ahead of this,â\u0080\u009d he said. In Arizona, emergency rooms are seeing about 1,200 suspected COVID-19 patients a day, compared with around 500 a month ago. If the trends continue, hospitals will probably exceed capacity within the next several weeks, said Dr. Joseph Gerald, a University of Arizona public health policy professor. â\u0080\u009cWe are in deep trouble,â\u0080\u009d said Gerald, urging the state to impose new restrictions on businesses, which Gov. Doug Ducey has refused to do. Dr. Peter Hotez, an infectious-disease expert at the Baylor College of Medicine in Texas, said he worries that states will squander what time they have to head off a much larger crisis. â\u0080\u009cWeâ\u0080\u0099re still talking about subtlety, still arguing whether or not we should wear masks, and still not understanding that a vaccine is not going to rescue us,â\u0080\u009d he said. The Texas governor initially barred local officials from fining or penalizing anyone for not wearing a mask as the state reopened. After cases began spiking, Abbott said last week that cities and counties could allow businesses to require masks. So did Arizonaâ\u0080\u0099s Ducey, who is a Republican, as is Abbott. Some business owners are frustrated that officials didnâ\u0080\u0099t do more, and sooner, to require masks. â\u0080\u009cI canâ\u0080\u0099t risk my staff, my clientele, myself, my family and everybody else in that chain just because other people are too inconvenienced to wear a piece of cloth on their face,â\u0080\u009d said Michael Neff, an owner of the Cottonmouth Club in Houston. He closed it this week so staffers could get tested after one had contact with an infected person. North Carolina Gov. Roy Cooper, a Democrat, ordered people to wear masks in public as the daily count of hospitalizations and new cases hovered near records. In Florida, several counties and cities recently enacted mask requirements. In a sign of the shift in the outbreak, New York, Connecticut and New Jersey announced they will ask visitors from states with high infection rates to quarantine themselves for 14 days. In March, Florida issued such an order for visitors from the New York City area, where cases were soaring. The U.S. Justice Department took aim at Hawaiiâ\u0080\u0099s quarantine requirement for visitors, saying it discriminates against out-of-state residents. The Hawaii attorney generalâ\u0080\u0099s office says thereâ\u0080\u0099s no merit to the governmentâ\u0080\u0099s arguments and a related lawsuit from out-of-state property owners. Cases also are surging in some other parts of the world. India reported a record-breaking one-day increase of nearly 16,000 cases. Mexico and Iraq hit new highs as well. But China appears to have tamed a new outbreak in Beijing, again demonstrating its ability to mobilize vast resources by testing nearly 2.5 million people in 11 days. China, where the virus emerged last year, reported 19 new cases nationwide Thursday. While up from the day before, there was no sign of further geographic spread. Worldwide, over 9.4 million people have been confirmed infected, and nearly 500,000 have died, by Johns Hopkinsâ\u0080\u0099 count."}]}