{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-return-to-highs-after-trump-backtracks-on-fiscal-stimulus-comments-11602073995", "published": 1602087620.0, "headline": "10-Year, 30-year Treasury yield back at four-month highs after Fed minutes", "body": "ANDREW CABALLERO-REYNOLDS/AFP/Getty Images U.S. Treasury yields rose Wednesday after the minutes of the Federal Reserve’s September policy meeting showed the Fed would not tweak its asset purchases to buy more longer-dated debt. Another factor was the revived possibility of some fiscal stimulus after President Donald Trump late Tuesday said he was open to targeted measures that partially reversed his earlier cancellation of negotiations on another coronavirus aid relief package. What are Treasurys doing? The 10-year Treasury yield TMUBMUSD10Y, 0.777% rose 4.3 basis points to 0.784%, closing at its highest since June 9, while the 2-year note rate TMUBMUSD02Y, 0.156% edged 0.8 basis point higher to 0.155%. The 30-year bond yield TMUBMUSD30Y, 1.576% climbed 5 basis points to 1.587%, its highest since June 8.What’s driving Treasurys? The bond market sold off after the Fed’s minutes from their September meeting did not show any mention of the central bank planning to shift its bond purchases towards longer-dated maturities. The hope was the Fed would start paving the way for more buying of extended maturity bonds as the Treasury issues more longer-dated debt. Investors are also watching if Washington lawmakers will restart negotiations on new fiscal stimulus measures, following Trump’s about-turn late Tuesday. Trump tweeted that he was open to passing several independent coronavirus relief measures, including stimulus checks and aid to airline workers. House Speaker Nancy Pelosi said she was open to payroll support for airlines but not individual stimulus checks. Analysts note, however, Trump’s proposals would be a far cry from the multitrillion dollar stimulus package Democratic lawmakers have demanded. All the same, yields have risen again on the possibility that progress towards more fiscal spending to support the economic recovery has not been totally derailed. Investors also noted the rising odds of a Democratic clean-sweep in Congress and the presidency in November’s elections possibly resulting in Joe Biden instituting a more aggressive government spending plan next year.What did market participants’ say? There is nothing in the Fed minutes “that suggests the Committee is overly eager to announce any changes to their purchase program in the immediate near-term,” said Thomas Simons, senior money market economist at Jefferies."}]}