{"article": [{"url": "https://www.marketwatch.com/story/he-had-35000-in-retirement-savings-in-march-350-trades-later-and-hes-apparently-sitting-on-1-million-2020-07-08", "published": 1595076020.0, "headline": "He had $35,000 in retirement savings in March - 350 trades later and he's apparently sitting on $1 million", "body": "Prepare for some serious trading FOMO, courtesy of Reddit's \"WallStreetBets\" community. If his detailed story is to be believed, the user, who identifies as \"Mori226\" on the popular social-media platform, has had a spectacular run during the coronavirus pandemic, and he walked his fellow traders on Reddit through every step of his journey. \"I cracked the 7-figure mark, and then some. I started with $35k in my ROTH IRA in late February/early March,\" the trader wrote. He said he pulled out about $50,000 along the way. Check out:All about the Roth IRA Here's what his nosebleed trading climb looks like charted: How did he pull it off? Mori226 offered up some of the tips that worked best: Hold at least 50% in cash reserves at all times, don't beat yourself up on bad trades, let the winners ride, never put more than 25% in any single position and learn to cut your losses, to name just a few. \"Try to stay disciplined. Learning to control. my emotions was key,\" he said. \"Losses don't kill options traders, calculating your alternate universe net worth on your woulda-coulda-shouldas do.\" Mori226 went so far as to lay out each trade made during that stretch. Here are the biggest winners, led by huge profits betting on alternative-fuel vehicle maker Nikola Corp. NKLA, -1.36%, as well as on Amazon AMZN, +3.01% AMZN, +3.01%, Disney DIS, +1.53% and Apple AAPL, +1.74% : The trader also took some lumps, particularly on bets against the S&P 500 SPX, +0.87% : And one last bit of wisdom to impart: \"Learning to get a sense of the current trend is the hardest part... Who is your best friend? The trend. Who gives you your giant pile of tendies [profits]? The trend,\" he wrote, \"Who buys your wife a new iMac pro? The trend. Never try to 'outsmart' the market. You're going to lose you f*****g shirt.\" What do his buddies on \"WallStreetBets\" make of it all? The top comment pretty much summed up the outpouring of love, appreciation and unveiled envy: \"Congrats! Now f*** off.\""}]}