{"article": [{"url": "https://www.marketwatch.com/story/amd-stock-surges-to-record-after-outlook-contrasts-with-intels-faceplant-2020-07-29", "published": 1596039500.0, "headline": "AMD stock surges to record after outlook contrasts with Intelâ\u0080\u0099s â\u0080\u0098faceplantâ\u0080\u0099", "body": "Advanced Micro Devices Inc.â\u0080\u0099s stock surged to close at a fresh record Wednesday after the chip companyâ\u0080\u0099s strong second quarter and outlook signaled a sea change in the semiconductor market following Intel Corp.â\u0080\u0099s announced delays of next-generation chips last week. AMD AMD, -3.94% Â shares rallied to close up nearly 13% at a record $76.09, after reaching an all-time high of $77.19 during Wednesdayâ\u0080\u0099s session. For the year, AMD shares are up 66%, compared with a 14% gain for the PHLX Semiconductor Index SOX, +1.77%, an 18% gain for the tech-heavy Nasdaq Composite Index COMP, +1.39%, and a 0.9% rise by the S&P 500 index SPX, +0.87% Late Tuesday, AMD topped Wall Street estimates on its quarterly results and outlook, boosting a full-year outlook that had been considered optimistic even before the COVID-19 pandemic hit. Analysts, on average, raised their revenue estimates for AMD to $2.49 billion from $2.31 billion for the third quarter after AMD forecast sales of $2.45 billion to $2.65 billion. For the year, Wall Street sees revenue of $8.72 billion, up from a previous estimate of $8.4 billion, after AMD forecast annual sales of roughly $8.88 billion. Susquehanna Financial analyst Christopher Rolland upgraded AMD to a positive rating from neutral because the company was â\u0080\u009ccapitalizing on Intelâ\u0080\u0099s 7-nm faceplant.â\u0080\u009d Rolland also hiked his price target to $85 from $64. Rolland was referring to last weekâ\u0080\u0099s surprise announcement that Intel Corp. INTC, -1.03% Â was delaying the release of its 7-nanometer chips until at least late 2022 because of manufacturing issues. Intel shares shed 2.4% to close at $48.07 Wednesday, and are down nearly 20% on the year. In chip parlance, nanometers, or nm, refers to the size of the transistors that go on a computer chip, with the general rule being that smaller transistors are faster and more efficient in using power. AMD, on the other hand, already sells 7-nm chips, and has spent 2020 releasing more and more versions of them. Rolland sees AMD capturing 20% share of servers by 2023, following an announcement from the company that it reached its goal of â\u0080\u009cdouble-digitâ\u0080\u009d market share of the server market. By 2023, Rolland also sees AMD capturing 35% of the notebook market, up from the current 20%; 40% of desktops, up from 20%; and 10% share of data-center GPUs, up from 3% today. Read:AMD is set up for blockbuster second half, but it isnâ\u0080\u0099t guaranteed Of the 36 analysts who cover AMD, 14 have overweight or buy ratings, 19 have hold ratings, and three have sell ratings. Of those, 20 hiked their price targets on the stock, resulting in an average price target of $70.68, up from an average of $55.48, according to FactSet data. Bernstein analyst Stacy Rasgon, who has a market perform rating on AMD and raised his price target to $70 from $45, said that while some critics could complain that AMDâ\u0080\u0099s operating expenses are limiting earnings per share, now is the time for the company to invest in its operations, â\u0080\u009cgiven it is critical for them to cement their positioning in the wake of Intelâ\u0080\u0099s struggles.â\u0080\u009d â\u0080\u009cAnd to that end, the emerging reversal of fortunes between the two companies is entering into the realm of the mind-boggling as AMD for a change appears ascendant, while their larger competitor flounders,â\u0080\u009d Rasgon said. Jefferies analyst Mark Lipacis, who has a buy rating and raised his price target to $86 from $63, called the second quarter a â\u0080\u009cwatershedâ\u0080\u009d event for AMD, in that he expects AMDâ\u0080\u0099s share gains on Intel to quicken. Cowen analyst Matthew Ramsay, who has an outperform rating and raised his price target to $90 from $65, said AMDâ\u0080\u0099s â\u0080\u009cstrong results and (more importantly) consistency of product execution stood in stark contrast to Intelâ\u0080\u0099s roadmap stumbles.â\u0080\u009d â\u0080\u009cThough significant progress to date, we believe AMDâ\u0080\u0099s share gains are just beginning to play out in the market with 7nm server, desktop and GPU products all launched over the last few quarters and 7nm notebook even more recently,â\u0080\u009d Ramsay said. Oppenheimer analyst Rick Schafer, in a note titled â\u0080\u009cLet the Games Begin!,â\u0080\u009d said that while AMD was a â\u0080\u009ccompelling growthâ\u0080\u009d story, he was going to wait on the sidelines because of the high valuation of the stock. Schafer has a perform rating on AMD. Schafer cautioned that while he thinks AMD can continue to grow its share in the server market, â\u0080\u009cfurther gains may be limited given tight 7-nm availabilityâ\u0080\u009d at Taiwan Semiconductor Manufacturing Co. TSM, +1.11%, which manufactures AMDâ\u0080\u0099s chips. American depositary receipts of TSMC surged 7.5% Wednesday to close at $82.67."}]}