{"article": [{"url": "https://www.marketwatch.com/story/women-and-credit-in-the-1990s-women-made-strides-in-politics-and-pop-culture-rewrites-what-it-means-to-be-a-girl-2020-08-05", "published": 1596815480.0, "headline": "Women and credit: In the 1990s, women made strides in politics, and pop culture rewrites what it means to be a girl", "body": "This article is reprinted by permission from NerdWallet. This series examines the financial progress made by women in the U.S. since the Equal Credit Opportunity Act was passed in 1974. In this installment: the 1990s, when “third-wave” feminism began.Strides in the workplace By the end of the 1990s, women’s participation in the workforce had grown to 60% — while men’s participation shrank to 74.7% — according to the U.S. Bureau of Labor Statistics. Women’s income continued to rise in relation to men’s income, moving up to 76.5 cents on the dollar by 1999. While the steady rise of women’s wages during the ’80s and ’90s is great, it’s less uplifting when you look at the income gap between women of different races. White women were earning just 75.7 cents to every dollar white men earned in 1999, but they still made more than Black and Latina women, who made 64.1 cents and 54.5 cents, respectively. In 1993, the Family and Medical Leave Act made it illegal for many women to be ejected from the workforce for going on medical leave for pregnancy. Today, maternity and paternity leave remains unpaid, but the FMLA requires employers to hold employees’ jobs for up to 12 weeks until they return from leave for qualified medical and family reasons. Such reasons include pregnancy, adoption and foster care placement. Coverage eligibility is limited to those who have worked for a qualified company with 50 or more employees for at least one year (putting in at least 1,250 hours during that year) and live within 75 miles of that company. See: Women now have more jobs than men — but that’s not necessarily sign of progress In order to show the next generation of women their career potential, Take Our Daughters to Work Day was created in 1992 and celebrated for the first time in 1993. It was founded by the Ms. Foundation for Women and its president, Marie Wilson, with help from famed feminist Gloria Steinem. It has since been renamed Take Our Daughters and Sons to Work Day.Advances in political power Women also made great strides in politics in the ’90s. In 1992, dubbed “The Year of the Woman” by the news media, four women were elected to the Senate — Barbara Boxer and Dianne Feinstein of California, Carol Moseley Braun of Illinois (the first Black woman elected to the Senate) and Patty Murray of Washington — and 24 were elected to the House of Representatives. A year later, Janet Reno became the first woman to serve as U.S. attorney general.Pop culture While pop culture in the 1970s and 1980s featured middle-aged women who had to do “men’s work” to feed themselves and their children, the shows of the ’90s hit a different demographic: girls. With shows like “Clarissa Explains It All,” “Pepper Ann” and “Moesha,” pop culture began to focus on intelligent, outspoken feminists-in-the-making. Also read: Men exaggerate their importance at work, while women do the exact opposite “Clarissa Explains It All” — focusing on Clarissa Darling, a sarcastic teen computer-game programmer — helped debunk the myth that boys could never enjoy a TV show with a female protagonist. Pepper Ann was a sporty, independent 12-year-old with a feminist mother who brought her to a women’s weekend to learn that women are as capable as men. Moesha, who always stood up for what she believed was right, fought against racism and sexism in her school and community while getting into teenage hijinks. And this isn’t an exhaustive list of ’90s television shows with awesome girls. You don’t have to do much digging to find positive female role models in ’90s pop culture. More from this series: In the 1970s, the Equal Credit Opportunity Act became law— a key step in financial freedom for women In the ’80s, women gained career options and financial clout In the 2000s, the fight against pay discrimination continues In the 2010s, the Credit Card Act is amended and more women are breadwinners What these leading ladies did for us as a society is this: They showed the next generation of women that being a girl means whatever they want it to mean. Girls who grew up in the ’90s weren’t told they should exclusively be teachers, nurses or moms. Instead, they learned that every career opportunity was theirs for the taking, even in the face of adversity.More from NerdWallet: Can a Credit Card Company Lower My Credit Limit? Is It OK to Never Have a Credit Card? Today’s Definition of Financial Adulthood Is More Flexible Than Ever Erin El Issa is a writer at NerdWallet. Email: erin@nerdwallet.com. Twitter: @Erin_El_Issa."}]}