{"article": [{"url": "https://www.marketwatch.com/story/the-new-savings-target-for-a-modest-retirement-8-million-2020-08-17", "published": 1599315980.0, "headline": "The new savings target for a modest retirement: $8 million?", "body": "You might want to hold off on that Winnebago. The 4% Rule has long been used as a guideline for retirees in determining how much they should be able to withdraw from their retirement account while still maintaining a balance that will allow for the same income stream to flow through their golden years. But here’s a stark reality check from the man behind the popular Financial Samurai blog: “ ‘The 4% Rule as a safe withdrawal rate in retirement is dead.’ ” He explained to MarketWatch on Monday that the outdated rule was established back in 1998 by a group of professors at a time when the 10-year bond yield averaged 5%. “Therefore, of course you could withdraw 4% without any fear of running out of money when you could earn 1% more risk-free,” the Financial Samurai said. But now that interest rates are hitting rock bottom, retirement savers face a challenging future — one that perhaps, at least according to this blogger, should be shaped by a new rule. “You can use the 0.5% Rule as a safe withdrawal rate guide once you’ve reached retirement or financial independence,” he said, drawing more than a few virtual spit-takes from readers. The Financial Samurai laid it all out in this table: “Or you can use the 0.5% Rule as a stretch net worth target,” he added, operating under the goal of leaving the nest egg untapped. “To find out how much net worth you need to declare financial independence, multiply your desired annual expenses by 200. If you want to live off $40,000, then your stretch net worth goal is to accumulate $8 million.” The Financial Samurai also took a deep dive into the numbers in a recent blog post. “Although the 0.5% Rule may sound extreme, it is based on financial reality today,” he explained, amid a growing number of critiques in his comments section. “2020+ is a very different time than 1998. Inflation is much lower and risk asset returns will likely be structurally lower for a while as well. Further, you’ve got to account for a potential bear market after such tremendous growth.” He went on to apply the unsettling rule to his own situation, in which he’s aiming to generate $300,000 a year in passive income. Good luck with that. “As two unemployed parents, amassing a $30 million to $40 million net worth appears next to mission impossible,” the Financial Samurai wrote. “However, at least the 0.5% Rule has provided a new net worth target to shoot for. Now we’ve got to figure out whether it’s worth both of us trying to find day jobs again and not seeing our kids all day for the sake of more wealth.” For more on the topic, check out the full blog post along with all the moans and groans in the comments section, where one reader pretty much summed it all up by saying, “No one could ever retire at the 0.5% Rule. So why read your web page anymore. We just work till we die.” The blogger’s response: “That might be the point. To pay for the massive stimulus, the Fed and the a central government want more Americans to work longer in order to pay more taxes.” Meanwhile, the stock market continues to perform relatively well. Although the Dow Jones Industrial Average DJIA, +0.56% moved lower Monday, both the S&P 500 SPX, +0.87% and Nasdaq Composite COMP, +1.39% managed to break into positive territory, trading near records."}]}