{"article": [{"url": "https://www.marketwatch.com/story/we-get-2740-a-month-from-social-security-and-want-a-warm-friendly-city-near-the-ocean-where-should-we-retire-2019-12-05", "published": 1598093660.0, "headline": "We get $2,470 a month from Social Security and want a warm, friendly city near the ocean. Where should we retire?", "body": "Bridges connecting Punta Gorda and Port Charlotte. iStock Dear Catey, I am 67 and retired, my wife is 64 and retired. Both of us are in pretty good health, but my wife has some COPD issues that a warmer, healthier climate could definitely improve. Our present combined Social Security income is about $2,470 a month. Our total retirement savings are presently about $136,000. If we sold our home, we could probably walk away with $45,000 to $65,000. We don’t have debt — just cards that we use for purchases and generally pay off monthly. We would like to find a friendly place to live, that has good climate with nice warm days most of the time and that’s within a short distance from the ocean. We’d like affordable housing that’s a short distance to stores, restaurants, entertainment, etc. We also want low crime rates and scenic places to walk. This place could be in the U.S., or in a country not very far from the U.S. If it is in another country, it must have good, accessible and very affordable health care. We basically want to live a good life on the income we have currently. I am able also to work and earn some income if need be. I am very handy and mechanically skilled and a former welder of 49 years. Hope you can help us in choosing what’s right for us. Thank you,R.C. Dear R.C., Sunny, warm weather is within your reach — especially if you can work part-time to supplement your $2470-per-month income. Though you have $136,000 in retirement savings, I want to leave that untouched if possible, as you’ll likely need it for out-of-pocket health-care costs in retirement. The proceeds from the sale of your home might be enough for a nice down payment for a home in your future city. With that in mind, I looked for retiree-friendly warm weather spots where the cost of living was below average and housing affordable. You’ll see that they cluster in the South, which tends to be significantly cheaper than the West or Northeast, while also providing easy access to the beach. You had a long list of criteria, so not every spot hits every want of yours, but I tried to get most of them or at least get close to what you wanted. (For example, it’s often hard to find affordable housing that also lets you walk to the amenities of a town, so I looked for spots with walkable downtowns so you can walk when you get there if you find you can’t afford an apartment downtown.) Here are three spots to consider. Punta Gorda, Florida Punta Gorda, FL iStock Many a retiree has left a colder climate for Florida, thanks to warm temperatures and no state income tax — but that popularity means a lot of spots in the Sunshine State are out of reach for your budget. However, under-the-radar Punta Gorda isn’t — and it offers much of what you’re looking for, including low crime, friendly vibes, a lower-than-average cost of living and proximity to the beach (here’s a list of nearby beaches). Kiplinger’s named Punta Gorda — which is north of Fort Myers on Charlotte Harbor and the Peace River — as one of the 7 best places to retire in Florida this year noting that it “knows how to appeal to retired folks” (with a majority of residents being 65 or older). (Bonus: Sarasota -- which has one of the best hospitals in the state, according to U.S. News — is just an hour away, and there is a smaller hospital in town.) In Punta Gorda, there is “plenty of golfing, plus a Fishermen’s Village waterfront complex with 30 shops and restaurants,” Kiplinger’s writes. “Also in town, the Harborwalk along Charlotte Harbor is just a portion of the 18 miles of bike trails and pedestrian pathways you can enjoy.” You can stroll around both Fisherman’s Village and Harborwalk, and TopRetirements.com points out that one big perk of Punta Gorda is the “restored and charming downtown which is walkable and full of interesting restaurants.” Admittedly, though, the most affordable housing here is not right in downtown and on the whole Punta Gorda isn’t considered all that walkable. Of course, there are downsides like hurricane risk. And Punta Gorda is small (around 20,000 residents) so there aren’t a lot of entertainment options. That said, you’re only a half-hour from the larger and more entertainment-packed Fort Meyers (which was recently named the No. 1 waterfront city to retire in). Summerville, South Carolina Church near Summerville iStock While walkable Charleston is likely a bit too expensive for your budget, nearby Summerville (roughly 25 miles away) — which has a walkable downtown with shopping—may fit the bill. The cost of living in Summerville is slightly below average, Social Security income is not taxed in South Carolina, and one-bedroom rents average less than $1,000 a month. Forbes recently put Summerville on its list of best places to retire, highlighting the low rate of serious crime, mild winters and “sufficient physicians per capita.” You’re also under an hour from the beach (popular Folly Beach is about a 45-minute drive from Summerville) and roughly a half-hour from Charleston, which is renowned for its food, arts and culture. And historic Summerville (part of the town is on the National Register of Historic Places) offers plenty of that friendly Southern hospitality; it even claims to be the birthplace of sweet tea. It does get hot and humid here, and Summerville doesn’t have as much to offer as Charleston, but you will get to enjoy things like the annual Flowertown Festival — one of the largest arts and crafts festivals in the Southeast — historic walking tours, and more. Bay St. Louis, Mississippi Coastline of Bay St. Louis Mississippi. iStock Southern Living magazine named this one of its favorite little towns in Mississippi, and USA Today put it on a list of the best small coastal towns in America. And for you, it’s got a lot of the things you’re looking for, including affordability (the cost of living is well below average), friendly locals and a gorgeous beach; Travel + Leisure magazine calls out the “soft and buttermilk white” sand here. And as I write in my piece “4 gorgeous beach towns where you can comfortably live on $40,000 a year,” after a day on those buttermilk-white shores, “you can nosh on gumbo, po-boys and fresh Gulf seafood, while strolling down the shop-lined Main Street and chatting with friendly, creative-minded locals. And if you get bored with that, you can be in vibrant New Orleans, which is just about 60 miles away, in an hour.” Admittedly property crime is higher than average here (though violent crime is below average), but on the plus side, you’re under a half-hour from Gulfport, which boasts the third best hospital in the state, according to U.S. News. On a related note, you may also want to look into Gulf Shores, Alabama, which also checks a lot of your boxes. Want more options for beach towns? Read this MarketWatch piece on someone who wanted to be near the beach on a budget. What about going abroad? You mentioned that you’d consider retiring abroad. While I didn’t highlight any international destinations in these suggestions, I do want to point out this list of affordable, international beach towns that I recently profiled; from that list, Coronado, Panama, might be a spot you’d want to consider."}]}