{"article": [{"url": "https://www.marketwatch.com/story/why-twitter-facebook-and-youtube-are-taking-down-that-hydroxychloroquine-video-and-suspending-accounts-including-donald-trump-jr-that-shared-it-2020-07-28", "published": 1595954060.0, "headline": "Twitter, Facebook and YouTube are taking down that hydroxychloroquine video, and now Donald Trump Jr. can't tweet for 12 hours", "body": "Social-media sites have come out swinging against a video pushing misleading information about hydroxychloroquine as a COVID-19 treatment - which led to Twitter's partially suspending Donald Trump Jr.'s account. The conservative media outlet Breitbart first published the contested clip, which features men and women dressed in white lab coats and referring to themselves as \"America's Frontline Doctors\" staging a press conference outside the U.S. Supreme Court in Washington, D.C. The individuals make questionable coronavirus claims that have been proven false, such as calling hydroxychloroquine (a drug used to treat malaria, lupus and rheumatoid arthritis for decades) \"a cure for COVID\" - despite a growing body of scientific evidence that has not shown this to be an effective treatment against the virus. What's more, one of the self-identified doctors whose name is given as Stella Immanuel of Houston claims in the video that \"you don't need masks,\" despite evidence showing that face coverings help slow the spread of the coronavirus. (She has also said that alien DNA is being used in medical treatments, and gynecological problems such as cysts are caused by people having sex in their dreams with demons and witches, the Daily Beast reported.) Facebook FB, +0.26%, Twitter TWTR, -0.23%  and the Alphabet unit GOOG, +1.97% GOOGL, +1.82%  YouTube have been pulling down the video since it began going viral on Monday, but the damage was already done. By late Monday evening, NBC News reporter Brandy Zadrozny tweeted, the Breitbart clip had been viewed 20 million times on Facebook alone, and that's not including versions that have been shared among private accounts. iframe.twitter-tweet { width: 100% !important; } President Donald Trump retweeted a few versions of the video on his Twitter account before they were taken down, undermining his own recent calls for Americans to wear masks to help prevent spreading COVID-19. His son Donald Trump Jr. also tweeted the video, which led Twitter to confirm on Tuesday that it was partially suspending his account for 12 hours, meaning he is temporarily unable to send tweets, retweet posts, follow users or like messages. The company cited a policy that requires \"the removal of content that may pose a risk to people's health, including content that goes directly against guidance from authoritative sources of global and local public health information.\" The hashtag #hydroxychloroquineworks became a top trending Twitter topic on Tuesday morning, whether driven by Trump supporters or conspiracy theorists buying into the bogus drug claims, with the social-media giants accused of censorship by both. Twitter refuted the hashtag by noting under the topic tab that the drug \"is not an effective treatment for COVID-19, according to the FDA.\" Indeed, the Food and Drug Administration has revoked its emergency-use authorizations for hydroxychloroquine and chloroquine, which Dr. Anthony Fauci repeated on \"Good Morning America\" Tuesday morning. The director of the National Institute for Allergy and Infectious Diseases told ABC's DIS, +1.53%  George Stephanopoulos: \"I go along with the FDA. The overwhelming prevailing clinical trials that have looked at the efficacy of hydroxychloroquine have indicated that it is not effective in coronavirus disease.\" iframe.twitter-tweet { width: 100% !important; } Hydroxychloroquine was touted as a potential miracle drug early in the pandemic, and President Trump became a vocal advocate. The FDA issued emergency-use authorization for the malaria drug in March to treat COVID-19 patients, and clinicians across China, France and the U.S. began testing it to treat the novel coronavirus. Drug makers such as Bayer AG BAYRY, +1.32%  and Novartis AG NVS, +0.97%  donated millions of doses to the U.S. Strategic National Stockpile. There was so much excitement, despite scant evidence that it was actually effective against COVID-19, that chloroquine shortages were reported as pharmacies and hospitals stockpiled \"excessive amounts\" of the drug - something the American Medical Association, the American Pharmacists Association and the American Society of Health-System Pharmacists \"strongly\" opposed in a joint statement. Read more:There's scant evidence so far for chloroquine as a COVID-19 drug - but there's already a shortage But reality hasn't lived up to the hype. Three randomized clinical trials of hydroxychloroquine failed to prove or disprove a beneficial or a harmful effect on COVID-19. These include a study at the University of Minnesota, where researchers reported in the New England Journal of Medicine last month that the drug was no more effective than a placebo in preventing COVID-19 infections. A Spanish study of more than 2,300 people also found that the drug was not effective for early treatment of mild COVID-19. And the U.K. \"Recovery\" trial also ruled out any meaningful mortality benefit to using the drug. Related: Here's the latest on what we know works - and doesn't work - in treating coronavirus infections One by one, the World Health Organization and the National Institutes of Health dropped the drug from their clinical trials, and the FDA revoked its emergency-use authorization. The general consensus in the scientific community today is that the drug does not help COVID-19 patients. Problem is, one study published in Lancet that claimed hydroxychloroquine put COVID-19 patients at a greater risk of death was later retracted, which helped to fuel skepticism in some quarters over whether any coronavirus research could be trusted. And COVID-19 conspiracy theories have spread even as the virus itself has infected at least 16.5 million people and counting worldwide, killing 655,084. In fact, roughly one in three Americans doesn't believe that the coronavirus has killed as many people as has been reported, even as Texas and Arizona officials have requested refrigerated trucks as deceased coronavirus victims began overwhelming hospital morgues. Read:Hope dims for hydroxychloroquine even as medical study detailing the drug's failure is retracted Further confusing the public's understanding of the coronavirus, Trump has supported hydroxychloroquine time and time again, and even said he was taking the drug himself to ward off the virus. Rep. Roger Marshall, a Kentucky Republican, has also touted taking the drug as a preventative measure against COVID-19. Key Words:Trump trade adviser Navarro blasts Beijing for 'spawning' the coronavirus and 'seeding and spreading' the disease, then complains he's 'sitting on 63 million doses of hydroxychloroquine in the FEMA strategic national stockpile that I can't give away' The spread of misinformation about the coronavirus is the latest struggle Big Tech is facing, as Alphabet, Amazon AMZN, +3.01%, Apple AAPL, +1.74%  and Facebook face questioning over their business practices on Capitol Hill on Wednesday. It also comes as the Trump administration moves forward in petitioning the Federal Communications Commission to reinterpret Section 230 of the 1996 Communications Decency Act, which states that websites cannot be punished for what other people publish on their sites. The petition complains that social-media sites use Section 230 to unfairly censor conservative views."}]}