{"article": [{"url": "https://www.marketwatch.com/story/investors-got-defensive-and-vanguard-scored-big-september-etf-flows-show-11602009880", "published": 1601995940.0, "headline": "Investors got defensive and Vanguard scored big, September ETF flows show", "body": "Twenty and five dollar bills Justin Sullivan/Getty Images Investors rotated toward more defensive holdings, and continued to try to find values in sectors of the market that have been left out of 2020’s big stock-market rally, according to exchange-traded fund flows data covering the month of September. Data from CFRA’s First Bridge database showed several notable patterns among the 20 ETFs with the largest inflows. Those are shown in the table below. September exchange-traded fund inflows Invesco QQQ Trust QQQ, +1.52% $5.62 billion iShares Core S&P 500 ETF IVV, +0.87% 3.7 billion Vanguard Total Stock Market ETF VTI, +0.84% 3.63 billion Vanguard S&P 500 ETF VOO, +0.89% 2.79 billion Vanguard Total International Stock ETF VXUS, +0.69% 2.27 billion Vanguard Total Bond Market ETF BND, +0.02% 2.08 billion iShares Core U.S. Aggregate Bond ETF AGG, +0.02% 1.99 billion ProShares UltraPro QQQ TQQQ, +4.44% 1.94 billion Vanguard Total International Bond ETF BNDX, +0.10% 1.85 billion SPDR Gold Shares GLD, +1.81% 1.12 billion SPDR S&P 500 ETF Trust SPY, +0.89% 1.08 billion Vanguard Short-Term Corporate Bond ETF VCSH, +0.04% 1.04 billion ARK Innovation ETF ARKK, +2.17% 879 million iShares Edge MSCI USA Value Factor ETF VLUE, -0.50% 876 million iShares Core MSCI EAFE ETF IEFA, +0.68% 858 million Industrial Select Sector SPDR Fund XLI, +0.37% 852 million Vanguard Value ETF VTV, +0.17% 839 million Vanguard Dividend Appreciation ETF VIG, +0.89% 788 million iShares Gold Trust IAU, +1.82% 778 million Goldman Sachs ActiveBeta U.S. Large Cap Equity ETF GSLC, +0.84% 758 million Source: CFRA’s First Bridge Database Among the trends in September: investor interest in bond funds, which has been on fire all year, cooled slightly. Only four bond funds were represented among the top 20, while eight made it onto the year-to-date top 20. And the four with the biggest gains in September represented “a tilt toward defensiveness,” said Todd Rosenbluth, CFRA’s head of mutual fund and ETF research. There’s only one purely corporate bond fund on September’s list, and it’s ultrashort term. The rest are broad-market funds. Compare that to the year to date, when iShares iBoxx $ Investment Grade Corporate Bond ETF LQD, +0.23% is the fifth-biggest flows gainer, picking up $15.4 billion so far. Conversely, stock fund investors in September tried, tentatively, to leave the perceived safety of big growth strategies, which have dominated this year. The iShares Edge MSCI USA Value Factor ETF and Vanguard Value ETF picked up big flows, and one out-of-favor sector, industrials, also had a strong month. It’s hard to call this the start of a real rotation, Rosenbluth said in an interview, but it’s more than a “headfake. Investors are dipping their toes in cautiously,” he added. Also of note in September: Vanguard dominated incoming money. It had 8 of the top 20 gainers, and 43% of dollar flows. The company tends to attract investors who are making portfolio allocation changes, not traders, Rosenbluth explained. Unlike its competitors, iShares and State Street, which can easily chart massive inflows and outflows for the same funds as traders use them for positioning, Vanguard flows “tend to be steadier” since investors are using them for buy-and-hold purposes. For the company, “this was a particularly impressive month,” Rosenbluth said. See: Vanguard is still on top of fund flows, even after a not-so-hot April"}]}