{"article": [{"url": "https://www.marketwatch.com/story/us-manufacturers-grow-again-in-august-for-fourth-month-in-a-row-ism-finds-2020-09-01", "published": 1598960300.0, "headline": "U.S. manufacturers grow fourth month in a row, ISM finds, but they arenâ\u0080\u0099t bringing all their workers back", "body": "The numbers: American manufacturers grew again in August for the fourth straight month, but companies still arenâ\u0080\u0099t bringing back lots of workers or seeking to increase investment with the coronavirus pandemic still infecting the economy. The Institute for Supply Management said its manufacturing index rose to 56% in August from 54.2% in July. Readings over 50% indicate growth. Economists surveyed by MarketWatch had forecast the index to total 54.9%. Althought the index hit a 21-month high, manufacturers arenâ\u0080\u0099t doing as well now as they were two years ago. Businesses executives are asked if their companies are doing better or worse compared with the prior month, but the survey doesnâ\u0080\u0099t reveal how much better. Most manufacturers are producing fewer goods with fewer workers than they were before the coronavirus pandemic. The index had fallen to an 11-year low of 41.5% in April during the height of the crisis. Read:Fedâ\u0080\u0099s Clarida says new inflation-fighting strategy has roots in failure of old approach What happened: New orders and production both rose in a good sign for the economy. The index for new orders jumped to 67.6% from 61.5%, marking the highest level since 2004. Yet other measures of actual production show new orders are actually still about 5% below precrisis levels. The production gauge rose to 63.3% from 62.1%. Timothy Fiore, chairman of the survey, said executives were â\u0080\u009cgenerally optimisticâ\u0080\u009d but â\u0080\u009cto a lesser degree compared with July.â\u0080\u009d Coronavirus cases spiked during the summer and sapped the economy of some of the momentum built up in May and June. The employment gauge, meanwhile, also increased, but manufacturers have reduced hours and staff levels because of weaker domestic and foreign demand for their products. The employment index crept up to 46.4%, but any number below 50% is a negative sign. Fifteen of the 18 industries tracked by ISM expanded in August up from 13 in the prior month. The ISM index is compiled from a survey of executives who order raw materials and other supplies for their companies. The gauge tends to rise or fall in tandem with the health of the economy. See: MarketWatch Economic Calendar Big picture: Manufacturers are outperforming other key segments of the economy and helping to lead a recovery. Thatâ\u0080\u0099s the good news. The bad news? They donâ\u0080\u0099t feel confident enough to bring back more workers or to justify new investments. â\u0080\u009cMany panelistsâ\u0080\u0099 companies are holding off on capital investments for the rest of 2020,â\u0080\u009d Fiore said. The cautionary approach is likely to act as a brake on the recovery and prevent the economy from speeding up much before the end of the year. See:MarketWatch Coronavirus Recovery Tracker What they are saying? â\u0080\u009cOverall the survey still suggests that manufacturing in the U.S. is rebounding a little quicker post-lockdown than we had initially expected,â\u0080\u009d said senior economist Andrew Grantham of CIBC Economics. â\u0080\u009cNot all firms have the capacity to bring all of their staff back from furlough and those that do face difficult challenges in figuring out how and when to safely bring their workers back to work,â\u0080\u009d economists Thomas Simons and Aneta Markowska of Jefferies LLC wrote to clients. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% rose modestly in Tuesday trades."}]}