{"article": [{"url": "https://www.marketwatch.com/story/the-pandemic-is-about-to-enter-its-most-treacherous-phase-11599770478", "published": 1599845480.0, "headline": "The COVID-19 pandemic is about to enter its most treacherous phase", "body": "Getty Images BERKELEY, Calif. (Project Syndicate)—April marked the most dramatic and, some would say, dangerous phase of the COVID-19 crisis in the United States. Deaths were spiking, bodies were piling up in refrigerated trucks outside hospitals in New York City, and ventilators and personal protective equipment were in desperately short supply. The economy was falling off the proverbial cliff, with unemployment soaring to 14.7%. Since then, supplies of medical and protective equipment have improved. Doctors are figuring out when to put patients on ventilators and when to take them off. We have recognized the importance of protecting vulnerable populations, including the elderly. The infected are now younger on average, further reducing fatalities. With help from the Coronavirus Aid, Relief, and Economic Security (CARES) Act, economic activity has stabilized, albeit at lower levels. Or so we are being told. U.S. jobless claims rise for fourth straight week, in sign of stalling labor market In fact, the more dangerous phase of the crisis in the U.S. may actually be now, not last spring. New normal is 40,000 infections a day While death rates among the infected are declining with improved treatment and a more favorable age profile, fatalities are still running at nearly a thousand per day. This matches levels at the beginning of April, reflecting the fact that the number of new infections is half again as high. Mortality, in any case, is only one aspect of the virus’s toll. Many surviving COVID-19 patients continue to suffer chronic cardiovascular problems and impaired mental function. If almost 40,000 cases a day is the new normal, then the implications for morbidity—and for human health and economic welfare—are truly dire. “ The silver bullet on which everyone is counting, of course, is a vaccine. This, in fact, is the gravest danger of all. ” And, like it or not, there is every indication that many Americans, or at least their current leaders, are willing to accept 40,000 new cases and 1,000 deaths a day. They have grown inured to the numbers. They are impatient with lockdowns. They have politicized masks.Economic danger This is also a more perilous phase for the economy. In March and April, policy makers pulled out all the stops to staunch the economic bleeding. But there will be less policy support now if the economy again goes south. Although the Federal Reserve can always devise another asset-purchase program, it has already lowered interest rates to zero and hoovered up many of the relevant assets. This is why Fed officials have been pressing the Congress and the White House to act. Unfortunately, Congress seems incapable of replicating the bipartisanship that enabled passage of the CARES Act at the end of March. The $600 weekly supplement to unemployment benefits has been allowed to expire. Divisive rhetoric from President Donald Trump and other Republican leaders about “Democrat-led” cities implies that help for state and local governments is not in the cards. Breaking news: Fiscal stimulus prospects at dead end after Senate vote, a top Republican says Consequently, if the economy falters a second time, whether because of inadequate fiscal stimulus or flu season and a second COVID-19 wave, it will not receive the additional monetary and fiscal support that protected it in the spring.The danger of rushing out a vaccine The silver bullet on which everyone is counting, of course, is a vaccine. This, in fact, is the gravest danger of all. There is a high likelihood that a vaccine will be rolled out in late October, at Trump’s behest, whether or not Phase 3 clinical trials confirm its safety and effectiveness. This specter conjures memories of President Gerald Ford’s rushed swine flu vaccine, also prompted by a looming presidential election, which resulted in cases of Guillain-Barré syndrome and multiple deaths. This episode, together with a fraudulent scientific paper linking vaccination to autism, did much to help foster the modern antivax movement. “ If the economy falters a second time, whether because of inadequate fiscal stimulus or flu season and a second COVID-19 wave, it will not receive the additional monetary and fiscal support that protected it in the spring. ” The danger, then, is not merely side effects from a flawed vaccine, but also widespread public resistance even to a vaccine that passes its Phase 3 clinical trial and has the support of the scientific community. This is especially worrisome insofar as skepticism about the merits of vaccination tends to rise anyway in the aftermath of a pandemic that the public-health authorities, supposedly competent in such matters, failed to avert. Studies have shown that living through a pandemic negatively affects confidence that vaccines are safe and disinclines the affected to vaccinate their children. This is specifically the case for individuals who are in their “impressionable years” (ages 18-25) at the time of exposure, because it is at this age that attitudes about public policy, including health policy, are durably formed. This heightened skepticism about vaccination, observed in a variety of times and places, persists for the balance of the individual’s lifetime.No alternative The difference now is that Trump and his appointees, by making reckless and unreliable claims, risk aggravating the problem. Thus, if steps are not taken to reassure the public of the independence and integrity of the scientific process, we will be left only with the alternative of “herd immunity,” which, given COVID-19’s many known and suspected comorbidities, is no alternative at all. All this serves as a warning that the most hazardous phase of the crisis in the U.S. will most likely start next month. And that is before taking into account that October is also the beginning of flu season. Barry Eichengreen is professor of economics at the University of California, Berkeley, and a former senior policy adviser at the International Monetary Fund. His latest book is “The Populist Temptation: Economic Grievance and Political Reaction in the Modern Era. “ This article was published with permission of Project Syndicate—The Pandemic’s Most Treacherous Phase"}]}