{"article": [{"url": "https://www.marketwatch.com/story/fauci-says-covid-19-has-one-characteristic-hes-never-seen-before-ive-been-dealing-with-viral-outbreaks-for-the-last-40-years-2020-06-23", "published": 1594565000.0, "headline": "Fauci says that in his 40 years of dealing with viral outbreaks, heâ\u0080\u0099s never seen anything like COVID-19", "body": "There's one thing about COVID-19 that makes it highly effective in traveling from host to host. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases for three decades and one of the leading experts on pandemics in the U.S. for the last four decades, said SARS-Cov-2 is proving to be a unique and peculiar virus, one that he has not seen the like of before. “ â\u0080\u0098Iâ\u0080\u0099ve been dealing with viral outbreaks for the last 40 years. Iâ\u0080\u0099ve never seen a single virus â\u0080\u0094 that is, one pathogen â\u0080\u0094 have a range where 20% to 40% of the people have no symptoms.â\u0080\u0099 ” â\u0080\u0094 Dr. Anthony Fauci, National Institute of Allergy and Infectious Diseases He told U.S. lawmakers that COVID-19, the disease caused by the novel coronavirus, has taken him by surprise, particularly in one singular way that helped lead to one of the biggest public health crises in a generation. â\u0080\u009cIâ\u0080\u0099ve been dealing with viral outbreaks for the last 40 years. Iâ\u0080\u0099ve never seen a single virus â\u0080\u0094 that is, one pathogen â\u0080\u0094 have a range where 20% to 40% of the people have no symptoms,â\u0080\u009d he told a recent House Committee on Energy and Commerce hearing on the Trump administration's response to the novel coronavirus pandemic. The World Health Organization currently estimates that 16% of people with COVID-19 are asymptomatic and can transmit the coronavirus, while other data show that 40% of coronavirus transmission is due to carriers not displaying symptoms of the illness. As a result, public health officials have advised people to keep a distance of 6 feet from one another. Related:With resurgence of COVID-19 cases in the U.S., Trump signals rift with Fauci: â\u0080\u0098Heâ\u0080\u0099s made a lot of mistakesâ\u0080\u0099 Fauci also said the virus may be mutating to become more transmissible. â\u0080\u009cWe donâ\u0080\u0099t have a connection between whether an individual does worse with this or not. It just seems that the virus replicates better and may be more transmissible. But this is still at the stage of trying to confirm that,â\u0080\u009d he said in an interview with the Journal of the American Medical Association on Thursday that the virus may be mutating to become more transmissible, with high viral loads. Fauci previously said that the U.S. government had not been doing well with contact tracing, the process of tracing people who have been in contact with someone identified to have the virus, instructing them to stay home, and connecting them with the resources they need to do so. â\u0080\u009cI donâ\u0080\u0099t think weâ\u0080\u0099re doing very well, for a number of reasons, and not all of which is the fault of the system,â\u0080\u009d he said in an interview with CNN. COVID-19, the disease caused by the virus SARS-CoV-2, has already proven extremely infectious. It had infected 12.8 million people globally and over 3.3 million in the U.S. as of Sunday, according to official figures collated by Johns Hopkins Universityâ\u0080\u0099s Center for Systems Science and Engineering. The disease had claimed at least 566,055 lives worldwide and 134,904 in the U.S. Confirmed coronavirus cases have recently risen in nearly 40 U.S. states. A recent University of California, San Francisco, study found that thereâ\u0080\u0099s a high load of SARS-CoV-2 shedding in the upper respiratory tract, even among pre-symptomatic patients, â\u0080\u009cwhich distinguishes it from SARS-CoV-1, where replication occurs mainly in the lower respiratory tract.â\u0080\u009d Such a viral load makes symptom-based detection of infection less effective in the case of SARS CoV-2, it said. Fauci dismissed criticism that federal authorities had created a serious misstep by telling the public not to wear masks during the early days of the pandemic, only to reverse that decision later on. The Centers for Disease Control and Prevention, the White House and even the World Health Organization all reversed their positions on the efficacy of wearing masks over time. “ â\u0080\u0098There was a paucity of equipment [needed by] our health-care providers, who put themselves daily in harmâ\u0080\u0099s way of taking care of people who are ill.â\u0080\u0099 ” â\u0080\u0094 Anthony Fauci pushing back on criticism that federal authorities misled the public on the effectiveness of wearing masks â\u0080\u009cOK, weâ\u0080\u0099re going to play that game,â\u0080\u009d Fauci said when questioned about the seemingly sudden U-turn in public-health policy. â\u0080\u009cI donâ\u0080\u0099t regret that because â\u0080\u0094 let me explain to you what happened. At that time, there was a paucity of equipment that our health-care providers needed, who put themselves daily in harmâ\u0080\u0099s way of taking care of people who are ill.â\u0080\u009d After two months of obfuscation over the efficacy of face masks, during which New York City became the epicenter of the pandemic in the U.S., and one month after the WHO declared the COVID-19 outbreak a pandemic, U.S. federal authorities said all Americans should, after all, wear face coverings in public settings. Fauci has said he was hopeful that a coronavirus vaccine could be developed by early 2021. But last month, Fauci said many states have reopened too quickly, and people are not abiding by rules of social distancing. â\u0080\u009cWhat we saw were a lot of people who maybe felt that because they think they are invulnerable, and we know many young people are not because theyâ\u0080\u0099re getting [this] serious disease; therefore theyâ\u0080\u0099re getting infected has nothing at all to do with anyone else when, in fact, it does,â\u0080\u009d Fauci he told CNN. Related: 5 critical mistakes that created the biggest public-health crisis in a generation In states where coronavirus spread is surging, like Arizona, Texas, Florida and California, he said, â\u0080\u009c20% to 40% of the people who are infected donâ\u0080\u0099t have any symptoms, so the standard, classic paradigm of identification, isolation, contact tracing doesnâ\u0080\u0099t work no matter how good you are, because you donâ\u0080\u0099t know who youâ\u0080\u0099re tracing.â\u0080\u009d Florida reported 15,299 new daily coronavirus cases on Sunday, its highest single day count ever. In early June, new daily cases were hovering around 1,000. Despite the surge, Walt Disney World DIS, +1.53% Â in Orlando pushed ahead with its planned reopening Saturday. The theme park closed on March 15. Social-distancing measures such as reduced capacity on rides and lower overall attendance along with temperature checks are in place in the park, a key Florida tourist attraction. Florida Gov. Ron DeSantis, a Republican, told CNN on Thursday: â\u0080\u009cWe spent months saying that there were certain things that were essential. That included fast-food restaurants, it included Walmart WMT, +1.00%, it included Home Depot HD, +0.49%. If fast food and Walmart and Home Depot â\u0080\u0094 and, look, I do all that, so Iâ\u0080\u0099m not looking down on it â\u0080\u0094 but if all that is essential, then educating our kids is absolutely essential.â\u0080\u009d The Dow Jones Industrial Index DJIA, +0.56% Â and the S&P 500 SPX, +0.87% Â ended higher Friday on hopes of progress with a vaccine, despite surge of coronavirus in states that have loosened restrictions. How COVID-19 is transmitted"}]}