{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-sets-record-for-new-cases-in-a-single-day-as-texas-becomes-first-state-to-reimpose-restrictions-2020-06-26", "published": 1593182420.0, "headline": "Coronavirus update: U.S. sets record for new cases in a single day, as Texas becomes first state to reimpose restrictions", "body": "The number of new confirmed cases of the coronavirus illness COVID-19 set a fresh record in the U.S. on Thursday of almost 40,000, according to data aggregated by Johns Hopkins University, amid a rise in hospitalizations and deaths in states in the South and West after reopening for business. The data shows several states, including Texas, Alabama and Nevada, reported record one-day increases in infections. A full 30 states have seen cases increase in the last two weeks, a New York Times tracker shows, led by California, Texas and Florida. Texas, Florida and Arizona have paused their efforts to reopen as hospitals approach full capacity. Texan Gov. Greg Abbott reimposed a ban on elective surgeries, to keep space for COVID-19 patients, as the Associated Press reported. On Friday, Abbott went a step further, issuing an executive order that closes all bars, further limits restaurant capacity and restricts certain outdoor activities, including tubing and rafting, that are popular with Texans. “As I said from the start, if the positivity rate rose above 10%, the State of Texas would take further action to mitigate the spread of COVID-19,” the governor said in a statement. “At this time, it is clear that the rise in cases is largely driven by certain types of activities, including Texans congregating in bars.” Shortly after the Texas news, Florida banned alcohol consumption at its bars. The Centers for Disease Control and Prevention (CDC) said Thursday that an estimated 20 million Americans, about 6% of the population, have likely been infected with COVID-19, according to a nationally representative survey it conducted using blood samples. This figure, which takes into account asymptomatic people and those who were sickened but did not get tested for COVID-19, is more than eight times larger than the estimated 2.3 million tests that have been performed in the U.S. The administration of President Donald Trump is considering a new approach to testing, using a pooled strategy that could help find infected patients faster and quickly isolate them, the Washington Post reported. Dr. Anthony Fauci, head of the National Institute for Allergies and Infectious Diseases, told the paper that health officials are in “intense discussions” on pool testing. The strategy involves testing samples from many people all together. If the tests are negative, the group can be considered to be infection-free. If the test is positive, only then would individual tests be needed, he said. “What you need to do is find the penetration of infected people in your society,” Fauci told the paper. “And the only way you know that is by casting a broad net.” Germany, Israel and other countries are using pool testing. The White House Task Force created to manage the pandemic held its first public briefing in two months on Friday, but took very few questions from reporters. Vice President Mike Pence acknowledged that the surge in cases in the South is of concern, but said half of new cases are patients below the age of 35, “which is very encouraging, because younger people are less susceptible to serious outcomes.” Fauci emphasized that the virus poses a special challenge in the high number of carriers that have no symptoms, which makes them unlikely to seek testing and enable health officials to trace and isolate their contacts. He called on young people in particular to understand their individual responsibility as well as their societal one. “If we want this to end, realize you are part of the process and can either be part of the solution of part of the problem,” he said. In a move that has bewildered many, the Trump administration on Thursday urged the Supreme Court to overturn the Affordable Care Act, a move that would strip more than 20 million Americans of health coverage. The administration made the filing with the high court in a continuation of the 10-year battle that Republicans have fought over the act known as “Obamacare” ever since its passage in 2010. House Speaker Nancy Pelosi slammed the administration for the move, coming in the midst of the worst public-health crisis since the 1918 flu outbreak. Pelosi is planning a floor vote early next week on her own bill to expand the ACA. “There is no legal justification and no moral excuse for the Trump administration’s disastrous efforts to take away Americans’ health care,” she said in a statement. Billionaire philanthropist Bill Gates, whose foundation has long funded global fight against infectious diseases, also criticized the government on Thursday, for failing to manage the crisis. In a virtual town hall on CNN, Gates said the U.S. is “not even close” to doing everything it can to battle the pandemic, and said the global response is worse off because of a lack of leadership from the U.S. “The U.S. in particular hasn’t had the leadership messages or coordination that you would have expected,” he said. “I’m still pretty disappointed. Without U.S. leadership, it’s been hard to pull together a response, and now the developing countries are bearing the brunt of the burden.”Latest tallies There are now 9.7 million confirmed cases of COVID-19 worldwide and at least 491,095 people have died, the Johns Hopkins data shows. About 4.9 million people have recovered. The U.S. continues to lead the world, with a case tally of 2.44 million and death toll of 124,732, more than double the next highest totals of 1.23 million cases and 54,971 deaths in Brazil. Russia is third in cases with 619,936, followed by India with 490,401 and the U.K. with 310,836. The U.K. has 43,498 fatalities, the highest in Europe and third highest in the world. China, where the illness was first reported late last year, has 84,704 cases and 4,641 fatalities.What’s the latest medical news? A number of small biotechs were moving Friday on COVID-19-related news. Vaxart Inc. stock VXRT, +0.97% skyrocketed 77%, on the news that its oral COVID-19 vaccine has been selected to take part in a non-human primate challenge study funded by the U.S. government’s ‘Operation Warp Speed’ program, that aims to accelerate development of a vaccine. The study is designed to evaluate the efficacy of the candidate. Chief Executive Andrei Floroiu said it’s the only oral candidate in the program. “SARS-CoV-2, the coronavirus that causes COVID-19, is primarily transmitted by viral particles that enter through the mucosa - nose, mouth or eyes - strongly suggesting that mucosal immunity could serve as the first line of defense,” he said in a statement. “In addition, our vaccine is a room temperature-stable tablet, an enormous logistical advantage in large vaccination campaigns.” Inovio Pharmaceuticals Inc. shares INO, -1.36% rose nearly 4%, erasing an earlier loss of as much as 21%, after a Stifel analyst downgraded the stock to hold from buy, while raising his stock price target to $24 from $19. Stifel’s Stephan Willey said the risk-versus-reward investment scenario “seems less palatable” at current prices. “While acknowledging peer COVID-19 vaccine company valuations would suggest we’re potentially leaving significant upside on the table should promising immunogenicity data (i.e. robust neutralizing antibody responses) and a large government-written check subsequently materialize, we also believe any potential downside risk in the absence of the aforementioned events occurring is equally-significant,” Willey wrote in a note to clients. Don’t miss: Race for a COVID-19 vaccine has drug makers scaling up manufacturing — before one is developed Shares of IBio Inc. IBIO, -0.48% , which is developing a plant-based vaccine in collaboration with Beijing CC-Pharming Ltd., rose 47% on the news that it will join the Russell 2000 RUT, +0.55% and Russell 3000 RUA, +0.86% indexes on Monday.What are companies saying? There was grim news for sporting goods maker Nike Inc. NKE, +0.97% after it swung to a loss for its fiscal fourth quarter and sale sales fell a whopping 38% despite a big surge in online shopping. The Dow Jones Industrial Average component saw its shares slide 6% in early trade. Nike lost $790 million, or 51 cents a share, in the fourth quarter, contrasting with earnings of $989 million, or 62 cents a share, in the year-ago quarter. Sales fell to $6.3 billion from $10.1 billion a year ago. Nike pinned the 38% drop on store closures due to the coronavirus pandemic and fewer shipments to its wholesalers, which increased inventory. Analysts polled by FactSet had expected Nike to report a GAAP loss of 8 cents a share on sales of $7.3 billion. The company vowed to continue to invest more in online sales. “We are uniquely positioned to grow, and now is the time to build on Nike’s strengths and distinct capabilities,” Chief Executive John Donahoe said in a statement. “We are continuing to invest in our biggest opportunities, including a more connected digital marketplace, to extend our leadership and fuel long-term growth.” Elsewhere, companies continued to offer updates on reopening efforts and to raise funds to bolster liquidity positions. Here are the latest things companies have said about COVID-19: • Big Lots Inc. BIG, -0.72% has seen a continuation of the strong demand that began in mid-April during the pandemic, putting its same-store sales in the second quarter-to-date “well ahead of expectations.” Columbus, Ohio-based Big Lots is now expecting second-quarter same-store sales to be up in a mid-to-high twenties percentage, which reflects some moderation from current trends. That is far ahead of the 13.3% FactSet consensus. It expects second-quarter adjusted per-share earnings to range from $2.50 to $2.75, excluding a gain of about $11 a share on the sale of four distribution centers in a sale and leaseback transaction. That will be up from 53 cents in the same period a year ago. The FactSet consensus is for EPS of 84 cents. The company has cash of about $890 million and has not tapped its $700 million revolving credit facility. The cash position does not include about $170 million relating to the sale/leaseback deal. • The Kroger Co.’s KR, +0.46% board approved an increase in its quarterly dividend to 18 cents a share from 16 cents. The new dividend will be payable Sept. 1, to shareholders of record as of close of business Aug. 14. The supermarket chain posted better-than-expected first-quarter earnings last week as consumers stocked up for in-home dining during the pandemic. • Office Depot Inc. ODP, -2.49% is planning a 1-for-10 reverse stock split effective June 30. The Boca Raton, Florida-based office goods retailer said shareholders approved the move at its May 11 annual meeting. The company will not issue any fractional shares in connection with the move, but shareholders who would have been entitled to them will receive a cash payment in lieu. • Progress Software Corp. PRGS, +1.79% hiked its outlook for the year even as earnings fell short of Wall Street estimates. “We had solid performances across our segments and products, and our business has proven to be extremely durable, despite the ongoing economic disruption caused by COVID-19,” said Progress Chief Executive Yogesh Gupta in a statement. “Our confidence in our ability to execute is reflected in our increased full-year guidance for revenue and EPS.” • Spectrum Brands Holdings Inc. SPB, +0.76% launched a $300 million offering of 10-year bonds on Friday, joining the many companies issuing debt during the pandemic. The company, which owns a portfolio of brands including George Forman, Russell Hobbs and Remington, said the proceeds will be used to repay part of a revolving credit facility. Coronavirus Update: States Prepare for Virus Surge, Fed’s Stress Test"}]}