{"article": [{"url": "https://www.marketwatch.com/story/off-the-beaten-road-the-2021-jeep-gladiator-reviewed-2020-10-08", "published": 1602133940.0, "headline": "Off the beaten road: The 2021 Jeep Gladiator reviewed", "body": "The 2021 Jeep Gladiator mixes the functionality of a midsize pickup truck with the iconic styling and off-road capability of the legendary Jeep Wrangler. Based on the Wrangler, the Gladiator is the first Jeep pickup since the Comanche ended production in 1992. It has a 4-door body with a 5-foot bed, like most of the short bed offerings in this midsize truck class. Two soft-tops, a black plastic hard top and a body-colored hard top are available. The nicer of the two soft tops, called the Premium Sunrider, is made of heavy-duty canvas. The hard tops are a 3-piece design with removable panels over the driver and passenger seats. Virtually identical to the Wrangler from the rear doors forward, the Gladiator offers all the benefits of a midsize pickup with its rear architecture, enabling excellent towing and payload capacities, especially with the Max Trailer Tow package available on Sport models. The Jeep Gladiator Jeep Configured in this way, the Gladiator can tow 7,650 pounds, second only in the class to the diesel-powered Chevrolet Colorado, that can tow 7,700 pounds. With this package also comes a maximum payload capacity of 1,535 pounds. The Rubicon version can tow a still-respectable 7,000 pounds and haul 1,160 pounds.What’s new for 2021? The diesel V6 engine alternative is now available. Every version is eligible for full-time 4-wheel drive with low-range gearing. The entry-level Sport trim now offers LED headlights and fog lights. Overland trim joins the Rubicon in offering a front-facing Trail Cam. And 80th Anniversary Edition and Willys packages join the options list. What we like It’s an off-roader It’s a convertible It’s a pickup Great customizability Class-leading towing and payload capacity What we don’t Solid axles are a drawback on-road Boxy interior can feel cramped How much? $35,040 to $45,370Fuel economy The Gladiator’s main engine is a 3.6-liter V6 making 285 horsepower and 260 lb-ft of torque. A 6-speed manual transmission is standard, an 8-speed automatic is optional. All-wheel drive (AWD) is also standard throughout the range. The EPA estimates fuel consumption at 16 miles per gallon in the city, 23 mpg on the highway and 19 mpg in combined driving (manual) or 17 mpg city/22 mpg hwy/19 mpg combined (automatic). A 3.0-liter diesel V6 is optional in the Sport, Overland and Rubicon versions. It generates 260 hp and a muscular 442 lb-ft of torque. An 8-speed automatic is the sole transmission with this engine. See: A plug-in hybrid Jeep is coming. Check out the Wrangler 4xe The EPA puts consumption at 22 mpg city/28 mpg hwy/24 mpg combined (Sport/Overland) or 20 mpg city/25 mpg hwy/22 mpg combined (Rubicon).Standard features and options Every 2021 Jeep Gladiator comes with 4-wheel drive, 5-foot bed, four removable doors, removable top, and a fold-down windshield. The premium soft top costs $595, the basic black 3-piece hard top is $1,395 and the body-colored 3-piece hardtop comes in at $2,395. Trim levels are Sport, Overland, Mojave and Rubicon. Sport ($35,040) is the entry level, with 17-in steel wheels, fog lights, manual roll-up windows, manual door locks, plastic steering wheel, cloth upholstery, push-button start, manually adjustable front seats, air conditioning, wash-out interior with drain plugs, Sunrider folding soft-top with sunroof, under-body protection for the fuel tank and transmission transfer case, Dana 44 front/rear solid axles, 4-pin/7-pin trailer wiring, cargo bed lights, lockable storage behind the rear seats, 5-in infotainment display, USB port, auxiliary audio input, Bluetooth, and an 8-speaker audio setup. This trim is eligible for a limited-slip rear differential, power windows/locks, heated side mirrors, 17-inch alloy wheels, tinted rear glass, leather-wrapped steering wheel, and satellite radio, plus the Sport S package that bundles most of these options together, and the Max Trailer Tow package. The comfort-focused Overland ($41,890) comes with power windows and locks (including the tailgate), 18-in alloy wheels, keyless entry/ignition, tinted rear glass, dual-zone climate controls, automatic on/off headlights, heated side mirrors, side steps, ambient LED footwell lighting, leather-wrapped steering wheel, 115-volt outlet, universal garage door opener, 7-in infotainment touchscreen, satellite radio, two extra USB-C ports, and Android Auto/Apple AAPL, +1.74% CarPlay smartphone integration. Mojave ($45,370) has Dana 44 axles with wider tracks, an electronic locking rear differential, Fox internal-bypass shock absorbers with external reservoirs, Fox front hydraulic jounce bumpers, high-clearance fender flares, extra under-body protection, 33-inch Falken all-terrain tires on 17-inch alloy wheels, and four tow hooks (two at each end). Rubicon ($45,370) adds an electronic locking differential up front, an electronically disconnecting front anti-roll bar (for greater axle articulation), Fox monotube shock absorbers (but no front jounce bumpers), Rock-Trac part-time 4×4 system with a transfer case and 4:1 crawl ratio, Selec-Speed Control, (basically off-road cruise control), rock rails to protect the rocker panels, black headlight surrounds and grille inserts, and a vented hood. This trim is also eligible for a steel front bumper with detachable ends and accommodation for a winch. The lower three trims may be fitted with Selec-Trac full-time 4-wheel drive and transfer case; Rubicon trim offers the option of full-time 4-wheel drive with a shift-on-the-fly transfer case. The top three trims can also be upgraded with a forward-facing Trail Cam, body-colored 3-piece hard top, leather-trimmed seating, real-time traffic updates for the satellite radio, self-dimming rearview mirror, navigation, and an 8.4-inch infotainment touchscreen. The 80th Anniversary bundle includes 18-inch alloy wheels with a Granite Crystal finish, metallic exterior accents, 8.4-inch infotainment touchscreen and Berber mats. The Willys bundle features 32-inch mud-terrain tires, rock rails and a limited-slip rear differential. There’s also a whole range of Mopar additions to personalize the Gladiator further. Also see: A first look at Toyota’s new RAV4 plug-in hybrid All versions of the 2021 Gladiator are eligible for an 8-speed automatic transmission, remote start, spray-in bed liner, tonneau cover, adjustable rail-based tie-down system, Premium Sunrider soft top, dual tops, blank auxiliary switches for aftermarket electronics, 9-speaker/552-watt Alpine audio upgrade, removable Bluetooth wireless speaker, heated front seats/steering wheel, lockable/removable compartment under the rear seats, full LED exterior lighting, and driver aids. Safety The Gladiator is available with forward collision warning and advanced brake assist, plus adaptive cruise control. with a low-speed function, which is fully capable of stopping the vehicle in traffic and getting it going again once the car in front has started moving, blind spot monitoring, and rear parking sensors. Neither the National Highway Traffic Safety Administration nor the Insurance Institute for Highway Safety had crash-tested the Gladiator at the time of compiling this review. Behind the wheel With great build quality throughout, the Jeep Gladiator inspires confidence. That said, although the Gladiator always feels safe and planted, its solid axles — installed purely for their off-road benefits — bring some disadvantages on the tarmac. The Gladiator is a little wobbly when cornering and doesn’t absorb potholes as well as other midsize trucks. This is because, unlike the more on-road-oriented independent front suspensions (found in the rest of this class) that allow each wheel to absorb bumps individually, a solid axle transfers motion from one wheel across the axle to the other. Don’t miss: Five cars we wish were still being made Running over a road imperfection with the left tire means both the left and right tires absorb the impact, which is then felt throughout the entire vehicle. As a result, drivers may experience greater fatigue in the Gladiator over long highway stretches, because of the greater effort it takes to control it. Once off-road, though, any on-road shortcomings dissipate quickly. Even the Sport and Overland models have serious off-road talents, with standard 4-wheel drive, 40.8-degree approach angle, 18.4-degree breakover angle, and 25-degree departure angle. The comfortable Overland can still perform admirably in deep mud ruts and slippery conditions despite road-going tires. Jeep has its Trail Rated badge that it applies to its most talented off-roading variants. The Mojave trim has a new Desert Rated designation. This version is built for high-speed off-road adventures, like Baja racer. Also on MarketWatch: American muscle: We compare a Chevy Camaro to Dodge Challenger The Rubicon is the more traditional mud-squelching, rock-climbing version. Thanks to a superlow crawl ratio, electronically disconnecting front anti-roll bar, locking diffs and terrain-appropriate tires, obstacles are negotiated with ease, even expanses of large granite boulders. The trail camera is especially helpful on steep downward slopes, bringing reassurance that the landing area is clear and that the truck isn’t about to bottom out. Other than a less-than-ideal breakover angle (due to the vehicle’s length), the Gladiator has inherited virtually all of the Wrangler’s winning off-road credentials.Other cars to consider 2021 Jeep Wrangler — Consider the Wrangler if a truck bed is not required. It comes in both 4-door and 2-door body styles, both of which are shorter than the Gladiator, and therefore more maneuverable off-road. 2021 Ford Bronco F, -1.36% — Also not a truck, but another iconic off-roader reimagined for the 21st century. And a credible alternative to the Wrangler. Pricing starts at around $30,000. 2021 Toyota Tacoma — The Toyota TM, -0.65% Tacoma offers great reliability and an array of aftermarket additions. Buyers also have some choice of body style and configuration, with extended cab and long bed options, in addition to the crew cab/short bed configuration like the Gladiator. But the Tacoma lags behind the Gladiator in terms of powertrain and interior refinement, and doesn’t have the Jeep’s “toy like” qualities. More: These are the year’s best pickup trucks 2021 Ford Ranger — The Ranger truck has a great turbocharged engine paired with a 10-speed automatic transmission, giving it what is arguably the best powertrain in its class. But a lack of refinement presents itself in areas like the interior and un-damped tailgate. 2021 Toyota 4Runner — Another popular adventure vehicle, the 4Runner offers great off-road capability and some cool features. It’s also one of the oldest brand-new vehicles on sale, having last been fully redesigned for 2010. So it doesn’t have the same current tech as the more modern Gladiator. See: 10 SUVs that are really fun to driveQuestions you may ask How much does the 2021 Jeep Gladiator weigh? Between 4,650 to 5,072 pounds, depending on trim. That’s several hundred pounds more than rivals like the Toyota Tacoma, which is about 6 inches shorter. Does the Jeep Gladiator come in 2-door form? No. Jeep has shown 2-door Gladiator concept vehicles, but the production Gladiator has four doors and five seats. Where is the Jeep Gladiator made? In Toledo, Ohio, where the Wrangler is also built.Autotrader’s advice A fully loaded 2021 Gladiator Rubicon could come in at around $60,000, which seems a lot for a midsize truck. But the Jeep Gladiator is far more than a mere pickup. Despite some mild shortcomings in regard to fuel economy and handling, its fun features and wild design earns our recommendation. There’s something to be said for buying the basic Sport trim and using that as a blank canvas to add any personal aftermarket preferences. Beyond that, it’s down to taste and legal tender. This story originally ran on Autotrader.com."}]}