{"article": [{"url": "https://www.marketwatch.com/story/science-itself-is-on-the-ballot-so-this-175-year-old-institution-makes-its-first-ever-endorsement-for-president-2020-09-15", "published": 1600180520.0, "headline": "'Science' itself is on the ballot, so this 175-year-old institution makes its first ever endorsement for president", "body": "Scientific American, considered to be the longest continuously published magazine in the U.S. and claiming articles by more than 150 Nobel Prize winners dating back to its 1845 origins, has never endorsed a presidential candidate in its 175-year history. Until now. The publication is backing Joe Biden, it said Tuesday. \"This year we are compelled to do so. We do not do this lightly,\" editors wrote in the October issue just released and in corresponding tweets. \"The evidence and the science show that Donald Trump has badly damaged the U.S. and its people.\" \"The most devastating example is his dishonest and inept response to the COVID-19 pandemic, which cost more than 190,000 Americans their lives by the middle of September,\" the editors wrote. Read:Coronavirus update: Global cases edge toward 30 million, and China says vaccine may be ready by November Environmental factors and other public-health issues also prompted the publication to take its stance. President Trump, visiting a singed California this week, could no longer put off commenting on climate change, which critics noted he had done for weeks. Wade Crowfoot, California's secretary for natural resources, told the president during a briefing on the fires that state officials \"want to work with you to really recognize the changing climate and what it means to our forests,\" spurring Trump to say: \"It'll start getting cooler. You just watch.\" Crowfoot said he wished science agreed with that view, and Trump then said he doesn't think \"science knows actually.\" Extreme weather and natural disasters have historically had a shaky association to the broader issue of climate change. But scientists say a warming Earth has upped the frequency, irregularity and impact of extreme weather events; longer droughts, for instance, are creating a tinder box in the West. Trump, for his part, has emphasized local forest management as key to pre-emptively containing seasonal blazes; about 57% of California's forests are federally managed. In just the latest move, Trump's EPA has dropped a methane-emissions rule for oil and gas fields, prompting some states to vow to sue over the rollback. Read:Trump now backs higher-ethanol gas at pumps in move to court farm votes before November Joe Biden, speaking this week on the other side of the country, riffed on Trump's recent go-to about endangered life in the suburbs. These communities are at risk, the president has suggested, from protests and efforts to abate income inequality through diverse housing. \"If we have four more years of Trump's climate denial, how many suburbs will be burned in wildfires?\" Biden countered on Monday. \"How many suburbs will have been flooded out? How many suburbs will have been blown away in superstorms?\" Biden's climate-change platform is more complete than the incumbent's but has faced its own questions, particularly as the former vice president has at times wavered on his stance on supporting the fossil-fuel industry, a key issue in swing states. Read:Facebook gives in to pressure on climate-change myths - including that antifa started deadly wildfires in western states - with new 'science-based' hub"}]}