{"article": [{"url": "https://www.marketwatch.com/story/chinas-top-stock-index-is-being-overhauled-which-hasnt-happened-in-three-decades-2020-06-22", "published": 1592815400.0, "headline": "Chinaâ\u0080\u0099s top stock index is being overhauled â\u0080\u0094 which hasnâ\u0080\u0099t happened in three decades", "body": "China most-watched stock index is getting its first overhaul in its 30-year history, to bring it more in line with leading global benchmarks and to better reflect the countryâ\u0080\u0099s increasingly technology-dominated market. The numerous changes to the Shanghai Composite Index SHCOMP, +1.67% Â will go into effect July 22, the Shanghai Stock Exchange said in a posting Friday. The adjustments will allow inclusion of stocks listed on the tech-focused STAR board as well as Chinese depository receipts issued by Chinese-based companies incorporated overseas, known as red-chip companies. From the MarketWatch archives (July 22, 2019):â\u0080\u0098STARâ\u0080\u0099 is born: New stock market debuts in Shanghai In contrast to these loosenings, stocks with special treatment, or ST, status â\u0080\u0094 a tag applied to companies with regulatory or financial problems â\u0080\u0094 will be booted from the index. The index currently has 85 stocks that carry risk warnings, representing a total weight of 0.6%, according to the exchange. Under the new rules, companies may apply to have securities rejoin the index from the next trading day on the second Friday of the month following the removal of an ST tag. â\u0080\u009cThe stocks subject to risk warning have high risks, and the fundamentals are uncertain. The investment value is affected, which makes it difficult to represent the mainstream situation of listed companies,â\u0080\u009d the exchange said Saturday in response to written questions from reporters. Eliminating these stocks will â\u0080\u009cbetter reflect the overall performance of listed companies in the Shanghai stock market.â\u0080\u009d A third much-awaited change will implement a longer wait time for new entrants to the index. New stocks in the Shanghai Exchangeâ\u0080\u0099s top 10 by average daily market value can join the index three months after listing, while newly listed stocks not in the top 10 must wait at least a year. This is a significant prolongation of the 11-day waiting period currently in effect. â\u0080\u009cMany market professionals believe that the inclusion of new shares on the 11th trading day of listing is not conducive to the accuracy and stability of the characterization of the Shanghai Composite Index,â\u0080\u009d the exchange said. Rumors of a possible revamp emerged a month ago, when the exchange confirmed it had formed a task force of academics, fund managers, and domestic and international index experts to devise the changes. Shanghaiâ\u0080\u0099s Composite Index not only differs from leading global indexes in its waiting period and in the way it weights stocks, but it even lags behind the smaller Shenzhen Component Index SZCP, +2.95%, which has been more flexible and representative of Chinaâ\u0080\u0099s plethora of tech firms. The Shanghai Composite Index tracks all of the more than 1,600 stocks traded on the Shanghai exchange, but, despite changes in Chinaâ\u0080\u0099s economy, the energy and financial sectors still dominate the weighted index. The way it calculates market value is one reason the index has moved so little even as China economy has exploded. Meanwhile, benchmarks around the world, from the S&P 500 SPX, +0.87% Â to the Shenzhen Component, have seen volatility levels more representative of modern indexes. The move is happening alongside the rollout of incentives to lure Chinaâ\u0080\u0099s overseas-listed tech firms back to the mainland and Hong Kong. Tanner Brown covers China for Barronâ\u0080\u0099s and MarketWatch."}]}