{"article": [{"url": "https://www.marketwatch.com/story/uber-bets-on-delivery-as-ride-hailing-suffers-with-265-billion-acquisition-of-postmates-2020-07-06", "published": 1594058420.0, "headline": "Uber bets on delivery with $2.65 billion acquisition of Postmates as ride-hailing stalls", "body": "In the race to gain a competitive edge in the burgeoning food-delivery business, the major players are carving up the U.S. map. Uber Technology Inc.’s UBER, -0.18% intention to acquire privately held Postmates Inc. for $2.65 billion after its failed bid for Grubhub Inc. GRUB, +0.83% is a case in point. See also: Uber to buy Postmates for $2.65 billion: reports The takeover would help Uber Eats gain ground against privately held DoorDash Inc., the current market leader in the U.S., through Postmates’ strong sales in Los Angeles, Las Vegas, Phoenix, San Diego and Miami. DoorDash remains the dominant player in New York — where it commands more than half the local market — and San Francisco. Grubhub, gobbled up by Europe’s JustEat Takeaway.com for $7.3 billion in June, is well established in the Midwest. “We’ve always admired Postmates, I guess, begrudgingly from afar in that it was a competitor who was able to compete aggressively and to be a leader in some very important markets with a much smaller capital base than a lot of its competition, including ourselves,” Uber Chief Executive Dara Khosrowshahi said on a conference call Monday to discuss the deal. A merged Uber-Postmates would control about 37% of the national market, versus DoorDash’s 45%, based on data from Edison Trends. Postmates’ presence has declined in the face of withering competition from deeper-pocketed competitors. In June, it had a market share of about 8%. Market consolidation has been inevitable as the coronavirus pandemic accelerates public adoption of food delivery, and companies like Uber diversify their businesses amid a massive slump in ride-hailing revenue. A land grab was necessary in the U.S., Forrester analyst Sucharita Kodali says, because the European market is already consolidated. In April, Amazon.com Inc. AMZN, +3.01% received provisional approval for its $575 million investment in UK-based startup Deliveroo. Wall Street heartily applauded Uber’s move, sending its shares up 6% in trading Monday. Grubhub’s stock rose 4.4%. Uber, which announced 3,000 additional layoffs following an 80% drop in ride volume in April, signaled a hard pivot to food delivery. Gross bookings for its Eats business were up 52% year over year in the first quarter. (Bookings on Uber Eats more than doubled in the second quarter, Khosrowshahi said Monday.) “At a time when our Rides business is down significantly due to shelter-in-place, our Eats business is surging,” Khosrowshahi said on the company’s earnings call in early May. See also: Uber loses nearly $3 billion in three months, but stock rebounds after hours Uber, which has been looking under the hood at several food-delivery companies for more than a year, initially set its sights on Grubhub. But neither side could agree on a selling price, and the combined operation would have surely faced antitrust scrutiny as the unquestioned market leader. At the time, Wedbush Securities analyst Ygal Arounian said any buyer of Grubhub would acquire market share in New York, Boston and Chicago “at a premium, in order to speed up rationalization through market-share dominance.” Read more: Opinion: Uber plus Grubhub called ‘a new low in pandemic profiteering,’ and that’s not the only problem Postmates, which has flirted with an initial public offering, should greatly help Uber expand delivery into more groceries and other small goods, according to Uber. Postmates recorded $107 million in revenue from $643 million in gross bookings in the first quarter of this year, according to a presentation during Monday’s acquisition announcement. “Postmates, which is the clear #4 player behind DoorDash, Uber Eats, and Grubhub, would be both a defensive and offensive acquisition in the food delivery space for Uber at a time with its core ride-sharing business seeing massive headwinds in this COVID-19 pandemic,” Wedbush analyst Dan Ives said in a note Monday. For consumers, ultimately, consolidation could lead to more efficient delivery systems at lower costs, says Rebecca Allensworth, a law professor at Vanderbilt University."}]}