{"article": [{"url": "https://www.marketwatch.com/story/the-all-new-ford-bronco-sport-a-smaller-bronco-with-more-mass-appeal-2020-07-26", "published": 1595394740.0, "headline": "The all-new Ford Bronco Sport: a smaller Bronco with more mass appeal", "body": "The 2021 Ford Bronco Sport is a large subcompact SUV, and the third model to join Ford’s F, -1.36% Bronco family of SUVs. Even though the Bronco Sport has some of the styling of the larger, truck-based Bronco, the Bronco Sport is based on a crossover SUV platform. It’s larger than the Ford EcoBoost and smaller than the Escape. Ford isn’t the only company to offer more than one subcompact SUV: Nissan sells the Kicks and the Rogue Sport, Mazda has the CX-3 and larger CX-30, and then there’s the Jeep Renegade and Compass. While some of these larger subcompact SUVs are aimed at day-to-day life, the Bronco Sport is designed for adventure. The Ford Bronco Sport Ford This SUV has been tested in tough off-road environments, and its 8.8 inches of ground clearance, purpose-built interior, and terrain management system were built for those drivers who are eager to go exploring. Its size, layout and capability would make it a logical competitor with the Jeep Compass and Subaru Crosstrek. Check out: A first look at Toyota’s new RAV4 plug-in hybrid However, even if you aren’t an off-road enthusiast, there’s plenty to like about the new Bronco Sport. Its optional engine offers an (estimated) 245 horsepower, and an 8-speed automatic transmission and all-wheel drive come standard, with an upgraded 4-wheel-drive system as an option. The cargo area was designed to hold two upright mountain bikes. There are clever interior storage solutions that would come in handy whether you’re in town or on a camping trip. And the 2021 Bronco Sport comes standard with impressive safety features, including Ford’s Co-Pilot360 suite of advanced safety.What’s new? The 2021 Bronco Sport is an all-new model. What we like Designed for outdoor adventure, with off-road chops Related to the new Bronco, with more mass appeal Clever interior has terrific storage solutions Advanced 4WD tech helps off-roaders of all abilities What we don’t No two-wheel-drive models, which could hurt MPG Upper trim levels could get pricey How much? Bronco Sport: $28,155 + $1,495 dest. Of course, there will be lots of options and flavors of Bronco Sport but the base price is attractive.Fuel economy The 2021 Ford Bronco Sport comes with a choice of two powertrains and comes standard with all-wheel drive. The base engine, a 181-horsepower 1.5-liter turbocharged 3-cylinder, uses an 8-speed automatic transmission. This is a version of one of the engines in the Ford Escape. While Ford hasn’t announced fuel economy, we anticipate this engine will yield numbers that are better than in the larger Escape – or better than 26 mpg city/31 mpg hwy/28 mpg combined. The sportier engine, a turbocharged 2.0-liter 4-cylinder with an estimated 245 hp, comes standard with the Badlands trim level. Its 8-speed automatic transmission comes with an oil cooler, manual shifting mode, and steering-wheel-mounted paddle shifters. Ford hasn’t released fuel economy numbers for this engine. Also on MarketWatch: American muscle: We compare a Chevy Camaro to Dodge Challenger For comparison, the Jeep Compass comes with a 2.4-liter engine and a 9-speed automatic, with the option of 4WD. When equipped with 4WD, the Compass fuel economy is 22 mpg city/30 mpg hwy/25 mpg combined. The Subaru Crosstrek has a 2.0-liter 4-cylinder engine backed by either a manual transmission or a continuously variable transmission (CVT). Like the Bronco Sport, it comes standard with all-wheel drive. With the CVT, the Crosstrek is rated at 27 mpg city/33 mpg hwy/30 mpg combined.Standard features and options The 2021 Ford Bronco Sport comes in five models: base, Big Bend, Outer Banks, Badlands and the First Edition. AWD is standard on all models, and the Badlands comes with an upgraded 4-wheel-drive system. Here is what we know about these models so far: The base Bronco Sport is powered by a 181-horsepower (est) 3-cylinder, 1.5-liter turbocharged engine, with an 8-speed automatic transmission. All Bronco Sports come standard with a version of all-wheel drive, plus 17-inch wheels and LED headlights. The Co-Pilot360 suite of advanced safety features is also standard. It includes blind-spot information with cross-traffic alert, forward collision warning, automatic high beams, and pre-collision assist with automatic emergency braking and pedestrian detection. Adding the Co-Pilot360 Assist+ adds adaptive cruise control and more. Sync 3 operated through an 8-inch touchscreen comes with every Bronco Sport, as does the Terrain Management System with G.O.A.T. (goes over any type of terrain) Modes. The Big Bend adds easy-to-clean cloth seats, a rubberized cargo floor, fog lights, and a touchpad section along the door where you can enter a code. This means you don’t need to carry your keys with you while you are biking or running. Next up is the Outer Banks, which adds black 18-inch alloy wheels, leather power-adjustable heated front seats for the driver and front passenger, a heated steering wheel, and USB A and C ports. This model also has body-color door handles and a black grille. The Badlands model is the most powerful and one of the most off-road capable of the group. (The other, the First Edition, is a limited-edition model that will also have the Badlands off-road features). This Bronco Sport uses the 2.0-liter turbocharged 4-cylinder engine and the 8-speed automatic transmission with paddle shifters. This SUV’s terrain management system has two more modes: mud/snow and rock crawl. The Badlands also has an upgraded 4WD system with a lock mode, larger off-road shocks, and more ground clearance. It and the First Edition are the only models that come standard with a full-size spare tire. Related: How to choose trim levels and options when buying a new car The First Edition, limited to 2,000 units, has unique badging, plus the off-road features of the Badlands and the styling cues and amenities of the Outer Banks.Safety Ford has announced preliminary information about the safety features that will be available with the 2021 Ford Bronco Sport. In addition to airbags and a rearview camera, the Co-Pilot360 suite of advanced safety features will come standard. This means that every Bronco Sport will come with automatic emergency braking with pedestrian detection, blind-spot detection, forward collision warning, lane-keep assist, and automatic high beams. An expanded version of this suite, called Co-Pilot360 Assist+, will be an available option. This will add adaptive cruise control, lane centering, and more.Behind the wheel The 2021 Ford Bronco Sport is equipped to be more off-road capable than the Nissan NSANY, -1.50% Rogue Sport or Mazda MZDAY, -1.05% CX-30. However, we expect the Ford will be comfortable on the highway, but perhaps without the same handling characteristics. Vehicles like the Subaru Crosstrek and Jeep Compass are good examples of vehicles that are built for pavement and dirt that are still competent, amenable daily drivers. We anticipate the Bronco Sport will follow suit.Other cars to consider 2020 Subaru Crosstrek — One of Subaru’s FUJHY, -1.41% most popular models, the Crosstrek has plenty of cargo space for your day-to-day needs, as well as the ground clearance and off-road confidence for adventures in the backcountry. And all models that come with the CVT include the impressive EyeSight suite of driver assists and advanced safety features. 2020 Jeep Compass — Pleasant to drive and well-equipped, the Jeep Compass has the ability to get you well off the beaten path. When it comes to off-road capability, its Trailhawk model would be a natural competitor for the Bronco Sport Badlands. 2020 Nissan Rogue Sport — While the Rogue Sport isn’t designed for off-roading the way the Jeep and Subaru are, it offers plenty of cargo space and an impressive array of safety features. But it’s getting a bit long in the tooth, despite a recent mild update. Used Subaru Forester — The Forester has the ground clearance and standard AWD for your next family outing. It’s larger than the Bronco Sport, but will serve as a good all-around SUV and can do some of what the Bronco Sport is built to do. It also comes with the safety features for which Subaru is known. A used Subaru Forester with less than 30,000 miles can be had for about $20,000, depending on model. Used Toyota RAV4 — The Toyota RAV4 is bigger than the Bronco Sport, but has a massive cargo area, loads of rear-seat legroom, and proven Toyota reliability. A used Toyota RAV4 with less than 30,000 miles can be had for about $22,000, depending on which version you get. Look for an AWD model if you want all-season confidence – but don’t plan on any tough off-roading. Also read: The pros and cons of buying a certified used carQuestions you may ask How much will the 2021 Ford Bronco Sport cost? Ford hasn’t announced pricing yet, but we expect the price of the Ford Bronco Sport to start at about $25,000. Is the Ford Bronco Sport the same as the Ford Escape? No. While the 2021 Ford Bronco Sport shares some platform components with the Ford Escape, the body, interior, and off-road capability are all unique to the Bronco Sport, and the Sport is smaller than the Escape. Consider the Bronco Sport to be a rugged subcompact SUV built for an outdoor adventure lifestyle, and the Escape as the larger family transport vehicle for around town. Where will the 2021 Ford Bronco Sport be built? The Ford Bronco Sport will be built at Ford’s plant in Hermosillo, Mexico.Autotrader’s advice The Ford Bronco Sport is here after much anticipation. This is a large subcompact SUV that would be good for outdoorsy types – people who want to camp, hike, or mountain bike on the weekends. Its interior design makes it an appealing vehicle for daily use too, as it has a lot of headroom, plus a versatile cargo area. This 5-passenger subcompact SUV has the capabilities, amenities and packaging to take on the Subaru Crosstrek and Jeep Compass, and its optional engine should offer best-in-class power. We recommend skipping the base model, so you can get more features. In addition, unless you genuinely need the maximum off-road capability the Badlands offers, we expect most people will be happy with the Big Bend or Outer Banks models. Also see: These 3 EVs are the lowest cost to own over 5 years This story originally ran on Autotrader.com."}]}