{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-and-u-s-futures-fall-as-trump-warns-pandemic-will-get-worse-before-it-gets-better-11595410906", "published": 1595417000.0, "headline": "European stocks fall on Trumpâ\u0080\u0099s pandemic warning but euro nears two-year high", "body": "U.S. President Donald Trump speaks during the renewed briefing of the Coronavirus Task Force in the White House on July 21, 2020. Jim Watson/Agence France-Presse/Getty Images European stocks slipped lower on Wednesday, after U.S. President Donald Trump warned the pandemic would â\u0080\u009cget worse before it gets better.â\u0080\u009d Coronavirus fears have lingered in the background in recent days, overshadowed by vaccine hopes and the European Unionâ\u0080\u0099s â\u0082¬1.8 trillion ($2.1 trillion) budget and recovery plan. But concerns over the virus seemed to be firmly at the front of investorsâ\u0080\u0099 minds early on Wednesday. Cases in the U.S. rose above 3.8 million on Tuesday and Trump appeared to change his view on face masks, urging Americans to wear them and practice social distancing, as the White House daily briefings returned for the first time since April. The pan-European Stoxx 600 SXXP, +0.55% index fell 0.9%, giving back much of the last two dayâ\u0080\u0099s gains, while Germanyâ\u0080\u0099s DAX DAX, +0.06% declined 0.5% â\u0080\u0094 returning to trade 1% down year-to-date from its brief venture in positive territory for the year on Tuesday. Escalating tensions between the U.S. and China added to the downbeat atmosphere, as China said its consulate general in Houston was ordered shut. Chinaâ\u0080\u0099s foreign ministry described it as an â\u0080\u009cunprecedented escalation.â\u0080\u009d TheÂ U.S dollar USDCNH, -0.71% jumped against the Chinese yuan as a result. The euro EURUSD continued its surge higher following the EU recovery package deal reaching near-two-year highs close to $1.16. Reports that the U.K. is close to abandoning hope of a Brexit trade deal with the EU pushed sterling GBPUSD, +0.83% 0.6% lower. Substantial losses for the pound would typically boost the FTSE 100 UKX, +0.64% but the U.K.â\u0080\u0099s benchmark index was 0.5% lower. U.S. dollar weakness sent gold GOLD, +2.86% and silver futures SI00, +5.96% surging late on Tuesday, and both contracts continued higher early on Wednesday.Â Stocks in focusÂ Kingfisher KGF, +1.42% climbed more than 13%, after the do-it-yourself home improvement group reported strong second-quarter results as consumers stocked up on supplies to do work to their homes during lockdown. Like-for-like sales jumped 21.6% in the three months to July. Melrose Industries MRO, +1.26% fell 15%, after the turnaround specialist said revenue fell 27% in the six months to June 30, and that cost reductions due to the pandemic would lead to job losses, adding that it wonâ\u0080\u0099t pay an interim dividend for 2020."}]}