{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-case-tally-climbs-above-38-million-president-trump-appears-to-have-changed-his-view-on-face-masks-2020-07-21", "published": 1595400440.0, "headline": "Coronavirus update: U.S. case tally climbs above 3.8 million; President Trump appears to have changed his view on face masks", "body": "The number of confirmed cases of the coronavirus illness COVID-19 in the U.S. rose above 3.8 million on Tuesday, and President Donald Trump appeared to change his view of face masks in the face of falling poll numbers. Trump tweeted an image of himself wearing a mask with a message of patriotism, just hours after saying he would reinstate daily briefings of his White House Task Force on managing the pandemic. Experts have repeatedly emphasized that face coverings, along with frequent hand washing and social distancing are crucial to contain the spread of the deadly illness, but Trump has stonewalled on the issue for months. As recently as Sunday, he told Fox News Anchor Chris Wallace he would not mandate face masks. The issue has become caught up in the culture wars that continue to divide America, even as the case tally and death toll continue to rise. The U.S. death toll stands at 141,426, according to data aggregated by Johns Hopkins University, the highest in the world. Forty-four states and territories show rising case numbers over the last 14 days, according to a New York Times tracker. On Monday, seven states and Puerto Rico — Florida, Georgia, Nevada, Kentucky, North Dakota, Arkansas and Montana — reported record one-day hospitalizations, according to the Washington Post. Polls show Trump is behind his presidential campaign opponent Joe Biden and Americans are unhappy with how he has handled the pandemic, according to a recent Washington Post-ABC News poll, that showed their attitude is hardening as cases climb across the country. A full 66% of those polled said they disapprove of his management of the outbreak, up from 53% in May and 45% in March. Meanwhile, a new Axios-Ipsos poll found about three quarters of Americans believe that other Americans are making the pandemic worse, and a majority of Republicans, or 65%, agree. “There may be some truth to this concern as new data suggests social distancing measures have stalled-out and few Americans who interact with friends and family outside the home engage in robust protective measures,” authors Chris Jackson and Mallory Newall wrote. “This comes as more Americans, particularly Republicans, deny the official toll of the pandemic.” iframe.twitter-tweet { width: 100% !important; } The poll also showed that trust in government at all levels is eroding over time. While the Centers for Disease Control and Prevention and national public health officials are still broadly trusted by Americans, that trust has fallen 15 points since early April. “State governments, while still trusted by a small majority of the public (57%), have also lost about 15 percent of the public’s trust since April,” the authors wrote. “Least trusted by the public are the federal government (35%) and the White House (31%).”Latest tallies There are now 14.8 million confirmed cases of COVID-19 worldwide and at least 611,599 people have died, the Johns Hopkins data shows. At least 8.3 million people have recovered. Brazil is second to the U.S. by case numbers and fatalities, with 2.1 million cases and 80,120 deaths, crossing the 80,000 threshold overnight. Brazilian President Jair Bolsanaro, who has tested positive for COVID-19, has been widely criticized for failing to take the illness seriously. Brazil’s citizenship minister, Onyx Lorenzoni, and education minister, Milton Ribeiro, are also now infected, according to Reuters. India has the third highest case tally at 1.2 million, followed by Russia, South Africa and Peru. The U.K. has 297,389 cases and 45,507 deaths, the third highest in the world and by far the highest in Europe. There was positive news from the European Union, where leaders agreed to a $1.8 trillion-euro ($2.1 trillion) budget and coronavirus recovery fund in the early hours of Tuesday, after four days of sometimes tense talks, as the Associated Press reported. To confront the biggest recession in its history, the EU will establish a 750 billion-euro coronavirus fund, partly based on common borrowing, to be sent as loans and grants to the hardest-hit countries. That comes on top of the seven-year, 1 trillion-euro EU budget that leaders had been haggling over for months even before the pandemic. German Chancellor Angela Merkel said, “We have laid the financial foundations for the EU for the next seven years and came up with a response to this arguably biggest crisis of the European Union.” The coronavirus has killed about 135,000 EU citizens and sent its economy into an expected contraction of 8.3% this year. Read now:Germany’s DAX turns positive for the year after EU leaders agree coronavirus recovery packageWhat’s the latest medical news? Analysts weighing in on the data released Monday from two early-stage clinical trials of experimental COVID-19 vaccines showing a T-cell response said the news was positive, but much remains unknown, as MarketWatch’s Jaimy Lee reported. BioNTech BNTX, +1.23% and Pfizer Inc. PFE, -0.27% said an ongoing early-stage clinical trial for their coronavirus vaccine candidate, BNT162b1, reported a T-cell response in participants, in addition to neutralizing antibody titers. Then, in a highly anticipated study published Monday in The Lancet, researchers at AstraZeneca AZN, +1.16% AZN, +0.63% and the University of Oxford said their investigational COVID-19 vaccine also produced a T-cell response, as well as antibody titers. “What remains unknown is whether the antibody response translates into protection, the level of neutralizing antibodies required for durable protection, and the role of T-cell immunity in the process,” SVB Leerink analysts wrote on Monday. BioNtech, taking advantage of the rally in its shares, announced plans to issue 5 million American Depositary Shares in a syndicated deal on Tuesday and said it will follow up with a rights offering. The company joins the many companies raising capital during the pandemic. Australian biotech Immuron Ltd. IMRN, +5.56% announced a direct offering of 1.07 million ADS. The company had announced earlier that its IMM-124E used to make its gastrointestinal and digestive health immune supplements Travelan and Proectyn demonstrated neutralizing activity against the coronavirus that causes COVID-19, but that was in “laboratory studies.” Small-cap Moleculin Biotech Inc. MBRX, -0.77% saw its shares rally after it said a second round of laboratory testing confirmed antiviral activity for WP1122, its candidate as a treatment for COVID-19. The lab involved was IIT Research Institute, an affiliate of the Illinois Institute of Technology, which conducted additional in vitro testing of the drug candidate.What are companies saying? Earnings season brought numbers from two Dow Jones Industrial Average components, starting late Monday with International Business Machines Corp.’s latest report, showing another decline in revenue, but more profit and sales than Wall Street was expecting, as MarketWatch’s Wallace Witkowski reported. Big Blue IBM, -2.81% reported second-quarter net income of $1.36 billion, or $1.52 a share, compared with $2.5 billion, or $2.81 a share, in the year-ago period. Adjusted earnings were $2.18 a share, compared with $3.17 a share a year ago. Revenue declined to $18.12 billion from $19.16 billion in the year-ago quarter. Analysts surveyed by FactSet had forecast adjusted earnings of $2.09 a share on revenue of $17.73 billion on average. Cloud and cognitive software sales, which includes IBM’s Red Hat business, came in at $5.75 billion, compared with $5.65 billion in the year-ago quarter, while analysts had forecast $5.74 billion. “Only 20% of the workloads have moved to the cloud,” said Arvind Krishna, IBM’s chief executive, on a conference call. “The other 80% are mission-critical workloads that are far more difficult to move. There is a massive opportunity in front of us to capture these workloads.” On Tuesday, it was Coca-Cola Co.’s KO, +0.69% turn with the drinks and snacks giant saying it expects the worst of the pandemic is behind it, even as cases surge across the U.S. Coca-Cola’s business has been impacted by the closure of venues like bars, restaurants and sports stadiums during lockdown periods. Sales picked up in May and June as stay-at-home measures were eased around the world. Chief Financial Officer John Murphy told The Wall Street Journal that Latin America and Africa offer the most uncertainty. Tobacco giant Philip Morris International Inc. PM, +0.70% beat estimates for profit and revenue and offered an upbeat outlook for the full year, even as it expects duty-free sales to take a long time to fully recover. Elsewhere, companies continued to issue debt and equity and to announce job cuts and other savings. Here’s the latest news about companies and COVID-19: • Clear Channel Outdoor Holdings Inc. CCO, -0.87% is planning a $350 million offer of five-year senior secured notes through its subsidiary Clear Channel International B.V. Proceeds will be used to repay a $54.9 million promissory note in full at par, and for general corporate purposes. The billboard ad company is joining a rake of companies that have been issuing debt at record levels during the pandemic. • Coca-Cola reported a second-quarter profit that topped expectations but revenue that fell a bit shy, amid challenges resulting from the pandemic. Unit case volume fell 16% from a year ago, but improved from a 25% decline for the month of April to a 10% decline in June. Operating margin decreased to 27.7% from 29.9%, citing pressure on revenue and the negative impact of currency translation. “We believe the second quarter will prove to be the most challenging of the year; however, we still have work to do as we drive our pursuit of ‘Beverages for Life’ and meet evolving consumer needs,” said Chief Executive James Quincey. • Hibbett Sports Inc. HIBB, +8.39% shares soared after the athletic retailer offered a second-quarter business update that includes a 70% same-store sales growth forecast. The FactSet consensus was for 15.7% growth. Bricks-and-mortar same-store sales are expected to grow 60% and online sales are forecast to jump 200%. Nearly all of Hibbett’s stores are open. Among the factors that Chief Executive Mike Longo attributes to the sales leap are stimulus checks and pent-up demand. New customers contributed to the results, with 25% of bricks-and-mortar sales and 40% of online sales coming from new shoppers. Hibbett has paid back the $50 million it borrowed as a precautionary measure during the early days of the pandemic. Raymond James analysts say Hibbett benefited from strong Nike Inc. NKE, +0.97% sales, which accounts for 68% of the retailer’s product. • Job networking site LinkedIn is cutting about 960 jobs, or 6% of its workforce, as it moves to align the business with the new COVID-19 world. In a message posted on the Microsoft Corp. MSFT, +2.48% website, Chief Executive Ryan Roslanksy said LinkedIn is not immune to the effects of the pandemic. “When we took a hard look at the business, we decided we needed to make some hard calls,” the CEO wrote. The cuts will be carried out across the company’s global sales and talent acquisition divisions. “COVID-19 is having a sustained impact on the demand for hiring, both in our LTS business and in our company,” the executive wrote. “In GSO and GTO, there are roles that are no longer needed as we adjust to the reduced demand in our internal hiring and for our talent products globally.” • Lockheed Martin Corp. LMT, -0.68% reported second-quarter profit and sales that rose above expectations, and lifted its full-year outlook. Each of the company’s business segments saw sales rise above expectations. For 2020, Lockheed raised its guidance ranges for EPS to $23.75 to $24.05 from $23.65 to $23.95 and for sales to $63.50 billion to $65.00 billion from $62.25 billion to $64.00 billion. The company said the 2020 financial outlook remain uncertain as a result of the pandemic, and current assumptions assume production facilities don’t experience significant work stoppages and closures. • Philip Morris International Inc. PM, +0.70% shares rose after the Marlboro parent reported second-quarter earnings and revenue that beat expectations. Cigarette shipment volume was down 17.6% while heated tobacco unit shipment volume, which includes the company’s IQOS product, was up 24.3% for the period. IQOS users totaled 15.4 million by quarter-end, of which Philip Morris says 11.2 million made the switch from cigarettes. Philip Morris has been touting its heated tobacco product as an alternative to cigarettes, and recently got FDA approval to market the product as a “modified risk” item. Certain cigarette production facilities have been impacted by COVID-19, but those facilities account for less than 5% of production capacity around the world. As of June 30, the company had approximately $4.2 billion of cash and cash equivalents on hand. For the full year, Philip Morris forecasts EPS of $4.84 to $4.99, and adjusted EPS of $4.92 to $5.07. The FactSet consensus is for EPS of $4.92. Philip Morris’ forecast assumes that none of the company’s key markets will undergo another lockdown, though the company doesn’t anticipate a recovery in duty-free sales given uncertain global travel conditions. • Tailored Brands Inc. US:TLRD, the parent of apparel retailers Men’s Wearhouse and Jos. A. Bank, expects to cut about 20% of its corporate workforce and close up to 500 stores given the impact of the pandemic on its business. The company expects to record a $6 million charge in the second quarter for severance payments and other termination costs. The company is realigning its store organization and supply chain to help support its store footprint going forward and its e-commerce business. Separately, Tailored Brands said Chief Financial Officer Jack Calandra will leave the company as of July 31; he joined as CFO in January 2017. • Tapestry Inc. TPR, +0.80%, parent of the Coach, Stuart Weitzman and Kate Spade brands, said fiscal fourth-quarter earnings due Aug. 13, “exceeded internal expectations from a top and bottom-line perspective. Importantly, gross margin expanded on a year-over-year basis, reflecting lower promotional activity, while inventory declined from prior year.” The company ended the year with a cash balance of $1.4 billion. The Wall Street Journal reported that Chief Executive Jide Zeitlin resigned, after being in the role for less than a year, following an internal investigation into his personal behavior. A woman, who Zietlin said he had a relationship with more than 10 years ago, accused Zeitlin of posing as a photographer under an alias, the WSJ report said. The company named Chief Financial Officer Joanne Crevoiserat as interim CEO, and said it would launch a search for a permanent CEO including external candidates. Andrea Shaw Resnick, currently head of investor relations and corporate communications, has been named interim CFO. The company’s lead independent director Susan Kropf has been named chair of the board. • Ulta Beauty Inc. ULTA, -1.63% will close 19 stores and open fewer new stores than it expected given “the uncertainty and disruption created by COVID-19.” Ulta said it now expects to open about 30 new stores in fiscal 2020, compared with a late May expectation of between 30 and 40 new stores this year. The company expects to resume new-store openings in August, and enter Canada in mid-2021, it said. Ulta did not provide the locations of the stores to close. It plans on reassigning salespeople “where possible,” it said. To date, about half of the employees furloughed in April are back to work. Ulta also joined a growing list of retailers requiring customers to wear face coverings while in its stores, starting Monday. • United Airlines Holdings Inc. UAL, +0.32% is looking to make air travel safer for passengers, through improving air flow and filtration and limiting the number of passengers that can board and deplane at a time. The air carrier said it will now maximize air flow volume for all high-efficiency particular rate (HEPA) filtration systems during the boarding and deplaning process. The air conditioning systems on its aircraft recirculates the air every 2 to 3 minutes and removes 99.97% of particles, including viruses and bacteria. United was also taking steps to limit the number of passengers on its planes, saying only 15% of its flights had more than 70% of the seats filled. In addition, the company will board fewer customers at a time and will deplane in groups of five rows at a time. • Walmart Inc. WMT, +1.00% will spend another $428 million on bonuses for its workers. That includes a $300 bonus for full-time hourly store associates, a $150 bonus for part-time and temporary associates, and bonuses for drivers, managers and assistant managers at clubs, distribution centers and other areas of the business. Those working for the company as of July 31 will be eligible, and they should expect the payout on August 20. This is the third bonus that Walmart has given this year, bringing the total spent to $1.1 billion."}]}