{"article": [{"url": "https://www.marketwatch.com/story/this-chart-shows-what-matters-more-as-schools-announce-covid-19-reopening-plans-11596457036", "published": 1596478100.0, "headline": "This chart reveals what matters most as schools announce COVID-19 reopening plans", "body": "Preschoolers and their instructors at a summer session in Monterey Park, Calif. Getty Images One of the most enduring — and maddening — aspects of Betsy DeVos’s legacy as secretary of education will be the way she has politically charged complicated issues in education. By reducing nuanced issues to a simple directive or judgment, she has attached her reputation — and President Trump’s reputation, in turn — to those positions, making the issues as polarizing as the two of them. Examples abound, from charter schools to Title IX. Now, though, we have an issue that seems more complicated, with higher stakes, than anything the education community has seen in decades. Local and state policy makers must decide whether, when and how to open schools amid a dangerous and unpredictable pandemic. These decisions are challenging in many ways, from their countless logistical considerations to hard ethical questions about how to weigh public health risks against the costs of school closings. The considerations vary from one city (and school) to the next based on local infection rates, school resources and community needs. “ Now that school reopening has become politicized — like mask wearing and hydroxychloroquine before it — we’re all in the precarious position of having local and state leaders who might, knowingly or not, prioritize politics over safety and reason in their decision making . ” One would hope the federal government would respond — and expect it to — with deference to local leaders, generous resources to support school reopening and distance learning, and clarity on medical research and best practices. Yet the federal government’s response has fallen far short of this standard. The message from the Trump administration has been to open school doors, no matter what. Reporting on negotiations between the White House and Republican legislators suggests that almost half of funds for K-12 schools in the COVID-19 aid package could be unavailable to schools that do not reopen with in-person learning. CDC guidance on school reopening has become so politicized that it now lacks credibility. This puts local decision makers in the precarious position of making reopening decisions with insufficient resources and information, and problematic incentives. Moreover, now that school reopening has become politicized — like mask wearing and hydroxychloroquine before it — we’re all in the precarious position of having local and state leaders who might, knowingly or not, prioritize politics over safety and reason in their decision making.An analysis of school reopening plans I brought together data from a few sources to get a sense for whether the reopening decisions to date seem more related to public health or politics. I downloaded an EdWeek database of school-district reopening plans, which, as of July 27, represented about 13 million students in 256 districts (excluding districts with plans coded as “Undecided,” and Puerto Rico, which does not participate in U.S. presidential elections). Since school-district boundaries are not coterminous with county boundaries in some states, I used data from the U.S. Department of Education to identify the districts’ primary county location. I then merged data from the MIT Election Data + Science Lab with county-level results from the 2016 presidential election and data from USAFacts showing the number of new COVID-19 cases by county from July 1 to July 25. The idea is to see what is more related to these district decisions (albeit not necessarily causally), local health conditions or politics. Figure 1, below, shows that reopening decisions are much more correlated with local political attitudes. Each dot in the scatterplot represents a school district. The light-blue dots represent districts that, by EdWeek’s coding, had announced “Full in-person reopening available for all students” (the preferred approach of the Trump administration). The dark-blue dots represent districts that have announced plans for “Remote learning only.” The x-axis shows the percentage of each county’s population that reports a new COVID-19 case during the month of July (through July 25), while the y-axis shows Trump’s county-level vote share in the 2016 election. If public health considerations were driving districts’ decisions, we might expect to see the light-blue dots to the left and the dark-blue dots to the right. This would mean that districts with relatively high COVID-19 rates per capita are the ones opting for distance learning. In reality, there is no relationship — visually or statistically — between school districts’ reopening decisions and their county’s new COVID-19 cases per capita. In contrast, there is a strong relationship — visually and statistically –between districts’ reopening decisions and the county-level support for Trump in the 2016 election. Districts located in counties that supported Trump are much more likely to have announced plans to open in person. On average, districts that have announced plans to reopen in person are located in counties in which 55% voted for Trump in 2016, compared with 35% in districts that have announced plans for remote learning only. Unsurprisingly, the one remaining group in EdWeek’s data– “Hybrid/Partial” — falls right in the middle, at 44%. These data aren’t perfect. For example, EdWeek’s database of district reopening plans is, by its own acknowledgement, incomplete, and school districts don’t map perfectly to counties. However, the patterns are so clear, and the regression results so consistent (e.g., controlling for different variables and restricting the time frame of district announcements), that it seems implausible that politics aren’t a major factor in district decision making.Looking ahead There has been some optimism that local leaders will set national politics aside as they make decisions about school plans for the fall. However, we need to be clear-eyed that national politics — and the strings attached to federal resources — can affect the decisions of local and state leaders. Politicization has become an immediate concern for the COVID-19 relief package, which now threatens to withhold funds from school districts in severely affected areas that need to build remote learning capacity. As Sarah Reber and Nora Gordon have argued, Congress needs to move quickly and generously, without playing school-reopening politics. Now is a time for local and state policy makers to focus on the best interests of their communities, apart from how that relates to matters of ideology and national politics. Of course, better leadership from the federal government would take us a long way in that direction. Jon Valant is a senior fell at the Brookings Institition’s Brown Center on Education Policy. Follow him on Twitter @JonValant. This was originally published on the Brookings Institution’s Chalkboard blog."}]}