{"article": [{"url": "https://www.marketwatch.com/story/judge-bolton-can-publish-book-despite-efforts-to-block-it-2020-06-20", "published": 1592653220.0, "headline": "Judge: Bolton can publish book critical of Trump despite efforts to block it", "body": "A federal judge ruled Saturday that former national security adviser John Bolton can move forward in publishing his tell-all book despite efforts by the Trump administration to block the release because of concerns that classified information could be exposed. The decision from U.S. District Judge Royce Lamberth is a victory for Bolton in a court case that involved core First Amendment and national security concerns. But the judge also made clear his concerns that Bolton had “gambled with the national security of the United States” by taking it upon himself to publish his memoir without formal clearance from a White House that says it was still reviewing it for classified information. “Defendant Bolton has gambled with the national security of the United States. He has exposed his country to harm and himself to civil (and potentially criminal) liability,” Lamberth wrote. “But these facts do not control the motion before the Court. The government has failed to establish that an injunction will prevent irreparable harm.” From a practical perspective, the ruling clears the path for a broader election-year readership and distribution of a memoir, due out Tuesday, that paints an unflattering portrait of President Donald Trump’s foreign policy decision-making during the turbulent year-and-a-half that Bolton spent in the White House. Soon after the ruling was released, Trump tweeted that Bolton “broke the law by releasing Classified Information (in massive amounts). He must pay a very big price for this, as others have before him. This should never to happen again!!!” Bolton’s lawyers insisted that Bolton had spent months addressing White House concerns about classified information and that Bolton had been assured in late April by the official he was working with that the manuscript no longer contained any such material. Bolton’s team said the Trump administration’s efforts to block the book were a pretext to censor him for an account that the White House found unfavorable. The Justice Department sued this past week to block the book’s release and to demand that copies be retrieved. Officials said the book contained classified information and that Bolton had failed to complete a prepublication review process meant to ensure former government officials do not improperly disclose national security secrets in books they write. The administration submitted written statements from multiple officials attesting to the national security concerns of releasing the book. The judge did not take issue with those concerns in his 10-page order. But with 200,000 copies of the book already distributed to booksellers across the country, attempting to block its release would be futile, the Lamberth wrote. Major media organizations also obtained the book and published comprehensive accounts about it. “In taking it upon himself to publish his book without securing final approval from national intelligence authorities, Bolton may indeed have caused the country irreparable harm. But in the Internet age, even a handful of copies in circulation could irrevocably destroy confidentiality,” Lamberth wrote. Just one individual with a book in hand could publish its contents from a local coffee shop, he said. “With hundreds of thousands of copies around the globe — many in newsrooms — the damage is done. There is no restoring the status quo,” the judge wrote. Lamberth appeared divided during arguments on Friday. He observed that Bolton had not waited for official assurance from the White House that the book was free of classified information. But Lamberth also suggested that he was powerless to halt the book’s release given that hundreds of thousands of copies had already been shipped. “The Room Where it Happened: A White House Memoir” depicts a president whose foreign policy objectives were inexorably linked to his own political gain. Bolton says Trump “pleaded” with China’s Xi Jinping during a 2019 summit to help Trump’s reelection prospects. Bolton writes that Trump linked the supply of military assistance to Ukraine to that country’s willingness to conduct politically charged investigations into former Vice President Joe Biden and his son Hunter — allegations that were at the heart of an impeachment trial that ended with Trump’s acquittal by the Senate in February. Bolton’s lawyers argued that he had labored painstakingly for months with the White House to address concerns over classified information. In late April, the career official he worked most closely with and who had done a line-by-line edit notified him that she had completed her revisions and that the revised manuscript did not contain classified information. But another White House official soon after embarked on an additional review and identified material that he said was classified. Bolton’s lawyers say the White House assertions of classified material were an attempt to censor him over a book the administration simply finds unflattering. “If the First Amendment stands for anything, it is that the Government does not have the power to clasp its hand over the mouth of a citizen attempting to speak on a matter of great public import,” Bolton’s attorneys wrote in a court filing. Trump on Thursday called the book a “compilation of lies and made up stories” intended to make him look bad. He tweeted that Bolton was just trying to get even for being fired “like the sick puppy he is!” Other administration officials who figure prominently in the book, including Secretary of State Mike Pompeo, denied comments or actions that were attributed to them and joined the president in condemning the book. Even Democrats who pounced on some of Bolton’s anecdotes to condemn the president nonetheless expressed frustration that he had saved them for his book instead of participating in the impeachment case. Bolton refused to voluntarily testify in the impeachment inquiry, and the House ultimately moved forward with its case without subpoenaing him."}]}