{"article": [{"url": "https://www.marketwatch.com/story/trump-to-release-list-of-potential-supreme-court-picks-that-includes-ted-cruz-other-republican-senators-11599752713", "published": 1599739940.0, "headline": "Trump releases list of potential Supreme Court picks that includes Ted Cruz, other Republican senators", "body": "U.S. President Donald Trump. Getty Images WASHINGTON (AP) — President Donald Trump released a list of potential Supreme Court nominees, one that voters can compare to rival Joe Biden’s promise to nominate a Black woman to the high court if given the chance. Among those on the list were Bridget Bade, Daniel Cameron, Tom Cotton, Paul Clement, Ted Cruz, Stuart Duncan, Steven Engel, Noel Francisco, Josh Hawley, James Ho, Gregory Katsas, Barbara Lagoa, Christopher Landau, Carlos Muñiz, Martha Pacold, Peter Phipps, Sarah Pitlyk, Allison Rushing, Kate Todd and Lawrence VanDyke. The move to release a list is a repeat of a successful strategy Trump employed during his 2016 campaign. Four years ago he took the unprecedented step of announcing potential Supreme Court nominees in a bid to win over conservatives and evangelicals who were not enthusiastic about his personal flaws but came around to his candidacy because of his promises on judicial appointments. Trump had previously said on Twitter the announcement of a new list would come by September 1 and that it “may include some, or many of those already on the list.” Biden too has said he’s working on a list of potential nominees, but the campaign has given no indication that it would release any names before the November election and doing so would risk giving Trump and Republicans a target to put Biden on defense. Any vacancy would give the president the ability to shape the future of the powerful court, which is currently divided 5-4 between conservatives and liberals. Any list may also be meaningless, however. Either man’s ability to get any future choice confirmed depends on having a majority in the Senate, which confirms nominees. Republicans currently hold 53 seats in the chamber to Democrats’ 45, with two independents who caucus with the Democrats. Trump released two lists of potential Supreme Court nominees during his previous presidential campaign, one with 11 names in May 2016 and another with 10 names that September. Justice Neil Gorsuch, Trump’s first nominee to the court, was on the second list. Justice Brett Kavanaugh, his second nominee, was one of five people added to Trump’s list in 2017. Of the people remaining on Trump’s list, six are women. It also includes several minorities including Amul Thapar, who is of South Asian descent. Former Michigan Supreme Court Justice Robert Young, who is Black, and Federico Moreno, a federal judge in Florida who is Hispanic, are also on the list, though their age makes them unlikely nominees. Trump has said recently that the winner of November’s presidential election “could have anywhere from two to four, to maybe even five” Supreme Court justices to pick because of the age of the current nine justices. It’s a view he also expressed in 2016. The court’s oldest members are Justice Ruth Bader Ginsburg, 87, and Justice Stephen Breyer, 82, both liberals, and Justice Clarence Thomas, 72, and Justice Samuel Alito, 70, two conservatives. Ginsburg made news this summer when she announced she is being treated for a recurrence of cancer but has no plans to step down. Biden, for his part, has not released a list of specific people he’d nominate, but his promise to nominate a Black woman to the court if he has the opportunity in many ways narrows the field. Biden said in late June that work on his list was underway. “We are putting together a list of a group of African-American women who are qualified and have the experience to be in the court. I am not going to release that until we go further down the line of vetting them as well,” he said. Regardless of party, presidents tend to look for the same characteristics in potential Supreme Court picks. Stellar legal credentials are a must. All of the current justices attended Harvard or Yale law school, though Ginsburg left Harvard and graduated from Columbia. All but Justice Elena Kagan were also first a judge on a federal appeals court. And they tend to be old enough to have a distinguished legal career but young enough to serve for decades. That generally means nominees are in their late 40s or 50s. More recently, nominees have also previously clerked for a Supreme Court justice, an early mark of legal smarts. Five of the current justices previously clerked at the Supreme Court. Age is one factor narrowing Biden’s choices. Only five Black women are judges on federal appeals courts around the country, and each is 68 or older this year according to a Federal Judicial Center database. Biden will almost certainly have to find someone with legal experience on a different court. One option: Judge Ketanji Brown Jackson, a judge on the federal district court in Washington, D.C. Jackson, who turns 50 this year, attended Harvard law school and was reportedly considered for the court by President Barack Obama in 2016 following the death of Justice Antonin Scalia. Another obvious choice: Justice Leondra Kruger, who sits on the Supreme Court of California. A graduate of Yale law school, she is 44. Both women also served as Supreme Court law clerks, Kruger to the late Justice John Paul Stevens and Jackson to Breyer."}]}