{"article": [{"url": "https://www.marketwatch.com/story/trump-says-hell-act-to-ban-tiktok-in-us-as-soon-as-saturday-2020-08-01", "published": 1596280820.0, "headline": "Trump says heâ\u0080\u0099ll act to ban TikTok in US as soon as Saturday", "body": "President Donald Trump said he will take action as soon as Saturday to ban TikTok, a popular Chinese-owned video app that has been a source of national security and censorship concerns. Trumpâ\u0080\u0099s comments came after published reports that the administration is planning to order Chinaâ\u0080\u0099s ByteDance to sell TikTok. There were also reports Friday that software giant Microsoft MSFT, +2.48% Â is in talks to buy the app. â\u0080\u009cAs far as TikTok is concerned, weâ\u0080\u0099re banning them from the United States,â\u0080\u009d Trump told reporters Friday on Air Force One as he returned from Florida. Trump said he could use emergency economic powers or an executive order to enforce the action, insisting, â\u0080\u009cI have that authority.â\u0080\u009d He added, â\u0080\u009cItâ\u0080\u0099s going to be signed tomorrow.â\u0080\u009d Reports by Bloomberg News and the Wall Street Journal citing anonymous sources said the administration could soon announce a decision ordering ByteDance to divest its ownership in TikTok. There have been reports of U.S. tech giants and financial firms being interested in buying or investing in TikTok as the Trump administration sets its sights on the app. The New York Times and Fox Business, citing an unidentified source, reported Friday that Microsoft is in talks to buy TikTok. Microsoft declined to comment. See also: Microsoft shares do a little jig on possible TikTok acquisition TikTok issued a statement Friday saying that, â\u0080\u009cWhile we do not comment on rumors or speculation, we are confident in the long-term success of TikTok.â\u0080\u009d ByteDance launched TikTok in 2017, then bought Musical.ly, a video service popular with teens in the U.S. and Europe, and combined the two. A twin service, Douyin, is available for Chinese users. TikTokâ\u0080\u0099s fun, goofy videos and ease of use has made it immensely popular, and U.S. tech giants like Facebook and Snapchat see it as a competitive threat. It has said it has tens of millions of U.S. users and hundreds of millions globally. But its Chinese ownership has raised concerns about the censorship of videos, including those critical of the Chinese government, and the potential for sharing user data with Chinese officials. TikTok maintains it doesnâ\u0080\u0099t censor videos based on topics sensitive to China and it would not give the Chinese government access to U.S. user data even if asked. The company has hired a U.S. CEO, a former top Disney executive, in an attempt to distance itself from its Chinese ownership. U.S. national-security officials have been reviewing the Musical.ly acquisition in recent months, while U.S. armed forces have banned their employees from installing TikTok on government-issued phones. Secretary of State Mike Pompeo said earlier this month that the U.S. was considering banning TikTok. These national-security worries parallel a broader U.S. security crackdown on Chinese companies, including telecom providers Huawei and ZTE. The Trump administration has ordered that the U.S. stop funding equipment from those providers in U.S. networks. It has also tried to steer allies away from Huawei because of worries about the Chinese governmentâ\u0080\u0099s access to data, which the company has denied it has. The Trump administration has stepped in before to block or dissolve deals on national-security concerns, including stopping Singaporeâ\u0080\u0099s Broadcom from its $117 billion bid for U.S. chipmaker Qualcomm QCOM, +2.06% Â in 2018 in an effort to help retain U.S. leadership in the telecom space. It also told Chinaâ\u0080\u0099s Beijing Kunlun Tech Co. to sell off its 2016 purchase of gay dating app Grindr. Other countries are also taking action against TikTok. India this month banned dozens of Chinese apps, including TikTok, citing privacy concerns, amid tensions between the countries. ___"}]}