{"article": [{"url": "https://www.marketwatch.com/story/oil-slumps-on-fears-rising-coronavirus-cases-will-crimp-demand-2020-07-30", "published": 1596123260.0, "headline": "U.S. oil prices drop below $40 on fears rising coronavirus cases will crimp demand", "body": "Oil futures were sharply lower on Thursday, with U.S. prices settling below $40 a barrel for the first time in three weeks, pressured by worries a resurgence in coronavirus cases around the world will cause demand to falter as major oil producers begin relaxing output curbs. “Demand concerns are front and center,” Phil Flynn, senior market analyst at The Price Futures Group, told MarketWatch. Iraq’s rising exports, meanwhile, have “raised concerns that Russia and the Saudis might start unwinding the OPEC+ deal as Iraq continues to cheat” on production cuts, he said. Iraq’s crude-oil exports averaged 2.75 million barrels per day, based on figures from Refinitive Eikon and an industry source, Reuters reported Thursday—up 50,000 barrels from June. “Terrible Jobs data and a worse than expected GDP added to demand woes, but the fact that President [Donald] Trump tweeted the question that the election could be delayed freaked people out,” he said. Against that backdrop, West Texas Intermediate crude for September delivery CL.1, -1.62% US:CLU20 on the New York Mercantile Exchange dropped $1.35, or 3.3%, to settle at $39.92 a barrel. That was the first settlement below $40 and lowest front-month contract finish since July 9, according to Dow Jones Market Data. September Brent crude UK:BRNU20 BRN00, -0.07%, which expires at the end of Friday’s session, fell 81 cents, or nearly 1.9%, at $42.94 a barrel on ICE Futures Europe. “Prospects of slower economic recovery” and OPEC’s hurry to trim production cuts show that the “demand/supply dynamics are not supportive of further short-term gains in oil markets,” said Ipek Ozkardeskaya, senior analyst at Swissquote Bank, in a note. U.S. economic data Thursday showed an economy badly battered by the coronavirus shrank at a record 32.9% annual pace in the second quarter. Initial jobless claims rose by 12,000 to 1.434 million in the week ended July 25. The number of COVID-19 cases around the world climbed above 17 million on Thursday, according to data aggregated by Johns Hopkins University, and the death toll rose to 667,688. The U.S. case tally climbed to 4.43 million and the death toll rose to 151,716, after crossing 150,000 late Wednesday. California and Florida posted single-day record death numbers on Wednesday and California added more than 12,300 cases, according to the New York Times. Meanwhile, the Organization of the Petroleum Exporting Countries and its allies, known collectively as OPEC+, are due in August to boost output by around 2 million barrels a day as they relax production curbs put in place earlier this year. Oil prices had edged higher Wednesday after the Energy Information Administration reported that U.S. crude inventories fell by 10.6 million barrels for the week ended July 24, the largest weekly decline since the 11.5 million-barrel fall reported for the week ended Dec. 27. The data, however, also revealed an unexpected climb in gasoline stocks, pulling futures prices for the fuel down by 1.9% Wednesday. On Nymex Thursday, August gasoline US:RBQ20 fell 1.7% to $1.2204 a gallon, while August heating oil US:HOQ20 shed 3.3% to $1.2119 a gallon,. Meanwhile, natural-gas futures finished lower Thursday after the EIA reported Thursday that domestic supplies of natural gas rose by 26 billion cubic feet for the week ended July 24. That was a bit higher than the average increase of 23 billion forecast by analysts polled by S&P Global Platts. September natural gas US:NGU20 fell 10 cents, or 5.2%, to $1.829 per million British thermal units. Losses for oil also came as traders watched storm developments in the Atlantic. Dan Flynn, market analyst at The Price Futures Group, said forecasts show Tropical Storm Isaias moving right through the state of Florida and up the Eastern Coast, “with minimal, if any, chance to enter the Gulf of Mexico,” where it could threaten oil and natural-gas production. However, “as we have seen in the past, these storms are very unpredictable and could change course in...a moment,” he said in a note. Read:U.S. shale oil production may take years to recover from COVID-19 demand slump"}]}