{"article": [{"url": "https://www.marketwatch.com/story/apple-investors-watch-out-for-the-winners-curse-2020-08-24", "published": 1598778800.0, "headline": "Apple investors: Watch out for the winners' curse", "body": "Quick: What was the most valuable company in the world 10 years ago? If you guessed Apple AAPL, +1.74%  - the most valuable today, with a market capitalization above $2 trillion-you'd be wrong. In 2010, occupying the No. 1 spot was oil giant ExxonMobil XOM, -1.47%. Returns since then? Zero. The stock has dropped from $61 to about $41, and even with dividends you've barely broken even - and that's before counting taxes and trading costs, let alone inflation. During the same period a standard, low-cost U.S. stock-market index fund has quadrupled your money. That's true for the SPDR 500 Trust SPY, +0.89%, which follows the S&P 500 SPX, +0.87%  large-company index; the Vanguard Total Stock Market Index fund VTI, +0.84%, which follows that company's index of large, midsize and small companies; and many others. OK - what was the most valuable company in the world five years before that, in 2005? If you thought it was still Exxon, you'd be 0 for 2. Actually in early 2005 it was General Electric Co. GE, +2.85%.  Returns since then: minus 70%. Yes, indeed. Even including reinvested dividends (and ignoring taxes, trading costs and inflation - we should all be so lucky). How about a few years before that? The biggest company on the stock market was Microsoft MSFT, +2.48%, and in 2001 it was briefly the megabank Citigroup C, +0.47%. Microsoft has been a terrific investment over that period - but only if you hung on for more than a decade. As for Citigroup: If you bought the stock in 2001, when it was the stock market's most valuable company, today you'd have lost 85% of your money. Yes, really. (And, once again, that's before deducting the costs you pay in the real world.) Go back to the 1980s and it would appear the stock market really anticipated the technology boom, because the world's most valuable company was a computer maker. Alas, it was IBM IBM, -2.81%. Love those mainframes! Oh, it made typewriters, too. OK, so this might look like a game. No doubt Apple's legion of stockholders and other fans will argue that the company is no IBM, or GE, or Exxon, or Citigroup, so the analogy won't apply. And all analogies break down eventually, so of course that's true. But there is serious research that shows not only that putting your money on the world's most valuable company has tended to be a poor long-term investment but that betting on the most valuable company in each sector has been, too. From around 1950 to 2010, \"the leader in any sector underperforms the average stock (equally weighted) in its own sector by nearly 4% in the next year â\u0080¦ and the next year â\u0080¦ and the next year. â\u0080¦ Put another way, with compounding, the top stock in the 12 U.S. market sectors declined 28% in value in 10 years, relative to the average stock in its respective sector, over the past 59 years.\" Yikes. Does this mean Apple is going to be a terrible investment over the next decade? No, of course not. As the late Casey Stengel advised: Never make predictions, especially about the future. But. If Apple makes up a big chunk of your 401(k), IRA or other retirement account, do the math. Sorry. Apple investors have become used to the most staggering stock-market returns. They've averaged 28% a year for 20 years. And so far the stock has earned them more than 70% - yes, really - since the start of this year. But in recent years, something has been happening that many investors may not fully appreciate. Apple's stock has been rising far faster than its per-share earnings. So in five years the stock has gone from $100 to $500. But during the same period the per-share earnings have risen only from $9 to $13. At 33 times forecast earnings for the next 12 months, Apple is now more expensive in relation to fundamentals than at any time since 2007-when the iPhone was new, and the company was one-twentieth of its current size, with gigantic room to grow. If you are expecting Apple to earn you 28% a year ahead, you're betting that in five years' time the company will be not America's first $2 trillion company, but the world's first $7 trillion company. Since 2015 Apple has gone from 11 times forecast earnings to 33 times. By 2025 are we expecting it to rise to 99 times? Just asking."}]}