{"article": [{"url": "https://www.marketwatch.com/story/the-coronavirus-recession-may-already-be-over-but-its-a-long-uphill-climb-to-normal-2020-06-13", "published": 1592035700.0, "headline": "The coronavirus recession may already be over, but itâ\u0080\u0099s a long uphill climb to â\u0080\u0098normalâ\u0080\u0099", "body": "The U.S. economy appears to be climbing out of a short though historically steep recession, but a return to normalcy? Thatâ\u0080\u0099s not in the cards anytime soon. After states began to reopen their economies in May, more people went back to work, consumer spending increased and Americans grew more confident that the worst of a coronavirus-induced recession was over. Read: Consumer sentiment climbs again in June as reopening U.S. economy eases worries More good news is on the way. Retail sales are expected to rebound smartly in May from a record 16.4% drop in April. Wall Street economists forecast a 5.4% snapback when the report is released next Tuesday. Another gauge of industrial production the same day is also likely to show a rebound. See: MarketWatch Economic Calendar The rebound comes as no surprise. Thereâ\u0080\u0099s a lot of pentup demand from consumers and businesses after a few months of the economy being almost entirely locked down. Now that businesses are reopening and people are moving about more, they can spend some of the money they had been involuntarily forced to save. Read:U.S. entered recession in February after end of longest expansion in history â\u0080\u009cThe opening of more businesses â\u0080\u0094 especially retail stores and restaurants â\u0080\u0094 will prompt more consumersâ\u0080\u0099 to open their wallets as they unleash a wave of pent-up demand that has been building in some parts of the country since mid-March,â\u0080\u009d said Scott Anderson, chief economist of Bank of the West. Higher retail sales alone, however, can be misleading. What matters even more is what consumers are buying or spending their money on. Jennifer Lee, senior economist at BMO Capital Markets, said a more telling tale about the strength of a nascent recovery is how much people spend on â\u0080\u009cthe wants and not the needs.â\u0080\u009d Examples: Dining out or takeout, home furnishings and hobby items such as books, music or sporting goods. â\u0080\u009cPeople want to go out,â\u0080\u009d she noted. â\u0080\u009cThat speaks volumes about consumer confidence.â\u0080\u009d Yet what happens after the pentup demand is met? â\u0080\u009cA lot depends on how things progress from here,â\u0080\u009d said senior economist Sam Bullard of Wells Fargo, referring to efforts to contain the coronavirus and find treatments. The federal governmentâ\u0080\u0099s willingness to keep providing benefits to millions Americans who lost their jobs during the pandemic is also critical. Bullard also pointed to the substantial amount of forced savings as another pool of money from which households can draw. Families have spent more on food, but theyâ\u0080\u0099ve hardly spent anything on clothes, gas, transportation, haircuts and other goods and services they normally would have purchased during the lockdown. Read: Consumer prices drop again as pandemic cuts rate of inflation to near zero Yet the economy canâ\u0080\u0099t avoid another slump if spending drops off again. Companies wonâ\u0080\u0099t bring back more workers if the demand isnâ\u0080\u0099t there, and fewer people returning to their jobs would eventually depress sales again. Thatâ\u0080\u0099s where the government comes in. Washingtonâ\u0080\u0099s effort to help families out with bonus checks and more generous unemployment benefits has played a key role in restarting the economy. If the federal government pulls back too soon, however, it could endanger a fragile recovery. See: Marketwatchâ\u0080\u0099s Coronavirus Economic Recovery Tracker â\u0080\u009cWe are still at the beginning,â\u0080\u009d Lee said. â\u0080\u009cWe are at the start line.â\u0080\u009d"}]}