{"article": [{"url": "https://www.marketwatch.com/story/the-fdas-list-of-toxic-sanitizers-is-surgingnow-at-75-heres-why-2020-07-23", "published": 1595663180.0, "headline": "The FDAâ\u0080\u0099s list of toxic sanitizers is surgingâ\u0080\u0094now at 75. Hereâ\u0080\u0099s why", "body": "The Food and Drug Administration has expanded its list of toxic hand sanitizers to 75 products that it says contain methanol, a toxic substance that could ultimately result in death if absorbed through the skin or ingested and is therefore are unsafe for human use. The warning includes some products that claim to have ethanol, or ethyl alcohol, which is safe to use, but which test positive for methanol. The agencyâ\u0080\u0099s initial list of harmful hand sanitizers started with a batch of nine alcohol-based cleaning products manufactured by Eskbiochem SA de CV in Mexico that it said contained wood methanol. However, since then the list has ballooned amid a continuing search for sanitizers that contain toxic substances. The FDA says it has been worried about â\u0080\u009cfalse and misleading claims for hand sanitizers,â\u0080\u009d including those suggesting that products can provide prolonged protection, â\u0080\u009csuch as 24-hoursâ\u0080\u009d against COVID-19, since there is no basis for such claims. Hereâ\u0080\u0099s a link to the list of the 75 products that the FDA says it has so far identified in its investigation into hand-sanitizer products that are â\u0080\u009ccontaminated with methanol that has led to recent adverse events including blindness, hospitalizations and death:â\u0080\u009d Following are some of the brands that have been deemed harmful by the FDA. Blumen Clear Advanced Hand Sanitizer with 70% Alcohol Blumen Advanced Instant Hand Sanitizer Clear Ethyl Alcohol 70% BLUMEN Advanced Instant Hand Sanitizer Clear KLAR AND DANVER Instant Hand Sanitizer (labeled with Greenbrier International Inc.) MODESA Instant Hand Sanitizer Moisturizers and Vitamin E BLUMEN Advanced Hand Sanitizer BLUMEN Advanced Hand Sanitizer Aloe BLUMEN Advanced Instant Hand Sanitizer Lavender BLUMEN Clear LEAR Advanced Hand Sanitizer BLUEMEN Clear Advanced Hand Sanitizer The Honeykeeper Hand Sanitizer BLUMEN Advanced Hand Sanitizer Clear BLUMEN Clear Advanced Instant Hand Sanitizer BLUMEN Clear Advanced Instant Hand Sanitizer Aloe BLUMEN Clear Advanced Instant Hand Sanitizer Lavender BLUMEN Aloe Advanced Hand Sanitizer, with 70 Alcohol Blumen Advanced Hand Sanitizer Lavender, with 70% alcohol Blumen Advanced Hand Sanitizer Aloe, with 70% alcohol Blumen Antibacterial Fresh Citrus Hand Sanitizer Blumen Hand Sanitizer Fresh Citrus KLAR and DANVER INSTANT HAND SANTIZER Hello Kitty by Sanrio Hand Sanitizer Assured Instant Hand Sanitizer (Vitamin E and Aloe) Assured Instant Hand Sanitizer (Aloe and Moisturizers) Assured Instant Hand Sanitizer Vitamin E and Aloe Assured Instant Hand Sanitizer Aloe and Moisturizers BLUMEN Instant Hand Sanitizer Fragrance Free BLUMEN Instant Hand Sanitizer Aloe Vera Assured Aloe bio aaa Advance Hand Sanitizer LumiSkin Advance Hand Sanitizer 4 oz LumiSkin Advance Hand Sanitizer 16 oz QualitaMed Hand Sanitizer Earths Amenities Instant Unscented Hand Sanitizer with Aloe Vera Advanced Hand Sanitizer Agavespa Skincare Vidanos Easy Cleaning Rentals Hand Sanitizer Agavespa Skincare All-Clean Hand Sanitizer Esk Biochem Hand Sanitizer Lavar 70 Gel Hand Sanitizer The Good Gel Antibacterial Gel Hand Sanitizer CleanCare NoGerm Advanced Hand Sanitizer 80% Alcohol CleanCare NoGerm Advanced Hand Sanitizer 75% Alcohol CleanCare NoGerm Advanced Hand Sanitizer 80% Alcohol Saniderm Advanced Hand Sanitizer Hand sanitizer Gel Unscented 70% Alcohol Andyâ\u0080\u0099s Best Andyâ\u0080\u0099s Gelclor NeoNatural Plus Advanced Optimus Lubricants Instant Hand Sanitizer Shine and Clean Hand Sanitizer Selecto Hand Sanitizer Mystic Shield Protection hand sanitizer Bersih Hand Sanitizer Gel Fragrance Free Antiseptic Alcohol 70% Topical Solution hand sanitizer Hand sanitizer (labeled with Wet Look Janitorial and Gardening Corp.) Britz Hand Sanitizer Ethyl Alcohol 70% DAESI hand sanitizer â\u0080\u009cConsumers who have been exposed to hand sanitizer containing methanol should seek immediate treatment, which is critical for potential reversal of toxic effects of methanol poisoning,â\u0080\u009d the FDA wrote on June 19. Read: FDA lists 59 hand sanitizers that can be toxic if absorbed by the body after expanding initial list â\u0080\u009cSubstantial methanol exposure can result in nausea, vomiting, headache, blurred vision, permanent blindness, seizures, coma, permanent damage to the nervous system or death,â\u0080\u009d the report indicated. The agency said the risk of possible ingestion centered mostly on young children or adolescents who might use alcohol-based sanitizers as a substitute for grain alcohol. Meanwhile, demand for hand sanitizer across the globe has increased as the coronavirus has spread, infecting about 13 million people, with 3.3 million in the U.S. alone, according to data compiled by Johns Hopkins University. Back in March, a number of retailers, including Costco Wholesale Corp. COST, +1.19%, BJâ\u0080\u0099s Wholesale Club Holdings Inc. BJ, +1.19% Â and Kroger Co. KR, +0.46%, reported surging sales in hand-cleaning products and other sanitizing merchandise. In the week ending April 25, Nielsen said hand sanitizer saw the highest in-store week-over-week sales growth. Individuals have even taken to attempting to make their own hand sanitizer. However, the U.S. Centers for Disease Control and Prevention has said that washing hands with plain soap and water is the best way to kill the novel strain of coronavirus that causes COVID-19. Moreover, hand sanitizer requires at least 60% alcohol. Alcohol dissolves the lipid membrane and disrupts other supramolecular interactions in viruses but you need a fairly high concentration of the alcohol to get a rapid dissolution of the virus. Vodka or whiskeyâ\u0080\u0094usually 40% ethanolâ\u0080\u0094wonâ\u0080\u0099t dissolve the virus as quickly. â\u0080\u009cOverall, alcohol is not as good as soap at this task,â\u0080\u009d wrote Palli Thordarson, a professor at the School of Chemistry at the University of South Wales, Sydney in a column for MarketWatch in April."}]}