{"article": [{"url": "https://www.marketwatch.com/story/investors-face-a-big-risk-heading-into-the-election-strategist-warns-and-its-not-because-biden-might-win-2020-08-17", "published": 1597666760.0, "headline": "Investors face a big risk heading into the election, strategist warns - and it's not because Biden might win", "body": "“ 'It is less about what he does after (the election)â\u0080¦ it is more about what he does before to try and make sure that doesn't happen.' ” By \"he,\" Cribstone Strategic Macro founder Michael Harris is referring to Donald Trump. And by \"that,\" Harris is talking about the potential for Trump's humiliation at the polls. In other words, Trump's efforts to avoid a big loss in November, in Harris's mind, is a risk that investors need to guard against by raising cash, buying puts, etc. \"That is why I think geopolitics could be especially hot over the next couple of months, and people should be buying protection on that basis, in my view,\" Harris told CNBC's \"Squawk Box Europe.\" An example of those efforts, he said, could be the ramping up of hostility toward Iran. \"A most likely 'rally around the flag' event would be (the U.S.) attacking Iran or perhaps (a) Venezuela overthrow,\" Harris told CNBC in an email detailing his views. \"So something around a temporary oil spike but not a fundamental call on oil winners.\" This, he said, could make defense contractors a good place to park some money. \"To me the message is just that a heavy act of military aggression is something investors should not be surprised by in the run up to the vote,\" he explained. While many on Wall Street are concerned that a Joe Biden victory would be bad for the stock market, Harris doesn't see it that way - in fact, quite the opposite. A Trump win would trigger a \"huge amount of turbulence in markets,\" he said, \"because I think the running assumption is we are going to have a lot of hostility and dysfunction in an environment like that.\" Watch the interview: Meanwhile, the stock market continues to hold up well, though the Dow Jones Industrial Average DJIA, +0.56%  turned slightly lower in Monday's trading session. Both the S&P 500 SPX, +0.87%  and Nasdaq Composite COMP, +1.39%  , however, were in the green."}]}