{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-cases-of-covid-19-climb-above-13-million-as-california-hong-kong-and-india-reimpose-restrictions-on-movement-2020-07-14", "published": 1594793780.0, "headline": "Coronavirus update: Global cases of COVID-19 climb above 13 million as California, Hong Kong and India reimpose restrictions on movement", "body": "The number of confirmed cases of the coronavirus illness COVID-19 climbed above 13 million on Tuesday, and the world’s eighth biggest economy, California, moved to again temporarily shut down higher-risk businesses such as bars and restaurants after a spike in hospitalizations. Other centers reimposing restrictions on movement include Hong Kong, and parts of Australia and India, including outsourcing center Bangalore. Russia reported more than 6,000 new cases overnight and in France, a baby boy was infected in its mother’s womb. In the U.K., face masks will become mandatory in indoor shops across England from July 24. French President Emmanuel Macron wants to require masks inside all indoor public spaces by Aug. 1. World Health Organization Director-General Tedros Adhanom Ghebreyesus warned that there is no way to return to normal “for the foreseeable future” and that there are “no short cuts out of this pandemic,” at a news conference, as the Guardian reported. In the U.S., a growing chorus of voices lamented the tensions between President Donald Trump and his own expert advisers, including Dr. Anthony Fauci, head of the National Institute for Allergies and Infectious Diseases, who is increasingly being targeted by administration officials over alleged mistakes make in handling the pandemic. Trump accused his most experienced infectious-disease expert of mistakes in a Fox News interview at the weekend, and administration officials gave the Washington Post a series of talking points outlining failures such as mixed messaging on wearing face masks. iframe.twitter-tweet { width: 100% !important; } Arne Duncan, former education secretary, said the war on science will cost lives. “The real travesty here is that there is no body count high enough for the president to actually pay attention to science,” Duncan said in an interview with MSNBC. “We could lose another 10,000. We could lose another 50,000. We could lose another 100,000. Nothing would compel him to listen to Dr. Fauci and others who are actually fighting to try and save lives.” See also: New York Gov. Cuomo says President Trump has put politics above public health throughout pandemic The U.S. now has 3.39 million confirmed cases of COVID-19 and at least 135,984 people have died, according to data aggregated by Johns Hopkins University. Forty one states and territories have seen cases rise over the last 14 days, according to a New York Times tracker. Florida is the new hot spot and Miami is the state epicenter. Florida counted more than 12,000 new cases on Monday, after more than 15,000 on Sunday. The Sunshine State has 282,427 confirmed cases and 4,276 people have died, the New York Times tracker shows. Miami-Dade County accounts for 67,712 of those cases and 1,143 of the deaths, for a mortality rate of 42 per 100,00 people. See: White House virus task force member says ‘none of us lie’ Carlos Migoya, chief executive of Miami-based nonprofit Jackson Health System, said Miami has about a three-week window before hitting the peak, and is missing vital equipment to cope — including staff: “That is a very tough three weeks,” Migoya said on MSNBC. “We’ve already been going at it for a full four months, and our staff are very, very tired and stressed, and, of course, nervous.” See:Coronavirus slashes deal-making globally: What to expect next Miami currently has a testing positivity rate of 25% to 28%, he said, which makes reopening schools in the fall unviable, he said. Multigenerational housing in Miami is causing young people to infect their parents and grandparents, he said, urging the public to wear face masks in public and socially distance. “We’re finding an awful lot of people that are extremely aggressive and against complying to those environments that is not really understandable at all,” he said. That message was echoed by Miami-Dade County Mayor Carlos A. Giménez: “‘Unless we change behavior, you can do all the tests in the world you want, we can get all the contact tracers in the world we want, it’s not going to make a difference,” said Giménez. “We have to change our behavior.” Robert Redfield, head of the Centers for Disease Prevention and Control, agreed. Redfield said at a Monday news conference that if every American agreed to wear a mask, “over the next six weeks we could drive (the virus) into the ground.” L.A. Public Schools Will Start Year Online, as Virus Rises in State Latest tallies There are now 13.2 million confirmed cases of COVID-19 world-wide and at least 574,615 people have died, according to data aggregated by Johns Hopkins University. At least 7.3 million people have recovered. Brazil is second to the U.S. with 1.88 million cases and 72,833 deaths. India is third measured by cases at 906,752, followed by Russia with 738,787 and Peru with 330,123. The U.K. has 45,053 fatalities, the highest in Europe and third highest in the world. China, where the illness was first reported late last year, has 85,117 cases and 4,641 fatalities. France will celebrate this year’s Bastille Day national holiday, not with the usual dignitaries attending a military parade but with a smaller ceremony honoring all of the front-line workers in the pandemic, from health care staff to supermarket workers and postal workers. See also: Rich countries may try to stockpile coronavirus vaccine, according to global health partnership founded by Bill and Melinda GatesWhat’s the latest medical news? Post-it maker 3M Co. MMM, +0.94% is developing a rapid diagnostic test for COVID-19 that would be used at the point of care, MarketWatch’s Jaimy Lee reported. The test, which is being jointly developed by researchers at the Massachusetts Institute of Technology, has been selected by the National Institutes of Health for commercial support and has received $500,000 from the U.S. government. Rigel Pharmaceuticals Inc. RIGL, -1.15% will test a drug used to treat an autoimmune disorder in a clinical trial in the U.K. as a treatment for COVID-19 pneumonia. The Imperial College London will operate the open-label, controlled trial for Tavalisse, which received Food and Drug Administration approval for chronic immune thrombocytopenia in 2018. Patients will receive Tavalisse, the chemotherapy ruxolitinib, or the standard of care, with a goal of understanding whether the drug can prevent the progression of mild or moderate COVID-19 pneumonia to more severe disease. Shares of Moderna Inc. MRNA, +0.09% soared on the news that the company, which is developing a COVID-19 vaccine, will join the Nasdaq-100 Index before the market opens on July 20. Read now:Race for a COVID-19 vaccine has drugmakers scaling up manufacturing — before one is developedWhat are companies saying? The second--quarter earnings season kicked off early Tuesday with earnings from three of the biggest U.S. banks and Delta Air. Bank earnings predictably showed gains from trading volatile markets and fees from underwriting debt and equity deals offsetting weakness in consumer banking and a big boost in loan loss provisions. See:S&P 500 earnings set to plunge as the coronavirus batters all sectors — with Wall Street counting on a bounce that may not come JPMorgan Chase & Co. JPM, -0.57% and Citigroup Inc. C, +0.47% managed to beat analyst estimates, even as profits fell, while Wells Fargo swung to a wider-than-expected loss, its first in more than a decade. Wells Chief Executive Charles Scharf said the bankwas “extremely disappointed” in its results and need to cut its dividend. “Our view of the length and severity of the economic downturn has deteriorated considerably from the assumptions used last quarter, which drove the $8.4 billion addition to our credit loss reserve in the second quarter,” he said. Delta DAL, +0.39% also reported a bigger-than-expected loss as the pandemic grounded flights and recession destroyed demand. Elsewhere, companies continued to update guidance and analysts continued to adjust models for the new COVID world. Here’s the latest news about companies and the pandemic: • Bed Bath & Beyond Inc.’s BBBY, -1.37% June same-store sales were “positive” for reopened stores and digital channels. Cash flow during June was also positive. Nearly all stores have reopened, following closures because of the pandemic. Separately, the company believes there is between $350 million to $450 million it could get from asset sales and the plan to reduce up to $1 billion of inventory at retail is slightly more than halfway complete. • Analyst James Hardiman at Wedbush cut his price target on Carnival Corp. CCL, +0.51% to $20 from $29 while reiterating his neutral rating, in the wake of the cruise operator’s announcements last week that three of its AIDA Cruises will start resailingin August, and that cumulative advance bookings for 2021 remained within historical ranges, although at lower prices. “While a legitimate target for the restart of the AIDA brand is encouraging, we can’t help but think that we remain a far distance away from operations resuming in the United States given a resurgence in COVID-19 cases as well as halted (in some instances reversed) economic reopenings,” Hardiman wrote in a note to clients. • Delta Air Lines Inc. DAL, +0.39% reported second-quarter losses that were wider than expected, although revenue beat lowered expectations. Passenger revenue for the quarter fell 94% to $678 million, and cargo revenue was down 42% to $108 million. “Given the combined effects of the pandemic and associated financial impact on the global economy, we continue to believe that it will be more than two years before we see a sustainable recovery,” said Delta Chief Executive Ed Bastian, emphasizing the “staggering impact of the COVID-19 pandemic on our business.” Delta ended the quarter with $15.7 billion in liquidity, and reduced its daily cash burn in June by 70% compared to late March, down to an average of $27 million. The airline has received $5.4 billion in grant funds and unsecured loans through the CARES Act, which will be paid in installments through July 2020. Maturities on $1.3 billion in borrowings on revolving credit facilities have been extended to 2022 from 2021. Delta has taken additional sanitation steps in the face of the coronavirus pandemic, has limited load factor at 60% and is blocking off middle seats. The company has provided more than $2.2 billion in cash refunds in 2020. Delta is positioning itself to be a smaller airline over the next couple of years, retiring MD-88 and other planes, and reducing head count through early retirement and other programs. The company is also accelerating airport construction projects in New York’s LaGuardia Airport, in Los Angeles and other cities. At the end of the quarter, the company had total debt and finance lease obligations of $24.6 billion. Delta took a write down of $1.1 billion on its investment in LATAM Airlines and a write down of $770 million on its investment in AeroMexico after those companies’ losses and bankruptcy filings. The company took a $200 million write down in its investment in Virgin Atlantic, a $200 million charge. • BS analyst Eric Sheridan downgraded Netflix Inc.’s NFLX, +1.43% stock to neutral from buy, writing that while the company looks poised to report a strong June quarter as it continued to benefit from COVID-19 lockdowns, investors seem to have already priced in these benefits to Netflix’s shares. “Unlike prior periods over the last few months (with debates centered around competition with Disney, balance sheet vs. free-cash flow generation, content costs/competition), investor fears seem to have disappeared and the current stock price increasingly reflects many of the long-term business moat dynamics including sustained growth in users/revs and steady state margin expansion,” Sheridan said in his note to clients. He sees tough subscriber comparisons ahead for the company next year and wrote that he “would rather be constructive at levels when a mix of potential subscriber volatility, FCF dynamics & competition are better reflected in the share price.” Sheridan kept his $535 price target unchanged. • Tesla Inc. TSLA, +1.89% extended their seemingly unstoppable rally, after Piper Sandler analyst Alexander Potter raised his price target on the stock to $2322 from $939, writing of “faster-than-expected share gains” and big opportunities in software. Though Tesla shares have rocketed nearly 260% on the year and the stock’s valuation is 88 times higher than it was after its 2010 initial public offering, Potter said that “resoundingly” his conclusion is to stick with the stock. “While deliveries are a key driver of our increased near-term estimates, software is the biggest driver of our increased DCF-based price target,” he wrote in a late Monday note to clients. “Tesla has noted the possibility for 30%+ gross margins if/when more customers opt-in for purchasing the company’s full self-driving (FSD) software.” That could help Tesla record operating margins in the “mid-20s” by the end of Potter’s 20-year forecast period, even if only half of customers go for the full self-driving software. “Thanks to the high-margin nature of the FSD package, we think that by the 2030s, Tesla could conceivably be selling vehicles at cost - or even below cost - while still achieving higher operating margins,” he wrote. Tesla shares have rallied even though its main California plant was closed for much of the recent quarter because of the pandemic. See:Tesla’s earnings on tap next week: Will a loss end its blowout stock rally? • The Travelers Cos. Inc. TRV, +0.18% expects to report a net loss per share of 16 cents for the second quarter, weighed down by a high level of catastrophe losses, mostly stemming from severe storms in the U.S., along with claims related to social unrest. The New York-based insurer is expecting net investment income of $268 million pretax, or $251 million after-tax, including $511 million from its fixed income portfolio and a loss of $234 million in the non-fixed income portfolio. That is equal to $438 million after-tax and $180 million after-tax respectively. The company is expecting the pandemic to have a modest impact on its underwriting result. Insurance losses directly caused by the pandemic are expected to come to $114 million pretax. The company will report second-quarter earnings on July 23. • Wells Fargo & Co. tumbled 6.5%, enough to pace the large-capitalization banking sector’s decliners, after the bank reported second-quarter results that missed expectations. The stock is on track to suffer the biggest one-day post-earnings decline since it tumbled 8.4% on Oct. 17, 2011, after third-quarter 2011 results were released. Additional reporting by Tim Rostan"}]}