{"article": [{"url": "https://www.marketwatch.com/story/dow-pulls-back-240-points-after-previous-days-rally-2020-07-07", "published": 1594140200.0, "headline": "Dow ends nearly 400 points lower, U.S. stocks swoon, on doubts of quick economic recovery", "body": "U.S. stocks on Tuesday ended sharply lower, with the S&P 500 snapping its 5-day win streak, as investors grew wary of the economic, public-health and policy response to the coronavirus pandemic. Equities lost steam after the White House reiterated a call to cap the next round of COVID-19 stimulus at $1 trillion or less, but accelerated their losses in the final hour of trade, after several Federal Reserve officials warned of challenges to the economy as infection rates soar across several states. How did benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% tumbled 396.85 points, or 1.5%, to end at 25,890.18, the S&P 500 index SPX, +0.87% shed 34.40 points, or 1.1%, closing at 3,145.32 and end a 5-session win steak; while the Nasdaq Composite Index COMP, +1.39% fell 89.76 points, or 0.9%, to finish at 10,343.89, after carving out an intraday 10,518.98 record. On Monday, the Dow gained 459.67 points, or 1.8%, to end at 26,287.03. The S&P 500 climbed 49.71 points, or 1.6%, ending at 3,179.72 and matching its longest win streak, five straight sessions, since the period ended Dec. 17; while the Nasdaq surged 226.02 points, or 2.2%, to 10,433.65, scoring its third straight record and its 24th of the 2020. What drove the market? Nagging unease over the outlook for the global economy in the midst of rising U.S. coronavirus infections helped dampen the buying mood on Wall Street. The White House added to those concerns Tuesday when Vice President Mike Pence’s top aide said the Trump administration wants Congress to cap the next COVID-19 stimulus package at $1 trillion or less, during an interview with Bloomberg Radio. “There’s obviously been a lot of stimulus put in the system over the last couple bills, and so the price tag for us would be that,” said Marc Short, Pence’s chief of staff. Jon Adams, senior market strategist at BMO Global Asset Management, pointed to the interview as one of the reasons why the stock rally took a breather Tuesday. “It’s really clear to us that policy is driving markets and seems to be the only thing that matters,” he told MarketWatch. “We’re constructive on risk assets, but perhaps a bit less so than a few months ago.” While calls from the Republican ranks for limits on further coronavirus relief aren’t new, the latest salvo from the White House comes as U.S. coronavirus cases neared 3 million, and Arizona, California, Texas and other states were expressing concerns about their hospitals rapidly filling up. The Trump administration also on Tuesday began the formal process of withdrawing from the World Health Organization, starting the clock on a one-year exit timeline and jeopardizing its top funding source for aid during a global pandemic. Earlier in the session, investors drew some hope from an employment report that showed a record 6.5 million people either found jobs or were rehired in May, following a prolonged shutdown due to the coronavirus that drove the U.S. into a deep recession. Job openings also rose to 5.4 million in April from 5 million in the prior month, according to a Labor Department report that’s released with a one-month delay. The number of jobs available was running around 7 million before the pandemic. However, San Francisco Fed President Daly said Tuesday the U.S. unemployment rate underestimates the economic damage of the virus, while Richmond Fed President Barkin said the central bank still has “more to do” with the jobless rate at 11.1%, during a virtual talk on the pandemic at the National Association for Business Economics. Read: Federal Reserve leaders see ‘bumpier’ recovery, slower decline in unemployment During a separate online talk, Atlanta Fed President Raphael Bostic said COVID-19 may be threatening the pace of the U.S. recovery, according to a Bloomberg report, a day after he described the recovery as “leveling off,” and raising doubts about a V-shaped, or swift and powerful, economic rebound. The warnings come as some states roll back business reopenings with COVID-19 cases soaring. Dr. Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases, said Tuesday that the U.S., unlike much of Europe, is now seeing “the consequence of community spread, which is even more difficult to contain.” Market participants also attributed some of the day’s malaise to dimming outlook for quarterly corporate earnings reports, even though they are widely expected to be poor, given the challenges posed by the pandemic. Refinitiv’s latest earnings scorecard has the S&P 500 index’s second quarter, year over year, blended earnings growth estimate at negative 43.4%, while noting the growth rate for the index drops to negative 38.2% if the battered energy sector is excluded. Opinion: Robert Shiller explains the pandemic stock market and why it’s decoupled from the economy On the global front, the Organization for Economic and Cooperation and Development said on Tuesday that unemployment will reach the highest level since the Great Depression and may not return to pre-crisis levels until 2022. In addition, the European Commission lowered its eurozone economic forecast by a percentage point, predicting a contraction of 8.7% this year. Read: Here’s what the rest of the year may hold for the stock market, according to the analysts who got the pandemic call rightWhich stocks were in focus? Shake Shack Inc. SHAK, +1.82% stock fell 6.6% after the burger chain announced preliminary second-quarter sales that missed expectations. Shake Shack said sales totaled $91.8 million for the quarter ending June 24, below the FactSet consensus for $101.0 million. Novavax’s NVAX, +0.18% experimental COVID-19 vaccine received a $1.6 billion commitment from the U.S. government to help the company expedite testing and production by the beginning of next year, even though it is still in an early phase trial involving 130 participants with nongovernmental funding. Its stock climbed 31.6%. Shares of Corvus Pharmaceuticals Inc. CRVS, -1.23% soared 80.8% on Tuesday after the company said it launched an open-label Phase 1 clinical trial to test an experimental monoclonal antibody as a treatment for COVID-19. Paychex Inc. PAYX, +0.40% said Tuesday it had net income of $220.7 million, or 61 cents a share, in its fiscal fourth quarter to May 31, down from $230.4 million, or 64 cents a share, in the year-earlier period. Shares fell 4.9%. Tripadvisor inc. TRIP, +0.74% said Tuesday it plans to offer $500 million of new senior notes that mature in 2025. Shares of the company fell 5.2%. Shares of Regeneron Pharmaceuticals Inc. REGN, +0.36% gained 2.2% on Tuesday after the drugmaker said it received $450 million from the federal government to manufacture and supply its still investigational COVID-19 treatment. Residential solar-panel installer Sunrun Inc. RUN, +1.26% announced a deal Monday night to acquire rival Vivint Solar Inc. US:VSLR for about $3.2 billion, including debt. Shares of Sunrun surged 22.6% Tuesday, while those for Vivint rose 38.2%. Tesla Inc. TSLA, +1.89% shares edged 1.3% higher after Adam Jonas of Morgan Stanley upped his price target on Tuesday for shares of the electric car maker to $740, implying a downside of around 47% from Tuesday’s share price, but also said there’s a $2,0270 “bull case” for the stock price. How did other assets perform? West Texas Intermediate U.S. crude US:CLQ20 for August delivery ended little changed, down only a penny, at $40.62 a barrel, on the New York Mercantile Exchange, after slipping less than 0.1% on Monday. In precious metals, August gold futures US:GCQ20 soared $16.40, or 0.%, to end at $1,809.90 an ounce, its highest level since Sept. 2011. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% was 3.5 basis points lower at 0.648%. Bond prices move inversely to yields. The greenback rose 0.3% against a basket of its major rivals, based on trading in the ICE U.S. Dollar Index. DXY, -0.58% In European equities, the Stoxx Europe 600 index SXXP, +0.55% ended 0.6% lower, and London’s FTSE 100 UKX, +0.64% declined 1.5%. In Asia markets, the Shanghai Composite Index SHCOMP, +1.67% closed up 0.4%, the CSI 300 Index 000300, +2.04% finished 0.6% higher after yesterday’s 5.7% rally. Hong Kong’s Hang Seng Index HSI, -0.30% fell 1.4% and South Korea’s Kospi Composite Index 180721, +0.21% fell 1.1%."}]}