{"article": [{"url": "https://www.marketwatch.com/story/rip-buddy-the-first-dog-to-test-positive-for-the-coronavirus-in-the-us-has-died-2020-07-31", "published": 1596279800.0, "headline": "RIP Buddy: The first dog to test positive for the coronavirus in the U.S. has died", "body": "If we’re still learning about how the coronavirus spreads among humans, and why some people get so much sicker than others — then we’ve barely scratched the surface with what it does to pets. While the number of animals infected worldwide remains relatively low, the first U.S. dog to test positive for SARS-CoV-2, the novel coronavirus that causes COVID-19, has sadly died. National Geographic has identified the pup as Buddy, a 7-year-old German shepherd from Staten Island, N.Y., in an exclusive interview with his family that published this week. Buddy passed on July 11, just two and a half months after he started wheezing and developing thick mucus in his nose. But the Mahoney family’s struggle to get him tested and to fully understand why their pet’s health declined so rapidly — and whether lymphoma, which wasn’t diagnosed until the day he died, played a part in it — illustrates just how many questions remain about the virus’ effect on animals. “You tell people that your dog was positive, and they look at you [as if you have] 10 heads,” Allison Mahoney, one of Buddy’s owners, told National Geographic. “[Buddy] was the love of our lives….He brought joy to everybody. I can’t wrap my head around it.” The family explained that Buddy began showing difficulty breathing in mid-April, when Allison’s husband Robert Mahoney had been sick with the virus himself for three weeks. “Without a shadow of a doubt, I thought [Buddy] was positive,” Robert said. Related: Can my dog or cat get coronavirus? Can I kiss my pet? FDA video warns pet owners about spreading COVID-19 But the first few veterinarians that they visited were skeptical that Buddy had the coronavirus. In some cases, clinics simply didn’t have the COVID-19 test on hand to find out. The third clinic that the Mahoneys visited finally tested Buddy, and he was confirmed positive for COVID-19 on May 15, a month after his symptoms began. By May 20, he tested negative for the virus, indicating it was no longer present in his body — although he did have the antibodies for it, which was further evidence he had been infected. The U.S. Department of Agriculture verified in a June 2 press release that Buddy was the first confirmed case of canine COVID-19 in the country. Buddy’s diagnosis spurred more questions, however: could he have spread it to the family’s 10-month-old German shepherd puppy, Duke, or anyone else in the house? (He did not.) Had he contracted it from Robert? (That seems likely.) And why was this otherwise healthy dog’s health suddenly crashing, despite being on prescription antibiotics and steroids? (He had not been diagnosed with possible lymphoma yet.) He lost weight and began to have trouble walking. And on the morning of July 11, the poor dog began vomiting clotted blood. There was nothing more that the family or veterinarians could do for Buddy, so they made the difficult decision to euthanize him. But new blood work done the day that Buddy was euthanized revealed he probably had lymphoma, a type of cancer, which could explain some of his symptoms toward the end. But it’s still unclear whether this underlying condition made him more vulnerable to the coronavirus, or whether the coronavirus is what first made him sick — or whether it was just bad, coincidental timing. The Mahoneys don’t bear any blame or ill will toward the clinic. “I think they are learning as well. It’s all trial and error. And they tried to help us the best way they can,” Allison said. They do wish that health officials had performed a necropsy (essentially a pet autopsy, or postmortem medical exam) to learn more about the virus in Buddy’s body. The family doesn’t remember anyone asking them about a necropsy on the day Buddy was euthanized, however, although they admit the sad day was a blur. Robert Cohen, the veterinarian at Bay Street Animal Clinic who treated Buddy — and who lost his own father to COVID-19 just a couple of weeks ago — told National Geographic that he asked the NYC Department of Health whether it needed Buddy’s body for follow up research. But by the time NYCDOH responded with a decision to do a necropsy, Buddy had already been cremated. So we don’t know for sure whether the coronavirus is what killed Buddy. “While testing of Buddy did indicate an infection with SARs-CoV-2 [the novel coronavirus that causes COVID-19], he also had lymphoma, which can cause clinical signs similar to those described, and it very likely was a primary reason for his illness and ultimately death,” Dr. Doug Kratt, president of the American Veterinary Medical Association (AVMA), told MarketWatch by email. “We have much more to learn about this virus and this disease,” he continued. “Research is underway to determine the full reach of SARS-CoV-2, how infection with the virus may affect animals, and which animals are susceptible and why (or why not).” Related:Owners warned stop kissing pets as U.K. latest to sound the alert over cat infected with coronavirus While this case raises a lot of questions about the coronavirus in animals, here’s what we do know. On the plus side, there are very few cases of COVID-19 in animals, especially relative to humans. While the virus has infected more than 17 million people worldwide, there are less than 25 confirmed cases in pets globally — although it should be noted that there has not been widespread testing of pets. The CDC is still not recommending routine testing for pets, largely because there is no evidence that pets are spreading the virus to people, and also because there are many health issues that could cause symptoms similar to COVID-19 in pets. “Because these other conditions are much more common than SARS-CoV-2 infections in animals, routine testing of pets for SARS-CoV-2 is not currently recommended by veterinary infectious disease experts, animal health officials, or public health veterinarians,” Dr. Kratt said. “Testing may be appropriate in certain situations after a pet has been completely evaluated by a veterinarian to rule out other causes of their illness.” So it remains unclear how many pets in the U.S. have been tested, or how many could carry the coronavirus. “We don’t want people to panic. We don’t want people to be afraid of pets” or to rush to test them en masse, CDC official Dr. Casey Barton Behravesh told the AP. “There’s no evidence that pets are playing a role in spreading this disease to people.” What’s more, the pets who do get sick generally have mild symptoms, and they usually recover. But Buddy’s fatal case does raise questions about whether more pets should be tested moving forward, or if animals with underlying conditions could be more vulnerable to the virus in the same way that many people with pre-existing health conditions have been hit harder by COVID-19. “Certainly it is likely the underlying condition could weaken the dog’s natural defenses to a lot of things,” one South Carolina vet told National Geographic. The FDA and the CDC are recommending that people practice social distancing with their pets, such as keeping dogs on a leash and six feet away from dogs and people who aren’t from their household. Anyone who gets sick with the coronavirus should isolate themselves from their pets, if possible, as there is evidence that pets can catch the virus from humans. And the U.K.’s chief veterinary officer has warned pet owners to stop kissing their pets, sharing food with them or sharing beds with them. Click here for more information about what we know about pets and coronavirus so far, as well as answers to many questions about taking care of pets during the pandemic. And for more information, check out the following resources: American Veterinary Medical Association: avma.org The Centers for Disease Control: cdc.gov/coronavirus And read more of MarketWatch’s coronavirus coverage here."}]}