{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-down-on-weak-demand-outlook-2020-09-14", "published": 1600096460.0, "headline": "Oil ends lower on weak demand outlook, but storm disruptions to Gulf output limit losses", "body": "Oil futures ended lower on Monday, undercut by continued demand worries, as the Organization of the Petroleum Exporting Countries further reduced its outlook for demand growth, as well as the potential for more oil from Libya. A storm in the Gulf of Mexico, however, has prompted shutdowns among energy platforms and rigs in the region, limiting losses for oil and lifting prices for natural gas. “Losing the psychological 40-dollar mark makes traders wonder how deep the oil price decline [may] be during the second wave of the pandemic,” said Bjornar Tonhaugen, head of oil markets at Rystad Energy, in daily market commentary. Demand is at much better levels since the first wave of the pandemic, but it has “not recovered to levels the market hoped for, and forecast are pretty flat for the coming months,” he said. The COVID-19 pandemic is “not past us yet and new infection cases continue to mushroom around the world, which in turn affects how key oil-consuming markets work.” And while “demand sweating to keep up, supply is accelerating,” said Tonhaugen. The comeback of some of curtailed production from the Organization of the Petroleum Exporting Countries and their allies is starting to be “visible in the market,” with Middle Eastern producers cutting prices, onshore storages filling up and offshore storage in demand, he said. West Texas Intermediate crude for October delivery CL.1, -1.62% US:CLV20 fell 9 cents, or 0.2%, to end at $37.24 a barrel on the New York Mercantile Exchange, while the global benchmark, November Brent BRN.1, -0.07% UK:BRNX20 declined by 22 cents, or nearly 0.6%, at $39.61 a barrel on ICE Futures Europe. OPEC, in its monthly report on Monday, said it now expects 2020 oil demand to contract by 9.5 million barrels a day to 90.2 million barrels a day, versus its previous call for a 9.1 million barrel-a-day fall. It also lowered its outlook for demand growth in 2021, citing the lingering effects of the coronavirus. Also weighing on prices, analysts said, was a report by Reuters that Libyan commander Khalifa Haftar plans to halt a blockade of the oil-exporting nation’s ports. “Unquestionably, this could put OPEC+ in an even more giant pickle when they hold a virtual meeting on Thursday to review the current production intervention level’s price impacts,” said Stephen Innes, chief global markets strategist at AxiCorp. “But one can be assured the cartel will not be happy to witness markets building a steeper contango since the last meeting.” A contango occurs when deferred contracts are priced at a premium to nearby prices. Rystad’s Tonhaugen said that “if Libya’s production comes back online soon, we are talking about 1 million bpd or more,” leading to a “significant addition to the global balances.” Meanwhile, some Gulf of Mexico oil producers are idle idling production as they prepared for Hurricane Sally. As of Monday afternoon, the National Hurricane Center forecasted that the hurricane will approach southeastern Louisiana this evening and make landfall on Tuesday or Tuesday night. with “life-threatening” flash flooding likely along the central Gulf Coast. Oil production in the Gulf of Mexico on Monday was down by 21.4% and 25.3% of natural-gas production has been shut in, according to the Bureau of Safety and Environmental Enforcement. Flash flooding will “impact production and refining,” said Phil Flynn, senior market analyst at The Price Futures Group, in a daily note. A “slow moving storm can damage offshore infrastructure and flooding can sink pipelines and takeout refineries.” For now, the storm provided support for natural gas, which saw its October contract US:NGV20 climb by 4 cents, or 1.8%, to $2.31 per million British thermal units. Among the oil products, also gained, with October gasoline US:RBV20 up 1.1% at $1.1068 a gallon and October heating oil US:HOV20 up nearly 0.4% at $1.0934 a gallon."}]}