{"article": [{"url": "https://www.marketwatch.com/story/check-out-the-mustang-mach-e-fords-electric-suv-2020-09-28", "published": 1601269940.0, "headline": "Check out the Mustang Mach-E, Fordâ\u0080\u0099s electric SUV", "body": "Itâ\u0080\u0099s an electric SUV. Itâ\u0080\u0099s aÂ Mustang. There will be higher-performance GT versions. EPA-estimated range from 210 miles to 300 miles. TheÂ 2021 Mustang Mach-EÂ is a monumental vehicle forÂ Ford F, -1.36% Â . The Ford Mustang Mach-E is an all-electric SUV and the automakerâ\u0080\u0099s first vehicle built from the ground up as an EV. Perhaps even more significantly, it bears the name of Fordâ\u0080\u0099s iconic pony car. The Mach-E represents the first time in 55 years Ford has expanded the Mustang lineup, and its innovative electric powertrain represents nothing less than the carmakerâ\u0080\u0099s future. No doubt bestowing the Mustang pedigree on an SUV â\u0080\u0094 a fully electric one, no less â\u0080\u0094 has left some Mustang purists tearing their hair, but thatâ\u0080\u0099s a gamble Ford is willing to take. And it looks like a smart one. For one thing, theÂ MustangÂ sports car isnâ\u0080\u0099t going away. And for drivers craving the V8 rumble of that performance car, the latest Ford Mustang coupe and convertible are better than ever. TheÂ 2021 Mustang Mach-EÂ is chasing a different set of buyers and pits itself against new rivals. Whereas the Mustang car has long competed with vehicles like theÂ Chevrolet CamaroÂ andÂ Dodge Challenger, the Mach-E has in its sights rivals like theÂ Tesla TSLA, +1.89% Â Model Y,Â Audi e-tron, and the slew other electric SUVs on the horizon. Also see:10 cool things about the Ford Mustang Mach-E, besides being electric The 2021 Ford Mach-E is set to go on sale in late 2020 with a starting price of $43,895. As an all-electric vehicle, it will be eligible for incentives such as the $7,500 federal tax credit. The Ford Mustang Mach E Ford All-electric power Available as eitherÂ rear-wheel driveÂ (RWD) orÂ all-wheel driveÂ (AWD), theÂ 2021 Ford Mustang Mach-EÂ can be outfitted with a standard-range or an extended-range battery. Ford claims an estimated 300-mile range when the electric SUV is equipped with the extended-range battery and configured as RWD. A 210-kilowatt motor drives the rear wheels. In AWD versions a second 50-kilowatt motor drives the front wheels. A 288-cell battery pack stores power for standard range. Extended-range models use a 376-cell battery pack. Depending on configuration, power ranges from 255 horsepower and 306 lb-ft of torque to 459 hp and 612 lb-ft of torque. The Mustang Mach-Eâ\u0080\u0099s 0-60 mph times are estimated to range from the low 6 seconds to the mid 3 seconds. The 2021 Ford Mustang Mach-E offers three different driving experiences: Whisper, Engage and Unbridled.The trappings What should a Mustang SUV look like? Other than the Running Pony logo on the front of the Mach-E, there is little to identify it as a Mustang. Sleek, stylish and aggressive all describe the exterior. Wheel sizes run from 18 inches to 20 inches depending on the trim. Inside the Mach-E seats up to five. In addition to the cargo room behind the second-row seat, there is more than 4.0 cu-ft of room under the hood. A 15.5-in touchscreen dominates the center of the dashboard. Responding like a smartphone with swipes and pinches, the touchscreen interface, says Ford, will steadily make the driverâ\u0080\u0099s life easier by learning his or her preferences. You might like: Which is better, the Ford Bronco or the Land Rover Defender? While the screen uses touch for most commands, Ford has also wisely put in a large, easy-to-reach volume knob. In addition to the main dial for changing volume, there is an outer ring for other functions, and the dial can be pressed for other functions. Thatâ\u0080\u0099s not the only tech-forward screen in the new Ford Mach-E. This Ford electric SUV also features a 10.2-inch digital instrument cluster.Ford Mach-E model selection, pricing and availability Upon launch, the Mustang Mach-E will be available in three trims: Select ($43,895), Premium ($50,000), and California RT.1 Edition ($52,400). The First Edition ($59,900) is already been sold out. Arriving next year is the GT ($60,500). Standard feature highlights in theÂ Ford Mustang Mach-EÂ SelectÂ model include 8-way power-adjustable driver seat/4-way manual adjust passenger seat, dual-zone climate control, manual liftgate, 18-inch aluminum wheels, and auto-dimming rearview mirror. As expected in a tech-forward vehicle, thereâ\u0080\u0099s plenty of included tech such as the latest Sync 4A system with 15.5-inch touchscreen display, Apple AAPL, +1.74% Â CarPlay/Android Auto, 4G LTE and Wi-Fi connectivity, and USB ports in the front and back. Standard safety features include Ford Co-Pilot 360 2.0 with lane-keeping assist,Â forward-collision warningÂ withÂ automatic emergency braking, blind-spot monitoring, adaptive cruise control and speed sign recognition. Another cool feature is that your phone can act as the vehicleâ\u0080\u0099s key. Also see: A plug-in hybrid Jeep is coming. Check out the Wrangler 4xe TheÂ Ford Mustang Mach-E PremiumÂ trim adds panoramic roof, hands-free power liftgate, 19-in wheels, active drive assist prep kit (over-the-air software updates to come next year), active parking assist, heated front seats and steering wheel, 8-way power passenger seat and 9-speaker premium audio system by Bang & Olufsen. TheÂ Ford Mustang Mach-E California Route 1Â gets similar features as the Premium but is offered in rear-wheel-drive only and has an extended-range battery pack estimated to deliver 300 miles of range. It has 18-in wheels and unique California Route 1 badges. Coming after launch is theÂ Ford Mustang Mach-E GT. It will have more power, standard all-wheel drive and estimated range of 250 miles. It comes with 20-in wheels, more aggressive styling, red brake calipers, and 10-speaker B & O audio system. Further upping the thrills will be the GT Performance Edition, with features like MagneRide suspension and the ability to do 0-60 mph in some 3.5 seconds.Â Also on MarketWatch: American muscle: We compare a Chevy Camaro to Dodge Challenger This story originally ran on Autotrader.com."}]}