{"article": [{"url": "https://www.marketwatch.com/story/in-a-true-battle-royale-apple-and-fortnite-maker-appear-headed-for-a-courtroom-2020-08-13", "published": 1597489100.0, "headline": "â\u0080\u0098Fortniteâ\u0080\u0099 maker accuses Apple, Google of illegal monopolistic practices in tech battle royale", "body": "The maker of â\u0080\u009cFortniteâ\u0080\u009d has launched a Battle Royale against Apple Inc. and Alphabet Inc., filing lawsuits against the two tech giants that claim they illegally exploit a monopoly on app and in-app purchases. Epic Games filed legal papers against Apple AAPL, +1.74% Â and Alphabetâ\u0080\u0099s GOOGL, +1.82% Â GOOG, +1.97% Â Google after the two tech giants booted the companyâ\u0080\u0099s hit game â\u0080\u009cFortniteâ\u0080\u009d out of their app stores Thursday, after Epic publicly announced an offer for players to receive a discount on in-game purchases if they paid Epic directly. Apple and Google take up to 30% of all purchases in their app stores, and Appleâ\u0080\u0099s approach to its app ecosystem has recently faced antitrust heat from the U.S. government. In the first lawsuit filed Thursday, against Apple, Epic said it would seek â\u0080\u009cto end Appleâ\u0080\u0099s unfair and anticompetitive actions that Apple undertakes to unlawfully maintain its monopoly.â\u0080\u009d The game maker came prepared for a fight, debuting a video that spoofs Appleâ\u0080\u0099s classic 1984 advertisement, which urged customers to oppose conformity and prevent International Business Machines Inc. IBM, -2.81% Â from dominating the computer market. Back then, Apple warned that without a change, the year 1984 could mirror George Orwellâ\u0080\u0099s dystopian â\u0080\u009c1984â\u0080\u009d novel; Epic Games cautions in its ad that 2020 could come to embody â\u0080\u009c1984â\u0080\u009d as well. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Apple is worth nearly $2 trillion thanks to the money it collects from the iPhone and the apps and services that are delivered through it. Fortnite had racked up $1 billion in player spending on Apple iOS devices alone through mid-May, according to mobile-app research company Sensor Tower, which would suggest Apple received hundreds of millions of dollars from the hit videogame. For more: Apple and Facebook could be most vulnerable among the antitrust suspects Evercore ISI analyst Amit Daryanani said in a note to clients late Thursday that Apple collects an estimated $30 million monthly from Fortnite. The company generated $13.2 billion last quarter in revenue for its services segment, which includes the App Store. He expects the legal battle to be â\u0080\u009ca multi-year process that is appealed at every level of the U.S. court system.â\u0080\u009d Epic has long tried to avoid paying such fees, previously selling an Android app through its own game store to avoid Androidâ\u0080\u0099s Play Store. Epic eventually did put â\u0080\u009cFortniteâ\u0080\u009d on the Play Store, but Google booted it late Thursday for the same reason as Apple, and Epic filed a similar lawsuit later in the evening. â\u0080\u009cGoogle has eliminated competition in the distribution of Android apps using myriad contractual and technical barriers,â\u0080\u009d Epic said in making a similar legal argument that it did about Appleâ\u0080\u0099s control of the iOS ecosystem. Those with Android devices will still be able to play the game by downloading it through Epicâ\u0080\u0099s own app store, but they wonâ\u0080\u0099t be able to play through the official store offered by Google â\u0080\u009cbecause it violates our policies,â\u0080\u009d according to an emailed statement from Google. See also: â\u0080\u0098Fortniteâ\u0080\u0099 spurned Android, then Google found a major security flaw in its app Epic says on its website that players whoâ\u0080\u0099ve already downloaded â\u0080\u009cFortniteâ\u0080\u009d to their Apple mobile devices â\u0080\u009cshould have no issues continuing to play Chapter 2 - Season 3â\u0080\u0099s 13.40 update.â\u0080\u009d Once the new season begins, Epic expects that players will be able to play the older content but not access new material. An Apple spokesperson said in a statement that Epic Games introduced the feature without the companyâ\u0080\u0099s approval and did so â\u0080\u009cwith the express intent of violating the App Store guidelines regarding in-app payments.â\u0080\u009d The statement also said that Apple will â\u0080\u009cmake every effort to work with Epic to resolve these violations so they can return â\u0080\u0098Fortniteâ\u0080\u0099 to the App Store.â\u0080\u009d An Epic spokeswoman confirmed the suit in an email to MarketWatch. As part of its blitz against Apple, the company has launched a page on its website with the tagline â\u0080\u009c#FreeFortniteâ\u0080\u009d that tells customers to use that hashtag in support of Epic by engaging with the App Storeâ\u0080\u0099s official Twitter account. The hashtag was trending on Twitter within an hour of the siteâ\u0080\u0099s launch. Appleâ\u0080\u0099s fee policies around the App Store have come under increased scrutiny from both developers and regulators recently. Big developers including Spotify Technology SA SPOT, +0.08% Â have looked for ways to avoid paying Apple a cut of subscription fees, and the developers of Hey, a new email app, publicly battled with Apple in June after the email service rolled out its app without an option to buy subscriptions from within the app. Apple and Heyâ\u0080\u0099s developers eventually reached a compromise. Regulators and lawmakers in the U.S. and Europe have also questioned the companyâ\u0080\u0099s App Store policies and whether they stifle competition. Epic argues in its complaint that Apple â\u0080\u009charms app developersâ\u0080\u0099 relationship with their customersâ\u0080\u009d through its mandatory involvement in all transactions since customers â\u0080\u009coften blame Epicâ\u0080\u009d for problems related to payments. â\u0080\u009cIn addition, Apple is able to obtain information concerning Epicâ\u0080\u0099s transactions with its own customers, even when Epic and its own customers would prefer not to share their information with Apple,â\u0080\u009d the complaint said. Apple shares rose 1.8% Thursday and have gained more than 50% in the past three months as the Dow Jones Industrial Average DJIA, +0.56% Â , which counts Apple as a component, has added 20%. Shares declined 0.1% in after-hours trading. Alphabetâ\u0080\u0099s Class A shares rose 0.7% in after-hours trading, and are up 12% over the past three months."}]}