{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-slide-before-presidential-debate-11601383159", "published": 1601369240.0, "headline": "10-year Treasury yield edges down to 3½-week low before Trump-Biden debate", "body": "U.S. Treasury yields edged lower Tuesday as investors eyed the coming presidential debate late Tuesday, which could offer further clues on the outlook for the Nov. 3 elections.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 1.7 basis points to 0.644%, the lowest since Sept. 3, while the 2-year note rate TMUBMUSD02Y, 0.156% edged 0.4 basis point down to 0.127%, the lowest since Aug. 8. The 30-year bond yield TMUBMUSD30Y, 1.576% slipped 1.9 basis points to 1.404%. Bond prices move inversely to yields. What's driving Treasurys? The presidential debate on Tuesday night may provide markets with clues about how President Donald Trump and Democratic candidate Joe Biden will fare in the weeks leading up to Election Day. Investors are worried that a contested election, one that isn't determined immediately, could create volatility in markets. See: Trump-Biden debate could be an 'important catalyst' for investors, Goldman says, as its strategists remain 'pro-risk' Yet so far, Treasurys have showed muted reaction even as political jitters have driven sharp swings in stock-market trading in the past few weeks. As for the Federal Reserve, Dallas Fed President Rob Kaplan  said the U.S. economy won't be back on track until late 2022 or sometime in 2023. Meanwhile, New York Fed President John Williams said that he doesn't see any sign of high inflation. In U.S. economic data, the Conference Board said consumer confidence rose to a post-pandemic high of 101.8 in September from 86.3 in August. The U.S. trade deficit in goods rose 3.5% in August to a record $82.9 billion.What did market participants say? \"This is some of the tightest ranges in 10-year Treasury notes in quite some time, maybe because we're approaching the election and people are taking profits and putting the money to work, but they haven't seen the catalyst for that to happen. I think investors are looking for the market to break out one way or the other,\" said Tom di Galoma, managing director of Treasurys trading at Seaport Global Securities, in an interview."}]}