{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-case-tally-tops-255-million-and-us-climbs-to-603-million-as-midwest-states-suffer-rise-in-infections-2020-09-01", "published": 1598972240.0, "headline": "Coronavirus update: Global case tally tops 25.5 million, and U.S. climbs to 6.03 million as Midwest states suffer rise in infections", "body": "The number of confirmed cases in the U.S. of the coronavirus that causes COVID-19 rose to 6.03 million on Tuesday, with new cases increasing in much of the Midwest and falling from their July peaks in the South and West. The U.S. added more than 36,000 new cases on Monday, according to data aggregated by Johns Hopkins University, while more than 480 deaths were counted. Iowa, Kansas, Minnesota, North Dakota and South Dakota counted more cases in a recent seven-day stretch than any other seen since the start of the outbreak, the New York Times reported. The U.S. accounts for about a quarter of the 25.5 million confirmed cases globally and almost a fifth of the 851,781 deaths counted by Johns Hopkins, or 183,733. On a per capita basis, the U.S. is fourth in the world with 55.95 deaths per 100,000 people, the data shows, after Peru, Chile and Brazil. Twitter removed a post that was retweeted by President Donald Trump at the weekend, claiming the U.S. death toll is greatly exaggerated. The post was sent by “Mel Q,” an adherent of the QAnon conspiracy theory. It claimed that the Centers for Disease Control and Prevention had updated its COVID-19 numbers and found only 9,000 of reported deaths were from the virus, while the rest were people with two or three other serious illnesses. Twitter said the post violated its coronavirus misinformation policy. The social-media site did not remove another post retweeted by Trump from a conservative website that criticized key members of Trump’s own White House task force, including Dr. Anthony Fauci, head of the National Institute for Allergies and Infectious Diseases, and Dr. Deborah Birx, coordinator of the task force. Fauci told ABC in an interview Tuesday that the CDC numbers did not mean that people died of causes other than COVID-19. “That does not mean that someone who has hypertension or diabetes who dies of Covid didn’t die of Covid-19. They did,” Fauci said on “Good Morning America.” “So the numbers you’ve been hearing -- there are 180,000-plus deaths -- are real deaths from Covid-19. Let (there) not be any confusion about that.” The head of the World Health Organization said the idea that high death rates from the virus are not a concern if it’s mainly older people who are dying is “moral bankruptcy.” “Accepting someone to die because of age is moral bankruptcy at its highest, and we shouldn’t allow our society to behave this way,” WHO director general Tedros Adhanom Ghebreyesus said at the agency’s latest press briefing. In other news: • Russia has more than 1 million confirmed cases of COVID-19, the English-language Moscow Times reported, the fourth highest in the world, after the U.S., Brazil and India. Russia will start its first mass deliveries of its COVID-19 vaccine this month, Health Minister Mikhail Murashko said on Monday. The governor of a remote Siberian region, the republic of Tyva on the border with Mongolia, is reported to have contracted the virus for a second time in Russia’s first such case, the paper reported. Hong Kong researchers last week confirmed a case of a patient who had been reinfected with COVID-19. That same week, two European patients were reported to have suffered that fate, the Guardian reported, citing regional public broadcasters in the Netherlands and Belgium. • Poland has banned direct flights from 44 countries, including Spain and the U.S., to contain the spread of the virus, the Guardian reported, citing government officials. India, Brazil, Argentina, Malta, Montenegro, Mexico, Israel and Romania are also on the list, the paper reported, but China and Russia have been removed, local media reported. The ban will become effective on Wednesday. Poland has 67,922 confirmed cases of the virus, according to the Johns Hopkins data, and 2,058 people have died. • Tourism traffic to Spain fell 75% in July from the year-earlier period, according to Spain’s National Statistics Institute, costing the country billions of euros in lost revenue. Spain is currently grappling with a fresh spike in cases, after recording almost 24,000 new infections over the weekend. In the past two weeks, Spain has seen more than 96,000 new infections, according to its health ministry, making it a hot spot for the outbreak for the second time. Madrid is the epicenter, with about 16% of area hospital beds currently occupied by COVID-19 patients. • Hong Kong launched a mass testing program on Tuesday, amid heightened tensions with mainland China following its efforts to crack down on the city’s democracy movement. The free scheme has had a shaky start, amid concerns that the involvement of doctors and testing companies from the mainland will lead to harvesting of DNA and other data, the Washington Post reported. “I’m postulating that in the most optimistic case, perhaps a million people will turn up, but if I say that, I will be announced as unpatriotic,” said Gabriel Choi Kin, head of the Hong Kong Medical Association, the paper reported. “Ultimately, this will be a display of whether citizens trust the government.” • More than a million students returned to schools in the Chinese city of Wuhan on Tuesday, the original source of the COVID-19 pandemic, according to media reports. Wuhan was locked down for more than two months starting in late January and has reopened gradually since April. About 3,869 inhabitants of the city died from the virus, according to official Chinese data, accounting for more than 80% of China’s total official death toll of 4,724. Students had their temperatures taken at the school gates and were given lessons on hand washing, according to the New York Times.Latest tallies At least 16.9 million people have tested positive and then recovered from COVID-19, the Johns Hopkins data show. Brazil is second to the U.S. with 3.9 million cases and 121,381 deaths. India is next with 3.7 million cases and 65,228 deaths. Mexico has 599,560 cases but 64,414 deaths, the fourth highest in the world. The U.K. has 338,085 cases and 41,589 deaths, the highest in Europe and fifth highest in the world. What’s the latest medical news? Sanofi SNY, +0.89% SAN, +1.20% said that the rheumatoid-arthritis drug Kevzara failed a Phase 3 clinical trial testing the therapy as a treatment for severely ill COVID-19 patients, MarketWatch’s Jaimy Lee reported. Sanofi and Regeneron Pharmaceuticals Inc. REGN, +0.36%, its commercial partner for Kevzara, said they do not plan to conduct additional studies testing the drug as a COVID-19 treatment. In the early days of the pandemic, there was interest in testing rheumatoid arthritis drugs like Kevzara and Roche Holding AG’s ROG, +1.80% Actemra in coronavirus patients; however, studies so far have failed to demonstrate that these drugs can lessen the severity of disease, shorten hospital stays, or reduce death. Roche said in July that Actemra had failed in a late-stage clinical trial testing the drug in hospitalized COVID-19 patients. Separately, AstraZeneca PLC AZN, +1.16% AZN, +0.63% said its COVID-19 vaccine candidate advanced into late-stage U.S. clinical trials to gauge its effectiveness. AstraZeneca said the Phase III trial is seeking up to 30,000 participants to test the vaccine, designated as AZD1222. Participants will either receive two doses of AZD1222 or a saline placebo four weeks apart. In July, AstraZeneca said an early-to-mid-stage study showed the vaccine was “well tolerated and generated robust immune responses” against SARS-CoV-2, the virus that causes COVID-19.What’s the economy saying? American manufacturers grew again in August for the fourth straight month, but companies still aren’t bringing back lots of workers or seeking to increase investment with the coronavirus pandemic still infecting the economy, MarketWatch’s Jeffry Bartash reported. The Institute for Supply Management said its manufacturing index rose to 56% in August from 54.2% in July. Readings over 50% indicate growth. Economists surveyed by MarketWatch had forecast the index to total 54.9%. Althought the index hit a 21-month high, manufacturers aren’t doing as well now as they were two years ago. Businesses executives are asked if their companies are doing better or worse compared with the prior month, but the survey doesn’t reveal how much better. Most manufacturers are producing fewer goods with fewer workers than they were before the coronavirus pandemic. The index had fallen to an 11-year low of 41.5% in April during the height of the crisis. The index for new orders jumped to 67.6% from 61.5%, marking the highest level since 2004. Yet other measures of actual production show new orders are actually still about 5% below precrisis levels. The production gauge rose to 63.3% from 62.1%. Timothy Fiore, chairman of the survey, said executives were “generally optimistic” but “to a lesser degree compared with July.” Coronavirus cases spiked during the summer and sapped the economy of some of the momentum built up in May and June. “Not all firms have the capacity to bring all of their staff back from furlough and those that do face difficult challenges in figuring out how and when to safely bring their workers back to work,” economists Thomas Simons and Aneta Markowska of Jefferies LLC wrote to clients. See now:MarketWatch Coronavirus Recovery TrackerWhat are companies saying? • Alaska Air Group Inc. ALK, +0.15% is permanently eliminating change fees on domestic and international flights, effective immediately, as the air carrier joins a number of rivals in doing so, starting with United Airlines Holdings Inc. UAL, +0.32%. The new policy applies to all tickets, except for “Saver” fares. The previous $125 change fee applied to all non-“Saver” flights, except for those traveling on refundable tickets and top elite status members of its loyalty program. “COVID has taught us that flexibility in travel is key,” said Chief Commercial Officer Andrew Harrison. • Delta Air DAL, +0.39% and American Airlines AAL, +0.34% are also dropping the ticket-change fee on most tickets for domestic flights. As Southwest Airlines LUV, +1.89% did not charge a fee, all four of the biggest U.S. carriers are now not assessing this unpopular fee. The move comes as the airline industry is hammered by the pandemic, which has grounded many flights and discouraged travelers from flying for all but urgent reasons. Normally in summer, 2 million or more people pass through security checkpoints at U.S. airports each day, but that number hasn’t been above 900,000 since mid-March, the early days of the pandemic, the Associated Press reported. • Eastman Kodak Co shares KODK, +12.98% rallied after the company disclosed that D.E. Shaw & Co. has taken a 5.2% stake. In a filing with the Securities and Exchange Commission, Kodak said D.E. Shaw has amassed 3.94 million shares of its stock. Kodak shares rallied in late July after the company won a government loan to help with pharmaceuticals ingredients during the pandemic, but that loan is on old amid government scrutiny of its award and of movement in the stock before and after it was announced. See also:Advice for Salesforce staff who reported having a mental-health issue — and all workers during the COVID-19 pandemic • Gogo Inc. GOGO, +8.36%, the in-flight wireless internet provider, is selling its commercial aviation business to Intelsat SA INTEQ, -1.16% for $400 million in cash. The Gogo board has approved the deal, which is expected to close before the end of the first quarter of 2021. Intelsat will fund the deal with cash on hand and borrowings under a $1 billion debtor-in-possession credit facility, with approval from the U.S. Bankruptcy Court for the Eastern District of Virginia, Richmond Division. “Combining CA, the leading in-flight connectivity provider, with Intelsat, the world’s largest global satellite operator, will create the leading vertically-integrated IFC business in the world, with the additional resources and scale to support continued growth and innovation as demand for commercial air travel recovers,” Gogo Chief Executive Oakleigh Thorne said in a statement. Gogo will use the proceeds of the deal to pay down debt and invest in growth opportunities, including its Gogo 5G products. The airline industry has been crushed by the pandemic, which has grounded flights and kept consumers from flying. • Hawaiian Holdings Inc. HA, +0.36% subsidiary Hawaiian Airlines Inc. has notified 414 employees who are in its Air Line Pilots Association (ALPA) and Association of Flight Attendants (AFA) that they will be affected by the air carrier’s workforce reduction plan. An additional 28 employees in the ALPA will be notified of job cuts at a later date. The company expects to issue notices of job cuts to employees in its International Association of Machinists and Aerospace Workers and Transport Workers Union groups. The layoffs are related to notices sent in July that 2,135 employees could be laid off, including 956 employees in the ALPA and AFA groups. • Kimco Realty Corp.’s KIM, -3.32% board has approved a quarterly cash dividend of 10 cents a share, reinstating the payment after suspending it at the peak of the pandemic. The dividend will be payable Sept. 24 to shareholders of record as of Sept. 10. The shopping mall real-estate investment trust continues to see improvement in foot traffic at malls as tenants reopen, boosting rent collections to 85% in August from 82% in July and 76% in June. The company has granted rent deferrals of about 2% of base rent for the month of August, it said in a statement. “We expect to establish a more normalized and well-covered dividend level based on our adjusted funds from operations and REIT taxable income in 2021,” Chief Executive Conor Flynn said in a statement. • Steelcase Inc. SCS, +0.35%, a maker of office furniture and interior architectural products, is cutting jobs permanently, while restoring pay to its salaried workers, executives and board members. The Grand Rapids, Mich., company will cut 300 jobs, or about 8% of its salaried workforce in the Americas, and cut about 160 hourly employees with early retirements. Another 65 salaried employees have volunteered for part-time roles or temporary layoffs for up to six months. Most salaried workers will have full base pay restored, the company said. “Making these types of permanent reductions to our cost structure is something we hoped to avoid, but they became necessary as demand levels in the Americas have continued to reflect the impact of the COVID-19 pandemic,” Chief Executive Jim Keane said in a statement. The company is expecting restored pay to cost about $20 million a quarter, partially offset by cost savings of about $10 million. The company expects to book restructuring charges of about $30 million in the second and third quarters. • Tenet Healthcare Corp. THC, +0.74% is planning to offer $2.5 billion of 8-year bonds, joining the many companies issuing debt during the pandemic at record levels. Proceeds of the deal will be used to redeem all outstanding 8.125% senior notes due 2022."}]}