{"article": [{"url": "https://www.marketwatch.com/story/3-house-committee-leaders-call-for-release-of-ppp-details-by-friday-2020-06-15", "published": 1592394020.0, "headline": "Key Republican senator promises release of some PPP details", "body": "Republican Sen. Marco Rubio of Florida, who chairs the Senate Committee on Small Business and Entrepreneurship, has promised that there will be more disclosure around companies that received Paycheck Protection Program loans, following widespread calls for more information on borrowers. Rubio tweeted on Wednesday that he supports full disclosure of information about the aid program’s borrowers, but small businesses have concerns so he and other government officials are working to find a way to release the data that addresses those worries. He tweeted on Tuesday that there was “no dispute over larger loan recipients being disclosed,” and the “only issue still being discussed” with the Trump administration was how to treat smaller loans. Many lawmakers, both Democrats and Republicans, have called for disclosing the names of all PPP loan recipients and their loan amounts. Treasury Secretary Steven Mnuchin has been declining to reveal such information, saying at a Senate hearing last week that it's “proprietary information and in many cases, for sole proprietors and small businesses, is confidential information.” See:House not taking Mnuchin’s no for an answer as it seeks details on recipients of federal coronavirus relief funds The heads of the Democratic-run House’s Financial Services Committee, Ways and Means Committee and Small Businesses Committee called for the Trump administration to provide disclosure in a letter Monday. “Given our shared responsibility to safeguard taxpayer dollars, we disagree with the decision to not release the names of businesses that received PPP loans. At a minimum, we owe the American people that information,” said Rep. Maxine Waters of California, Rep. Richard Neal of Massachusetts and Rep. Nydia Velázquez of New York. Mnuchin said on Twitter on Monday that he would be having discussions with lawmakers to “strike the appropriate balance for proper oversight of #ppploans and appropriate protection of small business information.” The Treasury secretary said on May 21 “that there is proprietary information because it’s tied off of payroll,” referring to how loan amounts have been determined. The PPP was established in late March to help small businesses and nonprofits hurt by the coronavirus crisis. It has received $670 billion in funding through March’s $2.2 trillion CARES Act and April’s $484 billion relief package. The program has drawn criticism over how publicly traded companies scored loans, as well as over sending money to less hard-hit areas and allegedly discriminating against businesses owned by women and minorities. On Tuesday, a Politico report said four House lawmakers — two Republicans and two Democrats — have close ties to companies that received PPP loans, and there could be other members of Congress who have benefited from the aid program. U.S. stocks SPX, +0.87% DJIA, +0.56% have rallied from their March lows thanks in part to optimism around Washington’s aid efforts. This is an updated version of a report first published on June 15, 2020."}]}