{"article": [{"url": "https://www.marketwatch.com/story/watchdog-says-washingtons-growing-swampier-even-as-coronavirus-lockdowns-let-congress-climb-off-hamster-wheel-of-fundraising-2020-06-24", "published": 1593102980.0, "headline": "Watchdog says Washington's growing swampier, even as coronavirus lockdowns let Congress climb off 'hamster wheel of fundraising'", "body": "Has President Donald Trump's administration drained the swamp? Washington has in fact become swampier in the past three and half years, according to a \"Spotlight on the Swamp\" report out this month from Issue One, a nonpartisan watchdog that aims to reduce the influence of big money in politics. The report points to a rise in lobbying spending, a high number of ex-lobbyists in cabinet-level positions, donors getting ambassadorships and other trends. But the organization's executive director, Meredith McGehee, also takes a long view and says the Obama administration didn't do much in areas such as campaign finance reform. As the coronavirus crisis and nationwide protests shake up Washington, McGehee spoke with MarketWatch this week about the new report, as well as the November elections, the federal government's aid spending, racial inequalities and more. The Q&A below has been edited for clarity and length. MarketWatch: How swampy was Washington before the Trump presidency and how swampy is it now? McGehee: Well, it's been swampy for a while. There are times when the swamp gets a little better in certain areas, and times when the swamp seems to get even swampier. We've seen that go back and forth over decades. Let's be clear - politics is about power. It's about people being able to use their money and influence to influence power. So that is not going to change, and the intent in \"Spotlight on the Swamp\" is not in any way, shape or form to say we want to take the politics out of the politics, or that you can somehow change that human behavior. What you can change are both the rules for how you govern, and the people's expectations of how you govern, because not everything in a democracy is about the laws on the books. It's also about a common expectation of behavior. So the swamp, I think by any fair assessment, has gotten swampier in the last several years. It's not a very pretty picture in terms of making sure that the conflicts of interest are dealt with. The questions that are asked in \"Spotlight on the Swamp\" - is lobbyist influence reduced and the revolving door slowed? No. Has the pay-to-play system been reduced? No. And do people feel that D.C.'s more ethical and accountable? The answer to these three questions is not only indicated on our webpage, but also related to the fact that people are taking to the streets because they feel like the political system is not being responsive to their concerns. MarketWatch: There have been widespread protests in recent weeks over police killing black Americans, as well as many tough conversations within organizations. What have been the conversations at Issue One, and are there ways your organization wants to make a difference? McGehee: There's no doubt that the current way campaigns are financed and the donor access not only affect 99% of Americans, but are particularly egregious when it comes to the black community and to other people of color. If you look at who donors are, and who are the people that get that access and influence, they are predominantly white, they're predominantly male. It is a system that does not really provide an effective means for a lot of these concerns to be heard. We're really trying to think hard about how we address that, and how Issue One itself can be a voice that reflects how these systemic problems in our money-in-politics system and in the way people make decisions - particularly in a congressman's office, political offices all around the country - play a role in maintaining a status quo that is unacceptable. MarketWatch: What has stood out for you or concerned you in the passage of the CARES Act and other coronavirus relief measures? McGehee: We've been working with other groups to ensure there's greater transparency on where these billions of dollars are going, who's getting it. We've had a minor or a good victory, not a complete victory, recently while working with POGO, the Project on Government Oversight, on trying to get better transparency about where the money is going, so that people can see if there are conflicts of interest. Related:How Congress is spending trillions in response to the coronavirus crisis - in one chart MarketWatch: Is that victory related to the increased disclosure of borrowers in the federal government's Paycheck Protection Program? McGehee: We've been working with POGO on the PPP disclosures. My understanding is that while there were some improved disclosures, it was not the full range that we wanted. Why this is supposedly \"proprietary information\" really floors me. It just makes no sense whatsoever. I don't see what the problem is with being able to have a public accounting of where that money went, company by company. Related:Treasury still too secretive on small business loans, watchdogs say And see:Key Republican senator promises release of some PPP details MarketWatch: With the PPP information, one reason given for why it's proprietary is it can show how many employees you have or how much you're spending on payroll. Do you think that holds any water? McGehee: Not when it comes to taxpayer money, and a bailout like this. It's not saying that everything a company does is public. This is a different question. This is hard-earned taxpayer money going to private entities. When you weigh the pros and cons, the balancing of public accountability for taxpayer money to me by far comes out on top. Read more:These public companies are returning emergency loans meant for small businesses MarketWatch: What is standing out for you or concerning you in the presidential election? McGehee: We have been already talking with the Federal Election Commission about the so-called Bloomberg loophole, where in this case, a billionaire was able to use current law to funnel huge amounts of money that would otherwise not be permitted into the system. We have a system right now, even in the presidential race, where most of this money that buys access and influence is coming from a small number of people. Now the good news is we have seen large numbers of individual donations. That's a good thing. That's participation. But the people that are going to get the access and influence are either the bundlers - and we've been tracking the bundlers, you can go on our website and see that - and these people that are able to bring large amounts to bear. And while the presidential race is going on and that gets a lot of attention, there are also really critical Senate races going on, and we've heard even from some Republicans that they're very concerned about the amount of out-of-state dark money that is flowing into these races, where you don't know the true identity of the source of the funds. Read more:Secret political spending, known as 'dark money,' reaches $1 billion milestone MarketWatch: Do you think there's a chance that in the future a super wealthy candidate like Mike Bloomberg won't be able to spend $1 billion of his own money on running for president? McGehee: No, certainly not in the near future with this Supreme Court. The loophole that he's now taking advantage of is he ran and had all this money in his account, and then he transferred all that money, which would otherwise not be permitted. He transferred it over to a party committee, and that's going to help Joe Biden, etc. So basically because he had the money in this particular account, he was able to evade the contribution limits. [Bloomberg has been criticized for a March transfer of $18 million from his defunct presidential campaign to the Democratic National Committee.] MarketWatch: What are some Senate races where dark money is coming into play? McGehee: There's lots of out-of-state money flowing into Kentucky and Colorado, Maine, Arizona - these competitive states. The point here is not necessarily saying that can't happen. The court has made the law about corruption and the appearance of corruption. But I think there should still be a robust discussion about what the role of money outside of the state should be. Don't miss:Democrats' chances of Senate takeover rise, and that could affect health care, energy and financial services MarketWatch: How much do you think social-distancing measures have shaken up campaign fundraising? McGehee: I would say for a few months, like March, April, a little into May, it almost drew fundraising to a halt. Then as everyone got comfortable with Zooming, they started to figure out that, \"OK, we'll do this a different way.\" My understanding is that now everybody's pretty accustomed to using Zoom ZM, +2.89%, and that the fundraisers have kicked in. But fundraising has kicked back into not a high gear, not anywhere near what it used to be. The interesting part - that I've heard from several members of Congress now in different conversations - is that they are discovering now that they don't have to go to all the fundraisers. Usually there's breakfast fundraisers, there's lunchtime fundraisers, there's 4 o'clock call time, and then you hit a number of fundraisers at the end your day, right? That's kind of the typical member's schedule. They're finding that they still have to make calls - that doesn't change - but without having to hit all the fundraisers, they're beginning to find their job satisfaction is increasing. They're actually having time to look at issues. They're talking to each other more, because they're kind of forced into doing that. They do miss the in-person stuff like seeing people on the floor, etc. But kind of the rat race, that hamster wheel of fundraising for them, has changed significantly. I'm not saying it's everybody, but they love it - the fact that they don't have this built-in structure in their everyday life. That really did dominate a lot of their schedule in Washington. Related:Meet the committee on Capitol Hill that's trying to make Congress great again MarketWatch: How much do you think lockdowns and working from home have shaken up other Washington work such as lobbying? McGehee: I'll let you in on a dirty secret, which is that at least for those of us in the public-interest community, this has in some ways been helpful. In many cases to get in to see a senator or chief of staff or someone like that, it can be very difficult if you're not a donor. But because everyone now is sitting there at home in front of their computers, looking at email, not running around, I'm getting a much higher response rate. A lot of lobbyists - K Street lobbyists in particular - rely on events. They go to the events and get to grab somebody and collar them and raise their issue at that event. Well, those events, it's a little more awkward, particularly if there's not a one-on-one time like that in these Zoom calls. But for me, it's great. MarketWatch: Let's go back to your \"Spotlight on the Swamp\" report. It says Washington is getting swampier. How discouraging is that for Issue One as a group that wants reform? McGehee: Being a democratic republic is really, really difficult. If it were easy, you would have many more of them around the world, and the reality is you have very few functional democracies or democratic republics. I think my parents' generation had a greater sense of the vulnerability, because my dad was a young person who fought in World War II. The threat of Germany and fascism and Japan was very real for them. This notion that it's not a given, it's kind of built into their DNA. My generation and I think the ones after me don't have that. They think, \"Oh, yeah, democracy. We're Americans. We'll always have it.\" So it's not depressing to me because I think democracy is damn hard work. Being a citizen is damn hard work. Democracy is not an end. You never just say, \"Oh, now we're fine.\" Right? That's not the nature of it. There's another part of this. I have so many friends who say, \"Oh politics, you work in politics. I hate politics.\" I keep reminding people that politics is the way that a civilized people try to resolve differences peacefully. Freedom from politics is just not a possibility unless you want an authoritarian regime. So you should be happy that we have politics, because the alternative to politics is in fact violence, which is what we see all over the world. I just think people forget that part. MarketWatch photo illustration/iStockphoto, Everett Collection MarketWatch: Issue One is a cross-partisan reform group, but what would you say to people who might say your \"Spotlight on the Swamp report\" is an attack on the Trump administration? McGehee: Well, I guess my first response would be to advise people to Google GOOG, +1.97%  some of my remarks about the Clinton Foundation or about President Obama and his inaction on taking on campaign finance reform. In approaching this issue, we praise Republicans, we praise Democrats - when it's merited. And we criticize both sides when merited. There's been a long record in my career of doing that, whether it's been ethics issues or other activities. Issue One has really tried to hew closely to that, and to call 'em as we see 'em. Whether it's ethics complaints against Democrats, whether it's criticisms of past candidates for president or otherwise, I think the record speaks for itself. Read more:Drain the swamp? Spending on Washington lobbying rises to 9-year high MarketWatch: What else do you think people ought to know right now about money in politics? McGehee: What I think they should know is that when you have systemic problems, the answer as a democratic republic is to change public policy, to change those systems. We've had all these questions about systemic racism, and how do you change that? Some of it's individual behavior, but many times the answer is actually changing public policy. If you want a more representative government, you've got to change policies so that the system allows you to have that. Right now this system is so out of whack, so out of balance. We're getting the representation that the far less than 1% are paying for. Related:It's getting harder and harder to crack into the 1%, according to IRS data This report was first published on June 24, 2020."}]}