{"article": [{"url": "https://www.marketwatch.com/story/mackenzie-scott-has-donated-17-billion-since-divorcing-jeff-bezos-last-year-2020-07-28", "published": 1595963420.0, "headline": "MacKenzie Scott has donated $1.7 billion since divorcing Jeff Bezos last year", "body": "MacKenzie Scott said Tuesday she has donated about $1.7 billion of her fortune over the past year since her divorce from Jeff Bezos. The donations largely went to social-justice, public-health and climate-change organizations, Scott, a novelist and philanthropist, wrote in a Medium blog post. Scott — who recently changed her last name back to the name she grew up with — ranks 13th on the Bloomberg Billionaires Index, with an estimated fortune of $59.3 billion. The bulk of that came from a 4% stake in Amazon.com Inc. AMZN, +3.01% that she received in her divorce from Bezos. “Last year I pledged to give the majority of my wealth back to the society that helped generate it,” Scott wrote, referring to her 2019 signing of the Giving Pledge, the campaign organized by Bill Gates and Warren Buffet in 2010, in which the world’s wealthiest people vow to donate more than half their fortune to charities or philanthropic causes over their lifetime. Read: How the 1% donate to charities differently to everyone else “Like many, I watched the first half of 2020 with a mixture of heartbreak and horror,” she said. “Life will never stop finding fresh ways to expose inequities in our systems; or waking us up to the fact that a civilization this imbalanced is not only unjust, but also unstable. What fills me with hope is the thought of what will come if each of us reflects on what we can offer.” Here’s how Scott broke down her giving: Racial equity: $586,700,000 LGBTQ+ equity: $46,000,000 Gender equity: $133,000,000 Economic mobility: $399,500,000 Empathy & bridging divides: $55,000,000 Functional democracy: $72,000,000 Public health: $128,300,000 Global development: $130,000,000 Climate change: $125,000,000 “On this list, 91% of the racial equity organizations are run by leaders of color, 100% of the LGBTQ+ equity organizations are run by LGBTQ+ leaders, and 83% of the gender equity organizations are run by women, bringing lived experience to solutions for imbalanced social systems,” Scott said. “The organizations ... offer a daily reminder that we can each carry more than we imagine. And they offer an opportunity to invest our good fortune in change, no matter what form our good fortune has taken.” Her ex-husband Bezos — the world’s wealthiest individual, worth about $178 billion — has not signed the Giving Pledge, and has been criticized by some for not donating more to charities."}]}