{"article": [{"url": "https://www.marketwatch.com/story/buttigieg-turns-table-as-fox-hosts-chide-harris-for-shifting-positions-after-joining-biden-ticket-11602169763", "published": 1602169460.0, "headline": "Pete Buttigieg turns tables on Pence as Fox News hosts chide Harris for shifting positions after joining Biden ticket", "body": "Pete Buttigieg addresses the Democratic National Convention this summer. Getty Images “ ‘There’s a classic parlor game of trying to find a little bit of daylight between running mates. And if people want to play that game, we could look into why an evangelical Christian like Mike Pence wants to be on a ticket with a president caught with a porn star. Or how he feels about the immigration policy that he called unconstitutional before he decided to team up with Donald Trump. If folks want to play that game, we could do it all night.’ ” That’s Pete Buttigieg’s fiery response to a twice-posed question late Wednesday on Fox News about how Kamala Harris could possibly “justify” her shifted positions on certain issues, such as Medicare for All, after being tapped as Joe Biden’s running mate. The Margin: Why Sen. Kamala Harris’s telling Vice President Mike Pence, ‘I am speaking,’ is resonating with so many women online Plus: Trump says he won’t debate Biden next week in virtual format The former South Bend, Ind., mayor and Democratic presidential candidate — who reportedly played the role of fellow Indianan Pence in Harris’s debate preparation — went on to say that voters have bigger issues on their minds, such as how their lives will be impacted by the election. “I think what most Americans want to hear about is, are our families going to be better protected than they have been by this president who’s failed to secure America in the face of one of the most dangerous things ever to happen to our country?” Buttigieg said. Watch the full interview, with Buttigieg’s comments about Harris, Trump, Pence and Stormy Daniels starting around the 3:28 mark: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } “Pete” immediately surged on the Twitter TWTR trending list: iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Buttigieg has entered the Fox News arena before, even as some prominent Democrats argued it should be avoided, and as one fan points out, he’s fared pretty well in those appearances: iframe.twitter-tweet { width: 100% !important; } |"}]}