{"article": [{"url": "https://www.marketwatch.com/story/euro-bulls-ready-to-test-ecbs-pain-threshold-after-lagarde-fails-to-stem-rally-11599753262", "published": 1599739340.0, "headline": "Euro bulls ready to test ECBâ\u0080\u0099s pain threshold after Lagarde fails to stem rally", "body": "Christine Lagarde Daniel Roland/Agence France-Presse/Getty Images Euro bulls were rejuvenated Thursday, after the European Central Bank failed to offer any meaningful reason to brake the shared currencyâ\u0080\u0099s rise. The ECB Governing Council, as expected, left rates and its massive asset-buying programs unchanged, leaving President Christine Lagardeâ\u0080\u0099s news conference as the main event, but a relatively upbeat outlook on the economy and inflation left Lagarde with little in the way of meaningful weaponry to arrest the euroâ\u0080\u0099s clearly unwelcome appreciation. The euro EURUSD, +0.60% remained 0.6% higher at $1.1882 after trading as high as $1.1917. â\u0080\u009cThe ECB presented almost no serious hurdlesÂ to renewed euro strength asÂ economic forecasts were more upbeatÂ than expected while comments on the exchange rate were fairly soft ,â\u0080\u009d said Petr Krpata, chief EMEA FX and interest-rate strategist at ING. Related: Dutch central bank chief has more confidence in economic projections Lagarde said the rising euro was â\u0080\u009cextensivelyâ\u0080\u009d discussed during the meeting, but emphasized that the ECB doesnâ\u0080\u0099t â\u0080\u009ctargetâ\u0080\u009d the exchange rate. She emphasized, as ECB officials often do, that the exchange rate is important largely because of its influence on inflation. A stronger euro puts downward pressure on prices, an unwelcome development with inflation having long run well below the ECBâ\u0080\u0099s target of near but just below 2%. The euroâ\u0080\u0099s gains were boosted as the news conference got under way after Bloomberg reported that the Governing Council had agreed to not overreact to euro gains. Anticipation of a stronger pushback against the euroâ\u0080\u0099s rise had built after ECB chief economist Philip Lane last week said that the exchange rate â\u0080\u009cdoes matterâ\u0080\u009d to monetary policy, remarks that took the wind out of a rally that had seen the euro top $1.20 for the first time in more than two years. Updated staff projections, meanwhile, offered additional fuel for euro bulls, reflecting increases in the forecast for core consumer price inflation in 2021 and 2022, noted Claus Vistesen, chief eurozone economist at Pantheon Macroeconomics. Expectations for further monetary easing werenâ\u0080\u0099t enhanced either after Lagarde said there was no discussion of boosting the size of the 1.35 trillion euro ($1.6 trillion) pandemic emergency purchase program, or PEPP, at Thursdayâ\u0080\u0099s meeting. That just underscores the limited options available to the ECB when it comes to fighting an appreciating euro, particularly when expectations are building for a long-term downtrend by the U.S. dollar. â\u0080\u009cEven if the ECB deemed it necessary to credibly lean against the recent currency strength, apart from the possible verbal interventions (which eventually must be followed by real action for them to be credible), it is important to note that the current accommodative ECB policy stance is already rather stretched,â\u0080\u009d Krpata said. So now what? ECB officials may try to jawbone the currency in the near term, but the euro is likely to continue its rally, â\u0080\u009ctrying to test where the pain threshold really is,â\u0080\u009d Vistesen said. â\u0080\u009cAs far as the central bankâ\u0080\u0099s stimulus programs are concerned, we now have to assume that theyâ\u0080\u0099re on hold, at least unless the data shift dramatically, to the downside. â\u0080\u009d"}]}