{"article": [{"url": "https://www.marketwatch.com/story/the-perils-of-waiting-10-days-or-more-to-get-a-coronavirus-test-result-its-only-marginally-better-than-not-doing-the-testing-11594963182", "published": 1594989380.0, "headline": "The perils of waiting 10 days or more to get a coronavirus test result: â\u0080\u0098Itâ\u0080\u0099s only marginally better than not doing the testingâ\u0080\u0099", "body": "Staff at direct cars at a drive-through COVID-19 test site, July 15, 2020 at Dodgers Stadium in Los Angeles, California. Robyn Beck/Agence France-Presse/Getty Images When people first started showing signs of coronavirus in the U.S. in March, they were told they needed special permission to get tested.Â If they didnâ\u0080\u0099t fit into the high-priority bucket â\u0080\u0094Â which included health-care workers, people who were hospitalized, and people who had recently traveled to China or had been in contact with someone who had, they were often told to quarantine at home for 14 days.Â At that time, there was an extremely limited supply of testing kits, which backfired by helping accelerate the spread of coronavirus across the country because so many cases went undiagnosed, said Ashish Jha, the director of the Harvard Global Health Institute. Since then, â\u0080\u009ctesting capacity has clearly gotten better. At that time it was completely awful and now itâ\u0080\u0099s inadequate,â\u0080\u009d Jha said. So far, the U.S. has performed more than 45 million tests total, averaging approximately 700,000 a day â\u0080\u009cand thatâ\u0080\u0099s continuing to go up week to week,â\u0080\u009d Admiral Brett Giroir, a member of the White House coronavirus task force, who oversees testing, told reporters on Thursday. But turnaround times for commercial test results â\u0080\u009ccontinues to be an issue,â\u0080\u009d Giroir, the assistant secretary for health at the U.S. Department of Health and Human Services, said.Â Wait times of more than 10 days have become the norm for many Americans. There are, however, stories of people who have had to wait 26 days to get their results.Â â\u0080\u009cOnce you get the lag of seven to 10 days, itâ\u0080\u0099s only marginally better than not doing the testing,â\u0080\u009d Jha said.Â Approximately half of the tests being performed daily are conducted by commercial labs such as Quest Diagnostics and LabCorp, Giroir said. The rest are done â\u0080\u009cat point of care, which is a 15-minute turnaround, or in local hospitals, which is generally within 24 hours.â\u0080\u009d â\u0080\u009cOnly one state has an average turnaround time of greater than five days. Five states are between four and five days. 26 states are still three days or less, and the rest are between three and four days.â\u0080\u009d Turnaround times of 10 to 12 days represent outliers, he added. Still, CityMD Urgent Care locations in New York, for example, says patients must wait seven days minimum for their test result. “ â\u0080\u0098Once you get the lag of seven to ten days, itâ\u0080\u0099s only marginally better than not doing the testingâ\u0080\u0099 ” â\u0080\u0094 Ashish Jha, the director of the Harvard Global Health Institute To reduce some state turnaround times, Giroir said he wants to transition to â\u0080\u009ccare testing.â\u0080\u009d He also advocated for â\u0080\u009cpooling five samples into one.â\u0080\u009dÂ Doing so, health experts say, would help labs churn through negative test results. The downside is that it prompts an additional round of testing if coronavirus is detected in the pooled sample.Â â\u0080\u009cIt can decrease the turnaround time tremendously,â\u0080\u009d he said. However, Giroir said â\u0080\u009cthe science is still being validated [and] the regulatory is still being authorized.â\u0080\u009d The state of commercial testing in the U.S. Quest Diagnostics Inc. DGX, +0.33%, one of the largest labs in the U.S. performing coronavirus tests, said that the average turnaround time for non-priority patients is â\u0080\u009cseven or more daysâ\u0080\u009d and â\u0080\u009cslightly more than one dayâ\u0080\u009d for priority patients. “ â\u0080\u009cWe will not be in a position to reduce our turnaround times as long as cases of COVID-19 continue to increase dramatically across much of the United States.â\u0080\u0099 ” â\u0080\u0094 Quest Diagnostics Inc Thatâ\u0080\u0099s after the company doubled its testing capacity compared to eight weeks ago, Quest said in a statement on Monday. Testing capacity currently hovers at 125,000 tests a day, but by the end of the month, Quest said it expects to have the capacity to perform 150,000 tests a day. â\u0080\u009cWe will not be in a position to reduce our turnaround times as long as cases of COVID-19 continue to increase dramatically across much of the United States,â\u0080\u009d the company said. â\u0080\u009cThis is not just a Quest issue. The surge in COVID-19 cases affects the laboratory industry as a whole.â\u0080\u009d LabCorpâ\u0080\u0099s LH, +0.77% experience is nearly identical to that of Quest. Both companies say that recent demand for testing in light of the countryâ\u0080\u0099s record daily cases that continue to climb cannot be met under their existing constraints.Â LabCorp said it has performed 7 million total tests since its test became available in March. Now it has been â\u0080\u009cable to process approximately 140,000 tests per day with plans to increase that to 150,000 tests per day this month,â\u0080\u009d a LabCorp spokesman said in a statement to MarketWatch. Until recently, LabCorp said itâ\u0080\u0099s been able to deliver test results back to patients on average between 1 to 2 days. â\u0080\u009cBut with significant increases in testing demand and constraints in the availability of supplies and equipment, the average time to deliver results may now be 4 to 6 days,â\u0080\u009d he added. â\u0080\u009cFor hospitalized patients, the average time for results is faster,â\u0080\u009d LabCorp said. But beyond the increased demand for testing, Jha pointed out that the long turnaround times cannot simply be pinned to one factor and can vary significantly at labs across the country. For some, it boils down to not having enough reagents or swabs to perform the tests. For others, there could be a shortage of trained personnel to perform the tests thatâ\u0080\u0099s causing the delays.Â But it was â\u0080\u009ccompletely predictable,â\u0080\u009d he said. â\u0080\u009cThe system was not designed to do this level of testing.â\u0080\u009d â\u0080\u009cWe designed a horse and buggy to race in the Indy 500 and weâ\u0080\u0099re having a hard time keeping up,â\u0080\u009d Jha told MarketWatch, and itâ\u0080\u0099s â\u0080\u009cmaking it so much harder to control the disease.â\u0080\u009d Not all labs across the country are being properly utilizedÂ â\u0080\u009cThereâ\u0080\u0099s a lot of capacity to do tests thatâ\u0080\u0099s sitting on the sidelines,â\u0080\u009d Jha said. There are many labs in the U.S. that have the ability to do coronavirus testing, but arenâ\u0080\u0099t â\u0080\u009cbecause theyâ\u0080\u0099re using the machines for something else.â\u0080\u009d â\u0080\u009cThey donâ\u0080\u0099t know that, if they stop doing the other stuff, if theyâ\u0080\u0099ll be able to get paid to switch to coronavirus testing,â\u0080\u009d he added. Companies with the technology would still have to repurpose their machines for coronavirus testing, Jha said. â\u0080\u009cThey couldnâ\u0080\u0099t possibly justify spending tens of millions of dollars if they donâ\u0080\u0099t know that this is going to be financially viable.â\u0080\u009dÂ “ â\u0080\u0098Thereâ\u0080\u0099s a lot of capacity to do tests thatâ\u0080\u0099s sitting on the sidelinesâ\u0080\u0099 ” â\u0080\u0094 Ashish Jha, director of the Harvard Global Health Institute Giroir said that the price point the federal government pays to labs and suppliers of inputs for tests â\u0080\u009cis very fair and highly incentivizes people to do these tests.â\u0080\u009d To ease their financial concerns, Jha recommended that the federal government pay them a portion of their fees upfront.Â He has spoken directly to some of those labs that are already in a financial limbo due to a decline in testing volumes because non-emergency health visits have fallen.There are only a couple of companies that make the reagents to perform the tests The Centers for Disease Control and Prevention has not publicly disclosed how many companies commercially manufacture reagents, but Jha believes thereâ\u0080\u0099s only a handful of companies doing so. In March, President Trump invoked the Defense Production Act calling upon traditional car manufacturers like General Electric GE, +2.85% and Ford F, -1.36% to make ventilators. In April, he called upon 3M MMM, +0.94% to manufacture more N95 masks.Â Jha said that could have been prevented if Trump invoked that same act to mandate â\u0080\u009ccompanies that donâ\u0080\u0099t make the reagents for these tests to start making the reagents.â\u0080\u009d â\u0080\u009cThose companies are working full time, but they canâ\u0080\u0099t ramp up production any more than what theyâ\u0080\u0099ve done,â\u0080\u009d he said."}]}