{"article": [{"url": "https://www.marketwatch.com/story/heres-how-the-stock-market-tends-to-trade-after-brutal-selloffs-like-thursdays-2020-06-11", "published": 1592034800.0, "headline": "Hereâ\u0080\u0099s how the stock market tends to trade after brutal selloffs like Thursdayâ\u0080\u0099s", "body": "U.S. stocks on Thursday booked their worst daily plunge since fears about the economic impact of measures to curtail the spread of the COVID-19 pandemic took root in investorsâ\u0080\u0099 psyches back in March. The Dow Jones Industrial Average DJIA, +0.56% tumbled roughly 1,862 points and the S&P 500 SPX, +0.87% Â lost 5.9% to tally their worst one-day declines since March 16, according to Dow Jones Market Data. Bespoke Investment Group noted that the broad-market S&P 500â\u0080\u0099s greater-than-5% tumble, on the back of rejuvenated fears of an emerging second wave of the illness derived from the novel strain of coronavirus and a sobering outlook from Federal Reserve Chairman Jerome Powell, was only the 28th time since 1952, when the S&P 500 converted to a five-day trading schedule, that the index has tumbled by at least 5% in a day. Five of those declines have been in the past three months alone. The investment and research provider also noted that an unraveling of the market on a Thursday is also a rarity, with all such previous Thursday 5%+ drops occurring amid the 2008 financial crisis and none before that, going back to 1952. All that said, declines of this magnitude have historically been followed by sizable rebounds in the days, weeks and months to follow (see attached table). Source: Bespoke Investment Group Bespoke notes that, on average, the S&P 500 has rallied 2.14% the day after a decline of 5% or more, and has been positive the next day 81.48% of the time. Of course, the longer the time horizon, the greater the likelihood and intensity of the bounceback. About a year after such drops, the S&P 500 has averaged a gain of 18.92% and has had positive returns 82.6% of the time, Bespoke noted. Check out the attached chart: Source: Bespoke Investment Group Itâ\u0080\u0099s important to note that Thursdayâ\u0080\u0099s selloff may not represent the end of a bullish phase for stocks after they hit their lowest point in a coronavirus-inspired selloff on March 23. Keith Lerner, chief market strategist at SunTrust Advisory Services, said that valuations for stocks had gotten lofty after the run-up for equities from their lows. For example, the Dow remains up 35.2% from its closing low on March 23 at 18,591.93, the S&P 500 has gained 34.2% from that low, while the technology-laden Nasdaq Composite Index COMP, +1.39% Â is 38.4% above that nadir, even after Thursdayâ\u0080\u0099s punishing decline. â\u0080\u009cAfter a 40%-plus rebound in the S&P 500 since March, stocks became stretched to the upside and vulnerable to bad news,â\u0080\u009d wrote Lerner in a Thursday research report. â\u0080\u009cMarkets started to bake in a very smooth economic reopening process, even while we continue to expect it to be positive but uneven. Last Fridayâ\u0080\u0099s much-better-than-expected jobs report further lifted investor expectations, and with elevated expectations, bad news surrounding the coronavirus went a long way in hitting markets,â\u0080\u009d he wrote, referencing the Labor Department employment report last Friday that showed a surprising 2.5 million jobs were created in May. Powell on Wednesday, following the Federal Reserveâ\u0080\u0099s policy update, said during a news conference that investors shouldnâ\u0080\u0099t overestimate the degree and pace of the recovery for the jobs market, noting that millions of jobs may remain unfilled due to forced closures and business shutdowns. Check out:A recap of the Fedâ\u0080\u0099s policy decision That said, Lerner also is of the view that the current retreat for the stock market represents a bump in the road and possible point for investors to digest the powerful gains from the lows of the past few weeks. He drew parallels to the rebound from the 2008 financial crisis, when the stock market saw a similar sharp pullback on a longer road to recovery. â\u0080\u009cNotably, this setback has come around the same period as it did during those bull markets, where stocks took a pause to digest gains and subsequently traded in a choppy sideways pattern,â\u0080\u009d the SunTrust strategist wrote. â\u0080\u009cWhile history is only a guide, we believe this is a reasonable road map for the marketâ\u0080\u0099s near-term direction,â\u0080\u009d he said. Check out the attached chart: Source: SunTrust Advisory Services To be sure, past results are no guarantee of outcomes for the future and the pandemic has managed to befuddle a number of investment pros already. The continued threat from the deadly pathogen that has infected more than 7 million people worldwide is a serious one. Bloomberg News on Thursday reported that Houston-area officials are â\u0080\u009cgetting closeâ\u0080\u009d to reimposing stay-at-home orders as cases rise. Some 20 states are seeing signs of rising cases of COVID-19, and although there has been movement on remedies and cures for the illness, there are exists no bona fide vaccines or treatments."}]}