{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-lifted-by-lackluster-bounce-in-opec-crude-output-inventory-fall-2020-09-02", "published": 1599060740.0, "headline": "U.S. oil prices settle at lowest in nearly a month as supplies, output log sharp but temporary hurricane-related drop", "body": "Oil futures declined on Wednesday, with U.S. prices settling at their lowest in nearly a month, pressured by a sharp, but temporary drop in domestic crude supplies and production, as output in the Gulf of Mexico sees a strong recovery from Hurricane Laura. The supply declines from the Energy Information Administration were “not surprising,” as Hurricane Laura caused a “bigger draw than what was forecasted in crude and gasoline” supplies, Tariq Zahir, managing member at Tyche Capital Advisors, told MarketWatch. The EIA reported Wednesday that U.S. crude inventories fell by 9.4 million barrels for the week ended Aug. 28, marking a sixth weekly decline in a row. That compared with an average forecast by analysts polled by S&P Global Platts for a fall of 1.2 million barrels. The American Petroleum Institute on Tuesday reported a drop of 6.4 million barrel. The EIA data also showed crude stocks at the Cushing, Okla., storage hub edged up by about 100,000 barrels for the week. Total U.S. crude production also dropped by 1.1 million barrels last week to stand at 9.7 million barrels a day. The drop coincides with the output shut ins related to Hurricane Laura, which touched down on the U.S. Gulf Coast early on Aug. 27. Against that backdrop, West Texas Intermediate crude for October delivery CL.1, -1.62% US:CLV20 fell $1.25, or 2.9%, to settle at $41.51 a barrel on the New York Mercantile Exchange. That was the lowest front-month finish since Aug. 7, according to FactSet data. November Brent crude BRN00, -0.07%, the global benchmark, lost $1.15, or 2.5%, at $44.43 a barrel on ICE Futures Europe. Hurricane Laura “led to significant reductions in offshore oil production,” but those “losses are temporary and expected during hurricane season,” said Robbie Fraser, senior commodity analyst at Schneider Electric, in a note ahead of the EIA supply data. “A major decline in U.S. weekly crude production won’t necessarily offer much support to the market.” The Bureau of Safety and Environmental Enforcement on Wednesday estimated that 19.9% of the current oil production in the Gulf of Mexico has been shut in, along with around 19.7% of natural-gas output. Around the time Laura reached the Gulf Coast last Thursday, about 84% of oil output was shut in. The EIA on Wednesday also reported that gasoline supply fell by 4.3 million barrels, while distillate stockpiles declined by 1.7 million barrels. The S&P Global Platts survey had shown expectations for supply declines of 4.7 million barrels for gasoline and 900,000 barrels for distillates. On Nymex Wednesday, October gasoline US:RBV20 fell by nearly 1.9% to $1.202 a gallon and October heating oil US:HOV20 lost 3.4% to $1.1885 a gallon. Looking ahead, there are several factors that could drive the next move for oil, said Zahir. Monthly U.S. employment data will be released Friday, and “we have already seen a weaker than expected number from ADP, which could be a forecast of what lies ahead, he said. “The bigger factor we feel will be how schools open....If we see additional schools go to remote learning, we feel that will have a demand impact on gasoline.” “We would need a vaccine come to the market to see a sustained move higher” in the oil market, Zahir said. “Barring that, we feel the risk is to the downside in crude oil.” Meanwhile, natural-gas futures finished lower Wednesday to suffer a third straight session decline, with the October contract US:NGV20 down 1.6% at $2.486 per million British thermal units. Read:Natural-gas futures gain nearly 50% in August, but rally may be ‘short-lived’ The October contract is “taking a beating versus the deferred months,” said Dan Flynn, market analyst at The Price Futures Group, in a daily note. “Change in temperatures must be the culprit.” Still, there is “no question natural gas is the wave of the future,” he said. “Unless there is another innovative idea to find an alternative and have the infrastructure to mass produce, this commodity is a keeper.” The moves in natural gas come ahead of the EIA’s weekly update on U.S. supplies of the commodity in storage. Analysts polled by S&P Global Platts expect the report Thursday to show a weekly rise of 34 billion cubic feet."}]}