{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-drift-up-but-tech-attempts-tepid-rebound-as-investors-watch-rising-coronavirus-cases-and-frayed-us-china-ties-2020-07-08", "published": 1594226720.0, "headline": "Dow closes up 177 points, Nasdaq at fresh high as investors focus on economic recovery prospects", "body": "U.S. stocks ended Wednesday higher, with the tech-heavy Nasdaq scoring an all-time record, as investors focused on stocks that can outperform amid an acceleration of coronavirus infections in about 30 American states and longer periods of working from home. How did benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% rose 177.10 points, or 0.7%, to end at 26,067.28, after trading as high as 26,109.49 at the start of the session. The S&P 500 SPX, +0.87% climbed 24.62 points, or 0.8%, to finish at 3,169.94. The Nasdaq Composite COMP, +1.39% added 148.61 points, or 1.4%, closing at a fresh 10,492.50 record, it’s 25th of the year. On Tuesday, the Dow tumbled 396.85 points, or 1.5%, to end at 25,890.18; the S&P 500 index shed 34.40 points, or 1.1%, closing at 3,145.32 and ending a 5-session win steak; while the Nasdaq Composite Index fell 89.76 points, or 0.9%, to finish at 10,343.89, after carving out an intraday 10,518.98 record on Monday. Year-to-date the Dow is down 8.66%, the S&P 500 down 1.88% but the Nasdaq Composite is up 16.94%. What drove the market? Equity markets booked gains Wednesday, even as investors focused on the question of whether unabated increases in COVID-19 cases in a number of U.S. states would delay economic recovery. The U.S. reported 60,000 new coronavirus cases Tuesday, a single-day record, according to data compiled by Johns Hopkins University. The seven-day average for cases is higher than the 14-day average, an indication that the spread is intensifying, according to a Wall Street Journal analysis of the publicly available health data. “The single-day spike kind of woke some investors up,” Lindsey Bell, Ally Invest’s chief investment strategist, told MarketWatch. Bell also expects the approaching corporate earnings reporting season in mid-July to provide reason for optimism, if only by showing the worst damage from the crisis has passed. “Earnings expectations are still pretty dire, but it looks like the second-quarter will be the bottom, and that there will be improvement in the third and fourth quarter, even if there are double-digit declines,” she said. “Investors are hopeful that 2021 is going to be a heck of a lot better than 2020.” Overall, more than 3 million coronavirus cases have been confirmed in the U.S. along with at least 131,857 deaths, the largest national toll in the world. Texas and Florida have become the epicenters of the recent resurgence, with Florida reporting 7,361 cases on Tuesday and Texas recording more than 10,000 infections—the highest one-day increase in infections thus far. Since early May, growing optimism around the U.S. economic restart had been driving a rotation into more cyclical stocks, mainly with an eye toward which companies could benefit from an easing of strict lockdowns: the “reopening” or “return to work” trade. “That trade has really unwound here,” said Katie Nixon, Northern Trust Wealth Management’s chief investment officer, in an interview. “Investors are getting back to the tried and true stocks that will be supported by a prolonged working-from-home environment.” Nixon pointed to the outperformance of tech-powerhouseInvesco QQQ Trust QQQ, +1.52%, one of the oldest and most liquid exchange-traded funds, as well as shares of Facebook Inc. FB, +0.26%, Amazon. com Inc. AMZ, +1.47%, Apple Inc. AAPL, +1.74%, Netlfix Inc. NFLX, +1.43% and Google GOOG, +1.97% GOOGL, +1.82% parent Alphabet as examples. Read: Slack, Microsoft, Zoom are upping the ante in virtual meeting wars The broader market, with the exception of the technology-laden Nasdaq, has traded in a relatively tight range since a recent peak on June 8 for the S&P 500 index and the Dow, as stalled business reopenings threaten the prospects of a V-shaped, or quick and sharp, recovery from a deep recession, barring a vaccine or effective treatments of the deadly illness. Away from Wall Street, consumer credit dropped 5.3% on an annual basis in May, after plunging 20% in April during the height of the coronvirus, signaling that U.S. households have been less willing to borrow to make purchases than in the past. Global government borrowing has taken on the opposite trajectory, with investment bank Barclays pointing out that public debt is on pace to eclipse World War II levels. Which stocks were in focus? KKR & Co. KKR, -0.61% stock gained 10% after it announced Wednesday an agreement to buy retirement and life insurance company Global Atlantic Financial Group Ltd. Walgreen’s Boot Alliances Inc. WBA, -1.96% Shares of edged 0.2% higher after the pharmacy chain said it would take a 30% stake in VillageMD as part of its plans to open up 700 new primary care practices at Walgreens stores. TaylorMorrison Home Corp. TMHC, +3.36% said Wednesday that June was its strongest sales month ever. The home builder’s shares surged 16.9%. Shares of Alcoa Corp. AA, -1.65% fell 1.3% Wednesday, after the aluminum products maker provided preliminary second-quarter results that were above analyst expectations, citing productivity gains and cost savings amid challenges resulting from the COVID-19 pandemic. Shares of Nikola Corp. NKLA, -1.36% soared 34.3% Wednesday, putting them on track to snap a five-day losing streak, after J.P. Morgan turned bullish on the battery- and hydrogen-electric truck maker, citing a more attractive valuation following the recent selloff. Instant messaging platform Slack Technologies Inc. WORK, +3.36% said Wednesday it has acquired Rimeto, a provider of business directory services for an undisclosed sum. Slack’s shares rose 8.8%. GoHealth Inc., a health insurance marketplace, set terms for its planned initial public offering on Wednesday, with plan to offer 39.5 million shares priced at $18 to $20 each. United Airlines Holdings Inc. UAL, +0.32% said it would send furlough or layoff warnings to 36,000 employees due to the coronavirus impact on demand for air travel. The airline’s shares fell 0.1%. U.S. traded shares of Alibaba Group Holding Ltd. BABA, -0.26% rallied 9%, following a report that the Chinese e-commerce giant plans an initial public offering for Ant Financial Services Group How did other assets perform? West Texas Intermediate U.S. crude futures US:CLQ20 for August delivery rose 28 cents, or 0.7%, to settle at $40.90 a barrel, on the New York Mercantile Exchange. In precious metals, August gold futures US:GCQ20 gained $10.70, or 0.6%, to settle at $1,820.60 an ounce, after hitting its highest level since Sept. 2011 on Tuesday. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% was up less than a basis point at 0.652%. Bond prices move inversely to yields. The greenback fell 0.4% a basket of its major rivals, based on trading in the ICE U.S. Dollar Index. DXY, -0.58% In European equities, the Stoxx Europe 600 index SXXP, +0.55% fell 0.7%, and London’s FTSE 100 UKX, +0.64% shed 0.6%. In Asia markets, China’s benchmark CSI 300 Index 000300, +2.04% gained 1.6%, extending its weekly rally. Hong Kong’s Hang Seng Index HSI, +2.28% rose 0.6%. Mark DeCambre provided additional reporting"}]}