{"article": [{"url": "https://www.marketwatch.com/story/uk-trial-sparks-interest-in-dexamethasones-potential-as-a-treatment-for-severely-ill-covid-19-patients-2020-06-16%7CNEW", "published": 1592374520.0, "headline": "U.K. trial sparks interest in dexamethasone's potential as a treatment for severely ill COVID-19 patients", "body": "A snapshot of data from a clinical trial in the U.K. testing a commonly prescribed steroid as a treatment for some severely ill COVID-19 patients reduced deaths among those patients, a finding that sent U.S. stocks soaring on Tuesday morning. Researchers at the University of Oxford said that low doses of dexamethasone reduced deaths in hospitalized COVID-19 patients who were on ventilators by one-third or receiving oxygen support by one-fifth. The steroid did not benefit hospitalized COVID-19 patients who don't require respiratory support. \"Dexamethasone is the first drug to be shown to improve survival in COVID-19,\" Dr. Peter Horby, a chief investigator for the study, said in a news release. \"The survival benefit is clear and large in those patients who are sick enough to require oxygen treatment.\" About 2,100 patients received a low dose of dexamethasone for 10 days; another 4,300 patients received the standard of care. Few additional details about the trial or the participants were made available at this time. Read:Hope dims for hydroxychloroquine even as medical study detailing the drug's failure is retracted This would be the first example of a drug that helped reduce deaths among severely ill COVID-19 patients. Gilead Sciences Inc.'s GILD, +0.82%  remdesivir, which had received an emergency use authorization from the Food and Drug Administration (FDA), was found to reduce recovery times among severely ill patients, in comparison. An estimated 20% of people who test positive for the virus are hospitalized. In New York, for example, about 90,000 patients with COVID-19 have been hospitalized out of the roughly 383,000 people in the state who have tested positive for the coronavirus. However, some experts have criticized the researchers' decision to release partial data - full results are expected to be published \"as soon as possible\" - following a series of medical research blunders during the COVID-19 pandemic that have led to at least two retractions of headline-grabbing clinical studies. Dr. Atul Gawande, a well-known medical journalist and surgeon, tweeted that \"after all the retractions and walk backs, it is unacceptable to tout study results by press release without releasing the paper.\" \"It is now a feature of this pandemic that most findings made public via press release with little data to provide context,\" Dr. Ashish Jha, incoming dean of the Brown University School of Public Health, tweeted. \"They could have easily put out a pre-print. [It's] frustrating but reality.\" Both physicians also tweeted that if the findings are true, it is good news for patients and doctors. The randomized trial is part of a larger study called the Recovery clinical trial that set out to examine six potential therapies as treatments for COVID-19. Enrollment in the dexamethasone trial has been halted, due to the promising nature of the findings, as has the hydroxychloroquine arm, which was stopped due to a lack of efficacy. (The other four therapies being tested are AbbVie Inc.'s ABBV, +0.41%  HIV drug Kaletra, the antibiotic azithromycin, Roche Holding AG's ROG, +1.80%  rheumatoid arthritis medication Actemra, and convalescent plasma, donated by people who have recovered from COVID-19.) There are at least 10 clinical trials under way testing dexamethasone in COVID-19 patients, including a randomized, double-blinded, placebo-controlled study at the University of Colorado in Denver. See also: Dow surges 700 points amid retail sales recovery and report on potential coronavirus treatment There are few proven treatments available for the eight million people worldwide who have tested positive for the coronavirus. In the U.S., the FDA has granted emergency use authorizations to three therapies during the COVID-19 pandemic, and only one - remdesivir - is a direct therapy, to be used among certain severely ill and hospitalized patients. The other two EUA are for Fresenius Kabi therapeutics, one used to maintain sedation in ventilated patients and the other a continuous renal replacement therapy. The regulator on Monday revoked emergency authorization for hydroxychloroquine and chloroquine, a pair of decades-old drugs approved to treat malaria, lupus, and rheumatoid arthritis, citing the medications' potential interaction with remdesivir as one reason to withdraw its authorization. The decision came within weeks after The Lancet, a prestigious medical journal, retracted a study that found hydroxychloroquine could increase the risk of death among COVID-19 patients over concerns about the accuracy of the data. Other studies, including one at the University of Minnesota, concluded that the drug isn't efficacious in preventing or treating people with COVID-19."}]}