{"article": [{"url": "https://www.marketwatch.com/story/gilead-says-coronavirus-drug-remdesivir-can-reduce-risk-of-death-but-analysts-need-more-proof-2020-07-10", "published": 1594463660.0, "headline": "Gilead says coronavirus drug remdesivir can reduce risk of death, but analysts need more proof", "body": "Shares of Gilead Sciences Inc. gained 2.0% on Friday after the drugmaker shared potentially promising data about remdesivir that indicates the experimental COVID-19 drug may reduce deaths, though it noted the findings need to be confirmed. Gilead’s GILD, +0.82% new analysis pairs data from two sources: a comparative, pre-planned analysis of 312 severely ill participants in a randomized, open-label Phase 3 trial, cobbled together with a real-world retrospective cohort of 818 patients who had similar clinical attributes to those included in the trial and had received remdesivir as part of their treatment. It indicates that remdesivir can reduce the risk of mortality in COVID-19 patients by 62%, when compared with the standard of care. “This is very encouraging but needs to be confirmed in a prospective trial,” Scott Gottlieb, the former commissioner of the Food and Drug Administration (FDA), tweeted. Gilead agreed, saying the new findings require “confirmation in prospective clinical trials” although the company did not say whether it plans to conduct those studies. Read:Why virus stocks are driving market volatility The source for the analysis, however, is unorthodox. It’s not from a randomized, placebo-controlled clinical trial, which has long been considered the gold standard for medical research in the U.S., and it compares clinical trial data to non-clinical trial data. “They highlight comparison to non-trial patient group,” Bernstein analyst Ronny Gal said in an email. “This is usually not done. However, given the epidemic, it is logical.” This is the latest example of how the coronavirus pandemic has upended the way clinical research is disseminated to investors and the public. Some companies are releasing snippets of data rather than full peer-reviewed data sets, and investors are making choices based on preliminary research published in preprint format, rather than waiting for peer-reviewed results. Gilead acknowledged the shift in how it is sharing clinical information. “To address the urgency of the continuing pandemic, we are sharing data with the research community as quickly as possible with the goal of providing transparent and timely updates on new developments with remdesivir,” Dr. Merdad Parsey, Gilead’s chief medical officer, said in a news release. There have been three major clinical trials for remdesivir so far in the U.S.: a Gilead-sponsored open-label study for moderately ill patients, which found no statistically significant benefit; the Gilead-sponsored Phase 3 trial for severely ill patients that is mentioned above, which was used to help understand the number of days a patient should undergo treatment; and a National Institute of Allergy and Infectious Diseases randomized, controlled study, which found the drug helped reduce the number of a days it takes for a severely ill patient to recover. A pair of closely watched double-blind, randomized, controlled trials in China were halted early due to enrollment issues but a study published in The Lancet about the multi-site trial in China did not indicate a mortality benefit. “It is a confusing suggestion given three prospective [randomized, controlled trials] already failed to demonstrate a survival benefit,” Raymond James analyst Steven Seedhouse told investors on Friday. “The aggregate clinical data still pretty clearly point to an inconclusive impact on survival at best.” See also:After months of speculation, investors get excited about Pfizer, BioNTech’s coronavirus vaccine candidate The FDA in May granted an emergency use authorization to Gilead for remdesivir in some hospitalized, severely ill patients. The drugmaker said it would work on trials for pregnant women and children with COVID-19 as well as for an inhaled version of the drug. Gilead’s stock has gained 17.5% year-to-date, with the share price reaching a year-to-date high of $84.00 on April 30, the day after the company released data from the NIAID trial and its own study of severely ill patients. The S&P 500 SPX, +0.87% is down 2.4%."}]}