{"article": [{"url": "https://www.marketwatch.com/story/how-to-wear-high-end-labels-without-high-end-prices-2020-10-09", "published": 1602237320.0, "headline": "How to wear high-end labels without high-end prices", "body": "This article is reprinted by permission from NerdWallet. Nowadays, it’s not just celebrities who wear high-end clothing and accessories. The influencers filling your social media feed likely wear them, too. Millennials love buying luxury names, according to Thomaï Serdari, academic director of the Fashion & Luxury MBA at NYU Stern School of Business and brand strategist at Brand(x)Lux. Some younger people are environmentally or socially conscious and invest in higher-end labels, buying one quality item that lasts for years or spending more money for a brand with a mission they believe in. Others simply want to treat themselves to a premium handbag, watch or pair of shoes every once in a while. “They like to be seen and they like to be photographed on Instagram carrying all the big names,” Serdari says. “Chanel, Louis Vuitton LVMUY, +1.74% , Prada PRDSY, +1.23% and all these luxury brands.” Here are a few ways to save money on products from some of the most sought-after labels. These tips can be applied to different levels of brand prestige and price points.Shop the secondary market Perhaps your best shot at savings is in the secondary market. The RealReal is a marketplace for consigned luxury goods, where you can get some items for a fraction of their retail price, according to Sasha Skoda, head of women’s at The RealReal. “If you were to purchase a current season Gucci sneaker, they’re probably going to be priced pretty close to retail because they’re so in-demand,” Skoda says. “But if you were to purchase maybe a past season Tory Burch dress, you could potentially get it for up to 90% off the original retail price.” There are other places to shop for these types of savings, too. But if you’re not shopping at a trusted establishment, you could be vulnerable to phony goods. “The more brand awareness that exists about a specific brand, the more people try to counterfeit the product,” Serdari says. Stay safe by sticking to reputable sellers. The RealReal, for example, has a team of experts that authenticates the items it sells. On the other hand, snagging what looks like a low-price Prada tote listed by a seller you don’t recognize on eBay EBAY, +6.47% can be much riskier.Check out the outlet Outlet stores, where brands sell their products straight to consumers, can also be sources of savings, but they likely won’t offer the same items you would see from the brand elsewhere. Serdari says products are often manufactured specifically for an outlet store. They’ll usually be the same quality but not the current collection from the brand. Despite this downside, outlets are still a good option if you want the social recognition and logo of a label without paying as much for it.Scout out several places Do your due diligence by scoping out products in person (when it’s safe to do so) and exploring your options. You may find a bargain on something at a boutique or department store that you hadn’t previously considered or wasn’t exactly what you had in mind, Serdari says. But don’t count out online sales, either. Some designer brands, such as Coach (owned by Tapestry, Inc. TPR, +0.80% ) and Michael Kors, (owned by Capri Holdings Ltd.) CPRI, +2.55% occasionally host annual sales on their websites. (More expensive luxury brands typically don’t, Serdari says.) You’ll save during these recurring promotions, but Serdari warns that sale sections are often more limited and may contain items that aren’t as desirable. Check for a sale tab on the brand’s website.Budget for your splurge Even if you find a good deal on that leather wallet or those cat-eye sunglasses, it’s likely you’ll still be spending a good chunk of money for your purchase, depending on the original price. Remember to account for your extravagant treat in your regular budget. According to the 50/30/20 budget, needs should take up no more than 50% of your monthly budget, wants get another 30% and savings encompass the remaining 20%. A luxury item would fall in the 30% category. Ensure you have room for it along with the other expenses that are already in that group like your morning latte and weekly takeout dinners. With your budget accounted for, go ahead and enjoy the feeling of looking like you paid much more for something than you actually did.More from NerdWallet: Are Medicare Advantage Plans Worth the Risk? Smart Money Podcast: Fake Reviews and Saving ‘Too Much’ Is Moving Now Your Best Financial Move? Courtney Jespersen is a writer at NerdWallet. Email: courtney@nerdwallet.com. Twitter: @CourtneyNerd."}]}