{"article": [{"url": "https://www.marketwatch.com/story/this-86-year-old-psychologist-has-some-advice-on-how-older-americans-should-prepare-to-re-enter-society-and-how-their-kids-and-grandkids-can-help-2020-07-21", "published": 1595424560.0, "headline": "This 86-year-old psychologist has some advice on how older Americans should prepare to re-enter society - and how their kids and grandkids can help", "body": "Katharine Esty understands the impacts the pandemic is having on older Americans who yearn for their routines - after all, she's an 86-year-old psychologist who misses going to her office every day to meet with clients. Esty, who is also the author of \"Eightysomethings: A Practical Guide to Letting Go, Aging Well, and Finding Unexpected Happiness,\" has seen the effects of the coronavirus crisis on older Americans first hand, but said not all of it has been negative. Many older Americans are still stuck in their homes, or told to stay away from others for risk of complications from contracting the disease, or their nursing homes or assisted living facilities may still be restricting visitors. Still, this has been a time for them and others to reconnect with loved ones, such as scheduling regular phone calls or taking up a new or neglected hobby. Esty spoke with MarketWatch about how the crisis is affecting older Americans, what they and their loved ones can do to help and how to prepare for a post-pandemic world. This interview was edited for clarity and length. See: Be on the lookout for COVID-19's hidden cost to older people MarketWatch: How has this pandemic affected older Americans, beyond of course their physical health? Katharine Esty: First of all, there are people who are feeling emotionally up and down a lot of the time. They get very lonely when they're cut off from their grandchildren and in some places they live, such as a retirement community like me, they've been stuck in their apartments by themselves for three months. They are lonely, and loneliness we know can also affect physical health. To feel you can't be in touch with anyone who matters to you is huge. Also, the fact that we have been hearing an emphasis that if we get it it'll be very serious and we're the age group most at risk of dying. Older people, in their 80s, are used to that concept but I noticed the level of anxiety for our kids - people in their 50s and 60s - is high because they're new to the idea that there could be something dangerous around. There are some things that are good. The pandemic made people less busy and just have time for whatever they want, like to read, call friends. It's not 100% negative. But I know that what has been really hard for everyone who is aging is that some important events were canceled. They missed a wedding, or a graduation of a grandchild, and there is grieving to do. MW: Is there anything they can do if they're grieving for those moments or lonely? Esty: Developing a routine fills your time and keeps you healthy too. People can take care of themselves. I take care of myself. And they can do that if they keep moving, walking, dancing, exercising. People are meditating, which helps me wind down and be more at peace. They can also have a routine, such as scheduled regular phone calls with grandchildren or children. Take the initiative. The main thing is to keep talking. My generation is more comfortable on the telephone than zoom but zoom has been a godsend. My colleagues and friends have learned how to zoom since March and routine is key. I have been talking to my clients about starting a new project. They can be writing a memoir, for example. I can't tell you how many people in my group of therapists have become birders - it is a good adaptation of being isolated and you make friends with the birds. MW: Being stuck in the house or away from loved ones has made many Americans, of all ages, become anxious about the uncertainty of this crisis. How can people cope, especially if they're older? Esty: They're anxious because they know it can all be so serious and they're also anxious when they feel they read that when everything reopens, older people should probably stay home because they're still vulnerable. There's a lot of pandemic fatigue - when they thought everything would be open in September, and now November or February or next year - the idea of a whole year not seeing your grandchildren or your friends is very, very hard. That time horizon for all of us is a huge amount of time to be outside of your normal life and it is particularly hard for older people when they think they may not have as many years to see their grandchildren. That's why people have to do everything they can to keep themselves occupied. I am a great believer in work. I am one person who thinks work and projects and a focus is useful at all ages. I'm still working and have a private practice and write on a blog, and I think that's good. I think children and grandchildren of people who are quarantined or not feeling good can reach out, and knowing even when someone says they're fine they may be hurting. It means a lot when other generations reach out. MW: Why have you stayed in the workforce? Esty: I have always had jobs that have been very stimulating, from teaching to running a consulting firm. I was one of the people who felt work was as much fun or more fun than what was called fun. It was just very engrossing. I had my own business for 20 years, and felt I still wanted to do that. I don't have the energy I used to when I write - two hours is a big chunk of time - but it still brings me that pleasure. I am sad not to go to the office anymore. Before the pandemic, I went to the office every day. I would get dressed and see clients and come home and it kept me in touch with the world. It was a way I loved to live. I miss the idea of getting up and going to the office. MW: How can older Americans prepare for the post-pandemic world? Esty: It is going to be different in a post-pandemic world. It is not going to be the same, but I think especially for aging people. I found while working on my book that they found unexpected happiness. By interviewing all of these people, most older adults are happier than they thought they'd be. We thought we would be dreading growing older but when you get there, you're unexpectedly happy and you're happy because of a changed lifestyle and no longer striving to achieve something or be interested immaterial goods. There's a freedom. I think when they get through this pandemic, they're going to enjoy freedom to go where they want to go and on their own time. In quarantine when you haven't had full activity, you can learn helplessness. Like the people in retirement communities, we suddenly couldn't walk for six weeks. We were staying in the apartment. When they went out they had to learn how to walk again because they lost a lot of tone and so on. I think older people need to be intentional - take their time and pay attention to their inner feelings about what is too much and what kind of risks they should take. MW: Was there anything else that surprised you while you wrote \"Eightsomethings\"? Esty: The first thing was how happy they were but there was this kind of joy and freedom, and also getting rid of your things. People have such a hard time downsizing, but when you do, you don't miss these things and there's a real joy that comes with living a little more simply. When you don't have a lot of responsibilities like they had before, there's this freedom and people sort of grow out of having to do what people expect of them to do and the shoulds and oughts. They become more themselves and do what they want to do and there's great pleasure there. I found all that was true. People who had a purpose, whether it was work or volunteering or creative projects like painting and writing, these projects give meaning to their lives and that's what people need - some sort of purpose or meaning. I interviewed 128 people. The stereotypes of old age are not true. Old people can learn another thing, like taking on a project to learn French or Spanish. Lots of people are using these apps and others are learning to play the piano or practicing cello. So we have to get rid of assumptions of old age. Also see: COVID-19 hasn't changed most people's retirement plans The other thing I think is the idea of letting go and that's the first stage of creating a happy old age. I know I had a hard time when I was 65, and wondered if I should retire. Isn't that what people do? I had no interest in retiring and eventually I could say I don't have to do what most people do. We have to work on rejecting some of these ageist assumptions that are still present in culture. You have to say, with retiring for example, maybe that's good for some people, but as I told you, I love going to the office and having a private practice. People need to think for themselves - and ask what's right for me? It's harder work than it sounds. MW: How can older Americans find passion, meaning or projects right for them? Esty: You have to try a few things. It may have to be like anything else, trial and error. I know some are writing memoirs, others are starting out of their genealogy. Just because you're old doesn't mean you can't do something creative and constructive, and also just because you're old doesn't mean you're going to necessarily be depressed. If they are, they should go to the doctor. There is a lot to learn and lots to recommend about this stage of life. This is a good stage of life that can be enjoyed for many years."}]}