{"article": [{"url": "https://www.marketwatch.com/story/trump-suddenly-supports-mail-in-voting-for-the-key-swing-state-of-florida-2020-08-04", "published": 1596570860.0, "headline": "Trump suddenly supports mail-in voting â\u0080\u0094 for the key swing state of Florida", "body": "After weeks of bashing mail-in voting and even suggesting the 2020 election should be delayed, President Donald Trump has changed his tune â\u0080\u0094 at least when it comes to the critical swing state of Florida. Now heâ\u0080\u0099s for it. The president on Tuesday encouraged voters in Florida to vote by mail, first via a tweet and later at his daily coronavirus press conference. iframe.twitter-tweet { width: 100% !important; } â\u0080\u009cFlorida has been working on this for years. They have a very good system for mail-in,â\u0080\u009d said Trump, when asked by a reporter to explain his seeming change of heart. The president credited two â\u0080\u009cgreatâ\u0080\u009d Florida governors, Rick Scott and the current incumbent Ron DeSantis, for building Floridaâ\u0080\u0099s current system. Florida helped deliver a key win for Trump in his victory over Hillary Clinton in 2016. Polls show he now trails Democratic contender Joe Biden. At the same time, though, the president repeated his criticism of Nevadaâ\u0080\u0099s decision to mail ballots to all voters in the Western swing state. The Democratic governor and Democratic-controlled state legislature approved the plan over the weekend. Read:Job trouble? Wave of rehiring after economy reopened to fade in July after viral spiral Trump contended that states with little experience in broad mail-in voting arenâ\u0080\u0099t equipped to make the transition quickly. He cited the hung congressional election in New York between veteran Democrat Carolyn Maloney and a left-leaning challenger that is still undecided a month and a half after the vote took place. â\u0080\u009cWhen you look at the Carolyn Maloney election, I think you have to do it over. Itâ\u0080\u0099s a disaster. Itâ\u0080\u0099s a mess,â\u0080\u009d said Trump, referring to a New York Times article about the outcome. Critics say Trump wants to stymie mail-in voting because it would lower the odds of him winning reelection. His suggestion that the November vote be delayed was rejected by major lawmakers in both parties. Read: Economy suffers titanic 32.9% plunge in 2nd quarter, points to drawn-out recovery Also:â\u0080\u0098A massive welfare economyâ\u0080\u0099 - federal aid prevents even steeper GDP collapse In other remarks during his press conference: â\u0080¢ Trump said his military advisers believe a deadly explosion in Lebanon was the result of an â\u0080\u009cattack.â\u0080\u009d The countryâ\u0080\u0099s prime minister has publicly declared it was an accident triggered by improper storage of nearly 3,000 tons of explosive chemicals near Beirutâ\u0080\u0099s port. â\u0080¢ Trump reiterated his belief that the U.S. Treasury should benefit financially from the sale of the Chinese-owned social-video app Tiktok, potentially to Microsoft MSFT, +2.48% He said the U.S. was making the deal possible. It would be highly unusual, if not unprecedented, for the U.S. government to profit from the sale of a private company in which it had no stake, legal experts say. The White House has threatened to ban the app over national-security concerns. â\u0080¢ Trump indicated the White House might adopt a different approach to coronavirus testing after he was asked why he thinks the U.S. tests too much. He did not offer any specifics. â\u0080\u009cThere comes a point when you want to focus your testing in a different way,â\u0080\u009d he said. â\u0080\u009cRight now the testing we are doing now is helpful, but we are spending massive amounts of money.â\u0080\u009d â\u0080¢ Trump said he might take executive action to prevent renters hurt by the pandemic from being evicted if a divided Congress doesnâ\u0080\u0099t agree to another financial-relief package soon for the economy. â\u0080\u009cPeople are being evicted unfairly. Itâ\u0080\u0099s not their fault. Itâ\u0080\u0099s Chinaâ\u0080\u0099s fault,â\u0080\u009d said the president, repeating a longstanding criticism of China for letting the virus spread to the rest of the world."}]}