{"article": [{"url": "https://www.marketwatch.com/story/tesla-stock-falls-after-third-quarter-deliveries-keep-demand-concerns-alive-2020-10-02", "published": 1601881400.0, "headline": "Tesla stock falls after third-quarter deliveries keep demand concerns alive", "body": "Tesla Inc. stock fell more than 5% Friday after the Silicon Valley car maker reported quarterly sales that were above Wall Street consensus and hit a record but failed to dispel concerns about the company’s longer-term goals. Tesla TSLA, +1.89% earlier Friday said it delivered 139,300 vehicles in the third quarter, compared with expectations of 137,000 vehicles, according to FactSet, a consensus that had stood at 140,000 in recent days. The company delivered 124,100 Model 3 and Model Y vehicles, 56% more than the year-ago quarter and compared with expectations for 117,300. It delivered 15,200 Model S and Model X vehicles, 100 vehicles shy of FactSet consensus. “These numbers are particularly impressive in a year when most auto makers are producing and delivering fewer vehicles,” said Karl Brauer, an analyst with iSeeCars.com. “With multiple factories coming online in the next year there’s every indication Tesla’s volume will continue to grow in 2021 and beyond.” Analyst Joseph Spak at RBC Capital had demand concerns for the near-term. “We do believe there could be some supply constraint, but bears may also point to some potential demand concerns,” Spak said. “Some of the early data we’ve seen in Europe suggests sales may be softer than we expected, and we continue to believe Model 3 sales in the US are down y/y (but Model Y helps U.S. demand).” At last week’s “Battery Day,” Chief Executive Elon Musk reiterated Tesla’s goal to sell about half a million cars this year, or 30% to 40% higher than 2019. To hit the low end of its goal, or some 478,000 vehicles, Tesla would need to deliver 159,000 vehicles, Spak said. “It’s not an unattainable goal, in our view, and is most likely dependent on the (Shanghai factory) rate continuing to increase and maybe some more efficiency out of (the Fremont, Calif., factory),” he said. “But getting to 500k ... seems increasingly difficult.” Dan Ives of Wedbush had a more optimistic take, saying that Tesla continues “to defy the bears given the dark global COVID economic backdrop.” Tesla hit “the high end of bullish whisper expectations for the quarter.” Ives pinned it on China being “a major source of strength this quarter.” The deliveries’ number “should translate into a nice EPS upside vs. the Street for 3Q with the profitability trajectory on an upward path moving forward.” The Friday stock weakness is “a knee-jerk reaction in a risk off tape this (morning) after a parabolic run in shares, although as the Street digests this eye popping number the stock should head higher over the coming days and weeks,” he said. Related:U.S. auto sales fall 9.7% in Q3, but the news isn’t all bad Tesla and Ford Motor Co. F, -1.36% were among the last auto makers to report deliveries on Friday. General Motors Co. GM, -0.15% on Thursday reported third-quarter deliveries that were 10% lower, highlighting strength in its retail sales of pickup trucks and SUVs. Ford said earlier Friday its third-quarter sales fell 4.9%. Car sales overall showed strength in September, with an annualized rate of 16.4 million units and above expectations for a third consecutive month. Inventory is still “tight,” and even tighter for trucks, analysts at Evercore ISI said. Retail sales “showed an encouraging trend of being roughly flat YoY while (fleet sales) positive rate-of-change trend improved again as well,” they said."}]}