{"article": [{"url": "https://www.marketwatch.com/story/stock-index-futures-edge-higher-after-thursday-decline-netflix-falls-premarket-2020-07-17", "published": 1595003420.0, "headline": "Dow closes lower though stocks post modest weekly gains, as investors track potential fiscal stimulus", "body": "Stocks eked out modest gains Friday as investors reacted to disappointing consumer sentiment data and gauged the potential for additional fiscal stimulus in the U.S. and Europe while COVID-19 cases continue to climb.What did major indexes do? The Dow DJIA, +0.56% closed at 26,671.95, down 62.76 points, or 0.23%, while the S&P 500 SPX, +0.87% added 9.16 points, or 0.28%, to close at 3,224.73. The Nasdaq Composite COMP, +1.39% gained 29.36 points, or 0.28%, ending the week at 10,503.19. The Dow on Thursday fell 135.39 points, or 0.5%, to close at 26,734.71, while the S&P 500 shed 10.99 points, or 0.3%, to close at 3,215.57. The Nasdaq finished at 10,473.83, down 76.66 points, or 0.7%. For the week, the Dow finished 2.3% higher, the S&P 500 booked a gain of 1.3%, and the Nasdaq lost 1.1%.What drove the market? Stocks gave up early gains to turn mixed after a U.S. consumer sentiment index fell to 73.2 in July from 78.1, compared with expectations for a reading of 78.6. “In short, the index weakened in early July as sentiment soured, no doubt reflecting a surge in virus cases that is once again restricting activity and clouding the outlook, especially as it relates to job prospects,” said Rubeela Farooqi, chief U.S. economist at High Frequency Economics, in a note. “Sentiment will likely remain subdued in the absence of a more substantial health response that will result in better virus containment and prevent repeated closures that will cause more permanent damage to the labor market,” she said. The U.S. posted a record of more than 70,000 new coronavirus cases in a single day Friday, the highest reported by any country since the start of the outbreak. The U.S. now has 3.58 million cases, or about a quarter of the global total, and 138,360 deaths. See: Coronavirus tally: Global cases of COVID-19 13.8 million, 590,401 deaths as U.S.sets global case record The continued rise in COVID-19 cases in the U.S. has been partly offset by optimism over scope for additional fiscal stimulus. The White House and lawmakers face increasing pressure to come up with an additional fiscal stimulus plan ahead of the expiration of supplemental unemployment benefits at the end of July. “Further fiscal stimulus could give the bull market fresh legs, with equities having already priced in the current unprecedented monetary policy support,” said Han Tan, market analyst at FXTM, in a note. Meanwhile, European Union leaders on Friday kicked off a two-day summit aimed at reaching an agreement on a €750 billion recovery fund. Read:European Union leaders say they are far apart on COVID-19 bailout deal “Should fiscal policy makers disappoint and deny stock bulls the fuel they desire, we could see the rapid erosion of gains from recent months,” Tan said. Meanwhile, the Federal Reserve on Friday announced it had expanded its Main Street Lending Program to include nonprofit organizations. In other U.S. economic data, U.S. housing starts came in at a 1.19 million seasonally adjusted annual rate in June, the Commerce Department said Friday, a 17% increase from May. Permits for newly-built homes rose 2.1% between May and June to a seasonally adjusted annual rate of 1.24 million. Housing starts nearly met the consensus forecast of economists polled by MarketWatch for a 1.2 million annual rate while permits fell slightly short of the consensus forecast of 1.3 million. “One of the ironies of this recession is that the weakest part of the economy in the previous recession — housing — is now one of the shining stars in an otherwise challenging year,” said Chris Zaccarelli, chief investment officer for Independent Advisor Alliance. Read:Here’s why all of the S&P 500’s gains since April came after the market closed: JP MorganWhich companies were in focus? Shares of Netflix Inc. NFLX, +1.43% fell 6.5%, with concerns over the second-half outlook overshadowing a jump in revenue and the addition of more than 10 million new subscribers to the video streaming service. Netflix shares have rallied 63% in the year to date. Read:Netflix promotes its Mr. Hollywood to co-CEO, showing importance of original content BlackRock Inc. BLK, +1.18% shares advanced 3.7% after reporting earnings and revenue that beat Wall Street expectations. Shares of cruise operators dropped after the Centers for Disease Control and Prevention extended a “no sail order” for cruise ships through September 2020 due to a surge in new COVID-19 cases.Shares of Norwegian Cruise Line Holdings Ltd. NCLH, +2.91% dropped 2.2%, Royal Caribbean Cruises Ltd. RCL, +2.59% shed 1.5% and Carnival Corp. CCL, +0.51% fell 1.9%. Tesla Inc. TSLA, +1.89% shares closed fractionally higher Friday after a split decision from the analyst community: Credit Suisse doubled its price target on the stock to $1400, or about $100 below current levels, while CFRA lowered its rating to sell. Berkeley Lights Inc. BLI, -0.74% Shares of shares surged on its first day of trading, suggesting upside of about 198% from its IPO pricing. Nio Inc. ADR NIO, +0.14% shares slid more than 14%, and it was one of the day’s most actively-traded securities, after a Goldman Sachs downgrade. Shares of Amazon.com Inc. AMZN, +3.01% closed 1.3% lower, and were off 7.4% for the week, marking the worst week for the stock since February 28. What did other markets do? The Shanghai Composite Index SHCOMP, +1.67% rose 0.1%, while the CSI 300 Index 000300, +2.04% gained 0.6%. Japan’s Nikkei 225 Index NIK, -0.11% rose 0.3%, while the Hang Seng Index HSI, -0.30% in Hong Kong gained 0.5%. The pan-European Stoxx 600 Europe Index SXXP, +0.55% closed up 0.2%, at 372.71, while London’s FTSE 100 Index UKX, +0.64% added 0.6% to close at 6,290.30. Bond yields rose, with the yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% up about two basis points to 0.63%. Bond yields and prices move in opposite directions. The ICE U.S. Dollar Index DXY, -0.58%, a measure of the U.S. currency against a basket of six major rivals, fell 0.4%. August West Texas Intermediate oil US:CLQ20 fell 16 cents, or 4%, to settle at $40.59 a barrel on the New York Mercantile Exchange. Gold GC00, +2.17% edged 0.5% higher to settle at $1,810. Read next:Stock-market risks for remainder of 2020 ‘are completely to the downside,’ says BofA analyst"}]}