{"article": [{"url": "https://www.marketwatch.com/story/intel-stock-savaged-as-next-gen-chip-delay-prompts-loss-of-confidence-from-wall-street-2020-07-24", "published": 1595680400.0, "headline": "Intel stock savaged as next-gen chip delay expected to be 'increasingly painful' to chip maker", "body": "Intel Corp.'s stock logged one of its worst days in 20 years Friday after the chip giant divulged that its next generation of chips would be delayed and that it may seek a third-party manufacturer to make them, handing a huge win to smaller rival Advanced Micro Devices Inc. Intel INTC, -1.03%  shares closed down 16.2% at $50.59 Friday, after dropping below $50 for the first time in five months. The one-day drop was the stock's worst since March, when it finished down 18%, but that was amid a broader market rout when the S&P 500 index SPX, +0.87%  tanked 12% and the tech-heavy Nasdaq Composite Index COMP, +1.39%  had its worst day ever with a 12.3% dive. In comparison, the S&P 500 was only off 0.6% Friday, and the Nasdaq finished down 0.9%. Other than the March 16 rout, Intel shares have only seen worse days three other times over the past 20 years, two 18% drops in 2002 and a 22% drop in 2000. Late Thursday, Intel said it was delaying its 7-nanometer line of chips by at least six months because of a \"defect mode\" and that it may have to resort to a contingency plan of using \"somebody else's foundry\" to make them. In chip parlance, nanometers, or nm, refers to the size of the transistors that go on a computer chip, with the general rule being that smaller transistors are faster and more efficient in using power. As a result, shares of AMD AMD, -3.94%, which already sells 7-nm chips, soared 16.5% to close at a record $69.40, only the second time AMD has ever closed at a higher stock price than Intel. Meanwhile, American depositary receipts of Taiwan Semiconductor Manufacturing Co. TSM, +1.11%, which makes AMD's chips, rallied 9.7%. to close at $73.90. Intel, on Friday, shed $41.54 billion in market capitalization, putting it far behind Nvidia Corp. NVDA, -0.54%  in the previously close race for most valuable U.S. chip maker. Nvidia shares finished Friday up 0.6% at $407.78 for a market cap of $250.78 billion, versus Intel's $214.2 billion. For more: Intel admits another defeat with unprecedented manufacturing issues Wall Street responded to Intel's news with a slew of downgrades and stock price target cuts. Bernstein analyst Stacy Rasgon downgraded Intel to \"underperform\" from \"market perform\" after what he considered the worst Intel earnings call in the 45 he has covered. In Thursday's call, Intel brought \"the structural issues we have been talking about for years directly to the forefront,\" he said. \"From here we see things growing increasingly painful as 7-nm delays are likely to overshadow anything good they can put forth, while magnifying any negative events, all while they fight an existential conflict with themselves as they attempt to figure a way out of the hole they have dug,\" Rasgon said. Deutsche Bank analyst Ross Seymore also downgraded Intel, in this case to a hold from a buy, because the delay \"will foster fears of competitive pressures persisting, if not accelerating over the next 2-3 years and thereby cap the valuation on its shares.\" B of A Securities analyst Vivek Arya downgraded Intel to neutral from a buy and said the delay called into question the long-term competitiveness of Intel manufacturing process against foundry rivals TSMC and Samsung Electronics Co. 005930, -0.33%, which are \"making rapid progress.\" Arya said Intel's delay will likely return AMD market share back to its peak levels of 20% in PCs and 25% in servers, the likes of which haven't been seen since 2006. Susquehanna analyst Christopher Rolland, who has a neutral rating and cut his price target on Intel to $53 from $58, said Intel should just get out of the foundry business altogether since it has \"zero-to-no chance\" catching up to TSMC now. \"Given the new timeline, we believe it's near impossible for Intel to catch/surpass TSM in the next half decade, accelerating competitive pressures (AMD),\" Rolland said. \"While not probable, we believe it makes sense for Intel to sell some of their leading-edge fabs to TSM, given the fungibility of Intel's state-of-the-art fabs/equipment.\" \"Yes, It's That Bad,\" was the title of Cowen analyst Matthew Ramsay's note on Intel. Ramsay has a market perform rating and a $55 price target, down from $60. \"Road map uncertainty on 7-nm (both timing and in/out-sourcing manufacturing strategy) will leave Intel's customers and investors frustrated and simultaneously ensure that the company cannot catch TSMC-enabled competitors' (namely AMD and Nvidia) silicon process leadership in any bounded time frame as it stands now,\" Ramsay said. Jefferies analyst Mark Lipacis, who has a hold rating and a $62 price target, said there may be a bright side to Intel's news, in that it may force the company to rethink how it is structured. Lipacis said back in January \"we argued that Intel's transistor lead was lost for good and that by going fabless it would turn into a cash flow and capital return machine, which would add $19 to the stock.\" \"We actually are more constructive on the stock as we think 7nm delays will force management to outsource and restructure,\" Lipacis said. Of the 41 analysts who cover Intel, 12 have overweight or buy ratings, 20 have hold ratings, and nine have sell ratings, after two other analysts downgraded Intel, according to FactSet data. At least 16 analysts cut their price target on the stock, resulting in an average target price of $59.55, down from a previous $64.82, according to FactSet. For the year, Intel shares are down 15.5%, compared with a 7.3% decline in the Dow Jones Industrial Average DJIA, +0.56%, of which it is a component. In comparison, the S&P 500 is down 0.5% for the year, while the Nasdaq is up 15.5% and the PHLX Semiconductor Index SOX, +1.77%  is up 10.2%. AMD shares are up 51% on the year, while Nvidia shares are up 73%."}]}