{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-rise-as-traders-brace-for-jobs-report-2020-09-04", "published": 1599234920.0, "headline": "10-year Treasury yield sees biggest daily pop since mid-May as traders make room for next weekâ\u0080\u0099s debt supply", "body": "U.S. Treasury yields climbed on Friday after the August official employment report showed more job gains and a sharper drop in the jobless rate than expected, easing concerns that the labor market recovery was in danger of stalling. Traders are also anticipating next weekâ\u0080\u0099s $108 billion wave of coupon-bearing debt auctions. The U.S. bond market will be closed next Monday in observance of the Labor Day holiday.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% Â rose 9.9 basis points to 0.720%, marking its biggest daily jump since May 18, but was virtually unchanged this week. Meanwhile, the 2-year note rate TMUBMUSD02Y, 0.156% Â rose 2.4 basis points to 0.149%, leaving it 1.4 basis point higher for the week. The 30-year bond yield TMUBMUSD30Y, 1.576% Â climbed 12.7 basis points to 1.468%, its largest such jump since May 18. The long bond rate fell 4 basis points for the week. Bond prices move inversely to yields.Whatâ\u0080\u0099s driving Treasurys? The bond market came under intense pressure after the Labor Department reported the U.S. economy had added 1.37 million jobs in August, above the 1.2 million predicted by MarketWatch-polled economists. The unemployment rate tumbled to 8.4% from 10.2%. The recovery in the labor market is seen pushing longer term yields higher as they are the maturities most sensitive to economic growth and inflation expectations. Household spending has historically been an important driver of U.S. economic growth. Read: â\u0080\u0098Whatâ\u0080\u0099s concerning is that the pace of jobs growth is slowing downâ\u0080\u0099 â\u0080\u0094 economists react to August jobs report Even as the stock-market has showed a soft tone since Thursday, bonds havenâ\u0080\u0099t rallied in the way portfolio managers have expected. Market participants say that may be because bond yields were expected to back up ahead of next weekâ\u0080\u0099s debt auctions as broker-dealers look to price in a â\u0080\u009cconcession,â\u0080\u009d bidding yields higher to attract bond buyers for the sales. Primary dealers, the middlemen of the U.S. Treasury market, want to ensure a successful auction to limit the amount of bonds they pick up at the sale, as part of their obligation of bidding at every government bond auction. What did market participantsâ\u0080\u0099 say? â\u0080\u009dBecause of the positive tone from the jobs report, we should get higher rates at the back of the curve,â\u0080\u009d said Patrick Leary, chief market strategist at Incapital, in an interview. He added longer-dated Treasurys were also coming under pressure ahead of next weekâ\u0080\u0099s round of auctions. â\u0080\u009cWe are still moving in the right direction and the pace of the jobs recovery seems to have picked up, but it still looks like it will take a while â\u0080\u0093 and likely a vaccine â\u0080\u0093 before we get back close to where we were at the beginning of this year,â\u0080\u009d said Tony Bedikian, Head of Global Markets at Citizens Bank."}]}