{"article": [{"url": "https://www.marketwatch.com/story/weekend-reads-juneteenth-and-economic-fairness-2020-06-19", "published": 1592640980.0, "headline": "Weekend reads: Juneteenth and economic fairness", "body": "Juneteenth was June 19, 1865, when slaves in Galveston, Texas, were set free, more than two years after President Lincoln’s Emancipation Proclamation took effect on Jan. 1, 1863. It is also known as Freedom Day and is an official holiday in Texas. • Julian Agyeman and Kofi Boone point out that black people in the U.S. own less land than they did 100 years ago and suggest what may be done about it. • Anne Price looks at structural racism and a possible economic solution. • Andrew Keshner identifies three ways the tax code amplifies the racial wealth gap. • Jillian Berman explains the connection between the current racial wealth gap and the 1921 massacre in Tulsa, Okla., that destroyed a prosperous black business district and left up to 300 people dead. • Amazon.com AMZN, +3.01% CEO Jeff Bezos urged employees to cancel meetings on June 19 and learn about structural racism instead. MarketWatch photo illustration/Getty Images, iStockphoto The first 100 days of the COVID-19 pandemic It has now been 100 days since the World Health Organization declared the coronavirus outbreak a pandemic on March 11. • Quentin Fottrell lists five mistakes that created a tremendous public-health crisis. • Jaimy Lee explains what we now know and still don’t know about the coronavirus. • Here’s a by-the-numbers look at how people and businesses have been affected by COVID-19. • This coronavirus recovery tracker has the latest data as the U.S. economy reopens. • Here are what Americans splurged on during the first 100 days of the pandemic. • Here are lists of the best and worst performing stocks of the pandemic.The Wirecard scandal — where’s the €2 billion? This week another big corporate financial scandal (following Luckin Coffee’s US:LK accounting ‘misconduct’) hit home, as Wirecard WDI, -3.34% CEO Markus Bruan resigned a day after the German payments processor said nearly €2 billion of its cash was missing. Related: This fund manager whose biggest short was Wirecard says he is the most bullish toward stocks since 2009 Outside Bozeman, Mt. courtesy Bozeman CVB More places where you might live when you retire Following last week’s look at possible retirement destinations for a man on a fixed budget who wants to be close to nature, Silvia Ascarelli helps a reader who wants to move to a rural area with four seasons and away from New York state.A big bullish sign for the stock market Mark Hulbert explains how the “single greatest predictor” of stock-market performance is pointing to a broad, long-term bull market in the U.S.Father’s Day advice for men Learn how the women in your life make financial decisions. Suze Orman. AFP via Getty Images Suze Orman’s advice on IRAs may not be right for you Suze Orman says everyone should opt for a Roth IRA instead of a traditional IRA. Here’s why her advice may not be best for your particular set of circumstances.A COVID-19 vaccine before November is possible — here’s what that would mean for investors Michael Brush says the real stock-market winners following the quick approval of a vaccine wouldn’t be the companies developing the vaccines, because investors have already jumped on then. Here are his expected stock-market winners after a vaccine is approved. More from Michael Brush: • Robinhood traders could learn from this growth-stock investor who’s beaten indexes by a wide margin for years • Rebuilding America paves the way for potential gains in these construction and engineering stocksA big tech stock to buy, and one not to buy Charles Lemonides of ValueWorks recommends a big tech stock that hasn’t rallied along with the sector this year and names a competitor investors should avoid. Want more from MarketWatch? Sign up for this and other newsletters, and get the latest news, personal finance and investing advice."}]}