{"article": [{"url": "https://www.marketwatch.com/story/why-joe-bidens-pick-of-kamala-harris-for-vice-president-wont-make-or-break-the-2020-election-2020-08-11", "published": 1597235060.0, "headline": "Why Joe Bidenâ\u0080\u0099s pick of Kamala Harris for vice president wonâ\u0080\u0099t make or break the 2020 election", "body": "Democratic presidential nominee Joe Biden has picked Sen. Kamala Harris as his vice presidential candidate. Hereâ\u0080\u0099s a reality check: Running mates have little direct effect on voters. When people go to the polls, they are primarily expressing a preference for the presidential candidate, not the second person on the ticket. MarketWatch on politics:Joe Biden picks Kamala Harris as his running mate In our new book, â\u0080\u009cDo Running Mates Matter?â\u0080\u009d my collaborator Kyle Kopko and I analyze half a century of political science survey data to examine what effect a running mate has on the success of presidential candidates. In general, voters are very unlikely to choose a presidential ticket simply because they like or dislike the second-in-command. Picking Jack Kemp, right, as his running mate didnâ\u0080\u0099t help 1996 Republican nominee Bob Dole win the election. J. David Ake/AFP via Getty Images On rare occasions, voters can be swayed by running mates who are much more â\u0080\u0094 or less â\u0080\u0094 popular than their partyâ\u0080\u0099s main candidate. For instance, John Kerryâ\u0080\u0099s vice presidential candidate in 2004, former North Carolina Sen. John Edwards, was relatively popular with voters early in the campaign. And, as our research shows, Edwardsâ\u0080\u0099 popularity made voters more likely to vote for Kerry, at least in the short term. Some political analysts believe a vice presidential selection could draw key voters from that personâ\u0080\u0099s own demographic group or their home state. We found that rarely happens, either. However, we found that voters view vice presidential choices as new information about the main candidate â\u0080\u0094 and that information can shift votersâ\u0080\u0099 views and change votes. The candidateâ\u0080\u0099s choice gives voters insight into who the candidate really is, what he or she stands for and how the person might operate once in office. Take the 2008 presidential election, for example, when Democrat Barack Obama ran against Republican John McCain with Joe Biden and Sarah Palin as their respective vice presidential nominees. In our book, we demonstrate that voters who doubted Palinâ\u0080\u0099s qualifications also were more likely to doubt McCainâ\u0080\u0099s judgment and think he was too old to be president. As a result, they were less likely to vote for McCain. John McCain, right, picked Sarah Palin, second from left, as his running mate in 2008. Rachael Dickson/Wikimedia Commons, CC BY Conversely, our analysis also showed that voters who believed Biden was well qualified for office were more likely to approve of Obamaâ\u0080\u0099s judgment â\u0080\u0094 and less likely to think he was too young to be president. As a result, they were more likely to vote for Obama. In 2020, Joe Biden is already well known as an experienced former vice president, so itâ\u0080\u0099s unlikely his running mate will outshine him on her own. But with this choice, Biden has a valuable opportunity to define himself as a candidate â\u0080\u0094 and a potential president â\u0080\u0094 in his own right. What does he really stand for? What are his political priorities? And does he have the good judgment to be president? Bidenâ\u0080\u0099s selection of Harris will help voters to answer these questions â\u0080\u0094 and to decide whether he deserves their support in November. Christopher J. Devine is an assistant professor of political science at the University of Dayton, in Dayton, Ohio. This article was published with the permission of The Conversation."}]}