{"article": [{"url": "https://www.marketwatch.com/story/the-stock-market-is-tracing-an-important-reversal-pattern-that-you-should-watch-2020-06-15", "published": 1592295320.0, "headline": "The stock market is tracing an important reversal pattern that you should watch", "body": "Investors are getting concerned about the coronavirus again. They’re now worried after frenzied stock buying by the momo (momentum) crowd, who essentially ignored the deadly virus. In the U.S., cases are increasing in many states. There’s an important technical pattern in the stock market called an island reversal. This one is ominous. Offsetting this negativity is the Federal Reserve’s full-tilt stimulus. Read:A portfolio of stocks being bought by mom-and-pop investors is trouncing Wall Street pros — here’s what they’re buying Let’s explore this pattern with the help of a chart.Chart Please click here for an annotated chart of the Dow Jones Industrial Average ETF DIA, +0.57%, which tracks the Dow Jones Industrial Average DJIA, +0.56%. Note the following: • The chart shows that an island was formed by two gaps, one on the left and one on the right. • The chart shows an Arora sentiment indicator was giving sell signals throughout the formation of the island. (This indicator reached an extreme positive zone during this period.) Sentiment at extremes is a contrary indicator. In plain English, when sentiment becomes extremely positive, it is a sell signal. It is important to note that some publicly available indicators work well, while others do not. In general, we have found that publicly available sentiment indicators do not work well, hence the need for proprietary indicators. • The chart shows that on the last two days of the island, the smart money — professionals — was selling. • The chart shows an inside day occurred the day after the island reversal. Further during this inside day, the candle is red. In plain English, this means that the close was below the open in the stock market. • The chart shows that the stock market is opening up lower after the inside day. • If the inside day did not occur, it could have nullified the negative implications. • The chart shows that the volume was very high on the day when the gap was formed on the right side of the chart. This adds to negative potency of the pattern. • The chart shows that RSI (relative strength index) reached 95 when the island was being formed. This was an extremely overbought level. • The chart shows that while the island was being formed and prior to the stock market falling, RSI gave a sell signal when it crossed below the moving average shown on the chart. • In a pane below the volume, the chart shows the S&P 500 ETF SPY, +0.89%, which tracks the benchmark S&P 500 Index. The pattern in the S&P 500 is the same as in the Dow Jones Industrial Average. It is important for investors to confirm the pattern by looking at different indices. • The late stages of the rally have been characterized with strong up moves in travel-related stocks such as airline stocks and cruise-line stock. • The chart shows American Airlines AAL, +0.34% stock tracing a less ominous pattern. The same is the case with other airlines such as United Airlines UAL, +0.32% and Spirit Airlines SAVE, +1.35%. • The chart shows Carnival CCL, +0.51% is tracing a pattern that is less ominous. A similar pattern is being shown by Royal Caribbean RCL, +2.59% and Norwegian Cruise Line NCLH, +2.91%. • Investors have been hiding in the five big tech stocks of Apple AAPL, +1.74%, Amazon AMZN, +3.01%, Microsoft MSFT, +2.48%, Alphabet GOOG, +1.97% GOOGL, +1.82% and Facebook FB, +0.26%. The patterns in these stocks are nowhere near as ominous as in the Dow Jones Industrial Average and S&P 500.Putting it all together Where many investors go wrong with technical analysis is that they do not put in the time and effort needed to learn it. It takes years to get good at it. In this case, it is not just the island reversal pattern, but also the following that are important: • The size of the gaps. • The location of the island — in this case after a very strong rally. • The day after the island is formed and the subsequent day. • RSI during the time the island is formed. • Sentiment during the time the island is formed. • The height of the island — tall islands give stronger signals than shallow islands. • Volume. • Duration of the island and many more factors. Due to the Fed’s actions, more data points are needed before making any definitive conclusions. Make no mistake — the market still believes that the Fed is providing a backstop. The most likely scenario is rampant speculation in the stock market due to the Fed’s actions. Under these conditions, it is important for investors to bring sophistication to their investing and trading. Consider following protection-band criteria. Please read, “Rampant speculation in the stock market — you ain’t seen nothing yet. Thank the Federal Reserve.” Disclosure: Arora Report portfolios have positions in Apple, Amazon, Alphabet, Microsoft and Facebook. Nigam Arora is the founder of The Arora Report, which publishes four newsletters. He can be reached at Nigam@TheAroraReport.com."}]}