{"article": [{"url": "https://www.marketwatch.com/story/fauci-hits-back-at-white-house-after-criticism-by-trumps-trade-adviser-it-doesnt-do-anything-but-reflect-poorly-on-them-2020-07-15", "published": 1594922900.0, "headline": "USA Today says Peter Navarroâ\u0080\u0099s op-ed criticizing Fauci was â\u0080\u0098misleadingâ\u0080\u0099 and did not meet â\u0080\u0098fact-checking standardsâ\u0080\u0099", "body": "Just when the war of words between Anthony Fauci and the Trump administration edged closer to a detente, it suddenly took a turn for the worse. The fractured relationship between President Donald Trump and Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases for three decades and a leading expert on pandemics in the U.S. for four decades, reached a new low Wednesday. The latest shot: USA Today on Wednesday published an op-ed by White House trade adviser Peter Navarro that took aim at Fauci. “ â\u0080\u0098I just want to do my job. Iâ\u0080\u0099m really good at it. I think I can contribute. And Iâ\u0080\u0099m going to keep doing it.â\u0080\u0099 ” â\u0080\u0094 Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases Navarro said of Fauci: â\u0080\u009cHe has been wrong about everything I have interacted with him on. In late January, when I was making the case on behalf of the president to take down the flights from China, Fauci fought against the presidentâ\u0080\u0099s courageous decision â\u0080\u0094 which might well have saved hundreds of thousands of American lives. When I warned in late January in a memo of a possibly deadly pandemic, the director of the National Institute of Allergy and Infectious Diseases was telling the news media not to worry.â\u0080\u009d The White House said the op-ed was not cleared before publication, and USA Today said Navarroâ\u0080\u0099s op-ed did not meet its standards. The deterioration in the what was once an appearance of unity â\u0080\u0094 however fragile â\u0080\u0094 is likely far from over, as moves by Trump to fire Fauci would likely be met with a backlash by the public and the medical community, and would also be subject to appeals, experts say. Starting in February, Trump said that the coronavirus would â\u0080\u009cdisappear,â\u0080\u009d â\u0080\u009cfade awayâ\u0080\u009d and/or â\u0080\u009cgo awayâ\u0080\u009d more than a dozen times. Late Wednesday, Bill Sternberg, USA Today editorial page editor, wrote in a note at the top of the op-ed: â\u0080\u009cSeveral of Navarroâ\u0080\u0099s criticisms of Fauci â\u0080\u0094 on the China travel restrictions, the risk from the coronavirus and falling mortality rates â\u0080\u0094 were misleading or lacked context. As such, Navarroâ\u0080\u0099s op-ed did not meet USA Todayâ\u0080\u0099s fact-checking standards.â\u0080\u009d He added, â\u0080\u009cWe dealt directly with Navarro and do not know whether he spoke to anyone else at the White House about his statement.â\u0080\u009d President Donald Trump and Fauci. Fauci visited the White House on Monday, but has not briefed the president since June 2. MarketWatch photo illustration/Getty Images Related: Hereâ\u0080\u0099s one â\u0080\u0098remarkableâ\u0080\u0099 difference between COVID-19 and the 1918 Spanish flu Fauci dismissed the op-ed by Navarro, telling the Atlantic: â\u0080\u009cI just want to do my job. Iâ\u0080\u0099m really good at it. I think I can contribute. And Iâ\u0080\u0099m going to keep doing it.â\u0080\u009d When asked how he can continue to when the government appears to be actively trying to discredit him, this time by a senior White House figure, Fauci replied: â\u0080\u009cThat is a bit bizarre.â\u0080\u009d He said that such attacks would backfire on the Trump administration: â\u0080\u009cIt doesnâ\u0080\u0099t do anything but reflect poorly on them. I cannot figure out in my wildest dreams why they would want to do that.â\u0080\u009d Fauci said of Navarro: â\u0080\u009cHeâ\u0080\u0099s in a world by himself.â\u0080\u009d In a separate interview with Stanford Medicineâ\u0080\u0099s Dean Lloyd Minor, Fauci took another swipe at the governmentâ\u0080\u0099s response and said there is a way to flatten the curve of new cases. â\u0080\u009cWe know that we can do that if we shut down. The Europeans have done it. People in Asia have done it. We did not shut down entirely.â\u0080\u009d Contrary to the presidentâ\u0080\u0099s insistence that itâ\u0080\u0099s time to get the countryâ\u0080\u0099s economy up and running again, Fauci paints a darker picture: â\u0080\u009cItâ\u0080\u0099s happened â\u0080\u0094 your worst nightmare, the perfect storm. We havenâ\u0080\u0099t even begun to see the end of it yet. Itâ\u0080\u0099s still globally threatening.â\u0080\u009d Fauci, meanwhile, told the Financial Times that he has not briefed the president since June 2. After the doctor criticized the U.S. response to the pandemic and Trump criticized the doctor, Fauci on Monday made a low-key visit to the White House to meet with Mark Meadows, the White House chief of staff. It came a day after the administration released a list to the Washington Post that contained criticisms of the doctor, and signaled a further souring of relations between Fauci and the Trump administration. “ â\u0080\u0098He has been wrong about everything I have interacted with him on.â\u0080\u0099 ” â\u0080\u0094 White House trade adviser Peter Navarro criticizing Fauci in an op-ed in USA Today that the paper said contained inaccuracies and did not live up to its editorial standards That list included comments made by Fauci in the early days of the pandemic about how he was not immediately worried about asymptomatic spreading and how Americans didnâ\u0080\u0099t need to wear masks. It was described by some reporters as â\u0080\u009copposition research,â\u0080\u009d a description that the White House has flatly denied. The Centers for Disease Control and Prevention originally told the public not to wear masks, but along with the Trump administration, reversed that policy in April. But the backlash to that â\u0080\u009clistâ\u0080\u009d was swift. On Tuesday, Thomas File, Jr., president of the Infectious Diseases Society of America, released a statement on behalf of his colleagues throwing their support behind Fauci. â\u0080\u009cThe only way out of this pandemic is by following the science, and developing evidence-based prevention practices and treatment protocols as new scientifically rigorous data become available. Knowledge changes over time. That is to be expected. If we have any hope of ending this crisis, all of America must support public health experts, including Dr. Fauci, and stand with science.â\u0080\u009d On Sunday, Adm. Brett Giroir, the testing coordinator at the Department of Health and Human Services, told NBCâ\u0080\u0099s â\u0080\u009cMeet the Pressâ\u0080\u009d that Fauci was not correct in his advice to states to slow down the opening of businesses: â\u0080\u009cI respect Dr. Fauci a lot, but Dr. Fauci is not 100% right, and he also doesnâ\u0080\u0099t necessarily, he admits that, have the whole national interest in mind. He looks at it from a very narrow public-health point of view,â\u0080\u009d Giroir said. Last week, Trump also doubled down on his criticism of Fauciâ\u0080\u0099s response to the pandemic. â\u0080\u009cDr. Fauci's a nice man, but heâ\u0080\u0099s made a lot of mistakes,â\u0080\u009d he said on Sean Hannityâ\u0080\u0099s Fox News show. â\u0080\u009cLike you donâ\u0080\u0099t have to ban them coming in from very infected China. I did it anyway and we saved hundreds of thousands of lives.â\u0080\u009d He added, â\u0080\u009cTheyâ\u0080\u0099ve been wrong about a lot things, including face masks,â\u0080\u009d he added. â\u0080\u009cMaybe theyâ\u0080\u0099re wrong, maybe not, but a lot of them said donâ\u0080\u0099t wear a mask, donâ\u0080\u0099t wear a mask. Now they are saying wear a mask. So a lot of mistakes were made â\u0080\u0094 a lot of mistakes.â\u0080\u009d “ â\u0080\u0098Dr. Fauci is not 100% right, and he also doesnâ\u0080\u0099t necessarily, he admits that, have the whole national interest in mind.â\u0080\u0099 ” â\u0080\u0094 Adm. Brett Giroir, the testing coordinator at the Department of Health and Human Services â\u0080\u009cWhen you compare us to other countries, I donâ\u0080\u0099t think you can say weâ\u0080\u0099re doing great. I mean, weâ\u0080\u0099re just not,â\u0080\u009d Fauci told the FiveThirtyEight podcast last week, which appears to have been taken by the White House as a direct rebuke of the president. Most voters said they approved of Fauci, although the majority of Republicans said so by a whisker, according to a New York Times/Siena College poll of 1,337 registered voters from June 17 to June 22. Overall, 67% of voters said they approved of the doctor, including 81% of Democrat, 51% of Republicans and 67% of Independents. On April 3, the administration and the Centers for Disease Control and Prevention reversed their policies on masks, and said everyone â\u0080\u0094 not just medical workers, as they previously said â\u0080\u0094 should wear face coverings. That same day, Trump said his administration recommended wearing cloth face coverings. However, he said he wouldnâ\u0080\u0099t wear a mask himself. â\u0080\u009cYou donâ\u0080\u0099t have to do it. Iâ\u0080\u0099m choosing not to do it.â\u0080\u009d In a rare break with his tradition of eschewing any face covering, he wore one last weekend while visiting Walter Reed National Military Medical Center. Last April, Trump suggested a treatment for COVID-19: â\u0080\u009cI see the disinfectant, where it knocks it out in a minute. One minute. And is there a way we can do something like that, by injection inside or almost a cleaning?â\u0080\u009d He added, â\u0080\u009cSo, supposing we hit the body with a tremendous â\u0080\u0094 whether itâ\u0080\u0099s ultraviolet or just very powerful light.â\u0080\u009d The presidentâ\u0080\u0099s comments drew widespread criticism from health professionals and Reckitt Benckiser RBGPF, +0.93%, which makes Lysol and Dettol, and scorn on social media. The next day, Trump said he was not being serious. â\u0080\u009cI was asking a question sarcastically to reporters like you just to see what would happen,â\u0080\u009d he said. COVID-19, the disease caused by the virus SARS-CoV-2, had infected at least 13.6 million people globally and 3.5 million in the U.S. as of Thursday evening. It had killed 586,423 people worldwide and 138,072 in the U.S. Fauci also said Wednesday that easing social-distancing requirements and reopening the economy too soon could ultimately cost even more lives: â\u0080\u009cWe know statistically that youâ\u0080\u0099re going to infect someone else, who then is going to infect someone else, who then all of a sudden youâ\u0080\u0099re going to infect somebody who gets sick and goes to the hospital.â\u0080\u009d Calling for the nationâ\u0080\u0099s schools to reopen, Trump suggested the exact opposite: â\u0080\u009cYouâ\u0080\u0099re losing a lot of lives by keeping things closed.â\u0080\u009d How COVID-19 is transmitted"}]}