{"article": [{"url": "https://www.marketwatch.com/story/skyrocketing-covid-19-cases-around-the-us-slows-dine-in-restaurant-recovery-2020-07-06", "published": 1594138640.0, "headline": "Skyrocketing of COVID-19 cases around the U.S. slows dine-in restaurant recovery", "body": "Soaring cases of COVID-19 around the U.S. drove a week-over-week slowdown at casual-dining restaurants, according to data provided by Bernstein. Casual-dining brands include Darden Restaurants Inc.’s DRI, -1.34% Olive Garden chain and Dine Brands Inc.’s DIN, +4.14% Applebee’s and IHOP brands. The U.S. has now tallied 2.89 million cases of COVID-19, the highest in the world. U.S. deaths from the pandemic are nearly 130,000. Over the past two weeks, the number of cases in the U.S. has climbed in 38 states, with Florida, Idaho and Montana in the lead. Read:Goldman Sachs cuts 2020 U.S. economy’s growth outlook as COVID-19 cases soar Spending growth was down 13% on a week-over-week basis, according to Bernstein’s July 6 report, compared with a 10% decline the previous week. Other restaurant categories saw increases, including quick-service restaurants like McDonald’s Corp. MCD, -0.43% and Wendy’s Inc. WEN, +2.20% (up 7% versus a 9% rise the previous week) and coffee vendors such as Starbucks Corp. SBUX, +0.53% and Dunkin’ Brands Inc. DNKN, +1.26% (up 2% compared with a 7% rise the week before). These sorts of restaurants do a good deal of their business via drive-through and takeaway. “Lower casual-dining restaurant ticket is consistent with more customers avoiding eating at restaurants due to the spike in COVID cases in states/cities that recently reopened, as dine-in occasions have higher attach rates for beverages and desserts,” the Bernstein report said. Immediately before the most recent spike, UBS analysts highlighted shifting restaurant sales as dining rooms reopened. After speaking with franchisees across fast-food, casual-dining and fast-casual chains, analysts said the average check at fast-food restaurants was starting to “normalize,” something that even increased traffic hadn’t been able to offset. “Late-night sales are gradually returning, but sales at dinner have slowed, particularly in markets with a higher percentage of reopened casual-dining rooms,” the report said. Continued growth in casual dining would be based on, among other factors, the desire to eat out at a restaurant and capacity limitations imposed by state and local authorities, according to the June 24 UBS report. Things have changed over the past two weeks. One restaurant sector that continues to grow is pizza, with Bernstein data showing 43% spending growth during the most recent week, versus 39% the previous week. Pizza chains Papa John’s International Inc. PZZA, -1.18% and Domino’s Pizza Inc. DPZ, -2.50% are poised to gain even more as the pandemic continues. These chains were well-established for digital ordering and home delivery even before the onset of the coronavirus pandemic, and added contactless delivery after the outbreak. See:Papa John’s says April was its best month ever with pizza delivery and Papadia flatbreads boosting sales “Market-share opportunities for Domino’s and Papa John’s could come about as smaller chains and mom-and-pops/independents encounter what could turn out to be a higher rate of permanent closures as 2020 progresses,” wrote Mark Kalinowski, president of Kalinowski Equity Research. Kalinowski says mom-and-pop pizza shops will suffer because they get a lot of their business from a dine-in crowd. Throughout the pandemic, MKM Partners analysts say Domino’s and Papa John’s will continue to see solid results. “We believe their solid results have helped management remain focused on go-forward strategies (including menu initiatives), which could continue to see the brands generate strong sales results, despite the growing access to dine-in options,” Brett Levy, MKM executive director, wrote. Ease, convenience and value will continue to work in favor of both pizza chains. Don’t miss:McDonald’s puts reopening plans on hold as coronavirus cases rise MKM rates both Domino’s Pizza and Papa John’s stocks neutral. Domino’s has a $350 fair-value estimate, in MKM’s view, and Papa John’s fair-value estimate is $74. The Invesco Dynamic Leisure and Entertainment ETF PEJ, +0.09% has fallen 35.2% for the year to date while the S&P 500 index SPX, +0.87% is down 2.6% in 2020."}]}