{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-edge-higher-but-kick-off-august-on-an-unsteady-note-as-traders-brace-for-opec-output-boost-2020-08-03", "published": 1596470360.0, "headline": "Oil prices end higher after upbeat readings on manufacturing activity outweigh jitters over coronavirus, OPEC+ output boost", "body": "Oil futures ended solidly higher Monday following a round of upbeat readings on manufacturing activity, though some traders see upside limited as OPEC and its allies relax curbs on output and the number of COVID-19 cases continue to rise. West Texas Intermediate crude for September delivery CL.1, -1.62% added 74 cents, or 1.8%, to settle at $41.01 a barrel on the New York Mercantile Exchange, while October Brent crude BRN00, -0.07% rose 63 cents, or 1.5%, to finish at $44.15 a barrel on ICE Futures Europe. Oil added to early gains after the Institute for Supply Management said its manufacturing index rose to 54.2 in July from 52.6 a month earlier, its highest level in 15 months and above the consensus forecast of 53.6. A reading above 50 indicates an expansion in activity, but senior executives warned that production remains well below pre-pandemic levels and that many jobs won’t be coming back soon. The Organization of the Petroleum Exporting Countries and its allies, a group known as OPEC+, agreed in early July to relax output curbs beginning in August. OPEC+ pledged to cut output by 9.7 million barrels a day beginning in May, easing to 7.7 million barrels a day this month and running through the end of the year. Countries that exceeded the earlier curb are supposed to further curtail output, which means output is targeted to rise by around 1.5 million barrels a day beginning this month, though skeptics doubt that past violators of such agreements will fully comply. “Investors are worried that the production increase will reverse the recent price recovery in oil, especially as coronavirus cases continue to rise world-wide and energy demand remains subdued,” said Mihir Kapadia, chief executive of Sun Global Investments, in a note. Oil ended last week on a positive note, leaving WTI with a monthly rise of around 2.6% for July, while Brent rose more than 5% for the month. New COVID-19 cases rose to 4.67 million in the U.S., with the death toll rising to 154,860, according to data aggregated by Johns Hopkins University on Monday. New daily cases have increased in the past week in 13 states, the data show, and 13 states have seen more than a double-digit percentage of tests turn out positive for COVID-19. Dr. Deborah Birx, the White House coronavirus task force coordinator, on Sunday warned that the pandemic had entered a “new phase.” In other energy trading, September natural-gas futures US:RBU20 surged 30.2 cents, or 16.8%, to end at $2.1010 per million British thermal units. The rally was the biggest one-day percentage rise for natural gas since Nov. 14, 2018, while the close was the highest since May 5, according to Dow Jones Market Data. Natural gas jumped after forecasts pointed to warmer weather than previously indicated for mid-August, wrote analysts at Tradition Energy, in a Monday note. “Weather forecasts, after the next five days of below-normal temperatures across a large swath of the central U.S. and above-normal temps across the Northeast and Texas, have shifted warmer to above-normal temperatures across much of the country in both the six-to-ten and 11-15 day forecast periods,” they noted. Analysts said other factors were also at play. “While forecasts for warmer weather in August are in part to blame, the bigger story is flagging production and a bump in LNG (liquefied natural gas) feedgas demand,” said Luke Jackson, North America natural gas analysis lead at S&P Global Platts Analytics. “We remain bullish on prices given these tightening fundamentals.” September gasoline US:RBU20 gained 4.2 cents per gallon, or 3.6%, to end at $1.2131 a gallon, snapping a five-day losing streak. September heating oil US:HOU20 rose 1.69 cents, or 1.4%, finishing at $1.2409 a gallon."}]}