{"article": [{"url": "https://www.marketwatch.com/story/ohio-governor-mike-dewine-tests-positive-for-virus-ahead-of-trump-visit-2020-08-06", "published": 1596752900.0, "headline": "Ohio Gov. Mike DeWine tests negative after positive result ahead of Trump visit", "body": "COLUMBUS, Ohio — Ohio Gov. Mike DeWine tested negative for COVID-19 on Thursday after testing positive earlier in the day before he was to meet with President Donald Trump, according to a statement from his office. His wife, Fran DeWine, also tested negative, as did staff members. They underwent a different type of test in Columbus; one considered to be more accurate than the rapid-result test which showed DeWine to be positive for COVID-19 just ahead of a planned meeting with Trump in Cleveland. DeWine, an early advocate among Republicans of wearing masks and other pandemic precautions, said he took a test arranged by the White House in Cleveland as part of standard protocol before he was to meet Trump at an airport. He had planned to join the president on a visit to the Whirlpool Corp. WHR, +0.60% plant in northwest Ohio. Instead, he received the news he was positive, called his wife, Fran DeWine, and returned to central Ohio where he took the other test that showed him to be negative. “A big surprise to me and certainly a big surprise to our family,” DeWine said at a late afternoon news conference broadcast from his porch on his farm in Cedarville in southwestern Ohio, where he planned to quarantine for 14 days. Dewine, 73, said he didn’t know how he would have contracted the coronavirus and that he’s already been spending much of his time at his farm, keeping his distance from family members and staff. DeWine said he feels fine with no symptoms. His only health concern is asthma he’s had since he was a teenager, for which he uses an inhaler daily. He said he’d already received some “not nice texts” Thursday from people claiming the news proves that mask-wearing is pointless. “The lesson that should come from this is that we’re all human, this virus is everywhere, this virus is very tough,” DeWine said before the negative result. “And yes you can contract it even when you’re being very, very careful and even when you’re wearing a mask.” But, the governor said, “the odds are dramatically better” of avoiding a positive test if people wear a mask. DeWine, in his first term as governor, is one of Ohio’s most familiar politicians, previously serving as a U.S. congressman, two-term U.S. senator, Ohio attorney general and lieutenant governor. Trump offered DeWine his best wishes and said “he’ll be fine” in remarks after arriving at the airport, where he was greeted by Lt. Gov. Jon Husted, who tested negative. “A very good friend of mine just tested positive,” Trump said. He added that DeWine “has done a fantastic job.” Husted said he’s been talking with DeWine via teleconference for weeks, and doesn’t expect changes in that routine or other aspects of DeWine’s job. Trump’s visit to Ohio comes amid signs that he faces a tight race with former Vice President Joe Biden in a state he carried by 8 percentage points in 2016. DeWine was the second U.S. governor to test positive for the coronavirus after Oklahoma Gov. Kevin Stitt announced he contracted the virus last month. The number of positive cases in Ohio had decreased after the first surge, hitting a low in late May. But numbers again began to rise in mid-June as Ohio began to reopen businesses. More than 3,600 Ohioans have died. In recent weeks, DeWine has pleaded with Ohioans to take personal responsibility over the virus’ spread across the state. He had resisted a statewide mask mandate until July 23. DeWine’s first try at a statewide requirement for wearing masks inside businesses — back in April — drew backlash that led him to rescind that directive the following day, a stutter among the aggressive moves that had won him early praise in his efforts to curb the virus. Mask-wearing also has been a point of contention at the Statehouse, where many Democratic lawmakers have donned masks while many Republican lawmakers have not. DeWine has often found himself at odds with members of his own party on the policy. DeWine’s key health adviser during the pandemic, Dr. Amy Acton, left government this week. In the early months, she joined DeWine at daily briefings and was a popular figure. However, backlash against state restrictions helped lead to a protest at her home and her decision to step away from the spotlight. Since early in the pandemic, DeWine has hosted his daily briefings from a room separate from where the press corps gathers at the Ohio Statehouse. He would appear on a television in front of the reporters, who could step up to a microphone and ask questions. DeWine held one of those briefings Tuesday but no other public events had been announced for this week besides his meeting with Trump. DeWine said he planned to give a previously scheduled coronavirus update Friday. In at least two briefings, DeWine has shared how several friends had died from the virus, urging the public to think about their loved ones, especially grandparents. The governor has 23 grandchildren. Notably, DeWine and his wife had avoided political rallies or meeting with members of the White House since the pandemic began. In June, the governor was scheduled to appear at a former General Motors plant in Lordstown but decided against it when Vice President Mike Pence announced he was going. The facility is now occupied by Lordstown Motors, which plans to build electric pickup trucks there. “Quite candidly, throughout this pandemic, (first lady) Fran and I have avoided crowds,” DeWine said. “We have not gone out to be close with a lot of people. So we’re not going to do that.”"}]}