{"article": [{"url": "https://www.marketwatch.com/story/disney-slashes-ad-spending-on-facebook-amid-growing-boycott-2020-07-18", "published": 1595091440.0, "headline": "Disney slashes ad spending on Facebook amid growing boycott", "body": "Walt Disney Co. has dramatically cut its advertising spending on Facebook Inc., according to people familiar with the situation, the latest setback for the technology giant as it faces a boycott from companies upset with its handling of hate speech and divisive content. Disney DIS, +1.53% was Facebook’s FB, +0.26% top U.S. advertiser for the first six months of 2020, research firm Pathmatics Inc. estimates. It joins hundreds of other companies that have paused spending, including Unilever PLC UN, +2.49% , Starbucks Corp. SBUX, +0.53% , Ford Motor Co. F, -1.36% , Verizon Communication Inc. VZ, +0.23% and many small marketers. Civil-rights groups including the Anti-Defamation League and NAACP called on advertisers to pull ad spending for July, arguing Facebook hasn’t made enough progress enforcing its policies on hate speech and misinformation. The entertainment giant, which is concerned about Facebook’s enforcement of its policies surrounding objectionable content, has paused advertising of its streaming-video service Disney+, the people familiar with the situation said. Disney has promoted the service heavily this year and it makes up a substantial portion of the company’s spending on marketing. In the first half of this year, Disney spent an estimated $210 million on Facebook ads for Disney+ in the U.S., according to Pathmatics. Disney was the biggest ad spender during that period. Last year, it was the No. 2 Facebook advertiser in the U.S., behind Home Depot Inc. Disney also paused spending on Facebook-owned Instagram for its sister streaming service Hulu, a person familiar with matter said. Hulu spent $16 million on Instagram from April 15 to June 30, Pathmatics said. Other divisions of Disney are also re-examining their advertising on Facebook. Ads for ABC and Disney-owned cable networks such as Freeform have all but vanished from the site. While there are fewer shows to market during the summer, a person familiar with the matter said, it is unlikely that ads will return when new episodes need to be promoted, unless the social platform polices itself better. Disney representatives had no immediate comment. “We know we have more work to do,” Facebook said in a statement, adding that it would work with civil-rights groups, a leading ad trade group and other experts “to develop even more tools, technology and policies to continue this fight.” Facebook has said it invests billions of dollars to keep its platforms safe and has banned 250 white-supremacist organizations from Facebook and Instagram. It also has said artificial intelligence helps it find nearly 90% of hate speech before anyone flags it. Facebook has around $70 billion in annual advertising revenue, generated from over eight million advertisers. It would take a sustained boycott from its biggest advertisers to put a significant dent in the company financially. Some marketers are reducing ad spending broadly because of financial pressures caused by the coronavirus pandemic. Many brands prefer not to cut Facebook ad spending, because they regard it as an especially effective marketing vehicle. An expanded version of this story appears on WSJ.com."}]}