{"article": [{"url": "https://www.marketwatch.com/story/stocks-could-fall-a-further-7-after-last-weeks-correction-but-heres-why-morgan-stanley-says-its-healthy-2020-06-15", "published": 1592271380.0, "headline": "Stocks could fall a further 7% after last week's correction. But the bull market will 'resume in earnest', Morgan Stanley says", "body": "The three major benchmark indexes suffered their biggest weekly losses since March 20 last week, as the Federal Reserve's downbeat economic outlook and rising coronavirus cases unsettled investors. Fears of a second wave grew over the weekend and the Dow Jones Industrial Average DJIA, +0.56%  was 310 points lower, or 1.2%, in early trading. However, in our call of the day, Morgan Stanley said last week's correction was overdue and \"healthy\" and that the bull market would soon \"resume in earnest.\" \"We maintain our positive view for U.S. equity markets because it's early in a new economic cycle and bull market. Last week's correction was overdue and likely has another 5-7% downside. It's healthy and we are buyers into weakness with a small/mid-cap and cyclical tilt,\" the investment bank's strategists said. The team, led by equity strategist Michael Wilson, said corrections were \"normal\" after rapid moves higher and that last week's correction was overdue in what they described as a new cyclical bull market. The S&P 500 SPX, +0.87% could fall to 2,800, and the Nasdaq COMP, +1.39% to 8,500 \"before the bull market resumes in earnest,\" they added. Morgan Stanley's economists see this recession as being \"the steepest but also one of the shortest on record,\" and its strategists agree there will be a V-shaped recovery. \"The V-shaped recovery in markets is foreshadowing a V-shaped recovery in the economy and earnings. It's also following the 2009 pattern almost identically in many ways,\" they said. The team raised its base case S&P 500 price target through June 2021 to 3,350 from 3,000, also shifting its bull and bear cases higher - from 3,250 to 3,700 and from 2,500 to 2,900 respectively. High quality and growth stocks would still do well as the economy recovers but would struggle to keep up with more cyclical pockets of the markets, including automobiles and consumer durables, they said. The chart This chart from the U.K.'s Office for National Statistics shows that anxiety levels among people in Britain are higher than at the end of 2019 but have improved in recent months. Office for National Statistics. Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. Be sure to check the Need to Know item. The emailed version will be sent out at about 7:30 a.m. Eastern. Follow MarketWatch on Twitter, Instagram, Facebook."}]}