{"article": [{"url": "https://www.marketwatch.com/story/daughter-of-trump-voter-who-died-of-coronavirus-his-only-pre-existing-condition-was-trusting-donald-trump-2020-08-17", "published": 1597707980.0, "headline": "Daughter of Trump voter who died of coronavirus: â\u0080\u0098His only pre-existing condition was trusting Donald Trumpâ\u0080\u0099", "body": "“ â\u0080\u009cHis only pre-existing condition was trusting Donald Trump.â\u0080\u009d ” Those were the words of Kristin Urquiza, speaking Monday night as part of the virtual Democratic National Convention. Urquizaâ\u0080\u0099s 65-year-old father, Mark, died from COVID-19 in June, and her obituary for him went viral after she blamed President Donald Trump, Arizona Gov. Rob Ducey and other politicians for his death, and the deaths of tens of thousands of others. â\u0080\u009cHis death is due to the carelessness of the politicians who continue to jeopardize the health of brown bodies through a clear lack of leadership, refusal to acknowledge the severity of this crisis, and inability and unwillingness to give clear and decisive direction on how to minimize risk,â\u0080\u009d she wrote in the obit. On Monday, Urquiza was a guest speaker for presumptive Democratic presidential nominee Joe Biden, on the first night of the virtual convention. More from the DNC: Bernie Sanders makes a case for his former rival | Michelle Obama rips Trump as â\u0080\u0098wrong president for our countryâ\u0080\u0099 In a heartfelt speech delivered from her home, Urquiza said she still blames Trump for her fatherâ\u0080\u0099s death. â\u0080\u009cDonald Trump may not have caused the coronavirus, but his dishonesty and his irresponsible actions made it so much worse,â\u0080\u009d she said, describing how she felt Trump â\u0080\u009cbetrayedâ\u0080\u009d her father. â\u0080\u009cHe had faith in Donald Trump, he voted him, listened to him, believed him and his mouthpieces when they said coronavirus was under control and would disappear, and that it was OK to end social-distancing rules before it was safe,â\u0080\u009d she said. â\u0080\u009cIn late May, after the stay-at-home order was lifted in Arizona, my dad went to a karaoke bar with his friends. A few weeks later, he was put on a ventilator. And after five agonizing days, he died alone, in the ICU, with a nurse holding his hand.â\u0080\u009d â\u0080\u009cMy dad was a healthy 65-year-old,â\u0080\u009d she said. â\u0080\u009cHis only pre-existing condition was trusting Donald Trump, and for that, he paid with his life.â\u0080\u009d Read: â\u0080\u0098Donâ\u0080\u0099t vote for a killer.â\u0080\u0099 Sharon Stone endorses Biden-Harris as coronavirus ravages her family As of Monday, more than 170,000 Americans have died from the coronavirus, according to Johns Hopkins data. Other speakers Monday night included a number of prominent Republicans â\u0080\u0094 including John Kasich and Meg Whitman â\u0080\u0094 who endorsed Biden, as well as Sen. Bernie Sanders and former first lady Michelle Obama. Also:Hereâ\u0080\u0099s how to watch the Democratic convention â\u0080\u0094 plus whoâ\u0080\u0099s speaking, and when"}]}