{"article": [{"url": "https://www.marketwatch.com/story/california-surpasses-new-york-in-total-coronavirus-cases-2020-07-22", "published": 1595449340.0, "headline": "California surpasses New York in total coronavirus cases", "body": "SACRAMENTO, Calif. — A record one-day total of newly confirmed coronavirus cases gave California more than 409,000 since the pandemic began, sending it past New York for the most in the country, data from Wednesday showed. California’s cases have climbed rapidly in the last month, punctuated by the 12,807 recorded Tuesday, while New York’’s have fallen to less than 1,000 per day. California’s overall total is about 700 more than New York’s, according to a tally Johns Hopkins University. The surge of cases in California came after much of its economy was reopened in May and early June following nearly three months under the nation’s first statewide stay-at-home order that forced most businesses to close and restricted where people could go. Statewide, hospitalizations have nearly doubled in the past month to more than 7,100 patients. Coronavirus patients in intensive care have risen 71% over the same time frame to more than 2,000 patients. Gov. Gavin Newsom and health officials have blamed the increase on people — many of them younger adults — gathering with friends and family and not wearing masks or maintaining social distancing. At the end of June, Newsom began reimposing shutdowns. Bars and inside dining are forbidden statewide and tougher restrictions — including bans on indoor religious services and in-person instruction at schools and closures of indoor malls and gyms — have been imposed on virtually every large county and some small ones where the outbreak is most severe. Officials say it’s still too soon to know if the new restrictions will adequately slow the spread of the virus. Los Angeles Mayor Eric Garcetti has warned the situation in LA has become so tenuous that a virtual lock-down may be needed. Still, the lure of sunny skies has beckoned families and friends to gather for barbecues and pool parties despite pleas from public health officials to stay home. “I know it’s hard,” Los Angeles County Public Health Director Barbara Ferrer said Wednesday. “I know it’s a sacrifice, especially on beautiful summer days. But I’m asking people to stay home as much as possible. Avoid gathering with people you don’t live with.” New York still has by far the most coronavirus-related deaths in the country with more than 32,500 — four times more than California’s tally of about 7,900. New York’s rate of confirmed infections of about 2,100 per 100,000 people is twice California’s rate. With nearly 40 million residents, California is the most populous state in the country by a wide stretch. New York has 19.5 million residents. Newsom said it wasn’t surprising California would eventually have the most cases. He added, however, that it is “a sober reminder of why we are taking things as seriously as we are.” But with the disease spreading faster than public health officials can track it, it’s impossible to know the true extent of the virus’s reach in the United States. Federal government data published Tuesday found that reported and confirmed coronavirus cases vastly underestimate the true number of infections, echoing results from a smaller study last month. Testing supplies were so scarce at the start of the pandemic that many people had it and recovered without ever getting checked to see if they had the disease. Antibody surveys in New York City have suggested that by late April, as many as 1 in 5 people in the city had the disease, which would be about 1.6 million people. The Centers for Disease Control and Prevention study said true COVID-19 rates were more than 10 times higher than reported cases in most U.S. regions from late March to early May. It is based on COVID-19 antibody tests performed on routine blood samples in 16,000 people in 10 U.S. regions. In California, Los Angeles County and its 10 million residents remain a virus hot spot. County officials announced 64 new deaths on Wednesday, raising the total to 4,213 as the number of confirmed cases soared past 164,800. County hospitals had 2,207 patients, marking the fourth day in a row of hospitalizations exceeding 2,200 people. A state watch list of counties with increasing number of cases grew to 35 on Wednesday as officials added rural Butte County to the list. The Northern California county was devastated by a 2018 wildfire that destroyed most of the town of Paradise. Counties on the watch list for three consecutive days trigger a new round of restrictions, including closing indoor operations at hair and nail salons. The renewed restrictions now apply to more than 85% of the state’s population, fueling fears of a more job losses in a state where more than 8 million people have applied for unemployment benefits."}]}