{"article": [{"url": "https://www.marketwatch.com/story/us-corporate-earnings-reports-will-shine-a-light-on-the-uneven-playing-field-in-the-year-of-the-pandemic-2020-10-09", "published": 1602255860.0, "headline": "U.S. corporate earnings reports will shine a light on the uneven playing field in the year of the pandemic", "body": "The U.S. third-quarter corporate earnings reporting season will kick off next week and the numbers will reflect a second quarter dominated by the coronavirus pandemic that has created an uneven playing field in which some companies thrive, while others shrink and fade. While stock indexes have set records and big technology and online retailers have outperformed, many other industries and individual companies are grappling with deteriorating sales and earnings as economic growth has slumped across the globe. “A lot of company risk is not being captured by equity indices,” said James Gellert, chief executive of Rapid Ratings, a data and analytics company that assesses the financial health of private and public companies. “The equity market is showing a lot of optimism, but below the surface, there’s an ocean of companies that are dealing with a crisis.” Companies doing business with bigger enterprises in hard-hit sectors that sell to or buy from them are aware of the financial health of those customers or vendors, he said. The market may suggest a company is doing well, but the difference between financial health and market health “can be very different.” Sebastian Leburn, senior portfolio manager at Boston Private, agreed. “You’ve got the economy and the stock market, and you’ve got the S&P 500,” Leburn said. A chart provided by Lindsey Bell, chief investment strategist at Ally Invest, depicts the differences between the ‘haves’ and ‘have-nots’ of the recovery off the post-pandemic lows. Mainly, the rich are getting richer as the smaller companies suffer. Leburn noted that the S&P 500 index SPX, +0.87% is market-capitalization weighted, so its performance is skewed by just a handful of mega-cap tech stocks. Those companies, led by Apple Inc. AAPL, +1.74%, Amazon.com Inc. AMZN, +3.01%, Microsoft Corp. MSFT, +2.48% and Google-parent Alphabet Inc. GOOGL, +1.82%, represent roughly one-fifth of the index, and have benefited from business lockdowns resulting from the pandemic. However, the average stock is not doing quite as well. See:Apple’s 5G iPhone launch has investors hoping for ‘unprecedented upgrade cycle’ While the S&P 500 is up 7.6% year to date, the S&P 500 Equal Weight Index SP500EW, +0.20% has declined 1.2%. And the S&P 500’s post-pandemic record high was 5.7% above its pre-pandemic high in February, but the S&P 500 Equal Weight post-pandemic high in September was 3.8% below its February record. S&P 500 companies’ overall earnings performance is expected to be less bad than the second quarter, when earnings fell the most since the 2008 financial crisis, according to FactSet data. The aggregate blended year-over-year growth estimate for S&P 500 earnings per share, which includes some earnings already reported and the average analyst estimates of coming results, is negative 20.5% as of Friday morning, following a 31.4% plunge in the second quarter. Investors may be more focused on the rate of change in the decline, rather than how far earnings are falling. They’re also likely looking much further into the future for signs of growth in a post-pandemic world. Read also:These small-business owners are still making it work, coronavirus and all “The story, if you want to believe it, is that the June quarter was the low, and earnings estimates are going to get better from here,” said Leburn. “They’re negative, but they’re less negative.” Gellert agreed. “It’s not as clear as better or worse. The second quarter was terrible, and this will be better than terrible, but still not necessarily good.” Andrew Slimmon, a managing director and senior portfolio manager on all-long equity strategies at Morgan Stanley Investment Management, is more concerned with how earnings look relative to what Wall Street is expecting. “I don’t care that we’re looking at down earnings, I care whether companies are going to do better than expected,” Slimmon said. And analysts are expecting results to be better than initial estimates, for the first time in more than two years.Analysts are raising estimates for the first time in 9 quarters The earnings decline may be slowing, but the third quarter will be the third-straight quarter of declines, following 31.4% drop in the second quarter and 14.1% fall in the first quarter. And while Wall Street is estimating a significant improvement in the fourth quarter, the estimate currently calls for another double-digit decline, of 12.7%. The third-quarter outlook does stands out a bit, however, as the current estimate of a 20.5% decline compares with the estimate of a 24.4% drop as of June 30. That marks the first time estimates have improved during a quarter since the second quarter of 2018. Over the past five years, estimates declined by an average of 5% during a quarter. What might that mean for the S&P 500 index? From mid-July 2018, when the second-quarter 2018 earnings season kicked off, the S&P 500 rose 4% through the end of the third quarter, reaching a record high in the process. Then the bottom fell out, as the index tumbled 14% over the final three months of that year, and hit a 20-month low in the process, amid concerns over the economic impact of a trade war with China and rising interest rates.Numbers are negative for all sectors So far, all 11 of the key S&P 500 sectors are expected to see earnings fall from last year. Energy is leading the way with an estimated 122.7% drop in earnings, followed by industrials at negative 60.4% growth and consumer discretionary at negative 36.9%. The sectors currently expected to perform the best are health care at negative 0.6% and information technology at negative 2.7%. Although the overall decline in the second quarter was bigger, three of 11 sectors saw earnings rise, including health care and technology. Seven sectors have seen estimates improve since June 30, with consumer discretionary showing the biggest improvement — negative 36.9% from negative 52.0% — followed by financials, to negative 18.8% from negative 30.8%. See related: Opinion: Get ready for a good earnings season for big U.S. banks. Meanwhile, the outlook for sales is much better, with analyst expectations pointing to 3.5% decline overall, following a 9.2% drop in the second quarter. Five of the 11 sectors are expected to post positive sales growth, led by health are at 7.3% and consumer staples at 2.3%. Energy is expected to suffer the biggest sales decline at 31.5%. For the fourth quarter, the sales decline is expected to improve to 1.4%. Gellert from Rapid Ratings said companies who came into the crisis with stronger financial health ratings, a metric that looks at one-year short-term default risk and viability, are naturally faring better than those who did not. In the airline sector, for example, he said Southwest Airlines Co. LUV, +1.89% and American Airlines Group Inc. AAL, +0.34% offer a case in point. Southwest started 2020 with a financial health rating of 91 out of 100, and it has now deteriorated to 72, which is still strong. American, in contrast, started the year with a financial health rating of just 56 out of 100, which has now deteriorated to 24. Capital markets are full steam ahead After raising record amounts of capital in the debt, equity and convertible bond markets in the second quarter, companies continued to borrow or issue stock in the third quarter as they struggled to bolster liquidity. U.S. companies have issued a record $1.48 trillion of corporate bonds in the year to date in 1,317 deals, according to data provided by Dealogic. That shattered the previous record of $928.8 billion issued in the same period in 2017 in 1,002 deals. See also: 2020 is the year of the SPAC — yet traditional IPOs offer better returns, report finds Companies have issued $385 billion of equity in the year so far in 1,071 deals, crushing the previous record of $276.6 billion issued in 2000 in 870 deals. They have issued 91.5 billion of corporate bonds in 156 deals, beating the previous record of $71.1 billion issued in 2007, in 164 deals. The initial public offering market alone had its busiest quarter since 2000, the height of the dot.com boom, with 81 deals raising $28.5 billion. The high volume and effect of several large deals generated the most proceeds in six years, according to Bill Smith, founder and chief executive of Renaissance Capital, a provider of IPO exchange-traded funds and institutional research. Anthony Denier, chief executive of Webull, a commission-free trading platform, said low interest rates and the Federal Reserve backstop are driving the trend. “The whole point of the Fed lowering rates is to get companies to borrow more. And while companies won’t pay 0% on their loans, they will pay very little interest, so now is a great time to borrow. And with the Fed backstopping the bond market, there’s very little downside.” Read: Deutsche Bank, Goldman and JP Morgan top commercial real estate finance, despite COVID-19 cracks However, companies still need the funds to service their higher debt loads, and will need to deliver adequate earnings and cash flow to manage it, according to Moody’s Investors Service. “We expect that many investment-grade companies will continue to show resiliency to the economic stress caused by the coronavirus,” Moody’s analysts wrote in a recent note. “However, companies in hard hit sectors – including those rated low investment grade – have high hurdles.” See now:IPO like it’s 1999: Snowflake and other software stocks pop as market nears dot-com-boom levels A sustained need for social distancing, for example, would totally upend the travel and leisure sectors, accelerate e-commerce trends, disrupt commercial real estate and extend oil price volatility. Already, cinemas and entertainment events are reeling from social-distancing mandates, said Denier from Webull. “The delay in releasing the new James Bond and Batman films is considered a disaster for the movie theater industry,” he said. “And with a resurgence in the coronavirus, entertainment venues won’t be opening anytime soon.” The credit markets are reflecting more concern about the outlook than the equity markets, which is hardly surprising given there is so much capital to put to work. “Businesses need to see demand for their products and services, but after falling off a cliff, demand is still very low,’ he said. “The current level of real yields is a signal that bond investors see a lot of weakness and uncertainty in the broader economy.” The first earnings reports next week, from the nation’s big banks, are expected to reflect that. Banks are expected to have cleaned up on fees from investment banking activity, given the record pace of capital raising and mergers & acquisitions. But their loan books are likely to reflect the stress especially in the small and medium-size business sector, and provisions for loan-loss reserves are expected to remain high, albeit below the lofty levels seen in the second quarter. For more, see: Get ready for a good earnings season for big U.S. banks Also on the docket next week is Johnson & Johnson JNJ, +1.39%, the pharmaceutical and consumer goods giant that is one of the companies developing a COVID-19 vaccine candidate. Investors will hope to hear data from the company’s Phase 1/2a trial, which began in the second half of July. J&J said Sept. 23 that the vaccine candidate demonstrated a “safety profile and immunogenicity after a single vaccination were supportive of further development” and preprint results would be published imminently. The company started to dose participants in its Phase 3 trial in September and is aiming to enroll up to 60,000 people. Read now:There are seven coronavirus vaccine candidates being tested in the U.S. — here’s where they stand"}]}