{"article": [{"url": "https://www.marketwatch.com/story/u-s-corporate-debt-soars-to-record-10-5-trillion-11598921886", "published": 1598907980.0, "headline": "U.S. corporate debt soars to record $10.5 trillion", "body": "Sculpture of an internally-lit exact replica of the planet using NASA imagery Zuma Press U.S. corporations now owe a record $10.5 trillion to creditors, either in the form of bonds or loans, a stunning 30-fold increase from a half-century ago, according to a new BofA Global Research report. By far, the biggest chuck of debt has been taken out by American companies with high “investment-grade” credit ratings of AAA to BBB, a segment of the market where borrowing has more than doubled in the past decade to roughly $7.2 trillion. Higher ratings should be a good thing for creditors, particularly if American corporations acts as investors expect, and start paying down their debts once the health threat of COVID-19 can be better managed, the economy recovers and corporate earnings pick back up. However, half of investment-grade corporate debt, or $3.6 trillion, resides within the borderline BBB credit-ratings category, only a few notches away from speculative-grade, or “junk,” territory. A longtime worry among investors has been that an economic downturn or a sustained cycle of BBB downgrades by credit-rating firms could swamp the junk-bond market, which BofA pegs as roughly 250% smaller than the BBB segment. To be sure, the outlook for corporate debt has brightened since March, when the Federal Reserve’s raft of emergency funding programs was unleashed to keep credit flowing during the pandemic, including the central bank’s historic leap into buying corporate debt for the first time ever. Among the knock-on effects has been a deluge of capital flooding into the U.S. corporate debt sector, including from individual investors in bond funds and exchange-traded funds, as well as foreign buyers looking for yields, which have kept debt markets liquid. This chart breaks down the ownership of the U.S. corporate bond market as of the first quarter of 2020. Of note, the pie chart has yet to include the owners of the flood of fresh debt issued by U.S. companies at ultra-low borrowing costs during the second quarter, as the pandemic bore down on North America and left companies hoarding cash to offset what could be several quarters of weak corporate earnings. Read: A binge? Bulge? Or just the new normal for debt in America as Fed helps spur string of records What it does show, however, is that earlier this year, foreign investors were the single largest holders of U.S. corporate debt, at 27% of the ownership pie. They were followed closely behind by funds with a 22% share, including mutual and exchange-traded funds. Another key concern of the decade’s long corporate debt boom has been the growing role of exchange-traded funds (ETFs), or funds that advertise daily liquidity in the market, even though their underpinning assets can be notoriously illiquid. However, for the most part, the biggest U.S. corporate bond ETFs ended up performing as expected during the worst of the coronavirus-triggered downward spiral and subsequent recovery, one of the quickest on record for major U.S. stock indexes. Capping off five strong months of gains, the S&P 500 index SPX, +0.87% and Dow Jones Industrial Average DJIA, +0.56% closed Monday by booking their best August returns in 36 years. BofA’s credit team, led by Hans Mikkelsen, notes that fixed-income ETFs have become increasingly popular this year, including those with shares dedicated to high-grade corporate bonds, which have rose to 12.4% of trading volumes relative to bonds already this year, from 1.6% in 2010. Specifically, in the investment-grade corporate bonds, his team pegged roughly half of the daily ETF trading volume as taking place in the massive $57.4 billion iShares iBoxx UDS Investment Grade Corporate Bond ETF LQD, +0.23%. Perhaps unsurprisingly, over the past three months, the Fed was the biggest holder of LQD, at 17,861 shares, according to FactSet data."}]}