{"article": [{"url": "https://www.marketwatch.com/story/new-york-city-teachers-feeling-overwhelmed-and-distrustful-of-doe-ahead-of-planned-schools-reopening-possible-uft-strike-2020-08-31", "published": 1598885120.0, "headline": "New York City teachers feeling 'overwhelmed' and 'distrustful' of DOE ahead of planned schools reopening, possible UFT strike", "body": "Jamie Ewing, an elementary school science teacher at P.S. 277 in the Bronx, is a proud educator and considers himself a role model to his students. This year, if New York City public schools reopen for in-person classes as planned, he'll take on an unofficial third job title that's arguably a lot less fun: mask-wearing enforcer.  Face-coverings will be mandatory inside of New York City school buildings for both students and staff under city Department of Education (DOE) rules. (Exceptions will be made for students who cannot wear masks for health reasons.) While Ewing, 55, isn't thrilled about having to police students' mask-wearing, he expects most students will follow the rules. To live through March and April in New York City, when it was the epicenter of the coronavirus pandemic, he believes, is to understand the importance of wearing a face mask. \"With the younger kids, we're going to have to be really vigilant, and just remind them, and do it in a very caring way,\" he said. \"As an educator, you get thrown a lot of different curveballs every year, so this is just one. It may be a little sticky in the beginning, but I have faith that it's going to be OK.\" It's one of the many uncertainties that New York City teachers are grappling with as they prepare for the district-the nation's largest, with 1.1 million students-to become the only major school system in the country to attempt some form of in-person learning this fall. Classes are expected to resume Sept. 10 with a hybrid model, meaning students who elect to show up at school will have two to three days of in-person classes and learn remotely the other days, as a way to reduce class sizes and promote social distancing. Other critical safety components, including adequate ventilation systems, are largely out of teachers' control. A growing contingent of educators is calling on the DOE to delay in-person classes to allow more time for facility improvements, given the virus's high risk factor indoors. Mayor Bill de Blasio said last week that teams of engineers are inspecting ventilation systems in the city's roughly 1,700 public schools. Ronnie Almonte, a biology teacher at Leaders High School in Brooklyn, has felt deepening distrust in the DOE since schools shut down in March, he said. As a member of the steering committee for a faction of the city's teachers union known as the Movement of Rank and File Educators (MORE) Caucus, he has been advocating to delay in-person classes until the spring semester. His building is among many in the school system that has windows that either don't open or open only a couple of inches. \"Safety is not an abstract idea,\" said Almonte, 31. \"Safety requires investment in our antiquated buildings, and without proof that there's money being invested, it's not going to be safe to reopen anytime soon.\" Michael Mulgrew, president of the United Federation of Teachers, the city's powerful teachers union, has said that the union is prepared to strike or go to court to prevent schools from reopening if they have not met the union's COVID-19 safety demands, which include adequate and regular testing of students and teachers. Unions that represent school principals, lunch workers and crossing guards have also urged de Blasio and schools Chancellor Richard Carranza to delay reopening so there is more time to train teachers and update equipment. UFT leaders could vote as soon as tonight to authorize a strike, followed by a vote of school-based UFT delegates on Tuesday who would have to approve the historic work action, Chalkbeat reported on Saturday. Meanwhile, de Blasio has said consistently, and as recently as Friday, that schools will be prepared to reopen safely on the planned start date, less than two weeks away. The city is also planning to open streets and parks to schools that elect to hold certain classes outside. \"We have been planning on Sept. 10 for months and months. It is exactly when school begins every year,\" de Blasio said Friday in an interview on the Brian Lehrer Show. \"And, yeah, there's additional things we've had to work out this year, to say the least. But step-by-step, these things are being resolved.\" A DOE spokeswoman echoed his comments on Monday. \"We're working around the clock to set our schools and educators up for a safe and successful start to the school year, with health and safety top of mind,\" DOE press secretary Miranda Barbot said in an email to MarketWatch. \"The vast majority of our students are planning to return in person, and it's our job to be ready for them with a shared vision for in-person education.\" Ewing, who is part of his school's reopening committee, does not feel that staff have had enough time to plan. P.S. 277, which was built in the 1800s, has five stories and limited exits and entrances, he said, which makes planning student traffic flow to reduce contact and spread of the virus a complex task. Getting to school in the first place will be a hairy proposition for some students and teachers who rely on public transportation but have not ridden regularly for months. Kaitlin Ruggiero, 34, a math teacher at Forsyth Satellite Academy who is also part of the MORE Caucus, said her students travel from throughout the five boroughs to attend the Lower East Side transfer school which serves students who are at risk of dropping out. \"I'm nervous that we're not going to protect our students and protect their families and protect everyone who's working at the schools properly if we open up too soon and if we spend too much time inside together,\" Ruggiero said. \"I'm feeling pretty stressed about the whole thing, and I feel like a thing I can do is push for the reopening of buildings to be done more thoughtfully, and I think we need more time to plan.\" Logistics and safety protocols are a huge concern for teachers. And then there's the actual work of addressing students' academic needs and their well-being during a period of educational, economic and political upheaval. Ewing is most worried about meeting the social and emotional needs of his youngest students, who are kindergartners, and who will be expected to observe social distancing while they are at school. \"How do you explain that to a 5-year-old who is used to coming in to school, running around, hugging their friends?\" he said. \"That's not what it's going to look like.\" The city surveyed parents in early August and reported that 26% of children-or 264,000 students-elected for online learning only, while roughly three-quarters may opt to start the school year with some in-person instruction. But families that didn't fill out the survey were, by default, counted in the in-person instruction pool, which likely artificially inflates the data touted by the mayor. Some families at Ruggiero's school, for example, chose not to fill out the survey because they're undecided about sending their children back to school and are waiting for more clarity from the DOE, she said. Coronavirus update: U.S. case tally edges closer to 6 million and FDA head says he won't be pressured to rush out a vaccine The numbers continue to shift, with 40,000 more children opting for fully remote learning in a subsequent survey, according to data published Aug. 17, amNewYorkMetro reported. Families that have elected to send children to school may opt out of in-person learning at any time. Simultaneously, steep state education budget cuts are expected this year; the worst-case financial scenario for New York City would result in 9,000 teacher layoffs, which would force all instruction to go remote for the entire school year, Carranza said last week. It's in this chasm of uncertainty that teachers are preparing to do their jobs both in-person and virtually, figuring out how to instruct students with varying needs and abilities on new platforms. As a science teacher, Ewing's curriculum includes lots of hands-on, project-based lessons. But if schools reopen, he's not expecting students to touch the robotics equipment this year because of the risk of spreading infections. He's spent the summer trying to adapt his lesson plans so students can do simple projects with materials they have at home. \"I'm kind of emotionally drained right now, trying to figure that out,\" he said. \"And I know that I'll get there, but it's really overwhelming.\""}]}