{"article": [{"url": "https://www.marketwatch.com/story/a-10-selloff-in-the-stock-market-is-most-likely-says-expert-who-called-march-lows-something-has-to-give-11596490253", "published": 1596529940.0, "headline": "A 10% selloff in the stock market is most likely, says expert who called March lows: 'Something has to give'", "body": "Michael Wilson, chief U.S. equity strategist at Morgan Stanley, and his colleagues believe that the narrow breadth of winners in the stock market will likely result in a 10% correction before giving way to a renewed rally. The analysts, in a Monday research report, say that either a host of risks that are building beneath the surface of the markets' unimpeded uptrend - spiking COVID-19 cases, 2020 presidential election uncertainty and nearly unchecked government spending - must be cured or the recent technology-related winners need to fall along with the rest of the market. \"We think the most likely outcome remains a 10% correction in the broader index led by the beneficiaries before the recovery and bull market continues,\" wrote Wilson and strategists Adam Virgadamo, Andrew Pauker and Michelle Weaver. The report comes as the tech-heavy Nasdaq Composite Index COMP, +1.39% finished the session up 1.5% to post its 29th all-time closing high of 2020. The index is up nearly 60% from its March 23 low, powered by a handful of large-capitalization companies, including Microsoft Corp. MSFT, +2.48% and Tesla TSLA, +1.89%, as well as from the so-called FAANG names, Facebook Inc. FB, +0.26%, Apple Inc. AAPL, +1.74%, Amazon.com Inc. AMZN, +3.01%, Netflix NFLX, +1.43% and Google parent Alphabet Inc. GOOG, +1.97% GOOGL, +1.82% The Dow Jones Industrial Average DJIA, +0.56% and the S&P 500 index SPX, +0.87% are both up by at least 43% since their late-March nadirs, but that pace isn't as brisk as the Nasdaq because of the latter's proportion of tech-related shares. Read: A record high for the Nasdaq 'would all come crashing down,' says Trump in a tweet, 'including your jobs, stocks, and 401(k)s,' if Biden wins presidency \"Once the correction is complete we expect the bull market to continue to broaden out and based on what we think will continue to be a surprising recovery in the economy and earnings later this year and into 2021,\" the Morgan Stanley analysts wrote. Wilson's picks haven't always been correct, but he and his team did call for markets to bottom on March 16, just a week before the S&P 500 hit its recent low 2,237 on March 23, arguing at that time that the COVID-19 epidemic and simultaneous crash in oil prices were simply the \"final blows to an already exhausted U.S. expansion.\" Wilson advocated for buying during a May pullback, which also seems to have been a good call as stock markets have posted four consecutive monthly gains since March."}]}