{"article": [{"url": "https://www.marketwatch.com/story/charting-a-bearish-technical-tilt-sp-500-dow-industrials-violate-major-support-2020-09-22-121035222", "published": 1600779620.0, "headline": "Charting a bearish technical tilt:  S&P 500, Dow industrials violate major support", "body": "Editor’s Note: This is a free edition of The Technical Indicator, a daily MarketWatch subscriber newsletter. To get this column each market day, click here. Technically speaking, the September market downturn continues to inflict damage to the major U.S. benchmarks. Against this backdrop, the S&P 500 and Dow industrials have violated major support — as well as the 50-day moving average — raising an intermediate-term caution flag. The Nasdaq Composite has firmed, on the margin, versus the other benchmarks. Before detailing the U.S. markets’ wider view, the S&P 500’s SPX, +0.87% hourly chart highlights the past two weeks. As illustrated, the S&P has tagged nearly two-month lows, violating major support (3,328) and the 50-day moving average. The downturn has been underpinned by a deeper floor at the June peak (3,233). Monday’s session low (3,229) roughly matched support. Separately, the S&P has narrowly maintained the July peak (3,280). Monday’s close (3,281) matched support to punctuate a late-day reversal. Similarly, the Dow Jones Industrial Average DJIA, +0.56% has violated key technical levels. The specific area matches its breakout point (27,580) and the 50-day moving average, currently 27,512. The violation signals a bearish shift to the Dow’s intermediate-term bias. Tactically, a swift reversal back atop the 50-day would neutralize the downdraft. Meanwhile, the Nasdaq Composite COMP, +1.39% has strengthened on the margin versus the other benchmarks. Consider that it closed Monday within last week’s range, unlike the S&P 500 and Dow industrials. Still, an extended test of last-ditch support — the mid-September low (10,728) — remains underway. Widening the view to six months adds perspective. On this wider view, the Nasdaq has extended the September downdraft, dropping as much as 12.9% from its record peak. Against this backdrop, the index has notched consecutive closes slightly under major support (10,840). As detailed previously, likely last-ditch support spans from 10,728 to 10,760, levels matching the mid-September and August lows. An eventual violation would mark a “lower low” — combined with a failed test of the 50-day moving average from underneath — raising an intermediate-term caution flag. The index maintained key support, by the skin of its teeth, with Monday’s bullish reversal. Looking elsewhere, the Dow Jones Industrial Average has violated notable support. The specific area matches its breakout point (27,580) and the 50-day moving average, currently 27,512. This marks the Dow’s first close under its 50-day moving average since April. (Recall the 50-day underpinned the May, June and late-July lows.) Combined with the prevailing “lower low” the Dow’s downturn signals a bearish intermediate-term bias. To reiterate, a swift reversal back atop the 50-day moving average would neutralize the downdraft. Meanwhile, the S&P 500 has also violated major support. The specific area matches its breakout point (3,328) and the 50-day moving average, currently 3,347. Here again, the downturn punctuates a “lower low” — combined with the violation of the 50-day — raising an intermediate-term caution flag. The bigger picture As detailed above, the September market downturn continues to inflict technical damage. On a headline basis, the S&P 500 and Dow industrials have violated major support — and the 50-day moving average — raising an intermediate-term caution flag. Meanwhile, the Nasdaq Composite has violated the 50-day moving average, though it has thus far narrowly averted registering a material “lower low.” So collectively, the bigger-picture backdrop is not one-size-fits-all. The formerly lagging Nasdaq Composite has firmed on the margin — (though it’s still hanging by a thread, in many respects) — while the S&P 500 and Dow industrials have more definitively signaled intermediate-term trend shifts. Moving to the small-caps, the iShares Russell 2000 ETF has violated its 50-day moving average, pressured amid a volume spike. Delving deeper, the 200-day moving average, currently 145.26, marked a July inflection point. Meanwhile, the SPDR S&P MidCap 400 ETF is challenging its 200-day moving average, currently 331.53. As always, the 200-day moving average is a widely-tracked longer-term trending indicator. (In this case, the 200-day’s slope has flattened, consistent with an absence of longer-term trend.) Looking elsewhere, the SPDR Trust S&P 500 has violated its 50-day moving average, currently 334.30, closing lower for the first time since April. The downturn has been fueled by increased volume, to punctuate a lackluster mid-September rally attempt. Bearish price action. Separately, consider that Monday’s internals pressed bearish extremes: NYSE declining volume surpassed advancing volume by a greater than 7-to-1 margin. In a textbook world two 9-to-1 downturns, across about a seven-session window, reliably signals a material trend shift. So the clock is ticking on a potential second shoe to drop. Placing a finer point on the S&P 500, the index has violated two key technical levels: The 50-day moving average, currently 3,347. Major support matching the early-2020 breakout point (3,328). The downturn punctuates the S&P’s first closing violation of the 50-day moving average since April. Tactically, the breakdown point (3,310) pivots to key resistance. A swift reversal back atop this area would place the S&P on firmer technical ground, neutralizing the prevailing downdraft. The pending retest from underneath should be a useful bull-bear gauge. Collectively, the S&P 500 has violated its 50-day moving average and major support (3,328) amid aggressive 7-to-1 negative breadth. The downturn signals a bearish intermediate-term bias pending repairs. (On a granular, and slightly positive note, the S&P also formed a bullish single-day reversal Monday almost precisely defined by its next notable support. Recall the session low matched the June peak (3,233) and the session close matched the July peak (3,280). The “bullish reversal” nonetheless marked a 1.1% daily downturn.) Tactically, the S&P 500’s breakdown point — the 3,310-to-3,328 area — pivots to key resistance. A swift reversal atop this area would place the index on firmer technical ground, neutralizing the prevailing downturn. The S&P’s backdrop supports a bearish intermediate-term bias pending such a move. Also see: Bull trend intact: S&P 500, Nasdaq rally from major support.Tuesday’s Watch List The charts below detail names that are technically well positioned. These are radar screen names — sectors or stocks poised to move in the near term. For the original comments on the stocks below, see The Technical Indicator Library.U.S. sector damage broadens, though pockets of strength persist Drilling down further, the September market downturn continues to inflict damage, though familiar pockets of strength persist. Several groups exemplify the prevailing backdrop: To start, the Financial Select Sector SPDR’s XLF, +0.11% backdrop has finally cracked. Specifically, the group has violated major support, an area matching its former range top (24.50) and the 50-day moving average (24.60). The downturn originates from trendline resistance, and signals an intermediate-term trend shift. Tactically, a swift reversal atop the breakdown point (24.50) would place the group on firmer technical ground. The pending retest from underneath should add color. Similarly, the SPDR S&P Regional Banking ETF has signaled a trend shift. As illustrated, the group has reached two-month lows, violating trendline support on increased volume. The downturn punctuates a head-and-shoulders top defined by the April, June and August peaks. Here again, the breakdown point (36.90) pivots to key resistance. The group’s backdrop supports a bearish intermediate-term bias pending a close atop this area. Meanwhile, the Energy Select Sector SPDR has extended to four-month lows. The prevailing downturn punctuates a flat mid-month rally attempt, and failed test of the breakdown point (34.25) from underneath. Bearish price action. Looking elsewhere, the Invesco QQQ Trust QQQ, +1.52% tracks the Nasdaq 100 Index, and serves as a large-cap technology sector proxy. This group paced the early-September market downdraft, and remains tenuously positioned. Technically, the mid-month bounce has been capped by trendline resistance, and punctuated by a strong-volume violation of the 50-day moving average. Shaky price action. Delving deeper, the former breakout point (268.40) and August low (264.63) likely mark last-ditch support, detailed previously. (See the Sept. 11 review and Sept. 18 review.) Monday’s close (267.51) registered within the support band. A potentially consequential retest remains underway. To reiterate, a close under the 264.60 area would mark a “lower low” — combined with a violation of the 50-day moving average — raising an intermediate-term caution flag. Familiar pockets of strength persist Conversely, familiar pockets of sector strength stand out: To start, the iShares Transportation Average IYT, +0.81% has pulled in from two-year highs amid a downturn that has inflicted limited damage in the broad sweep. Recall that trendline support tracks the 50-day moving average, and is rising toward the former breakout point (190.00). A posture higher signals a bullish intermediate-term bias. More broadly, recall that the early-August spike marked a two standard deviation breakout, encompassing four straight closes atop the 20-day volatility bands. The comparably flat prevailing pullback — at least so far — supports a comfortably bullish longer-term outlook. Meanwhile, the Industrial Select Sector SPDR XLI, +0.37% has reversed from six-month highs. (Yield = 1.9%.) In the process, the group’s violation of trendline support has been fueled by a volume spike, the strongest print since June. Still, the group has maintained support matching its breakout point (76.15) and the ascending 50-day moving average, currently 75.60. Limited damage has been inflicted. Delving slightly deeper, the 200-day moving average, currently 72.35, marked a former inflection point. Tactically, the group’s rally attempt gets the benefit of the doubt barring a violation of the 200-day. More broadly, the tandem industrials and transports strength supports the bull case. (Under Dow Theory, a bull market is confirmed when the pair registers new highs concurrently, or closely in time.) Finally, the Materials Select Sector SPDR XLB, +0.77% also remains relatively resilient. (Yield = 2.1%.) Though the group has reversed respectably from last week’s record high, the downturn has been fueled by lukewarm volume. And here again, the group has initially maintained support matching its breakout point (63.10) and the ascending 50-day moving average, currently 62.80. Delving deeper, likely last-ditch support (61.30) closely matches the February peak. The group’s bullish intermediate-term bias gets the benefit of the doubt pending a violation. Summing up the sector backdrop All told, this week’s downturn has incrementally damaged the U.S. sector backdrop. On a headline basis, the financials have joined large-cap technology as a key bear-case contributor. Still, familiar pockets of strength persist amid the September market cross currents. Collectively, the prevailing sub-sector backdrop supports a guardedly bullish-leaning bias, though potentially consequential technical tests remain underway. Editor’s Note: This is a free edition of The Technical Indicator, a daily MarketWatch subscriber newsletter. To get this column each market day, click here.Still well positioned The table below includes names recently profiled in The Technical Indicator that remain well positioned. For the original comments, see The Technical Indicator Library. Company Symbol* (Click symbol for chart.) Date Profiled Maxar Technologies, Inc. MAXR Sept. 18 V.F. Corp. VFC Sept. 14 Crocs, Inc. CROX Sept. 14 Toyota Motor Co. TM Sept. 14 Five Below, Inc. FIVE Sept. 10 Dow Inc. DOW Sept. 10 Eastman Chemical Co. EMN Sept. 10 CrowdStrike Holdings, Inc. CRWD Sept. 9 Workhorse Group, Inc. WKHS Sept. 9 International Paper Co. IP Sept. 3 Anaplan, Inc. PLAN Sept. 2 Beyond Meat, Inc. BYND Sept. 1 Elastic N.V. ESTC Sept. 1 Medtronic MDT Aug. 28 Celanese Corp. CE Aug. 26 Norfolk Southern Corp. NSC Aug. 25 Westlake Chemical Corp. WLK Aug. 25 Deere & Co. DE Aug. 24 PulteGroup, Inc. PHM Aug. 24 Expedia Group, Inc. EXPE Aug. 24 Visa, Inc. V Aug. 21 Johnson Controls International JCI Aug. 21 Adobe, Inc. ADBE Aug. 20 Canadian Solar, Inc. CSIQ Aug. 20 General Motors Co. GM Aug. 20 Starbucks Corp. SBUX Aug. 18 Builders FirstSource, Inc. BLDR Aug. 18 Steel Dynamics, Inc. STLD Aug. 17 Elanco Animal Health, Inc. ELAN Aug. 17 Brinker International, Inc. EAT Aug. 13 Enphase Energy, Inc. ENPH Aug. 13 Nike, Inc. NKE Aug. 11 Nucor Corp. NUE Aug. 11 Financial Select Sector SPDR XLF Aug. 10 Freeport McMoRan, Inc. FCX Aug. 10 Natera, Inc. NTRA Aug. 10 Lennar Corp. LEN Aug. 7 McDonald’s Corp. MCD Aug. 7 Mastercard, Inc. MA Aug. 6 United Health Group, Inc. UNH Aug. 6 Kansas City Southern KSU Aug. 6 Industrial Select Sector SPDR XLI Aug. 6 Verizon Communications, Inc. VZ Aug. 5 Sunrun, Inc. RUN Aug. 5 Coeur Mining, Inc. CDE Aug. 5 Southern Copper Corp. SCCO Aug. 3 Penn National Gaming, Inc. PENN July 30 Procter & Gamble Co. PG July 29 SPDR S&P Metals & Mining ETF XME July 28 iShares MSCI South Korea ETF EWY July 28 Toll Brothers, Inc. TOL July 27 HP, Inc. HPQ July 24 Advanced Micro Devices, Inc. AMD July 23 Best Buy Co., Inc. BBY July 22 iShares Europe ETF IEV July 21 Materials Select Sector SPDR XLB July 20 Caterpillar, Inc. CAT July 20 iShares U.S. Home Construction ETF ITB July 17 Progressive Corp. PGR July 17 Livongo Health, Inc. LVGO July 17 Roku, Inc. ROKU July 16 Catalent, Inc. CTLT July 16 Cognizant Technology Solutions, Inc. CTSH July 16 Health Care Select Sector SPDR XLV July 16 Consumer Staples Select Sector SPDR XLP July 15 Home Depot, Inc. HD July 15 Costco Wholesale Corp. COST July 15 Kirkland Lake Gold, Ltd. KL July 15 Air Products & Chemicals, Inc. APD July 14 Consumer Discretionary Select Sector SPDR XLY July 13 Sony Corp. SNE July 13 SunPower Corp. SPWR July 13 Walmart, Inc. WMT July 8 Big Lots, Inc. BIG July 1 Tandem Diabetes Care, Inc. TNDM July 1 Dell Technologies, Inc. DELL June 30 Danaher Corp. DHR June 24 RH RH June 24 Lowe’s Companies LOW June 19 Fiverr International, Ltd. FVRR June 19 Etsy, Inc. ETSY June 17 HubSpot, Inc. HUBS June 8 Square, Inc. SQ June 8 United Parcel Service, Inc. UPS June 5 FedEx Corp. FDX June 3 SPDR S&P Retail ETF XRT June 3 iShares MSCI Japan ETF EWJ May 29 SolarEdge Technologies, Inc. SEDG May 29 Synopsis, Inc. SNPS May 27 iShares Silver Trust SLV May 15 Agnico Eagle Mines, Ltd. AEM May 15 Agilent Technologies, Inc. A May 15 Qualcomm, Inc. QCOM May 12 Kinross Gold Corp. KGC May 11 Salesforce.com, Inc. CRM May 8 Facebook, Inc. FB May 7 Spotify Technology S.A. SPOT May 5 Dollar General Corp. DG Apr. 28 ServiceNow, Inc. NOW Apr. 27 Five9, Inc. FIVN Apr. 24 Chewy, Inc. CHWY Apr. 24 Tesla, Inc. TSLA Apr. 23 VanEck Vectors Semiconductor ETF SMH Apr. 17 Veeva Systems, Inc. VEEV Apr. 17 Okta, Inc. OKTA Apr. 16 Target Corp. TGT Apr. 16 VanEck Vectors Gold Miners ETF GDX Apr. 14 Invesco QQQ Trust QQQ Apr. 14 DocuSign, Inc. DOCU Apr. 3 Zscaler, Inc. ZS Apr. 3 Apple, Inc. AAPL Mar. 27 Nvidia Corp. NVDA Mar. 27 Zoom Video Communications, Inc. ZM Mar. 19 iShares MSCI Emerging Markets ETF EEM Mar. 19 Newmont Corp. NEM Jan. 13 SPDR Gold Shares ETF GLD Jan. 2 Microsoft Corp. MSFT Feb. 22 * Click each symbol for current chart."}]}