{"article": [{"url": "https://www.marketwatch.com/story/a-massive-welfare-economy---huge-federal-aid-prevents-an-even-steeper-gdp-collapse-2020-07-30", "published": 1596115700.0, "headline": "'A massive welfare economy' - huge federal aid prevents an even steeper GDP collapse", "body": "The U.S. economy's record contraction in the second quarter would have been a lot worse if Washington hadn't stepped up with trillions of dollars of emergency spending. And a recovery won't be nearly as strong unless Washington comes through with another rescue package, economists say. Democrats and Republicans are divided over the next relief bill with emergency unemployment and other benefits set to expire soon. Gross domestic product, the official scorecard of the economy, shrank by an inflation-adjusted 32.9% annualized pace from April through June, the government said Thursday. That's three times larger than the previous record decline in 1958. Read:Economy suffers titanic 32.9% plunge in second quarter and points to drawn-out recovery What kept the economy plunging even further was the lifeline thrown to tens of millions of suffering Americans by the federal government. Lawmakers spent trillions of dollars on stimulus checks for families, more generous unemployment benefits and massive loans for struggling businesses. Read:Jobless claims rise for second straight week as U.S. economic activity slows down Federal spending leaped by more than 17% and an even higher 40% outside the military. As result, disposable incomes actually soared in the second quarter even as the coronavirus pandemic triggered a record collapse in the economy. Incomes shot up at an annualized rate of 45%. That helped financially struggling Americans to pay the rent, buy groceries and make other needed purchases. \"The only way you have personal income rising in a collapsing economy is if you turn to a massive welfare economy.\" said Joel Naroff of Naroff Economic Advisors. \"That was absolutely necessary and if it didn't happened, the decline might have been 50% or more.\" Even all the federal help, however, could not prevent a record decline in consumer spending. Outlays sank at a nearly 35% annualized clip. Americans slashed spending on gasoline, clothing, dining out, health care, transportation, hotels and many other goods and services. With most Americans hunkered down at home during the spring, there was little need to drive, travel or spend money on discretionary or non-emergency services. A few segments of the economy still stood out, though. Sales of autos and parts rose 6.7% and purchases of recreational goods and vehicles skyrocketed 55%. Americans also spent a bit more on financial services - an effort no doubt to protect their money and savings as the stock market DJIA, +0.56%  crashed. Those bright spots were few and far between, however. The economy suffered an unprecedented blow and it will take a long time to heal, especially if Congress stints on further aid. Read:Consumer confidence wanes in July and points to rockier economic recovery \"The economy is still wrestling with the misery and uncertainty caused by the coronavirus,\" said senior economist Sal Guatieri of BMO Capital Markets. \"While the recovery is underway, it will take a long time before the economy recovers.\""}]}