{"article": [{"url": "https://www.marketwatch.com/story/despite-concerning-data-white-house-continues-to-downplay-coronavirus-worries-2020-06-16", "published": 1592336300.0, "headline": "Despite concerning data, White House continues to downplay coronavirus worries", "body": "NEW YORK — President Donald Trump has long been fond of crafting his own version of the facts. But when he said “if we stop testing right now we’d have very few cases” of coronavirus, he may have written a new line of attack for critics who question his commitment to following the science. His statement overlooks other important measures of the ongoing coronavirus threat, including hospitalizations and deaths. Trump’s comment Monday was part of a broader administration effort to play down the pandemic, a push that public health experts and Democratic officials worry is sending a dangerous message to the American public as some parts of the country have seen a surge in cases in recent weeks. “An ostrich puts his head in the sand because he doesn’t want to see what’s around him,” said Lawrence Gostin, a public health expert at Georgetown University. “It’s the same thing with Trump.” Last week, the University of Washington’s Institute for Health Metrics and Evaluation published new projections that show COVID-19-related deaths in the U.S. could surpass 200,000 by Oct. 1. The institute said rising rates of infections, hospitalizations and death “are now occurring in the wake of eased or ended distancing policies.” Trump offered more rosy talk Tuesday, predicting that a vaccine would be available by year’s end and adding that “even without it, it goes away.” He offered that optimistic outlook just one day after he attributed surging positive cases to testing in the United States that is “so much bigger and more advanced than any other country.” Read: ‘We’re still in a first wave,’ Fauci says, noting precautions can prevent second wave of coronavirus Vice President Mike Pence, for his part, pushed back in a Wall Street Journal op-ed that the potential for a second wave of the virus was “overblown.’ “Less than 2 percent of the counties in the entire country are seeing any significant increase in cases,” Pence said in a separate Fox News interview. “That’s a tribute to the American people.” But public health experts say Trump and Pence’s ebullience papers over concerning data that suggests that the virus remains a serious threat to Americans’ health and the economy and that the slowing of social distancing and mitigation efforts risks a second wave of the coronavirus in the fall. Chuck Schumer, the Senate Democratic minority leader, criticized the vice president for ridiculing concerns about a second wave. “Dr. Pence would not be someone I’d go to for a medical checkup, or for medical advice,” he said. The Trump administration’s push to diminish concerns about the virus comes as the president looks to resume his reelection campaign in earnest. Trump has seen his support erode over his handling of the pandemic and nationwide protests following the killing of George Floyd, the African American Minneapolis man who died after a white policeman pressed his knee onto Floyd’s neck. In recent weeks, leading public health experts on the White House coronavirus task force have made less frequent public appearances as the White House has sought to focus on the economic recovery from the pandemic. Dr. Anthony Fauci, the government’s top epidemiologist, said in an interview on NPR’s “1A” that he last spoke to Trump about two weeks ago. The coronavirus task force coordinator, Deborah Birx, hasn’t given a major media interview since late May. Trump is set to hold his first campaign rally since early March on Saturday in Tulsa, Oklahoma. Ticketholders were required to acknowledge the risk of exposure to coronavirus and absolve the campaign of liability if they fall ill. Trump also has moved his August nomination acceptance speech at the Republican National Convention to Jacksonville, Florida, after North Carolina’s Democratic governor said he couldn’t assure that the convention could go on as planned in Charlotte without some social distancing measures. “He continues to put politics over public health,” Democratic National Committee chairman Tom Perez said of Trump. Pence pointed to data showing more than half of states are actually seeing cases decline or remain stable. In the six states that have been recording 1,000 new cases a day, increased testing has allowed public health officials to determine that most of the outbreaks are occurring in particular settings — prisons, nursing homes and meatpacking facilities. But experts say testing is identifying just a small fraction of the actual number of infections in this country. In the last several weeks, new cases have decreased in the Northeast and much of the Midwest, while increasing in several states in the South and West. In the past week, hospitalization rates have increased in 11 states in the South and West, according to The COVID Tracking Project, a volunteer organization that collects coronavirus data in the United States. The states are Alaska, Arkansas, Arizona, California, Kentucky, Mississippi, Montana, North Carolina, South Carolina, Texas and Utah. Several of those states have also seen recent increases in the seven-day rolling average on the percent of tests coming back positive, another worrying sign. The reason for the increases can vary. In Arkansas, health officials say it’s specific to a few counties and seems to be largely driven by localized outbreaks related to poultry processing plants. But in Arizona and some other states, the increases are more widespread and suggest community spread that seems to have erupted after the states lifted stay-at-home orders, school and business closures, and other restrictions that were put in place during the spring to stop outbreaks from ever taking off. Phoenix Mayor Kate Gallego said Arizona residents are hearing “mixed messages” from Trump and Pence as well as Arizona’s Republican governor, Doug Ducey, about how careful they need to be. Arizona was among the first to lift its stay-at-home order last month, quickly allowing restaurants, barbershops and even nightclubs to reopen. Ducey has declined to require residents wear masks in public spaces where social distancing is difficult. The state reported 2,392 new coronavirus cases Tuesday, a new daily high, and 25 additional deaths. “We are still very much climbing towards our peak,” Gallego said. “The problem is getting worse in Arizona.”"}]}