{"article": [{"url": "https://www.marketwatch.com/story/stocks-could-be-melting-up-like-they-did-the-roaring-20s-strategist-says-we-all-know-what-happened-next-2020-08-13", "published": 1597487780.0, "headline": "Stocks could be melting up like they did in the Roaring â\u0080\u009920s, strategist says â\u0080\u0094 we all know what happened next", "body": "Mark Twain once said, â\u0080\u009cHistory doesnâ\u0080\u0099t repeat itself, but it often rhymes.â\u0080\u009d Ed Yardeni, chief investment strategist at Yardeni Research, applied those words to what, for most observers, has to feel like a unique climate for playing the market these days. But that is not necessarily the case, according to Yardeni. â\u0080\u009cWe live in interesting, though not unprecedented, times,â\u0080\u009d he wrote in a blog post. â\u0080\u009cThe Roaring 1920s could be a precedent for the Roaring 2020s.â\u0080\u009d For instance, he compared the coronavirus pandemic to the 1918 Spanish Flu, which killed an estimated 50 million people and infected some 500 million around the world. â\u0080\u009cThe good news is that the bad news during the previous precedent was followed by the Roaring 20s,â\u0080\u009d Yardeni wrote. â\u0080\u009cSo far, the 2020s has started with the pandemic, but there are plenty of years left for the prosperous 1920s to become a precedent for the current decade.â\u0080\u009d The key to the next boom, as it was in the 1920, will be technology-enhanced productivity. â\u0080\u009cTodayâ\u0080\u0099s doomsters could be confounded by biotechnological innovations that deliver not only a vaccine for COVID-19 but for all coronaviruses, Yardeni said. â\u0080\u009cScientists are investigating an array of approaches to fight COVID-19. Hopefully, beyond finding a cure or a vaccine, one of the beneficial outcomes of all this research will be that scientists learn many more ways to combat illnesses in general and viruses in particular.â\u0080\u009d Add this to robotics, AI, nanotechnology, blockchain, electric vehicles, quantum computing, etc., and, as Yardeni suggests, we could be looking at a historic transformation, much like the advances in transportation, manufacturing, electricity and plumbing that ensued 100 years ago. Whatâ\u0080\u0099s it all mean for the stock market? Well, as Yardeni told clients in a note Wednesday, he sees a strong finish to the year for the S&P 500 thanks to historic stimulus and a resilient bullish trend. The buying will spill over into 2021, where the S&P could end the year with a double-digit pop, he predicted. â\u0080\u009cThe 1920s ended with a stock-market meltup followed by a meltdown,â\u0080\u009d he said. â\u0080\u009cThe 2020s may already be seeing a meltup, begun on March 23.â\u0080\u009d If history does, indeed, rhyme, this rally has lots of room to run, but investors might want to mark their calendars for the fall of 2029. Meanwhile, the stock market was mixed in Thursdayâ\u0080\u0099s trading session, with the Dow Jones Industrial Average DJIA, +0.56% Â and the S&P 500 SPX, +0.87% Â losing some ground as the tech-heavy Nasdaq Composite COMP, +1.39% Â edged higher."}]}