{"article": [{"url": "https://www.marketwatch.com/story/a-lung-doctor-on-what-shes-learning-about-coronavirus-long-haulers-shortness-of-breath-and-fatigue-and-depression-but-also-improvement-over-time-2020-08-26", "published": 1598857520.0, "headline": "A lung doctor on what sheâ\u0080\u0099s learning about coronavirus â\u0080\u0098long haulersâ\u0080\u0099: shortness of breath, fatigue, and depression but also â\u0080\u0098improvement over timeâ\u0080\u0099", "body": "This interview is the third in a series of conversations MarketWatch is conducting with some of the leading voices in the U.S. on the COVID-19 pandemic. Back in April, Dr. Dixie Harris and about 100 nurses and doctors from the Intermountain Healthcare hospital system in Utah flew to New York City to work in the regionâ\u0080\u0099s overburdened hospitals. Harris, a pulmonologist who studies e-cigarette vaping, worked for days in a row, caring for COVID-19 patients when the regionâ\u0080\u0099s local hospitals were overwhelmed. It was at Southside Hospital in Bay Shore, N.Y., that she started to learn about the virus, about why itâ\u0080\u0099s better to put patients prone, why ventilators arenâ\u0080\u0099t always the best option â\u0080\u0094 and the importance of wearing a face mask. â\u0080\u009cOne hundred of us went,â\u0080\u009d she said. â\u0080\u009cZero came back positive.â\u0080\u009d Back home in the much more sparsely populated state of Utah, cases peaked at 876 on July 9, according to the Utah Department of Health. About 400 people in total have died as a result of a COVID-19 infection. (New York state has reported a total of 430,774 cases and 25,297 deaths as of Aug. 25.) As cases have declined, more of Harrisâ\u0080\u0099 focus has turned to patients who had COVID-19 in the spring and are still dealing with myriad health problems and symptoms months later. Many of these patients in the U.S. call themselves â\u0080\u009clong haulers.â\u0080\u009d They have reported fatigue, chest pain and neurological damage. â\u0080\u009cOne of my first long-hauler patients had symptoms in March,â\u0080\u009d she said. â\u0080\u009cFive months later, and this patient was never in the hospital. Thatâ\u0080\u0099s who Iâ\u0080\u0099m mostly seeing: patients who havenâ\u0080\u0099t been in the hospital but continue to have ongoing symptoms.â\u0080\u009d MarketWatch: When did you travel to New York? Dr. Dixie Harris: We were there three weeks in April. It was pretty intense. It was right as the peak was going down, but there were still six times the number of ICU patients or more for the hospital I was working in. From what I could see, it hit pretty much within a week. It went from next to no COVID patients to overwhelming the whole system. Iâ\u0080\u0099ve had other people ask me, â\u0080\u009cWhy didnâ\u0080\u0099t they just ship some of those patients to another hospital?â\u0080\u009d Well, every hospital in Long Island was overrun with patients. And all the ambulances were so busy bringing new patients in, itâ\u0080\u0099s not like they could say, â\u0080\u009cOh, weâ\u0080\u0099ll take this one patient all the way up to Albany. â\u0080\u009c A tsunami is what they called it because there was no warning and it hit all at once. It was an incredibly dynamic learning environment. From when we started to when I left, care changed markedly. We were intubating early on. And then we said, â\u0080\u009cWait a second, once they go on the ventilator, theyâ\u0080\u0099re on for three weeks. What can we do to avoid this?â\u0080\u009d The big key is proning. Even if you get some respiratory symptoms but you donâ\u0080\u0099t have to be in the hospital, go ahead and move. Prone. Donâ\u0080\u0099t just lay in the bed on your back at home. I will say itâ\u0080\u0099s really hard to lay on your belly when your BMI is 45. When youâ\u0080\u0099re really obese, it feels like you canâ\u0080\u0099t breathe. So I tell the patients to sit up, lean forward. Youâ\u0080\u0099re trying to get the back upright. It was an honor to get to go there. The head of Northwell Health came when we were leaving about to get on the plane and came in to thank us. They did a water cannon salute in New York at the airport. When we were in the waiting area right at the jet way, probably 30, 40 people showed up and just gave us a shout-out clap. All wearing masks, all distanced. MarketWatch: It looks like Utahâ\u0080\u0099s peak was in July. How is it different caring for patients there even now? Harris: We havenâ\u0080\u0099t been overwhelmed. We have not had our ICUs completely full and so because of that weâ\u0080\u0099re doing cutting edge best care possible. Every COVID patient is presented to infectious disease to decide which meds they qualify for. MarketWatch: What has been it been like caring for your long-hauler patients? Harris: The laypeople are calling it long haulers. The British Medical Journal just did a nice review on management of post-acute COVID patients. Theyâ\u0080\u0099re calling it long COVID. In the medical community, we havenâ\u0080\u0099t fully named it. But Iâ\u0080\u0099m [also] aware of patients who consider themselves long haulers who have never (been) diagnosed positive for COVID. They feel they have it because they have the symptoms, the time frame, and all that. MarketWatch: How do you treat patients who are saying they have long-term symptoms? Harris: Thatâ\u0080\u0099s really what we are just learning. Who I get are patients who two to three months later are still having shortness of breath, still having aches and pains, and maybe chest symptoms. Many of them are still on oxygen. Now mind you, we are at higher elevation. So some of these patients would not necessarily be hypoxic if they were at sea level. Still, these are people who are used to living here, so their body is adjusted to it. Dr. Kirk Knowlton, [Intermountainâ\u0080\u0099s director of cardiovascular research, critical care physician Dr. Eliotte Hirshberg] and I are going to be talking to our leadership about developing protocols to take care of these patients. Part of it is to acknowledge that patients are still having symptoms. One of my first long-hauler patients had symptoms in March. I talked to the patient a week and a half ago, and he is still having a little bit of symptoms [but is] markedly better. Back to work now. But five months later, and this patient was never in the hospital. Thatâ\u0080\u0099s who Iâ\u0080\u0099m mostly seeing: patients who havenâ\u0080\u0099t been in the hospital but continue to have ongoing symptoms. In the BMJ article that just was published, theyâ\u0080\u0099re saying that 10% of patients who test positive remain unwell after three weeks. Their definition is if you have symptoms more than three weeks, youâ\u0080\u0099re going into the long haulers. A lot of people are calling long haulers a month out. My colleague and I are presenting to our leadership â\u0080\u0094 heâ\u0080\u0099s a cardiologist, and Iâ\u0080\u0099m a pulmonologist â\u0080\u0094 but weâ\u0080\u0099re the ones who are aware of these cases two, three, four, or five months later. The fatigue and the memory issues. Depression. Thereâ\u0080\u0099s a lot of non-pulmonary issues. Muscle aches. Anxiety. Everybodyâ\u0080\u0099s anxious in the day of COVID, right? Everybodyâ\u0080\u0099s stressed. Everybodyâ\u0080\u0099s had to adjust and learn. Primary careâ\u0080\u0099s going to be addressing more and more of this. And our psychiatric services are going to be seeing this. My long haulers, most of them are on oxygen, and they all have pulmonary symptoms. But every time I see them, theyâ\u0080\u0099re a little bit better. I do see improvement over time. I will say that things such as prolonged symptoms â\u0080\u0094 fatigue, that kind of thing â\u0080\u0094 has been reported in MERS and SARS. MarketWatch: Itâ\u0080\u0099s not just a respiratory illness. Harris: Right. Itâ\u0080\u0099s a blood vessel illness. Itâ\u0080\u0099s a brain illness. Itâ\u0080\u0099s a muscle illness. MarketWatch: Youâ\u0080\u0099ve done some research around vaping and smoking. How do you talk to patients about these types of things in the context of COVID? Harris: Itâ\u0080\u0099s pretty well established that vaping nicotine does weaken the immune system. It especially affects how the nose can fight viruses. And how does COVID get in the system? Eyes, nose, mouth, right? You saw more cases of EVALI (e-cigarette, or vaping, product use associated lung injury) in April and May. A lot of the EVALI, like 90% to 95%, is due to the tainted THC (tetrahydrocannabinol) oil. [THC is the psychoactive ingredient in cannabis that makes people feel â\u0080\u009chigh.â\u0080\u009d] I think people are going to THC with the stress of all the quarantines and all the changes. It makes sense people are reaching for that. Whatever you do, donâ\u0080\u0099t vape the THC. This Q&A has been edited for clarity and length. Read more A Word from The Experts interviews: â\u0080¢ This Seattle man volunteered to be injected with an experimental COVID-19 vaccine: â\u0080\u0098It was kind of my duty as a healthy individual to step upâ\u0080\u0099 â\u0080¢ Dr. Osterholm: Americans will be living with the coronavirus for decades"}]}