{"article": [{"url": "https://www.marketwatch.com/story/the-5-best-minivans-for-your-kids-pets-travel-and-gear-2020-06-16", "published": 1592284340.0, "headline": "The 5 best minivans for your kids, pets, travel and gear", "body": "We understand your pain. Work, kids, weekend activities, family road trips — you need one vehicle that does it all, makes your life easier, and provides maximum safety and security for the people you love the most. Our advice? Get a minivan. Minivans aren’t necessarily boring to drive, as you’ll find with a Honda HMC, -1.21% Odyssey. They can be exceptionally efficient, too, especially the Chrysler Pacifica with its available plug-in hybrid powertrain. On a tight budget? The Chrysler Voyager is the minivan to get. The Kia Sedona boasts exceptional warranty coverage and SUV styling cues, while foul-weather dwellers may prefer the Toyota TM, -0.65% Sienna for its optional all-wheel-drive system. Regardless of your choice, they all supply seating for at least seven people and include sliding side doors that make it easy to load children. They have deep wells behind the third-row seats that won’t disgorge groceries or sporting equipment when you open the rear liftgate. They provide acceptable to exceptional protection based on crash-test ratings. To top it off, minivans are more affordable and efficient than a typical SUV, too. Which one should you get? As ranked by our official expert ratings, these are the best minivans you can buy in 2020.Best minivans of 2020 1. 2020 Honda Odyssey 2. 2020 Chrysler Pacifica 3. 2020 Chrysler Voyager 4. 2020 Toyota Sienna 5. 2020 Kia Sedona1. 2020 Honda Odyssey KBB.com rating: 4.6 out of 5 The Honda Odyssey is the best minivan for the most people. It’s KBB’s highest-rated minivan of 2020, the year’s Minivan Best Buy and the category’s Resale Value Award champion. No surprise that it’s also the bestselling minivan in the country and arguably the best family car ever made. We should know. We lived with one for a year. One of just two minivans to earn a Top Safety Pick rating from the Insurance Institute for Highway Safety (IIHS), the Honda Odyssey is priced from about $32,000 for LX trim, including the destination charge. You’ll want the Odyssey EX (about $36,000) at a minimum, though, for its full suite of advanced driving assistance systems. Leather is available starting with EX-L trim, the Touring gets a built-in vacuum cleaner, and the Elite is loaded with luxuries.2. 2020 Chrysler Pacifica KBB.com rating: 4.5 out of 5 The other minivan on this list to earn a Top Safety Pick rating from the IIHS is the stylish Chrysler Pacifica. Aside from its demonstrated ability to protect your family in a collision, the Pacifica’s unique Stow ‘N Go second-row seats are perfect for people who regularly make use of a minivan’s maximum cargo carrying capabilities. See: New car review: The Hyundai Venue Better yet, the Pacifica Hybrid is a plug-in hybrid supplying 32 miles of electric range before traveling a total of 488 additional miles on the gasoline engine. It starts at about $41,500 before factoring in the $7,500 federal income tax credit and any state or local incentives. Otherwise, your choices include Touring, Touring L, Touring L Plus, Limited, and Red S, all equipped with a powerful V6 engine. They range in price from about $35,250 to $50,000.3. 2020 Chrysler Voyager KBB.com rating: 4.5 out of 5 For 2020, Chrysler FCAU, -0.95% dusts off the classic Voyager nameplate and attaches it to a high-value version of the Pacifica. The two vans are essentially the same vehicle, the Voyager offering less equipment and a lower price. As a result, the Voyager is KBB’s new 5-Year Cost To Own champion. They all have a robust 3.6-liter V6 engine, but the Chrysler Voyager does without Stow ‘N Go second-row seats and doesn’t offer a plug-in hybrid option. The IIHS hasn’t rated it, either, but because it is structurally identical to the Pacifica, and the two vans wear the same sheet metal, protection levels should be the same. Two trims are available: L and LX. Prices start at about $28,500. 4. 2020 Toyota Sienna KBB.com rating: 4.4 out of 5 It’s been a decade since Toyota last redesigned the Sienna, and the minivan’s age shows in its middling frontal-impact crash-test ratings from the IIHS. But when you want all-wheel drive in a minivan, combined with seating for up to eight people and as much as 150 cu-ft of cargo space, well, this is your only choice. Read also: Men say child care has been evenly split under quarantine — women disagree If safety isn’t the current Sienna’s calling card, reliability is. Plus, it’s available with what Toyota calls an Auto Access Seat option, making it easier for physically impaired passengers to get into and out of the van. A variety of Toyota Sienna trim levels cater to budget-minded buyers (Sienna L from about $32,750), driving enthusiasts (Sienna SE from about $39,000), and luxury seekers (Sienna Limited Platinum from about $49,250).5. Kia Sedona KBB.com rating: 4.3 out of 5 What’s that? You didn’t know Kia made a minivan? It does, and the 2020 Sedona is a stylish choice that, if not for the exposed sliding door tracks beneath the rear windows, might be mistaken for a crossover SUV. Also see: These are the best cars for families in 2020 Offering decent IIHS crash-test ratings combined with industry-leading warranty and roadside assistance coverage that puts the other minivans on this list to shame, the Kia Sedona starts at about $28,750 in L trim. It, and the LX (about $31,500), have stain-resistant cloth upholstery, which anyone with little kids will appreciate. The EX (from about $35,000) and SX (from about $42,750) include leather, and all Sedonas have Slide-n-Stow second-row seats that collapse like folding chairs to maximize cargo capacity. Read: The most affordable 3-row SUVs Granted, the Kia Sedona is a bit smaller than other minivans when it comes to cargo capacity, but it offers big bang for the buck for some buyers. More awards The 2020 Honda Odyssey is this year’s Kelley Blue Book Minivan Best Buy as well as the segment’s Best Resale Value Award winner. The 2020 Chrysler Voyager took home the laurels as our 5-Year Cost To Own winner. Three of these five minivans also earned spots on our most recent collection of the Best Family Cars.Best minivan features Some of the cool features that distinguish today’s minivans include onboard vacuum cleaners and seats that slide not just up and back but side to side. There are rear-seat entertainment systems that can stream content from a smartphone, plus wall-type power outlets and HDMI ports to connect videogame consoles. There are even technologies that allow parents to observe and communicate with their children without turning around or yelling. Don’t miss: What it’s like to drive a Tesla Model Y This story originally ran on KBB.com."}]}