{"article": [{"url": "https://www.marketwatch.com/story/what-you-need-to-know-before-signing-a-hush-agreement-2018-03-08", "published": 1602159680.0, "headline": "Everything you need to know before signing a nondisclosure agreement", "body": "President Donald Trump has reportedly made frequent use of nondisclosure agreements — but the average employee should consider the serious repercussions these agreements can have before signing one. The president reportedly requested that physicians and other staff at the Walter Reed National Military Medical Center sign nondisclosure agreements when he made an unscheduled visit to the hospital in November 2019, NBC News reported, citing unnamed sources. Two doctors who declined to sign the agreements were reportedly barred from being involved in Trump’s care. It wasn’t clear whether Trump made a similar request of any of the Walter Reed staff involved in his care after he was diagnosed with COVID-19 last week, NBC News noted. President Trump has used nondisclosure agreements in the past. In 2018, Trump directed his then-lawyer Michael Cohen to seek a restraining order against adult film actress Stormy Daniels after she violated the terms of a nondisclosure agreement that sought to prevent her from talking about their alleged affair, people familiar with the event told The Wall Street Journal. In 2017, Cohen paid $130,000 to Stormy Daniels — whose real name is Stephanie Clifford — as part of that nondisclosure agreement, The Wall Street Journal reported. “ Breaching an NDA can lead to getting fired if it’s part of an employer’s contract. And in rarer cases, it can result in jail time. ” Daniels subsequently filed a lawsuit arguing that the settlement was invalid because “David Dennison,” allegedly the alias used for Trump, never signed it. Daniels used the pseudonym “Peggy Peterson.” The lawsuit was dismissed because the agreement was ruled to be unenforceable, and a California judge ordered Trump to pay Daniels more than $44,000 to cover her legal fees related to the case. Following leaks at the beginning of his presidency, Trump reportedly asked senior White House staff to sign nondisclosure agreements or NDAs, according to a report from Washington Post columnist Ruth Marcus. Unnamed sources told Marcus that the agreements were designed to last beyond Trump’s presidency and carried steep financial penalties if broken. Others have previously suggested that some of these agreements may be both unenforceable and unconstitutional. As federal employees, White House workers are protected by the First Amendment and cannot be silenced on criminal activity they observe. But before Trump’s use of nondisclosure agreements came into the spotlight, a number of women claimed that they had signed confidentiality agreements as part of settlements made with disgraced Hollywood mogul Harvey Weinstein. And Olympic gold medalist McKayla Maroney signed one as part of a settlement following sexual abuse by USA Gymnastics team doctor Larry Nassar, who was sentenced to up to 175 years for his crimes. Here is what employees need to know about nondisclosure agreements:What are nondisclosure agreements and how do they work? These sorts of agreements can go by many names, said Donna Ballman, an employment lawyer and author of the book “Stand Up For Yourself Without Getting Fired.” “Nondisclosure, hush, confidentiality — no matter what you call it, they are probably the same thing,” Ballman said. The agreements generally bar one or more parties from disclosing the terms of a settlement. Generally, they will describe what information a person can and cannot discuss publicly, and over what period of time the agreement is valid. In some cases, hush agreements will include non-disparagement clauses that bar someone from saying negative things about the other people who formed the agreement, Ballman said. While many recent examples in the news have involved instances of sexual harassment or assault, the agreements can be used for a variety of settlements. Ballman said consumers were most likely to encounter them in product liability settlements or as part of severance packages. Start-ups and inventors may use these agreements to prevent them from revealing proprietary information, while researchers may employ them among participants in studies. Public figures may use them for domestic staff, including housekeepers and even babysitters.What happens when you break a nondisclosure agreement? Stormy Daniels may have sought to have her hush agreement with Trump thrown out so she could tell her story, but experts suggest that approach might not be particularly fruitful for the average person. “That is rarely considered a real defense because most employers will quickly produce a signed copy,” Ballman said. “But if there was a breach on the other side, that may well mean she’s no longer obligated to comply.” First and foremost, breaking one of these agreements often has financial implications — and many agreements will have specific “liquidated damages” clauses, Ballman said. If someone entered into an NDA as part of a settlement, the affected party could sue to get the money back and possibly for additional damages. Daniels, her lawyer told CNN, was allegedly threatened with a $1 million fine for every public appearance in relation to the alleged affair. In some states, violating a confidentiality agreement means the non-breaching party no longer has to follow the agreement’s directives. Breaching an NDA can lead to getting fired if it’s part of an employer’s contract. And in rarer cases, it can result in jail time if a court finds that the breach constituted theft of proprietary information.Should I avoid signing a nondisclosure agreement? The Weinstein scandal prompted many to question the use of nondisclosure agreements, particularly in the context of sexual harassment. Consumers should be aware of their rights before signing such agreements. The National Labor Relations Board believes that non-disparagement provisions that prohibit employees from criticizing a company’s executives publicly are an unfair labor practice. And federal civil rights law supersedes settlements that seek to prevent someone from filing sexual harassment charges, which means you may still be able to file a sexual harassment lawsuit even if you’ve signed an NDA. Ultimately, someone considering signing an NDA should seek legal counsel. They should also carefully weigh what information would have to remain confidential under such an agreement and what effects that could have. “Contrary to NDAs that permit parties to do business together or protect proprietary rights, NDAs that hide harassment withhold crucial information from the profession and the public,” Annie Hill, an assistant professor at the University of Minnesota, wrote regarding the Weinstein allegations. This story was updated on Oct. 8, 2020."}]}