{"article": [{"url": "https://www.marketwatch.com/story/do-you-really-need-8-million-saved-up-for-retirement-2020-09-11", "published": 1600180040.0, "headline": "Do you really need $8 million saved up for retirement?", "body": "Have I not been pessimistic enough? In a recent column, you may recall, I argued that retirees are caught on a treadmill fueled by low interest rates. On the one hand those low rates are crucial to keeping the stock bull market going, but on the other hand those rates mean that your portfolio dollars don’t go as far as they did previously. In short, retirees are having to run faster just to stay even. Read: How to buy 10 years of retirement for $3,650 Gloomy as this was, it was nothing compared with the picture painted by the popular Financial Samurai blog. As fellow columnist Shawn Langlois summarized, the author of this blog in effect argued that you would need an $8 million portfolio in order to have retirement income of $40,000 a year. Ouch. Fortunately, the situation is not nearly as bleak as this. One way to show this is to focus on how a big your portfolio needs to be in order to purchase a guaranteed lifetime income in excess of $40,000 annually. The answer, even with today’s low interest rates, is less than $1 million. While that is still an imposing amount of money, it’s a lot less than $8 million. Consider the accompanying chart, which reports the annuity payout you can purchase today with $1 million. The data are courtesy of an online comparison tool at ImmediateAnnuities.com. I assumed a single male, either aged 65 purchasing an immediate annuity or aged 60 purchasing a deferred annuity to begin payouts in five years’ time. The chart reports the yearly payment level assuming either no inflation adjustment or what it would be in the first year if, in each subsequent year, it was 3% higher. Notice that in no event is the annuity’s annual payout less than $40,000. Read: What will 2030 look like for people over 60? Why did the Financial Samurai conclude that you need so much money to retire on $40,000 a year? The author derived it from the annual income you would earn if you took your entire retirement portfolio and purchased a 10-year Treasury. That admittedly is a low number. That is too pessimistic, however, for several reasons. First, in retirement you are able to draw down your portfolio’s principal in addition to living on its income. This is why the tax code treats a big chunk of an annuity payment as tax-free, since it represents a return of principal. So take this into account when comparing annuities to other possible retirement finance options; on an after-tax basis, the annuity is likely to look even more favorable. Another reason the Financial Samurai analysis is too pessimistic: Annuity rates are more correlated with the corporate bond yield than the Treasury yield, as I showed in the chart that accompanied my recent column. Though the corporate bond yield has been coming down in recent years, it is still larger than the Treasury yield. Furthermore, most researchers have found, you most likely will have a higher retirement standard of living if you do not annuitize with 100% of your retirement portfolio. Some financial planners recommend that you do so with perhaps one-third of it. The guaranteed lifetime income it would provide will enable you to take on more risk than otherwise with the balance of your portfolio, which should in turn improve your retirement standard of living relative to what it would be if you annuitized your entire net worth. So the analysis presented here is the minimum. To the extent you are able to do better, of course, then you would need less than $1,000,000 to fund a retirement income of $40,000 annually. None of this discussion suggests it is easy to finance a comfortable retirement. But, by the same token, it’s important also not to exaggerate how hard it will be.Inflation I also want to focus on the impact of inflation on retirement income. Which do you think is a better deal to purchase with $1 million? An immediate annuity that provides no cost-of-living adjustment (which in the accompanying chart translates into an annual payout of $59,124) or one whose payout grows 3% a year (which, per the chart, translates into an annual payout in the first year of $42,288)? By way of an answer consider that, in the 13th year, the annuity with the 3% COLA will pay out $60,293, more than the $59,124 of the annuity with no annual increase. And, cumulatively over the next 23 years, the total dollars paid out by the 3% COLA annuity will have exceeded the annuity with no adjustment. So your choice between these two annuities will depend in part on your life expectancy. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com."}]}