{"article": [{"url": "https://www.marketwatch.com/story/hundreds-of-thousands-ordered-to-flee-coast-ahead-of-laura-2020-08-25", "published": 1598362040.0, "headline": "Hundreds of thousands ordered to flee Gulf Coast ahead of Laura", "body": "Hundreds of thousands of people were ordered to evacuate the Gulf Coast on Tuesday as Laura strengthened into a hurricane that forecasters said could slam into Texas and Louisiana as a major storm with ferocious winds and deadly flooding. More than 385,000 residents were told to flee the Texas cities of Beaumont, Galveston and Port Arthur, and still more were ordered to evacuate low-lying southwestern Louisiana, where forecasters said as much as 13 feet (3.96 meters) of storm surge topped by waves could submerge entire communities. The National Hurricane Center projected that Laura would become a Category 3 hurricane before making landfall late Wednesday or early Thursday, with winds of around 115 mph (185 kph) capable of inflicting devastating damage. “The waters are warm enough everywhere there to support a major hurricane, Category 3 or even higher. The waters are very warm where the storm is now and will be for the entire path up until the Gulf Coast,” National Hurricane Center Deputy Director Ed Rappaport said. Ocean water was expected to push onto land along more than 450 miles of coast from Texas to Mississippi. Hurricane warnings were issued from San Luis Pass, Texas, to Intracoastal City, Louisiana, and storm surge warnings from the Port Arthur, Texas, flood protection system to the mouth of the Mississippi River. As of Tuesday morning, Laura was 585 miles (940 kilometers) southeast of Lake Charles, Louisiana, traveling northwest at 16 mph (26 kmh). Its peak winds were 75 mph (120 kph). The hurricane center nudged its forecast track a bit farther west as computer simulations pushed the storm closer to Texas. There was little to keep Laura from turbocharging. Nearly all forecasts showed rapid strengthening at some point in the next couple of days. Laura passed Cuba after killing nearly two dozen people on the island of Hispaniola, including 20 in Haiti and three in the Dominican Republic, where it knocked out power and caused intense flooding. The deaths reportedly included a 10-year-old girl whose home was hit by a tree and a mother and young son crushed by a collapsing wall. On top of storm surge that could penetrate miles inland, as much as 15 inches (38 centimeters) of rain could fall in some parts of Louisiana, said Donald Jones, a National Weather Service meteorologist in Lake Charles, Louisiana — near the bullseye of Laura’s projected path. On Grand Isle, Nicole Fantiny said she planned to ride out the hurricane on the barrier island along with a few dozen other people. “It could still change, but we keep on hoping and praying that it keeps on going further west like it’s doing,” said Fantiny, who manages a restaurant on the island. Marco, a system that approached land ahead of Laura, weakened into a remnant just off Louisiana’s shore on Tuesday. Satellite images showed a disorganized cluster of clouds, what meteorologists call “a naked swirl,” Jones said. Meanwhile, Laura powered up. The crew of a hurricane hunter plane confirmed that Laura became a hurricane with top winds of 75 mph winds (120 kmh) shortly after passing between the western tip of Cuba and Mexico’s Yucatan Peninsula. The hurricane center warned people not to focus on the details of the official forecast since storm surge, wind and heavy rain will extend far from Laura’s center. In Galveston and Port Arthur, Texas, mandatory evacuation orders went into effect at 6 a.m. Tuesday. People planning on entering official shelters were told to bring just one bag of personal belongings each, and a mask to reduce the spread of coronavirus. “If you decide to stay, you’re staying on your own,” Port Arthur Mayor Thurman Bartie said. Officials in Houston asked residents to prepare supplies in case they lose power for a few days or need to evacuate homes along the coast. Some in the area are still recovering from the devastation of Hurricane Harvey three years ago. State emergencies were declared in Louisiana and Mississippi, and shelters opened with cots set farther apart, among other measures designed to curb coronavirus infections. Laura’s arrival comes just days before the Aug. 29 anniversary of Hurricane Katrina, which breached the levees in New Orleans, flattened much of the Mississippi coast and killed as many as 1,800 people in 2005. Hurricane Rita then struck southwest Louisiana that Sept. 24 as a Category 3 storm. Now southwest Louisiana again faces the threat of being hit by a major hurricane, and Rita is on the mind of Ron Leleux. “When something like this comes up, I think people go back, and it brings back a lot of bad memories,” Leleux said from his home in Sulphur, where he served as mayor from 2002 to 2010. In Waveland, Mississippi, a coastal town devastated by Katrina in 2005, Jeremy Burke said the biggest threat is the storm surge. When Katrina struck, the wind caused damage, but the storm surge “put the nail in the coffin,” said Burke, who owns Bay Books in nearby Bay St. Louis. Many Waveland residents are staying in place as Laura bears down, but they also have their cars and trucks gassed up in case the forecast grows more ominous, Burke said. “People are prepared to possibly go at the drop of a hat,” he said. “We never take a storm for granted. We might have dodged a bullet with Marco, and obviously some people along the Gulf Coast are not going to be as blessed as us.” ___"}]}