{"article": [{"url": "https://www.marketwatch.com/story/if-you-want-to-live-to-100-do-this-one-thing-2020-06-23", "published": 1592920220.0, "headline": "If you want to live to 100, do this one thing", "body": "Hundreds of thousands of Americans are going to live to be 100 in the coming decades. And if you want to be one of them, here’s one thing you might want to do. Move into the city. Actually, don’t just move into the city, but specifically to a walkable urban neighborhood. The kind of place with sidewalks and cafes and parks where people stroll around. And make it an area where there are young, middle-aged and elderly people mixed in together. Don’t hang out in the suburbs. Don’t live way out in the countryside. So says a new study of nearly 150,000 elderly people in Washington state conducted by researchers at Washington State University. “Walkability had a strong positive correlation with the likelihood of reaching centenarian age by area,” the researchers write. “Protective factors for becoming a centenarian were higher walkability index and living in areas with a higher percentage of working age population…Individuals living in small towns or rural areas were less likely to become a centenarian compared with those living in metropolitan areas.” They used a walkability measure tracked by the Environmental Protection Agency. Ironically the results come as the coronavirus crisis may be causing some people to rethink a move to the city. Walking around in a crowded neighborhood and taking public transportation sound like two ways of exposing yourself to the virus. It sounds safer to be driving around in a car and hunkering down in a house way out of town, right? But this, too, will pass. Washington state researchers studied 144,665 people who made it at least to age 75, and then looked at those who lived much longer, if possible to 100 or more, and what they had in common. And urban neighborhoods proved a key health factor, especially as we get older. “Walkable and bikeable streets and clean, accessible parks are linked to increasing physical activity of the surrounding population by 30%,” they report. “Walkable neighborhoods are especially important for older adults who may have decreased mobility and no longer drive, as they are likely to benefit from easier access to their community afforded by walkable neighborhoods.” Those who live in the city and walk around get more exercise and have lower body weights on average, they add. They also have easier access to healthy food, hospitals, clinics and other amenities. They didn’t add, but might have done: Elderly people who live in vibrant local urban neighborhoods are less likely to suffer the loneliness that comes with old age and may be bad for your health, too. As previous studies have pointed out, there is more to “walkability” than just sidewalks and parks. You also want social cohesion and low rates of crime. There are currently about 70,000 people in America age 100 or older, according to a United Nations estimate. By 2050 it predicts that number will rocket to 378,000, or about one person per thousand. (What affect the coronavirus pandemic will have on this trajectory remains to be seen.) The latest study adds some new wrinkles to the growing understanding of what we all have to do to make it to 100. For instance: There is plenty of evidence that once you control for all other factors, being wealthier and having a higher income is generally good for your health and longevity. But as a recent Canadian study pointed out, people who live in urban neighborhoods are often less likely to be rich than those who live in the suburbs: And because they walk more, they tend to be slimmer, fitter and be less prone to diabetes. Meanwhile, the study unveiled a finding that is likely to be controversial: That education may, at least at later ages, be bad for your health. Those in the sample who had college degrees were far less likely to make it to 100 than those who never even finished high school. That goes against other findings on education and health, and will doubtless be subject to scrutiny. It could be a statistical fluke in the study. Or it could represent something intriguing — like the idea that those with more education are subjecting themselves to more, needless stress."}]}