{"article": [{"url": "https://www.marketwatch.com/story/trumps-coronavirus-recovery-stimulus-hope-election-clarity-whats-really-driving-the-market-11601928883", "published": 1601933420.0, "headline": "Trump's coronavirus recovery, stimulus hope, election clarity: What's really driving the market?", "body": "Markets were bounding higher Monday, as President Donald Trump indicated that he was healthy enough to be discharged from Walter Reed Medical Center. It isn't clear why the market is rising sharply on the session, other than as an inverse response to the uncertainties that the president's coronavirus diagnosis on Friday delivered to Wall Street investors. Read: As Dow jumps over 400 points, history shows investors are quick to shrug off presidential health woes Questions abound about the outlook for the economy and the course of the COVID-19 pandemic , not to mention the 2020 presidential election on Nov. 3. Nonetheless, the stock market has found cause to rally, with the Dow Jones Industrial Average DJIA, +0.56%, the S&P 500 index SPX, +0.87%, the Nasdaq Composite Index COMP, +1.39% and the small-capitalization Russell 2000 index RUT, +0.55% all scoring a sharp, broad advance on Monday. Stimulus talks in the driver's seat So what's underpinning the current ascent and is the market properly accounting for a host of challenges ahead, with fewer than 30 days left until the race for the White House meets its end? Robert Pavlik, chief investment strategist, at SlateStone Wealth, told MarketWatch that there are several key components to the market's current advance: Hope for an additional stimulus package Outcome of congressional elections Election Day results Successful coronavirus drugs \"Stimulus is in the drivers seat and the election has moved from the passenger seat to the back seat,\" Pavlik said. He says that additional aid will go a long way toward helping to push the market to fresh gains and sees the possibility of a blue wave, adding to the conviction for the bulls. That is not because investors view Democratic dominance as bullish for markets overall, but because a more left-leaning government might produce a far-ranging stimulus package that could help boost markets in the near-term and midterm. Traditionally, a one-sided government, dominated either by Republicans or Democrats, would lead to a weaker performance in the stock market, data show. The market's move on Monday \"is an implicit bet that there will be massive fiscal stimulus spend,\" Boris Schlossberg, managing director of BK Asset Management, told MarketWatch in a phone interview. \"Given the poll, it is not even a question of Biden winning but what's really necessary is a full blue wave necessary for true fiscal spend to happen and necessary for the market to continue rising,\" the analyst said. Biden's election margin widening Biden's lead over Trump has widened, according to a poll conducted by The Wall Street Journal and NBC News in the two days following the debate but before Trump revealed his COVID-19 diagnosis. Investors have also viewed that as lowering the chances for a disputed election result where the loser declines to immediately concede defeat or a winner isn't readily apparent. Surveys in battleground states, which could prove crucial in this highly contentious election, also showed a bigger gap for Biden, according to an average of recent polls. The former vice president was enjoying a 4 percentage point margin, 49 to 45, while a national average of polls from RCP shows Biden's margin at 8.5 percentage points at 50.7 to 42.2. The potential for a decisive victory from Biden is seen as adding to the market's hope for a noncontroversial election outcome. \"Given that Vice President Biden has been ahead in most polls, this suggests that markets are assigning a bit more probability to his win and a bit less to a close and contested outcome,\" wrote analysts at Barclays in a research note dated Monday. \"The odds are that the rally will start to build legs two weeks before the U.S. presidential election as volatility drops and is sold across the board, pricing out the risk of a protracted legal fight, to then be followed by the beginning of trends in indices with growth, quality and cyclicals leading the way as well as emerging markets,\" wrote Sebastien Galy, analyst at Nordea Investment, in a research note. Is a Biden win priced in? Although the markets appear to be expecting Democratic dominance in November voting, it isn't clear that a Biden victory is fully priced into the market and what impact it will have in the long term, should it come to pass. Galy speculated that market participants are likely partially positioned for a Trump loss and bracing for a Biden win that could introduce policies viewed as bearish in the short term, including higher corporate taxes and a stricter regulatory regime that targets a possible breakup of big technology giants. \"Stock market leaders are most vulnerable to Joe Biden's plan, according to the Wall Street Journal,\" The Nordea analyst noted. \"This is likely partially priced in.\" That said, many investors still see upside for the broader market under a Biden presidency. Trump recovering with stocks? Pavlik said that the move in stocks higher as Trump is showing signs of recovering from COVID-19 shouldn't be necessarily interpreted as an endorsement by financial markets for a second term, even though the 45th president is viewed as a business-friendly leader. Instead, he said investors are weighing the success of therapeutics and remedies administered to the commander-in-chief as offering some indication of progress made toward combating the disease that has infected over 35 million people globally, killing nearly 210,000 in the U.S., alone, according to data aggregated by Johns Hopkins University. Trump was treated with Regeneron Pharmaceuticals Inc.'s REGN, +0.36%  still-investigational antibody treatment, Gilead Sciences Inc.'s GILD, +0.82% remdesivir, supplemental oxygen at least once, and dexamethasone, in that order, according to Dr. Sean Conley, Trump's physician. I think part of the market's reaction is due to \"the fact that at least from what we've been told, Trump is responding positively\" to the regimen, Pavlik said. Trump tweeted on Monday afternoon that he would be discharged from Walter Reed National Military Medical Center at 6:30 p.m. Eastern, following a 3-day stay. iframe.twitter-tweet { width: 100% !important; } Another read of Trump's contraction of the virus is that it \"could lead to far broader adoption of mask-wearing as average Americans,\" wrote Kristina Hooper, Invesco's chief global markets strategist. \"In turn, this could slow the spread of COVID-19, which should be a significant positive for the economy, especially as we worry about a possible second wave this fall.\" Risk guideposts? Overall, the market is sending mixed signals about what it is weighing as the most important factors for investors over the coming weeks and months. The 10-year Treasury yield TMUBMUSD10Y, 0.777% has climbed, as prices have fallen, suggesting that risk is starting to be dialed down even by the fixed-income set, a group that has come to harbor extremely conservative views on the economic outlook. However, another haven asset gold GOLD, +2.86% rose to its highest level in weeks to around $1,920, while the dollar weakened on Monday, implying that a contingent of investors are positioning for a rougher road ahead for financial markets. Meanwhile, the so-called fear gauge, the Cboe Volatility Index VX00, -6.66% VIX, -5.15% also was rising along with stocks. The reading of implied volatility, which reflects options bets on the S&P 500 in the coming 30-day period, usually, usually falls as stocks rise and is used as a gauge against coming drops in the market."}]}