{"article": [{"url": "https://www.marketwatch.com/story/dow-slips-as-china-us-tensions-seen-ratcheting-up-while-investors-watch-for-earnings-from-tesla-microsoft-2020-07-22", "published": 1595435840.0, "headline": "Dow ends above 27,000 for first time in six weeks as defensive plays gain amid latest China-U.S. tussle", "body": "U.S. stocks closed higher Wednesday ahead of corporate results from Tesla and Microsoft, but with buying seen in utilities and other sectors viewed as defensive as Sino-American tensions rise. Market participants also remain concerned about the status of Congressional negotiations on another financial aid package for businesses and individuals coping with the economic damage wrought by the coronavirus pandemic. How did benchmarks fare? The Dow Jones Industrial Average DJIA, +0.56% jumped 165.44 points, or 0.6%, to end at 27,005.84, its highest close since June 9, according to Dow Jones Market Data. The S&P 500 SPX, +0.87% gained 18.72 points, or 0.6%, to close at 3,276.02, its forth straight day of gains. The Nasdaq Composite Index COMP, +1.39% added 25.76 points, or 0.2%, finishing at 10,706.13, after trading in negative territory earlier in the session. On Tuesday, the Dow added 159.53 points, or 0.6%, to end at 26,840.40, the S&P 500 index rose 5.46 points, or 0.2%, at 3,257.30, marking its highest close since Feb. 21 and putting the benchmark 3.8% from its Feb. 19 closing high. Meanwhile, the Nasdaq Composite Index closed 86.73 points, or 0.8%, lower at 10,680.36, What drove the market? Renewed anguish over relations between Beijing and Washington were back in focus Wednesday after the U.S. instructed China to close its consulate in Houston. The development represented a “political provocation unilaterally launched by the U.S.,” China’s Foreign Ministry said during a regular news briefing in Beijing. “China urges the U.S. to immediately rescind its erroneous decision, otherwise China will undertake legitimate and necessary responses,” the official said. “It’s certainly an issue today,” said James Ragan, director of wealth management research at D.A Davidson, in Seattle, in an interview with MarketWatch. “The market feels a little more defensive than what we’ve seen. We can attribute that to the China flare up.” Simmering tensions between the global superpowers raise additional risks for the valuations of multinational corporations already under pressure from a worsening of the coronavirus pandemic in the U.S. and both factors worked to keep recent stock gains in check on Wednesday. China also said Tuesday it would take unspecified “necessary measures” after the U.S. government imposed trade sanctions on 11 companies it says are implicated in human rights abuses in China’s Muslim northwestern region of Xinjiang. Another concern has been that any additional Congressional economic package won’t arrive before a $600-a-week top-up in jobless benefits runs out for millions of Americans at the end of the month. On Tuesday, Senate Majority Leader Mitch McConnell said Congress is unlikely to pass a new fiscal stimulus bill before lawmakers head to recess in two weeks. “A tailwind for stocks has been expectations for further stimulus from Washington and that there’s more to follow, which is warranted, given this is an election year,” Scott Clemons, chief investment strategist at Brown Brothers Harriman, told MarketWatch. Investors also kept second-quarter results from American corporations in focus, with Tesla Inc. TSLA, +1.89% and Microsoft Corp. MSFT, +2.48%, which reported after the bell, among the prominent names on Wednesday. Microsoft announced record quarterly revenue Wednesday, but shares still shrank from near-record highs in after-hours trading. Thus far, quarterly results have been better than feared. Of the 58 companies that have reported results thus far, 77.6% have reported above analyst expectations, compared with the average of 65% who reported above consensus estimates in prior quarters, according to data from Refinitiv, based on data going back to 1994. A little over 22% have reported results that fall below expectations, versus an average of 21% missing, the data show. “There is a reasonably firm bid underneath stocks in general,” Anik Sen, global head of equities at PineBridge Investments, pointing to signs of improvement in economy activity, as well as more focus on stocks beyond the top one-third driving equity indexes higher. “What I’m seeing now is an improvement in the breath of participation.” In pandemic news, the number of confirmed cases of COVID-19 cases in the U.S. rose above 3.8 million on Tuesday, data show, as President Donald Trump changed his view of face masks in the face of falling poll numbers ahead of the November elections. Holding his first White House task force briefings in months on the status of the epidemic on Tuesday, Trump said that the coronavirus outbreak could “get worse before it gets better.” There are now 14.8 million confirmed cases of COVID-19 worldwide and at least 611,599 people have died, the Johns Hopkins data shows. On the U.S. economic front, existing home sales jumped 20.7% in June, running at a seasonally adjusted annual pace of 4.72 million.Which stocks were in focus? InternationalBusiness Machines Corp. IBM, -2.81% rose 2.1% after reporting second-quarter net income of $1.36 billion, or $1.52 a share, compared with $2.5 billion, or $2.81 a share, in the year-ago period. Pfizer Ltd. PFIZER, +0.37% shares gained 5.1% and those of BioNTech BNTX, +1.23% rose 13.7% after the companies said they will receive $1.95 billion from the U.S. government to produce at least 1 million doses of their experimental COVID-19 vaccine if it receives approval or emergency use authorization from the Food and Drug Administration. McDonald’s Corp. MCD, -0.43% shares gained 2.9% after Keybanc Capital increased its share price target for the fast-food chain to $215 from $200. Snapchat parent Snap Inc. SNAP, -0.18% fell 6.2% after the social-media company missed expectations on daily active users. United Airlines Holdings Inc. UAL, +0.32% stock fell 4.2% after it said late Tuesday that it lost $1.6 billion, or $5.79 a share, in the second quarter, contrasting with a profit of $1.05 billion, or $4.02 a share, in the year-ago quarter. Biogen Inc. BIIB, -0.13% said late Tuesday that Michael McDonnell will become chief financial officer on Aug. 15, a day before reporting its quarterly results. Its shares gained 0.2%. The biggest blank-check buyout company sponsored by hedge fund billionaire Bill Ackman started trading on Wednesday under the name Pershing Square Tontine Holdings US:PSTH. It soared 6.5%. Slack Technologies Inc. WORK, +3.36% said Wednesday that it has filed a competition complaint against Microsoft Corp. MSFT, +2.48%, alleging illegal and anti-competitive practice of abusing its market dominance, before the European Commission. Shares of Slack slipped 5.1%, while Microsoft’s shares gained 1.4%. Advanced Micro Devices AMD, -3.94% shares rose 8.4% to end at an all-time high on Wednesday, according to Dow Jones Market Data. Read: Tesla’s earnings on tap this week: Will a loss end its blowout stock rally?How did other markets trade? In Europe, the Stoxx 600 Europe index SXXP, +0.55% ended 0.9% lower, while the U.K.’s FTSE UKX, +0.64% finished 1% lower. Germany’s DAX 188658, +0.18% lost 0.5%, after a 1% gain on Tuesday as the European Union forged its landmark recovery package. Gold futures US:GCQ20 extended their climb, rising $21.20, or nearly 1.2%, to settle at $1,865.10 an ounce in Wednesday on the New York Mercantile Exchange,their highest since Sept. 2011. September futures for the U.S. crude benchmark US:CLQ20 ended little changed at $41.90 a barrel, down 2 cents, after surging 2.8% on Tuesday. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 1.1 basis point to around 0.595%. Bond prices move in the opposite direction of yields. In currency markets, the dollar shed 0.2%, against its six major rivals based on trading of the ICE U.S. dollar index. DXY, -0.58% In Asia, the Nikkei NIK, -0.11% closed 0.6% lower, while China’s CSI 300 gauge 000300, +2.04% added 0.5%. South Korea’s Kospi 180721, +0.21% finished in negative territory but virtually unchanged; and Hong Kong’s Hang Seng index HSI, -0.30% tumbled 2.3%, wiping out its Tuesday gain. Mark DeCambre contributed reporting"}]}