{"article": [{"url": "https://www.marketwatch.com/story/pending-home-sales-continued-to-rebound-across-the-country-in-june-for-now-2020-07-29", "published": 1596021080.0, "headline": "Pending home sales continued to rebound across the country in June (for now)", "body": "The numbers: The index of pending home sales rose 16.6% in June as compared with May, the National Association of Realtors reported Wednesday. The increase comes after pending home sales experienced the largest monthly rise on record last month, the trade group said. Compared with a year ago, contract signings were up 6.3%, a sign of how sharply the market has rebounded from its coronavirus-related low. “It is quite surprising and remarkable that, in the midst of a global pandemic, contract activity for home purchases is higher compared to one year ago,” Lawrence Yun, the National Association of Realtors’ chief economist, said in the report. “Consumers are taking advantage of record-low mortgage rates resulting from the Federal Reserve’s maximum liquidity monetary policy.” The index measures real-estate transactions where a contract was signed for a previously-owned homes but the sale had not yet closed, benchmarked to contract-signing activity in 2001. What happened: Every region experienced a monthly increase in pending home sales, led by the Northeast (up 54.4%). However, the Northeast was the only region that did not experience a year-over-year uptick in contract signings, a reflection of the longer pandemic-related lockdowns in those states. The trade group now expects that existing-home sales will only drop by 3% for all of 2020. The big picture: The continued rebound in pending home sales suggests that the real-estate market is thriving in spite of the continued rise in COVID-19 cases across the country. Two main factors are driving the surge in home-buying activity. Many buyers appear to be entering the market looking to make up for lost time — as such, the rise in sales is a reflection of the delays caused by the coronavirus outbreak. The low mortgage rate environment has also created a sense of urgency among Americans looking to purchase a home and lock in an attractive interest rate. Nevertheless, headwinds remain for the nation’s housing market. There’s still a shortage of homes available for sale, and some sellers continue to stay on the side lines rather than list their properties. The supply situation will inherently limit how many deals can close. “The impacts of social distancing seem to have more lasting impacts on supply, as new listings remain well below the 2019 levels despite the resurgence of demand we saw in May and June,” said Ruben Gonzalez, chief economist at real-estate brokerage Keller Williams. And while low mortgage rates are popular, if they stay this low for an extended period of time, the novelty will likely wear off, experts say. Once Americans get used to sub-3% rates, they may not act as the same catalyst driving sales volumes as they are now, Realtor.com chief economist Danielle Hale told MarketWatch when the 30-year mortgage dropped below 3% on average for the first time earlier in July. Finally, coronavirus cases have continued to increase across much of the country throughout the summer, including in Sunbelt states with some of the largest real-estate markets in the country. It’s not fully clear yet how that rise in cases may affect consumer confidence and people’s interest in buying a home in those areas. And the quick adoption of virtual home-showing technology across the real-estate industry should stave off some of the negative effects from the rise in COVID-19 cases, Gonzalez said. What they’re saying: ”The numbers tend to trend broadly in line with mortgage applications, which have fully recovered from their COVID-induced drop in the early spring,” Ian Shepherdson, chief economist at Pantheon Macroeconomics, said in a research note. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and the S&P 500 SPX, +0.87% were both up slightly in Wednesday morning trading ahead of an antitrust hearing with tech giants Apple AAPL, +1.74%, Amazon AMZN, +3.01%, Facebook FB, +0.26% and Alphabet GOOGL, +1.82%. The 10-year Treasury note’s yield TMUBMUSD10Y, 0.777% was down as traders waited for a policy update from the Fed."}]}