{"article": [{"url": "https://www.marketwatch.com/story/why-trumps-virus-infection-resonates-globally-and-adds-a-new-layer-of-uncertainty-to-world-affairs-2020-10-02", "published": 1601641760.0, "headline": "Why Trump's virus infection resonates globally, and adds a new layer of uncertainty to world affairs", "body": "U.S. President Donald Trump tweeted early on Friday that he and first lady Melania Trump had tested positive for coronavirus and would begin a \"quarantine and recovery process immediately.\" \"We are feeling good,\" Melania Trump also tweeted. - The news came hours after the White House announced that presidential aide Hope Hicks had contracted COVID-19 after traveling with the U.S. president several times earlier this week. - Trump, at 74, is in an age category that puts him at a high risk. White House physician Dr. Sean Conley said in a memo early on Friday that the presidential couple was \"well at this time\" and that Trump could carry out his duties \"without interruption.\" Meanwhile, Vice President Mike Pence tested negative for the virus on Friday and remains in good health, a spokesman said. - The U.S. president, in a debate with Joe Biden, his Democratic adversary in the Nov. 3 presidential election, insisted that \"the end of the pandemic [was] in sight,\" and mocked his rival's frequent use of protective face masks. - Trump is the second leader of the G-7 group of industrial nations to test positive for the virus, after U.K. Prime Minister Boris Johnson, who had to be hospitalized in April. Read:What happens when a world leader tests positive for COVID-19 The outlook: The U.S. president's virus infection adds a new layer of uncertainty to world affairs, which his first term had already thrown into turmoil. The U.S. presidential campaign will be disorganized in the short term, with election rallies and the remaining presidential debates likely to be canceled. The true impact of the president's disease on the election will, however, depend on whether or not he develops symptoms, and then how serious his condition turns out to be. He could emerge from quarantine in good health, and then go on bragging about his triumph over adversity and his physical resilience. Or if his condition worsens, he could also appear, in the last month of the campaign, as the weakened president fallen victim to a pandemic he dismissed. Read:World leaders react to President Donald Trump saying he tested positive for COVID-19"}]}