{"article": [{"url": "https://www.marketwatch.com/story/airlines-restaurants-on-pelosis-radar-for-additional-aid-in-another-covid-19-bill-11600457708", "published": 1600443740.0, "headline": "Airlines, restaurants on Pelosi's radar for additional aid in another COVID-19 bill", "body": "WASHINGTON, DC: Speaker of the House Nancy Pelosi (D-CA) talks to reporters during her weekly news conference in the U.S. Capitol Visitors Center July 16, 2020 in Washington, DC. (Photo by Chip Somodevilla/Getty Images) U.S. House Speaker Nancy Pelosi said Friday the airlines and restaurant industries both need help that could be in another big economic stimulus package. Her remarks at a weekly press conference at the U.S. Capitol follow similar comments by Mark Meadows, White House chief of staff, on Thursday and mark an uncommon area of agreement amid stalled negotiations for a second major coronavirus aid bill. \"There are more needs that have emerged,\" Pelosi said, since May when House Democrats pushed through a $3.4 trillion aid bill that the Senate has refused to take up. \"The anticipation and hope at that time was that we would engage in crushing the virus. We didn't,\" she said. \"More deaths, more cases, more challenges in terms of jobs, and one of them being with the airlines. There, the bill that was there, the CARES Act, did good things until the end of September. So now that that emerges, again, as a challenge which we had hoped would have been addressed by crushing the virus.\" Several airlines have said that, without more aid, they will have no choice but to implement mass layoffs in October to deal with the losses taken as air passenger traffic has plummeted. On Wednesday, Meadows said President Donald Trump would support legislation to give more financial aid to airlines, after meeting with industry executives Thursday, according to a Bloomberg News report. Read more: Trump would support more aid to airlines, says White House Pelosi Friday also mentioned Friday an effort to provide $120 billion for grants to stabilize the restaurant industry. That's in a bill sponsored by Rep. Earl Blumenauer, an Oregon Democrat. \"The restaurants have a big ask, a very big ask - they've taken a beating on this. And I think there's bipartisan interest in helping restaurants,\" she said. How these issues would play into the larger stalled stimulus talks is unclear. Lawmakers are set to leave in two weeks to hit the campaign trail and will not be back in Washington until after the elections in November. But high on their to-do list before then is a stopgap funding bill to keep the government open after the Sept. 30 fiscal year end as well as cutting a coronavirus aid deal. Pelosi said making room for airlines and restaurant aid in a new package would mean Democrats would have to cut other items from their earlier package. \"That's what a negotiation is about,\" she said."}]}