{"article": [{"url": "https://www.marketwatch.com/story/fbi-catches-six-men-plotting-to-kidnap-michigan-gov-whitmer-01602175377", "published": 1602167000.0, "headline": "â\u0080\u0098Wolverine Watchmenâ\u0080\u0099 militia group allegedly plotted to kidnap Michiganâ\u0080\u0099s Democratic governor, Gretchen Whitmer", "body": "Gov. Whitmer addresses the state during a speech in Lansing, Mich., in September. According to a criminal complaint unsealed Thursday, six people plotted to try to kidnap Whitmer at her vacation home. Michigan Office of the Governor via AP DETROIT (AP) â\u0080\u0094 Agents foiled a stunning plot to kidnap Michigan Democratic Gov. Gretchen Whitmer, authorities said Thursday in announcing charges in an alleged scheme that involved months of planning and even rehearsals to snatch Whitmer at her vacation home. Six men were charged in federal court, while seven others accused of trying to target police and the state Capitol were charged in state court. â\u0080\u009cAll of us in Michigan can disagree about politics, but those disagreements should never, ever amount to violence. Violence has been prevented today,â\u0080\u009d Detroit U.S. Attorney Matthew Schneider told reporters. The six men charged in federal court plotted for months, consulting and training with members of a group that federal authorities described as a militia, and undertaking rehearsals in August and September, according to an FBI affidavit. Four planned to meet Wednesday to â\u0080\u009cmake a payment on explosives and exchange tactical gear,â\u0080\u009d the FBI said in the court filing. The FBI quoted one of the accused as saying Whitmer â\u0080\u009chas no checks and balances at all. She has uncontrolled power right now. All good things must come to an end.â\u0080\u009d The six men charged in federal court were arrested Wednesday night and face up to life in prison if convicted. They were due in court Thursday. Andrew Birge, the U.S. attorney in western Michigan, called them â\u0080\u009cviolent extremists.â\u0080\u009d Whitmer has been praised but also deeply criticized for the stateâ\u0080\u0099s response to the coronavirus. She put major restrictions on personal movement throughout the state and on the economy, although many of those limits have been lifted. The Michigan Supreme Court last week said a 1945 law used as the foundation for many of the governorâ\u0080\u0099s orders is unconstitutional. The government said the plot against Whitmer was stopped with the work of undercover agents and informants. Through electronic communications, two of the alleged conspirators â\u0080\u009cagreed to unite others in their cause and take violent action against multiple state governments that they believe are violating the U.S. Constitution,â\u0080\u009d the FBI said. The criminal complaint identified the six as Adam Fox, Ty Garbin, Kaleb Franks, Daniel Harris, Brandon Caserta, all of Michigan, and Barry Croft of Delaware. Fox said he needed 200 men to storm the Capitol building in Lansing and take hostages, including the governor, according to the FBI. He said he wanted to try Whitmer for â\u0080\u009ctreasonâ\u0080\u009d and would execute the plan before the Nov. 3 election, the government said. The group later shifted to targeting the governorâ\u0080\u0099s vacation home, the FBI said. The government said the scheme appeared to have roots in a June gathering in Dublin, Ohio, attended by more than a dozen people from several states, including Croft and Fox. â\u0080\u009cThe group talked about creating a society that followed the U.S. Bill of Rights and where they could be self-sufficient,â\u0080\u009d the FBI affidavit said. â\u0080\u009cThey discussed different ways of achieving this goal from peaceful endeavors to violent actions. â\u0080¦ Several members talked about murdering â\u0080\u0098tyrantsâ\u0080\u0099 or â\u0080\u0098takingâ\u0080\u0099 a sitting governor.â\u0080\u009d Michigan Attorney General Dana Nessel said subsequently in an MSNBC interview that the disruption of this alleged plot does not spell the end of militia-related menace. â\u0080\u009cI am worried about additional threats,â\u0080\u009d she said. â\u0080\u009cThis may very well be the tip of the iceberg.â\u0080\u009d"}]}