{"article": [{"url": "https://www.marketwatch.com/story/transactions-of-1000-or-more-rose-16-at-home-depot-during-the-second-quarter-2020-08-18", "published": 1597829600.0, "headline": "Transactions of $1,000 or more rose 16% at Home Depot during the second quarter", "body": "Shoppers hit their local Home Depot Inc. in big numbers during the fiscal second-quarter, with the latest results showing that customers were willing to spend to make their homes coronavirus-ready. “During the second quarter, big-ticket comp transactions, or those over $1,000, were up approximately 16%,” said Ted Decker, Home Depot’s HD, +0.49% executive vice president of merchandising, on the Tuesday earnings call, according to a FactSet transcript. “We saw very strong performance across a number of big-ticket categories like appliances, riding lawn mowers and patio furniture.” Do-it-yourself projects included outdoor projects involving sheds, fences and gardens as well as indoor upgrades like flooring, lighting and painting. See:Walmart says government stimulus money bolstered Q2’s blowout results and analysts are concerned now that it’s been spent The home improvement giant saw comparable sales climb 23.4%, with comparable sales in the U.S. up 25%. Still, Home Depot stock edged down 1.1% in Tuesday trading. For the year to date, shares have jumped 30.5% while the Dow Jones Industrial Average DJIA, +0.56% is down 2.7% for the period. Home Depot executives are unsure of the remainder of the year, even if the first part of 2020 was a blockbuster. “[W]e’re cautious to extrapolate trends from the first half of the year into a forecast for the remainder of the year, particularly given the tremendous amount of uncertainty we face with regards to the duration and continued impacts of the virus,” said Home Depot Chief Executive Craig Menear, according to FactSet. UBS thinks smaller projects were a contributing factor as well. “Customers likely performed a number of smaller projects, driving up traffic,” wrote analysts led by Michael Lasser. “Home Depot’s ticket was up 10.1% probably supported by customer trip consolidation, big-ticket strength, and some lumber inflation.” UBS rates Home Depot stock buy with a $300 price target. Also:Wayfair is on S&P’s ‘most vulnerable’ list despite soaring stock, new customer numbers Shoppers were also heading to Home Depot online in large numbers. Sales that used the company’s online platforms were up about double for the quarter, and more than 60% picked up their orders in a store. Placer.ai data shows that Home Depot visits were up 19.1% year-over-year in June and 19.0% in July. On August 1 and August 2, the increase was 34.3% and 38.2% respectively. Visits at Lowe’s Cos. LOW, +1.38% were up as well, rising 30.9% in June and 25.8% in July. Lowe’s reports second-quarter earnings on Wednesday. “This indicates that the demand could be longer-term creating a powerful opportunity for both brands,” Ethan Chernofsky, vice president of marketing wrote in a Placer blog post last week. “The idea here is that greater levels of focus on the home alongside economic concerns that reduce the desire to buy new create a scenario where upgrades become the most desirable way forward.” The end of government economic stimulus benefits could impact future home spending. Don’t miss:Amazon Prime Day, back-to-school uncertainty is changing the shopping calendar “The ending of enhanced benefits is undoubtedly a negative as it will deprive many households of the extra cash they were spending on the home,” said Neil Saunders, managing director at GlobalData Retail. “However, from our data it is still clear that home remains a big priority for most consumers and spending cuts are more likely to be focused on categories such as apparel. It is also true that by spending less on things like travel, gasoline, and eating out, some households can devote more cash to their homes.” This bodes well for Home Depot. Wells Fargo is even more upbeat, especially considering that more people are moving out of cities and will have projects in their new homes. “We view sustainability of strong Q2 trends the largest needle-mover for shares going forward, and considering recent improvement in leading housing metrics (turnover, etc.), de-urbanization, an extended stay-at-home lifestyle and lingering government stimulus benefits, we see ample levers supporting continued upside into 2H20,” analysts led by Zachary Fadem wrote. Wells Fargo rates Home Depot stock overweight with a $300 price target."}]}