{"article": [{"url": "https://www.marketwatch.com/story/donald-trump-jr-says-bidens-policies-would-stop-our-economic-recovery-cold-2020-08-24", "published": 1598311880.0, "headline": "Donald Trump Jr. says Bidenâ\u0080\u0099s policies â\u0080\u0098would stop our economic recovery coldâ\u0080\u0099", "body": "President Donald Trumpâ\u0080\u0099s eldest son helped the Republican Party kick off their national convention on Monday night with an attack on Democratic challenger Joe Biden, as other speakers also laid into the former vice president. â\u0080\u009cBidenâ\u0080\u0099s radical left-wing policies would stop our economic recovery cold,â\u0080\u009d Donald Trump Jr. said. â\u0080\u009cHeâ\u0080\u0099s already talking about shutting the country down again. Itâ\u0080\u0099s madness.â\u0080\u009d See:Biden says he would be open to shutting the economy down to halt the spread of COVID-19 The GOP incumbentâ\u0080\u0099s oldest son said Biden has supported â\u0080\u009cthe worst trade deals in the history of the planet,â\u0080\u009d such as Nafta, which the Trump administration has replaced, as he also accused the Democratic nominee of wanting to â\u0080\u009cbring in more illegal immigrants to take jobs from American citizens.â\u0080\u009d In addition, he went after Biden for promising to repeal most of Trumpâ\u0080\u0099s tax cuts. â\u0080\u009cBiden has promised to take that money back out of your pocket and keep it in the swamp,â\u0080\u009d Trump Jr. said. â\u0080\u009cThat makes sense though, considering Joe Biden is basically the Loch Ness monster of the swamp. For the past half-century, heâ\u0080\u0099s been lurking around in there. He sticks his head up every now and then to run for president, then he disappears and doesnâ\u0080\u0099t do much in between.â\u0080\u009d The presidentâ\u0080\u0099s son linked shutdowns triggered by the coronavirus pandemic and recent violent protests following police killings of Black Americans, saying the November presidential election is almost â\u0080\u009cshaping up to be church, work and school vs. rioting, looting and vandalism â\u0080\u0094 or, in the words of Biden and the Democrats, â\u0080\u0098peaceful protesting.â\u0080\u0099â\u0080\u009d The remarks came on the first night of the Republican National Convention, after the president earlier in the day formally secured the partyâ\u0080\u0099s nomination. The president also appeared in person during the eventâ\u0080\u0099s roll-call voting in Charlotte, N.C., and criticized Biden for not traveling to his partyâ\u0080\u0099s convention last week amid public-health concerns during the coronavirus pandemic. Among the other speakers at the GOP event on Monday night were Nikki Haley, the former South Carolina governor who served as the Trump administrationâ\u0080\u0099s ambassador to the United Nations, as well as Sen. Tim Scott of South Carolina, and Mark and Patricia McCloskey, the St. Louis couple who brandished guns at protesters during a racial-injustice demonstration outside their home. â\u0080\u009cThis president has a record of strength and success,â\u0080\u009d Haley said. â\u0080\u009cThe former vice president has a record of weakness and failure. Joe Biden is good for Iran and ISIS, great for Communist China, and heâ\u0080\u0099s a godsend to everyone who wants America to apologize, abstain and abandon our values.â\u0080\u009d Scott, who is Black, praised the Trump administrationâ\u0080\u0099s work with a 2018 criminal-justice reform law, while blasting Bidenâ\u0080\u0099s track record on racial issues. The senator brought up Bidenâ\u0080\u0099s suggestion that voters â\u0080\u009cainâ\u0080\u0099t Blackâ\u0080\u009d if they consider backing Trump, as well as the veteran Democratic politicianâ\u0080\u0099s support for 1994 crime legislation that is blamed for mass incarcerations of minorities. â\u0080\u009cIf you stand up for yourself and for the values our country was founded on, the mob spurred on by their allies in the media will try to destroy you,â\u0080\u009d Mark McCloskey said. â\u0080\u009cYou know that weâ\u0080\u0099re not the kind of people who back down. Thankfully, neither is Donald Trump.â\u0080\u009d In this screenshot from the RNCâ\u0080\u0099s livestream of the 2020 Republican National Convention, Patricia and Mark McCloskey, a couple from St. Louis who pointed guns at Black Lives Matter protesters, make remarks. Getty Images Trump also was featured, as expected, during Monday nightâ\u0080\u0099s programming, appearing in one pre-recorded video in which he praised front-line workers and defended his administrationâ\u0080\u0099s handling of the U.S. Postal Service. He also appeared in another clip with Americans who had been hostages in Syria, Venezuela and other countries before being freed following moves by the Trump administration. â\u0080\u009cWeâ\u0080\u0099re taking good care of our postal workers,â\u0080\u009d Trump told the front-line workers, who included a USPS employee, a trucker, a nurse, a police officer and others. â\u0080\u009cBelieve me, weâ\u0080\u0099re not getting rid of our postal workers. You know theyâ\u0080\u0099d like to sort of put that out there.â\u0080\u009d Trump and his fellow Republicans have been expected to aggressively counterattack the Democrats and their presidential nominee at this weekâ\u0080\u0099s GOP convention, a four-day affair that aims to make the case that it is Trump and not Biden who can revive the pandemic-battered U.S. economy. U.S. stocksÂ closed with gains on Monday, with the Dow Jones Industrial Average DJIA, +0.56% Â ending 4% from its February peak and the S&P 500 SPX, +0.87% and Nasdaq Composite COMP, +1.39% Â achieving fresh all-time highs."}]}