{"article": [{"url": "https://www.marketwatch.com/story/russia-meddled-on-trumps-behalf-in-2016-bipartisan-senate-intelligence-report-concludes-2020-08-18", "published": 1597780220.0, "headline": "Russia meddled on Trumpâ\u0080\u0099s behalf in 2016, bipartisan Senate intelligence report concludes", "body": "WASHINGTON â\u0080\u0094 The Trump campaignâ\u0080\u0099s interactions with Russian intelligence services during the 2016 presidential election posed a â\u0080\u009cgraveâ\u0080\u009d counterintelligence threat, a Senate panel concluded Tuesday as it detailed how associates of Donald Trump had regular contact with Russians and expected to benefit from the Kremlinâ\u0080\u0099s help. The nearly 1,000-page report, the fifth and final one from the Republican-led Senate intelligence committee on the Russia investigation, details how Russia launched an aggressive effort to interfere in the election on Trumpâ\u0080\u0099s behalf. It says the Trump campaign chairman had regular contact with a Russian intelligence officer and says other Trump associates were eager to exploit the Kremlinâ\u0080\u0099s aid, particularly by maximizing the impact of the disclosure of Democratic emails hacked by Russian intelligence officers. Read the full report:Senate Intelligence Committee Russia Investigation Vol. 5 “ Republicans on the panel submitted â\u0080\u0098additional viewsâ\u0080\u0099 indicating the report should state that Trumpâ\u0080\u0099s campaign did not coordinate with Russia, while Democrats on the panel submitted their determination that the report clearly shows precisely such cooperation. ” The report is the culmination of a bipartisan probe that produced what the committee called â\u0080\u009cthe most comprehensive description to date of Russiaâ\u0080\u0099s activities and the threat they posed.â\u0080\u009d The investigation spanned more than three years as the panelâ\u0080\u0099s leaders said they wanted to thoroughly document the unprecedented attack on U.S. elections. The findings, including unflinching characterizations of furtive interactions between Trump associates and Russian operatives, echo to a large degree those of special counsel Robert Muellerâ\u0080\u0099s Russia investigation and appear to repudiate the Republican presidentâ\u0080\u0099s claims that the FBI had no basis to investigate whether his campaign was conspiring with Russia. Trump, who has repeatedly called the Russia investigations a â\u0080\u009choax,â\u0080\u009d said Tuesday he â\u0080\u009cdidnâ\u0080\u0099t know anything aboutâ\u0080\u009d the report, or Russia or Ukraine. â\u0080\u009cAll I know is that I have nothing to do with either one of them and that came out loud and clear in the report,â\u0080\u009d Trump said. While Muellerâ\u0080\u0099s was a criminal probe, the Senate investigation was a counterintelligence effort with the aim of ensuring that such interference wouldnâ\u0080\u0099t happen again. The report issued several recommendations on that front, including that the FBI should do more to protect presidential campaigns from foreign interference. The report was released as two other Senate committees, the Judiciary and Homeland Security panels, conduct their own reviews of the Russia probe with an eye toward uncovering what they say was FBI misconduct in the early days of the investigation. A prosecutor appointed by Attorney General William Barr, who regards the Russia investigation with skepticism, disclosed his first criminal charge Friday against a former FBI lawyer who plans to plead guilty to altering a government email. Sen. Mark Warner, a Virginia Democrat, is the ranking member of the Senate Intelligence Committee, whose chairman since earlier this year has been Republican Sen. Marco Rubio of Florida. Getty Images See:Burr submits final Senate intelligence report on Russia election interference as he departs as committee chairman Among the more striking sections of the report is the committeeâ\u0080\u0099s description of the professional relationship between former Trump campaign chairman Paul Manafort and Konstantin Kilimnik, whom the committee describes as a Russian intelligence officer. â\u0080\u009cTaken as a whole, Manafortâ\u0080\u0099s high-level access and willingness to share information with individuals closely affiliated with the Russian intelligence services, particularly Kilimnik, represented a grave counterintelligence threat,â\u0080\u009d the report says. The report notes how Manafort shared internal Trump campaign polling data with Kilimnik and says there is â\u0080\u009csome evidenceâ\u0080\u009d Kilimnik may have been connected to Russiaâ\u0080\u0099s effort to hack and leak Democratic emails, though that information is redacted. The report also says â\u0080\u009ctwo pieces of informationâ\u0080\u009d raise the possibility of Manafortâ\u0080\u0099s potential connection to those operations, but what follows is again blacked out. Both men were charged in Muellerâ\u0080\u0099s investigation, but neither was accused of any tie to the hacking. A Manafort lawyer, Kevin Downing, said Tuesday that information sealed at the request of Muellerâ\u0080\u0099s team â\u0080\u009ccompletely refutes whatever the intelligence committee is trying to surmise.â\u0080\u009d He added, â\u0080\u009cIt just looks like complete conjecture.â\u0080\u009d Like Mueller, the committee reviewed a meeting Trumpâ\u0080\u0099s oldest son, Donald Trump Jr., took in June 2016 with a Russian lawyer he believed to have connections with the Russian government with the goal of receiving information harmful to his fatherâ\u0080\u0099s opponent, Democrat Hillary Clinton. The Senate panel said it assessed that the lawyer, Natalia Veselnitskaya, has â\u0080\u009csignificant connections to the Russian government, including the Russian intelligence services,â\u0080\u009d as did another participant in the meeting, Rinat Akhmetshin. The panel said it uncovered connections that were â\u0080\u009cfar more extensive and concerning than what had been publicly known,â\u0080\u009d particularly regarding Veselnitskaya. In a statement, Akhmetshin said he was â\u0080\u009cexonerated, yet again, of the false claim that I am a Russia spy.â\u0080\u009d The report also found no reliable evidence for Trumpâ\u0080\u0099s longstanding supposition that Ukraine had interfered in the election, but did trace some of the earliest public messaging of that theory to Kilimnik and said it was spread by Russian-government proxies who sought to discredit investigations into Russian interference. The committee said that messaging campaign lasted to â\u0080\u009cat least January 2020â\u0080\u009d â\u0080\u0094 after the House had impeached Trump for pressuring Ukrainian officials to investigate the family of Democrat Joe Biden, now Trumpâ\u0080\u0099s general election opponent. During that effort, some Republicans, including Trump, argued Ukraine was meddling, not Russia. Trump was acquitted by the Senate. The report purposely does not come to a final conclusion, as Mueller did and as the House intelligence committeeâ\u0080\u0099s 2018 report did, about whether there is sufficient evidence that Trumpâ\u0080\u0099s campaign coordinated with Russia to sway the election to him and away from Clinton, leaving its findings open to partisan interpretation. Several Republicans on the panel submitted â\u0080\u009cadditional viewsâ\u0080\u009d to the report, saying it should state more explicitly that Trumpâ\u0080\u0099s campaign did not coordinate with Russia. They say that while the report shows the Russian government â\u0080\u009cinappropriately meddledâ\u0080\u009d in the election, â\u0080\u009cthen-candidate Trump was not complicit.â\u0080\u009d The panelâ\u0080\u0099s acting GOP chairman, Florida Sen. Marco Rubio, signed on to that statement but the chairman who led the investigation, North Carolina Sen. Richard Burr, did not. Burr stepped aside earlier this year as the FBI was examining his stock sales. Another Republican committee member, Maine Sen. Susan Collins, also did not sign on to the GOP statement. Burr, who submitted the report before he stepped aside, often faced criticism from his GOP colleagues for working with Democrats on the probe and for summoning sensitive witnesses, such as Trump Jr. The top Democrat on the panel, Virginia Sen. Mark Warner, commended Burr for sticking with the investigation even amid criticism from all sides. He said Burr â\u0080\u009ctried to stay true to that north star of â\u0080\u0098weâ\u0080\u0099re going to put out all the facts.â\u0080\u0099â\u0080\u009d Warner said the report was designed to â\u0080\u009clet every American make their own judgement.â\u0080\u009d A group Democrats on the panel submitted their own views, saying the report â\u0080\u009cunambiguously shows that members of the Trump campaign cooperated with Russian efforts to get Trump elected.â\u0080\u009d Warner did not sign on to that statement. Maine Sen. Angus King, an independent who caucuses with Democrats, did not sign on to that statement, saying he believed the report should be bipartisan. But he said in an interview that he believes the report is a â\u0080\u009cwarning.â\u0080\u009d The report is â\u0080\u009cnot a hoax,â\u0080\u009d King said. â\u0080\u009cItâ\u0080\u0099s just one more set of facts thatâ\u0080\u0099s hard to ignore.â\u0080\u009d Mueller concluded in his report issued last year that Russia interfered in the election through hacking and a covert social media campaign and that the Trump campaign embraced the help and expected to benefit from it. But Mueller did not charge any Trump associates with conspiring with Russians. The Senate investigation did fault aspects of the investigation, suggesting for instance that agents did not respond with sufficient urgency to the hacking of Democratic National Committee email servers. The report also delved into areas of interest to Trump that were not explored by Mueller. Those include the FBIâ\u0080\u0099s reliance on opposition research on Trumpâ\u0080\u0099s ties to Russia that was compiled by a former British spy, Christopher Steele, whose work was financed by Democrats. The committee found the FBI gave Steeleâ\u0080\u0099s â\u0080\u009callegations unjustified credenceâ\u0080\u009d as it relied on the dossier of research to seek court approval to wiretap former Trump campaign adviser Carter Page. It says many of the dossierâ\u0080\u0099s allegations remain uncorroborated â\u0080\u009cnearly four years after Steele delivered the first of these memos.â\u0080\u009d A separate investigation by the Justice Departmentâ\u0080\u0099s inspector general also faulted the FBI for errors and omissions related to the Steele dossier."}]}