{"article": [{"url": "https://www.marketwatch.com/story/ocasio-cortez-lays-out-progressive-priorities-in-dnc-speech-symbolically-nominates-sanders-for-president-2020-08-18", "published": 1597791620.0, "headline": "Ocasio-Cortez lays out progressive priorities in DNC speech; symbolically nominates Sanders for president", "body": "Rep. Alexandria Ocasio-Cortez laid out the progressive movement’s goals in her speech to the Democratic National Convention on Tuesday without mentioning the name of Joe Biden, who was officially nominated by the party for president. The New York congresswoman symbolically nominated Sen. Bernie Sanders, and later tweeted her “deepest congratulations” to Biden. iframe.twitter-tweet { width: 100% !important; } Ocasio-Cortez backed Sanders in the Democratic primary against Biden, and was critical of Biden as too centrist. She later joined a Biden-Sanders “unity task force” with the aim of defeating President Donald Trump. Yet gaps remained on key issues, with progressive ideas like the “Green New Deal” and “Medicare for All” not making it into the task-force recommendations. In her speech she gave her thanks to “a mass people’s movement working to establish 21st-century social, economic, and human rights, including guaranteed health care, higher education, living wages, and labor rights for all people in the United States.” “In a time when millions of people in the United States are looking for deep systemic solutions to our crises of mass evictions, unemployment, and lack of health care, and ​espíritu del pueblo​ and out of a love for all people, I hereby second the nomination of Senator Bernard Sanders of Vermont for president of the United States of America,” said Ocasio-Cortez. The move was procedural. As the congresswoman explained, convention rules require roll call and nominations for every candidate who passes the delegate threshold. Sanders spoke to the convention on Monday night, acknowledging differences with Biden including over health care, but making a strong case for him as president. Also see:‘We need Joe Biden as our next president’: Sanders makes case for his former rival. Trump is attempting to paint Biden as what he calls a “Trojan Horse” for the left — and negative for stocks — even as the former vice president has rejected certain progressive ideas. The S&P 500 index SPX, +0.87% finished trading Tuesday at an all-time high, and the Nasdaq Composite COMP, +1.39% also closed at a record. The Dow Jones Industrial Average DJIA, +0.56%, meanwhile, slipped fractionally. Now read:Stock-market investors’ biggest election fear? A contested outcome."}]}