{"article": [{"url": "https://www.marketwatch.com/story/facebook-gives-in-to-pressure-on-climate-change-myths-including-that-antifa-started-deadly-wildfires-with-new-science-based-hub-2020-09-15", "published": 1600165040.0, "headline": "Facebook gives in to pressure on climate-change myths - including that antifa started deadly wildfires in western states - with new 'science-based' hub", "body": "Facebook, long targeted by critics for allowing misinformation on global warming and other environmental developments to populate users' social-media feeds unchecked, announced it will launch a new information hub to provide \"science-based information\" about climate change. \"Climate change is real. The science is unambiguous and the need to act grows more urgent by the day,\" the company FB, +0.26%  said in a release announcing the hub's rollout Tuesday after months of increased questioning of the climate-change denial posts it allows on the site under the cover of allowing editorials. Now when users search for information related to climate change on Facebook or when certain posts related to the subject pop up, so, too, will a link to the Climate Science Information Center. On it, users will find data and commentary from sources including the Intergovernmental Panel on Climate Change, the U.N. Environment Programme, the National Oceanic and Atmospheric Administration, the World Meteorological Organization and the Met Office, among others. The announcement comes just days after emergency responders in the Pacific Northwest had to fight misinformation on Facebook running counter to efforts to evacuate citizens in the line of the deadly wildfires. Wildfires are sparked by a variety of factors, but scientists increasingly point to climate change in contributing to the intensity and frequency of these events. The Facebook hub's launch - in the U.S., U.K., France and Germany to start - also comes ahead of the high-profile Climate Week, a conference to be run virtually next week by the United Nations and New York City. It's a position shift from a social-media giant that as recently as August offered push-back to mostly Democratic lawmakers seeking more action on behalf of truthful information. \"We asked Facebook leadership to close the loopholes that let climate disinformation spread on their platforms,\" Senators Elizabeth Warren, Tom Carper, Sheldon Whitehouse and Brian Schatz said in a statement last month. \"Their response: we should trust them to make and follow their own rules and procedures, even if it results in the distortion of facts and the mass dissemination of falsehoods. The future of our planet is at stake, and there should be no company too big, too powerful, and too opaque to be held accountable for its role in the climate crisis. Facebook is no exception.\" Last year, Facebook removed a \"false\" rating from an op-ed published by the Washington Examiner that cast doubt on the accuracy of climate-change models. Initially, Facebook's independent fact checker flagged the article as \"highly misleading,\" based on what it said was the inclusion of inaccurate information and cherry-picked data. But a nonprofit known as the CO2 Coalition, created by former Donald Trump adviser William Happer, protested the rating, and Facebook capitulated, dropping the warning and allowing the post under an \"opinion\" loophole. That labeling policy had always existed, Facebook stressed at the time. In addition to the information hub, Facebook said it will continue to reduce the distribution of posts containing false information on its News Feed feature and will label such posts as false. Facebook, however, says it will not remove the posts, and it was also not immediately clear how the company will deal with posts within private groups believed to contain information contradictory to what increasingly is mainstream adoption of the still-evolving science around man-made acceleration of climate change. Read:Biden says '4 more years of Trump's climate denial' could mean more suburbs 'burned in wildfires' Also see:Trump spars with California official on wildfires and climate change: 'It'll start getting cooler' Facebook has set its own goal, similar to those of many tech giants, to achieve net-zero carbon emissions and be supported fully by renewable energy in its own operations. The steps on climate change follow similar moves for the company surrounding information sharing on COVID-19 and voting in a presidential-election year. So far, Facebook says that over 2 billion people have been directed to resources from health authorities by its COVID-19 response. Facebook shares are up nearly 33% so far in 2020. The S&P 500 SPX, +0.87%  is up about 5.7% over the same stretch."}]}