{"article": [{"url": "https://www.marketwatch.com/story/biden-and-trump-campaign-in-minnesota-a-state-the-president-came-close-to-winning-in-2016-2020-09-18", "published": 1600450520.0, "headline": "'The president is only worried about the stock market and his re-election,' says Biden in Minnesota, as Trump also campaigns in the state", "body": "Democratic challenger Joe Biden and President Donald Trump both were campaigning on Friday in Minnesota, with Biden speaking at a union training center in the afternoon and Trump scheduled to appear at a rally in the evening. Trump's re-election campaign has characterized Minnesota as a battleground state that it hopes to win, after the president lost there four years ago by just 1.5 percentage points. But Biden has a 10.2-point advantage in a RealClearPolitics moving average of polls focused on the North Star State, and the last Republican presidential candidate to carry it was Richard Nixon in 1972. The former vice president on Friday continued his attacks on Trump's handling of the coronavirus crisis, saying that on one day in September there were a thousand deaths from the virus in the U.S., but zero \"just across the border\" in Canada. \"So many lives lost unnecessarily because the president is only worried about the stock market and his re-election,\" Biden said in a speech at the training center in the Duluth area following a tour of the facility. \"He refused to do what you're doing right here in this program - social distance, wear masks, sanitize. You're protecting your apprentices. He's not protecting America.\" Biden said the people that he grew up with \"don't have money in stocks,\" and he said he measures the health of the U.S. economy by how places like Duluth and Scranton, Pa., are faring. He added that his \"Build Back Better plan - in fact, my entire campaign - is built upon a simple concept. It's time to reward hard work in America, not wealth.\" Related:Kamala Harris blasts Trump's coronavirus response, say he's 'fixated on the stock market' Meanwhile, Trump is due to make remarks at 7 p.m. Eastern Time at a \"Great American Comeback\" event in Bemidji, a small city known in part for its statues of Paul Bunyan and Babe the Blue Ox. Ahead of the visits to Minnesota, the Trump campaign has highlighted endorsements from what it described as \"three mayors from historically Democrat strongholds on the Iron Range.\" The campaign said in a statement that the GOP incumbent \"has stood up to the radical environmentalists and worked to preserve the mining XME, +0.51%  and energy XLE, -1.59%  industries on the Iron Range that make America great. Joe Biden has simply become too radical for blue collar workers in America's heartland.\" A Trump supporter waves a flag near the statues of Paul Bunyan and Babe the Blue Ox on Friday in Bemidji, Minnesota. Getty Images Biden has a lead of 3.9 points in a RealClearPolitics moving average of polls focused on six swing states that are viewed as likely to decide the White House race. Minnesota is not one of those six states. Betting markets are giving the former vice president a 53.4% chance of winning vs. Trump's 45.9% chance. The main U.S. stock gauges SPX, +0.87% DJIA, +0.56%  COMP, +1.39% on Friday closed with losses for the session and for the week."}]}