{"article": [{"url": "https://www.marketwatch.com/story/what-are-we-waiting-for-multimillionaires-want-the-new-stimulus-bill-to-force-other-rich-people-to-give-more-money-to-charity-2020-07-22", "published": 1595572040.0, "headline": "'What are we waiting for?' Abigail Disney and other multimillionaires want the new stimulus bill to force other rich people to give more money to charity", "body": "A group of multimillionaires says the next stimulus package should force philanthropists to hand out more money to charities while the country grapples with the pandemic. The Patriotic Millionaires, whose members include the Disney DIS, +1.53%  heiress Abigail Disney, are among those asking Congress to pass an \"emergency charity stimulus bill\" that would temporarily require private foundations to double the amount of money they give to nonprofits. Under current law, private foundations like the Bill & Melinda Gates Foundation and the Ford Foundation are required to hand out 5% of their assets each year in grants to nonprofits. The bill would double a foundation's minimum payout to 10% of its assets for the next three years. The bill would also require donor-advised funds - tax-advantaged accounts that wealthy people often use for charitable giving - to send 10% of their assets to charities each year. See also: Tax us: Abigail Disney among 83 millionaires begging for higher taxes for coronavirus relief Private foundations hold an estimated $1 trillion in assets and donor-advised funds contain $120 billion, according to the bill's supporters. If passed, the bill would release $200 billion of that money to shore up nonprofits that provide important services and employ some 12 million Americans - at no expense to taxpayers, the proponents argue. Congress is now hammering out the details of the next stimulus package to address the economic fallout from the coronavirus pandemic. Supporters of the \"emergency charity stimulus bill\" say they're close to having the legislation introduced by a Democratic lawmaker, hopefully one who can garner support from Republicans, too. \"It's our view that the pressure for this will keep building,\" said Chuck Collins of the left-leaning Institute for Policy Studies, one of the groups behind the proposal. \"State and local budgets will get tighter. Nonprofits are going to get hammered and lay off people. Here's an elegant solution that's paid for by wealthy people who took their tax breaks long ago.\"Private foundations are subsidized by taxpayers Though they may not be familiar to many Americans, private foundations play a significant role in charitable giving in the U.S., and taxpayers help foot the bill. Foundations are nonprofit organizations created for charitable purposes, typically by one wealthy person or family. They give out money in the form of grants to nonprofits. In 2019, private foundations sent more than $75 billion to nonprofits, amounting to about 17% of all charitable giving in the U.S., according to Giving USA. “ 'Nonprofits are going to get hammered and lay off people. Here's an elegant solution that's paid for by wealthy people who took their tax breaks long ago.' ” - Chuck Collins, Institute for Policy Studies That generosity is subsidized by taxpayers to the tune of 37% to 74% of every dollar, depending on how much the donor's income, capital gains and estate taxes were reduced by the donation, according to a policy paper supporting the proposed bill. \"In other words, for every $1 a billionaire gives to charity, the rest of us chip in as much as 74 cents in lost tax revenue,\" the authors said.Some critics call donor-advised funds 'zombie philanthropy' The bill would also take aim at donor-advised funds (DAFs), a favored charitable-giving vehicle for affluent donors. These donors can put money into a DAF account and immediately claim a tax deduction, but don't have to decide which charities get the money right away. In fact, there's no deadline at all for the money to leave the DAF account and go to a charity. There are also no minimum requirements for how much DAF accounts must send to charities each year. The money, however, is permanently earmarked for charity. “ 'It's immoral to hoard your assets when there's death and economic devastation ravaging the land, to say nothing of racial division. What are we waiting for?' ” - Scott Wallace, president of the Wallace Global Fund Those loopholes have led critics to dub DAFs \"zombie philanthropy\" that allows donors - including many tech billionaires - to say they're giving away their money to charity, when in reality the money sometimes sits in the account for years. The emergency charity stimulus bill would require DAFs to give 10% of their assets to charities annually for the next three years. \"People get a tax break when they put the money in, but then don't have any incentive to move the money to a working charity,\" said Collins, an heir to the Oscar Mayer KHC, -0.35%  fortune who gave away his inheritance in his 20s. \"That seemed like a basic design flaw.\"Some donor-advised funds have given out record amounts this year Many people with donor-advised funds have been busy handing out money during the pandemic. A former Amazon AMZN, +3.01%  executive and his wife even started a campaign, HalfMyDAF, encouraging people with donor-advised funds to commit to sending half the money in their DAF to nonprofits by Sept. 30. DAF account holders with Schwab Charitable, one of the largest providers of DAFs, granted a record amount to nonprofits in the first six months of 2020 - more than $1.7 billion, or a 46% increase over the same period in 2019, Schwab Charitable announced recently. As for Schwab's position on the emergency charity stimulus bill, \"Schwab Charitable is supportive of efforts that encourage increased charitable giving, especially in our current environment,\" spokeswoman Grace Connolly told MarketWatch. Annual payout rates for Schwab Charitable DAFs average about 20% of assets, she said.The Gates Foundation gave out 10% of its endowment last year Some private foundations have also stepped up their giving amid the pandemic. In June, the Ford Foundation issued a $1 billion \"social bond\" to double its annual payout to 10% for the next two years \"in response to the unprecedented crisis of COVID-19 to stabilize and strengthen non-profit organizations,\" Ford Foundation spokeswoman Amanda Simon said. The Ford Foundation typically pays out more than the required 5%, averaging about 5.5% of its assets. The foundation does not have a position on the emergency charity stimulus bill, she said. The Bill & Melinda Gates Foundation, which has been a leading contributor to efforts to develop a coronavirus vaccine, typically exceeds the 5% required minimum payout, according to a spokesman, and last year gave out about 10% of its endowment, amounting to $5.29 billion in grants. \"We are encouraged to see many foundations and individual philanthropists stepping up in a wide variety of innovative ways during this time of immense need,\" said Robert Rosen, the director of the foundation's Philanthropic Partnerships Team. \"We don't have a position on proposed legislation or policies pertaining to the mandatory annual distributions from private foundations.\" The Council on Foundations, a group that lobbies on behalf of private foundations, wrote in a recent policy brief that increasing payout requirements for private foundations would have a \"deleterious effect on foundation assets.\" The policy brief noted, \"If similar proposals had been adopted following the tragedy of September 11, 2001, or the Great Recession of 2008, philanthropy would now have fewer resources and a significantly reduced ability to respond to COVID-19.\" Scott Wallace, one of the leaders of the campaign and president of the Wallace Global Fund, said his foundation has upped its grantmaking to 20% of its assets in response to the pandemic. Wallace said he's been shocked to see some private foundations cutting back on grantmaking as their assets have declined on the stock market. In his view, some foundations are too focused on their long-term preservation when they could be using their resources to make a difference in the present. \"It's immoral to hoard your assets when there's death and economic devastation ravaging the land, to say nothing of racial division,\" Wallace said. \"What are we waiting for? How many more existential crises do we need before you get off your assets and spend like it matters?\" This story was updated on July 23, 2020."}]}