{"article": [{"url": "https://www.marketwatch.com/story/house-democrats-summon-postal-service-leaders-to-emergency-hearing-on-mail-delays-2020-08-16", "published": 1597613360.0, "headline": "Pelosi to call House back to session this week to vote on Postal Service bill", "body": "WASHINGTON — Speaker Nancy Pelosi said Sunday she is calling the House back into session over the crisis at the U.S. Postal Service, setting up a political showdown amid growing concerns that the Trump White House is trying to undermine the agency ahead of the election. Pelosi is cutting short lawmakers’ summer recess with a vote expected the Saturday after the Democratic National Convention on legislation that would prohibit changes at the agency as tensions mount. President Donald Trump’s new postmaster general, Louis DeJoy, has sparked nationwide outcry over delays, new prices and cutbacks just as millions of Americans will be trying to vote by mail to avoid polling places during the coronavirus outbreak. “In a time of a pandemic, the Postal Service is Election Central,” Pelosi wrote Sunday in a letter to colleagues, who had been expected to be out of session until September. “Lives, livelihoods and the life of our American Democracy are under threat from the president.” The decision to recall the House, made after a weekend of high-level leadership discussions, carries a political punch. Voting in the House will highlight the issue after the weeklong convention nominating Joe Biden as the party’s presidential pick and pressure the Republican-held Senate to respond. Senate Majority Leader Mitch McConnell sent senators home for a summer recess. Earlier Sunday, Democratic lawmakers demanded that leaders of the Postal Service testify at an emergency oversight hearing Aug. 24 on mail delays. The House Oversight and Reform Committee said it wants to hear from DeJoy and from the chair of the Postal Service board of governors, Robert “Mike” Duncan. With heightened scrutiny of its operations, the Postal Service is now requesting a temporary preelection rate increase, from mid-October through Christmas, although not for first-class letters. The agency did not immediately respond to requests for comment about whether the two men would appear before the House committee. But it said Sunday it would stop removing its distinctive blue mailboxes through mid-November following complaints from customers and members of Congress that the collection boxes were being taken away. “Given the recent customer concerns the Postal Service will postpone removing boxes for a period of 90 days while we evaluate our customers’ concerns,’’ Postal Service spokeswoman Kimberly Frum said. House Democrats are expected to discuss the lawmakers’ schedule details on a conference call on Monday and were likely to be in session next Saturday, a senior Democratic aide said on condition of anonymity because the plans were private. The legislation being prepared for the vote, the “Delivering for America Act,” would prohibits the Postal Service from implementing any changes to operations or level of service it had in place on Jan. 1. DeJoy, a major Republican donor and ally of the president who took control of the agency in June, has pledged to modernize the money-losing agency to make it more efficient, and has eliminated most overtime for postal workers, imposed restrictions on transportation and reduced of the quantity and use of mail-processing equipment. Trump said last week that he was blocking a $25 billion emergency injection sought by the Postal Service, as well as a Democratic proposal to provide $3.6 billion in additional election money to the states. The Republican president worries that mail-in voting could cost him reelection. The money for the post office is intended to help with processing an expected surge of mail-in ballots. Both funding requests have been tied up in congressional negotiations over a new coronavirus relief package. On Saturday, Trump tried to massage his message, saying he supports increasing money for the Postal Service. He said he was refusing to capitulate to Democrats on other parts of the relief package, including funding for states weighed down by debt accumulated before the pandemic. But the president’s critics were not appeased, contending that Trump has made the calculation that a lower voter turnout would improve his chances of winning a second term. “What you are witnessing is a president of the United States who is doing everything he can to suppress the vote, make it harder for people to engage in mail-in balloting at a time when people will be putting their lives on the line by having to go out to a polling station and vote,” said Sen. Bernie Sanders, I-Vt. In announcing the upcoming hearing, congressional Democrats said in a statement: “The postmaster general and top Postal Service leadership must answer to the Congress and the American people as to why they are pushing these dangerous new policies that threaten to silence the voices of millions, just months before the election.” The lawmakers included Pelosi of California and New York Rep. Carolyn Maloney, the committee chair, along with Senate Minority Leader Chuck Schumer of New York and Michigan Sen. Gary Peters, the top Democrat on the Senate Homeland Security and Governmental Affairs Committee, which oversees the Postal Service. Earlier this month, Maloney’s committee had invited DeJoy to appear Sept. 17 at a hearing focusing on operational changes to the Postal Service that are causing delays in mail deliveries. But after Trump acknowledged in a Fox Business interview on Thursday that he’s starving the agency of money to make it harder to process an expected surge of mail-in ballots, the committee decided to move up their call for the appearance of DeJoy’ well as the governing board chair. Funding a cash-strapped Postal Service has quickly turned into a top campaign issue as Trump presses his unsupported claim that increased mail-in voting will undermine the credibility of the election and Democrats push back. Trump, who spent the weekend at his New Jersey golf club, derided universal mail-in voting as a “scam” and defended DeJoy as the right person to “streamline the post office and make it great again.” His chief of staff, Mark Meadows, tried on Sunday to counter criticism that Trump was trying to stifle turnout with national and battleground state polls showing him facing a difficult path to reelection against Biden. “I’ll give you that guarantee right now: The president of the United States is not going to interfere with anybody casting their vote in a legitimate way, whether it’s the post office or anything else,” Meadows said. But Democrats said changes made by DeJoy constitute “a grave threat to the integrity of the election and to our very democracy.” The agency in the meantime is now seeking a short-term, end-of-the-year rate increase, according to a notice filed Friday with the Postal Regulatory Commission. The reasons: increased expenses, heightened demand for online packages due to the coronavirus pandemic and an expected increase in holiday mail volume. The plan would raise prices on commercial domestic competitive parcels, including Priority Mail Express, Priority Mail, first-class package service, Parcel Select and Parcel Return Service. Most of the proposed increases would be less than 10%. They range from 24 cents for Parcel Select Service, which starts at $3.05, to a $1.50 increase for Priority Mail Express Commercial, which starts at $22.75. The regulatory commission is expected to decide on the proposals next month. The Postal Service is the country’s most popular government agency with 91% of Americans having a favorable opinion of the service, according to a Pew Research Center Survey published in April. “What concerns me is an all-out attack — they’re not even hiding it — by the president of the United States to undermine the United States Postal Service, to underfund it, to allow a mega-donor leading it to overtly do things to slow down the mail,” said Sen. Cory Booker, D-N.J. Sanders was on NBC’s “Meet the Press,’’ while Meadows and Booker appeared on CNN’s “State of the Union.”"}]}