{"article": [{"url": "https://www.marketwatch.com/story/gold-has-no-role-in-portfolio-of-wealth-clients-says-goldman-manager-11596138456", "published": 1596289460.0, "headline": "Gold has 'no role' in portfolio of wealthy clients, says Goldman manager", "body": "Don't believe the hype. That's the message from Sharmin Mossavar-Rahmani, chief investment officer of private wealth management at Goldman Sachs, who thinks that gold is overpriced and has no clear role in the portfolios of her private clients. Our view is that gold is only appropriate if you have a very strong view that the U.S. dollar is going to be debased. We don't have that view. We think the dollar maintains its status as the reserve currency. The dollar can cheapen a little bit because it's moderately overvalued but that doesn't mean that it's going to be debased, that we are going to have huge inflation and that gold is a good substitute. During an interview on CNBC Thursday morning, Mossavar-Rahmani explained that her wealth management group has two factors that it focuses on when thinking about gold: strategically and tactically. She said that gold isn't a great deflation hedge, doesn't generate any income, and isn't tied to economic growth and corporate earnings, so it fails the strategic hurdle as Goldman's wealth management crew assesses its relevance in a balanced portfolio. Secondly, she explained that tactically, gold is a hard case to make unless investors hold the perception that the current bout of weakness in the U.S. dollar is the start of a more severe downturn for dollars and a possible change in leadership of the monetary unit that is viewed as the No. 1 reserve currency in the world. \"So all this excitement and brouhaha about gold is not something that we buy into,\" Mossavar-Rahmani said. \"In fact, at one point, we think people should look at the reverse and think there's more downside to gold,\" she said. Mossavar-Rahmani's comments run in contrast with Goldman's commodity crew, which earlier this week raised its 12-month forecast for gold to $2,300 from $2,000 . That shift was precipitated by \"a potential shift in the U.S. Fed toward an inflationary bias against a backdrop of rising geopolitical tensions, elevated U.S. domestic political and social uncertainty, and a growing second wave of COVID-19 related infections,\" said a team of analysts including Jeffrey Currie. On Thursday, August gold GOLD, +2.86% fell by $11.10, or 0.6%, to settle at $1,942.30 an ounce, after settling at a record on Wednesday, marking its ninth straight advance, which is its longest win streak since a 10-session climb ended in January. Gold's ascent has come amid the backdrop of rising cases of COVID-19 in the U.S. and around the world. However, gold's climb has also coincided with a weakening of the dollar against its major rivals, which can give gold buoyancy because bullion and other precious metals are priced in the currency and its softening can make metals more attractive to buyers using alternative currencies. One measure of the buck, the ICE U.S. Dollar Index DXY, -0.58% was down around its lowest level since 2018 and has dropped 4.5% so far in July, according to FactSet data, while gold has climbed 8.1%, based on the most-active contract."}]}