{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-deal-prospects-already-dim-recede-further-with-pact-to-keep-government-open-11600884647", "published": 1600870700.0, "headline": "Coronavirus deal prospects, already dim, recede further with pact to keep government open", "body": "A reflection of the U.S. Capitol in Washington, D.C. (Photo by Stefani Reynolds/Getty Images) With lawmakers eager to wrap up in Washington and hit the campaign trail, the bright prospects for a deal to keep the government open also mean the pressure for a separate deal on coronavirus aid will likely ease. The Senate may vote as soon as Wednesday or Thursday on the stopgap funding bill to keep the government open past Sept. 30, a so-called continuing resolution. The bill passed the House Tuesday night on an overwhelming 359-57 vote. Read more: House passes bipartisan stopgap funding bill to avert government shutdown at month’s end Asked Wednesday how soon the Senate could vote on the pact, Senate Majority Leader Mitch McConnell said “as soon as we can.” Once the possibility of a government shutdown has been taken off the table, lawmakers may be reluctant to spend much more time in Washington without significant legislation to vote on and instead head home. “My guess is if we wrap up the CR, then yeah, we probably should be done for at least a while until something pops on one of those other issues,” Sen. John Thune, a South Dakota Republican, told reporters Wednesday, referring to coronavirus aid or the looming Supreme Court nomination. House Speaker Nancy Pelosi and Treasury Secretary Steven Mnuchin have given no public signs negotiations have been revived after stalling with the sides $900 billion apart on the size of a deal, much less what should be in it. The legislative calendar is dwindling for much more to be done ahead of the postelection lame duck session. The Senate is not scheduled to return until Wednesday next week and to work through Friday, though most workweeks end on Thursday. Rep. Steny Hoyer, the second-ranking Democrat in the House, told reporters on his weekly press call the House would be in session next week, regardless of whether the CR has been enacted. “We’re still scheduled to be in next week. We have a lot of pieces of legislation which are not controversial and people don’t know about them, but would be useful to pass, so it’s not as if we have finished the session. We’re not adjourning,” Hoyer said. He said he hoped Democrats would pass a slimmed down version of the $3.4 trillion bill they passed in May to deal with the economic impact of the coronavirus pandemic. House Speaker Nancy Pelosi has already said Democrats could accept a coronavirus bill at a lower $2.2 trillion level. “The sooner the better,” said Sen. Richard Shelby, the Alabama Republican who heads the Senate Appropriations Committee, said Wednesday of voting on the stopgap funding bill. “The CR passed by a big vote yesterday. I think it’s indicative of what we’ll do in the Senate,” he said. Shelby said the odds for a COVID-19 bill were “very slim,” though he cautioned against completely writing it off. “We’ve been hearing we’d probably go home this week. And if we don’t, if we’ll come back Wednesday and be here next week, for a little while,” he said, to deal with more presidential nominations."}]}