{"article": [{"url": "https://www.marketwatch.com/story/still-no-sign-of-the-sun-dense-smoke-from-wildfires-causes-dark-orange-skies-over-west-2020-09-09", "published": 1599694940.0, "headline": "'Still no sign of the sun': Dense smoke from wildfires causes dark, orange skies over West", "body": "SAN FRANCISCO - Hazy clouds of smoke from dozens of wildfires darkened the sky to an eerie orange glow over much of the West Coast on Wednesday, keeping street lights illuminated during the day and putting residents on edge. The California Highway Patrol urged drivers to turn on their headlights and slow down. Social media was filled with photos of the unusual sky, and many people complained that their cellphone cameras weren't accurately capturing the golden hues. \"It's really just strange and ominous outside, it feels like I should be in bed sleeping,\" said Aamir Vaid, who canceled plans to have lunch in downtown San Francisco because of the dark sky. iframe.twitter-tweet { width: 100% !important; } While satellites show a towering band of smoke hovering along the coast, there was little scent of smoke and the air quality index did not reach unhealthy levels. That's because fog drifting from the Pacific Ocean was sandwiched between the smoke and ground. And smoke particles above the marine layer were acting like a filter, scattering blue light and only allowing yellow, orange and red light to reach the ground, said Ralph Borrmann, a spokesman for the Bay Area Air Quality Management District. The smoke blocked out so much sunlight that a forecast for temperatures to climb to 90 degrees instead dipped to the 60s as though \"we're in perpetual morning without the sun to help us warm up,\" said Drew Peterson, a meteorologist with the National Weather Service's Bay Area office. Some of the smoke settled in San Francisco Bay and formed a 15-mile trail of ash along the tidal line, the U.S. Coast Guard said. Borrmann said the conditions were expected to linger until Friday. By then, the district expects to issue its 25th consecutive Spare The Air alert requiring residents to cut pollution - the longest stretch since the program began in 1991. The alerts began Aug. 18 after thousands of lightning strikes ignited three massive wildfires to the north, south and east of San Francisco. The previous streak was 14 days of alerts in 2018 when the Bay Area was choked by smoke from a fire that devastated the town of Paradise and killed 85 people. This time, strong winds from the north and northeast pushed smoke from devastating wildfires in the Sierra Nevada foothills and in Oregon and Washington state into lower elevations. A fire that exploded in size Tuesday and prompted evacuation orders for some 20,000 people in Oroville sent the air quality index in Sacramento to a hazardous reading at one point. iframe.twitter-tweet { width: 100% !important; } Poor visibility because of the dark sky also prevented California's largest utility, Pacific Gas & Electric PCG, +1.79%  , from doing some aerial inspections needed to restore power to about 167,000 customers, spokesman Jeff Smith said. The power was deliberately cut Monday to try to prevent power lines from sparking wildfires in windy weather. Air quality warnings also were issued throughout the Pacific Northwest, and people in communities from southern Oregon to north of Seattle have seen blood-red skies and choking smoke. \"It was scary. Especially as red as the sky was,\" said Patricia Fouts, who evacuated from a senior living center because of a massive fire east of Salem, Oregon. Winds coming from the Pacific Ocean will likely keep pushing the smoke across the U.S. West, worsening air quality, said Roger Gass, another weather service meteorologist. In Denver, a thick blanket of haze covered the skyline, obstructing mountain views typically visible from the city. Scott Landes, chief air quality meteorologist for Colorado's health department, said a cold front improved air quality but the state may start getting a new wave of smoke over the weekend because of drier, warmer temperatures. In Phoenix, the sky was finally blue after a cold front swept through, keeping wildfire smoke west and southwest of Arizona. Reno, Nevada, also saw blue for the first time in days after air quality reached a hazardous level a day earlier, prompting the Washoe County School District to cancel all in-classroom lessons. \"Everybody wants to know, when is this going to get better,\" Gass said. \"We have to remember, as long as the fires keep burning, they're going to continue to produce smoke.\""}]}