{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-covid-19-is-far-from-contained-and-could-rival-1918-flu-pandemic-that-killed-50-million-experts-warn-2020-07-15", "published": 1594881140.0, "headline": "Coronavirus update: COVID-19 is far from contained and could rival 1918 flu pandemic that killed 50 million, experts warn", "body": "The coronavirus pandemic is far from contained and could end up rivaling the 1918 flu that killed more than 50 million people worldwide, two leading health experts are warning. Dr. Anthony Fauci, the head of the U.S. National Institute for Allergies and Infectious Diseases, said that outbreak, which he called “the mother of all pandemics,” could be repeated if more is not done to contain it, during an online event with students from Georgetown University in Washington, D.C., on Tuesday, the Guardian reported. Fauci has of late been the subject of a series of attacks on his credibility from White House officials, including President Donald Trump, for days now. Separately, John M. Barry, a health sciences professor at Tulane University in New Orleans and author of “The Great Influenza: The Story of the Deadliest Pandemic in History,” warned that mistakes made in dealing with the U.S. outbreak — a failure to fully shut down until the country had achieved a steep downward trend in cases; a failure to get widespread buy-in for public health measures; and a failure to establish robust testing, tracing and isolating — has allowed the virus to spread, threatening lives and further disrupting the economy. In an op-ed in the New York Times, Barry noted how, during the 1918 flu, almost every city closed down most of its activity. “Fear and caring for sick family members did the rest; absenteeism even in war industries exceeded 50% and eviscerated the economy,” he wrote. “Many cities reopened too soon and had to close a second time — sometimes a third time — and faced intense resistance. But lives were saved.” If the U.S. had followed that course, it would be operating near 100% again by now, he wrote, Instead, as four former CDC heads wrote in a Tuesday op-ed in the Washington Post, the U.S. is home to a quarter of the world’s confirmed COVID-19 cases, despite accounting for just 4.4% of the global population. For more:Group of former CDC heads say no president has ever politicized the leading U.S. health agency the way Trump has The U.S. recorded 67,417 new COVID-19 cases on Tuesday, setting another record for cases counted in a single day, according to data aggregated by Johns Hopkins University. The U.S. now has 3.46 million confirmed cases of the deadly illness, and 136,940 Americans have died. How Coronavirus Spread Across the U.S. Florida reported 132 new coronavirus-related deaths Tuesday, its highest single-day tally since the start of the outbreak, and counted 9,194 new positive cases. Miami–Dade Country, the epicenter of the Florida outbreak, now has 69,802 confirmed cases, and 1,175 people have died, equal to a mortality rate of 43 per 100,000 residents. Oklahoma counted 993 new cases on Tuesday, while data from the Mississippi State Department of Health showed 805 patients in hospital, the highest number yet. North Carolina also set a record with 1,109 coronavirus-related hospitalizations. Oklahoma’s governor, Kevin Stitt, whose allegiance to the president and downplaying of the virus’s risks from the early days of the pandemic was a factor in his state’s being selected to host what turned out to be a lightly attended Trump rally last month, announced on Wednesday that he had contracted the virus and was experiencing symptoms. (The Tulsa rally “likely contributed” to a subsequent pickup in coronavirus diagnoses in the state, a health official said last week.) California, beset by testing challenges, overhauled guidelines on Tuesday to prioritize those who have been hospitalized with symptoms or are in close contact with people who have tested positive. The Golden State is not just short of testing kits; it is also short of essential workers, including intensive-care-unit staff. See:School reopenings should not be guided by politics, doctors say Dr. Adolphe Edward, CEO of El Centro Regional Medical Center in California’s Imperial County, told MSNBC it’s not just physical beds that are lacking: “I need the staff to take care of those patients. It actually reminds me of a war. This time the war zone is actually here in our own country, and it’s a war against COVID. It must be turned around because we really cannot continue to do what we’re doing,” Edward said. The outbreak in his county is so severe that about 500 patients have had to be sent to other parts of the state for treatment. Walmart announced Wednesday that it would require the wearing of face masks at its more then 5,000 U.S. stores beginning next Monday. The drumbeat of criticism of Fauci continued unabated, meanwhile, with White House trade adviser Peter Navarro saying in an op-ed in USA Today that the nation’s leading health expert “has been wrong about everything I have interacted with him on.” Navarro cited such issues as Fauci’s alleged resistance to imposing a travel ban on China, his early messaging about face masks and his opposition to the use of the antimalarial drug hydroxychloroquine as a treatment for COVID-19. That drug was found to be ineffective in multiple trials. Navarro had complained early this month that the malaria drug was being avoided, possibly for political reasons, as Trump had championed it for months and claimed he had taken a course of the drug prophylactically. “I’m literally sitting on 63 million doses of hydroxychloroquine in the FEMA strategic national stockpile,” Navarro told MSNBC on July 3, “that I can’t give away.” Medical experts, academics and others rebuked Navarro for his op-ed attacking an expert whose views are widely accepted by Americans in poll after poll. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } In another blow to the CDC, the Trump administration has requested that hospitals bypass it and send COVID-19 patient information to a central database in Washington, the New York Times reported, citing a document posted on the Department of Health and Human Services website. The department, and not the CDC, the main public health agency in the U.S., will handle daily reports on patients, available hospital beds, ventilators and other information needed to track the pandemic. The news dismayed public health experts as the data will not be open to the public, unlike CDC data, and will not be available to researchers who currently rely on CDC data to make decisions and projections. The news surprised the agency, the Times reported, citing two anonymous officials. “I find it very concerning,” said Richard Besser, CEO of the Robert Wood Johnson Foundation and a former CDC director, in an MSNBC interview. “It’s another example of the CDC being sidelined.” While there has been concern expressed that the CDC has been politicized by Trump as no president before him had done, HHS is seen traditionally as more firmly under the White House’s influence.Latest tallies There are now 13.4 million confirmed cases of COVID-19 worldwide, the Johns Hopkins data show. At least 580,502 people have died, while 7.4 million people have recovered. Brazil is second to the U.S. with 1.93 million cases and 74,133 deaths. India is third as measured by cases at 936,181, followed by Russia with 745,197 and Peru with 333,867. The U.K. has 45,138 fatalities, the highest in Europe and third highest in the world. China, where the illness was first reported late last year, has 85,226 cases and 4,642 fatalities.What’s the latest medical news? There was positive news from biotech Moderna Inc. MRNA, +0.09%, which said late Tuesday that its coronavirus vaccine candidate produced a “robust” immune-system response in a larger group of people and that the study will move to a decisive clinical trial in July, as MarketWatch’s Claudia Assis reported. Results published in the New England Journal of Medicine showed that a two-dose vaccination schedule induced the desired immune response in all 45 people evaluated, a larger group than in the preliminary data Moderna released in May, and was generally safe and well-tolerated, the company said. No serious adverse effects were reported, and some side effects that did occur, such as headaches and fatigue, were “generally transient and mild to moderate in severity,” the company said. Moderna is evaluating whether the participants’ immune responses are lasting, with participants followed for one year. A Phase 3 study will start this month “to demonstrate our vaccine’s ability to significantly reduce the risk of COVID-19 disease,” Moderna said. It added that it remained on track “to be able to deliver approximately 500 million doses per year, and possibly up to 1 billion doses per year” beginning in 2021. The later-stage trial is key, as it will involve the 30,000 patients that are required to really produce evidence of efficacy, analysts said. “There is no doubt that this vaccine, like its competitors, will face challenges clinically and commercially if the same rates of local and systemic reactions persist, or increase, in their pivotal trial cohort,” Geoffrey C. Porges, analyst at SVB Leerink wrote in a note to clients. ‘If they are offset by very strong disease prevention benefits, then these events are likely to be acceptable, but if not, or if they become more severe, they could significantly limit the vaccine’s adoption in healthy and low risk individuals.” In other vaccine news, the U.K. broadcaster ITV said positive news may emerge Thursday on initial trials of the Oxford COVID-19 vaccine, which is backed by AstraZeneca PLC AZN, +1.16% AZN, +0.63%. The report said “apparently the vaccine is generating the kind of antibody and T-cell (killer cell) response that the researchers would hope to see.”What’s the economy saying? Business activity in the Fed’s New York region increased in July for the first time since the pandemic began in March, according to the New York Fed’s Empire State Manufacturing Survey released Wednesday, as MarketWatch’s Greg Robb reported. The Empire State business-conditions index rose to 17.2 in July from negative 0.2 in the prior month. A reading above zero indicates improving conditions. Economists had expected a reading of 8.9, according to a survey by Econoday. Forty-one percent of manufacturers reported that conditions were better in early July than in June, up from 36% in the prior survey. “Recovery continues, but further significant near-term gains are unlikely,” said Ian Shepherdson, chief economist at Pantheon Macroeconomics. Industrial production rose 5.4% in June, the second gain after a steep drop in March and April, the Federal Reserve reported Wednesday. Wall Street economists had forecast a 4.1% gain, according to a MarketWatch survey. May output was up 1.4%. This followed a record 12.5% drop in April and a 4.4% decline in March. Industrial production is still down 10.9% compared with the pre-COVID-19 trend, and production fell at a 42.6% annual rate in the second quarter, the largest quarterly decline since right after the end of the second World War. “Ongoing issues related to virus-related interruptions as well as weak demand will continue to restrain output going forward,” said Rubeela Farooqi, chief U.S. economist at High Frequency Economics.What are companies saying? Bank earnings continued Wednesday, with quarterly numbers from investment bank Goldman Sachs that blew past estimates thanks to a strong performance from trading and fee-based income. Investment-banking revenue rose 36% to a record $2.66 billion, as “significantly higher” underwriting revenue partially offset weakness in corporate lending and financial advisory. Octavio Marenzi, CEO of the capital-markets management consulting firm Opimas, said the numbers were “almost indecent” and may have political ramifications. “The Fed has been able to engineer a huge bounce-back in the markets by injecting trillions of dollars, benefiting investment banks primarily,” said Marenzi. “This will lead to calls for the government to do more to help Main Street rather than Wall Street.” UnitedHealth Group Inc. had a less upbeat quarter, beating profit estimates but falling short on revenue, as premiums and services revenue missed. “As the [COVID-19] pandemic advanced, access to and demand for care was most constrained from mid-March through April, began to recover in May and approached more typical levels by the end of the second quarter,” the company said in a statement. Elsewhere, companies continued to offer updates on the state of their business in the new COVID-19 world. Here’s the latest news on companies and the pandemic: • Chipotle Mexican Grill Inc. CMG, +0.01% plans to add a total of 10,000 new hires, with 8,000 positions filled since hiring began in May. During the coronavirus pandemic, Chipotle has seen its digital orders grow 80% on a year-over-year basis, with digital sales becoming an increasingly significant part of the fast-casual chain’s business. New hires will help the company manage business growth. Chipotle also continues to add Chipotlanes, drive-through pickup lanes, to restaurants across the country, with the 100th Chipotlane launching in Ohio. • Goldman Sachs Group Inc. GS, -0.21% reported a second-quarter profit that was well above expectations, amid strong revenue growth in its markets and investment-banking businesses. Net income rose to $2.25 billion, or $6.26 a share, from $2.20 billion, or $5.81 a share, in the year-ago period. The FactSet consensus for earnings per share was $3.90. Total revenue grew 41% to $13.30 billion, as noninterest revenue climbed 47% to $12.35 billion to beat the FactSet consensus of $8.77 billion while net interest income fell 12% to $944 million to miss expectations of $1.16 billion. Investment banking revenue rose 36% to a record $2.66 billion, as “significantly higher” underwriting revenue partially offset by weakness in corporate lending and financial advisory. Global markets revenue soared 93% to $7.18 billion, as fixed income, currency and commodities (FICC) revenue more than doubled to $4.24 billion from $1.70 billion and equities revenue increased 46% to $2.94 billion. Goldman maintained its quarterly dividend of $1.25 a share. • Hanesbrands Inc. HBI, +1.41% was upgraded to strong buy from market perform at Raymond James based on its distribution at major retailers and the potential market share gains from Victoria’s Secret store closures. Raymond James has a $20 price target on Hanesbrands. Analysts list a number of company advantages, including its strong brands, which include Hanes and Playtex, and the scale of the business, benefits during the pandemic. Hanesbrands also rings up 25% of its sales at Walmart Inc. and Target Corp. “[B]oth are trading near all-time-high valuation levels, which indicates that the market believes they are retail winners and that likely implies their largest vendor partners should also be winners,” Raymond James said. • PVH Corp. PVH, -2.18%, the parent company of Calvin Klein, Tommy Hilfiger and Heritage Brands, plans to streamline its North American operations because of the pandemic. Those plans include exiting 162 outlet stores for Heritage Brands Retail and shaving its North American office workforce by 450 jobs, or 12%. The reductions are across all three brand businesses and corporate functions, which should result in annual cost savings of about $80 million. The Heritage Brands Retail stores are expected to operate through mid-2021. • UnitedHealth Group Inc. UNH, +1.68% reported a second-quarter profit that rose well above expectations, but revenue that came up short, as premiums and services revenue missed. Premiums revenue rose 4.7% to $49.39 billion to miss the FactSet consensus of $50.05 billion; products revenue fell 1.3% to $8.25 billion, but topped expectations of $8.08 billion; and services revenue dropped 7.6% to $4.16 billion, missing expectations of $4.99 billion. The company affirmed its 2020 adjusted EPS guidance range of $16.25 to $16.55. “As the [COVID-19] pandemic advanced, access to and demand for care was most constrained from mid-March through April, began to recover in May and approached more typical levels by the end of the second quarter,” the company said in a statement."}]}