{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-rise-taking-cue-from-stock-market-rally-2020-08-11", "published": 1597160300.0, "headline": "Oil futures end lower, but expectations for tighter U.S. supplies limit losses", "body": "Oil futures finished lower on Tuesday, with prices dragged down by traders’ need to cover margins on the back of big losses in the precious metals market, but expectations for tighter oil U.S. supplies limited price declines. “Oil could not ignore the big correction in precious metals,” said Phil Flynn, senior market analyst at The Price Futures Group. The sharp selloff in gold and silver Tuesday “led to some trickle over margin selling on oil,” he told MarketWatch. Gold futures suffered from their biggest daily dollar decline in more than seven years. West Texas Intermediate crude for September delivery CL.1, -1.62% US:CLU20 fell 33 cents, or 0.8%, to settle at $41.61 a barrel on the New York Mercantile Exchange, while the global benchmark, October Brent crude UK:BRNV20, lost 49 cents, or 1.1%, at $44.50 a barrel on ICE Futures Europe. WTI and Brent saw intraday highs at $42.94 and $45.79, respectively, on Tuesday. Settlements around those levels would have been the highest since early March, according to FactSet data. Traders eyed developments tied to efforts toward economic relief from the impact of the coronavirus. White House officials and top Democratic lawmakers on Monday indicated they were ready to resume talks on a coronavirus aid package after President Donald Trump over the weekend signed executive orders that would extend some elements of existing help that lapsed at the end of July, though there as little sign of movement. Those measures, meanwhile, face legal and logistical hurdles. Trump late on Monday said the administration was considering a cut in the tax rate on capital gains, which analysts said helped fuel gains for U.S. benchmark stock indexes. Analysts at JBC Energy, a Vienna-based consulting firm, noted that data showed U.S. rigs and frack fleets continued to fall week-over-week. Continued declines “could speak for further downside risk to U.S. supply relative to our current forecast of 10.8 million barrels a day” through the second half, they said. On the demand side, meanwhile, the analysts said their compound road-fuel demand indicator continued to trend largely flat on an aggregated global basis as well as in major parts of Europe and North America. On Nymex Tuesday, September gasoline US:RBU20 shed 2% to $1.2045 a gallon, while September heating oil US:HOU20 rose 0.1% to $1.2384 a gallon. September natural gas US:NGU20 settled at $2.171 per million British thermal units, up 0.8%. In a monthly report issued Tuesday, the U.S. Energy Information Administration raised its 2020 forecasts for U.S. and global benchmark oil prices, but reduced its U.S. crude production outlook for this year. The government agency also lifted its outlook for natural-gas prices to $2.03 per million Btus, up 5.4% from the July forecast. Energy traders also awaited weekly data on U.S. petroleum supplies, due out from the American Petroleum Institute late Tuesday and the EIA early Wednesday. On average, domestic crude stocks are expected to post a fall of 4.7 million barrels for the week ended Aug. 7, according to a poll of analysts conducted by S&P Global Platts. The analysts also forecast a decline of 2.1 million barrels in gasoline supplies and expect distillate inventories to edge down by 100,000 barrels for the week."}]}