{"article": [{"url": "https://www.marketwatch.com/story/dow-poised-to-rise-as-retailers-home-depot-walmart-deliver-better-than-expected-results-amid-coronavirus-2020-08-18", "published": 1597770140.0, "headline": "S&P 500, Nasdaq score record closes, reclaim their perch at all-time highs", "body": "Major U.S. stock indexes finished Tuesday mostly in record territory, despite ongoing wrangling in Congress over further coronavirus aid and concerns about how the economy will fare when an unprecedented raft of fiscal stimulus eventually burns off. How did major stock indexes fare? The Dow Jones Industrial Average DJIA, +0.56% slipped 66.84 points, or 0.2%, to close at 27,778.07. The S&P 500 index SPX, +0.87% gained 7.79 points, or 0.2%, finishing at a record 3,389.78, its first all-time closing high since Feb. 19. The Nasdaq Composite Index COMP, +1.39% added 81.84 points to reach 11,210.84, also a record close and its 34th of the year. On Tuesday, the Dow fell 86.11 points, or 0.3%, to end at 27,844.91, or 5.8% away from its record close. The S&P 500 rose 9.14 points, or 0.3%, closing at 3,381.99, only 0.1% away from its record closing peak at 3,386.15. The Nasdaq Composite Index added 110.42 points, or 1%, finishing at 11,129.73, while booking its 33rd record close of the year.What drove the market? The S&P 500 notched a fresh record close on Tuesday, setting a new high-water mark for an index that tracks many of the nation’s biggest corporations. Despite continuing concerns about the trajectory of the pandemic, the shape of the economic recovery and political turmoil in the U.S., it also marked the S&P 500’s quickest turnaround from bear-market territory in history, according to Dow Jones Market Data. “Our feeling is that a good deal of the easy lifting is behind us,” said Michael Hans, chief investment officer at Clarfeld Citizens Private Wealth, after the S&P 500 also briefly carved out its first intraday record since Feb. 19. “We have a resilient consumer, and benchmarks are back to all-time highs,” he told MarketWatch, but also added that it’s unclear what improvements in consumer spending, the labor markets and economic activity can be sustained without ongoing monetary and fiscal support. “The expectation is that policy will not be in place forever,” he said. Two of the nation’s biggest retailers reported second-quarter results that beat expectations, giving stock benchmarks a temporary boost. Shares of Walmart Inc. WMT, +1.00% and Home Depot Inc. HD, +0.49% briefly surged to record territory, but closed lower. Many retailers have been leveled by business closures imposed due to the COVID-19 pandemic, although Home Depot and Walmart have found some support from consumers focusing on home-improvement projects and general shopping needs. Walmart sells about 25% of all groceries bought in the U.S. and its results have been boosted by its partnership with Instacart, an internet startup for grocery deliveries. Read: Transactions of $1,000 or more rose 16% at Home Depot during the second quarter In economic reports, U.S. home builders began construction on homes at a seasonally-adjusted annual rate of 1.496 million in July, up 22.6% from the previous month and 23.4% from a year ago, the U.S. Census Bureau reported Tuesday, underscoring a powerful turnaround for coronavirus-stricken market. Increases in both single-family and multifamily starts contributed to the increase. Permitting activity occurred at a seasonally-adjusted annual rate of 1.495 million, up 18.8% from June and 9.4% from July 2019. Chris Zaccarelli, chief investment officer at Independent Advisor Alliance, pointed to the “massive amounts of liquidity that the Federal Reserve has injected into the system” as a catalyst for “the stunning recovery that we have just witnessed,” in emailed commentary, that also warned of numerous headwinds, including high unemployment, that could drag on the market. As U.S. economic activity slowly recovers from the coronavirus crisis, investors have begun to point to “political disarray” in America as a reason for the U.S. dollar’s recent decline. Treasury Secretary Steven Mnuchin, in a CNBC interview, said the economy is doing better as more businesses reopen, but that President Donald Trump wants Congress to do more. “He wants us to provide money for kids and jobs, and a second round of the PPP and direct payments are a clear part of that,” he said of the Treasury’s hallmark Paycheck Protection Program to help small businesses cover payroll during the pandemic. Meanwhile, Senate Republicans were expected to soon introduce a “skinny” coronavirus relief plan that also includes $10 billion for the U.S. Postal Service, which now sits at the heart a controversy over mail-in voting for the general elections on Nov. 3, according to several news reports. It is unclear if the new proposal will help break an impasse between the two political parties after $600 a week in extra unemployment benefits expired at the end of July. The Republican proposal includes a $300-a-week enhanced unemployment benefit, money for small-business aid, and protection for employers against lawsuits stemming from COVID-19 infections, according to Bloomberg. Several Democratic state attorneys general also said Tuesday they plan to sue the Trump administration to thwart any changes to the U.S. Postal Service that could hamper mail-in voting for the upcoming election. Postmaster General Louis DeJoy pledged that the mail service is ready today to handle all of the mail-in ballots it receives in November. Also on investors’ radar, the U.S. has imposed fresh restrictions on Huawei, after President Donald Trump again said the China technology group’s products are spyware.Which stocks were in focus? Oracle Corp. ORCL, +0.42% has entered the picture as a potential buyer of TikTok, the Financial Times reported Monday night. Its shares closed up 2.2%. Shares of Walmart Inc. WMT, +1.00% finished 0.7% lower, after surging in premarket trade after the retailer produced better-than-expected second-quarter results. Retailer Kohl’s KSS, -1.64% also reported results that were above consensus forecasts but the company didn’t provide same-store sales results due to the coronavirus closures. Shares slumped 14.7%. Shares of Home Depot Inc. HD, +0.49% also surged in premarket trading Tuesday, after the retailer reported a fiscal second-quarter profit that rose above expectations, but closed down 1.1%. Shares of Advance Auto Parts Inc. AAP, -1.48% rose 1.2% Tuesday, after the auto-parts seller reported a fiscal second-quarter profit that was well above expectations, helped by the best same-store sales performance in nearly 10 years. Boeing Co. BA, -0.39% will offer its employees a second round of buyouts, the aviation giant said Monday. “While we have seen signs of recovery from the pandemic, our industry and our customers continue to face significant challenges,” Boeing said in a statement. Shares closed down 1% Tuesday. Carnival Corp CCL, +0.51% shares ended 1.8% lower after the cruise liner said its Holland America Line division is opening bookings for the 2021 Grand Africa Voyage and 2022 Grand World Voyage. Tesla Inc TSLA, +1.89% shares rose 2.8% Tuesday, notching a fifth straight gain and third straight record close. PG&E Corp. PCG, +1.79% shares advanced 2.1%, as California customers were told to expect further power outages Tuesday that could last about two hours. amid “above-normal” temperatures across the state. How did other markets trade? In Asia on Monday, China’s CSI 300 index 000300, +2.04% closed less than 0.1% lower, while Hong Kong’s Hang Seng Index HSI, -0.30% advanced 0.1% and Japan’s Nikkei 225 NIK, -0.11% declined 0.2%. In Europe, the Stoxx 600 Europe Index SXXP, +0.55% closed down 0.6% in the region, while the U.K.’s FTSE 100 UKX, +0.64% ended 0.8% lower. The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% was 1.5 basis points lower at 0.668%. Bond prices move inversely to yields. Gold prices for December delivery GCZ20, +2.17% rose 0.7%, to settle at $2,012.10 an ounce. U.S. crude-oil prices US:CLU20 finished unchanged at $42.89 a barrel. The ICE U.S. Dollar Index DXY, -0.58%, a gauge of the buck against a half-dozen major rivals, was down 0.6% to 92.29, near its lowest level since 2018."}]}