{"article": [{"url": "https://www.marketwatch.com/story/u-s-closes-in-on-something-it-hasnt-done-since-wwii-borrow-more-money-than-it-raises-11597494896", "published": 1597661000.0, "headline": "U.S. is closing in on doing something it hasn't done since World War II - borrowing more money than it raises", "body": "The image of President George Washington on an engraving plate for a one-dollar bill at the Bureau of Engraving and Printing in Washington. REUTERS/Gary Cameron/File Photo Amid the economic devastation caused by the coronavirus pandemic, the U.S. government is nearing a new - and potentially ominous - fiscal milestone: It will borrow as much or more this year than it raises through taxes and other means. The last time that happened was in the final year of World War II. According to White House Council of Economic Advisers data, the government raised $45.2 billion in 1945 and ran a deficit of $47.6 billion that year. The government covers the difference between what it brings in and what it spends each year by borrowing. (Technically, it borrows even more in order to have cash on hand and roll over maturing debt.) Through July, the government had raised $2.824 trillion in revenue, mostly through income taxes and payroll taxes. But it had spent $5.631 trillion, leaving a hole of $2.807 trillion filled by borrowing. Read more: Soaring U.S. budget deficit takes a breather in July - but it will soon be going back up In 1945, the U.S. was in the final chapter of a two-front global war. Now, it is trying to deal with a worldwide pandemic, one that socked state and federal revenues as jobs disappeared. It also required higher government spending, as Congress and the White House agreed on $2.4 trillion in COVID-19 relief earlier this year. Shai Akabas, director of economic policy at the Bipartisan Policy Institute, noted the nonpartisan Congressional Budget Office said in June it expected a $3.7 trillion deficit for the fiscal year, which ends Sept. 30. \"That figure will rise if Congress passes further legislation next month before the end of the fiscal year. All told, I think it's a pretty safe bet that the deficit ends up exceeding revenue, meaning that revenues covered less than half of all the spending we did this year,\" he said in an email. Democrats in Congress and the White House have been deadlocked on the size of another coronavirus aid bill, with House Democrats passing a $3.4 trillion bill in May and the White House pushing for a smaller package close to $1 trillion. Read more: Pelosi says sides remain 'miles apart' on stimulus bargaining Spending more from borrowed money than from revenues would mark another milestone in a year that has blown up most expectations. The deficit will be the largest ever in terms of sheer dollar size, far surpassing 2009's $1.413 trillion. As a proportion of the economy, though, a measure most economists say better reflects the context of the deficit, the 2020 gap will probably only be the fourth highest on record, behind a stretch from 1943 to 1945, when the deficit peaked at 26.9% of the size of the economy and shrank to 20.9%. Still, the growing debt was enough to make Fitch Ratings in July downgrade its prognosis for U.S. Treasury debt ahead, changing its outlook from \"stable\" to \"negative.\" It kept the overall rating for Treasury debt at AAA, however. \"High fiscal deficits and debt were already on a rising medium-term path even before the onset of the huge economic shock precipitated by the coronavirus,\" Fitch said in explaining the new debt outlook. In a recent survey of firms that regularly bid in Treasury's debt auctions, so-called primary dealers estimated the 2020 deficit to come in somewhere between $3 trillion and $5 trillion, with an average projection of $4 trillion. While it was only at $2.8 trillion through July, Akabas said he would be surprised if the shortfall came in much under $3.5 trillion. \"This scary reality is the culmination of at least three factors: 1.) We were already running large, and eventually unsustainable, deficits pre-COVID; 2.) The crisis has caused revenues to fall well below expectations and countercyclical spending to spike; 3.) The government's fiscal response has been appropriately large, adding significantly to deficits,\" he said."}]}