{"article": [{"url": "https://www.marketwatch.com/story/stocks-in-europe-climb-on-economic-optimism-2020-06-23", "published": 1592890940.0, "headline": "Stocks in Europe and U.S. futures climb on economic optimism", "body": "European stocks advanced on Tuesday, getting a lift on hopes the economy will continue to recover without a spate of new virus cases throwing lockdown-easing measures off course. The Stoxx Europe 600 SXXP, +0.55% advanced 1.2%, with banks including Banco SAN, -1.28% and HSBC Holdings HSBA, -1.49% leading the index higher. The German DAX DAX, +0.06%, French CAC 40 PX1, +0.71% and the U.K. FTSE UKX, +0.64% also rose. Futures on the Dow Jones Industrial Average YM00, +0.82% rose 223 points, after briefly getting knocked by comments by White House trade adviser Peter Navarro on the U.S.-China trade deal, which he later walked back. The Dow Jones Industrial Average DJIA, +0.56% ended Monday with a 153-point gain. Navarro and President Donald Trump’s insistence that the trade deal was still in place put the focus back on the economy. The U.K. government is expected on Tuesday to outline further lockdown-easing measures. Purchasing managers indexes also pointed to an economy moving past its worst. The flash eurozone composite purchasing managers index rose to a 4-month high of 47.5 in June from 31.9 in May, Markit said on Tuesday, though the figure was still below the 50-mark, indicating deteriorating conditions. It did beat the 42.0 FactSet-compiled economist forecast. “Overall we see the second-wave and U.S. election stories as contributing to market volatility as headlines feed investors’ hopes and fears about the speed and strength of the economic recovery. But it is the Fed story that will endure over the medium term,” said Mark Haefele, chief investment officer at UBS Global Wealth Management. Of stocks on the move, Hikma Pharmaceuticals HIK, +1.85% slumped 7%, as the company bought back 12.8 million shares of the 27.2 million shares Boehringer Ingelheim sold. Wirecard WDI, +0.14% rose for the first time since it revealed a €1.8 billion of missing cash on its balance sheet that it now concedes probably never existed in the first place, climbing 22%. The Munich prosecutor said the former chief executive, Markus Braun, has been detained."}]}