{"article": [{"url": "https://www.marketwatch.com/story/apple-rolls-out-a-cheaper-apple-watch-subscription-bundles-and-more-11600198994", "published": 1600188800.0, "headline": "Apple rolls out a cheaper Apple Watch, subscription bundles and more", "body": "The Apple Watch SE is a cheaper Apple Watch that offers a performance boost over the Series 3 and more modern design. Apple Apple Inc. unveiled new Apple Watches and iPads Tuesday at a fall launch event that was devoid of iPhone announcements. The company also announced a new fitness subscription service and the option to bundle Apple AAPL, +1.74% services for a lower price than users would have had to pay to sign up for them each individually. Apple shares were up throughout the event but pulled back a bit afterward. They ended the session up 0.2%. Two watches In keeping with the “Times Flies” tagline for this event, Apple began its virtual production by rolling out two Apple Watch models. The flagship device is its new Series 6 model, which features a blood-oxygen sensor for the first time. Other enhancements include an “always-on altimeter,” which will provide real-time elevation readings on the watch face, and a new dual-core processor that offers performance boosts and a faster load time for applications. The Series 6 will come in blue and red, along with Apple’s usual silver, space gray and gold-aluminum choices. There are also more premium stainless steel and titanium models. Apple is also rolling out new watch bands that slide onto the wrist and don’t require a clasp. This style will be available in Apple’s traditional smooth silicone and also in a braided pattern. The Series 6 model begins at $399 for the GPS version and $499 for the cellular version. It will be available Friday, and preorders start today. The company announced a new lower-cost model as well, which will be called the Apple Watch SE. This device, which starts at $279 for GPS and $329 for cellular, offers Apple’s newer design with a slimmed-down feature set. The SE has a display that’s 30% larger than the Series 3 model, which Apple will continue to sell for a starting price of $199. Its performance is up to two times faster than the Series 3, Apple said. Apple is launching a family-setup feature for cellular Apple Watches in Series 4 or later that will let adults manage the wearable for children or older adults who don’t have their own iPhones. Those managing the watch will be able to choose which contacts children can communicate with, send their kids money to spend via the Apple Pay tool on the watch, and get updates about a child’s location at a given time. A fitness subscription and new bundles Apple Watch users will be able to try out the company’s new fitness subscription service, which offers video-based workouts in categories like yoga, cycling, treadmill running, and strength. Users can start workouts from their iPhone, iPad or Apple TV, which will allow the Apple Watch to start monitoring activity for this specific type of exercise. The Fitness+ service costs $9.99 a month or $79.99 a year. For the first time, Apple will also start bundling its subscriptions in a package the company is calling Apple One. The most basic version is an individual plan that offers access to Apple TV+, Apple Music, Apple Arcade, and 50GB gigabytes of iCloud storage for $14.95 a month. A family package lets up to six family members access the same three services but upgrades the iCloud storage to 200GB for the group, and it costs $19.95 a month. Apple is offering a premier version in certain countries, which ups the storage capacity to 2 terabytes for a family to share and includes Apple News+ and Apple Fitness+ as additional subscriptions. This tier costs $29.95 a month. Apple said it would provide 30-day free trials for subscriptions that users don’t already have. New iPads Apple gave a performance boost to its entry-level iPad Tuesday while also making upgrades to its iPad Air line. The company’s regular, eighth-generation iPad will be the first in this entry-level line to feature Apple’s neural engine, thanks to an A12 bionic chip in the device. Apple said in a release that this chip gives the new iPad 40% faster CPU performance relative to the prior-generation model. This 10.2-inch device is open for orders today and it will become available Friday. The Wi-Fi model starts at $329 while the cellular version starts at $459 in the U.S. The newly announced iPad Air features a 10.9-inch screen size, larger than its predecessor, as well as a faster A14 bionic chip that Apple said offers a strong performance boost. The company calls the A14 Bionic its “most advanced chip” with a 40% boost in CPU performance over its predecessor. The chip uses “breakthrough 5-nanometer process technology,” according to Apple’s release. The Air becomes available next month and will start at $599 for the Wi-Fi model or $729 for the cellular version. The device will come in silver, space gray, rose gold, green, and sky blue. Apple shares have added 35% over the past three months as the Dow Jones Industrial Average DJIA, +0.56%, which counts Apple as a component, has increased roughly 9%."}]}