{"article": [{"url": "https://www.marketwatch.com/story/consumer-credit-fell-a-smaller-53-in-may-as-the-economy-began-to-recover-2020-07-08", "published": 1594222880.0, "headline": "Consumer credit fell at a slower 5.3% in May as the economy began to recover", "body": "The numbers: Consumer borrowing fell at a slower 5.3% annual pace in May after a huge decline in April, as the economy began to recovery from the deepest downturn in American history. Total consumer credit dropped by an annual rate of $18.2 billion in May, compared to a much larger $70.2 billion plunge in April, according to Federal Reserve data released Wednesday. The use of credit sank in April at the height of the coronavirus pandemic by a 20% rate, marking the biggest decline since World War Two. Many businesses were forced to close, millions of people lost their jobs and spending tumbled as anxious Americans saved their money. The U.S. economy began to reopen in May and the government doled out trillions of dollars in business loans, more generous unemployment benefits and other measures to save a sinking economy. Read:Federal Reserve leaders see ‘bumpier’ recovery, slower decline in unemployment What happened: Revolving credit, like credit cards, declined at a nearly 29% clip in May. In April, revolving credit shrank by a record 65%. Yet nonrevolving credit, typically auto and student loans, actually rose 2.3%. Auto sales rebounded during the month. The Fed’s credit data does not include mortgage loans. See: MarketWatch Economic Calendar Big picture: Most households naturally cut back on spending during the early stages of the pandemic, unsure of their own job security and what would happen to the economy. Generous government aid and the return of 7.5 million people to their jobs in May and June has given boost to spending, but it’s likely to remain depressed until the threat from the coronavirus fades. Read:U.S. regains 4.8 million jobs in June. Is rehiring poised to slow? Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% rose slightly in Wednesday trades."}]}