{"article": [{"url": "https://www.marketwatch.com/story/harris-promises-to-offer-free-tuition-for-low-income-students-at-public-and-historically-black-colleges-11599773169", "published": 1599759260.0, "headline": "Harris promises to offer free tuition for low-income students at public and historically Black colleges", "body": "Democratic vice presidential nominee Sen. Kamala Harris welcomed by a marching band at Florida Memorial University, a historically Black private university, on Thursday. Getty Images Democratic vice-presidential nominee Sen. Kamala Harris promised Thursday that a Biden-Harris administration would make college tuition free at public schools and private historically Black colleges and universities for students whose families’ income is below $125,000 a year, and pledged student-loan debt forgiveness for some graduates of HBCUs. “In relation to the history of HBCUs, [students] decide to take on a profession of service, which often does not pay as well as if they go into the private sector and do other things,” Harris said at a roundtable discussion held at Florida Memorial University, a historically Black private university. “So for those students who come out and have jobs that pay less than $125,000, student-loan debt will also be forgiven.” Harris also promised to invest $70 billion in historically Black colleges and universities. Additionally, she said that two-year college programs would be free for low-income Americans. “We want to support our young people for whatever they pursue by way of education after high school,” Harris said. “For some that will be a college and university, for some it will be a two-year program, or an apprenticeship, or something of that nature, and we want to make sure that we support them in that quest.” Harris made the remarks in response to Jaffus Hardrick, president of Florida Memorial University, who said that “we are literally working on a shoestring budget” amid the economic decline caused by the pandemic that has forced many students to reconsider attending college. During her short-lived presidential campaign, Harris proposed making community college free. Her remarks came in the key swing state of Florida, where 29 electoral votes are up for grabs, the most among any of the major swing states. Former President Barack Obama claimed the state by a thin margin in the 2008 and 2012 elections. President Donald Trump, however, won it in the 2016 election. In a RealClearPolitics moving average of polls focused on top swing states that are likely to decide the election, Democrat Joe Biden had an edge of 3.9 percentage points over Trump as of Thursday, but his edge in Florida was just 1.2 points. Before addressing the roundtable, Harris took a jab at Trump, citing the interview he had with Bob Woodward where he said “I wanted to always play it down,” referring to the threat of the looming pandemic. “He suggested that to wear a mask is a sign of weakness as opposed to a sign of strength,” she said. “This is the president of the United States.” Earlier in the day, Harris visited Doral, a neighborhood of Miami with a high concentration of Venezuelans. Two days prior, Trump also visited South Florida, where he signed an order extending a moratorium on offshore drilling around Florida’s Gulf Coast. Biden is scheduled to visit the Sunshine State on Sept. 15."}]}