{"article": [{"url": "https://www.marketwatch.com/story/shame-on-you-mr-barr-attorney-general-clashes-with-democrats-over-protests-2020-07-28", "published": 1595942600.0, "headline": "â\u0080\u0098Shame on you, Mr. Barrâ\u0080\u0099: Attorney general clashes with Democrats over protests", "body": "Attorney General William Barr clashed with Democrats during a heated House Judiciary Committee hearing on Tuesday, as he defended the Trump administrationâ\u0080\u0099s response to protests and his involvement in high-profile cases. As protests continued in Portland, Ore., Barr told lawmakers on the panel that such demonstrations are â\u0080\u009can assault on the government of the United States.â\u0080\u009d The cityâ\u0080\u0099s federal courthouse has been at the center of nightly demonstrations. In an early moment of tension, House Judiciary Chairman Jerrold Nadler accused Barr of â\u0080\u009cprojecting fear and violence nationwideâ\u0080\u009d in a pursuit of â\u0080\u009cobvious political objectives.â\u0080\u009d â\u0080\u009cShame on you, Mr. Barr,â\u0080\u009d said Nadler, a New York Democrat. Barrâ\u0080\u0099s testimony was the first before the judiciary panel and came as House Democrats investigate allegations of political interference at the Justice Department. The attorney general rejected charges that he has politicized his agency to defend President Donald Trump. Barr has come under fire for, in one example, lessening the sentencing recommendation for Trump friend Roger Stone. Trump â\u0080\u009chas told me from the start that he expects me to exercise my independent judgment, to make whatever call I think is right, and thatâ\u0080\u0099s precisely what Iâ\u0080\u0099ve done,â\u0080\u009d Barr said in his opening statement. Republicans like Rep. Jim Jordan of Ohio defended Barrâ\u0080\u0099s response to the protests in Portland and elsewhere. Jordan played a string of video clips that showed violence in different parts of the country. The Trump administration says federal agents were sent to Portland to protect federal property. Local officials, meanwhile, have demanded they leave. Protests have been sparked by the killing in May of George Floyd, an unarmed Black man, by Minneapolis police."}]}