{"article": [{"url": "https://www.marketwatch.com/story/pending-home-sales-staged-a-historic-rebound-in-may-meaning-the-worst-may-have-already-come-for-the-real-estate-market-2020-06-29", "published": 1593427760.0, "headline": "Pending home sales staged a historic rebound in May, meaning the worst may have already come for the real-estate market", "body": "The numbers: After two consecutive months of decline, the index of pending home sales soared 44.3% in May as compared with April, the National Association of Realtors reported Monday. The monthly increase was the largest ever since the National Association of Realtors started the index in January 2001. “This has been a spectacular recovery for contract signings, and goes to show the resiliency of American consumers and their evergreen desire for homeownership,” Lawrence Yun, chief economist for the National Association of Realtors, said in the report. “This bounce back also speaks to how the housing sector could lead the way for a broader economic recovery.” The index measures real-estate transactions for previously-owned homes where a contract was signed but the sale had not yet closed, benchmarked to contract-signing activity in 2001. Compared with a year ago, contract signings were still down 5.1%, a sign of how steep the declines in March and April were given the record monthly increase in May. What happened: Every region saw a monthly increase in pending home sales, led by the West (up 56%) and the Northeast (up 44%). Only the South saw a year-over-year uptick in contract signings. With the improved outlook on home sales, Yun said the National Association of Realtors now expects existing-home sales to reach 4.93 million this year and new home sales to reach 690,000. The big picture: The rebound in pending home sales means that there likely won’t be repeats of May’s significant downturn in existing-home sales for months to come. Together with last week’s new home sales report for May, which also measures contract signings, it appears that home buyers are eager to re-enter the housing market. As such, the typically busy spring home-buying seasons appears to have been delayed for most buyers rather than foregone outright. Research has shown that the job losses related to the coronavirus pandemic have largely occurred for lower-paid workers who are less likely to be home buyers, so the people looking to purchase a home have weathered the recession well to this point. And record-low mortgage rates are proving to be a major incentive. Still, buyers will face trouble finding homes to buy. Sellers are still somewhat reluctant to list their homes because of concerns about the coronavirus and the economy. Before the pandemic began, the U.S. already saw a very short supply of homes for sale. For buyers in today’s market, that means they can expect more competition and higher prices for the properties that are available. What they’re saying: “New home sales took a similar upward turn last week, but today’s pending data is a more important indicator of market activity since it covers existing homes which made up roughly 80 to 90 percent of sales in recent years. This move confirms that May closings could represent a low-point for home sales, with June and July numbers looking much better,” said Danielle Hale, chief economist at Realtor.com. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and the S&P 500 SPX, +0.87% were both up slightly in Monday morning trading on the heels of the housing data, despite a continued rise in COVID-19 cases."}]}