{"article": [{"url": "https://www.marketwatch.com/story/trump-says-his-executive-actions-led-to-stock-markets-gain-as-briefing-gets-interrupted-by-shooting-2020-08-10", "published": 1597087280.0, "headline": "Trump says his executive actions led to stock market's gain, as briefing gets interrupted by shooting", "body": "President Donald Trump on Monday tied the latest gains in the stock market to his coronavirus-aid moves on Saturday, as he spoke at a news conference that was interrupted by a shooting outside the White House. \"So we issue those executive orders, and the stock market went up 358 points today. It's quite a reaction,\" Trump told reporters. The president's news conference then went on an abrupt break shortly after starting, with Trump ushered out of the briefing room, but he returned after a few minutes. Trump said there had been a shooting outside the White House, with law enforcement shooting a suspect, but the situation was under control. iframe.twitter-tweet { width: 100% !important; } \"I'd like to thank the Secret Service for doing their always quick and very effective work,\" he said. \"Somebody's been taken to the hospital.\" A Secret Service tweet said the shooting happened near 17th Street and Pennsylvania Avenue, an intersection that's close to the White House. \"It was outside of the premises,\" Trump said. Monday's news conference followed Trump's Saturday decision to issue an executive order and memorandums that were billed as providing coronavirus relief after bipartisan talks over another big aid package stalled. The actions aim defer payroll taxes and some student-loan payments, as well as replace an expired $600 unemployment benefit with a $400 payment and continue a freeze on some evictions, but experts said they don't appear feasible or legal. Related:What does Trump's payroll-tax deferral mean for your paycheck? Not much And see:After Trump actions on aid, negotiators can only talk about a lack of relief talks The S&P 500 SPX, +0.87%  and Dow Jones Industrial Average DJIA, +0.56%  each advanced for the seventh session in a row on Monday, with the Dow adding 358 points, or 1.3%. TRUMP TALKS GETTYSBURG AND G-7 Also on Monday, Trump tweeted that he and his re-election campaign would decide soon on where he will deliver his speech accepting the Republican Party's nomination, saying the choice is between the White House and the Gettysburg battlefield in Pennsylvania. In addition, the president said at his news conference that he favored holding the 2020 G-7 summit after the November U.S. elections. The meeting already has been delayed due to the coronavirus pandemic. The G-7 countries are the U.S., Canada, Japan, Germany, Italy, the U.K. and France. In RealClearPolitics averages of polls as of Monday, presumptive Democratic presidential nominee Joe Biden is leading Trump by 6.9 percentage points in nationwide surveys and by 5.0 points in top swing states. Trump and his re-election campaign have said pollsters are getting the 2020 race wrong."}]}