{"article": [{"url": "https://www.marketwatch.com/story/trump-contradicts-narrative-that-he-was-in-jest-when-he-appeared-to-advocate-a-slowdown-in-coronavirus-testing-2020-06-23", "published": 1592932040.0, "headline": "Trump contradicts narrative that he was speaking in jest when he appeared to advocate a slowdown in coronavirus testing", "body": "Saturday (at a Make America Great Again comeback rally in Tulsa, Okla.): President Donald Trump says he told his “people” to ease off on testing for the coronavirus causing the disease COVID-19 because “you’re going to find more people, you’re going to find more cases” the more testing rates swell. “So I said to my people, ‘Slow the testing down, please,’ ” he quotes himself as having pleaded. Sunday (on the CNN program “State of the Union”): Trade adviser Peter Navarro says Trump was engaging in a “lighthearted moment” at the rally when he, in a “tongue-in-cheek” manner, spoke of slowing down testing. (The same day, CBS cites another, anonymous White House official as calling Trump’s testing comment “in jest.”) Monday (at the White House): Press secretary Kayleigh McEnany appears to confirm Navarro’s explanation of the Trump remark, saying it had been delivered “in jest.” (Meanwhile, Vice President Mike Pence is quoted by ABC and others as having told governors that Trump’s comment was “in passing.”) Tuesday (outside the White House): Trump appears to reveal as artifice the narrative pushed by McEnany, Navarro and company, telling reporters as he departed for a trip to Arizona: “ ‘I don’t kid. Let me just tell you. Let me make it clear.’ ” Responded presumptive Democratic opponent Joe Biden, on Twitter: “ ‘It’s pretty simple: If we want to save people’s jobs and save people’s lives, we need more testing — and we need it faster. The President is intentionally slowing it down.’ ” In testimony before a House panel on Tuesday, though, Dr. Anthony Fauci suggested neither he nor other members of the White House coronavirus task force have received a slowdown order from Trump. “We will be doing more testing,” Fauci said."}]}