{"article": [{"url": "https://www.marketwatch.com/story/uk-economy-has-shed-700000-jobs-since-march-but-the-worst-may-be-yet-to-come-2020-09-15", "published": 1600195640.0, "headline": "U.K. economy has shed 700,000 jobs since March. And it's about to get worse", "body": "The U.K. economy has shed nearly 700,000 jobs since March because of the lockdown forced on it, with five million people still temporarily kept away from work, the U.K.'s statistics office said on Tuesday. - The U.K. unemployment rate rose to 4.1% in the three months to July, mostly due to the increase in the number of unemployed young people. This remains one of the lowest in Europe, where it stood at 7.2% in the European Union in July. - The job situation deteriorated despite the generous furlough programs and other job-supporting measures decided by the government in the significant stimulus plan it unveiled early in the crisis to counter the effects of the coronavirus pandemic. - Despite the sharpest fall of gross domestic product in Europe in the second quarter of the year, the U.K. is the country that best protected jobs over the same period, with the number of people employed roughly stable, while it fell by 3% in the rest of Europe. - In a study released this week, the Institute for Employment Studies estimated that nearly 450,000 dismissals by U.K. employers are expected in the next three months. Read:After U.K. tries to rewrite its 'Brexit' from the EU treaty, can it ever strike trade deals with the U.S. and others? The outlook: Like other similar economies, the U.K. is bracing for a serious deterioration of the labor market in the months to come. First, because the swift recovery that followed the easing of restrictions in June is already slowing down. Second, because the government is phasing out the costly job-support programs it adopted in March. Third, because Brexit will hurt the economy when it becomes real on January 1 - and the hit will be even worse if the EU and U.K. fail to conclude a trade deal, as is becoming likely. Read:New Japan leader Yoshihide Suga was Shinzo Abe's key enforcer of Abenomics - now he has to tackle coronavirus and a recession"}]}