{"article": [{"url": "https://www.marketwatch.com/story/report-that-trump-is-400-million-in-debt-raises-national-security-concerns-01601332900", "published": 1601318960.0, "headline": "Report that Trump is $400 million in debt raises national-security concerns", "body": "President Donald Trump speaks Monday in the Rose Garden of the White House. Getty Images WASHINGTON — Revelations that President Donald Trump is personally liable for more than $400 million in debt are casting a shadow over his presidency that ethics experts say raises the national-security concern that he could be manipulated to sway U.S. policy by individuals or entities he’s indebted to. New scrutiny of Trump, who claims great success as a private businessman, comes after the New York Times reported that tax records show he is personally carrying more than $300 million in loans that will come due in the next four years. Sen. Elizabeth Warren, D-Mass., was blunt about the potential implications. “He may be vulnerable to financial blackmail from a hostile foreign power and God knows what else,” said Warren, a frequent Trump critic. The Times said the tax records also show that Trump did not pay any federal income taxes in 11 years between 2000 and 2018, raising questions about the fairness of a president — who purports to be a billionaire — paying less in taxes than most Americans. The politically damaging revelations about Trump’s tax avoidance, however, are perhaps less concerning than word the president is holding hundreds of millions of dollars of soon-to-mature debt, ethics experts said. “Americans should be concerned about the president’s debt because it’s a national-security risk for our country,” said Donald Sherman, deputy director of the nonprofit government watchdog group Citizens for Responsibility and Ethics in Washington (CREW). “This is information that the president has aggressively and repeatedly tried to keep away from the public.” Trump, citing an ongoing Internal Revenue Service audit, has refused to follow the post-Watergate precedent set by other presidents of releasing his tax returns, so the complexities of his financial interests and whom he does business with have remained opaque. He’s fighting ongoing court battles with New York’s attorney general, Manhattan’s district attorney and two House committees over the provision of tax records. Richard Painter, who served as chief ethics attorney in Republican George W. Bush’s White House, also noted that Trump-owned companies have declared bankruptcy six times, raising the question: Why have lenders been willing to keep risking loans of such enormous amounts? Trump, according to his latest financial-disclosure statement, reported that he had 14 loans on 12 properties. One lender, Frankfurt-based Deutsche Bank DB, -0.85%, continued to do business with Trump even after he defaulted in 2008 on a loan for his Chicago hotel and condominium tower. Trump filed suit against the bank and others whom he blamed for his inability to repay. But Deutsche Bank’s private-banking division continued to lend to Trump, including $125 million to finance the purchase and renovation of his Doral golf resort in 2012, according to previous disclosures. Trump on Monday suggested that his debt load is hardly unusual in comparison with his assets, claiming in a tweet that he’s in fact “extremely under leveraged.” “I have very little debt compared to the value of assets,” he wrote, adding that he may release a financial statement that spells out all assets, properties and debts. Trump during an appearance on Monday ignored a reporter’s question about when he might release such a statement, and the White House would not comment on when he might follow through. He said repeatedly before his election four years ago that he would release his actual taxes but never has. Kathleen Clark, a government ethics expert at Washington University in St. Louis, said that a separate financial statement from Trump would shed little light on his business dealings if he does not disclose who his business partners are in his various holdings. The Trump Organization consists of hundreds of limited-liability, or LLCs, that “have been listed on his financial-disclosure forms,” Clark said. Trump refused to divest his business interests after his 2016 victory, and left day-to-day operation of his family’s real estate and other holdings to his sons Donald Jr. and Eric. Still, the president has benefited personally from U.S. and foreign government activity at his properties since his election and hasn’t shied away from promoting his hotels and golf courses. Republicans have held at least 88 political events at his properties, the president has visited his hotels and golf courses more than 500 times, and at least 13 foreign governments have held events at Trump establishments, according to a tally by CREW. The administration drew criticism last year when Vice President Mike Pence, while visiting Dublin for meetings, lodged at Trump International Golf Links and Hotel more than 180 miles away in Doonbeg, Ireland. And only under intense pressure did Trump scrap a plan to hold a meeting of the Group of 7 world leaders at one of his Florida properties last year. In the run-up to his 2016 election victory, Trump played down his bankruptcies as a smart business strategy and even referred to himself as the “king of debt.” “ An inability or unwillingness to satisfy debts and a history of not meeting financial obligations could disqualify any federal employee from receiving a security clearance. ” “I’ve always loved debt, I must be honest with you,” Trump said during a campaign rally. “I don’t love it for countries, but I love it individually. If things work out good that’s great, [and] if they don’t, you go renegotiate.” The New York Times, citing the tax records it obtained, also revealed that Trump did not pay federal income tax in 11 of 18 years, and just $750 each year for 2017 and 2018, as he claimed millions of dollars in business losses. Top Democratic lawmakers on Monday called Trump’s tax avoidance galling, but seized on his debt as perhaps more concerning. House Speaker Nancy Pelosi said on MSNBC that “our responsibility is to protect and defend and we have to make sure we know what exposure the president of the United States has, and what an impact it has on national security decisions for our country.” Painter said that if Trump were attempting to appoint someone with his massive debt load to a high-profile government position, the nominee would almost certainly face trouble getting a security clearance. Indeed, inability or unwillingness to satisfy debts and a history of not meeting financial obligations could disqualify any federal employee from receiving a security clearance, according to government guidelines. Peter Schweizer, the president of the Government Accountability Institute, said, “The question is also one of whether the loans are tied to actual assets such as buildings, etc., or was the political figure granted special favors in getting loans. Politicians and their families can engage in commercial transactions, the question is whether the loans are unusual and unique compared to others in the marketplace.” Trump is not the first president to contend with debt, either in office or later in life. Thomas Jefferson, whose peak net worth in current dollars reached $236.8 million, according to research by 24/7 Wall Street, died in debt. The debt was accrued during and after his presidency — as well as by relatives — and his family sold dozens of enslaved people from his Monticello estate to satisfy his liabilities. On the other hand, Barack Obama, in his second term, encouraged American homeowners to refinance their mortgages as rates dropped well below what he was paying, but he said he and his wife would hold off. “When you’re president, you have to be a little careful about these transactions, so we haven’t refinanced,” Obama explained at the time."}]}