{"article": [{"url": "https://www.marketwatch.com/story/if-stock-market-history-repeats-the-s-p-500-will-close-at-a-new-high-by-the-end-of-august-11597676415", "published": 1597747040.0, "headline": "Why the stock market will close at a record high by the end of August â\u0080\u0094 if history is a guide", "body": "Up and over? Valery Hache/Agence France-Presse/Getty Images The S&P 500 index has made several failed attempts since last week to take out its record close from February, causing some investors to worry the rally is running out of steam. History, on the other hand, suggests market bulls shouldnâ\u0080\u0099t be too quick to throw in the towel. The large-cap U.S. stock-market benchmark SPX, +0.87% last Wednesday closed less than 1% away from its all-time finish of 3,386.15 set on Feb. 19, after briefly trading above that level. It again flirted with a record on Thursday before a late pullback and ended Friday 0.4% away from the all-time closing high. On Monday, it traded as high as 3,387.59, according to FactSet, but then pulled back to end near 3,382. And in early trade Tuesday it took out the all-time intraday high of 3,393.52, also set on Feb. 19, before pulling back to change hands in recent action below 3,375. See: Why the S&P 500 is knocking on the door of its first record close in 6 months While the S&P 500â\u0080\u0099s failure to take out the record has prompted some analysts to worry that resistance near the all-time highs may be too tough to surmount after a bounce that has already seen the index rally more than 50% from its pandemic-induced March 23 low, Sam Stovall reviewed the market tape to see whether missing the high tends to spell doom for rallies. Read: The stock market hasnâ\u0080\u0099t seen a 100-day gain this strong since 1933 Stovall, chief investment strategist at CFRA, found that whenever the S&P 500 previously closed within 1% of a new high, that milestone was eclipsed within an average of just eight calendar days. The longest wait, he said in a Monday note, was 21 days following the bear market of 2000-2002, followed by a 20-day wait after the bear market of 2007-2009, while all others took eight days or fewer. â\u0080\u009cShould history repeat, and thereâ\u0080\u0099s no guarantee it will, the S&P 500 should set a new all-time high by the end of August,â\u0080\u009d he said. Then what? Stovall said that if the S&P 500 does hit a new high, â\u0080\u009cinvestors should be prepared for some profit-taking,â\u0080\u009d though the weakness that has usually followed past highs was usually not pronounced. The index declined between 5% and 14% after hitting previous highs, but the average selloff was 8% before equities resumed their advance, he noted. And Stovall isnâ\u0080\u0099t afraid stocks have come too far, too fast, despite the speed of the rebound off the March lows. Read: Stock-market bull, who called rally off March lows, now says S&P 500 overvalued by 5% to 10% CFRA Citing the table above, he noted that while what appears to be a current bull market is ahead of the initial 6-month returns for bull markets since 1932 and well above the average for all bull markets, six of those prevous bulls saw 12-month gains that exceeded the current bull marketâ\u0080\u0099s recovery pace."}]}