{"article": [{"url": "https://www.marketwatch.com/story/stock-index-futures-edge-lower-as-doubts-grow-over-prospects-for-coronavirus-aid-2020-08-13", "published": 1597338140.0, "headline": "S&P 500 ends lower in struggle to set record high as investors turn to tech stocks and stimulus talks flounder", "body": "Large-capitalization tech stocks on Thursday saw some buoyancy, but the broader market finished lower in listless trade as investors appeared hesitant to push equity benchmarks much further near records amid a stalemate over a fresh coronavirus aid package. A better-than-feared weekly report on joblessness in America provided a brief bump for the bulls but the reading, showing the lowest tally of those seeking unemployment benefits in the COVID-19 era, also highlighted the severity of the blow the labor market. What are major benchmarks doing? The Dow Jones Industrial Average DJIA, +0.56% fell 80.12 points, or 0.3%, to end at 27,896.72, while the S&P 500 SPX, +0.87% lost 6.92 points, or 0.2%, to close at 3,373.43, after hitting an intraday peak at 3,387.24 to momentarily breach its Feb. 19 closing record at 3,386.15. The Nasdaq Composite COMP, +1.39% rose 30.27 points, or 0.3%, higher to close at 11,042.50. The Dow on Wednesday rose 289.93 points, or 1.1%, to finish at 27,976.84, while the S&P advanced 46.66 points, or 1.4%, to close at 3,380.35. The Nasdaq Composite jumped 229.42 points, or 2.1%, finishing at 11,012.24.What’s driving the market? The S&P 500 failed to finish at a record high for a second straight day, as the benchmark flirted with that key level, following a report on initial claims for unemployment benefits. The closely followed government data series showed marked improvement in the most recent week, falling to 963,000. Economists surveyed by MarketWatch, on average, had forecast a higher number of seasonally adjusted initial claims for the week ended Aug. 8. That saw stock futures momentarily erase small losses to turn positive. But lingering questions about fiscal stimulus for an economy that is still reeling from the effects of the pandemic, held bullish investors in check. Market participants harbor concerns that many job losses accumulated in the COVID-19 era may be permanent and may turn into an deeper economic wounds because of the end of $600 in weekly unemployment benefits, which concluded at the end of last month, and could weigh on consumer spending for a longer period. San Francisco Federal Reserve Bank President Mary Daly on Wednesday, speaking during a virtual event organized by the Economic Club of Las Vegas, said additional relief to state and local governments would be important to prevent deeper cutbacks in services and layoffs of public workers. “It creates the potential for a hole, a little bit of a hole in consumer demand and consumer spending,” Daly said. Meanwhile, top Democrats and White House officials have failed to break a deadlock over another round of coronavirus aid, with each side blaming the other for a continued stalemate in place since negotiations aimed at extending a number of lapsed measures collapsed late last week. President Donald Trump over the weekend signed executive orders to partially extend some of those measures, but they face legal challenges and doubts over their effectiveness due to logistical constraints. “This is only one week in which many Americans are not been getting the boosted unemployment checks. We might not see the full ramifications after just one week” said Diane Jaffee, senior portfolio manager at TCW, who noted the surge in the savings rate as Americans have hunkered down over the past few months. “I’m modestly optimistic but I think we have to take this data with caution. That fiscal stimulus is super important.” Jaffee, herself a value investor, is carefully watching the market’s attempt to rotate toward value stocks. However, that rotation appears to have taken a bit of a pause in recent days as lack of fresh catalysts has emerged. “Clearly what’s holding investors from swarming to those stocks is real conviction that we’ve got a handle on the virus,” she said in an interview. “We had one of the longest economic recoveries in a generation but investors never really believed in it. Investors were always looking backward at the Great Financial Crisis and were just much more comfortable with growth. Value didn’t get much love. Once we have effective treatments, we have all this liquidity that will rush in.” The stock market broadly has been underpinned by economic data that remains relatively upbeat, despite a persistently high number of new coronavirus cases in the U.S. The global tally of confirmed cases of COVID-19 climbed to 20.6 million on Thursday, with the death toll rising to 749,656, according to data aggregated by Johns Hopkins University. At least 12.8 million people are confirmed to have recovered. The U.S. has 5.19 million cases, and COVID-19-related deaths stand at 166,027. “The equity market, in the U.S. and elsewhere is taking comfort from the fact that economic data show resilience to spikes in virus infections. This has been true for the U.S. economy for a while, and we can see it in Asia too,” said Kit Juckes, global macro strategist at Société Générale, in a note. And while the number of U.S. cases has remained high, investors appeared to focus instead on a slowdown in the number of new infections. Over the past week, there have been an average of 53,723 cases per day in the U.S., a decrease of 17% from the average two weeks earlier, according to a New York Times tracker. In separate economic news, import prices rose for the third straight month, marking the biggest three-month jump since 2011—though prices are still lower for the year. Which companies are in focus? Shares of Lyft Inc. LYFT, +2.16% slid 5.4%.The ride-sharing company late Wednesday said riders and revenue fell by more than half during a pandemic-dominated second quarter, but layoffs helped it top expectations for losses. Also:Uber and Lyft say they may shut down in California if forced to classify drivers as employees 3M Co. MMM, +0.94% shares rose 1% after the maker of personal safety, industrial and consumer products reported “broad-based improvement” in sales trends last month. Shares of network-equipment maker Cisco Systems Inc. CSCO, +0.15% were down 11.2% after it reported a revenue decline and soft earnings guidance for the current quarter Wednesday afternoon, then announced that its chief financial officer was stepping down. Tapestry Inc. TPR, +0.80% shares fell 1.1% after the parent company of Kate Spade and Coach reported sales figures that beat analyst expectations and posted a narrower-than-expected loss. Shares of Novavax Inc. NVAX, +0.18% jumped 7.1%, after the biotechnology company said it had entered into a development and supply agreement with a South Korea-based bioscience concern for the antigen component of Novavax’s COVID-19 vaccine candidate. FAT Brands Inc., FAT, +0.97% the parent company of Fatburger, more than doubled after the company said it would acquire the Johnny Rockets chain of restaurants. SmileDirectClub Inc. SDC, -2.59% shares slid nearly 16% after the company reported second-quarter sales above Wall Street expectations but GAAP earnings that came in below Wall Street expectations. How did other markets trade? In Asia overnight, China’s CSI 300 index 000300, +2.04% closed 0.3% lower, while Hong Kong’s Hang Seng Index HSI, -0.30%, moved fractionally lower and Japan’s Nikkei 225 NIK, -0.11% shot up 1.8%. In Europe, the Stoxx 600 Europe Index SXXP, +0.55% closed 0.6% lower and the FTSE 100 UKX, +0.64% slumped 1.5% on Thursday. The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% rose 3.1 basis points to 0.714%, touching its highest yield since June 17, after the jobless claims report was released. Bond prices move inversely to yields. Gold prices GC00, +2.17% reversed early losses, climbed $21.40, or 1.1%, to settle at $1,970.40 an ounce. Crude-oil prices US:CLU20 lost 43 cents, or 1%, to settle at $42.24 a barrel, one day after logging highest close for a front-month contract since March 5. Crude retreated briefly after the International Energy Agency cut its forecast for demand. The greenback continued its slide, with the ICE U.S. Dollar Index, DXY, -0.58% a gauge of the buck against a half-dozen major rivals, down 0.3% to 93.18. Read next: Don’t assume this stock-market value rotation will stick, J.P. Morgan says"}]}