{"article": [{"url": "https://www.marketwatch.com/story/feds-kaplan-says-economy-wont-get-back-on-track-until-late-2022-2020-09-29", "published": 1601374100.0, "headline": "Fedâ\u0080\u0099s Kaplan says economy wonâ\u0080\u0099t get back on track until late 2022", "body": "The U.S. economy wonâ\u0080\u0099t be back on track until late 2022 or sometime in 2023, said Dallas Fed President Rob Kaplan on Tuesday. In an essay on the outlook for the economy and Fed policy, Kaplan said he thinks the current level of the Fedâ\u0080\u0099s policy interest rate between zero and 0.25% will be appropriate until the economy has weathered the pandemic and is on track to achieve the central bankâ\u0080\u0099s goals of full employment and price stability. â\u0080\u009cMy best judgement is that it will take at least until late 2022 or sometime in 2023 for these criteria to be met,â\u0080\u009d Kaplan said. It is at this point that Kaplan would take a different path than his colleagues. At its meeting earlier in September, the Fed promised to keep interest rates at zero until inflation is on track to â\u0080\u009cmoderately exceedâ\u0080\u009d the central bankâ\u0080\u0099s 2% target â\u0080\u009cfor some time.â\u0080\u009d Kaplan dissented from this statement. He said that there is a difference between the Fed keeping policy easy and keeping rates at zero. He said he wanted to give future committees flexibility to lift-off of zero while remaining â\u0080\u009caccommodative.â\u0080\u009d If the economy improves and the Fed keeps rates at zero, this means that Fed policy will actually become more accommodative, he said. â\u0080\u009cI can understand why future Fed officials will want to remain accommodative at the point in order to ensure we achieve our goals, but will they want to be effectively increasing the level of accommodation by keeping the federal funds rate at zero?â\u0080\u009d he asked. â\u0080\u009cI would like future committees to have the flexibility to make this judgment,â\u0080\u009d he said. Kaplan said he believed there are â\u0080\u009creal costsâ\u0080\u009d for keeping rates at zero for a prolonged period of time. â\u0080\u009cKeeping rates at zero can adversely impact savers, encourage excessive risk taking and create distortions in financial markets,â\u0080\u009d he said. He noted that some of the seizing up of financial markets in March may have been due, in part, â\u0080\u009cto some amount of forced selling by over-risked market participants,â\u0080\u009d the Dallas Fed president said. Kaplan said his research team expects the economy to grow at about a 30% annualized rate in the third quarter, rebounding sharply from the roughly 32% decline in the April-June quarter. For the year, the economy will show a contraction of about 3%, he said, with the unemployment rate falling further to 7.5% at year end, from 8.4% in August. The Dallas Fed expects the economy will grow by roughly 3.5% in 2021 and the jobless rate will decline to about 5.7%. Inflation will remain below the Fedâ\u0080\u0099s 2% target. These forecasts are highly uncertain because they depend on the path of the coronavirus pandemic and continued fiscal support from Congress. â\u0080\u009cA key risk we are watching carefully is the potential waning of unemployment benefits and other forms of fiscal relief, which could cause more typical recessionary dynamics to emerge,â\u0080\u009d Kaplan said. U.S. Stocks opened mixed on Tuesday with the Dow Jones Industrial Average DJIA, +0.56% Â slipping by 38 points."}]}