{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-add-to-slide-on-track-for-longest-downtrend-in-5-months-2020-09-24", "published": 1600956740.0, "headline": "Gold prices post a gain for the first time in 4 sessions", "body": "Gold futures ended higher on Thursday to tally their first gain in four sessions, as a recent price drop to a two-month low raised the precious metal’s appeal among bargain hunters. Prices for the metal had been trading lower early in the session, and remains more than 4% lower for the week, with overall strength in the dollar contributing mightily to the deterioration in bullion. Chintan Karnani, chief market analyst at Insignia Consultants, attributed the shift higher in prices to “a short covering rally” given the “oversold conditions.” He added that “pre-U.S. presidential jitters” will ensure that weakness in gold will not last long. Read:Trump says Supreme Court will need 9th justice to decide election outcome December gold GCZ20, +2.17% GC00, +2.17% rose by $8.50, or nearly 0.5%, to settle at $1,876.90 an ounce. Prices based on the most-active contract logged a third straight session decline on Wednesday and settled at their lowest since late July. The dollar weakened a bit in Thursday dealings, though was poised for a weekly rise of 1.5%, which would mark its strongest weekly climb against a basket of a half-dozen currencies, as measured by the ICE U.S. Dollar Index DXY, -0.58%, since the period ended April 3, according to FactSet data. Strength in the dollar tends to pressure prices for dollar-denominated commodities, such as gold. Investors turned to the U.S. dollar amid rising concerns about the global economic outlook and increased cases of COVID-19. Read:A rebounding U.S. dollar is crushing gold–how far can it rise? Meanwhile, December silver SIZ20, +5.96% SI00, +5.96% gave up earlier losses to finish higher, up 9 cents, or 0.4%, to end at $23.196 an ounce. Its 5.8% tumble in the previous session marked its lowest levels since late July, according to FactSet data. “Silver has a tendency to take a very long time to rise whenever there is big crash,” said Karnani. For now, there’s “cautious optimism in silver.” Gold and silver had been trading lower as a weekly reading of those seeking unemployment benefits, used as a running gauge of the health of the economy amid the viral pandemic, came in somewhat weaker than expected. Weekly jobless claims rose 4,000 to 870,000, the Labor Department said Thursday. Economists surveyed by MarketWatch had been looking for claims to decline to 850,000, reflecting that slightly more Americans applied for state unemployment benefits in the week ended Sept. 19 than in the prior week. Claims in the prior week were raised by 6,000 to 866,000. During Thursday’s session, gold saw a “rapid turnaround...in tandem with U.S. equity markets,” Jeff Wright, executive vice president of GoldMining Inc., told MarketWatch. “The broader market has become too complacent so interest in gold should naturally rise.” He emphasized that there wasn’t one catalyst for gold to rise, but rather a “combination of factors leading to buying,” including the oversold conditions. Other metals traded on Comex finished lower, though off the session’s lows. with December palladium PAZ20, +2.31% down 1.4% at $2,226.90 an ounce and October platinum PLV20, +3.99% losing 0.6% to $838 an ounce. December copper HGZ20, +1.38% shed 0.8% to $2.968 a pound."}]}