{"article": [{"url": "https://www.marketwatch.com/story/fed-puts-18-trillion-us-government-bond-market-under-lockdown-2020-07-28", "published": 1596009380.0, "headline": "Fed puts $18 trillion U.S. government bond market under lockdown", "body": "Even for a market known to fall asleep over the summer, trading in Treasurys has gone quiet as the Federal Reserve asserts its intent to keep interest rates at zero for a long time. The potential for interest rates to move anytime soon looks increasingly diminished as analysts warn it may take several years for economic activity to mount a full recovery to pre-coronavirus levels. That has discouraged speculation in the world’s biggest bond market, with more traders complaining that the chance to make profits on swings in government bond yields have waned. “’Don’t fight the Fed’ is a mantra for a reason,” said Atul Bhatia, a portfolio strategist at RBC Wealth Management, in an interview. Since March, the 10-year Treasury yield has been trapped in a tight range between 0.90% and 0.60%. In recent days, the benchmark yield has occasionally ventured below this floor, but has shown few signs of escaping this range. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% finished at 0.581% on Tuesday, its lowest since April and around 8 basis points off its all-time low of 0.501% plumbed in mid-March. Bond prices move inversely to yields. “With Treasury yields at or near record lows, there is less incentive to be involved in the market, and rates will likely remain trapped at low levels for some time,” said John Canavan, an analyst at Oxford Economics. The ICE BofA MOVE Index, which tracks implied expectations of Treasury volatility over the next 30 days based on prices of options, fell to a record low of 42.48 last Friday. Canavan also noted the average trading volume in Treasury futures has collapsed to its most diminished levels since the start of 2016, according to the chart below. Treasury futures serve as pledges to buy the actual government bonds at a future date, but have instead developed into a more liquid alternative to the bonds themselves and have thus become preferred by traders who need to buy and sell in a hurry. Canavan said the unusually subdued trading in Treasury futures was also a feature back in 2008, when the Fed cut rates to rock-bottom. It was not until 2016 that trading volumes recovered. Read: Fed won’t be happy with how the economy is performing, but is not perturbed enough for aggressive action Even if the Fed doesn’t hike rates, the central bank is expected to make big changes to its monetary policy strategy in the coming months. Market participants eye an increased chance of the U.S. central bank choosing to cap yields for targeted bond maturities, or yield-curve control, at the end of this year. The move, however, is unlikely to come at this week’s meeting. Yet even the prospect of such an unprecedented policy decision has failed to inspire trading. “Yields are barely budging. We’re under an informal yield-curve control regime already,” Nick Maroutsos, head of global bonds at Janus Henderson, told MarketWatch. In other markets, the S&P 500 SPX, +0.87% and Dow Jones Industrial Average DJIA, +0.56% finished lower on Tuesday. Meanwhile, the greenback held steady against its major rivals, based on trading in the ICE U.S. Dollar index DXY, -0.58% ."}]}