{"article": [{"url": "https://www.marketwatch.com/story/this-overlooked-covid-19-investment-theme-is-one-of-the-best-buying-opportunities-i-have-ever-seen-2020-07-08", "published": 1594471220.0, "headline": "This hidden COVID-19 investment theme is â\u0080\u0098one of the best buying opportunities I have ever seenâ\u0080\u0099", "body": "In the hunt for COVID-19 plays, investors have fallen head over heels for â\u0080\u009cwork-at-homeâ\u0080\u009d stocks and companies in vaccines and therapies. This makes sense. But smart investors are looking beyond the classic virus beneficiaries to snap up an unusual lot of COVID-19 stocks â\u0080\u0094 insurers KIE, -0.16% Â . Unlike favored virus stocks like Zoom Video ZM, +2.89%, Teladoc Health TDOC, -1.52%, Novavax NVAX, +0.18% Â and Moderna MRNA, +0.09%, insurers wonâ\u0080\u0099t directly benefit from the virus. Quite the opposite. It looks like they are going to get hit hard by business interruption claims, meddling politicians who want to â\u0080\u009csocializeâ\u0080\u009d virus-related losses, and a prolonged slowdown that could cripple demand. But hereâ\u0080\u0099s the catch: Investors are overly worried about these concerns. These false fears have driven insurers down to really attractive levels. While Nasdaq Composite COMP, +1.39% Â hits new highs and the S&P 500 SPX, +0.87% and Dow Jones Industrial Average DJIA, +0.56% Â get closer to their own records, many insurers are down 30% or more year to date. Insurers typically trade at around 1.2 times book value, but theyâ\u0080\u0099ve been knocked down to the 0.8 range. The relative performance of Berkshire Hathaway BRK.A, +0.06% Â BRK.B, +0.24% to the S&P 500 is around a 19-year low. Despite this terrible performance, underlying industry trends that many investors donâ\u0080\u0099t recognize are about to drive outsized profits at insurers for years. â\u0080\u009cThis is one of the best buying opportunities I have ever seen, and I have been covering the group since 1998,â\u0080\u009d says Greg Locraft, an equity analyst for T. Rowe Price. â\u0080\u009cDonâ\u0080\u0099t worry too much about the individual names. Just get money on the table.â\u0080\u009d Weâ\u0080\u0099ll get to six names in a second. But first letâ\u0080\u0099s look at the three main reasons why insurers look very really here. 1. Insiders are buying big time One of the key themes I look for at my stock newsletter Brush Up on Stocks is broad, sector-wide buying by corporate insiders. Thatâ\u0080\u0099s clearly the case with insurers. Thereâ\u0080\u0099s been very large (in many cases $1 million worth or more per company) insider buying at about a dozen insurance companies in the past several weeks. Itâ\u0080\u0099s happening across the space, from life insurance and annuity companies to workersâ\u0080\u0099 compensation, home mortgage and auto insurance companies. The biggest buying has been happening at property and casualty insurers and insurance brokers. Theyâ\u0080\u0099re the ones that will benefit most by the favorable COVID-19-related trends. So we will focus on those as suggested stocks to consider. 2. The insurance market is turning in favor of the insurers Insurance company investing calls for a twisted logic: Bad is good. And it looks like things are getting really bad (good) right now. Hereâ\u0080\u0099s why. On top of all the weird storms and wildfires this year, insurers are going to get hit with large COVID-19 related claims. All these claims will cost them money â\u0080\u0094 or capital. In this business, capital is capacity because to write insurance you need money on hand to back potential claims. Whenever capacity declines in an industry, this creates shortages that drive up prices. Those higher prices will be great for insurers and their investors in the coming years. â\u0080\u009cThe best time to invest in insurers is when they get hit with a lot of losses,â\u0080\u009d says Ania Aldrich, an analyst for the Cambiar Opportunity Fund CAMOX, +0.72%. Like now. Big losses also drive out irrational underwriters and discourage new entrants which also curtails supply, points out Chris Davis, who co-manages the Davis Financial Fund RPFGX, -0.05% Meanwhile, all the uncertainty around COVID-19 and the weak economy makes managers and people in general more insecure. So they want more insurance. â\u0080\u009cPeople value insurance after they feel a loss,â\u0080\u009d says T. Rowe Priceâ\u0080\u0099s Locraft. â\u0080\u009cThey are going to buy more insurance, and pay more for it.â\u0080\u009d All of this creates favorable pricing trends for insurers, a dynamic known in the industry as a â\u0080\u009chardâ\u0080\u009d market.â\u0080\u009d â\u0080\u009cYou have classic hard market emerging in property and casualty insurance, and it is the first hard market since 2001,â\u0080\u009d says Locraft. â\u0080\u009cThat is why insurance insiders are buying. They know it. They see it. And theyâ\u0080\u0099re buying it.â\u0080\u009d Insiders who were recently buying confirm this. â\u0080\u009cWe expect that market pricing will continue to remain strong, to allow the industry to absorb the higher losses that are expected to emerge from this pandemic,â\u0080\u009d Axis Capital Holdings AXS, +0.60% CEO Albert Benchimol said in his companyâ\u0080\u0099s most recent earnings call. 3. Investors are worried about false issues First, concerns are high that a wave of lawsuits will force insurers to pay companies for COVID-19 downtime. But this is unlikely. Most business interruption policies include exemptions for pandemics, viruses and bacteria. Payouts also require actual physical damage to property. One way around this might be to claim that COVID-19 caused â\u0080\u009cdamageâ\u0080\u009d by being present on the surfaces of restaurant tables, office desks and factory equipment. But this probably wonâ\u0080\u0099t work. â\u0080\u009cHow do you put COVID in the building when it was shut, and the virus dies in 48 hours? I donâ\u0080\u0099t know,â\u0080\u009d says Greg. â\u0080\u009cIf it breaks bad, it will be really bad. But my view is they are fine.â\u0080\u009d For the second false fear, investors worry thereâ\u0080\u0099s a risk that state politicians will pass laws forcing insurers to pay out for virus-related business downtime, even though policies obviate this. This also seems like it will go nowhere. Indeed, politicians in several states are already backing off. â\u0080\u009cThe politicians will figure out this would be very unprecedented, and they will destabilize the sector if they force insurers to pay for these damages,â\u0080\u009d says Aldrich at Cambiar Investors. Hereâ\u0080\u0099s how Benchimol at Axis puts it: If states crippled the industry with forced payouts, who will cover damages from the next big hurricane to hit Miami? No one, unless the insurance industry itself gets bailed out, which would sort of defeat the purpose of making them pay. Finally, investors are worried about prolonged weak demand for insurance and sustained low returns on investments at insurance companies, given low bond yields, because of an extended sluggish economy. But if like me, you believe that the huge dollops of stimulus will make the economy rebound nicely, then interest rates and business demand for insurance will follow suit. â\u0080\u009cThe yield curve is steepening and the economy is getting better. And inflationary pressures may build which would make interest rates go higher,â\u0080\u009d says Todd Lowenstein, an equity strategist at The Private Bank division of Union Bank.Favored insurance companies To profit from the bullish insurance sector trends shaping up, consider the following names. Many of them pay decent dividend yields which look secure. In property and casualty, insiders have recently been big buyers at Axis Capital, Selective Insurance Group Â SIGI, +0.28% Â and State Auto Financial STFC, +1.25%. Also consider â\u0080\u009ccreativeâ\u0080\u009d underwriters like Markel MKL, -1.25% Â and Chubb CB, -0.68%, which are good at coming up with customized specialty lines of insurance for things like classic cars, horse stables and summer camps, says Davis. Finally, insurance brokers and consultants thrive in a â\u0080\u009chardâ\u0080\u009d market where prices and insurance demand go up â\u0080\u0094 like right now. These are fee-based businesses with a decent amount of recurring revenue. Here Davis likes AON AON, +0.53%, and insiders do, too. At the time of publication, Michael Brush had no positions in any stocks mentioned in this column. Brush has suggested AXS, SIGI, STFC and AON in his stock newsletter Brush Up on Stocks. Brush is a Manhattan-based financial writer who has covered business for the New York Times and The Economist Group, and he attended Columbia Business School. Follow Brush on Twitter @mbrushstocks."}]}