{"article": [{"url": "https://www.marketwatch.com/story/as-the-stock-market-soars-and-the-nasdaq-breaks-records-trump-warns-that-your-401k-could-disintegrate-2020-07-06", "published": 1594039520.0, "headline": "President Trump warns that your 401(k) could â\u0080\u0098disintegrate and disappearâ\u0080\u0099 if he loses the 2020 election", "body": "How is your 401(k) doing? With tech stocks leading the advance, the Nasdaq Composite COMP, +1.39% just broke into uncharted territory. Tesla TSLA, +1.89% took out a fresh high. So did Netflix NFLX, +1.43%. And Amazon AMZN, +3.01% reached $3,000 for the first time ever. Whatever the current status of your retirement account â\u0080\u0094 if you actually have one â\u0080\u0094 President Trump, in a tweet on Monday, warned that any gains you might be enjoying could â\u0080\u009cdisintegrate and disappearâ\u0080\u009d in a hurry if he doesnâ\u0080\u0099t win another four years in the White House: iframe.twitter-tweet { width: 100% !important; } Is that true? Should investors be scared into voting for Trump? Not according to strategists at JPMorgan Chase & Co. JPM, -0.57% who say that a win for former Vice President and presumptive Democratic nominee Joe Biden, currently ahead of Trump in recent national polls, would be a â\u0080\u009cneutral to slight positiveâ\u0080\u009d for stocks. â\u0080\u009cGiven the current economic weakness, business recovery and job growth are likely to be prioritized over policies that could dampen economic growth and perhaps even jeopardize the desired 2022 midterm election outcome,â\u0080\u009d the team said in the note. â\u0080\u009cFurther, a more diplomatic approach to domestic/foreign policy will likely result in lower equity volatility and risk premia.â\u0080\u009d Either way, it didnâ\u0080\u0099t take long for â\u0080\u009cMy 401(k)â\u0080\u009d to climb Twitterâ\u0080\u0099s list of trending topics, where the general sense is that voters have more on their minds than the size of the retirement savings: iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Then there were the inevitable comparisons: iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } In summary: iframe.twitter-tweet { width: 100% !important; } â\u0080\u0094"}]}