{"article": [{"url": "https://www.marketwatch.com/story/calculating-americas-eviction-crisis-up-to-40-million-people-are-at-risk-of-being-kicked-out-of-their-homes-2020-08-07", "published": 1597066040.0, "headline": "Calculating America's eviction crisis: Up to 40 million people are at risk of being kicked out of their homes", "body": "As President Donald Trump calls for another federal eviction moratorium, a new report has shed light on just how many Americans are facing housing insecurity as a result of the coronavirus pandemic and the associated economic downturn. Between 30 and 40 million people in the U.S. could be at risk of eviction in the next several months, according to a report released Friday by a group of housing researchers. The report aggregated existing research related to the housing crisis caused by COVID-19. The researchers said the current situation could be \"the most severe housing crisis\" in the nation's history. As the novel coronavirus first began spreading across the country and prompting business shutdowns, many state and local lawmakers took swift action to enact eviction moratoriums to protect people who suddenly found themselves without a source of income to pay their bills. Many renters were already in a precarious position before the pandemic: Research from the Joint Center for Housing Studies of Harvard University found that nearly half of all renter households were cost-burdened before the pandemic, meaning over a third of their income went toward rent. Read more:Landlords must notify tenants about eviction proceedings in multi-family buildings, housing regulator says At the federal level, the CARES Act placed a temporary moratorium on evictions for renters living in buildings supported by federal funding. But that moratorium expired at the end of July, and many of the moratoriums at the state and local level have also ceased. \"The vast majority of states lack protective eviction moratoriums and housing stabilization measures that could support renters facing rent hardship,\" researchers wrote, citing work done by the Eviction Lab at Princeton University and health and housing law expert Emily Benfer. “ 'The housing market embodies the inequality that was magnified and exacerbated by COVID-19.' ” - Diane Swonk, chief economist at accounting firm Grant Thornton Previously, research showed that people of color are disproportionately at more risk of being evicted currently. More than one-quarter of Black renters nationwide missed last month's rental payment, U.S. Census Bureau survey data show. And nearly one in six Black renters said they have no confidence that they will be able to pay the following month's rent. And even as the economy has recovered jobs lost because of the pandemic, America's renters are struggling to make their monthly payments. Roughly a third of all renters nationwide failed to make a full housing payment as of the first week of August, according to survey data from real-estate website Apartment List. The tenuous situation facing renters is in sharp contrast with the current state of affairs for homeowners and home buyers. \"The housing market embodies the inequality that was magnified and exacerbated by COVID-19,\" Diane Swonk, chief economist at accounting firm Grant Thornton, wrote on Twitter TWTR, -0.23%. \"My stomach churns every time I think of what the evictions will mean for homelessness, which was rising when we were at 3.5% unemployment.\" Mortgage rates have fallen to record lows eight times amid the pandemic. As a result, thousands of homeowners have refinanced their home loans in recent months, and many prospective home buyers have flooded the market looking to scoop up properties to lock in low rates. Also see: Americans' household debt fell for the first time since 2014 - but that doesn't mean people are paying off their loans Most homeowners who are facing financial trouble still have lifelines available to them. The CARES Act stipulated that any homeowner with a federally-backed mortgage could receive forbearance for up to one year. During that time, homeowners can make reduced monthly payments or skip paying altogether. Once forbearance ends, homeowners who are still in financial trouble will have a wide array of loss mitigation options available to them to adjust their mortgages in order to avoid default or foreclosure. Additionally, the Federal Housing Finance Agency, which regulates Fannie Mae FNMA, +0.73%  and Freddie Mac FMCC, +0.52%  , and the Federal Housing Administration have both extended foreclosure and eviction moratoriums through the end of August at least."}]}