{"article": [{"url": "https://www.marketwatch.com/story/from-lockdowns-to-brexit-the-uk-economy-is-heading-toward-a-rough-winter-2020-09-22", "published": 1600781240.0, "headline": "From lockdowns to Brexit, the U.K. economy is heading toward a rough winter", "body": "U.K. Prime Minister Boris Johnson announced on Tuesday new restrictions to help control the aggressive rise of coronavirus infections, as Bank of England governor Andrew Bailey warned that “the hard yards are ahead” for the economy. - Johnson told Parliament that all restaurants, bars and pubs will have to close at 10 p.m. and restrict themselves to table service, while staff will have to wear protective masks. Indoor team sports are banned, and wedding parties limited in size. The measures will be in place for “perhaps six months,” Johnson said. In a U-turn from his own previous recommendations, he also urged the public to work from home to the extent possible. - Bailey said during a webinar for the British Chamber of Commerce that the economy would remain scarred for months by the impact of the coronavirus pandemic, and that the labor market would remain weak for some time. The Bank of England governor, however, said that the central bank wasn’t ready yet to take its key interest rate below zero, as the European Central Bank has done in the last six years, but just studying the option to explore what its practical consequences would be. - A study by London School of Economics professor Thomas Sampson recently found that the economic cost of the country leaving the European Union without a comprehensive trade deal would be two or three times bigger, over the long term, than the coronavirus crisis’ impact. Alluding to the stalled negotiations between the U.K. and the EU on a trade deal, Germany’s Europe minister Michael Roth on Tuesday asked London to “stop the games” as “time is running out.” Read more:Boris Johnson imposes stricter restrictions on U.K. for ‘perhaps six months’ The outlook: The government tried to strike a balance that is difficult to achieve, between economic and health considerations. An alarming briefing by the governments’ top two scientific advisers on Monday had revealed that the number of daily infections might have reached 50,000 in a few weeks if nothing was done by then. The new restrictions will have an adverse impact on the economy and hit the hospitality sector yet again. But they would have been even more severe if Chancellor Rishi Sunak hadn’t lobbied Johnson, arguing about the need to limit, if not avoid, the economic cost of new measures. The U.K. economy’s gloomy prospects now mean that fiscal stimulus and monetary loosening are likely to continue for months. Opinion: Global banks hit by new corruption allegations. Why authorities are unlikely to act this time"}]}