{"article": [{"url": "https://www.marketwatch.com/story/an-experts-guide-to-road-tripping-with-your-dog-2020-09-02", "published": 1599023540.0, "headline": "An expertâ\u0080\u0099s guide to road-tripping with your dog", "body": "Even in the heart of a COVID-19 pandemicâ\u0080¦make thatÂ especiallyÂ in the heart of a COVID-19 pandemic, the summer road trip is a traditional taste of freedom thatâ\u0080\u0099s been celebrated since the automobile was invented. Inviting your dog to join you on these highway adventures makes you a much better person (just ask your pup). Keep in mind, however, that itâ\u0080\u0099s going to take a little bit of planning. Nothing major, just some smart forethought and consideration for your 4-legged traveling companion.The â\u0080\u009cwell, duh!â\u0080\u009d basics If youâ\u0080\u0099re reading this story on your phone as your road-trip vehicle idles in the driveway, your dog in the seat next to you and youâ\u0080\u0099re waiting for the Sherpas to finish packing the car, stop. Youâ\u0080\u0099ll still have a great road trip, but you should have started thinking through this journey with the dog a few weeks earlier. Thatâ\u0080\u0099s when you would have gathered your poochâ\u0080\u0099s essential traveling tools like vaccination records, medicines, and a current dog tag with your mobile number on it. Of course, your dog has an ID microchip implanted because you love him/her, right? OK, be sure that the chip number is loaded into your smartphone. Also see: Some pet owners are spending more than $2,000 a year on their dogs A pre-trip trip to the vet isnâ\u0080\u0099t a bad idea either just to make sure everything is in order. And vet runs are always good practice for how well a dog travels.The right set of wheels Another important pre-road trip consideration is which vehicle to take. If youâ\u0080\u0099re a one-car family, of course, thatâ\u0080\u0099s academic. But if you have a choice, choose the SUV that has AC vents in back (your dog will worship you if you can get cooling air to the rear seats where most road trip dogs travel). Summer heat is unforgiving, especially to canines. Learn more: Keep your dog safe when you travelâ\u0080\u0094here are some pointers Although SUVs work best for road trips with dogs â\u0080\u0094 lots of extra gear comes along â\u0080\u0094 cars will work just fine, too, and you wonâ\u0080\u0099t get any complaints out of Muttley either way. The important thing is to try to keep the second row â\u0080\u0094 aka, the back seat â\u0080\u0094 clear of luggage and gear so that your dog can take ownership of the space and feel secure in it. Leather seating cleans easier, but if youâ\u0080\u0099re a big-dog owner, make sure you protect the rear seat from scratching nails with aÂ pet hammock seat coverÂ designed to keep your dog safe and protect the seat from natural pet behavior. Itâ\u0080\u0099ll also make cleaning up after the trip â\u0080\u0094 dogs are dogs and they never learn to clean up their rooms, after all â\u0080\u0094 infinitely easier. Other essentials to prep before you go are a no-spill water dish, treats (of course), toys (of course, of course), and a few items from home that carry your scent to comfort him, like a favorite blanket or even your pupâ\u0080\u0099s bed. Donâ\u0080\u0099t forget to pack food (pack about 15%t extra for travel) and food bowls. If you plan on camping or hiking, a first aid kit designed specifically for dogs is a good addition to your list. All you have to do now is get your dogâ\u0080\u0099s Instagram account set up and youâ\u0080\u0099re ready to travel.And now, to the road When it comes right down to it, there are only two rules to traveling with a dog: 1. Iâ\u0080\u0099m thirsty. 2. I have to pee. These sweetly ironic rules should come as no surprise. Water helps dogs function, flush toxins, regulate body temperature, and keep noses wet for optimal sniffinâ\u0080\u0099. And it keeps them peeing throughout the day. When youâ\u0080\u0099re on the road with a canine companion, always keep those two facts in mind as priorities. Pee stops are a good chance to get a little exercise, too, for both the dog and the driver. Speaking of exercise, no matter where you are on the journey, donâ\u0080\u0099t hesitate to ask your smartphone for the location of the nearest dog park (every city and town has at least one) or if youâ\u0080\u0099re doing a coastal trip, a dog beach. Both of these places are great shared communities where the natural practice is to stay at least 6 feet apart without seeming unfriendly. Thatâ\u0080\u0099s true all across America, from the Union Square Dog Run in Manhattan to the Cayucos Dog Beach along Californiaâ\u0080\u0099s Highway 1. Plus, a worked out, sleeping dog travels best.Where to stay, where to eat Camping with dogs is a special kind of blast. These days, however, motels (and many hotels) seem to be getting more dog-friendly than ever. Itâ\u0080\u0099s easy to find a place where your tail-wagger can bunk with you free or for a very small fee. Many restaurants, too, especially now that coronavirus has forced so many dining establishments to expand their outdoor seating, are happy to accommodate with a big smile, a full menu and a fresh bowl of water for Fido. Report card: Which hotel brands have adapted best to COVID-19? A road trip seen through eyes of a dog keeps car travel fresh. It may not always be super simple, but it is always rewarding and guaranteed to bring you and your companions, human and nonhuman, closer together. Treat every meal, motel stay and pee stop as a teaching and learning moment â\u0080\u0094 a chance to refine your pupâ\u0080\u0099s already stellar behavior. So relax and go have fun. If you and your dog have found a rhythm together at home, youâ\u0080\u0099ll absolutely find one on the road. This story originally ran on Autotrader.com."}]}