{"article": [{"url": "https://www.marketwatch.com/story/these-early-retirees-investments-survived-the-great-recession-911-and-the-dot-com-boom-heres-how-the-covid-crisis-is-affecting-them-2020-05-26", "published": 1592926100.0, "headline": "Can my investments survive a crisis if I retire early? It did for these FIRE pioneers living in Mexico", "body": "Nearly 30 years ago, Billy and Akaisha Kaderli decided they wanted to retire at 38 — in that time, they have experienced cities around the world and their money has survived numerous financial crises. Yet, they’re still doing better financially than when they started their journey, they said. It was 1991, and the Kaderlis, who were living in Santa Cruz, Calif., had owned a restaurant for 10 years. Billy was a trained French chef working seven days a week for breakfast, lunch and dinner, at the restaurant, while Akaisha managed the business. Years into running the restaurant, Billy left to work at a brokerage firm, where he continued to work nights, weekends and holidays in his new job. Akaisha continued to manage the restaurant. “We finally asked, how much is too much?” Akaisha said. “Billy came to me with the idea of selling everything and traveling the world.” This was well before the term FIRE, or “Financial Independence, Retire Early,” became common. The FIRE movement’s followers strive to leave the workforce well before traditional retirement age, or at least curtail their reliance on a paycheck. The couple, who blog at Retire Early Lifestyle, invested 100% of their assets in the S&P 500 SPX, +0.87% and let the market work for them. “Thirty years later and we have a higher net-worth today than back then, and that’s after inflation and spending,” he said. It’s been quite an adventure, including the one time Akaisha almost lost her finger in Guatemala during the country’s independence day celebrations. A doctor opened up his practice to take care of her, and even with travel to the city, 11 visits with a surgeon, anesthesia and everything else, the total out-of-pocket cost was less than $3,000. As pioneers in financial independence they didn’t have the thousands of blogs about how to save and invest to accomplish these goals. In fact, during the early days they got their news — and tacos — from a nearby American Legion post. See:How to start on your financial independence journey How bad is it if I withdraw from my 401(k) during the pandemic? Billy and Akaisha spoke with MarketWatch about what early retirement was like before FIRE, how they have managed, and what their experiences have been like during the COVID-19 crisis. The interview was lightly edited for clarity and length. MarketWatch: Did you have any models or inspirations when you were preparing for this change? Billy: I had a magazine of a couple that lived in a sailboat with a child and that was always an inspiration for me, as well as some friends. MW: How many countries have you seen? Any favorites — and why? Billy: Our favorite place is where we are now: Chapala, Mexico. It is the largest lake in Mexico. Akaisha: We don’t really keep track or have a bucket list. We have always done a lot of travel. It was a passion of ours to see Central and South America, Europe, all through Asia. We have traveled the U.S. and Canada. We went to Bali and Vietnam. Billy: We spent years in Chiang Mai, Thailand. Asia is a great example — it is so different than the U.S., and Mexico also has a different culture. We enjoy immersing ourselves in those cultures. MW: From a retirement perspective, how do all of these countries differ from the U.S.? In positive or negative ways. Billy: From a retirement viewpoint, Mexico is on sale. The cost of living is favorable to the U.S. dollar. The big question is health care. Everyone wants to know. The [doctors there] know just as much as the guys up north. If I want to see a cardiologist, I just go walk to his office in the morning. It’s not like a referral. If he’s in, he’ll see me. If not, tomorrow. We have Medicare as a backup if we happen to be in the U.S. Akaisha: We pay for mostly everything out of pocket. It’s affordable. We did that in Thailand as well. MW: It wasn’t called FIRE when you did it, but how has the concept or execution of early retirement changed over the years? Do you think it’s more common? Easier or harder to accomplish? Billy: The investing side of the equation is easier than when we retired back in 1991. The internet hadn’t been widely used yet, so there was no online banking. There were ATMs but they were scattered. Akaisha: Also no email, no WhatsApp, no Skype. We used to write letters. MW: How did you weather the market’s ups and downs in the last 30 years? Billy: You have to have faith in the economic model and the thing is not to panic out of the market. Know that this is a temporary situation and it can be painful and can take years to come out of, but the biggest thing is making an irrational move that could hurt you late in life. Now that we’re 67, the people starting out in early retirement have asset allocation more aggressive than ours, but we still have a 60-40 split with 10 years’ worth of cash. Akaisha: In times like this, like in 2008, Y2K or 1987, we all had to jump in or out. The future is not bound to what the market is doing today. We can have market recovery and have our lives paid for. Billy and Akaisha Kaderli MW: You’ve mentioned working and being retired during a major crisis, like the recession in 2008-09. How have you been managing during this one, and is it different for you than others? Akaisha: We discussed going back to work during the 2008-09 recession, but we never did. We considered what it would cost us to return to work — the price of professional clothing, need for a car, returning to the States, and which state? Cost of fuel and vehicle maintenance, eating lunch out or packaging it for each day) — and decided that instead, we’d wait it out. Since we had that previous discussion over a decade ago, when the pandemic hit and the market went down, there was no need for a discussion again. We already knew what our answer was. We have been living off our investments since 1991 and continue to do so to this day with a higher net worth after spending and inflation than when we started. “ ‘We have been living off our investments since 1991 and continue to do so to this day with a higher net worth after spending and inflation than when we started.’ ” — Akaisha Kaderli I’d like to mention that the FIRE lifestyle prepares one for situations like COVID, in that we are already living within our means and have no debt. Billy and I have geographically arbitraged our location where we have a great cost of living (less than $30,000 a year) and plenty of affordable entertainment. So, our lifestyle puts no pressure on our portfolio and we have not had a need to touch it. Billy: In the 2008–09 recession we continued traveling the world and living our adventurous lifestyle. Today we have been forced to stay put. I was in Panajachel, Lake Atitlan, Guatemala in early March, when they shut down the international airport, all public transportation including buses, taxis and the borders. There was no way I was going to be denied getting out of the country and back to Akaisha in Chapala, Mexico. I paid handsomely for a private driver to travel the six-hour trip but was stopped by a police roadblock two hours from the border. The police turned my driver back but I could continue. My Indiana Jones days are over and hitchhiking in the mountains of Guatemala at 67 years old was an experience. Three days later I made it to Chapala. MW: Some people may have seen their portfolios hit hard by this pandemic. What do you think people can do to recover or follow through on their plans to retire early? Billy: It really depends on where they are along their path to financial independence. With the markets taking such a hit and if you are in the accumulation phase I would suggest having dividends reinvested and staying the course of dollar-cost averaging into Vanguard Total Market Index. VTI, +0.84% Ten years from now no one will remember this period as it will be a blip on the chart. I am assuming that those who are FIRE-ING already have several years of lifestyle expenses in cash, as we recommend, so they do not need to sell at a time when the market is down to cover living costs. If one is focused on retiring early, now is the time to live that lifestyle with moderated expenses. Housing, transportation, taxes and food/entertainment are the categories of largest expense, so look there to see what you can do to control costs and track your spending. MW: Has being away from the U.S. made it easier or harder during this health crisis? How is your area coping lately? Billy: It’s been easier in that we are able to walk anywhere to get our supplies, no need for public transportation or a car. Open air markets are abundant with foodstuffs, and grocery store shelves have not been empty. Yes, there was some panic buying in the town up the road, but not here in Chapala, Mexico, where we live. The weather is outstanding with sunshine daily, no dark clouds, rain or snow during this “shelter in place” order, so that’s been good mentally and emotionally. People are friendly, ready to smile, and, of course, there is sanitary gel everywhere. I am a trained French chef, so I took this opportunity to create many memorable dishes using local ingredients such as Bolillo dough that I wrapped around our beef Wellington. So, we definitely have not had any hardships regarding in-home dining. That being said, there is confusion here too. One restaurant might be closed, but another provides take-out. One store might be opened to allow us to purchase a cellphone, but we cannot buy a pair of shorts in that same store. Wide open places like the walking path by the lake is closed, but sidewalks all throughout town are open. Sadly, many small vendors and restaurants have lost their businesses and have no source of income, nor is there much of a safety net here. We do our best to contribute to our community with food to the homeless and unemployed and leaving large tips for servers when the business is open. It is going to take them a long time to recover financially. Also see: COVID-19 crisis sparks ‘early retirement’ wave MW: How do health concerns, like COVID-19 (but really anything), affect early retirees? And how do you plan or account for it differently at various stages, such as in your 30s, 40s, 50s, 60s and so on? Akaisha: First, I would say, it depends on where one chooses to retire early. Health care access and costs in the States are much different than we have found living overseas. And of course, having children changes everything. That being said, we have had routine services, operations, emergencies, colonoscopies, annual physicals, exams, dental and eye care all done overseas. We pay out of pocket for these services because they are both affordable and high quality of care. Since we have not had a US-based health insurance policy for years (we are now on Medicare) the money we would have normally paid for this insurance, we placed in a personal account like a personal Health Savings Account to be used for medical needs. Some countries like Mexico, Panama and Ecuador have safety net insurance policies for expats that are affordable if one needs something major like cancer treatment, heart bypass or a hip replacement. But compared with the U.S. pricing, even those costs are fairly reasonable if one needs to pay out of pocket. As far as living in the States, I would say first that for most people, major medical problems happen later in life. So, if a couple is young and with children, I would suggest several things: • Get a policy with a large deductible, so that the premiums are manageable; • Check out the health-sharing policies that are available (these are not insurance policies, but the cost of medical bills is shared among members); • There are some doctors who provide services for cash, and their pricing is much lower, or you could possibly purchase a concierge plan. For a single annual fee, a doctor will provide you so many office visits, so many X-rays, and other necessary things a year. This can keep your health costs down; • If one spouse works while the other is staying home, often that spouse can provide the insurance for the whole family. And if one is working digitally from home, this arrangement isn’t such a hardship; • And of course, there is always medical tourism, especially for big things. (Editor’s note: Medical tourism is when you leave your city, state or country to receive medical treatment.) MW: Is there any other advice you have for people interested in pursing early retirement — especially those starting out at a younger age, such as 20s or 30s? Billy: This is a great opportunity to pour as much as they can in during these downturns, when shares are at a cheaper price. The power of time is something we don’t have. Compounding money over time is just amazing, so just get as much as you can and let the markets work for you. Akaisha: The emotional component financial analysts don’t mention are more important than the number because you can always pick up some money in various ways. I would say not to run away from your job — the one thing I hear from young people is that they can’t wait to not work, but what’s your dream? Go toward your dream."}]}