{"article": [{"url": "https://www.marketwatch.com/story/trump-expected-to-announce-conservative-barrett-for-supreme-court-2020-09-26", "published": 1601141060.0, "headline": "Trump picks conservative Amy Coney Barrett for Supreme Court", "body": "President Donald Trump nominated Judge Amy Coney Barrett to the Supreme Court on Saturday, capping a dramatic reshaping of the federal judiciary that will resonate for a generation and that he hopes will provide a needed boost to his reelection effort. Republican senators are already lining up for a swift confirmation of Barrett ahead of the Nov. 3 election, as they aim to lock in conservative gains in the federal judiciary before a potential transition of power. Trump, meanwhile, is hoping the nomination will serve to galvanize his supporters as he looks to fend off Democrat Joe Biden. An ideological heir to the late conservative Justice Antonin Scalia, Barrett would fill the seat vacated after the Sept. 18 death of liberal icon Ruth Bader Ginsberg, in what would be the sharpest ideological swing since Clarence Thomas replaced Justice Thurgood Marshall nearly three decades ago. She would be the sixth justice on the nine-member court to be appointed by a Republican president, and the third of Trump’s first term in office. For Trump, whose 2016 victory hinged in large part on reluctant support from conservative and white evangelicals on the promise of filling Scalia’s seat with a conservative, the latest nomination in some ways brings his first term full circle. Even before Ginsburg’s death, Trump was running on having confirmed in excess of 200 federal judges, fulfilling a generational aim of conservative legal activists. “The biggest thing you can do is the appointment of judges, but especially the appointment of Supreme Court justices,” Trump told supporters Friday night at a campaign rally in Newport News, Virginia. “It sets the tone of the country for 40 years, 50 years. I mean, a long time.” The announcement came before Ginsburg was buried beside her husband next week at Arlington National Cemetery. On Friday, she was the first woman to lie in state at the Capitol, and mourners flocked to the Supreme Court for two days before that to pay respects. Within hours of Ginsburg’s death, Trump made clear he would nominate a woman for the seat, and later volunteered he was considering five candidates. But Barrett was the early favorite, and the only one to meet with Trump. Barrett has been a judge since 2017, when Trump nominated her to the Chicago-based 7th U.S. Circuit Court of Appeals. But as a longtime University of Notre Dame law professor, she had already established herself as a reliable conservative in the mold of Scalia, for whom she clerked in the late 1990s. She would be the only justice on the current court not to have received her law degree from an Ivy League school. The eight current justices all attended either Harvard or Yale. The staunch conservative had become known to Trump in large part after her bitter 2017 appeals court confirmation on a party-line vote included allegations that Democrats were attacking her Catholic faith. The president also interviewed her in 2018 for the vacancy created by the retirement of Justice Anthony Kennedy, but Trump ultimately chose Brett Kavanaugh. Trump and his political allies are itching for another fight over Barrett’s faith, seeing it as a political windfall that would backfire on Democrats. Catholic voters in Pennsylvania, in particular, are viewed as a pivotal demographic in the swing state that Biden, also Catholic, is trying to recapture. While Democrats appear powerless to stop Barrett’s confirmation in the GOP-controlled Senate, they are seeking to use the process to weaken Trump’s reelection chances. Barrett’s nomination could become a reckoning over abortion, an issue that has divided many Americans so bitterly for almost half a century. The idea of overturning or gutting Roe v. Wade, the landmark 1973 decision that legalized abortion, has animated activists in both parties for decades. Now, with the seemingly decisive shift in the court’s ideological makeup, Democrats hope their voters will turn out in droves because of their frustration with the Barrett pick. Trump has also increasingly embraced the high court — which he will have had an outsized hand in reshaping -– as an insurance policy in a close election. Increases in mail, absentee and early voting brought about by the coronavirus pandemic have already led to a flurry of election litigation, and both Trump and Biden have assembled armies of lawyers to continue the fight once vote-counting begins. Trump has been open about tying his push to name a third justice to the court to a potentially drawn-out court fight to determine who will be sworn in on Jan. 20, 2021. “I think this will end up in the Supreme Court,” Trump said Wednesday of the election, adding, “And I think it’s very important that we have nine justices.” Meanwhile, outside conservative groups are planning to spend more than $25 million to support Trump and his nominee. The Judicial Crisis Network has organized a coalition that includes American First Policies, the Susan B. Anthony List, the Club for Growth and the group Catholic Vote to help confirm Barrett, and Trump’s campaign is expected to include the nomination in upcoming advertising."}]}