{"article": [{"url": "https://www.marketwatch.com/story/why-safe-haven-gold-is-acting-like-a-risk-on-asset-as-it-soars-toward-an-all-time-high-2020-07-09", "published": 1594466900.0, "headline": "Why 'safe haven' gold and the stock market are now moving the same direction", "body": "Gold is traditionally thought of as a haven asset - a safe port in a storm. But that hasn't stopped it from rising to a near nine-year high, and within striking distance of its record, even as equities and other assets traditionally viewed as risky remain buoyant as they rebound from the pandemic-inspired selloff suffered earlier this year. Chalk it up, in part, to opportunity costs. Efforts by global central banks to push down interest rates, which have fallen into negative territory in real, or inflation-adjusted terms, in the U.S. and are outright negative in many parts of the world, mean that investors who hold gold aren't missing out on the yield they would earn from holding bonds in more usual circumstances. \"As real yields turn negative, opportunity costs for holding non-yielding assets essentially vanish, particularly when viewed through the historical lens of fiat currencies and their purchasing power,\" wrote Jeff deGraaf, chairman of Renaissance Macro Research, in a Thursday note. \"This provides a continued tailwind for gold,\" he said referring to the chart below, which shows the gold price inverted versus the real Treasury yield curve: Renaissance Macro Research August gold GC00, +2.17%  US:GCQ20  fell $16.80, or 0.9%, to settle at $1,803.80 an ounce, a day after the most-active contract rose 0.6% to settle at $1,820.60, the highest since Sept. 14, 2011, according to FactSet data. The weaker tone was accompanied by losses for stocks, with the S&P 500 SPX, +0.87%  down 1%. Gold remains up 0.8% for the week and more than 18% in the year to date, based on the most actively traded contract, according to FactSet. Here's another look from Georgette Boele, precious-metal strategist at ABN Amro, in a Thursday note. As the chart on the left shows, gold is moving increasingly in lockstep with stocks, as measured by the Dow Jones Industrial Average DJIA, +0.56%  , behaving more as a \"risk-on\" asset - a move aided by the fall in real yields, as reflected by the right-hand chart: ABN Amro \"Firstly, central bank policy is a strong driver behind higher gold prices. Not only are official rates close to zero in a large number of countries, they will unlikely go up in our forecast horizon,\" Boele wrote. Most central banks have announced quantitative easing, with the Federal Reserve embarking on unlimited QE and the Bank of Japan and the European Central Bank also implementing large programs. \"This sounds like music to the ears of gold bugs as money floods into the market and currencies begin to decline,\" she said. In June, gold-backed ETFs recorded their seventh consecutive month of global positive flows, adding 104 metric tons, which is equivalent to $5.6 billion, or 2.7% of assets under management, the World Gold Council reported on Tuesday. For the first half of the year, global net inflows reached $39.5 billion, surpassing the previous annual inflow record from 2016. Meanwhile, expectations the Federal Reserve could move to impose a form of \"yield-curve control,\" a policy that aims to keep yields at a particular level, scope for upside in U.S. Treasury yields remain limited, Boele said. That means if investors do grow concerned about the potential for inflation in the longer term, it will become visible via inflation expectations and negative U.S. real yields. Rising government budget deficits as a result of fiscal stimulus efforts by governments haven't hurt gold, either, she said. It all makes for a pretty bullish backdrop, Boele argued, noting that investors have bought every dip by the precious metal during the rally. \"Now the psychological resistance of $1,800 per ounce has been surpassed. It seems that investors will only be satisfied if the former (intraday) peak in gold prices at $1,921 per ounce is reached and taken out. Above that, the important psychological level of $2,000 per ounce is within reach,\" she said. ABN Amro raised its year-end gold forecast to $1,900 an ounce from a previous target of $1,700 and now sees the yellow metal at $2,000 an once versus a previous forecast of $1,800. But investors should be prepared for a potential near-term dip, Boele said, noting that speculative positions remain \"substantial\" and ETF positions at an all-time high. \"We still expect a sizeable correction in gold prices in a risk off environment when the dollar is back in favor. It is likely that this correction will be short-lived and be a buy-on-dips for investors eagerly waiting to step in,\" she said."}]}