{"article": [{"url": "https://www.marketwatch.com/story/obama-to-rebuke-trump-by-name-in-dnc-speech-warn-that-our-democracy-is-at-risk-2020-08-19", "published": 1597879880.0, "headline": "Obama rebukes Trump by name in DNC speech, warns that our democracy is at risk", "body": "WASHINGTON — Former President Barack Obama warned Wednesday night that American democracy may not survive if President Donald Trump is reelected, a damning assessment of his successor intended to jolt Democrats into rallying around Joe Biden in the November election. “This administration has shown it will tear our democracy down if that’s what it takes to win,” Obama said in strikingly blunt, and at times emotional, remarks on the third night of the Democratic convention. See:Full text of Obama’s speech at the Democratic National Convention Even in the heat of campaigns, former presidents are typically more restrained than other politicians in their criticisms of a sitting president. Yet Obama’s remarks — his most personal and direct critique of Trump yet — revealed the 44th president’s personal disregard for the nation’s current commander in chief and his belief that Trump presents an existential threat to American democracy. Obama’s address also amounted to a call to action to a weary and anxious nation, particularly younger Americans frustrated with a government that may often appear out of touch with their own interests. Democrats see Obama as a bridge to those voters in the 2020 race, someone who can speak both to Biden’s character and to the urgency of progressives pushing for more sweeping change to the nation’s economic and domestic policies. Read: Kamala Harris to accept nomination for vice president: DNC live updates “I am also asking you to believe in your own ability — to embrace your own responsibility as citizens — to make sure that the basic tenets of our democracy endure,” Obama said. Obama forged a close personal relationship with Biden during their eight years together in the White House and has been a sounding board for him throughout the 2020 campaign. On Wednesday, Obama said that when he set out to pick a vice president, “I didn’t know I’d end up finding a brother.” Yet there’s an inherent tension in Obama’s role as one of the most powerful and important surrogates for Biden. Obama’s own political rise was fueled by the power of barrier-breaking, generational change, and he’s encouraged “new blood” in politics. More recently, Obama drew attention during the 2020 Democratic primary when he said many of the world’s problems have been due to “old people, usually old men, not getting out of the way.” With the general election now in full swing, Obama confidants say that while the former president’s support for Biden is unequivocal, he does worry about enthusiasm among younger voters, particularly younger voters of color. He’s well aware that one of the reasons Trump currently occupies the Oval Office is that those voters did not show up in the same large numbers in 2016 for Hillary Clinton as they did when he was on the ballot. Obama was bitingly personal in his criticism of Trump, accusing him of using the presidency to seek the “attention he craves” and never putting in the work required to lead the nation, particularly in times of crisis. Speaking at a news conference Wednesday, Trump shrugged off Obama’s criticism, saying that if the former administration had done a good job, “I wouldn’t be here.” Trump added, “And probably if they did a good job, I wouldn’t have even run.” Obama spoke two nights after his wife, former first lady Michelle Obama, headlined the opening night of the convention. The fact that the Obamas are headliners on two of the four nights of the Democratic celebration speaks to the crucial role they have in helping Biden try to reassemble the coalition that propelled them into the White House — and the challenge the Democratic Party has in building a new bench of other leaders who can do the same. “When you think about folks who have the capacity to really unify us, there are only a few people,” said Yvette Simpson, chief executive of Democracy for America, a progressive political action committee. “Certainly Barack Obama and Michelle Obama are among them.” Indeed, the former president has enviable popularity, both among Democrats and all Americans. A Fox News poll conducted in May found 93% of Democrats had a favorable opinion of Obama, as did 63% of all registered voters. Despite that strong support, there has been some rethinking of Obama’s legacy among some of his party’s most liberal activists, who argue he didn’t go far enough in overhauling the nation’s health care system and gave too much away to Republicans in fiscal negotiations. Obama himself has acknowledged there was more he wanted to do, but argued he was hamstrung by the realities of a Republican-controlled House, and eventually Senate, for much of his tenure. But some of Obama’s more recent comments have energized liberals, who see signs of him embracing some of the tactics of his party’s activist wing. Progressives cheered in particular when Obama called for eliminating the Senate filibuster rules requiring 60 votes on major pieces of legislation, calling it a “Jim Crow relic” that is holding up rewriting voting rights laws. His surprise comments came during his eulogy at the funeral of the late civil rights leader and Georgia Rep. John Lewis. “That’s the guy we remember from the election of 2008,” Simpson said of Obama’s remarks at Lewis’ funeral. “It encouraged me that he might be the guy that pulls Joe Biden along a little bit.”"}]}