{"article": [{"url": "https://www.marketwatch.com/story/florida-records-10000-new-coronavirus-cases-the-largest-daily-surge-since-the-pandemic-began-2020-07-02", "published": 1593732740.0, "headline": "Florida records 10,000 new coronavirus cases - the largest daily surge since the pandemic began", "body": "Florida just hit a new record in the uphill battle against COVID-19. Florida reported more than 10,000 new cases Thursday, its highest number of new daily cases since the COVID-19 pandemic began. It also reported nearly 169,100 cases, most of which do not account for those who are asymptomatic or pre-symptomatic, and 3,617 confirmed deaths from the virus. While COVID-19's progress has slowed in states such as New York, where most cases in the U.S. are still centered, confirmed coronavirus cases have risen in 35 U.S. states, with some of the most populous states such as Florida, Texas and California a key cause for concern. Unlike officials in California and Texas, however, Florida Gov. Ron DeSantis has said the state will not delay its reopening plans. New cases are up 48% in Florida over the past week, up 27% in Texas, and up 19% in California over the same period, according to a tally by the Washington Post. “ Florida reported nearly 169,100 cases, most of which do not account for those who are asymptomatic or pre-symptomatic, and 3,617 confirmed deaths from coronavirus. ” \"We're not going back, closing things,\" DeSantis, a Republican, said this week, according to Axios. \"I don't think that that's really what's driving it, people going to a business is not what's driving it. I think when you see the younger folks, I think a lot of it is more just social interactions.\" \"We're open, we know who we need to protect; most of the folks in those younger demographics, although we want them to be mindful of what's going on, are just simply much, much less at risk than the folks who are in those older age groups,\" the governor added. DeSantis instructed bars, which are allowed to open to half of their usual capacity, to stop selling alcohol as one concession to the surge in coronavirus cases, but the state does not have restrictions on the number of people who can gather in stores and gyms. Congresswoman Donna Shalala, a Democrat based in Miami, told NPR that the state put politics above public health.\" \"We needed at the beginning to hit his virus with a hammer, to starve it all the way down. We didn't do the right thing in the beginning, and now we're trying to play catch-up.\" Thus far, New York has had the most deaths from COVID-19 in the U.S. (32,064), followed by New Jersey (15,107), Massachusetts (8,132), Illinois (6,951), Pennsylvania (6,951), Michigan (6,712) and California (6,171). Texas has reported 2,541 deaths from the virus. The COVID-19 pandemic, which was first identified in Wuhan, China in December, had infected 10,815,117 people globally and 2,732,639 in the U.S. as of Thursday. It had claimed at least 519,575 lives worldwide, 128,651 of which were in the U.S., according to Johns Hopkins University. The Dow Jones Industrial Index DJIA, +0.56%  and the S&P 500 SPX, +0.87%  ended up Thursday on better-than-expected unemployment numbers, despite the surge in coronavirus cases in some of the country's most populous states. How COVID-19 is transmitted"}]}