{"article": [{"url": "https://www.marketwatch.com/story/elon-musks-brother-kimbal-made-more-than-8-million-selling-tesla-stock-2-days-before-he-bought-them-2020-09-04", "published": 1599384740.0, "headline": "Elon Musk's brother Kimbal made more than $8 million selling Tesla shares 2 days before he bought them", "body": "Elon Musk's younger brother, Kimbal, appears to have made more than $8 million on Tesla's stock this week, as he exercised options to buy the stock, two days after he sold those shares at 6.5 times the price he paid for them. Good timing for board member Kimbal, as the sale of share was made Tuesday, with some of the sales executed above Monday's record closing price of $498.32. The stock TSLA, +1.89%  bounced sharply to close Friday up 2.8% at $418.32, reversing an earlier intraday loss of as much as 8.6%. The stock snapped a three-day losing streak, but has still tumbled 16.1% since Monday's record close. Weekend reads:Early warning sign for Tesla's stock This week's selloff comes after a 5-for-1 stock split went into effect on Monday, and as Tesla disclosed a $5 billion stock offering and a large shareholder reduced its stake. Don't miss:Tesla's stock sinks again to kick off a correction after disclosure of another large seller On Sept. 1, Kimbal Musk sold 36,375 Tesla shares at a weighted average price of about $482.59, according to a MarketWatch calculation of data from a Form 4 filing with the Securities and Exchange Commission filed late Thursday. The filing showed multiple trades made at prices ranging from about $471.33 to about $502.01. After closing at $498.32 on Monday, the stock reached an all-time intraday high of $502.49 in the first minute of trading on Tuesday, fell to an intraday low of $470.51 around 10 a.m. Eastern, then bounced to reach $502.28 around 10:30 a.m. before closing down 4.7% at $475.05. FactSet, MarketWatch Then on Sept. 3, the filing showed that Kimbal Musk acquired 20,375 Tesla shares at a price of $74.17, as part of a trading plan adopted on Feb. 20, 2020. For the 20,375 shares he sold on Sept. 1 and bought two days later, he made $8.32 million on the trades. If he were to buy back the extra 16,000 shares he sold at current prices, he could make about $1.49 million on the trades. Meanwhile, the volume-weighed average price (VWAP) of Tesla's stock on Sept. 3 was $412.46, according to FactSet. If Kimbal Musk had sold shares on the same day that he acquired them, as fellow board member Kathleen Wilson-Thompson did on Monday, and President of Automotive Jerome Guillen did on Tuesday, he would have made about $6.89 million on the trades, or about $1.43 million less than he did. FactSet, MarketWatch Kimbal Musk, who is co-founder of The Kitchen, has been on Tesla's board of directors since April 2004. He is a member of the board's compensation, corporate governance and disclosure controls committees. His compensation in 2019 as a Tesla board member was $20,000, in the form of a cash fee. After this week's trades, Kimbal Musk still owns 638,240 Tesla shares, the filings show, which at Friday's closing price were worth about $267.99 million. Despite the pullback, the stock has still soared 400.0% so far this year, compared with the S&P 500 index's SPX, +0.87%  gain of 6.1%.Another insider made more than $6 million from Tesla stock trades Tesla also disclosed late Thursday trades made by insider Jerome Guillen, which made him about $6.4 million. A Form 4 filing showed that Guillen acquired 15,000 shares at $51.64 on Sept. 1, as part of a trading plan adopted on Feb. 20. On the same day, he sold 15,000 shares at a weighted average price of about $479.00. The sale was made in a series of trades at prices ranging from $471.33 to $502.01. That's the same range of prices that Kimbal Musk's sales were executed. Guillen joined Tesla in November 2010 and has been president of automotive since September 2018."}]}