{"article": [{"url": "https://www.marketwatch.com/story/u-s-budget-deficit-to-hit-record-3-3-trillion-this-year-cbo-says-11599070944", "published": 1599067820.0, "headline": "U.S. budget deficit to hit record $3.3 trillion this year, CBO says", "body": "A sign at the U.S. Bureau of Engraving and Printing in Washington. (AFP via Getty Images) The U.S. government will run its biggest budget shortfall ever this year, at $3.311 trillion, the nonpartisan Congressional Budget Office said Wednesday. The government’s fiscal year ends Sept. 30 and the record fiscal deficit had long been seen as a fait accompli in light of the massive levels of government support for the economy in the wake of the COVID-19 pandemic. “This pandemic is tragic on so many fronts and today’s massive borrowing is a cost of mitigating this pain. The warning bells this report contains should not cause a premature end to borrowing, but a commitment to dealing with the debt at the appropriate time,” said Maya MacGuineas, president of the bipartisan Committee for a Responsible Federal Budget. The Treasury and the Office of Management and Budget will announce the official results sometime in October, if the Trump administration sticks to the usual release pattern. The CBO number was, however, slightly better than had been expected in April. Back then, the CBO was projecting a $3.7 trillion deficit for this budget year and a $2.1 trillion shortfall in 2021. The projected 2021 deficit was trimmed back to $1.810 trillion in the new forecast. In comparison to the size of the economy, a measure most economists say better reflects the deficit’s fiscal burden, the 2020 deficit would be the largest since 1945, at 16.0% of Gross Domestic Product. That would be the fourth-largest deficit in proportion to the size of the economy, according to data kept by the Office of Management and Budget, after the years 1943 through 1945. The CBO projected most of the budgetary impact of the pandemic would be focused in 2020 and 2021, as its 10-year forecast window remained mostly unchanged from estimates made before the virus’ impact was known. “The cumulative deficit between 2021 and 2030 is projected to total $13.0 trillion (5.0 percent of GDP over that period), about the same as CBO projected in March. Lower projected wages, salaries, and corporate profits, as well as recent legislation and other changes, increase deficits, but that change is more than offset by lower projected interest rates and inflation, which decrease deficits,” CBO said. The report comes as Congress and the White House are likely to begin in September hammering out another bill to respond to the pandemic, despite being far apart on how much to spend. Four earlier coronavirus bills, including the $1.7 trillion CARES Act passed in March, were estimated by the CBO to cost $2.404 trillion combined. House Speaker Nancy Pelosi and Mark Meadows, the White House chief of staff, remain about $900 billion dollars apart on the next bill, with Pelosi arguing for the higher number of $2.2 trillion. Any spending resulting from another coronavirus bill would probably come too late to affect the 2020 fiscal year. For this year, the CBO said spending would total about 32% of GDP, also the highest level since 1945. Revenues were expected to fall to about 16% of GDP. The revenue picture CBO projected showed the sharp economic turn caused by the pandemic. Revenues were up by 6% overall in the first six months of the budget year, October 2019 to March, before dropping by 13% in the second half of the year. Offsetting some of that, though, was a sharp drop in borrowing costs. While the amount of debt rose by 20% over 2019, net interest costs were projected to actually fall by $37 billion, the CBO said. “That drop occurs primarily because interest rates have been much lower in 2020 than they were in 2019,” CBO said. Over the 2020-’30 window, though, the budget picture remained grim. The publicly held-debt-to-GDP percentage was estimated to hit 98% in 2020 and continue rising steadily to almost 109% in 2030. In that year, the debt was estimated to hit $33.457 trillion, or more than $13 trillion more than 2020’s level. On a nominal basis, the projected annual deficits shrink quickly in 2020 and 2021, then pause before rising near the end of the decade. The lowest projected deficit over the next decade is $1.080 trillion in 2027. “While managing the COVID-19 crisis must remain the top priority, whomever is sworn in as president next year will also need a plan to dig us out of this hole once the economy is stronger,” MacGuineas said. Michael Linden, executive director of Groundworks Collaborative, an advocacy group for progressive and inclusive economic policy, said the deficit numbers should not deter policymakers from thinking big. “Interest rates are at historic lows and it’s clearer than ever that the deficit isn’t a major concern — so the highest priority, and really the only responsible thing for our government to do, is support workers and families and make the major investments needed to end this crisis and put our economy on strong footing,” he said. The CBO also released a report taking a look at the health of government trust funds and concluded three will be unable to pay out the amounts required by law within the next decade. It said the Highway Trust Fund would hit its exhaustion date in 2021, with the Hospital Insurance portion of Medicare following in 2024 and Social Security’s Disability insurance fund in 2026."}]}