{"article": [{"url": "https://www.marketwatch.com/story/we-need-to-create-more-good-jobs-the-old-easy-answers-wont-work-any-more-2020-06-17", "published": 1592379620.0, "headline": "We need to create more good jobs. The old easy answers won't work any more.", "body": "CAMBRIDGE, Mass. (Project Syndicate - COVID-19 has exacerbated deep fault lines in the global economy, starkly exposing the divisions and inequalities of our current world. It has also multiplied and amplified the voices of those calling for far-reaching reforms. When even the Davos set is issuing calls for a \"global reset of capitalism,\" you know that changes are afoot. There are some common threads running through the newly proposed policy agendas: To prepare the workforce for new technologies, governments must enhance education and training programs, and integrate them better with labor-market requirements. Social protection and social insurance must be improved, especially for workers in the gig economy and in non-standard work arrangements. More broadly, the decline in workers' bargaining power in recent decades points to the need for new forms of social dialogue and cooperation between employers and employees. Better-designed progressive taxation must be introduced to address widening income inequality. Anti-monopoly policies must be reinvigorated to ensure greater competition, particularly where social media platforms and new technologies are concerned. Climate change must be tackled head-on. And governments must play a bigger role in fostering new digital and green technologies. Taken together, these reforms would substantially change the way our economies operate. But they do not fundamentally alter the narrative about how market economies should work; nor do they represent a radical departure for economic policy. Most critically, they elide the central challenge we must address: reorganizing production. Our core economic problems - poverty, inequality, exclusion, and insecurity - have many roots. But they are reproduced and reinforced on a daily basis in the course of production, as an immediate by-product of firms' decisions about employment, investment, and innovation. In economist-speak, these decisions are rife with \"externalities\": they have consequences that spill over to other people, firms, and parts of the economy. Externalities can be positive: think of learning spillovers from research and development, which are well recognized (and form the rationale for tax credits and other public subsidies). Obvious negative externalities are environmental pollution and the effects of greenhouse-gas emissions on the climate. Such spillovers also include what could be called \"good jobs\" externalities. \"Good jobs\" are those that are relatively stable, pay well enough to underpin a reasonable living standard with some security and savings, ensure safe working conditions, and offer opportunities for career progression. Firms that generate them contribute to the vitality of their communities. By contrast, a shortage of good jobs often carries high social and political costs: broken families, substance abuse, and crime, as well as declining trust in government, experts, and institutions, partisan polarization, and populist nationalism. There are also clear economic inefficiencies, as productivity-enhancing technologies remain bottled up in a few firms and do not spread, contributing to anemic overall wage growth. Firms' decisions about how many workers to employ, how much to pay, and how to organize work do not affect only the bottom line. When a company decides to automate its production line or outsource part of its production to another country, the local community suffers long-term damage that is not \"internalized\" by its managers or shareholders. The implicit assumption behind much of our current thinking, as well as that of the traditional welfare-state model, is that middle-class \"good jobs\" will be available to all with adequate skills. From this perspective, the appropriate strategy to foster inclusion is one that combines spending on education and training, a progressive tax and transfer system, and social insurance against idiosyncratic risks such as unemployment, illness, and disability. But economic insecurity and inequality today are structural problems. Secular trends in technology and globalization are hollowing out the middle of the employment distribution. The result is more bad jobs that do not offer stability, sufficient pay, and career progression, and permanently depressed labor markets outside major metropolitan centers. Addressing these problems requires a different strategy that tackles the creation of good jobs directly. The onus should be on firms to internalize the economic and social spillovers they cause. Hence, the productive sector must be at the heart of the new strategy. Put bluntly, we must change what we produce, how we produce it, and who gets a say in these decisions. This requires not just new policies, but also the reconfiguration of existing ones. Active labor-market policies designed to increase skills and employability should be broadened into partnerships with firms and explicitly target the creation of good jobs. Industrial and regional policies that currently center on tax incentives and investment subsidies must be replaced by customized business services and amenities to facilitate maximum employment creation. National innovation systems need to be redesigned to orient investments in new technologies in a more employment-friendly direction. And policies to combat climate change, such as the European Green Deal, must be explicitly linked to job creation in lagging communities. A new economic order requires an explicit quid pro quo between private firms and public authorities. To prosper, firms need a reliable and skilled workforce, good infrastructure, an ecosystem of suppliers and collaborators, easy access to technology, and a sound regime of contracts and property rights. Most of these are provided through public and collective action, which is the government's side of the bargain. Governments, in turn, need firms to internalize the various externalities their labor, investment, and innovation decisions produce for their communities and societies. And firms must live up to their side of the bargain - not as a matter of corporate social responsibility, but as part of an explicit regulatory and governance framework. Above all, a new strategy must abandon the traditional separation between pro-growth policies and social policies. Faster economic growth requires disseminating new technologies and productive opportunities among smaller firms and wider segments of the labor force, rather than confining their use to a narrow elite. And better employment prospects reduce inequality and economic insecurity more effectively than fiscal redistribution alone. Simply put, the growth and social agendas are one and the same. Dani Rodrik, professor of international political economy at Harvard University's John F. Kennedy School of Government, is the author of \"Straight Talk on Trade: Ideas for a Sane World Economy.\" Stefanie Stantcheva is professor of economics at Harvard University. This article was published with permission of Project Syndicate - The Post-Pandemic Social Contract"}]}