{"article": [{"url": "https://www.marketwatch.com/story/phoenix-megachurch-delivers-for-trump-the-raucous-atmosphere-hed-hoped-tulsa-rally-would-provide-2020-06-24", "published": 1593002720.0, "headline": "Phoenix megachurch delivers for Trump the raucous atmosphere he'd hoped Tulsa rally would provide", "body": "PHOENIX (AP) - It wasn't quite one of his signature big-stadium rallies. But President Donald Trump drew something closer to the jam-packed audience of political supporters he's been craving as hundreds of young conservatives filled a Phoenix megachurch Tuesday to hear his call for them to get behind his re-election effort. The crowded Dream City Church for the gathering of Students for Trump offered a starkly different feel compared to Trump's weekend rally in Tulsa, Okla., his first of the coronavirus era, which drew sparser attendance. Trump hailed the \"patriotic young Americans who stand up tall for America and refuse to kneel to the radical left.\" \"You are the courageous warriors standing in the way of what they want to do and their goals,\" he told the boisterous crowd. \"They hate our history. They hate our values, and they hate everything we prize as Americans.\" Trump was looking to regain campaign momentum after Tulsa, which was supposed to be a sign of the nation's reopening and a show of political force. Instead, it generated thousands of empty seats and swirling questions about the president's campaign leadership and his case for another four years in office. The low turnout sharpened the focus on Trump's visit to Arizona, which doubles as both a 2020 battleground state and a surging coronavirus hot spot. With the Phoenix event, which was organized by Turning Point Action, a group chaired by Trump ally Charlie Kirk, the president hoped to turn attention - at least momentarily - away from his slumping poll numbers, surging coronavirus infections in huge swaths of the South and West, and a virus-ravaged economy. His address was chock-full of typical Trump lines - boasts about television ratings, ridicule of his likely Democratic presidential opponent, Joe Biden, and sharply worded resentments over China's handling of the coronavirus crisis. As he did in Oklahoma over the weekend, Trump referred to the virus as \"kung flu,\" a pejorative term that Asian-Americans say is racist, after audience members appeared to call for him to use the term while he was listing the plethora of names that, to his mind, the virus is known by - at one point launching into an exploration of his claim that \"some people\" don't know what the \"19\" in the disease's name, COVID-19, means, more than four months after that nomenclature was applied globally. iframe.twitter-tweet { width: 100% !important; } Key Words:Infectious-disease expert says we're thinking too much about a second wave of COVID-19 when it's really more like a forest fire Unlike his return to campaign stage before thousands of empty seats in Oklahoma, Trump seemed to revel in the energy of a packed - albeit smaller, with a reported capacity of about 3,000 - venue. He also offered his supporters a dark warning. \"This will be in my opinion the most corrupt election in the history of our country,\" said Trump, who has in recent days stepped up claims that expanded mail-in voting will lead to voting fraud. \"And we can not let this happen.\" But throughout his daylong trip to Arizona, which included a visit to the U.S.-Mexico border, the COVID-19 pandemic shadowed Trump. The Democratic mayor of Phoenix made clear she did not believe Trump's speech could be safely held in her city - and urged the president to wear a face mask. But Trump has adamantly refused to wear a mask in public, instead turning it into a red-vs.-blue cultural issue. Polling suggests Republicans are far less likely to wear face coverings than Democrats despite health experts' warnings that it dramatically reduces the risk of transmitting the virus. Few in the crowd at the Students for Trump event donned masks. Since late May, Arizona has emerged as one of the nation's most active hot spots for the spread of COVID-19. Key Words:Trump contradicts narrative that he was speaking in jest when he appeared to advocate a slowdown in coronavirus testing Photos of restaurants and bars crowded with unmasked patrons ignited controversy. Republican Gov. Doug Ducey, a Trump supporter, reversed himself last week and allowed cities and counties to require people to wear masks in public places. Most have, including Phoenix and Yuma and the counties that surround them. Arizona is seeing disturbing trends in several benchmarks, including the percentage of tests that prove positive for the virus, which is the highest in the nation. The state reported a new daily record of nearly 3,600 additional coronavirus cases Tuesday as Arizona continued to set records for the number of people hospitalized, in intensive care and on ventilators for COVID-19. Arizona's total case load in the pandemic stands at at least 58,179, with 42 more deaths reported Tuesday, raising the death toll to 1,384. \"Right now, the next couple of weeks are going to be critical in our ability to address those surgings that we are seeing in Florida, in Texas, in Arizona and other states,\" Dr. Anthony Fauci, the federal government's top infectious-disease expert, told a House committee Tuesday. \"They are not the only ones that are having a difficulty. Bottom line ... it's a mixed bag.\" Key Words:Fauci says in 40 years of dealing with viral outbreaks, he's never seen anything like COVID-19 Campaign officials stressed that rallies would remain a staple of the president's reelection strategy but allowed that they may, in certain states, need to change slightly. Discussions were under way about having them in more modest venues or outdoors, perhaps in airplane hangars and amphitheaters, or in smaller cities away from likely protesters. Trump campaign officials believe Trump's ability to draw thousands of supporters out during a pandemic sets up a favorable contrasting image with Democratic rival Joe Biden. Still, the campaign has struggled to find effective attack lines on Biden. Before the Students for Trump event, Trump visited the U.S.-Mexico border, where he tried to credit his new wall with stopping both illegal immigration and the coronavirus. In the blazing summer heat, Trump briefly stopped to inspect a new section of the concrete and rebar structure. The president and other officials took a moment to scrawl their signatures on the wall. President Donald Trump speaks with U.S. Border Patrol Chief Rodney Scott during a brief Tuesday tour of a section of border wall in San Luis, Ariz. The president and other officials took a time to scrawl their signatures on the wall. Associated Press Arizona health officials have said in recent weeks that an influx of virus patients from Mexico have added to the load on hospitals in the southern part of the state. \"We realize that this is a hotspot,\" Ducey said earlier this week. \"We also realize we've got a lot of good, hard-working folks that come across the border every day to work in Arizona industry. We also have a lot of good folks that want to take advantage of much of our Arizona health care system, and we want there to be that capacity.\" __ Madhani reported from Chicago. Associated Press writers Jonathan Cooper, Astrid Galvan and Bob Christie in Phoenix and Elana Schor in New York contributed to this report."}]}