{"article": [{"url": "https://www.marketwatch.com/story/census-to-end-data-collection-efforts-for-2020-a-month-early-2020-08-04", "published": 1596544460.0, "headline": "Census Bureau set to close 2020 data-collection window a month early", "body": "ORLANDO, Fla. (AP) — The U.S. Census Bureau is cutting its schedule for data collection for the 2020 census a month short as legislation that would have extended the national head count’s deadlines stalls in the U.S. Senate. The move is worrying researchers, politicians and others who say the change will miss hard-to-count communities, including minorities and immigrants, and produce less accurate and trustworthy data. “ ‘This is nothing but a disgusting power grab from an administration hell-bent on preserving its fleeting political power at all costs.’ ” — Julie Menin, New York City census director The Census Bureau said late Monday that the door-knocking and ability for households to respond online, by phone or by mail to the questionnaire will stop at the end of September so the bureau can meet an end-of-the-year deadline to turn in numbers used for redrawing congressional districts and allocating federal funds. Census experts and civil-rights activists worry earlier deadlines could affect the thoroughness of the count, which determines how $1.5 trillion in federal spending is distributed and how many congressional districts each state gets. “This is nothing but a disgusting power grab from an administration hell-bent on preserving its fleeting political power at all costs,” said Julie Menin, census director for New York City. But Census Bureau director Steven Dillingham said that the agency aimed to achieve the same level of responses as in past censuses. The bureau will hold extra training sessions and will reward door-knockers who work the maximum hours possible. “We will improve the speed of our count without sacrificing completeness,” Dillingham said. Facing delays caused by the pandemic, the Census Bureau had earlier this year pushed back wrapping up field operations for the once-a-decade head count from the end of July to the end of October. The bureau also asked Congress in April to extend the deadline for turning in apportionment data used for drawing congressional districts from Dec. 31, 2020, to April 30, 2021. Top Census Bureau officials have said it would be impossible to meet the end-of-the-year deadline, and that the bureau expected bipartisan support for the request. “ ‘Ending the count early increases the likelihood of a significant undercount that could deprive the city and its residents of vital funding and political representation.’ ” — Mike Feuer, Los Angeles city attorney The request passed the Democratic-controlled House as part of coronavirus-relief legislation but is now stalled in the Senate. The chamber’s inaction coincides with a memorandum Trump issued last month to try to exclude people living in the U.S. illegally from being part of the process for redrawing congressional districts. Civil-rights groups, states, cities and individuals have filed at least a half-dozen lawsuits challenging the memorandum as unconstitutional and an attempt to limit the power of Latinos and immigrants of color. The request to Congress also asked that the deadline for turning in data used for drawing legislative and local districts be extended from March 30, 2021, to July 31, 2021, but the Census Bureau is now aiming to finish those responsibilities by the end of March. “Ending the count early increases the likelihood of a significant undercount that could deprive the city and its residents of vital funding and political representation,” said Los Angeles City Attorney Mike Feuer, who has joined one of the lawsuits challenging Trump’s order. Read on:OK, boomers? Millennials and younger Americans now constitute a majority of the U.S. population"}]}