{"article": [{"url": "https://www.marketwatch.com/story/social-security-medicare-prescription-drug-pricesaging-in-america-panel-weighs-in-on-election-topics-2020-09-22", "published": 1600790240.0, "headline": "Social Security, Medicare, prescription drug pricesâ\u0080\u0094Aging in America panel weighs in on election topics", "body": "This article is reprinted by permission from NextAvenue.org. Whatâ\u0080\u0099s in store for older Americans from the 2020 presidential election? For answers, theÂ American Society on AgingÂ (ASA) just hosted its Panel of Pundits â\u0080\u0094 an annual event thatâ\u0080\u0099s been running for almost 20 years. I moderated. Normally, the panel is held at ASAâ\u0080\u0099s annual Aging in America conference to a standing-room crowd. This year, of course, it was a webinar; nearly 200 people watched. The five panelists brought a range of political perspectives and decades of experience in the aging and political worlds: Peter Kaldes, president and CEO of ASA and a former Obama economic adviser Richard BrowdieÂ of Browdie Consulting, formerly president and CEO of Benjamin Rose Institute on Aging and Pennsylvaniaâ\u0080\u0099s Secretary of Aging Joel White, founder and president of Horizon Government Affairs and former Republican staff director of the House Ways and Means Health Subcommittee Jay Newton-Small, a journalist for Time and Bloomberg News and co-founder and CEO of the MemoryWell digital platform to improve the care of elders John Zogby,Â founder and senior partner of the John Zogby Strategies polling firm I opened the session asking the panelists to give a one-word description of 2020 so far. The responses were as dire as the year has been; Newton-Small called the year â\u0080\u009cArmageddon.â\u0080\u009d During theÂ freewheeling webinar, I asked the pundits everything from their outlook for aÂ coronavirus vaccineÂ (they were divided on whether thereâ\u0080\u0099d be one in 2020) to whether the Senate would flip in November and become Democratic-controlled (most thought it would, but said not to count out the re-election of current Republican Senate Majority Leader Mitch McConnell). Panelists were united on two issues: All thought the 2020 federal election wouldÂ notÂ go off without serious hitches, which could delay final election results. And all were in support of a fourth coronavirus emergency package, but most felt it wouldnâ\u0080\u0099t be done by October 1. Hereâ\u0080\u0099s where they came down on four key topics: Social Security, Medicare and telehealth; prescription drug prices and their views on the top aging-related policy change theyâ\u0080\u0099d like to see, whoever is elected president:Social Security Most of the pundits felt that Social Security was not on the table as a 2020 election issue. However, most felt itsÂ solvencyÂ would be a serious issue in 2021 caused by increased unemployment lowering contributions to Social Security as well as the rising deficit. I asked whether President Trump put Social Security back on the political table when he suspended its payroll tax to provide stimulus checks to the American public. And, I queried, shouldnâ\u0080\u0099t we start thinking seriously about the exhaustion of the Social Security trust fund? See: This is one Trump tax cut you really donâ\u0080\u0099t want Joel White: â\u0080\u009cWait a minute. Wait a minute. Do we care about the Trust Funds and fiscal responsibility and all that stuff? Are you kidding me? Weâ\u0080\u0099ve got a $3.3 trillion deficit staring us in the face according to CBO [Congressional Budget Office] and the last time I heard someone on the Hill talk about trust fund balances and deficits and stuff like that, I think I was still on the Hill [from 2004-2007]. I donâ\u0080\u0099t think the Social Security issue is back on the political table this year. I think itâ\u0080\u0099s back on the table next year, when we have a budget, whether Biden is elected or Trump is re-elected.â\u0080\u009d Rich Browdie: â\u0080\u009cI would agree with Joelâ\u0080\u0099s assessmentâ\u0080¦. And I do think that the Social Security financing thing will be back, and the next president, whether heâ\u0080\u0099s planning to deal with it or not, heâ\u0080\u0099s going to have to dip in.â\u0080\u009d Related: Why you might not know that Trump is threatening your Social Security Peter Kaldes: â\u0080\u009cI suspect that if candidate Biden wins, the next day weâ\u0080\u0099ll start hearing about balancing budgets again. So, Iâ\u0080\u0099m a little concerned about that. But Iâ\u0080\u0099m with Rich on this one; I thinkâ\u0080¦using payroll taxes as a tool is something that President Obama did as well in some ways.â\u0080\u009d(In 2011 and 2012, the Obama administration cut payroll taxes by 2 percentage points to 4.2 percent.) Jay Newton-Small: â\u0080\u009cThe Republican National Convention for the first time, I think in history,Â did not have a platformÂ this year. So, itâ\u0080\u0099s hard to know for sure what President Trumpâ\u0080\u0099s second-term agenda, if he were to be re-elected, would be. But heâ\u0080\u0099s certainly spoken a lot about tackling deficits and entitlements like Social Security, Medicare and Medicaid and appeasing more of the fiscal conservatives that heâ\u0080\u0099s got. But I do think, similarly, Joe Biden â\u0080\u0094 as Peter was saying â\u0080\u0094 if he were elected, would also tackle those issues.â\u0080\u009d John Zogby: â\u0080\u0098Social Security really faces insolvency just 10 years from now. So, when do we begin the debate again about either a new funding mechanism for Social Security, because demographically, there arenâ\u0080\u0099t enough young people who are working to sustain the numbers of baby boomers and income Gen Xers? Ten years is not far away. Or are we in a situation where we kick the can down the road? But at least for now, the federal debt and deficit continue to grow almost exponentially and yet Social Security is just not on the table right now. But it has to be.â\u0080\u009dMedicare and telehealth I asked the pundits this question posed by webinar watcher Next Avenueâ\u0080\u0099s Money & Policy editor, Richard Eisenberg: â\u0080\u009cHow will Medicare change under the next president and why?â\u0080\u009d Peter Kaldes: â\u0080\u009cI think there are some wonderful opportunities under a Biden administration to really focus on the salaries of our caregivers and the direct care workforce. To the extent Medicare gets more involved with actual covering more of these at-home costs that are very real for people, I think that would be a wonderful addition to Medicare.â\u0080\u009d Also see: Medicare administrator Verma said to have paid private consultants nearly $6 million in taxpayer money for personal image-building campaign Jay Newton-Small: â\u0080\u009cI do think Donald Trump has certainly telegraphed that if he was re-elected, he would move towards a Paul Ryan, voucher-esque kind of plan for Medicare, which you definitely would never get through a Democratic-controlled Houseâ\u0080¦ Itâ\u0080\u0099s interesting to see Biden move to the left thanks to Bernie [Sen. Bernie Sanders] and [Sen.] Elizabeth Warren in the primaries on the issue ofÂ Medicare for All. He doesnâ\u0080\u0099t support Medicare for All, but I think he has certainly moved further along than he was when the election started. That said, I know a lot of people in the caregiving world were disappointed that his only nod to caregiving was a $4,000-a-year kind ofÂ tax rebate for family caregiversâ\u0080¦ I think a lot will depend on the control of Congress. Youâ\u0080\u0099re not going to make massive changes to Medicare unless you control both houses of Congress and the White House, as Obamacare showed how hard it was to get that through.â\u0080\u009d Rich Browdie: â\u0080\u009cThereâ\u0080\u0099s a lot of ways that Medicare can be adjusted to pragmatic solutions to things weâ\u0080\u0099ve learned in this COVID experienceâ\u0080¦ So, I would think that pragmatism would lead to a number of changes in Medicare. Partially for budget reasons, because it would be cheaper; partially because I think the sensibility about coverage has changedâ\u0080¦ You may not get to universal coverage by a particular government program, but I think the pressure to keep movement toward universal coverage will continue.â\u0080\u009d Joel White: â\u0080\u009cI think if next year is a big budget year, weâ\u0080\u0099re going to see big changes in Medicareâ\u0080¦ What is interesting to me is that both presidential candidates agree that there ought to be a cap in costs in out-of-pocket expenses in Medicare Part D [the prescription drug part]. I think it would put on the table in a big budget bill a cap on total costs, whether youâ\u0080\u0099re in fee-for-service [traditional Medicare] or otherwise in the Medicare program [Medicare AdvantageÂ private insurance plans], which would be good, so youâ\u0080\u0099re limiting your out-of-pocket costsâ\u0080¦ If a big budget deal is not in the works, I think Rich is right; thereâ\u0080\u0099s going to be much more in the way of these pragmatic little problems bubbling up that weâ\u0080\u0099re going to fix and thatâ\u0080\u0099s across the board â\u0080\u0094 home health, nursing care, hospital care, physician services. The Medicare program right now is kind of in need of some tender loving care and these kinds of bills come across about once every seven years and guess what next year is â\u0080\u0094 itâ\u0080\u0099s the seventh year in the process. So, I think somethingâ\u0080\u0099s going to happen, whether itâ\u0080\u0099s big or small.â\u0080\u009d Also see: How to compare Medicare Part D plans All panelists hailed the increased use ofÂ telehealthÂ for Medicare beneficiaries during the pandemic, thanks to temporary COVID-19 rules, and hoped that many of the new policies enabling its greater use would remain permanent after the pandemic. However, some panelists voiced concerns about access to telehealth caused by the â\u0080\u009cdigital divideâ\u0080\u009d that some older adults are facing. Joel White: â\u0080\u009cI think that what we see in access is really that Black and brown communities are significantly disadvantaged here, largely because of access to broadbandâ\u0080¦ Â And so, I think we need to â\u0080¦ make telehealth available across the country: rural, suburban and urban.â\u0080\u009d Peter Kaldes: â\u0080\u009cI think telehealth is here to stay. I would echo the sentiment that the guidelines need to be made permanent.â\u0080\u009d Jay Newton-Small: â\u0080\u009cI think that telehealth is the genie that is not going to be put back in the bottle now that people have realized how convenient it is.â\u0080\u009d John Zogby: â\u0080\u009cItâ\u0080\u0099s here to stay and to expand as well.â\u0080\u009dPrescription drug prices I asked the panelists whether the ability for Congress and the president to agree to a meaningful prescription drug bill had passed this year. Jay Newton-Small: â\u0080\u009cI think it has, unless they tack it onto the larger spending bill.â\u0080\u009d (Kaldes and Browdie agreed.) But, Newton-Small added, â\u0080\u009cThere usually is a very productive lame-duck session after the presidential election as they clear the decks for either the next president coming in or the next term of the current president. And I would say thereâ\u0080\u0099s a potential for that if thereâ\u0080\u0099s enough bipartisan agreement. But I donâ\u0080\u0099t think before the election, unless it somehow miraculously gets piggybacked onto a COVID bill.â\u0080\u009d Joel White: â\u0080\u009cI think itâ\u0080\u0099s more likely that the president is going to issue some programs around theÂ executive orders that he signedÂ at the end of Julyâ\u0080¦The other thing that we are seeing here is that drug prices are actually down; they were negative last year, at 1.7% this year, a full percentage and a half point lower than they were under President Obama so I think a lot of the political desire to go after the drug companies has dried up.â\u0080\u009dThe aging policy change theyâ\u0080\u0099d most like to see One of the more interesting questions during the webinar was posed by an audience member who asked what the panelists thought the top aging-related policy change should be, whoeverâ\u0080\u0099s elected president. The responses: White and Zogby called for expanded intergenerational mentoring programs. Browdie wanted to see the age for Medicare eligibility lowered from 65 to 60, which Biden has proposed. Kaldes hoped for greater enforcement ofÂ age discrimination employment laws. Newton-Small favored increased reimbursement for home health care under Medicare. I found it interesting that none of the panelists talked about long-term care and long-term services and supports as election issues. This may suggest that the biggest financial liability issue facing boomers may not yet be seen as a political imperative issue. No panelist was willing to give a definite answer as to who they thought would win the presidential election. Time, as pundits like to say, will tell. Clearly the realities of 2021 will ensure the next Panel of Pundits will have plenty to discuss. Bob Blancato is national coordinator of the Elder Justice Coalition, a national advocacy voice supporting elder justice in America, and president of Matz Blancato and Associates. He is a 2016 Next Avenue Influencer in Aging and winner of the American Society on Agingâ\u0080\u0099s 2020 Hall of Fame Award. This article is reprinted by permission from NextAvenue.org, Â© 2020 Twin Cities Public Television, Inc. All rights reserved."}]}