{"article": [{"url": "https://www.marketwatch.com/story/as-cases-surge-in-us-rural-areas-seeing-increases-as-well-2020-06-27", "published": 1593353960.0, "headline": "As cases surge in U.S., rural areas seeing increases as well", "body": "For many states and counties in the U.S., the dark days of the coronavirus pandemic in April unfolded on their television screens, not on their doorsteps, but now, some places that appeared to have avoided the worst are seeing surges of infections, as worries shift from major cities to rural areas. While much of the focus of concerns that the United States is experiencing a dangerous second wave has been on big Sunbelt states that are reporting thousands of new cases a day — like Texas and Florida — the worrying trend is also happening in places like Kansas, where livestock outnumber people. In early June, Kansas looked to be bringing its outbreak under control, but its daily reported case numbers have more than doubled in recent weeks. On June 5, the seven-day average for daily new cases hovered at around 96; by Friday, that figure was 211. The spike convinced Kansas City Mayor Quinton Lucas to order employees and patrons of businesses to wear masks, when 6 feet of separation isn’t possible — making official something the city had been recommending for a while. “Case numbers in Kansas City continue to rise, and we are taking all steps we can to ensure public health and safety,” he said Friday. Idaho and Oklahoma have seen similarly large percentage increases, albeit from low starting points. In Oklahoma, the seven-day average for daily new cases climbed from about 81 on June 5 to 376 on Friday, three weeks later. During the same period, Idaho’s average jumped from around 40 to 160. Many rural counties in states including California, Arkansas, Missouri, Kansas, Texas and Florida have seen their confirmed cases more than double in a week, from June 19 to Friday, according to data compiled by Johns Hopkins University. Lassen County, California, went from just nine cases to 172, and Hot Spring County, Arkansas, went from 46 cases to 415; both spikes were attributed to outbreaks at prisons. Cases in McDonald County, Missouri, more than tripled after Tyson Foods conducted facility-wide testing at a chicken plant there. The daily number of confirmed infections in the U.S. surged to an all-time high of 45,300 on Friday, eclipsing the high of 40,000 set the previous day, according to Johns Hopkins. While the rise partly reflects expanded testing, experts say there is ample evidence the scourge is making a comeback, including rising deaths and hospitalizations in parts of the country and higher percentages of virus tests coming back positive. Deaths are running at about 600 per day, down from a peak of around 2,200 in mid-April. Some experts have expressed doubt that deaths will return to that level because of advances in treatment and because many infections are happening in younger adults, who are more likely than older ones to survive. The virus is blamed for about 125,000 deaths and nearly 2.5 million confirmed infections nationwide in the U.S., by Johns Hopkins’ count. But health officials believe the true number of infections is about 10 times higher. Worldwide, the virus has claimed close to a half-million lives with nearly 10 million cases. The resurgence in the U.S. has drawn concern from abroad. The European Union seems almost certain to bar Americans in the short term from entering the bloc, which is currently drawing up new travel rules, EU diplomats confirmed Saturday. But the U.S. is not alone. German Chancellor Angela Merkel cautioned Saturday that the coronavirus pandemic is far from over. India reported more than 18,000 new cases, pushing its cumulative total over the half-million mark, the fourth highest globally behind the U.S., Brazil and Russia. German authorities renewed a lockdown in a western region of about 500,000 people in the past week after about 1,300 slaughterhouse workers tested positive for COVID-19, in an attempt to prevent the outbreak from spreading across the area. “The risk posed by the virus is still serious,” Merkel said. “It’s easy to forget because Germany has gotten through the crisis well so far, but that doesn’t mean we are protected, that the risk has been averted; that is not the case, as is demonstrated by these regional outbreaks.” Elsewhere, Egypt and Britain said they would ease virus controls, while China and South Korea battled smaller outbreaks in their capitals. Britain was expected to scrap a 14-day quarantine requirement for people returning from abroad in a bid to make summer vacation travel possible. Only travelers from “red’’ zones, places with a high level of COVID-19, will be told to self-isolate. A full list of countries is due to be published next week. Egypt on Saturday lifted many restrictions put in place against the coronavirus pandemic, reopening cafes, clubs, gyms and theaters after more than three months of closure, despite a continued upward trend in new infections. Authorities in other countries were taking a more cautious approach, with the Indian city of Gauhati, the capital of Assam state, announcing a new two-week lockdown starting Monday, with night curfews and weekend lockdowns in the rest of the state. India’s death toll has reached 15,685. China saw an uptick in cases, one day after authorities said they expect an outbreak in Beijing to be brought under control in the near future. The National Health Commission reported 17 new cases in the nation’s capital, the most in a week, among 21 nationwide. South Korea, where a resurgence in the past month threatens to erase the country’s earlier success, reported 51 new cases, including 35 in the Seoul metropolitan area. Officials, worried about the fragile economy, have resisted calls to reimpose restrictions eased in April. Australia braced for more imported cases as citizens return home. About 300 people were due to arrive this weekend from Mumbai, India, with others expected to follow from South America and Indonesia. One state heath official said he is preparing for 5% to 10% of the returnees to be infected. ___"}]}