{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-tick-lower-as-coronavirus-worries-hang-over-investors-2020-06-22", "published": 1592843480.0, "headline": "Treasury yields strain for direction as coronavirus worries hang over investors", "body": "U.S. Treasury yields held their ground on Monday as investors closely watch developments on the COVID-19 pandemic, amid signs the number of infections across the U.S. is picking up.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 0.8 basis point to 0.704%, while the 2-year note rate TMUBMUSD02Y, 0.156% was up 0.6 basis point to 0.192%. The 30-year bond yield TMUBMUSD30Y, 1.576% fell 0.8 basis point to 1.461%. Bond prices move inversely to yields.What’s driving Treasurys? The World Health Organization reported around 180,000 new coronavirus cases on Sunday, the single-largest increase since the pandemic began, with two thirds of new cases coming from the Americas. Around half of the 50 U.S. states were also reporting a rise in new coronavirus cases, threatening to undo the months of progress made through harsh lockdown measures used to stem the coronavirus’ spread. The worrisome developments on the medical front helped to keep the 10-year note yield anchored near 0.70%, even as risk assets gained on Monday, a move that would usually weigh on haven assets like government bonds. See: Stock-market’s rally threatened by shroud of uncertainty as fresh coronavirus threats to economic recovery emerge On the economic front, the Chicago Fed’s national activity index rebounded to a reading of 2.61 in May from a revised minus 17.89 in April. A number above a zero value for the index indicates that the U.S. economy is expanding beyond its historical trend rate of growth. Existing home sales fell 9.7% compared with April, to a seasonally adjusted annualized rate of 3.91 million units, according to the National Association of Realtors.What did market participants’ say? “In the week ahead, investors will be offered the first glimpse of summertime trading in a pandemic. Historically the summer months are characterized by limited conviction and low volumes, the COVID-19 outbreak challenges this typical pattern and we’ll be curious to learn just how closely the mid-year point conforms to prior episodes,” said Ian Lyngen, head of U.S. rates strategy at BMO Capital Markets."}]}