{"article": [{"url": "https://www.marketwatch.com/story/retirees-are-working-harder-just-to-avoid-falling-behind-2020-09-02", "published": 1599137120.0, "headline": "How retirees should invest in a time of record-low interest rates", "body": "Retirees these days are caught on a treadmill. Their retirement portfolios have become addicted to low and declining interest rates, both to preserve and possibly increase the value of their bondholdings but also to keep the stock bull market chugging along. Yet those ever-lower interest rates mean that it now takes more money to purchase the same retirement standard of living. In other words, retirees are running harder just to stay even. One way of appreciating this treadmill is to focus on how much less of an annuity you can purchase today with $100,000 than you could have 10 or 20 years ago. This is illustrated in the accompanying chart, which plots the monthly annuity payout that a single 65-year old male could have purchased with $100,000. Two decades ago, that $100,000 could have purchased a guaranteed lifetime income of $650 a month. With $100,000 today, in contrast, you can only purchase a guaranteed monthly payment of $465. The chart also plots the yield on triple-A rated corporate bonds. Notice the striking correlation with annuity payout rates. Vincent Deluard, head of global macro strategy at investment firm StoneX, refers to this as a “death loop”: Retirees “need lower rates so that equities keep rising despite the lack of healthy economic growth. At the same time, lower yields…prevent them from having any hope of meeting their return targets.” How can retirees get off this treadmill? The only solution I can see is to take some money off the table, so to speak. And I don’t just mean lowering your equity exposure; I also mean reducing your bond exposure as well. That’s because both asset classes are stuck on this same treadmill. I suggest you consider buying an annuity with some of the proceeds of lowering your equity and fixed-income exposures. That might seem surprising, given the above chart, but there are at least two compelling reasons to nevertheless consider one: • This treadmill can’t last forever, even if it can continue a while longer. As Deluard puts it, “I am entirely certain that the system is unsustainable over the long-term…Although I cannot predict when, I am certain that the gods of math and reality will eventually punish the mistaken disciples of the bull market cult.” If the market were to fall from here, the annuity you could purchase would be even less attractive than the one you could buy today. • In any case, you shouldn’t exaggerate the extent to which today’s annuity payout rates are less attractive than they were two decades ago. That’s because, after adjusting for inflation and prevailing interest rates, the situation isn’t as bad as it seems. Consider the net present value, or NPV, of the annuity payouts that my hypothetical 65-year old single male is able to purchase with $100,000, assuming his life expectancy is equal to what the Social Security Administration assumes is average for his age and gender, and using the triple-A rated corporate bond yield as the discount rate. On those assumptions, the annuity he could have purchased at the beginning of 2003 had a NPV of $77,702; the NPV of the comparable annuity purchased today is $73,188. How much of your retirement portfolio should you allocate to an annuity? Some retirement analysts recommend about one-third. For example, David Blanchett, head of retirement research at Morningstar, analyzed 78,000 possible retirement scenarios based on different assumptions about the markets’ rates of return, life expectancies, varying allocations to an annuity, and so forth. In each case, he calculated the annuity allocation that would have produced the best outcome for the retiree. On average, he found, that the optimal allocation was 30.52%. It should go without saying, but I’ll say it nonetheless: You should exercise great care in choosing the correct annuity product. There are many different annuity products, and comparing them can be hopelessly complex. Some come with excessive fees. By all means you should consult with a qualified financial planner who is skilled in analyzing the pluses and minuses of each bell and whistle. What if you hate the idea of reducing your equity exposure and thereby forfeiting the gain you would realize if the stock market continues to rise ever further? There is an annuity product that at least partially responds to this fear of missing out. Known as a Fixed Income Annuity (FIA), such an annuity never goes down in value but returns a percentage of the market’s gain in those years in which it rises. As always, the devil is in the details. I devoted a column in early April to some of those details, and I refer you to it for a more complete discussion. To repeat, furthermore, make sure you discuss the possibilities with a qualified financial planner. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com."}]}