{"article": [{"url": "https://www.marketwatch.com/story/can-your-employer-require-you-to-take-a-covid-19-vaccine-11601962262", "published": 1602226400.0, "headline": "Can your employer require you to take a COVID-19 vaccine?", "body": "Seven vaccine candidates in the U.S. are in the clinical-trial phase with human participants. (Photo: Henry Ford Health System/Agence France-Presse/Getty Images.) Your employer might be well within its rights to impose a mandatory COVID-19 vaccination policy — but it’s far more likely to try promoting and facilitating worker immunization before wielding that power, legal experts say. A safe, effective COVID-19 vaccine has not yet been approved. Seven vaccine candidates in the U.S. are in the clinical-trial phase with human participants, including four candidates — AstraZeneca AZN, +1.16% in partnership with the University of Oxford, BioNTech BNTX, +1.23% and partner Pfizer PFE, -0.27%, Moderna MRNA, +0.09% and Johnson & Johnson JNJ, +1.39% — that are in Phase 3 clinical trials, the final and most critical stage. Meanwhile, a declining share of people have expressed intent to take a coronavirus vaccine. Just 51% of U.S. adults say they would “probably” or “definitely” get a COVID-19 vaccine if it were available to them today, according to a Pew Research Center survey conducted Sept. 8 to Sept. 13 — a 21-percentage point drop from May. Three in four respondents said it was “somewhat” or “very” likely that a vaccine would be used before its safety and effectiveness were fully understood. As employers seek to reopen brick-and-mortar workplaces and restore some semblance of normalcy, they may wonder whether it makes sense to mandate coronavirus vaccinations to protect employees’ and customers’ health, and reduce the likelihood of transmission on the job. Randi Weingarten, the head of the American Federation of Teachers, recently told Axios that her union would support the notion of school districts requiring teachers to take a Food and Drug Administration-approved COVID-19 vaccine in order to teach in schools, “just like we have vaccines that we require kids to take to be in school in normal times.”‘Constitutional restrictions simply do not apply to private employers’ So is your employer even allowed to mandate that you receive a COVID-19 vaccine before returning to a physical workplace? “The short answer is yes,” Debbie Kaminer, a law professor at Baruch College’s Zicklin School of Business, told MarketWatch. “Employers have significantly more freedom when it’s an employer just enacting its own policy, and it’s not a government-mandated policy — because constitutional restrictions simply do not apply to private employers.” Sahar Aziz, a professor at Rutgers Law School, agreed. “Legally, it will be difficult for you to refuse to take it, and still be able to go to work to that particular job,” absent any government action, she said. But employers can’t mandate a vaccine across the board, she added: There must be accommodations for employees based on medical or religious exemptions under anti-discrimination laws. “ The Commission ‘is actively evaluating how a potential vaccine would interact with employers’ obligations under the Americans with Disabilities Act, Title VII of the Civil Rights Act of 1964, and the other laws the Commission enforces.’ ” — EEOC spokesperson Workers with legitimate medical concerns about taking the vaccine could seek an exemption under the Americans with Disabilities Act, which requires employers to provide reasonable accommodations to employees with disabilities absent “undue hardship” such as significant expense or difficulty. And those with “sincerely held” religious beliefs might be able to get an accommodation under Title VII of the Civil Rights Act, said Barry Hartstein, co-chair of the EEO & Diversity Practice Group at the employment law firm Littler. The bottom line, according to Hartstein: “Could employers mandate it? Yes. Would it be illegal? No, with the exceptions of potential accommodations on religious or ADA grounds.” Reached for comment, Equal Employment Opportunity Commission spokesperson Christine Saah Nazer referred MarketWatch to the agency’s pandemic-preparedness guidance issued in response to the 2009 H1N1 pandemic, which underscores the fact that an employee might be entitled to exemptions based on an ADA disability or a “sincerely held religious belief, practice or observance.” “Generally, ADA-covered employers should consider simply encouraging employees to get the influenza vaccine rather than requiring them to take it,” the document says. Nazer added in an email: “The Commission continues to closely monitor the developments of a COVID-19 vaccine and is actively evaluating how a potential vaccine would interact with employers’ obligations under the Americans with Disabilities Act, Title VII of the Civil Rights Act of 1964, and the other laws the Commission enforces.” Kaminer, for her part, suggested that religious exemptions were unlikely to be required in this case. “Under federal law, employers do not need to accommodate religious employees (which would include a religious exemption from a mandatory vaccination policy) if an accommodation would result in a greater than ‘de minimis’ [minimal] cost,” she explained in an email. “Some states require a higher level of accommodation, typically defining undue hardship under their state religious accommodation statutes as ‘significant difficulty or expense.’” “Regardless of whether the standard is ‘de minimis’ or ‘significant difficulty and expense,’ in the midst of one of the worst public-health crises in the last century, with its severe health, educational and economic implications, mandatory vaccination policies without religious exemptions should meet this burden,” Kaminer said.‘This is new terrain’ An employer could fire an employee who refused to comply with a mandatory vaccination policy if there were no reasonable accommodation requested or needed, said employment lawyer and human-resources consultant Kate Bischoff. But would union membership protect an employee from having to follow a vaccine requirement — or, for that matter, from being fired for not complying with one? “Maybe,” Bischoff said. “An employer would have to negotiate with the union as this would be a mandatory subject of bargaining, but a union is unlikely to get in the way of this kind of safety issue.” In the event that employees challenge a COVID-19 vaccine mandate in court, judges may be more likely than usual to side with workers over employers given potential safety concerns surrounding a novel vaccine, Aziz said. After all, she said, “this is new terrain.” “I think judges will be more sympathetic to at least the evidence that an employee would bring to argue, ‘This is not safe; it should be illegal to require me to be vaccinated’ — which is a distinction from the flu vaccine, which has been around for decades,” she said. “ ‘I suspect most employers are going to start with the voluntary-encouragement route, facilitating free and convenient vaccinations.’ ” — Sahar Aziz, a professor at Rutgers Law School A vaccine mandate could make more sense in certain workplaces Several states mandate that workers in health-care and long-term care facilities get vaccinated against influenza and other vaccine-preventable diseases. Health-care facilities often require that their employees get vaccinated, Kaminer added. “Prior to the pandemic, [a vaccine mandate] was really pretty much limited to health-care facilities and nursing homes — but it’s like it’s a different world now,” Kaminer said. A COVID-19 vaccine mandate might make more sense in certain environments that present high risk for virus transmission, such as a meatpacking plant, a crowded bar or a health-care facility, than it would in a workplace with few employees who can be safely spaced apart, Kaminer said. The question of whether to mandate the vaccine would come down to a cost-benefit analysis, she added. Carlos del Rio, an infectious-disease expert at Emory University who is involved in Moderna’s vaccine trials, agreed that the type of employment would play a role in determining whether workers should be required to be vaccinated. He noted that “immunization rates go up when you mandate it.” “Assuming that the vaccine has good efficacy, I would prefer a mandate in the situations where you want to vaccinate,” he said. “Then you have less excuses, less possibility for people to not accept the recommendation.”Employers are unlikely to go the mandatory route Most employers are likely to be flexible on COVID-19 vaccination in the interest of avoiding conflict within the company, bad publicity and potential litigation, Aziz said, especially if employees are able to work remotely. She predicted companies would “try the path of least resistance” before resorting to a mandate. To that end, employers might make the vaccine free for employees, offer vaccinations at work to reduce inconvenience, and/or educate employees about the vaccine to promote voluntary vaccination, she said. “I suspect most employers are going to start with the voluntary-encouragement route, facilitating free and convenient vaccinations,” Aziz said, adding that they could shift to mandating the vaccine if the workplace or surrounding community wasn’t getting vaccinated at the desired rates. Employers may also be hoping the government will “decide for them” and move to mandate a vaccine, Aziz added. State and local governments have mandated vaccines in the past. Anthony Fauci, the longtime National Institute of Allergy and Infectious Diseases director and the federal government’s top infectious-disease doctor, told Healthline in a recent interview that he didn’t think the government would “ever” mandate a vaccine for the general public. “I’d be pretty surprised if you mandated it for any element of the general public,” he said, noting that medical facilities may require workers to get vaccinated before interacting with patients. “You cannot force someone to take a vaccine.”A vaccine won’t be a magic bullet Employers should suggest and recommend a vaccine but not mandate it, Hartstein said, given the uncertainty over potential long-term side effects. “There’s still a lot up in the air because we don’t have a vaccine; we don’t know how it will work, whether you need to get one shot or two shots,” Bischoff added. “Until we’re to that point, this is all a fun critical-thinking game.” In addition to gauging whether the vaccine is useful and effective, we will also need to understand more about the disease and its immunology, including what happens to people who have already had COVID-19, del Rio added. A vaccine will be critical in “helping us get out of this mess,” but it won’t be the only solution, del Rio said: Masking and social distancing will still be necessary for some period of time until 60% to 70% of the population has been immunized or developed antibodies from the virus. “But the sooner we immunize people,” he added, “the better off we’re going to be.”"}]}