{"article": [{"url": "https://www.marketwatch.com/story/nikola-stock-falls-7-after-electric-vehicle-makers-wider-q2-loss-2020-08-04", "published": 1596618860.0, "headline": "Nikola stock falls 12% after pandemic-related supply-chain disruptions", "body": "Nikola Corp. shares fell more than 12% in premarket trading Wednesday after the electric-vehicle maker reported a second-quarter loss that was wider than Wall Street expected and said that the COVID-19 pandemic disrupted its supply chain. Nikola NKLA, -1.36% said Tuesday afternoon that it lost $86.6 million, or 33 cents a share, in the quarter, compared with a loss of $16.8 million, or 6 cents a share, in the year-ago period. Adjusted for one-time items, Nikola lost 16 cents a share in the quarter. Analysts polled by FactSet had expected Nikola to post a GAAP loss of 13 cents a share on no revenue. Related:Chinese electric-car maker Li Auto soars 50% post-IPO “The global pandemic caused disruption in Nikola’s supply chain, but mitigation efforts are underway to reduce the resulting risk to production timelines,” the company said in a statement. “At this time, we believe Nikola’s long-term objectives will be materially unaffected by COVID-19.” Nikola said its Nikola Tre, a hydrogen-powered long-haul truck, is on track to start production in the fourth quarter of 2021. The first few units will be produced at Nikola’s Germany factory, which is undergoing modifications. Once complete, this facility will be capable of producing up to 10,000 units a year, Nikola said. In addition to the buildout in Germany, Nikola said it broke ground on July 23 on a manufacturing facility in Coolidge, Ariz. “Once completed, the Coolidge manufacturing facility will be capable of producing up to 35,000 trucks per year at full capacity on two shifts. Phase one of this construction is expected to be complete by Q4 2021,” the company said. Nikola went public in June, and shares doubled shortly after. Within days, Tesla Inc. TSLA, +1.89% Chief Executive Elon Musk was urging his company to “go all out” with the Tesla Semi, the Silicon Valley auto maker’s long-haul electric truck, expected to be available in 2021. See also:Nikola on road to ‘disrupt transportation,’ JP Morgan says Nikola’s popularity is also part of a wave of IPOs through a special purpose acquisition corporation, or SPAC, also called blank-check companies. Electric-car maker Fisker Inc. also chose to go public through a SPAC. Shares of Nikola have gained 273% this year, compared with gains around 2% for the S&P 500 SPX, +0.87% and contrasting with a loss around 6% for the Dow Jones Industrial Average. DJIA, +0.56% ."}]}