{"article": [{"url": "https://www.marketwatch.com/story/as-covid-19-cases-hit-25-million-dr-fauci-says-its-conceivable-well-know-if-theres-a-safe-vaccine-by-november-2020-08-30", "published": 1598942780.0, "headline": "Dr. Fauci: It's 'conceivable' we'll know by November if a safe, effective vaccine is coming", "body": "How much longer until there's a safe, effective vaccine? Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases and an expert in infectious diseases for the last four decades, said this weekend: \"The way the pace of the enrollment is going on and the level of the infections that are going on in the United States, it is likely that we'll get an answer by the end of the year.\" “ 'The way the pace of the enrollment is going on and the level of the infections that are going on in the United States, it is likely that we'll get an answer by the end of the year. It is conceivable that we would get an answer before that. ” - Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases He added: \"It is conceivable that we would get an answer before that.\" In the meantime, cases keep rising in the U.S. with California becoming the first state in the country to surpass 700,000 confirmed cases; infections there hit 712,475 as of Tuesday with 13,022 COVID-related deaths. New York has recorded 434,756 infections and the highest number of deaths in the U.S. (32,957). COVID has killed 183,598 people in the U.S. \"I would say a safe bet is at least knowing that you have a safe and effective vaccine by November, December,\" he told the Times newspaper in the U.K. He declined to comment on what vaccine could be a front-runner, but added, \"I would not be satisfied until a vaccine was proven to be safe and effective, before it was actually approved for general use.\" But Fauci cautioned against rushing a vaccine for political purposes without first knowing it was safe. At the mostly online Republican National Convention, President Donald Trump said, \"We are delivering lifesaving therapies, and will produce a vaccine before the end of the year, or maybe even sooner. We will defeat the virus, end the pandemic, and emerge stronger than ever before.\" The president's convention address appeared to somewhat accelerate the timeline laid out by \"Operation Warp Speed,\" his administration's effort to financially support the rapid development, manufacturing and distribution of a COVID-19 vaccines, therapeutics and diagnostics. Under that program, the administration says it aims to have initial vaccine doses available by January 2021. As of Tuesday, COVID-19 has infected over 25 million people worldwide, which mostly does not account for asymptomatic cases, and killed 850,605. The U.S. still has the world's highest number of COVID-19 cases (6,031,013), followed by Brazil (3,908,272), India (3,691,166) and Russia (992,402), according to data aggregated by Johns Hopkins University. AstraZeneca AZN, +1.16%, in combination with Oxford University; BioNTech SE BNTX, +1.23% and partner Pfizer PFE, -0.27% ; GlaxoSmithKline GSK, +1.10% Johnson & Johnson JNJ, +1.39% ; Merck & Co. MERK, +1.59% ; Moderna MRNA, +0.09% ; and Sanofi SAN, -1.48% are among those currently working toward COVID-19 vaccines. Also see:Sweden embraced herd immunity, while the U.K. abandoned the idea - so why do they both have high COVID-19 fatality rates? In a separate interview with the \"Colors\" podcast on Friday, Fauci said it was imperative to enroll a diverse number of people in a vaccine to ensure that it is safe and effective for everyone, and said that coronavirus has shed \"very bright light\" on the disparities in the U.S. health-care system. Even post-vaccine, he said something needed to be done about those disparities. “ 'The likelihood that African Americans will get infected versus whites or others and - when and if they do get infected - the likelihood of their getting a serious outcome more so than whites. The answer is unfortunately, 'Yes,' to both.' ” - Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases \"There are two elements that need to be clarified,\" Fauci told the podcast's hosts J.J. Green and Chris Core. \"One: The likelihood that African Americans will get infected versus whites or others and - when and if they do get infected - the likelihood of their getting a serious outcome more so than whites. The answer is unfortunately, 'Yes,' to both.\" He said, \"You want to show that it is safe and effective in all elements of society. If we don't get African Americans and Latinx and Asian Americans and Native Americans, if we don't get them properly represented in the proportion of those that are in the trial, we will not know for sure - although you can assume it, but you want to prove it - that it is safe and effective in that group.\" But experts caution that a vaccine is unlikely to provide 100% immunity to the population. Aside from social distancing and masks, Fauci previously said that aiming for 100% herd immunity - as Sweden attempted - instead of closing schools and businesses to flatten the curve of new cases of COVID-19, would have dire consequences for the American people. Anders Tegnell, the Swedish epidemiologist who masterminded the plan, admitted the country made a mistake. \"If we were to encounter the same illness with the same knowledge that we have today, I think our response would land somewhere in between what Sweden did and what the rest of the world has done,\" he said in June when the country hit the highest death rate in Europe. Countries like South Korea, New Zealand and China - where the virus is believed to have originated in a food market in Wuhan late last year - appear to have had more success in beating back COVID-19. Earlier this week, for example, New Zealand moved fast to lock down Auckland after the return of COVID after 102 days of reporting no new infections. The Dow Jones Industrial Index DJIA, +0.56% and the S&P 500 SPX, +0.87% ended lower Monday, while the Nasdaq Composite COMP, +1.39% clinched another record close. Over the past five months, the Dow's advanced 29.7%, its biggest 5-month percent gain since July 2009, while the S&P 500 added 35.4%, its best 5-month run since October 1938."}]}