{"article": [{"url": "https://www.marketwatch.com/story/tesla-takes-advantage-of-stocks-best-month-in-7-years-with-5-billion-offering-2020-09-01", "published": 1598978420.0, "headline": "Tesla takes advantage of stockâ\u0080\u0099s best month in 7 years with $5 billion offering", "body": "Shares of Tesla Inc. were knocked lower Tuesday, as the electric vehicle manufacturer took advantage of the stockâ\u0080\u0099s best monthly performance in seven years to raise more capital. Tesla disclosed in an 8-K filing with the Securities and Exchange Commission before Tuesdayâ\u0080\u0099s opening bell that it entered into an â\u0080\u009cequity distribution agreementâ\u0080\u009d with a host of Wall Street firms to raise up to $5 billion by selling shares from time to time, through an â\u0080\u009cat-the-marketâ\u0080\u009d program. Based on Mondayâ\u0080\u0099s stock closing price of $498.32, that amount represented about 10.03 million shares, or about 1.1% of the shares outstanding. The stock TSLA, +1.89% Â slumped 4.7% to $475.05 in active trading Tuesday, but pared earlier losses of as much as 5.6%. It was up as much as much as 7.9% in the premarket session just minutes before the offering was disclosed. Trading volume was 89.1 million shares, compared with a full-day average of about 74.5 million and enough to make it the second-most active stock listed on the Nasdaq exchange, according to FactSet. FactSet, MarketWatch The share offering comes after Teslaâ\u0080\u0099s stock soared 12.6% on Monday after a 5-for-1 stock split took effect, extending the stockâ\u0080\u0099s 74.2% rocket ride in August. That was the stockâ\u0080\u0099s best monthly performance since it soared 81.1% in May 2013, and the second-best monthly performance since Tesla went public in June 2010. Donâ\u0080\u0099t miss: Tesla stock rally accelerates further into record territory after split takes effect. The rally has lifted Teslaâ\u0080\u0099s market capitalization to $464.3 billion as of Mondayâ\u0080\u0099s closing price, making Tesla the seventh most valuable U.S. company. It has also made Chief Executive Elon Musk, Teslaâ\u0080\u0099s largest shareholder about 34.1 million shares, the third richest person in the world, according to the Bloomberg Billionaires Index. The sales agents in the equity distribution agreement were Goldman Sachs & Co., BofA Securities, Barclays Capital, Citigroup Global Markets, Deutsche Bank Securities, Morgan Stanley, Credit Suisse Securities (USA), SG Americas Securities, Wells Fargo Securities and BNP Paribas Securities. The sales agents will receive a commission of up to 0.5% of the proceeds from each sale of shares. The agreement can terminate the distribution agreement at any time, for any reason. Wedbush analyst Dan Ives was upbeat about Teslaâ\u0080\u0099s stock offering, but kept his rating on the stock at neutral and his stock price target at $380, which was about 24% below Mondayâ\u0080\u0099s closing price. Meanwhile, Ivesâ\u0080\u0099s â\u0080\u009cbull caseâ\u0080\u009d target of $700 suggests a further 40% gain was possible. â\u0080\u009cWe believe this is the smart move at the right time for Musk & Co. after the parabolic rally in shares with the appetite strong among investors to play the transformational EV trend through pure play Tesla over the coming years,â\u0080\u009d Ives wrote in a note to clients. Ives has been neutral on Tesla since April 2019. Teslaâ\u0080\u0099s stock has run up nearly sixfold (up 468%) year to date. In comparison, China-based EV maker Nio Inc. shares NIO, +0.14% Â have soared 401% and EV van maker Workhorse Group Inc.â\u0080\u0099s stock WKHS, +12.62% Â has rallied 563%, while the S&P 500 index SPX, +0.87% Â has gained 9.2%."}]}