{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-case-tally-passes-2-million-mark-and-21-states-are-still-seeing-increases-in-infections-2020-06-11", "published": 1591887020.0, "headline": "Coronavirus update: U.S. case tally passes 2 million mark and 21 states are still seeing increases in infections", "body": "The number of U.S. cases of the coronavirus illness COVID-19 marked a grim milestone of more than 2 million on Thursday, and cases continued to climb in 21 states, even as they push ahead with reopening economies after lockdowns and restrictions on movement. The increasing rate of new infections in states, including California, Texas and Florida is raising fears of a second wave breaking out just as business activity is resuming. The stock market, which has seemed resilient to much of the bad news on the virus, cratered after the latest jobless claims data showed more than 47 million people have sought benefits since the start of the outbreak. Treasury Secretary Steven Mnuchin told CNBC that shutting the economy for a second time is not a viable option. President Donald Trump, meanwhile, announced he will resume holding election rallies with the first in Tulsa, Oklahoma on June 19th and is not expected to require that attendees practice social distancing. Critics echoed the concerns of public-health experts that Americans will suffer unnecessary hardship and deaths if reopening continues to spread the virus. Dr. Anthony Fauci, head of the National Institute of Allergy and Infectious Disease, said the pandemic is not over yet and described it as his worst nightmare after it took a single month to span the globe. Read now: Fauci calls pandemic his ‘worst nightmare,’ warns ‘it isn’t over yet’ “After months of failing to respond quickly or effectively to the COVID-19 crisis, the Trump administration appears to be trying out a new strategy: pretending the pandemic is over,” said Kyle Herrig, president of nonpartisan watchdog Accountable.US in a statement. “The problem is, that won’t stop the virus from spreading — nor will it help the millions of Americans struggling to make rent and put food on the table as the economy continues to struggle. “People’s lives are on the line — we need Trump to treat this pandemic with the seriousness it deserves and help keep the American people safe.” Read:Yes, America needs to brace itself for a second wave of coronavirus All 50 states are in the process of reopening and some are even starting to allow visits to nursing home residents, about three months after they were stopped to avoid spreading the virus. West Virginia is allowing visitation by appointment from June 17, if the nursing home has had no cases of COVID-19 for at least the past 14 days. Massachusetts and Indiana, for example, already allow visits, only outside, and Ohio this week began allowing visits in assisted-living and intermediate-care facilities. In many other states, families often resort to visits through windows. Nursing home residents accounted for at least a quarter of the more than 113,000 Americans who have lost their lives to the pandemic, according to data compiled by the Centers for Medicare and Medicaid Services and the Centers for Disease Control and Prevention. Some 60,000 cases of illness have been reported, and nearly 26,000 of those residents died. Managing their reopening is viewed as a major test, ahead of the reopening of schools later in the year. For more, read: U.S. states slowly reopen after coronavirus lockdowns with visits to nursing homes permitted now See also:Arizona hospitals at 83% capacity as coronavirus cases surgeLatest tallies There are now 7.43 million confirmed cases of COVID-19 worldwide and at least 418,052 people have died, according to data aggregated by Johns Hopkins University. At least 3.5 million people have recovered. The U.S. has the highest case toll in the world at 2.0 million and the highest death toll at 113,209. Brazil has 772,416 cases and 39,680 fatalities, the data show. Brazil, which stopped updating its official numbers at the weekend, has resumed its updating of its numbers after a Supreme Court judge ordered the government to do so. Russia has topped 500,000 cases after a spike overnight. It now has 501,800 cases and 6,522 fatalities. The U.K. has 292,854 cases and 41,364 deaths, the highest death toll in Europe and second highest in the world after the U.S. India now has 286,577 cases and 8,102 deaths. Two early hot spots, Spain has 242,707 cases and 27,136 deaths, while Italy has 236,142 cases and 34,167 deaths. Read: Locals reclaim Madrid as their city while waiting for the tourists to return Peru, France Germany, Iran, Turkey Chile, Mexico, Pakistan, Saudi Arabia and Canada are next and all ahead of China, where the illness was first reported late last year. China has 84,210 cases and 4,638 deaths. What’s the latest medical news? Moderna Inc. MRNA, +0.09% said it has finalized the Phase 3 study protocol for its COVID-19 vaccine candidate, although the Phase 2 trial, which began dosing patients less than two weeks ago, has not been completed. Moderna has previously said it expects the experimental vaccine to move into Phase 3 trials in July if it is successful in the mid-stage study. The plans for the Phase 3 trial include a randomized, placebo-controlled study with about 30,000 participants in the U.S. The primary endpoint will test whether a 100 microgram dose of the investigational vaccine prevents symptomatic COVID-19 disease, and secondary endpoints will evaluate if the vaccine candidate can prevent severe forms of COVID-19 and infection from the virus at all. Moderna is ahead of the pack of drug companies and biotechs attempting to develop a COVID-19 vaccine. It’s July trial is expected to be followed in August by a vaccine that is being co-developed by Oxford University and U.K. drug maker AstraZeneca AZN, +1.16%. In September, Johnson & Johnson JNJ, +1.39% will launch a trial involving its vaccine candidate. In other medical news, Regeneron Pharmaceuticals Inc. REGN, +0.36% said it started a Phase 1 clinical trial testing its experimental antibody cocktail aimed at both preventing and treating COVID-19. Regeneron plans to test the therapy in hospitalized COVID-19 patients, COVID-19 patients who aren’t sick enough to be hospitalized, individuals who are at high risk of contracting the virus, and people who have reported close exposure to someone who has COVID-19. What’s the economy saying? The latest Labor Department data showed the number of Americans applying for traditional jobless benefits in the latest week slowed to 1.54 million from a revised 1.9 million at the end of May. Economists polled by MarketWatch had forecast 1.6 million new claims filed the usual way through state unemployment offices. New applications for benefits have dwindled since peaking at almost 7 million in late March, but they are still extremely high. Before the pandemic paralyzed the U.S. economy in March, new claims were running in the low 200,000s and sat near a 50-year low. But more than 47 million new jobless claims have been filed since the crisis took root three months ago, an unfathomable number that shows just how much devastation COVID-19 has caused to million of Americans and the U.S. economy. However, people have been returning to work as states reopen, and there are likely duplicative claims given many state employment offices have been overwhelmed, especially early in the crisis. “The worst in the labor market appears to be over, but it is still in terrible condition from the viral recession,” said chief economist Gus Faucher of PNC Financial Services. Read now:Revisiting that funky drop in unemployment to 13.3% in May: Nobody really believes it Separately, the Labor Department said the wholesale cost of U.S. goods and services rebounded in May after three straight monthly declines. The producer price index rose 0.4% in May after a record 1.3% decline in the prior month. Economists polled by MarketWatch had predicted a 0.1% gain. See now: Consumer prices drop again as pandemic cuts rate of inflation to near zero The rate of wholesale inflation in the past year was a negative 0.8% in May, up slightly from a negative 1.2% in the prior month. Food and energy costs drove the increase. Energy costs rose 4.5% after three straight declines. Food prices gained 6%.What are companies saying? With the first-quarter earnings season now largely finished, attention has turned to the IPO market, which has come back to life after all but shutting down at the peak of the crisis. Two biotechs, Generation Bio Inc. GBIO, +0.24% and Avidity Biosciences Inc. RNA, -3.35% upsized and raised their expected price ranges on Thursday, suggesting they are seeing strong demand for their paper. The week is expected to bring eight deals in total, with the biggest of the week, that of Azek Co. AZEK, +1.24%, expected to price later Thursday, market conditions permitting, and start trading Friday. The second biggest deal of the week was online used car seller Vroom Inc. VRM, -0.26%, which started trading Tuesday after pricing above its price range and instantly doubled in value. The stock was down 7% in Thursday’s falling market, but remains 109% above its issue price. Read:Vroom stock more than doubles in first day of trading amid hopes pandemic accelerates online car buying Elsewhere, companies continued to raise capital through equity, debt or convertible debt offerings, and to offer updates on the status of reopening efforts. Here are the latest things companies have said about COVID-19: • Bloomin’ Brands Inc. BLMN, +2.69%, parent of Outback Steakhouse, detailed the same-store sales improvement as its restaurants reopen, with momentum gaining slowly at some chains. Outback Steakhouse same-store sales fell 24.7% for the week ending June 6, compared with a 24.8% decline the week before. Same-store sales at Carrabba’s Italian Grill fell 21.4% for the week ending June 6, compared with a 24.1% the week before. And Bonefish Grill same-store sales fell 40.5% for the week ending June 6, compared with a 48.6% decline the week before. As of June 7, 74% of U.S. company-owned stores, or 760 locations, have reopened with limited dine-in capacity. As of June 11, Bloomin’ Brands had $493 million in liquidity, which includes approximately $128 million of cash and $365 million from its revolving credit facility. • Children’s Place Inc. PLCE, -6.78% reported first-quarter sales that missed expectations by a wide margin. The kids clothing retailer’s online sales have soared 300%, however 95% of Children’s Place stores remain closed with most expected to be operating by July 1. The company had 61 stores open as of June 8. Children’s Place now plans to close 300 stores by the end of fiscal 2021, with 200 closures by the end of this year • Dollar Tree Inc. DLTR, +2.30% is extending a bonus-pay period through the end of June. The dollar store had announced a $2 an hour pay bump to its hourly store and distribution employees for all hours worked in the 14-week period from March 8 to June 13, the height of coronavirus-related stocking up and grocery shopping. That was estimated to cost $105 million. Dollar Tree extended that premium pay over the two-week period ending June 27, for an additional $15 million, the company said. Dollar Tree had about 56,900 full-time and 136,200 part-time employees as of Feb. 1. • Eventbrite Inc. EB, -0.09%, a ticketing platform, upsized a convertible bond offering on Thursday to $130 million from $115 million. The San Francisco-based company priced the deal at 5.000% a year. The company will grant the initial purchasers the option to purchase an additional up to $20 million to cover over-allotments. The company will use the proceeds of the deal of about $125.3 million to cover capped call transactions, that aim to reduce dilution on conversion, and for general corporate purposes. • Honeywell International Inc. HON, +0.34% and SAP SE SAP, +0.65% SAP, +0.18% on Thursday announced they are teaming on a joint cloud-based solution combining technologies to streamline business operations based on data, starting with commercial real estate. Analysts briefed on the Honeywell-SAP partnership believe it could establish a new baseline as building owners and tenants grapple with a whole new dynamic. Honeywell’s partnership with SAP is part of a dramatic pivot to an industrial-software company that has drawn comparisons to the business models of Salesforce.com Inc. CRM, +2.21% and SAP, while bolstering Honeywell’s bottom line and stock price. • Jack in the Box Inc.’s JACK, +1.37% same-store sales for the first half of its current quarter climbed 5%. The company did not provide specific reasons for the increase. Jack in the Box expects to report third-quarter results on Aug. 5 and does not expect more updates. • Keurig Dr Pepper Inc. KDP, +1.91% disclosed that Maple Holdings, its largest shareholder, plans to sell 143 million common shares of Keurig, representing about 10.2% of the shares outstanding. The company said the shares will become freely tradeable after a lock-up period. After the sale, Maple will own 52.6% of Keurig’s outstanding shares, and the public float will increase to 34.3%. • Oneok Inc. OKE, -1.22%, a natural gas services company, announced a public offering of 26 million shares of common stock, joining the many companies raising capital during the pandemic. That represents 6.3% of the shares outstanding, as of April 20. The company expects to grant the underwriters of the offering options to buy up to 3.9 million additional shares to cover overallotments. Barclays, J.P. Morgan and Citigroup are the lead book-running managers of the offering. Based on Wednesday’s stock closing price of $41.98, 26 million shares would be valued at $1.09 billion. • Oxford Industries Inc. OXM, -1.69%, owner of the Tommy Bahama and Lilly Pulitzer brands, reported quarterly results that were well below Wall Street estimates and declined to offer an outlook for 2020 because of the pandemic. “We temporarily closed all of our North American stores and restaurants on March 17 and quickly pivoted time and resources to staying connected with our customers through our e-commerce and digital platforms,” said Thomas Chubb, Oxford chairman and chief executive. The company reopened its first stores in early May and now has a little more than half of our 225 locations opened. It expects to have almost all locations open by the end of June. • Tailored Brands Inc. US:TLRD has taken “decisive actions” to manage its liquidity and requested an extension to file quarterly results because of the “disruption” caused by the pandemic. Some 44% of its stores, which include Men’s Wearhouse and Jos. A. Bank, have reopened. As of June 5, Tailored Brands had $201 million in cash and equivalents, excluding $93.5 million of restricted cash. First-quarter sales were down 60% to $286.7 million due to the pandemic. Trends such as “casualization,” online sales and digital marketing have accelerated during this time. Some of the actions taken to shore up liquidity included accessing $310 million in additional borrowings from its credit facility, cutting or deferring expenses, extending payment terms with landlords and suppliers, and furloughing salespeople. • Target Corp. TGT, +1.14% is raising its quarterly dividend by 3%, to 68 cents a share from 66 cents. The new dividend will be payable Sept. 10 to shareholders of record on Aug. 19. Based on Wednesday’s stock closing price of $120.00, the new annual dividend rate implies a dividend yield of 2.27%, which compares with the yield for the SPDR S&P Retail ETF XRT, +0.05% of 1.76% and the implied yield for the S&P 500 SPX, +0.87% of 1.80%, according to FactSet. • Terminix parent ServiceMaster Global Holdings Inc. US:SERV provided an upbeat revenue outlook for the second quarter. The pest control company expects revenue for the quarter through June of $510 million to $525 million, above the FactSet consensus of $476 million. The company expects residential pest control revenue to be flat to down slightly from last year, with COVID-19-related service postponements continuing to improve after peaking late in the first quarter. Commercial pest control revenue is expected to be down about 10% and termite and home services revenue is expected to grow 3% to 5%. • Walmart Inc.’s WMT, +1.00% Sam’s Club will make curbside pickup available at all 597 club locations by the end of June. The service is part of the Plus-level of membership, and adds to the list of perks including early shopping hours. Non-Plus members will be able to use the service at no charge for a limited time. Curbside pickup is a contactless option that had been piloted in 16 stores. Coronavirus Update: U.S. Cases Top Two Million, Stocks Drop on Fed Plans"}]}