{"article": [{"url": "https://www.marketwatch.com/story/rncs-3rd-night-pence-to-talk-up-trumps-handling-of-the-economy-coronavirus-and-foreign-policy-2020-08-26", "published": 1598485100.0, "headline": "RNC's 3rd night: Pence says Biden can't be trusted to rebuild economy, keep cities safe", "body": "Vice President Mike Pence on Wednesday night argued that Democratic presidential nominee Joe Biden can't be trusted to restore the coronavirus-battered economy or keep cities safe, as he delivered the keynote speech on the Republican National Convention's third night and accepted his party's nomination to serve as President Donald Trump's No. 2. \"On Nov. 3, you need to ask yourself: Who do you trust to rebuild this economy?\" Pence asked. \"A career politician who presided over the slowest economic recovery since the Great Depression? Or a proven leader who created the greatest economy in the world?\" \"The choice is clear: To bring America all the way back, we need four more years of President Donald Trump,\" the vice president said. In a reference to the unrest sparked by recent police killings of Black Americans, Pence said people \"don't have to choose between supporting law enforcement and standing with our African-American neighbors,\" but then claimed that Biden would cut funding for law enforcement and \"double down on the very policies that are leading to violence in America's cities.\" \"The hard truth is you won't be safe in Joe Biden's America,\" Pence said. The veteran Republican politician, who was Indiana's governor before becoming Trump's vice president, also noted that Biden has referred to himself as \"a transition candidate,\" so he \"would be nothing more than a Trojan horse for a radical left.\" Pence's remarks - made at Baltimore's Fort McHenry, known as the national anthem's birthplace - came a day before a speech from Trump serves as the grand finale for the four-day, mostly virtual convention. The president on Thursday night \"will be trumpeting his accomplishments\" and talking about what he would do in a second term if the Trump-Pence ticket wins re-election in November, according to a campaign spokesman. Ahead of Pence's speech, Biden's running mate, Kamala Harris, attacked the GOP candidates in a fundraising email sent to supporters. \"Donald Trump and Mike Pence can talk all they want about making America great again, but they can't hide from their record,\" the California senator said. \"American families are reeling from the worst public health crisis in a century, and the worst economic crisis since the Great Depression. Trump and Pence have responded with incompetence.\" Among the other speakers at the GOP event on Wednesday night were Trump adviser Kellyanne Conway, who plans to step down from her White House job by the end of the month, as well as former Notre Dame football coach Lou Holtz, South Dakota Gov. Kristi Noem, second lady Karen Pence, Rep. Dan Crenshaw of Texas and Lara Trump, the president's daughter-in-law. Related:Trump's convention breaks norms - and possibly the Hatch Act Conway praised Trump's efforts to address the opioid crisis, saying he's \"the president we need for four more years,\" as he \"picks the toughest fights and tackles the most complex problems.\" Holtz said \"one of the important reasons\" that he trusts the Republican incumbent is \"because nobody has been a stronger advocate for the unborn than President Trump,\" while the Biden-Harris ticket is \"radically pro-abortion,\" adding that they and other politicians \"are Catholics in name only.\" The speeches followed testimonials earlier in the week from a range of speakers, including Donald Trump Jr. and Nikki Haley on Monday, and first lady Melania Trump and Secretary of State Mike Pompeo on Tuesday. Biden's deputy campaign manager and communications director Kate Bedingfield criticized the GOP convention early Wednesday, casting it as \"an alternate reality.\" \"In this delusion, thousands of Americans didn't die in the last week from COVID-19, nor have millions of Americans been infected or put out of work,\" she said in a statement. Bedingfield also said Americans \"can't afford for Donald Trump to bury his head in the sand any longer,\" and the country needs \"real leadership.\" Opinion:Trump, running for re-election, is faking it on the economy and the pandemic Counterpoint:Don't count Trump out - here's how he can still win in November In RealClearPolitics averages of polls as of Wednesday, the Democratic nominee is leading Trump by 7 percentage points in nationwide surveys and by 3.7 points in key swing states that are likely to decide the November election. The main U.S. stock gauges mostly closed with gains Wednesday, with the S&P 500 SPX, +0.87% and Nasdaq Composite COMP, +1.39% finishing at fresh all-time highs."}]}