{"article": [{"url": "https://www.marketwatch.com/story/homeland-security-departments-top-two-officials-were-put-there-illegally-by-trump-concludes-government-accountability-office-2020-08-14", "published": 1597430540.0, "headline": "Homeland Security Department's top two officials were put there illegally by Trump, concludes Government Accountability Office", "body": "WASHINGTON (AP) - The two most senior officials in the U.S. Department of Homeland Security were improperly appointed to the posts under federal law by the Trump administration, a nonpartisan congressional watchdog said Friday. The Government Accountability Office says acting DHS Secretary Chad Wolf and his acting deputy, Ken Cuccinelli, are ineligible to run the agency under the Vacancy Reform Act. It was not immediately clear what effects the determination would have on DHS, an agency that has acting officials in a number of prominent roles and is at the forefront of key administration initiatives on immigration and law enforcement. The report does not carry the force of law, though it could be a factor in lawsuits challenging administration policies or influence members of Congress. For its part, DHS rejected the finding. \"We wholeheartedly disagree with the GAO's baseless report and plan to issue a formal response to this shortly,\" the agency said in a written response to the Associated Press. The Government Accountability Office said it has asked the DHS inspector general, a Trump appointee, to review the situation and determine if the violation affects decisions they have taken. Wolf should step down and return to the position he previously held in the department and Cuccinelli should resign, according to Rep. Bennie G. Thompson, chair of the House Committee on Homeland Security, and Rep. Carolyn Maloney of the House Committee on Oversight and Reform. \"GAO's damning opinion paints a disturbing picture of the Trump Administration playing fast and loose by bypassing the Senate confirmation process to install ideologues,\" the two Democrats said in a joint statement. DHS, which was already under intense criticism for carrying out administration policies aimed at curbing legal and illegal immigration, found itself embroiled in more controversy this summer as it dispatched federal agents in tactical gear to Portland to confront protesters outside federal buildings without the cooperation of local authorities. Acting Deputy Secretary of Homeland Security Ken Cuccinelli speaks about the coronavirus outside the West Wing in March. Associated Press Maloney, of New York, and Thompson, who is from Mississippi, condemned what they see as the department's priorities under Wolf and Cuccinelli. \"At a time when DHS should be marshaling the resources of the federal government to respond to the pandemic that has killed over 165,000 Americans, the Department's illegally appointed leaders are instead focused on continuing the Administration's attack on immigrants and intimidating peaceful protesters in a show of force for the President's reelection campaign,\" they said. The GAO analysis traces the violation back to a tumultuous period at DHS in 2019 when then-Secretary Kirstjen Nielsen resigned. It found that she was improperly replaced by Kevin McAleenan under the rules governing succession in federal agencies. McAleenan altered the rules of succession after he was subsequently removed, but GAO's legal analysis concluded that the later appointments of Wolf and Cuccinelli were invalid. Opponents of administration policies have already sought to use their uncertain status in legal challenges. In March, a federal judge in Washington said Cuccinelli's appointment violated the 1998 Vacancy Reform Act and set aside a directive he issued that granted people seeking asylum less time to consult with an attorney before a screening interview. DHS is the third-largest Cabinet agency, with about 240,000 employees. It is also the newest, established by the George W. Bush administration on the wake of the Sept. 11, 2001, terror attacks. Read on:Tom Ridge, the country's first secretary of homeland security, notes that the department \"was not established to be the president's personal militia"}]}