{"article": [{"url": "https://www.marketwatch.com/story/we-the-qualifying-taxpayers-should-not-have-to-suffer-when-will-i-receive-my-first-stimulus-check-2020-08-05", "published": 1597560260.0, "headline": "Iâ\u0080\u0099m still waiting on my FIRST stimulus check. When will I get it? â\u0080\u0098We, the qualifying taxpayers, should not have to sufferâ\u0080\u0099", "body": "Dear Moneyist, I feel I was unfairly denied the stimulus payment. In 2019, I made a total of $51,331. My filing status was â\u0080\u009csingle, no children.â\u0080\u009d I was denied the stimulus payment on 4/10/20 because the IRS based my income on my 2018 taxes. I was permanently laid off from my job as a direct result of the coronavirus pandemic. I was the supervisor of the department that processed and reconciled parking citations written by my city. Since mid-March, the number of parking citations drastically fell due to the coronavirus pandemic, and this caused a major reduction of revenue in my department which resulted in me losing my job. I do not understand why they cannot send out the stimulus checks for the people that do qualify, according to their 2019 taxes. Why didnâ\u0080\u0099t they put the checks on hold until the 2019 taxes were received if the 2018 taxes did not qualify, instead of flat out denying people who truly do qualify? The Moneyist:I told my unemployed tenant about jobs. He said they donâ\u0080\u0099t pay enough, and sits at home smoking weed. Now he wants a discount. What do I do? This timing game is preventing people who qualify from receiving the assistance that is desperately needed. I understand there was no time to iron everything out before the checks were dispersed. But why not fix this loophole, and send the checks that truly qualify from their recent 2019 taxes? I was told by the IRS they cannot go back on their original decision. It is obvious that this decision was rushed, and not thought through. We, the qualifying taxpayers, should not have to suffer due to this loophole. I am not a high income earner. My 2018 income was inflated due to a 401(k) disbursement that I had to take to save my house due to a scheduled layoff in 2018. I really wish someone could help. The $1,200 is desperately needed. A Very Disappointed Unemployed Taxpayer Dear Disappointed, Iâ\u0080\u0099m very sorry you were laid off. The pandemic has affected so many parts of the economy. Parking-ticket revenue was one area that did not occur to me. I understand you are frustrated, and it does feel unfair. However, I do hope that the weekly $600 in extra unemployment benefits went some way in making these last few months easier to manage. Itâ\u0080\u0099s more for some people than others, I know, but the $2.2 trillion CARES Act has gone some way in easing that burden for millions of Americans in a situation similar to your own. The Moneyist: I filed a joint tax return with my estranged wife because she is a gambler and her finances are a mess. But I got NO stimulus check â\u0080\u0094 what can I do? Had the Internal Revenue Service delayed the stimulus-check program for you, and others like you, it would have also delayed it for millions of other Americans. It did not work with the precision of a Swiss watch, but the staff at the IRS were working hard to send as many checks to people as soon as they humanly could â\u0080\u0094 with the challenges of computer networks that were not set up for such a public-health and financial emergency. Fourteen percent of households making under $50,000 have yet to receive their stimulus payment, according to a survey Prosperity Now, a research and policy organization, conducted between June and July. Thatâ\u0080\u0099s one of the ways the pandemic is squeezing poor families who are skipping bills and skimping on groceries, the organization said. By early June, IRS still needed to pay out between 30 and 35 million checks. That included 13 million to 18 million people. The Moneyist: I didnâ\u0080\u0099t get my stimulus check because I owe back child support. Itâ\u0080\u0099s not fair. My stepchildren rely on me â\u0080\u0094 what can I do? The good news: Your $1,200 stimulus check will arrive with your 2020 tax refund. Lawmakers are still wrestling over the details of the next stimulus package. â\u0080\u009cItâ\u0080\u0099s clear no Phase Four deal will be made until the week of August 3rd, which remains our base case,â\u0080\u009d said analysts at Beacon Policy Advisors in a note Thursday. â\u0080\u009cBut given the current lack of unity among Republicans, which could slow down the pace of the negotiations with Democrats, a final deal could even slip a few days further into the week of Aug. 10.â\u0080\u009d The bad news: It will be based on 2019 tax returns, too. Coronavirus update: COVID-19 has now killed at least 771,276 people worldwide, and the U.S. ranks 10th in the world for deaths per 100,000 people (51.5), Johns Hopkins University says. As of Sunday, the U.S. has the worldâ\u0080\u0099s highest number of confirmed COVID-19 cases (5,361,302) and deaths (169,483). Worldwide, confirmed cases are now at 21,261,598. The Dow Jones Industrial Index DJIA, +0.56% closed Friday with a small gain, while the S&P 500 SPX, +0.87% and Nasdaq COMP, +1.39% Â closed slightly lower as investors await progress on a vaccine and, as Democrats and Republicans debate the details of the next unemployment benefits, round two of the economic stimulus program. AstraZeneca AZN, +1.16% in combination with Oxford University, BioNTech SE BNTX, +1.23% and partner Pfizer PFE, -0.27%, GlaxoSmithKline GSK, +1.10%, Johnson & Johnson JNJ, +1.39%, Merck & Co. MERK, +1.59%, Moderna MRNA, +0.09%, and Sanofi SAN, -1.48%, among others, are currently working on COVID-19 vaccines."}]}