{"article": [{"url": "https://www.marketwatch.com/story/gold-rises-as-china-us-tensions-seen-escalating-2020-08-10", "published": 1597070960.0, "headline": "Gold ends higher as China-U.S. tensions seen escalating; Silver rallies over 6%", "body": "Gold futures on Monday settled higher, resuming a strong uptrend for the precious metal after snapping a five-session win streak on Friday, as China imposed fresh sanctions against U.S. officials in apparent retaliation for similar measures against Hong Kong and mainland officials last week. China said it would impose sanctions on 11 U.S. citizens, including Republican Sens. Ted Cruz and Marco Rubio. “Gold is higher on the China news enhancing new buying after profit-taking last Friday,” wrote Peter Cardillo, chief market economist at Spartan Capital Securities December gold GCZ20, +2.17% GC00, +2.17% added $11.70, or 0.6%, to settle at $2,039.70 an ounce, after the metal lost 2% on Friday, cutting into its weekly gain of 2.1%. The commodity has climbed for nine consecutive weeks, marking its longest such streak since the period ended May 12, 2006. China’s move comes as tensions between the U.S. and China, partly centered on Beijing’s perceived handling of the COVID-19 pandemic and national-security laws being imposed in Hong Kong, have been escalating on a number of fronts, including the decision by the superpowers to force the closures of respective consulates in Houston and the southwestern Chinese city of Chengdu. Gold’s weakness to end trade last week was largely pinned to a rebound in the U.S. dollar, which the metal is priced in, and a tilt higher in government bond yields, which can undercut appetite for haven metals. Most recently, the dollar was up about 0.1% at 93.566, as measured by the ICE U.S. Dollar Index DXY, -0.58%. Meanwhile, the 10-year Treasury note yield TMUBMUSD10Y, 0.777% was up 0.4 basis point at 0.57%. Bullish gold investors think the precious metal and its sister metal, silver, are on a long-term uptrend due to measures by governments and central banks to help stabilize economies hurt by COVID-19. “Technically, the gold bulls have the strong overall near-term technical advantage,” wrote Jim Wyckoff, senior analyst at Kitco.com. He said that resistance for gold in the near term may be around $2,100. “Bears’ next near-term downside price objective is pushing futures prices below solid technical support at $2,000.00,” he wrote in a daily note. September silver US:SIU20 rose $1.72, or 6.3%, to more than wipe out its losses on Friday and settle at $29.261 an ounce, nearing a psychologically significant level at $30. Last week, the precious and industrial metal managed to put in a weekly gain of 13.7%. “Silver bulls’ next upside price objective is closing prices above solid technical resistance at $30.00 an ounce,” Wyckoff said. Investors also were watching developments around additional funding from the government to help Americans who have lost jobs due to the deadly pandemic, after Congressional negotiations failed to reach an agreement on aid last week and Trump on Saturday signed executive orders that aim to pause the collection of payroll taxes, provide help on rent, assist with student-loan payments and extend a portion of additional unemployment benefits that had lapsed at the end of last month. In other metals, September copper US:HGU20 gained 6.9 cents, or 2.5%, to reach $2.8615 a pound, after the industrial metal put in a weekly decline of 2.6% on Friday. October platinum PLV20, +3.99% traded $32.30, or 3.3%, higher to settle at $1,002.70 an ounce, following last week’s weekly gain of 5.6%. September palladium US:PAU20 picked up $93.80, or 4.3%, to end at $2,270.40 an ounce and wipe out all of its Friday decline and then some. The precious metal finished last week’s trade with a weekly advance of 1.5%."}]}