{"article": [{"url": "https://www.marketwatch.com/story/this-signal-is-raising-a-red-flag-for-the-stock-market-rally-11598527633", "published": 1598610500.0, "headline": "This signal is â\u0080\u0098raising a red flagâ\u0080\u0099 for the stock market rally", "body": "A divergence between the S&P 500 and VIX indexes raises a 'red flag' for the stock market rally, former hedge-fund investor Jesse Felder warned. Getty Images The VIX index is â\u0080\u009craising a red flagâ\u0080\u009d for the stock market rally, flashing a warning signal that predicted the 2007 market top, according to former hedge-fund investor Jesse Felder. The author of the popular Felder Report financial blog said that typically the stock market and expected volatility â\u0080\u0094 indicated by the VIX index â\u0080\u0094 should move in opposite directions. Any divergence from this, which Felder said has now appeared, can signal â\u0080\u009can impending reversal.â\u0080\u009d The 2007 stock market top and the 2009 market bottom were both identified by a divergence between the S&P 500 SPX, +0.87% index and the VIX, he said. â\u0080\u009cSince then we had several bearish non-confirmations that warned of significant corrections. Today, we have another bearish non-confirmation,â\u0080\u009d the Bear Stearns & Co alumnus said. The S&P 500 index and inverted VIX index over the past 15 years The 10-day correlation between the S&P 500 index and the VIX has risen into positive territory, which Felder said can serve as an effective short-term sell signal. â\u0080\u009cRight now, this VIX warning signal is flashing again as it did earlier this year and prior to the corrections in the first and fourth quarter of 2018,â\u0080\u009d he said. Â â\u0080\u009cIn short, the options market is sending a message that volatility going forward is likely to be greater than the stock market currently implies. And history shows the options market is usually the only [that] wins this sort of argument,â\u0080\u009d he added.The chart If this chart from Goldman Sachs is anything to go by, then the U.S. dollar bear market may have some way to run, Robeco portfolio manager Jeroen Blokland noted. He said there have only been three U.S. dollar bull markets and two bear markets since the 1970s. iframe.twitter-tweet { width: 100% !important; }"}]}