{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-new-england-journal-of-medicine-says-trump-should-be-voted-out-over-pandemic-management-as-us-death-toll-nears-212000-2020-10-08", "published": 1602170000.0, "headline": "Coronavirus update: New England Journal of Medicine says Trump should be voted out over pandemic management as U.S. death toll tops 212,000", "body": "The U.S. death toll from the coronavirus illness COVID-19 moved above 212,000 on Thursday, as the editors of the prestigious New England Journal of Medicine sharply criticized the Trump administration’s handling of the pandemic. In a highly unusual move, the editors published an editorial that called for the current government to be voted out of office. “ Political leaders in the U.S. ‘have taken a crisis and turned it into a tragedy.’ ” — New England Journal of Medicine “This crisis has produced a test of leadership,” said the editorial. “With no good options to combat a novel pathogen, countries were forced to make hard choices about how to respond. Here in the United States, our leaders have failed that test. They have taken a crisis and turned it into a tragedy.” The U.S. leads the world in number of cases at 7.6 million and by deaths at 211,834, according to data aggregated by Johns Hopkins University, far exceeding the numbers of countries with bigger and even more vulnerable populations, the journal’s editors wrote. “The death rate in this country is more than double that of Canada, exceeds that of Japan, a country with a vulnerable and elderly population, by a factor of almost 50, and even dwarfs the rates in lower-middle-income countries, such as Vietnam, by a factor of almost 2000. Covid-19 is an overwhelming challenge, and many factors contribute to its severity. But the one we can control is how we behave. And in the United States we have consistently behaved poorly,” the editors wrote. Read:Mnuchin and Pelosi resume discussions after Trump changes course on fiscal stimulus The U.S. “failed at almost every step,” the editorial continues. Despite ample warning, the country failed to implement adequate and effective testing or even provide the basic personal protective equipment to safeguard health-care workers and the general public. The U.S. lags countries such as Kazakhstan, Zimbabwe and Ethiopia, which do not have America’s biomedical infrastructure or manufacturing capacity, in terms of the number of tests performed per infected person. Don’t miss:Trump’s vaccine czar says the first vaccine should be submitted for emergency authorization around Thanksgiving The U.S. failed to institute quarantine and isolation measures on time and consistently, rules on social distancing remain loose and inconsistent, and restrictions were lifted too early and long before disease control had been achieved. Public messaging on face-mask wearing has been politicized, the journal lamented. The nation’s key public health agencies, the Centers for Disease Control and Prevention, the National Institutes of Health and the Food and Drug Administration have been politicized, too, or excluded from crucial decision making, greatly undermining trust in them, according to the journal. Don’t miss: Expert calls for ‘radical transparency’ on Trump’s coronavirus treatment and progress as more in president’s circle test positive “When it comes to the response to the largest public health crisis of our time, our current political leaders have demonstrated that they are dangerously incompetent,” the editorial concluded. “We should not abet them and enable the deaths of thousands more Americans by allowing them to keep their jobs.” The comments come after Mike Pence and Kamala Harris clashed over the Trump administration’s handling of the crisis at Wednesday night’s vice-presidential debate, with Harris labeling it “the greatest failure of any presidential administration in the history of our country.” Read now: Trump says he won’t debate Biden next week in virtual format The U.S. counted 52,523 new cases of COVID-19 on Wednesday, and at least 994 people died, according to a New York Times tracker. The U.S. has averaged 45,644 new cases daily for the last week, up 9% form the average of two weeks ago. Hospitalizations are rising in key electoral battleground states, according to the Washington Post, including Wisconsin, Michigan, Pennsylvania and Iowa. In other news: • Madrid’s top regional court has rejected a partial lockdown imposed at the weekend on the capital and nine nearby towns to contain the spread of the virus, the Guardian reported. The restrictions banned residents from leaving the city limits, apart from for work, school or medical reasons. The region is grappling with an infection rate of more than 700 cases per 100,000 people, which compares with the nationwide rate of just 300 per 100,000. The court said it had “denied the ratification” of the measures on grounds that “they impacted on the rights and fundamental freedoms” of the 4.5 million residents affected by the closure. • The coronavirus killed three times as many people as the flu and pneumonia in England and Wales in the first eight months of the year, the Washington Post reported, citing data released by Britain’s Office for National Statistics. Research shows that more than 48,000 peopled died of COVID-19 in the period from Jan. 1 to Aug. 31, compared with 13,619 deaths from pneumonia and 394 from flu. The U.K. has 546,959 confirmed cases of COVID-19, the Johns Hopkins data show, and 42,605 people have died, the highest number in Europe and fifth highest in the world. • Regeneron Pharmaceuticals Inc. REGN, +0.36% has submitted a request for emergency authorization to the Food and Drug Administration for its experimental antibody treatment, MarketWatch’s Jaimy Lee reported. The therapy was reportedly prescribed to President Donald Trump last week as part of his COVID-19 treatment plan; on Wednesday, in a video, Trump called it a “cure.” (He was also reportedly prescribed Gilead Sciences Inc.’s GILD, +0.82% remdesivir and the steroid dexamethasone.) Regeneron’s announcement of its filing for an emergency-use authorization, or EUA, came the same day that Eli Lilly & Co. which is also developing an antibody treatment for mild to moderate COVID-19 cases, announced it had requested an EUA. • The Orthodox Jewish community in Brooklyn and Queens staged a second night of protests over New York Gov. Andrew Cuomo’s restrictions that aim to curb a spike in infections. Social-media videos showed groups of men, many without face masks, holding hands and dancing while waving Trump flags. Cuomo has ordered nonessential businesses and houses of worship to close for at least two weeks in certain areas of the city, where the because of a high positive rate of 5.5% that far exceeds the overall rate of 1.2% for the state. iframe.twitter-tweet { width: 100% !important; } Latest tallies There are now more than 36.3 million confirmed cases of COVID-19 worldwide, the Johns Hopkins data show, and at least 1.06 million people have died. So far, 25 million people have recovered. Brazil has the second highest death toll after the U.S. at 148,228, but third highest case tally at 5 million. India is second to the U.S. by case tally at 6.8 million, and has the third highest death toll at 15,526. See also: Prepare for a ‘marathon’ and two years of wearing masks to battle COVID-19, says prominent Spanish virologist Mexico is fourth with 82,726 deaths and ninth with 799,188 cases. See now: Second coronavirus wave could delay Europe’s recovery: ECB President Lagarde China, where the illness was first reported late last year, has 90,689 cases and 4,739 fatalities, according to its official numbers. Read also:Abbott exec: Why better COVID-19 tests may help the U.S. get back to normalWhat are companies saying? • AMC Entertaiment Holdings Inc. AMC, -2.17%, the biggest operator of cinemas in the U.S., expects 520 of its roughly 600 theaters to be open by mid-October. AMC and other cinema chains have been hit hard by the coronavirus pandemic, which forced them to close their theaters to avoid the close gathering of people indoors. AMC said it will open 14 locations in the state of Washington on Friday, Oct. 16. “AMC will reopen its remaining theaters once authorized to do so by state and local officials,” the company said. “All reopened AMCs stringently enforce AMC Safe & Clean and follow all local guidelines and directives.” Moviegoers can expect to see “The War With Grandpa,” starring Robert De Niro, among other coming titles. • Eli Lilly and Co. LLY, +2.20% has entered an agreement with the Bill & Melinda Gates Foundation to ensure access to Lilly’s COVID-19 antibody therapy for low- and middle-income countries. The agreement is part of the COVID-19 Therapeutics Accelerator, an initiative launched by the Gates Foundation, Wellcome and Mastercard MA, +2.09%. The therapy will be manufactured at the Fujifilm Diosynth Biotechnologies facility in Denmark, where the accelerator has reserved manufacturing capacity. “Lilly has already started the manufacturing technology transfer at risk, in anticipation of regulatory authorization for its antibody therapy,” the partners said in a statement. “In the interest of making supply of COVID-19 therapeutic innovations available globally as quickly as possible, Lilly will make certain volumes of its antibody therapeutic manufactured in other facilities available to lower-income countries prior to April 2021, pending the timing of regulatory authorization.” • McDonald’s Corp. MCD, -0.43% reported third-quarter same-store sales that were better than expected and said it was raising its dividend by 3%. Same-store sales for the quarter ended Sept. 30 fell 2.2% from a year ago, but that beat the FactSet consensus of a 5% decline. U.S. same-store sales grew 4.6%, more than the FactSet consensus of 2.5% growth. The company said U.S. sales were positive throughout the quarter, boosted by “strong” average check growth from larger group orders. Separately, the company said it was raising its quarterly dividend to $1.29 a share from $1.25. The new dividend will be payable Dec. 15 to shareholders of record on Dec. 1. • Moderna Inc. MRNA, +0.09% will not enforce any of the seven patents it holds for its COVID-19 vaccine candidate during the pandemic, the Wall Street Journal reported. Moderna told the Journal that it would be willing to license the patents to other organizations when the pandemic ends. Moderna’s experimental coronavirus vaccine is in Phase 3 trials. •PPG Industries Inc. PPG, +0.65% offered upbeat guidance for third-quarter adjusted earnings, despite tailwinds created by the pandemic. PPG said it now expects adjusted EPS to range from $1.90 to $1.94, up from $1.67 a year ago and well ahead of the $1.44 FactSet consensus. The company expects sales volumes to be down about 5% from a year ago, below the lower end of its guidance range of down 6% to down 11%. “We expect to achieve high-teen percentage operating margins in both reporting segments for the quarter, reflecting improving sales volumes and continued execution of our cost management initiatives,” Chief Executive Michael McGarry said in a statement. In the remaining businesses, “demand trends continue to be mixed due to impacts from the pandemic” he said. PPG will release third-quarter earnings on Oct. 19."}]}