{"article": [{"url": "https://www.marketwatch.com/story/jobless-claims-likely-rose-by-16-million-in-early-june-but-the-economy-may-no-longer-be-a-net-job-loser-2020-06-10", "published": 1591807460.0, "headline": "Jobless claims likely rose by 1.6 million in early June, but the economy may no longer be a net job loser", "body": "The surprise rebound in U.S. employment in May would be more encouraging if the number of people applying each week for jobless benefits also showed a similarly welcome trend. Although new jobless claims have been falling since March, more than 2.2 million applications for unemployment compensation were filed in the last week of May through state and federal relief programs. That’s almost as many as the 2.5 million jobs supposedly regained by the economy in the entire month. Read:U.S. entered recession in February after end of longest expansion in history Economists polled by MarketWatch predict another 1.6 million people likely applied for benefits in the first week of June through traditional state-run unemployment programs. Several hundred thousand more may have applied via a temporary federal relief program. To be sure, new jobless claims by themselves do not present an accurate picture of the labor market. They tally up job losses only. They reveal little about job gains or people returning to work after a brief coronavirus-induced hiatus. “The problem with the classic high-frequency employment data, like jobless claims, is that it only shows you one side of the equation,” economists Tom Porcelli and Jacob Oubina at RBC Capital Market wrote. “(W)e are not losing jobs on net.” Read: Revisiting that funky drop in unemployment to 13.3%: Nobody really believes it Still, it’s going to be hard to believe the labor market has really turned the corner until combined state and federal jobless claims drop well below the 1 million mark each week. Before the pandemic, they ran in the low 200,000s. The elevated level of claims suggests lots of workers are still losing their jobs or are finding they have none to go back to. It could also be a sign companies have decided to make some layoffs or furloughs permanent because they do not see demand recovering sufficiently enough to call back all of their employees. Federal Reserve Chairman Jerome Powell said Wednesday that he worries the number of people who’ll find they have no job to return to could be “well into the millions.” Based on other employment indicators, some 20 million people are likely still out of work. That’s less than half the total number of applications for unemployment benefits filed since the pandemic struck the U.S. economy in the middle of March. Read: Consumer prices drop again as pandemic cuts rate of inflation to near zero Why such a gap? Some people returned to work and others got new jobs, for one thing. The government’s small-business protection plan, for instance, basically pays firms to keep paying their workers even if they aren’t actually doing any work. Read: Small businesses turn more optimistic, NFIB says, and expect ‘short-lived’ recession In other cases, some people have may filed multiple claims amid widespread reports of computer outages at state employment offices while other applications were rejected. That’s why the most important number to pay attention to is so-called continuing jobless claims — the actual number of people actually getting unemployment checks. Total continuing claims in the week ended May 16 — the latest data available — actually fell slightly to an unadjusted 29.9 million. It will be at least a few more weeks until continuing claims provide more clarity on the how rapidly the labor market is recovering."}]}