{"article": [{"url": "https://www.marketwatch.com/story/jp-morgan-joins-the-list-of-wall-street-banks-calling-for-the-demise-of-6040-portfolio-despite-its-success-this-year-2020-07-01", "published": 1593857120.0, "headline": "JP Morgan joins the list of Wall Street banks calling for the demise of 60/40 portfolio, despite its success this year", "body": "In a year where a classic 60/40 allocation has affirmed the success of this time-tested strategy, JP Morgan is joining the list of Wall Street banks that are calling for its demise in the coming years. Historically, financial advisers would tell their clients to keep 60% of their cash in stocks and the rest in highly rated bonds, with the idea that the portfolio would capture the dramatic long-term gains achieved by equities, while depending on the “safe” fixed-income assets like government bonds to rally during any short-term drawdowns in the stock market. Yet money managers and bank strategists have repeatedly questioned the ability of government bonds and mortgage-backed debt to act as ballast in a portfolio, with yields on such “safe\" assets looking increasingly meager. “In the zero-yield world, which we think will be with us for years, bonds offer neither much return nor protection against equity falls,” said Jan Loeys and Shiny Kundu, strategists at JP Morgan, in a Tuesday note. See: Bank of America declares ‘the end of the 60-40’ standard portfolio Read: Is Wall Street too ready to ‘pen the obituary’ of the 60-40 standard portfolio? So far, the traditional allocation has performed admirably in the last four to five decades, returning around 10% annually over that stretch. And a 60/40 fund would have helped offset losses this year, too. Vanguard’s balanced index fund VBINX, +0.52% eked a gain of less than 1% year-to-date through June 30. The S&P 500 SPX, +0.87% is down 3.3% over the same period. Yet as long-term Treasury yields hover near historic lows, investors say it’s hard to imagine how much further government bonds and other “safe” fixed-income assets can rally. At the moment, the 10-year U.S. Treasury note yield TMUBMUSD10Y, 0.777% stands at 0.68%, while the yield for the U.S. Aggregate Bond Index AGG, +0.02% , comprised of government debt, mortgage-backed debt and highly rated corporate bonds, offers a yield of 1.3%, a historic low. Bond prices move in the opposite direction of yields. Unless long-term yields turn negative, the ability of plain-vanilla bonds to offset drawdowns in the risky asset share of the portfolio could prove limited. Moreover, in the event that inflation materializes or the Federal Reserve raises rates, investors holding long-term government paper could feel painful losses. “With yields so low, bonds can no longer do all the things they’ve been doing for investors during this secular declining interest rate environment over the last forty years,” said David Jilek, chief investment strategist at Gateway Investment Advisers. JP Morgan forecast annual returns for a 60/40 portfolio would average around 3.5% over the next decade. Read: Investing legend Burton Malkiel on day-trading millennials, the end of the 60/40 portfolio and more Their analysts instead advocated investors to tweak the make-up of their portfolio ballast away from government bonds or other safe assets, to what they dub “hybrid” assets like collateralized loan obligations, real estate investment trusts, commercial mortgage backed securities and even sub-investment-grade corporate debt, or junk-rated bonds, that offer additional yield but also hold up most of their value during stock-market drawdowns. By their estimation, a portfolio allocating 20% to bonds, 40% to hybrids, and 40% to stocks could offer an additional 50 basis points of returns over the traditional 60/40 portfolio. “This may not sound like a huge difference, but this adds up over the years,” JP Morgan said."}]}