{"article": [{"url": "https://www.marketwatch.com/story/got-regrets-so-does-everyone-heres-how-to-minimize-them-11597333412", "published": 1597406540.0, "headline": "Got regrets? So does everyone. Hereâ\u0080\u0099s how to minimize them", "body": "Choose wisely, and then don't worry about it. Getty Images/iStockphoto Â Last week, I learned the disappointing news that our next-door neighborsâ\u0080\u0094possibly the nicest people in the worldâ\u0080\u0094have put their house on the market. While Iâ\u0080\u0099m sorry to see them go, I understand their decision. With a growing family, theyâ\u0080\u0099re looking for more room. During the pandemic, in fact, many people are making changes of one sort or another. Will they be happy with their choices? That brings me to a new project, developed by author Daniel Pink, called theÂ World Regret Survey. The goal: to better understand the dynamics of decision-making and regret by collecting and cataloging regrets shared by people around the world. Interestingly, Pink has made his initial data available online. It is, in essence, a giant database of regrets. Many of them, as you might imagine, have to do with career and personal finance. While some amount of regret in life is inevitable, there are certain strategies that can help keep it to a minimum. Here are six such strategies: 1. Rules. Itâ\u0080\u0099s common sense that decisions made under stress generally have worse outcomes. But sometimes, decisions canâ\u0080\u0099t wait andÂ needÂ to be made amid stressful circumstances. Whatâ\u0080\u0099s the solution? In my view, it comes down to one word: rules. Or maybe two words: decision rules. To the extent possible, try to write out a set of financial rules for yourself. For example, if the stock market declines again, what will you doâ\u0080\u0094sit tight,Â rebalance, complete a RothÂ conversionÂ or perhaps contribute to your childrenâ\u0080\u0099s 529Â accounts? While no one can conceive of every possible eventuality, you can still cover the big ones. This will make it easier to make logical decisions when the time comes. 2. Records.Â It might seem tedious, but thereâ\u0080\u0099s a lot of value in keeping a log of financial decisions. Whether a decision goes well or poorly, youâ\u0080\u0099ll be able to revisit your initial thinking after the fact. Since no oneâ\u0080\u0099s memory is flawless, Iâ\u0080\u0099ve found logs like this to be helpful. In some cases, as you review your records, youâ\u0080\u0099ll want to congratulate yourself. In other cases, youâ\u0080\u0099ll want to beat yourself up. But either way, youâ\u0080\u0099re almost guaranteed to learn something that will help the next time around. 3. Information.Â A month ago, mortgage rates were at all-time lows. Where are rates today? Even lower. Does that mean that, if youÂ refinancedÂ your mortgage a month ago, you should regret it? To be sure, it would be easy to regret not waiting a month, but no one could have known that rates would go lowerâ\u0080\u0094and they could easily have gone the other way. Thatâ\u0080\u0099s why I think itâ\u0080\u0099s so important to exclude from decision-making what you thinkÂ couldÂ happen in the future. If you make the best decision you can with the information available today, thatâ\u0080\u0099s the best you can do. And if you keep that information in your log, as recommended above, that will go a long way toward not second-guessing yourself later. 4. Devilâ\u0080\u0099s Advocate (Part I).Â Psychiatrist Viktor Frankl advocated this approach to decision-making: â\u0080\u009cLive as if you were living a second time, and as though you had acted wrongly the first time.â\u0080\u009d In other words, to avoid regret after the fact, try to think through all of the possible outcomes of a decisionÂ beforeÂ the fact. As I noted above, itâ\u0080\u0099s impossible to see the future. But it is possible to make some educated guesses. Ask yourself: If something went wrong with the decision Iâ\u0080\u0099m about to make, what would it be? In a sense, you want to play devilâ\u0080\u0099s advocate with yourself. You might not change your mind, but at least youâ\u0080\u0099ll have considered a wider range of potential outcomes. 5. Devilâ\u0080\u0099s Advocate (Part II). Two heads are better than one, or so the saying goes. But if you ask a friend to weigh in on a financial decision, take his or her response with a grain of saltâ\u0080\u0094because what you may hear is some pithy aphorism. Iâ\u0080\u0099ve heard dozens during my career: â\u0080\u009cDonâ\u0080\u0099t fight the Fed.â\u0080\u009d â\u0080\u009cYour first trade is your best trade.â\u0080\u009d â\u0080\u009cNever try to catch a falling knife.â\u0080\u009d â\u0080\u009cTrees donâ\u0080\u0099t grow to the sky.â\u0080\u009d â\u0080\u009cDonâ\u0080\u0099t cut your flowers and water your weeds.â\u0080\u009d â\u0080\u009cNo one ever went broke taking profits.â\u0080\u009d Whatâ\u0080\u0099s dangerous about these sayings is that they sound wiseâ\u0080\u0094and, as a result, they can be convincing. But beware: Many of them justsoundÂ wise. In fact, thereâ\u0080\u0099s usually another equally pithy saying that perfectly contradicts many of these common sayings. 6. Quantify. To the extent possible, understand the type of decision youâ\u0080\u0099re making. Specifically, try to quantify what the benefit might be if the decision goes well and whatâ\u0080\u0099s at risk if it goes poorly. You canâ\u0080\u0099t know these numbers in advance with any precision. But I nonetheless recommend this as a thought experiment. In racetrack terms, you want to understand the odds. With some investments, the potential risk and return are about even, but in other cases, it is skewed one way or the other. You might still choose to make some bets that are riskyâ\u0080\u0094and Iâ\u0080\u0099m not suggesting you shouldnâ\u0080\u0099tâ\u0080\u0094but I think itâ\u0080\u0099s a good regret-minimization technique to at least go through this exercise. Adam M. Grossmanâ\u0080\u0099s previous articlesÂ includeÂ Donâ\u0080\u0099t Be That Person,Â Skewed ImpressionÂ andÂ What to Worry About.Â Adam is the founder ofÂ Mayport, a fixed-fee wealth management firm. In his series of freeÂ e-books, Adam advocates an evidence-basedÂ approach to personal finance. Follow Adam on TwitterÂ @AdamMGrossman. This column originally appeared on Humble Dollar and was republished with permission."}]}