{"article": [{"url": "https://www.marketwatch.com/story/tech-backed-group-blasts-trumps-order-on-work-visas-as-full-frontal-attack-on-american-innovation-and-our-nations-ability-to-benefit-from-attracting-talent-2020-06-23", "published": 1592909960.0, "headline": "Tech-backed group blasts Trumpâ\u0080\u0099s order on work visas as â\u0080\u0098full-frontal attack on American innovation and our nationâ\u0080\u0099s ability to benefit from attracting talentâ\u0080\u0099", "body": "“ â\u0080\u0098Massive restrictions to legal immigration â\u0080\u0093 including restricting immigrants who contribute to medicine, science, and research in the United States, and who are working as we speak to develop treatments for coronavirus and other deadly diseases â\u0080\u0093 will not only hinder efforts to save lives, but will prevent job creation and hurt our economy as our country struggles to recover. ... This is a full-frontal attack on American innovation and our nationâ\u0080\u0099s ability to benefit from attracting talent from around the world.â\u0080\u0099 ” â\u0080\u0094 Todd Schulte, president of FWD.us Thatâ\u0080\u0099s the reaction to the Trump administrationâ\u0080\u0099s order restricting work visas on Monday from Todd Schulte, president of FWD.us, a pro-immigration lobbying group that was founded by Facebookâ\u0080\u0099s FB, +0.26% Â Mark Zuckerberg and other technology industry leaders. President Trumpâ\u0080\u0099s order blocks visa issuance until the end of the year for a range of foreign workers, affecting the H-1B visas that are widely used by Silicon Valley companies. Other business groups have also criticized the administrationâ\u0080\u0099s move as well, such as the U.S. Chamber of Commerce. â\u0080\u009cPutting up a â\u0080\u0098not welcomeâ\u0080\u0099 sign for engineers, executives, IT experts, doctors, nurses and other workers wonâ\u0080\u0099t help our country, it will hold us back,â\u0080\u009d said the chamberâ\u0080\u0099s CEO, Thomas J. Donohue. But the Center for Immigration Studies, which lobbies for reducing immigration, praised the order. â\u0080\u009cIt will help US workers, as long as it is sustained for a long enough. Potentially creates nearly half a million job openings,â\u0080\u009d tweeted the centerâ\u0080\u0099s director of policy studies, Jessica Vaughan. Nearly 600 organizations disclosed lobbying in Washington, D.C., on immigration issues last year, including Facebook, Microsoft MSFT, +2.48%, Intel INTC, -1.03% Â and Google parent Alphabet GOOG, +1.97% Â GOOGL, +1.82%, according to an OpenSecrets.org analysis of disclosures."}]}