{"article": [{"url": "https://www.marketwatch.com/story/kroger-downgraded-at-bank-of-america-as-competition-with-walmart-and-target-heats-up-11600115916", "published": 1600155200.0, "headline": "Kroger downgraded at Bank of America as competition with Walmart and Target heats up", "body": "Kroger is facing competition, particularly online where grocery sales have spiked @KrogerNews Kroger Co. was downgraded to neutral from buy at Bank of America with analysts citing intensifying competition with other mass grocers. Bank of America moved its price objective to $40 from $42. Grocers have seen sales soar during the coronavirus pandemic as more customers, who are working, schooling and spending more time at home, make more of their own meals. Big-box chains like Walmart Inc. WMT, +1.00% and Target Corp. TGT, +1.14% have also used the increased attention from consumers to focus on services and customer service offerings that appeal to shoppers who want to stock their pantries while also social distancing. Read: Halloween sales forecast could be frightful to companies trying to create holiday season momentum Walmart, for instance, announced the coming launch of Walmart+, its membership program that will offer unlimited delivery. And Target, which was already using its stores as fulfillment centers, talked up the customer response to its pickup service and other options. Kroger KR, +0.46% has invested heavily in its digital offerings, for instance, through a partnership with Ocado, a British online grocery company. It has made announced plans to beef up its e-commerce lineup with the addition of 50,000 items from third-party sellers. “We believe Kroger’s plan to integrate third-party marketplace offerings this fall reflects Kroger’s need for a broader general merchandise assortment to compete with omnichannel leaders Walmart and Target,” Bank of America analysts led by Robert Ohmes wrote. A Wall Street Journal story published just before Kroger’s earnings were announced discussed Kroger’s digital shortcomings despite its efforts and investments, saying the grocer is in “catch-up mode in e-commerce.” Raymond James analysts, in a note published last week, highlight the soaring growth in online grocery during the coronavirus, with Walmart, Target and Amazon.com Inc. AMZN, +3.01% among the winners. Food and beverage is an $800 billion-plus business in the U.S., and Raymond James expects U.S. online grocery penetration to reach about 6% this year, doubling last year, with sales of $50 billion. Analysts say that forecast could be “conservative.” See: Target to increase the number of Black workers across the company by 20% over the next three years Analysts think online grocery can reach about 10% by 2025. “We believe traditional grocers have the most to lose, though many are also increasingly investing in online grocery capabilities including automation and would note Instacart as a key technology partner to many traditional grocers,” Raymond James wrote. The popularity of buy-online-pickup-in-stores should also help, according to BMO Capital Markets analysts led by Kelly Bania. “Kroger noted that digital profitability is improving on an incremental basis, we believe largely in the pick-up business, despite the ‘temporary’ removal of pick-up fees,” BMO said. BMO rates Kroger stock market perform with a $34 target price. But Bank of America thinks identical sales should decelerate as more customers return to restaurants. Kroger reported a 14.6% increase in identical sales without fuel in the most recent quarter, and forecasts growth for the year to exceed 13%. UBS analysts are turning their attention to the year ahead when conditions moderate. “[W]e think much of the focus will now turn to how Kroger performs in a likely more normalized environment in 2021 when it laps difficult comparisons,” wrote UBS analysts led by Michael Lasser. In the meantime, Kroger stock is suffering as other grocery retailers, including traditional ones like Albertsons Cos. Inc. ACI, +1.71%, had a better quarterly earnings showing, analysts said. Kroger shares have tumbled 7.2% over the past month, though they have jumped 13.3% for the year to date. The S&P 500 index SPX, +0.87% is up 4.7% for 2020 so far. “It could be that Kroger invested more in price than others, or that it simply didn’t capture growth like other players,” UBS said. “Regardless, we believe Kroger will continue to benefit from industry tailwinds and see strength throughout the end of the year.” Don’t miss: COVID-related U.S. e-commerce growth slows as store reopenings attract quarantine-fatigued customers: Adobe UBS rates Kroger stock neutral with a $36 price target, up $1."}]}