{"article": [{"url": "https://www.marketwatch.com/story/us-gdp-likely-sank-a-record-35-in-the-2nd-quarter-after-coronavirus-ravaged-the-economy-2020-07-29", "published": 1596020540.0, "headline": "U.S. GDP likely sank a record 35% in the 2nd quarter after coronavirus ravaged the economy", "body": "The U.S. suffered the biggest economic decline in the second quarter since the government began keeping track after World War Two. How much? Try 30% — or more. Economists polled by MarketWatch estimate gross domestic product — the official scorecard for the U.S. economy — contracted by a record 34.6% annual pace from the start of April to the end of June. Before the coronavirus pandemic, the largest drop in GDP on record was 10% in 1958. The government’s quarterly GDP figures go back to 1947. The steepest quarterly drop during the 2007-2009 Great Recession was 8.4%. Here is what to watch in the second-quarter GDP report when published Thursday morning.Consumer spending The loss of tens of millions of jobs and closure of countless businesses during the early stages of the pandemic shook households to the core. The amount of money consumers spent likely fell by a record 35%, according to Wall Street DJIA, +0.56% economists. Consumption represents about 70% of U.S. economic activity. The unprecedented drop in spending is expected to account for the bulk of the decline in GDP. Spending on services fared the worst. Travel dried up, fewer people went to doctors or dentists for regular care, indoor dining at restaurants was barred and people couldn’t get haircuts, among other things. Read:Consumer confidence wanes in July and points to rockier economic recovery Americans also spent less on cars and many other goods, but they bought more household staples such as groceries and paper products to tide them over while working from home.Business investment Businesses slashed investment and production in the second quarter when faced with an unfathomable collapse in domestic and foreign demand. Particularly hard hit were energy producers stung by a huge drop in oil prices as drivers stayed off the road and airline traffic crumbled. Investment in structures such as drilling rigs and equipment like computers and heavy machinery probably shrank about 40% or even more. Inventories also saw a large drawdown as manufacturers and other companies scaled back production. A decline in the level of inventories also causes GDP to shrink. Businesses aren’t going to ramp up investment and production until the latest rash of coronavirus cases recedes and global trade recovers from mass disruption. Weak investment not only hurts the economy now, it will make it harder for growth to accelerate in the future once the virus runs its course.Government Washington has committed to spending trillions of dollars to keep the economy from sinking into an even deeper abyss. Yet it’s quite possible that government spending also declined in the second quarter. Not all the federal aid has been funneled into the economy yet and states and localities have suffered from a huge drop in tax revenue even as their expenses have risen to combat the damage from the virus.Exports and imports Chronically high U.S. trade deficits haven’t looked all that different during the pandemic, but it’s mostly a statistical illusion. Imports have plunged — but so have American exports. In short, world trade has been brought to its knees. The result will be a further drag on the economy in the second quarter if, as expected, exports fall faster than imports and lead to a somewhat larger deficit. Higher deficits subtract from GDP."}]}