{"article": [{"url": "https://www.marketwatch.com/story/tesla-stock-propelled-higher-by-bofa-and-morgan-stanley-upgrades-2020-08-14", "published": 1597422440.0, "headline": "Tesla stock propelled higher by BofA and Morgan Stanley upgrades", "body": "Analysts at BofA Securities and Morgan Stanley upgraded their ratings on Tesla Inc. shares on Friday, thinning the ranks of Tesla bears and boosting the stock toward another record. Tesla TSLA, +1.89% stock hit an all-time high of $1,650.71 on Friday, and has nearly quadrupled in price this year. Earlier this week, the company announced a five-for-one stock split to make the shares more accessible to investors and employees. BofA and Morgan Stanley highlighted the share rally and future share catalysts such as the company’s “battery day” next month. See also:For Nikola stock, no news was not good news After 17 years in existence, Tesla is “only now” making about 500,000 a year and reaching just above or breakeven profit and free cash flow, “which is uninspiring progress,” analyst John Murphy at BofA said in his note. Yet Chief Executive Elon Musk’s “leadership, a compelling brand, and improved execution are driving an ever- increasing stock price,” he said. “This is direct evidence that the company has unfettered access to low-cost capital, which remains a key advantage that may (and should) be leveraged to accelerate growth to almost 50% per annum over the next five years,” the analyst said. Related:Fisker is going public: Five things to know about the electric-car maker ahead of its IPO Murphy upgraded his rating on Tesla to the equivalent of buy from hold, and raised his price target to $1,750 from $800, which had been among the lowest Tesla stock targets on Wall Street. Of 35 analysts polled by FactSet focusing on Tesla, a third rate the stock a sell, and half rate it a hold, with the remaining 20% rating it a buy. The average price target is $1,232, representing 25% downside from Friday’s share price. ”While we remain skeptical that (Tesla) will be the dominant EV automaker in the long-run, if a big global footprint can be built with no-cost capital, the ‘growth’ story would carry the day for the stock,” Murphy said. Adam Jonas at Morgan Stanley raised his rating to the equivalent of hold from sell, and raised his price target to $1,360. The analyst and his team downgraded Tesla stock to their equivalent of sell, from neutral, in June, citing trade risks between the U.S. and China, concerns about near-term demand, and the company’s ongoing capital needs. “With this report, we now feel we can justify transferring some value of the third-party battery business from the realm of the bull case into our base case,” Jonas said in a note Friday, explaining that the bank now values Tesla as a battery and powertrain supplier in addition to its main business of making cars. The idea that Tesla could supply “not only drive trains and software but superior battery packs to the auto industry is increasingly gaining validation.” Tesla has set a “battery day” for Sept. 22 to showcase its battery technology. The shares have gained 293% this year, compared with gains around 4% for the S&P 500 index. SPX, +0.87%"}]}