{"article": [{"url": "https://www.marketwatch.com/story/heres-where-things-stand-on-the-extra-600-a-week-in-unemployment-benefits-that-expired-on-friday-11596482060", "published": 1596532520.0, "headline": "Hereâ\u0080\u0099s where things stand on the extra $600 a week in unemployment benefits that expired on Friday", "body": "Republicans and Democrats have not yet reached an agreement on the amount of unemployment insurance to distribute to nearly 30 million jobless Americans. (Photo by Brendan Smialowski-Pool/Getty Images) Brendan Smialowski-Pool/Getty Images Anyone who has taken a basic chemistry class knows that when you combine oil with water, the two substances will not mix. No matter how hard you shake or stir the combination youâ\u0080\u0099ll still see droplets of oil surrounded by water.Â For the past two weeks, Republican and Democratic lawmakers have acted just like oil and water regarding stimulus talks.Â The two parties failed to reach a compromise on several issues, including the extra $600 a week in unemployment benefits that jobless Americans have been receiving under the $2 trillion CARES Act, causing it to expire entirely on Friday.Â As a result, 30 million unemployed Americans received $600 less in benefits this past weekend. Some received checks below $235, the maximum benefit paid out to beneficiaries in Mississippi, the state that pays the lowest amount of weekly jobless benefits.Â House Democrats, led by House Speaker Nancy Pelosi, are demanding that the extra $600 a week paid by the federal government remain in place through January 2021, a key part of the stimulus package they passed in May known as the HEROES Act. Senate Republicans and members of the Trump administration say that the extra $600 is akin to paying Americans not to work, given that two-thirds of Americans have received more money in unemployment benefits than they did from their former jobs. Instead, Republican senators proposed, as part of the recently unveiled HEALS Act, lowering the supplemental benefits to $200 a week for two months until state workforce agencies can implement weekly unemployment benefits equal to 70% of a workersâ\u0080\u0099 prior wages. Pelosi said that $200 a week â\u0080\u009cdoes not meet the needs of Americaâ\u0080\u0099s working families.â\u0080\u009d She added on Sunday in an ABC interview that itâ\u0080\u0099s a â\u0080\u009ccondescensionâ\u0080\u009d to claim that Americans donâ\u0080\u0099t need it because they are staying home when they could otherwise be working. Related: Republicans want to replace extra $600 unemployment with 70% replacement wages â\u0080\u0094 but that could take months Republicans attempted to pass a one-week extension of the $600 benefit as the two parties continue to negotiate an overarching stimulus package, but could not get enough votes in the Senate to pass it on to the House. Even if the proposed extension did make it to the House, itâ\u0080\u0099s highly unlikely that it would have passed, given Pelosiâ\u0080\u0099s opposition to short-term extensions, which she said are only appropriate when lawmakers are â\u0080\u009con the verge of having an agreement or you have an agreement.â\u0080\u009d House Majority Leader Steny Hoyer however signaled last week that Democrats are willing to compromise on the $600 benefit.Â â\u0080\u009cItâ\u0080\u0099s not $600 or bust,â\u0080\u009d he said in a CNN interview. He also said that the Republicansâ\u0080\u0099 argument that the extra $600 discourages people from working â\u0080\u009chas some validity to it, and we ought to deal with that.â\u0080\u009d “ â\u0080\u0098Itâ\u0080\u0099s not $600 or bustâ\u0080\u0099 ” â\u0080\u0094 House Majority Leader Steny Hoyer For Pelosi, it is $600 or bust, at least for the time being, she said in a CNN interview on Monday. â\u0080\u009cThe $600 is related more to the unemployment rate. As the unemployment goes down then that number can go down.â\u0080\u009dÂ Donâ\u0080\u0099t miss: Job trouble? Wave of rehiring after economy reopened to fade in July after viral spiral Senate Minority Leader Chuck Schumer and Sen. Ron Wyden, a Democrat from Oregon, proposed a bill that would keep federal unemployment benefits at $600 â\u0080\u009cuntil a stateâ\u0080\u0099s three-month average total unemployment level falls below 11%.â\u0080\u009d At that point, benefits would drop by $100 for every 1% decrease in a statesâ\u0080\u0099 unemployment rate. Sen. Mitt Romney, a Republican from Utah, introduced a similar proposal backed by two other Republican senators, Susan Collins from Maine and Martha McSally from Arizona. Their proposal calls for extending federal unemployment benefits for three months. States can decide whether to pay benefits equal to 80% of workersâ\u0080\u0099 prior wages or start phasing out benefits starting at $500 in August and dropping by $100 each month through October.Â Pelosi said Romneyâ\u0080\u0099s proposal â\u0080\u009cis something to talk aboutâ\u0080\u009d at a later point in time.Â Senate Majority Leader Mitch McConnell has not indicated whether he will schedule a vote in the Senate on either of those proposals. Members of the Trump administration said the President is looking into options to sidestep Congress that would address some of the economic issues Americans are confronting if the House and Senate are unable to pass a second stimulus package, the Washington Post reported Monday."}]}