{"article": [{"url": "https://www.marketwatch.com/story/minor-ballot-and-application-issues-breathe-life-into-trump-claim-of-mail-in-voting-disaster-01601899765", "published": 1601885840.0, "headline": "Minor ballot and application issues breathe life into Trump claim of mail-in voting 'disaster'", "body": "WASHINGTON (AP) - Nine ballots discarded in Pennsylvania. A mail carrier who altered a handful of affidavit ballot applications. People being sent double ballots. In the run-up to Election Day, President Donald Trump is seizing on small, potentially routine voting issues to suggest the election is rigged. But there is no evidence there is any widespread voter fraud as the president has suggested. Nevertheless, his comments have been amplified by his campaign, supporters and allies, including Attorney General William Barr, adding heft to the claims. \"Mail ballots, they cheat,\" Trump said last month. During the presidential debate last week, he insisted the election had already been \"rigged,\" adding: \"As far as the ballots are concerned, it's a disaster.\" But voter fraud has proved exceedingly rare. And even a panel commissioned by the Trump administration to explore the issue uncovered no evidence to support claims of widespread voter fraud. Five states routinely send ballots to all registered voters so they can choose to vote through the mail or in person, and four other states and the District of Columbia will be adopting that system in November, as will almost every county in Montana. “ A mail carrier in West Virginia admitted to changing parts of absentee-ballot applications, including changing the party affiliation on five applications from Democratic to Republican. President Trump misconstrued the facts of that incident. ” Even as the president rails against mail-in voting, he has acknowledged that he voted by absentee ballot in the past. But Trump's decision to seize on the small number of issues - they occur in every election - exemplify the president's monthslong effort to sow doubt about the integrity of the election before it's even arrived and to preemptively call into question the results. Particularly, the president has seized on an election worker's decision to discard nine military ballots in Wilkes-Barre, Pa., which a state elections official said amounted to a mistake and not \"intentional fraud.\" Still, the president brought up the case, saying it was evidence of election fraud. He mentioned it twice during Tuesday night's presidential debate. The Justice Department in a particularly unusual move said seven of the nine ballots found discarded in a wastebasket in Luzerne County in Pennsylvania had Trump's name on them. The Justice Department is investigating the matter and it was Trump, after being briefed by Barr - again, unusually for such an incident - who first mentioned the ballots during a Fox News radio appearance, hours before the U.S. attorney in Harrisburg announced the investigation. At the debate, Trump also pointed to another Justice Department in West Virginia, where a mail carrier admitted to changing parts of absentee-ballot applications, including changing the party affiliation on five applications from Democratic to Republican. But the president misconstrued the facts in the case and said that there were \"mailmen selling the ballots.\" The man, Thomas Cooper, held a postal contract to pick up mail in the three towns in which the voters live and delivered the forms in April to the Pendleton County clerk. He pleaded guilty in July to attempted election fraud and injury to the mail. But there were no accusations that Cooper had ever been paid to take the actions taken and told investigators that he did it \"as a joke.\" Barr has previously raised the possibility that a \"foreign country could print up tens of thousands of counterfeit ballots\" and has argued they would be hard to detect, but that's been disputed by election experts. Multiple studies have debunked the notion of pervasive voter fraud in general and in the vote-by-mail process. In an interview with CNN last month, Barr said he was basing his concerns on \"logic,\" though senior U.S. officials have said there is no intelligence to suggest that was happening. The president has also pointed to an error in Fairfax County in Virginia, where about 1,000 voters were sent two ballots, claiming at the debate that it was evidence that \"this is going to be a fraud like you've never seen.\" But local officials have said it is not a situation that could lead to voter fraud because those who return a ballot will be marked as having voted, preventing them from voting twice. The Margin: Critics say Trump supporters staging event at early voting site in Virginia's Fairfax County aimed to intimidate and suppress"}]}