{"article": [{"url": "https://www.marketwatch.com/story/airline-stocks-rally-as-travel-demand-increases-reaching-new-post-covid-19-highs-2020-08-11", "published": 1597147760.0, "headline": "Airline stocks rally as travel demand increases, reaching new post-COVID-19 highs", "body": "Airline stocks were broadly higher Tuesday, boosted by a continued rebound in traveler demand to fresh post-COVID-19 highs and upbeat analyst comments fueling investor interest. The U.S. Global Jets exchange-traded fund JETS, +0.16% ran up 3% toward a near two-month high in morning trading. The ETF is on track for a seventh straight gain — it has surged 13% over the past six sessions — which would be the longest such streak since the eight-day stretch ended March 13, 2018. Among the ETF’s most-active U.S.-based components, shares of American Airlines Group Inc. AAL, +0.34% hiked up 1.9%, United Airlines Holdings Inc. UAL, +0.32% rose 1.4% and Delta Air Lines Inc. DAL, +0.39% advanced 2.1%. A MarketWatch analysis of data provided by the Transportation Security Administration, a part of the Department of Homeland Security, showed that travel demand has resumed its rising trend, after a two-week dip in July. The daily average of travelers going through TSA checkpoints for weeks ended Sundays rose to 699,675 in the latest week, the highest daily average since the week ended March 22. “People are likely looking to squeeze in travel ahead of back to school as spiking cases in mid-July delayed travel plans,” Becker wrote in a note to clients. Daily, the number of travelers going through TSA checkpoints on Sunday rose to 831,789 from 683,212 on Saturday, and from 799,861 the previous Sunday, to the highest total since March 17. On Monday, there were 761,861 travelers going through TSA checkpoints, the highest total for a Monday since March 16, which was the last day there were more than 1 million travelers (1,257,823). U.S. Transportation Security Administration, MarketWatch The increased travel demand comes as Cowen analyst Helane Becker said that while new COVID-19 case counts and hospitalizations remain high, they have recently started trending lower. “We continue to believe there is coronavirus fatigue with some now looking to get back to normal life,” Becker wrote. “We expect to see TSA throughput trend higher this week, probably helped in part by college students returning to their schools.” Mesa Air Group Inc.’s MESA, +11.83% stock surged 5.4% after Deutsche Bank analyst Michael Linenberg raised his rating on the air carrier to buy from hold, and boosted his stock price target to $5.50 from $4.00. The upgrade comes after Mesa Air reported a surprise second-quarter profit that rose from a year ago, although revenue fell more than forecast. Elsewhere, shares of Southwest Airlines Co. LUV, +1.89% climbed 2.8%, Spirit Airlines Inc. SAVE, +1.35% tacked on 2%, JetBlue Airways Corp. JBLU, -0.07% gained 2%, Alaska Air Group Inc. ALK, +0.15% were up 0.9% and Hawaiian Airlines parent Hawaiian Holdings Inc. HA, +0.36% rose 3.7%. It’s unclear how news that Russia has registered the first vaccine to treat COVID-19, before even starting Phase 3 trials, is affecting airline stocks, given the uncertainties surround the effectiveness and safety of the treatment. Don’t miss: Russia’s accelerated COVID-19 vaccine greeted with alarm as experts say Phase 3 trial is essential. The Jets ETF has now run up 35.6% over the past three months, but has still lost 43% year to date. In comparison, the Dow Jones Transportation Average DJT, +0.84% , which includes six airline components, has edged up 1.1% this year and the Dow Jones Industrial Average DJIA, +0.56% has slipped 1.5%."}]}