{"article": [{"url": "https://www.marketwatch.com/story/we-need-to-balance-sanity-and-risk-is-it-safer-to-stay-at-a-hotel-or-airbnb-during-your-summer-vacation-2020-06-02", "published": 1593450080.0, "headline": "Is a hotel or an Airbnb safer for your summer vacation? â\u0080\u0098We need to balance sanity and riskâ\u0080\u0099", "body": "When shelter-in-place orders went into effect across the country in March, many Americans quickly sought refunds for hotel bookings, airfare and travel expenses. But now that states have relaxed some social-distancing measures, Americans have gone full-circle and are planning road trips. That trend may be here to stay as â\u0080\u009ctravel will never, ever go back to the way it was pre-COVID,â\u0080\u009d said Airbnb Inc. co-founder and Chief Executive Brian Chesky. But when it comes to lodging, you might be faced with this question: Is it safer to stay at an Airbnb or a hotel? Leaving your home for any reason increases your chances of getting infected and spreading COVID-19, and travel is certainly no exception. Thatâ\u0080\u0099s why the U.S. Centers for Disease Control and Prevention holds that â\u0080\u009cstaying home is the best way to protect yourself and others from getting sick.â\u0080\u009d But if appropriate precautions and considerations are taken into account in advance, you shouldnâ\u0080\u0099t write off a summer getaway entirely, said Thomas Russo, chief of the division of infectious disease at the University at Buffalo. â\u0080\u009cWe need to balance sanity and risk,â\u0080\u009d Russo said. â\u0080\u009cItâ\u0080\u0099s important for us to get out and reemerge from our caves but we need to do so safely.â\u0080\u009d The CDC encourages you to consider some of these questions if you are planning a trip. Before embarking on a trip, â\u0080\u009ctravelers should research the local effects in any area they are planning to visit,â\u0080\u009d said Scott Pauley, a spokesman for the CDC. â\u0080\u009cThe best source for those localized reports are the local health departments for the area they are traveling.â\u0080\u009d For instance, in New York, New Jersey and Connecticut people arriving from states like Texas, Arizona and Florida will have to self-isolate for 14 days. Related: New York, New Jersey and Connecticut want people coming from hot spots to quarantine â\u0080\u0094 but how will they enforce it? “ â\u0080\u0098We need to balance sanity and risk.â\u0080\u0099 ” â\u0080\u0094 Thomas Russo, University at Buffalo If you do travel, the CDC recommends you â\u0080\u009cpick up food at drive-throughs, curb-side restaurant service, or stores,â\u0080\u009d and practice regular social-distancing protocols, including wearing face coverings in public places. Traveling with the people youâ\u0080\u0099ve been sheltering in place with, be it family or roommates, Russo referred to as a â\u0080\u009cfixed risk.â\u0080\u009d Simply getting in a car with them wonâ\u0080\u0099t increase your chances of contracting coronavirus anymore than watching TV at home. Traveling with people from outside your household, however, increases the risk of spreading the virus, he said. Consider whether youâ\u0080\u0099ll be interacting with someone who is more at risk of contracting coronavirus after your vacation, he added, including older adults and people with underlying health conditions.The case for staying at an Airbnb over a hotel Given that person-to-person contact is believed to be the main way coronavirus spreads, experts recommend driving yourself as opposed to traveling by bus, train or airplane. â\u0080\u009cYouâ\u0080\u0099re bound to have fewer interactions with people than you would if you were flying,â\u0080\u009d Russo said. For the same reason, Russo recommends staying at an Airbnb or Airbnb equivalent over a hotel. â\u0080\u009cIn a hotel, itâ\u0080\u0099s inevitable that youâ\u0080\u0099ll have more interactions than at an Airbnb,â\u0080\u009d he said. Related: Redfin CEO: Vacation real-estate markets are â\u0080\u0098toastâ\u0080\u0099 because of the pandemic as Airbnb owners rush to offload their homes Hotels are offering contactless check-ins, but elevators, narrow hallways and the risk of coming into contact with cleaning and administrative staff can make it hard to keep six feet apart from other people. If travel from the U.S. into Canada wasnâ\u0080\u0099t currently restricted, he said, he would have taken the vacation he booked to British Columbia, where he had planned to stay at a home he rented through VRBO, a home rental site owned by Expedia EXPE, +0.36%. In late April, Airbnb rolled out an â\u0080\u009cEnhanced Cleaning Initiativeâ\u0080\u009d, a set of protocols for hosts to follow which were designed by former U.S. Surgeon General Vivek Murthy. “ â\u0080\u0098The beauty of Airbnb is that each property is unique and each host has a lot of discretion.â\u0080\u0099 ” â\u0080\u0094 Sheryl Kline, University of Delaware Hosts are not required to follow the protocols, but those who do â\u0080\u009cwill get a special call-out on their listing page, so guests will know theyâ\u0080\u0099ve committed to following more rigorous cleaning and sanitization practices,â\u0080\u009d an Airbnb post states. Hosts are also encouraged to share with their guests that they taking extra care to sanitize their space due to COVID-19, but â\u0080\u009cyou canâ\u0080\u0099t make unsubstantiated claims, like calling your space â\u0080\u0098COVID-freeâ\u0080\u0099,â\u0080\u009d the company said. Thatâ\u0080\u0099s in line with Airbnbâ\u0080\u0099s business model, said Sheryl Kline, a professor at the University of Delaware who has researched hotel hygiene. â\u0080\u009cThe beauty of Airbnb is that each property is unique and each host has a lot of discretion when it comes to creating the guest experience when renting their properties.â\u0080\u009d That may come with a downside, however. â\u0080\u009cThis flexibility means they do not have the same set of standards as large hotel companies,â\u0080\u009d she added. Given that Airbnb doesnâ\u0080\u0099t inspect the rental properties listed on its platform, it will have to â\u0080\u009crely on the word of the hosts to determine if these new cleaning protocols are followed.â\u0080\u009d â\u0080\u009cI would consider staying at an Airbnb if it had a four-day buffer between guests, was cleaned using their new protocols and if I rented the entire space and did not share it with the host,â\u0080\u009d she said.The case for staying at a hotel Hotels have less discretion when it comes to cleaning rooms, said Chip Rogers, CEO of the American Hotel and Lodging Association. In early May the association introduced industrywide cleaning standards, which Rogers said were reviewed by the CDC. These guidelines are meant to be â\u0080\u009cbaseline standards that can be applied to every hotel across the country.â\u0080\u009d The 16 largest hotel groups in the country including Marriott MAR, -0.96%, Hilton HLT, -1.26% Â and Hyatt H, -2.69% Â have all signed off on these standards and were involved in setting them. Also see: â\u0080\u0098Opening up does not mean social activitiesâ\u0080\u0099: Your coronavirus guide to safely commuting, shopping, traveling and visiting the doctor as states reopen Kline said that these hotels â\u0080\u009chave dramatically improved their cleaning protocols,â\u0080\u009d compared to pre-coronavirus days. â\u0080\u009cThey have implemented housekeeping training programs and use the CDC and the Environmental Protection Agencyâ\u0080\u0099s recommended cleaners and disinfectants.â\u0080\u009d â\u0080\u009cI would feel comfortable staying at a major chain hotel because of the standardization of hotel operating procedures,â\u0080\u009d she said.Best practices to follow no matter where you decide to stay Regardless of whether you choose to stay at a hotel or an Airbnb, â\u0080\u009cit is a good idea to take your own cleaning and sanitizing products and re-clean those areas that are high-touch areas,â\u0080\u009d Kline said. High-touch areas she said include doorknobs, light switches, telephones, remote-control devices, tabletops and bathroom fixtures. Itâ\u0080\u0099s not necessary to bring your own linens and towels â\u0080\u009cif you are staying at a reputable hotel or home rental.â\u0080\u009d In fact, bed linens are â\u0080\u009cmost likely the cleanest item in the guest room because they are washed [after] each guest and most likely washed and changed daily,â\u0080\u009d Kline said. However, she said she wouldnâ\u0080\u0099t use the bedspread, bed scarf or decorative pillows since â\u0080\u009cthey may not be washed as frequently.â\u0080\u009d Alternatively, you could always ask for them to be replaced. And when checking in? Experts recommending bringing your own pen."}]}