{"article": [{"url": "https://www.marketwatch.com/story/covid-marshals-and-moonshot-mass-testinghow-u-k-plans-to-combat-rapid-rise-in-coronavirus-cases-11599675087", "published": 1599727880.0, "headline": "COVID marshals and â\u0080\u0098moonshotâ\u0080\u0099 mass testing â\u0080\u0094 how England plans to combat rapid rise in coronavirus cases", "body": "U.K. Prime Minister Boris Johnson addressed the nation on new social distancing laws and an ambitious testing plan as coronavirus cases rise. Stefan Rousseau/Agence France-Presse/Getty Images An army of â\u0080\u009cCOVID marshalsâ\u0080\u009d will police new social-distancing rules across England as Prime Minister Boris Johnson unveiled a raft of new measures to combat a rapid rise in coronavirus cases. From Monday, the public will face arrest if they gather outside or inside in groups of more than six, Johnson said in his first public coronavirus briefing in six weeks. Rules were relaxed in July to allow friends and family to congregate in groups of up to 30. â\u0080\u009cWe will boost the enforcement capacity of local authorities by introducing COVID-secure marshals to help ensure social distancing in town and city centers,â\u0080\u009d Johnson said making it law that bars and restaurants record the contact details of customers. “ â\u0080\u0098Premises where people meet socially will be legally required to request the contact details of a member of every party, and record and retain these details for 21 days.â\u0080\u0099 ” â\u0080\u0094 Boris Johnson â\u0080\u009cIn future, premises where people meet socially will be legally required to request the contact details of a member of every party, and record and retain these details for 21 days.â\u0080\u009d Read: AstraZeneca vaccine â\u0080\u0098most likelyâ\u0080\u0099 to roll out in the U.K. early next year The government has been forced to act because of a sudden increase in new coronavirus cases in recent days. In April 6,000 new cases were recorded a day, but this dropped to well below 1,000 in June. Newly diagnosed cases have risen beyond 2,000 for the past three days, according to data from the Department of Health and Social Care. â\u0080\u009cThe reason that weâ\u0080\u0099re doingÂ this,â\u0080\u009d the prime minister said, speaking of the new measures, â\u0080\u009cis toÂ prevent another wholesale national lockdown of the kindÂ thatÂ we had in March.â\u0080\u009d Spain, France and Germany have been battling to avoid a second wave, and the U.K. is hoping these swift and strict new rules will stop the spread of the virus. Experts in the U.S. have been following developments in Europe closely. See: COVID-19 death toll hits 57,400 in UK as Brits urged to take pandemic seriously The prime minister also revealed a plan to shift the paradigm in the countryâ\u0080\u0099s testing regime. Johnson now wants to make it easier and faster for people to get a test, and focus on identifying those without the virus to allow as many people â\u0080\u009cto lead more normal livesâ\u0080\u009d as possible.Â Testing will expand to include those who donâ\u0080\u0099t have symptoms, â\u0080\u009cso we can allow them to behave in a more normal way in the knowledge that they canâ\u0080\u0099t infect anyone else with the virus,â\u0080\u009d Johnson said. This is a departure from the current testing regime, which is limited to identifying those with the virus. Read: U.K. strikes two COVID-19 vaccine deals for 90 million doses The new testing plan, which the prime minister called a â\u0080\u009cmoonshot,â\u0080\u009d involves stepping up testing to 500,000 a day by the end of October, and getting test results back to people in 20 to 90 minutes. Johnson said the plan â\u0080\u009cwill require a giant collaborative effort from the government, fromÂ business, from public health professionals, scientists, logistics experts, and many, many more.â\u0080\u009d A pilot project will be rolled out in Salford, near Manchester in northern England, next month to explore the practicality of testing people before attending venues for mass events, like theaters and sports grounds, at indoor and outdoor venues. Drastically ramping up testing capacity and allowing people without symptoms to get a test will also bring implications for those traveling to the U.K. from abroad. Currently, travelers from much of the world are required to self-isolate for 14 days upon arrival to England. If travelers from abroad test negative, they could be released from quarantine. The prime minister outlined plans for a \"moonshot\" new testing regime, including ambitions to return test results in 20 to 90 minutes. Oli Scarff/Agence France-Presse/Getty Images Patrick Vallance, the Johnson governmentâ\u0080\u0099s chief scientific adviser, spoke at the press conference about the news that AstraZenecaâ\u0080\u0099s AZN, +0.63% late-stage coronavirus vaccine trial has been paused because one of the participants developed an unexplained illness. â\u0080\u009cThat is not an unusual thing,â\u0080\u009d at this point in the programâ\u0080\u0099s testing, Vallance said. â\u0080\u009cWe need to make sure with these vaccines that they work, they work well enough, and they are safe.â\u0080\u009d Read: AstraZeneca stock falls as drugmaker pauses vaccine trial after volunteerâ\u0080\u0099s â\u0080\u0098unexplained illnessâ\u0080\u0099 And: AstraZenecaâ\u0080\u0099s coronavirus vaccine setback shows why Big Pharma prefers to be safe than sorry â\u0080\u0094 which is good news Side effects like the ones identified in the AstraZeneca trial happen â\u0080\u009cinevitably,â\u0080\u009d Vallance said, and cautioned that people should expect to see similar pauses in other trials as they progress responsibly. The science adviser reiterated the sentiment from major drug manufacturers this week that trials should proceed with caution and that pauses like the one seen in the AstraZeneca trial are an integral part of the approval process. â\u0080\u009cItâ\u0080\u0099s wrong to just jump over those stages and approve a vaccine on hope.â\u0080\u009d Prime Minister Boris Johnson is flanked by Chief Medical Officer for England Chris Whitty, left, and Chief Scientific Adviser Patrick Vallance at the press conference, convened virtually from Downing Street. Stefan Rousseau/Agence France-Presse/Getty Images"}]}