{"article": [{"url": "https://www.marketwatch.com/story/hsbc-profit-slumps-77-in-first-half-2020-08-03", "published": 1596421460.0, "headline": "HSBC profit slumps 77% in first half", "body": "HSBC Holdings PLC said its first-half net profit plunged from a year earlier, mainly as higher expected credit losses ate into the profit of Europe's largest bank by assets. Net profit for the period plummeted 77% to $1.98 billion from $8.51 billion, said the U.K.-based, Asia-focused bank. Its first-half revenue declined at a smaller rate to $26.75 billion from $29.37 billion, partly weighed by interest rate reductions, HSBC said Monday. \"Our first half performance was impacted by the Covid-19 pandemic, falling interest rates, increased geopolitical risk and heightened levels of market volatility,\" Group Chief Executive Noel Quinn said in an earnings statement. In the first half, the bank's credit impairment charges jumped by $5.7 billion to $6.9 billion due to the economic fallout from the pandemic, as well as higher charges related to specific wholesale customers, it said. HSBC estimates its full-year credit impairment charge for 2020 to fall to between $8 billion and $13 billion. This compared with an earlier forecast made in April, when the bank said it will set aside as much as $11 billion for bad loans this year, up from $2.76 billion last year. HSBC, which makes most of its profit in Hong Kong and mainland China, expects headwinds from the pandemic to continue affecting its performance in the second half and said it intends to take additional cost action to mitigate revenue pressure. The lender resumed a plan in June to lay off 35,000 workers, or about 15% of its workforce. The plan had been put on hold in March, as its staff scrambled to keep the company operational around the world when the pandemic spread globally. Given the current high degree of uncertainty, it intends to provide an update on its medium-term financial targets and dividend policy when announcing its year-end results for 2020, HSBC said. HSBC and a host of Britain's largest banks earlier this year cancelled dividend payouts at the request of the Bank of England, a move aimed at shoring up their capital buffers against economic shocks stemming from the pandemic. Write to Martin Mou at martin.mou@wsj.com"}]}