{"article": [{"url": "https://www.marketwatch.com/story/facebook-shares-rally-as-quarterly-result-easily-top-street-view-2020-07-30", "published": 1596177800.0, "headline": "Facebook shares rally as quarterly results easily top Street view", "body": "Facebook Inc. shares rallied in the extended session Thursday after the social-media giant blew past Wall Street estimates for the second quarter and addressed how advertiser boycotts could potentially affect their business. Facebook FB, +0.26% shares surged more than 7% in after-hours trading Thursday, following a 0.5% rise to close the session at $234.50. The stock was up 6.2% premarket Friday. The company reported net income of $5.18 billion, or $1.80 a share, compared with net income of $2.62 billion, or 91 cents a share, in the year-ago quarter. Revenue improved 11% to $18.69 billion from $16.89 billion a year ago. Analysts surveyed by FactSet had expected adjusted earnings of $1.39 a share on sales of $17.34 billion. Monthly active users, or MAU, a key indicator of Facebook’s growth and advertising appeal, improved to 2.7 billion. FactSet analysts had projected 2.63 billion, up 8.8% from the 2.41 billion reported a year ago. Daily active users, or DAU, rose 12% to 1.79 billion, while analysts expected 1.75 billion. Read more: Facebook has weathered many storms, but the latest are coming for its core The embattled company is in the grips of a worldwide ad boycott by more than 1,100 companies that object to hate speech, violent content and misinformation on Facebook’s digital platforms. The Who’s Who of major brands that have either added their names to the #StopHateForProfit campaign or otherwise pulled their ads range from Coca-Cola Inc. KO, +0.69% and Starbucks Corp. SBUX, +0.53% to Ford Motor Co. F, -1.36% and Microsoft Corp. MSFT, +2.48%. “We do not profit from misinformation or hate,” Facebook Chief Executive Mark Zuckerberg said on the conference call. The full scope of the boycott’s financial damage won’t be known until Facebook reports its third-quarter results. On the call, David Wehner, Facebook chief financial officer, said that the company’s largest 100 advertisers accounted for just 16% of revenue in the second quarter, a slightly lower percentage that it was a year ago. Three-fourths of Facebook’s revenue comes from small- and medium-sized companies, though it remains to be seen if those companies pull back on ad spending while in the grips of the worsening pandemic. See also: Here are the major brands that have pulled ads from Facebook Wehner said in the first three weeks of July, Facebook’s year-over-year ad revenue growth rate was roughly in line with its second-quarter revenue growth rate of 10%. “We expect our full-quarter Q3 year-over-year ad revenue growth rate to be roughly similar to this July performance,” Wehner said, adding that the boycott was reflected in this trend, along with factors like economic insecurity. MAUs and DAUs are expected to be “flat or slightly down in most regions” in the third quarter as shelter-in-place restrictions ease, Wehner said. On the call, Zuckerberg said Facebook has more than 9 million active advertisers and cautioned that while ad boycotts could hurt Facebook’s revenue, “the much bigger cost of such a move would be to reduce the effectiveness of the ads and opportunities for small businesses to grow.” “This would reduce opportunities for small businesses so much that it would probably be felt at a macroeconomic level,” Zuckerberg said. “And is that really what policy makers want in the middle of a pandemic and recession?” Zuckerberg was one of four tech CEOs — Apple Inc.’s AAPL, +1.74% Tim Cook, Amazon.com Inc.’s AMZN, +3.01% Jeff Bezos, and Sundar Pichai of Google parent Alphabet Inc. GOOGL, +1.82% GOOG, +1.97% were the others — to testify before a House antitrust subcommittee on Wednesday. (Facebook was originally scheduled to report second-quarter results on Wednesday but pushed them back to Thursday.) Facebook shares are up 14% this year. The broader S&P 500 index SPX, +0.87% is up 0.6% in 2020."}]}