{"article": [{"url": "https://www.marketwatch.com/story/goldman-sachs-cuts-2020-us-growth-outlook-as-covid-19-cases-soar-2020-07-06", "published": 1594023980.0, "headline": "Goldman Sachs cuts 2020 U.S. economy's growth outlook as COVID-19 cases soar", "body": "Goldman Sachs has downgraded its U.S. growth outlook for 2020, saying a reimposition of COVID-19 restrictions due to surging cases across swaths of the country will weigh on consumer spending. That's according to the bank's chief economist, Jan Hatzius, in a note to clients sent out over the Fourth of July weekend, which saw the U.S. record nearly 156,000 new coronavirus cases. \"The healthy rebound in consumer-services spending seen since mid-April now appears likely to stall in July and August as authorities impose further restrictions to contain virus spread,\" the economist and his team said. \"Over the last few weeks, the COVID situation in the U.S. has worsened signiï¬\u0081cantly to the point where the U.S. is now a notable outlier among advanced economies,\" he said, adding that states representing over half the U.S. population now meet just one or zero of the Centers for Disease Control and Prevention-recommended gating criteria for reopening. Hatzius now expects a contraction in 2020 U.S. growth of 4.6%, versus a previous forecast for a 4.2% drop. For 2021, the bank is sticking to its forecast for growth to rebound 5.8%. The good news is that Goldman doesn't think the consumer comeback has stalled out completely, and expects the economy will likely get back on track in September, for two reasons: \"First, other major economies have returned to similar levels of activity while containing the virus, showing that further progress is feasible. Second, policy and behavioral changes such as mask wearing offer opportunities for controlling the virus at minimal economic cost. The recent implementation of a mask mandate in Texas shows that U.S. authorities are willing to adapt,\" said Hatzius. Inspiration can also be found via how other countries are managing right now, he noted. \"Similar economies have clearly found a more efï¬\u0081cient way to balance reopening the economy and keeping the virus under control, and we think the U.S. is likely to eventually ï¬\u0081nd its way to a better approach too,\" he said. Read:Mask wearing could save the domestic economy from a 5% hit to GDP, Goldman says"}]}