{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-pandemic-will-continue-for-some-time-experts-tell-congress-as-us-case-tally-nears-45-million-2020-07-31", "published": 1596195380.0, "headline": "Coronavirus update: Pandemic will continue for some time, experts tell Congress as U.S. case tally nears 4.5 million", "body": "With close to 4.5 million Americans confirmed to have been infected with the coronavirus illness COVID-19, the pandemic will continue for some time, public health officials will tell Congress on Friday, underscoring the importance of following their recommendations on face masks, frequent hand washing and social distancing. “While it remains unclear how long the pandemic will last, COVID-19 activity will likely continue for some time,” Dr. Anthony Fauci, head of the National Institute for Allergies and Infectious Diseases, along with Centers for Disease Control and Prevention head Dr. Robert Redfield and Health and Human Services testing czar Adm. Brett Giroir will say, according to prepared testimony for a special House panel investigating the pandemic. The U.S. is still seeing high case numbers across the South and the West in states that reopened quickly and are now experiencing record numbers of one-day infections. Testing constraints are still being reported, as well as stress on hospital systems. The race for a vaccine, meanwhile, although progressing at a faster clip than in other epidemics, has not yet produced a clear breakthrough. France’s Sanofi SA. SAN, +1.20% and U.K. drug maker GlaxoSmithKline PLC SAN, +1.20% said they will receive $2.1 billion in funding from the U.S. government’s Operation Warp Speed program, aimed at accelerating the development of their vaccine candidate and have agreed to deliver 100 million doses to the U.S. The program has invested more than $8 billion in developing a vaccine, according to data provided by the government agency, Biomedical Advanced Research and Development Authority, backing numerous candidates and trials and paying for the manufacture of doses even before trials have been completed. On Thursday, Dr. Deborah Birx, coordinator of the White House Task Force created to manage the pandemic, urged states and localities with rising cases to mandate face masks. In an interview with Fox News, Birx said there is a “very serious pandemic” in Southern states and its moving fast. “So now we see the virus, probably because of vacations and other reasons of travel, moving up into Kentucky, Tennessee, southern Ohio, Missouri, Iowa, Kansas, Nebraska,” she said. “And, of course, we continue to have problems across the coast — Washington, Oregon, California, Idaho and Utah, and now increases in Colorado.” Dr. Michael Osterholm, epidemiologist at the University of Minnesota, told MarketWatch’s Jaimy Lee in an interview that the U.S. effort to contain the virus has failed because victory was declared long before it made sense. Early hot spot New York and neighboring states succeeded in getting their outbreaks under control by strict lockdowns that were followed by very gradual reopenings. Other states did not follow suit. “This virus has been poised to be transmitted in our communities, and we thought we had done enough to get it down. It’s like a fire crew. I only put out half the forest fire but you know, I put out half so we’re done. And then look what happened. It’s burned more acres since we gave up than it did before we gave up,” he said. For more:Dr. Osterholm: Americans will be living with the coronavirus for decades The U.S. has counted another 2,000 deaths since the death toll surpassed 150,000 on Wednesday. The toll now stands at 152,075, according to data aggregated by Johns Hopkins University. Florida and Arizona broke one-day records for fatalities on Thursday, with Florida counting 253 deaths and Arizona 48, the New York Times reported. Mississippi, Hawaii and Ohio set one-day records for new cases. A total of 67,167 new cases were counted across the U.S. on Thursday, above the average of 64,632 a day recorded in the last week, according to a New York Times tracker. There are 27 states showing rising cases over the last 14 days, and 20 that are pretty much the same. Latest tallies There are now 17.3 million confirmed cases of COVID-19 worldwide, the Johns Hopkins data show, and at least 673,868 people have died. More than 10 million people have recovered. Brazil is second to the U.S. with 2.6 million cases and 91,263 deaths. India is third measured by cases at 1.6 million, followed by Russia with 838,461 and South Africa with 482,169. The U.K. has 303,913 cases and 46,084 fatalities, the highest in Europe and third highest in the world. China, where the illness was first reported late last year, has 87,610 cases, and 4,661 fatalities. Read also:Young people could be driving a surge in coronavirus cases in Europe, warns the WHO In Europe, Germany added another three Spanish regions to its list of high-risk destinations, the Guardian reported. Spain is currently suffering fresh outbreaks in tourist hot spots Barcelona and the beaches of the Costa Brava. Germans arriving from those areas will be required to produce a negative test of quarantine for 14 days. Don’t miss:Top coronavirus doctor in Spain has a message for tourists: ‘A couple of drinks, you take off your mask, you sing and you dance, that’s a problem’ France health officials reported a 54% increase in COVID-19 cases in the last week, according to its health department. The rise has been especially strong in people aged 20 to 30 as France braces for a heat wave that could see temperatures above 100 degrees Fahrenheit.What’s the latest medical news? Medical news was dominated by the Sanofi-Glaxo funding news, the highest amount awarded by the U.S. government so far. The Phase 1/2 study for the Sanofi/GSK vaccine is expected to begin in September. “No single vaccine or company will be able to meet the global demand alone,” Thomas Triomphe, global head of Sanofi Pasteur, the drugmaker’s vaccines business, said in a news release. Both companies also said they are in talks with the European Commission, as well as France and Italy, about supplying Europe with their vaccine. In other news, Laboratory Corp. of America Holdings LH, +0.77% is planning to create a program offering total antibody testing at no charge as a way to support blood plasma donations as a treatment for COVID-19. See also:Kodak’s stock triples as company announces pandemic plan to start making pharmaceutical ingredients Blood plasma is currently being evaluated as a possible treatment for patients with an active COVID-19 infection. LabCorp said it will run the program using individual patients’ own doctors. “LabCorp is currently working with public health authorities and the provider community on the details of the three-month program and will provide additional information in the near future,” the company said in a statement. Gilead Sciences Inc. GILD, +0.82% said it expects to produce more than 2 million courses of remdesivir by year-end, its experimental treatment for COVID-19 patients that won emergency use authorization from the U.S. Food and Drug Administration in May. The company offered the forecast as part of second-quarter earnings released late Thursday. It is unclear whether remdesivir will be a moneymaker for the drugmaker as the first doses were donated for free, though some analysts have predicted at least $1.5 billion in sales of the drug this year alone. Gilead has also recently announced that it will study the infused drug in pregnant women, in children, in combination with other treatments, and in an inhaled format.What are companies saying? Earnings season brought numbers from the Big Tech quartet of Alphabet Inc. GOOGL, +1.82% GOOG, +1.97%, Amazon.com Inc. AMZN, +3.01%, Apple Inc. AAPL, +1.74% and Facebook Inc. FB, +0.26% reported results after Thursday’s closing bell, and found they are just getting bigger in the face of the pandemic and antitrust scrutiny, as MarketWatch’s Therese Poletti reported. The four collectively crushed Wall Street’s expectations a day after a five-and-a-half-hour-long congressional hearing on anticompetitive practices in which their CEOs answered questions from lawmakers on their dominant positions in the marketplace. Their stocks in after-hours trading mirrored that view, with all four stocks gaining and pushing toward a combined market cap increase of more than $200 billion. The four companies combined were worth almost $5 trillion at the close. See now:How Apple’s stock split will change the pecking order in the 124-year old Dow industrials Combined revenue for the four — excluding traffic acquisition costs, or TAC, for Google parent Alphabet — was $198.11 billion, with Amazon reporting the most stunning revenue and earnings beat after Chief Executive Jeff Bezos promised to spend all of Amazon’s profit on responding to the pandemic. See:Two stock market risks are hiding in Apple, Amazon, Facebook and Alphabet With more people stuck at home and relying on shopping online and working on cloud-computing power, Amazon’s net income was instead a record for the e-commerce giant. Chief Financial Officer Brian Olsavsky told analysts on its conference call that online grocery sales tripled in the quarter and world-wide video streaming doubled from a year ago. Amazon’s physical stores saw a 13% decline, however, as more consumers used online grocery delivery services while sheltering in place. Wall Street had been looking for the four giants to report a combined revenue of $181.5 billion, according to FactSet, compared with $165.7 billion in the year-ago quarter, excluding TAC for Alphabet. Combined revenue for the four grew nearly 20%. There was good news for videogame maker Electronic Arts Inc. EA, +1.15% , which posted its best-ever quarter thanks to a surge in player engagement during stay-at-home periods. The videogame maker also said it has added tens of millions of new players as more people are staying home, and that demand for flagship games such as “Madden NFL,” “FIFA,” “The Sims” and more is unprecedented.“ We expect these trends to continue during and after the pandemic,” said CEO Andrew Wilson on the company’s earnings call. Friday’s releases were more mixed with oil majors Chevron Corp. CVX, -1.62% and Exxon Mobil Inc. XOM, -1.47% posting predictably disappointing numbers, hurt by the twin effects of weak oil prices and weak demand during the pandemic. AbbVie Inc. ABBV, +0.41% , fresh from its takeover of Allergan Inc., said that company’s flagship Botox product saw sales slide 43% as consumers were stuck at home. Colgate-Palmolive Co. CL, +1.30% fared better thanks to continued strong demand for liquid soap and other cleaning products. Pinterest Inc. PINS, -0.50% surprised investors with better-than-expected numbers as the photo platform seemed to benefit form at-home online activity. How Airlines Can Survive the Pandemic Here’s the latest news on companies and COVID-19: • Caterpillar Inc. CAT, +1.45% the maker of construction and mining equipment and engines and turbines, reported second-quarter profit and revenue that fell as a result of the impact from the pandemic, but beat Wall Street expectations. Total revenue dropped 31% to $10.00 billion, but was above the FactSet consensus of $9.40 billion, as revenue from Caterpillar’s construction, resource industries and energy and transportation businesses all fell less than forecast. Dealers decreased machine and engine inventories by about $1.4 billion, compared with an increase of about $500 million a year ago. The company expects the pandemic will impact its results for the rest of 2021, but will not provide a financial outlook given the uncertainties of that impact. • Chevron posted weaker-than-expected earnings for the second quarter, hit by the twin effects of a weak oil price and depressed demand during the pandemic. San Ramon, Calif.-based Chevron said it had a net loss of $8.3 billion, or $4.44 a share, in the quarter, after income of $4.3 billion, or $2.27 a share, in the year-earlier period. Excluding special items, the company’s adjusted per-share loss came to $1.59, wider than the loss per share of 93 cents forecast by FactSet analysts. Revenue slid to $16 billion from $36 billion a year ago, also below the $21.9 billion FactSet consensus. “The past few months have presented unique challenges,” said CEO Michael K. Wirths said in a statement. “The economic impact of the response to COVID-19 significantly reduced demand for our products and lowered commodity prices. Given the uncertainties associated with economic recovery, and ample oil and gas supplies, we made a downward revision to our commodity price outlook which resulted in asset impairments and other charges.” • Colgate-Palmolive company beat second-quarter earnings estimates amid strong demand for soap and cleaning products during the pandemic. New York-based Colgate’s profit and sales rose. “We continue to see elevated demand across our geographies in certain categories such as liquid hand soap, dish liquid, bar soap and cleaners,” CEO Noel Wallace said in a statement. “In other categories, we are starting to see the impact of consumers working down their pantry inventories, particularly in Europe.” The company is not offering guidance due to the uncertainty created by the pandemic. • Electronic Arts reported first-quarter earnings and revenue that beat Wall Street expectations on the strength of new game updates and increased player engagement during the pandemic. The company also said it saw tens of millions more new players. The Redwood City, Calif.-based company reported first-quarter net income of $365 million, or $1.25 a share, compared with $1.4 billion, or $4.75 a share, which included one-time tax benefits, in the year-ago period. Revenue rose to $1.46 billion from $1.21 billion in the year-ago quarter. The company had adjusted earnings of $1.42 a share on net bookings, the amount of products and services sold digitally or physically, of $1.39 billion in the quarter. Analysts surveyed by FactSet had forecast earnings of 80 cents a share on revenue of $1.05 billion. • Exxon Mobil reported a wider-than-expected second-quarter loss and revenue that fell more than forecast, as the global oversupply of oil and the pandemic drove down results. Oil-equivalent production fell 7% to 3.6 million barrels a day, which was above the FactSet consensus of 3.4 million barrels a day, as liquids production fell 3% and natural gas decreased 12%. “The global pandemic and oversupply conditions significantly impacted our second quarter financial results with lower prices, margins, and sales volumes,” said Chief Executive Darren Woods. The company said it doesn’t plan to take on more debt, as it believes it has already increased debt to a level that is “appropriate” given current market uncertainties. • Merck & Co. Inc. MRK, -0.14% reported second-quarter profit and sales that beat expectations, while pharmaceutical sales fell from the effects of the pandemic, and raised its full-year outlook. Sales fell 8% to $10.87 billion, but was above the FactSet consensus of $10.44 billion, as pharmaceutical sales declined 7% to $9.68 billion. Animal health sales slipped 2% to $1.10 billion, but topped expectations of $944.6 million. The company estimates the negative effect of the pandemic on revenue to be about $1.6 billion, consisting of about $1.5 billion in pharmaceuticals and $100 million from animal health. Among Merck’s biggest selling drugs, Keytruda sales rose 29% to $3.39 billion, above expectations of $3.13 billion, while Januvia/Janumet sales slipped 7% to $1.34 billion to top expectations of $1.26 billion. • Pinterest shares soared after the photo platform easily topped expectations and gave an upbeat forecast for the third quarter. The company said that it expects revenue for July to be up around 50% through July 29, relative to a year earlier, and that overall third-quarter revenue could be up in the mid-30% range. “We are encouraged by the performance of our business in July, but a tremendous amount of uncertainty remains given the ongoing COVID-19 pandemic and other factors,” Pinterest said in its release. The company saw monthly active users in the June quarter climb to 416 million from 367 million in the March quarter. That number far exceeded the FactSet consensus, which was looking for 379 million monthly active users for the June period. The company had 96 million monthly active users in the U.S. and 321 million internationally. Global average revenue per user fell to 70 cents from 88 cents for the quarter, but came in ahead of estimates for 67 cents. • Under Armour Inc. UAA, -0.39% reported second-quarter revenue that was well ahead of expectations, although its loss widened during the pandemic. Revenue in North America was down by 45% to $450 million. Under Armour’s Chief Executive Patrik Frisk says most of the company’s stores have reopened and the company is “encouraged by some of the momentum [it has] experienced in June and July.” • VF Corp. VFC, -0.91%, the apparel and accessories company with brands including Vans and The North Face, reported a narrower-than-expected fiscal first-quarter loss and revenue that fell less than forecasts. The company said 75% of its North America stores were open at the end of the quarter, as the company continued to feel the effects of the pandemic. While some additional stores have reopened since then, those were partially offset by over 120 retail stores that have re-closed due to the resurgence of COVID-19 outbreaks. The company swung to a net loss of $285.6 million and revenue fell 48% to $1.08 billion, as beats by outdoor and work revenue offset a miss in active revenue. • World Wrestling Entertainment Inc. WWE, +0.77% reported fiscal second-quarter results that exceeded Wall Street estimates. The company laid off employees during the quarter as part of significant cost cutting. Revenue fell 17% to $223.4 million from $268.9 million a year ago. WWE has been hit harshly by coronavirus, which has eliminated its ability to host events with fans and, surprisingly, driven its TV ratings to all-time lows. And with the return of professional sports, those ratings could plunge even lower. • XPO Logistics Inc. XPO, -0.65% reported a narrower-than-expected quarterly loss and sales came in above forecasts. “The ramifications of COVID-19 dominated the second quarter,” Chief Executive Bradley Jacobs said in a statement. “Business trends improved across our segments and geographies as the quarter progressed, and continued in July. We’ve seen a recovery take hold in Europe and start in North America.” E-commerce continues to be the company’s “strongest tailwind,” he said."}]}