{"article": [{"url": "https://www.marketwatch.com/story/were-focused-on-the-paper-returns-as-the-irs-re-opens-offices-how-long-will-it-take-to-receive-your-tax-refund-2020-07-15", "published": 1595234300.0, "headline": "When will I get my tax refund? 'We're focused on the paper returns,' the IRS says as it reopens offices", "body": "As tax season winds down, the Internal Revenue Service is gearing up its operations. The federal tax collector's plans and procedures have been upended this year, like countless other government agencies and companies contending with the coronavirus pandemic. The IRS temporarily closed offices in March due to the COVID-19 public-health emergency and the filing deadline was pushed from April 15 to July 15. On top of that, lawmakers tasked the agency with distributing millions of stimulus checks, beginning in April. The IRS started reopening its offices last month after 90% of its facilities were closed at the peak of the pandemic. The IRS has processed 130.5 million returns by July 3, down 9.5% from the same point last year when it had already processed 144.3 million, according to the most recent data. It's issued 95.2 million refunds so far, which is 9.6% fewer issued refunds than the same point last year. As of late June, the IRS was also working its way through 12.3 million pieces of correspondence, IRS Commissioner Charles Rettig told senators at a June 30 Finance Committee hearing. Paper tax returns are the top priority in the mountain of documents, he noted. \"We're focused on the paper returns because many of those also obviously will have refunds,\" Rettig said, referring to the tax credit for low- and moderate-income families. Don't miss:Government tax watchdog: IRS should not waste time pursuing $1 billion in stimulus checks sent to dead people The IRS is processing paper returns in the order it receives them. When it comes to on-site office returns, Rettig said the IRS has focused first on staffing up its capacity to issue refunds and handle customer service calls. \"We're trying to ramp up as quickly as we can,\" he said. By this week, all of the IRS processing facilities and call centers were scheduled to be open, Rettig said last month, \"understanding that 'open' is a relative term for socially distanced working, different schedules, working different shifts, having people spread out.\" The IRS did not immediately respond to a request for comment on the latest working status for its facilities. So when will I get my refund? Anxious taxpayers don't need to raise their stress level by constantly refreshing the page. The refund tracker gets updated once a day, and it's usually overnight, the IRS says. (Around 98% of all returns with refunds are processed and paid in 21 days, Rettig noted during his testimony.) The average refund, a reimbursement for overpayment of income tax, is $2,762. That's basically unchanged from last year's average amount - and worth more than two $1,200 stimulus checks. In theory, they should start to arrive around the same the additional $600 in weekly unemployment benefits expire at the end of July. “ 98% of all refunds should be processed and paid in 21 days, but there may be delays given the extraordinary set of circumstances related to the pandemic. ” If a taxpayer has already submitted their tax return, they can track the status of their refund through the IRS' \"Where's My Refund?\" portal. Users need to supply their Social Security or individual taxpayer identification number. They must also provide their filing status and exact refund amount. If you have already submitted your tax return and expect money, track the refund status through the IRS site, experts told MarketWatch. Rafael Alvarez, CEO and founder, of ATAX, a national tax-preparation company, said if you haven't yet filed your return, do so electronically and supply bank-account information for a direct-deposit receipt. A taxpayer who doesn't supply bank-account information will get a paper check for their refund, which could prolong the wait by a week, Alvarez said. If you already submitted a return without bank account information, you can give updated account information to the IRS. However, Alvarez said that may be a tough task for a backlogged agency that's wary of enabling scammers who could make off with someone else's refund money. \"It can be modified by talking to IRS agents, but you need to explain the reason why you are doing this,\" Alvarez said. See also:Taxpayers who wait to file their taxes can get interest on their refund - what you need to know ahead of July 15 tax deadline The IRS was never an agency designed for downtime given its time-sensitive work, according to Robert Kerr, executive vice president of the National Association of Enrolled Agents, a trade organization for tax professionals. That's especially true during filing season, he added. He credits the IRS for doing its best under extraordinary circumstances, but says the sheer number of returns mean a small percentage of snafus and delays can equate to big numbers. For example, the IRS has fraud and error filters to screen out potentially questionable returns. Some mistakenly flagged returns are taking a long time to fix and send refunds, according to the National Taxpayer Advocate report. \"When these returns bounce, they bounce to somebody's desk,\" Kerr said."}]}