{"article": [{"url": "https://www.marketwatch.com/story/uk-and-eu-hint-again-at-possible-compromise-on-trade-deal-heres-why-it-matters-this-time-2020-10-08", "published": 1602227060.0, "headline": "Trade-deal compromise is possible, Boris Johnson hints â\u0080\u0094 weâ\u0080\u0099ve heard that before, but hereâ\u0080\u0099s why it matters this time", "body": "Negotiators for the U.K. and the European Union started a new round of intensified trade talks on Wednesday, aiming at striking a deal on their tough, 10-months-long negotiations before a crucial summit of EU heads of states and governments on Oct. 15. â\u0080¢ In a sign of concession from London, chief U.K. negotiator David Frost told the House of Lords that the government would consider going â\u0080\u009cfurther than you normally do in a free-trade agreementâ\u0080\u009d on the crucial questions of state aid rules and regulations. â\u0080¢ Cabinet office minister Michael Gove opined that the way the talks have evolved in the last few weeks is â\u0080\u009ccause for steady optimism.â\u0080\u009d He added that he now saw the odds for a deal at 66%. â\u0080¢ Both U.K. Prime Minister Boris Johnson and EU Council President Charles Michel said after a phone conversation on Wednesday that a deal would be preferable for both camps. â\u0080¢ Bank of England Gov. Andrew Bailey said in an interview that the two sides should be able to strike a deal, if only because â\u0080\u009cit is in the interest of both sides â\u0080\u0094 letâ\u0080\u0099s be blunt â\u0080\u0094 to get an agreement.â\u0080\u009d In a separate intervention before an EU panel on Thursday, Bailey acknowledged that the post-Brexit transition â\u0080\u009cwould have been easier had we not have to deal with COVID.â\u0080\u009d Opinion: The U.K. economy was crippled before the virus hit. More reason for the government to be careful about Brexit The outlook: Both camps acknowledge that â\u0080\u009csignificant differencesâ\u0080\u009d remain on both the state aid and the fisheries questions. The upbeat mood does signal a change of tone compared with the previous weeksâ\u0080\u0099 acrimony. But in the last months, sudden warnings or ultimatums have often followed days of cautious optimism. The EU launched a legal procedure last week against the U.K.â\u0080\u0099s recent â\u0080\u0098internal market bill,â\u0080\u0099 which reneges on key aspects of the withdrawal agreement and its protocol on Ireland signed by the two sides last year. Before a deal can be struck, it may require the EU leadersâ\u0080\u0099 ultimate green light next week, which would then lead to both sides rushing to claim major political victories, however serious or flimsy the evidence. Read: Biden to Brexit Britain: No trade deal with U.S. if you mess with Ireland"}]}