{"article": [{"url": "https://www.marketwatch.com/story/its-like-the-wild-west-in-the-stock-market-with-the-get-rich-crowd-vs-wall-st-pros-but-its-too-easy-to-blame-retail-investors-for-rampant-speculation-2020-06-13", "published": 1592216720.0, "headline": "Itâ\u0080\u0099s like the Wild West with â\u0080\u0098get-rich-quick crowdâ\u0080\u0099 vs. Wall Street pros, but itâ\u0080\u0099s too easy to blame retail investors for â\u0080\u0098rampant speculationâ\u0080\u0099", "body": "Tales of out-of-work 20- and 30-somethings using coronavirus stimulus checks to scoop up stocks on Wall Street with reckless abandon are coming fast and furious, but the reasons behind the recent fervor for investing is, perhaps, far simpler. MarketWatch has written a bit about the rising influence of retail investors of late, including in an article by Mark Hulbert here, and another by columnist Howard R. Gold. A New York Post story cited Deutsche Bank analyst Parag Thatte as attributing much of the nearly 40% surge in the U.S. stock market since its late-March nadir to unexperienced small investors with a voracious appetite for risk. The analyst suggested that Wall Street professionals are being forced to chase amateurs who have bid up equities. Tobias Levkovich, Citigroupâ\u0080\u0099s chief U.S. equity strategist, in a research report last Friday asking whether the market was â\u0080\u009cGetting Bubblicious,â\u0080\u009d similarly surmised that investors were starting to chase performance, as Citiâ\u0080\u0099s closely followed Panic/Euphoria index reached its most euphoric level since 2002, Barronâ\u0080\u0099s Ben Levinsohn noted. â\u0080\u009cThereâ\u0080\u0099s definitely a fear of missing out. Thatâ\u0080\u0099s why people are chasing the market,â\u0080\u009d said Nick Maroutsos, co-head of global bonds at Janus Henderson Investors, in an interview with MarketWatch. In a late-May Bloomberg podcast, Levkovich referred to that sentiment as not fear of missing out, or FOMO, but fear of meaningfully underperforming, or FOMU. Are retail investors at the root of this? Some have made the case that an era of zero-commission discount brokerage trades, ushered in by Charles Schwab SCHW, +1.29%, and platforms like Robinhood that cater to younger investors, combined with a dearth of diversions due to COVID-19 lockdowns and unemployment, have created a perfect environment for newly minted day traders. â\u0080\u009cIt got too easy, and now we all have to suffer as the get-rich-quick crowd gets blown out,â\u0080\u009d CNBCâ\u0080\u0099s Jim Cramer said on his â\u0080\u009cMad Moneyâ\u0080\u009d show on Friday, describing the current environment as one of â\u0080\u009crampant speculation.â\u0080\u009d The entryÂ into day tradingÂ has never been as seamlessÂ as it was withÂ â\u0080\u009ca large population of people looking for something to do that can set up an environmentÂ where there isÂ a lot of retailÂ speculation,â\u0080\u009d National Securities strategist Art Hogan told MarketWatch. However, itâ\u0080\u0099s hard to make the argument that mom-and-pop investors are leading a new dawn of investing on Wall Street, captained by the outspoken Barstool Sports founder Dave Portnoy, who has suggested that heâ\u0080\u0099s better suited to the current investing environment than legendary long-range investor Warren Buffett. A Financial Times story named Portnoy as prominent among a new breed of investors of the mind that stocks only move in one direction: upward. â\u0080\u009cRetail bros,â\u0080\u009d the FT calls them. Historically, retail investors and those who day trade, in the grand scheme of things, represent a small portion of the overall trading on Wall Street, even if discount brokerages are seeing a spike in new accounts. A recent research report from Barclays by analyst Ryan Preclaw concluded that retail investors are not behind the marketâ\u0080\u0099s enormous moves and noted that purchases on the Robinhood platform actually underperformed. â\u0080\u009cJust because two things happen at the same time doesnâ\u0080\u0099t mean one causes the other,â\u0080\u009d said Preclaw. â\u0080\u009cAnd while itâ\u0080\u0099s true that many high-return stocks have had a substantial increase in retail ownership, low-return stocks have also had a big increase,â\u0080\u009d the analyst wrote (see attached chart). Source: Barclays Individual investors are unlikely to account for Thursdayâ\u0080\u0099s vicious stock-market selloff, which saddled the Dow Jones Industrial Average DJIA, +0.56%, the S&P 500 index SPX, +0.87% and the Nasdaq Composite Index COMP, +1.39% with their biggest weekly losses since the week ended March 20, even with a partial rebound in stocks on Friday, according to Dow Jones Market Data. CNBCâ\u0080\u0099s Cramer may have characterized the current dynamic most aptly when he speculated that professionals, who have been accused of mostly sitting on the sidelines of this epic rally, are strategically taking advantage of the day-trader crowd. But even if retail investors are jumping into stocks, it would be hard to blame them. The Federal Reserveâ\u0080\u0099s balance sheet ballooned from around $4 trillion in March to $7.2 trillion this week in support of the economy. Some expect that portfolio will grow to possibly $10 trillion before the end of the coronavirus public health crisis, as Fed Chairman Jerome Powell aims to ensure that financial markets that were unhinged at the start of this recession remain liquid and healthy. On Wednesday, Powell said the economy could be troubled for a while but the Fedâ\u0080\u0099s interest-rate projections imply that easy-money policies will be in place through 2022. However, an unintended byproduct of those efforts is the threat of asset bubbles. Asked about this at the news conference that followed the Fedâ\u0080\u0099s policy update on Wednesday, Powell said that the central bankâ\u0080\u0099s main focus is on getting the labor market back into shape. â\u0080\u009cI would sayÂ if we were to hold back because ... we would never do this ... but just the concept that we would hold back because we think asset prices are too high, others may not think so,â\u0080\u009d the Fed boss explained. He added, â\u0080\u009cWhat would happen to the people that weâ\u0080\u0099re actually, legally supposed to be serving? Weâ\u0080\u0099re supposed to be pursuing maximum employment and stable prices, and thatâ\u0080\u0099s what weâ\u0080\u0099re pursuing.â\u0080\u009d In many ways, buying of stocks on Wall Street has been buttressed by the perception of unrelenting support from the Fedâ\u0080\u0099s historic measures to stabilize the economy, federal funds interest-rate futures rates in a range of 0% and 0.25%, and the 10-year Treasury note TMUBMUSD10Y, 0.777% closing out Friday at a meager rate of 0.704%. â\u0080\u009cThey look at Treasurys trading at a less than 1% yield and cash offering zero, so they decide maybe you take some risk,â\u0080\u009d Tony Rodriguez, head of fixed-income strategy at Nuveen, told MarketWatch. On top of that is a sense that many investors missed out on the fantastic rebound in the equity markets from the 2008-09 financial crisis, which ushered in an 11-year bull market that ended in March. One of the curious features of this market has been the purchasing of shares of bankrupt companies, including car-rental company Hertz Global Holdings Inc. HTZ, -1.78%, which on Friday received unprecedented permission to issue stock to investors, despite the risk that the value of those shares could plunge to zero. Check out: In latest market rally, even companies filing for bankruptcy get love Powell is scheduled to deliver the Fedâ\u0080\u0099s semiannual update to Congress on Tuesday and Wednesday, and heâ\u0080\u0099s likely to field questions about the state of the economy and the unintended consequences of the Fedâ\u0080\u0099s actions. JJ Kinahan, chief market strategist for TD Ameritrade, told MarketWatch that too much has been made of the entry of retail investors, who missed out on a lot of action in recent years. â\u0080\u009cLetâ\u0080\u0099s go back two years ago, when everyone was throwing up their hands over how thereâ\u0080\u0099s no participation in the market,â\u0080\u009d he said. â\u0080\u009cOne of the things that we try to do is to educate people that [they] are playing with fireâ\u0080\u009d when they invest in certain stocks, â\u0080\u009cbut if people go in and they are willing to take that risk knowing what the risk is â\u0080\u0094 thatâ\u0080\u0099s choice,â\u0080\u009d Kinahan said. Meanwhile, it will be a quiet week for U.S. corporate earnings reports, with a handful of companies such as. Oracle Corp. ORCL, +0.42%, H&R Block Inc. HRB, -1.80%, Carnival Corp. CCL, +0.51% and Kroger Co. KR, +0.46% reporting their results. Lyft Inc. LYFT, +2.16% and Slack Technologies WORK, +3.36% Â will webcast annual shareholder meetings on Friday. In economic reports, investors will watch for New York Empire State Manufacturing Survey for June on Monday, and a report on U.S. retail sales for May is due on Wednesday, along with the NAHB/ Wells Fargo Housing Market Index for June. Weekly jobless-benefits-claims figures are due on Thursday, as are leading economic indicators from the Conference Board. Read:Hereâ\u0080\u0099s how the stock market tends to trade after brutal selloffs like Thursdayâ\u0080\u0099s"}]}