{"article": [{"url": "https://www.marketwatch.com/story/trump-to-gop-theres-an-obligation-to-replace-justice-ginsberg-without-delay-11600530292", "published": 1600516340.0, "headline": "Trump to GOP: Thereâ\u0080\u0099s an â\u0080\u0098obligationâ\u0080\u0099 to replace Justice Ginsberg â\u0080\u0098without delayâ\u0080\u0099", "body": "President Donald Trump speaks during a campaign rally in Wisconsin this week. On Saturday he said Republicans owe it to their voters to move quickly on a Supreme Court nomination. AP President Trump tweeted a largely expected response Saturday morning to the passing of Supreme Court Justice Ruth Bader Ginsberg, saying the open seat should be filled without delay, as the election that could shake up a narrow Republican majority in the Senate, not to mention the White House occupant, is just 45 days away. â\u0080\u009c@GOP We were put in this position of power and importance to make decisions for the people who so proudly elected us, the most important of which has long been considered to be the selection of United States Supreme Court Justices. We have this obligation, without delay!â\u0080\u009d Trump tweeted. Senate Majority Leader Mitch McConnellÂ announcedÂ Friday in the wake ofÂ news of the death of the liberal justice that any nomination advanced by Trump would get a Senate vote. Senate Minority Leader Charles Schumer had earlier referenced McConnellâ\u0080\u0099s 2016 words inÂ stating the view that the American people should have a voice in the selection of the next Supreme Court justice through their votes in the presidential election. At that time, Republicans blocked then-President Barack Obamaâ\u0080\u0099s nomination ofÂ Merrick Garland.Â The high court had a 5-4 conservative majority prior to Ginsburgâ\u0080\u0099s death. Some Republican senators, including Susan Collins of Maine, who is in a tough reelection fight, Lisa Murkowski of Alaska and Charles Grassley of Iowa, have in the past stated their dislike of Supreme Court decisions so close to major elections. Sen. Lindsey Graham of South Carolina also has a mixed history in discussing these kinds of votes, tweeting on the topic again on Saturday. Uncertainty around these senatorsâ\u0080\u0099 current views led to quick handicapping by political analysts attempting to calculate how such a tight vote might play out."}]}