{"article": [{"url": "https://www.marketwatch.com/story/the-15-best-midsize-suvs-of-2020-2020-08-04", "published": 1596814880.0, "headline": "The 15 best midsize SUVs of 2020", "body": "Midsize SUVs are a happy medium between efficient, maneuverable compact SUVs and big, family-friendly full-size SUVs. They provide plenty of space and some of them have three rows of seats, making them good minivan alternatives. You have a lot of options in this diverse segment, so let’s take a look at the best midsize SUVs of 2020, ranked by Autotrader, and find which one is right for you.1. Hyundai Santa Fe — $26,125 Score: 4.9 / 5 The Hyundai HYMTF, -0.02% Santa Fe is a near-perfect midsize two-row SUV that does almost everything well at a great value. It has a lovely, spacious interior with comfortable back seats, a generous cargo hold, outstanding safety scores and one of the best infotainment systems in the business. The only flaws we can fault it for are so-so fuel economy and the fact that you can’t get the turbocharged engine on the base trim. 2. Kia Telluride — $31,890 Score: 4.8 / 5 The Kia Telluride Kia The Kia Telluride made its debut for the 2020 model year with a bang, quickly taking a lead position in the competitive 3-row midsize SUV segment. Inside and out, the Telluride looks and feels like a truly premium SUV that you’d expect to carry a higher price tag. The interior is large and comfortable with third-row seating you can actually use. We just wish there was more than one engine available. The Telluride is on our list of the best cars for 2020. It is the best midsize, 3-row SUV you can get right now. 3. Hyundai Palisade — $31,775 Score: 4.7 / 5 The Hyundai Palisade is the mechanical twin of the Kia Telluride and it has all of the same virtues as its Kia cousin. It’s roomy, comfortable and has a premium feel that might surprise you at this price point. There’s plenty of room for both passengers and cargo, making it a strong minivan alternative. We like the bold exterior styling, but it’s proven to be a bit polarizing, with some drivers turned off by the front-end. Also on MarketWatch: Mortgage applications for suburban homes are surging as buyers try to escape the coronavirus pandemic4. Honda Pilot— $31,650 Score: 4.7 / 5 The Honda Pilot Honda The Honda Pilot is one of the founding fathers of the midsize 3-row crossover segment and it’s still a leader in its class. It comes with the safety and reliability you would expect from a Honda and it does an excellent minivan impression on the inside, with available family-friendly features like a rear-seat entertainment system. The Honda HMC, -1.21% Sensing safety tech suite isn’t as sophisticated as similar tech on some rivals, but we like that it’s standard on every trim. 5. Toyota Highlander— $34,600 Score: 4.6 / 5 The Toyota Highlander Toyota The tried-and-true Toyota Highlander is all-new for 2020 and the upgrade has improved on an already excellent 3-row family crossover. The third row is admittedly a little cramped, but it’s a super-comfortable SUV in the first two rows of its upscale interior. Driving dynamics are improved over its predecessor, and it’s the highest-ranking SUV on this list, with an available hybrid option that returns class-leading fuel economy. The starting price is a little high, but this Toyota TM, -0.65% is very generous with standard safety technology, even on the base trim.6. Honda Passport — $31,990 Score: 4.6 / 5 The Honda Passport is a midsize 2-row crossover that is a little edgier than what we typically see from Honda. It has a sharp appearance and a rugged attitude, with impressive off-road capabilities when equipped with all-wheel drive. Interior space is generous and some clever interior storage means there’s a cubby for everything. However, it’s a little on the pricey side of this segment and mysteriously has a higher starting price than the bigger, 3-row Pilot. Also read: A first look at the 2021 Polestar 2, Volvo’s all-new EV7. Buick Enclave— $40,000 Score: 4.5 / 5 The Buick Enclave has the highest starting price of any SUV on this list, but it’s also arguably one of the best values. The Enclave straddles the line between mainstream and luxury, with a feature-rich interior that is competitive with much more expensive luxury crossovers, especially in the higher trims. The Enclave also has a roomier interior than almost any 3-row crossover from a luxury brand. However, its size also means it can be a bit cumbersome to drive. 8. Subaru Ascent— $31,995 Score: 4.5 / 5 The Subaru Ascent Subaru The Subaru FUJHY, -1.41% Ascent is on the more rugged side of 3-row family crossovers, with standard AWD and some serious off-road chops. This is for taking the whole family on adventures off the beaten path. The interior is roomy and it’s packed with generous safety and infotainment technology, making it a great value no matter which trim you go with. However, that safety tech can be a bit intrusive and all the beeping can get annoying. 9. Chevrolet Traverse— $29,800 Score: 4.4 / 5 The Chevy Traverse is one of the roomiest midsize 3-row crossovers you can buy and it also has a pretty attractive starting price, making it a strong value for families. The Traverse has interior space that rivals the Tahoe while carrying a much more affordable price tag. It has easily accessible third-row seating with generous legroom, giving it almost minivan-like practicality. Surprisingly, modern driver assistance technology that is standard on many rivals is reserved for the upper trims of the Traverse. Don’t miss: The 10 coolest things about the new Ford Bronco10. Volkswagen Atlas — $30,545 Score: 4.4 / 5 The VW Atlas Volkswagen The Volkswagen Atlas is one of the roomiest midsize crossovers with minivan-like legroom in the easily-accessible third row of seats. Unfortunately, it doesn’t deliver much in terms of distinct VW VWAGY, +0.14% charm or driving character, with neither available engine being particularly satisfying to drive. But the mainstream appeal of the Atlas can also be a good thing with its generous interior space, great feature content and strong value proposition. 11. Chevrolet Blazer — $28,800 Score: 4.3 / 5 The Chevrolet Blazer returns for 2020 as a midsize 2-row crossover with an edgy, muscular look. Don’t expect the off-road capabilities of Blazers of old but rather a roomy, road-going crossover. The interior is a bit plasticky and we can’t say we’re too impressed with the base 4-cylinder engine, but if you upgrade to the available V6, you’ll get the muscle that the Blazer’s Camaro-like aesthetic suggests. Like the bigger Traverse, modern safety tech is reserved for the upper trims. 12. Jeep Grand Cherokee — $32,150 Score: 4.3 / 5 The Jeep Grand Cherokee has always done a nice job blending strong off-road capabilities with good on-road manners with little compromise, and that’s still true in 2020. We like the variety in the Grand Cherokee lineup, ranging from the high-performance Trackhawk to the off-road-ready Trailhawk, plus several other trims, ensuring there’s a Grand Cherokee for every taste and every budget. However, it’s an old design that is starting to show its age, and fuel economy is subpar.13. Kia Sorento— $26,990 Score: 4.1 / 5 The Kia Sorento is in its final model year before a big redesign for 2021 and it still represents a strong value in midsize 3-row crossovers with one of the lowest starting prices in the segment. The interior is really nice for its price point and it can be had with plenty of modern technology features. The cargo area is a little tight when all three rows of seats are in place and most safety tech features aren’t standard, but the Sorento is still a good value. Also see: 8 new luxury SUVs for under $50,00014. Nissan Murano — $31,530 Score: 4.1 / 5 The Nissan Murano Nissan The Nissan NSANY, -1.50% Murano really impressed us when its current generation came out in 2015, but it’s starting to get eclipsed by some rivals in midsize 2-row crossovers. That said, it’s still a good value with a surprisingly luxurious interior and dramatic styling that we think is aging well. The Murano has a strong standard V6 engine that’s good on gas but it lacks a fun-to-drive factor found in previous generations. The Murano may not be the most utilitarian SUV, but it is one of the most stylish. Check out: A first look at Toyota’s new RAV4 plug-in hybrid15. Ford Explorer — $32,765 Score: 4.1 / 5 The Ford F, -1.36% Explorer is all-new for 2020, replacing its aging predecessor with a few tricks up its sleeve. The new Explorer returns to a rear-wheel-drive layout (with available AWD) and has a diverse model range that includes a sporty ST model and a frugal hybrid model. Interior quality is a bit lacking and the third row is pretty cramped, but we’re impressed with the engine options and the standard Ford Co-Pilot360 safety tech suite on every trim. The Explorer Hybrid is pretty efficient, but not nearly as efficient as its direct competitor, the Toyota Highlander Hybrid. Also see: These 3 EVs are the lowest cost to own over 5 years This story originally ran on Autotrader.com."}]}