{"article": [{"url": "https://www.marketwatch.com/story/as-trump-trails-in-national-polls-his-new-campaign-manager-says-the-surveys-keep-getting-it-wrong-2020-07-24", "published": 1595606540.0, "headline": "As Trump trails in national polls, his new campaign manager says the surveys â\u0080\u0098keep getting it wrongâ\u0080\u0099", "body": "“ â\u0080\u0098National polls keep getting it wrong.â\u0080\u0099 ” â\u0080\u0094 Bill Stepien, Trumpâ\u0080\u0099s campaign manager The line above came Friday afternoon from Bill Stepien, President Donald Trumpâ\u0080\u0099s new campaign manager, as he projected confidence about the state of the White House race amid a range of polls showing sizable leads for Democratic challenger Joe Biden. Stepien, a veteran Republican operative, became the manager of Trumpâ\u0080\u0099s re-election campaign last week, replacing Brad Parscale, who remains with the campaign. Two recent national surveys â\u0080\u009cprovide a sample that is 27% less Republican than showed up at the polls in the last presidential election â\u0080\u0094 27% less Republican,â\u0080\u009d Stepien said during a conference call with reporters. â\u0080\u009cThatâ\u0080\u0099s why weâ\u0080\u0099re not going to spend a lot of time here â\u0080\u0094 any time at all â\u0080\u0094 talking further about national polls, and itâ\u0080\u0099s why, as I said before, we donâ\u0080\u0099t pay a lot of attention to them day to day here in the campaign.â\u0080\u009d He said pollsters survey registered voters, â\u0080\u009cwhich never resembles the actual turnout of the election,â\u0080\u009d and he said they draw on states that donâ\u0080\u0099t â\u0080\u009ceven come close to being a part of the battleground map.â\u0080\u009d The campaign manager talked up Trumpâ\u0080\u0099s chances of getting the 270 electoral votes needed to win Novemberâ\u0080\u0099s presidential election. â\u0080\u009cWe think that there isnâ\u0080\u0099t just a pathway to 270 but multiple pathways to 270,â\u0080\u009d he said, as he suggested there were favorable trends in a number of swing states. â\u0080\u009cThe president is polling better in Arizona among key demographics now than where he was four years ago,â\u0080\u009d Stepien said. Minnesota is â\u0080\u009ca state that the president lost by just 44,000 votes, 1.5% four years ago,â\u0080\u009d he also said. â\u0080\u009cSo if people are going to talk about Pennsylvania as a pickup opportunity for Joe Biden, seems only fair that Minnesota should get that same treatment coming the other way.â\u0080\u009d â\u0080\u009cBottom line is building off of the 2016 map, I think there are several offensive opportunities in play for the presidentâ\u0080\u0099s campaign, and we have the unique luxury of having the ability to expand our map, expand our electoral path,â\u0080\u009d the campaign manager told reporters. In a RealClearPolitics moving average of national polls as of Friday, Biden drew support of 49.6% of voters, ahead of Trumpâ\u0080\u0099s 40.9%. Besides polls, a campaignâ\u0080\u0099s financial reports are a closely watched measure of viability, and Bidenâ\u0080\u0099s war chest is catching up to Trumpâ\u0080\u0099s. The president also often touts the performance of the stock market SPX, +0.87% Â DJIA, +0.56%, but it has been trading below its February peaks amid worries over the coronavirus pandemicâ\u0080\u0099s economic effects."}]}