{"article": [{"url": "https://www.marketwatch.com/story/us-oil-prices-slip-for-a-second-session-as-rise-in-coronavirus-cases-seen-hobbling-crude-demand-2020-07-07", "published": 1594135280.0, "headline": "Oil slips as traders eye demand amid rise in coronavirus cases but U.S. supplies seen falling", "body": "Oil futures ended with a modest loss on Tuesday, with the increase in coronavirus cases in parts of the world continuing to pressure prospects for energy demand. Expectations for a decline in U.S. crude inventories for a second week in a row, however, provided some support for prices. On Tuesday, West Texas Intermediate crude for August US:CLQ20 fell by a penny, 0.02%, to settle at $40.62 a barrel on the New York Mercantile Exchange, after also ending marginally lower on Monday. Global benchmark Brent oil for September UK:BRNU20 declined by 2 cents, or 0.05%, to $43.08 a barrel on the ICE Futures Europe exchange, following a gain of 0.7% in the previous session. On the demand side, the Energy Information Administration’s report Wednesday, which covers data for the week ended July 3, “may capture a small piece of early 4th of July holiday driving, though next week’s report will be the one to watch,” said Robbie Fraser, senior commodity analyst at Schneider Electric. On average, the EIA is expected to report a decline of 3.7 million barrels in crude stockpiles for last week, according to analysts polled by S&P Global Platts. That would mark a second-straight weekly fall. They also forecast supply declines of 1.2 million barrels for gasoline and 500,000 barrels for distillates. On Nymex Tuesday, August gasoline US:RBQ20 rose 2.8% to $1.275 a gallon, but August heating oil US:HOQ20 shed 0.1% to $1.2433 a gallon. August natural gas US:NGQ20 settled at $1.876 per million British thermal units, up 2.5%. For natural gas, “weather remains a key supportive factor over the short and medium-term, with most forecast models showing a strong probability of above average temperatures,” said Fraser, in a daily note. “That would in turn boost natural gas demand from the power generation sector.” In a monthly report ahead of Wednesday’s weekly EIA data, the government agency lifted 2020 and 2021 forecasts for Brent and WTI oil, and U.S. crude production. “Changes in supply and demand have shifted global oil markets from an estimated 21 million barrels per day of oversupply in April to inventory draws in June,” Linda Capuano, EIA administrator, said in a statement. “EIA estimates June consumption increased by almost 10 million barrels per day from April at the same time that global supply fell by 12 million barrels per day as a result of reduced production from OPEC+ and price-driven declines in the United States and Canada.” Meanwhile, members of OPEC pumped 22.31 million barrels per day in June, the lowest collective output since September 1990, according to an S&P Global Platts survey released Tuesday. OPEC+, which includes OPEC and allied non-OPEC members, saw production at 10.32 million barrels per day below their late 2018 reference levels, representing 106% of their committed production cuts, the survey showed. “Still, demand data remains particularly important as the market gauges how the U.S. and other economies are responding to easing lockdown measures,” Fraser said in a daily note. “The U.S. is particularly complex, with several states facing a concerning rise in COVID-19 case counts, causing some to roll back plans to reopen.” Stymied business reopenings in the U.S. and reinstituted lockdowns in countries like Australia were cited as part of the reason for a pullback in crude prices on the session. Australian officials closed the border between the country’s two largest states, as the country’s second-largest city, Melbourne, recorded two deaths and its highest-ever daily increase in infections on Monday. In the U.S., California Gov. Gavin Newsom on Monday asked six counties to re-close indoor business as cases of the virus spikes. Crude oil investors are also still digesting a federal judge’s order Monday to temporarily shutdown of the Dakota Access pipeline within 30 days. The 1,172-mile underground pipeline, which has been in operation since June 2017 and can transport 570,000 barrels of oil per day, runs beneath the Missouri River, north of the Standing Rock Indian Reservation. The pipeline moves crude from the Bakken shale and surrounding regions to refinery hubs in the Midwest and “could place further pressure on producers in the region,” Fraser said. “However, the impact is likely to be somewhat muted given the market’s current state of weak refinery demand and generally strong supply.”"}]}