{"article": [{"url": "https://www.marketwatch.com/story/nyc-shutters-schools-in-covid-19-hotspots-with-more-restrictions-on-the-way-2020-10-05", "published": 1601917820.0, "headline": "NYC shutters schools in COVID-19 hotspots, with more restrictions on the way", "body": "Schools will close in New York City COVID-19 hotspots, located in parts of Brooklyn and Queens, on Tuesday, marking the first round of new closures since the initial lockdown last spring. “Picture those hotspots as embers within a field of dry grass,” Gov. Andrew Cuomo said as he announced the measures on Monday. “The only course is to run to those embers and stamp them out.” The shutdown will apply to both private and public schools in nine ZIP Codes, centered around neighborhoods primarily in Southeast Brooklyn, as well as three ZIP Codes in Queens. More aggressive restrictions to combat the spike in cases are expected to be announced over the coming days and could include the closure of nonessential businesses, such as indoor dining, and stricter limits on gatherings. The positivity rate in those ZIP Codes has remained above 3% for seven consecutive days or more, and was higher than 6% in two areas of Brooklyn, despite a massive test-and-trace effort that’s targeted the outbreaks, according to data from the state on Monday. The city is monitoring an additional 12 ZIP Codes where the virus is spreading. It’s not clear how long the closures, which affect thousands of students, will last. It could be as short as two weeks and will depend on how quickly each ZIP Code can get its positivity rate under 3% and keep it there, said Mayor Bill de Blasio at a separate briefing on Monday. That makes late October the earliest affected schools could resume in-person learning, the mayor said. “We hope to stay on the short end of that,” he said. More restrictions on those hotspots will likely be announced in the coming days, though the mayor and the governor differed on what the exact measures and target areas would be—sowing confusion as the city faces a critical test in its ability to keep the disease under control. Also see: The COVID-19 grind seems unbearable — but it’s not forever De Blasio reiterated plans he presented on Sunday that would also shutter all nonessential businesses in those nine ZIP Codes beginning on Wednesday. That would return parts of the city to a level of lockdown not seen since the spring—when the city was the nation’s viral epicenter. The mayor justified his plan as the most straightforward at the moment. “Here’s nine ZIP Codes where unfortunately the problem is pervasive enough that fuller restrictions make sense across the board—hopefully for only two to four weeks,” de Blasio said on Monday. Meanwhile, Cuomo said the state is looking at whether there’s a more precise geographic catchment than ZIP Codes for targeting the hotspots. He said experts are worried people would just avoid the restrictions by going a few streets over, potentially bringing the virus with them. “You could actually be spreading the virus,” said Cuomo, who said that public spaces and religious gatherings actually presented more of a danger than neighborhood businesses. The recent outbreak in New York City, as well as hotspots in the Hudson Valley directly north, have hit Orthodox Jewish communities particularly hard. The governor said a 50% capacity limit at churches and synagogues must be enforced and planned to speak with religious leaders to get their commitment to adhering to those rules. “If I do not have the agreement from the religious community directly,” Cuomo said, the state and local authorities would double down on enforcement. “We have to have real enforcement.” Coronavirus update: Global case tally tops 35 million and deaths exceed 1 million, while Trump says ‘don’t be afraid of COVID’ Outside of a handful of hotspots, New York City and New York state’s viral numbers remained under control, both Cuomo and de Blasio said on Monday. The percentage of people who tested positive in the five boroughs on Saturday, the most recent data available, was 1.83%, according to the city."}]}