{"article": [{"url": "https://www.marketwatch.com/story/job-losses-mount-for-public-school-employees-as-pandemic-squeezes-education-sector-11601661872", "published": 1601893700.0, "headline": "Job losses mount for public school employees as pandemic squeezes education sector", "body": "The jobs report released Friday indicated employment losses in public education. (Photo by John Moore/Getty Images) Published Credit: John Moore/Getty Images Published Credit: John Moore/Getty Images John Moore/Getty Images The pandemic-induced economic downturn is taking a toll on America’s educators. Job gains during the month of September, as reported by the Bureau of Labor Statistics Friday, were weaker than expected. One of the main drivers: job losses in public education. Employment in local government education, or jobs largely in the K-12 public school system, dropped by 231,000 last month, the BLS reported. Employment in that sector is down by 570,300 from this time last year, according to an analysis of BLS data by Elise Gould, a senior economist at the Economic Policy Institute, a left-leaning think tank. Employment in state government education, which typically includes jobs at public colleges and universities, fell by 49,000. Jobs in private education fell by 69,000 after a similar gain in August, according to the BLS. Overall, employment in the education sector has fallen by 355,000 jobs since February. The financial fates of both K-12 public schools and public colleges are tied heavily to that of their states. States depend on income and sales taxes for a large portion of their tax revenue, and given widespread job losses due to the pandemic, those coffers have likely taken a hit, which could affect the funding statehouses send to their public schools. “With the federal policy makers not providing sufficient relief there are already cuts happening,” Gould said. “And oftentimes education is on the chopping block.” Are you a student, parent or educator? We want to hear from you. Email jberman@marketwatch.com Public school districts have been bracing for funding cuts. In many states, funding for public schools is closely tied to enrollment and districts have seen declines as a result of the challenges some students face accessing technology for remote courses, as well families turning to private schools, pandemic pods or homeschooling instead of their local public school. Some colleges and universities have already furloughed, laid off or reduced pay and benefits for their workforce in response to the squeeze the pandemic has placed on schools’ business models. For many colleges, housing and dining services, which shuttered in March, bring in a significant portion of revenue. In addition, many colleges refunded some portion of what families paid for those services when they sent students home in March. State budget cuts will likely only exacerbate these challenges. Both public K-12 school and higher education systems were still recovering from funding losses during the Great Recession when the pandemic hit. In 2018, state funding for two and four-year public colleges was still $6.6 billion below 2008 levels, according to the Center on Budget and Policy Priorities. As of last month, K-12 education employment was 890,000 below where it would have needed to be to keep up with enrollment gains since 2008, according to an analysis by Gould. This school year will likely also be an expensive one for public schools. Both colleges and K-12 public school systems have invested in technology to make remote or hybrid learning possible. In addition, reopening in-person has also required expensive safety upgrades. In these challenging times for students, families and educators, it seems as if, “we actually need more workers and not fewer workers, more resources and not fewer,” Gould said."}]}