{"article": [{"url": "https://www.marketwatch.com/story/att-stock-gains-after-earnings-beat-but-company-predicts-covid-19-will-accelerate-cord-cutting-2020-07-23", "published": 1595511140.0, "headline": "AT&Tâ\u0080\u0099s continued media woes prompt questions about competitive potential", "body": "A previous version of this report incorrectly referred to the consensus forecast for AT&Tâ\u0080\u0099s postpaid phone net adds. It has been removed. Getty Images AT&T Inc. posted better-than-anticipated earnings Thursday, but the big picture was pretty much as expected. While AT&Tâ\u0080\u0099s T, -1.01% Â wireless business remained stable, the company still faces big challenges in its media and video businesses due to the pandemic. Management warned that cord-cutting trends could accelerate due to COVID-19 as more people ditch their traditional TV plans. Shares were down 0.7% in Thursdayâ\u0080\u0099s session. For the June quarter, the company shed 886,000 subscribers of its premium video services DirecTV and U-Verse as well as 68,000 AT&T TV Now streaming subscribers in another wave of heavy subscriber losses for the companyâ\u0080\u0099s various video offerings. Analysts had been calling for about a million subscriber losses combined across video, so AT&Tâ\u0080\u0099s big declines came in better than feared. Chief Executive John Stankey defended the business on the companyâ\u0080\u0099s earnings call, telling investors that AT&T acquired DirecTV a few years back because â\u0080\u009cwe like the customer base,â\u0080\u009d not as a bet on satellite as a medium. â\u0080\u009cIt was an opportunity to move that customer base into the right technology platforms moving forward, and thatâ\u0080\u0099s clearly where weâ\u0080\u0099re investing and what weâ\u0080\u0099re doing right now,â\u0080\u009d he said. â\u0080\u009cI donâ\u0080\u0099t necessarily view satellite technology as the place thatâ\u0080\u0099s necessary to make that happen.â\u0080\u009d Despite ongoing speculation on Wall Street that AT&T may try to stem the bleeding by spinning off DirecTV through a merger with Dish Network Corp. DISH, -0.90%, MoffettNathanson analyst Craig Moffett was skeptical that such a transaction could take place. â\u0080\u009cA business shrinking this fast canâ\u0080\u0099t be levered, and there would be no possible exit for an investor in the merged entity,â\u0080\u009d he wrote in a note to clients. â\u0080\u009cThe window to merge the two companies appears to have long since closed.â\u0080\u009d AT&Tâ\u0080\u0099s WarnerMedia business had a tough quarter as well amid advertising pressures, film delays, and the loss of live sports. Total revenue for the segment was down 23% from a year earlier. The wireless business once again provided a cushion, though AT&T posted postpaid net subscriber losses of 151,000 after it stopped counting 338,000 â\u0080\u009caccrued disconnects,â\u0080\u009d or subscribers who are still receiving service through the Keep America Connected pledge, which asked wireless companies to continue providing service to customers who werenâ\u0080\u0099t able to pay their bills due to the pandemic. â\u0080\u009cCritically, mobility service revenues, adjusted for roaming, grew by more than 1%,â\u0080\u009d Bernstein analyst Peter Supino wrote. Citiâ\u0080\u0099s Michael Rollins noted that AT&Tâ\u0080\u0099s stronger-than-expected equipment revenues backed up â\u0080\u009cthe improving distribution productivity over the course of the quarterâ\u0080\u009d after some concerns about what store closures would mean for smartphone sales. He rates the stock a buy with a $36 target price. Moffett wrote that wireless â\u0080\u009cis clearly AT&Tâ\u0080\u0099s best businessâ\u0080\u009d but worried that the pressures surrounding the rest of the company might hurt AT&Tâ\u0080\u0099s ability to effectively compete in wireless. â\u0080\u009cTheir loss of postpaid phone subscribers owes, in part, to the necessity of prioritizing free cash flow over growth in order to mitigate the weakness in their media and wireline businesses,â\u0080\u009d wrote Moffett, who rates AT&Tâ\u0080\u0099s stock a sell with a $24 target. â\u0080\u009cAnd, perhaps more importantly, it is unclear whether AT&T has the balance sheet to vigorously compete in the FCCâ\u0080\u0099s upcoming auctions for mid-band spectrum.â\u0080\u009d T-Mobile has the best position in terms of spectrum, according to Moffett, while Verizon is expected to spend heavily to catch up. Moffett questioned whether AT&T will be able to play that game as well. The report left Bernsteinâ\u0080\u0099s Supino with some concerns as well. â\u0080\u009cWith Mobility stable while the media businesses hemorrhage, this print offers little to stem concerns that a weakening competitive position and pandemic-related dislocations increasingly strain the companyâ\u0080\u0099s financial position,â\u0080\u009d wrote Supino, who has a market perform rating and $35 target price on AT&T shares. Overall revenue for AT&T declined to $41 billion from $45 billion and came in even with the FactSet consensus. The company generated revenue of $17.1 billion for its mobility unit, $10.1 billion for its entertainment unit, $6.4 billion for its business wireline unit, $6.8 billion for its WarnerMedia segment, and $1.2 billion for its Latin America business. The company generated June-quarter net income of $1.56 billion, or 17 cents a share, down from $3.97 billion, or 51 cents a share, in the year-prior quarter. Adjusted earnings per share fell to 83 cents a share from 89 cents a year earlier, while analysts surveyed by FactSet had been modeling 79 cents in adjusted EPS. The company expects third-quarter results to be impacted by disruptions to sports leagues, the closure of movie theaters and postponement of film releases, declines in roaming activity, and â\u0080\u009cthe acceleration of the disconnection of linear TV services due to the pandemic.â\u0080\u009d Shares of AT&T have added 0.5% over the past three months as the S&P 500 SPX, +0.87% Â has gained 17%."}]}