{"article": [{"url": "https://www.marketwatch.com/story/trump-says-he-might-spend-his-own-money-on-his-re-election-campaign-if-i-have-to-i-would-2020-09-08", "published": 1599581120.0, "headline": "Trump says he might spend his own money on his re-election campaign: â\u0080\u0098If I have to, I wouldâ\u0080\u0099", "body": "President Donald Trump on Tuesday said he might spend his own money on his re-election campaign, with the remark coming a week after Democratic challenger Joe Biden announced a record-breaking fundraising haul for August. â\u0080\u009cIf I have to, I would,â\u0080\u009d Trump said, regarding the possibility that he might use some of his own fortune, estimated at $2.5 billion, toward his run for a second term. â\u0080\u009cIf we did need â\u0080\u0094 we donâ\u0080\u0099t, because we have much more money than we had last time going into the last two months, I think double and triple â\u0080\u0094 but if we needed any more, Iâ\u0080\u0099d put it up personally.â\u0080\u009d â\u0080\u009cWhatever it takes â\u0080\u0094 we have to win,â\u0080\u009d the president added, as he spoke with reporters before heading to Florida. Trump was making visits to two key swing states on Tuesday, giving a speech in Florida in the afternoon and an address in North Carolina in the evening. Trump has discussed spending as much as $100 million of his own money on his re-election campaign, if necessary, according to a Bloomberg News report on Tuesday citing unnamed sources. He contributed $66 million to his 2016 campaign, but it would be unprecedented for an incumbent president to put his own money toward winning a second term, the report added. Bidenâ\u0080\u0099s campaign and its affiliates last week announced they raised $364.5 million in August, breaking the previous monthly fundraising record for a White House campaign. Related:How Bidenâ\u0080\u0099s war chest is catching up to Trumpâ\u0080\u0099s â\u0080\u0094 in one chart Trumpâ\u0080\u0099s re-election campaign and its affiliates on Wednesday announced an August haul that came in below Bidenâ\u0080\u0099s, getting more than $210 million, and a New York Times report on Monday said some people inside the campaign are forecasting a cash crunch with less than 60 days until the Nov. 3 election. Thatâ\u0080\u0099s after the campaign and its affiliates raised $1.1 billon from the beginning of 2019 through July, but then spent more than $800 million. Trumpâ\u0080\u0099s campaign manager, Bill Stepien, pushed back on suggestions of a cash crunch on Tuesday, saying his team is â\u0080\u009cvery comfortable and confident in where weâ\u0080\u0099re spending and how much weâ\u0080\u0099re spending and how much weâ\u0080\u0099re going to have down the stretch.â\u0080\u009d He took over as campaign manager in July. â\u0080\u009cWe are now carefully managing the budget,â\u0080\u009d Stepien told reporters on a conference call. â\u0080\u009cI consider it to be among the â\u0080\u0094 if not the most important â\u0080\u0094 tasks for any campaign manager.â\u0080\u009d â\u0080\u009cFrom this day forward to Election Day, we will have more recent resources to spend than we had in 2016, and it wonâ\u0080\u0099t be close â\u0080\u0094 itâ\u0080\u0099ll be by a factor of two times or three times what we had to spend on the campaign we were a part of in 2016,â\u0080\u009d Stepien added. A campaignâ\u0080\u0099s financial condition is a closely watched measure of viability, along with polling data. Trump also often touts the performance of the stock market SPX, +0.87% DJIA, +0.56% Â , which closed lower again Tuesday after selling off last week. Trumpâ\u0080\u0099s threat on Monday to â\u0080\u009cdecoupleâ\u0080\u009d the U.S. economy from China added to market jitters during Tuesdayâ\u0080\u0099s session, Wall Street analysts said. In a RealClearPolitics moving average of polls focused on top battleground states that are likely to decide the election, Biden was drawing support of 48.2% of voters as of Tuesday, ahead of Trumpâ\u0080\u0099s 45.3%. Betting markets were giving Biden a 53.7% chance of winning vs. Trumpâ\u0080\u0099s 45.7%. Betting markets on Tuesday are giving Biden a 53.7% chance of winning vs. Trumpâ\u0080\u0099s 45.7% RCP Trumpâ\u0080\u0099s campaign indicated on Tuesday that he was scheduled to travel this week to other swing states or states that could flip to the GOP, with a trip on Thursday to Michigan, one on Friday to Pennsylvania and appearances on Saturday and Sunday in Nevada. However, a Las Vegas Review-Journal report on Wednesday said the Nevada rallies have been canceled because of the stateâ\u0080\u0099s restrictions on in-person gatherings during the coronavirus pandemic. Biden attacked Trumpâ\u0080\u0099s record in Florida ahead of the Republican incumbentâ\u0080\u0099s speech, which was billed as covering his administrationâ\u0080\u0099s â\u0080\u009cenvironmental accomplishments for the people of Florida.â\u0080\u009d Biden said in a statement that the president â\u0080\u009chas opened up additional public lands, both on land and offshore, to the possibility of new oil and gas drilling, a deeply unpopular threat to Floridaâ\u0080\u0099s natural environment and tourism-based economy.â\u0080\u009d The former vice president also said Trumpâ\u0080\u0099s â\u0080\u009cmismanagementâ\u0080\u009d of the coronavirus crisis has â\u0080\u009ccost too many North Carolinians their lives and livelihoods, with communities of color bearing the brunt of the devastation.â\u0080\u009d During his speech in Jupiter, Fla., Trump announced and then proceeded to sign what he described as a â\u0080\u009cpresidential order extending the moratorium on offshore drilling on Floridaâ\u0080\u0099s Gulf Coast and expanding it to Floridaâ\u0080\u0099s Atlantic coast, as well as the coasts of Georgia and South Carolina.â\u0080\u009d The moratorium had been expected to expire in 2022. This is an updated version of a report first published on Sept. 8, 2020."}]}