{"article": [{"url": "https://www.marketwatch.com/story/police-clash-with-protesters-at-uk-covid-19-demonstration-2020-09-26", "published": 1601136320.0, "headline": "Police clash with protesters at UK COVID-19 demonstration against lockdowns", "body": "London police clashed with demonstrators on Saturday as they broke up a protest in Trafalgar Square against COVID-19 restrictions amid rising tensions over limits on everyday life as the government tries to stem a sharp rise in infections. Police and protesters were injured when officers moved in after three hours of speeches in front of thousands of people who packed the iconic square in London waving placards opposing mandatory vaccinations, face mask requirements and limits on civil liberties. Police said they intervened because the demonstrators refused to comply with the very social-distancing rules they were there to protest. Officers removed sound equipment, bottles were thrown and police drew their batons in confrontations with protesters. Several people were seen being led away in handcuffs. “Crowds in Trafalgar Square have not complied with the conditions of their risk assessment and are putting people in danger of transmitting the virus,’’ the Met said. The demonstration was held as Parliament prepares to review COVID-19 legislation and the government imposes new restrictions to control the disease. Some lawmakers have criticized the government for implementing the rules without parliamentary approval. Speakers at the rally denied they were conspiracy theorists, arguing they were standing up for freedom of expression and human rights. Dan Astin-Gregory, a leadership trainer, acknowledged the deaths and suffering caused by the pandemic, but said the response to COVID-19 has been out of proportion to the threat caused by the disease. “We are tired of the fear mongering and the misrepresentation of the facts,” he told the crowd. “We are tired of the restrictions to our freedoms.” The government earlier this week ordered a 10 p.m. curfew on bars and restaurants nationwide, along with tougher facemask requirements and increased fines for non-compliance. It has also banned most social gatherings of more than six people, but there is an exemption for protests as long as organizers submit a risk assessment and comply with social distancing rules. Before the demonstration began, police said they would encourage protesters to follow the rules, but they would take enforcement action if protesters failed to comply. “I know there is great frustration to these regulations, but they have been designed to keep everyone safe from what is a lethal virus,” Cmdr. Ade Adelekan said Saturday morning. As the demonstration began, officers in high-visibility vests and surgical masks were visible around the perimeter of the square but there was no effort to silence speakers or prevent protesters from gathering. The atmosphere turned tense later in the afternoon as officers in soft caps were replaced by others wearing riot helmets and face shields. As some protesters shouted, “You’re part of the tyranny,” others sang, “All you need is love.” Saturday’s demonstration came a week after a similar event during which thousands of people crowded into Trafalgar Square. Police said several officers were hurt during that event when a “small minority’’ of protesters became violent. Britain has Europe’s worst death toll from the pandemic, with nearly 42,000 confirmed deaths tied to COVID-19. New infections, hospitalizations and deaths have all risen sharply in recent weeks. In addition to the nationwide COVID-19 rules, several jurisdictions have imposed tighter restrictions to control local spikes in the disease. By Monday, about one-quarter of the U.K.’s 65 million people will be living under these heightened restrictions. London, home to almost 9 million people, on Friday was added to the British government’s COVID-19 watchlist as an “area of concern.” That means the U.K. capital also could face new restrictions if infections continue to rise in the city."}]}