{"article": [{"url": "https://www.marketwatch.com/story/president-trump-loses-big-edge-over-biden-on-the-economy-as-election-looms-2020-10-07", "published": 1602078860.0, "headline": "President Trump loses big edge over Biden on the economy as election looms", "body": "President Trump’s biggest advantage of Democratic rival Joe Biden in the 2020 election — his handling of the economy — appears to have evaporated with less than a month to go before the November elections. Several recent polls show the president’s edge has narrowed or disappeared entirely, potentially making it harder for Trump to come from behind and beat Biden. The former vice president has widened his lead in the polls after the first presidential debate. Read:Consumer confidence surges to highest level of coronavirus era The latest CNN poll shows that 49% of registered voters think Trump would do a better job on the economy vs. 49% who say Biden would handle it better. See CNN poll Just two months ago, Trump held an 8-point advantage over Biden in the CNN poll. He had an even larger 12-point advantage in May, when the government approved a multi-trillion dollar economic-rescue plan. iframe.twitter-tweet { width: 100% !important; } An Economist/YouGov poll found similar erosion. Only 48% of voters approved of Trump’s handling of the economy while 48% disapproved. For most of the past year, Trump’s approval rating on the economy has hovered about 50%. Yet his standing seems to have suffered after a divided Congress failed in July to approve more federal aid for the unemployed, small businesses and large industries such as airlines that have been especially hurt by the coronavirus pandemic. Read:U.S. adds 661,000 jobs in September and unemployment rate falls to 7.9% Late Tuesday night, Trump suddenly tweeted he would sign a “stand alone bill” providing a second round of $1,200 stimulus checks for eligible American families if Congress agreed. He also offered $25 billion for airlines and $135 for small businesses. iframe.twitter-tweet { width: 100% !important; } Yet just hours earlier, he had said he would end talks with Democrats on another financial aid package until after the election, accusing House Speaker Nancy Pelosi and her party of negotiating in bad faith. One poll by the Wall Street Journal/NBC still showed Trump with an edge on the economy, but his advantage was the smallest since April at just 48% to 41%. The poll showed Biden leading Trump in his handling of most other issues."}]}