{"article": [{"url": "https://www.marketwatch.com/story/women-and-credit-in-the-1970s-the-equal-credit-opportunity-act-became-law-a-key-step-in-financial-freedom-for-women-2020-08-03", "published": 1596815360.0, "headline": "Women and credit: In the 1970s, the Equal Credit Opportunity Act became lawâ\u0080\u0094 a key step in financial freedom for women", "body": "This article is reprinted by permission from NerdWallet. This series examines the financial progress made by women in the U.S. since the Equal Credit Opportunity Act was passed in 1974. In this installment: the 1970s, the decade when the Equal Credit Opportunity Act became law.Â The Equal Credit Opportunity Act Women have come a long way in the past century in terms of legal rights, although reality has often fallen short of legal promises. Women earned a constitutional right to vote nationwide in 1920, for example, but many continued to be denied that right for decadesÂ due to racist state laws, violence and the lack of availability of bilingual election materials, among other things. A 1963 federal law prohibited gender-based discrimination in wages, but the pay gap has yet to close. Still, a key step in womenâ\u0080\u0099s financial freedom came with the passage in 1974 of the Equal Credit Opportunity Act, which granted women the right to obtain credit cards separate from their husbands. More from this series: In the â\u0080\u009980s, women gained career options and financial clout In the 1990s, women made strides in politics, and pop culture rewrites what it means to be a girl In the 2000s, the fight against pay discrimination continues In the 2010s, the Credit Card Act is amended and more women are breadwinners The law barred several shady credit practices, including lender discrimination based on race, sex, age, nationality or marital status. Before it was passed, women could be denied access to their own credit cards by issuers. Passage of this act wasnâ\u0080\u0099t simply a success in gender equality; it was also necessary for practical reasons. The idea that single women wouldnâ\u0080\u0099t be able to obtain credit while making an income was absurd enough, but women who are married and choose to stay home with children should also be able toÂ establish credit. In the event of divorce or death of a spouse,Â having your own credit is crucial.Strides in the workplace Women made other great strides in the â\u0080\u009970s, particularly in the office. In 1977, the courts recognized sexual harassment in the workplace, although it wasnâ\u0080\u0099t defined by the Equal Employment Opportunity Commission until 1980. And theÂ Pregnancy Discrimination ActÂ of 1978 made it illegal to fire a woman for being pregnant, which was previously common practice. Also read: Tax rules have been largely written by rich, white men â\u0080\u0094 and it shows, researchers say While both of these accomplishments made it easier for women to thrive in the workplace, it arguably shouldnâ\u0080\u0099t have taken so long to get these basic workplace protections in place. Women are crucial earners to their families, with 41% of mothers as the sole or primary breadwinners for their families,Â as of 2017, including 68.3% of Black mothers, 41% of Latina mothers and 36.8% of white mothers. Job protection in the case of pregnancy and recourse for workplace sexual harassment are absolutely necessary for women to continue to work and provide for themselves and their families.Pop culture Pop culture is indicative of the times, and â\u0080\u009970s television brought the issue of gender inequality into the spotlight with shows like â\u0080\u009cAliceâ\u0080\u009d and â\u0080\u009cThe Mary Tyler Moore Show.â\u0080\u009d â\u0080\u009cAliceâ\u0080\u009d was about a single mother who had to support herself and her son by working in a diner under a chauvinistic boss. â\u0080\u009cThe Mary Tyler Moore Showâ\u0080\u009d was about a single working woman in her 30s who had recently ended a relationship with a man whom she financially supported through medical school. Both shows featured episodes about pay inequality, where the eponymous women discovered that their male counterparts made higher salaries than them. Also read: How to plan for the unique financial challenges women face Pop culture in the 1970s showed women as breadwinners, dealing with inequality in the workplace and pay discrimination. Although Alice and Mary were TV characters, they opened up a dialogue among women to talk about these once-taboo topics with episodes that could be considered progressive even by todayâ\u0080\u0099s standards.More from NerdWallet: Can a Credit Card Company Lower My Credit Limit? Is It OK to Never Have a Credit Card? Todayâ\u0080\u0099s Definition of Financial Adulthood Is More Flexible Than Ever Erin El Issa is a writer at NerdWallet. Email: erin@nerdwallet.com. Twitter: @Erin_El_Issa."}]}