{"article": [{"url": "https://www.marketwatch.com/story/members-of-trump-golf-club-in-new-jersey-enlisted-as-audience-for-impromptu-press-conferences-and-inking-of-executive-actions-2020-08-09", "published": 1597047200.0, "headline": "Members of Trump golf club in New Jersey enlisted as audience for impromptu press conferences and inking of executive actions", "body": "BEDMINSTER, N.J. (AP) — They hustled down the stairs, the rain dabbing their polo shirts and golf attire, as they dashed inside the clubhouse, drinks in their hands and masks missing from their faces. It was an unexpected perk of their country-club membership: being the audience for President Donald Trump’s hurriedly announced news conference Friday evening at his course in Bedminster, N.J. They were props in a surreal gathering that violated COVID-19 safety guidelines but gave Trump a stage on which to end his week by falsely claiming the coronavirus pandemic ravaging the nation and endangering his re-election campaign was “disappearing.” As if it were a political rally, the well-heeled crowd offered cheers and jeers as the president delivered broadsides against his political foes. Club members booed when a reporter suggested the news conference violated social-distancing regulations put in place by Gov. Phil Murphy, D-N.J. Trump Signs Executive Orders to Provide Additional Coronavirus Relief “You’re wrong about that because it’s a political activity. They have expectations for political activities. And it’s also a peaceful protest,” Trump said. The audience roared when the president suggested that the club’s members “know the news is fake.” The news conference was not on the president’s daily schedule when it was released late Thursday. White House word about the addition came less than an hour before Trump began talking. Trump had flown in from Ohio to begin a three-day stay at the club. He played a round of golf Friday and then met with campaign staff to map out the next few weeks in a race that has seen him consistently trailing Democrat Joe Biden. Reporters traveling with the president received notice in the morning of a “lid,” which meant no public appearances were expected the rest of the day. As evening approached and the rain moved in, the lid was lifted. Aides scrambled to get the club ready. They set up the presidential podium and monitors with the office’s seal in a gilded room with chandeliers. It was the same room, not far from the fairways, where Trump, on another August weekend three years ago, first said there was blame on “many sides” of the clash between white supremacists and anti-racist protesters that had just occurred in Charlottesville, Va. Reporters arriving at the club before the news conference watched as members, many carrying glasses of wine, hurried from an upstairs dining room to the first floor ballroom. They, like the reporters, had their temperatures checked. Neither group was given the rapid COVID-19 test usually administered by the White House to anyone who will be near the president. After reporters tweeted that most in the crowd, packed shoulder to shoulder, were not wearing masks, a staffer handed masks to anyone in the audience who wanted one. Most, but not all, put on a face covering. “ ‘You’ll get to meet the fake news tonight. You’ll get to see what I have to go through. Who’s there? Oh, all my killers are there, wow. So you’ll get to see some of the people that we deal with every day.’ ” — President Trump, referring to assembled members of the traveling White House press corps, in comments to members of his New Jersey golf club Trump addressed the crowd before reporters entered. In remarks caught on the White House live-stream feed, the president said: “You’ll get to meet the fake news tonight. You’ll get to see what I have to go through. Who’s there? Oh, all my killers are there, wow. So you’ll get to see some of the people that we deal with every day.” Murphy had tightened New Jersey’s restrictions this past week after a recent surge of cases. The new coronavirus guidelines require that for any indoor event, “regardless of the room’s capacity, the maximum limit shall be 25 persons.” Face coverings are now required of workers and customers. Trump argued that a “political event” could have up to 100 people, per the guidelines. But the number of people in that room, when including reporters and Secret Service agents, appeared to exceed that limit, and few were 6 feet apart. Aides had suggested to reporters on Friday that the president might sign executive orders that, despite questions about their legality and potential effectiveness, were meant to bypass stalled negotiations about the next round of economic assistance during the pandemic. The administration’s talks with congressional leaders had collapsed, endangering federal aid to workers and businesses struggling during an outbreak that has killed more than 160,000 Americans and cost tens of millions their jobs. But no executive orders would be signed that day. At his news conference, Trump also promoted the latest jobs report which, while surpassing expectations, lagged behind the past two months and suggested the economic recovery had stalled. He battled with reporters, cutting off one who tried to ask a question. He played down intelligence reports that Russia was trying to help his candidacy and that China and Iran were hoping for his defeat. Trump also returned to his campaign’s newest attack line against Biden — that the former vice president is under the control of the “radical” elements of the Democratic Party. Trump conducted another news conference Saturday at the club, but the crowd was slightly smaller than Friday’s, and, this time, nearly everyone was wearing a mask and not a glass of wine was in sight. Supporters were just as boisterous, booing the mentions of Democrats and cheering when the president cut off reporters. He did sign a series of executive orders and even offered pens to people in the back of the room. “ Trump conducted another news conference Saturday at the club, but the crowd was slightly smaller than Friday’s, and, this time, nearly everyone was wearing a mask and not a glass of wine was in sight. Supporters were just as boisterous, booing the mentions of Democrats and cheering when the president cut off reporters. ” In campaign meetings before his appearance in the ballroom, the president was shown polling data that indicated that he had narrowed the gap against Biden in most battleground states, though Michigan, which he won in 2016, and Minnesota, which his campaign hoped to pluck from Democrats, were likely out of reach, according to two officials. They were not authorized to publicly discuss internal campaign matters and spoke on condition of anonymity. Details are soon to be finalized for Trump’s reimagined nominating convention, which will now be based in and around the nation’s capital. Though the White House is still being considered for Trump’s acceptance speech, an idea that has drawn bipartisan blowback for using the executive mansion for an explicitly political purpose, other options are in the mix, according to the officials. The president also is focusing on fundraising to bankroll the stretch run. After a fundraiser at a yacht club on Lake Erie on Thursday, Trump raised money at a pair of events Saturday in the Hamptons on New York’s Long Island, including one hosted by his eldest son. On Sunday, before returning to Washington, Trump was scheduled to attend another, in Deal, N.J., at the home of the late Stanley Chera, a friend and donor who died in April from the coronavirus. The push comes after a heated call this past week in which Trump urged GOP megadonor Sheldon Adelson to contribute even more to the campaign, according to the officials."}]}