{"article": [{"url": "https://www.marketwatch.com/story/nvidia-data-center-sales-expected-to-surpass-gaming-for-first-time-2020-08-14", "published": 1597842500.0, "headline": "Nvidia data-center sales expected to surpass gaming for first time", "body": "Nvidia Corp.’s upcoming earnings report promises to usher in an era of firsts for the chip company, the most significant being formally shedding its past reputation as being primarily a gaming card company and fully embracing its role in shaping data centers. With Nvidia NVDA, -0.54% scheduled to report second-quarter earnings after the bell on Wednesday, shares were last up 0.2% at $491.31. Shares closed at a record $493.48 on Monday, and touched an all-time intraday high of $499.84 on Tuesday. On Monday, another analyst hiked the price target on the stock ahead of the earnings report and shares rallied enough to put the company at a value of more than $300 billion for the first time. The quarter will be the first to capture sales of Nvidia’s new data-center products like its A100 graphics-processing unit, that represent the first line of chips sporting a new GPU architecture that Nvidia dubs “Ampere.” Read: Nvidia unveils Ampere GPU architecture for AI boost, and the first target is coronavirus That coincides with a crucial shift in balance regarding Nvidia’s business segments. Up until now, Nvidia’s gaming segment has always been its largest source of revenue, but that’s expected to have changed significantly with the second quarter. While Nvidia’s data-center sales topped $1 billion for the first time in the first quarter of 2020, they still lagged behind gaming sales of $1.34 billion. For the second quarter, analysts expect data-center sales of $1.71 billion, compared with gaming sales of $1.41 billion. Also, back in July, Nvidia surpassed Intel Corp. INTC, -1.03% as the largest U.S. chip company by market capitalization, so this will be the company first earnings report in that position.What to expect Earnings: Of the 34 analysts surveyed by FactSet, Nvidia on average is expected to post adjusted earnings of $1.97 a share, up from the $1.77 a share expected at the beginning of the quarter. Revenue: Wall Street expects revenue of $3.65 billion from Nvidia, according to 32 analysts polled by FactSet. That’s up from the $3.11 billion forecast at the beginning of the quarter. Nvidia predicted revenue of $3.58 billion to $3.72 billion. Estimize, a software platform that uses crowdsourcing from hedge-fund executives, brokerages, buy-side analysts and others, expects revenue of $3.7 billion. Stock movement: Over the second quarter, Nvidia shares surged 44%, while the PHLX Semiconductor Index SOX, +1.77% gained 32%, the S&P 500 index SPX, +0.87% rose 20%, and the Nasdaq Composite Index COMP, +1.39% advanced 31%.What analysts are saying Ahead of earnings, Susquehanna Financial analyst Christopher Rolland, who has a positive rating on Nvidia, hiked his price target to $540 from $450 on the basis that new gaming chips from the company will help “de-risk” any possible softness in data-center sales going into the second half of the year. “While Intel and others prognosticate a 2H data center slowdown, we believe the setup remains more favorable for NVIDIA, helped by the relatively new launch of the A100,” Rolland said. Also on the gaming side, Rolland said an expected ramp-up of Switch consoles from Nintendo Co. NTDOY, -0.10% could boost Nvidia’s sales by $100 million in the second half. Morgan Stanley analyst Joseph Moore, who has an equal-weight rating and a $380 price target, also sees strong gaming sales going into the third quarter and a better-than-anticipated showing from Nvidia in data-center sales. Moore said “data center Ampere looks poised to roll out more broadly in the October quarter, after a July quarter that seems primarily driven by DGX server sales, allowing the company to outperform overall cloud which is seeing short-term digestion.” Last week, Wedbush analyst Matt Bryson, who has an outperform rating, hiked his price target to $500 from $420, and said he expects “only good news” from Nvidia. Bryson expects gaming trends picked up substantially over the quarter and to continue into the third quarter. In data center, Bryson said his checks suggested that demand for Nvidia GPUs exceeded supply. As a result, “that should yield a strong outlook” for the third quarter and offset any potential weakness for Mellanox network interface cards, he said. Raymond James analyst Chris Caso, who has an outperform rating, recently raised his price target to $500 from $370. “While the stock has had a good run, we consider NVDA to have among the strongest product cycles in semis, given the continued ramp of Ampere for datacenter, and the upcoming ramp of the new gaming chip, for which it appears the launch will occur on Aug 31,” Caso said. Caso also expects a big third quarter for data-center sales as “we expect that October is likely to be stronger given strong pent-up demand for Ampere.” Cowen analyst Matthew Ramsay, who has an outperform rating and a $475 price target, said he expects Ampere to drive Nvidia’s dominance in gaming and data-center for a while. “We see this continuing not just through F’21/22, but long-term as Nvidia capitalizes on its accelerated computing hardware strength, the broad/mature programming environment, and vertical-specific software ecosystems,” Ramsay said. Of the 40 analysts who cover Nvidia, 32 have buy or overweight ratings, six have hold ratings and two have sell or underweight ratings. Wall Street has an average price target of $430.71 on the stock, after at least nine analysts hiked price targets over the past week, according to FactSet data."}]}