{"article": [{"url": "https://www.marketwatch.com/story/donald-trump-needs-to-take-credit-for-the-no-longer-good-economy-to-distract-us-from-his-failures-11601313070", "published": 1601740400.0, "headline": "The K-shaped economic recovery: For half of America, the economy is still terrible", "body": "Donald Trump is counting on a big rebound in GDP in the current quarter to allow him to pat himself on the back for his economic leadership. But even a 30% annualized gain would leave GDP far below what it was before the pandemic hit. No president can be given credit for all the good luck on his watch without having to take some of the blame for the bad luck as well. With the possible exception of Donald J. Trump. Trump had the wonderful fortune to take office during a period of great economic stability. Job growth was strong, GDP growth was above potential, and inflation was low. Trump’s luck held for three years. The economy was good, but not great, as we shall see. “ Getting the unemployment rate down to 3.5% wasn’t Trump’s achievement or Obama’s—it was the work of the Fed, of Ben Bernanke, Janet Yellen, and Jerome Powell. Even more, it was the accomplishment of the American people. ” And then misfortune struck—the COVID-19 pandemic. Trump was faced with the first real test of his leadership and he failed. The U.S. response to the coronavirus has been among the worst in the world. Tens of thousands have died because Trump denied the most serious threat to public health in decades. Opinion: Why Donald Trump is a terrible leader Trump says he created the greatest economy in history before the pandemic hit, but it’s just not so. Presidents don’t build economies, the American people do. None of Trump’s policies transformed the U.S. economy in any long-lasting way. The tax cut gave the economy a brief jolt, and his trade wars have been a complete flop. Too busy celebrating The economy is in awful shape right now, but Trump won’t acknowledge it. He and his supporters are touting the 10.6 million jobs that have been created since May, but they ignore the 20.5 million who want to work but can’t, the 7.5 million part-timers who want to work full time, and the 1.4 million who file for unemployment benefits each and every week. Millions are suffering but the Trump campaign is too busy celebrating to hear. Trump has forgotten the words he spoke in his inaugural address: “I will fight for you with every breath in my body—and I will never, ever let you down.” If you are sick, or out of work, or have lost your business or a loved one, Trump has let you down. The celebrating is only going to get louder. We all know that on Oct. 29 he’ll be patting himself on the back for the huge quarter-on-quarter rebound (maybe an annualized 30%!) in gross domestic product that will be reported for the third quarter on that day, just five days before Election Day. He won’t, however, mention that GDP is still far below where it was at the beginning of the year, before he botched the COVID-19 crisis, nor will he mention that large portions of the economy—including Trump’s own businesses—will never fully recover until the coronavirus is beaten back.Exposed the rot The pandemic exposed the rot in the U.S. economy for all to see. As has been the case for decades, those who have wealth or education or privilege are doing fine, for the most part. With a few exceptions, the pandemic has been nuisance, but not a catastrophe. Not so for millions of their fellow Americans. Those who aren’t so lucky or privileged are scrambling to keep a roof over their heads, to put food on the table, to survive on the crumbs they get from unemployment, or to force themselves to physically go into their workplaces, hoping they won’t get sick or infect their customers, co-workers, friends and family. The recovery isn’t V-shaped, or L-shaped, but K-shaped, with half of the country doing well and the other half falling. The stock market DJIA, +0.56% has hit record highs while millions of people are unemployed with few prospects. Home sales are soaring while millions cannot pay their rent, or afford food. Millions have lost their health insurance amid a great public health crisis. For half of America, the economy is still terrible. Trump and the Republican Party have turned their backs on those who are hurting, because to acknowledge their plight would be to admit that Trump has been lying all along about how the coronavirus would just disappear. Opinion: Audaciously, Trump is running for re-election as the Hero of the Coronavirus WarWhat makes an economy ‘great’? We need to ask ourselves what we mean when we say the economy is great. My answer is that a great economy must work for everyone. It isn’t enough that billionaires are richer than ever. The greatest economy in history ought to be better than what we’ve settled for. It ought to deliver the things that matter to people: A sense of security and opportunity, access to good education and good health care and a healthy environment. By this standard, our economy isn’t the best, not even close. The U.S. has fallen to 28th place in the world on these quality-of-life metrics. The greatest economy ever would keep people safe from disease and violence and homelessness. The greatest economy in history wouldn’t have an epidemic of “deaths of despair.” Anne Case and Angus Deaton: The United States of Despair is gripped by two simultaneous pandemics that expose a widening inequality gap The richest 1% of Americans now own more than the entire middle class. The greatest economy in history would share the bounty with those who do the work, not just those who provide the capital. It wouldn’t let 1% of the households (around three million people) claim a third of the nation’s wealth, more wealth than 200 million working-class and middle-class Americans have combined. Almost 40 years ago, they were promised that the good things would trickle down to them. They are still waiting. The greatest economy in history wouldn’t require the support of massive fiscal deficits and extremely low real interest rates. The greatest economy in history wouldn’t judge itself by a stock market SPX, +0.87% whose gains accrue almost exclusively to the richest 10% of families and which reflect in large measure the fortunes of just six companies—Facebook FB, +0.26%, Apple AAPL, +1.74%, Amazon AMZN, +3.01%, Google GOOG, +1.97% GOOGL, +1.82%, Microsoft MSFT, +2.48% and Netflix NFLX, +1.43% —that employ relatively few workers. The middle class used to get more than half of U.S. household income. Now the elite gets more than half. A great economy wouldn’t have stagnant wages—the real wages of men working full time are no larger than they were in 1973. The middle class used to get more than half of the nation’s income. Now, the top 20% of households gets more than half. The greatest economy wouldn’t tell people who drive for Uber or deliver groceries and takeout food that they are “entrepreneurs,” when really they have no hope of building a future on the $10 an hour they clear. Trump and his voters knew the economy wasn’t great Trump knew all these things in 2016. He felt in his gut that the economic recovery under Barack Obama was incomplete, that many of Americans were dissatisfied with the economy and their own prospects. It wasn’t just a culture war that his voters wanted—although, in the end, that’s all they got. Trump promised to fix it all. In fact, he said he was the only one who could fix it. He didn’t fix it. But he thinks that if he just repeats the lie often enough, his supporters will believe that he did. I’ve long been skeptical that presidents have much impact on the short-run performance of the economy, unless they really screw it up, as Trump has done the past eight months. Fine-tuning the economy in the short run is the job of the Federal Reserve. Opinion: Why presidents shouldn’t get credit or blame for the economy Presidents generally make their mark with long-term investments or structural changes that will bear fruit over a period of decades. Think of Lincoln and the Homestead Act and the Transcontinental Railroad. Or FDR with Social Security and bank regulation, or Eisenhower with interstate highways. Carter, Reagan and Clinton deregulated many industries, while the space program and Cold War spending of the 1950s, ’60s and ’70s under Ike, JFK, LBJ and Nixon gave birth to most of the information and communication technologies that are still being mined today. Obama had the Affordable Care Act and investments in green technologies (think Tesla TSLA, +1.89% ) that are beginning to pay off. What is Trump’s signature policy move that is going to structurally change the U.S. economy for decades to come? There isn’t one. He talked about building and repairing infrastructure, but the self-proclaimed greatest deal maker in history never even tried. His efforts at deregulation have weakened labor, health, safety and environmental protections that benefit our economy much more than they cost. He hasn’t even attempted to articulate what his agenda for a second term would be.Trump’s failures Trump’s first (and, with any luck, his last) term will be known for two policies: The quixotic trade wars and the massive tax giveaway to corporations and the super rich. Trump promised to reduce the trade deficit. He didn't. The trade war was a disaster. It accomplished little beyond weakening economies around the world as global trade flows shrank. It amounted to a large tax increase on American consumers and producers. Few jobs were created, despite his promise to “bring back all the jobs.” Trump promised the tax cut would supercharge business investment in the U.S. It didn't. And the tax cut? It didn’t transform the economy by giving U.S. companies strong incentives to invest in America. Instead of being the promised supply-side boost to productivity and investment, the tax cut served only as a brief jolt of Keynesian sugar for the economy. It boosted consumption, not investment. That consumption created some extra jobs, but the job growth slowed again as the stimulus faded, forcing the Fed to cut rates again to keep it going. Getting the unemployment rate down to 3.5% wasn’t Trump’s achievement or Obama’s—it was the work of the Fed, of Ben Bernanke, Janet Yellen, and Jerome Powell. Even more, it was the accomplishment of the American people, who went to work every day and paid down their debts every month. They painstakingly rebuilt a ravaged economy over 10 years, only to have the guy who just showed up in the corner office take all the credit. “ “There is no limit to the amount of good you can do if you don’t care who gets the credit.” ” — Ronald Reagan Trump desperately needs to take credit for the economy, because he doesn’t have any other positive accomplishments to tout. He has to talk about an imaginary “great” economy to distract us from his failures, to make us forget the cemeteries and unemployment lines, and to make us forget that’ll we’ll need more than luck to rebuild our economy so it works for everyone. Now read: Temporary layoffs are becoming permanent job losses"}]}