{"article": [{"url": "https://www.marketwatch.com/story/trump-may-have-power-to-extend-eviction-moratorium-on-his-own-pelosi-says-11596649251", "published": 1596652760.0, "headline": "Trump may have power to extend eviction moratorium on his own, Pelosi says", "body": "Housing activists gather to protest alleged tenant harassment by a landlord and call for cancellation of rent on July 31 in Brooklyn. Getty Images The Trump administration might be able to extend the federal moratorium on tenant evictions unilaterally, House Speaker Nancy Pelosi said Wednesday. Pelosi’s comments came as an agreement struck Tuesday — to try to work out the framework for another stimulus package by the week’s end that could be turned into legislation next week — appeared to fray, with both sides raising doubts about the likelihood of that happening. Read more: White House, Democrats agree to try to reach coronavirus-aid deal by week’s end The eviction moratorium, put in place by the CARES Act in March, formally expired July 25, according to the Department of Housing and Urban Development, but because a 30-day notice of eviction is required to be served to tenants, the practical date of the moratorium’s end is Aug. 24, according to a Congressional Research Service report. White House chief of staff Mark Meadows and U.S. Treasury Secretary Steven Mnuchin put the moratorium and reviving a federal add-on payment to state jobless benefits at the top of their to-do list when they began face-to-face talks with Democratic leaders last week. “He may be able to extend the moratorium on evictions, but unless you have some money with that, it’s helpful but it’s not the whole thing,” Pelosi said in a televised interview Wednesday on MSNBC. Pelosi met with Mnuchin and Meadows on Tuesday and they confirmed then the White House was looking at what actions it could take on the moratorium and the unemployment payments through executive orders or other means without congressional approval. “Again, you can’t do the money without the Congress of the United States. The power of the purse begins in the House,” Pelosi said. HUD has already extended one anti-eviction deadline included in the CARES Act. In June, the department said it was extending the moratorium on foreclosures and evictions for homeowners with Federal Housing Administration-insured single family mortgages. The recently expired moratorium deadline applied to residents in public housing, using federal housing vouchers and in FHA-insured multifamily buildings. Meadows, speaking on CNN, said President Donald Trump would use his executive authority to help the jobless and people at risk of being evicted if he has to. “What I’m saying is by Friday, if we haven’t made significant progress and we’re too far apart, the president is prepared to take executive action,” Meadows said. “We believe that we can address those two things,” Meadows said, citing what he called “flexibility” provided in the CARES Act as well as “the executive privilege that the president enjoys broadly.” Meadows later told a group of reporters at the U.S. Capitol that when Democratic leaders Pelosi and Sen. Chuck Schumer agreed with Mnuchin and him to try to get a deal done by the week’s end, that was seen as Friday. But he was pessimistic about progress if nothing is agreed to by then. Pelosi herself appeared to backtrack somewhat on Friday as a drop-dead date. “I do believe that we have to reach an agreement,” she said. “What the timetable is really relates to the progress we make. How big will the bill be and how long will it last, those are the questions,” Pelosi said."}]}