{"article": [{"url": "https://www.marketwatch.com/story/slack-breaks-even-unexpectedly-but-stock-still-plummets-15-in-after-hours-trading-2020-09-08", "published": 1599640160.0, "headline": "Slack breaks even unexpectedly, but stock still plummets in after-hours trading", "body": "Slack Technologies Inc. showed strong growth Tuesday amid a global pandemic that has increased the need for its collaboration software, but it was not enough for investors once again, as they sent shares down hard in after-hours trading. Slack WORK, +3.36% has benefited from the COVID-19 pandemic that has sent workers home, as companies have sought software that can help their employees communicate and remain productive. Slack’s “freemium” approach to software — which allows some employees to test out the software before companies begin to pay — and longer contracts have kept it from showing the type of immediate financial returns that have been shown by other work-from-home tech beneficiaries like Zoom Video Communications Inc. ZM, +2.89% , however. For more: Slack was judged by Zoom standards, and it didn’t end well Slack on Tuesday afternoon reported fiscal second-quarter losses of $74.8 million, or 13 cents a share, on sales of $215.9 million, up from $145 million a year ago. After adjusting for stock-based compensation and other factors, the software company reported a break-even quarter, an improvement from adjusted losses of 14 cents a share a year ago and the first time the company has not reported an adjusted loss for a quarter. Analysts on average were expecting adjusted losses of 3 cents a share on sales of $209.1 million, according to FactSet. “Paid customer growth — which is the single most important driver of the business over the long term — accelerated in Q2, up 30% year-over-year,” Chief Executive Stewart Butterfield said in Tuesday’s news release. In a conference call with analysts following the earnings report, Butterfield said he expects paid-customer growth to “increase substantially” in the second half of the year as more companies adopt its communications-collaboration platform. He said the pandemic has, in part, fundamentally changed the way employers look at internal communications. Slack predicted third-quarter adjusted losses of 5 cents to 6 cents a share on sales of $222 million to $225 million and slightly increased its annual forecast, which now calls for adjusted losses of 13 cents to 14 cents a share on sales of $870 million to $876 million. Analysts on average were predicting third-quarter adjusted losses of 5 cents a share on sales of $223.9 million, according to FactSet. Slack Chief Financial Officer Allen Shim said during the analyst call that minimal churn among customers spending $100,000 a year on the company’s products will contribute to rising revenue. “Obviously, the momentum is very encouraging for new customers,” he added. Slack’s stock dove about 15% in after-hours trading immediately following the release of the results, and sunk to -18.5% during the analyst call. Shares have gained 30% so far this year, as the S&P 500 index SPX, +0.87% has increased about 3%. Butterfield has detailed strong gains for Slack, but has also attacked the approach of a major rival, Microsoft Corp. MSFT, +2.48% , which makes Teams software that offers similar messaging software combined with videoconferencing similar to Zoom’s. Slack filed an antitrust case against Microsoft in Europe related to Microsoft’s bundling of Teams with its other Office software offerings. “This [the lawsuit] is something years in the works,” Butterfield said during the analysts call. “We genuinely believe [Microsoft’s conduct] is illegal and anticompetitive behavior. [The suit] is a tactic more than a strategy... after competing with Microsoft for 14 quarters.” Contributing: Jon Swartz"}]}