{"article": [{"url": "https://www.marketwatch.com/story/were-essentially-pushing-the-pain-down-the-road-trumps-order-to-extend-payment-freeze-on-some-student-loans-leaves-many-unanswered-questions-11597076467", "published": 1597130660.0, "headline": "â\u0080\u0098Weâ\u0080\u0099re essentially pushing the pain down the roadâ\u0080\u0099: Trumpâ\u0080\u0099s order to extend payment freeze on some student loans leaves â\u0080\u0098many unanswered questionsâ\u0080\u0099", "body": "President Donald Trump issued an executive action pausing student-loan payments until December 31, 2020, but questions remain about its implementation. Photo: Drew Angerer/Getty Images. President Donald Trump extended the pause on payments and interest for some federal student loans as part of a slew of pandemic-related executive actions issued Saturday, but questions remain about how exactly the pause will be implemented and some borrower advocates say it doesnâ\u0080\u0099t go far enough in providing meaningful relief.Â As part of the CARES Act, the coronavirus relief package passed in March, Congress suspended payments and collections and waived interest on federal student loans held by the Department of Education. That pause was scheduled to expire on Sept. 30, about a month before the Presidential election.Â In his memo to Secretary of Education Betsy DeVos, directing her to implement the executive action, Trump wrote that it is â\u0080\u009cappropriateâ\u0080\u009d to extend the CARES Act policy â\u0080\u009cuntil such time that the economy has stabilized, schools have re-opened, and the crisis brought on by the COVID-19 pandemic has subsided.â\u0080\u009d The memo states that the payment pause and interest waiver on student loans held by the Department of Education will continue until Dec. 31, 2020.Â Though it seems clear that student-loan borrowers who had their payments paused and interest waived through the CARES Act will be able to continue that pause through the end of the year, â\u0080\u009cwe still have a lot of unanswered questions here,â\u0080\u009d said Ben Miller, vice president for postsecondary education at the Center for American Progress, a left-leaning think tank.Â The Department of Education didnâ\u0080\u0099t immediately respond to a request for comment on its plans for implementing the executive action.Â Outstanding questions Those questions include, for example, whether the paused payments will count towards the 120 needed for borrowers to qualify for Public Service Loan Forgiveness, a program that allows public servants to have their federal student loans forgiven after 10 years of payments. During the payment pause period covered by the CARES Act, borrowers who are in a qualifying repayment plan are receiving credit as if they were making on time monthly payments.Â In addition, itâ\u0080\u0099s unclear whether borrowers who have defaulted on their student loans will have collections paused during the period covered by Trumpâ\u0080\u0099s executive action, said Kyra Taylor, a staff attorney focusing on student loans at the National Consumer Law Center. The CARES Act paused wage garnishment and other forms of involuntary collection for these borrowers. Nonetheless, some are still having their paychecks seized. The mechanics of implementing the executive action are also still fuzzy, Miller said. Will borrowers opt in or opt out of this payment pause? How will student-loan servicers, the companies hired by the Department of Education to be borrowersâ\u0080\u0099 point of contact during the repayment process, actually code this pause into their system? At the outset of the CARES Act, these companies faced challenges implementing the payment pause and borrower advocates were already worried theyâ\u0080\u0099d struggle to deal with a crush of borrowers looking to change repayment plans as the pause lifted. For the past several weeks, these companies have been preparing to transition borrowers back into repayment.Â “ â\u0080\u0098Youâ\u0080\u0099re just seeing that executive action is no replacement for real legislation by Congress in this situationâ\u0080\u0099 ” â\u0080\u0094 Ben Miller, vice president for postsecondary education at the Center for American Progress â\u0080\u009cAs a practical matter it would clearly be so much better and so much easier for Congress to just extend what was in the CARES Act,â\u0080\u009d Miller said. â\u0080\u009cYouâ\u0080\u0099re just seeing that executive action is no replacement for real legislation by Congress in this situation.â\u0080\u009dÂ The Republican-led Senate proposed a coronavirus relief package last month that included a provision which would allow borrowers with no income to stay current on their loans without making payments, an option that is already available in the student-loan program. The Democratic-led House of Representatives passed the HEROES Act in May, which extended the CARES Act payment pause until 2021 and provided $10,000 of student debt cancellation for some borrowers.Â In addition to the confusion surrounding the Presidentâ\u0080\u0099s executive action, advocates have said it doesnâ\u0080\u0099t go far enough to address the challenges student-loan borrowers are facing during this time. For one, like the CARES Act, it only covers federal student loans that are actually held by the Department of Education. That means at least $165 billion of federal student loans are ineligible for the payment pause, according to Mark Kantrowitz, the publisher of Savingforcollege.com.Â Even for those borrowers that do qualify for the payment pause, â\u0080\u009cweâ\u0080\u0099re essentially pushing the pain down the road,â\u0080\u009d said Julie Margetta Morgan, vice president of research at the Roosevelt Institute, a progressive think tank.Â â\u0080\u009cWhatâ\u0080\u0099s going to happen whenever these payments get restarted is that peopleâ\u0080\u0099s debt burdens are going to be the same as they were at the beginning of the pandemic, but itâ\u0080\u0099s more than likely that their capacity to repay is going to be substantially reduced,â\u0080\u009d she said. â\u0080\u009cIn order to provide people real, meaningful relief and to boost the economy, we have to look for some kind of debt cancellation,â\u0080\u009d she added."}]}