{"article": [{"url": "https://www.marketwatch.com/story/peek-inside-sex-and-the-city-star-kim-cattralls-3-25-million-east-hampton-home-11602180767", "published": 1602166820.0, "headline": "Peek inside â\u0080\u0098Sex and the Cityâ\u0080\u0099 star Kim Cattrallâ\u0080\u0099s $3.25 million East Hampton home", "body": "Kim Cattrall's Hamptons home Gavin Zeigler for Sotheby's International Realty â\u0080\u009cSex and the Cityâ\u0080\u009d star Kim Cattrall is letting go of her serene retreat in East Hampton, NY. Sheâ\u0080\u0099s asking $3.25 million for the bayfront home. The actress purchased the property in 1998 for $420,000, so her investment has shown some serious appreciation. â\u0080\u009cKim has owned it for a while, and it is time for her to turn the page and simplify a bit,â\u0080\u009d says listing agent Rebekah Baker, with Sothebyâ\u0080\u0099s International Realty East Hampton Brokerage. â\u0080\u009cShe has her mom out West, and I think she wants to be closer to her.â\u0080\u009d Baker adds that Cattrallâ\u0080\u0099s touches are visible throughout. â\u0080\u009cShe did everything to this property. It is perfectly curated by her with beautiful gardens with tall grasses and bluestone walkways leading up to a home that has dimension and nooks to relax in, and yet it is open to the impressive water views. Decks at the back to view the water and a deck at the front to view the gardens.â\u0080\u009d For the inner artist, thereâ\u0080\u0099s a separate building to channel such inclinations. â\u0080\u009cShe has an incredible studio in the middle of the property to get away further and pursue creative pursuits like writing the three books she wrote while living here,â\u0080\u009d says Baker. The studio could be converted into a home gym or guest quarters. Set behind a gate and overlooking Gardiners Bay, the property offers seclusion and a â\u0080\u009claid-back waterfront lifestyle,â\u0080\u009d the listing notes. Kim Cattrall's Hamptons home Gavin Zeigler for Sotheby's International Realty Living and dining space Chris Foster Family room Chris Foster Fireplace and film projector Chris Foster Kitchen with outdoor access Chris Foster Studio Chris Foster The 1,300-square-foot main house features an L-shape living and dining area, which includes a wood-burning fireplace and a wall of water-facing windows. The living room doubles as a screening room with a projector and motorized screen that descends from the ceiling. The high-end kitchen opens to a patio and dining area outside. The floor plan includes two bedrooms, plus a loft, as well as 2.5 baths. The detached studio with walls of windows includes a half-bath. The large lot offers professionally landscaped grounds, with grassy areas, mahogany decks, and walkways, as well as a waterside fire pit and a hot tub with water views. Stone pavers lead to the bay. The actress also owns a fabulous and fashionable apartment on the Upper East Side of Manhattan. Featured in Architectural Digest, the posh pad she redesigned is filled with finds from the Paris flea market and artwork from galleries in Europe Cattrall is best known for her role as Samantha Jones on the popular HBO series â\u0080\u009cSex and the City,â\u0080\u009d for which she won a Golden Globe as well as two ensemble Screen Actors Guild awards. She also reprised the role for the two spinoff movies. The film, stage, and TV star most recently appeared in the lead role of the TV series â\u0080\u009cFilthy Richâ\u0080\u009d on Fox, which debuted this fall. This story was originally published on Realtor.com"}]}