{"article": [{"url": "https://www.marketwatch.com/story/virgin-galactic-stock-rallies-after-company-strikes-nasa-space-tourism-deal-2020-06-22", "published": 1592829440.0, "headline": "Virgin Galactic stock rallies after company strikes NASA space-tourism deal", "body": "Virgin Galactic Holdings Inc. shares jumped 10% Monday after the aerospace company struck a deal with NASA to train and outfit future space travelers in a bid to boost space tourism. Virgin Galactic’s SPCE, -3.12% stock was on pace for its best one-day gain since May 6, when it rose more than 11%, and traded as high as $17.70, its highest intraday level since June 1. Shares are up in five of the past seven sessions. Under the agreement, Virgin Galactic will develop “a new private orbital astronaut readiness program,” the company said in a statement. That entails identifying people interested in buying private astronaut missions to the International Space Station, procuring transportation to the ISS, on-orbit resources and ground resources, the company said. “The next generation of space traveler is interested in a variety of space experiences. Building on its commercial spaceflight training experience, Virgin Galactic believes it can provide an unparalleled, personalized customer experience for orbital space travel,” it said. Private astronaut experiences could range from private citizen expeditions to government-enabled scientific research missions, the company said. Virgin Galactic will also offer astronaut training to the future space tourists. The deal may lead “to commercial participants conducting research and other commercial activities aboard the ISS,” the company said. Virgin Galactic’s Spaceport America in New Mexico will be used for some elements of the program, it said. Virgin Galactic is “proud to share that insight in helping to grow another market for the new space economy. We want to bring the planetary perspective to many thousands of people,” Chief Executive George Whitesides said in the statement. The company’s deal comes three weeks after Tesla TSLA, +1.89% head Elon Musk’s Space Exploration Technologies Corp., or SpaceX, launched two astronauts into orbit from U.S. soil for the first time in nearly a decade, ushering a new era in commercial space travel. NASA in April announced another partnership with private companies, selecting privately held SpaceX as well as a team led by Blue Origin, founded by Amazon.com Inc.‘s AMZN, +3.01% Jeff Bezos, and Dynetics, a subsidiary of Leidos Holdings Inc. LDOS, +1.88% to work on the landing systems for its Artemis program, which aims to land the first woman and next man on the moon by 2024. Blue Origin’s team includes defense contractors Lockheed Martin Corp. LMT, -0.68% and Northrop Grumman Corp. NOC, -1.37% Analysts at UBS said in a note last year they expect the “space economy” to grow to around $244 billion this year and $805 billion by 2030. Virgin Galactic shares have gained 44% this year, contrasting with losses of 4% and 9% for the S&P 500 index SPX, +0.87% and the Dow Jones Industrial Average DJIA, +0.56% in the same period."}]}