{"article": [{"url": "https://www.marketwatch.com/story/feds-williams-says-hes-not-worried-about-inflation-2020-09-29", "published": 1601393600.0, "headline": "Fedâ\u0080\u0099s Williams says heâ\u0080\u0099s not worried about inflation hobbling an improving economy", "body": "A key top Federal Reserve official said Tuesday that he is not worried about inflation even as the economy is returning to faster growth after the shutdown in the spring. New York Fed President John Williams, who is a key adviser to Fed Chairman Jerome Powell, said that he doesnâ\u0080\u0099t see any sign of high inflation. â\u0080\u009cIâ\u0080\u009dm not worried about inflation. Obviously if there were significant inflationary pressures with inflation taking off, we know how to respond to that. But I donâ\u0080\u0099t see any signs of that,â\u0080\u009d Williams said, during a discussion sponsored by the Fisher Center for Real Estate & Urban Economics at the University of California, Berkeley. Some analysts and Fed officials think that the economy is recovering so strongly that there will be bottlenecks that push up prices. Other economists note that wage growth, a critical component of inflation, remains subdued. The Fed has promised to allow inflation to run moderately above its 2% target for some time before lifting rates off of zero. Williams was relatively upbeat about the economy, saying he was optimistic that the strong recovery seen since June would continue for the rest of the year and into next year. He said he expected the economy would fully recover in about three years time. Read:New York Fedâ\u0080\u0099s Williams says Treasury market seizure in March underlines importance of central bank backstop Other Fed officials have sounded more cautious about the downside risks given the economy is not through the pandemic. â\u0080\u009cI do think the economy is on a pretty good trajectory,â\u0080\u009d Williams told reporters following his appearance. If Congress fails to pass more spending, it would result in a somewhat weaker outlook, he said, but only lower the trajectory a bit. He acknowledged there was a lot of uncertainty in the forecast. Williams said that if people arenâ\u0080\u0099t comfortable adapting and returning to some semblance of pre-coronavirus life of regular interactions with other people, it will be hard for the economy to fully recover. â\u0080\u009cIf we donâ\u0080\u0099t see people comfortable going back into stadiums and theaters and restaurants, it is really going to be hard to get backâ\u0080\u009d to get to the 100% pre-Covid economic levels, he said. Williams said he was surprised the economy has managed to see some improvement in growth since the summer even as virus cases were rising. Stocks were lower Tuesday as investors awaited the first presidential debate. The Dow Jones Industrial Average DJIA, +0.56% Â was down 58 points in late afternoon trading."}]}