{"article": [{"url": "https://www.marketwatch.com/story/why-do-so-many-americans-refuse-to-wear-face-masks-it-may-have-nothing-to-do-with-politics-2020-06-16", "published": 1593354260.0, "headline": "Why do so many Americans refuse to wear face masks? Politics is part of it â\u0080\u0094 but only part", "body": "When Delaware International Speedway, a raceway in Delmar, Del., reopened to spectators earlier this month, attendees were forewarned that they had to wear face masks. â\u0080\u009cAs a part of the agreement for opening with the State of Delaware those social distancing measures are still in place as well as, masks must be worn by all spectators,â\u0080\u009d according to the stadiumâ\u0080\u0099s official policy. “ Those who choose not to wear masks may feel a sense of solidarity, like theyâ\u0080\u0099re taking a stand against authority. ” However, pictures from the first race held on June 6 showed that many spectators did not abide by the face-mask requirement. Delaware International Speedway did not respond to a MarketWatch request for a comment. In early April, the Centers for Disease Control and Prevention recommended that Americans wear a face cloth covering or mask in places where it is difficult to social distance from other people. However, there currently is no federal mandate to wear face coverings. Nor is the wearing of eye protection a formal recommendation, though a study published in the Lancet found an association with reduced infection. Related: â\u0080\u0098I woke up in a free countryâ\u0080\u0099: Costco shopper gets bounced from store after refusing to wear a mask Individual states including Delaware, New York, Virginia and Illinois require citizens to wear masks in public places. Washington state joined that list just days ago. Other states require essential-business employees and patrons while on premises to wear masks, while some only require employees to wear them. Meanwhile, many states donâ\u0080\u0099t have any mask requirements and instead recommend that they be worn in public places. But even in states with mask mandates, Americans are defying these orders despite evidence that suggests that widespread use of face masks can greatly limit the transmission of the coronavirus, which is believed to occur mainly from respiratory droplets. Donâ\u0080\u0099t miss:Is Americaâ\u0080\u0099s most masked city losing its grip on safety?Why people are wearing masks even if they arenâ\u0080\u0099t required to On Sunday, U.S. Surgeon General Jerome Adams tweeted: â\u0080\u009cSome feel face coverings infringe on their freedom of choice â\u0080\u0094 but if more wear them, weâ\u0080\u0099ll have MORE freedom to go out.â\u0080\u009d “ In times of heightened uncertainty, humans tend to seek a sense of belonging. That cuts both ways. ” â\u0080\u009cUltimately it is a choice we make, and I hope itâ\u0080\u0099s made based on the best available/current science, and a desire to do all we can to help others and ourselves/our communities,â\u0080\u009d he said in a subsequent tweet. â\u0080\u009cLike vaccines, the more who participate, the greater the impact.â\u0080\u009d It may go beyond politics. In times of heightened uncertainty, humans tend to seek a sense of belonging, said David Abrams, a professor of social and behavioral sciences at the NYU School of Global Public Health. That cuts both ways. Those who donâ\u0080\u0099t wear masks may feel a sense of solidarity, and those that do likely regard it â\u0080\u009cas an act of altruism and a way of helping each other out,â\u0080\u009d said Abrams. iframe.twitter-tweet { width: 100% !important; } People who have lost a loved one to the coronavirus are also more likely to wear masks, he said. â\u0080\u009cThinking about real people and personalizing coronavirus gets at that emotion of altruism and nurturance. You side with the tribe that wears masks and you go, â\u0080\u0098Oh I want to be part of that.â\u0080\u0099 â\u0080\u009d If common sense prevailed, all Americans would wear face masks, Abrams told MarketWatch. But in light of heightened uncertainty, â\u0080\u009cstrong emotions override rationality, and we look to leaders for guidance.â\u0080\u009d “ â\u0080\u0098Thereâ\u0080\u0099s a certain bravado of being angry and defying requirements to wear a mask.â\u0080\u0099 ” â\u0080\u0094 David Abrams, NYU School of Global Public Health Notably, President Donald Trump and Vice President Mike Pence have been reluctant to wear â\u0080\u0094 and have refused to wear â\u0080\u0094 masks in public, and in Trumpâ\u0080\u0099s case to bristle at the sight of people wearing face coverings, or even in some instances to practice social distancing in his presence. Pence violated the standards of the famed the Mayo Clinic in Minnesota and did not wear one during an April visit when he met with staff and patients. (A week after Penceâ\u0080\u0099s visit he acknowledged heâ\u0080\u0099d made a mistake by visiting patients without a mask, wearing a mask in his next public appearance, before returning to following Trumpâ\u0080\u0099s example.) â\u0080\u009cPeople look at [Pence at the Mayo Clinic] and say: â\u0080\u009cWell, heâ\u0080\u0099s in a hospital and didnâ\u0080\u0099t wear a mask, [so] why should I?â\u0080\u0099 â\u0080\u009d Abrams said. Pence and Trump both appeared to blame testing in the U.S. for a recent rise in COVID-19 cases. Pence, on a Monday call with governors, actively encouraged the echoing of a Trump administration stance that the increase in cases is due to an increase in testing. â\u0080\u009cThe administrationâ\u0080\u0099s argument that less testing means fewer COVID-19 cases exist is absurd,â\u0080\u009d countered Kyle Herrig, president of the nonpartisan advocacy group Accountable.US. Unlike many countries in East Asia, before coronavirus Americans rarely were asked to wear a face mask in public. Now Americans who donâ\u0080\u0099t wear masks can be denied entry to stores including Costco COST, +1.19%, Dollar Tree DLTR, +2.30% Â and Apple AAPL, +1.74% AAPL, +1.74%, and can be barred from flying on United Airlines UAL, +0.32%. Americans who choose not to wear masks, Abrams said he suspects, â\u0080\u009cdonâ\u0080\u0099t want to admit that this is the new normal,â\u0080\u009d he said. â\u0080\u009cThey want the old America that theyâ\u0080\u0099re used to.â\u0080\u009d It may be a reaction (or overreaction) to authority. â\u0080\u009cThereâ\u0080\u0099s a certain bravado of being angry and defying requirements to wear a mask,â\u0080\u009d he said. On the other hand, Americans are rarely up in arms when they see signs that require them to wear shoes or shirts because abiding by those standards is part of our culture, he added. Donâ\u0080\u0099t miss: â\u0080\u0098People probably arenâ\u0080\u0099t going to react kindly or openly to being policedâ\u0080\u0099: How to deal with someone who refuses wear a face maskDemographic disparities when it comes to wearing a face mask Gender, political affiliation, race, income and geography all appear to play a role when it comes to wearing a mask or not â\u0080\u0094 some determining factors: Men are less likely to believe theyâ\u0080\u0099ll be seriously impacted by COVID-19, one study shows. Unlike women, theyâ\u0080\u0099re more likely to see wearing face coverings as â\u0080\u009ca sign of weakness.â\u0080\u009d A person in the top-earning segment, averaging $233,895, was more likely to wear a mask than someone making an average of $13,775, according to this study. â\u0080\u009dItâ\u0080\u0099s less burdensome for people to engage in these behaviors when they have more money,â\u0080\u009d Nicholas Papageorge, an author of the study, told MarketWatch. Some 80% of New York City residents and nearly 79% of Los Angeles residents said they always wear masks in public, according to a nationally representative survey published by the Centers for Disease Control and Prevention. However, outside of the two cities, 60% of Americans responded that they always wear masks in public. â\u0080\u009cNationwide, higher percentages of respondents from urban areas reported use of cloth face coverings than did rural area respondents,â\u0080\u009d the report states. â\u0080\u009cBecause outbreaks have been reported in rural communities and among certain populations since March 2020 these data suggest a need for additional and culturally effective messaging around the benefits of cloth face coverings targeting these areas.â\u0080\u009d In the second week of April, a week after the CDC recommended all Americans wear face coverings in public, the divide between Democrats and Republicans who said they wear masks at all times when leaving home was fairly narrow, according to an Ipsos/Axios poll. “ â\u0080\u0098Trump had not made a point of not wearing a mask. Once he very clearly did not wear mask in public that transmitted a signal.â\u0080\u0099 ” â\u0080\u0094 Chris Jackson, Ipsos Public Affairs Some 38% of Democrats and 24% of Republicans at that time said that they wore masks at all times. By the second week of June, some 60% of Democrats and about 34% of Republicans responded they wear masks at all times. That is the largest difference in mask wearing across all demographics, including household income, age, race and gender, said pollster Chris Jackson, senior vice president for Ipsos Public Affairs. In early April, â\u0080\u009cTrump had not made a point of not wearing a mask,â\u0080\u009d Jackson said. â\u0080\u009cOnce he very clearly did not wear mask in public, that transmitted a signal that if youâ\u0080\u0099re a good supporter of the president you donâ\u0080\u0099t wear a mask.â\u0080\u009d The Dow Jones Industrial Index DJIA, +0.56% Â and the S&P 500 SPX, +0.87% Â ended higher Tuesday on the back of higher-than-expected retail sales and a report of a potential therapeutic steroid treatment for patients with severe COVID-19 symptoms."}]}