{"article": [{"url": "https://www.marketwatch.com/story/trump-signs-plan-to-spend-3-billion-a-year-on-national-parks-and-public-land-during-a-year-busy-with-epa-rollbacks-2020-08-04", "published": 1596547400.0, "headline": "Trump signs plan to spend $3 billion a year on national parks and public land during a 2020 crammed with EPA rollbacks", "body": "President Trump signed the $3-billion-a-year Great American Outdoors Act into law Tuesday, an investment in America’s national parks and public lands that drew criticism from some Republicans over an expense backlog and from climate groups who dislike the continued protection of oil interests. The legislation will provide $900 million a year in permanent funding to the Land and Water Conservation Fund (LWCF), doubling the current spending. It will allocate $9.5 billion over five years to restore facilities and infrastructure at national parks and on public lands. The act will create over 100,000 additional infrastructure-related jobs, its proponents stressed. “This legislation marks the most significant conservation accomplishment since the presidency of Theodore Roosevelt,” President Trump said in a release that accompanied the signing. The measure was convincingly approved by Congress, but did have some detractors. Congressional champions of the bill are Republican Sens. Cory Gardner of Colorado and Steve Daines of Montana. Both are up for reelection in 2020 and hold some of the most contested Senate seats in this year’s race. Each represents a state where the outdoor economy and tourism at sites such as the Rocky Mountain and Yellowstone national parks play an outsize role, making passage a key part of their campaigns. Their positions on natural-resource use, including on public lands, is also a key election factor. “While Trump spends the day congratulating himself and Senate Republicans for the conservation legislation, this one action doesn’t even put a dent in the long list of anti-climate actions he’s taken as a president,” said Lori Lodes, executive director of Climate Power 2020, a representative group of several environmental groups targeting the politics of climate change for this year’s election. “He has rolled back 100 regulations, silenced communities of color and sold our public lands to the fossil fuel industry during his four years in the White House.” Read:Preserving some drilling, Pelosi and climate panel push Congress to get nation to net-zero emissions by 2050 “This bill will allow Americans to continue to enjoy the freedom of the outdoors,” said ConservAmerica, which bills itself as a group promoting market-based solutions to conservation, environmental and energy challenges. Among the statistics the group emphasized is the $200 billion economic contribution, and 1.3 million American jobs, created by the activities of 49 million American sportsmen. The legislation’s opponents, mostly Republicans, complained it would not eliminate an estimated $20 billion maintenance backlog on 640 acres (259 hectares) of federally owned lands. Maintenance funding will come from the $9.5 billion over five years. Lawmakers from Gulf Coast states also argued that their states receive too small a share of revenue from offshore oil and gas drilling that is used to pay for the conservation fund. The Associated Press contributed to this report."}]}