{"article": [{"url": "https://www.marketwatch.com/story/is-mulan-worth-30-the-answer-and-other-streaming-picks-for-september-2020-2020-08-31", "published": 1599143720.0, "headline": "Is â\u0080\u0098Mulanâ\u0080\u0099 worth $30? The answer, and other streaming picks for September 2020", "body": "After a relatively slow summer, the major streaming services are kicking it back into gear in September, with a slew of new series and movies featuring some very big names. That includes â\u0080\u009cMulan,â\u0080\u009d which will ask consumers to pay $30 to essentially rent the movie for three months. (More on that below.) As this column has previously mentioned, consumers can take full advantage of cord-cutting by capitalizing on the ability to add and drop streaming services each month, and all it takes is good planning and timing. Remember, a billing cycle starts when you sign up, not necessarily at the beginning of each month. Consumers can also take advantage of deals for free streaming trials, as Disney+ and Apple TV+ in particular focus on building subscriber bases rather than growing revenue (for now, at least). Youâ\u0080\u0099re never going to get a better deal than free, and the offers wonâ\u0080\u0099t last forever. Keep in mind, some offers have lapsed while new ones have popped up (such as an intriguing bundle of Apple TV+, CBS All Access and Showtime for $9.99 a month, and a free Verizon bundle of Disney+, Hulu and ESPN+ for some wireless customers). Free and bundled possibilities aside, when itâ\u0080\u0099s time to decide where your subscription dollars should go, Whatâ\u0080\u0099s Worth Streaming is here to help. We rate each major streaming service every month as a â\u0080\u009cplay,â\u0080\u009d â\u0080\u009cpauseâ\u0080\u009d or â\u0080\u009cstop,â\u0080\u009d similar to investment analystsâ\u0080\u0099 ratings of buy, hold and sell, and pick the best content to help you make your monthly decisions. Hereâ\u0080\u0099s a look at whatâ\u0080\u0099s coming to the various streaming services in September 2020, and whatâ\u0080\u0099s really worth the monthly subscription feeDisney+ ($6.99 a month) OK, letâ\u0080\u0099s get this out of the way first. Disney+â\u0080\u0099s September offerings pretty much begin and end with â\u0080\u009cMulanâ\u0080\u009d (Sept. 4), the bold gambit for one of the most anticipated movies of the year that could pave a new way for major movies to be released. With the coronavirus pandemic forcing theaters to close (some are starting to reopen only now, with sharply reduced seating capacity), Walt Disney Co. DIS, +1.53% has decided to take the movie directly to subscribers for $30. â\u0080\u009cMulanâ\u0080\u009d is, of course, the live-action remake of Disneyâ\u0080\u0099s 1998 animated hit, about a young Chinese girl who disguises herself as a male warrior to save her father, and becomes a hero battling invaders. The new version looks to be a fairly spectacular action drama. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } UPDATE: It was announced Thursday that â\u0080\u009cMulanâ\u0080\u009d will be available for no additional charge to Disney+ subscribers starting Dec. 4, which very much changes the following two paragraphs, which were written before that announcement: Keep in mind, itâ\u0080\u0099s not quite a rental and not quite a purchase â\u0080\u0094 for $30 on top of the $6.99-a-month subscription price, Disney says the â\u0080\u009cunlockedâ\u0080\u009d movie be available to watch for as long as you have a Disney+ subscription. Thatâ\u0080\u0099s a big caveat though â\u0080\u0094 if you drop Disney+ for a month to save money, youâ\u0080\u0099ll also lose access to â\u0080\u009cMulan.â\u0080\u009d So bottom line: Is â\u0080\u009cMulanâ\u0080\u009d worth paying for? Maybe. While a lot of people gasped at the $30 price tag when it was announced, that still could be cheaper (and safer) than taking multiple kids to the multiplex. Of course, there are those who have no problem splurging on a new Disney movie, and thatâ\u0080\u0099s fine. But for the rest of us, there are a few things to consider â\u0080\u0094 IF youâ\u0080\u0099re OK with committing to subscribing to Disney+ for the long haul, and IF you have multiple kids (or multiple housemates) whoâ\u0080\u0099d watch it, and IF â\u0080\u009cMulanâ\u0080\u009d gets decent reviews, then sure, feel free to shell out $30 without regret since you can probably justify the cost. But if the answer to any of those is â\u0080\u009cno,â\u0080\u009d then consider it safe to skip â\u0080\u0094 $30 is, after all, significantly pricier than a DVD purchase or a typical digital download. One more thing: Donâ\u0080\u0099t count on â\u0080\u009cMulanâ\u0080\u009d to be added for free on Disney+ too quickly. While it will likely join the serviceâ\u0080\u0099s regular lineup eventually (perhaps six to nine months from now?), remember that for decades Disney has been the master at keeping movies locked in its vault and making their limited availability a selling point. So, the NEW bottom line: The Dec. 4 release data is a shocker and changes the calculus entirely. The question is now this: Do you wait three months and see â\u0080\u009cMulanâ\u0080\u009d for free (well, not free, but for your $6.99 a month) or pay an extra $30 to watch it early? Which....duh? Does anyone need to see a movie at home THAT badly? Itâ\u0080\u0099s a no-brainer: There is zero reason to spend $30 on â\u0080\u009cMulan,â\u0080\u009d unless you just want to help line Disneyâ\u0080\u0099s pockets. Wait a few months and watch it as part of your subscription. Whoâ\u0080\u0099s Disney+ for? Families with kids, and hard-core â\u0080\u009cStar Warsâ\u0080\u009d and Marvel fans. For those not in that group, its library is lacking. Play, pause or stop? Pause and think it over. If you have kids, then Disney+ is worth a subscription, hands down. But if not, thereâ\u0080\u0099s not much point.Netflix ($8.99 or $12.99 a month) Netflix NFLX, +1.43% is rolling out the big names in September, starting with â\u0080\u009cAwayâ\u0080\u009d (Sept. 4), a space/family drama series starring Oscar-winner Hilary Swank as an astronaut leading the first manned flight to Mars, coping with both the challenges of her mission and the pain of leaving her family behind on Earth. Jason Katims (â\u0080\u009cFriday Night Lights,â\u0080\u009d â\u0080\u009cParenthoodâ\u0080\u009d) serves as executive producer, so expect some serious pulling of the heartstrings. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Another Oscar-winner â\u0080\u0094 writer/director Charlie Kaufman (â\u0080\u009cBeing John Malkovich,â\u0080\u009d â\u0080\u009cEternal Sunshine of the Spotless Mindâ\u0080\u009d) â\u0080\u0094 will debut his latest film the same day, with the psychological thriller â\u0080\u009cIâ\u0080\u0099m Thinking of Ending Thingsâ\u0080\u009d (Sept. 4), starring Jessie Buckley as a young woman meeting her boyfriendâ\u0080\u0099s parents for the first time. Safe to say, it does not go well, as she ends up questioning her sanity and the very nature of reality. Based on the trailer, it looks typically Kaufmanesque â\u0080\u0094 very weird, and likely very good. Staying in the psychological thriller genre, producer Ryan Murphy will roll out his latest drama series â\u0080\u009cRatchedâ\u0080\u009d (Sept. 18), with Emmy-winner Sarah Paulson starring in the technicolor and campy origin story of one of Hollywoodâ\u0080\u0099s great villains: Nurse Ratched from â\u0080\u009cOne Flew Over the Cuckooâ\u0080\u0099s Nest.â\u0080\u009d Thereâ\u0080\u0099s also â\u0080\u009cEnola Holmesâ\u0080\u009d (Sept. 23), a rollicking mystery movie starring Millie Bobby Brown (â\u0080\u009cStranger Thingsâ\u0080\u009d) as the younger sister of Sherlock; Rachael Leigh Cook and Damon Wayans Jr. in the rom-com movie â\u0080\u009cLove, Guaranteedâ\u0080\u009d (Sept. 3), which looks sappy and predictable but slightly charming; and â\u0080\u009cSing On!â\u0080\u009d (Sept. 16), a karaoke competition series hosted by Tituss Burgess (â\u0080\u009cThe Unbreakable Kimmy Schmidtâ\u0080\u009d). See: Hereâ\u0080\u0099s everything coming to Netflix in September 2020 â\u0080\u0094 and whatâ\u0080\u0099s leaving And after a popular series of novels and at least two TV adaptations, troubled-but-brilliant Swedish detective Kurt Wallander is back, this time in an English-language prequel series exploring how the young cop became a super-sleuth. Adam Palsson plays the rookie investigating a hate crime in â\u0080\u009cYoung Wallanderâ\u0080\u009d (Sept. 3). Fans of Nordic shows will also appreciate the addition of all three seasons of the acclaimed 2010-â\u0080\u009913 political drama â\u0080\u009cBorgenâ\u0080\u009d (Sept. 1), which was hailed by critics as the Danish â\u0080\u009cWest Wing.â\u0080\u009d September also brings the animated kidsâ\u0080\u0099 adventure series â\u0080\u009cJurassic World: Camp Cretaceousâ\u0080\u009d (Sept. 18); â\u0080\u009cSneakerheadsâ\u0080\u009d (Sept. 25), a new comedy series about a man and his sneaker obsession; and a ton of mouth-watering food docuseries, including â\u0080\u009cChefâ\u0080\u0099s Table: BBQâ\u0080\u009d (Sept. 2), â\u0080\u009cTaco Chronicles Volume 2â\u0080\u009d (Sept. 15) and Season 2 of Jon Favreauâ\u0080\u0099s â\u0080\u009cThe Chef Showâ\u0080\u009d (Sept. 24). And among older additions, check out â\u0080\u009cMidnight Specialâ\u0080\u009d (Sept 7), a clever 2016 indie sci-fi chase movie that may satisfy your itch for â\u0080\u009cStranger Thingsâ\u0080\u009d until a new season arrives; all three â\u0080\u009cBack to the Futureâ\u0080\u009d movies (all Sept. 1); and the final season of the hit NBC afterlife comedy â\u0080\u009cThe Good Placeâ\u0080\u009d (Sept. 26). Whoâ\u0080\u0099s Netflix for? Fans of buzz-worthy original shows and movies. Play, pause or stop? Play. Netflix is still the king of streaming, and September looks to be a strong month for new releases.Hulu ($5.99 a month or $11.99 with no ads) As stacked as Netflixâ\u0080\u0099s lineup is in September, Huluâ\u0080\u0099s is just as impressive. Thatâ\u0080\u0099s thanks largely to its streaming partnership with FX â\u0080\u0094 arguably cableâ\u0080\u0099s most high-quality network. A pair of FX favorites are set to return for new seasons, available for streaming the next day on Hulu. Itâ\u0080\u0099s been three years since the last season of Noah Hawleyâ\u0080\u0099s brilliant crime anthology â\u0080\u009cFargo,â\u0080\u009d but the fourth season will finally drop on Hulu on Sept. 28 (it was originally due in April, but was pushed back due to the pandemic). The series will step back in time this go-around, focusing on a Kansas City mob war in 1950, and stars Chris Rock and Jason Schwartzman as capos in rival crime syndicates. If itâ\u0080\u0099s anything like the previous three installments, â\u0080\u009cFargoâ\u0080\u009d will be one of the yearâ\u0080\u0099s best shows and very much worth watching. Another FX (technically FXX) hit also returns, with the 11th season of â\u0080\u009cArcherâ\u0080\u009d (Sept. 17), the animated but extremely adult spy comedy. After three seasons of meandering stories sourced from the comatose Archerâ\u0080\u0099s mind, heâ\u0080\u0099s awake again and back in the spy business â\u0080\u0094 which has apparently changed a bit during his absence. Perhaps going back to basics will rekindle the magic that made â\u0080\u009cArcherâ\u0080\u009d one of the funniest, most demented shows of its time. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Hulu will also launch a pair of original comedies, with the second season of â\u0080\u009cPen15â\u0080\u009d (Sept. 18) and the debut of â\u0080\u009cWokeâ\u0080\u009d (Sept. 9). â\u0080\u009cPen15â\u0080\u009d is the cringe-worthy comedy from the brains of Maya Erskine and Anna Konkle, who play seventh-grade versions of themselves. In addition to being incredibly awkward, itâ\u0080\u0099s also very funny. â\u0080\u009cWoke,â\u0080\u009d meanwhile, is an intriguing series about a sheltered Black cartoonist who gets harassed by the police, and suddenly sees the world in a whole new, more paranoid light. The trippy-looking series mixes live action and animation, and appears to be very timely. See: Hereâ\u0080\u0099s whatâ\u0080\u0099s coming to Hulu in September 2020, and whatâ\u0080\u0099s leaving Thereâ\u0080\u0099s also the FX docuseries â\u0080\u009cA Wildness of Errorâ\u0080\u009d (Sept. 26), about the notorious Jeffrey MacDonald murder case, and next-day streaming of Foxâ\u0080\u0099s fall shows, including â\u0080\u009cBobâ\u0080\u0099s Burgersâ\u0080\u009d and â\u0080\u009cThe Simpsonsâ\u0080\u009d (Sept. 28). Whoâ\u0080\u0099s Hulu for? TV lovers. Thereâ\u0080\u0099s a deep library for those who want older TV series, and next-day streaming for many current network and cable shows Play, pause or stop? Play. Hulu is the best value in streaming, and with the addition of FX, the top spot for high-quality series.Amazon Prime Video ($12.99 a month) Amazon.com Inc.â\u0080\u0099s AMZN, +3.01% streaming service has a new season of a fan favorite coming in September, along with an intriguing conspiracy thriller. â\u0080\u009cThe Boysâ\u0080\u009d returns for its second season Sept. 4, with the eponymous gang of superhero-haters on the run from the police and the corporate-backed superhero group The Seven. Itâ\u0080\u0099s a cynical, ultra-violent and very adult series that has a strong cult following, but its unrelenting unpleasantness isnâ\u0080\u0099t for everyone. Sept. 25 will see the release of â\u0080\u009cUtopia,â\u0080\u009d adapted by Gillian Flynn (â\u0080\u009cGone Girlâ\u0080\u009d) and featuring Sasha Lane, Rainn Wilson and John Cusack, among others. Itâ\u0080\u0099s about a group of fanboys and -girls who discover that a comic-book conspiracy is actually real, and only they can stop a coming pandemic from wiping out humanity. While feeling a bit meta, the concept of a group of good guys preventing a pandemic seems like nice wish-fulfillment at this point of 2020, and the trailer, at least, looks solidly entertaining. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Also: Hereâ\u0080\u0099s everything coming to Amazon Prime Video in September 2020 Prime Video will also debut the political documentary â\u0080\u009cAll In: The Fight for Democracyâ\u0080\u009d (Sept. 18), about voter suppression in the U.S., as well as the soccer docuseries â\u0080\u009cAll or Nothing: Tottenham Hotspurâ\u0080\u009d (Aug. 31) and a handful of classic movies, such as â\u0080\u009cClose Encounters of the Third Kind,â\u0080\u009d â\u0080\u009cThe Graduate,â\u0080\u009d and â\u0080\u009cThe Last House on the Leftâ\u0080\u009d (all Sept. 1). Whoâ\u0080\u0099s Amazon Prime Video for? Movie lovers, TV-series fans who value quality over quantity. Play, pause or stop? Pause and think it over. Is this a necessary month to subscribe? Probably not. Is there still enough interesting content there to make it worth your while? Probably.HBO Max ($14.99 a month) Itâ\u0080\u0099s not just Netflix with the big names in September â\u0080\u0094 HBO Max has plenty of its own to offer. That includes director Ridley Scottâ\u0080\u0099s original Max sci-fi series â\u0080\u009cRaised by Wolvesâ\u0080\u009d (Sept. 3), about a pair of androids raising human children on a mysterious planet; as well as the HBO social-distancing comedy movieâ\u0080\u009cCoastal Elitesâ\u0080\u009d (Sept. 12), starring Bette Midler, Issa Rae and Sarah Paulson; and â\u0080\u009cThe Third Day,â\u0080\u009d a miniseries starring Jude Law and Naomie Harris as visitors to a mysterious island. The trailer, at least, looks intriguingly unsettling. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Thereâ\u0080\u0099s also the Max original movie â\u0080\u009cUnpregnantâ\u0080\u009d (Sept. 10), a road-trip comedy about two former best friends mulling over major life decisions; â\u0080\u009cWe Are Who We Areâ\u0080\u009d (Sept. 14), a coming-of-age drama series about two American kids on a military base in Italy; the true-crime story â\u0080\u009cThe Murders at White House Farmâ\u0080\u009d (Sept. 24); and the dog-grooming competition series â\u0080\u009cHaute Dogâ\u0080\u009d (TBA). There are also new episodes of the terrific and fantastical horror series â\u0080\u009cLovecraft Country,â\u0080\u009d though John Oliverâ\u0080\u0099s always excellent â\u0080\u009cLast Week Tonightâ\u0080\u009d is taking a few weeks off, to return Sept. 27. Whoâ\u0080\u0099s HBO Max for? HBO fans and movie lovers. Though oddly enough, itâ\u0080\u0099s still NOT for Roku or Amazon Fire users, since HBO Max owner AT&T Inc. T, -1.01% has yet to hammer out a deal with the two biggest makers of streaming-TV devices. Play, pause or stop? Stop. If you already get HBO, then by all means explore Max. But the lack of Roku and Amazon compatibility makes it hard to recommend Max for most consumers. UPDATE: If you are looking to hop aboard the Max train, nowâ\u0080\u0099s the time: HBO Max is offering a discounted subscription of $11.99 a month for 12 months if you sign up between Sept. 4 and 25. Thatâ\u0080\u0099s a savings of about $36 for the year.Peacock (free basic level, $4.99 a month with ads, or $9.99 a month with no ads) After an underwhelming slate of originals when it launched, September should finally offer a reason or two to consider upgrading to the paid, Premium tier of Peacock, the streaming arm of Comcast Corp.â\u0080\u0099s CMCSA, -0.99% NBCUniversal, with the arrival of NBC Sports, Premier League soccer and a new season of the underrated sitcom â\u0080\u009cA.P. Bioâ\u0080\u009d (Sept. 3). Peacock announced a deal in early July to become the U.S. streaming home for the English Premier League, offering more than 175 matches during the 2020-â\u0080\u009921 season, starting Sept. 12. Thatâ\u0080\u0099s about half of the Premier League slate, with the rest being shown on NBCâ\u0080\u0099s broadcast and cable channels. Peacock will also feature live NBC Sports coverage of U.S. Open golf (Sept. 17-20). Most people missed â\u0080\u009cA.P. Bioâ\u0080\u009d during its two seasons on NBC, which was a shame. The high-school comedy moves to Peacock for its third season, and itâ\u0080\u0099s well worth checking out. Starring Glenn Howerton (â\u0080\u009cItâ\u0080\u0099s Always Sunny in Philadelphiaâ\u0080\u009d) as the worst teacher ever, and featuring one of the best ensemble casts on TV (including Patton Oswalt, Paula Pell and Lyric Lewis), itâ\u0080\u0099s a show that balances twisted humor and just enough heart. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Also coming in September: â\u0080\u009cDepartureâ\u0080\u009d (Sept. 17), a new drama starring Archie Panjabi and Christopher Plummer as investigators probing the mysterious disappearance of a jetliner; â\u0080\u009cThe Publicâ\u0080\u009d (Sept. 15) a movie written and directed by Emilio Estevez about a police standoff after a public library is taken over by the homeless during winter; the documentary â\u0080\u009cA Most Beautiful Thingâ\u0080\u009d (Sept. 3), about the nationâ\u0080\u0099s first Black high school rowing club; â\u0080\u009cAnthonyâ\u0080\u009d (Sept. 4), about a murdered Black teen in Liverpool; the documentary film â\u0080\u009cThe Sit-In: Harry Belafonte Hosts the Tonight Showâ\u0080\u009d (Sept. 10); the documentary â\u0080\u009cBlack Boysâ\u0080\u009d (Sept. 10) from writer-director Sonia Lowman and executive producer and NFL veteran Malcom Jenkins; and new weekly late-night talk shows from comedians Amber Ruffin and Larry Wilmore (dates TBA). Whoâ\u0080\u0099s Peacock for? If youâ\u0080\u0099re a cord-cutter who misses network TV, the free version of Peacock is great. If youâ\u0080\u0099re eligible for Premium through a Comcast or Cox cable subscription, itâ\u0080\u0099s also a perfectly fine free addition. Play, pause or stop? Stop. The free version is nice, but the paid tier will be unnecessary for most people, though its offerings are improving.Apple TV+ ($4.99 a month) Looks like yet another month of Apple Inc.â\u0080\u0099s AAPL, +1.74% Â streaming service adding a couple of perfectly adequate series. Thatâ\u0080\u0099ll be â\u0080\u009cTehranâ\u0080\u009d (Sept. 25), a spy thriller about an Israeli agent (Niv Sultan) who goes deep undercover for a dangerous mission in Iran, and â\u0080\u009cLong Way Upâ\u0080\u009d (Sept. 18), a docuseries about another epic motorcycle trip by actor Ewan McGregor and TV host/travel writer Charley Boorman. Both look just fine, but not quite compelling enough on their own to sign up for a subscription. There are also new episodes of â\u0080\u009cTed Lasso,â\u0080\u009d a surprisingly charming comedy that debuted in August. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Whoâ\u0080\u0099s Apple TV+ for? Thatâ\u0080\u0099s the big question â\u0080\u0094 it offers a little something for everyone, but not enough for anyone, really. Play, pause or stop? Stop. With the shallowest library of any other streaming service and only one or two originals a month, itâ\u0080\u0099s still not worth the admittedly low price, although its new bundle deal with CBS All Access/Showtime is intriguing.CBS All Access ($5.99 a month or $9.99 with no ads) Live sports will be the draw for CBS All Access in September, with the return of the NFL on Sept. 13 (if all goes according to schedule) and the new season of UEFA Champions League soccer. The Championsâ\u0080\u0099 League third qualifying round kicks off Sept. 15, and qualifying playoffs start Sept. 22. All Access is bolstering its offerings, though, adding a host of shows from across the ViacomCBS Inc. VIAC, -2.34% family of networks (Comedy Central, BET, MTV among others), and is expected to formally relaunch in 2021. Whoâ\u0080\u0099s CBS All Access for? Cord-cutters who miss network TV and sports. Play, pause or stop? Stop. Thereâ\u0080\u0099s still not enough to justify the price, though between the upcoming reboot and the bundling deal with Showtime and Apple TV+, that could be changing.Quibi ($4.99 a month with ads, $7.99 a month with no ads) Quibi, too, has at least one big-name release in September, with the new Steven Soderbergh (â\u0080\u009cOceanâ\u0080\u0099s Elevenâ\u0080\u009d) drama series â\u0080\u009cWirelessâ\u0080\u009d (Sept. 14). It stars Tye Sheridan (â\u0080\u009cReady Player Oneâ\u0080\u009d) as a college student lost in the wilderness without cell service. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Whoâ\u0080\u0099s Quibi for? Unknown. Perhaps people who like YouTube videos but would rather pay for them? Play, pause or stop? Stop. Save your money. Just not nearly enough quality for the price."}]}