{"article": [{"url": "https://www.marketwatch.com/story/tuesdays-presidential-debate-biden-must-aggressively-push-back-against-trump-to-win-expert-says-2020-09-25", "published": 1601369780.0, "headline": "Tonightâ\u0080\u0099s presidential debate: Biden must â\u0080\u0098aggressivelyâ\u0080\u0099 push back against Trump to win, expert says", "body": "Tuesday nightâ\u0080\u0099s presidential debate is expected to set an audience record, breaking the 2016 mark of 84 million viewers, as President Donald Trump and Democratic challenger Joe Biden meet in person for the first time since Trumpâ\u0080\u0099s January 2017 inauguration. History suggests the clash could make a difference because the White House race is tight in critical swing states, and there are certain keys to a debate victory for each candidate, according to Mitchell McKinney, a presidential-debates expert who leads the University of Missouriâ\u0080\u0099s Political Communication Institute. â\u0080\u009cFor Biden to win, heâ\u0080\u0099s got to exceed this low bar of expectations that he canâ\u0080\u0099t stand there for 90 minutes and string two sentences together,â\u0080\u009d McKinney told MarketWatch. â\u0080\u009cBut he also has to demonstrate for anxious, nervous Democrats, and also for an anxious, nervous perhaps even wider swath of the citizenry, that he can aggressively meet Donald Trump and push back.â\u0080\u009d He noted that Trumpâ\u0080\u0099s critics view him as a â\u0080\u009cthis bully, this tyrant, and the president himself sort of relishes this bully image,â\u0080\u009d so thereâ\u0080\u0099s a risk that Biden â\u0080\u009cwill just fade on the stage.â\u0080\u009d Biden faces relatively low expectations ahead of the debate thanks in part to Trump, who has attacked his opponent as not all there, McKinney said. That differs from the typical strategy of trying to set high expectations for your opponent, and Trumpâ\u0080\u0099s re-election campaign manager, Bill Stepien, has aimed to do exactly that, telling reporters earlier this month that Biden is â\u0080\u009cnot formidable anywhere else, but he is formidable on the debate stage.â\u0080\u009d For Trump, a win in the debate would involve making a â\u0080\u009cstrong caseâ\u0080\u009d that he deserves four more years in office, rather than just arguing that a Biden administration would be a disaster, according to the Mizzou debates expert. The president also could end up being viewed as the victor if Biden only matches or performs below expectations, McKinney said â\u0080\u0094 if the former two-term vice president, who spent 3Â½ decades in the U.S. Senate, â\u0080\u009cstumbles, he fumbles,â\u0080\u009d and faced with the â\u0080\u009coverwhelming aggression of Donald Trump, he fades in comparison.â\u0080\u009d Related:When is the first Trump and Biden debate? And see:Chris Wallace of Fox News reveals topics chosen for first Biden-Trump debate Pundits will focus on who â\u0080\u009cwas most coherent, had fewer issues with the fact checkers, and had the most memorable one-liners,â\u0080\u009d said Melissa K. Miller, a professor of political science at Bowling Green State University in Ohio. â\u0080\u009cWho can forget Ronald Reagan saying â\u0080\u0098There you go againâ\u0080\u0099 to Jimmy Carter? Or Lloyd Bentsen telling Dan Quayle â\u0080\u0098Youâ\u0080\u0099re no Jack Kennedyâ\u0080\u0099? â\u0080\u009d she told MarketWatch in an email. â\u0080\u009cThese zingers tend to be what gets remembered, though thereâ\u0080\u0099s no evidence they actually changed anyoneâ\u0080\u0099s mind.â\u0080\u009d Other analysts are also questioning the potential impact of the debate, which is slated to take place at 9 p.m. Eastern time on Tuesday in Cleveland, with Case Western Reserve University and the Cleveland Clinic serving as hosts. â\u0080\u009cThe debate will likely break ratings records,â\u0080\u009d but a recent Wall Street Journal columnâ\u0080\u0099s view that the clash will have the 2020 campaignâ\u0080\u0099s most important 30 minutes is â\u0080\u009can over-exaggeration, to say the least,â\u0080\u009d said Ben Koltun, a senior research analyst at Beacon Policy Advisors, in a note. â\u0080\u009cIn a year (four years, really) characterized by many remarkable 30-minute intervals, the matchup between Trump and Biden has remained remarkably steady.â\u0080\u009d Bidenâ\u0080\u0099s polling lead over Trump in top swing states has not ranged that much for the past six months, staying between about 2 percentage points and 6 points, according to a RealClearPolitics moving average of polls. Related:Hereâ\u0080\u0099s how key swing states are leaning in the presidential race â\u0080\u0094 and how theyâ\u0080\u0099re weathering the recession But Mizzouâ\u0080\u0099s McKinney said his analysis of past debates suggests that Tuesdayâ\u0080\u0099s face-off and other debates next month could in fact be influential in determining the outcome of the Nov. 3 election. â\u0080\u009cWe found that in the range of 90% to 95% of debate watchers are unchanged. They come to the debate with their minds made up, committed to one of the candidates,â\u0080\u009d he said. However, there is a small slice of the audience, usually 2% to 3% but sometimes as much as 4% or 5%, that is affected, McKinney added. â\u0080\u009cThese are the folks that typically havenâ\u0080\u0099t been following the campaign very closely,â\u0080\u009d he said, but they end up being part of a viewing audience that can exceed 80 million, as debates have a â\u0080\u009cstrong reach.â\u0080\u009d â\u0080\u009cThatâ\u0080\u0099s where I point to the debates as potentially consequential,â\u0080\u009d the professor said. â\u0080\u009cThey can move the needle for 2% or 3% of the viewers, and weâ\u0080\u0099ve got races in these states that are just neck-and-neck, virtually tied. They really can have an effect.â\u0080\u009d Bidenâ\u0080\u0099s polling advantage in the swing states of North Carolina and Florida is just around 1%, according to the RealClearPolitics averages of polls. His lead across six battleground states viewed as likely to decide the election is 3.6% overall, with that figure taking into account surveys in those two states plus Arizona, Michigan, Pennsylvania and Wisconsin. Trump and his campaign have said pollsters are getting the 2020 race wrong. Tuesdayâ\u0080\u0099s debate comes as the U.S. death toll in the coronavirus pandemic has topped 200,000, and as Trumpâ\u0080\u0099s recent refusal to commit to a peaceful transfer of power has generated headlines. News reports also have been dominated by his pick of Judge Amy Coney Barrett for a Supreme Court vacancy and The New York Times publishing details on his income tax returns. The latest jobs report has suggested an economic recovery from the coronavirus recession is still plowing ahead even if the pace of growth has slowed since the start of the summer. The release showed the U.S. regained 1.4 million jobs last month as the unemployment rate fell to 8.4%. Beyond the polls, Trump often touts the performance of the stock market DJIA, +0.56%. The S&P 500 SPX, +0.87% Â has been selling off this month, but the equity gauge is still positive for the year and notched an all-time high on Sept. 2. A campaignâ\u0080\u0099s financial reports are another closely watched measure of viability, and Biden's $466 million in cash on hand at the start of this month exceeded Trumpâ\u0080\u0099s cash on hand by $141 million. Trump and Biden are scheduled to debate two more times after Cleveland, meeting Oct. 15 in Miami and Oct. 22 in Nashville, Tenn. This is an updated version of a report that was first published on Sept. 25, 2020"}]}