{"article": [{"url": "https://www.marketwatch.com/story/senate-republican-toomey-says-he-wont-run-for-re-election-or-challenge-pennsylvanias-democratic-governor-2020-10-05", "published": 1602064880.0, "headline": "Senate Republican Toomey says he wonâ\u0080\u0099t run for re-election or challenge Pennsylvaniaâ\u0080\u0099s Democratic governor", "body": "BETHLEHEM, Pa. (AP) â\u0080\u0094 Republican U.S. Sen. Pat Toomey of Pennsylvania will not seek re-election in 2022 and plans to leave public service, he confirmed, a surprise move for the fiercely anti-tax and anti-regulation lawmaker who had been seen as the favorite to be the partyâ\u0080\u0099s nominee for governor in two years. Toomeyâ\u0080\u0099s decision will force Pennsylvania Republicans to look elsewhere for candidates â\u0080\u0094 and to a wide-open field â\u0080\u0094 for both seats in a politically divided state where both parties have shown they can win statewide races. At a news conference near his home in suburban Allentown, Toomey said he will serve out the final two years of his second term, â\u0080\u009cand after that my plan is to go back to the private sector.â\u0080\u009d â\u0080\u009cI always thought that Iâ\u0080\u0099d probably serve just two terms and often mentioned that along the way,â\u0080\u009d Toomey said at the news conference at the studios of WLVT-TV, standing with his wife and three children, the youngest of whom is 10. Toomey, 58, called his reasons â\u0080\u009cpersonal, not political,â\u0080\u009d and said that 18 years in public office, including six years in the U.S. House from 1999 through 2004, is a long time and had demanded sacrifices from his family. Toomey had long expressed an interest in running for governor, and he drew calls on a daily basis from people who he said wanted to help him run for governor or for reelection to the Senate. Once his mind was made up, he said, he felt he should be candid about it. â\u0080\u009cIâ\u0080\u0099m looking forward to more time back at home,â\u0080\u009d he said. Toomey said he still hopes to become chairman of the Senate Banking Committee. Toomey is a stalwart proponent of free markets and smaller government who was staunchly supported in the past by the billionaire industrialists Charles and David Koch and the Club for Growth, the take-no-prisoners free-markets advocacy group Toomey once led. The news of his future plans that broke Sunday has reshuffled the deck for Republicans looking ahead to the two major statewide races in two years. As Pennsylvaniaâ\u0080\u0099s only statewide elected Republican official outside of the courts, Toomey had been widely considered the favorite to be the gubernatorial nominee if he wanted it in 2022, when Democratic Gov. Tom Wolf is term-limited. With both offices open in 2022, Democrats have a bench of prospects who have won statewide races â\u0080\u0094 Lt. Gov. John Fetterman, Attorney General Josh Shapiro and Treasurer Joe Torsella â\u0080\u0094 and a statewide voter registration advantage over Republicans. Democrats also have an advantage in recent history: their party have won four out of the last five races for governor. Republicans, meanwhile, are left without any natural heir or obvious front-runner for either governor or U.S. Senate. They have nine members of the U.S. House â\u0080\u0094 as do Democrats â\u0080\u0094 and they have a couple of big-city U.S. attorneys, Scott Brady and William McSwain, who are believed to be politically ambitious. Two of the last three Republican governors â\u0080\u0094 Dick Thornburgh and Tom Corbett â\u0080\u0094 served as the U.S. attorney in Pittsburgh before they won a governorâ\u0080\u0099s race. Among those Republicans expressing interest in running for governor, either privately or publicly, is freshman U.S. Rep. Dan Meuser. â\u0080\u009cItâ\u0080\u0099s something thatâ\u0080\u0099s of sincere interest,â\u0080\u009d said Meuser, who hails from northeastern Pennsylvaniaâ\u0080\u0099s Luzerne County and, with a portion of his district viewed as swing territory in the presidential election, is a regular at appearances by President Donald Trump and Vice President Mike Pence. In midterm elections, the party of the president tends to lose seats in Congress, raising the possibility that the advantage in 2022 will go to the party that loses Novemberâ\u0080\u0099s presidential election. Charles Gerow, a Harrisburg-based media strategist for Republican candidates, said of critical importance to would-be candidates is the result of the Nov. 3 presidential election and how Trump performs in Pennsylvania. If Trump wins, it could encourage more people to run, Gerow said. â\u0080\u009cThere certainly is a consideration as to how the president fares, not only nationally, but in Pennsylvania,â\u0080\u009d Gerow said. â\u0080\u009cFolks are going to look at the result of Nov. 3 very carefully, and some may look at those results before joining the fray and deciding to actually run.â\u0080\u009d"}]}