{"article": [{"url": "https://www.marketwatch.com/story/disney-world-reopens-as-coronavirus-cases-surge-in-florida-2020-07-11", "published": 1594471580.0, "headline": "Disney World reopens as coronavirus cases surge in Florida", "body": "“The Most Magical Place on Earth” has reopened after nearly four months with new rules in place to help prevent the spread of COVID-19. Walt Disney World’s Magic Kingdom and Animal Kingdom are reopening Saturday, while Epcot and Disney’s Hollywood Studios will follow four days later. “It’s the chance to come back and be in the magic,” said Diane Watkins, a preschool teacher from Helena, Alabama, who visits the park about eight times a year. “Hot or not, mask or not, we’re just happy to be here. I feel like everybody here is in the same frame of mind. Everybody is just so excited to be here.” Watkins said that when she and her 16-year-old daughter walked into the Magic Kingdom on Saturday morning, then saw all the cast members lined up and clapping on Main Street, she cried. “It was very emotional,” she said. The reopening comes as a huge surge of Floridians have tested positive for the new coronavirus in recent weeks. On Saturday, there were about 10,000 new cases reported, according to state statistics. Many cities and counties around the state have recently reinstated restrictions that had been lifted in May, when cases seemed to drop. All of Disney’s Orlando DIS, +1.53% parks closed in mid-March in an effort to stop the virus’s spread. Universal Orlando and SeaWorld Orlando closed around the same time but reopened several weeks ago after instituting similar rules to protect employees and customers from the virus. Lori Lovell of Evansville, Indiana, strolled around Frontierland on Saturday morning with friends. “I have missed coming here. It just feels really good to be back. This is where I’ve made so many memories. It’s kind of our second home. Not being able to come here was hard.” Disney’s new rules include mandatory masks and social distancing. Visitors will need reservations to enter a park, and they won’t be allowed to hop between parks. Both visitors and employees will receive temperature checks when they enter. Fireworks shows and parades have been suspended to prevent drawing too many people together. Park-goers say that nearly everyone in sight wore masks on Saturday morning. Capacity is nowhere near where it is under normal circumstances, they said. “I’ve been here on spring breaks where you can barely walk around. The walkways are very wide open,” said Lovell. There were lots of hand sanitizer stations around, and people were respecting the physical distancing cues and guidelines. Since the park is at lower capacity, there was only a five-minute wait for the popular Buzz Lightyear ride — normally it’s about 90 minutes, Watkins said. Some attractions and dining areas aren’t yet open. Another change: visitors can’t hug and greet the costumed Disney characters. Instead, the characters are in “cavalcades,” or motorcades, as they make their way through the park. Disney has been opening its parks back up around the globe for the past two months. In May, the company opened Disney Springs, a complex of shops, restaurants and entertainment venues in Lake Buena Vista. ___"}]}