{"article": [{"url": "https://www.marketwatch.com/story/79-million-a-daythats-how-much-the-uk-is-losing-from-tourism-collapse-2020-08-26", "published": 1598505860.0, "headline": "$79 million every single day â\u0080\u0094 thatâ\u0080\u0099s how tourismâ\u0080\u0099s collapse is costing the U.K. economy", "body": "The U.K. economy is set to lose Â£22 billion ($29 billion) from the collapse of international travel during 2020, according to a report published on Wednesday. Travelers and tourists are staying away from the U.K. â\u0080\u009cin drovesâ\u0080\u009d because of continuing uncertainty around travel restrictions designed to curb the spread of COVID-19, the report by the World Travel & Tourism Council (WTTC) found. As a result, international visitor spending this year could plunge by 78% compared with 2019 levels, equating to a loss of Â£60 million ($79 million) a day, or Â£420 million a week, to the U.K. economy, according to WTTC estimates. Read:Global tourism loses $320 billion in first five months of 2020, says UN Susannah Streeter, senior investment and markets analyst at Hargreaves Lansdown said the bleak outlook for the travel and tourism sector has been reflected in the stock market. “ Travel and tourism was responsible for almost 4 million U.K. jobs in 2019. ” Carnival CCL, +0.51%, the worldâ\u0080\u0099s biggest cruise company, and budget airline easyJet EZJ, +0.09% Â exited the FTSE 100 earlier this year after a major collapse in their share prices. â\u0080\u009cFor easyJet, there has been a slight recovery this month after bookings came in higher than expected but with some travel corridors closed once again, it is clear the challenges are far from over,â\u0080\u009d Streeter said. On Wednesday, Carnivalâ\u0080\u0099s Princess Cruises said that two cruises set to sail in early 2021 would be canceled, blaming border restrictions and the â\u0080\u009ccontinued uncertainty of airline travel.â\u0080\u009d â\u0080\u009cWe share in the disappointment of this cancellation for guests of our world cruises because it is a pinnacle cruise vacation experience, booked by some of our most loyal guests,â\u0080\u009d Jan Swartz, Princess Cruises president,â\u0080\u009d said in a statement. Carnival said guests currently booked on these canceled voyages will receive a â\u0080\u009crefundable Future Cruise Credit (FCC)â\u0080\u009d equivalent to 100% of the cruise fare plus an additional nonrefundable FCC equal to 25% of the cruise fare paid. Read: Some of Europeâ\u0080\u0099s biggest travel companies are leaving consumers covering the cost of coronavirus â\u0080\u0094 holding on to cash while handing out credit notes The cancellations follow an announcement on Tuesday by Cunard, also owned by Carnival, that its services will be suspended until March 2021. â\u0080\u009cAfter very careful consideration and reviewing the latest guidance, we simply donâ\u0080\u0099t feel it would be sensible to start sailing again with our current schedule so we have reviewed future itineraries,â\u0080\u009d Cunard President Simon Palethorpe said. Earlier in August, Ryanair RYA, -2.60%, Europeâ\u0080\u0099s largest airline, announced that it would reduce its flight capacity by 20% during September and October due to a fall in bookings. â\u0080\u009cVisitors from France and Spain who may have planned a weekend long city break to the U.K. will now postpone or cancel, given the freshly imposed quarantine rules. Other European tourists may also stay away, not wanting to run the risk of being confined to hotel rooms if new restrictions are brought in,â\u0080\u009d Streeter added. According to WTTCâ\u0080\u0099s 2020 Economic Impact Report, during 2019, travel and tourism was responsible for almost 4 million U.K. jobs, or 11% of the countryâ\u0080\u0099s total workforce. It also generated nearly Â£200 billion to the U.K. economy last year â\u0080\u0094 around 9% of GDP. â\u0080\u009cWe urgently need to replace stop-start quarantine measures with rapid, comprehensive and cost-effective test and trace programs at departure points across the country,â\u0080\u009d said Gloria Guevara, WTTCâ\u0080\u0099s chief executive. â\u0080\u009cThis investment will be significantly less than the impact of blunt quarantines which have devastating and far-reaching socioeconomic consequences,â\u0080\u009d she added. Read:COVID-19 turned the hotel industry upside down, but it wonâ\u0080\u0099t change what people want Between 2016 and 2018, the largest inbound source markets to the U.K. were travelers from the U.S. and France, each accounting for 10% of all international arrivals, with Germany coming in third with 9%, and Ireland and Spain in joint fourth place with 7% each, the WTTC said."}]}