{"article": [{"url": "https://www.marketwatch.com/story/in-the-midst-of-covid-19-knowing-your-employee-health-and-insurance-benefits-is-more-crucial-than-ever-2020-10-06", "published": 1601982380.0, "headline": "In the midst of COVID-19, knowing your employee health and insurance benefits is more crucial than ever", "body": "According to new Voya Employee Benefits research, to help protect their families during these uncertain times more than 70% of American workers plan to spend more time reviewing their workplace benefits ahead of open enrollment this fall, and more than half (53%) plan on making changes. Given these insights, consider updating your “to-do” list this fall to include taking a close look at your workplace benefits. Here’s a few suggestions to help you rethink and re-evaluate potentially untapped benefits offered by your employer so you’re ready when open enrollment begins: 1. Don’t procrastinate: Industry research shows employees spend just 17 minutes electing their benefits, while Netflix users spend an average of 18 minutes deciding what to watch. Certainly, trying to make sense of all your benefit options during open enrollment is like “cramming for a final exam” — it’s a lot of information and can be overwhelming. As a result, many employees simply default to last year’s benefits options. However, in the midst of a global pandemic, this is not the year to hit the “default button” during open enrollment. Instead: • Check with your employer now to find out how open enrollment materials will be shared this year and how you can get more information once open enrollment begins. • With many companies operating with few employees in offices, some may provide virtual enrollment benefits fairs and more digital support (e.g. webinars, on-demand videos, Zoom calls, etc.). • If your employer hasn’t provided details yet, get a jump start by checking your company’s benefits materials from last year to get up to speed on what options might be available in 2021. 2. Learn about supplemental, or voluntary, workplace benefits: Typically, when employees prepare for open enrollment, they spend most of their time focused on core workplace benefits: medical; dental and vision. While important, Voya’s own customer data shows that more than 4-in-10 retirement-plan participants (44%) have protection or insurance gaps in their coverage. Accordingly, this could put you in a challenging financial situation if you get hit with an unexpected medical expense. For example, the average cost of one day in the hospital in the U.S. is around $2,400, with the average patient staying more than four days. Voluntary benefits, or supplemental health benefits, offered through your employer can provide additional protection — and typically at a cost lower than what most people may expect. For example: • Hospital indemnity insurance, which pays a daily benefit when you have a covered stay in a hospital, also can be used for childcare, groceries or help around the house. • Critical illness insurance pays a benefit to help get your life back on track after a stroke, heart attack or other covered illness. • Accident insurance, which covers an accidental injury such as a broken bone, concussion or deep cut, generally costs less than an 8-pack of sparkling water per week. The benefit payment can be used on anything you need — such as paying a utility bill or filling your car with gas. 3. HSAs can help pay for unplanned medical costs: A health savings account (HSA) is a medical savings account that is available to employees when they are enrolled in a high-deductible health plan (HDHP). HSAs are funded by pre-tax dollars that are deposited into your account by you or your employer, usually through a payroll deduction. Unlike flexible spending accounts (FSAs), HSAs are not “use-it-or-lose-it” accounts and your balance carries over each year. Also, unlike your health insurance plan and your FSA, which are generally tied to your employment, your HSA is portable — meaning you own the account. Therefore, if you get laid off or furloughed from your job as result of the COVID-19 pandemic, you can continue to use your HSA funds to help pay for qualified medical costs. And when you enroll in an HSA, some employers will provide some funding to your account as well. Plus, HSAs offer triple tax advantages: • Contributions are pre-tax and reduce your taxable income; • Your HSA funds grow tax-free; and • When used to pay for eligible medical expenses, HSA withdrawals are tax-free. Therefore, if your employer offers a HDHP, don’t overlook the benefits of contributing to an HSA — especially as these savings vehicles continue to grow in popularity. According to a new report by Devenir Research, as of June 30, 2020, the number of new HSA accounts increased 12% to a total of 29 million HSA accounts in the United States. The COVID-19 pandemic has shined a spotlight on the need to be prepared for unexpected medical costs, and HSAs can be a valuable workplace benefit to help protect your family. If you don’t use the funds this year, or even next, your HSA account can be a resource for funding medical expenses in retirement. 4. Follow through will be key this enrollment period: If the COVID-19 pandemic has taught us anything, it’s that we need to be prepared for the unexpected. While it’s encouraging to see more working Americans taking positive steps during open enrollment this fall, follow through will be key. While top of mind for Americans, if given the choice to review their workplace benefits versus spend time on a home improvement project or review their internet cable options, new Voya research shows almost half (49%) said they would rather focus on the latter. And it’s understandable — especially as more Americans are working from home — to want to focus on home improvements versus workplace benefits. That said, the survey also finds that becoming more financially secure is the top priority for almost half of American workers (49%) as life eventually shifts back to normal — cited more frequently than spending additional time with family and friends (41%), leading a healthier lifestyle (40%) and traveling somewhere new (25%). Accordingly, a good place to start to help achieve your financial wellness goals is to take a closer look at the benefits offered by your employer. It may not be the most exciting item to prioritize, but it is of utmost importance. Andrew Frend is senior vice-president of strategy and product at Voya Employee Benefits. More: You have ample savings. So why are you scared of running out of money? Plus: When it comes to Social Security, these strategies can pay off for married couples"}]}