{"article": [{"url": "https://www.marketwatch.com/story/medicare-enrollment-how-to-sign-up-if-youre-a-new-member-01600353472", "published": 1600339520.0, "headline": "Medicare enrollment: How to sign up if youâ\u0080\u0099re a new member", "body": "MarketWatch has highlighted these products and services because we think readers will find them useful. This content is independent of the MarketWatch newsroom and we may receive a commission if you buy products through links in this article.Key Takeaways: If youâ\u0080\u0099re eligible, you should apply for Medicare three months before your 65th birthday even before youâ\u0080\u0099re eligible to start receiving retirement benefits. If you want to enroll in Part B later on, you may sign up during the Special Enrollment Period (SEP) if your circumstances qualify as an eligible life event. If not, you can wait for the General or Open Enrollment Period and receive delayed benefits, pay a late enrollment fee or be charged a higher premium.Â Â Enroll in Medigap to receive benefits Original Medicare does not cover. You can only do this if you are enrolled in both Medicare Parts A and B. Medicare enrollment for beginners Youâ\u0080\u0099ve already done the legwork. You know youâ\u0080\u0099re eligible for Medicare and you already know which Medicare plan to enroll in based on your needs after examining and comparing all the available Medicare health insurance options. But now youâ\u0080\u0099re faced with a bigger task â\u0080\u0094 going through the complex process of Medicare enrollment. Being well-informed and prepared is key to successfully tackling the process of Medicare enrollment, particularly if youâ\u0080\u0099re a first-time enrollee.How do you apply for Medicare? There are different ways to apply for Medicare, and they vary depending on the plan you want to enroll in. Medicare has four parts (Parts A, B, C and D) as well as supplement plans, otherwise known as Medigap. Here are the different ways, steps to take, and important information to keep in mind when applying for Medicare.How to apply for Original Medicare (Parts A and B) Original Medicare is federally run by the Centers for Medicare and Medicaid Services (CMS). To sign up, you have three options: You can apply online at www.socialsecurity.gov. You can also go to www.ssa.gov to obtain a printable document with instructions on how to navigate the site to apply. Enrolling in Medicare online may be the best option if you want to save time and money, and youâ\u0080\u0099ll be able to check the status of your application with convenience using your digital device. You can talk to a live person on the phone to enroll by calling the Social Security Administration at 1-800-772-1213 (TTY 1-800-325-0778) toll-free on weekdays from 7 a.m. to 7 p.m. You also have the option to call your local Social Security office. If you want to enroll in person, you can visit the local Social Security office in your area. What should you expect after your Medicare enrollment? After you have submitted your Medicare application, it will be processed for approval. You may be asked for additional documentation as needed. Once processed, you will receive a decision letter stating whether you have been approved or not. If you have been approved, you will receive your Medicare packet in the mail from CMS. Included in your packet will be your Medicare card and a handbook containing all the information about your Medicare coverage.Can you sign up for Medicare before turning 65? If youâ\u0080\u0099re eligible, you should apply for Medicare three months before your 65th birthday even before youâ\u0080\u0099re eligible to start receiving retirement benefits.What are the different Medicare enrollment periods? There are four types of enrollment periods for Medicare (Parts A, B, C and D). You need to make sure you sign up during any of these time frames to avoid costly and time-consuming penalties.Initial Enrollment Period Three months before your 65th birthday, you are allowed to apply for Medicare. This enrollment period runs for seven months beginning three months before you turn 65 and ending in the third month after your 65th birthday.General Enrollment Period The general enrollment for Medicare happens every year from January 1 until March 31. Coverage begins on July 1 of the same year. This would include anyone who is eligible for Medicare but is not already enrolled.Open Enrollment Period The open enrollment for Medicare happens every year from October 15 to December 7. If you need to switch plans, you can do so within this annual enrollment period. Coverage begins on January 1 of the next year.Special Enrollment Period Anytime you enroll outside of the General or Open Enrollment Period in Medicare, you will be in the Special Enrollment Period (SEP). Certain life events can get you qualified to enroll during SEP like losing other health coverage and moving to a new address. What other important information do you need to know about Medicare enrollment in Parts A and B? You can sign up for both Medicare Parts A and B but you donâ\u0080\u0099t have to sign up for Part B. If you want to enroll in Part B later on, you may sign up during the SEP if your circumstances qualify as an eligible life event. If not, you can wait for the General or Open Enrollment Period and receive delayed benefits, pay a late enrollment fee or be charged a higher premium.Â Â If you live in Puerto Rico, thereâ\u0080\u0099s no automatic enrollment for Part B. You will have to sign up during your Initial Enrollment Period or you will be charged a penalty. How to apply for a Medicare Advantage plan (Part C) Medicare Advantage, or Medicare Part C, is provided by private health insurance companies accredited with Medicare. It includes all the standardized benefits of Original Medicare (Parts A and B) as well as dental, vision and hearing benefits. In some Part C plans, Medicare prescription drug plans are included in the bundle. If you have Medicare and would like to take advantage of an alternative plan, you may enroll in the Medicare Advantage plan.Â Once youâ\u0080\u0099ve decided youâ\u0080\u0099re ready to review other health insurance options and would like to enroll in the Medicare Advantage plan, the steps below will help you: You can use Medicareâ\u0080\u0099s Plan Finder on www.medicare.gov to find a Medicare Advantage plan thatâ\u0080\u0099s right for you, or you can request a quote from carriers who offer Medicare Advantage plans in your area by going to MedicareExpertUSA.com or call 214-817-3545.Â Once youâ\u0080\u0099ve decided which plan is suitable for you according to your health needs and your location, you can visit the planâ\u0080\u0099s website and find out how you can enroll. Most plans offer online enrollment.Â If youâ\u0080\u0099re not comfortable with enrolling online, you can choose to do manual enrollment. Ask your carrier of choice for enrollment forms that you can fill out and mail back. All health insurance carriers are required to provide paper enrollment forms to interested subscribers. Keep the health insurance carrierâ\u0080\u0099s contact information and place it in a convenient place for easy reference. Call them if you have questions. Keep your Medicare card handy. You will need the information on your card when enrolling in Medicare Part C including your coverage period and your Medicare number. Private insurance carriers offering Medicare are not allowed to reach out to you to offer a plan without your permission. Do not give your personal information to anyone claiming to offer a Medicare plan unless you requested information. Do not give your bank or personal information to private insurance carriers offering Medicare.Â You may reach out or report any suspicious incidents related to Medicare to 1-800-MEDICARE (1-800-633-4227). How to apply for a Medicare prescription drug plan (Part D) Medicare Part D is a drug prescription plan that is also offered by private insurance carriers accredited with Medicare. In most cases, this plan is included in Medicare Part C. If you have Original Medicare and want Medicare Part D, the steps for enrolling are the same as those for Medicare Part C including the following: You can find a Medicare prescription drug plan (PDP) from the Medicare Plan Finder. You may apply online but Medicare will still require that you fill out a paper enrollment form. How to apply for Medicare Supplement plans You may want to consider enrolling in Medicare Supplement plans, also known as Medigap, to receive benefits that Original Medicare does not cover. You can only do this if you are enrolled in both Medicare Parts A and B. Keep in mind, you are not allowed to enroll in Medigap if you are already enrolled in a Medicare Advantage plan. To apply for Medigap, here are the steps: Visit www.medicare.gov to find the Medigap policy thatâ\u0080\u0099s right for you. Shop around for different carriers so you can compare their benefits. If you need help in comparing rates or benefits, you can always request for a Medigap rate comparison guide from the State Health Insurance Assistance Program (SHIP). Conduct research concerning your Medigap insurance provider and make sure youâ\u0080\u0099re well-informed regarding previous complaints and other issues related to the companyâ\u0080\u0099s services. You can reach out to your state insurance department for records and additional information about the carrier. Call your preferred insurance carrier and ask questions before enrolling or dial 214-817-3545 to speak with a licensed insurance agent in your area. . What are the different Medicare Supplement enrollment periods? You can enroll during the Medicare Supplement Open Enrollment Period which begins on your 65th birthday. You can also enroll when your Medicare Part B becomes effective and goes on for exactly six months following that date. Just as with Medicare Parts A through D, you can enroll outside of the Open Enrollment Period, but only if you have Guaranteed Issue rights. Guaranteed Issue rights include major events like your Medigap carrier going bankrupt or committing fraud. Otherwise, you will be charged a penalty for not complying with enrollment guidelines.Time to enroll Enrolling in Medicare is an important step.Â As you are looking ahead and preparing for the rest of your life, it is essential to have an appropriate level of healthcare that is geared toward your individual needs. This way, you can be sure that you will be covered for any medical issue that may arise. It is also worth contacting a professional who can help you get a jumpstart on your application to avoid late-enrollment fees, and to make sure you have seamless coverage throughout your retirement."}]}