{"article": [{"url": "https://www.marketwatch.com/story/why-one-strategist-is-actually-encouraged-by-the-latest-coronavirus-data-showing-a-spike-in-new-cases-2020-06-26", "published": 1593244760.0, "headline": "Why one strategist is actually encouraged by a spike in new U.S. coronavirus cases", "body": "It is just the nature of the market that the coronavirus pandemic has forced every fund manager and analyst to become an amateur epidemiologist. So here are some of the COVID-19 thoughts of Christopher Wood, global head of equity strategy at Jefferies. He is actually encouraged by the latest week of coronavirus data that has seen cases spike outside of the New York metropolitan area. He notes, for example, the median age of new positive cases in Florida has declined from 50 in April to 33 in recent days, and that, crucially, deaths are declining even as new cases pile up. Besides the point that new cases are being detected more because testing has increased, and that younger and healthier people are getting the disease, Wood raises the possibility that, like severe acute respiratory syndrome, COVID-19 could simply burn itself out as it mutates into a less virulent form over time. “If such is indeed the case, it is extremely bullish. Investors should certainly keep an open mind on such a possibility,” Wood says. More good news on the coronavirus front comes from Western Europe, as new cases and deaths, outside of the U.K., are roughly 90% lower eight weeks into reopening. Wood recommends a barbell strategy of owning both growth and value stocks. Growth stocks have outperformed of late because of second-wave concerns, while value stocks should rally when V-shaped recovery talk hits the market, he says. A renewed move in cyclicals should also lead to renewed outperformance by Europe and Japan, given the greater cyclical gearing of their indexes, he adds. If he’s wrong about the virus, Wood still doesn’t think widespread shutdowns will result. That point was reinforced by President Donald Trump himself in a tweet, who said the U.S. economy won’t be shut down again. The buzz Personal income slumped 4.2% in May — the federal government’s $1,200 checks were mostly sent out in April — while consumption shot up 8.2%, the Commerce Department reported. The personal savings rate fell to a still high 23.2% from 32.2%. Friday is the annual reconstitution day for the Russell stock-market indexes and typically is one of the highest volume days for the year. After conducting stress tests on big banks, the Federal Reserve said it is requiring large lenders to preserve capital by suspending share repurchases — 70% of payouts in recent years — and it is also capping dividend payments. Bank stocks had rallied on Thursday on a loosening of restrictions. Related: The Federal Reserve’s bank stress tests put dividend payments at risk E-commerce giant Amazon AMZN, +3.01% is going to announce the purchase of self-driving car developer Zoox, according to reports in The Information and the Financial Times. The FT report put the price tag at $1.2 billion. Cannae Holdings CNNE, +2.12% and Senator Investment Group said they’re offering $65 per share in cash for the 85% they don’t already own in CoreLogic CLGX, +0.86% , the real estate data and analytics company. Apparel maker Nike NKE, +0.97% swung to a fiscal fourth-quarter loss on a 38% revenue fall. Close-out retailer Big Lots BIG, -0.72% said sales were well ahead of expectations. The Trump administration urged the Supreme Court to overturn the Affordable Care Act. The market U.S. stock futures ES00, +1.13% YM00, +0.82% lost ground as the open approached. Oil futures CL.1, -1.62% also turned lower. Gold GC00, +2.17% edged higher. The dollar USDJPY, -0.38% fell vs. the Japanese yen. The chart Bank of America did the math on where the markets would go from here if they followed previous bear-market rallies, and that projection would land the S&P 500 SPX, +0.87% between 3300 and 3600. The strategists said they are tactically bullish on expectations second-quarter earnings may surprise to the upside — “big downside rarely happens when everyone so keen on it,” they wryly note — but strategically bearish. They say 2020 is likely to be seen as secular low for both inflation expectations and bond yields and advise investor diversification into 25/25/25/25 asset allocation of stocks/bonds/cash/gold or factor allocation of growth/yield/quality/inflation before 2021. Random reads A $20,000 prize is being offered by NASA — for a space toilet that can work on the Moon. A “mysterious new creature” has been unearthed in Australia. Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. Be sure to check the Need to Know item. The emailed version will be sent out at about 7:30 a.m. Eastern."}]}