{"article": [{"url": "https://www.marketwatch.com/story/oil-edges-higher-gasoline-jumps-as-storms-force-output-cuts-in-us-gulf-coast-2020-08-25", "published": 1598369660.0, "headline": "U.S. oil and gasoline futures tally highest finish since March as storms force output cuts in U.S. Gulf Coast", "body": "Oil and gasoline futures settled Tuesday at their highest since early March, as storms forced the shutdown of more than 80% of offshore crude-oil production in the Gulf of Mexico and prompted refinery cuts. Tropical Storm Marco made landfall Monday and was downgraded to a post-tropical cyclone Tuesday morning. Attention is focused on Laura, which was upgraded to a hurricane Tuesday morning and is expected to make landfall on the U.S. Gulf Coast later this week. “Markets know that the hurricane shut-ins are usually transient, and it’s a bit too early to know whether the current ones will have a prolonged bearish effect on prices or not,” said Bjornar Tonhaugen, head of oil markets at Rystad Energy, in a daily note. “Refineries might need to shut-in more runs due to flooding than upstream operators shut in crude supply,” so weaker demand for crude at the refineries may help to offset price-bullish supply constraints. West Texas Intermediate crude for October delivery CL.1, -1.62% CL00, -1.62% rose 73 cents, or 1.7%, to settle at $43.35 a barrel on the New York Mercantile Exchange. October Brent crude UK:BRNV20, the global benchmark, also gained 73 cents, or 1.6%, to $45.86 a barrel on ICE Futures Europe. Front-month prices for both benchmarks settled at their highest since March 5, according to Dow Jones Market Data. The Interior Department’s Bureau of Safety and Environmental Enforcement, citing operator reports, estimated Tuesday that 84.3% of offshore oil production in the Gulf of Mexico, or about 1.6 million barrels of oil a day, had been shut in, along with nearly 61% of natural-gas production. A number of refineries on the Gulf Coast, where almost half of the U.S. oil processing industry is located, have also suspended production ahead of Laura’s expected landfall, noted Eugen Weinberg, analyst at Commerzbank. While the refineries were reinforced following Hurricane Katrina in 2005, there is still the risk of flooding, which could prompt extended closures. Storms can also affect the transportation of crude oil and exports. It’s no surprise then that gasoline futures jumped 6.5% Monday in response to the storms, Weinberg said. A widening premium for October gasoline relative to November indicates market participants fear the potential of shortages, analysts said. On Tuesday, front-month September gasoline US:RBU20 added 2.1% to $1.3959 a gallon—the highest finish since March 5. The most-active October contract US:RBV20 gained 0.7% to $1.2685 a gallon. September heating oil US:HOU20, meanwhile, rose 1% to $1.2601 a gallon. September natural gas US:NGU20 lost 1% at $2.489 per million British thermal units after tacking on 2.7% Monday. “ Since 2005, ‘most Gulf hurricanes result in lower, not higher prices in natural gas, after the fact...’ ” — James Roemer, Weather Wealth newsletter “Since 2005, however, most Gulf hurricanes result in lower, not higher prices in natural gas, after the fact,” given potential demand destruction from rains and “the fact that most natural gas production is now inland (shale), not off-shore,” James Roemer wrote in his latest newsletter, Weather Wealth. “Natural gas prices could begin to sell off if Laura goes further west away from the main pipelines and Gulf rigs.” Traders continued to monitor signs of changes to oil demand. Jim Burkhard, vice president and head of oil markets at IHS Markit, said in a report released Tuesday that world oil demand has been growing at a record pace, by 13 million barrels per day in the last four months, “since the bottom of the COVID-induced collapse in April.” It’s currently at 89% of pre-COVID levels. That growth is likely to taper off, Burkhard said, and IHS Markit expects global crude demand to plateau just below pre-pandemic levels — at 92 million to 95 million barrels per day, or roughly 92% to 95% of prior year levels, through the first quarter of 2021. Weekly data on U.S. petroleum supplies will be released late Tuesday by the American Petroleum Institute, with the official Energy Information Administration report due early Wednesday. On average, the EIA is expected to report a decline of 4.3 million barrels in crude supplies for the week ended Aug. 21, according to a poll of analysts conducted by S&P Global Platts. The analysts also forecast supply declines of 2.7 million barrels for gasoline and 700,000 barrels for distillates."}]}