{"article": [{"url": "https://www.marketwatch.com/story/silver-copper-prices-mark-an-impressive-recovery-from-march-lows-2020-06-26", "published": 1593264140.0, "headline": "Silver, copper prices mark an impressive recovery from March lows", "body": "Industrial metal prices have seen an impressive recovery in recent weeks. Silver has erased its loss for the year, and copper is looking to recoup the bulk of the declines it suffered during the peak of the coronavirus pandemic’s toll on the global economy. The drop in global mining production from the shutdowns helped buoy prices of both commodities, says Rohan Reddy, research analyst at exchange-traded fund provider Global X, and the sharp climb “indicates the market views the deterioration in economic data being short-lived.” Silver futures hit an 11-year low of $11.772 an ounce on March 18, down 34% for the year as of that date. With the July contract US:SIN20 settling at $18.035 an ounce on Friday, prices were up 0.6% in 2020. Copper futures US:HGU20, meanwhile, fell to their lowest level since October 2016, at $2.101 a pound on March 23, which marked a 33% drop from the end of 2019. They’ve pared that, with the September contract 4.2% lower this year, after settling at $2.679 on Friday. Declines in mining production helped buoy prices for the metals, as two-thirds of global silver output, and an estimated 13% of copper production, went offline during the initial shutdown-related measures, says Reddy. “It’s harder to bring mining production back quickly than it is to bring demand back,” he observes. In Chile and Peru, which account for nearly 40% of global copper output, coronavirus cases have accelerated and might lead to a second wave of mining shutdowns, he adds. Still, the price drop for the metals in March were severe, with copper futures down over 12% and silver dropping 14%. That got the “attention of value investors,” both institutional and end users of the commodity, says John Caruso, senior asset manager at RJO Futures. After seeing the depths of the broad-based market crash, “you naturally get a synchronized response from global central banks,” says Caruso. “There’s a lot of global stimulus and liquidity being issued to markets that are specifically meant to boost U.S. dollar-denominated asset values.” Gold has benefited from that, as has silver, which is both a precious and industrial metal. “Silver’s solid price action is driven by its precious metal side much more than its base metal characteristic,” and the low interest rate environment is great for precious metals, says Taki Tsaklanos, founder of InvestingHaven.com. A second wave of virus infection probably would put “even more fuel under silver’s price rally” because of the prospects of a long-lived low interest rate environment, and inflationary measures of policy makers to stimulate economies, says Tsaklanos, who expects silver to test $21 before year-end. Copper’s outlook, however, isn’t as upbeat. The market for the metal could see a 2020 surplus around 200,000 metric tons, says Johann Wiebe, lead metals analyst on the GFMS team at global financial-data provider Refinitiv. He believes that copper prices already have seen their bottom for the year, and that attempts to push significantly higher from here will “prove unsustainable in coming months,” due to concerns over a possible second infection wave. Without a second wave, or if fears of one recede, copper might end the year around $6,000 per metric ton, or about $2.72 a pound, a bit higher than it is currently. Silver, meanwhile, appears to find $18 an ounce a difficult level to breach. But if it pushes through that, its price might peak around $20 before year-end, says Wiebe. Caruso is more bullish on a rise in prices by year-end. His upside target for copper is $2.87 to $3.00 a pound, and he says silver could hit $22 to $25 an ounce, assuming further weakness in the dollar."}]}