{"article": [{"url": "https://www.marketwatch.com/story/us-import-prices-surge-14-in-june-due-to-higher-oil-prices-but-inflation-still-tepid-2020-07-15", "published": 1594806380.0, "headline": "U.S. import prices surge 1.4% in June due to higher cost of oil, but inflation still tepid", "body": "The numbers: The cost of goods imported into the U.S. jumped 1.4% in June to mark the second straight increase, but most of the upturn has been driven by oil prices rebounding from an 18-year low earlier in the year. Excluding energy, import prices rose a much smaller 0.3%, the government said Import-related inflation is also running 4% lower compared to a year earlier. The coronavirus has caused scattered shortages for some goods, but most prices have softened because of weaker demand amid a global economic slump. Read: Soaring demand for federal jobless benefits points to fresh fissures in the economy What happened: The cost of imported fuel surged almost 22% in June after a revised 15.4% rise in May. The increase last month was the biggest since the government began publishing the index in 1992. Yet the cost of imported petroleum is still 36% lower compared to one year ago, reflecting a huge drop in flying and driving. Prices also rose in June for industrial supplies and some consumer goods. Prices fell for food, drinks and new cars. See:Marketwatch’s Coronavirus Economic Recovery Tracker. Big picture: Inflation fell sharply during the first few months of the pandemic and is likely to remain low for at least the next year despite the recent uptick. Even with the government spending massive amounts of money to prop up the economy, there’s simply not enough demand for most goods and services to nudge inflation appreciably higher. Read:Higher gas prices trigger first increase in U.S. consumer inflation in four months Economists expect inflation to remain subdued until the pandemic is over and the economy starts to get back to normal, a process that could take a year or two. Read:Coronavirus spike in the dog days of summer saps economy of momentum Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% rose in early Wednesday trades."}]}