{"article": [{"url": "https://www.marketwatch.com/story/home-prices-continued-to-rise-even-as-the-coronavirus-pandemic-swept-across-america-fhfa-says-2020-06-24", "published": 1592994800.0, "headline": "Home prices continued to rise even as the coronavirus pandemic swept across America, FHFA says", "body": "Home prices have continued to increase throughout the coronavirus pandemic, despite the hurdles the outbreak caused for the real-estate industry. The Federal Housing Finance Agency house price index rose 0.2% on a monthly basis in April, the housing regulator reported Wednesday. Compared with a year ago, home prices were up 5.5%. Regionally, only two parts of the country experienced a drop in home prices between March and April. The South Atlantic region — which includes Delaware, Florida, Georgia, Maryland, North Carolina, South Carolina, Virginia, District of Columbia and West Virginia — saw home prices fall 0.5% on a monthly basis. And home prices dropped 0.2% in New England, which includes Connecticut, Maine, Massachusetts, New Hampshire, Rhode Island and Vermont. On an annual basis, home prices rose in every part of the country, led by the Mountain region, which includes Arizona, Colorado, Idaho, Montana, Nevada, New Mexico, Utah and Wyoming. There, home prices have increased 6.8% from last year. Also see:The number of Americans skipping mortgage payments drops for the first time since March Economists have disagreed on whether or not the spread of COVID-19 and resulting economic downturn would contribute to a drop in home prices. Fannie Mae FNMA, +0.73% previously predicted that home prices would continue to edge upward. But a report from Zillow ZG, -0.42% released last week indicated that the downturn in home prices could be delayed and might come in the second half of the year. “The next question housing will face is whether this growth can continue after demand built up during housing’s brief pause in the pandemic’s early days runs its course,” Zillow senior principal economist Skylar Olsen said in the report. “It’s likely housing will feel the broader economy’s downturn eventually, though to a mild degree, and home values will fall in the coming months.” Looking to the future, FHFA expects a return to normal, to an extent, for the housing market. “We expect the normal spring bump in sales was pushed off by the COVID-19 shutdowns and may extend into the summer months as states reopen and real estate sales pick back up,” said Lynn Fisher, deputy director of the division of research and statistics at FHFA. Reopening isn’t without its risks though. Coronavirus cases have surged in some states that have begun reopening, including Florida, Texas and Arizona. “Rising infection rates, if they result in closures, could restrict sales activity once again going forward,” Rubeela Farooqi, chief U.S. economist for research firm High Frequency Economics, said in a note."}]}