{"article": [{"url": "https://www.marketwatch.com/story/how-trump-and-biden-tax-policies-could-affect-your-paycheck-tax-return-investment-portfolio-and-nest-egg-2020-09-21", "published": 1601541740.0, "headline": "How Trump and Biden tax policies could affect your paycheck, tax return, investment portfolio and nest egg", "body": "President Donald Trump says the American Dream is on the line this election, while Democratic challenger Joe Biden says his campaign is locked in a “battle for the soul of this nation.” That’s weighty rhetoric, but it’s also intangible. How might the candidates affect the things you can see and hold, like a paystub, an income tax return or a portfolio statement? A lot of people would like to know, polls suggest. Almost 80% of registered voters told the Pew Research Center that the economy was a very important issue in this highly-charged election. Seventy-seven percent of voters told YouGov that domestic issues were most important during the election; the economy was the second top priority behind the coronavirus outbreak and response. The focus on finances puts tax policy front and center. The tax code’s rules are critical for a household’s budget and a government balance sheet — especially when the federal budget is projected to grow by almost $4 trillion in the wake of the pandemic. Biden has a tax plan that will generate between $3.35 trillion and $4 trillion over 10 years, according to various estimates. The money mostly comes from America’s richest residents, who are well aware of the prospect. Trump has a first-term record that includes the 2017 Tax Cuts and Jobs Act, an overhaul that reduced income tax rates while expanding some credits and exemptions as it capped others. Major features, like the paired-down income brackets and heightened estate tax exemption are currently set to expire at the end of 2025. Taxpayers paid almost $64 billion less in income taxes during the first year under the new tax rules than they did the year before that, IRS statistics show. “ ‘The basic Biden story is if you’re rich or if you’re a corporation, you’re going to pay more tax. ... Trump is basically saying ‘we’re going to cut your taxes,’ and not telling anybody how.’ ” — Howard Gleckman, senior fellow at the Tax Policy Center “The basic Biden story is if you’re rich or if you’re a corporation, you’re going to pay more tax. If you’re middle-income or lower-income, you’ll pay either what you pay now, or you’ll pay less depending on your specific circumstances,” said Howard Gleckman, senior fellow at the Tax Policy Center. There are very few specifics, for now, on a second-term Trump administration tax plan, Gleckman added. “Trump is basically saying ‘We’re going to cut your taxes,’ and not telling anybody how.” “With tax cuts and deregulation President Trump has fought to protect the paychecks of everyday Americans from an overburdensome federal government,” said Trump campaign spokesman Ken Farnaso. “Joe Biden wants to overturn that progress and tack on a $4 trillion tax hike and his version of a Green New Deal. Whether it be the payroll tax cut or the highly successful Tax Cuts and Jobs Act, President Trump has never stopped fighting to preserve our economic freedoms.” A Biden campaign representative could not be immediately reached for comment. Here’s a look at how the Trump administration and Biden campaign’s tax policies could affect paychecks, portfolios, income taxes and retirement savings. What Trump and Biden tax policies mean for your paycheck Before you get your paycheck, Uncle Sam takes a cut. These are payroll taxes and they consist of 6.2% that an employee pays into Social Security and 6.2% an employer pays for Social Security, combining for a 12.4% payment. The employer and employee also pay 1.45% apiece (a combined 2.9%) for Medicare taxes. Employees and employers currently pay the 12.4% only up to the first $137,700 a person earns. Trump authorized employers to let their workers making less than $104,000 defer payment on their 6.2% tax obligation between September and December. Experts say a deferral means the employee has a bigger check now, but has to pay the taxes next year, on top of the payroll taxes that come back on. Trump would like to see if lawmakers can pass a bill that would forgive the deferred taxes. Some small businesses have said the deferral isn’t worth the administrative hassle. Biden wants the 12.4% Social Security tax to kick back in for incomes above $400,000. The move takes square aim at the country’s highest earners. For example, the average salary for a CEO at the 350 largest publicly-traded companies was $1.325 million (as part of a $21.28 million projected pay package), according to the left-leaning Economic Policy Institute.What Trump and Biden tax policies mean for your income tax return Biden wants to put the top income tax bracket rate back to the Obama-era’s 39.6% rate from its current 37% rate. “I will raise taxes for anybody making over $400,000. The very wealthy should pay a fair share. Corporations should pay a fair share,” Biden previously said. People with adjusted gross incomes at or below $400,000 would have a 0.9% average decrease in after-tax income under Biden’s plan, while people making that threshold would see a 17.7% after-tax income drop, according to a budget model from the University of Pennsylvania Wharton School of Business. Though Biden says he wouldn’t raise taxes on people below the $400,000 threshold, the Wharton figure factors in estimated indirect effects of lower investment returns and wages because of Biden’s corporate tax hike, which puts the rate at 28%, from 21%. Biden would also cap the value of itemized deductions. When taxpayers prepare their taxes, they can choose between a standard deduction and an itemized one that’s comprised of things like state and local taxes expenses, mortgage interest, charitable contributions and medical expenses. Rich households overwhelmingly opt for the latter, research shows. Forty-three percent of taxpayers making between $50,000 and $100,000 itemized their deductions in 2018 while 80% of households earning between $100,000 and $500,000 did the same, according to the Tax Policy Center. Specifically, Biden would cap the value of the itemized deduction at 28%. That cap would apply even if a taxpayer was taxed at a higher rate, Gleckman noted. With an across-the-board cap, Biden is trying to avoid picking and choosing which deductions deserve more or less of a break. Biden is limiting the power of write-offs at the top of the income ladder, but he’s expanding them farther down. For example, he’s calling for a maximum $15,000 first-time homebuyer’s credit, a tax credit for renters and a larger tax credit for children. (The Trump administration temporarily doubled the child credit from $1,000 to $2,000. Biden would turn the credit up to $4,000.) Trump has not yet offered specifics on his plan for income taxes in a second term, observers note. But White House budgets for fiscal years 2019 through 2021 assume the income tax rates will become permanent, experts point out, like those at the consulting firm Deloitte. Trump has also said he’s considering an income tax cut for middle-income families. Trump may have not have many tax proposal specifics right now, but he does have a tax record to run on — for better or worse depending on who you ask. The 2017 tax code changes created tax cuts that helped the wealthy more than anyone else, critics say. A household making less than $50,000 sees a 0.5% after-tax income increase, in one UCLA Law School professor’s analysis. A millionaire’s household has a 3% to 5% after-tax income jump, he said. The 2017 tax code changes simplified the tax code and gave the average taxpayer in every state and congressional district a tax cut, according to the Heritage Foundation, a right-leaning think tank. Now it’s crucial to make the rates a permanent feature of the tax code, tax experts at the organization say. What Trump and Biden tax policies mean for your investment portfolio Biden wants to tax capital gains at 39.6% (his proposed top rate for ordinary income) for people who make more than $1 million. Right now, the rate is set at 20%, along with 3.8% for the net investment income tax. Even the prospect of a rate hike is accelerating some high-priced deals to avoid even the potential for a hike. Capital gains don’t only apply to appreciating stock sales, but it’s worth noting there are many people who own stock and make less than $1 million. Fifty-five percent of Americans said they owned stock, according to a Gallup poll this year. Within that segment, 84% of people making over $100,000 reported having stock while 65% of people making between $40,000 and $99,999 said they owned stock. Trump has said he’s “looking very seriously at a capital-gains tax cut.” Another potential move, his administration said, is indexing the basis for capital gains. This adjusts a gain for inflation so that a taxpayer is only paying tax on appreciated value, not prices that bulge because of big-picture economic forces. Trump is also proposing to broaden the “opportunity zones,” created in the Tax Cuts and Jobs Act. This is a program designed to encourage investment in “economically distressed” places; investors can receive preferential tax treatmentWhat Trump and Biden tax policies mean for your retirement account Trump has not sketched out second-term tax proposal on retirement savings, according to experts at Deloitte. But the president has already enacted the SECURE Act. The law lets more employers provide annuities as a 401(k) investment option. The law also pushes the required minimum distribution age from age 70.5 to age 72 and gives tax credits to businesses that automatically enroll workers in their retirement plan. Biden is calling for a 26% refundable tax credit that applies for each dollar contributed to an IRA or 401(k). “The tax credit would be deposited into the taxpayer’s retirement account as a matching contribution,” explained Garrett Watson, Senior Policy Analyst at the right-leaning Tax Foundation. Under current law, 401(k) contributions come right off the top of a person’s taxable income. But the tax benefit accrues more to the higher earners taxed at higher rates. “Compared to current law, the flat credit would provide a larger benefit to lower-income earners and reduce the benefit to higher-income earners,” Watson wrote. Biden’s plan would not touch contribution limits or affect the rules on Roth IRAs, where after-tax money goes into the account and is withdrawn tax-free."}]}