{"article": [{"url": "https://www.marketwatch.com/story/for-a-covid-free-vacation-create-a-travel-bubble-and-do-everything-possible-to-stay-in-it-2020-09-01", "published": 1598964560.0, "headline": "For a COVID-free vacation, create a travel â\u0080\u0098bubbleâ\u0080\u0099 and do everything possible to stay in it", "body": "What does a travel writer do during a pandemic, other than fantasize about the exotic trips he canâ\u0080\u0099t take? If you are fortunate enough to have a friend with a boat, you join him in a COVID-free â\u0080\u009cbubbleâ\u0080\u009d and cruise down the California coast.Â My friend Charlie lives in Los Angeles, as do I. His boat â\u0080\u0094 a Tollycraft 44 CP named â\u0080\u009cAllegroâ\u0080\u009d â\u0080\u0094 was docked in a marina in San Rafael, Calif., in the San Francisco Bay. Since the boat wasnâ\u0080\u0099t doing him any good in Northern California during the pandemic, he decided to move it closer to home, to the Ventura, Calif. marina an hourâ\u0080\u0099s drive north of Los Angeles. Needing a crew to help, he hired Chris, a professional captain with experience cruising the unprotected waters off the California coast. He also asked me, with little boat experience other than the toy ones my mother used to lure me into the bath when I was a kid. My role was to make sandwiches and keep Charlie and Chris awake with stories of past travel adventures and romantic misadventures buried even deeper in my past. Before we could go anywhere, even in the car to drive from Los Angeles to San Rafael, we had to make sure we would not infect each other while living in close quarters for several days. Both Charlie and I are in our late 70s and have underlying medical conditions that might put us at even greater risk. All three of us went at the same time to get tested for the coronavirus. We also promised not to do anything foolish within the two days before the test, which might be too soon to be picked up by the test, and over the several days after we received our results.Â We all tested negative and were good to go. Less than a week later, we piled into a rental car and headed north. The five-day cruise was the best five days Iâ\u0080\u0099ve had since the COVID-19 restrictions began. The highlights included: Cruising under the Golden Gate Bridge. Iâ\u0080\u0099ve passed over this bridge many times; this is the first time I passed under it.Â Anchoring in the bay off the legendary golf course at Pebble Beach. The rugged views of the ocean, cliffs across the bay and distant hills from the greens are stunning. I donâ\u0080\u0099t play golf, but if I did, this is where I would want to play.Â Gazing at the Big Sur coast as we made our way to San Simeon. Iâ\u0080\u0099ve driven this route many times, and it is without a doubt one of the most spectacular drives in the world. For most of the seven hours of our cruise I just sat on the rear deck watching the vista slip by. Many people have taken the drive, few people have seen it from the water.Â Â As we approached San Simeon, watching the hills of Southern California glisten gold in the late afternoon sun. Hearst Castle sits atop one of the hills close to the coast.Â Kayaking in the protected cove where we were anchored at San Simeon. Bobbing gently in the swells, I watched the waves breaking on the rocks at the entrance to the bay and pelicans perched on a jagged promontory jutting out of the water. This was the calmest I had been since well before the onset of the pandemic.Â Cruising all night from Morro Bay to the Ventura marina, the terminus of our trip, to beat the winds and waves at Point Conception before they build up and start banging against each other from all directions. From this brief but successful adventure, I learned two lessons â\u0080\u0094 other than make friends with people who own a boat: 1) Create an antiseptic bubble of travel companions and 2) manage interactions and reduce possible exposure with people outside of your bubble.Â There are several ways to create a bubble. We took the most secure route, getting tested. A less-secure but easier approach would be to travel with trusted friends. But therein lies the rub. Levels of vigilance vary widely among our friends, from those who disinfect their mail to others who visit family and get haircuts. Some I would feel O.K. traveling with, others not. The only way to make sure is for everyone to get tested before leaving for the trip.Â Even that may not be enough. Traveling with a group also requires an expectation and trust that everyone within the bubble will minimize the chance of exposure for the two-to-three days before the test (about how long it takes for an infection to show up in the results) and for the few days between the test and the departure date for the trip. Once you have built your bubble, the next challenge is to isolate it and manage contact with people outside your bubble when you canâ\u0080\u0099t isolate, especially as the bubble moves to, from, and within your destinations. It is relatively easy in a boat or a fully stocked RV, but harder if you are driving, or worse yet, flying.Â Read: COVID-19 hit the hotel industry hard. Hereâ\u0080\u0099s how hotels are pivoting in the new reality Even on a boat or RV, there is the possibility of exposure to the virus. To minimize risk on our drive to San Rafael, we packed lunches and snacks. We still had to stop for gas and bathroom breaks. Of course, we used masks and gloves and opted for a highway rest stop bathroom, assuming it would be cleaner than a gas station, though I am not sure it was. In any case, we didnâ\u0080\u0099t linger. In the Monterey, Calif. marina, where we spent our first night at sea, signs were posted prominently asking everybody to wear masks. It looked like everyone took this seriously, including the dock workers who helped us tie up to the dock and refuel the boat. Further south in Morro Bay, safety was more of a challenge. Few signs were posted and people seemed more lax about wearing masks. While Chris and Charlie checked the weather and plotted our course around Point Conception, I did what I do best, get dinner. I picked up fish and chips from a nearby restaurant. Most of the patrons didnâ\u0080\u0099t wear masks. I wore mine and moved gingerly to keep my distance from the other customers.Â The bottom line is that traveling during a pandemic requires a combination of informed practices for things you can control and trust for those you canâ\u0080\u0099t. We live with risk every time we get up from the couch. We canâ\u0080\u0099t eliminate it. But we can minimize it and keep the probability of infection low by diligently following the behaviors and strategies we know will work, namely: minimize contact and exposure wherever possible; wear a mask; keep your distance and wash your hands. DonÂ Mankin, a.k.a \"The Â Adventure Geezerâ\u0080\u009d,Â is a U.S.-based travel journalist who writes about adventure travel for seniors and boomers. He is the author of Riding the Hulahula to the Arctic Ocean (National Geographic 2008). Read: After a hard landing, the airline industry faces a long path to a new takeoff More: Life will never be the same for people over 60 â\u0080\u0094 even with a COVID-19 vaccine"}]}