{"article": [{"url": "https://www.marketwatch.com/story/death-toll-from-west-coast-wildfires-rises-to-33-2020-09-13", "published": 1600033820.0, "headline": "Death toll from West Coast wildfires rises to at least 35", "body": "BEAVERCREEK, Ore. — Nearly all the dozens of people reported missing after a devastating blaze in southern Oregon have been accounted for, authorities said over the weekend as crews battled wildfires that have killed at least 35 from California to Washington state. The flames up and down the West Coast have destroyed neighborhoods, leaving nothing but charred rubble and burned-out cars, forced tens of thousands to flee and cast a shroud of smoke that has given Seattle, San Francisco and Portland, Oregon, some of the worst air quality in the world. The smoke filled the air with an acrid metallic smell like pennies and spread to nearby states. While making it difficult to breathe, it helped firefighters by blocking the sun and turning the weather cooler as they tried to get a handle on the blazes, which were slowing in some places. But warnings of low moisture and strong winds that could fan the flames added urgency to the battle. The so-called red flag warnings stretched from hard-hit southern Oregon to Northern California and extended through Monday evening. iframe.twitter-tweet { width: 100% !important; } Lexi Soulios, her husband and son were afraid they would have to evacuate for a second time because of the weather. They left their small southern Oregon town of Talent last week when they saw a “big, huge flow of dark smoke coming up,” then went past roadblocks Friday to pick through the charred ruins of their home. While they are staying farther south in Ashland, known for the Oregon Shakespeare Festival, she said by text message that the forecast may mean they could be on the move again. “So this isn’t over yet but we just had the car checked so we feel prepared,” Lexi Soulios wrote. Authorities last week reported as many as 50 people could be missing after a wildfire in the Ashland area. But the Jackson County sheriff’s office said late Saturday that four people had died in the blaze and that the number of missing was down to one. At least 10 people have been killed in the past week throughout Oregon. Officials have said more people are missing from other fires, and the number of fatalities is likely to rise, though they have not said how high the toll could go as they search. In California, 24 people have died, and one in Washington state. Thousands of homes and other buildings have burned. Barbara Rose Bettison, 25, left her farm among the trees and fields of Eagle Creek, outside Portland, when a sheriff’s deputy knocked on her door Tuesday. They drove away on a road that became an ominous dividing line, with blue skies on one side and the other filled with black and brown smoke. She took shelter at an Elks Lodge near Portland, where evacuees wrapped themselves in blankets and set up tents out back. “It’s terrifying. We’ve never had any form of natural disaster,” she said. Bettison, a UPS driver, was able to get out with her chickens, rabbits and cats. She hasn’t been back, but neighbors said it is so smoky they can’t see their hands in front of their faces. “I’m hoping there has not been too much damage because it would break my heart,” she said. Farther south in the town of Talent, Dave Monroe came to his burned home, partially hoping he’d find his three cats. “We thought we’d get out of this summer with no fires,” he said. “There is something going on, that’s for sure, man. Every summer we’re burning up.” Numerous studies in recent years have linked bigger wildfires in the U.S. to global warming from the burning of coal, oil and gas. The Democratic governors of all three states say the fires are a consequence of climate change, taking aim at President Donald Trump ahead of his visit Monday to California for a fire briefing. “It is maddening right now that when we have this cosmic challenge to our communities, with the entire West Coast of the United States on fire, to have a president to deny that these are not just wildfires, these are climate fires,” Washington Gov. Jay Inslee said Sunday on ABC’s “This Week.” At a rally in Nevada, Trump blamed inadequate forest management, which White House adviser Peter Navarro echoed on CNN’s “State of the Union,” saying that for many years in California, “particularly because of budget cutbacks, there was no inclination to manage our forests.” Firefighter Steve McAdoo has run from one blaze to another in Oregon for six days, seeing buildings burn and trees light up like candles. “We lost track of time because you can’t see the sun and you’ve been up for so many days,” he said. “Forty-eight to 72 hours nonstop, you feel like you’re in a dream.” As he and his team battled the blazes, McAdoo worried about his wife and daughter at home just miles away. They evacuated safely, but at times he could communicate with them only in one-word text messages: “busy.” McAdoo and other firefighters got their first real break Sunday to take showers, shave and check their equipment. And though it’s a faint shadow of its usual self, he can finally see the sun. “It’s nice today to at least see the dot in the sky,” he said. Meanwhile, Oregon’s fire marshal, who resigned after being placed on leave amid a personnel investigation, says he was trying to help a colleague and “didn’t do anything wrong.” Jim Walker told TV news station KOIN in Portland that state police leaders put him on leave after he tried to help a co-worker whose family was missing in a fire zone, saying his superiors decided he had overstepped his authority."}]}