{"article": [{"url": "https://www.marketwatch.com/story/us-service-economy-grows-again-in-september-ism-finds-and-employment-turns-positive-for-first-time-in-7-months-2020-10-05", "published": 1601899940.0, "headline": "U.S. service economy grows again in September, ISM finds, and employment turns positive for first time in seven months", "body": "The numbers: The huge service side of the U.S. economy — retailers, restaurants, banks, hospitals and the like — expanded in September for the fourth month in a row and employment also grew for the first time since the pandemic began, a survey business executives showed. An index of nonmanufacturing companies rose to 57.8% last month from 56.9% in August, the Institute for Supply Management said Monday. Any number above 50% means more companies are expanding. Strong gains in both the ISM service and manufacturing indexes suggest the recovery set down more roots in September. Read:Consumer confidence surges to highest level of coronavirus era The surveys are limited in what they reveal, however. The ISM survey of senior executives asks if business has gotten better or worse compared to the prior month, but it doesn’t reveal how much better. As the result, the relatively high level of the index overstates how well the economy is performing. While many companies have fully reopened and are getting back up to speed, others like restaurants and airlines continue to operate under government restrictions or have suffered a deep decline in customer traffic that won’t be quickly reversed. What happened: New orders and production both grew a bit faster in September. The index of new orders dropped rose to 61.5% from 56.8%. And the gauge for production edged up to 63% from 62.4%. The best news was employment turning positive for the first time since February. The employment gauge climbed to 51.8% from 47.9%, suggesting companies are adding more workers than they are letting go. Service-oriented businesses cut millions of jobs earlier in the pandemic and employment remains well below precrisis levels, however. Nor is the coast entirely clear. Read:U.S. adds 661,000 jobs in September and unemployment rate falls to 7.9% Disney DIS, +1.53% , American Airlines AAL, +0.34% and other large companies say they will permanently cut thousands of jobs unless they get more aid from the government. Very few people are flying, going to theme parks, staying in hotels or engaging in other activities that require them to mingle with lots of people. Big picture: The improvement in the service side of the economy that employs eight in 10 Americans is good news. Sixteen of the 17 industries tracked by ISM expanded in September. “Business has come back solidly since mid-July, with a strong August and September,” said a retail executive. Yet there’s also a growing divided between the industries that have been able to resume full operations and those still laboring under restrictive rules. “Our industry is facing a bleak outlook, as the Hollywood studios have pulled back almost all of their content from October and November and moved it into next year,’ said an entertainment executives. The U.S. economy can’t make a broad recovery until every industry is able to restore normal operations and customers traffic begins to return to precrisis levels. That might not happen until a vaccine or treatment for the coronavirus is found. What they are saying? “The service sector is showing good signs of picking up strength as the recovery progresses,” said Thomas Simons, money market economist at Jefferies LLC. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 index SPX, +0.87% rose in Monday trades."}]}