{"article": [{"url": "https://www.marketwatch.com/story/the-recovery-is-faltering-top-forecasters-say-2020-08-12", "published": 1597307540.0, "headline": "The economic recovery is faltering, the most accurate forecasters say", "body": "After a sharp rebound in the economy in May and June, the economic recovery has slowed as consumers, workers and businesses remain extremely cautious, say the economists at UBS who won the MarketWatch Forecaster of the Month contest for July. The latest jobs data show that the recovery is faltering, they say, but they do expect the economy to gradually regain its footing, with gross domestic product rising 5% in 2021. The unemployment rate will probably still be around 10% at the end of this year, they say, with a strong jobs recovery next year once the coronavirus is beaten back. Led by U.S. chief economist Seth Carpenter, the winning team at UBS includes Sam Coffin, Alan Detmeister, Andrew Dubinsky and Laura Desplans. It’s the 11th time that UBS has won our monthly contest. Seth Carpenter, chief U.S. economist at UBS. UBS “The risks are deep,” Coffin said in a phone interview. Job growth is faltering, incomes are falling, and both households and businesses remain leery of making too many long-term plans. The key driver of the outlook for the economy is what assumptions you make about the path of the virus, said Detmeister. It’s less about the number of cases than the level of restrictions in place, he said. UBS is assuming no further large spikes in infections, Coffin said. So that’s a risk to their forecast. They’re more focused on the economic risks, such as “labor-market scarring,” sluggish capital spending and businesses reluctant to act. The next six to 12 months will likely exhibit the effects of a “prolonged dislocation in the labor market,” Coffin said. “What’s going to drive this is how fast people get their jobs back.” The latest data show that most of the job gains since the depths of April have come in the heavily beaten-down food services, accommodation and retail sectors. But there’s been almost none in sectors that were able to shift workers to home offices. More troubling trends: Growth in manufacturing jobs stalled in July outside the automotive sector. The labor-force participation rate dipped in July after gains in May and June. “And within the employed, a large share remained either part time for economic reasons or employed but not at work,” they wrote in a note to clients. The retail sector is under strain, and bankruptcies are looming in many sectors of the economy. The biggest headwind in the next few months will be a large drop in income, due to the expiration of massive federal relief. Even if Congress does agree to another round of extended employment benefits or direct payments, it won’t replace all the income support that was “the lifeblood to prevent the economy from tanking” from March through July. They figure household incomes will drop 10% at an annual rate. Regardless of what Washington does, consumption will slow in September and October, Coffin said. In the July contest, the UBS team had the most accurate forecasts among 45 teams on three of the 11 indicators we track: consumer confidence, the consumer price index and the trade deficit. Their forecasts on four other indicators — the ISM manufacturing index, durable-goods orders, GDP and housing starts — were among the 10 most accurate. UBS forecast Number as reported* ISM 53.3% 52.6% Nonfarm payrolls 1.50 million 4.80 million Trade deficit -$54.8 billion -$54.6 billion Retail sales 5.0% 7.5% Industrial production 4.5% 5.4% Consumer price index 0.6% 0.6% Housing starts 1.20 million 1.19 million Durable goods orders 7.0% 7.3% Consumer confidence index 93.0 92.6 New home sales 685,000 776,000 GDP -34.2% -32.9% *Subject to revisions The runners-up in the July contest were Spencer Staples of EconAlpha, Ellen Zentner’s team at Morgan Stanley, Brian Bethune of Tufts University and Stephen Stanley of Amherst Pierpont Securities. The MarketWatch median consensus published in our Economic Calendar includes the predictions of the 15 forecasters who have earned the most points in our contest over the past 12 months, plus the forecast of the most recent winner of the monthly contest. The economists participating in our consensus forecast: Jim O’Sullivan of TD Securities, Christophe Barraud of Market Securities, Andrew Hollenhorst’s team at Citigroup, Seth Carpenter’s team at UBS, Ryan Sweet of Moody’s Analytics, Michelle Meyer’s team at Bank of America, Lou Crandall of Wrightson ICAP, Spencer Staples of EconAlpha, Jay Bryson’s team at Wells Fargo, Stephen Gallagher at Société Générale, Brian Wesbury and Bob Stein at First Trust Advisors, Jan Hatzius’s team at Goldman Sachs, Douglas Porter’s team at BMO Capital Markets, James Sweeney’s team at Credit Suisse, and Robert Brusca of Fact and Opinion Economics"}]}