{"article": [{"url": "https://www.marketwatch.com/story/beware-the-vultures-coming-for-your-old-401-k-money-11592320876", "published": 1592388200.0, "headline": "Beware the vultures coming for your old 401(k) money", "body": "Tens of millions of Americans are out of work as a result of the COVID-19 pandemic and associated shutdowns. Once the economy restarts in earnest, chances are many of them will return to different jobs, even different careers. That kind of monumental shift in the economy will be an acceleration of an already common experience for many of us — job mobility. The average American holds between 10 and 15 jobs over a lifetime. Many of us spend less than five years at any one employer. Yet five years is long enough to get started in a 401(k) retirement plan and even build up a pretty good balance — money often left behind when we leave a job. Over a recent 10-year period as many as 25 million people in workplace plans changed jobs and left behind a 401(k) plan. Millions more have left behind more than one, according to a GAO study. ING Direct estimates that half of workers who change jobs leave money behind in a previous employer’s plan, even those with large balances. A quarter of “lost” accounts fall in the $10,000 to $50,000 range, notes ING. The average 401(k) balance is currently around $91,400. Sound like enough money to worry about? You bet. As of 2013 there was $1 trillion sitting in orphaned retirement accounts, reports the National Association of Plan Advisors (NAPA). That’s money at a real risk of evaporating completely, warns NAPA, due to state escheatment laws — regulations that pour abandoned accounts into a state fund to await an eventual claimant. According to the U.S. Securities and Exchange Commission, these state laws treat your retirement savings as state-controlled funds. Once claimed, states typically return to owners the balance at the time of escheatment. You get no market gains and none of the dividends. Most 401(k) plans are terminated when companies go out of business. While the company cannot keep your money, you lose unvested contributions and matching contributions are worth nothing if paid in the stock of a failed company. If your company is bought or merged your plan balance could be in an entirely different plan which you will now have to track down. Even if you know where your money is held, the fees in 401(k)s can be ludicrous. Over 10 years, owners of stranded 401(k) plans paid nearly $44 billion in administrative fees on an estimated 38 million left-behind plans nationwide, according to Boston Research Group. Worse still, abandoned 401(k) balances typically are placed in the most conservative investments possible. As a result, they can languish as plan fees eat them alive. The fact is, unless you’re in the government’s massive Thrift Savings Plan or one of a handful of very large corporate plans, you likely pay a lot for your 401(k) investments. Savers in small company plans, which is most people, pay as much as 2.46% in total plan costs. Fees aside, you might think that your old 401(k) is just fine on autopilot. It almost certainly is not. Investments that made sense in your 20s or early 30s are not necessarily a good fit in your 40s and older. Your old plan might be too heavily invested in stocks for your goals, or not enough. Moreover, a shocking number of people believe that having money scattered among previous employer plans is the same thing as diversification. It’s not. You can be in several different mutual funds and still own a small number of the same, currently popular stocks, concentrating your risk despite having “eggs in different baskets.” True diversification is owning hundreds or thousands of different stocks in low-cost index funds. Low-cost funds are vital to reducing the overall cost of investing. The funds I prefer charge a tiny fraction of the typical stock mutual fund fee and provide instant, real diversification. The risks of staying in an old 401(k) plan are reason enough to take action, but consider the positive reasons to roll money out and into an IRA. For one, there’s control. You wouldn’t be happy leaving cash behind in your old bank after moving to a new town. Like an abandoned bank account, a 401(k) at a previous employer is truly out of sight, out of mind. The first step out of this mess is to open an IRA, if you don’t already have one. You can do that with a phone call to any one of several national brokerages or even your local bank. Once the IRA is created, contact your past employers and ask about a rollover. A rollover means the money remains in a tax-advantaged retirement plan, so there is no tax cost to selling your old investments in order to buy new ones. Make sure you request a rollover, not a distribution. If you take money out of your 401(k) plan you will be liable for taxes and, possibly, penalties for early withdrawal. Once the money is transferred you can begin to choose new investments in your IRA that better fit your current age, risk tolerance and retirement goals. As the saying goes, it’s not about what you make, it’s about what you keep. Investments left in old 401(k) plans are at high risk of being unmanaged and often cost far too much. The solution is to consolidate your old 401(k) balances by opening an IRA and rolling over those accounts, then reinvesting in low-cost index funds. A prudent portfolio of diversified index funds can provide a powerful long-term return at a low cost. Plus you’ll get the peace of mind that comes from seeing all of your investments in one easy-to-manage spot."}]}