{"article": [{"url": "https://www.marketwatch.com/story/too-good-to-be-true-how-to-buy-a-salvage-title-vehicle-2020-10-08", "published": 1602133820.0, "headline": "Too good to be true? How to buy a salvage-title vehicle", "body": "This article is reprinted by permission from NerdWallet. The deals you might encounter on salvage-title vehicles these days are enticing — late-model SUVs and luxury sedans, often with low miles, advertised for thousands less than comparable clean-history vehicles. The vehicles are clearly marked as having a “branded” title, a designation that has traditionally frightened off most shoppers, perhaps spooked by past ventures into the depths of Craigslist, where sellers spin tales of tiny little fender-benders that, somehow, led insurance companies to write off a late-model car. They often turn up when you search online car-shopping sites and sort prices from low to high. That’s because companies such as AutoSource, which has grown to 10 car lots in six states, Autolocity and dozens of local operators aggressively market branded-title cars as less expensive alternatives, complete with no-haggle pricing, financing and a limited warranty. Some will even arrange shipping across the country. But is a salvage-title car any better a choice under the bright lights of a dealer lot?What’s a salvage title? The decision to “total” the vehicle (declare it a total loss) is made by the insurance company when it determines it isn’t worth fixing. State laws vary but, in general, vehicles that have been damaged by an accident, flood, hailstorm or fire, are “branded” with a salvage title to warn future buyers that there was a significant problem. Also see: What you should know about buying a used rental car Traditionally, experts recommended avoiding branded-title cars. “It’s such an unknown,” says Mark Holthoff, editor at Klipnik.com, a community website for used-car enthusiasts. Jeff Huang, sales supervisor at Westlake Financial Services, a national auto financing company based in Los Angeles, agrees. “The question is, what kind of components did the shop repair the car with?” he asks. Still, he adds, “if you know the history of the car, there can be value there.” There are a lot of reasons to proceed with caution: It’s difficult to verify that the vehicle has been properly fixed. Other problems may slowly appear, such as fading paint, rust, uneven tire wear, or poor driving dynamics, Holthoff says. Pricing guides don’t provide prices for vehicles with salvage titles, so it’s hard to know what you should pay. When it’s time to sell, most buyers will avoid branded titles. Salvage-title cars typically don’t keep their factory warranty if any remains. You may be able to buy a warranty of some kind, but it will be limited. Not all insurance companies cover salvage-title cars. Many lenders won’t finance branded-title vehicles (Westlake Financial is one of the few that does). Should you consider a branded-title vehicle? A salvage-title car might be a good fit for someone who understands the risks. Resale value is uncertain at best, but that’s not an issue if you plan to drive the car for years. Financing won’t be a problem if you can pay cash or your credit is good enough to make a personal loan viable. The quality of repairs won’t always be obvious, but you’re willing to have the car inspected and research the car’s damage history. In return, you can expect potential savings between 20% and 40% under market value, according to Kelley Blue Book. Also read: The pros and cons of buying a certified used car Bargain hunters shopping the branded-title market hope to find vehicles that suffered little or no damage. For example, if a car was stolen and had only a few parts stripped, it might get a salvage title, even though it could be restored to perfect running order. Hail damage can often be severe enough to total a car. “Maybe some kid who wants a BMW BMW, -1.55% , but can’t afford it,” Huang says. “But he could buy one with a salvage title.” For example, a salvage-titled 2019 Subaru Impreza Limited, with only 1,593 miles, was offered at $16,999. Without a salvage title, Kelley Blue Book estimates the car would cost $25,073 on a dealer’s lot. Assuming this Subaru FUJHY, -1.41% was correctly repaired — a vehicle history report described the damage as “moderate to severe” — a buyer would enjoy a nearly new car at a saving of $8,074. Read: How to test drive a used car That’s a lot of money. But it’s a lot of risk. You could wind up with an unreliable or even unsafe car that is hard to sell or trade.Homework is critical These rebuilt-title sellers make a living finding the right wrecked vehicles, repairing them and inspecting the result. But due diligence on your part is still essential: Get a vehicle history report from Carfax or AutoCheck. Avoid cars where the report shows it was towed from the scene or where the airbag was activated. These both indicate a more serious accident. Take any branded-title car you’re considering to a reputable body shop or mechanic for an inspection. First, Google the car’s vehicle identification number, or VIN, to bring up pictures of the car showing the damage before it was repaired. That will help an inspection focus on the right areas. Be sure to ask the shop to look for frame damage that could alter the alignment of the car. The test drive is crucial: Push every button and turn every knob. Take the car on the freeway to make sure it tracks straight. Find an empty road and hit the brakes hard. Get a quote for insurance coverage before you agree to buy the car. Read Yelp YELP, -1.66% or other reviews for the dealer. More from NerdWallet: If Your College Closes for Good, What Happens to Your Debt? You Don’t Need Perfect Credit to Get a Personal Loan What Biden or Trump Could Do for Your Student Loans Philip Reed is a writer at NerdWallet. Email: articles@nerdwallet.com. Twitter: @AutoReed."}]}