{"article": [{"url": "https://www.marketwatch.com/story/skyrocketing-us-budget-deficit-slows-in-july-as-delayed-tax-payments-offset-massive-federal-spending-2020-08-12", "published": 1597249280.0, "headline": "Soaring U.S. budget deficit takes a breather in July â\u0080\u0094 but it will soon be going back up", "body": "The numbers: The U.S. budget deficit shrank in July to the lowest level since the start of the coronavirus pandemic, but the government is still on track to post the biggest shortfall as a share of the economy since World War II because of massive federal aid for households and businesses. The U.S. deficit slid to $68 billion last month from a record $864 billion in June, the U.S. Treasury said Wednesday. It was also half as large as the $120 billion budget gap in the same month a year earlier. The sharp decline largely reflected an expected spike in tax receipts as well as somewhat smaller spending on coronavirus relief. The government allowed businesses and individuals to delay until July tax payments normally due in April, part of a series of measures meant to blunt the damage to the economy from the virus. The U.S. budget deficit through the first 10 months of the current fiscal year climbed to $2.81 trillion, well above the $867 billion gap in the same period in 2019. The government operates on annual budget that runs from Oct 1. to Sept. 30 instead of using the calendar year more common in the business world. The U.S. is set to record a $3.7 trillion deficit in fiscal 2020 owing to a gigantic increase in spending by the federal government to prevent the economy from sinking into depression. The magnitude of the spending is almost on the scale of World War II. Last year, the budget deficit totaled just under $1 trillion. The deficit could go even higher if Republicans and Democrats end a deadlock over another financial-relief bill. Talks broke down last week and havenâ\u0080\u0099t resumed yet. The next package could top $1 trillion. Read:Fedâ\u0080\u0099s Barkin says economy could suffer relapse without more Washington stimulus What happened: Washington spent $626 billion in July, down from $1.11 trillion in June. In the same month a year earlier, outlays were a much smaller $371 billion. Most of the increase in spending in the past few months was devoted to financial relief for unemployed workers, small businesses and certain industries deemed critical to the U.S. that have suffered greatly during the pandemic. Medical outlays also rose as the government stepped in to help with the cost of testing and treatments for the coronavirus. Tax receipts more than doubled from a year earlier to $563 billion in July. Despite a big drop in tax revenue during the pandemic, receipts are only running 1% below year-ago levels in a sign that the federal bailout has been relatively successful. Spending is up 51% â\u0080\u0094 to $6.56 trillion from $3.73 trillion in the first 10 months of fiscal 2019. Read:The economy took another body blow from COVID-19 in July â\u0080\u0094 just how bad was it? Big picture: The unprecedented nature of the pandemic has spawned the biggest federal intervention in the economic life of the nation since WWII. The deficit as a percentage of gross domestic product is likely to reach around 18%, not far from the 20%-plus level from 1943-1945. The U.S. government is slated to borrow an astonishing $4.5 trillion in fiscal 2020, three times as much as it did last year. The deficit is likely to rise even more in the short run and probably wonâ\u0080\u0099t begin to taper off until early next year â\u0080\u0094 assuming the pandemic begins to fade by then. Thatâ\u0080\u0099s still an unknown. One saving grace for the government: Interest rates have fallen to modern record lows, making it cheap to borrow. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% were trading higher in Wednesday action. Stocks have been mostly rising since hitting a low point in March, with the major benchmarks registering four consecutive monthly gains thus far. The 10-year Treasury yield TMUBMUSD10Y, 0.777% edged up slightly to 0.67%."}]}