{"article": [{"url": "https://www.marketwatch.com/story/stock-index-futures-struggle-for-direction-after-volatile-session-as-investors-await-powell-testimony-2020-09-22", "published": 1600792760.0, "headline": "Dow recovers from intraday drop as S&P 500, Nasdaq snap four-day losing streak", "body": "Stocks rose Tuesday, recovering from intraday losses as the bulls appeared to overcome worries about renewed coronavirus lockdowns in Europe and rising political uncertainty in the U.S. Investors also watched testimony by Federal Reserve Chairman Jerome Powell and Treasury Secretary Steven Mnuchin before a House panel.What are major benchmarks doing? The Dow Jones Industrial Average DJIA, +0.56% rose 140.48 points, or 0.5%, to close at 27,288.18, after hitting an midday low of 26,989.93. The S&P 500 SPX, +0.87% rose 34.51 points, or 1.1%, finishing at 3,315.57. The Nasdaq Composite COMP, +1.39% COMP, +1.39% COMP, +1.39% rose 184.84 points, or 1.7%, to 10,963.64. The S&P 500 and Nasdaq both ended four-day losing streaks, while the Dow snapped a three-day string of declines. See: Nasdaq’s big bounce comes despite just a minority of stocks gaining ground Stocks fell hard Monday, but ended the day well above session lows. The Dow dropped 509.72 points, or 1.8%, to finish at 27,147.70, after falling more than 900 points at its session low. The S&P 500 fell 38.41 points, or 1.2%, to end at 3,281.06 for its fourth straight daily fall, its longest losing streak since February. The Nasdaq Composite shed 14.48 points, or 0.1%, ending at 10,778.80.What are major benchmarks doing? Rising COVID-19 cases and threats of renewed lockdowns in Europe, along with heightened U.S. political rancor ahead of November’s general election, weren’t enough to prevent the market from recouping early losses on Tuesday. Investors dipped their toes back into the market, snapping a string of declines for major equity benchmarks amid signs that the bearish momentum that had sent stocks plummeting on Monday had eased. Still, market participants remain worried that more sustained gains in U.S. markets may be hard to achieve in the face of the looming wall of market risks. “Coronavirus concerns have resurfaced, worrying investors that a reversal in reopening progress could be near. More and more uncertainty is arising as we get closer to the election but no closer to congressional fiscal relief,” said Lindsey Bell, chief investment strategist for Ally Invest, in a note. “But we’re still optimistic this dip will be bought sooner rather than later.” Bitterness in Washington has investors worried about the dimming prospects for an agreement between congressional Democrats and the White House on additional fiscal aid during the pandemic—a prospect complicated by the looming battle over a nominee to replace Ruth Bader Ginsburg, who died Friday, on the Supreme Court. “The lack of new fiscal stimulus, unclear direction over coronavirus policy and now an intense Supreme Court-related political battle is causing a new level of angst in the markets,” said Kenny Polcari, managing partner at Kace Capital Advisors, in emailed comments. “Both political parties are now in a full flight with just a few weeks until election day. The U.S. election has begun to spin out of control.” See: Stock-market ‘anxiety will only intensify over the next 60-90 days warns expert who profited in 1987 and 2008 crises Concerns also have been rising about a second lockdown in parts of the developed world, contributing to anxiety over the prospect of renewed restrictions in the U.S. “I don’t believe we’ll have a second lockdown in the United States, but it’s a simmering concern for investors and the markets,” Polcari said. Equities have been under pressure for much of September, with major benchmarks suffering three straight weekly declines. Tech shares have bore the brunt of the selloff, but have outperformed sectors more sensitive to the economic cycle this week. That has investors keenly focused on rising COVID-19 cases, after the U.K. moved to reimpose some lockdown restrictions. Federal Reserve Chairman Jerome Powell on Tuesday told lawmakers it’s up to them to provide relief to some troubled companies, as doubts remain over prospects for another aid package. Powell and Mnuchin testified Tuesday before the House Financial Services Committee about the status of pandemic aid. In the hearing, Powell pushed back on a suggestion the Fed lower the threshold for loans under its Main Street Lending Program to make loans available to smaller companies. Powell said there was little demand for loans below $1 million and that redesigning the program would require the Fed to start from scratch. On the economic front, data showed existing-home sales in August rose by 2.4% to an annual rate of 6 million, the fastest pace in nearly 14 years. Chicago Federal Reserve Bank President Charles Evans, in remarks at a forum, warned that it’s important for Congress to pass more spending or risk a downward economic spiral. Which companies are in focus? Shares of electric car maker Tesla Inc. TSLA, +1.89% fell 5.6% as the company embarked on a “battery day” event. Chief Executive Elon Musk aimed to tone down expectations ahead of the event, tweeting late Monday that the products set to be unveiled “will not reach serious high-volume production until 2022” See:3 things to know about Tesla’s ‘battery day’ Amazon.com Inc. AMZN, +3.01% shares gained 5.7% after the e-commerce giant was upgraded to outperform from market perform by analysts at Bernstein. Shares of Peloton Interactive Inc. PTON, +6.97% fell 0.4% after recovering from its intraday losses, sparked by Amazon’s unveiling of its “Echelon Smart Connect Fitness Bikes,” for $499 to compete against Peloton’s pricier indoor exercise bikes. AutoZone Inc. AZO, -1.06% shares fell 1.6%%, despite the auto-parts retailer delivering earnings and revenue that beat expectations. Shares of CoreLogic Inc. CLGX, +0.86% gained 0.8% after the company raised its revenue outlook for this year and next, citing increases in mortgage market volumes. What are other markets doing? The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% declined 0.7 basis point to 0.663%. Bond prices move inversely to yields. The ICE U.S. Dollar Index DXY, -0.58% was up 0.3% after jumping 0.7% Monday as investors looked for havens amid a global equity selloff. Gold futures GCZ20, +2.17% lost $2.60, or 0.1%, to $1898.60 an ounce. Oil futures CLX20, -1.62% gained 29 cents per barrel, or 0.7%, to $39.60 per barrel on the New York Mercantile Exchange, bouncing back after a steep fall in the previous session. The pan-European Stoxx Europe 600 Index SXXP, +0.55% rose 0.2% and the U.K.’s benchmark FTSE UKX, +0.64% gained 0.4%. In Asia, Hong Kong’s Hang Seng Index HSI, -0.30% fell 1% and the Shanghai Composite Index SHCOMP, +1.67% lost 1.3%, while Japan’s Nikkei NIK, -0.11% remained closed for a public holiday."}]}