{"article": [{"url": "https://www.marketwatch.com/story/as-trump-tweets-false-flu-claims-here-are-the-facts-about-the-twindemic-that-could-be-coming-2020-10-06", "published": 1602235220.0, "headline": "As Trump tweets false flu claims, here are the facts about the 'twindemic' that could be coming", "body": "Stop comparing the coronavirus and the flu - and start preparing to face them both this fall. That's the message from many doctors and public health experts after President Trump downplayed the coronavirus threat by tweeting that Americans should learn to live with COVID-19 as they have adapted to deal with seasonal influenza. \"Flu season is coming up! Many people every year, sometimes over 100,000, and despite the Vaccine, die from the Flu,\" Trump tweeted, less than a day after returning to the White House following his hospitalization for COVID-19 at Walter Reed Medical Center over the weekend. \"Are we going to close down our Country? No, we have learned to live with it, just like we are learning to live with Covid, in most populations far less lethal!!!\" Twitter TWTR, -0.23%  later flagged the tweet for \"spreading misleading and potentially harmful information related to COVID-19,\" and Facebook FB, +0.26%  pulled the post down completely, because scientific data shows that the two respiratory diseases, while they sometimes share similar symptoms, are not the same. The coronavirus is currently much more dangerous. A study published in JAMA Internal Medicine in May compared the number of deaths from COVID-19 at that time, and the deaths from seasonal influenza during the peak weeks of the last seven flu seasons. The findings: COVID-19 deaths counted in mid-April were about 20 times higher than the seasonal flu deaths during their worst weeks. The president's flu death toll is also higher than what the Centers for Disease Control and Prevention (CDC) reported for the U.S. Influenza is responsible for between 12,000 and 61,000 deaths a year, according to the CDC, and an estimated 22,000 people in the U.S. died from the flu during the 2019-2020 influenza season. This week, the U.S. passed 210,000 COVID-19 deaths since the spring; more than the total number of influenza deaths from the past five flu seasons combined. The flu is certainly a serious health threat, however, and public health services such as the CDC, the World Health Organization (WHO) and the American Academy of Pediatrics (AAP) are warning about a \"twindemic\" of influenza and COVID-19 this fall as America enters flu season from October through May. Here's a look at what we know about the 2020-2021 flu season to date, and how the coronavirus pandemic could complicate things. Why are people worried about a \"twindemic\"? The U.S. is entering flu season right now (which runs between October and May, and peaks between December and February) while the country is still grappling with the coronavirus pandemic that has infected an estimated 7.5 million Americans and counting. So public officials are concerned about both viruses attacking the population at once - a \"twindemic, if you will - and overwhelming hospital beds and emergency services, especially since severe cases of both viruses require the same life-saving medical equipment. The flu has seen between 140,000 and 810,000 people hospitalized each year since 2010. CDC director Robert Redfield has warned that America is bracing for \"the worst fall, from a public health perspective, we've ever had\" with COVID-19 and influenza. \"Either one of those by themselves can stress certain hospital systems,\" he said. Dr. Anthony Fauci, the nation's leading infectious disease expert, has also said that \"we need to hunker down\" this fall and winter. Read:CDC director warns America is in for the 'worst fall â\u0080¦ we've ever had' But it's not just about overflowing intensive care units. Dr. David Cennimo, an infectious disease expert at Rutgers, told MarketWatch that both viruses overwhelming doctors' offices, urgent care centers and clinics is also a major concern. \"If we can remove the burden of symptomatic influenza, we are helping to keep the economy running, keep the workforce running, and to just keep people out of doctors' offices,\" he said. Fortunately, the basic protective measures recommended in preventing the spread of COVID-19 can also stem influenza spread: Wearing masks, staying six feet apart and washing hands. But there's another weapon in the anti-flu arsenal: getting the flu shot. You can catch COVID-19 and the flu at the same time - but you can only vaccinate against one of them right now. Earlier in the pandemic, there were some cases of Americans contracting both COVID-19 and the flu at once, although there is not a lot of data on those situations yet because the pandemic hit at the tail-end of flu season, and the Southern Hemisphere's flu season was especially mild this year (more on that later). The CDC says that this is still being studied. \"Patients tend to do worse if they are fighting multiple respiratory infections at the same time. So you definitely wouldn't want both the flu and COVID at the same time,\" Cennimo said. “ \"To choose to not get the flu vaccine is to choose actively to say, 'I want no chance of protection.'\" ” - Dr. David Cennimo While there are four COVID-19 vaccines in late-stage studies, it's unlikely that a vaccine will be widely available to the public before spring 2021, which is when the flu season will hopefully be winding down. But we do have a flu vaccine now, which can at least remove influenza from the twindemic equation. (And no, the flu vaccine will not prevent you from catching COVID-19, as they are two different viruses.) Yet less than half of the country (47%) got a flu shot last year. \"To choose to not get the flu vaccine is to choose actively to say, 'I want no chance of protection,'\" said Cennimo. \"And that makes no sense to me, given the incredible safety of these vaccines.\" Even a less effective flu vaccine is better than no flu vaccine. Don't let reports that influenza vaccines have been less effective in some past flu seasons put you off. (For example, the 2017-18 vaccine's efficacy rate was just about 36%, which means it cut flu-related doctor visits by that amount.) The vaccine can still lower your risk of complications or dying from the flu, even if you do get sick. Last flu season, 188 children and teens under age 19 died of complications from influenza, according to the CDC. About 80% of children who die from the flu are not vaccinated. \"The flu is tricky. It mutates a lot,\" Cennimo said, but he explained that a flu vaccine's effectiveness is about more than just how many infections it prevents. \"The people that were immunized against influenza and subsequently got influenza that year, they went to the hospital a lot less than people who weren't immunized. They got intubated a lot, lot less,\" he said. \"So there's a value to partial immunity, and sort of attenuating the infection.\" All Americans ages 6 months and up should get the influenza vaccine. The CDC and AAP are urging everyone over the age of six months to get vaccinated for the flu this year. Problem is, one in seven parents have said that the fear of exposing their kids to COVID-19 was keeping them from taking their kids to the doctor for regular checkups and immunizations, like the flu shot. Or people who used to take for granted that they'd be given their flu shot at their workplace, who are now working from home, may not know where to go to get vaccinated this year. \"We're very concerned about how this will affect vaccination rates,\" Cennimo said. Read:1 in 3 parents won't vaccinate their children against the flu, even though pediatricians say it's 'more important than ever' What's more, one in three American parents plan to skip getting flu shots for their kids during the pandemic, according to the recent National Poll on Children's Health, even though both the CDC and the AAP have said its more important than ever right now. \"As a pediatrician, I am very concerned about the health of children and their families this fall if these two potentially deadly viruses [COVID-19 and the flu] are circulating in the community at the same time,\" Dr. Flor Munoz, the lead author of the AAP recommendations, said in a recent statement. \"Children play a pivotal role in the transmission of influenza to others in their household. They can also get seriously ill from influenza without a vaccination.\" The Southern Hemisphere had a mild flu season - but that doesn't mean the Northern Hemisphere will, too. Here's one silver lining: Social distancing measures, as well as closing down schools and non-essential businesses earlier in the pandemic, seem to have almost eradicated the flu in the Southern Hemisphere during that region's winter. Australia and South America, which are just ending their flu seasons, have seen a steep decline in the number of influenza infections and deaths so far this year compared with the previous five years. But the Northern Hemisphere can't just assume it's in for a mild flu season, too. \"It's always very difficult to predict what kind of a flu year you're going to have,\" said Cennimo. \"I don't tend to believe that the U.S. looks too much like New Zealand. And we also did not control our COVID-19 numbers nearly as effectively as they did.\" Read:These charts show one possible silver lining of the pandemic And while social distancing measures, which some Americans have hesitated to adopt, likely did contribute to the Southern Hemisphere's milder flu season, the citizens of New Zealand and Australia also embraced the flu vaccine in a way Americans haven't of late. \"If you take a deep dive into the data, their flu vaccination rates went up between 20% and 40%,\" Cennimo said. \"So maybe that is what is working.\" But less than half of Americans (47%) got vaccinated for the flu last year. The CDC normally recommends that 60% to 70% of the country get the influenza inoculation to keep the virus under control, and Redfield is pushing for 65% compliance this year. But as noted above, many Americans are hesitant to get vaccinated or to vaccinate their children. There is enough flu vaccine available for everyone to get vaccinated. Do not worry about flu vaccine shortages. The CDC normally purchases about 500,000 doses of the vaccine each year for uninsured adults. This year, Redfield said that the CDC ordered extra, and between 194 million and 198 million doses are on the way for the U.S. While some people may occasionally find that their drugstores or clinics are temporarily out of stock, just be patient. Less than half of the available flu vaccines have been distributed so far, and plenty more are on the way. \"This year I think everyone is wanting to get their vaccine and maybe wanting it earlier than usual,\" Dr. Daniel Jernigan of the CDC told the Associated Press. \"If you're not able to get your vaccination now, don't get frustrated,\" and keep trying. But get it done sooner rather than later, as the flu vaccine takes up to two weeks to reach peak effectiveness Here's where to get the flu vaccine. Most Americans with health insurance can get the flu vaccine without coughing up a copay. The vaccine can come in the form of a single injection, two shots to boost protection in older adults, and a nasal spray. The CDC recommends them all, so get whichever one is available to you, or that you are most comfortable getting. Just get it soon. If you're uninsured, the shots generally run between $40 and $60 at drugstores like CVS CVS, -1.76%, Walmart WMT, +1.00%  and Target TGT, +1.14%, and people with Costco COST, +1.19%  or Sam's Club memberships have been able to get the shot for just $20 or $30. You can also find health centers near you, or look up your state's free and discounted vaccine offerings, at Vaccines.gov. There's no way to tell whether your symptoms are COVID-19, the flu or just a cold unless you get tested for COVID-19 and the flu. Unfortunately, you can't self-diagnose which respiratory illness you have at home, because COVID-19 symptoms can be so variable, and also because so many coronavirus patients are asymptomatic. \"It's not possible,\" Cennimo said. \"A sudden onset fever, malaise, body aches, headache and cough tends to be the classic flu, but COVID-19 has fever and fatigue, too. The only way to know is getting tested for the flu, and getting tested for COVID.\" Symptoms of COVID-19 can include fever, cough and shortness of breath, as well as the sudden loss of taste and/or smell, sore throat, headache, body aches, fatigue, chills, nausea and congestion. If you or someone in your family feels sick, call your health care provider - do not just walk into an urgent care center or clinic without calling ahead. While public health experts do want Americans to reach out to their doctors if they feel sick, and to continue getting their regular wellness checkups, vaccinations and screenings, it's important to make an appointment ahead of time - especially if you think you may have caught or been exposed to the coronavirus. Visiting a health care center without warning could see you inadvertently infecting other patients or medical staff. Call ahead. Most flu patients have a mild illness and don't need medical care or antiviral drugs, so the CDC recommends that they just stay home and avoid contact with people, except to get medical care. But call a health care provider, like your family doctor, if you're in a high risk group (young children, people over 65 and pregnant women), are very sick, or are worried about your illness. Those at high risk should get antiviral treatment ASAP, because it works best when started within two days after getting sick. Read:Fight the flu with these 10 proven treatments If you or someone in your household gets sick with what you think could be the coronavirus, however, then once again: stay home. Call your health care provider to describe your symptoms, tell them whether you are in a high risk group (older adults or those with underlying medical conditions) and see whether they advise getting a COVID-19 test. If you test positive - or even if you do not get tested at all - you should self-isolate for at least 10 days after symptoms appear. The CDC has more detailed guidance here. This story will be updated as we continue to learn more about COVID-19 and this year's flu season."}]}