{"article": [{"url": "https://www.marketwatch.com/story/global-tourism-loses-320-billion-in-first-five-months-of-2020-says-un-2020-08-25", "published": 1598325200.0, "headline": "Global tourism loses $320 billion in first five months of 2020, says UN", "body": "UNITED NATIONS (AP) — The tourism global industry has been devastated by the coronavirus pandemic, with $320 billion lost in exports in the first five months of the year and more than 120 million jobs at risk, the U.N. chief said Tuesday. Secretary-General Antonio Guterres said in a policy briefing and video address that tourism is the third-largest export sector of the global economy, behind fuels and chemicals, and in 2019 it accounted for 7% of global trade. “It employs one in every 10 people on Earth and provides livelihoods to hundreds of millions more,” he said. In addition to boosting economies, “it allows people to experience some of the world’s cultural and natural riches and brings people closer to each other, highlighting our common humanity,” he said. But the U.N. chief said that in the first five months of 2020, because of the pandemic, international tourist arrivals decreased by more than half and earnings plummeted. Guterres said this has been a “major shock” for richer developed nations “but for developing countries, it is an emergency, particularly for many small island developing states and African countries.” Tourism for some of those countries represents more than 20% of their GDP, he explained. Sandra Carvao, the U.N. World Tourism Organization’s chief of market intelligence and competitiveness, said the $320 billion in lost exports from January through May is three times what was lost during the year 2009 at the height of the last global financial crisis. And according to the policy briefing, “export revenues from tourism could fall by $910 billion to $1.2 trillion in 2020” and that “could reduce global GDP by 1.5% to 2.8%.” In addition to tourism jobs that are at risk, the policy paper said jobs in associated sectors, including food service, that provide employment for 144 million workers worldwide are also at risk. It stressed that small businesses, “are particularly vulnerable.” Guterres said tourism “is also a key pillar for the conservation of natural and cultural heritage.” According to the briefing, some 7% of world tourism relates to wildlife, “a segment growing by 3% annually.” “The fall in revenues has led to increased poaching and habitat destruction in and around protected areas,” the secretary-general said, “and the closure of many World Heritage sites has deprived communities of vital livelihoods.” Guterres called for the tourism sector to be rebuilt in a way that is safe for host communities, workers and travelers, and is also “equitable and climate friendly.” Noting that travel restrictions and border closures still remain though some have been lifted, Carvao said “the recovery will be very much dependent on the evolution of the pandemic and the economic situation.” “No country has escaped the impact of COVID on tourism,” she said."}]}