{"article": [{"url": "https://www.marketwatch.com/story/saudi-aramcos-first-half-profits-plummet-50-amid-pandemic-2020-08-09", "published": 1596991760.0, "headline": "Saudi Aramco's first-half profits plummet 50% amid pandemic", "body": "DUBAI, United Arab Emirates - Saudi Aramco's net income plunged by 50% in the first half of the year, according to figures published Sunday, offering a revealing glimpse into the impact of the coronavirus pandemic on one of the world's biggest oil producers. Profits for the first six months of the year plunged to $23.2 billion, half of last year's $46.9 billion for the same time period. The results were announced as Aramco's 2222, +0.55%  second quarter earnings dipped to $6.6 billion compared to $24.7 billion during the same time last year, reflecting a staggering 73% drop. The majority state-owned company's financial health is crucial to Saudi Arabia's stability. Despite massive efforts by Saudi Crown Prince Mohammed bin Salman to diversify the economy, Saudi Arabia still depends heavily on oil exports to fuel government spending. The price of Brent crude UK:BRNV20  hovers just under $45 a barrel, significantly less than before the pandemic but up from a low of around $21 a barrel in April. Aramco CEO Amin Nasser acknowledged the company's finances were impacted by \"strong headwinds from reduced demand and lower oil prices\" sparked by the pandemic, which halted flights around the world and plunged economies into recession, including Saudi Arabia's. The company said it will uphold its commitment to pay out dividends of $18.75 billion for the second quarter as part of its promise to pay $75 billion in annual dividends. Nasser described Aramco's half-year earnings as \"solid\" and credited the company's low production costs and operational strength, which helped it to maintain its promised dividend payments. Aramco was knocked out of it's top spot as the world's most valuable listed company by Apple AAPL, +1.74%  in recent days. It's stock price gained a little on Sunday, trading at around 33 riyals ($8.80) a share. At its highest, Aramco traded above $10 a share in December and at it lowest slipped to $7.20 a share in March. Looking ahead, Nasser said the energy market is seeing a partial recovery as countries around the world ease restrictions and reboot their economies. \"We are determined to emerge from the pandemic stronger and will continue making progress on our long-term strategic journey, through ongoing investments in our business,\" Nasser said. Even before the half-year results were announced, it was clear Aramco's half-year earnings would take a hit with the company's first quarter profits down 25%. Aramco, which floated a sliver of its shares on the local Saudi stock market last year, had long kept its financial details a closely-held secret until the company began preparations for its market debut."}]}