{"article": [{"url": "https://www.marketwatch.com/story/microsoft-says-apples-threat-against-fortnite-maker-would-hurt-entire-videogame-industry-2020-08-23", "published": 1598215940.0, "headline": "Microsoft says Appleâ\u0080\u0099s threat against â\u0080\u0098Fortniteâ\u0080\u0099 maker would hurt entire videogame industry", "body": "Apple Inc.â\u0080\u0099s threat to revoke Epic Games Inc.â\u0080\u0099s developer account would have far-reaching effects harmful to the videogame industry, Microsoft Corp. said in a court filing Sunday. The new filing by Epic comes amid a tense showdown with Apple AAPL, +1.74% Â , which has removed Epic videogames, such as the mega-popular â\u0080\u009cFortnite,â\u0080\u009d from its App Store over a violation of its payment rules. Epic argued that Appleâ\u0080\u0099s threat to also block its developer account would prevent other game developers from using its widely used Unreal Engine, which is used in the creation of 3-D graphics, harming â\u0080\u009cnumerous third-party developers.â\u0080\u009d Kevin Gammill, Microsoftâ\u0080\u0099s MSFT, +2.48% Â general manager for Gaming Developer Experiences, agreed in a statement of support, saying the ban by Apple would put developers who use the Unreal Engine â\u0080\u009cat a substantial disadvantage,â\u0080\u009d since â\u0080\u009cthere are very few other options available.â\u0080\u009d Read: Will videogames be the Achilles heel for Apple, Google in antitrust investigations? â\u0080\u009cIf Unreal Engine cannot support games for iOS or macOS, Microsoft would be required to choose between abandoning its customers and potential customers on the iOS and macOS platforms or choosing a different game engine when preparing to develop new games,â\u0080\u009d Gammill said. â\u0080\u009cAppleâ\u0080\u0099s discontinuation of Epicâ\u0080\u0099s ability to develop and support Unreal Engine for iOS or macOS will harm game creators and gamers.â\u0080\u009d Apple has said it will restore â\u0080\u009cFortniteâ\u0080\u009d and leave Epicâ\u0080\u0099s developer account alone if the company reverses course and follows the App Storeâ\u0080\u0099s payment rules. In a filing Friday, Apple called the impact on Epic a â\u0080\u009cself-inflictedâ\u0080\u009d wound, and accused it of deliberately breaching its contract after years of taking â\u0080\u009cadvantage of everything Appleâ\u0080\u0099s App Store has to offer.â\u0080\u009d"}]}