{"article": [{"url": "https://www.marketwatch.com/story/these-cheap-stocks-could-see-huge-gains-during-a-vaccine-driven-economic-rebound-2020-09-22", "published": 1601107520.0, "headline": "These cheap stocks could see huge gains during a vaccine-driven economic rebound", "body": "There’s no doubt that the coronavirus economy has been terrible for value stocks. But with expectations growing that there will be effective COVID-19 vaccines late this year or sometime in 2021, it’s time to think about which stocks that have been hit so hard this year will soar as earnings expectations normalize. First, here’s a comparison of performance for the benchmark S&P 500 index SPX, +0.87% this year with the Vanguard S&P 500 Growth ETF VOOG, +1.35% Vanguard S&P 500 Value ETF VOOV, +0.29% : Value stocks fell further during the March coronavirus doldrums and are still down significantly for 2020, as growth stocks have soared and the full S&P 500 index has more than recovered. FactSet “Many of today’s Value stocks have faced particularly acute challenges from the coronavirus and will experience the sharpest rebounds in earnings expectations once investors have confidence in the path to normalization,” Goldman Sachs chief U.S. equity strategist David Kostin wrote in the firm’s “Weekly Kickstart” report on Friday. Increasing earnings estimates tend to drive stock prices higher, and for slower-growing companies, rising estimates as recovery expectations solidify, and even P/E multiple expansion, can lead to significant gains for investors who are willing to go in now and wait. Patiently. If you are confident that one or more of the massive COVID-19 vaccine-development projects will be successful this year or in 2021, the value-rebound thesis may help you outperform over the next two years. Why two years? Even if there is surprisingly quick success with a vaccine, there are likely to be shortages and other deployment delays. So it seems prudent to look out to 2022 for earnings estimates and price-to-earning valuations. Among the S&P 500, consensus 2022 earnings estimates are available from FactSet for 483 companies. Five of those are expected to continue losing money that year, making price-to-earnings valuations meaningless. Among the remaining 478 constituents of the S&P 500, here are the 30 that are the most cheaply priced against calendar 2022 consensus earnings estimates: Company Ticker Price/ consensus calendar 2022 EPS estimate Total return - 2020 through Sept. 21 Lincoln National Corp. LNC, -2.18% 3.0 -45% Unum Group UNM, -1.42% 3.0 -39% Mylan NV MYL, -0.50% 3.2 -26% DXC Technology Co. DXC, +0.30% 3.9 -53% Western Digital Corp. WDC, -1.49% 4.5 -42% Prudential Financial Inc. PRU, -0.57% 5.0 -28% Citigroup Inc. C, +0.47% 5.1 -43% American International Group Inc. AIG, -1.02% 5.3 -46% General Motors Co. GM, -0.15% 5.6 -17% MetLife Inc. MET, -0.92% 5.7 -24% H&R Block Inc. HRB, -1.80% 5.7 -36% Invesco Ltd. IVZ, +1.23% 5.7 -40% ViacomCBS Inc. Class B VIAC, -2.34% 5.9 -29% Synchrony Financial SYF, -1.06% 5.9 -26% Principal Financial Group Inc. PFG, -2.25% 6.0 -26% Discovery Inc. Class A DISCA, -2.32% 6.0 -32% Hartford Financial Services Group Inc. HIG, -1.83% 6.1 -39% Capital One Financial Corp. COF, -0.49% 6.3 -30% Discover Financial Services DFS, -0.79% 6.3 -33% HollyFrontier Corp. HFC, -2.93% 6.4 -57% Ford Motor Co. F, -1.36% 6.4 -25% AbbVie Inc. ABBV, +0.41% 6.5 5% Walgreens Boots Alliance Inc. WBA, -1.96% 6.6 -37% Diamondback Energy Inc. FANG, -1.38% 6.6 -65% Delta Air Lines Inc. DAL, +0.39% 6.8 -49% KeyCorp KEY, -1.42% 6.8 -38% Xerox Holdings Corp. XRX, -1.38% 6.9 -49% NRG Energy Inc. NRG, -0.24% 6.9 -25% Wells Fargo & Co. WFC, 6.9 -54% Source: FactSet You can click on the tickers for more about each company. Here’s the list again, this time with analysts’ ratings and price targets. Scroll the table at the bottom, to the right, to see all the data. Company Ticker Share 'buy' ratings Share neutral ratings Share 'sell' ratings Closing price - Sept. 21 Cons. price target Implied 12-month upside potential Lincoln National Corp. LNC, -2.18% 50% 50% 0% $31.54 $44.64 42% Unum Group UNM, -1.42% 9% 73% 18% $17.12 $21.00 23% Mylan NV MYL, -0.50% 65% 35% 0% $14.78 $22.00 49% DXC Technology Co. DXC, +0.30% 54% 46% 0% $17.32 $23.54 36% Western Digital Corp. WDC, -1.49% 60% 37% 3% $36.09 $51.25 42% Prudential Financial Inc. PRU, -0.57% 16% 69% 15% $64.73 $71.00 10% Citigroup Inc. C, +0.47% 85% 15% 0% $43.93 $67.85 54% American International Group Inc. AIG, -1.02% 50% 50% 0% $26.98 $37.21 38% General Motors Co. GM, -0.15% 83% 17% 0% $30.00 $38.88 30% MetLife Inc. MET, -0.92% 62% 38% 0% $37.43 $45.80 22% H&R Block Inc. HRB, -1.80% 33% 56% 11% $14.18 $17.57 24% Invesco Ltd. IVZ, +1.23% 11% 67% 22% $10.22 $10.43 2% ViacomCBS Inc. Class B VIAC, -2.34% 40% 56% 4% $28.99 $27.53 -5% Synchrony Financial SYF, -1.06% 70% 30% 0% $25.90 $28.76 11% Principal Financial Group Inc. PFG, -2.25% 18% 82% 0% $39.00 $47.80 23% Discovery Inc. Class A DISCA, -2.32% 38% 58% 4% $22.42 $24.67 10% Hartford Financial Services Group Inc. HIG, -1.83% 76% 24% 0% $36.24 $52.20 44% Capital One Financial Corp. COF, -0.49% 69% 22% 9% $71.65 $80.38 12% Discover Financial Services DFS, -0.79% 63% 33% 4% $55.02 $61.45 12% HollyFrontier Corp. HFC, -2.93% 42% 47% 11% $21.21 $31.81 50% Ford Motor Co. F, -1.36% 17% 78% 5% $6.87 $7.41 8% AbbVie Inc. ABBV, +0.41% 74% 26% 0% $89.09 $110.00 23% Walgreens Boots Alliance Inc. WBA, -1.96% 5% 86% 9% $35.79 $40.94 14% Diamondback Energy Inc. FANG, -1.38% 89% 11% 0% $32.08 $58.72 83% Delta Air Lines Inc. DAL, +0.39% 62% 38% 0% $29.82 $37.82 27% KeyCorp KEY, -1.42% 36% 46% 18% $12.05 $13.72 14% Xerox Holdings Corp. XRX, -1.38% 13% 63% 25% $18.07 $17.20 -5% NRG Energy Inc. NRG, -0.24% 80% 20% 0% $29.15 $44.44 52% Wells Fargo & Co. WFC, 29% 60% 11% $24.04 $30.11 25% Sell-side analysts ratings and price targets are based on 12-month outlooks. That’s not a very long period when you are looking at an economic recovery play that depends on unproven vaccines. This type of rebound investment play needs to include a truly long-term commitment, as you have no way of knowing how quickly a vaccine will be deployed. You also need to do your own research to form opinions about a particular company’s viability over the next decade. One example from the list is General Motors Co. GM, -0.15%, which was cited by George Schultze, CEO of Schultze Asset Management, as an excellent investment for the electric-vehicle revolution. The Wall Street Journal recently profiled GM CEO Mary Barra and her efforts to transform the company into a leaner manufacturer with a focus on electric and autonomous vehicles. You should decide how you rate GM’s chances. Or you might forgo trying to pick value winners and invest in a value ETF instead with the same long-term commitment."}]}