{"article": [{"url": "https://www.marketwatch.com/story/stock-market-index-futures-drift-slightly-higher-a-day-after-sp-500-nabs-record-2020-08-19", "published": 1597857020.0, "headline": "U.S. stocks finish lower after Fed minutes urge Congress for more pandemic aid, underscore challenge to recovery", "body": "U.S. stocks finished lower Wednesday, a day after the S&P 500 index scored its first record close in six months, while the minutes of the Federal Reserve’s July meeting showed staff cut their economic growth forecast for the remainder of 2020 and stressed the need for more fiscal aid in the wake of the coronavirus pandemic. How did stock benchmarks fare? The Dow Jones Industrial Average DJIA, +0.56% shed 85.19 points, 0.3%, to end at 27,692.88, while the S&P 500 SPX, +0.87% fell 14.93 points, 0.4%, to close at 3,374.85, after setting an intraday record of 3,399.54. The Nasdaq Composite Index COMP, +1.39% slumped 64.38 points, or 0.6%, to close at 11,146.46, after also reaching a new intraday record of 11,257.42. The small-cap Russell 2000 index RUT, +0.55% closed 0.2% higher, extending a streak of outperformance that has it up 6.7% in the past month. On Tuesday, the Dow slipped 66.84 points, or 0.2%, to close at 27,778.07. The S&P 500 index gained 7.79 points, or 0.2%, finishing at a record 3,389.78, its first all-time closing high since Feb. 19. The Nasdaq Composite Index added 81.84 points to reach 11,210.84, also a record close and its 34th of the year. What drove the market? Stock indexes fell after the Federal Reserve published minutes of its July meeting at which staff cut their forecast for economic growth over the rest of year, while highlighting the need to support vulnerable families and broader economy during the pandemic with additional fiscal stimulus. The Fed minutes echoed earlier warnings by Fed Chair Jerome Powell about the significant downside risks to the economy which remains tethered to the pandemic’s trajectory. “To us, this strongly suggests that both monetary and fiscal policy support will continue to be required for the recovery to remain on track,” said Bob Miller, BlackRock’s head of Americas fundamental fixed Income, in a note. In an interview with Politico, Democratic House Speaker Nancy Pelosi said that she would be willing to reconvene negotiations and consider a compromise on another coronavirus relief package, after $600 a week in additional unemployment benefits expired at the end of last month leaving many workers in the lurch. Earlier in the Wednesday session, stocks got a lift from healthy earnings reports from prominent retailers. Target Corp. TGT, +1.14% reported a record-setting second-quarter early Wednesday, with comparable sales soaring a record 24.3%, and digital comparable sales nearly tripling, up 195%. Similarly, home-improvement retailer Lowe’s Cos. LOW, +1.38% reported fiscal second-quarter profit and sales that rose well above expectations, boosted by a consumer focus on home repair and maintenance activities during the pandemic. “Part of the reason why retail sales have been so strong has been fiscal relief that’s helped the recovery story,” said Matt Stucky, an equities portfolio manager at Northwestern Mutual, pointing to the recent dip in reported U.S. COVID 19 cases, corporate earnings that beat dire forecasts, and the positive impacts of government pandemic aid. “But there’s still is a massive need for fiscal relief for those who are counting on these benefits to pay their bills and meet their needs,” he told MarketWatch. Amid a still-weak labor market, a downturn on Wall Street could come from any one of a number of sources, including slow progress on further coronavirus fiscal stimulus in Congress, rising Sino-American tensions, a contested November election, and more. That is driving a bifurcation not just between highflying tech sectors and the rest of the stock market, but in asset classes as well. “It seems like the stock, credit and rates markets are totally disconnected,” said Nancy Davis, chief investment officer of Quadratic Capital, in emailed comments. “The equity and credit markets are looking past the pandemic and are already pricing in a strong recovery with record highs in the S&P 500, the Nasdaq and credit markets. The rates market, on the other hand, is priced for the end of times.” Read next:There will be no V-shaped recovery for consumer sentiment, DataTrek says On the international front, President Donald Trump suggested that he would be willing to let a phase-one agreement between the U.S. and China collapse as animosities between the two sides ratchet higher. Separately, U.S. universities and colleges have been warned by the State Department that they should divest Chinese stockholdings, ahead of a potential delisting of those firms, wrote Bloomberg.Which stocks were in focus? Shares of Momenta Pharmaceuticals Inc. US:MNTA rocketed 69.2% Wednesday, after the biotechnology company announced an agreement to be acquired by Johnson & Johnson JNJ, +1.39% in a deal valued at $6.5 billion. President Donald Trump voiced support on Tuesday for Oracle Corp. ORCL, +0.42% to buy the U.S. operations of TikTok, adding a fresh wrinkle to the bidding for the Chinese-owned video-sharing app, whose parent ByteDance is also in negotiations with Microsoft Corp. MSFT, +2.48% over a possible acquisition that also appeared to be endorsed by the president. Apple Inc. AAPL, +1.74% shares rose 0.1%, ending just shy of a market capitalization of $2 trillion just two years after reaching $1 trillion. Advance Auto Parts Inc. AAP, -1.48% scored a set of price-target increases, with J.P. Morgan boosting its forecast to $183, and Credit Suisse and Wedbush hiking their target to $180. Shares fell 1.3%. TJX TJX, -0.18% on Wednesday reported sales that slightly edged analyst expectations, but a deeper per-share loss than Wall Street had expected. Shares fell 5.4%. Target TGT, +1.14% shares surged 12.7% after the big-box retailer reported better-than-expected results for the quarter, including a 24.3% in same-store-sales shoppers stocked up on household items during stay-at-home orders. Lowe’s LOW, +1.38% shares gained 0.2% after the hardware store chain’s financial results surpassed estimates as people continued improving their homes during the pandemic. Walmart Inc. WMT, +1.00% remains in focus after the big-box stores reported earnings and revenue that beat the consensus. U.S. same-store sales rose 9.3% with general merchandise and food leading the way. Shares slumped 1.7%. Occidental Petroleum Corp OXY, -3.22% shares shed 0.9% after it announced Wednesday agreements to sell its Wyoming, Colorado and Utah land grant assets for $1.33 billion to Orion Mine Finance. How did other markets trade? In Asia overnight, China’s CSI 300 index 000300, +2.04% closed 1.5% lower, while Hong Kong’s Hang Seng Index HSI, -0.30% fell 0.7%. Japan’s Nikkei 225 NIK, -0.11% added 0.3%. In Europe, the Stoxx 600 Europe Index SXXP, +0.55% closed 0.7% higher and the U.K.’s FTSE 100 UKX, +0.64% added 0.6%. The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% rose less than a basis point to 0.674%. Bond prices move inversely to yields. Gold prices for December delivery GCZ20, +2.17% tumbled 2.1%, to settle at $1,970.30 an ounce. U.S. crude-oil prices US:CLU20 finished 4 cents higher, or 0.1%, at $42.93 a barrel after an industry group reported a decline in inventories. The ICE U.S. Dollar Index, DXY, -0.58% a gauge of the buck against a half-dozen major rivals, jumped 0.8% to 93.00. Mark DeCambre contributed reporting"}]}