{"article": [{"url": "https://www.marketwatch.com/story/wholesale-prices-surge-06-but-dont-be-fooled-inflation-no-threat-to-the-economy-2020-08-11", "published": 1597140140.0, "headline": "Wholesale prices surge 0.6%, but donâ\u0080\u0099t be fooled: Inflation no threat to the economy", "body": "The numbers: The wholesale cost of U.S. goods and services posted the biggest increase in July in nearly two years, led by higher oil prices, but inflationary pressures in the economy were still largely invisible owing to the coronavirus pandemic. The producer price index shot up 0.6% last month, the government said Monday. Economists polled by MarketWatch had predicted a 0.3% increase. Yet wholesale inflation more broadly was absent. The PPI is down 0.4% in the past 12 months, a marked contrast to the beginning of the year. The index was growing at a yearly pace of 2% in January. Many companies have had to reduce prices to generate sales, especially in businesses that have seen a big dropoff in customers worried about contracting the virus. Hotels, airlines and indoor dining have been particularly hard hit. Another measure of wholesale costs known as core PPI â\u0080\u0094 which excludes food, energy and trade margins â\u0080\u0094 rose 0.3% last month to mark the third straight gain. The core rate has risen a scant 0.1% in the past year, however. By contrast, it was rising at a 1.5% yearly clip before the crisis. See: MarketWatch Economic Calendar What happened: Oil prices have bounced off pandemic lows and contributed to the slight uptick in inflation. Wholesale gas prices jumped 10.1%. Itâ\u0080\u0099s still relatively cheap to fill up, however. Food prices fell slightly. In the past two months most of the spike in wholesale food costs early in the pandemic have been basically erased. The wholesale cost of services, a volatile category from which it is hard to deduce any trends, rose 0.5% in July. Thatâ\u0080\u0099s the biggest increase in more than a year. The wholesale cost of financial adviced was a leading contributor. Big picture: Washington is spending trillions of dollars to prop up the economy â\u0080\u0094 the most massive federal effort since World War Two â\u0080\u0094 but itâ\u0080\u0099s not adding to inflation because of the depressed economy. A lack of demand is forcing companies to keep prices down in an effort to lure back customers. While prices for some goods and services might rise here and there, inflation is unlikely to pose a problem for the economy until the pandemic fades. What they are saying? â\u0080\u009cFigures have been choppy in recent months, but there is no significant upward pressure on wholesale prices,â\u0080\u009d said chief economist Scott Brown of Raymond James. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% rose in Tuesday trades."}]}