{"article": [{"url": "https://www.marketwatch.com/story/when-does-it-make-sense-to-take-social-security-at-62-2020-07-22", "published": 1595675600.0, "headline": "Take Social Security at 62? Here's when it makes sense to do it", "body": "It's best to wait until you're 70 to start taking Social Security retirement benefits - even if it means tapping into your retirement assets at the bottom of a bear market. Why? Because the guaranteed, risk-free 8% annual Social Security benefit increase is an unbeatable deal. 80% of older Americans can't afford to retire - COVID-19 isn't helping And yet in 2018 only 6% of women and 4% of men waited until they turned 70 to claim benefits. Most advisers and financial columnists wag their fingers at people who take Social Security as soon as they qualify at age 62. Yet some 31% of women and 27% of men tapped into Social Security at that age in 2018. It's hard to say no when somebody is offering you a pot of money right now. There are some bad reasons to do this, such as because all your friends are doing it or because you'd better grab the benefits before Social Security runs out of money. I suspect that before that happened, Congress would raise payroll taxes for high-income people rather than cut benefits for one of the nation's largest, most active voting blocs. But there are some decent reasons to start taking benefits early, and the recession in the wake of the COVID19 pandemic has dramatically highlighted one of them: many people don't have much choice. We'll get into that later. One of the best reasons to take Social Security at 62 is if you've got a serious illness or chronic medical conditions. As with all retirement planning, you're acting like an amateur actuary, predicting your own life expectancy to determine how long you'll need your money to last. Research shows that the more chronic conditions you have, the shorter your lifespan is likely to be. A 2014 study by researchers at Johns Hopkins University showed that a 67-year-old individual with no chronic conditions will live on average 22.6 years (almost to 90) but that a person of that age with five chronic conditions will live on average 7.7 fewer years than the healthy 67-year-old. Those chronic conditions the researchers looked at included heart disease, cancer, chronic obstructive pulmonary disease, stroke and Alzheimer's disease. Other common chronic illnesses, according to the Chronic Conditions Data Warehouse, which uses data from Medicare and Medicaid, include hypertension, arthritis, diabetes and kidney disease. Many people who have these conditions and have been successfully treated, live long, happy lives, so be sure to consult your doctor on your own situation. But if your prognosis for a long life isn't great-especially if you have some chronic conditions yourself or a family history of them-taking Social Security early should definitely be on the table. The coronavirus brought the other big real-world factor to center stage. A 2018 survey of nearly 5,000 people by Willis Towers Watson found that 37% of employees expected to work past 70, up from 30% two years before. As of February 2019, more than 20% of adults 65 and older were either working or looking for work-double the percentage from 1985-and the Bureau of Labor Statistics estimated 13 million Americans aged 65 and older would be in the labor force in 2024. COVID-19 and the actions by governments to prevent its spread have thrown some 40 million Americans out of work, the deepest, fastest such decline in history. The labor-force participation rate plummeted more than seven percentage points, an astonishing decline. Among those were many older workers who, three researchers concluded, have probably left the labor force for good. \"We see a large increase in those who claim to be retired,\" write Olivier Coibon of the University of Texas at Austin, Yuriy Gorodnichenko of the University of California at Berkeley and Michael Weber of the University of Chicago's Booth School of Business. \"This makes early retirement a major force in accounting for the decline in the labor-force participationâ\u0080¦. [it] suggests that the onset of the Covid-19 crisis led to a wave of earlier than planned retirements.\" That's led to a mini-run on 401(k)s, IRAs and other retirement accounts. A new survey by Bankrate shows that more than 27% of Americans who are still working or are recently unemployed withdrew money from their retirement accounts. Some 62% of those people cited loss of income as the main reason. Last time we showed it's not a bad idea to tap into your retirement account to delay taking Social Security as long as you can. But as many as 45% of baby boomers have nothing saved for retirement. So, if you've just lost your job for good and have little or no retirement savings, you have very little choice: Take Social Security at 62 and get on with life. Sometimes you just gotta do what you gotta do."}]}