{"article": [{"url": "https://www.marketwatch.com/story/stimulus-talks-appear-to-end-with-a-whimper-not-a-bang-11596836211", "published": 1596827720.0, "headline": "Stimulus talks appear to end with a whimper, not a bang", "body": "Speaker of the House Rep. Nancy Pelosi (D-CA) and Senate Minority Leader Sen. Chuck Schumer (D-NY) speak to members of the press after a meeting with Treasury Secretary Steven Mnuchin and White House Chief of Staff Mark Meadow after talks on another stimulus package made no progress. Alex Wong/Getty Images Ultimately, $2 trillion was too big of a chasm to bridge. Democratic congressional leaders and Trump administration negotiators emerged from their last-ditch coronavirus aid bargaining meeting Friday empty-handed and ready to take the fight to the public. Neither side described the talks as formally over, but also neither said they plan to offer anything new to get them restarted. “The president would like us to make a deal, but unfortunately, we did not make any progress today. We discussed the same issues,” Treasury Secretary Steven Mnuchin told reporters after the meeting broke up. “I said come back when you’re ready to give a higher number,” Pelosi said to reporters, flanked by Senate Democratic Leader Chuck Schumer. The two sides, with Mnuchin joined by Mark Meadows, the White House chief of staff, had been meeting on an almost daily basis for two weeks. The pressure for a deal escalated earlier this week after what appeared to be a consensus to try to get at least the major outlines of a deal done by the week’s end and with senators leaving town Thursday, being told they would be called back only if there was a deal. Mnuchin pointed to disagreements over the enhanced federal jobless benefits, $600 weekly add-on payments to the unemployed that lapsed in July, and how much to give to states as the main hurdles negotiators could not overcome. The add-on payments had been created by the CARES Act, the $1.7 trillion bill enacted in March. “I think if we can reach an agreement on state and local and unemployment, we will reach an overall deal and if we can’t, we can’t,” he said. Democrats wanted to reinstate the add-on payment at $600, while Republicans offered either one-week extensions or a system to gradually replace the $600 with lower add-on payments that would only make up a portion of workers’ previous pay. Pelosi said Democrats also wanted $915 billion in state, local and tribal government aid to offset lost revenues and rising coronavirus expenses and Republicans offered $150 billion. Schumer said Republicans remained unwilling to budge from their proposals, which have been estimated to cost about $1.1 trillion between 2020 and 2030, even after Democrats publicly offered to lop $1 trillion from their initial $3.4 trillion bill. “Unfortunately, they rejected it. They said they couldn’t go much above their existing $1 trillion and that was disappointing,” he said, Meadows, a member of the House and part of a group called the Freedom Caucus advocating against federal spending, criticized Democrats for having such an expensive plan. “What they want is a $2.5 trillion blank check,” Meadows said. In the short-term, Meadows said he plans to recommend to Trump the president move ahead with trying to provide some economic relief unilaterally, through the executive order process. Trump Tweeted on Thursday that he wanted to take action on the jobless benefit add-on, evictions, student loan payments and to have a payroll tax cut. Read more: Going executive order route poses risks, raises questions for White House Others are less convinced the talks are as dead as they appear. James Lucier, with Capital Alpha Partners in Washington, said until the presidential nominating conventions begin, lawmakers can still be summoned back to Washington. “The long wait has happened because the effective deadline hasn’t arrived yet. The deadline to do something before Friday, August 14 is probably Tuesday, August 11,” he wrote in a client note. And Mnuchin and Pelosi both said there are areas of agreement, issues where the sides are close in their thinking, but that have been held hostage to larger items being worked out. “I think there are areas where there is broad bipartisan agreement,” Mnuchin said, specifically referring to the Paycheck Protection Program, the loan program for small businesses that is set to expire Saturday. If lawmakers do not return to Washington this month, the next likely window for negotiations is either September, when they will be focused on passing a temporary spending bill to keep the government open past Sept. 30, or after the election. Asked about combining a renewed stimulus push with the stopgap bill Meadows said, “I don’t want to anticipate anything.” The main U.S. stock benchmarks closed slightly higher on Friday as investors tracked the negotiations and digested a better-than-expected July jobs report, with the S&P 500 SPX, +0.87% up 0.1% and the Dow industrials DJIA, +0.56% gaining 0.2%."}]}