{"article": [{"url": "https://www.marketwatch.com/story/this-stock-market-metric-has-correctly-predicted-presidential-election-results-since-1984-11598986959", "published": 1598996360.0, "headline": "This stock-market metric has correctly predicted presidential election results since 1984", "body": "The 2020 election race between incumbent President Donald Trump and former Vice President Joe Biden is a coin toss, LPL financial chief market strategist Ryan Detrick says. Indeed, a number of polls and betting odds indicate that a once-yawning lead enjoyed by Biden is starting to wane. Real Clear Politics shows that the Democratic nominee is leading Trump by 6.2 percentage points, based on an average of national polls, and his advantage in so-called battleground states, stands at a relatively razor-thin margin of 2.7 percentage points, according to a separate RCP poll average. Read: Opinion: Here’s what stock returns from now until Election Day tell us about Biden and Trump But Detrick says that a simple equity-market chart has been the best predictor of U.S. presidential elections since 1984, proving 100% accurate—and is 87% accurate since 1928. The LPL analyst says that a chart of the S&P 500’s performance in the three-month period ahead of Election Day, which is Nov. 3 this year, has proven accurate over the past nearly four decades. That gauge currently shows that since Aug. 3, the S&P 500 SPX, +0.87% has returned nearly 7% (see attached chart). Meanwhile, the Dow Jones Industrial Average DJIA, +0.56% has climbed over 7% and the Nasdaq Composite Index COMP, +1.39% has surged more than 9%. LPL Financial, FactSet Detrick writes that a positive return over that three-month period “may signal an increased likelihood that the incumbent party may win, while stock market losses during the same period have tended to predict an opposition party win.” To be sure, the strategist acknowledges that the market isn’t the economy and that millions of people are out of work due to the effects of the COVID-19 pandemic, but notes that a look at what stocks may say about the outcome of election may be one thing for investor to consider as they prepare for an uncertain stretch of trade ahead of that key vote. “The unique circumstances around this year’s pandemic seem to add plausibility that this could be the first time in almost 100 years that this signal may be wrong—especially if the stock market and economy continue to recover between now and Election Day,” he wrote. All that said, Detrick said that Trump is still contending with an even bigger factor that could stymie his re-election chances beyond the stock-market gains: a recession. “History has shown that when a recession has occurred during the two years before the election, the incumbent president has tended to lose,” the analysts wrote. “ In fact, the economy incredibly has predicted the winner of every presidential election going back to President Calvin Coolidge,” he added. That statistic also offers its own inherent caveat since the recession that ensued in this pandemic is a global one and occurred a stunning and historic rate. But the president’s handling of the current pandemic and the ensuing public-health crisis may be the one thing that voters weigh against or in favor of Trump. Read: This spot-on predictor of who will win the 2020 presidential election isn’t the stock market or even opinion polls MarketWatch columnist Mark Hulbert, in an article on Tuesday pointing out the fallibility of trying to spot correlations between stock performance and election outcomes, says that investors should “be on your guard…for those using the stock market to predict who will win the White House in November.” Notably, he says that the historical data can be contorted to say a number of things but also that the range period, including a three-month stretch before the election, is arbitrary and should raise a caution for observers. See: Trump re-election momentum could shock stock-market investors betting on Biden win, quantitative analyst says Check out: Leon Cooperman torn on voting for Trump: ‘Bottom line is we have a man with limited character who has good economic ideas, but he’s very divisive’"}]}