{"article": [{"url": "https://www.marketwatch.com/story/what-to-do-if-someone-else-is-claiming-your-unemployment-benefits-2020-06-08", "published": 1592051720.0, "headline": "What to do if someone else is fraudulently claiming your unemployment benefits", "body": "In Washington, the authorities have recovered $300 million in bogus unemployment claims from crooks using stolen identities. In Maine, officials have cancelled more than 12,000 initial jobless claims that they’ve determined are fraudulent. And in Oklahoma and Pennsylvania, authorities have been probing an increasing number of questionable unemployment claims. At a time of double-digit unemployment rates, criminal imposters are using stolen personal information to apply for jobless benefits across the country and reap the cash that a victim might desperately need. A Nigerian-based crime ring is one potential source of the problem, according to the U.S. Secret Service. There’s an ongoing investigation into the perpetrators, according to the Federal Trade Commission said. The widespread scam is affecting “tens of thousands of people, slowing the delivery of benefits to people in real need, and costing states hundreds of millions of dollars,” the regulator said. The $2.2 trillion stimulus bill known as the CARES Act authorized an extra $600 in weekly unemployment payments on top of whatever amount a state pays out to unemployed workers. The extra payments, which expire at the end of July, amount to a generous cash infusion for many people who quickly lost their job as the coronavirus pandemic rocked America. So what if you become one of the victims — especially if you need that money for necessities? Here are answers on what to do next:How will I know I’m a victim of unemployment benefit fraud? An imposter fraud victim learns someone is cashing in on their identity two different ways, according to Eva Velasquez, president and CEO of the Identity Theft Resource Center. In one case, Velasquez says, the victim still has a job and their current employer tells the worker they’ve been notified that the worker is supposedly applying for jobless benefits. (Employers are notified by the state as a matter of course when an ex-worker applies for jobless benefits.) “ There’s two ways identity theft victims usually learn someone’s using their information to get jobless benefits. ” In the other case, victims apply for unemployment insurance themselves and learn from state labor officials someone with their exact same identity is already collecting unemployment. “That, to me, is the most heartbreaking scenario,” Velasquez told MarketWatch. The Identity Theft Resource Center is a nonprofit organization that’s been assisting identity theft victims for two decades. Imposter fraud is nothing new, but it’s blown up in scale since the coronavirus outbreak, Velasquez said. Don’t miss: Expanded unemployment benefits: Who qualifies, how to apply Before the pandemic, the resource center’s hotline typically received one or two calls a month from victims complaining someone else swiped their unemployment benefits. In April and May, the hotline received approximately 50 monthly calls on the issue, Velasquez said. Cybercriminals are now using all the information they’ve stolen in data breaches through the years, she said. Can I still get my unemployment money even though someone else has been claiming it? Yes, according to Michele Evermore, senior policy analyst at the National Employment Law Project, an advocacy organization focused on workers’ rights. Scammers “are not going to be able to legally drain your eligibility,” she said. That goes for the state unemployment money, and the extra $600 in weekly pay under the Pandemic Unemployment Assistance program. “ ‘In the scheme of things, fraud detection is one of the things unemployment insurance agencies are stronger at dealing with.’ ” — Michele Evermore, National Employment Law Project senior policy analyst “In the scheme of things, fraud detection is one of the things unemployment insurance agencies are stronger at dealing with,” Evermore said. “Over the past decade, states have focused on overpayment to the detriment of getting payments out.” The pandemic has spotlighted the lag on payments. State labor agencies have been coping with a massive and sudden rise in jobless claims since the coronavirus outbreak, and that’s gummed up the payment process for many people. If money suddenly pops up in the bank account of someone who didn’t apply for the benefits, report the windfall to your state’s labor agency and ask how to safely return the money. Never reply to any call, email or text message instructing you to wire the money somewhere or put it on a gift card, the FTC said. What do I have to do to get my money? And when will I get it? One immediate step is reporting the fraud to your state unemployment agency. Every state will have different rules on how to report fraud, and whether an employer also needs to report the matter, the FTC says. This website can help residents find the state labor agency to report the fraud. If a scammer is getting unemployment money, it means they have information including a person’s date of birth and their Social Security number, the FTC noted. “ The FTC says scammers getting someone else’s unemployment money have their birth date and Social Security number. ” There’s a lot someone can do with that. A cybercriminal could fraudulent seek food stamps, medical coverage or other benefits in a person’s name, the Identity Theft Resource Center said. “If there are any issues involving those services and someone’s identity, people should contact those agencies immediately,” the center wrote in a blog post. The FTC also has a website where identity theft victims can file a complaint and follow a guide on how to issue a fraud alert on their credit, freeze their credit report and close any wrongly-opened accounts. An identity theft victim applying for benefits doesn’t need to the start all over with their claim, Evermore said. Still, the verification process may take several weeks, she noted. In fact, some totally blameless benefit recipients may see a hold in their benefits too as authorities look into a questionable claim, Evermore added. Online correspondence — instead of physically mailed forms — is the best way to quicken the verification process, experts say. E-mails or correspondence through a state labor department’s online portal is the “simplest and fastest way to clear things up,” Evermore said. “ ‘If there’s any conflicting information, that’s going to hold up the benefits. Just make sure everything is correct and matches.’ ” — Michele Evermore Take the time to make sure even the tiniest details are correct, right down to name spellings, she added. “If there’s any conflicting information, that’s going to hold up the benefits. Just make sure everything is correct and matches.” On the subject of being meticulous, Velasquez said it’s wise for victims to document all of their expenses and time spent correcting the problem. That’s in order to get paid now, and possibly in the future too. If any class-action lawsuits arise from the wave of imposter fraud, settlements could potentially ask class members to prove how they were harmed before they receive any payout, Velasquez said. This happened during the $700 million settlement last year over the 2017 Equifax EFX, +1.53% data breach. One provision of the settlement offered up to $20,000 for out-of-pocket losses. To get the money, people had to show expenses like the fees and incidental costs they paid to fix any fraud and the amount of time spent addressing the problem. The Identity Theft Resource Center’s app has a case log feature, Velasquez noted. “It’s always a great idea to keep track of that,” she said."}]}