{"article": [{"url": "https://www.marketwatch.com/story/analysts-worry-ginsburg-replacement-fight-will-take-congress-eye-off-ball-of-fiscal-aid-11600703920", "published": 1600755680.0, "headline": "Analysts worry Ginsburg replacement fight will take congressional eyes off the pandemic-relief ball", "body": "A small group of demonstrators protests outside the U.S. Capitol on Sept. 21, 2020 in Washington, D.C., as they marched from the home of Sen. Lindsey Graham (R-SC) to the court. (Photo: ALEX EDELMAN/AFP via Getty Images) Just what Congress needed: another big fight. Some analysts worry a Senate procedural brawl over nominating and confirming a replacement for Ruth Bader Ginsburg on the U.S. Supreme Court will take lawmakers’ attention away from already dicey fights over keeping the government open and approving more coronavirus aid. However, those deadlines are bearing down on Congress much faster than the need to confirm Ginsburg’s replacement. The government’s funding authority runs out on Sept. 30, and, without a stopgap bill to extend it, many federal agencies will shut down. There’s no deadline for approving a second large coronavirus aid package, but prior to Ginsburg’s death the assumed timeline on Capitol Hill was similar to the one for the so-called continuing resolution. Putting pressure on lawmakers is a threat by airlines that they will have to start mass layoffs in October without new help from Washington. Read: Airlines, restaurants on Pelosi’s radar for additional aid in another COVID-19 bill Still, with only six days left in session for the House and Senate before Sept. 30, anything that could take lawmakers’ minds off the stalled coronavirus talks and the continuing resolution will make it harder to reach those deals, analysts said. “We have been assuming another [$1 trillion or $1.5 trillion] fiscal package, so the current stalemate suggests downside risks,” wrote Jim O’Sullivan, chief U.S. macroeconomic strategist with TD Securities. “And while we expect a package eventually, the probability of no action until after the election has risen significantly,” he wrote. ” That was true even before the Supreme Court suddenly became an issue.” Chris Krueger, strategist with Cowen Washington Research Group, said the prospects for a stimulus package before the election now appeared very unlikely. “Another fiscal package was always likely before the midterms mainly because it is essentially just re-upping Phase 3 and adding a liability shield. This isn’t particularly tough policy and the framework hasn’t really changed since the Spring. The Supreme Court fight is likely to take all the oxygen on Capitol Hill through November,” he wrote in a client note. Larry Kudlow, director of the White House’s National Economic Council, downplayed the impact of the Supreme Court fight. Asked Monday if he expected it to make it harder for lawmakers to focus on another COVID-19 bill, he said, “It doesn’t have to.” House lawmakers were expected to unveil their stopgap spending bill Friday, but that was pushed to Monday. While analysts said a shutdown was still unlikely, getting the bill through the House and the Senate, the latter of which is scheduled now to be out of session Monday and Tuesday, in time to avoid a shutdown Thursday depends on there emerging no procedural hiccups. Failing to get a stopgap bill done, though, would likely mean blowback for both parties. “I don’t think anybody wants to be responsible for shutting down the government on the eve of an election in the middle of a pandemic,” said Rep. Tom Cole, an Oklahoma Republican, last week. Read more: One way to end coronavirus aid standoff? Add parts of a deal to stopgap funding bill"}]}