{"article": [{"url": "https://www.marketwatch.com/story/still-waiting-on-your-stimulus-check-read-this-before-registering-with-the-irs-to-get-your-money-11599684958", "published": 1599814640.0, "headline": "An estimated 9 million low-income Americans are eligible for stimulus checks but havenâ\u0080\u0099t gotten them yet", "body": "Some 9 million Americans may still be waiting on their stimulus checks. MARKETWATCH PHOTO ILLUSTRATION/ISTOCKPHOTO An estimated 9 million Americans who make less than $12,000 a year may be eligible for pandemic relief checks but havenâ\u0080\u0099t received them yet, and the clock is ticking if they want to get the money this year. They have until Oct. 15 to claim the payment by registering with the Internal Revenue Service. If they fail to meet the deadline, theyâ\u0080\u0099ll have to wait until 2021 to get the payment, according to the IRS.But these low-income Americans may want to think twice before registering to get the money, experts told MarketWatch. If they use the IRS portal to claim their stimulus payment now, they could be delayed in receiving an important federal benefit: the Earned Income Tax Credit. The IRS is mailing letters to the 9 million individuals starting on Sept. 24 outlining details about eligibility and information on how to claim their stimulus checks. â\u0080\u009cIf you were not required to file a 2019 federal income tax return, the best and fastest way to claim your Economic Impact Payment is to visit IRS.gov/eip by October 15,â\u0080\u009d the letter states. After Oct. 15, the only way to receive an unclaimed stimulus check is â\u0080\u009cto file a federal income tax return,â\u0080\u009d the letter states.Â Most Americans who got stimulus checks received the money either through a direct deposit into their bank accounts, or with a paper check in the mail. The IRS used address and bank account information it had on file from peopleâ\u0080\u0099s tax returns. But Americans who earn under $12,200 a year arenâ\u0080\u0099t required to file federal income tax returns, according to the IRS. Thatâ\u0080\u0099s made it more difficult for the IRS, the agency responsible for distributing stimulus checks, to get stimulus checks to these individuals. “ Unlike the majority of Americans who received their stimulus checks automatically, the estimated 9 million Americans who have yet to receive their stimulus checks are mostly earning under $12,000 a year and typically donâ\u0080\u0099t file federal income tax returns. ” â\u0080\u009cPeople who normally donâ\u0080\u0099t file a tax return shouldnâ\u0080\u0099t wait to see if they receive one of these letters,â\u0080\u009d IRS Commissioner Chuck Rettig said in a statement on Sept. 8. â\u0080\u009cThey can review the guidelines and register now if theyâ\u0080\u0099re eligible.â\u0080\u009d But thereâ\u0080\u0099s a significant catch: The letter the IRS will be sending out â\u0080\u009cfails to provide other options to taxpayers such as a mail-in form as an alternative to using the online portal,â\u0080\u009d said Nancy Rossner, a senior staff attorney at the Community Tax Law Project. Thatâ\u0080\u0099s important because â\u0080\u009cusing the portal essentially acts like filing an electronic return, and so it prevents that taxpayer from actually being able to file electronically for 2019 if they have first used the portal.â\u0080\u009d “ â\u0080\u0098Taxpayers who use the portal to claim their stimulus checks will need to file a paper return to claim the EITC which may take several weeks if not months to process as the IRS is still trying to catch up on its backlog of mail.â\u0080\u0099 ” â\u0080\u0094 Nancy Rossner, a senior staff attorney at the Community Tax Law Project â\u0080\u009cThis is especially detrimental to taxpayers who may be eligible to claim the Earned Income Tax Credit,â\u0080\u009d she said. The EITC is a benefit available to low and moderate-income taxpayers who could be eligible for up to a $6,557 tax refund for 2019 with three or more qualifying children, according to the IRS. While people who make under $12,000 arenâ\u0080\u0099t required to file a tax return to pay taxes, they do need to file one if they want to claim the Earned Income Tax Credit. â\u0080\u009cTaxpayers who use the portal to claim their stimulus checks will need to file a paper return to claim the EITC which may take several weeks if not months to process as the IRS is still trying to catch up on its backlog of mail,â\u0080\u009d Rossner told MarketWatch.Â (The IRS did not respond to MarketWatchâ\u0080\u0099s request for a comment.) She recommends that people who qualify for the EITC consult with a tax professional who can give quick advice on whether to use the portal to claim their stimulus check more quickly or file their 2019 tax return, which would trigger the stimulus check payment and the EITC refund.Â Also see: Should I have gotten my stimulus check by now? Why some people are still waiting â\u0080\u0094 and what to do about it Prior to the coronavirus pandemic, low-income Americans had access to free in-person tax prep assistance from Volunteer Income Tax Assistance and Tax Counseling for the Elderly, both of which are federally funded programs. However, many of the offices for those programs have closed or are operating with limited capabilities due to the COVID-19 pandemic, Rossner said, â\u0080\u009c[I]t has created a perfect storm challenging low-income Americansâ\u0080\u0099 ability to access their stimulus checks which they are rightfully entitled to.â\u0080\u009d Organizations like the Community Tax Law Project can help Americans figure out which option is best for them, Rossner said.Â Why are so many Americans are still waiting for stimulus checks?Â So far, the IRS has distributed checks to more than 160 million Americans as part of the $2 trillion CARES Act stimulus package. The payments amount to $1,200 for individuals who earn up to $75,000. Married couples earning under $150,000 received $2,400.Â â\u0080\u009cThe problem is that the program was structured as a tax refund, so the IRS needs people to file a tax return, but people who do not normally file returns donâ\u0080\u0099t realize that they need to,â\u0080\u009d said Lauren Saunders, associate director at the National Consumer Law Center, a nonprofit that advocates for consumersâ\u0080\u0099 rights on issues. “ â\u0080\u0098The problem is that the program was structured as a tax refund, so the IRS needs people to file a tax return, but people who do not normally file returns donâ\u0080\u0099t realize that they need to.â\u0080\u0099 ” â\u0080\u0094 Lauren Saunders, associate director at the National Consumer Law Center On top of this, â\u0080\u009cthe IRS does not readily have information available about people who donâ\u0080\u0099t file tax returns and donâ\u0080\u0099t receive federal benefits,â\u0080\u009d she added.Â â\u0080\u009cAnother factor is weâ\u0080\u0099ve seen a lot of taxpayers who have been claimed as dependents without their knowledge or their preparers made a mistake that is causing them not to get their payment or the full amount of it,â\u0080\u009d said Omeed Firouzi, a staff attorney at Philadelphia Legal Assistance, a free legal service providerâ\u0080\u0099s low-income tax clinic. Some people also may not be able to access their payment â\u0080\u009cbecause it went to a joint bank account they no longer have full access to anymore,â\u0080\u009d he added. See also: Domestic abusers are taking survivorsâ\u0080\u0099 stimulus checks â\u0080\u0094 and lawmakers want the IRS to do something about it Â It can be difficult to navigate obstacles to overcome these situations, Firouzi said. Getting help often involves filing amended returns, wrangling with the IRS, getting in touch with the Taxpayer Advocate Service (an independent organization within the IRS) â\u0080\u009cand waiting a long time for matters to resolve,â\u0080\u009d he said. â\u0080\u009cIt is unfortunate that the people who need the money the most need to jump through hoops and might miss out, but we donâ\u0080\u0099t have a national tracking system to find people,â\u0080\u009d Saunders said."}]}