{"article": [{"url": "https://www.marketwatch.com/story/frontline-workers-in-eye-of-pandemic-storm-for-months-now-fending-off-repo-man-11601587260", "published": 1601720060.0, "headline": "Frontline workers in eye of pandemic storm for months, now fending off repo man", "body": "A stack of hospital bills and about $7,000 in debt on a used 2013 Toyota Corolla were all that remained of his papá. In July, an immigrant laborer in Arkansas lost his father, who had been a poultry-plant worker, to COVID-19. The 30-year-old son also contracted the deadly disease, ended up hospitalized but survived. However, the illness cost him weeks of pay, while he battled for his life against the infection. Now, the man, who declined to use his name for this article for fear of potentially losing his job and jeopardizing his U.S. legal status, is back at work, in manufacturing near Springdale, Ark. He is one of an estimated 55 million essential workers on America’s frontlines, and he doesn’t know how long he can keep paying the loan on his dad’s Corolla at its 16% interest rate. “It’s all my dad left,” he told MarketWatch via an interpreter. “I can barely make the payment.” “It’s one of the issues that’s been compiling into a big crisis,” said Margarita Solorzano, executive director at the Hispanic Women’s Organization of Arkansas, a 20-year-old nonprofit in Springdale, which has provided emergency aid to families struggling to make car payments, keep up with rent and put food on the table, seven months into the the global viral outbreak. “Owning a car is a must,” she said. Springdale is an industrial hub tucked in the state’s northwest corner with about 81,000 residents. It also sits deep in the Ozarks, where many workers earn minimum wage and public transportation remains scarce. Hispanics make up nearly 40% of the town’s population, a far greater proportion than most any other part of the state. But in a lot of ways, Springdale also could be any town in America — where the toll of the worst public-health crisis in a century has hit Latinos, Blacks and other ethnic minorities the hardest. “A lot are considered essential workers,” Solorzano said of families in northwest Arkansas seeking aid from her group and others, which aim to help families hurt by the economic and public-health shocks of COVID-19, particularly where federal aid has fallen short. Several auto dealerships peppered throughout the town offered initial loan extensions to borrowers facing hardships, according to Solorzano, but so-called buy-here, pay-here subprime lenders often repossess vehicles quicker than other lenders. Then there’s the man who’s been making payments on his dad’s Toyota, even though he’s unsure he can claim title to the vehicle, since it’s not under his name. The dealer who sold the car to the family a few years ago hasn’t been helpful, he said. “Right now, they are close to paying for the car,” Solorzano said, adding that she’s been working with the son and his mother try to find ways to keep the car. “But since no one else is on the contract, they are wondering what will happen.” “ ‘People will go without food and the medicines they need to hold on to a car. ‘ ” — Rosemary Shahan Echos of ’08 Families often find out the hard way that auto debt can fall into an administrative morass similar to the one that ensnared millions of homeowners during the 2007-’08 financial crisis. Rosemary Shahan said paperwork problems, including delayed vehicle registrations and title woes, can leave unsuspecting buyers in the lurch down the road. It’s often those who relied on dealerships to take loans out on used vehicles, something Shahan, a consumer advocate who founded California-based nonprofit Consumers for Auto Reliability and Safety in the 1980s, never recommends. Those problems often get worse during downturns. Shahan pointed to a vicious cycle of predatory auto lending and repossessions that has been around for decades. “Now it’s on steroids,” she told MarketWatch. “People will go without food and the medicines they need to hold on to a car.”Low wages, high stakes Government studies show that essential workers have been coping with higher odds of contracting the virus and dying because of their jobs, but also with the fear they’ll bring it home to their families. Some of Springdale’s largest local employers are a school district, Tyson Foods TSN, -1.71%, which is based there, and retail giant Walmart WMT, +1.00%, founded about 40 years ago in the town of Rogers, which is just about 10 miles north. In the early months of the pandemic, COVID-19 ravaged U.S. meat and poultry plants, forcing many to temporarily close. That prompted a national food-shortage scare, compelling President Donald Trump to sign an executive order to keep workers on the line and meatpacking plants open. Workers outside a Queens, New York, supermarket after government in April orders slaughterhouses to stay open to secure the food supply. AFP via Getty Images Months later, COVID-19 continues to create gut-wrenching problems for poultry-plant workers in particular, said Albious Latior, an advocate for Springdale’s large Marshallese community. Marshallese are Pacific islanders who immigrated to Arkansas after the U.S. in the 1980s granted free travel and work privileges to citizens of the Marshall Islands. Many work in the poultry plants, earning starting wages of about $13 an hour, but often also pay up to 20% interest rates on marked-up used vehicles, which have gone through multiple cycles of repossessions with previous owners, Latior said. Even the hint of COVID-19 exposure can spell financial ruin. That’s partially because anyone suspected of exposure to the novel strain of coronavirus faces a two-week quarantine, which will restart if anyone else in a household has a similar scare on the job. Test results also have been known to take about 14 days, he said, which adds up to some workers going a month or longer before collecting any back pay. “I know of more than 30 families that got a car repossessed,” Latior told MarketWatch. “They can’t miss a car payment.” To help families get by, Latior helped raise nearly $50,000 in emergency funds through the nearby Good Shepherd Lutheran Church in Fayetteville. In August, Latior and the Rev. Clint Schnekloth went around to local car dealers to make auto payments in person and help Marshallese families get caught up on their loans. Albious Latior and the Rev. Clint Schnekloth make auto payments in August The Rev. Clint Schnekloth The relief, unlike the pandemic, has been short-lived. “On my list are almost 300 families asking for help with car payments,” Latior said. Tyson told MarketWatch it responded to the pandemic by boosting its support for workers, including by increasing short-term disability pay and medical benefits, as well as handing out a one-time $1,000 bonus to about 71% of its nearly 141,000 employees. It gave about another $6 million in personal hardship assistance. As part of its third-quarter earnings, Tyson disclosed that $114 million of “thank-you bonuses to frontline employees,” was offset partially by credits from the landmark $2 trillion Cares Act passed by Congress in March to help shore up households, businesses and cities during the pandemic. Walmart said it has given employees $1.1 billion in special bonuses this year and extended emergency leave. But Deeksha Gupta said government help hasn’t been targeted enough for many communities, particularly marginalized groups experiencing higher rates of coronavirus infections and deaths. While the Cares Act provided a temporary income windfall and forbearance protections for home loans with government backing, no similar relief has been granted on the auto front. “That’s one reason why collection practices are ongoing,” said Gupta, an assistant professor of finance at Carnegie Mellon University’s Tepper School of Business, who wrote a July working paper with Tetiana Davydiuk that found that low-income workers, particularly in Black communities with higher debt burdens, often couldn’t afford to reduce their mobility and stay at home during the pandemic.Auto debt haunts for life Also, unlike swaths of the mortgage market, auto loans typically are recourse, meaning a lender can sue a borrower and often garnish wages for any remaining defaulted loan balance — even after a car gets repossessed and a borrower owes more on a vehicle than it’s worth on paper. “The car was just bait,” Shahan, the consumer advocate, said of lenders using predatory practices. Already, the boom in subprime auto lending over the past decade had been a key concern among regulators focused on what sectors might fare the worst during the next downturn. But as far as scrutinizing subprime auto industry practices, it’s been states’ top legal officers leading the charge, including by extracting legal settlements from large and small lenders. That work continues. In August, the Massachusetts attorney general filed a lawsuit against Credit Acceptance Corp CACC, -0.73%, one of the nation’s largest subprime auto lenders. The AG claimed that Credit Acceptance knew “well over 50% of high-risk low-score borrowers would default, typically a little more than a year into their loans,” and also claimed the lender has engaged in unfair collection and repossession practices since at least 2013. Credit Acceptance disclosed in August that about 40 state attorneys general, including from Arkansas and the District of Columbia, have been investigating the company. It didn’t respond to a request for comment for this article.Wall Street’s role There were $250 billion of outstanding subprime auto loans that Wall Street packaged into bond deals and sold to investors at the end of 2019, or about 18.8% of all U.S. auto loans, according to the Federal Reserve Bank of Richmond. Proceeds from bond sales help lenders keep making new loans. Already this year, $21.6 billion of subprime auto bonds have been issued, according to Finsight data, which roughly is in line with annual issuance over recent years, despite it being the worst U.S. economic downturn since World War II. During the ’08 crisis, subprime auto loans largely held up as borrowers clung to their vehicles as a lifeline to a job. In recent months, subprime auto-bond loan delinquency rates have dipped below levels from a year prior, according to Goldman Sachs data. But that resilience largely has been attributed to one-time stimulus checks and $600 in extra weekly unemployment befits, which expired in July. “The longer Congress and the president delays in coming up with another relief package, the longer this pandemic-induced recession will be prolonged,” said Brian Marks, an economics and business analytics lecturer at the University of New Haven. What’s more, messy loan-document practices uncovered during the 2008 subprime mortgage crisis often led to a temporarily reprieve for many underwater homeowners who stopped paying their lenders, but continued to stay in their homes. The opposite has been the case in subprime auto finance, where a car with late payments or a title lien can be immobilized and repossessed, sometimes within hours of a missed payment. “I do believe the good news is going to end,” said Joseph Cioffi, chair of law firm Davis & Gilbert’s insolvency and creditor’s rights practice, of the strong performance of subprime auto loans so far during the pandemic. After all, COVID-19 led many car factories to temporary shut down production and consumers to race out and buy used cars to avoid public transportation. But that’s also meant lenders now have great incentive to swiftly repossess vehicles and refill their lots. “Subprime auto borrowers, right now, they are in a very vulnerable spot,” Cioffi said."}]}