{"article": [{"url": "https://www.marketwatch.com/story/on-a-fixed-income-here-are-some-ideas-to-save-money-2020-07-01", "published": 1594378460.0, "headline": "On a fixed income? Here are some ideas to save money", "body": "I’m always talking about Social Security and how it’s a life vest for tens of millions of Americans. But the average monthly benefit this year is just $1,503. And yet, notes the Washington Post, “forty percent of Americans over age 60 who are no longer working full time rely solely on Social Security for their income.” If you’re that average retiree, I don’t have to tell you how difficult it is to live on $1,503 a month, or $18,036 a year. Every dollar counts. Every single one. Divorce inspired this woman to learn about money and she retired early You’ve probably cut your expenses to the bone. Or have you? I’ve been gathering some ideas, that perhaps you haven’t thought of that could save a few bucks. In this column, I’ll focus on two areas: Your electric bill and your water bill. Slash your electric bill The U.S. Energy Information Administration (EIA) says the average monthly electric bill in the United States in 2018 was $117.65. That’s 8% of the average Social Security benefit! You’ve got all sorts of things plugged in right now. You might think that because the TV or coffee maker are turned off, they’re not using any electricity. Actually they are. These devices are called “energy vampires” because they drain electricity around the clock, whether they’re being used or not. “These phantom energy suckers can account for as much as 20% of your monthly electricity bill,” North Carolina-based Duke Energy, says. One-fifth of that average $117.65 electric bill is an extra $23.53 a month. Not huge, but again, if you’re on a fixed income, every dollar counts. What can you do? Some tips: Unplug things. I know you won’t do this for the clock radio you might have on your nightstand, but if you have devices that are used infrequently—maybe a TV in your bedroom that you watch only a little bit at night—yank the cord. Use “smart power” strips. These automatically cut off power when devices aren’t in use. Some devices, like computers, have built-in “sleep modes” that save energy when they’re idle. Fluorescent lightbulbs cost more up front, but can save energy and money over the long run.Cut your water bill The average monthly water bill in the U.S. is $70.39 a month, according to the Environmental Protection Agency (EPA). It says the typical family uses 300 gallons of water a day. That 70 bucks is nearly 5% of your monthly Social Security check. The Volusia County, Fla., water conservation department offers some money-saving tips: A typical shower uses up to 10 gallons of water a minute. Consider limiting your showers to the time it takes to soap up, wash down and rise off. Your toilet could be wasting thousands of gallons of water a month. Find out by putting a few drops of food coloring in the tank. If, without flushing, the coloring begins to appear in the bowl, you have a leak—and are literally flushing money away (though you’d have to balance fixing this against the cost of a plumber). Don’t run the water while shaving and brushing your teeth. Before brushing, fill a water glass to rinse. Before shaving, fill the sink with an inch or two of warm water in which to rinse your razor. Use your dishwasher and washing machines only when there’s a full load. And setting your washing machine to cold wash and rinse saves energy and gets your clothes just as clean. Plant trees and plants that thrive without water. And surround them with mulch, which slows evaporation. There are many more good ideas here. Exercise But you know the single biggest thing—by far—you can do to save money? Stay healthy. Keeping fit—both mentally and physically—for as long as you can will not only add more enjoyment to your life, but save incalculable amounts of money. Fidelity Investments estimated last year that a couple retiring at age 65 would have to spend—get this—$285,000 on health care over the rest of their lives. A single man can expect to spend $135,000, but a single woman, because of longer life expectancies—could spend $150,000. Fidelity has yet to offer a 2020 estimate, but you can be sure it’ll be higher. Coming back to what I said up top—that the average Social Security recipient currently gets $18,036 a year—it’s easy to see how big of a burden this will be. You don’t me to tell you that exercise is good for you. But I am here to tell you the cost of NOT exercising could be significant. Also: people think that doing the crossword puzzle is the way to keep your brain sharp. It helps, but you know what really helps? Exercise, because it increases the flow of oxygenated blood to your head. As usual, talk to a doctor about what’s best for you given your age and circumstances. I’m obviously just scratching the surface on money-saving ideas. In future columns, I’ll offer more. Meantime, tell me how YOU save money during these tough times; I may share your tips with fellow readers. Please write me at: RetireBetterMarketWatch@gmail.com."}]}