{"article": [{"url": "https://www.marketwatch.com/story/we-want-to-retire-somewhere-in-the-carolinas-whats-a-nice-area-11594223759", "published": 1601136500.0, "headline": "We want to retire somewhere in the Carolinas on $3,400 a month in Social Security â\u0080\u0094 whatâ\u0080\u0099s a nice area?", "body": "Downtown Hendersonville, N.C., has a small-town atmosphere. iStock Dear MarketWatch, My wife and I are both 57 and looking to retire at 62.Â We will get approximately $1,700 a month each from Social Security.Â We currently have approximately $750,000 in 401(k) and cash.Â Â We are looking to get out of New Jersey for obvious reasons. We are looking in both North Carolina and South Carolina to retire. We are not looking at areas near the shore. We do not need a lot to survive and live well within our means.Â Â Can you suggest some nice areas, with affordable housing, low crime and low taxes?Â Â Thank you, Jim Dear Jim, Congratulations for being on track for a comfortable retirement and starting to think about your dream retirement spot.Â Many areas in the Carolinas qualify as nice and affordable with low taxes and low crime, so you may want to spend more time thinking about what else youâ\u0080\u0099re looking for. Bigger city? Smaller town? And thatâ\u0080\u0099s just the start.Â On taxes: Note that Social Security is not taxed in North Carolina. South Carolina exempts the portion of Social Security benefits included in federal taxable income, so you should expect to pay some taxes. If this is a big concern, talk to a tax professional. South Carolina also relies more on property taxes to fund state and local government than North Carolina does, according to the nonprofit Tax Foundation. Of course, those taxes will vary by community and property. Read: There is more to picking a place to retire than low taxes â\u0080\u0094 avoid these 5 expensive mistakes You may want to ask about other costs as well. What will your air conditioning bill look like vs. what you pay in New Jersey? Whatâ\u0080\u0099s the cost of a pool, if the house you buy comes with one? Now read: This eye-opening experience has me rethinking how Social Security figures into my retirement planning Given that crime can vary by neighborhood or across a county, take the time to have a chat with the police department of communities that are on your short list. And as always, take the time to really explore an area, including when the weather isnâ\u0080\u0099t as ideal. A bad move is a costly mistake. .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 600px; margin-bottom: 5px; } .at16units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 600px; } body.at12units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 600px; } body .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body .header .wsj-interactive.generic-iframe-embed[name=\"\"], body.at8units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 600px; } body.at4units .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .header .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 600px; } With that being said, here are three suggestions for you:Hendersonville, North Carolina You can have easy access to Asheville but be away from the crowds by living in nearby Henderson County. About 115,000 people live in the county, including 14,000 in the county seat of Hendersonville, which offers a cute downtown and plenty of chains on the outskirts. An unexpected historical site just outside of Hendersonville is poet Carl Sandburgâ\u0080\u0099s house, now a national historic site. Youâ\u0080\u0099ll have plenty of natural beauty given that Hendersonville is at the edge of the Pisgah National Forest and between the Smoky Mountains and the Blue Ridge Mountains. With an elevation of 2,200 feet, snow should be light while summer temperatures peak at an average of 85 degrees in July. Median housing costs are slightly below the U.S. median. Using current listings on Realtor.com, which, like MarketWatch, is owned by News Corp., take a look at homes that are on the market right now. Now read: Curious about Winston-Salem? Greenville's Falls Park on the Reedy is a popular spot. iStock Greenville, South Carolina Go an hour south of Hendersonville and youâ\u0080\u0099ll reach Greenville, S.C. Itâ\u0080\u0099s popping up on many â\u0080\u009cbest placesâ\u0080\u009d lists, and if you donâ\u0080\u0099t want snow and can handle some humidity, it may be a fit. What makes this city of 70,000 so hot? US News & World Report cites a â\u0080\u009creinvigorated downtown,â\u0080\u009d and Money magazine notes that it is â\u0080\u009cone of the most diverse cities in South Carolinaâ\u0080\u009d. Livability.com says the local obsession is food, so foodies will appreciate that two restaurants were semi-finalists for James Beard awards this year. Furman University is in the top quartile of national liberal arts colleges, according to US News, and ranks fifth among â\u0080\u009cmost innovative schools.â\u0080\u009d Thereâ\u0080\u0099s natural beauty â\u0080\u0094 Falls Park on the Reedy gets lots of raves, and youâ\u0080\u0099re in the foothills of the Blue Ridge Mountains. Locals also praise the Swamp Rabbit Trail, aÂ 22-mile greenway for cyclists, joggers, walkers and more along the Reedy River. Sports fans can enjoy minor-league baseball and hockey. Curious what your money can buy? Here are the current listings on Realtor.com. Stepping back a bit, Greenville County has more than 500,00 residents. Next door, to the northeast, is Spartanburg County with more than 300,000 people. Clemson University is 40 minutes away in the opposite direction. You can read about Columbia, S.C., 90 minutes on the highway toward Charleston, here. Golfing at Pinehurst No. 9. Getty Images Pinehurst, North Carolina But maybe the foothills arenâ\u0080\u0099t your thing, and youâ\u0080\u0099re happy with even warmer temperatures. So I looked at this list of low-crime spots in North Carolina.Â Pinehurst tops the list. You may know it as the home of big-name golf tournaments, but 16,000 people live there and another 14,000 in neighboring Southern Pines (No. 10 on the list). Golf is certainly big here â\u0080\u0094 there are 40 courses within 20 miles. But be sure to check out Reservoir Park and its 95-acre lake as well as the Sandhills Horticultural Gardens. Youâ\u0080\u0099ll find plenty of fellow retirees here; in Pinehurst, more than 40% are 65 and older, and itâ\u0080\u0099s still an above-average 26% in Southern Pines. Weather-wise, the average high in July is 90 degrees. Median housing costs are above the national average, although they are low compared to New Jersey. Hereâ\u0080\u0099s whatâ\u0080\u0099s on the market now, again using listings on Realtor.com. This is a slightly more rural choice than Hendersonville; Moore County has about 100,000 residents. When you want to spend time somewhere busier, Fayetteville is an hour away to the east, Chapel Hill and Greensboro are about 90 minutes away, generally north, and Charlotte is two hours to the west. You can read about Chapel Hill and the Raleigh-Durham area here. Readers, whatâ\u0080\u0099s your best suggestion for Jim and his wife? Leave it in the comments section. Now read: We get $2,470 a month from Social Security and want a warm, friendly city near the ocean. Where should we retire?"}]}