{"article": [{"url": "https://www.marketwatch.com/story/trump-coronavirus-adviser-slammed-by-cdc-director-for-spreading-false-information-11601312715", "published": 1601299520.0, "headline": "President Trumpâ\u0080\u0099s new coronavirus adviser gets slammed by CDC director for spreading false information", "body": "Dr. Scott Atlas Joshua Roberts/Getty Images “ â\u0080\u0098Everything he says is false.â\u0080\u0099 ” Thatâ\u0080\u0099s Robert Redfield, the director of the Centers for Disease Control and Prevention, reportedly criticizing Scott Atlas, a new member of the White House coronavirus task force, for arming President Trump with misleading information. Redfield was overheard by NBC News on a phone call flying from Atlanta to Washington. He confirmed that he was talking about Atlas, who was added to the White House team in August as a neuroradiologist with no background in infectious diseases or public health. Some of the issues Redfield has a problem with, according to the report, include the efficacy of masks, whether young people are susceptible to the virus and the benefits of herd immunity. As this tweet TWTR, -0.23% shows, Redfield isnâ\u0080\u0099t the only one calling out Atlas, who was a frequent guest on Fox News before he was added to the task force: iframe.twitter-tweet { width: 100% !important; } Earlier this month, Redfield testified to Congress that he suspects that a mask could protect him from COVID-19 better than any future vaccine. â\u0080\u009cIf every one of us did it, this pandemic would be over in eight to 12 weeks,â\u0080\u009d he said, adding that â\u0080\u009cweâ\u0080\u0099re nowhere near the end,â\u0080\u009d which contradicted the presidentâ\u0080\u0099s view that the country is â\u0080\u009crounding the cornerâ\u0080\u009d on the coronavirus pandemic. In a statement provided to NBC News, Atlas defended himself, explaining â\u0080\u009ceverything I have said is directly from the data and the science. It echoes what is said by many of the top medical scientists in the world, including those at Stanford, Harvard, and Oxford.â\u0080\u009d"}]}