{"article": [{"url": "https://www.marketwatch.com/story/tech-has-been-a-pandemic-savior-for-the-market-and-has-been-richly-rewarded-so-what-happens-now-11595260647", "published": 1595322740.0, "headline": "Tech has been a pandemic savior for the market and has been richly rewarded. So what happens now?", "body": "The tech industry worked for years to build a world in which everyone worked remotely, tied together by services and computer power delivered through the cloud. When the COVID-19 pandemic suddenly created that world, tech was ready. Zoom Video Communications Inc. ZM scaled from hosting about 10 million meeting participants a day to 300 million, adding online happy hours and Taco Tuesday streams with grandparents to the business meetings for which it was known before the pandemic. Netflix Inc. NFLX, +1.43% added more than 25 million customers in a few months, and pushed out fresh content like “Tiger King” to keep customers entertained while they were stuck at home. Amazon.com Inc. AMZN, +3.01% leveraged a giant infrastructure network it had spent years building to ship needed goods to customers’ homes and offer companies cloud-computing power necessary to scale their own services. Even as their own employees dealt with extreme conditions and users pushed the boundaries of their internet connections, tech companies were able to keep their services up and running and service a nation that needed them more than ever. “We went from a country that did business one way and basically overnight flipped a switch to do it another way, and we had the infrastructure to make that transition without a lot of breakage because of the vision of some really impressive people and companies,” said Brendan Connaughton, the founder and managing partner of Catalyst Private Wealth in San Francisco. Tech companies have been richly rewarded for those efforts by investors, who have pushed the Nasdaq Composite Index COMP, +1.39% to record highs in hopes of finding something resembling safety in insecure economic times. Zoom’s valuation has more than tripled in 2020 to top $70 billion, while Netflix and Amazon gained more than 60%, putting Amazon back atop a $1 trillion market cap. The question for investors and the tech industry is what happens next: Can tech companies continue to show the type of earnings and usage growth that would justify those valuations as the pandemic continues, or was it just a surge of demand that would have arrived later? Netflix kicked off tech’s earnings season Thursday and may have given a preview of what’s in store: After Netflix executives admitted that huge growth in the first half of the year likely means a slowdown in the second half, and that original content scheduled for early next year will likely be delayed due to production shutdowns, shares plunged and wiped out $15 billion of the company’s valuation in a single trading session Friday. Full earnings season preview: Profit set to plunge as the coronavirus batters all sectors MarketWatch recently spoke with four experts — an independent investment analyst and sell-side financial analyst focused on tech, a financial adviser to high-net-worth individuals and an independent tech analyst — for insight into where the tech industry could be headed as COVID-19 wreaks havoc in the U.S. Here is what they expect moving forward.Strong second-quarter results expected Early indications suggest that tech companies did well in the second quarter, after first-quarter results for most companies contained only a couple of weeks of the shelter-in-place orders. IDC and Gartner reported a very strong quarter for personal-computer shipments, as PC manufacturers refilled retail pipelines that were drained by the initial rush to purchase laptops for at-home workers. Software companies are expected to show results of businesses looking for ways to keep employees connected and operating. “This coming quarter is going to be a ‘bright light’ quarter for a lot of companies,” predicted Maribel Lopez, founder and principal analyst of Lopez Research. And a lack of big earnings or revenue growth may not even matter at this point in the cycle, Wedbush analyst Dan Ives said. “When you have a once-in-a-hundred-years pandemic, investors are basically writing off earnings unless they’re dramatically different one way or the other that changes the fundamental story for the long term,” Ives said. “Unless there’s a silver-bullet business market trajectory change that changes the long-term focus right now, the haters could hate but the path for tech continues to be up and to the right through and after this earnings season.” That is especially true for companies dedicated to the cloud, which has proved to be a saving grace in the pandemic. All the analysts noted that many investors who have jumped into cloud-related stocks are likely in it for the long haul and expecting even more gains. “We’re gonna see cloud become something that is unfathomable,” said Beth Kindig, an investment analyst with a paid newsletter who sometimes writes for MarketWatch on tech stocks. Kindig: ‘Moats’ will make all the difference for cloud companies Currently, analysts expect sales in the S&P 500’s SPX, +0.87% information-technology sector XLK, +1.52% are expected to decline about 0.6% year-over-year while earnings are expected to drop 9.2%–behind only the health care XLV, +0.90%, financials XLF, +0.11% and utilities sectors XLU, -0.01% in both respects. Catalyst Private Wealth’s Connaughton — who advises many Bay Area tech executives on financial issues — said performance would be even better if some big tech names, including Amazon, weren’t moved out of the tech sector in recent years. “Technology will probably surprise on the upside, consumer-connected sectors will probably surprise on the downside,” Connaughton predicted.Third quarter may be a different story Lopez, who advises tech companies, suggested that the big spending spree of the first and second quarters may not continue in the summer as companies pause spending to assess. In her telling, companies spent fast and furious at the end of the first quarter and through the second quarter to find a stasis point, and now are going to take time to fashion a long-term plan that will lead to spending in the fourth quarter and into 2021. “The first wave of business demand we have gone through,” Lopez said. “The second wave will start when [executives] officially…figure out what their at-work populace is going to look like…and give employees a full work-from-home package.” Read also: An obscure court ruling could play havoc with tech companies’ earnings That scenario in the enterprise space could play out for consumers as well. Those who still have a job have settled into their new routine and made the tech and subscription purchases they need to get by in the near term, and the typical impetus for spending in the quarter — back-to-school spending — may not happen if kids wind up staying home for remote learning. Also, tech gadgets like smartphones are a big question mark, as consumers could see other purchases — including PCs — being more useful as they stay at home. That dynamic is going to make forecasting third-quarter results difficult. “Right now, guidance for the third quarter is playing a game of blindfolded darts,” Ives said. Executives are likely to punt instead of offer hard numbers, as most did in the second quarter, when exact guidance figures were few and far between. Instead, Connaughton expects to hear more specific plans from officials for where they expect to spend money in the future, and what that communicates about the future. That information will guide investment decisions throughout the quarter and the rest of the year as investors determine the best long-term plays, he said. “This earnings season is almost a reset, we all have to go back to the beginning, to an understanding of how their business is going to change.”Back to winners and losers With that dynamic, it is likely that the broad-based gains in tech stocks that happened in the second quarter is likely to go away, and some of the boats that rose along with the tide could start sinking lower. “Right now every boat has come off the bottom, [but] to go to the next level you actually have to outperform,” Connaughton said. Investors are likely to focus on the segments within tech that will continue to show solid growth no matter how long the pandemic lasts, and potentially move away from legacy hardware companies especially. “HPE HPE, -1.80%, IBM IBM, -2.81%, Cisco CSCO, +0.15%, ultimately they’re on the wrong side of the spending trends,” Ives said. “The COVID-19 environment accelerated cloud, cybersecurity, streaming, e-commerce — that benefits only a handful of public companies,” Ives said. Kindig pointed out that any company basing results on the online-advertising market could be high-risk due to the uncertainty of that market in the short term, as well as the volatility that appears inherent to the ad-tech industry. Also, she pointed to content-delivery networks such as Akamai Technologies Inc. AKAM, +1.30%, Fastly Inc. FSLY, +9.38% and Cloudflare Inc. NET, +6.77% — which help to handle the increased volume of internet traffic — as “the one coronavirus trade that I feel fairly confident is temporary.” All four experts with whom MarketWatch spoke pointed to the semiconductor sector as one of the most important and interesting to watch in this earnings season, after a quarter in which Nvidia Corp. NVDA, -0.54% passed chip behemoth Intel Corp. INTC, -1.03% in market cap as Intel takes hits from rival Advanced Micro Devices Inc. AMD, -3.94% Connaughton said his research showed a strong lead correlation to the entire market through the semiconductor sector. “We’re thinking that the semiconductor companies have really turned into…an early-cycle indicator,” he said, comparing them to the way transportation stocks were once seen as a harbinger of market moves. “If you can get the semis right, you’re gonna get the market call right about 70% of the time.”The big guys are going to be just fine Another nearly unanimous opinion was that Big Tech should be a popular destination for investment, especially Microsoft Corp. MSFT, +2.48% and Amazon. Questions about smartphone demand makes Apple a little more questionable, and ad demand at Alphabet Inc. GOOGL, +1.82% GOOG, +1.97% and Facebook Inc. FB, +0.26% are worrisome, but the companies’ dominant positions in different tech marketplaces are expected to buttress them. “We think FAANG names go 20-30% higher over the next two months,” Ives said. Those companies aren’t just dominant when it comes to consumers, though. Lopez pointed out that many of the chip and hardware companies that sell large tech equipment are just as reliant — if not moreso — on Big Tech as consumers for their cloud-computing build out. There are only a few so-called hyperscalers that create demand for components such as servers, storage and expensive chips, and their purchasing whims could determine the path of the tech ecosystem in the coming months. “A lot of the money in enterprise has shifted to those who build cloud, they control the industry now,” she said. And if the other companies don’t live up to what big cloud providers like Amazon, Microsoft and Google need, they may just leave them in the dust. “If they don’t see things moving fast enough with the product guys, they’ll do it themselves,” she said. “The balance of power has shifted, especially in the last six months.” Those dynamics are expected to show up in these results and third-quarter results later in the year, which will show up in the stock market. “There are good management teams and bad management teams, companies that are executing well and executing poorly, and their financial results will start to represent the good management and the bad management,” Connaughton said. “It will get us back to normalcy.”"}]}