{"article": [{"url": "https://www.marketwatch.com/story/fly-lands-on-mike-pences-head-and-threatens-to-become-vice-presidential-debates-breakout-star-2020-10-08", "published": 1602117140.0, "headline": "Fly lands on Mike Penceâ\u0080\u0099s head and threatens to become vice-presidential debateâ\u0080\u0099s breakout star", "body": "WASHINGTON (AP) â\u0080\u0094 The vice-presidential debate featured plexiglass barriers to prevent the spread of the coronavirus. They were no match for the nightâ\u0080\u0099s most talked-about intruder â\u0080\u0094 a fly that briefly buzzed around the stage before landing and settling in on Mike Penceâ\u0080\u0099s head. The incident went unmentioned onstage, with the Republican vice president and Democratic Sen. Kamala Harris continuing to focus on the discussion of systemic racism in the justice system. The Margin:Why Sen. Kamala Harrisâ\u0080\u0099s telling Vice President Mike Pence, â\u0080\u0098I am speaking,â\u0080\u0099 is resonating with so many women But as the insect took up residence on Penceâ\u0080\u0099s white hair, the social-media firestorm was creating more, well, buzz than nearly anything else that occurred. â\u0080\u009cThatâ\u0080\u0099s not on your TV. Itâ\u0080\u0099s on his head,â\u0080\u009d tweeted MSNBCâ\u0080\u0099s Rachel Maddow. â\u0080\u009cThe fly knows,â\u0080\u009d tweeted author Stephen King. Others joked about the creature perhaps getting stuck in hair spray â\u0080\u0094 or possibly now being a prime candidate for coronavirus testing. Democratic presidential nominee Joe Biden immediately got in on the act, tweeting a photo of himself clutching an orange fly swatter under the heading â\u0080\u009cPitch in $5 to help this campaign fly.â\u0080\u009d Moments later, he tweeted again, this time highlighting â\u0080\u009cFlywillvote.com,â\u0080\u009d which took users to a website set up for his campaign to help supporters make plans to vote. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Pence had spent much of the night shaking his head in response to Harrisâ\u0080\u0099s answers. But the vice president didnâ\u0080\u0099t appear to notice the flyâ\u0080\u0099s arrival. Despite his talking and normal body movements, the hot stage lights and those virus-fighting barriers, the fly was unperturbed. It finally flew away on its own. Wednesday nightâ\u0080\u0099s visitor wasnâ\u0080\u0099t the first fly to take center stage at a presidential debate. In 2016, one briefly landed between Democratic nominee Hillary Clintonâ\u0080\u0099s eyes during a town-hall-style debate with Donald Trump. Clinton didnâ\u0080\u0099t flinch. President Barack Obama, in contrast, took action when confronted with an airborne distraction during the taping of a television interview in 2009. Obama stopped speaking to swat at a buzzing fly and tell it to â\u0080\u009cget out of here.â\u0080\u009d As interviewer John Harwood quipped, â\u0080\u009cThatâ\u0080\u0099s the most persistent fly Iâ\u0080\u0099ve ever seen,â\u0080\u009d Obama concentrated on its path and caught it in midair. Read on:Debate turns green: Pence refuses to say whether climate change is a threat, while vice-presidential rival Harris evades on Green New Deal"}]}