{"article": [{"url": "https://www.marketwatch.com/story/gilead-reaches-21-billion-deal-for-immunomedics-2020-09-13", "published": 1600015100.0, "headline": "Gilead reaches $21 billion deal for Immunomedics", "body": "Gilead Sciences Inc. will pay $21 billion to buy biotech Immunomedics Inc. and its prized breast-cancer drug, the company said Sunday, a sign of the value of the cancer-drugs business. Immunomedics has a market value of roughly $10 billion following a recent surge in its stock, meaning that Gilead is paying up to secure ownership of the company. Gilead agreed to pay $88 a share in cash for Immunomedics, whose shares closed at $42.25 Friday. That represents a 108% premium. The Wall Street Journal first reported Saturday that Gilead and Immunomedics were nearing a more than $20 billion deal. The deal will help Gilead accelerate its efforts to diversify into cancer, Chief Executive Daniel O'Day said. \"It's allowing us to fast forward the work we've done over the past several years in developing a true franchise and portfolio in cancer, and it's really not complete until you have a marketed product,\" he said in an interview. Immunomedics, based in Morris Plains, N.J., sells breast-cancer drug Trodelvy, which would be attractive to several large drugmakers, many of which have set their sights on adding more fast-growing oncology therapies to their portfolios. Breast-cancer treatment is one of the most lucrative segments of the world-wide cancer-drugs market, which EvaluatePharma pegs at $157 billion this year. The market has become among the most precious in pharmaceuticals, because advances in understanding the disease have opened up new opportunities for drugmakers to find treatments that can help patients, and the therapies can command high prices. As a result, the biggest drugmakers including AstraZeneca PLC, Pfizer Inc. and GlaxoSmithKline PLC have moved to establish beachheads in cancer treatment, creating a heavily contested battleground with stalwarts Novartis AG and Roche Holding AG. The desirability of cancer treatments, especially those like Trodelvy that have already passed muster with regulators, has sent premiums soaring. Trodelvy is among the brightest cancer-drug prospects, showing signs of success in treating lung and other cancers, too. At a medical conference this coming week, Immunomedics is expected to present data on Trodelvy's performance against bladder cancer. The therapy could ring up $3 billion to $5 billion a year in annual sales if it proves to work safely against other cancers, Jefferies & Co. analyst Michael Yee said in a note to investors. Though Gilead is paying a big premium, \"we would favor a deal as it adds a blockbuster cancer drug and builds a significant commercial and R&D oncology biz,\" Mr. Yee wrote. In April, Trodelvy was approved in the U.S. to treat a form of the disease that has spread to other parts of the body and is known as triple-negative breast cancer. Triple-negative breast cancer is an especially aggressive form of the disease that pharmaceutical companies have struggled to treat because it lacks the molecular targets that drugs can home in on. It accounts for 10% to 15% of breast cancers, according to the American Cancer Society. Discussions between Gilead and Immunomedics were initially centered around a partnership before shifting to a full-fledged takeover negotiation as other suitors expressed interest, people familiar with the matter said. Gilead, an antiviral-drug leader, has been seeking for years to increase its portfolio of therapies for other diseases. An acquisition would give the company a foothold in the fast-growing cancer drug market, allowing it to build up its commercial infrastructure for selling a wider portfolio of therapies. And Gilead doesn't take on any risk that regulators won't approve the drug, since they already have done it. The Foster City, Calif., company is best known for its blockbuster hepatitis C offerings and HIV therapies. Most recently, Gilead has drawn notice for Covid-19 drug remdesivir, which the U.S. authorized for use in July and is expected to significantly boost the company's revenue this year. Cancer drugs, however, promise to provide Gilead a more enduring business that could help the company offset declining sales of its hepatitis C drugs and competition for its HIV franchise. Mr. O'Day, who took the helm in March 2019, has since been inking deals designed to bolster the company's portfolio. Up to now, Gilead has focused its firepower on drugs still in development. In 2019, it spent more than $5 billion deepening a partnership with Belgian biotech firm Galapagos NV. Earlier this year, it paid about $5 billion for biotech company Forty Seven Inc. and its blood-cancer drug. And in June, it spent $275 million for a nearly 50% stake in another company focused on cancer treatments, privately held Pionyr Immunotherapeutics Inc. \"We have done more than 13 deals in oncology over the past two years,\" Mr. O'Day said. Trodelvy \"really is a foundation product for us.\" Trodelvy belongs to a relatively new class of cancer agents called antibody drug conjugates. These drugs consist of an antibody that hunts down cancer cells and carries payloads of chemotherapy that is deployed to destroy the tumor target. In 2017, Immunomedics had planned to sell the rights to the drug to biotech Seattle Genetics Inc., which specializes in antibody drug conjugates. But activist investor venBio Select Advisor LLC, which then had a large stake in Immunomedics, stepped in and blocked the deal, saying it wasn't in investor interests. The husband-and-wife team that ran Immunomedics resigned from the company and the activist, now called Avoro Capital Advisors, gained representation on the company's board. Avoro's Behzad Aghazadeh remains Immunomedics' chairman and Avoro owns a roughly 11% stake in the company, according to FactSet. The company's history has been up and down since that battle. In 2019, the FDA postponed approval of Trodelvy, which Immunomedics said stemmed from chemistry and manufacturing issues. An FDA inspection found testing and record-keeping problems at the company's plant. Immunomedics' share price is up 99% so far this year. Trodelvy rang up $20.1 million in net sales in its first two months on the market, which Jefferies analysts said indicated the drug could become a go-to treatment for triple-negative breast cancer. In 2022, Jefferies estimates, Trodelvy sales will reach $480 million. Trodelvy could generate even more sales if trials under way find it works against other cancers, including another form of breast cancer known as HER2-negative and non-small cell lung cancer. The companies expect the deal to close by year-end. Write to Cara Lombardo at cara.lombardo@wsj.com and Jonathan D. Rockoff at Jonathan.Rockoff@wsj.com"}]}