{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-pull-back-from-2000-mark-as-dollars-skid-abates-2020-08-19", "published": 1597846220.0, "headline": "Gold prices end lower, decline more than 2% as dollarâ\u0080\u0099s skid abates; copper books highest settlement since 2018s", "body": "Gold prices settled sharply lower Wednesday, ending a two-day string of gains, as the U.S. dollar halted its skid and as commodity investors watched for minutes from the Federal Reserveâ\u0080\u0099s July policy meeting, which could provide further insights on the central bankerâ\u0080\u0099s outlook for the U.S. and global business. Market participants will also watch for any announcements on new measures the central bank may employ to alleviate economic harm caused by the pandemic. Minutes from the Fed are due at 2 p.m. Eastern Time, a half-hour after metals settle on Comex. U.S. lawmakers, meanwhile, were also trying to reignite stalled talks that could see a smaller coronavirus relief package released. Fed policy makers have persistently warned of limits to their ability to prop up the economy and financial markets and have encouraged Congress to provide more fiscal stimulus to extend the recovery from COVID-19. â\u0080\u009cFinancial markets will likely expect the Fed will be disappointed the latest fiscal stimulus deal seems to be dwindling and that raise the bar for extra support,â\u0080\u009d wrote Edward Moya, senior market analyst at Oanda, in a note. Gold has mostly prospered in an environment of easy-money policies and uncertainty generated by the global viral outbreak. December gold GCZ20, +2.17% GC00, +2.17% was of $42.80, or 2.1%, to settle at $1,970.30 an ounce, following a 0.7% gain for the precious metal in the previous session. Meanwhile, September silver prices US:SIU20 retreated shed 73.5 cents, or 2.6%, to end at $27.340 an ounce after goldâ\u0080\u0099s sister metal rose 1.5% on Tuesday. Moves for metals on the day come as the dollarâ\u0080\u0099s softening to a fresh two-year low on Tuesday has abated somewhat. The buck was up 0.5% at 92.697, as gauged by the ICE U.S. Dollar Index DXY, -0.58%, a measure of the dollar against a half-dozen currencies. In other metals trade, September copper US:HGU20 added 4.8 cents, or 1.6%, to settle at $3.023 a pound, marking its highest settlement since 2018, according to Dow Jones Market Data. October platinum PLV20, +3.99% lost $19.10, or 2%, to end at $956.30 an ounce, while September palladium US:PAU20 shed $49.20, or 2.2%, to settle at $2,179.10 an ounce."}]}