{"article": [{"url": "https://www.marketwatch.com/story/living-in-retirement-during-covid-19-how-to-keep-your-cool-2020-07-06", "published": 1594034600.0, "headline": "Living in retirement during COVID-19? How to keep your cool", "body": "Sudden and steep declines in the stock market are unsettling for all investors, but they may be especially worrisome for retirees and those nearing retirement. The former may wonder if they will have enough money to live on without making painful changes to their lifestyle. The latter may conclude they have to keep working longer to afford retirement. When markets are volatile, it’s normal to feel anxiety or the need to take action. You might be asking yourself, “Is my financial strategy still OK?” Although we can’t predict when the volatility will end, those approaching and living in retirement who take the time to review their financial strategies, and calmly put the selloff in perspective, may find that they are in better shape than they previously thought. How Annuities Could Protect Your Retirement Income Keeping it in context What caused the decline was unexpected, but market declines, in general, are not. While media headlines tend to focus on stocks, the vast majority of investors have portfolios that hold a mix of stocks, bonds and cash. Cash didn’t lose its value in March. Some bonds lost ground, while others rallied. The upshot: historically, a portfolio of 65% stocks and 35% bonds has fallen less than the Dow DJIA, +0.56% during market declines The stock selloff in March was jarring, but hardly unprecedented. In fact, the market has a 20% decline about once every four years on average, which means you could live through five to 10 such events in the course of your retirement. Additionally, while we know past performance is no guarantee of the future, we also know that every decline thus far has been followed by an eventual recovery. While we cannot control the market or the current environment, there are reasons for optimism. Stocks fell as the economy shut down given uncertainty about the extent of the disease and the effect on the economy. As we see progress that the pandemic is subsiding and states slowly open their doors, we expect the economy and the markets should regain their footing. There is one more silver lining here you may not have considered. The change in peoples’ spending habits over the past several months while staying home, such as adjusting their spending, can play a major role in ensuring their money lasts as long as they need it in retirement. Time to reassess If the turbulent market has you unsettled, take the opportunity to review your financial strategy and see where you stand. The first item on your checklist should be reviewing your overarching goals and comfort with risk. Often times, market declines can tempt individuals to make drastic changes to their strategy, so before you make any adjustments, take a step back and see if anything has changed with your goals. You can then work with your financial adviser to understand the effects that any change you make could have on your long-term goals. Next, it’s important to review your mix of assets, with the understanding that each investment should serve a purpose in providing for your income needs, both now and in the future. We recommend that those living in retirement have enough cash to cover a year of living expenses from their portfolio and enough in CDs and short-term fixed income to cover three to five years. That diversification can help cushion the blow from a market selloff, may keep you from having to sell stocks at depressed levels.* Stocks are there to provide growth for your income needs in the future. Other items worth reviewing are your withdrawal rate and reliance rate. The withdrawal rate refers to how much you take out from your portfolio on a regular basis. Reviewing your spending habits also makes sense. If a market decline proves fleeting you may not need to change anything at all. If the drop is steeper or longer, an adjustment might be appropriate. The reliance rate tells you how much you are counting on income from your portfolio as opposed to other sources such as Social Security and pensions. For example, if you need $60,000 in income each year, and $40,000 is coming from your portfolio, your reliance rate is 66%. The higher the rate, the more sensitive your strategy could be to market fluctuations. If your risk tolerance is lower you might want to consider other solutions such as annuities, which provide a more predictable source of income. For those who are not yet claiming Social Security, delaying Social Security can also be a way to help lower your reliance on your portfolio. Reviewing your spending habits also makes sense. While you can’t control what the markets will do, you do have control over what you spend. Again, you may find that you are in solid shape. Finally, this might be a good time to rebalance your portfolio if your asset mix has deviated from your long-term strategy. Buying more stocks in a down market may feel counterintuitive, but you may benefit from having purchased shares at lower prices when the market rallies. Focus on what you can control Great investors always have a long time horizon and focus on what they can control. The same approach works for the rest of us. Thanks to healthier lifestyles and better medical care, retirement can last two or three decades today. That means retirees need to focus on what works over the long haul and not get overly distracted by what is happening now, even when the news is unnerving. Importantly, working with a financial adviser can help maintain this focus. He or she can let you know if you need to make any changes or if not, give you added confidence that you are on the right track, and potentially better off than you may have realized. *Diversification does not ensure a profit or protect against loss in a declining market. Past performance of the markets is not a guarantee of how they will perform in the future. Investing in equities involves risks. The value of shares will fluctuate and you may lose principal. Scott Thoma, CFA, CFP, is an investment strategist at Edward Jones."}]}