{"article": [{"url": "https://www.marketwatch.com/story/disney-will-overhaul-splash-mountain-ride-following-criticism-over-connections-to-racist-film-2020-06-25", "published": 1593359300.0, "headline": "Disney will overhaul Splash Mountain ride amid criticism over connections to racist film â\u0080\u0094 hereâ\u0080\u0099s the movie they chose", "body": "Disney DIS, +1.53% Â will revamp the popular ride Splash Mountain at Walt Disney World and Disneyland, the company said Thursday, after facing criticism that the attraction was inspired by a racist film. The ride will be completely overhauled and will be â\u0080\u009crethemedâ\u0080\u009d to be based the 2009 animated feature film, â\u0080\u009cThe Princess and the Frog,â\u0080\u009d the first Disney movie to star a Black princess. Disneyâ\u0080\u0099s announcement comes after a petition to redo Splash Mountain garnered traction online. When the ride is revamped, it will have a new name, but the company was not ready to share the new name and will announce it in the future, a Disney spokeswoman said. Theme park fans sought to get the ride made-over because of its connections to the 1946 film â\u0080\u009cSong of the South,â\u0080\u009d which has been widely criticized for its racist depictions of Black people and allusions to slavery. Disney has never made â\u0080\u009cSong of the Southâ\u0080\u009davailable on VHS or DVD in the U.S., and the company has declined to include it on its streaming platform, Disney+. Splash Mountain currently features characters and stories from the film. Recently, a Change.org petition to redo the log flume ride garnered more than 21,000 signatures. But others have criticized Splash Mountainâ\u0080\u0099s connections to â\u0080\u009cSong of the Southâ\u0080\u009d in the past. The ride and film were the focus of multiple episodes of the popular podcast â\u0080\u009cYou Must Remember Thisâ\u0080\u009d last October. Donâ\u0080\u0099t miss:Disney fans say a popular ride is racist and should be overhauled â\u0080\u0094 it wouldnâ\u0080\u0099t be the first time Disney has changed with the times â\u0080\u009cThe retheming of Splash Mountain is of particular importance today,â\u0080\u009d Disney said in a statement provided to MarketWatch. â\u0080\u009cThe new concept is inclusive â\u0080\u0094 one that all of our guests can connect with and be inspired by, and it speaks to the diversity of the millions of people who visit our parks each year.â\u0080\u009d An artistâ\u0080\u0099s rendering of the concept for the new version of Splash Mountain. Courtesy of Disney Internal discussions about â\u0080\u009cplussingâ\u0080\u009d Splash Mountain, as Walt Disney referred to the practice, have been going on for a while, the company said, but Disney landed on the current concept last summer. The project is being led by Walt Disney Imagineering senior creative producer Charita Carter, who previously led the creation of Mickey and Minnieâ\u0080\u0099s Runaway Railway at Disneyâ\u0080\u0099s Hollywood Studios theme park in Florida, which was the first theme park ride based on Mickey Mouse. The companyâ\u0080\u0099s â\u0080\u009cImagineers,â\u0080\u009d the employees who create its theme park attractions, are still working on the conceptual design for the new ride. The designs will soon undergo preliminary reviews and the company will then create a timeline for the revamp. â\u0080\u009cWe are still evaluating project timelines based on the extended closures weâ\u0080\u0099ve experienced due to COVID-19,â\u0080\u009d Bob Weis, president of Walt Disney Imagineering, told Disney fan club D23. The viral outbreak has affected the turnaround times for other projects around the world. Disney staff were unable to access Splash Mountain during the parksâ\u0080\u0099 coronavirus-related closures, but Disney shared that workers will soon perform full digital scans and facility assessments needed to move the project forward. Currently, there are no plans to revamp the version of the ride located at Tokyo Disneyland in Japan. Also see:Unlimited decks of cards, no doubles in ping-pong and a â\u0080\u0098snitchâ\u0080\u0099 hotline: 7 really specific rules for NBA players at Disney World â\u0080\u009cThe Princess and the Frogâ\u0080\u009d was less successful at the box office than other Disney films such as â\u0080\u009cFrozen,â\u0080\u009d but the lead character, Princess Tiana, has remained popular among children and is frequently seen at meet-and-greet events and parades at Disneyâ\u0080\u0099s theme parks. “ â\u0080\u0098On the list of priorities given how much red ink the parks are hemorrhaging right now this is way down there.â\u0080\u0099 ” â\u0080\u0094 Jim Hill, a theme park historian and blogge Some travel experts have suggested that redoing Splash Mountain could be a draw for visitors. â\u0080\u009cThis is a huge opportunity for Disney â\u0080\u0094 new rides bring in customers,â\u0080\u009d Len Testa, president of travel website Touring Plans, previously told MarketWatch. (Testa noted that he had signed the petition regarding Splash Mountain.) The new version of Splash Mountain will pick up where â\u0080\u009cThe Princess and the Frogâ\u0080\u009d left off, the company said, following Princess Tiana and her alligator friend Louis as they prepare for their first Mardi Gras performance. The filmâ\u0080\u0099s setting in New Orleans and the bayous of Louisiana works well thematically at Disneyland, where Splash Mountain is situated adjacent to New Orleans Square. At Walt Disney Worldâ\u0080\u0099s Magic Kingdom, the ride is located near Tom Sawyerâ\u0080\u0099s Island, which is based on the Mark Twain novel set in Mississippi. While many fans clamored for a new theme for Splash Mountain based on â\u0080\u009cThe Princess and the Frog,â\u0080\u009d others argued against the change on Twitter TWTR, -0.23% Â , saying that the film deserves its own unique attraction. iframe.twitter-tweet { width: 100% !important; } And as calls for an overhaul of Splash Mountain grew in the wake of anti-racist protests sparked by police killings of people of color, theme park experts suggested that the coronavirus pandemic could stymie efforts to redo the popular attraction. Read more:Walt Disney World cancels dining reservations and stops taking new hotel bookings ahead of planned July reopening â\u0080\u009cOn the list of priorities given how much red ink the parks are hemorrhaging right now this is way down there,â\u0080\u009d Jim Hill, a theme park historian and blogger, told MarketWatch before Disneyâ\u0080\u0099s announcement. Disneyâ\u0080\u0099s theme parks around the world were closed for months because of COVID-19. Walt Disney World in Florida is currently set to reopen in July, but the company said Wednesday that it had delayed its reopening of Disneyland in California, which had also been planned for next month. The existing version of Splash Mountain will be available when the parks reopen, and no closing date for the rideâ\u0080\u0099s overhaul has been set yet. The pandemic has already cost the companyâ\u0080\u0099s theme-parks division $1 billion in profit, and the company has said it would reduce capital spending to compensate. Disney said it regularly plans for updates to attractions â\u0080\u0094 such as the re-theming of a ride at the Norway pavilion at the Epcot theme park in Florida based on the â\u0080\u009cFrozenâ\u0080\u009d franchise â\u0080\u0094 and that the overhaul of Splash Mountain fits into those plans. Shares of Disney have been down 24% this year to date compared to a nearly 11% decline for the Dow Jones Industrial Average DJIA, +0.56% Â and a nearly 5.6% dip for the S&P 500 Index SPX, +0.87% Â . This story has been updated."}]}