{"article": [{"url": "https://www.marketwatch.com/story/did-the-expired-600-federal-jobless-benefit-keep-people-from-going-back-to-work-sudden-drop-in-claims-adds-fuel-to-debate-2020-08-13", "published": 1597337180.0, "headline": "Did the expired $600 federal jobless benefit keep people from going back to work? Sudden drop in claims adds fuel to debate", "body": "Did generous unemployment benefits discourage many workers from returning to their jobs? A big drop in people seeking or receiving benefits in the past two weeks after the end of a $600 federal stipend hints the answer might be yes. Initial jobless claims fell to 963,000 in early August, a decline of almost 500,000 from two weeks earlier. New applications had largely been flat at around 1.5 million a week from June to mid-July. The number of peopled receving benefits, meanwhile, tumbled by 1.5 million in the last two weeks of July to 15.49 million just as the benefit was expiring. That’s the lowest level for these so-called continuing claims since early April. Read:Jobless claims fall below 1 million for first time since start of coronavirus pandemic Some economists say it’s no coincidence new and continuing applications for benefits began to tumble right around the July 31 expiration of the federal stipend. “This is not rocket science, folks. When you pay people more to sit at home than to go back to work, they sit at home,” said chief economist Stephen Stanley of Amherst Pierpont Securities. “When you don’t, if they are offered a job, they go back to work.” “ “This is not rocket science, folks. When you pay people more to sit at home than to go back to work, they sit at home. When you don’t, if they are offered a job, they go back to work.” ” — -Stephen Stanley, chief economist of Amherst Pierpont Securities Stanley and other Wall Street DJIA, +0.56% economists in frequent contact with business people say they’ve repeatedly been told generous benefits made it harder for companies to hire or rehire. “I hear it all the time from business people,” said Gus Faucher, chief economist at PNC Financial Services. “They tried to recall people and people either implied or outright stated, ‘Why should I return to work if I am making more from unemployment?’” Yet economists largely in academia and at the Federal Reserve contend the problem is negligible. A handful of studies, including one by Yale, assert the federal stipend has had virtually no impact on whether people go back to work. Million of people who returned to their jobs in May and June, the study pointed out, did so despite receiving a high level of benefits. “We find no evidence that high [unemployment insurance] replacement rates drove job losses or slowed rehiring,” the Yale study said. Mary Daly, president of the San Francisco Federal Reserve, also downplayed the role of the federal stipend on unemployment in a “digital town hall” on Tuesday. While she’s also heard plenty of anecdotes from businesses leaders, she said the number of people refusing to work is probably too low to make much of a difference. The answer is not an academic exercise or an inside debate among economists with little bearing on public policy. The federal stipend hasn’t been renewed partly because Republicans argued it was keeping workers from returning to their jobs. In the early stages of the pandemic, Congress and the White House agreed to pay an extra $600 a week to the unemployed on top of what they would normally receive from their state unemployment programs. State benefits ranged from a low of $235 a week in Mississippi to a high of $713 in New Jersey. The new law also made self-employed workers such as Uber UBER, -0.18% drivers and freelance writers eligible for the very first time to collect benefits. The combined state and federal payments resulted in millions of full-time workers who lost their jobs getting $800 or more a week. A study by the University of Chicago found that two-thirds of the tens of millions of people laid off during the pandemic earned more money from unemployment than they did from their old jobs. The latest drop in new jobless claims could encourage conservatives to dig in their heels. It provides “fuel for the argument that the enhanced benefits were providing an incentive for people to stay away from returning to work if they had the option,” said money-market economist Thomas Simons at Jefferies LLC. “The data of the past two weeks will not help the arguments of lawmakers fighting to extend the expired benefits.” President Donald Trump has temporarily ordered a reduced federal payment of $300 a week amid an ongoing standoff between Democrats and Republicans over the next stimulus package. Democrats are pushing for an extension of the full $600 stipend, saying people need the money and that they shouldn’t be forced to go back to work if they feel unsafe, especially those with preexisting conditions. Whatever the outcome, economists do agree on one thing: Washington needs to act fast. They say the impasse is likely to hurt the economy soon if a compromise isn’t struck. Some added federal benefit is better for the economy and millions of unemployed than none at all. “We know the economy is a lot smaller than it was six months ago. Businesses need fewer workers than they needed six months ago,’ Faucher said. “Taking away the benefits isn’t going to fix that problem. We could be choking off the recovery.” He suggested a still-generous, if smaller, federal stipend of $400 a month as a way to bridge the divide in Washington. But neither party is budging."}]}