{"article": [{"url": "https://www.marketwatch.com/story/the-us-drops-to-no-28-on-this-global-well-being-index-2020-09-10", "published": 1599816620.0, "headline": "The U.S. dropped majorly on the index that measures well-being â\u0080\u0094 hereâ\u0080\u0099s where it ranks now", "body": "So much for America being No. 1 â\u0080\u0094 the United States has dropped to No. 28 in a new report measuring social progress around the world. In fact, out of 163 countries, only three â\u0080\u0094 the U.S., Brazil and Hungary â\u0080\u0094 have citizens who are worse off now than they were about a decade ago. This is according to the Social Progress Index, which began measuring the quality of life (independent of economic indicators) across the globe in 2011. It looks at 50 well-being metrics â\u0080\u0094 such as access to health care, education, nutrition, safety, the environment and freedom â\u0080\u0094 to measure quality of life. And America has fallen from 19th place in 2011 to 28th place this year, despite the countryâ\u0080\u0099s overall wealth, cultural impact and military power compared with the rest of the planet. The report reveals a number of troubling disparities in Americansâ\u0080\u0099 quality of life. For example, while the nation ranks No. 1 in the world for its access to advanced education and the quality of its universities, itâ\u0080\u0099s down at No. 91 for its access to quality basic education. U.S. kids get an education roughly on par with children in Uzbekistan and Mongolia, according to the New York Times, which got an advance look at the report before it dropped on Thursday. And although the U.S. is among world leaders in medical technology, itâ\u0080\u0099s No. 97 in its citizensâ\u0080\u0099 access to quality health care. Indeed, Americans share health statistics similar to those of people living in Chile, Jordan and Albania. Whatâ\u0080\u0099s more, the data driving these rankings was taken before the COVID-19 pandemic sickened 6.36 million Americans and killed more than 190,000, put tens of millions out of work, and led more than half of Americans to report experiencing worse mental health. Granted, the coronavirus pandemic has also hurt the quality of life in countries across the globe, which will likely reshuffle the rankings moving forward. Still, the results put several American stress points into the spotlight. â\u0080\u009cWe are no longer the country we like to think we are,â\u0080\u009d Â a Harvard Business School professor and the chair of the advisory panel for the Social Progress Index told the Times. â\u0080\u009cItâ\u0080\u0099s like weâ\u0080\u0099re a developing country.â\u0080\u009d The U.S. also suffered low marks for having higher homicide and traffic fatality rates, worse sanitation and internet access, as well as discrimination and violence against minorities compared with most other advanced countries. It should be noted that Americaâ\u0080\u0099s decline in the Social Progress Index predates the current presidential administration. The report also doesnâ\u0080\u0099t offer explanations for why these shifts have happened. But it certainly led to people on both sides of the political divide pointing figures at who is to blame for the slip in quality of life, and â\u0080\u009cWeâ\u0080\u0099re No. 28â\u0080\u009d was trending on Twitter on Thursday. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Porter told the Times this report should be seen as a wake-up call. â\u0080\u009cThe data paint an alarming picture of the state of our nation, and we hope it will be a call to action,â\u0080\u009d he said. The U.S. was also recently named the second-worst country in the world to raise a family (behind Mexico) according to a recent Asher & Lyric survey of the 35 nations that are part of the Organization for Economic Cooperation and Development. It also barely cracked the top 20 countries for raising kids in the U.S. News & World Reportâ\u0080\u0099s Best Countries list released in January. And America didnâ\u0080\u0099t make the top 10 list of best countries for retirement last fall, either, landing at No. 18 on the Global Retirement Index."}]}