{"article": [{"url": "https://www.marketwatch.com/story/surge-in-megadeals-points-to-ma-recovery-as-tech-sector-dominates-2020-09-01", "published": 1599043760.0, "headline": "Surge in megadeals points to M&A recovery as tech sector dominates", "body": "A series of blockbuster deals drove corporate deal making to its strongest start of all time in the second half, as chief executives hit the acquisition trail again after sitting on the sidelines during the height of the pandemic. The combined value of megadeals announced so far during the second half of 2020 reached $256 billion, according to data from Refinitiv. That tally was only exceeded once in this period, in 2015. Nine deals worth $5 billion or more were announced in August alone — the biggest count for that month since 1999, dominated by the technology and health-care sectors. “A coalescence of deals on hold coming back to life, central banks providing copious amounts of cheap liquidity and companies seeking growth has led to an M&A [mergers and acquisitions] boom as deal makers have returned from pandemic enforced seclusion,” said Frank Aquila, global head of M&A at international law firm Sullivan & Cromwell. “Unless there is a significant economic shutdown in the coming months, M&A activity will likely remain at near record levels through at least the end of 2020 and likely well into 2021,” he added. Deals in the tech sector total $69.3 billion, accounting for 27% of global M&A activity during August. Six of the largest 10 deals announced globally during the month involved tech sector targets, while health-care deals total $38.5 billion, the highest monthly number since December 2019. The list includes Johnson & Johnson JNJ, +1.39%, which on Aug. 19 agreed to buy biotech company Momenta Pharmaceuticals US:MNTA for $6.5 billion to boost its capabilities in treating autoimmune and rare diseases. Just days earlier, France’s Sanofi SAN, +1.20% struck a $3.7 billion deal to buy Principia Biopharma US:PRNB valuing the U.S. maker of a promising multiple sclerosis treatment at $3.6 billion, including debt. However, investors appear to be becoming tougher about what they deem to be lowball offers. Earlier in August, Thermo Fisher Scientific TMO, +2.46% said it had terminated its attempted $13 billion offer for German genetic testing company Qiagen QGEN, +1.23%, after only 47% of shareholders voted to approve the deal. European deals account for just 10% of global M&A in August, but bankers say confidence in boardrooms is picking up. On Monday, Nestlé NESN, +0.36% spent $2.6 billion on peanut allergy treatment maker Aimmune Therapeutics AIMT, +0.46% to gain full ownership of the California-based drugmaker in which it already has a stake of around 25.6%. Last week, Aveva Group AVV, +0.19% snapped up SoftBank Group-backed OSlsoft for $5 billion, in one of the biggest deals ever made by a U.K.-listed technology company. The deal would create a company with annual revenue of around £1.2 billion, and adjusted earnings before interest and taxes of £330 million. The resurgence in deal making comes after the coronavirus halted a six-year M&A boom, as companies moved to preserve cash instead of pursuing big-ticket acquisitions. In April, dozens of companies worldwide drew down lines of credit, looking to bolster their cash piles as revenues collapsed amid the near-shut down of the economy. Read:Cash Is King — and M&A Goes MIA Activist investors also took a back seat at the height of the pandemic, as the tools that once boosted returns at target companies became impossible to use amid sinking valuations and the continuing massive government intervention in the world’s largest economies. Share prices have since recovered, spurring companies with strong balance sheets to target their more vulnerable rivals, but overall, activity is still down. During the first eight months of 2020, the value of global deal making reached $1.8 trillion, a 31% fall from the same period last year and the lowest year-to-date level since 2013, Refinitiv data shows. Asia-Pacific accounted for the highest share of year-to-date activity. The collapse in the oil price has spurred deals in the energy sector. In July, Chevron CVX, -1.62% bought oil and gas producer Noble Energy US:NBL for $13 billion, including debt in an all-stock transaction. Marathon Petroleum MPC, -3.21% sold its Speedway gas stations to Seven & I Holdings, the Japanese owner of 7-Eleven convenience stores, for $21 billion, after coming under pressure from activist investors including Elliott Management. Read: Here’s Why Investors Should Bet on Stocks That Are Selling Noncore Assets On Aug. 31, French water and waste management group Veolia said that it had made an all-cash offer to acquire a 29.9% stake in its peer Suez from Engie, at a price of €15.50 ($18.46) a share. Suez issued a statement shortly after, saying Veolia’s approach “has been unsolicited and Suez had no discussion with Veolia about a possible merger.” It added that it has set up an ad hoc committee to examine the proposal. Last year, shareholder activist firm Amber Capital called for a strategy review at Suez, arguing that the French utility had underperformed rivals and could create more value for its shareholders."}]}