{"article": [{"url": "https://www.marketwatch.com/story/jp-morgan-enters-green-bond-push-with-1-billion-debut-debt-deal-11599703139", "published": 1599689240.0, "headline": "JP Morgan enters green bond push with $1 billion debut debt deal", "body": "The San Francisco skyline is obscured in orange haze Wednesday. AFP/Getty Images JP Morgan Chase & Co. entered the green-bond world on Wednesday, offloading the bank’s first set of bonds specifically to fund projects with a sustainability bent. While the banking giant has arranged debt with an environmental or social-good purpose for its clients and other companies, this was JP Morgan’s first $1 billion foray into issuing such bonds on its own behalf. Many investors welcomed the move, not only because of the weight JP Morgan JPM, -0.57% carries in the market as the nation’s biggest U.S. bank by assets, but also because of a growing acceptance within the U.S. that a climate crisis threatens both environmental and financial instability. Read: CFTC’s groundbreaking climate-change report sounds a bipartisan alarm on costly risks for U.S. financial system JP Morgan’s bond deal hit as wildfires raged along the West Coast, with smoke from fires shrouding the San Francisco Bay Area on Wednesday in an eerie orange haze and underscoring how climate change threatens to make extreme fire events, power outages and forced evacuations the norm. “The more the larger players come along, the larger the scale to move things along faster,” said Steve Liberatore, Nuveen’s lead portfolio manager for environmental, social and governance (ESG) criteria and impact investments. But Liberatore also stressed that a key part of tackling the unfolding “climate disaster” is to mitigate it in an “economically beneficial way for the average person.” That can mean achieving a lower cost of capital for renewable energy projects than what’s available for funding fossil fuels. To that end, JP Morgan was able to pull in pricing Wednesday amid high investor demand, clearing the bonds at a spread of 48 basis points over Treasurys BX:TMUBMUSD10Y, after they initially were floated in the range of 65 basis points. A bond spread is the level of compensation investors get paid above a risk-free benchmark to act as a creditor, with lower spreads often indicating high demand or a lower expectation of default. “Generally, green bonds yield less, meaning the cost of financing is lower,” said Pri de Silva, senior corporate credit analysts at Aware Asset Management, adding that JP Morgan priced similar bonds in May that were trading on Wednesday closer to 58 basis points over Treasurys. “From a funding perspective, I’d say there was a 10-basis-point advantage,” de Silva said, even though he noted the “sunk costs” involved in setting up the new green issuance platform, including providing the “belts and suspenders” to ensure there’s a process in place to track that only eligible projects are funded. To that end, JP Morgan said proceeds from the debut green bond would finance a range of projects from green buildings to renewable energy, in a public filing. Notably, the bank also listed areas that will be excluded from the funding from bond proceeds, including coal, oil, gas and nuclear energy projects, as well as activities that involve modern slavery, child labor and human rights exploitation. Amid an overall corporate debt boom, the second quarter also saw a record $99.9 billion of “sustainability bonds” issued globally, according to Moody’s Investors Service, a category that encompasses green, social and sustainable bonds. JP Morgan’s debut follows on the heels of Citigroup C, +0.47% and Bank of America BAC, +0.47%, which issued green and social-good bonds earlier this year. See: Bank of America sold a first-of-a-kind Covid-19 bond “Banks are in a unique position to issue green bonds as they are interrelated with the broader economy,” said Brian Ellis, portfolio manager, Calvert Green Bond Fund. “From an investor’s perspective, growth in green bond issuance provides increased opportunities for portfolio and project diversification, but also the ability to be more selective because there’s a larger group to choose from.” JP Morgan declined to comment."}]}