{"article": [{"url": "https://www.marketwatch.com/story/why-natural-gas-prices-havent-yet-bottomed-despite-this-years-nearly-20-drop-2020-06-12", "published": 1591974980.0, "headline": "Why natural-gas prices havenâ\u0080\u0099t yet bottomed despite this yearâ\u0080\u0099s 20% drop", "body": "Natural-gas prices trade 20% lower this year, and analysts say they havenâ\u0080\u0099t hit bottom yet, despite the early start to the Atlantic hurricane season, expected high demand for the summer season, and signs that the U.S. economy is recovering from the Covid-19 pandemic. Despite stronger demand tied to the coming summer season, natural-gas prices â\u0080\u009cface headwinds given a global supply glut and limited available storage capacity in Europe, Asia, and the U.S.,â\u0080\u009d says Rich Redash, head of global gas planning at S&P Global Platts Analytics. As of the week ended June 5, natural gas in U.S. storage stood at 2.807 trillion cubic feetâ\u0080\u009436% higher than the same period a year ago, according to the Energy Information Administration. â\u0080\u009cWhile concerns swirl about lower natural-gas production as a result of lower activity from U.S. oil basins, stymied demand amid milder weather and lower economic activity have meant that natural-gas storage has swelled,â\u0080\u009d says Matt Smith, director of commodity research at ClipperData. Natural gas produced from oil wells in five major shale-oil producing regions accounted for about 12% of the nationâ\u0080\u0099s natural-gas output in 2018, according to the EIA, which projects a June shale oil production decline to 7.822 billion barrels a day, from 8.019 billion in May. â\u0080\u009cU.S. weakness is also a reflection of global weakness now that the U.S. is a key exporter,â\u0080\u009d Smith says. â\u0080\u009cAs buyers cancel cargoes, U.S. [liquefied natural-gas] exports are dropping below year-ago levels to a 10-month low.â\u0080\u009d Natural-gas demand has suffered under pandemic-related closures, affecting U.S. electricity demand as well as manufacturing activity, says Redash. Still, natural-gas weakness has been partly offset by â\u0080\u009ccoal-to-gas switching in the power sector, driven by low gas prices.â\u0080\u009d The Atlantic hurricane season saw an early start, with the first named storm forming in mid-May, ahead of the official June 1 through Nov. 30 season. The National Oceanic and Atmospheric Administration sees a 60% chance of an â\u0080\u009cabove normalâ\u0080\u009d 2020 Atlantic hurricane season, with the potential for 13 to 19 named storms, including six to 10 hurricanes. Tropical Storm Cristobal made landfall along the Louisiana coast in early June. Storms receive names in alphabetical order, and Cristobal was the earliest third-named storm on record. Gulf of Mexico oil and gas operations implemented shutdowns due to the storm. At the peak, 35% of the regionâ\u0080\u0099s natural-gas output was shut in on June 8, according to the Bureau of Safety and Environmental Enforcement. Even so, Cristobal generated a â\u0080\u009cyawn from traders,â\u0080\u009d says meteorologist James Roemer, president of commodity-trading advisory BestWeatherInc.com. â\u0080\u009cPrices have not really reacted to the â\u0080\u0098psychologyâ\u0080\u0099 of an active season since the advent of shale production in the past 10 to 12 years or so.â\u0080\u009d Natural gas used to see a seasonal lift into June and July, he says, but prices have failed to find support despite moves to reopen the economy from eased lockdowns that were imposed amid the height of the COVID-19 pandemic. On June 12, futures prices US:NGN20 Â settled at $1.731 per million British thermal units, down 21% this year. There has been a â\u0080\u009cstructural reductionâ\u0080\u009d in daily offshore Gulf of Mexico natural-gas production to about three billion cubic feet, from roughly 10 billion cubic feet in the 2005-2006 period, Redash says. So, when it comes to Atlantic storms, the bigger worry is demand, he explained. Storm risks â\u0080\u009cnow skew bearish,â\u0080\u009d in that potential demand losses in the U.S. Southeast and Texas region â\u0080\u009ccould top supply losses during such events,â\u0080\u009d says Redash. Gas prices havenâ\u0080\u0099t bottomed yet, given the glut of global supplies and the potential to run out of storage space, he says."}]}