{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-fall-after-rise-in-jobless-claims-11600952003", "published": 1600966400.0, "headline": "30-year Treasury yield plumbs three-week low amid labor market concerns", "body": "U.S. Treasury yields slid Thursday in the wake of a rise in first-time jobless claims, underlining the continued weakness in the labor market and the broader economy.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 1.2 basis points to 0.664%, while the 2-year note rate TMUBMUSD02Y, 0.156% edged 0.4 basis point lower to 0.137%. The 30-year bond yield TMUBMUSD30Y, 1.576% slipped 2.5 basis points to 1.401%, its lowest since Sept. 3. Bond prices move in the opposite direction of yields. What’s driving Treasurys? U.S. first-time applications for jobless benefits for the week ending Sept. 19 rose by 4,000 to 870,000, higher than the 850,000 consensus estimate. The number of Americans continuing to file for unemployment benefits stood at 12.58 million, versus a forecast of 12.3 million. Without a rapid recovery in employment, investors say the U.S. economy will struggle to return to its pre-COVID strength soon. In other data, new home sales for August ran at a seasonally-adjusted, annual rate of 1.011 million, its highest level in 14 years. MarketWatch-polled analysts had forecast an annualized pace of 900,000. Senior Federal Reserve officials also spoke on Thursday, with Fed Chairman Jerome Powell repeating the message that downside risks to the economy were growing without additional fiscal stimulus measures. In Congress, House Democrats are preparing a new $2.4 trillion coronavirus aid package, according to multiple published reports on Thursday. But it’s unclear if Republicans will be receptive to the proposal, even if it is $1 trillion lower than the previous Democrat plan. The Treasury Department sold $50 billion of 7-year notes, but the new supply did not have much of a dent on the outstanding market.What did market participants say? “While interest rates and the Fed’s pledge to keep them low isn’t in question, the U.S. economic recovery, COVID-19, the election, stimulus negotiations, and a weak jobs market are reasons to be concerned,” said Kevin Giddis, chief fixed-income strategist at Raymond James."}]}