{"article": [{"url": "https://www.marketwatch.com/story/regal-owner-cineworld-to-shut-all-theater-screens-putting-45-000-jobs-at-risk-11601893250", "published": 1601994320.0, "headline": "Regal owner Cineworld to shut all theater screens, putting 45,000 jobs at risk", "body": "The release of the latest James Bond \"No Time to Die\" has been delayed for the second time. mladen antonov/Agence France-Presse/Getty Images Shares in Cineworld plunged 57% on Monday, after the world’s second-largest movie chain confirmed it will temporarily close its cinemas in the U.K. and the U.S., putting 45,000 jobs at risk. U.K. Prime Minister Boris Johnson acknowledged there would be “tough times ahead” in the jobs market following Cineworld’s announcement, but encouraged people to go to the movies. Cineworld’s move comes after the release of the latest James Bond film, “No Time to Die” was delayed for the second time. The MGM film had been due to be released in April this year, but was then postponed until November because of the pandemic. It is now expected to be released on April 2, 2021. Cineworld UK:CINE Chief Executive Mooky Greidinger said the closure of its 663 cinemas was “not a decision we made lightly.” “We did everything in our power to support safe and sustainable reopenings in all of our markets,” Greidinger said. Read: Cineworld Warns COVID-19 Still Threatens Its Future. It’s Not the Only Theater in Trouble. iframe.twitter-tweet { width: 100% !important; } All operations will be suspended at 536 theaters in the U.S. and 127 Cineworld CNNWF and Picturehouse theaters in the U.K. from Oct. 8. The company didn’t give a date for reopening its cinemas. Shares in Cineworld, which plunged 57% when the market opened, were trading 27.77% lower in early morning trading on Monday. Susannah Streeter, senior investment and markets analyst at Hargreaves Lansdown, said the beleaguered entertainment industry has taken another huge blow with the confirmation that all of Cineworld’s venues will close their doors temporarily. “Although the delay of the latest 007 blockbuster prompted the decision, Bond isn’t the villain in this piece. The spread of COVID-19 around the world has been a horror movie for the industry and the fresh wave of infections is the latest installment in what’s been a devastating story for cinema chains,” Streeter said. iframe.twitter-tweet { width: 100% !important; } Cineworld’s announcement follows a series of high-profile delays in recent weeks, including the Fast & Furious sequel, F9, which has been delayed until the end of May 2021, analysts at Citigroup said. “The only major release post the peak of COVID, the highly anticipated “Tenet,” has delivered a disappointing performance. It seems that there is a vicious circle — with concerns over audience levels, the studios are unwilling to release their strongest content. And without decent content, audience levels are unlikely to return any time soon,” the analysts added. Read: ‘Tenet’ earns $20.2 million in U.S. debut, in big test for box office “Without these new releases, Cineworld cannot provide customers in both the U.S. and the U.K. — the company’s primary markets — with the breadth of strong commercial films necessary for them to consider coming back to theaters against the backdrop of COVID-19,” Cineworld said. The entertainment industry has been among the hardest hit by social distancing and other restrictions, with the pandemic forcing U.S. and U.K. cinemas to close in mid-March. Read: Movie-industry group pleads for aid from Congress, warning ‘theaters may not survive’ Chains including AMC Entertainment AMC, -2.17%, the world’s largest movie theater chain, have since reopened with reduced capacity in several U.S. cities, but efforts to get audiences back into venues have proved dispiriting. On Friday, S&P Global Ratings on Friday downgraded the debt of AMC Entertainment, estimating that it has six months of cash left unless the situation materially improves. The boss of cinema chain Vue International, Tim Richards, told BBC Radio that demand from customers was there but there was a lack of major movies being released for them to watch. “Our problem right now is we have no movies, and this was a big blow for us.” “We’re likely going to make it through; I’m concerned about the independents and the small regional operators right now that are going to really struggle and when they close they may not reopen,” Richards said. Disney said on Sept. 23 it had postponed the release of superhero movie “Black Widow” and director Steven Spielberg’s “West Side Story” until 2021. The next significant release is Pixar’s “Soul,” set for Nov. 20. However, a report in Variety suggested that this could instead be moved to Disney+, the streaming services owned by Walt Disney DIS. Cineworld’s announcement will increase pressure on the government for more support for the entertainment and arts industry, which still has 51% of workers on furlough. Around 51% of the industry’s workforce were still on furlough as part of the government’s Coronavirus Job Retention Scheme between July 27 and Aug. 9, according to the Office for National Statistics. In September, Cineworld reported a $1.6 billion pretax loss for the first six months of the year, during which its net bet increased to $8.2 billion. The company said it is assessing several sources of additional liquidity and all liquidity raising options are being considered. Neil Wilson, chief market analyst for Markets. com, said the delay to the next James Bond film was the straw that broke the camel’s back, but Cineworld was a little bloated before the pandemic struck. “Net debt of over $8bn — thanks mainly to two large leveraged acquisitions in recent years — and a market cap of $540m by the close on Friday left Cineworld in a difficult position to refinance if punters were not coming through the doors; without the Bond franchise to draw people in there was little option — closing its theaters at least gives it a chance to preserve cash and wait for things to improve,” Wilson said. Read: Here’s everything coming to Netflix in October 2020 — and what’s leaving He added that refinancing by some sort of rights issue seems inevitable. “The advance of over-the-top streaming services, especially Netflix NFLX, +1.43% with its vast Hollywood budgets and ability to make feature films, has been a critical blow to the industry and COVID has vastly compounded the problem by keeping viewers away.”"}]}