{"article": [{"url": "https://www.marketwatch.com/story/secs-regulatory-work-could-be-hamstrung-by-leadership-change-with-clayton-set-to-exit-analyst-says-2020-06-22", "published": 1592830280.0, "headline": "SEC's regulatory work could be hamstrung by leadership change with Clayton set to exit, analyst says", "body": "The Securities and Exchange Commission is likely to be hampered by the Trump administration's move to nominate SEC Chairman Jay Clayton for U.S. attorney for the Southern District of New York, according to one analyst. \"We're probably at the stage where the agency will follow through on things that are far along, such as the February proposal aimed at reducing the gap between proprietary market data products and the publicly available data feed, and the fund-of-funds proposal,\" said Ian Katz, a Capital Alpha Partners analyst, in a note on Sunday. \"But the combination of Clayton's awkward situation, the ongoing pandemic, and the possibility of a change in government next year mean that progress in wonky areas like market data and fund regulation will likely become even slower than usual.\" After initially refusing to leave, Geoffrey S. Berman stepped down as the top Manhattan prosecutor over the weekend following an assurance that his investigations into allies of President Donald Trump wouldn't be disturbed. Clayton has emerged as the White House's pick for the post, though one roadblock is that New York's two U.S. senators have called for him to withdraw from consideration. Clayton has told the SEC's staff that he plans to remain at the agency until he is confirmed as the U.S. attorney by the Senate. \"Not only is Clayton a short-timer, but he's a short-timer in the middle of a controversy. That can't be comforting to the staff, which is already suffering from two recent body-blow court defeats at the hands of the exchanges,\" Katz said. A ruling last week struck down a planned transaction fee pilot, and a June 5 decision overruled the SEC's challenge of data fee increases by Nasdaq Inc. NDAQ, +0.36%  and the New York Stock Exchange, which is owned by Intercontinental Exchange Inc. ICE, -0.04%  The analyst also noted that the SEC's leadership already had started to look like a lame duck earlier this month, with Clayton not expected to stay at the agency even if Trump is re-elected in November."}]}