{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-rise-on-track-for-sharp-weekly-rise-as-lingering-public-health-crisis-buoys-bullion-2020-06-26", "published": 1593181520.0, "headline": "Gold futures finish higher, tally a gain for the week as COVID-19 spread spurs haven demand", "body": "Gold futures finished higher on Friday to score a gain for the week, as a rise in infections of COVID-19 raised the potential for another round of shutdowns to prevent the spread, feeding haven demand for bullion. “It was another week, but the same old story for gold,” said Lukman Otunuga, senior research analyst at FXTM. “The precious metal was offered support in the form of renewed jitters about Covid-19. Prices for gold still eased back from a Tuesday settlement that was the highest since 2012, posting losses for two consecutive sessions this week, pressured by some gains in the dollar, “which also benefitted from safe-haven flows,” he said. U.S. states saw a single-day record rise of close to 40,000 infections on Thursday, led by Florida, Texas, California and Arizona, surpassing the 36,188 level from April 24, according to analysis of data from Bloomberg, compiled by Johns Hopkins University. Against that backdrop, the U.S. dollar traded little changed Friday as gold futures settled, but looked to end lower for the week, according to FactSet data, measuring the ICE U.S. Dollar Index DXY, -0.58%. A weaker dollar can provide support for assets priced in the currency by buyers using alternative monetary units. Expect gold to “meander within a wide range until a fresh directional catalyst is bought into the picture,” Otunuga told MarketWatch. August gold US:GCQ20 rose $9.70, or nearly 0.6%, to settle at $1,780.30 an ounce after tapping an intraday low of $1,754 Friday and posting declines in each of the past two sessions. Prices on Tuesday had settled at the highest for a most-active contract since Oct. 4, 2012. The most-active July silver US:SIN20 added 14 cents, or 0.8%, at $18.035 an ounce. September silver US:SIU20 which is also among the active contracts, rose 12 cents, or nearly 0.7%, to $18.168. For the week, gold saw for an advance of 1.6%, its third weekly rise in a row, while silver futures tallied a climb of nearly 1.1%, based on the most-active contracts as of last Friday, according to Dow Jones Market Data. Read:Silver, copper prices make an impressive recovery from March lows “Next week is a big week for gold bulls and gold bears,” said Chintan Karnani, chief market analyst at Insignia Consultants. “Fears of second wave of coronavirus should prevent a short term bearish trend in gold,” even if U.S. jobs numbers next week beat street expectations by a wide margin, he told MarketWatch. Gold futures on Friday showed little reaction following the final June reading on U.S. consumer sentiment, which was at 78.1, down from the initial 79.3 reading. Consumer spending in May, meanwhile, climbed by a record 8.2% to mark the first increase since the pandemic hit the economy. Still, central-bank stimulus across the globe and low or negative interest rates have been viewed as factors that have been supportive to the buying of precious metals. The main scenario for gold “still appears positive, and we could be in a consolidation phase, with the market trying to gain strength for potential further rallies, which will have more chance of success if stocks decline and risk-off mode comes back,” said Carlo Alberto De Casa, chief analyst at ActivTrades. On Friday, gold ended higher as U.S. benchmark stock indexes moved broadly lower. Elsewhere on Comex, July copper US:HGN20 edged down by nearly 0.2% to $2.659 a pound, while the now most-active September contract US:HGU20 rose 0.04% to $2.679. Tracking the most-active contracts, prices were 2.6% higher for the week. July platinum US:PLN20 rose 0.9% to $809.90 an ounce, while the now most-active October platinum contract PLV20, +3.99% ended at $819.30, up 1.3%. Most-active platinum futures were down 1% for the week. September palladium US:PAU20 rose 2.7% to $1,894.40 an ounce, for a weekly loss of 0.7%."}]}