{"article": [{"url": "https://www.marketwatch.com/story/oil-slumps-on-rise-in-gasoline-inventories-as-traders-await-opec-committee-meeting-2020-08-19", "published": 1597851140.0, "headline": "U.S. oil benchmark erases loss, finishes flat after EIA reports drop in gasoline inventories", "body": "The U.S. crude benchmark shook off early losses to end little changed on Wednesday, finding support after government data showing a fall in gasoline inventories soothed jitters over demand as a pandemic-lightened driving season moves into its final stretch. Traders were also keeping an eye on a meeting of an OPEC+ panel that was expected to recommend sticking with the current schedule of production curbs as major producers gauge the COVID-19 pandemic’s affect on the demand outlook. West Texas Intermediate crude for September delivery CL.1, -1.62% rose 4 cents, or 0.1%, to close at $42.93 a barrel on the New York Mercantile Exchange, while October WTI US:CLV20, the most actively traded contract, lost a penny to close at $43.11 a barrel. October Brent crude UK:BRNV20 fell 9 cents, or 0.2%, to $45.37 a barrel on ICE Futures Europe. The Energy Information Administration said U.S. crude inventories last week fell by 1.6 million barrels, while gasoline inventories were down 3.3 million barrels. Oil had been under pressure after the American Petroleum Institute late Tuesday reported a rise in gasoline inventories, which would be a bearish sign in the final stretch of summer driving season. The EIA said distillate inventories rose by 200,000 barrels. September gasoline futures US:RBU20 rose 0.75 cent, or 0.6%, to close at $1.2905 a gallon. Analysts surveyed by S&P Global Platts had expected the EIA data to show U.S. crude supplies fell 3.8 million barrels last week, while gasoline stocks were expected to show a decline of 2 million barrels. Distillate supplies are forecast to fall 900,000 barrels. The OPEC+ Joint Ministerial Monitoring Committee, meeting virtually Wednesday, was largely expected to take a wait-and-see approach after members in August went ahead with a plan to scale back output cuts from 9.7 million barrels a day to 7.7 million barrels a day, albeit with some producers who had failed to abide by earlier restrictions agreeing to maintain deeper cuts. Saudi Arabia’s oil minister told participants that demand should bounce back to pre-pandemic levels in the fourth quarter, Reuters reported, while calling on members of the alliance to adhere to production cuts. Read:OPEC+ committee expected to take ‘wait-and-see’ approach on output as oil prices “Though the decision to already step up supply again from August appears premature in view of the risks on the demand side, there should be no renewed oversupply if those countries that produced more crude oil than agreed from May to July offset their ‘overproduction’ and keep the cuts in place until September,” said Eugen Weinberg, analyst at Commerzbank, in a note. In other energy trading, September heating oil US:HOU20 fell 0.94 cent, or 0.8%, to settle at $1.2510 a gallon. September natural-gas futures US:NGU20 rose 0.9 cent, or 0.4% to $2.426 per million British thermal units."}]}