{"article": [{"url": "https://www.marketwatch.com/story/natural-gas-lumber-among-best-performers-as-commodities-post-a-second-straight-quarterly-gain-11601497224", "published": 1601483300.0, "headline": "Natural gas, lumber among best performers as commodities post a second straight quarterly gain", "body": "The commodities sector posts a second straight quarterly rise, with lumber among the best performers. frederic j. brown/Agence France-Presse/Getty Images Commodities posted a gain for a second straight quarter on the last day of September, with natural gas and lumber among the best performers even as COVID-19 clouded the outlook for the global economy. The Bloomberg Commodity Index BCOM, +1.51%, which tracks 23 commodities, climbed by roughly 9% for the third quarter this year. The index rose about 5% in the second quarter. Natural-gas futures NGX20, +5.17% were up by more than 44%, while lumber futures LB00, -4.94% LBX20, -4.94% tacked on roughly 40% for the period, according to Dow Jones Market Data. The overall move higher for commodities “speaks to investors’ confidence that we’ll have a vaccine delivered to at least the more high-risk demographic in the not-too-distant future,” said Adam Koos, president and portfolio manager at Libertas Wealth Management Group. The rise also points to expectations that “companies will continue to open up, and that the consumption of materials will start getting back to normal sooner than later.” Natural-gas futures scored their biggest quarterly percentage climb since the second quarter of 2016. “There was a much faster rebound in European [liquefied natural gas] demand than was anticipated in the throes of the coronavirus shutdown,” said Phil Flynn, senior market analyst at The Price Futures Group. “At the same time, a pullback in U.S. production was deeper and more sustained leading to a tighter outlook for 2021 supply.” Read: Natural-gas futures rally on storm-related disruptions and signs of stronger demand Lumber futures, meanwhile, have been a standout all year amid strong demand for the commodity even as the shutdowns linked to the coronavirus led to a significant slowdown in global economies. Prices reached a record settled at $928.50 per 1,000 board feet on Sept. 1. It was an “historic run” for lumber futures going from the $430 area at the start of the third quarter to up to $1,000 and back down to the $550 area this week, said Greg Kuta, president of lumber broker Westline Capital Strategies. That’s left the industry “exhausted and highly confused heading into Q4. Trying to forecast prices for Q4 and Q1 2021 will be a never-ending job, with significantly more risk versus the reward realized in Q3.” Read: Lumber futures climb to a record and more than double for the year, as pandemic boosts demand Among the metals, silver SIZ20, +5.96% gained 26% to far outperform gold for the quarter. The yellow metal GCZ20, +2.17% posted a much more modest 5.3% rise for the three-month ended in September. Still, Ross Norman, chief executive officer of Metals Daily, noted silver’s loss for the month. Prices lost nearly 18% in September. The otherwise sedate metal, silver, has a “tendency to surprise and when in play, can be highly volatile,” said Norman. “Essentially, we are seeing the so-called weak hands in the silver market being taken out, removing the froth or head from the market and preparing silver for better, later gains.” Other industrials did well, with spot prices for rhodium jumping 73% for the quarter, according to data from specialty-chemicals company Johnson Matthey. Prices stood at $13,900 an ounce on Sept. 30. The metal is not traded on the futures market, or included in the commodities index. Palladium PAZ20, +2.31%, which is one of the platinum group metals along with rhodium, scored a quarterly rise of 18.5%. Hans Ritter, global head of trading at Heraeus attributed the rise for both rhodium and palladium to “a much faster recovery of the car market in China with higher loadings on catalysts for both metals, versus lost primary production in South Africa due to COVID-19 related lockdown earlier in the year.” He also added that “mines are nearly back to full production.” Ritter pointed out that 80% to 90% of both metals are consumed in the automotive industry and European car sales are down significantly, with further economic restrictions possible given the current second wave of new COVID-19 infections. “The risks for rhodium and palladium are medium-term on the downside,” he said. Read: Coronavirus pandemic knocks palladium and rhodium off the rally track Grain prices also rose sharply for the quarter, with wheat futures WZ20, -0.50% leading the percentage climb, up nearly 18%. For the quarter, demand for grains, including corn CZ20, +1.93% and soybeans SX20, +1.47%, was “strong, especially from China, and it really needs to rain in several places for the winter wheat and South American soybean crops to get a good start,” said Sal Gilbertie, president and chief investment officer at Teucrium Trading. Read: Why soybeans may be headed for their highest price in 6 years Other commodities saw surprisingly more modest moves for the quarter. Oil futures ended higher for the three months ended in September, with U.S. prices up 2.4%, as traders weighed efforts by the Organization of the Petroleum Exporting Countries and their allies to cut production against expectations for a hefty loss in energy demand driven by the pandemic-related economic toll on global markets. November West Texas Intermediate crude CLX20, -1.62% settled at $40. 22 a barrel on Wednesday. Read: OPEC+ committee’s power of words helps lift oil prices Gold futures marked eight consecutive quarterly gains. The rise for the third quarter, however, paled in comparison to their second quarter rise of nearly 13%. Futures prices had settled at a record $2,069.40 on Aug. 6. The gold market “seems to have settled for now,” but the short term for gold is always “harder to predict than the long term,” said Brien Lundin, editor of Gold Newsletter. Still, “given the sovereign and corporate debt burdens around the world, which will necessitate ultra-easy monetary policy and negative real rates, much higher metals prices seem assured months and years down the road,” he said. Read: Volatility in oil and gold may offer more opportunity than risk"}]}