{"article": [{"url": "https://www.marketwatch.com/story/feds-evans-says-the-power-to-get-the-economy-going-lies-with-congress-2020-08-03", "published": 1596499460.0, "headline": "Fedâ\u0080\u0099s Evans says the power to get the economy going lies with Congress", "body": "A senior Fed official on Monday said that Congress is in the drivers seat for getting the economy going and central bank interest-rate policy is in the passenger seat, at least for now. â\u0080\u009cThe ball is in Congressâ\u0080\u0099 court,â\u0080\u009d Charles Evans, the Chicago Federal Reserve president, told reporters in summarizing the current state of economic policy. â\u0080\u009cFiscal policy is really fundamental for getting us going,â\u0080\u009d he said. Fed officials are watching with baited breath as White House officials and congressional Democrats seek to compromise on another stimulus package. Already the talks have dragged on so that federal unemployment benefits of $600 per week have expired, as has a federal moratorium on evictions. There is growing talk that a deal wonâ\u0080\u0099t be reached until September. Failure to reinstate this support for unemployed workers and their families would damage the economy, he said. â\u0080\u009cIf we go very long without somehow addressing the reduction and evaporation of that support, I think it is going to show up in lower aggregate demand and that would be very costly for the economy,â\u0080\u009d Evans said. In a separate interview, St. Louis Fed President James Bullard was optimistic a deal could be reached. â\u0080\u009cMy sense is that nobody in Congress wants to go face an electorate this fall having failed to come to a deal,â\u0080\u009d Bullard told reporters on a separate teleconference. Fed Chairman Jerome Powell stressed last week that the path ahead for the economy depends on the course of the coronavirus. Evans and Bullard echoed this remark. â\u0080\u009cAnything that helps us avoid...second wave scenarios is just absolutely crucial,â\u0080\u009d Evans said. The Chicago Fed president said there has been a flattening in the economic data and some economists think the U.S. economy is stalling. â\u0080\u009cThis is a very challenging time,â\u0080\u009d he said. A less optimistic path for the economy is just as likely as the baseline forecast for a steady improvement in the economy, he noted. For now, Evans said he sees the unemployment rate falling from 11.1% in June to 9.5% by the end of 2020 and to 6.5% by the end of 2021."}]}