{"article": [{"url": "https://www.marketwatch.com/story/pentagon-leaders-say-reports-of-russian-bounties-unproven-but-would-trigger-action-if-true-2020-07-09", "published": 1594316420.0, "headline": "Pentagon leaders say reports of Russian bounties unproven, but would trigger â\u0080\u0098actionâ\u0080\u0099 if true", "body": "WASHINGTON â\u0080\u0094 Top Pentagon leaders told Congress on Thursday that reports of Russia offering Taliban militants bounties for killing Americans were not corroborated by defense intelligence agencies, but said they are looking into it and the U.S. will respond if necessary. Defense Secretary Mark Esper said his military commanders heard initial reports on the bounty issue in January and he first saw an intelligence paper about it in February. While the threats were taken seriously, he said they have not yet been found credible. Esper and Gen. Mark Milley, chairman of the Joint Chiefs of Staff, were testifying before the House Armed Services Committee on the role of the military during recent protests triggered by the killing of George Floyd. Several House members asked about the Russian bounty reports. Milley said Russia and other nations have long worked against the U.S. in Afghanistan and provided support to the Taliban, but the specific notion of bounties hasnâ\u0080\u0099t been proven. President Donald Trump initially labeled the reports about bounties â\u0080\u009cjust another hoaxâ\u0080\u009d made up by the media. The White House has said Trump wasnâ\u0080\u0099t briefed on the intelligence until after the stories broke. According to U.S. intelligence officials, information that Russia offered bounties to Taliban militants for killing American troops was included in a briefing for Trump in late February. Milley and Esper appeared to walk a fine line. Esper said he didnâ\u0080\u0099t recall a briefing that mentioned the word â\u0080\u009cbounties.â\u0080\u009d But, under questioning he later acknowledged that there were reports that mentioned â\u0080\u009cpayments.â\u0080\u009d And Milley was pressed about the difference between Iran backing militants in Iraq â\u0080\u0094 which has triggered U.S. retaliation â\u0080\u0094 and what the Russians are doing in Afghanistan. He said that while Russia continues to back the Taliban, there is no evidence it directed militant attacks on U.S. troops in Afghanistan. â\u0080\u009cIn the case of the Russians, we do not have concrete, corroborating evidence, intelligence, to show â\u0080\u0098directing.â\u0080\u0099 Thatâ\u0080\u0099s a big difference. If we did, it would be a different response, too,â\u0080\u009d he said, adding that the military is still digging into the matter and will get to the bottom of it. â\u0080\u009cIf in fact thereâ\u0080\u0099s bounties directed by the government of Russia or any of their institutions to kill American soldiers, thatâ\u0080\u0099s a big deal,â\u0080\u009d Milley said. â\u0080\u009cI and the secretary and many others are taking it seriously, weâ\u0080\u0099re going to get to the bottom of it, weâ\u0080\u0099re going to find out if, in fact, itâ\u0080\u0099s true. And if it is true we will take action.â\u0080\u009d That action, he said, could be military, diplomatic, financial or other steps. The bulk of the hearing focused on the role of the National Guard soldiers in supporting law enforcement agencies during the civil unrest. Esper said using the Guard was a better alternative than using active-duty forces as Trump had threatened. His stance is at odds with Trump, who had spoken of invoking the Insurrection Act in order to use active-duty forces on the streets of the nationâ\u0080\u0099s capital during protests in late May and early June that included limited acts of violence, such as setting a fire in St. Johnâ\u0080\u0099s Episcopal Church near the White House. Several active-duty units were put on alert but ultimately were not deployed in Washington. â\u0080\u009cUsing active-duty forces in a direct civilian law enforcement role should remain a last resort, and exercised only in the most urgent and dire of situations,â\u0080\u009d Esper said, stressing that no active-duty military units engaged protesters or took a direct part in law enforcement in the District of Columbia or other places in the country. Esper and Milley, however, acknowledged there was confusion in the streets and it was often difficult to tell the difference between the Guard troops and the many law enforcement agencies that also had personnel in Washington. â\u0080\u009cYou want a clear visual distinction,â\u0080\u009d said Milley, between â\u0080\u009cthat which is military and that which is police.â\u0080\u009d And Esper said one thing officials are discussing is that the Guard loaned shields to law enforcement officers during the unrest. In the future, he said, they might want to cover the military police designation on the shields when they are loaned out, to make it clearer they are not military. Thursday was the first time Esper and Milley have testified before Congress since March 4, when they appeared to discuss the administrationâ\u0080\u0099s defense policy proposal. A few panel members were in the room, but many participated remotely due to the c oronavirus pandemic. Trumpâ\u0080\u0099s push for an aggressive response to the civil unrest led to an extraordinary clash with Esper and Milley, who on June 1 accompanied the president when he walked from the White House to St. Johnâ\u0080\u0099s Church on Lafayette Square, where he held up a Bible for photographers. That day, a National Guard helicopter was flown at extremely low altitude to help disperse protesters from the capitalâ\u0080\u0099s streets, prompting a Pentagon investigation into whether that was a proper use of military resources. Esper told the committee the Army has completed the helicopter probe and the results are under review. Esper drew Trumpâ\u0080\u0099s ire for telling a Pentagon news conference on June 3 that he opposed invoking the Insurrection Act to permit the president to use active duty forces to put down domestic civil unrest. Esper said he saw no need for such an extreme measure, a clear counterpoint to Trumpâ\u0080\u0099s threat to use force. Esper also had previously expressed regret at having accompanied Trump to the presidential photo opportunity in front of St. Johnâ\u0080\u0099s on the day of the Lafayette Square confrontations. In his testimony Thursday, Esper alluded to his worry that the photo op episode could be seen as undermining his apolitical role. â\u0080\u009cAs one of the countryâ\u0080\u0099s most respected institutions, we work to maintain the trust of the American people through our time-honored commitment to our mission and core values, while remaining neutral and non-partisan in all matters,â\u0080\u009d he said. Milley has also expressed public regret that he was part of the scene with Trump, saying his presence â\u0080\u009ccreated a perception of the military involved in domestic politics.â\u0080\u009d"}]}