{"article": [{"url": "https://www.marketwatch.com/story/epa-chief-pledges-less-focus-on-climate-change-2020-09-03", "published": 1599161480.0, "headline": "EPA chief pledges less focus on climate change", "body": "Environmental Protection Agency chief Andrew Wheeler on Thursday defended the Trump administration’s record on protecting the nation’s air and water and said a second term would bring a greater focus on pollution cleanups in disadvantaged communities and less emphasis on climate change. In a speech commemorating the 50th anniversary of the EPA’s founding, Wheeler said the agency was moving back toward an approach that had long promoted economic growth as well as a healthy environment and drawn bipartisan support. “Unfortunately, in the past decade or so, some members of former administrations and progressives in Congress have elevated single issue advocacy — in many cases focused just on climate change — to virtue-signal to foreign capitals, over the interests of communities within their own country,” he said. Environmental groups and former EPA chiefs from both parties have accused Wheeler and his predecessor, Scott Pruitt, of undermining the agency’s mission by weakening or eliminating dozens of regulations intended to protect air and water quality, reduce climate change and protect endangered species. “EPA was founded to protect people — you, me and our families — but the Trump administration has turned it into an agency to protect polluters.” said Gina McCarthy, who led the agency during the Obama administration and now is president of the Natural Resources Defense Council. Under President Donald Trump, EPA has raised the bar for requiring environmental reviews of highway and pipeline construction; reduced limits and reporting requirements for methane emissions; rolled back vehicle fuel economy and emissions standards; slashed the number of protected streams and wetlands; and repealed federal limits on carbon emissions from power plants. Courts have blocked some of the changes, but others have taken effect. In his remarks, Wheeler said that if Trump is re-elected EPA would support “community-driven environmentalism” that emphasizes on-the-ground results such as faster cleanup of Superfund toxic waste dumps and abandoned industrial sites that could be used for new businesses. He pledged to require cost-benefit analyses for proposed rules and to make public the scientific justification for regulations, saying it would “bring much needed sunlight into our regulatory process” and saying opponents “want decisions to be made behind closed doors.” Wheeler spoke at the Richard Nixon library in Yorba Linda, California. The Republican president established the EPA in 1970 amid public revulsion over smog-choked skies and waterways so laced with toxins they were unfit for swimming or fishing. Some of the nation’s bedrock environmental laws, such as the Clean Air Act and the Clean Water Act, were enacted during his administration. Wheeler, an EPA and Senate staffer in the 1990s and a former coal industry lobbyist, said the agency had accomplished much. Lead gasoline, paint, asbestos and dioxins and hundreds of hazardous chemicals and compounds have been banned, he said. “America’s environment today is cleaner than it’s ever been in our lifetimes,” he said, adding that during the Trump administration, air pollution has fallen while Superfund cleanups have accelerated and EPA programs have pumped $40 billion into clean-water infrastructure upgrades. But the agency has become too bureaucratic and confrontational, he said — delaying permits needlessly, issuing conflicting orders to businesses and communities, and backing policies that worsen some environmental problems to solve others. East Coast governors have blocked natural gas pipelines in the name of fighting climate change but the result has been more gas imports from Russia, Wheeler said. He blamed California’s support of greater reliance on renewable energy and less on gas for rolling power blackouts that had resulted in sewage spills. “Instead of confusing words with actions, and choosing empty symbolism over doing a good job, we can focus our attention and resources on helping communities help themselves,” Wheeler said. McCarthy and five other former EPA chiefs whose terms date as far back as the Reagan administration issued a statement this month saying Trump had abandoned the agency’s “core mission of protecting human health and the environment.” “Actions during the Trump administration have further decreased public confidence in the agency’s credibility, undercut its historic dedication to high ethical standards, and affected employee morale,” they said in a joint statement."}]}