{"article": [{"url": "https://www.marketwatch.com/story/toll-booths-or-temperature-stations-at-the-bridges-and-tunnels-2020-07-31", "published": 1596207560.0, "headline": "Toll booths or temperature stations at the bridges and tunnels?", "body": "It’s getting a little close for comfort around here. Bad enough when the coronavirus was scorching distant states like Florida, Texas and Arizona. But what do you do when the New Jersey governor sends out COVID-19 distress signals, the Philadelphia Phillies suspend their schedule and the country clubs of southern Connecticut tell their family members to get tested immediately and please stay home? If you’re New York, you start to worry: How much protection can I-95 and the Holland Tunnel really provide? “We’re not going to Philadelphia,” Toronto Blue Jays manager Charlie Montoyo told reporters at Nationals Park in Washington, citing Pennsylvania’s increased case count and a rising concern across Major League Baseball. “Those games have been postponed. Our plans right now are to stay put and let MLB. work through whatever they’re working through.” No one knows for certain what that could entail. Meanwhile, officials across New Jersey were scrambling to beat back a midsummer explosion of the virus propelled by large indoor gatherings and outdoor family barbecues. And it wasn’t just in the state’s larger cities. Middletown reported 50 new cases after several teenage parties. In Jackson, police on anti-COVID patrol broke up one massive bash where 700 guests were crammed into one very crowded house. And on Long Beach Island, a single party sidelined three dozen lifeguards. Wednesday’s statewide count added an additional 489 coronavirus cases and 18 COVID-19 deaths to the New Jersey total. A day earlier, it was another 565 cases and 24 deaths, the highest one-day jump since June 6. Also read: New York said ‘action,’ but many film and TV cameras won’t get rolling until September or later A frustrated Gov. Phil Murphy urged the state’s young people to, please, cool it. “Over the past four months,” he said, “we have crushed the curve. But folks, this is sobering. Over the past four days, we have reported roughly 2,000 new positive test results. We are now back, plus or minus, to where we were a month ago in the daily number of new cases. We can’t go backwards. We can’t afford to go backwards.” By the time Murphy had finished speaking, another hot zone had already popped up in Darien, Stamford and Greenwich, Connecticut, centered around several country clubs, yet another indication of the virus’s disrespect for the privileges of wealth and suburbia. Darien reported nine new coronavirus cases last week, all but two affecting people 10 to 19 years old. Officials in Greenwich said their caseload was up by 19 from the previous week. The Tokeneke Club and the Country Club of Darien both reported outbreaks among their counselors, visitors and younger members. According to the Darien Times, the clubs are eyeing a group trip taken by young people from Darien and possibly other towns as a potential source of transmission. See: New York metropolitan area lost nearly 1.5 million jobs in June, the most of any U.S. city “Over the last week a large group of positive cases among young people — teenagers and 20-somethings — has been reported in our community as a result of an out-of-town gathering which took place from July 12-15,” said a letter to members of The Tokeneke Club. Tokeneke joined the Country Club of Darien, the Woodway Country Club and the Wee Burn Country Club in a rare public statement: “The above referenced private clubs closely monitor directives and communications from state and local leaders with regard to COVID-19 protocols. We regularly communicate these protocols and any related relevant news to our members and employees as part of our ongoing effort to comply with these directives in order to create a safe environment for our members, guests and staff.” Suddenly, New Yorkers have a right to feel surrounded. Gov. Andrew Cuomo was still clinging to hopeful statistics at week’s end. On Friday, he announced hospitalizations totaled 576, the lowest since March 17. Intensive-care beds were at 140, the lowest since March 16. Intubations were down to 70, the lowest since March 15. And you could add to those steady improvements the state’s 0.93% positive-test rate, meaning that more than 99% of those tested showed no sign of the virus. As states across the south and west saw their case counts skyrocket this summer, New York, New Jersey and Connecticut entered a regional compact, imposing quarantines on a roster that now includes 32 other states plus Washington, D.C., and Puerto Rico. Visitors to the tri-state area from those places are supposed to quarantine for two weeks. Weekend reads: We’re not going to vaccinate our way out of COVID-19 But what happens when the threat arrives from just across the New York state line? Well, you can forget about forehead thermometers at the George Washington Bridge. “We’re working with them,” Cuomo said Thursday of officials in New Jersey. “Obviously, they’re our neighbor. They’ve been our neighbor all through this. I’m hopeful we can get that number down.” And if not? “I don’t know how you could quarantine New Jersey,” Cuomo said. “They don’t fly into New York. You’d have to blockade roads, and we’re not talking about blockading.” Ellis Henican is an author based in New York City and a former newspaper columnist."}]}