{"article": [{"url": "https://www.marketwatch.com/story/microsoft-and-bytedance-put-tiktok-talks-on-hold-after-trump-signals-opposition-2020-08-01", "published": 1596300740.0, "headline": "Microsoft and Bytedance put TikTok talks on hold after Trump signals opposition", "body": "Microsoft Corp. has paused negotiations to buy the U.S. operations of the video-sharing app TikTok after President Trump said late Friday he opposes the deal, according to people familiar with the matter. The president’s statements spurred TikTok to make additional concessions, including agreeing to add as many as 10,000 jobs in the U.S. over the next three years, but it isn’t clear if those will alter Trump’s stance, one of the people said. The software giant MSFT, +2.48% was in advanced talks with TikTok parent Bytedance Ltd., with momentum toward a deal that they believed met the White House goal for the popular app to get bought by a U.S. company, the people said. Those plans were interrupted when Trump told reporters on Air Force One that he preferred to ban the app and wouldn’t support a sale. Before Trump’s remarks, the two sides believed the broad strokes of a deal could be in place by Monday, the people said. The companies were caught off guard by the president’s comments, said one person familiar with the matter. Another person said the White House has been involved in the discussions for weeks and made it clear from the outset that the desired outcome was for TikTok to be “American owned.” In a statement Saturday, a White House spokesperson said, “The administration has very serious national security concerns over TikTok. We continue to evaluate future policy.” The deal talks aren’t believed to be dead, but rather the two companies are trying to get clarity on where the White House stands and whether it is planning a separate action that would make it difficult for TikTok to operate in the U.S., the people said. Trump said that he preferred to ban the app entirely. “As far as TikTok is concerned we’re banning them from the United States,” he said. “Well, I have that authority.” See also: Microsoft in advanced talks to buy TikTok’s US business An expanded version of this story appears on WSJ.com"}]}