{"article": [{"url": "https://www.marketwatch.com/story/vaccine-hopes-and-m-a-action-power-european-stocks-and-u-s-equity-futures-11600070052", "published": 1600086380.0, "headline": "European stock rally fades despite M&A surge and Wall Street gains", "body": "Capped vials of the University of Oxford's COVID-19 vaccine candidate, which has restarted trials after a pause last week. Vincenzo Pinto/Agence France-Presse/Getty Images European stocks closed higher on Monday but gave back earlier gains driven by vaccine hopes and a flurry of M&A activity. The Stoxx Europe 600 index SXXP, +0.55% rose 0.2% after ending last week nearly 1.7% higher, the best weekly return since the week ending August 7. The French CAC 40 FR:PX1 rose 0.4%, but the German DAX DAX, +0.06% and the FTSE 100 index UKX, +0.64% fell 0.1%. Investors will hear from the Federal Reserve, the Bank of England and the Bank of Japan in the coming days in a busy week for central bank meetings. European stocks faded in the afternoon despite a strong start on Wall Street. The Dow Jones Industrial Average DJIA, +0.56% climbed 1.4%, or 377 points, in early trading, while the S&P 500 SPX, +0.87% was 1.7% up and the Nasdaq COMP, +1.39% was 2.4% higher. Renewed hopes over a coronavirus vaccine also helped improved sentiment at the beginning of the week. Pfizer Inc.’s PFE, -0.27% chief executive officer Albert Bourla said in an interview Sunday that the drug maker should know if its COVID-19 vaccine candidate will work by the end of October — and if approved, it could be distributed in the U.S. by the end of the year. Pfizer is partnering with German drug maker BioNTech BNTX, +1.23% on the vaccine’s development. Oxford University also announced Saturday it would resume a trial for the coronavirus candidate it’s developing with AstraZeneca AZN, +0.63%. The study was halted last week following a U.K. patient falling ill pending a review into the “unexplained illness.” Oxford University said it has been deemed safe to continue. Shares of AstraZeneca rose 0.5%. U.S.-based Gilead Sciences Inc. GILD announced a $21 billion deal on Sunday to buy biotech Immunomedics Inc. IMMU, maker of a key breast-cancer drug. Japanese technology conglomerate SoftBank Group Corp. announced a $40 billion deal late Sunday to sell U.K.-based microprocessor designer Arm Holdings to chipmaker Nvidia NVDA, -0.54% for a mix of cash and stock. The technology sector was also lifted by M&A, with shares of chip equipment maker ASML Holding NV ASML, +2.12% ASML, +1.83% up 0.9%. And the race for TikTok is heating up. Software group Oracle Corp. ORCL, +0.42% had been tipped to take over the video-sharing app’s U.S. after China’s ByteDance apparently rejected an offer from technology giant Microsoft Corp. MSFT, +2.48% But in the latest twist, Chinese state media say ByteDance has turned down Oracle as well. Elsewhere, Euronext NV ENX, -4.39% said Monday that it has submitted a non-binding offer to acquire Borsa Italiana from London Stock Exchange Group PLC LSE, +0.40%. The pan-European exchange partnered with Italian lenders Cassa Depositi e Prestiti Equity and Intesa Sanpaolo SpA ISP, +0.21% on the offer. Euronext shares slipped 2.5% and London Stock Exchange shares fell 0.8%."}]}