{"article": [{"url": "https://www.marketwatch.com/story/alphabet-q2-display-ad-spending-is-still-in-a-rut-2020-07-30", "published": 1596130460.0, "headline": "Alphabet Q2 results show ad spending is still in a rut", "body": "Google parent Alphabet Inc. met street expectations Thursday despite a dip in advertising that bedeviled the company for a second straight quarter. The company GOOGL, +1.82% GOOG, +1.97% reported net income of $6.96 billion, or $10.13 a share, compared with net income of $9.95 billion, or $14.21 a share, in the year-ago quarter. Revenue after removing traffic-acquisition costs declined to $31.6 billion from $31.7 billion in the year-ago period. Analysts surveyed by FactSet had estimated $7.95 a share on ex-TAC revenue of $30.66 billion on average. The second-quarter results, announced after the market’s close Thursday, initially sent Alphabet shares up 2% in after-hours trading. But the results sunk to flat after investors digested a $2.6 billion decline in year-over-year advertising revenue. “We continue to navigate through a difficult global economic environment,” Alphabet Chief Financial Officer Ruth Porat said in a statement announcing the results Thursday. She noted improvement in ad sales as the quarter progressed. “We’re all grappling with a pandemic and uncertain economy,” Alphabet Chief Executive Sundar Pichai added in a conference call with analysts later. Though $29.9 billion of Google’s total quarterly revenue of $38.3 billion came from advertising, underscoring its dependence on a struggling market, there were bright spots. Sales from Google Cloud and YouTube continued to swell in a growing sign of versatility in the company’s overall product line — YouTube ad revenue increased 6%, to $3.8 billion from $3.6 billion a year ago, while Google Cloud sales grew 43%, to $3 billion from $2.1 billion. Google’s softening sales, especially in travel, punctured its previous quarter’s performance and will most likely continue throughout the year. Monness Crespi Hardt analyst Brian White warns Google not only faces increased competitive pressure from Facebook Inc. FB, +0.26% , Amazon, Snap Inc. SNAP, -0.18% , and Twitter Inc. TWTR, -0.23% but serious antitrust investigations around its ad business. Read more: Google is being squeezed by a softening ad market that has cut more than $8 billion from sales expectations In a nod to competition from Amazon.com Inc. AMZN, +3.01% , Google last week said it will eliminate commission fees for retailers. “Long run, I see a growth opportunity,” Pichai told analysts during the call. Google is navigating an industry badly battered by the pandemic in the spring, and bracing for another rough quarter if a second national lockdown occurs. The good news is digital advertising is getting the bulk of spending, at the expense of broadcast and print media. “There is a truism that in advertising a vast majority of spending tends to congregate in the second half of the year with Black Friday, the holiday season, and a rush to spend your budget,” Julian Baring, general manager of Americas at digital media advertising company Adform, told MarketWatch in a phone interview Thursday. “On the other hand, when the economy takes a downturn, ad spending tends to go first.” This makes the second half of 2020 all the more crucial for Google, JMP Securities analyst Ron Josey told MarketWatch in a phone interview. He rates Google shares as outperform, with a price target of $1,500. “Google’s new reporting metrics are helpful.” Longer term, Josey and others are keeping a close eye on antitrust investigations of Google’s ad business over the coming months, and how it may impact operations. On Wednesday, Pichai, Apple Inc. AAPL, +1.74% CEO Tim Cook, Amazon.com Inc. AMZN, +3.01% CEO Jeff Bezos, and Facebook Inc. FB, +0.26% CEO Mark Zuckerberg testified before the House on their business practices and enormous market power. Read more: Antitrust questions bruise but don’t break Big Tech CEOs in historic hearing Pichai was especially grilled on Google’s role as a middleman in the online-advertising market, its manipulation of search results to benefit the company’s bottom line, and charges it steals content from developers. When pressed during the conference call on the regulatory climate, Pichai said he is confident in Google’s focus on users and offering them plenty of product choices at lower prices. “We operate by the rules, and if we need to change [business operations to adhere to rules], we will,” he said. Alphabet shares are up 15% in 2020. The broader S&P 500 index SPX, +0.87% is down 0.% this year."}]}