{"article": [{"url": "https://www.marketwatch.com/story/its-been-100-days-since-coronavirus-sent-the-stock-market-to-rock-bottom-heres-what-comes-next-after-its-best-rally-over-that-period-in-80-years-2020-07-01", "published": 1593610100.0, "headline": "It's been 100 days since coronavirus sent the stock market to rock bottom. Here's what comes next after its best rally over that period in 80 years", "body": "Legendary. That's how Bespoke Investment Group characterized the past 100 days for the U.S. stock market after the COVID-19 pandemic sent equities reeling to a low on March 23 and then recovered, implying there may be more gains to come, if history is any guide. \"As long as the S&P 500 finishes today in positive territory, the current 100-day rally (not including Wednesday) will go down as the strongest 100-calendar rally since 1933, and barring a major decline today, it will still be the strongest 100-calendar day rally since 1938,\" the research and investment group wrote in a Wednesday report. Check out: Why stock-market strategists have never been more confused in June about the year-end outlook for equities Indeed, the S&P 500 SPX, +0.87% index has climbed nearly 40% since falling more than 33% to 2,237.40 in late March. Meanwhile, the Dow Jones Industrial Average DJIA, +0.56% has climbed by about the same amount in the same time and the technology-laden Nasdaq Composite Index COMP, +1.39%  has surged 48% since the nadir in March. It's worth noting that the move amounted to the best quarterly gain for the S&P 500 since 1998, the best quarter for the Dow since 1987, and the sharpest such rally for the Nasdaq since 1999, according to Dow Jones Market Data. But what happens from here after such a brisk 100-day run (see chart which shows performance on a rolling 100-day period)? Bespoke, tracking only a handful of other times that the market saw a similar period of parabolic returns, indicates that average returns have been higher in the following one-month, three-month, six-month and one-year periods. Only the one-week period has been lower the researchers show. On average, the return is about 6.4% for the one-month period and more than 7% three and six months out but about 13.5% in the following year (see attached chart). To be sure, past results are no guarantee of the future, particularly given that this downturn has been predicated on a public-health crisis unlike anything seen in the last 100 years. But Bespoke's researcher aren't the only ones estimating that powerful gains beget powerful gains. SunTrust Advisory chief market strategist Keith Lerner said that while history was \"only a guide,\" he expected it to be repeated with the onset of a bull market and the S&P 500 higher next year, even if he expected the path forward to be a bumpy one as the economy reopens in \"fits and starts.\" Read: Here's what history tells us happens after the S&P 500's best quarters of all time"}]}