{"article": [{"url": "https://www.marketwatch.com/story/us-likely-to-be-joined-by-russia-india-brazil-on-eu-travel-ban-roster-2020-06-29", "published": 1593438800.0, "headline": "U.S. likely to be joined by Russia, India, Brazil on EU travel-ban roster", "body": "BRUSSELS (AP) — The European Union is edging toward finalizing a list of countries whose citizens will be allowed to enter Europe again in coming days, with Americans almost certain to be excluded in the short term due to the number of U.S. coronavirus cases. Spain’s foreign minister said that the list could contain 15 countries that are not EU members and whose citizens would be allowed to visit from July 1. EU diplomats confirmed that the list would be made public on Tuesday. The diplomats spoke on condition of anonymity because the procedure is ongoing and politically very sensitive. See:EU set to name countries from which tourists will be welcomed next month, and U.S. didn’t make the cut EU envoys in Brussels worked over the weekend to narrow down the exact criteria for countries to be included, mostly centered on their ability to manage the spread of the disease. Importantly, the countries are also expected to drop any travel restrictions they have imposed on European citizens. The number of confirmed cases in the United States has surged over the past week, and President Donald Trump also suspended the entry of all people from Europe’s ID check-free travel zone in a decree in March, making it highly unlikely that U.S. citizens would qualify. Infection rates in Brazil, Russia and India are high, too, and their nationals are also unlikely to make the cut. A man transports boxes across an empty Grand-Place in Brussels. Getty Images Spanish Foreign Minister Arancha González Laya said the EU is considering whether to accept travelers from China if Beijing lifts restrictions on European citizens. Morocco is another possibility, although its government doesn’t plan to open borders until July 10. She said she wasn’t aware of pressure from the United States for the EU to reopen travel to its nationals, adding that countries have been chosen according to their coronavirus statistics — whether similar or not to that in the EU — trends of contagion and how reliable their data is. “This is not an exercise to be nice or unfriendly to other countries, this is an exercise of self-responsibility,” she told Spain’s Cadena SER radio on Monday. The safe country list would be reviewed every 14 days, with new countries being added and some possibly dropping off, depending on how the spread of the disease is being managed. Non-EU nationals already in the bloc wouldn’t be affected. More than 15 million Americans are estimated to travel to Europe annually, and any delay would be a further blow to virus-ravaged economies and tourism sectors on both sides of the Atlantic. Around 10 million Europeans are thought to cross the Atlantic for vacations and business each year. The 27 EU nations and four other countries that are part of Europe’s “Schengen area” — a 26-nation bloc where goods and people move freely without document checks — appear on track to reopen borders between each other from Wednesday. Once that happens and the green light is given, restrictions on nonessential travel to Europe from the outside world, which were imposed in March to halt new virus cases from entering, would gradually be lifted. Brussels fears that opening up to countries outside in an ad hoc way could lead to the reintroduction of border controls between nations inside the Schengen area, threatening once again Europe’s cherished principle of free movement, which allows people and goods to cross borders without checks."}]}