{"article": [{"url": "https://www.marketwatch.com/story/uber-lyft-drivers-in-limbo-as-judge-hears-arguments-in-case-brought-by-california-11596760363", "published": 1596746420.0, "headline": "Uber, Lyft drivers in limbo as judge hears arguments in case brought by California", "body": "Uber and Lyft on Thursday defended against a lawsuit, brought by California and San Francisco, Los Angeles and San Diego, accusing the companies of not complying with a law to classify their drivers as employees. Getty Images A judge said Thursday he would probably decide “within a matter of days, not weeks,” whether he will order Uber Technologies Inc. and Lyft Inc. to immediately comply with a California law that classifies their drivers as employees, in a closely watched case that could deal a blow to the business models of the ride-hailing giants. The pending decision by Judge Ethan Schulman of the San Francisco County Superior Court on the lawsuit by California’s attorney general and the city attorneys of San Francisco, Los Angeles and San Diego — who are seeking an immediate injunction ordering the two companies to reclassify their drivers — could have wide-reaching repercussions on the gig economy. Schulman mentioned a few times that he was struggling to balance the harms that an immediate injunction could bring, especially after Lyft LYFT, +2.16% attorney Rohit Singla characterized it as a “dramatic” and unprecedented action that would be burdensome to the companies and could lead to hundreds of thousands of drivers losing “income opportunities.” “I feel a little bit like I’m being asked to jump into a body of water without really knowing how deep it is, how cold the water is and what’s going to happen when I get in,” the judge said during the nearly three-hour-long hearing in San Francisco, which was conducted virtually. AB 5, which became law on Jan. 1, codified a 2018 California Supreme Court ruling. The ruling, known as Dynamex, adopted an “ABC test” that says workers can be considered contractors only if they control their work; if their duties fall outside the scope of a company’s normal business; and if they are “engaged in an independently established trade, occupation or business.” Uber attorney Theane Evangelis argued that some changes the company has implemented since AB 5 went into effect, including allowing drivers to set their own rates in a limited fashion, ensure that the company can meet the ABC test. When AB 5 passed, it was widely seen as a threat to the gig economy’s business model, which relies on independent contractors who are not provided guaranteed minimum wages or benefits. The drivers’ lack of benefits became even more pronounced during the coronavirus crisis, as demand for rides plunged amid widespread lockdowns. Drivers did not have paid time off or employer-backed health care amid a pandemic. Many sought unemployment benefits. “What we think is dramatic is that these workers are being systematically denied a wide range of employee protections and being harmed by these practices,” said Matthew Goldberg, deputy city attorney for the San Francisco City Attorney’s office. In their lawsuit, the state attorney general and city attorneys list as violations the companies’ failure to pay unemployment insurance taxes and other taxes toward the state’s social insurance programs. Goldberg pointed out Thursday that the two companies have more than $11 billion of cash reserves combined. Uber UBER, -0.18% and Lyft argued that they should not have to comply with AB 5 until after California residents vote on Proposition 22, an initiative the companies backed that will be on the state ballot in November. It seeks to define ride-hailing and delivery drivers as independent contractors and establish specific labor and wage regulations for app-based companies. The companies often say they provide drivers with flexibility, and attorneys for both Uber and Lyft made that same argument Thursday. But San Francisco City Attorney Dennis Herrera said in a statement after the hearing that “There is no rule that prevents these drivers from continuing to have all of the flexibility they currently enjoy. Being properly classified as an employee doesn’t change that.” Uber declined comment Thursday. Lyft did not immediately respond to a request for comment. Uber and Lyft are also facing other lawsuits over worker classification, including ones filed this week by California’s labor commissioner accusing the two ride-hailing giants of wage theft “by willfully misclassifying drivers as independent contractors instead of employees.” The lawsuits filed Wednesday in Alameda County Superior Court against each company by Lilia Garcia-Brower seek back wages, damages and penalties, including for failure to provide minimum wages, rest breaks, overtime pay and more. According to Nicole Moore, a Los Angeles-based organizer with Rideshare Drivers United, more than 5,000 drivers have filed wage claims with the state. “You can’t really overlook claims of $1.35 billion,” she said in an interview. In a letter to drivers dated Aug. 5, the California Division of Labor Standards Enforcement said those claims would be dismissed by the state because it is now suing the companies and seeking those wages on drivers’ behalf. See: Uber’s delivery business tops core ride-hailing as pandemic rocks earnings Thursday’s hearing came on the same day Uber reported that it lost $2 billion in the second quarter as rides plunged 67% compared with the year-ago quarter. Lyft is scheduled to report its results next week."}]}