{"article": [{"url": "https://www.marketwatch.com/story/why-we-need-water-futures-11600977377", "published": 1600963460.0, "headline": "Why we need water futures", "body": "Water is pumped into an irrigation canal on May 8, 2015 in Biggs, California. Justin Sullivan/Getty Images Investors will be able to make wagers on the price of water later this year with the launch of futures contracts, which are expected to better balance supply and demand for the commodity and hedge price risks. “The water sector had long wished for some market structure for price discovery and the ability to hedge risk,” says Deane Dray , a managing director and multi-industry analyst at RBC Capital Markets. “If this new futures contract shows promise, it could spawn more innovation in the futures market related to water.” CME Group CME, -0.87% and Nasdaq NDAQ, +0.36% announced a plan on Sept. 17 to launch the Nasdaq Veles California Water Index futures contract, which will have a settlement price based on its namesake index, late in the fourth quarter of this year, pending a regulatory review. The contract will allow investors to hedge price risks in the spot water market and better manage price swings, says Tim McCourt, CME Group’s global head of equity products and alternative investments. The index, itself, sets a weekly spot rate price of water rights in California, the majority of which are owned and managed by water districts that deliver water to individual farms, says Clay Landry , managing director at consulting firm WestWater Research, which provides the data used to calculate the index. Some farms own water rights directly, he says; other water-rights owners include municipalities, industrial companies, water utilities, and tribes. On Sept. 23, the Nasdaq Veles California Water Index set the weekly spot price of water rights at $510.99 per one acre-foot. The unit of measure represents the amount of water required to submerge one acre of land in one foot of water—equivalent to about 325,851 gallons of water. Each futures contract based on the index will represent 10 acre-feet of water. The index is “reflective of arm’s-length economic efforts to determine fair value” for water, says Patrick Wolf, lead product developer with Nasdaq Global Information Services. The focus on the California market offers both relevance and robustness in the depth and breadth of participants and the value of transactions, he says. Wolf points out that the index is up markedly this year following an extremely dry winter in California, with February 2020 marking the driest February for the state in at least 100 years. For commodities, “supply conditions are extremely variable year to year, and the relative scarcity of water is what determines price,” Wolf says. Future price risk is a key feature of the California water market, and this index “captures and distills that risk in real time.” Whether the index is “substantially up or down, it is adding tremendous value to the marketplace.” Year to date, the index value has doubled, boasting a return of more than 100%. The water futures contract will be specific to prices in California, a state that the CME’s McCourt refers to as having among the “most active and dynamic water markets” in the U.S. California saw more than $1.1 billion in water-market activity last year, he says, and having a “robust, transparent futures market can help more efficiently align supply and demand of this vital resource,” which may, in turn, help consumers. RBC’s Dray, meanwhile, points out that “what California is paying for water has little relevance for other parts of the country.” He also expresses skepticism about the new contract, saying water futures would be a niche “unlikely to generate enough open interest,” or volume of contracts, “to support a reliable forward-pricing model.” Still, Dray said he and his team will examine this new security more closely, “to see what the potential might be.”"}]}