{"article": [{"url": "https://www.marketwatch.com/story/mortgages-rates-fall-to-a-new-record-low-but-not-all-americans-will-be-able-to-access-them-2020-09-10", "published": 1599907640.0, "headline": "Mortgage rates fall to a new record low - but not all Americans will be able to access them", "body": "Mortgage rates have dropped to all-time lows for the ninth time in 2020. But Black Americans could face an uphill battle accessing this historically-cheap home financing. The 30-year fixed-rate mortgage averaged 2.86% for the week ending Sept. 10, falling 13 basis points from the week prior, Freddie Mac FMCC, +0.52%  reported Thursday. The previous record low was set in early August at 2.88%. In comparison, these loans had an average rate of 3.56% a year ago. The 15-year fixed-rate mortgage decreased five basis points to an average of 2.37%, while the 5-year Treasury-indexed hybrid adjustable-rate mortgage jumped 18 basis points higher to 3.11% on average. The decline in the benchmark 30-year mortgage was a reflection of \"a late summer slowdown in the economic recovery,\" said Sam Khater, chief economist at Freddie Mac. A more tumultuous week in the stock market also affected the rates lenders were offering. \"The 30-year fixed mortgage rate declined due to investors moving away from the steep drop in equity markets and towards the relative safety of bonds,\" said George Ratiu, senior economist for Realtor.com. Also see: Renters in U.S. cannot be evicted through the end of the year due to coronavirus, CDC order states But many Americans won't be offered these rock-bottom rates - particularly people of color. A recent LendingTree study found that Black home buyers are more likely to receive a high-cost mortgage to buy a home than the overall population. High-cost mortgages are loans with an annual percentage rate (APR) higher than the benchmark Average Prime Offer Rate defined by the Federal Financial Institutions Examination Council. The share of Black buyers who receive high-cost home loans was nearly nine percentage points higher than the overall population, LendingTree TREE, -0.37%  found based on an analysis of Home Mortgage Disclosure Act data. However, all real-estate is local, and in some parts of the country Black Americans are far more likely to be presented with a high-cost loan. In Cleveland, over one in four (26.6%) Black home buyers took out a high-cost mortgage, while the overall share of buyers with high-cost loans was just 9.5%. That represents a difference of 17 percentage points. LendingTree's findings match what other researchers have reported about the discrepancies people of color face when they take out home loans. Realtor.com recently reported that home buyers in predominately Black communities were issued mortgages with interest rates that were 13 basis points higher than in white neighborhoods. And a recent analysis of Home Mortgage Disclosure data from Zillow ZG, -0.42%  found that Black mortgage applicants were denied loans at an 80% higher rate than white applicants. Read more:The Big Move: I'm tired of renting in Manhattan, but love living in New York. Is now the time to buy if the city is supposedly dead? To be sure, these discrepancies are not necessarily indicative of explicit racial bias on the parts of lending officers and banks. Rather, it's a reflection of how people of color in the U.S. are often at an economic disadvantage. Black Americans are more likely to have lower credit scores or have thin credit files than their white peers, which can contribute to a mortgage company offering a higher rate or denying them a loan outright. Plus, the racial gap in earnings makes it harder for people of color to amass the savings needed to make a larger down payment, which can lower the interest rate they are assigned. \"Not all consumers can take advantage of low rates,\" Tendayi Kapfidze, chief economist at LendingTree, wrote in the credit comparison website's report. \"Depending on factors like their income, employment history and credit score, the rates that some borrowers receive may be significantly higher than record lows.\""}]}