{"article": [{"url": "https://www.marketwatch.com/story/what-has-covid-19-done-to-our-retirement-savings-11599572812", "published": 1599740900.0, "headline": "What has COVID-19 done to our retirement savings?", "body": "Twentieth Century Fox Film Corporation. All rights reserved./Courtesy Everett Collection COVID-19 has disrupted life as we knew it, upending our daily lives, threatening the health of many, and exacerbating the financial stress already facing many families. The short-term impacts have been substantial and have received considerable attention, but we should not lose sight of the potential for long-term financial consequences, especially on retirement security. Short-term relief, long-term consequences As millions of Americans found themselves out of work and many small businesses were forced to close at least temporarily, policy makers responded with aid to individuals and companies: unemployment benefits, the Paycheck Protection Program, and more. The bipartisan CARES Act relaxed regulatory restrictions and tax burdens so someone could withdraw up to $100,000 from retirement savings to meet more-immediate obligations if they or their spouse were diagnosed with coronavirus, or they have been affected financially by the pandemic. The early data suggest that relatively few have taken advantage of the ability to stop contributing to or make hardship withdrawals from their 401(k) plans; most plans report that less than 5% of their participants took that step. This could be a result of government assistance and efforts by these businesses to provide additional education to their employees and discourage them from taking Coronavirus-Related Distributions (CRDs) and more loans. Nevertheless, 3,200 individuals had already withdrawn the full $100,000 hardship limit by April 2020, according to one report, which alone represents $320 million in savings that evaporated. According to Vanguard’s survey How America Saves 2020, fewer than 2% of participants took CRD withdrawals, with an approximate median of $10,000. This may seem like a small price to pay for financial security now, but a worker who withdraws $10,000 at age 35 could miss out on approximately $43,000 in retirement savings by age 65. Employers shedding jobs, not retirement plans So far, early fears that some employers might end retirement plans or stop their contributions to employee plans have not been realized. According to surveys by Mercer and the Plan Sponsor Council of America (PSCA), few have suspended the employer match and almost none have terminated plans. Ironically, larger businesses — with more than 500 employees — were somewhat more likely to have suspended match contributions than small businesses. These and other surveys also confirm that most retirement plan sponsors have adopted at least one of the optional CARES Act provisions. According to the PSCA, these include letting participants take CRDs (64%) or increasing plan loan amounts (37%). One business in five has not yet decided, and only 10% are not implementing any of the CARES provisions. While employers may be staying the course in providing retirement benefits to their workforces, one of their biggest cost-cutting measures has been permanent employment terminations and/or furloughs, which creates one of the biggest setbacks to accumulating savings: permanent job loss. Individual Confidence Shaken Despite some signs of optimism on the retirement savings front, many risks remain. The initial wave of government support for individuals and businesses has run out, and there are still questions about how resilient the economy will be. In recent weeks, major retailers have begun filing for bankruptcy and large employers are announcing significant layoffs. A Federal Reserve survey found that more than one-third of those who lost a job or had their hours reduced could not pay their bills in full in April 2020 — just one month after the pandemic shutdown much of the country. Continued job losses, wage reductions, and overall uncertainty will all take a toll on workers and their savings. According to the U.S. Census, 49% of American adults live in households that have experienced losses in employment income since March. The losses are even greater for African Americans (56%) and Latinx (62%) workers. While some individuals may have begun to return to work, more than 35% of American adults still expected a loss of employment income at least through August, if not longer. A recent survey found that 71% of Americans believe the pandemic will have a negative impact on their retirement plans. Some workers close to retirement may throw in the towel and retire now. The rate of early retirement for individuals who are 65 or older already increased by at least 7 percent between April 2019 and April 2020. There are also warning signs among younger Americans: 39% of Generation X workers already believe that they may need to delay retirement. On the bright side, though, three out of four planned to prioritize retirement savings once the COVID-19 crisis ends. The gyrations of the equity markets over the past six months create additional issues for retirement savings. In the first quarter of 2020, 401(k) plan values dropped by 20%. The market has rebounded since then, but the longer the COVID-19 health risks remain, the greater the potential for further market volatility and its economic impact on retirement savings and income. Disproportionate impact on low-income and minority households Tens of millions of low-income BIPOC (Black, Indigenous, and People of Color) cannot afford to take the appropriate measures to protect themselves from COVID-19, such as working from home or keeping children away from elderly grandparents. Women of color are more likely than men to forego wages and stay home as caregivers if a loved one falls ill. Low-income and minority households are also less likely to have access to quality health care and paid leave, forcing them to choose between their health or their job should they contract the virus. Building a stronger foundation for recovery We do not yet know how much deeper this hole may get — when the pandemic began, approximately half of the private sector workforce already lacked access to ways to save for retirement — or how much longer the disruption will last. Even once we turn the corner, we cannot be sure how long it will take for individuals’ retirement savings to recover. In a 2019 study, more than half of the workers surveyed said that they had not yet fully recovered from the Great Recession a full decade later, and 7% believed they might never be able to do so. It will take time to understand the additional damage to retirement savings caused by COVID-19, but we do have tools and information that we lacked in 2008. Employers and plan providers appear to be making more of an effort to educate workers about the long-term consequences of raiding their retirement funds and helping prevent this by offering emergency savings accounts. State-based retirement savings programs and the SECURE Act’s pooled employer plans, which did not exist after the Great Recession, aim to expand access and can provide a stronger foundation for recovery. These resources should help workers get back to saving more quickly, even as momentum grows to create universal access to retirement savings. This crisis presents another opportunity to apply the lessons, knowledge, and tools to protect and strengthen retirement security more effectively. Angela Antonelli is a Research Professor and the Executive Director of the Georgetown University Center for Retirement Initiatives (CRI) at the McCourt School of Public Policy."}]}