{"article": [{"url": "https://www.marketwatch.com/story/tracking-trump-where-the-president-was-and-who-he-came-in-contact-with-before-announcing-his-positive-coronavirus-test-11601645187", "published": 1601631260.0, "headline": "Tracking Trump: Where the president was and whom he came in contact with before announcing his positive coronavirus test", "body": "President Donald Trump's and first lady Melania Trump's coronavirus diagnoses came on the heels of news that White House aide Hope Hick's had contracted the virus. Saul Loeb/Agence France-Presse/Getty Images President Donald Trump had a busy week of campaigning before announcing early on Friday morning that he and the first lady Melania Trump had tested positive for coronavirus, bringing COVID-19 into the heart of the American administration. His diagnosis came shortly after it was revealed that a trusted aide, Hope Hicks, had tested positive for the virus. Hicks was in close contact with the president and members of the core White House team during the period in which she was likely contagious. The World Health Organization says that transmission of COVID-19 is “primarily occurring from people when they have symptoms, and can also occur just before they develop symptoms, when they are in close proximity to others for prolonged periods of time.” Trump, who has long underplayed the seriousness of the virus, has been vocal about his aversion to germs but rarely appears in public wearing a face mask. He has convened fundraising events and large rallies against the advice of medical practitioners, who recommend social distancing to stop the spread of the coronavirus that causes COVID-19. Here’s a reverse timeline of where Trump was, and whom he met with, in the run-up to his diagnosis: Thursday, Oct. 1 Trump flew from Washington, D.C., to Morristown, N.J., from where he transited to Bedminster, N.J., for a fundraising event at his golf club there. At 3 p.m., he participated in a roundtable with supporters and shortly after delivered remarks at a fundraising committee reception. The president left his golf club and arrived back at the White House at 6:30 p.m. In the evening, he appeared remotely on Sean Hannity’s Fox News show, where he revealed that he and Melania Trump were awaiting the results of coronavirus tests. Hope Hicks had tested positive at that point. “We spend a lot of time with Hope,” the president told Hannity. Wednesday, Sept. 30 The president was in proximity with Hicks on Wednesday, when she apparently showed symptoms that would have made her contagious. Trump and his entourage, including Hicks, Dan Scavino, Stephen Miller, and son-in-law Jared Kushner, left Washington in the afternoon. Flying to Minneapolis, the group went to the residence of Marty Davis, the chief executive of quartz-countertop company Cambria. Davis hosted a private fundraising committee event that the president attended into the evening. The group then flew from Minneapolis to nearby Duluth, Minn., where the president spoke to his supporters at a rally before flying back to D.C. at night. According to reports, Hicks began feeling ill around the time of the rally and showed symptoms of COVID-19 on the return flight, where she was apparently isolated aboard the plane. Tuesday, Sept. 29 Trump and the first lady left Washington in the afternoon, flying to Cleveland for the first presidential debate against Democratic rival Joe Biden. Hope Hicks was in attendance. The president spent about four hours at the InterContinental Suites Hotel in Cleveland immediately before the debate. Trump and Biden didn’t shake hands publicly at the debate, and were at least 1 meter, or just more than 3 feet, away from each other — the minimum distance recommended by the World Health Organization for physical distancing. It is unclear whether the two were tested for the virus ahead of the debate. Monday, Sept. 28 The president made an announcement in the Rose Garden on the nation’s coronavirus testing strategy. Vice President Mike Pence, assistant secretary for health Brett Giroir, Mississippi Gov. Tate Reeves, and one of Trump’s coronavirus advisers, Scott Atlas, all spoke at the event, but at a different podium, distanced from the president. Members of Congress and state officials were in attendance. In the afternoon, the president reviewed a truck manufactured by Lordstown Motors on the White House grounds, alongside two members of Congress and three representatives from the manufacturer. Trump stood next to Lordstown Motors founder Steve Burns."}]}