{"article": [{"url": "https://www.marketwatch.com/story/oscars-set-new-standards-for-best-picture-category-to-encourage-diversity-2020-09-08", "published": 1599604700.0, "headline": "Oscars set new standards for best-picture category to encourage diversity", "body": "In an historic move, the Oscars are raising the inclusion bar for best picture nominees starting with the 96th Academy Awards in 2024. The Academy of Motion Picture Arts and Sciences on Tuesday laid out sweeping eligibility reforms to the best picture category intended to encourage diversity and equitable representation on screen and off, addressing gender, sexual orientation, race, ethnicity and disability. The film academy has established four broad representation categories: On screen; among the crew; at the studio; and in opportunities for training and advancement in other aspects of the film’s development and release. Each standard has detailed subcategories as well. To meet the on-screen representation standard, a film must either have at least one lead character or a significant supporting character be from an underrepresented racial or ethnic group, at least 30% of secondary roles must be from two underrepresented groups or the main storyline, theme or narrative must be focused on an underrepresented group. According to the academy, underrepresented groups include women, people of color, people who identify as LGBTQ+ or people with disabilities The best picture award, which is handed out to the producers of a film, is the one category which every film academy member can vote for. Earlier this year, the South Korean film “Parasite” became the first non-English language film to win the award. All other categories will be held to their current eligibility requirements. “The aperture must widen to reflect our diverse global population in both the creation of motion pictures and in the audiences who connect with them,” said Academy President David Rubin and CEO Dawn Hudson in a written statement. “We believe these inclusion standards will be a catalyst for long-lasting, essential change in our industry.” The second category addresses the creative leadership and crew composition of a film. In order to meet the standard a film must have either at least two leadership positions or department heads be from an underrepresented group and at least one be from an underrepresented racial or ethnic group; at least six other crew be from an underrepresented racial or ethnic group; or at least 30% of the film’s crew be from an underrepresented group. The third category deals with paid internship and apprenticeship opportunities as well as training opportunities for below-the-line workers, and the fourth category addresses representation in marketing, publicity and distribution teams. The inclusion standards form will be confidential and will not be required for best picture hopefuls for the 94th and 95th Academy Awards. The inclusion standards were developed by a task force led by academy governors DeVon Franklin and Jim Gianopulos and in consultation with the Producers Guild of America. They also took into account diversity standards used by the British Film Institute and the British Academy of Film and Television Awards. These changes will also not affect the 93rd Academy Awards, although the academy has had to make a few alterations because of COVID-19’s effects on the movie business, including pushing the ceremony back two months to April 25, 2021 and allowing films that debuted on a streaming service to be eligible for best picture."}]}