{"article": [{"url": "https://www.marketwatch.com/story/the-stock-market-is-cheating-us-alland-heres-by-how-much-2020-07-31", "published": 1596459680.0, "headline": "The stock market is cheating us allâ\u0080\u0094and hereâ\u0080\u0099s by how much", "body": "For most of the middle class, the stock market is going to make the difference between retiring with dignity or not retiring at all. We havenâ\u0080\u0099t got gold-plated, â\u0080\u009cdefined benefitâ\u0080\u009d final salary schemes, we didnâ\u0080\u0099t inherit trust funds, and we know that Social Security is there to provide a basic level of existence but little more. So if we want to escape the rat race and kick back, sooner or later, itâ\u0080\u0099s going to come down to what we manage to save in our 401(k)s, IRAs and other retirement accounts each year, and how much that money earns in annual returns. 80% of older Americans can't afford to retire - COVID-19 isn't helping But this week there dropped into my inbox a document which proved, once again, that you and I are getting shortchanged, every year. Big time. And thatâ\u0080\u0099s even if we do everything â\u0080\u009cright.â\u0080\u009d The document? The latest annual Public Pension Study from the American Investment Council, the trade body that represents the private equity industry. It demonstrates, once again, that private-equity funds continue to beat the â\u0080\u009cpublicâ\u0080\u009d stock market funds available to everyone else, by a country mile too. It may sound innocuous, or technical, but it isnâ\u0080\u0099t. It means quite simply that the stock market is failing to extract the full value out of companies. Vast amounts of money are being left on the tableâ\u0080\u0094for private-equity funds, and especially their managers, to gobble up. Read: Bye, boomer: The coming cull for workers over 50 The great journalist Michael Kinsley used to point this out every time there was a big buyout deal and a company was taken private. We all know the story. Amalgamated Widgets is trading at $40 a share. Along comes a buyout fund offering $50 or $60 a share. Five years later the buyout fund sells Amalgamated Widgets (rebranded, probably) to someone else for $150 a share. Good for them, bad for us. But if the company was really worth $150 a share, or even just $60 a share, how come the public markets were only able to squeeze $40 in value out of it on their own? Weâ\u0080\u0099re getting robbed. Incompetent managers and overstaffed bureaucracies are effectively stealing large sums of money from the stockholders, right under our noses. Read: This sector could have a half million job openings for older workers The latest study gives an idea of the size of the offense. Private-equity funds owned by state pensions earned an average of 13.7% a year over the most recent 10-year period, a full percentage point a year ahead of their public stock market investments, according to the AIC. That may not sound like much, but itâ\u0080\u0099s huge, because these return figures are net of feesâ\u0080\u0094and in private equity the fees are enormous. Typically theyâ\u0080\u0099re around 2% of the assets under management each year, plus 20% of the profits. Factor these in and the private-equity funds must have earned somewhere around 19% a year on their investments, gross. Read: How to protect your money â\u0080\u0094 at any age So under hard-charging, value-oriented, incentivized management, companies could generate around 19% a year instead of 12.7%. Imagine what you could do with a 19% annual return on your investments. Imagine when you could retire. So even if we kept all our money in low-cost index funds, we were missing out on maybe a third of the money we should have been making. Yes, itâ\u0080\u0099s tempting to be skeptical of the marketing claims put out by the private equity industryâ\u0080\u0099s trade association, especially at a time when they are trying to get their hands on our 401(k) money. But these claims are not in isolation. Multiple studies have found over many decades that private equity has continued to outperform the public stock market, even after their epic fees. If you want to see why, just take a walk around your office. If you work for any kind of public company, especially a big one, you can probably see the waste, incompetence and inefficiency everywhere you look. For me, a few years working as a management consultant were the equivalent of Keanu Reeves swallowing the red pill in the movie â\u0080\u009cThe Matrix.â\u0080\u009d Itâ\u0080\u0099s revealed a shocking truth to me that I can never unsee: What consultants in cost-cutting mode typically call â\u0080\u009cquick winsâ\u0080\u009d and â\u0080\u009clow hanging fruitâ\u0080\u009d everywhere. Your typical big company is full of people who would be expensive even if they worked for free. Itâ\u0080\u0099s like a form of organizational isometrics, where you have different groups of managers balancing each other out. And management rarely really cuts costs. The reason? Managers are almost the biggest waste. The longer the job title, the easier the decision. Instead they cut front-line staff. And hire some assistant managers to help them. Whatâ\u0080\u0099s especially egregious is when you look at millions the CEOs are paid as â\u0080\u009cincentives.â\u0080\u009d And yet here they are, demonstrably wasting about a third of the potential annual returns every year. No one gets to grips until some private equity company takes over the whole company, and goes through the organization like a dose of salts. The problem with private equity isnâ\u0080\u0099t that they squeeze real returns out of companies, but that the managers get to eat nearly all the upside. That may come to hundreds of billionsâ\u0080\u0094yes, indeedâ\u0080\u0094of dollars. If only public mutual funds could put the same kind of pressure on managers. Meanwhile the working stiff gets the short end of the stick in their 401(k)â\u0080\u0094before being laid off as a â\u0080\u009ccost cutting measureâ\u0080\u009d by an expensive, yet exempt, â\u0080\u009cQuick Winâ\u0080\u009d in a suit. What can we do about it? Well, if you have a chance to get a job in private equity, take it! Otherwise, itâ\u0080\u0099s another good argument for owning stocks, even if weâ\u0080\u0099re stuck with public markets and regular mutual funds. There is still plenty of value to squeeze out of equities, even if someone else is going to get most of it."}]}