{"article": [{"url": "https://www.marketwatch.com/story/how-covid-19-may-have-changed-americans-views-on-unemployment-benefits-and-health-care-in-an-election-year-11601394340", "published": 1601630360.0, "headline": "Americans more impacted by COVID-19 are more likely to support Democrat-favored social safety-net programs, researchers say", "body": "The U.S. unemployment rate was 8.4% in August. Joe Raedle/Getty Images In a pandemic election year that has seen unprecedented numbers of people filing for unemployment benefits and at least 205,000 Americans dead from COVID-19, a new study suggests that people who have been more severely impacted by the virus are more inclined to support expanding government safety-net programs. Exposure to the fallout of COVID-19 — both real and perceived — “strongly” predicts support for expanding government-provided health care and unemployment insurance in the long term, according to a working paper distributed by the National Bureau of Economic Research and authored by researchers from the University of Pennsylvania’s Wharton School, the University of Exeter Business School and Autonomous University of Barcelona. The researchers found a positive association between support for these government programs and coronavirus infections and deaths in a respondent’s county of residence; the change in their county’s unemployment rate due to the pandemic; and a respondent’s own perceived probability of contracting or dying from the virus, running out of money or losing their job. “ ‘These results suggest the possibility that COVID-19 has had a quantitatively important impact on policy preferences.’ ” — the authors of a new paper distributed by NBER The associations held up even after controlling for the respondents’ demographic characteristics and political ideology prior to the pandemic. “These results suggest the possibility that COVID-19 has had a quantitatively important impact on policy preferences,” wrote the authors of the paper, which has not been peer-reviewed. “Our study suggests that the spread of COVID-19 has influenced American’s support for some of the most central policy issues of recent times, perhaps in a manner that will be relevant for the intense policy debates that will surely surround the upcoming election and persist into the following presidency.” The study analyzed results from 2,516 respondents to a late-June survey administered by the University of Southern California’s ongoing Understanding America Study. Participants were compensated $2. People who had grappled with the consequences of COVID-19 weren’t necessarily more likely to support raising tax revenue to foot the bill for safety-net expansions, the study found. “Our analysis suggests that increased tolerance for taxes has not broadly accompanied the increases in desire for policies that we have documented, but that increased tolerance for deficit spending has,” the authors wrote. It’s possible that the shift in people’s policy tastes won’t prove permanent, the authors noted. But the study results “do suggest some persistence,” they added, as respondents’ risk assessments in April predicted their policy views captured in late June. COVID-19 had infected at least 7.1 million Americans and killed 205,003 as of Monday, according to figures compiled by Johns Hopkins University. Meanwhile, the United States regained 1.4 million jobs last month as unemployment fell to 8.4%, continuing its steady decline from a peak of 14.7% in April. The CARES Act’s $600-a-week expansion of federal unemployment benefits ran dry at the end of July, and the $300-a-week enhanced unemployment benefits provided by an executive action President Trump signed last month were expected to run out within weeks. Congress has yet to pass a new COVID-19 relief package. What this means in an election year: “Three times as many Democrats and Democratic-leaning independents as Republicans and Republican leaners say the poor have hard lives because government benefits are insufficient to allow them to live decently (72% vs. 24%),” according to a survey by the Pew Research Group, an independent think tank in Washington, D.C. Republicans are more likely than Democrats to say the economic system is fair. “The gap between Republicans and Democrats has widened over the past two decades, largely because Democrats increasingly say the poor have hard lives because government benefits do not go far enough,” Pew said. “Two-thirds of Democrats and Democratic leaners say the country should to more to help the needy, even if it means increasing the debt; just 27% of Republicans and Republican leaners say the same. Partisan differences on this question today are much larger than they were throughout much of the 1990s and 2000s,” it added."}]}