{"article": [{"url": "https://www.marketwatch.com/story/consumer-confidence-surges-to-highest-level-since-start-of-coronvirus-pandemic-2020-09-29", "published": 1601384540.0, "headline": "Consumer confidence surges to highest level since start of coronavirus pandemic", "body": "The numbers: Consumer confidence rose in September to the highest level since the coronavirus pandemic began after the number of cases declined and the economic forged ahead, a closely followed survey showed. The index of consumer confidence rose to 101.8 this month from 86.3 in August, the Conference Board said Tuesday. It was the biggest one-month increase in 17 years. Economists polled by MarketWatch had forecast a smaller increase in the index to 89.6. The level of confidence in August was also revised slightly higher after initially showing the lowest reading since the pandemic began more than six months ago. “A more favorable view of current business and labor market conditions, coupled with renewed optimism about the short-term outlook, helped spur this month’s rebound in confidence,” said Lynn Franco, senior director of economic indicators at the board. See:MarketWatch Coronavirus Recovery Tracker What happened: An index that gauges how consumers feel about the economy right now jumped to 98.5 in September from 85.8 in the prior month. Another gauge that assesses how Americans view the next six months—the so-called future expectations index—surged to 104 from 86.6. The rebound in confidence almost certainly reflects a decline in coronavirus cases after a midsummer spike. Perhaps more surprising, a reduction in federal benefits for the unemployed did little to dampen the optimism. A $600 federal unemployment stipend expired at the end of July. President Trump authorized temporary $300 payments, but the money is already running out and Congress is deadlocked on what to do next. Big picture: The springback in consumer confidence after two straight declines is welcome news, suggesting a U.S. recovery is still on track even if growth has tapered off since the late spring. Although millions of Americans remain out of work, more people are returning to their jobs and the unemployment rate is declining. Economists worry the end of federal aid will slow the recovery and make it harder to return to normal, but so far the U.S. has continued to plow ahead. Confidence is still far below pre-pandemic levels, however. The index stood at 132.6 before the viral outbreak. What they are saying? “The levels are still subdued compared to February,” said chief U.S. economist Rubeela Farooqi of High Frequency Economics. “Even so, it is welcome news that is likely reflecting some optimism about economic and job prospects from an ongoing and fuller reopening of the economy.” Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 index SPX, +0.87% fell in Tuesday trades ahead of the first presidential debate."}]}