{"article": [{"url": "https://www.marketwatch.com/story/us-economy-adds-661000-jobs-in-september-and-unemployment-rate-falls-to-79-2020-10-02", "published": 1601642900.0, "headline": "U.S. adds 661,000 jobs in September and unemployment rate falls to 7.9%", "body": "The numbers: The U.S. created 661,000 new jobs in September and the unemployment rate fell again to 7.9% to the lowest level of the pandemic, but the gain in hiring was the smallest since the economy reopened and pointed to deceleration in the recovery. The increase in employment last month fell short of Wall Street’s estimate. Economists polled by MarketWatch had forecast an 800,000 gain. U.S. stocks fell in Friday trading after the smaller-than-expected increase in employment and news that President Trump tested positive for the coronavirus. Private-sector hiring was somewhat stronger with the creation of 877,000 new jobs, the Bureau of Labor Statistics said Friday. What dragged down employment in September was a decline in public-educations jobs at local schools and state colleges. Most have adopted forms of online learning. The economy regained more jobs in September, but millions of Americans are still waiting to return to work. Getty Images The unemployment rate, meanwhile, fell for the fifth month in row to 7.9% from 8.4%, a new pandemic low. The official jobless rate had peaked at 14.7% in April before subsiding. Yet the decline mostly reflected 700,000 people exiting the labor force because of a scarcity of new jobs. They aren’t counted in the unemployment rate. Another caveat: The jobless rate would have been closer to 8.3% if households gave an accurate description of their employment status, the Bureau of Labor Statistics said. Some survey respondents have mistakenly referred to themselves as employed even though they aren’t actually working, a problem that’s bedeviled the BLS amid widespread furloughs. See:Marketwatch’s Coronavirus Economic Recovery Tracker What happened: Bars and restaurants added 200,000 jobs in September to lead the way. Although they’ve hired back 3.8 million people since the economy reopened, some 2.3 million industry employees are still out of work. Retailers, for their part, increased payrolls by 142,000. Professional businesses hired 89,000 people. And manufacturers increased employment by 66,000, recovering more than half of the jobs lost early in the pandemic. Read:U.S. manufacturers expand for fifth month in a row and maintain momentum Workers also put in more hours on the job, another good sign for the labor market. The only drop in employment took place in government, largely in education. State and local governments need fewer bus drivers, cafeteria workers and teacher aides with so many schools opting for online learning. Temporary federal employment for the U.S. Census that’s conducted every 10 years also declined. So far the U.S. has recovered about 11.4 million jobs since a recovery got underway in May. The economy had shed about 23 million jobs at the height of the pandemic. In August, the increase in employment was raised by 145,000 to 1.49 million. The increase in July was revised up slightly to 1.76 million. Just how many people are still out of work, however, is hard to know for sure. The monthly employment survey showed 12.6 million people were unemployed last month, but a separate government report suggests as many 26 million are collecting jobless benefits. Some economists contend the data on benefits is inflated by duplicate applications, fraud and other errors. Read:U.S. jobless claims fall to six-month low of 837,000 — but there’s a California catch A broader measure of unemployment known as the U6 suggests the “real” rate fell to 12.8% in September from 14.2%. The U6 rate includes workers who can only find part-time work and those who have become too discouraged to look for jobs because so few are available. Big picture: The recovery has slowed since bursting out of the gate in May when the economy reopened, but the most recent batch of data suggest the U.S. is still improving at a modest pace. Economists are divided over what comes next. One camp predicts the economy will slow even further because of the end of most federal aid, the ongoing pandemic and the coming cold season, when viruses like the coronavirus typically flourish. They point to recent layoff announcements by Disney DIS, +1.53%, American Airlines AAL, +0.34% and other large service-oriented companies as evidence that another wave of layoffs is building that will halt the momentum in hiring. Yet other economists contend the economy will continue to expand as workers, consumers and businesses find ways to cope with the virus and governments loosen restrictions. Consumer confidence rose sharply in September to the highest level during the pandemic, for example, and a variety of survey suggest that manufacturers, small businesses and other firms are steadily expanding. What they are saying? “This underscores that job gains from here on will be tougher, and speaks to the need for more stimulus to help the economy and to support the more than 11 million Americans who had jobs in February and who are unemployed now,” said Robert Frick, corporate economist at Navy Federal Credit Union. “At the end of the day, this report probably does not move the needle much,” said chief economist Stephen Stanley of Amherst Pierpont Securities. “The economic recovery continues, though it is decelerating, as you would expect, as we get further away from the lockdown lows.” Read: Consumer confidence surges to highest level since start of coronavirus pandemic Market reaction: The Dow Jones Industrial Average DJIA, +0.56%, S&P 500 SPX, +0.87% and Nasdaq COMP, +1.39% fell lower in Friday trades."}]}