{"article": [{"url": "https://www.marketwatch.com/story/pelosi-says-next-move-on-stimulus-up-to-the-trump-administration-11598304024", "published": 1598290100.0, "headline": "Pelosi says next move on stimulus up to the Trump administration", "body": "Speaker of the House Nancy Pelosi (D., Calif.) talks to reporters during her weekly news conference in the U.S. Capitol Visitors Center July 16 in Washington. While the weekend saw House lawmakers return to Washington from a weeks-long break, any hopes that meant there would be progress on stalled economic stimulus talks remained illusory. Asked Monday afternoon if Americans should be hopeful Congress and the White House can soon reach an agreement to pass a second large coronavirus aid package, House Speaker Nancy Pelosi (D., Calif.) urged caution. “A lot of that will be up to the administration, if they stop making misrepresentations to the American people,” she said in an interview on MSNBC. House members returned briefly to Washington Saturday to vote on a bill to provide $25 billion to the U.S. Postal Service and keep it from making changes that would slow mail delivery heading into an election where many voters are expected to vote by mail. Read more: House approves bill to halt Postal Service changes blamed for delays, send $25 billion to boost USPS ahead of election Pelosi accused Trump of reneging when he threatened to veto the bill, which passed handily. “The president said if we passed a freestanding postal bill, he would sign it. We did. Now he says no,” she said. Mark Meadows, the White House chief of staff who has served as one of the two lead negotiators, said Saturday no stimulus talks had occurred “in weeks.” Meadows did push the idea of a so-called skinny bill, a stripped down piece of legislation that Democratic leaders have continually rejected. He said there was “a growing consensus that if we want to do something on postal, we ought to do something on other small businesses and enhanced unemployment — at least pick the things that we think we can agree upon and put that bill on the floor.” But on Monday spokesmen for Pelosi and Senate Majority Leader Mitch McConnell (R., Ky.) both said there were no new developments. Speaking in Georgetown, Ky., McConnell Monday said he still retains hope. “As you may have noticed, we’re at a stalemate with the Democratic majority in the House and the Democratic minority in the Senate and have not been able to reach an agreement yet, but I haven’t given up hope,” he said. “The American people need additional assistance now. That can only be done on a bipartisan basis and I hope we’ll be there soon,” McConnell said."}]}