{"article": [{"url": "https://www.marketwatch.com/story/trumps-epa-to-adopt-global-climate-standards-for-aviation-thats-an-outdated-model-say-environmental-groups-2020-07-23", "published": 1595496320.0, "headline": "Trumpâ\u0080\u0099s EPA to adopt global climate standards for aviation â\u0080\u0094 thatâ\u0080\u0099s an outdated model, say environmental groups", "body": "The Trump administration said Wednesday that it plans to adopt aircraft emissions standards modeled on international ones, a move it says will not further reduce climate-damaging emissions from planes. Andrew Wheeler, administrator of the Environmental Protection Agency, said the change â\u0080\u009cstrikes the right regulatory balanceâ\u0080\u009d and would ensure that U.S.-made airliners and large business jets meet the demands of the global market. Environmental groups, which had threatened to sue EPA over delays in setting greenhouse gas limits for aviation, said the agencyâ\u0080\u0099s proposal does not go far enough. The Center for Biological Diversity called it â\u0080\u009ctoothless.â\u0080\u009d The rules â\u0080\u009care too weak to address the severity of the climate crisis,â\u0080\u009d said Clare Lockwood, the groupâ\u0080\u0099s climate legal director. Another environmental group, the International Council on Clean Transportation, said the standard is already out of date and wonâ\u0080\u0099t speed investment in more fuel-efficient engines and planes. The average new plane delivered last year was already 6% more fuel efficient than EPAâ\u0080\u0099s rules would require in 2028, said Sola Zheng, lead author of an upcoming study by the group. The U.S. needed to adopt a rule at least as tough as the one being put in place by the International Civil Aviation Organization to sell and operate planes overseas. Boeing BA, -0.39% Â and Airlines for America, a trade group for the biggest U.S. airlines, praised the EPAâ\u0080\u0099s decision. The new standard for planes is â\u0080\u009ca major step forward for protecting the environment and supporting sustainable growth of commercial aviation and the United States economy,â\u0080\u009d said Boeing spokesperson Bryan Watt. Aircraft fuel efficiency has improved 50% since 1990, and the EPA proposal will help aircraft manufacturers continue making technological innovations for more fuel efficiency, he said. President Donald Trumpâ\u0080\u0099s administration largely has resisted calls from scientists and others for swift, large-scale action to cut the burning of oil, natural gas and coal to stave off the worst of climate change. The administration pulled the U.S. out of the Paris climate accord and weakened Obama-era initiatives to reduce emissions from vehicles and power plants. Wheeler told reporters that the administration is working to curb fossil fuel emissions but is â\u0080\u009cdoing it in a thoughtful manner that protects our manufacturing base.â\u0080\u009d The new U.S. proposal is modeled on a change adopted by the International Civil Aviation Organization, a United Nations agency, to limit climate-damaging carbon dioxide and nitrogen oxides. Since airline makers globally are expected to follow the new international standards anyway, â\u0080\u009cthe EPA is not projecting emission reductions associated with todayâ\u0080\u0099s proposed GHG regulations,â\u0080\u009d or greenhouse gas rules, the EPA description of the change notes. Before the COVID-19 outbreak hit demand for air travel, the international agency predicted emissions from planes will grow at least 3% a year globally because of rising traffic, even with cleaner planes. The Obama administration concluded that aviation contributes to climate change, endangering public health. That set Wednesdayâ\u0080\u0099s proposed rule in motion. The EPA says U.S. aviation UAL, +0.32% Â LUV, +1.89% Â AAL, +0.34% Â JBLU, -0.07% Â accounts for 3% of the countryâ\u0080\u0099s overall climate-changing emissions."}]}