{"article": [{"url": "https://www.marketwatch.com/story/dont-miss-out-on-this-generational-opportunity-in-the-stock-market-hedge-fund-manager-says-11602183237", "published": 1602192140.0, "headline": "Donâ\u0080\u0099t miss out on this â\u0080\u0098generational opportunityâ\u0080\u0099 in the stock market, hedge-fund manager says", "body": "Thomas Hayes of Great Hill Capital was asked this week whether heâ\u0080\u0099s been putting his clientsâ\u0080\u0099 money to work amid the volatility and uncertainty the pandemic has created in the market. His answer: Yes. In fact, â\u0080\u009caggressively.â\u0080\u009d But heâ\u0080\u0099s not following the herd year by loading up on the notable tech names like Alphabet GOOG, +1.97%, Amazon AMZN, +3.01%, Tesla TSLA, +1.89%, Facebook FB, +0.26%, Apple AAPL, +1.74%, etc. The big gains going forward, he said, lie elsewhere. â\u0080\u009cThis is aÂ generational opportunityÂ for some of the laggard sectors that have been left behind during the â\u0080\u0098Stay at Homeâ\u0080\u0099 period of COVID,â\u0080\u009d he wrote in a post on his Hedge Fund Tips blog.Â â\u0080\u009cNow that we are beginning the â\u0080\u0098Re-Openingâ\u0080\u0099 period of the COVID crisis, opportunities to position ahead of continued treatment improvements and vaccines abound.â\u0080\u009d Hayes pointed out that cyclicals â\u0080\u0094 industrials, materials, transports and financials â\u0080\u0094 have all outperformed technology, in a shift that he fully expects to continue as he trims his portfolio of â\u0080\u009cover-ownedâ\u0080\u009d pockets of tech stocks. â\u0080\u009cThis recovery will be led by housing/cyclicals (as 85M millennials are at the age of housing formation and COVID has accelerated the pace),â\u0080\u009d he wrote. â\u0080\u009cOn top of that, low rates are helping with financing and urban exodus is accelerating the trend.Â This trend is just beginning.â\u0080\u009d So, after loading up on home builders back in March and April in anticipation of this shift, Hayes says his fund has been buying up banks in recent months. â\u0080\u009cYou cannot have a sustainable recovery without credit expansion,â\u0080\u009d he said, adding that Wells Fargo WFC, is his top pick. Hereâ\u0080\u0099s the path heâ\u0080\u0099s looking at for his stake in Wells Fargo, which he claims is â\u0080\u009cthe most hated stockâ\u0080\u009d in the entire S&P 500 index: His rotation, he said, is in line with earnings estimates for the S&P 500. â\u0080\u009cMost cyclical sectors will grow earnings at a FASTER pace than the S&P 500, while Tech will grow earnings at HALF the pace of the S&P 500,â\u0080\u009d he said. Energy and industrials, in particular, should shine, he said. As for where the market goes short term, Hayes is mostly bullish, tech-aside, on the prospects of stocks as they enter the â\u0080\u009creopeningâ\u0080\u009d phase thanks to the $4.4 trillion cash on the sidelines. â\u0080\u009cWe will continue to take advantage on any short-term weakness â\u0080\u0093 as when the reopening trade flips on in earnest â\u0080\u0093Â it will be abrupt and meaningful for those who are correctly positioned,â\u0080\u009d Hayes said. It wasnâ\u0080\u0099t exactly â\u0080\u009cabrupt,â\u0080\u009d but some of that cash trickled into the stock market on Thursday, with the Dow Jones Industrial Average DJIA, +0.56% closing up triple digits. The tech-heavy Nasdaq Composite COMP, +1.39% and the S&P 500 SPX, +0.87% also ended higher."}]}