{"article": [{"url": "https://www.marketwatch.com/story/trump-speaks-in-person-at-republican-convention-in-north-carolina-i-felt-an-obligation-to-be-here-2020-08-24", "published": 1598282180.0, "headline": "Trump speaks in person at Republican convention, blasting Biden for not traveling to Democratic event", "body": "President Donald Trump on Monday appeared in person at the Republican National Convention in Charlotte, delivering remarks in which he blasted White House rival Joe Biden and Democratic governors such as North Carolina’s Roy Cooper. “I felt an obligation to be here,” Trump said. “You have a governor who’s in a total shutdown mood. I guarantee on Nov. 4, it’ll open up.” The president claimed Democratic governors “love shut down until after the election is over, because they want to make our numbers look as bad as possible for the economy.” Trump and his fellow Republicans have been expected to aggressively counterattack the Democrats and their presidential nominee at this week’s GOP convention, a four-day affair that aims to make the case it is Trump and not Biden who can revive the pandemic-battered U.S. economy. Trump on Monday described North Carolina as a state “that’s been very good to me.” “We won a lot of victories here,” the Republican incumbent said. “I do want to show a little bit of a difference, because another state that’s been very good to me is Wisconsin. And Joe Biden was going to have their convention in Milwaukee, and they didn’t go there at all — they didn’t do this. We did this out of respect for your state.” Wisconsin was picked to host last week’s Democratic National Convention, but Biden and other top Democrats chose not to travel to Milwaukee, as their convention became a largely virtual event due to ongoing public health concerns amid the coronavirus pandemic. Trump’s comments came after Republicans at their scaled-down convention formally nominated him for a second term in the White House, and as more than 300 delegates cast their roll-call votes for him. The president earlier this month hadn’t been expected to travel to Charlotte, but reports over the weekend said he and Vice President Mike Pence would appear in person on Monday. In his remarks on Monday, Trump also continued his long-running attacks on efforts to increase the use of mail-in ballots during the COVID-19 pandemic. “Who’s mailing them? Mostly Democrat states and Democrat governors. Supposing they don’t mail them to Republican neighborhoods?” the president said. “This is the greatest scam in the history of politics.” He also said: “What they’re doing is using COVID to steal an election.” Read more:Trump suddenly supports mail-in voting — for the key swing state of Florida And see:Trump claims mail voting leads to fraud, but he and other top White House officials have embraced it In addition, Trump talked up the recent performance of U.S.equities, saying: “We’re just about ready to break the all-time stock-market record.” The Dow Jones Industrial Average DJIA, +0.56% on Monday traded within 5% of its February peak, while the S&P 500 SPX, +0.87% and tech-heavy Nasdaq Composite COMP, +1.39% closed at records on Friday. The president is slated to accept the GOP nomination on Thursday night in a speech given at the White House, but he also was set to be featured during each day of the convention. Among the speakers on the schedule for Monday night are GOP Sen. Tim Scott of South Carolina and Nikki Haley, who served as the Trump administration’s ambassador to the United Nations, as well as Donald Trump Jr. and Mark and Patricia McCloskey, the St. Louis couple who brandished guns at protesters during a racial-injustice demonstration outside their home. The Biden campaign on Monday offered up counterprogramming, rolling out a “Republicans for Biden” group featuring former GOP lawmakers such as Arizona’s Jeff Flake and Virginia’s John Warner. “It is because of my conservatism, and because of my belief in the Constitution, and in the separation of power, and because I am gravely concerned about the conduct and behavior of our current president that I stand here today – proudly and wholeheartedly — to endorse Joe Biden as the next president,” said Flake, a former senator and longtime Trump critic."}]}