{"article": [{"url": "https://www.marketwatch.com/story/fed-staff-lowers-forecast-for-economic-growth-over-rest-of-year-fomc-minutes-2020-08-19", "published": 1597854260.0, "headline": "Fed staff lowers forecast for economic growth over the rest of year: FOMC minutes", "body": "The Federal Reserve’s staff told central bank officials in late July that they were lowering their estimate for economic growth over the second half of the year, according to the minutes of the Federal Open Market Committee’s meeting released Wednesday. Fed staff members always present their own forecast at the central bank’s eight interest-rate committee meetings each year. At the latest meeting on July 28-29, the staff said they expected the rate of recovery in gross domestic product and the pace of declines in the unemployment rate to be “somewhat less robust than in the previous forecast.” The staff blamed the slowdown on the increasing spread of the coronavirus since mid-June, and the slowing of state re-openings of businesses. Fed officials stressed in their policy statement released after July’s meeting that the path of the economy would depend significantly on the course of the coronavirus pandemic. “Participants generally agreed that prospects for further substantial improvement in the labor market would depend on a broad an sustained reopening of businesses. In turn, such a reopening would depend in large part on the efficiency of health measures to limit the spread of the virus,” the minutes said. The staff forecast assumed additional fiscal stimulus measures would be passed by Congress but these have been delayed as the two political parties jockey for advantage ahead of November’s presidential election. At the July meeting, Fed officials decided to keep interest rates at zero and to maintain monthly purchases of $120 billion of U.S. Treasurys and mortgage-backed securities. Fed Chairman Jerome Powell has said the central bank isn’t “even thinking about thinking about raising rates.” In their discussions, Fed officials noted that there had been an increase in uncertainty about the economic outlook since their prior meeting in mid-June. Richmond Fed President Thomas Barkin, in remarks after the minutes were published, said uncertainty “matters a lot for players in the economy.” Blue collar workers “seem frozen in place” and some business leaders say they are having trouble finding workers, even with the unemployment rate over 10%, Barkin said in a talk to the National Economists Club. “We are at a very vulnerable spot, and I don’t know what the next shoe to drop will be,” Barkin said. According to the minutes, “several” Fed officials said that additional monetary easing steps could be required to strengthen the economy. “Some” said that strong fiscal support would be necessary. Going forward, “a number” of Fed officials thought the central bank should rewrite its forward guidance. Officials talked about making a pledge to keep interest rates low until one or more economic outcomes were achieved. But the minutes show that there was no push to reach agreement on this issue in July. No mention was made about the central bank’s next meeting in September. Wall Street economists had been thinking the Fed would be prepared to upgrade its forward guidance in mid-September but recent comments from Fed officials has cast some doubt on this expectation. Discussion of a new tool where the Fed could put a cap on interest rates beyond short-term rates got a mixed reception at the July meeting, the minutes show. Many of the Fed officials who talked about yield curve control said there were only “modest benefits” and potential serious “costs” to the strategy, including uncertainty over how to end it once it has been started. “In light of these concerns, many participants judged that yield caps and targets were not warranted in the current environment but should remain an option that the FOMC could reassess in the future if circumstances changed,” the minutes said. Powell and his deputy Richard Clarida spent most of 2019 preparing the groundwork for a change in the Fed’s strategy for keeping the economy on an even keel. A central concern is that inflation has almost never hit the Fed’s 2% target since the goal was adopted in 2012. Fed watchers had hoped for some details of the Fed’s new plans to hit the inflation target but the minutes only said that officials decided a revised strategy was a good idea. Stocks lost their earlier gains after the minutes were released late Tuesday with the Dow Jones Industrial Average DJIA, +0.56% trading close to unchanged."}]}