{"article": [{"url": "https://www.marketwatch.com/story/how-to-protect-your-money-at-every-age-2020-07-29", "published": 1596020900.0, "headline": "How to protect your money - at every age", "body": "Growing up, my friend's mom always gave me good advice. When things went terribly wrong, Mrs. Brown would say, \"It's a learning experience, Stephen.\" I realized that the experience, however painful, could serve me well in the end. 80% of older Americans can't afford to retire - COVID-19 isn't helping The fallout of COVID-19 has yet to be fully measured, but it's fair to say that most of us have been impacted in some way - some more than others. However, what we learn from challenging occurrences can help us manage risks going forward. In these uncertain times, the risks you face depend on where you are along your course toward reaching your goals. Whether you're just starting out and in your 20s, or you are older and further along your path, consider the following measures to help mitigate the damage of the next unforeseeable event. In your 20s â\u0080¢ Protect your FICO score with a line of credit attached to your checking account. Overdrafts are costly and can lead to all sorts of credit problems down the road. A low FICO score can severely limit your ability to fully leverage your income. â\u0080¢ Open a Health Savings Account. You can qualify if you have a high deductible health insurance plan. Contributions are tax deductible and growth in the account is tax-free if withdrawals are used for qualified medical expenses. â\u0080¢ Build your budget. Know how much you need to survive. â\u0080¢ Keep an emergency fund to pay for an unexpected expense or to buy you the time necessary to secure your next job. â\u0080¢Take full advantage of work-related benefits such as matching contributions within a company sponsored retirement plan. It's guaranteed money so you can't go wrong. â\u0080¢ Start a Roth IRA. It's less arduous than a traditional IRA and investment growth is income tax-free. In your 30s or 40s â\u0080¢ Establish an umbrella policy to protect yourself against personal liability. It's a very inexpensive way to shift personal liability away and protect your net worth. â\u0080¢ Income replacement through disability and life insurance is paramount. Understanding how much income your household needs to support essential costs can bridge the gap in the event of an injury or an untimely death. â\u0080¢ Build an inventory of estate documents - a will including guardianship, health care directives, and a durable power of attorney can protect you in the event of a medical crisis. â\u0080¢ Add primary and contingent beneficiaries to your bank, investment, retirement accounts and insurance policies. â\u0080¢ Secure low cost credit tools, even if you don't need them. Flexibility and having options is key to financial stability. A day may come when you need access to credit when you are most vulnerable. For example, if you lost your job, a line of credit may be an affordable means to cover your household expenses until you begin to earn income again. â\u0080¢ Continue building your retirement savings. In your 50s or 60s â\u0080¢ Consider long-term care insurance. If you are fortunate to have accumulated some meaningful investment assets, protect them from an accelerated spend down with long term care insurance. A long-term illness can wreak havoc on an investment portfolio and permanently damage its ability to produce income. â\u0080¢ Build a retirement income strategy to mitigate risk in the stock market. Often times we focus on building our savings rather than how to make it last. And keep a cash buffer to support spending in the event of a prolonged down market. â\u0080¢ Determine a realistic retirement plan. Plan retirement timing, expenses, income and a strategy for social security retirement benefits. In some cases, your election to take social security benefits will depend on your ability to work and available resources. Social security benefits taken early are permanently reduced, but it you delay, your benefit will be higher. Also, understand the monthly income your assets can produce, how many years those assets will last, and how to bridge an income shortfall if you delay your social security benefit. In your 70s or older â\u0080¢ Review your beneficiary designations and make sure they're aligned with your wishes. â\u0080¢ Keep copies of your advanced health care directives with your primary care doctor to avoid any misunderstanding about your care if you can't speak for yourself. Stephen Augstell CFP, is vice president and senior financial planner at Berkshire Bank Wealth Management. Investment products are not FDIC-insured, are not a bank deposit, not guaranteed by the bank, not insured by any federal government agency and may lose value. Banking products are provided by Berkshire Bank: Member FDIC. Berkshire Bank is a Massachusetts chartered bank."}]}