{"article": [{"url": "https://www.marketwatch.com/story/your-boss-wants-you-back-at-work-an-employment-law-expert-explains-your-rights-2020-07-07", "published": 1594131680.0, "headline": "Your boss wants you back in the office - An employment law expert explains your rights", "body": "With states reopening - or planning to reopen - in the coming weeks and months, you may be worried about what returning to work will mean for you and your family, particularly if it means increased exposure to COVID-19. As a professor specializing in employment law, I don't have a lot of reassurance to offer. Employment law is a patchwork at the best of times - let alone during a global pandemic - and legal protections may not cover your situation. Like so many of the challenges people are facing right now, you may be mostly on your own, negotiating the least bad of many bad options. Here is a basic overview of what your options are under some common scenarios.I've been called back to the office, but I don't like the idea of being in an enclosed space for nine hours a day If you have a medical condition that makes you especially vulnerable to the coronavirus, you may be entitled to a reasonable accommodation under the Americans with Disabilities Act. That means your employer needs to engage in a dialogue with you to figure out if there is a way to limit your exposure, such as remote work, a temporary reassignment or a modified shift. Otherwise, your options are more limited. Unionized workers can ask their union for assistance. If the office opening is in violation of a state stay-at-home order, you might be able to file a complaint with a state workplace health and safety agency. Or you could try negotiating some sort of temporary or intermittent remote work arrangement with your employer. Everyone else has little choice but to head back to the office. To make matters worse, the Department of Labor has issued guidance suggesting that if you refuse to return to work due to general coronavirus-related apprehension - as opposed to a specific safety hazard - you may not be eligible for extended unemployment insurance.I believe I'm being asked to work in unsafe conditions Under federal workplace safety law, the first thing you are expected to do is talk to your employer about the unsafe condition. Be specific about the condition that concerns you and the fact that you are worried about your safety. If you are unionized, conveying your concern to the union will enable it to address the problem on behalf of everyone. Even if you're not unionized, banding together with other employees to advocate for safer working conditions is protected under the National Labor Relations Act. If your employer does not address your safety concerns, you can complain to the state workplace safety agency or the local branch of the federal Occupational Safety and Health Administration. The agency should send an inspector to examine the situation. In the meantime, you should refuse to work only if you have no \"reasonable alternative\" and the unsafe condition would pose a \"real danger of death or serious injury.\"I have to go to work but have children at home and no child-care options If you work for a company with fewer than 500 employees, you may be eligible for up to 12 weeks of paid leave under the Families First Coronavirus Response Act. But if you've been using this leave throughout the pandemic, you may be in a dicey situation in the summer as child-care centers remain shuttered and summer camps are canceled. Beyond those 12 weeks of leave, companies are not required to make accommodations for employee child-care issues. If the leave runs out - or you work for a large company not covered by the leave law - you may be eligible for expanded unemployment insurance under the federal Coronavirus Aid, Relief and Economic Security Act.I live with a family member who is in a vulnerable population, and I don't want to expose the person to the virus If you need to care for the family member - and work for a company with fewer than 500 employees - you may be eligible for leave under the Families First Coronavirus Response Act. Your employer might request documentation that a health-care provider advised the family member to self-quarantine. Otherwise, you may be out of luck - and may not even get unemployment insurance if you refuse to work. That may mean doing your best to limit your exposure at work and transmission at home.I think I just got sick from exposure to the coronavirus at work You should be eligible for two weeks of paid sick leave under the Families First Coronavirus Response Act if you work for a company with fewer than 500 employees. If you are still sick after that, you may be eligible for Family and Medical Leave. You'll also want to check your company's sick leave policy. The Occupational Safety and Health Administration advises companies to adopt flexible sick leave policies that actively encourage sick workers to stay home. You might be eligible to file for workers' compensation, which covers medical costs and provides some wage replacement for workers who are injured because of work. State law varies a lot when it comes to workers' compensation, including whether infectious diseases like COVID-19 count as a workplace injury. Your claim will also depend on whether you can show that you contracted the coronavirus at work as opposed to exposure from other places. Some states are issuing presumptions that certain kinds of frontline workers - like health care workers and first responders - contracted the virus at work.I was injured by a customer who got violent after being asked to wear a mask Some retail workers are reporting being violently assaulted by customers when enforcing new social distancing rules, such as wearing a mask. It's not clear how common this is, but even prior to the pandemic, workplace violence was a major cause of workplace injury, affecting an average of 1.7 million workers per year. Injuries as a result of violent customers would generally be covered by workers' compensation. Of course, it's better to avoid being injured in the first place, so frontline workers should consider asking management about the plan for responding if a customer's behavior starts to escalate. Elizabeth C. Tippett is an associate professor at the University of Oregon's School of Law in Eugene. This was first published on The Conversation - \"Returning to work? An employment law expert explains your rights in getting your boss to accommodate you and your family's safety\""}]}