{"article": [{"url": "https://www.marketwatch.com/story/as-trumps-rocky-relationship-with-fauci-deteriorates-americas-top-infectious-disease-doctors-say-we-will-not-be-silenced-nor-sidelined-2020-07-14", "published": 1595151920.0, "headline": "White House animus toward Fauci may escalate as he calls coronavirus pandemic â\u0080\u0098your worst nightmare, the perfect stormâ\u0080\u0099", "body": "Fauci is not for turning. Itâ\u0080\u0099s been a turbulent week for President Donald Trumpâ\u0080\u0099s relationship with the nationâ\u0080\u0099s top infectious-disease specialist. With a rise in COVID-19 cases in most U.S. states, particularly Texas, Arizona, California and Florida, and reversals by some of their plans to reopen, the White House appears to have acknowledged that there will be immediate healing to an fractured relationship with Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases for three decades and a leading expert on pandemics in the U.S. for four decades. “ â\u0080\u0098You can physically separate people to the point of not allowing the virus to transmit, and the only way to do that is by draconian means.â\u0080\u0099 ” â\u0080\u0094 Anthony Fauci, National Institute of Allergy and Infectious Diseases The Dow Jones Industrial Index DJIA, +0.56% Â closed lower Friday though stocks post modest weekly gains, as investors tracked round two of the potential fiscal stimulus. The S&P 500 SPX, +0.87% Â and Nasdaq Composite COMP, +1.39% Â ended the week up slightly. The Trump administration is trying to block $25 billion for states to conduct testing and contact tracing in the next coronavirus relief bill, people involved in the talks told the Washington Post on Saturday. Wait times vary from a matter of hours to up to 26 days in some extreme cases. In an interview with Stanford Medicineâ\u0080\u0099s dean, Lloyd Minor, the doctor said there is a way to flatten the curve of new cases. â\u0080\u009cWe know that we can do that if we shut down. The Europeans have done it. People in Asia have done it. We did not shut down entirely.â\u0080\u009d Contrary to the presidentâ\u0080\u0099s insistence that itâ\u0080\u0099s time to get the countryâ\u0080\u0099s economy up and running, Fauci paints a darker picture: â\u0080\u009cItâ\u0080\u0099s happened â\u0080\u0094 your worst nightmare, the perfect storm. We havenâ\u0080\u0099t even begun to see the end of it yet. Itâ\u0080\u0099s still globally threatening.â\u0080\u009d Fauci, meanwhile, told the Financial Times in an interview published last weekend that he had not briefed the president since June 2, though the two were subsequently reported to have spoken late this week. After the doctor criticized the U.S. response to the pandemic and Trump criticized the doctor, last Monday Fauci made a low-key visit to the White House to meet with Mark Meadows, the White House chief of staff. It came a day after the administration released a list to the Washington Post that contained criticisms of the doctor, and signaled a further souring of relations between Fauci and the Trump administration. The list included comments made by Fauci in the early days of the pandemic about how he was not immediately worried about asymptomatic spreading and how Americans didnâ\u0080\u0099t need to wear masks. The Centers for Disease Control and Prevention originally told the public not to wear masks but, along with the Trump administration, reversed that policy in April. (The disseminated document was widely described as resembling nothing so much as opposition research, a characterization that the White House denied.) But the backlash to the White House documentation of Fauciâ\u0080\u0099s past remarks was swift. On Tuesday, Thomas File Jr., president of the Infectious Diseases Society of America, released a statement on behalf of colleagues throwing their support behind Fauci. â\u0080\u009cThe only way out of this pandemic is by following the science, and developing evidence-based prevention practices and treatment protocols as new scientifically rigorous data become available. Knowledge changes over time. That is to be expected. If we have any hope of ending this crisis, all of America must support public health experts, including Dr. Fauci, and stand with science.â\u0080\u009d “ â\u0080\u0098If we have any hope of ending this crisis, all of America must support public health experts, including Dr. Fauci, and stand with science.â\u0080\u0099 ” â\u0080\u0094 Thomas File Jr., Infectious Diseases Society of America On Sunday, Adm. Brett Giroir, the testing coordinator at the Department of Health and Human Services, told NBCâ\u0080\u0099s â\u0080\u009cMeet the Pressâ\u0080\u009d that Fauci was not correct in his advice to states to slow down the opening of businesses: â\u0080\u009cI respect Dr. Fauci a lot, but Dr. Fauci is not 100% right, and he also doesnâ\u0080\u0099t necessarily, he admits that, have the whole national interest in mind. He looks at it from a very narrow public-health point of view.â\u0080\u009d That same day, Trump doubled down on his own effort to discredit Fauci. He appeared to endorse via retweet this sentiment from game-show host Chuck Woolery over the weekend: â\u0080\u009cThe most outrageous lies are the ones about Covid 19. Everyone is lying. The CDC, Media, Democrats, our Doctors, not all but most that we are told to trust. I think itâ\u0080\u0099s all about the election and keeping the economy from coming back, which is about the election. Iâ\u0080\u0099m sick of it.â\u0080\u009d (The president also retweeted this, from the co-host of Wooleryâ\u0080\u0099s podcast: â\u0080\u009cSo based on Dr. Fauci and the Democrats, I will need an ID card to go shopping but not to vote?â\u0080\u009d) â\u0080\u009cWhen you compare us to other countries, I donâ\u0080\u0099t think you can say weâ\u0080\u0099re doing great. I mean, weâ\u0080\u0099re just not,â\u0080\u009d Fauci told the FiveThirtyEight podcast last week, which appeared to be taken by the White House as a direct rebuke of the president. Most voters said they approved of Fauci, although the majority of Republicans said so by a whisker, according to a New York Times/Siena College poll of 1,337 registered voters from June 17 to June 22. Overall, 67% of voters said they approved of the doctor, including 81% of Democrat, 51% of Republicans and 67% of independents. Last week, Trump also doubled down on his criticism of Fauciâ\u0080\u0099s response to the pandemic. â\u0080\u009cDr. Fauci's a nice man, but heâ\u0080\u0099s made a lot of mistakes,â\u0080\u009d he said on Sean Hannityâ\u0080\u0099s Fox News show. â\u0080\u009cLike you donâ\u0080\u0099t have to ban them coming in from very infected China. I did it anyway and we saved hundreds of thousands of lives.â\u0080\u009d He added, â\u0080\u009cTheyâ\u0080\u0099ve been wrong about a lot things, including face masks,â\u0080\u009d he added. â\u0080\u009cMaybe theyâ\u0080\u0099re wrong, maybe not, but a lot of them said donâ\u0080\u0099t wear a mask, donâ\u0080\u0099t wear a mask. Now they are saying wear a mask. So a lot of mistakes were made â\u0080\u0094 a lot of mistakes.â\u0080\u009d Anthony Fauci posing for a special digital cover of InStyle magazine. Related: Hereâ\u0080\u0099s one â\u0080\u0098remarkableâ\u0080\u0099 difference between COVID-19 and the 1918 Spanish flu On April 3, the administration and the Centers for Disease Control and Prevention reversed their policies on masks, and said everyone â\u0080\u0094 not just medical workers â\u0080\u0094 should wear face coverings. That same day, Trump said his administration recommended wearing cloth face coverings. However, the president immediately volunteered that he wouldnâ\u0080\u0099t wear a mask himself. â\u0080\u009cYou donâ\u0080\u0099t have to do it. Iâ\u0080\u0099m choosing not to do it.â\u0080\u009d In a rare break with his tradition of eschewing any face covering, he wore one last weekend while visiting Walter Reed National Military Medical Center. Fauci recently said that the U.S. government had not been doing well with contact tracing, the process of tracking people who have been in contact with someone identified to have the virus. â\u0080\u009cI donâ\u0080\u0099t think weâ\u0080\u0099re doing very well, for a number of reasons, and not all of which is the fault of the system,â\u0080\u009d he said in an interview last month with CNN T, -1.01%. On April 13, when reporters questioned Fauci about possible tension between him and the administration, Fauci said he made recommendations to Trump to restrict travel. â\u0080\u009cThe travel was another recommendation, when we went in and said, â\u0080\u0098We probably should be doing that,â\u0080\u0099 â\u0080\u009d Fauci said. â\u0080\u009cAnd the answer was yes.â\u0080\u009d “ â\u0080\u0098We have been very fortunate to have Dr. Fauci at the helm directing infectious diseases research at National Institutes of Health for so many years.â\u0080\u0099 ” â\u0080\u0094 Judith Feinberg, HIV Medicine Association On Monday, CNN reporter Jim Acosta asked White House press secretary Kayleigh McEnany: â\u0080\u009cWhy is the White House trashing Dr. Fauci? The president has gone off on anonymous sources in the past. Why not have the guts to trash Dr. Fauci with your own names?â\u0080\u009d McEnany said suggestions that there was opposition research on Fauci â\u0080\u009ccouldnâ\u0080\u0099t be further from the truth.â\u0080\u009d Acosta pointed out that, in April, Trump floated the idea of using ultraviolet light inside the human body or a disinfectant by â\u0080\u009cinjectionâ\u0080\u009d as a treatment for coronavirus. Indeed, Trump told a press conference: â\u0080\u009cI see the disinfectant, where it knocks it out in a minute. One minute. And is there a way we can do something like that, by injection inside or almost a cleaning? Because you see it gets in the lungs, and it does a tremendous number on the lungs. So it would be interesting to check that,â\u0080\u009d he said. â\u0080\u009cSo, supposing we hit the body with a tremendous â\u0080\u0094 whether itâ\u0080\u0099s ultraviolet or just very powerful light â\u0080\u0094 and I think you said that that hasnâ\u0080\u0099t been checked, but youâ\u0080\u0099re going to test it. And then I said, supposing you brought the light inside the body.â\u0080\u009d The next day, Trump and allies said he was not being serious. His original comments drew widespread criticism from health professionals and Reckitt Benckiser RBGPF, +0.93%, which makes Lysol and Dettol. â\u0080\u009cI was asking a question sarcastically to reporters like you just to see what would happen.â\u0080\u009d When asked by a reporter whether Trump was suggesting disinfectant as an injection, the president replied, â\u0080\u009cNo. Of course not. ... It was said sarcastically. It was put in the form of a question to a group of extraordinary hostile people. Namely, the fake news media.â\u0080\u009d Also this week, Judith Feinberg, who chairs the HIV Medicine Association, added in a separate statement: â\u0080\u009cWe have been very fortunate to have Dr. Fauci at the helm directing infectious-diseases research at the National Institutes of Health for so many years. His leadership and support of a rigorous scientific process has been critical to transforming HIV from a death sentence to a chronic condition, saving millions of lives worldwide. His voice and expertise need to be amplified not silenced if we are going to get control of the COVID-19 pandemic.â\u0080\u009dFauciâ\u0080\u0099s history with the HIV/AIDS epidemic, particularly in the early days, and his relationship with activists is more complex than that. â\u0080\u009cThey blocked the doors and hallways chanting, â\u0080\u0098Hey, Hey, FDA, How Many People Have You Killed Todayâ\u0080\u0099 and â\u0080\u0098Fauci, You Are Killing Us.â\u0080\u0099 After their action they launched a media tour demanding a shortened drug-approval process and illustrating that they all knew every detail of the complex FDA process,â\u0080\u009d according to journalist Ann Montague, who revisited that chapter in Fauciâ\u0080\u0099s career. â\u0080\u009cTensions came to a head in 1990 when activists were not given a seat at the table where the discussions were taking place regarding the AIDS clinical trials.â\u0080\u009d â\u0080\u009cThere was a massive demonstration outside Fauciâ\u0080\u0099s office with activists wearing Grim Reaper masks and carrying large coffins. There were 60 arrests. Recently, in an interview Dr. Fauci recalled being smoke bombed. Eventually Dr. Fauci ended up loosening HIV drug clinical trial requirements so that more patients could try new compounds,â\u0080\u009d Montague wrote in Socialist Action, adding, â\u0080\u009cAct Up members were included in writing procedural standards, and they were added to expanded seats on the planning committee of the AIDS Clinical Trial Group. This was a significant win.â\u0080\u009d (Fauci was not immediately available for comment on his time dealing with the AIDS pandemic.) Ann Northrop, a lesbian AIDS activist at that time, told Montague that Fauciâ\u0080\u0099s relationship with AIDS activists at the time evolved: â\u0080\u009cI would say at the beginning of his encounter with us, he was a pretty typical bureaucrat, making excuses for the slow pace of drug investigation and approval. I will give him credit for turning into someone who listened more to the activist point of view and eventually became more of an ally. There also is agreement that he was never homophobic like the majority of the medical establishment at this time.â\u0080\u009d (President Ronald Reagan famously never mentioned AIDS until 1987.) Fauci has continued his media road show, repeating his message that the current approach is not working. In an interview with Facebook FB, +0.26% CEO Mark Zuckerberg on Thursday, Dr. Anthony Fauci said the current jump in cases, which now hovers at 70,000, can be reversed, if the right steps are taken: â\u0080\u009cYou have got to do it correctly,â\u0080\u009d he said. â\u0080\u009cYou canâ\u0080\u0099t jump over steps, which is very perilous when you think about rebound. The proof of the pudding is, look what has happened.â\u0080\u009d Perhaps more damning, he said, â\u0080\u009cThis was avoidable.â\u0080\u009d Fauci also said easing social-distancing requirements and reopening the economy too soon could ultimately cost even more lives, and said there needed to be a rethink of how statesâ\u0080\u0099 lawmakers were approaching the virus. He said the government must look to the medical community for advice on how to bring an end to the first wave in the U.S. â\u0080\u009cWe have such extraordinary talent in our academic medical centers,â\u0080\u009d Fauci told Stanford dean Minor, â\u0080\u009cwe really need to begin to leverage them more.â\u0080\u009d As of Sunday, COVID-19, the disease caused by the virus SARS-CoV-2, had infected at least 14.3 million people globally and 3.7 million in the U.S. It had killed over 602,777 people worldwide and at least 140,120 in the U.S., according to Johns Hopkins Universityâ\u0080\u0099s Center for Systems Science and Engineering. Florida reported 10,327 new cases on Saturday. Texas reported over 10,000 new cases for the fifth consecutive day. The day before, the U.S. recorded over 70,000 new cases, exceeding previous records for the second consecutive day. How COVID-19 is transmitted"}]}