{"article": [{"url": "https://www.marketwatch.com/story/global-coronavirus-death-toll-tops-1-million-01601341770", "published": 1601327840.0, "headline": "Global coronavirus death toll tops 1 million", "body": "In this Sept. 10, 2020, file photo, a woman wearing white protective gear mourns after taking a glimpse of her husband's body, a victim of COVID 19, at a cremation site in Gauhati, India. Associated Press NEW DELHI — The worldwide death toll from the coronavirus eclipsed 1 million on Tuesday, nine months into a crisis that has devastated the global economy, tested world leaders’ resolve, pitted science against politics and forced multitudes to change the way they live, learn and work. “It’s not just a number. It’s human beings. It’s people we love,” said Dr. Howard Markel, a professor of medical history at the University of Michigan who has advised government officials on containing pandemics and lost his 84-year-old mother to COVID-19 in February. “It’s our brothers, our sisters. It’s people we know,” he added. “And if you don’t have that human factor right in your face, it’s very easy to make it abstract.” The bleak milestone, recorded by Johns Hopkins University, is greater than the population of Jerusalem or Austin, Texas. It is 2 1/2 times the sea of humanity that was at Woodstock in 1969. It is more than four times the number killed in the 2004 earthquake and tsunami in the Indian Ocean. Even then, the figure is almost certainly a vast undercount because of inadequate or inconsistent testing and reporting and suspected concealment by some countries. And the number continues to mount. Nearly 5,000 deaths are reported each day on average. Parts of Europe are getting hit by a second wave, and experts fear the same fate may await the U.S., which accounts for about 205,000 deaths, or 1 out of 5 worldwide. That is far more than any other country, despite America’s wealth and medical resources. “I can understand why … numbers are losing their power to shock, but I still think it’s really important that we understand how big these numbers really are,” said Mark Honigsbaum, author of “The Pandemic Century: One Hundred Years of Panic, Hysteria and Hubris.” The global toll includes people like Joginder Chaudhary, who was his parents’ greatest pride, raised with the little they earned farming a half-acre plot in central India to become the first doctor from their village. After the virus killed the 27-year-old Chaudhary in late July, his mother wept inconsolably. With her son gone, Premlata Chaudhary said, how could she go on living? Three weeks later, on Aug. 18, the virus took her life, too. All told, it has killed more than 95,000 in India. “This pandemic has ruined my family,” said the young doctor’s father, Rajendra Chaudhary. “All our aspirations, our dreams, everything is finished.” When the virus overwhelmed cemeteries in the Italian province of Bergamo last spring, the Rev. Mario Carminati opened his church to the dead, lining up 80 coffins in the center aisle. After an army convoy carted them to a crematory, another 80 arrived. Then 80 more. Eventually the crisis receded and the world’s attention moved on. But the pandemic’s grasp endures. In August, Carminati buried his 34-year-old nephew. “This thing should make us all reflect. The problem is that we think we’re all immortal,” the priest said. The virus first appeared in late 2019 in patients hospitalized in the Chinese city of Wuhan, where the first death was reported on Jan. 11. By the time authorities locked down the city nearly two weeks later, millions of travelers had come and gone. China’s government has come in for criticism that it did not do enough to alert other countries to the threat. Government leaders in countries like Germany, South Korea and New Zealand worked effectively to contain it. Others, like U.S. President Donald Trump and Brazil’s Jair Bolsonaro, dismissed the severity of the threat and the guidance of scientists, even as hospitals filled with gravely ill patients. Brazil has recorded the second most deaths after the U.S., with about 142,000. India is third and Mexico fourth, with more than 76,000. The virus has forced trade-offs between safety and economic well-being. The choices made have left millions of people vulnerable, especially the poor, minorities and the elderly. With so many of the deaths beyond view in hospital wards and clustered on society’s margins, the milestone recalls the grim pronouncement often attributed to Soviet dictator Josef Stalin: One death is a tragedy, millions of deaths are a statistic. The pandemic’s toll of 1 million dead in such a limited time rivals some of the gravest threats to public health, past and present. It exceeds annual deaths from AIDS, which last year killed about 690,000 people worldwide. The virus’s toll is approaching the 1.5 million global deaths each year from tuberculosis, which regularly kills more people than any other infectious disease. But “COVID’s grip on humanity is incomparably greater than the grip of other causes of death,” said Lawrence Gostin, a professor of global health law at Georgetown University. He noted the unemployment, poverty and despair caused by the pandemic, and deaths from myriad other illnesses that have gone untreated. For all its lethality, the virus has claimed far fewer lives than the so-called Spanish flu, which killed an estimated 40 million to 50 million worldwide in two years, just over a century ago. That pandemic came before scientists had microscopes powerful enough to identify the enemy or antibiotics that could treat the bacterial pneumonia that killed most of the victims. It also ran a far different course. In the U.S., for example, the Spanish flu killed about 675,000. But most of those deaths did not come until a second wave hit over the winter of 1918-19. Up to now, the disease has left only a faint footprint on Africa, well shy of early modeling that predicted thousands more deaths. But cases have recently surged in countries like Britain, Spain, Russia and Israel. In the United States, the return of students to college campuses has sparked new outbreaks. With approval and distribution of a vaccine still probably months away and winter approaching in the Northern Hemisphere, the toll will continue to climb. “We’re only at the beginning of this. We’re going to see many more weeks ahead of this pandemic than we’ve had behind us,” Gostin said."}]}