{"article": [{"url": "https://www.marketwatch.com/story/in-memoir-michael-cohen-casts-himself-as-star-witness-against-trump-2020-09-06", "published": 1599549500.0, "headline": "Michael Cohen casts himself as â\u0080\u0098star witnessâ\u0080\u0099 against Trump in new memoir", "body": "NEW YORK â\u0080\u0094 Michael Cohenâ\u0080\u0099s tell-all memoir makes the case that President Donald Trump is â\u0080\u009cguilty of the same crimesâ\u0080\u009d that landed his former fixer in federal prison, offering a blow-by-blow account of Trumpâ\u0080\u0099s alleged role in a hush money scandal that once overshadowed his presidency. Of all the crises Cohen confronted working for Trump, none proved as vexing as the porn actress Stormy Daniels and her claims of an extramarital affair with Trump, Cohen writes in â\u0080\u009cDisloyal: The True Story of the Former Personal Attorney to President Donald J. Trump.â\u0080\u009d Trump, despite his later protestations, green-lighted the $130,000 payment to silence Daniels ahead of the 2016 election, reasoning he would â\u0080\u009chave to payâ\u0080\u009d his wife a far greater sum if the affair ever became known, Cohen writes, adding the president later reimbursed him with â\u0080\u009cfake legal fees.â\u0080\u009d â\u0080\u009cIt never pays to settle these things, but many, many friends have advised me to pay,â\u0080\u009d Trump said, according to Cohen. â\u0080\u009cIf it comes out, Iâ\u0080\u0099m not sure how it would play with my supporters. But I bet theyâ\u0080\u0099d think itâ\u0080\u0099s cool that I slept with a porn star.â\u0080\u009d The White House called Cohenâ\u0080\u0099s memoir â\u0080\u009cfan fiction.â\u0080\u009d â\u0080\u009cHe readily admits to lying routinely but expects people to believe him now so that he can make money from book sales,â\u0080\u009d White House spokesman Brian Morgenstern said in a statement. â\u0080\u009cItâ\u0080\u0099s unfortunate that the media is exploiting this sad and desperate man to attack President Trump.â\u0080\u009d The Associated Press obtained an early copy of the book, which is scheduled to be released Tuesday. Cohen, who pleaded guilty to campaign-finance violations and other crimes, including lying to Congress, calls himself the â\u0080\u009cstar witnessâ\u0080\u009d of a hush-money conspiracy that still could culminate in charges for Trump after he leaves office. He described his new book as a â\u0080\u009cfundamental piece of evidenceâ\u0080\u009d of the presidentâ\u0080\u0099s guilt. In an interview with NBCâ\u0080\u0099s Lester Holt last week, Cohen said he fears Trump would now do anything to stay in power, laying out prospective scenarios, and adding that a peaceful transition of power after a Trump loss on Nov. 3 is not a certainty. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Cohenâ\u0080\u0099s allegations â\u0080\u0094 his most detailed to date â\u0080\u0094 are part of an unsparing and deeply personal take-down attempt on Trump. Cohen assails Trump as an â\u0080\u009corganized crime donâ\u0080\u009d and â\u0080\u009cmaster manipulator,â\u0080\u009d but allows that he saw much of himself in a man he once considered a father figure. â\u0080\u009cI care for Donald Trump, even to this day,â\u0080\u009d Cohen writes, â\u0080\u009cand I had and still have a lot of affection for him.â\u0080\u009d Cohen remains at a loss to explain his unswerving allegiance to a cutthroat businessman who abandoned him at the most vulnerable point in his life. He likens his fealty to Trump to a mental illness and said he thought of himself as acting like a drug user in need of an intervention. â\u0080\u009cIt seemed to [my family] that I wouldnâ\u0080\u0099t listen to anyone, not even the people who loved me most, as I gradually gave up control of my mind to Trump,â\u0080\u009d Cohen writes. â\u0080\u009cI confess I never really did understand why pleasing Trump meant so much to me,â\u0080\u009d Cohen adds. â\u0080\u009cTo this day I donâ\u0080\u0099t have the full answer.â\u0080\u009d The memoir offers an introspective â\u0080\u0094 and at times self-loathing â\u0080\u0094 apology for the role Cohen played in Trumpâ\u0080\u0099s political ascent. He urged Trump for years to run for president but now laments that his election â\u0080\u009cled the nation and maybe even the world to the brink of disaster.â\u0080\u009d Key Words (January 2019):Michael Cohen confirms he paid tech firm to rig polls and says Trump directed him to do it â\u0080\u009cI thought Trump was a visionary with a no-nonsense attitude and the charisma to attract all kinds of voters,â\u0080\u009d he writes. But the real reason he wanted Trump in the White House, Cohen concedes, â\u0080\u009cwas because I wanted the power that he would bring to me.â\u0080\u009d Cohen expresses little to no remorse for his federal crimes, saying he was â\u0080\u009crailroadedâ\u0080\u009d by the government and pleaded guilty after prosecutors threatened to indict his wife. He writes that Trumpâ\u0080\u0099s three oldest children came to Cohenâ\u0080\u0099s office after Trumpâ\u0080\u0099s campaign announcement in 2015, in which Trump referred to people coming to the U.S. from Mexico as rapists and murderers. Cohen says they asked him to convince their father to drop out of the race, arguing his rhetoric was â\u0080\u009ckilling the company.â\u0080\u009d Cohen says Trump was unconcerned with any harm to his businesses. â\u0080\u009cPlus, I will never get the Hispanic vote,â\u0080\u009d Trump said, according to Cohen. â\u0080\u009cLike the blacks, theyâ\u0080\u0099re too stupid to vote for Trump. Theyâ\u0080\u0099re not my people.â\u0080\u009d Cohen returns to Trumpâ\u0080\u0099s treatment of women throughout the book. He describes the married Trump ogling contestants at his Miss Universe pageant and boasting he could â\u0080\u009chave all of themâ\u0080\u009d if he wanted. He also claimed to have seen Trump corner and forcibly kiss women at his office. In a far more personal episode, Cohen writes of Trump leering at Cohenâ\u0080\u0099s daughter at Trumpâ\u0080\u0099s New Jersey golf club in 2012. Cohen writes that when he told Trump that it was his daughter he was ogling, Trump replied: â\u0080\u009cWhen did she get so hot?â\u0080\u009d She was 15 years old at the time. Cohen also sheds light on Trumpâ\u0080\u0099s admiration of Russian President Vladimir Putin, saying he admired him most because he â\u0080\u009chad the balls to take over an entire nation and run it like it was his personal company.â\u0080\u009d He characterizes Trumpâ\u0080\u0099s campaign as, in his view, â\u0080\u009cfar too chaotic and incompetent to actually conspire with the Russian government.â\u0080\u009d Beyond his dealings with Trump, Cohen waxes nostalgic about experiences he says informed his fierce loyalty and attack-dog persona. The Long Island native, a Holocaust survivorâ\u0080\u0099s son, writes of rubbing shoulders with mobsters at his uncleâ\u0080\u0099s club, where he worked as a teen. After witnessing a poolside shooting, he says he felt a duty to keep quiet. A few days later, he writes, a tough-looking fellow handed him an envelope stuffed with $500 in cash. Cohen has led a publicity blitz around his memoir even as he serves his federal sentence in home confinement. A judge ruled this summer that authorities had retaliated against him, sending him back to prison in upstate New York after he was furloughed because of the coronavirus pandemic, for publishing the book ahead of the November election. Cohen was released to home confinement in July and the government lifted a ban on him speaking publicly. â\u0080\u009cThis story is all I have left for my wife, my children and the country I love so much,â\u0080\u009d Cohen writes. MarketWatch contributed."}]}