{"article": [{"url": "https://www.marketwatch.com/story/treasury-still-too-secretive-on-small-business-loans-watchdogs-say-2020-06-21", "published": 1592758520.0, "headline": "Treasury still too secretive on small business loans, watchdogs say", "body": "NEW YORK — The Trump administration has relented to public pressure and pledged to provide more details about which small businesses received loans from a $600 billion-plus coronavirus aid program. But government watchdogs say even more transparency is needed to get an accurate picture of who was helped, and who was left out. Under pressure from Democratic lawmakers and government watchdogs, the Treasury Department and the Small Business Administration said Friday they would disclose the names of small business owners who received $150,000 or more in forgivable loans. The agencies will reveal the general amount these businesses received, their address, demographic data and the number of jobs they helped protect. But for loans of less than $150,000, the agencies will not name the recipients, revealing only summary information broken down by zip code, industry and demographics. Experts say this could paint an incomplete or misleading picture. Recipients of smaller loans could be part of a bigger subsidiary that would be hidden, and it won’t be clear what percentage of loans went to minority-owned businesses. A factory located in a minority neighborhood, for example, could be owned by an individual or conglomerate based elsewhere. The administration’s new approach on disclosure “is a big deal compared to where we were, but it’s not enough to have confidence that this money is going to the right people, who actually urgently need it,” said Danielle Brian, executive director of the nonpartisan Project On Government Oversight. Treasury Department spokespeople didn’t respond to a request for comment Saturday, although Secretary Steven Mnuchin has previously said he is concerned about business owners’ privacy. Sen. Marco Rubio, the Florida Republican who heads the Senate Small Business Committee, said Friday that Treasury’s plan to disclose more information strikes the right balance. As of Friday, the SBA said it had processed 4.6 million loans worth about $512 billion. Nearly 75% of the money approved so far has gone to businesses borrowing more than $150,000. But 86% of the loans have gone to businesses borrowing less than $150,000, according to the SBA. The Paycheck Protection Program started in early April and runs out at the end of the month. The loans can be forgiven if businesses use the money to keep employees on payroll or rehire workers who have been laid off. Several hundred publicly traded companies received these loans despite their likely ability to borrow money elsewhere and, after an outcry, some said they would return the money. The pandemic has caused a deep recession and the U.S. unemployment rate is above 13% after falling slightly in May. Economists have said the small business loan program has helped, although it’s hard to know by how much. The SBA has so far only provided general information about the beneficiaries of its loans, such as the industry they are in and the state in which they are located. John Arensmeyer, founder and CEO of the Small Business Majority, said in a statement that minority- and women-owned businesses appear to be getting disproportionately less funding than others, based on surveys of the 65,000 businesses in his network. “To understand how rampant this problem is, the administration ought to release the loan amount requested and loan amount received for all recipients,” Arensmeyer said. Watchdogs also are seeking information from the banks that processed the government-loan applications. A U.S. House subcommittee investigating coronavirus relief programs last week asked bank executives for complete lists of applicants and whether they were approved. Robert Weissman, president of Public Citizen, a consumer advocacy organization, says that having a robust picture of how the money was allocated will also help offer lessons for the future. The coronavirus pandemic isn’t going away any time soon, and the economy could need another assistance program, he says. “It’s taxpayer money,” he said. “It is completely reasonable for the public to know who received it.”"}]}