{"article": [{"url": "https://www.marketwatch.com/story/teladoc-livongo-185-billion-merger-is-a-huge-step-forward-for-digital-health-analysts-say-2020-08-05", "published": 1596694880.0, "headline": "Teladoc-Livongo $18.5 billion merger is a huge step forward for digital health, analysts say", "body": "Teladoc Health Inc. and Livongo Health Inc. said Wednesday they have agreed to merge in a deal valued at $18.5 billion that will create a company that can serve a spectrum of health needs using virtual care. Purchase, New York-based Teladoc TDOC, -1.52% is a pioneer in virtual health, while Mountain View, California-based Livongo LVGO, -1.17% is known for hardware and software that’s used to monitor and manage chronic conditions including diabetes. Under the terms of the deal, Livongo shareholders will receive 0.592 shares of Teladoc plus $11.33 in cash per Livongo share. Teladoc shareholders will own abut 58% of the combined entity, while Livongo shareholders will own the remaining 42%. The combination “creates a global leader in consumer centered virtual care,” the companies said in a joint statement. Analysts said the deal is a major step forward in advancing digital health care and is timely, coming in the midst of the coronavirus pandemic, which has greatly expanded the adoption of digital and remote health care services. “In our view this merger makes all the sense in the world,” said Verity Research analyst David Larsen. “When a Livongo member communicates with a health coach, we suspect that many times this health coach would in theory like to be able to refer the member to a physician, and they would like to be able to provide more in-depth care and services for other ailments that members may have.” See now:We deserve an economy that provides jobs, public health and a sustainable environment “By combining with Teladoc, Livongo members will have access to expert physician communications, their own primary care physician, they will have the ability to get prescriptions written for them, and this combined platform truly gives the entire world a digital health care solution,” Larsen wrote in a note to clients. Forrester Research Senior Analyst Arielle Trzcinski agreed. “With the addition of robust analytics through the Applied Health Signals offering from Livongo, the combined company will provide their clients with rich insight to support more effective chronic care management, a deeper level of personalization, and more robust mental health capabilities,” she wrote in commentary. Read also:Biotech’s smart money is already focused on disease prevention, boosting immune systems and longevity And with mental health needs rising on an almost daily basis during the pandemic, “the MyStrength offering from Livongo will provide a great complement to Teladoc’s existing virtual mental health care capabilities, enabling more proactive engagement with individuals that may otherwise suffer in silence,” she wrote. Livongo shares rose immediately after the news was announced, before falling back 7% in early afternoon trade. Teladoc was down 14.6%, but both stocks have chalked up strong gains in the year to date, rising through the pandemic on expectations demand for their services will grow. Teladocremains up 155% in the year to date, while Livongo has gained 427% and the S&P 500 SPX, +0.87% has gained 2.9%. The new entity is expected to have pro forma revenue of about $1.3 billion for 2020, equal to pro forma growth of 85%. “Livongo is a world-class innovator we deeply admire and has demonstrated success improving the lives of people living with chronic conditions,” Teladoc Chief Executive Jason Gorevic said in a statement. “Together, we will further transform the health care experience from preventive care to the most complex cases, bringing ‘whole person’ health to consumers and greater value to our clients and shareholders as a result.” The deal is expected to close in the fourth quarter. The combined company is expected to generate revenue synergies of $100 million by the end of the second year after the deal closes and to achieve $500 million on a run rate basis by 2025. Gorevic will become CEO of the combined company, and the board will comprise eight members of the Teladoc board and five members of the Livongo board. See also: Tech companies are offering parents additional benefits as COVID-19 threatens schools’ return Health plans will also likely favor the deal, wrote Verity Research’s Larsen. Their members will now have access to health maintenance along with lower-cost telehealth visits. “While Amazon AMZN, +3.01% and other large entities in industry have talked about wanting to revolutionize health care, and lower its costs while improving value, this deal will actually deliver on that objective,” he wrote. Given the new company’s total addressable market — the entire global population — “we do not see how the growth of this organization is at risk of slowing any time soon,” he wrote. On separate conference calls to discuss the deal, management said they expected to grow revenue organically by 30% to 40% in the next few years. The deal price offers a roughly 10% premium over Livongo’s closing share price on Tuesday and “makes sense” given the market would not have accepted anything less than that. Livongo also reported second-quarter earnings early Wednesday, showing adjusted per-share earnings of 11 cents, well ahead of the 2 cents FactSet consensus. Revenue rose 125% to $91.9 million, comfortably ahead of the $83.4 million consensus."}]}