{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-health-officials-clamor-for-us-states-seeing-spikes-in-covid-19-infections-to-pause-reopening-2020-07-10", "published": 1594391240.0, "headline": "Coronavirus update: Health officials clamor for U.S. states to pause reopenings amid spikes in COVID-19 infections", "body": "U.S. states that are experiencing major problems with new infections of the coronavirus illness COVID-19 should pause their reopening efforts to get the outbreak under control and encourage residents to wear face masks, wash their hands regularly and socially distance. That’s according to Dr. Anthony Fauci, head of the National Institute for Allergies and Infectious Diseases, in comments Thursday in separate interviews in which he again said the U.S. is not doing well at containing the spread of the deadly illness. Fauci seemed to walk back comments made Wednesday urging states to “seriously look at shutting down,” a position that put him at odds with President Donald Trump, who has been pushing aggressively for the U.S. to reopen for business, against the advice of his own health experts. This week he and allies have placed particular emphasis on the reopening of schools. On Thursday, Fauci, who is considered to be the nation’s leading infectious-disease expert, said pausing would give states the chance to look “at what did not work well and try to mitigate that. ... I don’t think we need to go back to an extreme of shutting down.” See:CDC won’t revise guidelines for reopening schools, despite Trump claim Fauci also lamented that partisanship has made the fight against coronavirus tougher. “When you don’t have unanimity in an approach to something, you’re not as effective in how you handle it,” he said in an interview Thursday with FiveThirtyEight’s PODCAST-19. “So I think you’d have to make the assumption that, if there wasn’t such divisiveness, that we would have a more coordinated approach.” His comments came a day after another leading public health expert, Michael Osterholm, head of the Center for Infectious Disease Research and Policy at the University of Minnesota, said the U.S. needs to go back to Square 1. “We have to shut down again and bring the U.S. back up slowly, in a measured way,” Osterholm said in an interview on MSNBC. The U.S. saw more than 60,000 new infections on Thursday, according to data aggregated by Johns Hopkins University, and the death toll has started to move higher amid a wave of hospitalizations in states in the South and West. Thirty-eight states have seen a rise in cases in the last 14 days, according to a New York Times tracker. There was grim news from Mississippi Health Officer Thomas Dobbs, who said Thursday that the state’s five biggest medical groups have run out of intensive-care-unit beds, the Washington Post reported. ‘Mississippi hospitals cannot take care of Mississippi patients,” Dobbs said. Harvard Global Health Institute researchers have developed a national tracker to trace the severity of the outbreak on a state-by-state basis, and it’s flashing red for Arizona, Florida, Louisiana, South Carolina and Georgia, with 25 cases per 100,000 people. “Once a community reaches the red risk level, stay-at-home orders become necessary again,” the researchers wrote. At least one of those states, Florida, is unlikely to consider shutting down again, after Gov. Ron DeSantis showed his determination to reopen schools in the Sunshine State in the fall, in line with Trump’s push, which has included threatening to withhold federal education funds. DeSantis drew criticism after saying Thursday that if retailers like Walmart and Home Depot are open, schools should be, too. The risk of children getting sick is “extremely, extremely low,” DeSantis said, according to a Tampa Bay Times report, and if stores are essential businesses during the pandemic, schools should reopen as well. Sate education officials said they will stick with reopening plans that include online learning from home. Broward School Superintendent Robert Runcie told the South Florida Sun-Sentinel that “we do not see a realistic path” to schools opening five days a week. While the virus initially proved fatal mostly for older people, young people and children have also seen horrifying side effects from the illness, including a rare but sometimes life-threatening condition that is being called multisystem inflammatory syndrome in children, or MIS-C. The condition presents with symptoms that often differ from kid to kid, and can include fever, stomach pain and rashes, as well as red eyes, loss of appetite and lethargy. Earlier this week, U.K. neurologists published a report on how the virus can cause brain damage, including strokes, psychosis and paranoia in some patients. From MarketWatch partner Financial News:Coronavirus R-rate rises in London as cases multiplyLatest tallies There are now 12.3 million confirmed cases of COVID-19 worldwide, and the U.S. has more than a quarter of them at 3.12 million, the Johns Hopkins data show. At least 555,531 people have died, while at least 6.8 million people have recovered. The U.S. death toll stands at 133,291. Brazil is second to the U.S. with 1.76 million cases and 69,184 deaths. India is third measured by cases at 793,802, followed by Russia with 712,863 and Peru with 316,448. The U.K. has had 44,687 fatalities, the highest in Europe and third highest in the world. China, where the illness was first reported late last year, has 84,992 cases and 4,641 fatalities.What’s the latest medical news? Gilead Sciences Inc. GILD, +0.82% disclosed findings from a new internal analysis of previously disclosed clinical trial data that found the experimental therapy remdesivir can reduce the risk of mortality in COVID-19 patients by 62%, when compared with the standard of care, as MarketWatch’s Jaimy Lee reported. Gilead said the mortality data point is “an important finding that requires confirmation in prospective clinical trials.” The new analysis is not from a randomized, placebo-controlled clinical trial; it stems from a comparative, pre-planned analysis of 312 severely ill participants in a randomized, open-label Phase 3 trial and a real-world retrospective cohort of 818 patients with COVID-19 who had similar clinical attributes to those included in the trial and received remdesivir as part of their treatment. The new analysis may also help reinforce previous conclusions from a randomized, placebo-controlled National Institutes of Health trial that found remdesivir can reduce recovery times, a finding that was published in April and contributed to the Food and Drug Administration’s decision in May to grant an emergency-use authorization to remdesivir.What are companies saying? United Airlines Holdings Inc. UAL, +0.32% suffered another blow on Thursday, when S&P Global Ratings downgraded its debt by one notch to B+, pushing it further into junk-bond territory. The ratings agency expects the airline to generate a “substantial cash-flow deficit,” thanks to a “steep decline” in bookings due to the pandemic. A return to positive cash flow is expected next year, S&P said. United is taking several steps to offset the reduced bookings, but these will not be enough, it said. “As of now, we expect air traffic to begin to recover in the second half of 2020, but any delay will prolong weakness in credit metrics,” the ratings agency said. There was better news from retailer Express Inc., which said sales and traffic are picking up now that about 95% of its stores have reopened after being closed during the pandemic. However, same-store sales and traffic declined in Arizona, California, Florida and Texas in late June, as COVID-19 cases began to spike. Here’s the latest news about companies and COVID-19: • Carrier is launching an air-filter machine to be used in institutional settings such as school classrooms, libraries and gyms, to help keep the air clear of contaminants and pathogens like the coronavirus. The heating, ventilating and air-conditioning company, part of Carrier Global Corp. CARR, +0.87% after it was spun off the former United Technologies Corp. in May, said the new unit, called the OptiClean 1500-cfm Dual-Mode Air Scrubber & Negative Air Machine, joins an existing OptiClean 500-cfm unit, which was launched in April for use in hospitals. The machine can be plugged into a standard wall outlet and uses a long-life HEPA filter to improve indoor air quality. Chris Nelson, head of Carrier’s HVAC business, said the company is expecting the machine to help schools keep students and teachers safe as they prepare to reopen in the fall. The units are portable and take up just 3 square feet of floor space. • Clothing retailer Express Inc.’s EXPR, +3.04% same-store sales and traffic are improving as most of its stores have reopened after being closed for the coronavirus pandemic. The Columbus, Ohio–based company said about 95% of its stores are now open and the rest are expected to open in the coming weeks. Same-store sales have improved to negative 15% in the third week of June from negative 50% in early May. However, same-store sales and traffic declined in Arizona, California, Florida and Texas in late June, as COVID-19 cases began to spike. The company has buy-online-and-pickup-in-store capabilities at more than 275 locations and plans to have all stores enabled by the end of the third quarter. “Results in stores have been negatively impacted by multiple factors, including reduced mall traffic due to COVID-19 and the cancellation of June and July product, the latter causing the assortments to not yet be fully reflective of the Company’s new vision but deemed prudent in order to effectively manage liquidity,” said the company. • Franklin Covey Co. FC, +2.25%, a maker of management and organization products and services, reported third-fiscal-quarter sales below expectations, and its quarterly loss was wider than expected as executives and educators switched to online learning amid closures to curb the spread of the coronavirus. All of the company’s business units “were adversely impacted by the closure of offices, schools, and other gathering places in the United States and in other countries” amid the pandemic, the company said. Training, coaching and consulting resulted in fewer sales for both its enterprise and education divisions; the education division also missed out on sales of materials and fewer coaching days as educators transitioned to online classes. • Kroger Co. KR, +0.46% rang up 75% higher sales for plant-based meat between the months of March and June 2020. Customer count for these items during the period rose by half. The data accompanied the results of a study conducted by the grocer and the Plant Based Foods Association that found plant-based-meat sales grew 23% when these items were placed in the meat department. Kroger sells plant-based-meat products under its Simple Truth private label, as well as plant-based brands like Beyond Meat Inc. BYND, +0.80%. Alphabet Economics: Why the Old Rules of Recoveries May Not Apply"}]}