{"article": [{"url": "https://www.marketwatch.com/story/the-extra-600-americans-receive-in-unemployment-benefits-ends-this-month-heres-what-else-is-on-the-table-2020-07-02", "published": 1593849980.0, "headline": "The extra $600 Americans receive in unemployment benefits ends this month â\u0080\u0094 hereâ\u0080\u0099s what else is on the table", "body": "The clock is ticking for lawmakers on Capitol Hill who have until July 31 to come to an agreement on the extra $600 a week unemployed Americans have been receiving under the $2.2 trillion CARES Act. Failure to act before the end of the month will strip more than 20 million Americans of nearly $842 billion to spend, according to data released by the Bureau of Economic Analysis, a U.S. government agency that provides official macroeconomic and industry statistics. That could cost the country even more jobs, some economists say. But given that two-thirds of laid-off workers receive more money from their unemployment benefits than they did from their jobs, the Trump administration and leading Republicans say extending these benefits would be akin to paying Americans not to work. “ Failure to act before the end of the month will strip more than 20 million Americans of a total of nearly $842 billion to spend ” In the race against time, Senate Minority Leader Chuck Schumer and Oregon Sen. Ron Wyden introduced legislation on Wednesday that would extend the $600 unemployment benefit â\u0080\u009cuntil a stateâ\u0080\u0099s three-month average total unemployment level falls below 11%.â\u0080\u009d â\u0080\u009cOnce the unemployment rate falls below 11%, the benefit amount reduces by $100 for each percentage point decrease in a stateâ\u0080\u0099s unemployment rate,â\u0080\u009d the proposal states. These enhancements would remain in place until March 2021. For instance, beneficiaries in a state with an unemployment rate between 7% to 8% would receive an additional $200 a week on top of their stateâ\u0080\u0099s unemployment benefits. Nevada has the highest state unemployment rate of 25.3% as of May, according to the Bureau of Labor Statistics. Nebraska, in contrast, has the lowest state unemployment of 5.3%. Nationally, the unemployment rate hovers at 11.1% down from 13.3% in May. Donâ\u0080\u0099t miss: U.S. regains 4.8 million jobs in June and unemployment falls to 11.1%, but rehiring poised to slow “ The Schumer-Wyden proposal â\u0080\u0098would go a long way to providing workers and families with certainty that the benefits they count on will be there as long as they need themâ\u0080\u0099 ” â\u0080\u0094 Rep. Don Beyer, vice chair of the Joint Economic Committee â\u0080\u009cIf we fail to renew the $600 per week increase in [unemployment insurance], millions of American families will have their legs cut out from underneath them at the worst possible time â\u0080\u0094 in the middle of a pandemic when unemployment is higher than itâ\u0080\u0099s been since the Great Depression,â\u0080\u009d Schumer said in a statement. Schumer and Wydenâ\u0080\u0099s proposal shares similarities with a separate proposal Rep. Don Beyer, a Virginia Democrat, introduced last month. That proposal garnered support from Former Federal Reserve Chairmen Ben Bernanke and Janet Yellen. The main difference between the two is that Beyerâ\u0080\u0099s would allow Americans to continue to receive the additional $600 benefit for as long as the national emergency or state emergency for COVID-19, the disease caused by the novel coronavirus, is in effect. Once the national or state emergency is terminated, jobless Americans would receive benefits based on their stateâ\u0080\u0099s unemployment level. Opinion: To avoid a step backwards this summer, Congress must renew enhanced unemployment benefits The Schumer-Wyden proposal â\u0080\u009cwould go a long way to providing workers and families with certainty that the benefits they count on will be there as long as they need them,â\u0080\u009d Beyer, vice chair of the Joint Economic Committee, said. But it faces competition from Republican Sen. Rob Portmanâ\u0080\u0099s return-to-work bonus proposal that would provide an additional $450 a week for Americans who return to work. â\u0080\u009cNot only is the return-to-work bonus proposal the right policy in terms of incentivizing people to safely return to work and allowing businesses to reopen, but it could also benefit the American taxpayer through significant cost savings compared to the current money weâ\u0080\u0099re spending on the CARES Act unemployment benefits,â\u0080\u009d Portman said in a statement to MarketWatch. President Donald Trump is against extending the $600 past July, saying that it gives Americans â\u0080\u009ca disincentive to work.â\u0080\u009d â\u0080\u009cYouâ\u0080\u0099d make more money if you donâ\u0080\u0099t go to work,â\u0080\u009d he said during an interview with Fox Business Network that aired Wednesday. â\u0080\u009cWe donâ\u0080\u0099t want to have that. We want to have people get out, and we want to create a tremendous incentive for people to want to go back to work.â\u0080\u009d Trump did not indicate specifically if he supports Portmanâ\u0080\u0099s proposal, though National Economic Council Director Larry Kudlow said that the Trump administration is looking â\u0080\u009cvery carefullyâ\u0080\u009d at it. Trump also said in the interview that heâ\u0080\u0099s in favor of providing another round of stimulus checks to Americans in â\u0080\u009cactually larger numbers than the Democrats.â\u0080\u009d Senate Majority Leader Mitch McConnell said on Tuesday he will consider another coronavirus stimulus package when lawmakers return from their two-week July 4 recess."}]}