{"article": [{"url": "https://www.marketwatch.com/story/while-politicians-squabble-new-york-schools-make-their-own-plans-2020-07-10", "published": 1594384880.0, "headline": "While politicians squabble, New York schools make their own plans", "body": "Should the schools stay closed until the pandemic is finally beaten? Or should the doors swing open as if all the danger has disappeared? As the politicians and pundits leap one way or the other, people on the front lines of America’s largest public-school system are speaking out from hard experience: Only a politician or a pundit would choose either of those simple-minded extremes. “ “Every parent I know is freaking out.” ” — Sarah Garland, executive editor of the Hechinger Report and a Brooklyn mom The only reasonable plan for September, the people who really know say, is a “hybrid” system where students return to the classroom two or three days a week. “Parents are eager to send the kiddos back to school—of course, they are,” said Ricardo Colon, an instructional coach (a teacher of teachers) at PS/IS 30, a large and diverse K-8 school in Bay Ridge, Brooklyn. “But safety first and foremost. That’s why it’s so important we get these details right.” “There is no plan for opening with all the kids coming back in together,” said Michael Mulgrew, president of the United Federation of Teachers, the union representing 75,000 New York teachers, 19,000 classroom paraprofessionals and assorted other school personnel. “That would mean we couldn’t do the safety procedures that are the minimum we need to keep the school community safe.” By school community, Mulgrew means the children, the teachers and also the families they all go home to. That’s a lot of people—1.1 million students alone. It’s one big, interconnected web. “It’s a series of bad choices we are facing,” said Brooklyn mom Sarah Garland, still frazzled from three months of “distance learning” with a 5- and 6-year-old. “Every parent I know is freaking out.” They are keenly aware of the health risks of packing school buildings as a deadly infection still rages. But after the abrupt suspension of classroom teaching on March 15, “as a parent, it’s hard not to feel, ‘Please, take my kid for five days a week.’ I had no idea how hard it was to teach a child to write—and I’m a writer!” Along with her recent conscription as a home-school instructor, Garland is also executive editor of the Hechinger Report, a nonprofit newsroom based at Teachers College, Columbia University, that has won praise for its savvy coverage of education issues across the U.S. “This is tough for everyone,” she said. “But for needier populations, not having schools open is devastating. So the question is, ‘How do we do it safely?’” Like mask-wearing, large gatherings and so much else about the coronavirus crisis, the debate over school reopening has been sharply politicized. President Donald Trump, Florida Gov. Ron DeSantis and some others are demanding a full return to classes after the summer break, saying the economy requires it. Washington Democrats, state and local officials from both parties and most public-health experts, including the top leaders at the National Institutes of Health and the Centers for Disease Control and Prevention, have been urging greater caution. Infection rates are still shooting up in many states, they note. See: Trump threatens federal funding for schools, says he disagrees with CDC over reopening guidelines But the people closest to the schools—parents, teachers and the local officials who run them—are tuning out the divisive rhetoric and tackling the thousands of crucial details that must be resolved. “I’m talking to teachers all the time,” said Colon, whose school has the city’s only English-Arabic bilingual curriculum. “We knew we couldn’t wait for City Hall to solve this. We’ve been working on it since April 1. We have the rudimentary outlines of what it will be. If we get the resources and support we need, we can make it work in September.” Get ready for fewer kids in a classroom, he said. Desks and other furnishings that can keep everyone separated (after years of team learning and enhanced collaboration). Sanitizer and cleaning supplies everywhere. Lunch is still a question mark. And masks. Lots of masks. See: Under proposed plan, NYC students to attend in-person classes two or three times a week in September “We’re talking about kids,” Colon said. “You know some of those masks are ending up on the floor. We need extra supplies of everything.” So will this really happen? Will the New York schools be ready? Doesn’t the virus get a vote? “If we remain on our current trajectory on the virus,” said the union’s Mulgrew, “yes, this is realistic.” But whatever plan’s in place for the first day of school in September, it will almost certainly need to be adjusted in the days and weeks after that. “We have to take advantage of new information on the science side,” Mulgrew said. “There’s testing. And contact tracing. We’ll be ready, but we’ll still be filling in the pieces as we go along.” Ellis Henican is an author based in New York City and a former newspaper columnist."}]}