{"article": [{"url": "https://www.marketwatch.com/story/group-of-former-cdc-heads-say-no-president-has-ever-politicized-the-leading-us-health-agency-as-trump-has-2020-07-14", "published": 1595071580.0, "headline": "Group of former CDC heads say no president has ever politicized the leading U.S. health agency the way Trump has", "body": "A group of four former heads of the Centers for Disease Control and Prevention said Tuesday the U.S. is contending with two opponents in its battle to contain the coronavirus pandemic. The first is COVID-19, the illness caused by the coronavirus that has infected more than 3.36 million Americans and caused the deaths of 135,616, according to data aggregated by Johns Hopkins University. The second: political leaders and others trying to undermine the CDC. “ ‘Trying to fight this pandemic while subverting scientific expertise is like fighting blindfolded.’ ” In an op-ed in the Washington Post, the four — Tom Frieden, Jeffrey Koplan, David Satcher and Richard Besser — who among them led the CDC over a period of more than 15 years encompassing both Republican and Democratic administrations, wrote that they cannot recall a single time in the past when political pressure had actually led to a change in the interpretation of scientific evidence. Yet that’s exactly what’s happening in the current administration as President Donald Trump has undercut guidelines devised by the CDC on safely reopening schools immediately after they were released, said the op-ed. “Through last week, and into Monday, the administration continued to cast public doubt on the agency’s recommendations and role in informing and guiding the nation’s pandemic response,” the health experts wrote. “On Sunday, Education Secretary Betsy DeVos characterized the CDC guidelines as an impediment to reopening schools quickly rather than what they are: the path to doing so safely. The only valid reason to change released guidelines is new information and new science — not politics.” Coronavirus update:Global cases of COVID-19 climb above 13 million as California, Hong Kong and India reimpose restrictions on movement The CDC guidelines aim not just to protect children, but also the many adults in their orbit, from parents to teachers to school staffers and their families. Failing to comply with those guidelines will put many lives at risk, according to the op-ed, while also introducing “chaos and uncertainty.” “ ‘In fact, the U.S. has more cases and deaths than any other country, and the sixth highest rate of any large country in the world. The U.S. is home to a quarter of the world’s confirmed COVID-19 cases, despite accounting for just 4.4% of the global population.’ ” The CDC houses many experts who have worked for decades to contain other deadly pathogens, including HIV, Zika and Ebola. See also:School reopenings should not be guided by politics, doctors say “Despite the inevitable challenges of evolving science and the public’s expectation of certainty, these are the people best positioned to help our country emerge from this crisis as safely as possible,” said the op-ed. “Unfortunately, their sound science is being challenged with partisan potshots, sowing confusion and mistrust at a time when the American people need leadership, expertise and clarity.” The result has been an undermining of the authority of public health officials, some of whom have been harassed or even forced to resign, at a time when they are most needed, according to the op-ed. Those include two Wisconsin state health department officials, one of whom was asked to resign in the middle of the outbreak without being offered any reason. “This is unconscionable and dangerous,” the group wrote. The undermining of the country’s premier public health agency has led to a rise in infections and deaths as the public refuse to comply with measures like social distancing and wearing face masks in public spaces. The tragedy is compounded by the disproportionate impact the virus is having on communities of color and lower-income essential workers, they wrote. See: As COVID-19 cases surge in the U.S., Trump administration turns ire on Democrats, media — and Anthony Fauci In fact, the U.S. has more cases and deaths than any other country, and the sixth highest rate of any large country in the world. The U.S. is home to a quarter of the world’s confirmed COVID-19 cases, despite accounting for just 4.4% of the global population. “Sadly, we are not even close to having the virus under control. Quite the opposite, in fact,” they wrote. Read: Why do so many Americans refuse to wear face masks? Politics is part of it — but only part The op-ed comes a day after New York Gov. Andrew Cuomo issued a scathing attack on Trump’s handling of the pandemic, accusing him of ignoring the reality of the crisis from Day 1. Read now:New York Gov. Cuomo says President Trump has put politics above public health throughout pandemic"}]}