{"article": [{"url": "https://www.marketwatch.com/story/five-growing-post-covid-industries-and-where-the-jobs-are-2020-07-13", "published": 1596814820.0, "headline": "Five growing post-COVID industries and where their jobs are", "body": "COVID-19 is the biggest disrupter most industries have ever faced. The global pandemic, almost overnight, changed the American way of life — with entire industries forced to rethink their business models. Workforces became remote. Health, safety and sanitation became more important than ever. And we’ve seen an interesting juxtaposition: nostalgic businesses like drive-in movie theaters are thriving alongside futuristic industries like robotics. But unlike recessions of the past that were led by bubble bursts or natural disasters, the economic downturn we’re experiencing now is totally unique. Entire industries were shut down or extremely limited in order to prevent the spread of the virus. Suffice it to say, as the U.S. begins to reopen in fits and starts, there’s not exactly a clear road map for economic recovery. But, there are some clues. As far as rebounding industries, there are a few that are starting to show positive signs of recovery, says Meredith Metzker, a content marketing specialist with Emsi, a labor analytics firm. “With things changing so quickly, job posting data gives us the most up-to-date look at what’s going on in our economy,” says Metzker. “It helps us get a feel for which companies and industries are hiring right now.” For example, transportation and warehousing saw a drop when COVID-19 shutdowns first began, but the industry has seen a positive percent change in unique job postings in the past month. Wholesale trade, manufacturing, arts, entertainment and recreation, real estate and construction are other industries that have also seen dips amid the shutdowns, but are seeing more positive job posting trends recently, she says. Read on for a closer look at five career fields that could potentially rebound quickly or fare well in a post COVID-19 world — and where these jobs are located. 1. Education technology When the pandemic shut down schools last spring, courses at all levels across the nation went completely digital — with online classes ranging from educational games for the youngest pupils to Zoom ZM, +2.89% lectures for college students. It became a massive experiment in virtual learning — done on the fly with educators swiftly adapting their lesson plans so they could be taught online. Here to help were education tech companies. For instance, the number of students using DreamBox Learning, a Bellevue, Washington-based ed tech company that offers fun videogame-style math lessons, grew from 3 million to 5 million. Chattanooga-based Learning Blade has been providing supplemental curriculum around Science, Technology, Engineering and Math for remote teachers and home schooling parents. Prior to COVID-19, the online education market was expected to grow from a $107 billion market in 2015 to $350 billion by 2025. But the pandemic could accelerate the growth as schools grapple with how to hold classes while adhering to social distancing guidelines, and colleges and universities explore hybrid in-class and remote learning models. Related: A great technology wave is cresting over America because of the pandemic — and it’s largely a good thing The state of Iowa is a leader in education technology, with more than 3,100 people working in the industry, with a diverse mix of startups and larger companies and more than $22.7 million in venture capital or angel investments raised since 2010, according to an annual report from the Iowa EdTech Collaborative. A part of the collaborative, Pear Deck, an Iowa City-Cedar Rapids edtech company founded in 2014, allows teachers to create interactive presentations and has seen record-breaking use of their tools this spring. In the U.S., between March 1 and April 30, the company trained more than 20,000 new teachers on their tools and recorded more than 30 million moments of engagement. 2. Manufacturing The pandemic exposed flaws in the U.S. supply chain as trade slowed to a halt. When factories shut down in China amid the spread of COVID-19, the international supply chain was affected. The U.S. has long relied on China for imports that include telecom equipment, computer parts, electrical machines, plastics, furniture, clothing and more, but many companies are looking to bring manufacturing of these items back to the U.S. Sen. Tom Cotton (R-Ark.) and Congressman Mike Gallagher (R-Wis.) have also introduced a bill to end the U.S.’s dependence on Chinese pharmaceuticals, providing incentives for pharmaceuticals and medical equipment manufactured in the U.S. Regions that have the infrastructure for manufacturing may be braced for a boom. One such spot? Greater Limestone County in Alabama, with Mazda MZDAY, -1.05% Toyota TM, -0.65% Manufacturing USA opening an auto assembly plant, bringing hundreds of jobs to the region. Dozens of existing manufacturers are also thriving here, including office furniture manufacturer Steelcase and ATV maker Polaris. PII, -1.16% 3. Telehealth COVID-19 will drastically change the face of health care, experts predict, and telemedicine will be a part of the “new normal.” At its inception, telehealth was born out of convenience — hop on a video call with your physician rather than carving out an afternoon for an appointment. But, now with person-to-person contact limited, telehealth has become a necessity. The number of virtual care visits in 2020 is expected to soar to more than 1 billion, according to analysts at Forrester, a market research company. And in response to the COVID-19 pandemic, nearly half of all physicians are treating patients virtually, up from 18% in 2018, according to a new survey conducted by Merrit Hawkins, a physician search firm and a company of AMN Healthcare AMN, +1.93% in collaboration with The Physicians Foundation. Some health care companies have already positioned themselves as leaders in telemedicine. For instance, Franklin, Tenn.-based Community Health Systems CYH, +5.38% — an operator of 97 hospitals in 17 states — was ahead of the curve, and began partnering with American Well, a telehealth service provider in 2015. The partnership allows for virtual doctor visits at CHS-affiliated hospitals. With telehealth expanding, providers in all sectors will need to be inventive to make sure they are still serving patients remotely and we can expect new med tech companies and tech-enabled outreach to be born out of the pandemic. In Nashville, AdhereHealth, a health-care technology leader focused on medication adherence, announced a new forward-thinking program: COVID-19 Adherence Solution. Using predictive analytics, tech-enabled consumer outreach, and home-delivered pharmacy services, the program helps make sure people stay on their prescribed medications. See: How to get the most out of a telehealth appointment: 9 tips In normal times, 50% of patients who are managing chronic conditions don’t take their medications as directed, says Jason Z. Rose, CEO of AdhereHealth. “Factor in continued lockdowns, social distancing and economic hardships, and it’s easy to see how non-adherence is likely to get worse,” Rose said in a press release. “Engaging with consumers proactively gives us a chance to get them support before they wind up in a hospital bed.”4. Real estate A couple of trends are at play that could help the real-estate market thrive. Interest rates have been flirting with record lows, which is appealing to buyers and existing homeowners who are looking to refinance. While existing homes sales fell in May, the National Association of Realtors expects a strong rebound in coming months. “Sales completed in May reflect contract signings in March and April – during the strictest times of the pandemic lockdown and hence the cyclical low point,” said Lawrence Yun, NAR’s chief economist, said in a news release. “Home sales will surely rise in the upcoming months with the economy reopening, and could even surpass one-year-ago figures in the second half of the year.” Plus, as people spend more time in their homes, they may become more aware of the inefficiencies and shortcomings of their current space. People are looking to move so they have, say, a bigger backyard, or a more modern kitchen since they’re eating at home much more frequently. The pandemic also prompted many to reconsider their way of life — a recent national survey by Ipsos found that 42% of people have either moved or thought about moving since March, and rural areas, small and midsize cities were their top choices. It’s likely that real-estate markets will be especially hot in places that can offer homeowners more space at relatively low prices compared with big cities: think Boise, Cedar Rapids and Northern Kentucky.5. Robotics Until recently, the idea of robots were novel and futuristic. Now, amid COVID-19, they’ll become a practical necessary part of our economy, predicts John McElligott, the CEO of York Exponential in York, Penn., a region that’s established itself as a robotics hub. As farmers, meatpackers, truckers, cooks, and others got sick or were ordered to stay home, it exposed weaknesses in our supply chain. Enter robots. Simply put: they can’t get sick. McElligott foresees robots becoming more prominent in many areas of everyday life. For example, to adhere to social distancing measures, meatpacking workers or line cooks can no longer be so close to one another. A future workforce might include both humans and robots to minimize contact, or have robots delivering food as restaurants reopen. It’s certainly an exciting time for the industry, with companies like York Exponential leading the way in innovating and envisioning what our high-tech future looks like. These are the Top 100 Best Places to Live in America in 2019 Read the original article on Livability."}]}