{"article": [{"url": "https://www.marketwatch.com/story/trump-announces-deal-that-would-normalize-relations-between-israel-and-bahrain-11599848486", "published": 1599834560.0, "headline": "Trump announces deal that would normalize relations between Israel and Bahrain", "body": "US President Donald Trump, with Senior Advisor to the President Jared Kushner. andrew caballero-reynolds/Agence France-Presse/Getty Images WASHINGTON (AP) — Bahrain has become the latest Arab nation to agree to normalize ties with Israel as part of a broader diplomatic push by President Donald Trump and his administration to fully integrate the Jewish state into the Middle East. Trump announced the agreement on Friday, following a three-way phone call he had with Israeli Prime Minister Benjamin Netanyahu and Bahrain’s King Hamad bin Isa Al Khalifa. The three leaders also issued a brief six-paragraph joint statement, attesting to the deal. “Another HISTORIC breakthrough today!” Trump tweeted. The announcement on the 19th anniversary of the Sept. 11, 2001 terrorist attacks came less than a week before Trump hosts a White House ceremony to mark the establishment of full relations between Israel and the United Arab Emirates. Bahrain’s foreign minister will attend the event. “There’s no more powerful response to the hatred that spawned 9/11 than this agreement,” Trump told reporters at the White House. It represents another diplomatic win for Trump less than two months before the the presidential election and an opportunity to shore up support among pro-Israel evangelical Christians. Just last week, Trump announced agreements in principle for Kosovo to recognize Israel and for Serbia to move its embassy from Tel Aviv to Jerusalem. “This is a historic breakthrough to further peace in the Middle East,” Trump, Netanyahu and King Hamad said in the statement. “Opening direct dialogue and ties between these two dynamic societies and advanced economies will continue the positive transformation of the Middle East and increase stability, security, and prosperity in the region.” Like the UAE agreement, Friday’s Bahrain-Israel deal will normalize diplomatic, commercial, security and other relations between the two countries. Bahrain, along with Saudi Arabia, had already dropped a prohibition on Israeli flights using its airspace. Saudi acquiescence to the agreements has been considered key to the deals. Trump’s son-in-law and senior adviser Jared Kushner noted that the agreement is the second Israel has reached with an Arab country in 30 days after having made peace with only two Arab nations — Egypt and Jordan — in 72 years of its independence. “This is very fast,” Kushner told The Associated Press. “The region is responding very favorably to the UAE deal and hopefully it’s a sign that even more will come.” Netanyahu welcomed the agreement and thanked Trump. “It took us 26 years between the second peace agreement with an Arab country and the third, but only 29 days between the third and the fourth, and there will be more,” he said, referring to the 1994 peace treaty with Jordan and the more recent agreements.” The agreement will likely be seen as a further setback to the Palestinians who tried unsuccessfully to have the Arab League condemn normalization with Israel until they have secured an independent state. That was one of the few cards still held by Palestinians in negotiations as peace talks remain stalled. The joint statement made passing mention of the Palestinians, saying the parties will continue efforts “to achieve a just, comprehensive, and enduring resolution to the Israeli-Palestinian conflict to enable the Palestinian people to realize their full potential.” The agreement makes Bahrain the fourth Arab country, after Egypt, Jordan and the UAE, to have full diplomatic ties with Israel. Other Arab nations believed to be on the cusp of fully recognizing Israel include Oman and Sudan. While tacitly blessing the deals Saudi Arabia, the regional power player, is not expected to move as quickly. Like the UAE, Bahrain has never fought a war against Israel and doesn’t share a border with it. But Bahrain, like most of the Arab world, long rejected diplomatic ties with Israel in the absence of a peace deal establishing a Palestinian state on lands captured by Israel in 1967. The agreement could give a boost to Netanyahu, who was indicted on corruption charges last year. Deals with Gulf Arab states “are the direct result of the policy that I have led for two decades,” namely “peace for peace, peace through strength,” Netanyahu has said. The Israeli-UAE deal required Israel to halt its contentious plan to annex occupied West Bank land sought by the Palestinians. Telephone calls soon began working between the nations as they continue to discuss other deals, including direct flights. While the UAE’s population remains small and the federation has no tradition of standing up to the country’s autocracy, Bahrain represents a far-different country. Just off the coast of Saudi Arabia, the island of Bahrain is among the world’s smallest countries, only about 760 square kilometers (290 square miles). Bahrain’s location in the Persian Gulf long has made it a trading stop and a naval defensive position. The island is home to the U.S. Navy’s 5th Fleet and a recently built British naval base. Bahrain is acutely aware of threats posed by Iran, an anxiety that comes from Bahrain’s majority Shiite population, despite being ruled since 1783 by the Sunni Al Khalifa family. Iran under Shah Mohammad Reza Pahlavi had pushed to take over the island after the British left, though Bahrainis in 1970 overwhelmingly supported becoming an independent nation and the U.N. Security Council unanimously backed that. Since Iran’s 1979 Islamic Revolution, Bahrain’s rulers have blamed Iran for arming militants on the island. Iran denies the accusations, though weapons experts suggest explosives found there bear similarities to others linked to Iran. Israel and Iran view each other as top regional enemies. Outside of those tensions, Bahrain’s Shiite majority has accused the government of treating them like second-class citizens. The Shiites joined pro-democracy activists in demanding more political freedoms in 2011, as Arab Spring protests swept across the wider Middle East. Saudi and Emirati troops ultimately helped violently put down the demonstrations. In recent years, Bahrain has cracked down on all dissent, imprisoned activists and hampered independent reporting on the island. While the Obama administration halted the sale of F-16 fighter jets to Bahrain over human rights concerns, the Trump administration dropped that after coming into office. Bahrain’s royal family and officials have come out in support of the Israel-UAE agreement. However, civil society groups and others have condemned the move and warned the monarchy not to follow in UAE’s footsteps — despite Bahrain’s yearslong flirtation with Israel and Jewish leaders. Unlike the Emirates, Jews had a historical presence on the island and some still live there. In 2017, two prominent U.S. rabbis said Bahrain’s king told them he hoped the Arab boycott of Israel would end. An interfaith group from Bahrain that year also visited Israel, though the state-run Bahrain News Agency later said that it didn’t “represent any official entity” after an uproar erupted on social media. Bahrain has increasingly relied on support from other nations as it struggles with its debts, particularly neighboring Saudi Arabia. In that way, Bahrain has followed in lockstep with Riyadh, meaning any normalization with Israel likely got the kingdom’s approval, though, Saudi Arabia has for its part remained silent since the Emirati announcement."}]}