{"article": [{"url": "https://www.marketwatch.com/story/macys-july-4th-fireworks-to-blast-off-in-unannounced-displays-across-nyc-next-week-2020-06-23", "published": 1593519380.0, "headline": "Macyâ\u0080\u0099s launches â\u0080\u0098unannouncedâ\u0080\u0099 July 4th fireworks this week â\u0080\u0094 but whoâ\u0080\u0099s behind the surprise fireworks boom across the country?", "body": "The annual Macyâ\u0080\u0099s 4th of July Fireworks show will go on despite the coronavirus pandemic this year â\u0080\u0094 and the mounting complaints against amateur fireworks displays in several major cities. Rather than the roughly 25-minute star-spangled spectacle in a single location that viewers have come to expect on Independence Day, this yearâ\u0080\u0099s show is being scattered across the five boroughs into a number of smaller displays over a couple of nights this week to reduce crowds and encourage social distancing. The mini displays are building up to a televised finale featuring the Empire State Building on the Fourth. Macyâ\u0080\u0099s M, -0.95% described the reimagined show as a â\u0080\u009cseries of high elevation unannounced displays from select locations across every boroughâ\u0080\u009d in a press release on Tuesday. The organizers are not revealing exactly where these five-minute mini fireworks shows will be, nor which nights they will be on, in an effort to prevent crowds of spectators from forming ahead of time to get a front-row seat. For the first night of fireworks on Monday, for example, the city tweeted out a couple of vague announcements that 5-minute Macyâ\u0080\u0099s pyrotechnic displays would occur sometime between 9 p.m and 10 p.m. that could be seen and heard along the East River between Manhattan and Queens, as well as another Coney Island show that could be seen and heard from southern Brooklyn and Staten Island. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } The light shows are running through Saturday, launching from one or two land or water-based locations across the boroughs that the organizers state â\u0080\u009ccould safely accommodate the launch and firing of large-scale pyrotechnics.â\u0080\u009d The fireworks can reach maximum heights of 1,000 feet, and can be seen far and wide. â\u0080\u009cThese past few months have been some of the most difficult in our cityâ\u0080\u0099s history, and New Yorkers are looking for a break,â\u0080\u009d Mayor Bill de Blasio said in a statement. â\u0080\u009cThis 4th of July Celebration with Macyâ\u0080\u0099s will give all New Yorkers a safe and exciting way to enjoy the holiday together, even when we are apart.â\u0080\u009d Ironically, this announcement came the same day last week that the mayor also launched a task force to crack down on the nightly barrage of illegal fireworks that city residents have become increasingly vocal about during the last several weeks. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Some New Yorkers who have already been on edge after weeks of disrupted sleep from illegal fireworks were less than ecstatic about Macyâ\u0080\u0099s announcement. In fact, many begged for a break from the fireworks. Manhattan borough president Gale Brewer called it a â\u0080\u009ccacophonous spectacleâ\u0080\u009d and a â\u0080\u009c6 million dollar â\u0080\u0098giftâ\u0080\u0099 that no one asked forâ\u0080\u009d on Twitter. iframe.twitter-tweet { width: 100% !important; } â\u0080\u009cPlease god no more,â\u0080\u009d wrote on reader under the name Braden Bradley. â\u0080\u009cRight over my building. I had no idea. Thought we were under attack,â\u0080\u009d wrote a city resident after Monday nightâ\u0080\u0099s display. Another mused, â\u0080\u009cHow are people who arenâ\u0080\u0099t on Twitter being notified about this?â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } While thereâ\u0080\u0099s generally an increase in illegal fireworks activity leading up to the Fourth in New York City, fireworks complaints to 311 have skyrocketed by 314 times this month compared with the same period last year, Gothamist reported, with 8,477 complaints made from June 1st to 20th, compared to 27 last year. There were 2,092 complaints to 311 about fireworks citywide on June 20th alone. And there have been more than 12,500 calls to NYCâ\u0080\u0099s 911 system this month alone about fireworks, or roughly 12 times the number of comparable calls from the first six months of 2019, the New York Times reported. There was even a protest outside the mayorâ\u0080\u0099s upper east side residence last week, as New Yorkers fed up with the fusillade of fireworks that have kept them up drove to Gracie Mansion and honked their car horns into the wee hours to disrupt the mayorâ\u0080\u0099s sleep, too, and demand action. Indeed, illegal fireworks complaints have been exploding across the country, including in Boston, Chicago and San Francisco, which has sparked a number of conspiracy theories. They include suggesting that the fireworks are an organized effort to disorient and destabilize communities of color and neighborhoods that have protested police brutality in recent weeks, by making residents sleep-deprived. Many note that these are professional-grade fireworks blasting off on city blocks. iframe.twitter-tweet { width: 100% !important; } Others theorize that the fireworks have become so prolific due to police officers slowing down their response times in retaliation to calls for law enforcement reform and defunding the police. Some have even accused the police of firing the recreational explosives, themselves. iframe.twitter-tweet { width: 100% !important; } As part of NYCâ\u0080\u0099s new crackdown, the NYC Sheriffâ\u0080\u0099s office arrested 10 people on Staten Island for dealing illegal fireworks (and transporting three alligator carcasses, believe it or not), while the NYPD apprehended a dozen people in the Bronx for possessing an arsenal of fireworks. Still, many on Twitter accused law enforcement officials of staging the photos. But many reports and pyrotechnic experts believe itâ\u0080\u0099s more likely the result of people blowing off steam. The New York Times suggests the fireworks â\u0080\u009cserve as a release after months of boredom and seclusion in cramped apartments.â\u0080\u009d Bill Weimer, vice president of Phantom Fireworks, a leading fireworks retailer in the U.S., told CNN that the demand his company has seen this year â\u0080\u009cso far has been the strongest early fireworks season Iâ\u0080\u0099ve seen in my years of involvement in the fireworks business.â\u0080\u009d Whatâ\u0080\u0099s more, 40% of them are first-time buyers, and his theory is that folks are putting on their own fireworks shows now that so many cities are canceling large-scale July 4th displays. â\u0080\u009cItâ\u0080\u0099s a combination of people getting out, being anxious and having this pent-up energy, and then right around the corner is a quintessential firework holiday,â\u0080\u009d he said. â\u0080\u009cPut the two together, consider the fact that there wonâ\u0080\u0099t be a lot of fireworks, and suddenly, you have a formula that means people are buying more and more fireworks, and buying them earlier.â\u0080\u009d Whatâ\u0080\u0099s more, seeing fireworks gets some people fired up to shoot off their own fireworks. And Julie L. Heckman, the executive director of the American Pyrotechnics Association, told the Times that most of the fireworks she has seen on social media or the news actually do not appear to be professional, and can in fact be legally purchased in several states. When asked whether having Macyâ\u0080\u0099s set off fireworks â\u0080\u009cunannouncedâ\u0080\u009d and without warning across NYC could trigger residents with PTSD, or scare pets and small children, a spokesperson explained that a majority of the locations chosen for this yearâ\u0080\u0099s displays have hosted fireworks in the past. Plus, the brief displays will not be every night, and will take place shortly after dark â\u0080\u009cat an appropriate timeâ\u0080\u009d â\u0080\u0094 not two in the morning. NBCâ\u0080\u0099s CMCSA, -0.99% Â national broadcast of the Macyâ\u0080\u0099s 4th of July Fireworks Spectacular will run from 8 p.m. to 10 p.m. ET on July 4th. It will include footage from the mini fireworks shows from throughout the week, as well as a grand finale by the Empire State Building. This article was originally published on June 23 and has been updated with the first Macyâ\u0080\u0099s mini fireworks displays, as well as updated figures on complaints to 311."}]}