{"article": [{"url": "https://www.marketwatch.com/story/automakers-are-gambling-on-electric-pickup-truckswill-consumers-buy-them-2020-09-08", "published": 1599541940.0, "headline": "Automakers are gambling on electric pickup trucks-will consumers buy them?", "body": "Thanks to the Tesla Cybertruck and Rivian, electric pickups are making headlines. Automakers plan to introduce eight electric pickups by 2021 Electric pickups are coming, but there's no way to know if consumers want to buy them. Electric pickups are getting lots of attention. The reveal of the Tesla Cybertruck in 2019 with its angular, futuristic design only increased that attention level. It's estimated there will be eight electric pickup trucks on the market by 2021. The question is: Who will buy them all? The Tesla Cybertruck on display at the Petersen Automotive Museum in Los Angeles. AFP/Getty Images While Tesla TSLA, +1.89%  is grabbing headlines for its polarizing design, it's one of many with plans for an electric truck. According to CNN, General Motors GM, -0.15%  CEO Mary Barra told investors there will be a GM electric pickup by 2021 while newcomer Rivian is already taking orders for its R1T electric pickup. A big financial gamble No less than eight electric pickup trucks are due to hit the U.S. market by 2021. The current number of electric pickups? Zero. There's no way to know exactly how many people will want an electric pickup when these trucks arrive, making them an expensive gamble for automakers. It's not just the auto industry that thinks consumers want electric pickups. Investors are on board. Among the backers for Rivian are Ford F, -1.36%  , which invested $500 million and Cox Automotive (which owns KBB.com) with a $350 million stake. Beating them both is Amazon AMZN, +3.01%  , which put $700 million in the company last February. There's lots of money going into the development of electric pickups even as consumer sentiment toward electric vehicles is lukewarm. Concerns about range and the availability of charging stations continue to be issues even as the charging infrastructure expands. Still, predictions are that electric vehicle sales will one day outpace sales of gas-powered vehicles. Increased vehicle ranges, lower pricing, and time for consumers to get used to the idea of plugging-in rather than fueling-up will inevitably give electric vehicles the edge.Who wants an electric pickup? That might be 20 years down the road, but 2021 is much closer. When the planned electric trucks arrive, automakers need them to sell. Whether that happens or not all depends on how much of the hugely profitable truck market these EVs can snag. An electric truck doesn't need to be a top-selling model to be a success. For the first half of 2020, the Ford F-150 sold more than 200,000 units and that's with the market locked down in March and April. Nissan NSANY, -1.50%  Titan, at the bottom of the list, sold 8,400. Related: Why this is a great time to buy a pickup truck It's unlikely that any electric truck is going to topple the Ford F-series from its perch. There is, however, plenty of room for an electric truck to find success somewhere within that huge spread of existing truck sales numbers. If only a small percentage of those buyers switch, that's still a hefty number. Also see: These 3 EVs are the lowest cost to own over 5 years There's also the possibility that the idea of an electric truck could attract buyers who would not otherwise consider a truck. As much as some people see EVs as too new and different, there are those that embrace them for the same reason. That lends plenty of appeal to an electric truck. Customers can reserve a Tesla Cybertruck for a $100 deposit. Tesla CEO Elon Musk tweeted that reservations topped 250,000 units in just five days. That's a small deposit and there's no telling how many of those reservations will become deliveries when this truck is available in two years, but it shows there is public interest. Automakers are gambling that interest is high enough to support eight new electric trucks all arriving at the same time. See: The Hot Wheels version of the Tesla Cybertruck is just $400Why this matters Electric vehicles are coming, but the public isn't entirely on board with the idea. The idea of an electric truck is completely new. Regardless of whether they're better or worse than gasoline-powered models, it's a tough call whether enough people will make the switch for electric trucks to be successful. Trucks are popular, but electric trucks are still a big gamble. This story originally ran on KBB.com."}]}