{"article": [{"url": "https://www.marketwatch.com/story/trump-claims-biden-win-would-crash-market-cause-depression-2020-08-13", "published": 1597317920.0, "headline": "Trump claims Biden win would crash market, cause depression", "body": "President Donald Trump on Thursday cast his election battle with Joe Biden as a fight for the future of the U.S. economy, reiterating claims that the stock market would tank and a depression would ensue if the his Democratic rival wins in November. “If Biden gets in, this market’s SPX, +0.87% DJIA, +0.56% going to crash,” Trump asserted in an interview on Fox Business Network with host Maria Bartiromo. Invoking Biden’s tax plans, Trump also claimed that the former vice president would “tax this country into a depression like in 1929.” Trump spoke as Democrats are preparing to nominate Biden next week at their party’s convention, which, while nominally being held in Milwaukee, will be an almost entirely virtual event as delegates and lawmakers stay home as a coronavirus precaution. Biden is leading Trump in national polls and in battleground states, including Florida, Wisconsin and Pennsylvania. Now see:The Obamas, AOC and Kamala Harris: Here’s who’s speaking to the Democratic convention and when Biden on Tuesday introduced his running mate, Sen. Kamala Harris of California, to the relief of some on Wall Street. Under a Biden administration, analysts have said health-care stocks XLV, +0.90% could benefit, while financials XLF, +0.11% may be negatively impacted. A recent analysis from Fidelity International found the opposite of what Trump argues. It said that a sweeping victory for Biden and Harris—plus Democratic majorities in both houses of Congress—would be the best outcome for markets in the long run. See:A Biden-Harris sweep would be best for markets, says Fidelity. What’s more, wrote lead cross-asset strategist Wen-Wen Lindroth, a Trump win would bring added downside risk from factors including growing civil unrest and “potential for continued poor management of the Covid crisis, which increases the risks of a double-dip recession in the U.S.” Trump charges that Biden’s plans would decimate an economy that attempting to recover from the effects of the coronavirus pandemic. “They’re big taxers,” he said of Biden and Harris. “It’s just something that won’t work.” Among Biden’s tax plans are hiking levies on individuals with incomes of more than $400,000. According to the nonpartisan but business-friendly Tax Foundation, Biden’s plan would raise tax revenue by $3.8 trillion over the next decade, and reduce gross domestic product by 1.51% over the long term. Trump in the interview talked up his plans to cut capital-gains taxes, a proposal he has been touting this week along with a middle-income tax cut. “We are looking very seriously at a capital-gains tax cut, and also an income-tax cut for middle-income families,” Trump said at a Monday news conference, claiming that a reduced taxation of capital gains would “create a lot more jobs.” Now read:Trump ‘seriously’ considers a capital-gains tax cut—and here’s how he could do it Sign up for Trump Today and more MarketWatch newsletters."}]}