{"article": [{"url": "https://www.marketwatch.com/story/arnold-schwarzenegger-says-to-wear-a-mask-anyone-making-it-a-political-issue-is-an-absolute-moron-2020-06-18", "published": 1592656160.0, "headline": "Arnold Schwarzenegger backs California face-mask order: â\u0080\u0098Anyone making it a political issue is an absolute moronâ\u0080\u0099", "body": "â\u0080\u009cItâ\u0080\u0099s not a tumorâ\u0080\u009d may be Arnold Schwarzeneggerâ\u0080\u0099s second-most-famous line, and the actor and former California governor weighed in on another health issue Thursday: The importance of wearing face masks. “ â\u0080\u009cAnyone making it a political issue is an absolute moron who canâ\u0080\u0099t read.â\u0080\u009d ” â\u0080\u0094 Arnold Schwarzenegger Schwarzenegger tweeted his support for California Gov. Gavin Newsomâ\u0080\u0099s order earlier in the day mandating face masks for anyone leaving their home, with rare exceptions, in an effort to slow the spread of COVID-19. â\u0080\u009cThis is 100% the right move,â\u0080\u009d the onetime â\u0080\u009cGovernatorâ\u0080\u009d said. â\u0080\u009cThis will help us beat this terrible virus. The science is unanimous â\u0080\u0094 if we all wear masks, we slow down the spread and can reopen safely. Itâ\u0080\u0099s not a political issue. Anyone making it a political issue is an absolute moron who canâ\u0080\u0099t read.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } Schwarzenegger, a Republican, served as Californiaâ\u0080\u0099s governor from 2003-â\u0080\u009911. Before Thursday, California cities and counties had been free to make masks mandatory, but Newsom said he issued a statewide order because too many people have been going out mask-less as businesses reopen. California has seen a recent increase in coronavirus cases, especially in Southern California. While face masks have become a political issue in the U.S., the science behind their effectiveness appears prettysolid. The U.S. Centers for Disease Control and Prevention recommends â\u0080\u009cEveryone should wear a cloth face cover when they have to go out in public,â\u0080\u009d and notes â\u0080\u009cthe cloth face cover is meant to protect other people in case you are infected.â\u0080\u009d Read:â\u0080\u0098Shameful, not cool, a sign of weaknessâ\u0080\u0099: Men are less likely to wear face masks to protect against coronavirus, study finds And for what itâ\u0080\u0099s worth, Schwarzenegger isnâ\u0080\u0099t the only action hero whoâ\u0080\u0099s not too cool for a mask, as this photo of Harrison Ford shows: iframe.twitter-tweet { width: 100% !important; }"}]}