{"article": [{"url": "https://www.marketwatch.com/story/when-investors-fear-losing-it-all-skilled-financial-advisers-bring-them-back-to-reality-2020-08-10", "published": 1597063760.0, "headline": "When investors fear losing it all, skilled financial advisers bring them back to reality", "body": "With the U.S. economy grappling with the impact of the coronavirus pandemic, investment advisers are seeing the ripple effects. Some clients fear losing everything they’ve built. For some, the threat of bankruptcy is a reality, while for others, even the remote possibility of going broke stirs feelings of dread. Advisers face a tricky challenge in aiding these anxious clients. On one hand, they have a responsibility to prepare individuals for the worst — and devise a plan if the money runs out. But in their effort to assist clients in desperate financial straits, they risk coming on too strong. Facing the likelihood of losing it all can prove immobilizing. Rushing to draft a detailed strategy and offer technical advice will backfire if a client isn’t ready to listen. First, an adviser needs to show concern and gather information. “Maybe the client is treading water with their anxiety,” said Meghaan Lurtz, a senior research associate at Kitces.com, which provides education and resources for financial planners. “Part of an adviser’s job is to be there while they tread” and serve as a sounding board. Advisers who set a supportive tone are better positioned to help clients grapple with their fear. Responding to anxiety with non-judgmental acceptance is a good first step. “It may be exhausting and stressful for advisers to deal with these clients,” Lurtz said. “But you still need to thank them for opening up to you. That makes them feel safe.” The next step is to try to learn more. To someone scared of losing their business, for example, say: “Tell me how things for you are going.” “Get to the heart of what the client is experiencing and what’s at the heart of their fear,” Lurtz said. “It may be they’re nervous about losing key employees to the virus or how long they can continue to pay them. Or it may be a decline in revenues and their P&L [profit and loss]. It may be about something else.” She urges advisers to make statements (“Tell me more about that”) rather than pose questions. That’s because clients are more apt to lower their guard and speak freely when responding to a neutrally worded prompt. “When we hear a question, our brain thinks there’s a right and wrong answer,” she said. “But people respond very differently to a statement. It cues the client that you really want to know, and solicits a richer type of response.” Advisers tend to draw conclusions from data analysis. If they think a client’s fear of losing it all is unfounded, they may trot out facts and figures as reassurance. Yet appealing to rationality when someone is not thinking clearly — and riddled with fear — carries risk. “Whether the fear is rational or irrational, it’s real in the client’s mind,” said Kim Bourne, a New York City-based certified financial planner. “So you have to get to the root cause, whatever is underlying that fear.” She cites the example of a client, a pre-retiree in his 60s, who feared a financial wipeout as the market tanked in mid-March. In reality, he held significant assets and faced no danger of bankruptcy. “He had the experience of poverty in his past, so he was afraid,” she said. “The fear of losing everything was lingering in his head.” Bourne dignified his fear. Instead of trying to appeal to his rational side by crunching the numbers, she sought to learn more about his feelings. “Tell me more about what it felt like when you didn’t have enough money,” she said. Then she asked, “What did you learn from those dark moments?” Then she asked: “How did that help you achieve your greatest financial accomplishments?” He came away with a restored sense of perspective, Bourne says, and his fear no longer plagues him as much. More:What investors should do if they think the stock market is in a bubble, according to the folks who wrote the book on bubbles Plus: Thinking about retiring early? You may want to think again"}]}