{"article": [{"url": "https://www.marketwatch.com/story/the-pandemic-is-accelerating-the-racial-wealth-divide-heres-how-we-turn-it-around-2020-06-25", "published": 1593273980.0, "headline": "The pandemic is accelerating the racial wealth divide. Hereâ\u0080\u0099s how we turn it around.", "body": "Behind the anger in the streets at police abuse is the awareness that Black, brown, and Native people are disproportionately disenfranchised, suffering, and dying. Itâ\u0080\u0099s not just police brutality or the inequality of the COVID-19 pandemic, deadly as those are. Itâ\u0080\u0099s also the ongoing crisis of socio-economic marginalization faced by people of color in this country, most dramatically illustrated by our racial wealth divide. Median white families own literally dozens of times more wealth than Black and Latino families, who have far fewer resources to endure disasters like the pandemic and recession. While we are several years away from understanding the pandemicâ\u0080\u0099s impact on racial asset holdings, the most recent pre-pandemic data is alarming. Between 1983 and 2016, the median Black family saw their wealth drop by more than half after adjusting for inflation, down to a minuscule 2% of white wealth. Latinos saw only a marginal increase, to just 4% of median white wealth. White households, by contrast, increased their wealth by a third. Also read:A Juneteenth revival: we must end economic violence, too The Great Recession â\u0080\u0094 and the inadequate response to it â\u0080\u0094 made all this much worse. Back then, the government bailed out corporations but ignored distressed homeowners and low-wage workers who were disproportionately Black and Latino. It would be a crime not to learn from these mistakes. Eight solutions In a new report, we identify eight solutions to recover from the pandemic while reducing the racial asset divide. In the short term, millions of families desperately need cash. Stimulus aid has been a critical, but insufficient, support during this time. With much of it set to expire soon, weâ\u0080\u0099ll need immediate, emergency income support that could gradually evolve into a universally guaranteed income or federal jobs guarantee, like the Depression-era Works Progress Administration. We could also expand the mandate of the U.S. Postal Service to include basic financial services, which would help the â\u0080\u009cunbankedâ\u0080\u009d in rural and inner-city communities get access to basic financial services â\u0080\u0094 and avoid predatory lenders. According to the FDIC, Black households are five times more likely, and Latino households are four times more likely, than white households to be unbanked or underbanked. In a crisis, that makes them prime targets for exploitation. As we emerge from the crisis, other universal social programs could have a profound impact on closing the racial wealth gap. For instance, we could delink health insurance from employment and guarantee universal health coverage through a program like Medicare for All. With Black and Latino workers losing their jobs at higher rates than white workers in the current crisis â\u0080\u0094 and with Black Americans dying from COVID-19 at more than double the rate of other groups â\u0080\u0094 this pandemic shows how inequities in health care and the broader economy are closely linked.Baby bonds Another idea? Baby bonds. That is, Congress could seed savings and investment accounts for every child born in this country, which theyâ\u0080\u0099d get access to as adults to get an education, start a business, or otherwise fund their next steps. This step alone, researchers suggest, could reduce the racial wealth gap tenfold. Finally, paying for these programs with a more progressive tax structure â\u0080\u0094 including more progressive wealth, income, and estate taxes â\u0080\u0094 would also narrow the racial wealth divide, as the sharply declining tax burden of Americaâ\u0080\u0099s wealthiest 0.1% over the last few decades has enriched an economic elite that is almost entirely white. These ideas, along with programs to expand homeownership and other wealth-building opportunities, would lift up millions of households of all races that have been left behind in this unequal economy, but they would especially lift up Black and brown people who are poorly served by the current health and financial systems. While these programs would be universal, some initiatives should be targeted to those historically excluded, due to racially based practices, from past wealth-building programs. For example, we advocate for a rigorous â\u0080\u009cracial wealth auditâ\u0080\u009d for each new federal policy to ensure programs reduce racial wealth divisions, not worsen them. Americans of all colors are hurting right now. But because white supremacy is the pre-existing condition â\u0080\u0094 and in the face of a massive uprising for racial justice â\u0080\u0094 our path out of this crisis must have a strong racial equity lens. The health of our country, and countless lives, demand it. Dedrick Asante-Muhammad is the chief of race, wealth, and community at the National Community Reinvestment Coalition. Chuck Collins directs the Program on Inequality at the Institute for Policy Studies. They are coauthors of the report, â\u0080\u009cWhite Supremacy Is the Pre-existing Condition.â\u0080\u009d"}]}