{"article": [{"url": "https://www.marketwatch.com/story/fuelcell-energy-stock-powers-higher-after-bullish-call-from-j-p-morgan-11602175749", "published": 1602175940.0, "headline": "FuelCell Energy stock powers higher after bullish call from J.P. Morgan", "body": "Getty Images Shares of FuelCell Energy Inc. charged higher on heavy volume Thursday, after a bullish call from J.P. Morgan analyst Paul Coster said the company seems “poised to pivot into profitability” after years of investment. Coster initiated coverage of the fuel cell technology company FCEL, +10.08% with an overweight rating, with a 2021 fair value estimate for the stock around $3.00. The stock soared as much as 20.8% early in the session, before paring gains to close up 10.2%. Trading volume swelled to 67.2 million shares, compared with full-day average of about 18.1 million shares. The shares have run up 25.9% amid a three-day win streak. “After many years of investment and cash-burn, the company, with a recently-strengthened balance sheet, now seems poised to pivot into profitability by converting project backlog into recurring revenues, and drive strong long-term growth from accelerating adoption of distributed generation solutions, and early-stage adoption of Carbon Capture and Hydrogen-based energy storage solutions,” Coster wrote in a note to clients. He said that while the market opportunity for the company is in the early stages, he believes it is “massive.” The company, which Coster said has over $1.3 billion of firm backlog in hand and nearly 50 megawatts of projects, is pursuing a market estimated to be valued at more than $170 billion with over 20 gigawatts of capacity. He thinks FuelCell will “inflect into profitability” in 2022. Meanwhile, the FactSet consensus for the fiscal year ending October 2022 is for a per-share loss of 22 cents. For the time being, Coster said the stock, which is currently trading on a multiple of revenue, looks cheaper than shares of rival Ballad Power Systems Inc. BLDP, +6.62% and Plug Power Inc. PLUG, +3.07%, but a bit more expensive than Bloom Energy Corp. BE, +11.15% Coster’s fair value estimate for the stock is about 26% above Thursday’s closing price. FuelCell stock’s current win streak comes after the stock closed at a near five-month low of $1.89 on Monday, following allegations by short seller Night Market Research that the company failed to disclose in a fundraising completed last week that it lost two contracts in it backlog. The started started bouncing after the company said the short-seller report contained ‘factual inaccuracies,’ saying the lost contracts were never part of its backlog. FuelCell’s stock has lost 5.2% year to date, while Ballard Power shares have soared 145.8%, Plug Power’s stock has rocketed 465.8% and Bloom Energy’s stock has run up 176.0%. Meanwhile, the S&P 500 index SPX, +0.87% has advanced 6.7% this year."}]}