{"article": [{"url": "https://www.marketwatch.com/story/republican-ron-johnson-subpoenas-fbi-documents-amid-senate-committee-probe-into-origins-of-trump-russia-investigation-2020-08-10", "published": 1597068320.0, "headline": "Republican Ron Johnson subpoenas FBI documents amid Senate committee probe into origins of Trump-Russia investigation", "body": "WASHINGTON (AP) — Republican Sen. Ron Johnson said Monday that he has subpoenaed the FBI to produce documents to his committee related to the Trump-Russia investigation. The Wisconsin senator also defended a separate investigation he is leading into Democratic presidential candidate Joe Biden and Ukraine, even as Democrats say the probe has the effect of amplifying Russian propaganda and as U.S. intelligence officials say they have assessed that Russia is working to denigrate Biden ahead of the November election. See:Russia aims to run down Biden candidacy in support of Trump’s re-election, says U.S. counterintelligence official Johnson’s Homeland Security and Governmental Affairs Committee is one of multiple Republican-led Senate panels scrutinizing the FBI’s investigation into ties between the Trump campaign and Russia. Another, the Judiciary Committee, has released a series of documents in recent weeks aimed at discrediting the probe, including material on Sunday that the chairman, Sen. Lindsey Graham, said raised questions about whether the FBI had misled Congress about the accuracy of information it received during the investigation. The subpoena demands that the FBI produce by Aug. 20 the records that it gave to the Justice Department inspector general’s office, which concluded in a report last December that the Russia investigation had been opened for a valid reason but that the FBI had made significant errors during its surveillance of a former Trump campaign adviser. See:Contrary to DOJ’s findings, Barr claims Russia probe was started ‘without basis’ Plus:FBI says review of national-security surveillance applications found only minor errors The FBI said in a statement that it had received the subpoena and that the bureau had already been producing documents and information for Johnson’s committee. “As always, the FBI will continue to cooperate with the Committee’s requests, consistent with our law enforcement and national security obligations,” the statement said. In a separate statement on Sunday, the FBI said that it was continuing to cooperate with the Judiciary Committee’s investigation. Johnson publicized the subpoena along with a more than 5,000-word open letter in which he sought to explain the basis for his scrutiny of the Russia investigation and to defend his Biden probe against allegations that he was amplifying Russian disinformation. “I felt it was important to provide this explanation of my investigations because of the concerted and coordinated attacks on my efforts that I have interpreted as a ‘brush back pitch’ to deter my actions and preemptively marginalize my committee’s findings,” Johnson wrote in an email. He said he was concerned that the media was preparing to taint his committee’s findings as an extension of Russian propaganda. Democrats in recent weeks have expressed alarm about the probe, and a statement Friday by William Evanina, the government’s chief counterintelligence official, called out by name a pro-Russia Ukrainian lawmaker who has spread leaked recordings about Biden meant to be pejorative. Johnson denied Monday ever receiving information from that lawmaker, Andrii Derkach, or being part of a Russian disinformation effort. “As always, almost all of the documents we are seeking and will make public are from U.S. sources,” Johnson wrote in the letter. The Biden-Ukraine issue is a politically freighted one, particularly after President Donald Trump urged his Ukraine counterpart in a July 2019 phone call to investigate Biden and his son Hunter, who was a paid board member of a Ukraine gas company called Burisma Holdings. That phone call formed the basis of Trump’s impeachment by the House in December. He was acquitted by the Senate in February. Hunter Biden has denied using his influence with his father to aid Burisma, and Biden has denied speaking with his son about his overseas business dealings. Trump and his allies, including Johnson, have raised questions about Biden’s move as vice president in 2016 to pressure the Ukrainian government to fire its top prosecutor, Viktor Shokin, who had previously led an investigation into Burisma’s owner. Biden was representing the official position of the U.S. government, a position that was also supported by other Western governments."}]}