{"article": [{"url": "https://www.marketwatch.com/story/record-15000-new-coronavirus-cases-in-florida-as-disney-world-reopens-to-public-2020-07-12", "published": 1594570880.0, "headline": "Record 15,000 new coronavirus cases in Florida as Disney World reopens to public", "body": "ST. PETERSBURG, Fla. — Florida shattered the national record Sunday for the largest single-day increase in positive coronavirus cases in any state since the beginning of the pandemic, adding more than 15,000 cases as its daily average death toll continued to also rise. According to state Department of Health statistics, 15,299 people tested positive, for a total of 269,811 cases, and 45 deaths were recorded. California had the previous record of daily positive cases — 11,694, set on Wednesday. New York had 11,571 on April 15. The numbers come at the end of a grim, record-breaking week as Florida reported 514 fatalities — an average of 73 per day. Three weeks ago, the state was averaging 30 deaths per day. Since the pandemic began in March, 4,346 people have died in Florida of COVID-19, the state says. Testing has doubled over the last month, going from about 25,000 tests per day to almost 50,000, but the percentage of people testing positive has risen even more dramatically. A month ago, fewer than 5% of tests came up positive on a daily average. Over the past week, the daily average exceeded 19%. About 10.7% of Saturday’s 143,000 tests came up positive, with an average age of 38. “I still think we need to increase our testing a little bit more,” said University of Florida epidemiologist Dr. Cindy Prins, adding that the state and local health departments should ramp up their contact tracing. Prins said that she’s still concerned about large crowds, gyms and some restaurants as being places of mass transmission. Reports of illegal clubs and raves in South Florida is also a worry, she said. “I really do think we could control this, and it’s the human element that is so critical. It should be an effort of our country. We should be pulling together when we’re in a crisis, and we’re definitely not doing it,” she said. “I know people want to live their lives. There have been a lot of other times, people have made those sacrifices in order to benefit our society. It’s almost like a war effort. That’s what we need right now.” Terry Shaw, AdventHealth’s president and CEO, said Sunday on CBS’ Face the Nation that the peak of COVID-19 hospitalizations in Florida will be “sometime in front of us in July.” While on the program, he said that the health system, which has hospitals in nine states including 30 in Florida, has adequate PPE, a stockpile of ventilators and a clinical team that’s learned how to better treat the disease. “I give you an example. Our length of stay in our ICU for COVID patients has dropped in half. The number of people coming in to our hospital with COVID that need a ventilator, we’ve also been able to cut that in half. And because of those things, our death rate has also been cut in half” since the beginning of the pandemic,” he said The health system’s ICU capacities in Florida are currently running at about 85% to 90%. He said the system could turn some “progressive care units” into ICU units if needed. Hospitals in several counties have stopped doing elective surgeries. HCA West Florida have ceased inpatient elective procedures at hospitals in Hillsborough, Pinellas and six other nearby counties, said an HCA spokeswoman on Sunday. Florida ceased elective surgeries statewide from March until early May in order to free up beds, and to reserve personal protective equipment for health care workers caring for COVID-19 patients. Miami-Dade, Broward, and Palm Beach are the top three counties for hospitalizations, with 3,232 people hospitalized — 42 percent of the 7,542 people in hospitals statewide for coronavirus. Miami-Dade County Mayor Carlos Gimenez told CNN on Sunday that his county’s hospitals will soon reach capacity, but he said more beds can be added, including for intensive care. “We still have capacity, but it does cause me a lot of concern,” he said. Throughout May and into June, the state reopened much of its economy with some restrictions — and the number of positive cases began rising, but it wasn’t until the last week that the daily death total began rising, too. Because of the increase in cases and the positivity rate, doctors have predicted a rise in deaths, saying the mortality rate usually increases two to four weeks later as some of those infected get sicker and eventually die. Health experts are concerned that people are gathering in crowds, and have expressed concern that the Republican National Convention’s nomination party for President Donald Trump will be held in Jacksonville in August. On Saturday, the Magic Kingdom and Animal Kingdom reopened at Walt Disney World in Orlando, concerning health experts who urge people not to gather in groups. Guests at the Walt Disney Co. DIS, +1.53% theme park said that people were wearing masks and social distancing, and videos showed near-empty parks. Florida Gov. Ron DeSantis said that even with the rising rates, he still wants the schools to reopen as scheduled next month, saying children have not proven to be vectors for the disease in states and countries where campuses are open. He said while each county will have to come up with procedures, depending on their local infection rate, not opening the schools would exacerbate the achievement gap between high- and low-performing students. “We know there are huge, huge costs for not providing the availability of in-person schooling,” he said. “The risk of corona, fortunately, for students is incredibly low.” Helen Ferre, a spokeswoman for DeSantis, said Sunday that the state has tested more than 2.4 million people for COVID-19. Ferre said the important statistic isn’t the raw number of positives, but the percentage — on Sunday, it was just over 11%, about 8 percentage points lower than the weekly average. “The more people who get tested and are proportionately reporting negative for this virus is meaningful,” she wrote in an email to The Associated Press. Meanwhile, a commissioner for a county near Jacksonville is seriously ill with the virus, according to a posting by his daughter on Facebook. St. Johns County Commissioner Paul Waldron had recently voted against a county ordinance requiring masks, but not because he opposed them. He said he wanted more answers from county administrators about which masks are most effective and whether the county had enough for employees and visitors at government buildings."}]}