{"article": [{"url": "https://www.marketwatch.com/story/trump-white-house-sues-to-block-release-of-john-bolton-book-2020-06-16", "published": 1592385320.0, "headline": "Trump administration sues to delay release of John Bolton book", "body": "WASHINGTON — The Trump administration sued former national security adviser John Bolton on Tuesday to delay the publication of a book that the White House says contains classified information and that is expected to paint an unflattering portrait of the president’s foreign policy decision-making. The civil lawsuit in Washington’s federal court follows warnings from President Donald Trump that Bolton could face a “criminal problem” if he doesn’t halt plans to publish the book, which is scheduled for release next week. The complaint is the latest salvo in a contentious relationship between Trump and the hawkish Bolton, who was abruptly forced from the White House in January after repeated disagreements on national security matters. It moves their rift into court, where a judge will be asked to decide whether Bolton short-circuited proper procedures to get his book on the market — something his lawyer has strongly denied. In its lawsuit, the Justice Department administration contends that the former adviser did not complete a pre-publication review to ensure that the manuscript did not contain classified material. It requests that a federal court order Bolton to “instruct or request” that his publisher further delay publication of the book to allow for a completion of the national security review process and to “retrieve and dispose” of existing copies in a manner acceptable to the government. The Justice Department also is asking a federal court to grant it the rights to all proceeds Bolton earns from the publication of the book. Bolton’s attorney, Chuck Cooper, has said Bolton worked for months with classification specialists to avoid releasing classified material. He has accused the White House of using national security information as a pretext to censor Bolton. In its lawsuit, the Justice Department argues that Bolton’s job meant he “regularly came into possession of some of the most sensitive classified information that exists in the U.S. government.” Officials said Bolton’s manuscript was more than 500 pages and was “rife with classified information, which he proposed to release to the world.” The book contained “significant quantities of classified information that it asked Defendant to remove,” the filing says. “The United States is not seeking to censor any legitimate aspect of Defendant’s manuscript; it merely seeks an order requiring Defendant to complete the prepublication review process and to take all steps necessary to ensure that only a manuscript that has been officially authorized through that process — and is thus free of classified information — is disseminated publicly,” the lawsuit says. Bolton’s book, “The Room Where It Happened: A White House Memoir,” was supposed to be released in March. Its release date was twice delayed and it is now set to be released next week by publisher Simon & Schuster, a unit of ViacomCBS Inc. VIAC, -2.34% . “Bolton covers an array of topics — chaos in the White House, sure, but also assessments of major players, the president’s inconsistent, scattershot decision-making process, and his dealings with allies and enemies alike, from China, Russia, Ukraine, North Korea, Iran, the United Kingdom, France, and Germany,” according to the publisher. “I am hard-pressed to identify any significant Trump decision during my tenure that wasn’t driven by reelection calculations,” Bolton writes in the book, according to a news release from the publisher. The book has been highly anticipated for months, especially after news broke during President Donald Trump’s impeachment trial that the manuscript offered a vivid account of the president’s efforts to withhold military aid from Ukraine in exchange for the country assisting with investigations into Trump’s political rival Joe Biden. Those allegations formed the crux of the impeachment case, which ended with the president’s Senate acquittal in February. Cooper did not immediately return an email seeking comment on the lawsuit. He has previously said that he sent Bolton’s manuscript to White House classification specialist Ellen Knight in late December and that Knight and Bolton spent nearly four months going through the nearly 500-page book multiple times, “often line by line.” In a statement Tuesday, the American Civil Liberties Union said the lawsuit is “doomed to fail.” Ben Wizner, the director of the organization’s speech, technology and privacy project, said the Supreme Court had rejected a half-century ago the Nixon administration’s efforts to block the release of the Pentagon Papers, and said it is well-established that prior restraints on publication are unconstitutional. “As usual, the government’s threats have nothing to do with safeguarding national security, and everything to do with avoiding scandal and embarrassment,” Wizner said."}]}