{"article": [{"url": "https://www.marketwatch.com/story/heres-where-trump-and-biden-stand-on-china-and-other-trade-issues-2020-09-21", "published": 1600956920.0, "headline": "Hereâ\u0080\u0099s where Trump and Biden stand on China and other trade issues", "body": "President Donald Trump likes to say that Joe Bidenâ\u0080\u0099s agenda is â\u0080\u009cmade in China.â\u0080\u009d Yet on dealing with Beijing, the two White House contenders may have more in common than meets the eye. China policy is just one international trade issue Trump and Biden are sparring over as the Nov. 3 election approaches. Trump has pushed an â\u0080\u009cAmerica Firstâ\u0080\u009d policy, withdrawing from the Trans-Pacific Partnership after taking office and remaking the North American Free Trade Agreement into the U.S.-Mexico-Canada Agreement. Biden, meanwhile, was a free-trader as a senator and vice president, backing Nafta and supporting the same Pacific deal Trump backed out of. Hereâ\u0080\u0099s a look at where Trump and Biden stand on a few key trade issues. China: One of Trumpâ\u0080\u0099s signature trade deals was the so-called Phase 1 agreement with China MCHI, +0.53% Â in January, under which Beijing agreed to buy about $200 billion of U.S. farm and other products over two years. In exchange, the U.S. cut some tariffs on Chinese imports. The U.S. now levies 7.5% tariffs on $120 billion in certain Chinese goods, and 25% duties on about $250 billion of other Chinese products. With Trump referring to the coronavirus as the â\u0080\u009cChina virusâ\u0080\u009d and saying heâ\u0080\u0099s uninterested in speaking with Chinese President Xi Jinping, further talks are at a standstill. Biden may keep Trumpâ\u0080\u0099s tariffs on China if he wins the White House, even as he pledges to â\u0080\u009cstand up to the Chinese governmentâ\u0080\u0099s abuses [and] insist on fair trade.â\u0080\u009d Now see:Trump threatens to â\u0080\u0098decoupleâ\u0080\u0099 U.S. economy from China, accuses Biden of â\u0080\u0098treachery.â\u0080\u0099 â\u0080\u009cI think he has to keep Trumpâ\u0080\u0099s tariffs on China,â\u0080\u009d said Jon Lieber, Eurasia Groupâ\u0080\u0099s managing director for the U.S. â\u0080\u009cHe canâ\u0080\u0099t just come into office and lower these things without getting significant concessions from the Chinese first,â\u0080\u009d said Lieber, citing anti-China sentiment in the U.S. and potential blowback Biden would face for giving Beijing a â\u0080\u009cwin.â\u0080\u009d TPP, U.K. deals: One of Trumpâ\u0080\u0099s first moves as president in January 2017 was to pull the U.S. out of the Trans-Pacific Partnership, a 12-nation trade deal. The deal was backed by the Obama administration, and as president, Biden would have the opportunity to reverse Trumpâ\u0080\u0099s decision. But the former vice president has said heâ\u0080\u0099s not in a rush to re-enter. During the Democratic presidential debates, Biden said he wouldnâ\u0080\u0099t rejoin as â\u0080\u009cinitially put forward,â\u0080\u009d and that pieces of it should be renegotiated. He favors involving environmental and labor activists in talks. On the other side of the world, Biden has said the U.K. shouldnâ\u0080\u0099t count on signing a trade deal with the U.S. if the agreement that brought peace to Ireland â\u0080\u009cbecomes a casualty of Brexit.â\u0080\u009d Trump and U.K. Prime Minister Boris Johnson have made the agreement a priority. Also read:Biden to Brexit Britain: No trade deal with U.S. if you mess with Ireland. Domestic manufacturing: With U.S. unemployment above 8% as the country struggles with the coronavirus pandemic, trade and manufacturing policy are key planks of each candidateâ\u0080\u0099s campaign. As Trump has blamed Bidenâ\u0080\u0099s support for Nafta for cutting jobs in states like Michigan, the former vice president says he wants the federal government to spend $400 billion on American goods and services, in addition to $300 billion in research and development in U.S. tech companies. Biden has also called for taxes on companies that move jobs overseas. Read on:Biden proposes $700 billion-plus â\u0080\u0098Buy Americanâ\u0080\u0099 campaign. Trump, meanwhile, pledges in his second-term agenda to bring back 1 million manufacturing jobs from China. The president charges that Bidenâ\u0080\u0099s vote 20 years ago to normalize trade relations with China has helped kill American jobs and hollow out U.S. manufacturing. â\u0080\u009cPresident Trump has fundamentally transformed U.S. trade policy to put Americans first and bring jobs back home,â\u0080\u009d said Ken Farnaso, deputy national press secretary for the Trump campaign. â\u0080\u009cJoe Biden spent his entire career appeasing globalist leaders and expanding American reliance on foreign countries like China. Now, heâ\u0080\u0099s lying about his record thinking American voters arenâ\u0080\u0099t smart enough to know the truth: that his actions cost millions of American jobs to be shipped abroad. Itâ\u0080\u0099s clear that every failed trade deal, lost job, and shut down factory has Bidenâ\u0080\u0099s fingerprints all over it,â\u0080\u009d Farnaso told MarketWatch in a statement. Opinion:Both Trump and Biden are overlooking the simplest way to encourage â\u0080\u0098Made in Americaâ\u0080\u0099 manufacturing. While Trump and Biden share some of the same goals, the key is in how theyâ\u0080\u0099ll try to achieve them, Lieber says. â\u0080\u009cTrumpâ\u0080\u0099s been doing unconventional things such as forcing trading partners to the negotiating table with the threat of tariffs. Bidenâ\u0080\u0099s far more likely to pursue a more multilateral approach and work with allies to try to come up with remedies against the bad actors in the world, the biggest of which of course includes China,â\u0080\u009d he told MarketWatch. A Biden campaign spokesman didnâ\u0080\u0099t immediately return requests for comment. Also read:How Trump and Biden tax policies could affect your paycheck, tax return, investment portfolio and nest egg. This report was first published on Sept. 21, 2020."}]}