{"article": [{"url": "https://www.marketwatch.com/story/trump-praises-qanon-conspiracy-theorists-says-he-appreciates-their-support-2020-08-19", "published": 1597867160.0, "headline": "Trump praises QAnon conspiracy theorists, says he appreciates their support", "body": "WASHINGTON — President Donald Trump on Wednesday praised the supporters of QAnon, a convoluted, pro-Trump conspiracy theory, and suggested he appreciates their support of his candidacy. Speaking during a press conference at the White House, Trump courted the support of those who put stock in the conspiracy theory, saying, “I heard that these are people that love our country.” It was his first public comment on the subject. QAnon has ricocheted around the darker corners of the internet since late 2017, but has been creeping into mainstream politics more and more. The baseless theory centers on an alleged anonymous, high-ranking government official known as “Q” who shares information about an anti-Trump “deep state” often tied to satanism and child sex trafficking. Trump insisted he hadn’t heard much about the movement, “other than I understand they like me very much” and “it is gaining in popularity.” iframe.twitter-tweet { width: 100% !important; } Trump has retweeted QAnon-promoting accounts, and shirts and hats with QAnon symbols and slogans are not uncommon at his rallies. An FBI bulletin last May warned that conspiracy theory-driven extremists have become a domestic terrorism threat. The bulletin specifically mentioned QAnon. Earlier last year, the Southern Poverty Law Center warned that the movement is becoming increasingly popular with anti-government extremists. Pressed on QAnon theories that Trump is allegedly saving the nation from a satanic cult of child sex traffickers, Trump claimed ignorance, but asked, “Is that supposed to be a bad thing?” “If I can help save the world from problems, I’m willing to do it,” Trump said. Qanon supporters were quick to celebrate Trump’s comments on social media, with many calling them a validation of their views. Many have long contended he sends them coded messages of support, and on Twitter TWTR, -0.23% , one user claimed Trump’s choice of a pink tie on Wednesday was another signal of support. Within minutes, dozens of Instagram users began celebrating Trump’s acknowledgement of the conspiracy theory at the White House podium, uploading videos of him. “Well we’ve been waiting for this moment for a while, to put it mildly thank you @realDonaldTrump,” one Instagram user wrote to her 19,000 followers in a post of Trump’s exchange. The video was viewed more than 1,000 times in just 30 minutes. “Holy Smokin Q,” another tweeted. “Our President was asked 2 questions about the Qanon movement TODAY!! We LOVE you President Trump.” On Parler, a right-wing platform popular with some Trump supporters, one Qanon supporter posted a photo of Trump and a bald eagle. Trump’s comments came a week after he endorsed Marjorie Taylor Greene, who won her GOP House primary runoff in Georgia last week. Greene called the QAnon conspiracy theory “something worth listening to and paying attention to” and called Q a “patriot.” Trump praised her as a “future Republican Star.” Trump has a long history of advancing false and sometimes racist conspiracies, including last week, when he gave credence to a highly criticized op-ed that questioned Democrat Kamala Harris’ eligibility to serve as vice president even though she was born in Oakland, California. Asked about the matter, Trump told reporters he had “heard” rumors that Harris, a Black woman and U.S.-born citizen whose parents were immigrants, does not meet the requirement to serve in the White House. The president said he considered the rumors “very serious,” but later he and his campaign indicated they were not making an issue of the claim. Constitutional lawyers have dismissed it as nonsense."}]}