{"article": [{"url": "https://www.marketwatch.com/story/tiktok-has-lost-its-ceo-and-has-days-to-sell-u-s-business-the-pressure-intensifies-for-an-american-company-to-buy-it-11598537112", "published": 1598526740.0, "headline": "TikTok has lost its CEO and has days to sell U.S. business - the pressure intensifies for an American company to buy it", "body": "TikTok has been downloaded about 2 billion times globally and has more than 100 million monthly users in the U.S. alone, according to the app. AFP via Getty Images Kevin Mayer has quit his job as the chief executive of popular social media app TikTok after only three months in the role, as pressure mounts on the Chinese company to sell its U.S. business. The longtime media executive left Walt Disney DIS, +1.53% in May to run Chinese-owned ByteDance's video-sharing app, and almost immediately found himself plunged into a difficult political environment. President Donald Trump signed an order on Aug. 14 that set a 90-day deadline for TikTok's owner to divest from U.S. operations. TikTok has been downloaded about 2 billion times globally and has more than 100 million monthly users in the U.S. alone, according to the app. Mayer will be temporarily replaced by Vanessa Pappas, currently the U.S. general manager for TikTok. In a note to staff viewed by The Wall Street Journal, Mayer said that the political environment had \"sharply changed\" in recent weeks and that he decided to resign after \"significant reflection on what the corporate structural changes will require\" in the event of a sale. Read: U.S. TikTok CEO Kevin Mayer resigns, saying 'political environment has sharply changed' The outlook: Trump's order framed TikTok as a potential national security threat and called for it to sell its U.S. operations to an American company. So far, there has been intense interest from potential suitors, including Microsoft MSFT, +2.48% and Oracle ORCL, +0.42%, who have only a short time to seal a deal. Read: These German stocks are rising after the country extended coronavirus relief"}]}