{"article": [{"url": "https://www.marketwatch.com/story/a-long-hard-fight-to-allow-visits-to-isolated-nursing-home-residents-2020-10-07", "published": 1602062960.0, "headline": "A long, hard fight to allow visits to isolated nursing home residents", "body": "This article is reprinted by permission from NextAvenue.org. I didn’t hug my mom Betty for 200 days because her nursing home in Jacksonville, Fla., was on lockdown. Before that, my brothers and I saw her virtually every single day. She suffered a debilitating stroke and was left with aphasia (a brain disorder), so she is unable to communicate and has cognitive deficits. While technology has been the solution for many, talking to her through a video screen isn’t an option for us. Not long after the lockdown, my mother’s facility opened up window visits. But sitting on the sidewalk on a noisy street and seeing her through a grainy window screen is more frustrating than it’s worth. My mom either closes her eyes or cries. She doesn’t understand. She misses my morning visits when I’d show up with coffee and doughnuts. And there’s no way to explain this to her. Our pleading and begging with the facility’s administrators have fallen on deaf ears. They’re just following government mandates and, I believe, they genuinely want to protect their residents from this deadly virus. On Sept. 17, the Centers for Medicare and Medicaid Services (CMS) released new guidance easing some nursing home visitation restrictions, but facilities may interpret the guidelines differently. I’m sure you’ve seen the stories in the news and heard the outcry from families who fear that their loved ones in these locked-down facilities are declining. Family engagement, love, human touch and hugs are all important to everyone, but especially to those who may be suffering from physical and mental decline.Caregivers for Compromise The first few months of lockdown, I was just going about my business, griping to anyone who would listen about how cruel this process was. Residents of these facilities felt imprisoned. Punished. Cut off. And like my mom, they felt unloved. Some quit eating due to depression. Some died. It felt like my brothers and I were fighting an uphill battle. Don’t miss: The case for defunding nursing homes and replacing them with a radically different model That’s when I stumbled upon a Facebook FB, +0.26% group called “Caregivers for Compromise – because isolation kills too!” It was started by a woman in Jacksonville who got a job as a dishwasher at her husband’s memory care facility, just so she could see him. And thus began a groundswell of concerned, disgruntled and downright angry family members who were being kept from their loved ones. What began as a group to connect with others and share stories and commiserate, became state-by-state grass roots action chapters rallying legislators and politicians to find ways to let families reconnect with their loved ones in assisted living facilities, nursing homes and group homes. It’s a place of angry and frustrated voices, but also an idea bank where real solutions are being developed and shared. It’s social media at its best. In Florida, a group of volunteers put together a white paper for the governor and made heart-wrenching videos to garner media attention. Other states followed suit. Word spread through the Facebook groups that Minnesota had successfully lobbied for the Essential Family Caregiver Program which granted family members who had previously provided essential caregiving services to their loved ones access to the facilities. This became the rallying cry and buzzword for other states. Reporters joined these groups so they could feature families in their nightly newscasts. As family members, our voices were finally being heard. But our ultimate goal was to lift the lockdowns and allow us to see our loved ones.PPE, testing and social distancing As a family member and an advocate, it’s a tough situation. I want to spend time with my mom but that also means allowing other people into my mom’s facility, which increases the risk of spreading COVID-19. Also see: Are we undercounting or overcounting COVID-19 deaths? I’m a masker and a distancer, but how could I know if other residents’ visitors were equally as vigilant? I certainly didn’t want my mom exposed to the virus. I know from speaking to other families that we would all go to great lengths to be able to see our loved ones even for periodic visits. We’d get tested regularly, wear all forms of PPE, quarantine if necessary and even socially distance, which is tough because I really want to hug my mom. She doesn’t speak, so human touch is our only form of communication. I generally hug my mom 365 days a year. I’ve only hugged her twice in the last six months. The 51 chapters of Caregivers for Compromise continued to feed off one another. There were letter-writing campaigns to legislators. Sit-ins in parking lots of facilities. Media interviews. Tweet campaigns. Anything that could tear at the heartstrings of those in charge. Even within states, there is little standardization about visitors. Some facilities have usurped the government orders and created their own protocols, while others have gone to the extreme of barring any contact at all, even window visits. But these family members are all about accountability. They’ve shared form letters and emails holding corporate owners and facility administrators responsible for failures in the daily care of their loved ones. It’s the true definition of grass roots. And those grass roots efforts have led to media coverage, which then prompted some states to revise their visitation policies. The key message on behalf of all families is pretty much the same: there are safe ways to allow us access to our loved ones: PPE, distancing and testing. We want to keep residents and ourselves safe, too. Slowly, states are lifting the mandates on lockdown, but many facilities are still left grappling with the logistics of how to reopen to visitors safely. And I get that. In August, Florida’s governor opened up access, but most facilities are still closed to visitors as corporate owners and internal staff reckon with “safe access.” Families have learned that there is strength in numbers. And that we really are all in this together. Keeping each other motivated and informed is the key to successfully fighting the system. See: This is one task everyone in their 50s should consider before it’s too late These days, my visits with my mother are very limited; I’m allowed two one-hour visits a week. I don’t like this new normal and hope we can return to our daily visits. It’s been a long, hard fight, but one in which I was never alone. Beth Graham is an empty nest lifestyle writer, and the classic sandwich generation as a caregiver for her terminally ill mother and mother to two aspirational millennials. She blogs on the empty nest lifestyle at bethgraham.com. Find her on Twitter @BethGrahamPR. This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}