{"article": [{"url": "https://www.marketwatch.com/story/we-obviously-bet-on-the-wrong-horse-i-co-signed-my-nephews-55k-student-loan-he-has-no-degree-and-no-job-aside-from-a-time-machine-how-can-we-get-out-of-this-mess-2020-09-16", "published": 1601101040.0, "headline": "â\u0080\u0098We bet on the wrong horseâ\u0080\u0099: I co-signed my nephewâ\u0080\u0099s $55K student loan: He has no degree and no job. What should we do?", "body": "Dear Moneyist, My wife and I co-signed her nephewâ\u0080\u0099s student loans so he could attend a small private college. Six years later, he has no degree, no job, no prospects, nor do I believe he has any ability to repay the loan. Itâ\u0080\u0099s around $55,000. He lives with his mother, and only on rare occasions does he return our calls or emails. His mother and grandparents have no means to repay this loan either. Aside from a time machine, what solutions do we have to avoid getting stuck with the tab for this mess? We believed in good faith that this smart young man would be successful and keep his word. We obviously bet on the wrong horse. Donâ\u0080\u0099t want to be holding the bag in Des Moines Dear Niece, You loaned money to your nephew by co-signing his loan with the expectation that he would finish college, get a job and repay it. In other words, you co-signed the loan so your nephew would make the investment in his own future. The hard, difficult truth is that the actual investment here was his to make, not yours, and that was the risk you took on when you gave your nephew this money. Itâ\u0080\u0099s similar for people who choose to invest in stocks. They have the expectation that the company will pursue strategies to increase revenue and market share, build investor confidence, and increase the share price. But once you hand the money â\u0080\u0094 whether itâ\u0080\u0099s co-signing a loan, investing in a stock, or playing blackjack â\u0080\u0094 itâ\u0080\u0099s out of your hands. Only loan money that you can afford to lose. Unfortunately, if your nephew does not repay this loan, you are on the hook for it, and non-payment could affect your credit score, and ability to take out a loan or refinance your home. This is a conversation you should have as a family. Interest rates are low. You could pay off this loan, if you can afford it, on the condition that you co-sign on a loan with a lower interest rate. The Moneyist: My late husband did not see his son in 30 years. Should I mail his son photos and other memorabilia â\u0080\u0094 and risk him making a claim on his estate? This is a cautionary tale for others who may be tempted to co-sign a private student loan for a family member. Private student loans make up $120 billion of the $1.5 trillion student-loan industry. Among adults 50 and older, co-signing a private loan is the most common way to help pay for someone elseâ\u0080\u0099s education, according to the AARP. One quarter had to make at least one co-payment. â\u0080\u009cHistorically, people tended to incur debt at younger ages â\u0080\u0094 to pay for their college education and buy homes â\u0080\u0094 and then paid the debt off during their working years,â\u0080\u009d the AARP report said. â\u0080\u009cThis enabled them to enter retirement debt-free and gave them a better chance of obtaining and retaining financial security as they aged.â\u0080\u009d Not anymore. But the other big investment you made here is the emotional investment. You did something good, and you feel cheated and disrespected by your nephew not finishing college, not getting a job, moving back in with his parents, and avoiding your calls. Make peace with that before you approach your sister and your nephew to talk about what steps he (hopefully) plans to take to repay it. You can email The Moneyist with any financial and ethical questions related to coronavirus at qfottrell@marketwatch.com. Want to read more?Follow Quentin Fottrell on Twitterand read more of his columns here. Hello there, MarketWatchers. Check out the Moneyist private Facebook FB, +0.26% Â group where we look for answers to lifeâ\u0080\u0099s thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}