{"article": [{"url": "https://www.marketwatch.com/story/tesla-stock-tumbles-toward-2nd-bear-market-in-6-months-2020-09-08", "published": 1599636500.0, "headline": "Tesla stock suffers biggest-ever drop as it starts its second bear market this year", "body": "Shares of Tesla Inc. suffered Tuesday their biggest loss since going public to kick off the second bear market this year, as investors rode a roller coaster over the past week that started with a climb to a record close and was followed by a stock offering, a big bounce, and then an S&P 500 index snubbing. The electric vehicle and battery maker’s stock TSLA, +1.89% plunged 21.1% to close at $331.21 Tuesday. The previous record selloff was the 19.3% drop on Jan. 13, 2012, while the biggest post-COVID-19 crisis decline was 18.6% on March 16. Tesla went public on June 29, 2010, at a pre-split adjusted initial public offering price of $17 ($3.40 split adjusted). Tesla’s stock has now plummeted has lost 33.7% since closing at a record $498.32 about a week ago, which is the day a 5-for-1 stock split took effect. The stock’s selloff kicked off last Tuesday after the electric vehicle maker disclosed a $5 billion stock offering and a large shareholder reduced its stake. On Friday, the stock had plunged as much as 8.6% intraday, before pulling a sharp U-turn to close up 2.8%, to snap a 3-day losing streak, after the company disclosed stock trades by a number of insiders. Read more: Elon Musk’s brother Kimbal made more than $8 million selling Tesla shares two days before he bought them. Then after the close Friday, the stock took a beating after S&P Dow Jones Indices stunned investors by not adding Tesla’s stock to its benchmark S&P 500 index SPX, +0.87%, as many on Wall Street believed was a foregone conclusion. “Tesla not getting into the S&P 500 club is a head scratcher and the stock will likely be down for the indexing implications,” Wedbush analyst Dan Ives said in an email to MarketWatch, as reported by MarketWatch’s Jeremy Owens. Don’t miss: S&P 500 adds three companies not named Tesla — ‘a bit of a shocker,’ analyst says. “With an estimated ~$4.5 [trillion] of assets indexed to the S&P 500, we think shares were reflecting expectations for substantial passive inflows,” Baird analyst Ben Kallo wrote in a research note. “Unclear why [Tesla] was not included in the recent rebalancing cycle, though we do think the stock will eventually be added to the S&P 500, having fulfilled all inclusion criteria.” The shock snubbing pushed the stock over the widely-watched 20%-decline threshold. Many on Wall Street label a decline on a closing basis of at least 10% to up to 20% from a record as a correction, and define bear market as a drop of at least 20%. Although those definitions are arbitrary and not necessarily considered a trading trigger, they are still often noted in trading lore, as they can be useful in recognizing volatility amid longer-term trends. Despite this week’s tumble, the stock was still up nearly fourfold (up 294.7%) year to date, while the Nasdaq Composite Index COMP, +1.39% , of which Tesla is a member, has rallied 20.9% and the S&P 500 has gained 3.1%. Tesla’s market cap is $307.7 billion, compared with the market caps for S&P 500 components General Motors Co. GM, -0.15% of $46.3 billion and Ford Motor Co. F, -1.36% of $28.0 billion. It took just two days for the stock to enter correction territory, as on Sept. 2 it closed 10.2% below its Aug. 31 record. Many would view a close on Tuesday at or below $398.65 as marking the beginning of a bear market. Also read: Tesla’s stock sinks again to kick off a correction after disclosure of another large seller. That last time Tesla’s stock entered a bear market was Feb. 27, 2020, when it closed at a split-adjusted $135.80 to be down 26.0% from its Feb. 19 record close (at the time) of $183.48. The stock went on to fall as much as 60.6%, as it bottomed at a three-month closing low of $72.24 on March 18. The stock closed at a new record of $189.98 on June 8, or 70 trading days after it entered a bear market. FactSet, MarketWatch The bear market off a record high before that was launched on Nov. 2, 2017, when it closed at $59.85, or 22.3% below the previous record at the time of $77.00 on Sept. 18, 2017. After bouncing around for nearly two years, the stock finally bottomed on June 3, 2019, at a closing low of $35.79, or 53.5% below its September 2017 record. The stock didn’t reach another record closing high until Dec. 18, 2019, or 534 trading sessions after the bear market kicked off."}]}