{"article": [{"url": "https://www.marketwatch.com/story/new-wildfires-in-the-napa-sonoma-wine-region-are-forcing-hasty-evacuations-01601314106", "published": 1601328140.0, "headline": "New wildfires in the Napa-Sonoma wine country force nearly 70,000 to flee homes", "body": "A fire engine leaves a burning property as the Glass Fire tears through St. Helena, Calif., on Sunday. Associated Press SAN FRANCISCO — Northern California’s wine country was on fire again Monday as strong winds fanned flames in the already scorched region, destroying homes and prompting overnight evacuation orders involving nearly 70,000 people. Meanwhile, three people died in a separate fire further north in the state. Residents of the Oakmont Gardens senior living facility in Santa Rosa boarded brightly lit city buses, some wearing bathrobes and using walkers. They wore masks to protect against the coronavirus as orange flames marked the dark sky. iframe.twitter-tweet { width: 100% !important; } The fire threat forced Adventist Health St. Helena hospital to suspend care and transfer all patients elsewhere. The fires that began Sunday in the famed Napa-Sonoma wine country about 45 miles north of San Francisco came as the region nears the third anniversary of deadly wildfires that erupted in 2017, including one that killed 22 people. Just a month ago, many of those same residents were evacuated from the path of a lightning-sparked fire that became the fourth-largest in state history. “Our firefighters have not had much of a break, and these residents have not had much of a break,” said Daniel Berlant, assistant deputy director with the California Department of Forestry and Fire Protection, known as Cal Fire. Sonoma County Supervisor Susan Gorin evacuated her home in the Oakmont community of Santa Rosa about 1 a.m. She is rebuilding a home damaged in the 2017 fires. Gorin told the San Francisco Chronicle that she is numb, and the situation feels surreal. “It’s like God has no sympathy, no empathy for Sonoma County,” she said. iframe.twitter-tweet { width: 100% !important; } More than 68,000 people in Sonoma and Napa counties have been evacuated in the latest inferno, one of 27 major fire clusters burning across the state, said Berlant. Many more residents have been warned that they might have to flee, even though winds eased significantly Monday afternoon, giving firefighters an opportunity to make some progress, he said. In Napa County, the entire town of Calistoga, population around 5,000, was ordered to evacuate Monday evening. Many more residents have been warned that they might have to flee, even though winds eased significantly Monday afternoon, giving firefighters an opportunity to make some progress, he said. “The smoky skies that we’re under are a sign that there’s not a lot of air movement out there moving the smoke around,” Nichols said at an evening briefing. “Not good for air quality, and folks outside exercising, but great for us to work on containing this fire and working on putting it out.” The Glass Fire broke out before 4 a.m. Sunday and merged with two other fires to scorch 17 square miles as of early Monday. Officials did not have an estimate of homes destroyed or burned, but the blaze engulfed the Chateau Boswell Winery in St. Helena and at least one five-star resort. Logan Hertel of Santa Rosa used a garden hose to fight flames at a neighbor’s house in the Skyhawk neighborhood until firefighters could relieve him. “Seems like they got enough on their hands already. So I wanted to step in and put out the fire,” Hertel said. Dominic Wiggens, who lives in the same neighborhood, evacuated but returned later Monday. His home was still standing, but many others were gone. “It’s so sad,” he said. iframe.twitter-tweet { width: 100% !important; } Pacific Gas & Electric PCG, +1.79% was inspecting its equipment as it sought to restore power to more than 100,000 customers who had it turned off in advance of gusty winds or within active fire zones. The utility’s equipment has caused previous disasters, including the 2018 Camp Fire that killed 85 people and devastated the town of Paradise in the Sierra Nevada foothills. By Monday night, the utility said it had restored electricity to essentially all of those customers. However, PG&E said about 24,000 people remained without power in areas affected by two fires in Napa, Sonoma, Shasta and Tehama counties. More than 1,200 people were also evacuated in Shasta County for the Zogg Fire, spread over 23 square miles by Monday. Shasta County Sheriff Eric Magrini announced Monday afternoon that three people have died as a result of that fire, though he gave no details. “It’s with a sad heart that I come before you today,” he said, urging residents to heed advice to leave. “When you get that order, evacuate immediately. Do not wait.” Residences are widely scattered in the forested area in the far northern part of the state. The region was torched just two years ago by the deadly Carr Fire — infamously remembered for producing a huge tornado-like fire whirl. The causes of the new fires were under investigation. Mark Ghilarducci, director of the Governor’s Office of Emergency Services, said 2020 has been challenging. “The silver lining to it is that people who live in California become more prepared, they’re more aware, they know these events take place and we’re seeing a citizenry that does get it and is working hard to be prepared,” he said. Numerous studies in recent years have linked bigger wildfires in America to global warming from the burning of coal, oil and gas. Scientists say climate change has made California much drier, meaning trees and other plants are more flammable. The latest fires erupted as a giant ridge of high pressure settled over the West, producing powerful gusts blowing from the interior toward the coast while slashing humidity levels and raising temperatures. So far this year, more than 8,100 California wildfires have killed 26 people, scorched 5,780 square miles, and destroyed more than 7,000 buildings. Most of the losses occurred after a frenzy of dry lightning strikes in mid-August ignited a massive outbreak of fires. Fire worries were developing Monday across Southern California, although it was unclear how strong predicted Santa Ana winds would become. Heat and extreme dryness were expected to be problematic nonetheless. Conditions were also hot, dry and windy in parts of Arizona, where the Sears Fire in Tonto National Forest north of Phoenix has grown to more than 14 square miles since it erupted Friday. Authorities reported zero containment."}]}