{"article": [{"url": "https://www.marketwatch.com/story/qanon-supporter-who-made-racist-videos-wins-republican-primary-in-georgia-2020-08-11", "published": 1597185680.0, "headline": "QAnon supporter who made racist videos wins Republican primary in Georgia", "body": "ATLANTA — Marjorie Taylor Greene, a businesswoman who has expressed support for the far-right conspiracy theory QAnon and been criticized for a series of racist comments, has won the Republican nomination for Georgia’s 14th Congressional District. Greene beat neurosurgeon John Cowan in a primary runoff for the open seat on Tuesday in the deep-red district in northwest Georgia, despite several GOP officials denouncing her campaign after videos surfaced in which she expresses racist, anti-Semitic and anti-Muslim views. “WE WON! Thank you for your support! Save America. Stop Socialism,” Greene tweeted late Tuesday. A video posted to her Twitter account of her victory party showed a room full of supporters gathered closely together. Few, if any, wore face masks to protect against the coronavirus. In a victory speech posted to social media, Greene said she decided to enter politics because the country is heading in the wrong direction. “So the Republican establishment was against me. The DC swamp has been against me. And the lying fake news media hates my guts,” she said. “Yep, it’s a badge of honor.” She has amassed tens of thousands of followers on social media, where she often posts videos of herself speaking directly to the camera. Those videos have helped propel her popularity with her base, while also drawing strong condemnation from some future would-be colleagues in Congress. In a series of videos unearthed just after Greene placed first in the initial June 9 Republican primary, she complains of an “Islamic invasion” into government offices, claims Black and Hispanic men are held back by “gangs and dealing drugs,” and pushes an anti-Semitic conspiracy theory that billionaire philanthropist George Soros, who is Jewish, collaborated with the Nazis. Several high-profile Republicans then spoke out against her. House Minority Whip Steve Scalise of Louisiana quickly threw his support behind Cowan, while Rep. Jody Hice of Georgia rescinded an endorsement of Greene. Greene addressed criticism of her comments on Twitter. “The Fake News Media, the DC Swamp, and their radical leftist allies see me as a very serious threat. I will not let them whip me into submission,” she said, without distancing herself from her earlier remarks. Greene also is part of a growing list of candidates who have expressed support for QAnon, the far-right U.S. conspiracy theory popular among some supporters of President Donald Trump. She has positioned herself as a staunch Trump supporter and emphasizes a strongly pro-gun, pro-border wall and anti-abortion message. She has also connected with voters through an intensive effort to travel the district and meet people on the ground. Larry Silker, a 72-year-old retiree, cast a ballot for Greene last week at an early voting location in Dallas, Georgia. “She seems to be a go-getter, you know. She’s out seeing everybody that she can, and I think that’s nice,” Silker said. Asked whether he had seen criticism of Greene’s remarks, Silker said: “Well yeah, you know, you see it. But do you put faith in it? You just have to weigh it out.” Voter Pamela Reardon said she supports Greene because she connects with people, and she’s anti-abortion, a defender of the Second Amendment and “a true Christian.” “I got behind her because of her honesty,” she said. “She’s not going to be bought by anybody. I could tell that her heart was pure.” Reardon is familiar with criticism of Greene’s social media posts and videos but says “she’s never said anything racist like they say she has,” and blamed attacks by her opponent’s campaign. The district stretches from the outskirts of metro Atlanta to the largely rural northwest corner of the state. Greene will face Democrat Kevin Van Ausdal in November. Republican Rep. Tom Graves, who did not seek reelection, last won the seat with over 76% of the vote in 2018."}]}