{"article": [{"url": "https://www.marketwatch.com/story/chipotle-customers-are-spending-more-to-dine-on-queso-and-steak-2020-07-23", "published": 1595578100.0, "headline": "Chipotle customers are spending more to dine on queso and steak", "body": "Chipotle Mexican Grill Inc. reported a 4.8% second-quarter revenue decline to $1.4 billion, but the average check rose by 5% as customers choose to add more steak and queso to their entrées. In addition, customers are ordering for larger groups of people. “I think that’s because instead of the person working and going out to lunch maybe with a group, [when] they’re all paying [for] themselves, now it’s going to the restaurant and then ordering for the family,” said John Hartung, Chipotle’s CMG, +0.01% chief financial officer, on the late Wednesday earnings call, according to a FactSet transcript. Chipotle is down 1.6% in Thursday trading despite beating earnings and revenue expectations. Analysts, who attribute the share slide to lofty investor expectations, remain largely upbeat about the fast-casual chain due to its digital investments, its real estate prospects and its continued menu innovations. Read:Coca-Cola plans to cut ‘zombie brands’ from its portfolio Chipotle has launched a new line of organic drinks, Tractor Beverages, which have a philanthropic component to aid U.S. agriculture, this week. And last week, the company began testing cauliflower rice. Chipotle also recently introduced a digital-only option, quesadillas. “The company’s March 1 launch of Queso Blanco has seen good reception following targeted marketing that uses its growing customer data to drive product attachment,” wrote JPMorgan analysts in a note, who say other items are being considered for a digital-only menu. “Chipotle has also learned that in the early days of the digital-only quesadilla launch, people are willing to go through the app/digital experience just to get the product.” JPMorgan rates Chipotle stock neutral and raised its price target $20 to $1,040. A number of upbeat analysts have raised Chipotle’s price target post-earnings announcement. Wedbush, with a stock rating of outperform, moved its price target to $1,320 from $1,200. RBC Capital Markets, with a sector perform stock rating, raised its price target to $1,250 from $1,125. And SunTrust Robinson Humphrey’s buy rating has a $1,358 price target, up from $1,336. “While 2Q and 3QTD comps (-9.8% and +6.4%, respectively) appear to have fallen just short of the high bar set by investor expectations heading into earnings, the 2Q’s sequential topline and margin improvement, along with strong, sustained digital mix, and a higher visibility path to margin and earnings recovery by the end of the year are nonetheless impressive given the challenging backdrop of this spring,” wrote RBC’s Christopher Carill in a note. Also: Domino’s Pizza could snap up market share with ‘improved’ chicken wings Bernstein analysts are also confident that there will be more new menu items to come. “The power of topline drivers like Queso Blanco (high teens mix) and salads are a testament to the efficacy of the stage-gate process as well as the long runway for menu innovation that awaits,” wrote analysts led by Sara Senatore. The stage-gate process are the steps Chipotle takes to introduce new dishes to the menu. Queso Blanco, for example, was launched using the stage-gate process. “Chipotle’s ability to retain 70%+ of digital sales even as dining room volumes recover (now at 50% of previous levels) reflects the strong value proposition of Chipotle generally and digital ordering specifically.” Bernstein rates Chipotle stock outperform with a $1,300 target price. Chipotle stock has rallied 34% for the year to date while the S&P 500 index SPX, +0.87% has edged up 0.2% for the period."}]}