{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-hold-steady-as-stocks-set-to-hit-new-heights-2020-08-24", "published": 1598285540.0, "headline": "Treasury yields look past stock market records as traders gear up for debt supply", "body": "U.S. Treasury yields were mostly steady on Monday as bond traders looked past the buoyant mood buttressing equities, while looking ahead to the rush of debt issuance later this week.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 0.6 basis point to 0.645%. The 2-year note rate TMUBMUSD02Y, 0.156% ticked up to 0.151%, from 0.145% in the previous session, while the 30-year bond yield TMUBMUSD30Y, 1.576% fell 0.4 basis point to 1.349%. Bond prices move inversely to yields.What’s driving Treasurys? The upbeat sentiment in risk assets didn’t make for diminished appetite for haven assets like government paper amid uncertainty around the trajectory of the pandemic and Fed policy. The S&P 500 SPX, +0.87% and Nasdaq Composite COMP, +1.39% set new records at the start of Monday, extending the stock market’s remarkable rebound since plumbing its March trough. The Federal Reserve will command the attention of Wall Street as central bankers speak at the virtual Jackson Hole symposium, where Fed Chairman Jerome Powell will announce the results of the Fed’s review of its monetary policy approach and goals. Analysts expect the Fed to tweak its policy framework to allow for a sustained overshoot of its inflation target before raising interest rates. Read: Powell to speak next Thursday on Fed’s new inflation-friendly strategy Investors saw some second-tier economic data in the morning. The Chicago Fed’s national activity index for July fell to 1.18 in July from a revised record-high of 5.33 in June. For the rest of the week, market participants will have to take down $148 billion of debt with maturities ranging between 2 years to 7 years. What did market participants’ say? “The highlight of this week will be Jay Powell and the Fed’s annual economic symposium which will be a livestream this year. We expect the Fed to maintain a very dovish stance as it works through its multiyear policy review,” said Gregory Faranello, head of U.S. rates at AmeriVet Securities."}]}