{"article": [{"url": "https://www.marketwatch.com/story/dont-stop-demanding-racial-equality-after-protests-are-over-heres-how-to-become-a-lifelong-ally-2020-06-23", "published": 1593357980.0, "headline": "â\u0080\u0098Being anti-racist is a verb, so it requires actionâ\u0080\u0099: Donâ\u0080\u0099t stop demanding racial equality â\u0080\u0094 how to become a lifelong ally", "body": "Maybe you posted a black square on Instagram FB, +0.26%, donated money to a racial-justice organization, reflected with friends about your own privilege, or purchased a title from one of the internetâ\u0080\u0099s many anti-racism reading lists in the last three weeks. But as nationwide protests and a reckoning with Americaâ\u0080\u0099s racist past â\u0080\u0094and present â\u0080\u0094 hurtle onward, activists say the work is far from done. In fact, they say, todayâ\u0080\u0099s conversations are only the beginning. â\u0080\u009cRealize that whatâ\u0080\u0099s going on now is part of a long-term pattern of racial injustice, discrimination, exploitation and violence,â\u0080\u009d Paul Kivel, an educator, activist and author of the book â\u0080\u009cUprooting Racism: How White People Can Work for Racial Justice,â\u0080\u009d told MarketWatch. â\u0080\u009cItâ\u0080\u0099s really important for us to understand that we need to be always working for racial justice, whether thereâ\u0080\u0099s dramatic moments or not.â\u0080\u009d The countryâ\u0080\u0099s current scrutiny of police violence, discrimination and historic inequalities doesnâ\u0080\u0099t show signs of abating anytime soon. But in the event that it does, you can still work toward racial equality in your everyday existence â\u0080\u0094 and stand with your Black friends and coworkers even after the statements of solidarity fade from social-media feeds. You can start, of course, by understanding the history of Black-owned businesses and making the conscious decision to shop at them. (MarketWatch has your starter guide here.) Here are more ways to keep your foot on the racial-equality gas pedal at home, at work and out in the world:Continue educating yourself Become a â\u0080\u009cracial equity learnerâ\u0080\u009d and find ways to learn about how racial inequality persists today, said Rashawn Ray, a University of Maryland sociology professor and fellow at the center-left Brookings Institution. â\u0080\u009cWe need to educate ourselves about how racism looks and operates and what the history is, how it plays out today, and how are people of color organizing to address it,â\u0080\u009d Kivel said. â\u0080\u009cWe should be turning and listening to people of color, and thereâ\u0080\u0099s wonderful films and books and YouTube GOOG, +1.97% Â clips and art and dance and music.â\u0080\u009d Race-focused book lists abound; they often include a mix of introductory texts about race and literature by Black authors. Leslie Mac, an organizer and digital strategist, suggested reading â\u0080\u009cas many books and content from Black women as you possibly can.â\u0080\u009d She recommended contemporary works by authors such as Charlene Carruthers and Crystal Fleming, as well as historical works by authors like Frantz Fanon and Angela Davis. â\u0080\u009cIf youâ\u0080\u0099ve ever heard that a Black writer or thinker is â\u0080\u0098too radical,â\u0080\u0099 thatâ\u0080\u0099s who you should be reading right now,â\u0080\u009d she said. â\u0080\u009cAny book that is imagining a world that looks different from the one that we have, and is not just talking about things in theory, is really useful right now and will move people beyond that 101 framing, which is â\u0080\u0098I know that racism exists.â\u0080\u0099â\u0080\u009d As for learning from your Black friends or coworkers, â\u0080\u009cdonâ\u0080\u0099t have conversations that could easily be handled by a Google search,â\u0080\u009d Mac said. â\u0080\u009cYou can have a conversation with them about their experiences, about your behavior with them. Those are conversations that can be fruitful,â\u0080\u009d she said. â\u0080\u009cBut if youâ\u0080\u0099re just looking to download information from Black people, just skip it.â\u0080\u009dTalk to your friends and family â\u0080\u0094 and speak up when you witness racism The next step, Ray said, is to become a â\u0080\u009cracial equity advocate.â\u0080\u009d That means holding people accountable for their actions and statements about inequality at the dinner table, in your friend group and at work, he said. Donâ\u0080\u0099t let racist statements go unchecked. â\u0080\u009cPart of the fundamental way you know youâ\u0080\u0099re an advocate is if you speak up and speak out when the group thatâ\u0080\u0099s being vilified is not present or when they cannot help themselves,â\u0080\u009d Ray said. â\u0080\u009cIf you donâ\u0080\u0099t say anything, youâ\u0080\u0099re letting that racist statement ride, and itâ\u0080\u0099s assumed that you support it even if you donâ\u0080\u0099t. You have to purposely say something about it.â\u0080\u009d Pushing back with responses like, â\u0080\u009cI actually donâ\u0080\u0099t agree with that,â\u0080\u009d â\u0080\u009cIâ\u0080\u0099m not sure if thatâ\u0080\u0099s true,â\u0080\u009d or â\u0080\u009cIâ\u0080\u0099m not sure if we should be talking about people like thatâ\u0080\u009d can go a long way, especially if there are other people observing, he said. You can also be an advocate in public. Notice a pattern of Black customers at your local restaurant not being served or only being seated in the back corner? Ask for the manager or write a letter to the head of the company later. See someone being mistreated by the police or others? Record video of the encounter. â\u0080\u009cWithout mobile phones, we wouldnâ\u0080\u0099t know what happened to George Floyd, Ahmaud Arbery, Christian Cooper,â\u0080\u009d Ray said. If you have the time and opportunity, you can also acknowledge what happened to the person and let them know you didnâ\u0080\u0099t agree with it, he added. The bare minimum you can do to promote racial equality is to break the silence, Kivel said. â\u0080\u009cPart of how racism continues is that we donâ\u0080\u0099t talk about it â\u0080\u0094 so we need to have the conversations with our family and friends, with our children, with our neighbors, in our workplaces,â\u0080\u009d he said. “ â\u0080\u0098When the tenor of the conversation shifts, people are still going to be sitting with their experiences of structural racism, systemic racism and the daily microaggressions â\u0080\u0094 and theyâ\u0080\u0099re going to look to these same coworkers who blacked out their square on Instagram that day and put up the hashtag and sent them a note that said, â\u0080\u009cI am with you.â\u0080\u009dâ\u0080\u0099 ” â\u0080\u0094 Laura Morgan Roberts, a professor of practice at the University of Virginiaâ\u0080\u0099s Darden School of Business Promote equality at work Take ownership and responsibility for trying to positively change the culture of your workplace, said Laura Morgan Roberts, a professor of practice at the University of Virginiaâ\u0080\u0099s Darden School of Business who has researched and consulted on diversity. Be on the lookout for microaggressions, listen for stereotypical comments disparaging a personâ\u0080\u0099s qualifications, and â\u0080\u009ccall out that flawed assumption or characterizationâ\u0080\u009d in the moment, she said. Be proactive to ensure that people of color are included in meetings and important decisions, Roberts added; if you notice your Black coworker was left off an impromptu Zoom ZM, +2.89% Â meeting invite, take the extra step to loop them in. When a coworker of color does really well on a project or makes an important contribution to the team, shine a light on their accomplishments. If you have some authority at work, use your newfound enlightenment on race to promote greater equality in hiring and promotion decisions, Roberts said. Make sure people of color are being considered for leadership roles, task forces and other opportunities that could benefit them and their career. â\u0080\u009cTheir name might not be considered naturally when people talk about high potential, so throw that personâ\u0080\u0099s name in the hat too,â\u0080\u009d she said. If youâ\u0080\u0099ve put yourself forth as an ally during this time, Roberts added, expect that coworkers of color might eventually approach you to share an experience theyâ\u0080\u0099ve had in the workplace â\u0080\u0094 and be ready to offer validation, support, empathy and compassion, rather than dismissing or second-guessing their account. â\u0080\u009cWhen the tenor of the conversation shifts, people are still going to be sitting with their experiences of structural racism, systemic racism and the daily microaggressions â\u0080\u0094 and theyâ\u0080\u0099re going to look to these same coworkers who blacked out their square on Instagram that day and put up the hashtag and sent them a note that said, â\u0080\u0098I am with you,â\u0080\u0099â\u0080\u009d she said. â\u0080\u009cTheyâ\u0080\u0099re going to test that commitment by sharing an incident or an episode that otherwise they wouldâ\u0080\u0099ve never told their white coworker about.â\u0080\u009d “ â\u0080\u0098Being anti-racist is a verb, so it requires action for you to claim that particular mantle â\u0080\u0094 and it requires consistent action.â\u0080\u0099 ” â\u0080\u0094 Leslie Mac, an organizer and digital strategist Leverage your money, time and clout â\u0080\u009cRealize that because we have various benefits and privileges that we get from being white, we can use those to leverage resources for racial justice,â\u0080\u009d Kivel said. One of those resources is money, of course, but thereâ\u0080\u0099s also time, energy, experience, skills and connections, he said. Support and volunteer with grassroots organizations led by people of color that are â\u0080\u009corganizing for systematic change for racial justice at an institutional level,â\u0080\u009d Kivel said, and addressing issues such as housing, jobs, education and health care. Mac said she often looks for Black-led organizations that truly understand that â\u0080\u009call Black lives matterâ\u0080\u009d â\u0080\u0094 meaning theyâ\u0080\u0099re supportive of Black trans lives and Black LGBTQ+ lives. Scrutinize the work an organization does and see whether itâ\u0080\u0099s working alongside other groups, she said, because â\u0080\u009cvery rarely does good community organizing happen in a vacuum.â\u0080\u009d â\u0080\u009cThe piece thatâ\u0080\u0099s important is that whatever work youâ\u0080\u0099re trying to do is to complement and be in concert with the work that Black, brown and Indigenous organizers are doing on the ground,â\u0080\u009d Mac added.Use your power to influence systems Interrogate the systems that you have direct influence over and participate in, whether thatâ\u0080\u0099s the PTA or a board you sit on, Mac said. â\u0080\u009cBeing anti-racist is a verb, so it requires action for you to claim that particular mantle â\u0080\u0094 and it requires consistent action,â\u0080\u009d she said. In that vein, the third step in Rayâ\u0080\u0099s framework is to become a â\u0080\u009cracial equity broker,â\u0080\u009d meaning you advocate for racially equitable and transparent policies in spaces like your workplace, place of worship, homeownersâ\u0080\u0099 association and kidsâ\u0080\u0099 school. â\u0080\u009cYouâ\u0080\u0099re interrogating the rules, policies, practices and laws that are in place that govern what you do,â\u0080\u009d he said. â\u0080\u009cSpeaking as a white person in those kinds of public settings, whether itâ\u0080\u0099s a school-board meeting or a city-council meeting, does carry weight,â\u0080\u009d Kivel said.Vote â\u0080\u009cItâ\u0080\u0099s important to think about who we vote for and that we support candidates of color â\u0080\u0094 not indiscriminately, because we care about what they stand for [and] what their politics are,â\u0080\u009d Kivel said. He urged voting for candidates who are working toward goals like affordable housing, health care for everyone and safe communities. Consider candidatesâ\u0080\u0099 stances, behavior and past records on racism, he added: â\u0080\u009cAre they going to take us toward racial justice, or are they going to entrench us further in division?â\u0080\u009d"}]}