{"article": [{"url": "https://www.marketwatch.com/story/trump-republicans-prepare-to-counterpunch-biden-at-4-day-convention-2020-08-23", "published": 1598259860.0, "headline": "Trump, Republicans prepare to counterpunch Biden at 4-day convention", "body": "President Donald Trump and his fellow Republicans are preparing to aggressively counterattack Joe Biden at this week’s GOP convention, a four-day affair that is expected to make the case it is Trump and not his Democratic challenger who can revive the pandemic-battered U.S. economy. Like the Democrats’ own event, the Republicans’ will be a largely virtual affair thanks to COVID-19 concerns. But delegates will re-nominate the GOP president in Charlotte, N.C., in person on Monday, and Trump will speak from the South Lawn of the White House on Thursday night. Facing unemployment of more than 10% and lagging Biden in polls of key battleground-state voters, the convention is a crucial opportunity for Trump to turn the tide in his favor. Now see:‘I’ll be an ally of the light, not the darkness’: Joe Biden pledges to rebuild economy as he accepts Democratic nomination. “He’s in a world of hurt,” said Barbara Perry, the director of presidential studies at the University of Virginia’s Miller Center. “It’s hard to imagine how Trump is going to pull this one out of the hat. But I would not say he couldn’t do it,” Perry told MarketWatch. Speaking to a conservatives’ group last Friday in Arlington, Va., Trump again laid blame for the coronavirus on China and said the U.S. is on track to develop “incredible” vaccines. He said he represented “the bright future, not the dark future that you saw last night and for the last four days.” The convention’s theme will be “Honoring the Great American Story” and feature speeches by Vice President Mike Pence, first lady Melania Trump, Sen. Tim Scott of South Carolina and others including Mark and Patricia McCloskey, the St. Louis couple who brandished guns at protesters during a racial-injustice demonstration outside their home. Pence said Friday the Republicans would “talk about how we’re going to support law and order.” Read:Pence says Democrats went ‘negative’ at convention, previews a law-and-order thrust at Republican gathering. The economy is expected to be another major focus, given its continued weakness as a result of the coronavirus pandemic. Even as stocks SPX, +0.87% have set fresh records, millions of Americans remain out of work as businesses have shuttered. Trump “will argue that he created the greatest economy of all time and is the only person capable [of] returning the U.S. to economic strength,” wrote Sarah Bianchi of Evercore ISI in a note on Friday. Also see:Trump claims Biden win would crash market, cause depression. “It is a more complex argument as the crisis wears on and no additional stimulus has been passed, despite the expiration of the emergency UI. Nevertheless, we expect the president to point to the rebound in the stock market DJIA, +0.56% COMP, +1.39% and the relatively strong jobs reports from previous months,” Bianchi wrote. In the weeks leading up to the conventions, Trump has tried to paint Biden and his running mate Kamala Harris as extreme leftists who would wreck the economy and sink stocks. Some Wall Street analysts, meanwhile, have said it’s a Democratic sweep of the presidency and Congress that would boost the economy in the long run. Financial News:A Biden-Harris sweep would be best for economy, says Fidelity International. Mark Zandi of Moody’s Analytics — which is predicting a Biden victory over Trump in November — says factors including continued improvement in the job market and another fiscal rescue package that would give struggling Americans more income support could buoy Trump. “There is a scenario under which the economy could be strong enough and moving in the right direction fast enough that swings the election to Trump,” Zandi, Moody’s Analytics’ chief economist, told MarketWatch. Negotiations between Republicans and Democrats on another round of aid, meanwhile, remain stalled on Capitol Hill. A member of Trump’s campaign said the president would not limit his participation to his acceptance speech and would appear each night of the convention, and plans to honor frontline workers among other activities."}]}