{"article": [{"url": "https://www.marketwatch.com/story/why-are-some-people-with-coronavirus-asymptomatic-and-why-are-they-so-contagious-2020-08-08", "published": 1597086620.0, "headline": "Why are some people with coronavirus asymptomatic â\u0080\u0094 are they as contagious as those who display symptoms?", "body": "How contagious is someone who has contracted COVID-19 â\u0080\u0094 yet displays no symptoms? This study, published in the medical journal JAMA Internal Medicine this week, provides one theory for the first question. It isolated 303 patients with COVID-19 in a treatment center in South Korea. Of those, 110 (36%) were asymptomatic and 21 (19%) developed symptoms during isolation. â\u0080\u009cThe potential for transmission from asymptomatic people has been cited as an important factor in controlling the spread of COVID-19, but there is limited information about the clinical course and viral loads of asymptomatic people with SARS-CoV-2 infection,â\u0080\u009d the researchers wrote. What they found: â\u0080\u009cMany individuals with SARS-CoV-2 infection remained asymptomatic for a prolonged period, and viral load was similar to that in symptomatic patients,â\u0080\u009d the scientists concluded. â\u0080\u009cTherefore, isolation of infected persons should be performed regardless of symptoms.â\u0080\u009d The study was led by Seungjae Lee, an associate professor at Soonchunhyang University College of Medicine in South Korea, was peer reviewed, and carried out earlier in the pandemic; the researchers analyzed swabs taken from the group between March 6 and March 26. “ â\u0080\u0098Many individuals with SARS-CoV-2 infection remained asymptomatic for a prolonged period, and viral load was similar to that in symptomatic patients.â\u0080\u0099 ” Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said that in his 40 years of dealing with viral outbreaks, heâ\u0080\u0099s never seen anything like COVID-19, particularly in one singular way that helped lead to one of the biggest public health crises in a generation. â\u0080\u009cIâ\u0080\u0099ve been dealing with viral outbreaks for the last 40 years. Iâ\u0080\u0099ve never seen a single virus â\u0080\u0094 that is, one pathogen â\u0080\u0094 have a range where 20% to 40% of the people have no symptoms,â\u0080\u009d he told a recent House Committee on Energy and Commerce hearing on the novel coronavirus pandemic. The World Health Organization currently estimates that 16% of people with COVID-19 are asymptomatic and can transmit the coronavirus, while other data show that 40% of coronavirus transmission is due to carriers not displaying symptoms of the illness. The infectiousness of asymptomatic individuals relative to those who are symptomatic is 75%, according to the Centers for Disease Control and Prevention, based on studies of â\u0080\u009cviral sheddingâ\u0080\u009d dynamics â\u0080\u0094 that is, how much of the virus they transmit through talking or breathing. Not everyone responds the same to COVID-19 infection. â\u0080\u009cThe different host immune responses to SARS-CoV-2 infection may partially explain why males and females, young and old persons infected with this virus have markedly distinct disease severity,â\u0080\u009d the researchers wrote. So why are some people asymptomatic while others are not? â\u0080\u009cSARS-CoV-2, which is the virus causing coronavirus disease 2019 (COVID-19), uses the angiotensin-converting enzyme 2 (ACE2) as a cell receptor to invade human cells,â\u0080\u009d they added. Those ACE2 receptors or â\u0080\u009cdoorwaysâ\u0080\u009d appear to be more prevalent in older people and those who are obese than younger people. That may go some way in explaining why so many young people have not been as badly affected by the virus as those older than 60, for instance. Previous exposure to other coronaviruses, which can give people â\u0080\u009cT-cell immunityâ\u0080\u009d to similar viruses, receiving a lower viral load of COVID-19 and other lucky genetic variations may also contribute to why some people having less severe or not symptoms to infection. There is currently no vaccine for COVID-19, although several companies say theyâ\u0080\u0099ve made progress with trials. However, unlike with influenza viruses for which there are several vaccines, people have generally not built up an immunity to COVID-19 over multiple generations. Related: Feeling lax about masks? Think again. Hereâ\u0080\u0099s how many lives could be saved if everyone wore a mask â\u0080\u0094 starting today The public has been confused about the number of asymptomatic people and how contagious they are. MarketWatch photo illustration/iStockphoto But a strong immune response to an infection from a virus such as COVID-19 can sometimes cut both ways. Case in point: Doctors and members of the public were spooked by how otherwise strong, healthy people fell victim to the 1918 influenza. Doctors today attribute that to the â\u0080\u009ccytokine storm,â\u0080\u009d a process where the immune system in healthy people reacts so strongly as to hurt the body and ultimately cause damage to the organs and, in the most severe cases, organ failure. A hallmark of some viruses: A surge of immune cells and their activating compounds (cytokines) effectively turned the body against itself, led to an inflammation of the lungs, severe respiratory distress, leaving the body vulnerable to secondary bacterial pneumonia. â\u0080\u009cA major difference between Spanish flu and COVID-19 is the age distribution of fatalities,â\u0080\u009d according to a recent report by Deutsche Bank DB, -0.85%. â\u0080\u009cFor COVID-19, the elderly have been overwhelmingly the worst hit, but the young working-age population were severely hit in 1918. â\u0080\u009cIn fact, the death rate from pneumonia and influenza that year among 25-34-year-olds in the United States was more than 50% higher than that for 65-74-year-olds. A remarkable difference to Covid-19,â\u0080\u009d Deutsche Bank said. “ Asymptomatic transmission â\u0080\u0098is the Achillesâ\u0080\u0099 heel of Covid-19 pandemic control.â\u0080\u0099 ” â\u0080\u0094 Monica Gandhi, Deborah Yokoe and Diane Havlir, scientists at the University of California, San Francisco Public-health officials have advised people to keep a distance of six feet from one another. Face masks are designed to prevent the wearer, who may be infected with COVID-19 but have very mild or no symptoms, from spreading invisible droplets to another person and thereby infecting them too. It doesnâ\u0080\u0099t matter if someone appears sick or not. Asymptomatic transmission â\u0080\u009cis the Achillesâ\u0080\u0099 heel of COVID-19 pandemic control through the public-health strategies,â\u0080\u009d according to a May 28 editorial in the New England Journal of Medicine. It said the SARS-CoV-1 is even more contagious than SARS-CoV-2. The editorial, by researchers Monica Gandhi, Deborah Yokoe and Diane Havlir at the University of California, San Francisco, referred to recent study of a coronavirus outbreak at a skilled nursing facility that â\u0080\u009cstrongly demonstrate that our current approaches are inadequate.â\u0080\u009d They said those symptoms include high genetic relatedness, transmission primarily through respiratory droplets, and the frequency of lower respiratory symptoms (fever, cough, and shortness of breath), with both infections developing a median of five days after exposure. This University of California, San Francisco study said thereâ\u0080\u0099s a high viral load of SARS-CoV-2 shedding in the upper respiratory tract, even among pre-symptomatic patients, â\u0080\u009cwhich distinguishes it from SARS-CoV-1, where replication occurs mainly in the lower respiratory tract.â\u0080\u009d â\u0080\u009cDespite the deployment of similar control interventions, the trajectories of the two epidemics have veered in dramatically different directions,â\u0080\u009d they added. â\u0080\u009cWithin 8 months, SARS was controlled after SARS-CoV-1 had infected approximately 8,100 persons in limited geographic areas.â\u0080\u009d Related: Feeling lax about masks? Think again. Hereâ\u0080\u0099s how many lives could be saved if everyone wore a mask â\u0080\u0094 starting today Governments around the world are struggling to stop the spread of the pandemic. (An epidemic is a disease that infects regions or a community.) The â\u0080\u009cSpanish fluâ\u0080\u009d from 1918 to 1919 and Black Death from 1347 to 1351 were two of the most extreme pandemics ever recorded. As of Monday, COVID-19 has now infected 5,075,678 people in the U.S. Itâ\u0080\u0099s killed 732,889 people worldwide and 163,282 in the U.S., and also infected at least 19.9 million people globally, according to Johns Hopkins Universityâ\u0080\u0099s Center for Systems Science and Engineering. With 10,382 deaths, California is now the third U.S. state to register over 10,000 deaths after New York (32,781 deaths) and New Jersey (15,878 deaths). Texas has the fourth highest number of fatalities (9,177). New research on the rate of asymptomatic transmission does not bode well for these numbers. President Donald Trump signed four executive orders on Saturday that include extending unemployment benefits after Congress failed to reach a deal on a stimulus package. The Dow Jones Industrial Index DJIA, +0.56% and S&P 500 SPX, +0.87% Â closed up slightly Monday as investors awaited round two of a fiscal stimulus; the Nasdaq Compositeâ\u0080\u0099s COMP, +1.39% traded down."}]}