{"article": [{"url": "https://www.marketwatch.com/story/as-students-return-to-school-are-face-shields-really-effective-against-covid-19-2020-09-02", "published": 1599465380.0, "headline": "Think twice before wearing a face shield to protect against COVID-19 instead of a cloth face mask - here's why", "body": "Face shields are probably OK to wear to protect against COVID-19, right? Wrong. That's according to the latest experiment on the subject showing how respiratory droplets that could carry the virus spread while people wore a face shield and a face mask with exhale valves compared to how droplets spread from a traditional mask. College and high-school students and children in elementary schools are returning to classes - sometimes wearing face shields with a cloth mask, and sometimes without one. In California, for instance, the Orange County Health Care Agency, the Orange County Department of Education and school districts across that county, have developed a guide to returning to school. It says face coverings are required for third-graders through high school-level students, and \"strongly encouraged\" for children between two years old and second grade. \"A face shield is an acceptable alternative for children in this cohort who cannot wear them properly,\" the guide states. “ 'No burden of 100% efficacy should be placed on face shields or any containment policy because this level of control is both impossible to achieve.' ” - A commentary published by JAMA Network, an open-access medical journal published by the American Medical Association Vanderbilt University in Nashville, Tenn., among some other colleges, says it's comfortable allowing faculty members inside classrooms to wear a face shield without a mask. But research suggests that may not be enough to prevent a teacher from spreading coronavirus, especially if he/she is asymptomatic or pre-symptomatic. (Vanderbilt did not return request for comment.) To reduce the risk of spreading COVID-19, the disease caused by SARS-CoV-2, it may be preferable to use high-quality cloth or surgical masks that are of a plain design instead of face shields and masks equipped with exhale valves, according to an experiment published Wednesday by Physics of Fluids, a monthly peer-reviewed scientific journal covering fluid dynamics. The journal, which was first established by the American Institute of Physics in 1958, published the study, \"Visualizing droplet dispersal for face shields and masks with exhalation valves,\" to illustrate how shield or mask with a valve affected the movement of droplets compared to wearing a face mask without valves. Their conclusion: It may be preferable to use high-quality cloth or surgical masks with plain design without valves. That's in line with what the U.S. Centers for Disease Control and Prevention has said: it recommends against using masks with valves or vents, because they can \"allow virus particles to escape.\" The CDC also recommends against using N95 respirators or surgical masks intended for healthcare workers. \"We focused on the smaller droplets, since they can stay suspended for very long times and might contain enough virus particles to transmit COVID-19,\" said Siddhartha Verma, one of the paper's authors and an assistant professor at the Department of Ocean and Mechanical Engineering at Florida Atlantic University in Boca Raton, Fla. \"Even the very best masks have some degree of leakage.\" Watch the video here. In the experiment, face shields blocked the initial forward motion of a simulated jet of a cough or a sneeze, but the expelled droplets moved around the visor with relative ease and spread out over a large area, the experiment concluded. The experiment also suggested that droplets can pass through a mask's exhale valve unfiltered, \"which significantly reduces its effectiveness as a means of source control.\" This experiment published by Physics of Fluids, a peer-reviewed scientific journal, looks at droplet spread from face shields and face masks with exhale valves, and compares them to those of traditional cloth face masks. (Image courtesy of: Siddhartha Verma, Manhar Dhanak and John Frankenfield) \"As students return to schools and universities, some have wondered if it is better to use face shields, as they are more comfortable and easier to wear for longer periods of time,\" said Verma. \"But what if these shields are not as effective? You would be essentially putting everyone in a tight space with droplets accumulating over time, which could potentially lead to infections.\" Other universities won't let students on campus without a mask and shield. The U.S. Centers for Disease Control and Prevention does not recommend face shields as a substitute for masks: \"It is not known what level of protection a face shield provides to people nearby from the spray of respiratory droplets from the wearer. There is currently not enough evidence to support the effectiveness of face shields.\" The CDC has reminded people to distinguish between masks, and surgical masks. \"Currently, those are critical supplies that should continue to be reserved for health-care workers and other medical first responders,\" it says. \"Masks also are not appropriate substitutes for them in workplaces where surgical masks or respirators are recommended or required and available.\" “ 'What if these shields are not as effective? You would be essentially putting everyone in a tight space with droplets accumulating over time.' ” - Siddhartha Verma, assistant professor at the Department of Ocean and Mechanical Engineering at Florida Atlantic University While face shields and masks with valves may be more comfortable than cloth masks, the CDC calls for wearing a mask that covers both your nose and your mouth, with the mask secured under your chin. It should fit snugly against your face. There should not be large openings or gaps around your nose, mouth and the sides of your face. Do not touch the mask while wearing it. Some educational institutions are circumspect on the use of face shields. Loma Linda University, a Seventh-day Adventist health-sciences university in California, advises the wearing of face masks as the No. 1 protection against COVID-19. \"Prolonged exposure reduces the amount of protection of the shield,\" according to this advice from the university's health and wellness team. Vanderbilt University's Public Health Advisory Task Force, in a statement on the college's website, cited a \"preliminary study\" as offering sufficient evidence for the efficacy of face shields \"in the way Vanderbilt intends to use them, which is coupled with other protective measures (social distancing, less density with classrooms, students wearing face masks/coverings, etc.).\" However, that preliminary study is actually \"viewpoint\" commentary on face shields that cites other pieces of research on face shields and the influenza virus, which is obviously different from coronaviruses. Nor does the commentary in question published by the JAMA Network offer up enough scientific evidence to show face shields are adequate. In fact, the \"viewpoint\" concludes: \"It is unlikely that a randomized trial of face shields could be completed in time to verify efficacy. No burden of 100% efficacy should be placed on face shields or any containment policy because this level of control is both impossible to achieve and unnecessary to drive SARS-CoV-2 infection levels into a manageable range.\" COVID-19 has now killed at least 889,213 people worldwide, and 188,941 in the U.S., Johns Hopkins University says. As of Labor Day, the U.S. still has the world's highest number of COVID-19 cases (6,277,847). Worldwide, there has been at least 27,137,624 confirmed cases, which mostly does not account for asymptomatic cases. AstraZeneca AZN, +1.16%  , in combination with Oxford University; BioNTech SE BNTX, +1.23%  and partner Pfizer PFE, -0.27% ; GlaxoSmithKline GSK, +1.10% ; Johnson & Johnson JNJ, +1.39% ; Merck & Co. MERK, +1.59% ; Moderna MRNA, +0.09% ; and Sanofi SAN, -1.48%  are among those currently working toward COVID-19 vaccines. The Dow Jones Industrial Index DJIA, +0.56%, the S&P 500 SPX, +0.87%  and the Nasdaq Composite COMP, +1.39% were lower Friday. Doubts about traction for further fiscal stimulus from Washington may be one factor discouraging investors who have been betting on Republicans and Democrats striking a deal to offer additional relief to consumers and businesses."}]}