{"article": [{"url": "https://www.marketwatch.com/story/read-this-before-scheduling-that-elective-surgery-in-the-near-future-2020-06-15", "published": 1592370440.0, "headline": "Read this before scheduling that elective surgery in the near future", "body": "This article is reprinted by permission from NextAvenue.org. It is part of The Coronavirus Outbreak: What You Need To Know Special Report. For the past few years, Linda Rohn, 72, of Simi Valley, Calif., has known that she needed to have a total knee replacement for her arthritic right knee. But as her pain got worse, the coronavirus pandemic hit. Elective surgeries like hers were postponed as hospitals made room for COVID-19 patients and transferred many doctors to the front lines. Like a lot of other patients, Rohn put the surgery on her to-do list for later. Now, as states begin to open up in the new phase of the pandemic, elective surgeries are possible again, with ramped up precautions in place for safety. Still, the decision to go forward with surgery isn’t simple, as Rohn knows. A few weeks ago, Rohn’s surgeon offered her a surgery date in early June. “Too soon,” she told him. Then, she went to work, researching what the best course for her might be, talking to her surgeon and her physical therapist. This approach by Rohn is the ideal one, according to two surgeons. “Now, as we start thinking about how we come back online [with elective surgeries], it is really an individual decision,” says Dr. Patricia L. Turner, director of the division of member services for the American College of Surgeons. Turner says one of the first factors to consider is the type of surgery needed. A procedure for a cancer, for instance, rightfully gets more precedence than a cosmetic procedure such as an eyelid lift. One patient who needs orthopedic surgery may be trying mainly to improve a golf game, while another may be in too much pain to walk, even after taking anti-inflammatory medicine. Turner’s definition of elective? “It means you have the luxury of scheduling it sometime in the future,” she says. “That doesn’t mean elective surgeries aren’t important or don’t need to be done.” Where you live also affects the decision to have an elective surgery, as well as its timing, says Dr. Richard L. Whelan, system chief of colorectal surgery and colorectal cancer at Northwell Health, based at Lenox Hill Hospital in hard-hit New York City. His hospital has a lengthy backlog for some surgeries, so not everyone can be scheduled immediately.Surgeons set precautions In a joint statement, the American College of Surgeons, the American Society of Anesthesiologists, the Association of Perioperative Registered Nurses and the American Hospital Association released guidance on the resumption of elective surgery. In addition, state departments of health have issued specific guidance on when their state health care providers are allowed to resume elective procedures. Among the main points of the guidance — which is not mandatory, but simply suggested: Timing: Sustained decline in COVID-19 cases in the community should be ongoing for at least 14 days. Testing: The facility should have capabilities of testing for COVID-19 for staff and patients — not only before surgery for you as a patient, but also post-op, in case of COVID-19-like symptoms. PPE: Supplies of personal protective equipment must be in place and adequate.What can patients expect? As a patient, expect to be screened for any COVID-19 symptoms and possibly given a swab test to detect the coronavirus infection, or even two such tests, with an interval in between, to be sure you are not infected. If you have any COVID-19-like symptoms after the surgery, you may be given another coronavirus test. Because there may be a large backlog of patients hoping to schedule the postponed surgery, you may be offered an evening surgery time — or even a weekend. Also see: Is it safe to see your doctor or dentist again? Your surgeon may spend more time talking with you than usual before the procedure, aware that you may have more questions and heightened anxiety.What should patients ask? Among the questions worth asking your surgeon, say Whelan and Turner: Do you have adequate personal protective equipment (PPE)? Could we do telemedicine visits for some of the before- and-after visits that are needed? May I have a family member or other loved one with me for the surgery? Do I need to stay overnight? (If this is a major procedure, and you have coexisting conditions such as diabetes, high blood pressure or heart issues, you may need to be hospitalized, Turner says.) Will I be on the same floor as COVID-19 patients? (“They should have COVID patients separate,” Whelan says. Depending on where you live, your hospital may have very few COVID-19 patients or none.) The new normal “One of the many things patients are noticing that is different is the ability to have family and friends with them every step of the way,” Turner says. This, unfortunately, may not be possible for elective surgeries these days. For instance, Turner is used to speaking to a family member out in the waiting room, right after the surgery. And some family members choose to sleep in a reclining chair in a loved one’s hospital room. “That is helpful and often calming,” she says. “We can’t do that now.” Elective-surgery patients are also not used to seeing people all over the hospital wearing masks, Turner says, from the greeter at the front door to the lab person drawing blood to the cafeteria workers — nor to wearing one themselves. “Depending on where you live, wearing of masks may be more common or less common,” notes Turner. Don’t miss: Now I totally get why my father was so frugal And there’s an elective-surgery backlog, so you may need to be patient. At Whelan’s hospital, he estimates up to 800 patients may be waiting on general surgery procedures, just one segment of the waiting list.Rohn’s decision Linda Rohn did her research about her knee surgery and spoke extensively with her surgeon. She scheduled her procedure for late June, will stay overnight and feels at peace with her decision. Her surgeon has reassured her about safety precautions. The hospital where Rohn will go has only had three COVID-19 patients, he told her. Also see: How Iceland flattened the curve “I’ve been suffering with this for two years,” she says of her knee pain. As for the COVID-19 pandemic, Rohn says, ”it’s going to get better or there might be another spike.” When she made the decision, the coronavirus rates were declining. And she thought: “If I don’t do it now, who knows what the future will bring?” On the other hand, Whelan says he understands those who want to wait a bit. “A lot won’t come in [right away],” he says. “They’ll say, ‘No, no, I’m going to live with this hemorrhoid for a while.’” Kathleen Doheny is a Los Angeles-based freelance journalist who writes about health and lifestyle topics. She is a brand-new Mimi of a beautiful baby girl. This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}