{"article": [{"url": "https://www.marketwatch.com/story/have-you-herd-new-york-might-have-immunitybut-please-dont-count-on-it-the-mayor-pleads-2020-08-21", "published": 1598089040.0, "headline": "Have you 'herd'? New York might have immunity-but please don't count on it, the mayor pleads", "body": "Herd immunity. The term conjures up visions of open prairies and animals on the hoof. But all of a sudden, one research scientist is asking: Could certain densely packed New York City neighborhoods have already achieved herd immunity against the deadly coronavirus? It's far from proven, but it's not quite as far-fetched as it sounds. And there might even be some rough justice lurking in here somewhere. The biggest beneficiaries of herd immunity, if it's actually happening, would be poorer and especially immigrant neighborhoods, the very communities hit hardest by the virus so far. “ \"...I want to note that we don't have proof of it, and we should just work off of an abundance of caution, not rest on that laurel, if you will.\" ” - New York City Mayor Bill de Blasio When herd immunity takes hold, so many infected people have already developed antibodies that the disease just peters out. The petering-out part would be fabulous. The getting-there part? Not so much. Up till now, herd immunity has not won much respect in the global fight against the novel coronavirus. Sweden moved in that direction this spring and quickly got the highest infection rate in Scandinavia. British Prime Minister Boris Johnson was a proponent until he contracted COVID-19 and nearly died. And Wednesday on Staten Island, Mayor Bill de Blasio threw cold water on the whole idea of herd immunity in New York. \"Something has gotten around out there,\" the mayor said, \"sort of folk wisdom in some communities. But I want to note that we don't have proof of it, and we should just work off of an abundance of caution, not rest on that laurel, if you will.\" Added de Blasio: \"I think we're nowhere near that point from what we know and understand.\" But in fact it's data from the mayor's own Health Department that has reinvigorated the herd immunity discussion in New York, along with a provocative interview on a brainy British website that, yes, went viral. First the interview. Sunetra Gupta, a theoretical epidemiologist at Oxford University, spoke with Reaction.life, a London-based journal of news and commentary edited by former Scotsman and Wall Street Journal executive Iain Martin. In the interview, Gupta argued that coronavirus antibody rates are so high in some neighborhoods of London and New York that parts of those cities may have already achieved herd immunity. \"A large swath of the population has been exposed,\" she said. \"Some have become immune, and therefore exhibit antibodiesâ\u0080¦And some were resistant to start with.\" However they got their protection, this could be a life saver should another wave of the virus hit this fall. Said Gupta: \"Under those circumstances, no, we shouldn't see a huge surge in infections in those regions like London and New York where we've had a major incidence of infection and death.\" Call it much-deserved payback for March and April, when things got really bad around here. But not evenly bad, according to a fresh data dump from the New York City health department. Coronavirus tally: U.S. daily death toll tops 1,000 for 3rd-straight day The department has just released 1.5 million coronavirus antibody test results, a far larger sample than had been made public before. The clear trend: Lower-income neighborhoods, especially those with large immigrant populations, have far more antibodies than richer ones. That makes sense because so many of those people worked right through the plague. Unlike a lot of wealthy New Yorkers, they weren't hiding in the Hamptons or the Hudson Valley for the last six months. Citywide, the positive rate was 27%. Of the five boroughs, the Bronx was highest, 33%. Manhattan was lowest at 19%. But that doesn't fully reveal the disparities. In Corona, Queens - a neighborhood packed with Spanish-speaking immigrants, many of whom have been working all year - 51% of those tested had antibodies for coronavirus. South of 96th Street in Manhattan, not a single ZIP Code topped 20%. Depending how contagious an infection is, usually 70% to 90% of a population needs immunity to achieve herd immunity, according to Johns Hopkins School of Public Health. At one clinic in Corona, 68% of the antibody tests came back positive. In upscale Cobble Hill, Brooklyn, it was 13%. So what does all this mean? Well, for one thing, if there is any herd immunity, those with the most infection would likely get the most protection. Finally, some good news for Corona at the expense of Tribeca and the Upper East Side. And second, whatever immunity might be out there, it's still almost certainly a good idea to keep doing all the things that helped New York beat back the raging virus this spring. Also see: Is it the last dance? The murky future of NYC's nightlife business That's the plea being made by the mayor's public health adviser, Dr. Jay Varma. He's still in the wear-a-mask-and-wash-your-hands school of medicine. \"From our perspective,\" he said, \"the only way to continue to keep infections low, like we have right now, is to focus on all the things we're doing - face coverings, social distancing, limits on gatherings, good hygiene - and it may very well be that there is some percentage of the population that is currently immune that's also helping keep our infection rates low. But I don't think that we should be complacent and rest upon that until we know more.\" Ellis Henican is an author based in New York City and a former newspaper columnist."}]}