{"article": [{"url": "https://www.marketwatch.com/story/bill-gates-the-worst-of-the-pandemic-is-yet-to-come-and-freedom-played-a-part-in-the-disappointing-us-response-2020-08-20", "published": 1598086880.0, "headline": "Bill Gates: Millions more will die in this pandemic, and 'freedom' hinders the disappointing U.S. response", "body": "Almost 800,000 people around the world have already died from COVID-19, according to the latest tally from Johns Hopkins University and Microsoft MSFT, +2.48%  co-founder Bill Gates predicts that \"the worst is still ahead\" and the death toll will ultimately rise by millions. Emerging markets, where health-care systems and economies are already struggling, is where the pain will be most pronounced, he explained in a recent interview in the Economist. But the U.S. is dealing with its own unique set of issues, as politics and conspiracy theories have contributed to what he said has been a disappointing response. Why? In the name of freedom. “ 'We believe in freedom, individual freedom. We optimize for individual rights.' ” According to Gates, Trump supporters have wielded \"freedom\" to make a political statement that continues to complicate the U.S. response to the pandemic. Refusing to wear a mask, for instance, is one way for them to signal their anger and resistance. Read: No mask? This video might change your mind Will that change if Joe Biden wins the presidency? Don't count on it. \"I don't think a change in administrations will get people to wear masks,\" Gates said. \"It's hard to see how we build that trust network and improved behavior. It'll mostly be incremental.\" Read:The 'Oligarchic Dozen' just reached a 'disturbing milestone' It's more than that, though. Gates explained that the U.S. was unprepared from the beginning, as testing efforts were slow to make an impact once the virus began to spread. China, on the other hand, \"did a very good job of suppressing the virus,\" thanks, in part, to the \"typical, fairly authoritarian\" approach and the \"individual rights that were violated,\" he said. The good news is that Gates is looking for the pandemic to pass by the end of 2021, as a reasonably effective vaccine should be in mass production by then. Of all the candidates, he said that he believes AstraZeneca AZN, +1.16% is the furthest along. Watch the full 42-minute interview, which was posted on Wednesday: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } -"}]}