{"article": [{"url": "https://www.marketwatch.com/story/why-the-dow-is-plunging-ginsburg-replacement-battle-covid-19-and-everything-else-11600708678", "published": 1600707560.0, "headline": "Why the Dow dived: Ginsburg replacement battle amplifies election jitters, uncertainty over stimulus", "body": "Election jitters are on the rise. AP Wait, aren’t stocks supposed to “climb a wall of worry?” That old Wall Street cliché about bull markets wasn’t in evidence Monday as the Dow Jones Industrial Average DJIA, +0.56% plunged more than 950 points at its session low and the S&P 500 SPX, +0.87% neared correction territory. But worries were plentiful. Read: Monday’s stock-market selloff sets up worst September in 18 years They include: A rising number of COVID-19 infections that threaten to force renewed lockdowns of major European economies. A blow to banking stocks from news reports alleging that many of the world’s most powerful banks looked the other way for years when dealing with suspected money launderers and other shady customers. And last, but not least, the prospect of an ugly political battle over a replacement for Supreme Court Associate Justice Ruth Bader Ginsburg, who died Friday at 87. Opinion: Global banks hit by new corruption allegations — why authorities are unlikely to act this time: For U.S. markets, the perhaps most jarring development was the addition of a battle over the Supreme Court in the run-up to what what already was shaping up potentially to be the most divisive presidential election in generations. While the nation still mourned the death of Ginsburg, battle lines quickly formed. President Donald Trump said he would announce a nominee on Friday or Saturday, while Democrats contend the winner of the Nov. 3 election should choose the nominee after the Republican-led Senate in 2016 used that rationale to block a nomination by Barack Obama following the death of Associate Justice Antonin Scalia. Already, investors were preparing for the possibility of a contested election result. The looming fight over the composition of the Supreme Court “makes the U.S. election even more important and heated than it already was — and harder to call,” said Michael Every, global strategist at Rabobank, in a note. The battle makes all other topics secondary, he said. That’s a mixed bag for both Trump and Democratic challenger Joe Biden as it moves the spotlight off the economy (bad news for Trump) and the administration’s handling of the pandemic (bad news for Biden), he said. Analysts also widely expected the debate to further reduce prospects that lawmakers and the White House would be able to reach a deal on a new round of coronavirus aid as the economy shows signs of slowing. See: Analysts worry Ginsburg replacement fight will take Congress’ eye off ball of fiscal aid Analysts led by Michael Wilson at Morgan Stanley, in a Monday note, said the market faces two distinct outcomes: Either Congress fails to pass the CARES 2 bill and the recovery stalls or Congress does pass the bill, which is good for the stock market, but bad for the long end of the bond market. Opinion: Here’s what has to happen for Trump and Mitch McConnell to seat a new Supreme Court justice before Election Day Ginsburg’s death “adds another element of risk to the timing of the outcome, and could weigh on the market overall in the near term,” they wrote. And then there’s the general anxiety level surrounding the election and what some commentators fear could be a slide toward more conflict and even the potential for a constitutional crisis in the event of a contested election outcome. Election: Democrats score Ginsburg-related surge in donations, after Biden topped Trump last month in cash on hand “This election was already seen as a potential risk event; arguably far more so now,” Every wrote."}]}