{"article": [{"url": "https://www.marketwatch.com/story/target-talks-christmas-in-july-with-holiday-shopping-announcement-2020-07-27", "published": 1595925560.0, "headline": "Target talks Christmas in July with holiday shopping announcement", "body": "Target Corp. is already talking about the holidays, announcing plans to launch holiday season deals in October. Like Walmart Inc. WMT, +1.00% , Target TGT, +1.14% says stores will be closed on Thanksgiving Day. And Target will be making 20,000 more items, including groceries, available through its pickup and order delivery services. Target is getting a jump in a year when experts say the holiday shopping season will be pulled forward, thanks in part to a later Prime Day event. Prime Day, the Amazon.com Inc. AMZN, +3.01% two-day shopping event, usually takes place in the summer but is expected this year to take place in the fall. Coresight Research data shows that 48% of shoppers expect to spend less this holiday season. And 28% say they’re going to start their shopping earlier than usual. See: Walmart, CVS, Lowe’s among the retailers requiring face coverings One area where consumers expect to cut spending is on restaurants, bars and nightclubs. Two-thirds say spending on travel to visit others will also be reduced. We’re still in what is usually the back-to-school shopping season. Wedbush Managing Director Michael Pachter has already forecast a back-to-school dud, with many school districts still working out the details about how – or if – students will return to classrooms for the new semester. With much still up in the air, parents have held off on buying supplies and other school gear. Read: The back-to-school shopping season will be a ‘dud’ on analyst says, but the NRF is forecasting a record breaker According to Numerator’s Back-to-School Index, only 78% of households expect to buy back-to-school supplies this year versus 94% in 2019. The National Retail Federation, on the other hand, forecasts a tremendous back-to-school selling season, thanks to increased purchases of computers and other technology for remote learning. The coronavirus pandemic has shifted what is part of the school supply category, with face masks, blue light glasses due to increased screen time, and hygiene technology and fabrications as big trends to watch, according to retail market data and technology company Edited. “Promoting merchandise that can be worn in both the classroom or at home has been the overarching theme, with retailers such as Gap, Macy’s and Dick’s Sporting Goods tailoring emails that speak to parents sending their kids back to school or carrying on with online learning,” Edited wrote in a report. Edited notes that Amazon hosted a “Big Style Sale” in July that drove a more promotional apparel landscape, although discounts aren’t as deep as they were last year as retailers try to preserve margins. Target stock is down 4.3% for the year to date while the SPDR S&P Retail ETF XRT, +0.05% is up 1.4% and the S&P 500 index SPX, +0.87% has edged up 0.3%."}]}