{"article": [{"url": "https://www.marketwatch.com/story/some-tech-workers-are-slowly-trickling-back-to-the-office-this-month-2020-06-04", "published": 1592203880.0, "headline": "Some tech workers are slowly trickling back to the office now", "body": "It’s back to the office for some tech employees this month. Apple Inc. AAPL, +1.74% and Juniper Networks Inc. JNPR, +0.08% , for example, are allowing small pools of employees to return in what is expected to be a series of gradual phases, though companies are reluctant to talk. (Apple is reopening more stores, though the company temporarily closed some around the country in the wake of widespread protests and looting.) Google parent Alphabet Inc. GOOGL, +1.82% GOOG, +1.97% , meanwhile, is giving pockets of workers the option of using the office, beginning July 6, CEO Sundar Pichai said in a note to employees last week. Select engineers and other workers began trickling back to Apple Park in Cupertino, Calif., in May, with the option of a nasal-swab test for COVID-19; requirements to wear masks and take temperature checks; limited weekly schedules onsite; and closed kitchens, according to a report by Bloomberg on Friday. Juniper is taking a measured approach. “As of June 1, we have moved to the next phase of occupancy in our offices in California and Massachusetts (and many other locations around the world) by allowing up to 20% of workers to voluntarily return for short-term tasks or those tasks that cannot be carried out effectively from home,” Brad Minnis, vice president of environmental health & safety at Juniper, said in a statement to MarketWatch. “We have implemented significant safety arrangements to prevent exposure to COVID-19 in our offices and are practicing strict physical distancing in compliance with local regulations, CDC, OSHA and our own guidelines.” The Sunnyvale, Calif.-based provider of critical internet infrastructure equipment has maintained about 5% of its staff onsite to support customers, as well as maintain IT and other critical systems and applications, he added. “Our process is incredibly gradual,” Appian Corp. APPN, +5.49% CEO Matt Calkins told MarketWatch in a phone interview Monday. His McLean, Va.-based business-software company is easing back 10% of its 1,000 employees to offices worldwide, including Virginia in mid-June. “The return is small so we can learn about restrictions, like bottlenecks on elevators, and keeping people safe.” Company software is being used to ensure employees are properly spaced at work. See also: Google plans to begin reopening of some offices on July 6 Slowly, Americans are migrating back to a very different world — offices designed to accommodate social distancing, staggered schedules, temperature checks, daily deep cleanings, contact tracing and potential testing. On Monday, Santa Clara County (Calif.) announced the reopening of manufacturing operations in the heart of Silicon Valley, a key economic engine of the region. Manufacturing accounted for 172,400 jobs in Santa Clara County as of April, or more than 15% of all civilian jobs. Last week, MGM Resorts International MGM, -2.59% and Wynn Resorts Ltd. WYNN, -2.22% said they are reopening their Las Vegas properties on June 4. Disney’s DIS, +1.53% Walt Disney World in Orlando, Fla., is expected to open in mid-July. Some NBA players are expected to go back to their teams as early as this week as the league preps for a return to the hardwood on July 31. Some Lucasfilm Ltd. employees trickled back to work Monday. Assembly workers at Tesla Inc. TSLA, +1.89% are already back at its Fremont, Calif., facility. Overstock.com Inc. OSTK, +1.21% may allow a “very limited stage of reentry” at its Salt Lake City headquarters as soon as June 15. “This first stage would only be for those that feel it necessary to return to work due to difficulties working from home and who have received approval to do so,” Overstock CEO Jonathan Johnson told MarketWatch in an email. See also: Elon Musk vs. Bay Area officials: These emails show what happened behind the scenes in the Tesla factory fight Their return comes at a time when most tech employers are in no hurry to uproot their work-from-home workforces. Employees at Facebook Inc. FB, +0.26% , Alphabet GOOGL, +1.82% GOOG, +1.97% , Hewlett Packard Enterprise Co. HPE, -1.80% , Visa Inc. VISA, +0.90% , Discover Financial Services DFS, -0.79% and others have the option of working at home through 2020. Twitter Inc. TWTR, -0.23% is making the move for all workers permanent. Indeed, tech is the industry least likely to go back to the office. Data compiled by S&P Global Market Intelligence reveals that 45% of software and IT services employees are likely to continue to work from home, compared to just 31% for health-care workers and 28% in manufacturing jobs. “This is sort of like a traffic jam. You slow down, and then gradually regain speed,” VMware Inc. VMW, +0.81% Chief Operating Officer Sanjay Poonen told MarketWatch in a phone interview, highlighting the ambiguity many companies face as they comply with guidance from state and local health officials. The company plans to bring back essential workers to its Palo Alto, Calif., headquarter by the end of June. Employees returning to the office face uncertainty, but many may choose to return after months of working at home with children or alone in a cramped apartment. Nearly a quarter of businesses in the Western U.S. say they have partially reopened, according to a poll of 186 companies in California, Oregon, Washington, Nevada and Colorado by international law firm Seyfarth Shaw LLP. The impact to the commercial real estate market will be “seismic,” Tony Cho, CEO of Metro 1, a Miami-based real estate company, told MarketWatch. “The winners will be brokerages that can pivot and adapt to the new reality post-COVID, offering clients smaller, more affordable spaces in less urban-dense areas, and who can get creative with their lease structures,” Cho said. Slack Technologies Inc. WORK, +3.36% CEO Stewart Butterfield is one of a handful of tech leaders who have advocated the use of “hoteling,” a concept where a desk in a large open space within an office is assigned temporarily for work, as if one would buy a hotel room for the night. As municipalities across the U.S. begin to ease stay-at-home restrictions and slowly reopen their economies, businesses of all types are dramatically reconsidering their existing floor plans and layouts for staff and customers to comply with social-distancing guidance by state and county restrictions. Companies ranging from Kroger Co. KR, +0.46% to Discover Financial Services and Blue Shield of California shared their ideas with MarketWatch, although several tech companies including Apple, Amazon, Facebook and Oracle Corp. ORCL, +0.42% did not respond to email queries about bringing employees back onsite. Some of those that did respond offered a pat response, such as Nvidia Corp. NVDA, -0.54% : “We will reopen when we are confident it is safe. In the meantime, we are enhancing sites for a safe return, learning best-known methods from others, and monitoring the guidance of health officials,” CEO Jensen Huang said in a note to employees on May 19. See also: Companies reveal their plans for what work will look like when America returns to the office “Companies need to show employees through their floor plans that their offices are safe,” Brian Cross, director of professional services at Esri, a maker of location-mapping software and geographic-information system software that is used by the World Health Organization and Johns Hopkins to track the spread of COVID-19, told MarketWatch in a phone interview last Thursday. Esri is also working with government agencies and a dozen Fortune 500 companies in fields such as tech and energy to help them create new, safer office spaces. Its customers already include Exxon Mobil Corp. XOM, -1.47% . Through this technology, organizations can map and analyze existing floor plans and traffic flows to determine how spaces should be redesigned. POPin, maker of an anonymous crowdsourcing app, said some of its customers — who include Ford Motor Co. F, -1.36% and Chick-fil-A — are using the app to let employees voice their concerns over returning to the office. The biggest worry? Social distancing at desks, meeting rooms, break rooms, the bathroom and elevators, according to Chris Jackson, vice president of customer success at POPin. Across the world, in Israel, SysAid Technologies on Tuesday introduced an app called Worksafe that lets employees self-report their health status online. “People want to return safely to work,” Jade Kahn, vice president of marketing at SysAid, told MarketWatch in a phone interview Monday."}]}