{"article": [{"url": "https://www.marketwatch.com/story/how-a-foreclosure-can-affect-your-tax-bill-2020-08-25", "published": 1598335760.0, "headline": "How a foreclosure can affect your tax bill", "body": "Despite the COVID-19 crisis, residential real estate prices are still stable or rising in many areas. Even so, COVID-19-caused financial stress may cause some homeowners to be unable to make their mortgage payments. This column explains the federal income tax consequences if the lender forecloses. As you will see, those tax consequences can range from pretty bad to harmless. Here’s the what you need to know, after first covering some necessary background information. Key point: Federal and state COVID-19 relief measures may temporarily postpone lender foreclosure actions in some situations. And some lenders may voluntarily postpone foreclosure actions. However, unless homeowners can regain the ability to make their mortgage payments, foreclosures will eventually happen. Foreclosure basics A foreclosure occurs when a mortgage borrower defaults and the lender seizes the mortgaged property in order to sell it before things get worse. More than one mortgage When there are several mortgages against a property, any of the lenders can potentially initiate foreclosure proceedings. However, first mortgage lenders generally must be paid in full before second mortgage lenders can collect anything. Recourse vs. nonrecourse mortgage A foreclosure transaction is not necessarily the end of the story if your mortgage is a recourse loan, because the lender can pursue you for any negative difference (deficiency) between the foreclosure sale proceeds and the loan balance plus foreclosure costs. In contrast, with a nonrecourse mortgage, the lender’s only remedy is to take the property and sell it. If there’s a deficiency, the lender cannot go after the borrower. Tax treatment of principal residence foreclosures The two most important variables in determining the federal income tax consequences of a principal residence foreclosure are: (1) whether the mortgage is recourse or nonrecourse and (2) the value of the property in comparison to the mortgage balance. Recourse mortgage: property worth less than loan balance When the property’s fair market value (FMV) is less than the recourse mortgage balance (the most-common situation), the federal income tax rules treat the foreclosure as a sale of the property for the FMV amount. So, the foreclosure triggers a tax gain if the FMV of the home exceeds its basis (basis usually equals the purchase price plus the cost of improvements). However, the gain will often be federal-income-tax-free thanks to the principal residence gain exclusion break. That break allows unmarried homeowners to exclude (pay no tax on) gains of up to $250,000. Married joint-filing couples can exclude gains of up to $500,000. To qualify for the gain exclusion break, you generally must have: (1) owned the home for at least two years during the five-year period ending on the foreclosure date and (2) used the home as your principal residence for at least two years during that five-year period. If the basis of a principal residence exceeds FMV, the foreclosure transaction will trigger a nondeductible loss. If the lender then forgives part of all of the deficiency (the difference between the recourse mortgage debt and the foreclosure sales proceeds), the forgiven amount constitutes cancellation of debt (COD) income for federal income tax purposes. Any COD income must be reported as income on your Form 1040 for the year the debt forgiveness occurs, unless you qualify for a tax-law exception. (See below for more details.) Recourse mortgage: property worth more than loan balance When the property’s FMV exceeds the recourse loan balance (the less-common situation), the foreclosure is treated for federal income tax purposes as a sale of the property for a price equal to the loan balance plus any additional proceeds received by the borrower from the foreclosure sale. Nonrecourse mortgage A foreclosure by a nonrecourse lender is treated for federal income tax purposes as a sale of the property to the lender for an amount equal to the nonrecourse mortgage balance. The property’s FMV is irrelevant, and the lender cannot pursue the borrower for any deficiency. There’s never any debt forgiveness, because the taking of the property in foreclosure is deemed to completely satisfy the nonrecourse loan. Therefore, there is no possibility of taxable cancellation of debt (COD) income with a nonrecourse mortgage foreclosure. However, there will be a tax gain or loss from the deemed sale to the lender. A tax gain occurs if the nonrecourse loan balance exceeds the property’s basis (usually the original purchase price plus the cost of any improvements). With a principal residence, the gain will often be federal-income-tax-free thanks to the gain exclusion break. It allows an unmarried person to exclude (pay no tax on) a principal residence gain of up to $250,000; a married joint-filing couple can exclude up to $500,000. To qualify, you generally must have: (1) owned the home for at least two years during the five-year period ending on the foreclosure date and (2) used the home as your principal residence for at least two years during that five-year period. If the property’s basis exceeds the nonrecourse loan balance, the foreclosure triggers a nondeductible loss. Summary for recourse mortgage foreclosures The single most important thing to understand about a recourse mortgage foreclosure is that the lender can come after you for any deficiency that remains after the foreclosure sale. It can take many months or even several years for a lender to decide whether to pursue you for the full deficiency, forgive part of it, or forgive the whole thing. Tax-wise, the most important thing to understand is that a principal residence recourse mortgage foreclosure can result in a gain and maybe some COD income too. Thankfully, any gain will often be federal-income-tax-free thanks to the principal residence gain exclusion break (state income tax results may vary). Some or all of any COD income may also be tax-free thanks to beneficial tax-law exceptions (see below for more information). When no exception applies, COD income must be reported as income on your Form 1040 for the year the debt forgiveness occurs.Summary for nonrecourse mortgage foreclosures With a nonrecourse mortgage, the single most important thing to understand is that the lender cannot come after you for any deficiency after the foreclosure sale. Tax-wise, the most important thing to understand is that a principal residence nonrecourse mortgage foreclosure can result in a gain. Thankfully, the gain will often be federal-income-tax-free thanks to the principal residence gain exclusion break. State income tax results may be different. The bottom line COVID-19-caused financial distress will probably result in a greater number of principal residence foreclosures, even while real estate prices are still stable or rising in many areas. 3 exceptions that can make forgiven recourse mortgage debt federal-income-tax free The general federal income tax rule is that any cancellation of debt (COD) from a forgiven principal residence recourse mortgage must be reported as income on the borrower’s Form 1040 for the year the debt forgiveness occurs. However, our beloved Internal Revenue Code provides several exceptions to that general rule. Here are the three most important exceptions in the context of forgiven principal residence recourse mortgage debts. Principal residence exception: Through 2020, COD income from up to $2 million of forgiven principal residence acquisition debt is federal-income-tax-free. However, this exception does not apply to a second mortgage or HELOC if the loan proceeds are not used to acquire or improve your principal residence. It remains to be seen if this potentially valuable break will be extended beyond the end of this year, but that seems almost certain to happen. Bankruptcy exception: If mortgage debt is forgiven in Title 11 bankruptcy proceedings, the resulting COD income is federal-income-tax-free. Insolvency exception: If the borrower is insolvent (debts in excess of assets) when the mortgage debt forgiveness occurs, the resulting COD income is federal-income-tax-free as long as the borrower is still insolvent after the debt forgiveness. If the debt forgiveness causes the borrower to become solvent, the resulting COD income is taxable to the extent the debt forgiveness causes solvency."}]}