{"article": [{"url": "https://www.marketwatch.com/story/the-covid-19-grind-seems-unbearable-but-its-not-forever-2020-10-05", "published": 1601904200.0, "headline": "The COVID-19 grind seems unbearable â\u0080\u0094 but itâ\u0080\u0099s not forever", "body": "When will life be â\u0080\u009cnormalâ\u0080\u009d again? Will it ever? 80% of older Americans can't afford to retire - COVID-19 isn't helping These are reasonable questions considering the impact that the pandemic has had on virtually everyone on the planet. Many have died, many more are sick, and millions are out of work or underemployed. Read our coronavirus update Broadly, the economy seems to be finding a footing here and there, even as markets wobble. Washington is wrapped up in the drama of a rapidly nearing Election Day, but for most Americans the reality of daily life is get up, try to work, try to keep your kids on task, care for relatives, neighbors and pets â\u0080\u0094 and repeat, seemingly infinitely. While most experts believe that a vaccine will appear early next year, they also believe that it will take time, months or years, for things to get back to normal. Whoever wins the office of president on Nov. 3 will have the same job as our current leaders: Get people back to work and school â\u0080\u0094 safely. Read: Half of Americans over 55 may retire poor Throw in massive fires in the West, more than a few destructive hurricanes and now a political battle royal and itâ\u0080\u0099s hard to focus on how much is going right in our struggle to contain COVID-19: Vaccine progress aside, our understanding of the virus, its treatment and how to protect the most vulnerable among us has only improved since March. Whatâ\u0080\u0099s more, the Federal Reserve seems committed to keeping money cheap, likely for years to come. In that way, itâ\u0080\u0099s reasonable to compare the pandemic to the 2008 housing crisis. Both the housing crash and the pandemic were â\u0080\u009csurpriseâ\u0080\u009d events that at least a few saw coming quite clearly. Famously, some on Wall Street shorted the housing market well ahead of the eventual crash. Epidemiologists have written entire books about the risks of a future global pandemic. It took a long time for us to fully recover from 2008. Yet the markets did recover, year by year, finally surpassing previous highs. The economy roared and unemployment fell sharply. It seems our pandemic recovery will be similar. Barring some other black swan event in the meantime (aliens? an asteroid?) we will get the upper hand on the coronavirus. The economy will strengthen even more than it already has, and stocks will continue to climb. In fact, the dizzying drop in stocks we saw start in mid-February was erased by mid-August, just six months later. Employment will recover. Schools will reopen. So will bars and restaurants and, yes, people will get on cruise ships and once again pack themselves into stadiums. Long-term investors should remind themselves what â\u0080\u009clong termâ\u0080\u009d means: Decades, not days, weeks or months. If you were comfortable with your investments in January, you shouldnâ\u0080\u0099t be questioning those choices now. If you werenâ\u0080\u0099t, then a realistic review of your goals is always in order â\u0080\u0094 pandemic or not."}]}