{"article": [{"url": "https://www.marketwatch.com/story/michael-cohen-is-returned-to-federal-prison-for-violating-terms-of-his-release-2020-07-09", "published": 1594306340.0, "headline": "Michael Cohen is returned to federal prison for violating terms of his release", "body": "NEW YORK (AP) — President Donald Trump’s former personal lawyer and fixer, Michael Cohen, was returned to federal prison, weeks after his early release to serve the remainder of his sentence at home because of the coronavirus pandemic, his attorney Jeffrey Levine told news outlets Thursday. Levine said Cohen had been taken into custody for violating the terms of his release. His return to prison comes days after the New York Post published photos of him and his wife enjoying an outdoor meal with friends at a restaurant near his Manhattan home. Cohen, who pleaded guilty to tax evasion, campaign finance fraud and lying to Congress, had been released May 21 on furlough as part of an attempt to slow the spread of the virus in federal prisons. Cohen, 53, began serving his sentence in May 2019 and had been scheduled to remain in prison until November 2021. Cohen’s convictions were related to crimes including dodging taxes on $4 million in income from his taxi business, lying during congressional testimony about the timing of discussions around an abandoned plan to build a Trump Tower in Russia, and orchestrating payments to two women to keep them from talking publicly about alleged affairs with Trump. Prosecutors said the payments amounted to illegal campaign contributions. Trump, who denied the affairs, said any payments were a personal matter. Cohen was once one of Trump’s closest advisors but became a loud critic after pleading guilty. A federal judge had denied Cohen’s attempt for an early release to home confinement after serving 10 months in prison and said in a May ruling that it “appears to be just another effort to inject himself into the news cycle.” But the Bureau of Prisons can move prisoners to home confinement without a judicial order. Prison advocates and congressional leaders had pressed the Justice Department to release at-risk inmates, arguing that the public health guidance to stay 6 feet (2 meters) away from other people is nearly impossible behind bars. Attorney General William Barr ordered the Bureau of Prisons to increase the use of home confinement and expedite the release of eligible high-risk inmates, beginning at three prisons identified as coronavirus hot spots. Otisville, where Cohen was housed, was not one of those facilities."}]}