{"article": [{"url": "https://www.marketwatch.com/story/amy-coney-barrett-emerges-as-trumps-front-runner-to-fill-ruth-bader-ginsburgs-supreme-court-seat-reports-2020-09-19", "published": 1600529900.0, "headline": "Amy Coney Barrett emerges as Trumpâ\u0080\u0099s front-runner to fill Ruth Bader Ginsburgâ\u0080\u0099s Supreme Court seat: reports", "body": "Judge Amy Coney Barrett of the 7th Circuit Court of Appeals emerged Saturday as President Trumpâ\u0080\u0099s front-running nominee to fill the Supreme Court seat left vacant by the death of Justice Ruth Bader Ginsburg, according to reports. Coney Barrett, who was appointed to her current position in the federal appeals court in Chicago by President Trump in 2017, was named as the likely top pick in early handicapping by three sources talking to NBC News. A separate report from Bloomberg News also listed the 48-year-old judge as the leading contender, although still in a large field. Trump in a tweet Saturday urged the Republican-led Senate to consider â\u0080\u009cwithout delayâ\u0080\u009d his upcoming nomination to fill the Supreme Court vacancy with just six weeks remaining before the election. The White House as of Saturday afternoon had not made any nomination official, nor set a timeline. But the administration was likely moving quickly to select a nominee, the Associated Press reported, before the first presidential debate scheduled for 10 days from Saturday. Senate Majority Leader Mitch McConnell, the Kentucky Republican, vowed on Friday night, just hours after the liberal Bader Ginsburgâ\u0080\u0099s death, to call a vote for Trumpâ\u0080\u0099s upcoming nominee. Democrats countered that Republicans should follow the precedent that GOP legislators set in 2016 by refusing to consider a Supreme Court choice advanced by Barack Obama in the run-up to that yearâ\u0080\u0099s presidential election. The high court had a 5-4 conservative majority prior to Ginsburgâ\u0080\u0099s death. Read:Supreme Court Justice Ruth Bader Ginsburg dies at 87 Earlier this month, Trump released a refreshed potential Supreme Court nominee list with 20 additions to his original roster; it included Republican Sens. Ted Cruz, Tom Cotton and Josh Hawley. Coney Barrett was on the shortlist in 2018 to replace retiring Justice Anthony Kennedy. Trump ultimately selected Brett Kavanaugh for that vacancy. Republicans favoring Coney Barrettâ\u0080\u0099s potential nomination cited her 2017 appeals court confirmation hearing performance as a strong indication that she might survive another round of questioning in which her religious beliefs, and whether they might cloud legal judgment, is likely to emerge, the sources told NBC. Critics have pointed to the judgeâ\u0080\u0099s writings, in which she raised questions about the importance of respecting precedent and referred to â\u0080\u009cunborn victimsâ\u0080\u009d of abortion. At the time of the appeals court hearings, Sen. Dianne Feinstein, the California Democrat, told the nominee, â\u0080\u009cThe dogma lives loudly within you, and thatâ\u0080\u0099s a concern.â\u0080\u009d Barrett responded then: â\u0080\u009cItâ\u0080\u0099s never appropriate for a judge to impose that judgeâ\u0080\u0099s personal convictions, whether they arise from faith or anywhere else, on the law.â\u0080\u009d In a 2013 article in the University of Notre Dameâ\u0080\u0099s quarterly alumni magazine, Coney Barrett is paraphrased as saying the landmark abortion ruling Roe v. Wade â\u0080\u0094 which a majority of Americans back, polls show â\u0080\u0094 has created â\u0080\u009cthrough judicial fiat a framework of abortion on demand.â\u0080\u009d She later said the primary controversy for her lies with public versus private funding. Opinion:Ruth Bader Ginsburg played a pivotal role in the womenâ\u0080\u0099s-rights era â\u0080\u0094 and that was before she joined the Supreme Court Democratic presidential contender Joe Biden, for his part, has not released a list of specific people heâ\u0080\u0099d nominate for a Supreme Court spot if the decision for replacement falls to him should he prevail and a Senate majority shift come November. But Bidenâ\u0080\u0099s promise to nominate a Black woman to the court if he has the opportunity in many ways narrows the field. Biden said in late June that work on his list was underway."}]}