{"article": [{"url": "https://www.marketwatch.com/story/pharma-stocks-fall-with-trump-set-to-sign-executive-orders-targeting-drug-prices-2020-07-24", "published": 1595666840.0, "headline": "Pharma stocks fall as Trump targets drug prices with executive orders", "body": "As President Donald Trump on Friday afternoon said he was signing four executive orders aiming to lower drug prices, pharmaceutical companies’ shares closed with losses. PRICING POLITICS The orders targeting drug prices “may illustrate efforts by the Trump administration to shore up support for a key voter issue with President Trump and other Republicans losing momentum ahead of the election,” said Height Capital Markets analysts in a note Friday. Trump said the first order “will require federal community health centers to pass the giant discounts they receive from drug companies on insulin and EpiPens directly to their patients,” while the second allows some drug importation and the third will take discounts away from middlemen such as pharmacy benefits manager and give them to patients. The fourth order will require that Medicare purchase drugs at the same price as foreign countries pay, Trump said. It “will end global freeloading on the backs of American patients and American seniors,” he said. As a result of the orders, the heads of major drug companies have requested a meeting on Tuesday to discuss how to lower drug prices and out-of-pocket expenses for Americans, the president added. If talks are successful, the administration may not need to implement the fourth executive order, he said. Pharma stocks, as tracked by the Invesco Dynamic Pharmaceuticals ETF PJP, +0.30%, finished 1.6% lower, while the broad S&P 500 index SPX, +0.87% fell just 0.6% Friday. Trump over the years often has stated that drug companies are “getting away with murder” and prices are “out of control,” though this year he has been meeting with pharma execs as their companies work on a coronavirus vaccine. From the archives:Drugmakers’ lobbying spending at 10-year high as Washington targets soaring prices And read:Pelosi’s drug-pricing bill passes House, but pharma stocks are up as it’s unlikely to become law MEDAL FOR RYUN, BARSTOOL SPORTS INTERVIEW Trump on Friday morning awarded the Presidential Medal of Freedom to legendary runner and former Kansas Republican Rep. Jim Ryun. The president has been speaking about the role of sports in the U.S. recovery, and a White House spokeswoman tweeted late Thursday that the he had sat down for an interview on that topic with Barstool Sports founder Dave Portnoy, who recently has gained a following as a day trader. Related:Baseball is back — here’s how U.S. sports leagues are returning during the pandemic Trump on Friday was not slated to conduct a 5 p.m. Eastern Time coronavirus briefing after holding one for three days in a row. He announced at Thursday’s briefing that he was scrapping the Florida component of next month’s Republican National Convention as COVID-19 cases surge in that state."}]}