{"article": [{"url": "https://www.marketwatch.com/story/you-might-use-zoom-for-free-but-companies-are-paying-for-it-pushing-the-stock-to-new-heights-2020-08-31", "published": 1598944400.0, "headline": "You might use Zoom for free, but companies are paying for it - pushing the stock to new heights", "body": "Zoom Video Communications Inc. has become a household name during the coronavirus pandemic, with millions of people using its online-video service for free - but it still needs companies to pay for it in order to survive. On Monday, it proved that is happening - and then some. Zoom ZM, +2.89%  reported another amazing quarter as consumers, schools and all types of businesses continue to use the service while sheltering in place, sending shares up 22% in after-hours trading. While most individuals are using Zoom for free, more companies are signing on for big-money deals. Zoom Chief Executive Eric Yuan touted some major new customers - Exxon Mobil Corp. XOM, -1.47%  and Activision Blizzard Inc. ATVI, +0.52% - during a conference call Monday afternoon. Exxon is using Zoom as its communication platform for its teams, customers and partners around the world, while Activision plans to replace its legacy videoconference products with Zoom. Zoom said that it added 219 customers in the second quarter that spent more than $100,000 each in the trailing 12-month period, its best quarter ever for attracting big-revenue customers. Zoom is approaching 1,000 customers of that size, reaching 988 as of the quarter's end on July 31. Zoom also said that it expanded on its deal with ServiceNow Inc. NOW, +2.43%  , signing the cloud-software company to a deal for Zoom Phone, the company's system to replace legacy PBX systems; with more employees working at home, those PBX systems are often sitting idle while employees use their own phones for work. Zoom expanded that service internationally in the second quarter and launched a hardware-as-a-service offering, which will allow it to sell large corporate clients on more services, and thus drive more sales. \"We continue to see growth in the period from both new customers as well as existing customers, and tremendous opportunity with webinar, especially, as well as Zoom Phone,\" Zoom Chief Financial Officer Kelly Steckelberg told analysts. \"We actually signed our largest Zoom Phone deal to date in Q2. So exciting to see that continued momentum.\" Smaller customers are growing fast at Zoom too, but they could have a more volatile effect on Zoom's financials. Zoom ended the quarter with about 370,000 customers that have 10 employees or more, adding 105,000 of those in the second quarter, and pushing the smaller companies to 36% of Zoom's revenue, up from 30%. But executives admitted that those customers are showing a greater propensity to \"churn\" to other services, and they could more prone to price fluctuations by paying monthly instead of annually. They are also the most obvious targets for Zoom rivals - like Alphabet's Google Meets GOOG, +1.97%  GOOGL, +1.82%  , Microsoft Corp.'s MSFT, +2.48%  Teams and WebEx from Cisco Systems Inc. CSCO, +0.15% - to poach. By locking down more big-money deals, expanding offerings beyond videoconferencing and increasing the base of smaller corporate clients, Zoom continues to prove it is built to be a force even after the pandemic has run its course. Yuan predicted that even though everyone will be working from home for the foreseeable future, the nature of work when people return to the office is going to change dramatically in ways that will still make Zoom an important part of the daily routine. \"If you look at a lot of companies they have a very big [open] space, I think that may not work anymore in the future,\" he said. He also said that employees may shift to two or three days a week in the office, working at home the other days, and there won't be much need for a lot of small offices with few workers. \"It's very, very likely it's hybrid,\" he said. Indeed, as the future of work is likely to be more of the same that many are experiencing now, Zoom is poised to continue to reap the benefits."}]}