{"article": [{"url": "https://www.marketwatch.com/story/goodbye-extra-600-unemployed-workers-should-not-get-benefits-higher-than-their-old-wages-in-next-stimulus-bill-mnuchin-says-2020-07-09", "published": 1594474700.0, "headline": "Goodbye, extra $600: Unemployment benefits wonâ\u0080\u0099t exceed former wages in next stimulus bill, Treasuryâ\u0080\u0099s Mnuchin says", "body": "Treasury Secretary Steven Mnuchin said Thursday that the Trump administration wants to cap enhanced unemployment benefits in the next coronavirus package to make sure workers do not get benefits amounting to more than their former wages. Under the coronavirus bill enacted in March, workers, to encourage compliance with stay-at-home orders, received as much as $600 per week in addition to their regular unemployment benefits, which critics say encouraged the jobless to not look for work. Weekend reads:A breakdown of all the COVID-19 relief programs for consumers â\u0080\u009cYou can assume it will be no more than 100%, so, yes, we want to incent people to go back to work,â\u0080\u009d Mnuchin told the cable channel CNBC. The House has passed legislation that would extend the $600 in extra weekly payments until December. The impact of the so-called enhanced unemployment benefits has been hotly debated among economists recently. Supporters say the add-on has been key in keeping families out of poverty as the jobless rate shot up, noting it typically only goes beyond offsetting a previously earned wage when that wage was very low. Critics claim companies are experiencing difficulty in recruitment, despite a national unemployment rate above 11%. The add-on expires in late July. â\u0080\u009cEnhanced unemployment is intended for people who donâ\u0080\u0099t have jobs, particularly in industries that are harder to rebound, so we will not be doing it in the same way,â\u0080\u009d Mnuchin said. Mnuchin said he that and Mark Meadows, the White House chief of staff, talked with Senate Majority Leader Mitch McConnell on Wednesday and that their goal was to pass the next coronavirus aid bill between July 20 and the end of the month. Mnuchin said the administration wants to see another round of direct payment checks in that next package. â\u0080\u009cWe do support another round of economic impact payments,â\u0080\u009d Mnuchin said, though he added that the level of and criteria for the new payments needed to be determined. See:Pelosi skeptical of limiting new round of virus checks to people making less than $40,000 Two leading economists on Thursday urged the Congress to pass a relief bill larger than $1.5 trillion with benefits that don't expire until the economy is out of danger. U.S. stocks were mixed on Friday with the Dow Jones Industrial Average DJIA, +0.56% Â and the S&P 500 Index SPX, +0.87% posting intraday gains, while the Nasdaq Composite Index COMP, +1.39% was in negative territory. Barronâ\u0080\u0099s on MarketWatch:Wearing a mask will help the U.S. economy grow faster, Fedâ\u0080\u0099s Kaplan says"}]}