{"article": [{"url": "https://www.marketwatch.com/story/warren-buffett-finally-opens-his-wallet-during-the-pandemic-with-nearly-10-billion-purchase-2020-07-06", "published": 1594031720.0, "headline": "Warren Buffett finally opens his wallet during the pandemic, with nearly $10 billion purchase", "body": "Warren Buffett has finally deployed a little bit of his $137 billion war chest. Over the weekend, Berkshire Hathaway Inc. BRK.B, +0.24% BRK.A, +0.06% said it is going to acquire Dominion Energy’s D, -0.34% natural gas transmission and storage business, valued at $9.7 billion including assumed debt. The assets include over 7,700 miles of natural gas transmission lines, with approximately 20.8 billion cubic feet a day of transportation capacity and 900 billion cubic feet of operated natural gas storage. Buffett, the chairman of Berkshire Hathaway, said the firm acquired a “great portfolio” of natural gas assets that also includes a 25% stake in Cove Point, an LNG export, import and storage facility in Maryland. “We are very proud to be adding such a great portfolio of natural gas assets to our already strong energy business.” “Acquiring this portfolio of natural gas assets considerably expands our company’s footprint in several eastern and western states as well as globally, increasing the market reach and diversity of Berkshire Hathaway Energy,” said Bill Fehrman, Berkshire Hathaway Energy’s president and chief executive. Analysts at JPMorgan said the acquired assets had earnings before interest, tax, depreciation and amortization of around $1 billion, calling the price “not the highest we have seen gas pipes transact at.” Berkshire Hathaway had $137 billion in cash at the end of the first quarter. Buffett has been criticized for missing the stock market rally from the March lows. Berkshire’s B-class of shares has dropped 21% this year, compared with the 3% drop for the S&P 500 SPX, +0.87%. The announcement came as Dominion and partner Duke Energy DUK, +0.16% stopped their Atlantic Coast Pipeline project."}]}