{"article": [{"url": "https://www.marketwatch.com/story/twitter-stock-gains-after-strong-user-growth-outweighs-revenue-miss-2020-07-23", "published": 1595500820.0, "headline": "Twitter sees huge surge in user growth but ad business is still feeling the sting from COVID-19", "body": "Shares of Twitter Inc. are up more than 4% in morning trading Thursday after the company fell short of revenue expectations but saw a big surge in user growth. The company saw users engage more with advertisements even as the advertising landscape remained under pressure due to the COVID-19 crisis. Chief Financial Officer Ned Segal said on Twitter’s TWTR, -0.23% earnings call that recent product improvements and the surge in user growth put the company in an “even better position to deliver for advertisers” upon the return of sporting events and other live events that tend to bring people over to Twitter. Read: Snap is ‘executing better than its social media peers’ as it heads into second half of 2020 Twitter’s monetizable daily active users (mDAUs) increased sequentially by 20 million to 186 million for the June quarter, while analysts had been projecting about 172 million. Segal disclosed on Twitter’s earnings call that ad engagements were up 3% from a year earlier during the quarter. Revenue for the quarter slipped to $683 million from $841 million, and came in below the FactSet consensus, which called for $702 million. Twitter generated $365 million of revenue from the U.S. and $319 million from the rest of the world. While Twitter saw a 23% decline in ad revenue, to $562 million, during the period, executives noted that trends improved as the quarter progressed. Ad revenue was down 15% in the last three weeks of the quarter, according to Segal, and he said that Twitter sees “terrific opportunities” to capitalize on the gradual return of live sporting events through sponsorship and advertising now that fans can’t easily congregate in person to talk about games. See also: Here are the major brands that have pulled ads from Facebook Chief Executive Jack Dorsey said that Twitter was still in the “very, very early phases of exploring” ways to charge for certain aspects of the service. “We do think there’s a world where subscription is complementary” to the ad business, he said, though Twitter’s “no. 1 priority” now is rolling out the company’s new Mobile App Promotion product, which allows marketers to advertise for apps on Twitter. Glitches with the product late last year pressured revenue, but Twitter has since made improvements to this advertising feature. Segal didn’t directly answer a question about whether a recent Twitter security breach, which allowed hackers to take over numerous notable accounts, has impacted performance at all in July. “Typically, when we see something like this, we find that although it can be a challenging time for people who use the service, if we...are really transparent about what happened, what we’re doing about it and how we’re working hard to make sure that it can’t happen again, that we can work through these things with the people who use the service, with our content partners, and with advertisers,” he said on Twitter’s earnings call. “And so we intend for that to be the case here, but we’re still working through all the details on the security issue, and we’ll just keep people posted, as we have, on Twitter over the last couple of weeks as our work has unfolded.” The company posted a June-quarter net loss of $1.23 billion, or $1.56 a share, whereas it had recorded a GAAP profit of $1.12 billion, or $1.43 a share, in the year-earlier quarter. The year-earlier net income was driven by a large tax benefit. For the most recent quarter, Twitter said in its release that it recognized a $1.1 billion valuation allowance. Twitter saw an adjusted loss per share of $1.39, while analysts surveyed by FactSet had expected the company to break even on a per-share basis. The company recorded $1.58 a share in adjusted earnings a year earlier. MKM Partners analyst Rohit Kulkarni wasn’t too impressed by the results. “From a fundamental standpoint, Twitter’s Q2 results were worse than expected, particularly given the advertising revenue trends reported by its peers,” he wrote in a note to clients. “While Twitter is cutting variable costs over the near term, we think the cost of growing the business is clearly rising for Twitter as the company seems to be playing catch-up on tech investments.” He rates the stock at neutral with a $34 target price. Read: Twitter breach threatens to create ‘lengthy overhang on the stock,’ analyst says Dorsey announced that Twitter will report its third-quarter results on Oct. 29 after the market closes, breaking from the company’s usual pattern of premarket releases. Shares have risen 39% over the past three months as the S&P 500 SPX, +0.87% has gained 17%."}]}