{"article": [{"url": "https://www.marketwatch.com/story/who-reports-largest-single-day-surge-in-coronavirus-cases-yet-2020-06-21", "published": 1592761940.0, "headline": "WHO reports largest single-day surge in coronavirus cases yet", "body": "GENEVA — The World Health Organization on Sunday reported the largest single-day increase in coronavirus cases by its count, at more than 183,000 new cases in the latest 24 hours. The UN health agency said Brazil led the way with 54,771 cases tallied and the U.S. next at 36,617. Over 15,400 came in in India. Experts said rising case counts can reflect multiple factors including more widespread testing as well as broader infection. Overall in the pandemic, WHO reported 8,708,008 cases — 183,020 in the last 24 hours — with 461,715 deaths worldwide, with a daily increase of 4,743. More than two-thirds of those new deaths were reported in the Americas. In Spain, officials ended a national state of emergency after three months of lockdown, allowing its 47 million residents to freely travel around the country for the first time since March 14. The country also dropped a 14-day quarantine for visitors from Britain and the 26 European countries that allow visa-free travel. But there was only a trickle of travelers at Madrid-Barajas Airport, which on a normal June day would be bustling. “This freedom that we now have, not having to justify our journey to see our family and friends, this was something that we were really looking forward to,” Pedro Delgado, 23, said after arriving from Spain’s Canary Islands. Spanish Prime Minister Pedro Sánchez urged people to take maximum precautions: “The virus can return and it can hit us again in a second wave, and we have to do whatever we can to avoid that at all cost.” At a campaign rally in Tulsa, Oklahoma, Trump said Saturday the U.S. has tested 25 million people, but the “bad part” is that it found more cases. “When you do testing to that extent, you’re going to find more people, you’re going to find more cases,” Trump said. “So I said to my people, ‘Slow the testing down, please.’” White House trade adviser Peter Navarro said on CNN that Trump was being “tongue-in-cheek” and made the comment in a “light mood.” Democratic rival Joe Biden’s campaign accused Trump of “putting politics ahead of the safety and economic well-being of the American people.” The U.S. has the world’s highest number of reported infections, over 2.2 million, and the highest death toll, at about 120,000, according to Johns Hopkins. Health officials say robust testing is vital for tracking outbreaks and keeping the virus in check. In England, lockdown restrictions prevented druids, pagans and party-goers on Sunday from watching the sun rise at the ancient circle of Stonehenge to mark the summer solstice, the longest day of the year in the Northern Hemisphere. English Heritage, which runs the site, livestreamed it instead. A few people gathered outside the fence. “You can’t cancel the sunrise,” druid Arthur Pendragon told the BBC. The number of confirmed virus cases is still growing rapidly not only in the U.S. but in Brazil, South Africa and other countries, especially in Latin America. Brazil’s Health Ministry said the total number of cases had risen by more than 50,000 in a day. President Jair Bolsonaro has been downplaying the risks even as his country has seen nearly 50,000 fatalities, the second-highest death toll in the world. South Africa reported a one-day high of almost 5,000 new cases on Saturday and 46 deaths. Despite the increase, President Cyril Ramaphosa announced a further loosening of one of the world’s strictest lockdowns. Casinos, beauty salons and sit-down restaurant service will reopen. In the United States, the virus appears to be spreading across the West and South. Arizona reported over 3,100 new infections, just short of Friday’s record, and 26 deaths. Nevada also reported a new high of 445 cases. In Europe, a single meatpacking plant in Germany has had over 1,000 cases, so the regional government issued a quarantine for all 6,500 workers, managers and family members. In Asia, China and South Korea reported new coronavirus cases Sunday in outbreaks that threatened to set back their recoveries. Chinese authorities recorded 25 new confirmed cases — 22 in Beijing. In the past week, Beijing tightened travel controls by requiring anyone who wants to leave the Chinese capital, a city of 20 million people, to show proof they tested negative for the virus. In South Korea, nearly 200 infections have been traced to employees at a door-to-door sales company in Seoul, and at least 70 other infections are tied to a table tennis club there. But South Korean officials are reluctant to enforce stronger social distancing to avoid hurting the economy."}]}