{"article": [{"url": "https://www.marketwatch.com/story/my-retirement-income-is-95000-a-year-and-i-want-a-walkable-affordable-beach-town-to-spend-the-winter-where-should-i-retire-2020-01-27", "published": 1592668400.0, "headline": "My retirement income is $95,000 a year, and I want a walkable, affordable beach town to spend the winter. Where should I retire?", "body": "Dear Catey, My wife and I are 58. She will retire at 62 and I at 67. Our annual retirement income at 67 will be approximately $95,000 from Social Security, pensions and investments. We would like to find an affordable, friendly place to rent during the winter months, that is warm and as close as possible to the ocean in the good ‘ole United States of America. We plan to pay off our home in the Midwest in about six years. Grateful for no other debt. Ideally, the location would also be near stores, in restaurants and walkable. It cannot be on the West Coast. In the coming years, we’d like to visit locations to “test the waters.” Can you help with some recommendations for the future snowbirds? Thank you,G.A. Dear G.A., I get a number of letters from aspiring snowbirds, and frankly, escaping the cold months sounds like a plan to me (I write this as I’m bundled up in a sweater in chilly New York City and dreaming of a palm tree and umbrella drink). Of course, there are things to consider like taxes (here’s a piece from Money on how snowbirds can avoid “a blizzard of taxes”), home security, winterizing your home and more (this guide is a good start). That said, snowbirding is a compelling option. Here are three spots in walkable, pretty affordable beach towns. St. Augustine, Florida St. Augustine, Florida iStock This city of about 15,000 residents is nestled along the county’s 42 miles of pristine beaches and boasts tons of history. “You can’t walk very far in St. Augustine without being reminded that it is the oldest European-established city in the U.S.—one that houses more than 60 historic sites and attractions, including a town square that dates to 1573. The city is still very much alive, however. Pedestrian-only St. George Street, lined with bistros, boutiques and bars, bustles all day and well into the night, with live music coming from practically every other open door,” writes Kiplinger’s of the town, which it calls a “smart” place to retire. And Travel & Leisure, which named it one of the seven best places to visit in Florida, notes that: “It’s a walkable town, imbued with intrigue; whispers of the past swirl through every cobblestoned alley.” Kiplinger’s adds that St. Augustine has “everything from golf to belly dancing for retirees” as well as “plenty of cultural activities, affordable luxury living, and first-class health care.” To be sure, there are cheaper cities to live in Florida — the cost of living in St. Augustine is slightly above average for the U.S. — but this city has so many perks to recommend it, and with your income you can likely make this work: The median rent for a one-bedroom apartment is $800 and the median two-bedroom is under $1,000, according to Sperlings (though you may pay more in the heart of things) — not to mention that Florida is one of the most tax-friendly states in the country for retirees, Kiplinger’s notes. (Here’s a piece on how snowbirds can be taxed as Florida residents.) Galveston, Texas Galveston, Texas iStock Texas, like Florida, has no income tax and is tax-friendly to retirees — and Galveston itself has a cost of living that’s significantly below average. It’s also, at least in parts, reasonably walkable and offers “quiet beaches as well as a lively cultural scene,” writes Kiplinger’s, which calls it a “great place to retire.” You won’t be bored there: “Because Galveston attracts a lot of weekend visitors, there’s always something going on,” writes Kiplinger’s — including annual celebrations like Mardi Gras, the Food and Wine Festival, the Brewmasters Craft Beer Festival, as well as an amusement park, and summertime concerts. Plus, Houston — which has excellent health care and plenty more to do — is under an hour’s drive away. Crime is slightly elevated in Galveston, but there are safer neighborhoods. It’s not just a resort town either, writes the New York Times: “Galveston (population, 49,000) has more character than most flip-flop playgrounds. Its history, as rich as that of Charleston, S.C., or New Orleans, is evident in the majestic downtown structures and in palm-lined neighborhoods of Victorian homes painted in jelly bean shades…More recently, an enormous rebuilding effort in the 1980s started a new round of changes. Artists and entrepreneurs are filling downtown lofts and restaurants; these days many visitors come for the manufactured wonders as well as natural ones along the shore. Tampa, Florida Tampa, Florida iStock Tampa landed on Kiplinger’s list of the best places for early retirement thanks in part to its ‘particularly affordable living costs” as well as “all the things you’d look for in a Florida retirement: white sand beaches, warm blue waters, plenty of golf and generous tax breaks.” You can also find certain neighborhoods that are walkable and plenty of other perks too like a “growing food and live music scene, killer lineup of breweries and almost eternally beach and boat-friendly weather,” writes Thrillist, which calls the quality of life here “appealing.” Tampa (population of about 370,000) and the surrounding area also offer “both a laid-back beach lifestyle and the amenities of a large metropolitan area, including professional sports teams, interesting museums and an array of entertainment and dining options,” writes U.S. News. However, some complain of the city’s growth and sprawl."}]}