{"article": [{"url": "https://www.marketwatch.com/story/us-trade-deficit-climbs-in-august-to-671-billion-and-hits-third-highest-level-on-record-2020-10-06", "published": 1601978240.0, "headline": "U.S. trade deficit climbs in August to $67.1 billion and hits third highest level on record", "body": "The numbers: The U.S. trade deficit climbed almost 6% in August to $67.1 billion and hit the third highest level on record, reflecting an ongoing struggle by American exporters to recover all the ground lost in the early stages of the coronavirus pandemic. Economists polled by MarketWatch has forecast a $66.7 billion trade gap. What happened: Imports of foreign goods and services rose 3.2% in August to $239 billion, the U.S. Census Bureau said Tuesday. Exports increased a smaller 2.2% to $171.9 billion. Imports have rebounded faster than exports, largely reflecting a stronger recovery in the U.S. economy compared to many of its trading partners. Imports are just 3% below prepandemic levels. Exports, on the other hand, are about 18% lower compared to the last month before the pandemic. Disruptions in global supply chains and weaker demand overseas have hindered the ability of U.S. exporters to recover all the sales lost early in the pandemic. The U.S. is also exporting fewer services tied to travel and tourism with so few people around the world flying and visiting other countries. Typically the U.S. runs a large surplus in services because its one of the most frequented travel destinations in the world. Read:Consumer confidence surges to highest level of coronavirus era The trade gap in goods with China, meanwhile, fell to $26.4 billion in August from $28.3 billion in the prior month. The deficit with China is running about 18% lower in 2020 compared to 2019 owing to coronavirus disruptions and U.S. tariffs. The big picture: A larger trade deficit subtracts from gross domestic product, the official scorecard for the U.S. economy. The increase in the third quarter is likely to shave a few points off what is expected to be a record increase in GDP as the economic recovery got underway. President Trump entered office almost four years ago vowing to slash chronically high U.S. trade deficits, but his effort has fallen short mostly due to longstanding patterns in imports and exports that are hard to shift. Americans buy so many imports, for instance, because a number of products are no longer made in the America. Read:U.S. adds 661,000 jobs in September and unemployment rate falls to 7.9% The global coronavirus pandemic has exacerbated U.S. trade deficits because exports have recovered slower than imports. Economists predict exports will begin to pick up more rapidly soon as the global economy recovers and supply chains are repair, driving U.S. trade deficits back down to precrisis levels. What they are saying? “As [U.S.] production continues to ramp up, there is plenty of scope for exports to catch up over the coming months,” said senior U.S. economist Andrew Hunter of Capital Economics. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 index SPX, +0.87% were set to rise in Tuesday trades."}]}