{"article": [{"url": "https://www.marketwatch.com/story/teslas-stock-soars-toward-record-as-wall-streets-biggest-bear-raises-price-target-2020-07-06", "published": 1594104320.0, "headline": "Teslaâ\u0080\u0099s stock soars to 4th-straight record as Wall Streetâ\u0080\u0099s biggest bear raises price target", "body": "Shares of Tesla Inc. charged higher to a fourth-straight record close Monday, after even the most bearish analyst on Wall Street analyst lifted his price target following the electric vehicle makerâ\u0080\u0099s blowout deliveries results. Tesla rival Nio Inc.â\u0080\u0099s stock NIO, +0.14% Â also soared, in the wake of the China-based EV makerâ\u0080\u0099s upbeat June sales report. Meanwhile, among other EV makers, shares of Workhorse Group Inc. WKHS, +12.62% Â pulled back after a record 11-day win streak and Nikola Corp. NKLA, -1.36% Â was headed for a fourth straight loss. Teslaâ\u0080\u0099s stock TSLA, +1.89% Â shot up a record $162.92, or 13.5%, to $1,371.58. The stock has soared 42.9% over the past five days, the last four of which were record closing prices. Analyst Ryan Brinkman at JPMorgan raised his stock price target by 7.3% to $295, but that was still 78.5% below current prices. Brinkmanâ\u0080\u0099s target remained the lowest of the 32 analysts surveyed by FactSet. The price target increase follows Teslaâ\u0080\u0099s report Thursday that it delivered 90,650 vehicles in the second quarter, well above expectations of 72,000. Donâ\u0080\u0099t miss: Tesla stock rockets higher as quarterly sales crush expectations. See related: Some workers complain Tesla has threatened firings if they donâ\u0080\u0099t return to work. Brinkman said that the deliveries data led Chief Executive Elon Musk to imply Teslaâ\u0080\u0099s second-quarter report, due out on or about July 22, could produce a surprise break-even result. But he cautioned investors that any â\u0080\u009csubstantially better resultsâ\u0080\u009d could include items that are â\u0080\u009cone-time or somewhat one-time in nature,â\u0080\u009d such as zero-emission regulatory credit sales or the release of deferred revenue associated with autonomous driving features. Brinkman reiterated the underweight rating heâ\u0080\u0099s had on Tesla for at least the last three years, citing â\u0080\u009clofty valuationâ\u0080\u009d coupled with â\u0080\u009chigh investor expectations and high execution risk.â\u0080\u009d â\u0080\u009cOur underweight rating considers notable investment positives, including a highly differentiated business model, appealing product portfolio, and leading-edge technology, which we believe are more than offset by above-average execution risk and valuation that seems to be pricing in a lot,â\u0080\u009d Brinkman wrote in a note to clients. Of the 32 analysts surveyed by FactSet, 12 have the equivalent of sell ratings on Tesla, while 11 have the equivalent of hold and 9 have the equivalent of buy. The average price target is $774.98, or 43.5% below current prices. FactSet Nioâ\u0080\u0099s stock ran up 22.7% to $11.51, to also record a fifth straight gain. That was the stockâ\u0080\u0099s second-highest close since going public on Sept. 12, 2018. The record close of $11.60 was reached on Sept. 13, 2018. The stock has rocketed 66.8% during its current win streak. Nio reported last week that June sales rose 179% from a year ago to 3,740 EVs. That consisted of 2,476 ES6 model EVs, which are Nioâ\u0080\u0099s small SUVs, and 1,264 ES8 EVs. That took second-quarter sales to 10,331 vehicles, up 191% from a year ago. Separately, DigiTimes reported Monday that Nio raised funds totaling $1.97 billion in the first half of 2020, and has acquired a factory in central China as it looks to expand its production capacity to 4,500 to 5,000 EVs a month from the current rate of 4,000. FactSet, MarketWatch Not all EV makers enjoyed gains Monday, as Workhorseâ\u0080\u0099s stockÂ tumbled 15.8% to $17.61, the first decline in 12 sessions. The stock had rocketed more than fivefold (up 406%) during its record 11-day win streak through Thursday, which was supported by the announcement last week of a $70 million securities purchase agreement from an institutional investor. Nikolaâ\u0080\u0099s stockÂ slumped 14.5% to $48.92 on Monday. It has shed 38.1% amid a four-day losing streak, and has tumbled 38.6% since the June 9 record close of $79.73. JPMorganâ\u0080\u0099s Paul Coster had started coverage of the battery-electric and hydrogen-electric vehicle maker late last month with a neutral rating, saying the company was poised to disrupt the transportation industry. Despite the pullbacks, Workhorseâ\u0080\u0099s stock was still up nearly sixfold (up 479.3%) year to date and Nikola shares were up nearly fivefold ( up 374.0%). Teslaâ\u0080\u0099s stock has more than tripled (up 227.9%) this year and Nioâ\u0080\u0099s stock has nearly tripled (up 186.3%), while the S&P 500 index SPX, +0.87% Â has slipped 1.6%."}]}