{"article": [{"url": "https://www.marketwatch.com/story/warren-buffett-just-turned-90-heres-a-video-of-bill-gates-baking-him-a-cake-11598811211", "published": 1599309200.0, "headline": "Bill Gates says this might be 'the most important thing' he's learned from Warren Buffett, who just turned 90", "body": "“ 'Warren has the mental sharpness of a 30-year-old, the mischievous laugh of a 10-year-old, and the diet of a 6-year-old.' ” That's Bill Gates ringing in his longtime pal Warren Buffett's 90th birthday on Sunday in a blog post that includes a video of the Microsoft MSFT, +2.48% co-founder baking a cake. \"He once told me that he looked at the data and discovered that first-graders have the best actuarial odds, so he decided to eat like one,\" Gates wrote. \"He was only half-joking.\" Here's the video: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Gates went on to talk about one of their shared interests - the love of math and numbers - and related them to their friendship. 30: Number of years Warren has spent sleeping in his lifetime 10,649: Days since we met for the first time, on July 5, 1991 2: Phone numbers I have on speed dial at my office-Melinda's and Warren's Incalculable: The impact Warren has had on the world by committing to give virtually all of his wealth back to society Gates said that the \"unshakable sense of right and wrong\" is one of Buffett's most admirable qualities, and that he also has a \"phenomenal eye for talent\" when it comes to building his business. Gates shared this photo of Buffett and his first wife and kids from the mid-1950s, which was around the time the Buffett Partnership was launched. \"For as long as I've known Warren, his approach to life and work has stayed constant,\" Gates wrote in the blog post. \"It's amazing, in fact, how little he has changed even as Berkshire Hathaway BRK.A, +0.06% has become wildly successful.\" The most important thing Gates said he learned from him is the value of friendship, and he pointed to one quote in particular that Buffett once told a group of college students. \"You will move in the direction of the people that you associate with. So it's important to associate with people that are better than yourself. The friends you have will form you as you go through life,\" Buffett said. \"Make some good friends, keep them for the rest of your life, but have them be people that you admire as well as like.\""}]}