{"article": [{"url": "https://www.marketwatch.com/story/how-will-the-robots-see-you-through-the-pandemic-2020-07-23", "published": 1595498960.0, "headline": "How will the robots see you through the pandemic?", "body": "Today’s market turbulence marks new terrain for automated investing platforms, most of which emerged over the last decade after the financial crisis in 2008. This first major test for robo adviser platforms comes in the form of an unprecedented global health crisis that has spurred incredible uncertainty for the economy and financial markets. It’s enough to make any investor feel anxious — and robo adviser users are wondering what it all might mean for their portfolios. Calls from our robo adviser clients have more than doubled on some of the most volatile market days recently. From millennial investors who are experiencing their first major market downturn to preretirees counting on their investments to last them through retirement, here are a few of the most common questions we are hearing, along with tips for any robo investor weathering uncertainty ahead: 1. ‘Should I change my portfolio allocation to be more conservative?’ This is one of the most frequently asked questions among investors right now, and the reality is that it is going to depend on each individual’s time horizon and risk profile. Broadly, however, unless an individual’s financial goals have changed, their portfolio strategy shouldn’t change during volatility either. Over a lifetime of investing, the best strategy is to get and stay invested with a diversified portfolio and according to an established plan. Even if it’s tempting to try to time the market, time in the market is far more important. 2. ‘How often should my portfolio be rebalanced?’ Rebalancing is among the more critical things that an investor can do for their portfolio—but it’s also one of the trickiest. Markets are in constant flux, and target allocations within a portfolio can drift off course as the markets rise and fall—a challenge that becomes magnified in periods of volatility. According to Schwab data, a hypothetical portfolio made up of 60% stocks and 40% bonds in March 2009 without rebalancing would have been 83% stocks and 17% bonds in June 2018—that’s a significant deviation over a 10-year period after the financial crisis. Regular rebalancing ensures that investors’ portfolios remain consistent with their risk tolerance over time and mitigates exposure to a level of risk that may increase portfolio vulnerability during a market downturn. But rebalancing too frequently to hold tight to target allocations carries the potential risks of lower returns and increased tax burdens in nonqualified accounts. Most digital advice platforms have built-in levers to determine when it’s necessary to rebalance, and some offer ongoing portfolio monitoring for opportunities to reallocate. The automated process puts logic, instead of emotion, in the driver’s seat to help investors stay the course. More important, it allows investors to focus on other pressing matters in challenging times, like taking care of their health and families. 3. ‘How should I think about tax-loss harvesting?’ A lot of robo adviser clients are seeing trades taking place in their portfolios and wondering about the mechanics of tax-loss harvesting, especially during market volatility when there is more opportunity for tax-loss harvesting. Put simply, by selling funds that have experienced a loss and reinvesting in a similar fund within the same asset class, investors can offset tax liabilities while maintaining their allocation targets. Tax-loss harvesting, similar to rebalancing, is an important strategy that becomes even more significant in periods of volatility when there is opportunity to take advantage of losses. So it is natural that investors are seeing more of these trades in today’s environment. 4. ‘Should I move money out of the market if I’m close to retirement?’ The risk to getting out of the market fully is twofold. First, there’s a missed opportunity for growing assets toward individual long-term goals. For most, retirement is a pretty lengthy period and people typically need the growth provided by stocks to carry them through. Second is the risk of not participating in a recovery if and when markets rebound. Historical data shows that trying to time a market exit and re-entry can be detrimental to returns, while investors who stick with a long-term investment plan in a diversified portfolio generally see their investments recover in a few years. The decision is going to look different for every individual. Investors with short-term goals who need to tap their assets soon—within four to five years—may want to hold that money in cash investments or investments generally less volatile than stocks. Weathering the storm with automated investing While today’s environment remains uncharted territory for some robo adviser users, many of the traditional principles still apply — investors should establish their parameters from the get-go and aim to stay on track over a lifetime of investing. Automated platforms also help to remove some of the emotion that causes impulsive investment decisions that often accompany volatile markets, which can otherwise be detrimental to an individual’s long-term goals. Many even offer access to financial advisers at an affordable cost for investors who might want some additional guidance amid the uncertainty. David Koenig, CFA, is chief investment strategist at Schwab Intelligent Portfolios. Disclosure: Brokerage Products: Not FDIC-Insured • No Bank Guarantee • May Lose Value Please read the Schwab Intelligent Portfolios Solutions™ disclosure brochures for important information, pricing, and disclosures related to the Schwab Intelligent Portfolios and Schwab Intelligent Portfolios Premium programs. Schwab Intelligent Portfolios® and Schwab Intelligent Portfolios Premium™ are made available through Charles Schwab & Co. Inc. (“Schwab”), a dually registered investment adviser and broker dealer. Portfolio management services are provided by Charles Schwab Investment Advisory, Inc. (”CSIA”). Schwab and CSIA are subsidiaries of The Charles Schwab Corporation. Schwab Intelligent Portfolios® and Schwab Intelligent Portfolios Premium™ are designed to monitor portfolios on a daily basis and will also automatically rebalance as needed to keep the portfolio consistent with the client’s selected risk profile. Trading may not take place daily. Diversification, automatic investing and rebalancing strategies do not ensure a profit and do not protect against losses. Tax‐loss harvesting is available for clients with invested assets of $50,000 or more in their account. Clients must choose to activate this feature. The tax‐loss harvesting feature that is available with Schwab Intelligent Portfolios Solutions ™ is subject to significant limitations which are described on the Schwab Intelligent Portfolios Solutions website and mobile application (collectively, the “website”) as well as in the Schwab Intelligent Portfolios Solutions™ disclosure brochures (the “Brochures”), and the IRS website at www.irs.gov. You should consider whether to activate the tax‐loss harvesting feature based on your particular circumstances and the potential impact tax‐loss harvesting may have on your tax situation. You should read the tax‐loss harvesting disclosures on the website and in the Brochures before choosing the tax‐loss harvesting feature. Neither the tax‐loss harvesting strategy nor any discussion herein is intended as tax advice, and neither Charles Schwab & Co., Inc. nor its affiliates, including but not limited to Charles Schwab Investment Advisory, Inc., represents that any particular tax consequences will be obtained. ©2020 Charles Schwab & Co., Inc. All rights reserved. Member SIPC."}]}