{"article": [{"url": "https://www.marketwatch.com/story/covid-19-stimulus-talks-could-still-get-off-the-ground-as-end-of-runway-nears-11601405370", "published": 1601409740.0, "headline": "COVID-19 stimulus talks face deadline of noon Wednesday, Democrats say", "body": "Treasury Secretary Steven Mnuchin, shown at the Capitol in March, spoke with House Speaker Nancy Pelosi again Tuesday morning about an economic stimulus package. Wednesday is looking like high noon — literally — for efforts to pass a coronavirus fiscal stimulus package before the Nov. 3 presidential election. A top House Democrat said late Tuesday that Democrats would be waiting until noon to hear back from the White House with a counteroffer to the new $2.2 trillion aid bill they unveiled Monday. If they go ahead and vote on the bill, it could very well mean hopes for a package are dead until the winner of the post-election lame-duck session. “Hopefully a substantive response tomorrow morning, by noon” was what Democrats were waiting on, Rep. Steny Hoyer, the second-ranking Democrat in the House, told reporters early Tuesday night. Stimulus talks, which had remained largely dormant since early August, had flickered to life as House Speaker Nancy Pelosi and Treasury Secretary Steven Mnuchin spoke early Tuesday for the second time in less than 24 hours. Pelosi later was upbeat about the approximately 50-minute phone call. “Our conversation was a positive one. We’ll get back together tomorrow to see how we can find common ground,” Pelosi said in an interview on MSNBC. One of the White House’s negotiators in past COVID-19 talks, chief of staff Mark Meadows, also said he and Mnuchin had discussed the issue with President Donald Trump. “The secretary and I have had a couple of conversations this morning. We also had a conversation with the president, so hopefully we’ll make some progress and find a solution for the American people,” Meadows told reporters on Capitol Hill as he accompanied Amy Coney Barrett, the new U.S. Supreme Court nominee, to her meetings with individual senators ahead of her confirmation hearings. The renewed talks, with Pelosi and Mnuchin’s talk being the longest discussion in weeks, come against a background increasingly dominated by the upcoming election. This is the last week House and Senate lawmakers are scheduled to be in the U.S. Capitol before the Nov. 3 election, aside from the Senate possibly coming back to vote on Barrett. With the Senate in play to potentially flip to Democratic control, many lawmakers are eager to wrap up business and hit the trail for the final few campaign weeks. The Senate is set to approve a bill Wednesday to keep the government temporarily funded through Dec. 11 and is expected to stick around through Thursday. The House is slated to be in through Friday and may vote on a slimmed-down version of the sweeping stimulus bill they passed in May. That vote could come as early as Wednesday, Democrats say. Read more: Pelosi, Mnuchin agree to keep talking on COVID-19 aid as Democrats unveil own $2.2 trillion bill “When we reduced it, we didn’t take out priorities. We just reduced the timeline as to how long those benefits would last,” Pelosi said of what House Democrats are calling “Heroes 2.0”. The original bill had a $3.4 trillion price tag, an amount reduced to about $2.2 trillion in the new bill. The bill cuts the Democrats’ ask for aid to cash-strapped state, local and tribal governments to $436 billion, about half of the previous amount sought and a seeming concession to Republican objections. It also includes items with support from both Pelosi and the White House, like $28.3 billion for passenger airlines, their contractors and cargo airlines to keep them from laying off workers. Another industry that both sides have mentioned as a priority, restaurants and bars, would see a $120 billion grant program to help establishments weather the downturn in foot traffic. It would provide for another round of $1,200 direct payments to households, revive the dormant $600-a-week federal supplement to state jobless benefits, renew and modify the Paycheck Protection Program for small businesses, and provide money for schools and colleges to deal with teaching in a pandemic. The bill could be altered if Pelosi and Mnuchin reach a deal, but it also could be voted on as-is as one of the last things House members do before leaving Washington. Moderate House Democrats have chafed at what they see as a too-hardline negotiating stance by Pelosi. “If Pelosi pushes her new bill for a vote in the next couple of days, that will serve to lock Democrats into what is essentially the status quo, a gap of roughly $1 trillion between the two closest offers. However, if Pelosi holds off on a vote, that is a crucial signal that talks are progressing better than expected and a deal may be possible,” wrote analysts with Height Securities LLC in a note to clients Tuesday. Still, getting a substantive package through Congress quickly would require a lot of things to go right. In his client note Monday evening, Chris Krueger, a strategist with Cowen Washington Research Group, wrote: “We do not believe there is enough political will — or time — to get a bill done before the Nov. 3 elections.” An agreement would also require Senate Republicans, whose leader, Majority Leader Mitch McConnell, has been absent from in-person stimulus talks, to focus on this issue with a lot going on: the Barrett confirmation, a stopgap funding bill and a controversy over Trump’s taxes. Sen. Mike Crapo, the Idaho Republican who heads the Senate Banking Committee, said Tuesday he wasn’t keeping up with stimulus talks, but he favored a deal. “I think we need another COVID bill. And I’m glad to see the talks have started up again. I don’t know of any of the details, so I’m not gonna comment on that. But I’m prepared to support something,” he told reporters."}]}