{"article": [{"url": "https://www.marketwatch.com/story/the-pandemic-has-brought-the-personal-computer-back-to-life-with-help-from-zoom-11599316207", "published": 1599575600.0, "headline": "The pandemic has brought the personal computer back to life, with help from Zoom", "body": "The personal computer, given up for dead by many consumers when smartphones became the device of choice, has experienced a huge revival during the COVID-19 pandemic, as workers, students and other consumers suddenly needed new PCs to handle tasks such as videoconferencing. Declining PC sales in recent years have led many industry prognosticators, as well, to declare the PC if not dead than dying, supplanted by tablets along with smartphones. PC sales, though, have seemingly exploded during the pandemic, thanks to bulk purchases by companies and schools that must now connect to workers and students remotely, as well as consumers who had avoided an upgrade for years. The biggest reason, according to experts: Older models were ill-equipped for videoconferencing tools such as Zoom Video Communications Inc.’s ZM, +2.89% offering, which has exploded in use for videoconferencing, key for team meetings and remote classes. “The old PCs are not doing so well, they didn’t have the next graphics card and other things,” said Maribel Lopez, principal analyst at Lopez Research. “If you have a 4-year-old PC and you are doing videos, it’s really not working. This is one reason the PC market is going gangbusters. Today’s entry-level PC would be better than what you bought four years ago.” IDC analyst Jitesh Urbani agreed that video was a big driver of the increase in PC demand. For more: How the boom boosted Zoom earnings and how you may use it for free but companies are paying for it “At the start of the pandemic, we heard of many instances where folks were scrambling to buy new PCs, and when they couldn’t find one they would resort to using their old PCs, which often lacked a decent webcam, microphone, or other hardware features,” Urbani said in an email. “However, as video calls have essentially become mandatory, those people ultimately sought to upgrade their old PCs.” The upswing in shipments began in the second quarter of the year, IDC reported, after retail channels were wiped out from early buying during the COVID-19 pandemic, which began affecting the U.S. in early March. The first quarter, when China began shutting down its factories, also saw some issues in the global supply chain that were a factor in a nearly 10% drop in worldwide PC unit shipments, according to IDC. But demand picked up as supply became more available, and consumers better recognized the nature and duration of working from home. Worldwide PC unit shipments surged 11.2% in the second quarter, according to IDC. On the other hand, the smartphone market moved in the opposite direction. In the second quarter, IDC said global smartphone unit shipments plunged 17%. Apple Inc.’s AAPL, +1.74% third-quarter results showed these trends, with only a very slight uptick of 1.6% in iPhone revenue, while the iPad tablet experienced a major resurgence, with revenue jumping 31%, and sales of the Mac climbed nearly 22%, in the quarter that ended July 30. Laptops are clearly the biggest beneficiary of the pandemic’s tech trends, especially in many households where the work situation is fluid, with a dad in the home office and a mom working at a makeshift desk in the kitchen or dining room, while also trying to help one child with homework on yet another separate computer or tablet, and then moving to another room later in the day. “Many people don’t have a dedicated office,” Alex Cho, president of the PC business at HP Inc. HPQ, told MarketWatch. “People are working around the house a lot. They are mobile in the house. … They are also sharing resources, including the couch, the number of people working in a bedroom and network bandwidth.” IDC also noted strong growth for Chromebooks, which are particularly popular in education. Lopez noted that the devices, which run on an Alphabet Inc. operating system, are also being used by call-center employees who cannot store any consumer data on devices in their homes. They are now often working with a Chromebook or some other type of virtual desktop interface, so that all their work goes to the cloud, sometimes via a legacy app in a mainframe that is designed as cloud-first. Cho said that HP has been getting feedback from customers, partners and employees about their working situations and how they could be improved. Trying to avoid neck pain from slouching over a laptop, many have been using thick books to raise their devices. “We are getting pictures of people’s home environments,” he said. “I did not realize how much work is happening in the bedroom, in the garage.” More from Therese Poletti: The CEO who made one of Silicon Valley’s worst acquisitions wants a $400 million blank check HP and other PC manufacturers recently detailed the resurgence in PC sales in their quarterly earnings. In its third fiscal quarter, where overall revenue slipped 2.1%, pulled down by corporate printing, HP saw net revenue of the consumer segment of its personal systems business jump 42%, while commercial revenue fell 11%. When Lenovo Group Ltd. 992, -1.91%, the world’s largest PC maker, reported its third-quarter earnings in August, it said its consumer PC segment saw revenue growth of 45%. Gianfranco Lanci, president and chief operating officer, told analysts on the company’s earnings call that consumers are finding that the PC they occasionally used at home for maybe one hour or two a day “is not good enough.” “So it’s not only people buying a new PC, but it’s also people replacing a PC,” he said. At Dell Technologies Inc. DELL, -0.39%, an otherwise lackluster quarter, where overall revenue fell 3%, saw its biggest revenue gain in the consumer segment. Consumer revenue was $3.2 billion, up 18%, driven by the double-digit growth across consumer notebooks and gaming systems. Dell’s higher-end consumer PCs, the XPS, and its Alienware gaming systems saw combined growth of 25%. The company, though, did forecast that it expected its fourth fiscal quarter would be down more than normal on a sequential basis. Jeff Clarke, Dell’s chief operating officer and vice chairman, told analysts that the gains in consumer sales have been largely education-driven. “That is largely lower-end ASPs [average selling prices] that are associated with [the education market],” he said on the company’s conference call. See also: A tale of two $2 billion Chinese IPOs headed in very different directions The renewed love affair with the PC won’t last forever. Both IDC and Gartner Inc. predict that the growth will be short-lived, but their predictions as to how long it will last diverge. “It is likely that the surging laptop and tablet demands will be short-term, and not sustainable in the long term,” said Mikako Kitagawa, a Gartner analyst. “Once the devices are distributed to these who need [them], then the demand will slow down significantly. This will most likely happen in 2021.” IDC’s Lopez said she believes demand will remain stable for the rest of this year but will “fall off the cliff” in the first quarter of 2021. IDC said in a forecast last week that the overall market for desktops, notebooks and workstations will grow 3.3% in 2020 and decline 7.5% in 2021. HP is trying to take advantage of the demand while it can, but Cho also observed that the company had seen a resurgence in interest in PCs even before the pandemic forced everyone to work from home, particularly among Gen Z. Once again, “the PC is essential,” Cho said."}]}