{"article": [{"url": "https://www.marketwatch.com/story/opinion-the-real-reason-that-mary-trumps-tell-all-book-matters-11594229111", "published": 1594215200.0, "headline": "The real reason that Mary Trumpâ\u0080\u0099s tell-all book matters in the presidential election", "body": "AÂ new book by Mary Trump, President Donald Trump â\u0080\u0099s niece, is already getting media coverage with its official publication dateÂ still several days away. Journalists who have gotten advance copies of the book,Â Too Much and Never Enough: How My Family Created the Worldâ\u0080\u0099s Most Dangerous Man, report that the book contains some nuggets that are sure to attract attention.Â For example, Mary Trump alleges that her Uncle Donald paid someone to take a college-entrance test, the SAT, for him. She also claims that Donald TrumpÂ lasciviously remarkedÂ upon her body when she wore a bathing suit at a family gathering.Â Publication of the book is also an occasion for revisiting bombshell stories we already know aboutâ\u0080\u0094for instance, the 2018Â New York Times reportÂ alleging that Donald Trump and other family members relied on tax evasion and fraud toÂ avoid paying taxesÂ on hundreds of millions of dollars (Mary Trump has revealed she was aÂ key sourceÂ for the Times story). Trump critics are of course eager to exploit incendiary revelations that could damage Trump politically. Mary Trumpâ\u0080\u0099s book is certainly not good news for the president, and signals new trouble for his campaignâ\u0080\u0094though perhaps not in the way the presidentâ\u0080\u0099s opponents expect. There is no guarantee that any new revelation, no matter how dramatic, will sink Trump. Weâ\u0080\u0099ve seen him survive enormous scandals, including theÂ Access HollywoodÂ recording, the Mueller report and related prosecutions and incarcerations of Trump associates, extramarital affairs and reported payoffs to two mistresses,Â impeachmentÂ for an attempt to extort electoral assistance from a foreign country, andÂ recent reportsÂ that Trump failed to take action after learning of U.S. intelligence concerns that Russia was paying bounties for the murder of American soldiers in Afghanistan.Â Thatâ\u0080\u0099s not to say these or other bombshells are irrelevantâ\u0080\u0094they may well have contributed to Trumpâ\u0080\u0099sÂ deficit in the pollsÂ and could do so again with his nieceâ\u0080\u0099s bookâ\u0080\u0094but weâ\u0080\u0099re past a point where we can expect any scandal, no matter how big, to topple his presidency.Â There is simplyÂ no indication that congressional Republicans will abandon Trump, no matter what happens. The real problem for Trump, however, is that the book is yet another distraction for an easily distractible president.Â The election is now less than four months away. At this point in the 2016 cycle, Trump was successfully beating the drum on the issues that would define the campaignâ\u0080\u0094his promise to build a wall Mexico would pay for, Hillaryâ\u0080\u0099s emails, supposedly dangerous immigrants threatening to invade America.Â The Republican national convention took place July 17-18â\u0080\u0094in other words, at almost precisely the same stage in the cycle that we stand at now in 2020. No one would call Trumpâ\u0080\u0099s 2016 campaign well-organized, but he had gotten his preferred themes locked into the narrative by mid-July. People knew what he stood for (the wall, anti-immigrant policies, reworking trade deals) and what he was against ( Hillary Clinton â\u0080\u0099s supposed corruption, immigrants, Muslims).Â It was no surprise to hear chants of â\u0080\u009clock her upâ\u0080\u009d at the July 2016 Republican convention. It followed predictably from the narrative Trump had pounded home, a narrative thatÂ dominated media coverageÂ of the campaign. This time around, Trump is having far less luckÂ controlling the narrative. His campaign argues that thereâ\u0080\u0099sÂ still timeÂ for him to make a moveâ\u0080\u0094as he did in 2016. Thatâ\u0080\u0099sÂ possible, of course. His supporters can point to October 2016, when then-FBI director James Comey â\u0080\u0099s last-minute announcement about Clintonâ\u0080\u0099s emailsÂ likely gave Trump an edgeÂ he needed to win the election by a razor-thin margin in three states that decided the Electoral College. The problem for Trump, as he hopes to relive history (much of his 2020 campaign, like the 2016 effort, is built on nostalgiaâ\u0080\u0094this time, that includes an effort to relive the 2016 campaignÂ itself), is that itâ\u0080\u0099s later than he thinks. He was able to benefit from the Comey letter because he hadÂ stayed close to ClintonÂ through the summer of 2016â\u0080\u0094which depended in large part on his ability to control the narrative. So far, 2020 does not look like 2016.Â For one thing, Joe Biden leads Trump in the polls byÂ significantly moreÂ than Clinton did. Another difference from 2016 is that Trump is now the incumbent, and is struggling withÂ multiple crisesÂ that dominate headlines and constantly put him on defense.Â He has had no luck advancing an anti-Biden narrativeâ\u0080\u0094remember theÂ Zelensky phone callÂ from last year? Trump hadÂ hoped to smear BidenÂ with the same shadowy allegations of corruption that he successfully dumped on Clinton.Â But the script just hasnâ\u0080\u0099t worked for Trump this timeâ\u0080\u0094in part, perhaps, because Trump was caught and impeached, but also because the coronavirus pandemic and resultingÂ economic downturnÂ have dominated headlines. Trump has been so busy trying to convince Americans that the pandemic isÂ no big dealÂ that he hasnâ\u0080\u0099t even found enough time toÂ settle on the right playground insultÂ to use as a nickname for Biden.Â Itâ\u0080\u0099s clear that Trump would like to useÂ racism as a galvanizing energyÂ for his baseâ\u0080\u0094substituting protesters seeking racial justice, Confederate monuments, and the Confederate flag for immigrants and the border wall. But Americans may simply have had enoughâ\u0080\u0094similarlyÂ racist scare tacticsÂ did not work for Trump and Republicans in theÂ 2018 midtermÂ elections. There is evidenceÂ that the center of gravity on race has shifted away from Trump, leaving his race-baiting tactics so far outside the mainstream thatÂ even Sen. Lindsey GrahamÂ was forced to seek some distance from the president. There may or may not be more bombshells to come from Mary Trumpâ\u0080\u0099s book. But, from Bidenâ\u0080\u0099s perspective, this is beside the point. The mere fact that the book is appearing in news headlines is another distraction that makes it harder for Trump to play offense with the election now less than four months away. With Trump unable to control the narrative as he did in 2016, the election is shaping up as a referendum on the presidentâ\u0080\u0094â\u0080\u009cAmerica or Trumpâ\u0080\u009d as a Lincoln Project ad recently put it. Nothing is impossible, and of course the election results arenâ\u0080\u0099t guaranteed, but what may be most significant about his nieceâ\u0080\u0099s book is that itâ\u0080\u0099s yet another reminder of how 2020 is different than 2016, and that, for Trump, itâ\u0080\u0099s later than he thinks. ChrisÂ EdelsonÂ is an assistant professor of government in American Universityâ\u0080\u0099s School of Public Affairs. He has written two books on presidential power, and recently wrote a book chapter describingÂ the problem of constitutional failure in the United States."}]}