{"article": [{"url": "https://www.marketwatch.com/story/good-news-bad-news-on-stimulus-they-talked-but-nothings-changed-11597264991", "published": 1597255640.0, "headline": "Good news, bad news on stimulus: They talked, but nothing's changed", "body": "House Speaker Nancy Pelosi speaks to reporters alongside Senate Minority Leader Chuck Schumer last week on Capitol Hill. (Getty Images) At least they talked? After days of no communications between Democratic congressional leaders and the White House over a new coronavirus aid package, the two sides talked by phone Wednesday. But afterwards the Democratic pair, House Speaker Nancy Pelosi and Senate Minority Leader Chuck Schumer, and Treasury Secretary Steven Mnuchin both issued dueling statements blaming the other side for keeping talks stalled. \"An overture was made by Secretary Mnuchin to meet and he made clear that his televised comments from earlier today still stand: The White House is not budging from their position concerning the size and scope of a legislative package,\" Pelosi and Schumer wrote in a joint statement. \"Earlier today, Speaker Pelosi and I spoke by phone. Her statement is not an accurate reflection of our conversation. She made clear that she was unwilling to meet to continue negotiations unless we agreed in advance to her proposal, costing at least $2 trillion,\" Mnuchin said in his statement, without elaborating on which part of the Democratic leaders' account was untrue. \"The Democrats have no interest in negotiating,\" he said. Talks on a package broke down Friday as Democrats and the White House were unable to bridge substantial differences in their approach to a follow-up to the $1.7 trillion CARES Act put into law in March. Read more: Stimulus talks appear to end with a whimper, not a bang House Democrats passed a sweeping $3.4 trillion bill in May, while the Senate, with the White House's blessing, had proposed a more targeted approach of several bills, totaling about $1.1 trillion, according to the bipartisan Committee for a Responsible Federal Budget. Over the weekend, President Donald Trump signed several White House memorandums and an executive order that he claims would help get extra money to the unemployed, ease student debt worries, institute a delay in collecting payroll taxes and make it harder to evict delinquent tenants. Trump also said Democrats had contacted the White House and were in a mood to concede, something Schumer denied publicly. Experts have expressed skepticism on how quickly some of those initiatives, especially the aid to jobless people, can be implemented or whether they would actually do anything at all, in the case of the executive order on evictions. Read more: Republican senator calls Trump's stimulus executive order 'unconstitutional slop' Larry Kudlow, director of the White House's National Economic Council, said on Fox Business on Wednesday that the eviction order did not extend a moratorium that had been put in place by the March bill. \"It's not quite an eviction moratorium, but it's certainly eviction protection,\" he said. Pelosi and Schumer said in their statement that they made an offer to reduce the size of their package by $1 trillion if the White House was willing to raise its offer by a similar amount. \"We have again made clear to the administration that we are willing to resume negotiations once they start taking this process seriously,\" the pair said. That drew a rebuke from Alyssa Farah, the White House's director of communication. She tweeted that the administration took executive action because of Democrats' obstinance. iframe.twitter-tweet { width: 100% !important; } A drop in consumers' ability to spend due to the lapsed $600-a-week extra jobless benefit and other CARES Act provisions designed to boost the economy could dampen growth in the fall, just as the Trump administration looks to show a big economic bounceback. Read more: Here's how much a reduction in extra unemployment benefits could slash consumer spending But Kudlow said he did not think there was much danger of the economy slowing due to lack of a new stimulus. \"The numbers are coming in very, very nicely,\" Kudlow said. \"No, I don't think the economy is going to rely solely on this.\" With most of official Washington out of town on vacation, including lawmakers, the deadlock threatens to drag on into September. That's when lawmakers and the White House must come to an agreement on a temporary spending bill to avoid a government shutdown after Sept. 30. The two debates, stimulus and a so-called continuing resolution, could easily get pushed together by lawmakers wanting to leave D.C. to hit the fall campaign trail."}]}