{"article": [{"url": "https://www.marketwatch.com/story/california-will-require-public-companies-to-have-diverse-boards-11601504807", "published": 1601494940.0, "headline": "California will require public companies to have diverse boards", "body": "California Gov. Gavin Newsom has signed a bill that requires company boards to have at least one underrepresented minority member by the end of 2021. Getty Images California will require publicly traded companies headquartered in the state to add minority board members by the end of 2021 under a first-in-the-nation bill signed into law by Gov. Gavin Newsom on Wednesday. “When we talk about racial justice, we talk about power and needing to have seats at the table,” the governor said in a live-streamed press conference, during which he signed other controversial racial-justice bills, including one that would establish a task force to study reparations for African Americans. Assembly Bill 979 requires publicly traded companies based in California to add at least one board member from underrepresented groups — people who identify as Black or African American, Hispanic, Latino, Asian, Pacific Islander, Native American, Native Hawaiian or Alaska Native, or gay, lesbian, bisexual or transgender — by the end of next year. By the end of 2022, companies with at least nine board members will need to have at least three such directors, and those with four to eight board members will be required to have at least two directors from those groups. “The lack of diversity on California’s boards and upper-level corporate positions is a challenge we urged corporations to address on their own during our time in the Legislature,” Assemblymember Christina Garcia, D-Bell Gardens, who co-wrote the bill, said in a statement. “However, it is clear we can no longer wait for corporations to figure it out on their own.” The new law follows another first-in-the-nation corporate diversity law, SB 826, that mandates the number of women on companies’ boards, which California enacted in 2018 under then-Gov. Jerry Brown. That law has since sparked a couple of lawsuits seeking to invalidate it, with critics claiming it is unconstitutional. “Ending discrimination is a worthy objective,” said Anastasia Boden, an attorney for Pacific Legal Foundation, which has a lawsuit pending against SB 826. “Unfortunately, AB 979 is a pernicious and unconstitutional way of achieving it. The government should treat people as individuals, not according to their immutable characteristics.” Stephanie Creary, an assistant professor of management at Wharton Business School who has published research on diversity in business, called the law “extremely progressive” and said, “This is a quota, no disagreement about what this is. We already know there will be lawsuits.” However, businesses have expressed their support for the law, including the Silicon Valley Leadership Group, which represents more than 350 companies in tech and other industries. “The reality is the people whose job it is to interpret the law who say ‘never pay attention to someone’s demographic traits,’ they’re enabling continued discrimination against women and people of color,” Creary said. “On boards it’s especially egregious because they are often a reflection of a CEO’s personal network.” She also said the law is a “huge win” for the LGBTQ community, which is rarely included in diversity efforts. California’s secretary of state will be responsible for tracking companies’ compliance with this new law and fining them if needed, just like for SB 826 — a law that has already been followed by similar proposals in a handful of other states. AB 979’s author, Assemblyman Chris Holden, D-Pasadena, said during the press conference that Newsom’s signing of his legislation and others was “definitely a model for the rest of this country to follow.”"}]}