{"article": [{"url": "https://www.marketwatch.com/story/consumers-hold-the-key-to-an-economic-recovery-and-right-now-theyre-very-anxious-2020-08-05", "published": 1596644000.0, "headline": "Consumers hold the key to an economic recovery and right now theyâ\u0080\u0099re very anxious", "body": "Has the first stage of the U.S. economic recovery from the coronavirus already peaked? Or has a rebound in the economy merely hit the pause button after a recent surge in Covid-19 cases in many states? The full answer wonâ\u0080\u0099t be known for at least a month or more, but the level of consumer confidence appears to be providing the clearest signal to how quickly the economy will recover. And right now the signal is blinking yellow. Confidence nose-dived in the early stages of the pandemic, shot up after the economy began to reopen in May and then fizzled in June and July out after a fresh outbreak in Covid-19 cases. â\u0080\u009cSeventy percent of our economy is consumer spending and 80% is servicesâ\u0080\u009d like retailers and restaurants, noted John Leer, an economist at Morning Consult. â\u0080\u009cThose are activities that are very difficult to continue in the face of fear.â\u0080\u009d Read: Economy suffers titanic 32.9% plunge in 2nd quarter, points to drawn-out recovery Also:â\u0080\u0098A massive welfare economyâ\u0080\u0099 - federal aid prevents even steeper GDP collapse Morning Consult runs a weekly survey of consumer confidence, a report that has earned a larger following during the pandemic because of how timely it is. The other major consumer opinion reports tracked by Wall Street are publicized just once or twice a month and both also show a decline in confidence in July. Morning Consult actually conducts its poll on a daily basis, helping the firm to better spot turning points in the economy and which news events capture the most attention of consumers. The poll is one of six indicators included in MarketWatchâ\u0080\u0099s Coronavirus Recovery Tracker. The Morning Consult consumer-confidence surveyâ\u0080\u0099s results closely mirror the path of the economy since the pandemic first struck in March. The index plunged to a new low of 81 in early April from 115 a month earlier. It then clawed back to as high as 90 by mid-June before tapering off to 85.9 in the first week of August. See:Manufacturers expand in July for third straight month, but not all jobs are coming back Also:Job trouble? Wave of rehiring after economy reopened to fade in July after viral spira What does it tell us now ? The coronavirus naturally dominates the attention of Americans like no other issue and they are tailoring their behavior accordingly, acting even before the states or federal government impose restrictions. The same thing happened after the first wave of cases erupted in the U.S. â\u0080\u009cThe last time we saw this movie play out, it had very little do with governors declaring stay-at-home orders,â\u0080\u009d he said in an interview with MarketWatch. â\u0080\u009cBy then consumers had already decided to change their behavior.â\u0080\u009d The recent decline in consumer confidence does not bode well for the economy in the short run, Leer said. â\u0080\u009cConsumers over the past month have grown more pessimistic,â\u0080\u009d he noted, mainly in new hotspots in the South and West. Confidence has remained relatively stable in the Midwest in Northeast where the spread of the disease has slowed. A raft of other data also signal that economic growth flat-lined in July, posing a roadblock to workers returning to their jobs. The government on Friday is expected to report that hiring slowed in July after big gains in the prior two months, an outcome foreshadowed by a separate ADP survey of private-sector jobs. â\u0080\u009cI think itâ\u0080\u0099s highly unlikely that we see the situation improve in July,â\u0080\u009d Leer said. Read: ADP says private sector job growth slows sharply in July The loss of momentum probably wonâ\u0080\u0099t be temporary, either. High unemployment, depressed business conditions and a Congress sharply divided over what kind and how much financial aid it should provide are likely to hinder a recovery for a while. Morning Consult:No evidence high jobless benefits stop people from going back to work â\u0080\u009cYou get this picture of weakening consumer demand and millions of households struggling to pay their bills in a high level of business uncertainty and a weakening labor market,â\u0080\u009d Leer said."}]}