{"article": [{"url": "https://www.marketwatch.com/story/weekend-reads-what-to-know-now-that-president-trump-has-the-coronavirus-2020-10-02", "published": 1601716700.0, "headline": "Weekend reads: What to know now that President Trump has the coronavirus", "body": "President Trump’s announcement that he and his wife Melania had tested positive for the coronavirus has shaken up his re-election campaign with just 32 days to go until Election Day. Here’s what we know so far and what could happen next. More coverage and reaction: • Why Trump has higher risk of more a severe case of COVID-19 • A look back at his shifting statements on face masks and the severity of COVID-19 • Trump’s positive coronavirus test puts spotlight on presidential line of succession • Opinion: Why Trump’s virus infection resonates globally, and adds a new layer of uncertainty to world affairsA new contact tracing app New York’s government has launched a smartphone app called Covid Alert NY that will warn people if they are within six feet of other app users and compile lists of close contacts. If a user of the app becomes infected with the coronavirus, they can decide whether or not to have alerts sent to the app’s contact list. Several other states will be participating.The virus and the repo man A laborer in Arkansas is struggling to pay off about $7,000 on a used 2013 Toyota Corolla that belonged to his father, who died of COVID-19 in July. Joy Wiltermuth captures the painful personal financial fallout from the coronavirus crisis on essential workers. Bloomberg The guacamole IPO Mission Produce AVO, +2.20% — which provides avocados to Walmart, Costco Wholesale and Chipotle Mexican Grill, among others — went public on Thursday. Tanya Garcia shares five things to know about the avocado producer.Social Security Howard Gold provides strategies for couples to get the most out of Social Security. Retirement warnings Teresa Ghilarducci, a professor at The New School in New York City and expert on retirement planning, believes that half of Americans aged 55 or older will retire in poverty or near it. Read on:What’s the biggest threat that retirees face? iStock/Getty Images Avoiding humidity in retirement When readers ask for Silvia Ascarelli’s advice about where to live when they retire, they often complain about humidity. The MarketWatch retirement location tool now has been expanded with new selection criteria, including humidity and availability of medical care. Broadening your investment horizons One way people try to diversify their investments is with an S&P 500 SPX, +0.87% index fund. But Paul Merriman has simple advice to give you much more diversification and hopefully better long-term performance. A Carvana Co. vending machine in Westminster, Calif. Bloomberg Another transportation revolution — used cars Electric vehicles are causing tremendous changes around the world as people and governments make the switch and old car companies struggle to compete with Tesla TSLA, +1.89%, whose share price has soared 419% this year. But there is another important transformation taking place: the used-vehicle market is moving online. Here are eight stocks professionals investors are looking at to play this long-term trend. What a hotter Arctic means for the globe Dramatic changes in the Arctic suggest climate change could return Earth to Pliocene conditions of 3 million years ago. Florida and California’s Central Valley would be under water, and it would be too hot to grow corn and wheat in the Midwest and Great Plains. Want more from MarketWatch? Sign up for this and other newsletters, and get the latest news, personal finance and investing advice."}]}