{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-health-experts-express-alarm-at-cdc-change-in-testing-guidelines-that-exclude-asymptomatic-patients-2020-08-26", "published": 1598454260.0, "headline": "Coronavirus update: Health experts express alarm at CDC change in testing guidelines that exclude asymptomatic patients", "body": "Health experts expressed alarm Wednesday at news that the Centers for Disease Control and Prevention had changed its guidance on testing for COVID-19 and will no longer recommend a test for people who show no symptoms. As asymptomatic carriers are a key reason for the spread of the virus, the news was widely criticized on social media and elsewhere. “You do not necessarily need a test unless you are a vulnerable individual or your health-care provider or state or local public health officials recommend you take one,” the CDC said. That marks a change from previous guidance that people who had spent more than 15 minutes with an individual who had tested positive for the virus should also get tested, regardless of the presentation of symptoms. The U.S. has conducted more than 73 million tests this year, and about 6 million of them have come back positive, according to the COVID Tracking Project. Coming just days after the head of the Food and Drug Administration, Stephen Hahn, was forced to acknowledge that a comment he made Sunday about the use of convalescent plasma as a treatment for hospitalized COVID-19 patients was inaccurate, the news is a second blow this week to the credibility of a leading U.S. public health agency. “Our work on the ‘silent’ spread underscores the importance of testing people who have been exposed to COVID-19 regardless of symptoms,” Alison Galvani, an epidemiologist and director of the Center for Infectious Disease Modeling and Analysis, tweeted. “This change in policy will kill.” New York Gov. Andrew Cuomo said the move was political, “not science.” iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } It is estimated that up to 40% of people who have COVID-19 are asymptomatic, meaning they do not demonstrate common symptoms of an infection like coughing or muscle aches, according to one research letter published in May in JAMA Network. The news also comes after the U.S. counted 38,200 new cases on Tuesday, according to data compiled by Johns Hopkins University, up a few hundred from Monday though better than last week when cases were above 40,000 most days. In all, 5.79 million people in the U.S. have been infected, or roughly a quarter of the global total, according to the Johns Hopkins data. There have been more than 179,000 deaths in the U.S., by far the highest in the world. On a per capita basis, the U.S. currently ranks fifth in the world with 54.55 deaths per 100,000 people, after Peru, Spain, Chile and Brazil. Rural Illinois is emerging as something of a hot spot with cases up 14% from the average of two weeks ago, according to a New York Times tracker. Illinois counted 1,756 new cases on Tuesday and 32 new deaths. The state has had at least 225,812 confirmed cases of COVID-19 and 8,155 deaths since the start of the outbreak. In other news: • The Trump administration has threatened to cut Medicare and Medicaid funding to hospitals if they do not report COVID-19 patient data and rest results to the Department of Health and Human Services, the Associated Press reported. The threat was included in new emergency rules announced by the Centers for Medicare and Medicaid Services. The program has been voluntary until now. The new rules also apply to nursing homes. The American Hospital Association called the new rules a “heavy-handed regulatory approach” and complained that it was not consulted. “This disturbing move, announced in final form without consultation, or the opportunity to provide feedback through appropriate administrative procedures prior to it becoming effective, could jeopardize access to care and leave patients and communities without vital health services from their local hospital during a pandemic,” Rick Pollack, president and CEO of the association, said in a statement. The rule “should be reversed immediately,” he said. See:WHO says plasma treatment touted as breakthrough by Trump is unproven, advises caution • In a sign of just how far and wide COVID-19 can spread without containment measures, an international meeting held by Biogen Inc. BIIB, -0.13% in February led to about 20,000 cases in four counties in Massachusetts by early May, way more than the 99 previously identified, the Boston Globe reported, citing three scientists involved in a new study. The study, which has not yet been peer-reviewed, was backed by National Institute of Allergy and Infectious Diseases, the CDC and private donors including the Bill and Melinda Gates Foundation and the Chan Zuckerberg Initiative. “Our results highlight the failure of measures to prevent importation into [Massachusetts] early in the outbreak, underscore the role of superspreading in amplifying an outbreak in a major urban area, and lay a foundation for contact tracing informed by genetic data,” the authors wrote. • There are growing concern that Lebanon could lose control of the virus, after a spike in cases following the massive explosion in capital Beirut on Aug. 4, the Guardian reported. The country’s interim prime minister, Hassan Diab, said the number of new infections is climbing fast, “and if this continues, we will lose control of this epidemic,” he said, according to a statement issued by the supreme defense council. Lebanon counted 525 new cases on Tuesday and 12 deaths, the paper said. Cases doubled in the two weeks after the explosion, which left many people homeless and damaged hospitals. • Germany recorded 1,576 new cases of COVID-19 on Tuesday, up from 1,278 on Monday, according to Der Spiegel, citing data from the Robert Koch Institute. That comes after more than 2,000 cases were reported on Saturday, the first time Germany has exceeded that number in a single day since late April. • U.S. universities are still seeing rising numbers of new cases as students return to dorm rooms and college bars, even though many have not yet returned to classes. At least seven universities, mostly in the South, have counted at least 500 cases, according to a New York Times survey, while another 30 have at least 200 confirmed cases. In all, there have been 26,000 confirmed cases at 750 colleges, the survey found. College Town Economies Brace for Covid Blow Latest tallies The global tally for confirmed cases of COVID-19 edged closer to 24 million on Wednesday, with the death toll rising to 819,945, according to data aggregated by Johns Hopkins University. At least 15.6 million people are confirmed to have recovered. Brazil is second to the U.S. with 3.7 million cases and 116,580 deaths. India is third measured by cases at 3.2 million, followed by Russia with 968,297 and South Africa with 613,017. Mexico has 568,621 cases and 61,450 deaths, the third highest in the world. See also:Google searches for ‘panic attack,’ ‘anxiety attack’ hit all-time high during coronavirus pandemic India now has 59,459 deaths, putting it ahead of the U.K. That country has 329,869 cases and 41,535 fatalities, the highest in Europe and fifth highest in the world. China, where the illness was first reported late last year, has 89,752 cases, and 4,712 fatalities.What’s the economy saying? Orders for durable goods lasting at least three years surged 11.2% in July, largely because of strong consumer demand for new cars and trucks, but business spending outside the automobile industry was softer, and investment grew more slowly, MarketWatch’s Jeffry Bartash reported. The increase in orders last month — the third in a row — easily topped the 4.8% forecast of economists surveyed by MarketWatch. Demand for industrial goods was less robust if automobiles and airplanes are excluded. New orders rose a smaller 2.4% minus transportation. See also: Stocks will head higher until there’s a reason, besides COVID-19, to stop, one analyst says Car sales have been surprisingly strong during the summer as Americans took advantage of low interest rates and discounted pricing. Bookings in July were actually higher last month compared with July 2019. Orders are likely to moderate soon now that plants have reopened and automobile manufacturers are operating closer to normal capacity. Sales to corporate customers are still depressed, and demand usually wanes in the fall. Airline orders only declined half as much in July as they did in June, the government said, reflecting fewer cancellations. That also contributed to the better-than-expected increase in industrial orders last month. A key measure of business investment, known as core orders, edged up 1.9% last month and has returned close to pre-crisis levels. These exclude defense and transportation orders. Business investment was already weak before the pandemic, however, and is unlikely to regain full strength until the virus is brought under control at home and abroad. The disease has wreaked havoc on the global trading system and forced businesses to preserve cash in case the economy worsens. “U.S. durable-goods orders made more progress toward recovering in July despite the resurgence in the virus,” said economist Katherine Judge of CIBC Economics, but “we continue to see the recovery in business investment from here as occurring relatively slowly given the prevalence of spare capacity.” See now: MarketWatch Coronavirus Recovery TrackerWhat are companies saying? • Bed Bath & Beyond Inc.’s BBBY, -1.37% planned reorganization to focus on online sales will result in 2,800 job cuts from corporate headquarters and retail stores, effective immediately. The cuts are designed to strip away management layers and “significantly reposition field operations to better serve customers in a digital-first shopping environment,” the company said. The reorganization will result in about $150 million in annual pretax cost savings, Bed Bath & Beyond said. The company is taking steps to improve its shopping experience in store and online, building on the recent introduction of its buy online, pick up in store option and curbside pickups in addition to plans to launch “an array of new customer-inspired owned brands in 2021,” it said. “Saying goodbye to colleagues and friends is incredibly difficult, but this component of our comprehensive restructuring program is critical to rebuild the foundation of our business, construct a modern, balanced and durable business model, and meet the structural shift in customer shopping and service preferences that we have seen accelerate as a result of COVID-19,” Chief Executive Mark Tritton said in a statement. • Dick’s Sporting Goods Inc. DKS, -1.09% reported second-quarter earnings and sales that blew past expectations, as shoppers returned to stores as they reopened during the pandemic. Same-store sales rose 20.7%, beating the FactSet consensus for a 10.5% increase. E-commerce sales increased 194%. The company ended the quarter with $1.1 billion in cash and equivalents and no outstanding borrowings after repaying $1.4 billion from its $1.855 billion revolving credit facility. Dick’s Sporting Goods recently extended its 15% pay premium to workers through the end of the year. The retailer did not provide financial guidance due to the uncertainty from the coronavirus pandemic. Through the first three weeks of the third quarter, same-store sales increased 11%. • Nordstrom Inc. JWN, -2.18% reported second-quarter sales that missed Wall Street expectations as losses have widened during the pandemic. Nordstrom’s e-commerce business “continued to experience significant growth” in new customers of more than 50%, the retailer said. Operating cash flow of more than $185 million was above company expectations and allowed Nordstrom to pay down $300 million on its revolving line of credit, the company said. Nordstrom ended the second quarter with $1.3 billion in liquidity, including $1 billion in cash. “We’re confident that we can improve sales trends in the second half of the year and beyond,” President Pete Nordstrom said in a statement. “Our inventories are current and in-line, and we’re focused on amplifying relevant categories, brands and trends to meet customers’ changing preferences.” • Urban Outfitters Inc. URBN, +0.53% swung to a surprise second-quarter profit, and sales beat Wall Street expectations thanks to online sales. Same-store sales decreased 13%, with the drop for bricks-and-mortar stores, closed for part of the quarter due to the pandemic, offset by online sales. “I’m pleased to announce [Urban] produced solid revenues and profits for the second quarter driven by strength in the digital channel,” Chief Executive Richard A. Hayne said in a statement. “Notably, all brands were profitable and enter the fall selling season with lean inventories and positive momentum.” Besides the namesake stores, other Urban Outfitters brands include Free People and Anthropologie."}]}