{"article": [{"url": "https://www.marketwatch.com/story/consumer-sentiment-climbs-again-in-june-as-reopening-us-economy-eases-worries-2020-06-12", "published": 1591960820.0, "headline": "Consumer sentiment climbs again in June as reopening U.S. economy eases worries", "body": "The numbers: The step-by-step reopening of the economy and the increase in the number of people returning to work buoyed the spirits of U.S. households in early June, according to a closely followed survey of consumer sentiment. The preliminary reading of the consumer-sentiment survey rose to 78.9 in June from 72.3 in May, marking the second straight increase, the University of Michigan said Friday. Economists polled by MarketWatch had forecast a reading of 75. Read: Consumer prices drop again as pandemic cuts rate of inflation to near zero What happened: Consumers are more hopeful that a U.S. recovery is firmly underway and a record number of participants expect the unemployment to decline from May’s official 13.3% rate. A portion of the sentiment survey that examines how Americans view the present climbed to 87.8 from 82.3 points. Similarly, another part of the survey that gauges attitudes for the next six months moved up to 73.1 from 65.9. Yet even though Americans are alarmed, most still expect tough times in the year ahead. They worry about further viral outbreaks and the threat to the economy from persistently high unemployment. Read:U.S. entered recession in February after end of longest expansion in history “Despite the expected economic gains, few consumers anticipate the reestablishment of favorable economic conditions anytime soon,” said Richard Curtin, the chief economist of the sentiment survey. See:Marketwatch’s Coronavirus Economic Recovery Tracker. Big picture: The latest reading of consumer sentiment shows Americans expect the economy to gradually recover, but they are uncertain how long it will take to get to normal. Many have scaled back plans to buy big-ticket items such as cars and appliances or anything beyond what’s essential until they’re sure they will still have a job and income. The pending expiration of emergency federal jobless benefits could weigh on the minds of consumers in July. What’s helped are extremely low interest rates and deep discounting by businesses desperate to drum up sales, though such price cuts also hurt profits and the ability of companies to retain workers. Read: Revisiting that funky drop in unemployment to 13.3%: Nobody really believes it What they are saying? “Today’s good consumer sentiment report reflects the sea change in hiring, but also shows Americans know the recovery will be a bumpy road,” said Robert Frick, corporate economist at Navy Federal Credit Union. Market reaction:The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% rebounded sharply in Friday trades after a big selloff the day before on fresh worries about a rise in coronavirus cases and a tepid assessment of the economy by the Federal Reserve."}]}