{"article": [{"url": "https://www.marketwatch.com/story/15-women-accuse-washingtons-nfl-team-of-rampant-sexual-harassment-in-front-office-report-2020-07-16", "published": 1594926860.0, "headline": "15 women accuse Washington's NFL team of rampant sexual harassment in front office: report", "body": "“ \"I have never been in a more hostile, manipulative, passive-aggressive environment â\u0080¦ and I worked in politics.\" ” That's Julia Payne, a former vice president of communications with Washington, D.C.'s, NFL team, quoted in a Washington Post report late Thursday describing a \"nightmare\" workplace for women amid a team culture of misogyny and rampant sexual harassment. Fifteen women told the Post they were harassed while working in the NFL team's front office between 2006 and 2019, 14 of whom requested anonymity because they were fearful of legal reprisals from the team. The Post cited interviews with more than 40 current and former team employees, as well as internal documents and text messages. See also: Two ways Washington changing its 'Redskins' nickname could make the team money One woman who agreed to be named, former marketing coordinator Emily Applegate, told the Post she cried at work daily due to the constant harassment and verbal abuse she and other women experienced from top team executives, and the indifference she received after she complained. \"It was the most miserable experience of my life,\" she said. \"And we all tolerated it, because we knew if we complained - and they reminded us of this - there were 1,000 people out there who would take our job in a heartbeat.\" Applegate and the other women gave the Post numerous examples of receiving unwelcome sexual comments or overtures, and being told to wear revealing clothing and to flirt with clients. \"I was propositioned basically every day at training camp,\" one woman told the Post, claiming a coach and staffers invited her to their hotel rooms. Three male members of the team's front office have left their jobs in the past week, all of whom were named in the Post report. Two other executives who were named left their jobs in 2015 and 2018. The team said Thursday it has hired a law firm to review the allegations. While team owner Daniel Snyder was not accused of harassment, many of the women said he set a poor example and tolerated a toxic corporate atmosphere, claiming he verbally abused top executives, even allegedly forcing a male executive to do cartwheels for his entertainment during a staff meeting. A number of women said their experiences with the team ruined lifelong ambitions. \"I am done with the NFL,\" one anonymous woman told the Post, saying it \"has killed any dream of a career in pro sports.\" Last week, the team dropped its longtime nickname following decades of complaints that it was racist, following a revolt by team sponsors."}]}