{"article": [{"url": "https://www.marketwatch.com/story/broadway-shutdown-extended-again-until-may-30-01602256547", "published": 1602242600.0, "headline": "Broadway shutdown extended again until May 30", "body": "Broadway posters outside the Richard Rodgers Theatre in New York on May 13, 2020. Evan Agostini/Invision/AP NEW YORK (AP) — Fans of Broadway will have to wait a little longer for shows to resume — until at least late May. Although an exact date for various performances to resume has yet to be determined, Broadway producers are now offering refunds and exchanges for tickets purchased for shows through May 30. “We are working tirelessly with multiple partners on sustaining the industry once we raise our curtains again,” said Charlotte St. Martin, president of the Broadway League, which represents producers. Broadway theaters abruptly closed on March 12, knocking out all shows — including 16 that were still scheduled to open — and scrambling the Tony Award schedule. Producers, citing health and city authorities, previously extended the shutdown to June 7, then again to Sept. 6 and again to Jan. 3. The new timeframe may complicate a clutch of shows that had planned to open in the spring, including “MJ,” “The Music Man,” “Flying Over Sunset,” “Caroline or Change,” “Plaza Suite,” “American Buffalo” and “The Minutes.” Actors’ Equity Association, the national union that represents actors and stage managers, has urged lawmakers to include arts funding and loans to help those who work in the live performing arts. The move by the Broadway League comes less than a month after the Metropolitan Opera said it will skip an entire season for the first time in its nearly 140-year history and intends to return from the pandemic layoff next September. In London, producer Cameron Mackintosh has said his company’s West End productions of “Hamilton,” “The Phantom of the Opera,” “Mary Poppins” and “Les Miserables” won’t reopen until 2021 due to the pandemic. The John F. Kennedy Center for the Performing Arts in Washington, D.C., has canceled most previously announced performances and events through the end of 2020, as has the Huntington Theatre Company in Boston. Broadway grossed $1.8 billion last season and attracted a record 15 million people. Producers and labor unions are discussing ways theaters can reopen safely."}]}