{"article": [{"url": "https://www.marketwatch.com/story/osterholm-americans-will-be-living-with-the-coronavirus-for-decades-2020-07-30", "published": 1596280040.0, "headline": "Dr. Osterholm: Americans will be living with the coronavirus for decades", "body": "This interview is the first in a series of conversations MarketWatch will conduct with some of the leading voices in the U.S. on the COVID-19 pandemic On Jan. 20, just nine days after Chinese health authorities published the DNA sequence for a new coronavirus that had sickened dozens of people in China, Dr. Michael Osterholm, an epidemiologist at the University of Minnesota, wrote in an email: “I’m certain this will cause our next pandemic.” The next day the Centers for Disease Control and Prevention confirmed the first U.S. case of someone infected with what became known as COVID-19. Since then, as outbreaks intensified and the virus spread to Europe, and then the Americas, Osterholm, a flu expert with experience working in the CDC who heads up the Center for Infectious Disease Research and Policy, has become one of the nation’s leading voices on the pandemic, weighing in on everything from masks to contact tracing. Osterholm’s viewpoint is sobering. The 67-year-old expects the novel coronavirus to be present for the rest of his life. He doesn’t believe the wave theory (a first wave, a lull, followed by other waves) will apply to this pandemic. “That’s not what’s happening here,” he told MarketWatch in an interview. MarketWatch: One of the things I’m pretty interested in is the talk and the hope around a vaccine. Do you think we have misconceptions about what it means when we have a vaccine? Michael Osterholm: Everyone is looking at the vaccine as being a light switch: on or off. And I look at it as a rheostat, that’s going to take a long time, from turning it on from its darkest position to a lightest position. If you’re anticipating a light switch, you’re going to be concerned, confused, and in some cases very disappointed in what it might look like in those first days to months with a vaccine. MarketWatch: I saw a piece in The Atlantic this week and I thought they positioned it well. They described it as the beginning of the end. Osterholm: It won’t be. We will be dealing with this virus forever. Effective and safe vaccines and hopefully ones with some durability will be very important, even critical tools, in fighting it. But the whole world is going to be experiencing COVID-19 ‘til the end of time. We’re not going to be vaccinating our way out of this to eight-plus billion people in the world right now. And if we don’t get durable immunity, we’re potentially looking at revaccination on a routine basis, if we can do that. We’ve really got to come to grips with actually living with this virus, for at least my lifetime, and at the same time, it doesn’t mean we can’t do a lot about it. MarketWatch: Do you think we’re going to see some of these vaccines fail in clinical studies? Osterholm: One of the challenges we have is: what do we mean by fail? What’s the definition? Some people right now have a view that any vaccine that isn’t like the measles vaccine is going to be a challenge, meaning they’ve got to work 93% to 98% of the time. I don’t think there’s any sense that that’s going to happen with this vaccine. That doesn’t mean that there isn’t going to be an effective vaccine at 50%, 60% or 70%. We have to keep watching for safety signals. We have to make sure that over time we can assure the public with open and transparent data that: This is what you can expect in terms of reactions, this is what might have any long-term complications. MarketWatch: When it comes to how medical information is being disseminated, there have been a lot of changes. You’ve done some peer review and work with journals. Do you think some of these preliminary scientific writings are being shared with the public too soon? Osterholm: Oh, absolutely. We’re drinking from a fire hose right now in terms of new information. You can make the case that’s important because we’re in a position to learn things that could have a very real impact on patient outcome and therefore getting the data out are critical. But then there’s a downside to that, too, because with that comes an increasing amount of marginal if not potentially erroneous information. MarketWatch: Do you think we’re going to see distinct waves of outbreaks in the U.S.? Osterholm: No, no. They’re not waves. We’ve never had a pandemic due to coronavirus before. We’ve had influenza pandemics. With an influenza pandemic, you do get true waves, meaning you get a first big peak of cases, then the numbers come down substantially without any human intervention. It’s nothing we do. We’ve never understood why that happens, and then a few months later you get a second wave. At this point, that’s not what’s happening here. This is like a forest fire, full steam ahead. And wherever there’s human wood to burn, it’ll do it. What we see, though, are these spikes in cases where human mitigation strategies ended, or they’re not adhering to them ... This is just one constant pressure that’s occurring. MarketWatch: And human mitigation [like mask wearing or social distancing] declines? Osterholm: Right. And everyone’s expecting it. Look at Hong Kong, which is doing an outstanding public health follow up, and yet they are still having a problem. Think of this like a big forest fire. If you’re in the way of it, you’re going to get burned. The best we can do is try to put out as much as we can. But even knowing that, if you just suppress it, it’s going to come back. The embers are still there because we never really put it out. MarketWatch: What do you think the biggest failure in the U.S. response has been? Osterholm: We’ve failed because we declared victory over the virus when we had no business doing so. This virus has been poised to be transmitted in our communities, and we thought we had done enough to get it down. It’s like a fire crew. “I only put out half the forest fire but you know, I put out half so we’re done.” And then look what happened. It’s burned more acres since we gave up than it did before we gave up. MarketWatch: What was that moment when you realize the seriousness of this virus? Osterholm: I just could tell based on all the data we had, and it was one of those “oh my God” moments. No one knew for certain how a coronavirus is going to act, and, unfortunately, it’s fulfilling all my worst nightmares. One challenge that is yet to really be understood is just what kind of durable immunity we get from infection and vaccine. We’re making assumptions right now that’s going to last. If it doesn’t, that really complicates things. If you have double, triple, and quadruple jeopardy with this virus, that’s not a pretty picture. MarketWatch: Are we getting going to get close to [herd immunity] by a vaccine? Or is the goal to keep as many people safe as possible? Osterholm: Again, it goes back to the question we just discussed: is there durable immunity? Because herd immunity is based on the concept that once you have immunity, it stays. One of our goals has been to postpone as many cases we can until the vaccine is available and use that as your means for getting 50% to 70% of the population protected. But we don’t know what immunity means for either natural disease or vaccine. Herd immunity is still, in some ways, that theoretical state to get to but we’re not sure we ever will. This Q&A has been edited for clarity and length."}]}