{"article": [{"url": "https://www.marketwatch.com/story/trump-rally-next-weekend-in-tulsa-labeled-dangerous-by-public-health-experts-2020-06-14", "published": 1592207960.0, "headline": "Trump rally next weekend in Tulsa labeled dangerous by public health experts", "body": "WASHINGTON (AP) — After months away from the campaign trail, President Donald Trump plans to rally his supporters this coming Saturday for the first time since most of the country was shuttered by the coronavirus. Trump will head to Tulsa, Oklahoma — a state that has seen relatively few COVID-19 cases. But health experts question the decision, citing the danger of infection spreading among the crowd and sparking outbreaks when people return to their homes. The Trump campaign itself acknowledges the risk in a waiver attendees must agree to absolving them of any responsibility should people get sick. What makes the rally risk high? Trump’s rally will be held indoors, at a 19,000-seat arena that has canceled all other events through the end of July. Scientists believe the virus spreads far more easily in crowded enclosed spaces than it does outdoors, where circulating air has a better chance of dispersing virus particles. The Centers for Disease Control and Prevention outlines the highest risk events for transmission of the coronavirus this way: “Large in-person gatherings where it is difficult for individuals to remain spaced at least 6 feet apart and attendees travel from outside the local area.” The CDC recommends cloth masks in places where people might shout or chant. Trump’s rallies typically draw thousands of supporters, and campaign manager Brad Parscale has been crowing in recent days that the Tulsa arena is significantly oversubscribed — going on to describe those requesting the free tickets as having participated in a campaign “data haul”: iframe.twitter-tweet { width: 100% !important; } Rally attendees — many of whom in prepandemic times prided themselves on traveling from event to event, attending as many as a dozen in the span of a year — often stand outside in line for hours before passing through airport-style security and cramming into an arena, where they sit side by side or stand shoulder to shoulder. The rallies are typically raucous, with much shouting, cheering and chanting. Some people dance. Many jeer at reporters. Sometimes protesters are met with violence from the charged-up and pro-Trump audience before being removed by security. Many attendees are older, which would put them at higher risk of severe complications from COVID-19. It’s not unusual for several individuals in a Trump rally crowd to require medical attention when the temperature rises. The rallies also typically draw supporters from surrounding towns and states. Some die-hard fans travel across the country from rally to rally like groupies for a band. Dr. Ashish Jha, director of Harvard’s Global Health Institute, called the upcoming Trump rally “an extraordinarily dangerous move for the people participating and the people who may know them and love them and see them afterward.” Trump supporters coming from neighboring cities and states could carry the virus back home, Jha said. “I’d feel the same way if Joe Biden were holding a rally.” Oklahoma cases have been low, but they’re on the rise. In its final phase of reopening, Oklahoma now allows public gatherings of any size as long as organizers consider social distancing. Participants at any large gathering should stay 6 feet apart and wear a cloth face covering when distancing is a challenge, the state health department said. The state has a relatively low death rate compared with the rest of the nation, but new cases are rising. In Tulsa, cases are increasing, with 71 new cases reported Friday. The Tulsa Health Department already was investigating an outbreak linked to an indoor gathering of a large group of people. “I have concerns about large groups of people gathering indoors for prolonged lengths of time,” Bruce Dart, executive director of the Tulsa Health Department, said in a statement Friday. “It is imperative that anyone who chooses to host or attend a gathering take the steps to stay safe.” Dart said the risk of spreading the virus increases with higher numbers of people congregating for longer periods of time. Oklahoma health authorities said that anyone who attends a large public event should get tested for COVID-19 shortly afterward. Shelley Payne, director of the LaMontagne Center for Infectious Disease at the University of Texas at Austin, said the Trump rally meets every criteria for the riskiest type of event. “I would certainly recommend that people wear masks and try to keep as much distance as possible,” Payne said. Julie Fischer, an associate research professor of microbiology and immunology at Georgetown University, said the event could have wide repercussions for the country. “With a little bad luck, that scenario could end in the seeding of community outbreaks of COVID-19 across the U.S.,” she said. Will attendees wear masks and take precautions? The Trump campaign has declined to respond to repeated questions about whether it will require attendees to wear masks, socially distance or take other measures to reduce the risk of virus transmission. Trump has made clear that he believes empty seats are bad optics. “I can’t imagine a rally where you have every fourth seat full. Every — every six seats are empty for every one that you have full. That wouldn’t look too good,” he said in April. Trump also insisted that the marquee event of the Republican National Convention — his acceptance of his party’s nomination for reelection — be moved from Charlotte, N.C., to Jacksonville, Fla., after North Carolina’s Democratic governor refused to promise he would not impose public health restrictions. Housing and Urban Development Secretary Ben Carson, a former neurosurgeon, said Trump’s rallies will be coordinated with health authorities to maintain safety. “As far as the virus is concerned, we have two choices: We can allow it to dominate us, or we can learn as much as we can about it and we can learn how to live with it in a safe, prescribed manner,” Carson said Sunday on Fox News. “And I think the second option is the one that’s going to be adopted.” Why the urgent need to hold a Trump rally? Trump has been eager to resume the rallies that are the centerpiece of his campaign. The president revels in his large crowds. The events let him vent and gauge the kind of rhetoric that will appeal to his ardent political base. They also help his campaign expand its voter databases and will serve as a contrast to Democratic challenger Biden, who has suspended campaign events because of the virus and hasn’t attracted the same size of crowds. See:Trump says he will reschedule 2020 campaign rally in Tulsa that fell on Juneteenth holiday Plus:Black leaders call Trump’s Juneteenth rally in Tulsa ‘a slap in the face’ But the decision to pull the trigger now was driven, in large part, by the mass anti-racism protests that have taken place across the country in the wake of George Floyd’s death in Minneapolis. Campaign and White House officials say the protests — and the limited public health outcry they generated — gave them cover. If it was OK for tens of thousands of people to march through the streets, demanding racial justice, why can’t Trump rally his supporters, too? Of course, the protests were held outside, with many participants wearing masks. “Any large gathering, whether of protesters or ralliers, is dangerous,” Jha said. But infection is less likely at an outdoors moving march than at a crowded event in an enclosed space, he said, citing the air flow. Trump campaign will not take responsibility for attendees’ well-being. The Trump campaign, in recognition of the risk, has tried to protect itself from lawsuits with waiver language on its registration website. “By clicking register below, you are acknowledging that an inherent risk of exposure to COVID-19 exists in any public place where people are present,” the campaign advised those signing up for the rally. “By attending the Rally, you and any guests voluntarily assume all risks related to exposure to COVID-19 and agree not to hold Donald J. Trump for President, Inc.” liable for illness or injury. Read on:Trump seeks rapid return to normal, including Tulsa rally — whose attendees must sign a health release"}]}