{"article": [{"url": "https://www.marketwatch.com/story/oil-on-track-for-july-gain-as-dollar-slumps-2020-07-31", "published": 1596210080.0, "headline": "Oil ends higher to log July gain as traders brace for added supply", "body": "Oil futures ended higher Friday, logging a monthly gain, as investors weighed an uncertain demand outlook and an expected rise in supplies as major producers relax output curbs. West Texas Intermediate crude for September delivery CL.1, -1.62% US:CLU20 rose 35 cents, or 0.9%, to close at $40.27 a barrel on the New York Mercantile Exchange, while October Brent crude BRN00, -0.07%, the global benchmark, added 27 cents, or 0.6%, to finish at $43.52 a barrel on ICE Futures Europe. WTI logged a monthly rise of around 2.6%, while Brent rose more than 5% for July. Some analysts see scope for the rebound in oil prices off recent lows to bring back sufficient production to cap the potential for further price rises. “Prices have rebounded, and they are currently near break-even levels for many producers — we believe this will encourage producers to bring back shut-in supply and even drill more, wrote analysts led by John LaForge at Wells Fargo Investment Institute, in a Friday note. “The capacity to increase oil supply is significant both in the U.S. and abroad. Any price increase from current levels is likely to be met with an overeager deluge of supply,” they said. “This should keep a lid on oil prices moving meaningfully higher from current levels.” Some analysts see the market potentially struggling with an expected uptick in production as the Organization of the Petroleum Exporting Countries and its allies, a group collectively known as OPEC+, prepare to relax output curbs by 2 million barrels a day beginning Saturday. “Despite the resilient and rangebound nature of oil pricing over recent weeks, plateauing global demand and increasing OPEC+ output raises the question of whether the market can absorb additional barrels,” said Michael Tran, commodity analyst at RBC Capital Markets, in a note. “Marginal barrels continue to find buyers but the outlook appears increasingly challenged and indication of upside potential to Norway’s Johan Sverdrup field beyond 470,000 barrels a day is yet another headwind,” Tran said. Oil maintained gains after oil-field services company Baker Hughes said the number of U.S. oil rigs dropped by 1 to 180 this week. Analysts said oil has been buoyed by a slump in the dollar, with the ICE U.S. Dollar Index DXY, -0.58%, a measure of the currency against six major rivals, dropping to a more-than-two-year low this week and tumbling more than 4% in July, on track for its biggest monthly decline since September 2010, according to FactSet. The index caught a bounce Friday, however, rising 0.3%. A weaker dollar can support commodities priced in the unit, making them cheaper to users of other currencies. September gasoline futures US:RBU20 fell 1.6% to $1.1711 a gallon, while September heating oil rose 1% to $1.224 a gallon. September natural-gas futures US:NGU20 dropped 3 cents, or 1.6%, to finish at $1.799 per million British thermal units."}]}