{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-death-toll-climbs-toward-150000-as-covid-19-enters-dangerous-new-phase-2020-08-03", "published": 1596469160.0, "headline": "Coronavirus update: U.S. death toll climbs to 155,000, as COVID-19 enters â\u0080\u0098dangerous new phaseâ\u0080\u0099", "body": "The U.S. tally for new confirmed cases of the coronavirus that causes COVID-19 continued its march toward 5 million, with the death toll topping 155,000, as White House coronavirus task force coordinator Dr. Deborah Birx warned that the pandemic has entered a â\u0080\u009cnew phase.â\u0080\u009d Birxâ\u0080\u0099s warning came after President Donald Trump continued to push his belief that the increase in cases was only a result of increased testing. He tweeted over the weekend that Dr. Anthony Fauci, his administrationâ\u0080\u0099s top infectious disease expert, was â\u0080\u009cWrong!â\u0080\u009d for suggesting the U.S. failed to properly respond to the outbreak, while other countries did. New COVID-19 cases reached 4.69 million in the U.S., with the death toll rising to 155,124, according to data aggregated by Johns Hopkins University. Nearly 1.5 million people have recovered. New daily cases have increased in the past week in 13 states, the data show, and 13 states have seen more than a double-digit percentage of tests turn out positive for COVID-19. The stock market continued to look past the new case and death tolls, with the Dow Jones Industrial Average DJIA, +0.56% Â rising solidly and the technology-friendly Nasdaq Composite COMP, +1.39% Â rallying to fresh records. See Market Snapshot. In an interview Sunday on CNNâ\u0080\u0099s â\u0080\u009cState of the Unionâ\u0080\u009d program, Birx said that COVID-19 is now â\u0080\u009cdifferentâ\u0080\u009d from what was seen in March and April, as it is now â\u0080\u009cextraordinarily widespread,â\u0080\u009d into both rural and urban areas. She urged all Americans to keep wearing masks, social distancing and take personal hygiene measures. Donâ\u0080\u0099t miss: Birx warns of pandemicâ\u0080\u0099s dangerous â\u0080\u0098new phaseâ\u0080\u0099 as Pelosi assails her credibility. Also read: Who is Deborah Birx â\u0080\u0094 the doctor that both Trump and Pelosi are now suddenly criticizing? Her dire outlook came hours after House Speaker Nancy Pelosi, on ABCâ\u0080\u0099s â\u0080\u009cThis Week,â\u0080\u009d said as a Trump appointee she had no confidence in Birx, who Pelosi believed should be doing more to refute the misinformation Trump was spreading about the pandemic. On Friday, Fauci said the reason the U.S. continued to see the pandemic spread rapidly in the U.S. was because when the U.S. started shutting down in response the spread of COVID-19, the U.S. only â\u0080\u009cfunctionallyâ\u0080\u009d shut down about 50% of the country, while countries in Europe had shut about 95%+ of their countries. Also read: Heated congressional hearing raises questions about coronavirus testing capacity, protests, Trumpâ\u0080\u0099s messaging. And earlier last week, Johns Hopkins University said the U.S. needed to reset its response to COVID-19, as hospitalization rates matched or exceeded the numbers seen at the peak in the first U.S. hot spot in New York City in March and April. â\u0080\u009cItâ\u0080\u0099s time to reset,â\u0080\u009d a report from the universityâ\u0080\u0099s Center for Health Security said. Trumpâ\u0080\u0099s response on Saturday was emphatic: iframe.twitter-tweet { width: 100% !important; } Meanwhile, the White House, Senate Republicans and House Democrats have reportedly made progress on a new coronavirus relief bill, but have yet to reach an agreement on restoring the $600-per-week supplemental unemployment benefit although that benefit expired on Friday. Admiral Brett Giroir, assistant secretary for the Department of Health and Human Services, was asked on NBCâ\u0080\u0099s â\u0080\u009cMeet the Pressâ\u0080\u009d on Sunday whether the U.S. can improve its testing strategy, tried to put it â\u0080\u009cin contextâ\u0080\u009d by saying testing was being used â\u0080\u009cselectively.â\u0080\u009d â\u0080\u009cObviously, we want to increase testing, and weâ\u0080\u0099ve done that,â\u0080\u009d Giroir said. He emphasized that what was â\u0080\u009cincredibly importantâ\u0080\u009d to controlling the coronavirus was to wear masks, but that 85% to 90% of people had to wear masks and avoid crowds. When asked whether that means the U.S. should implement a national mask mandate, Giroir said it â\u0080\u009creally has to be voluntary by the American people,â\u0080\u009d whether itâ\u0080\u0099s mandated by cities or states. Regarding Trumpâ\u0080\u0099s continued touting of antimalarial drug hydroxychloroquine as a treatment for COVID-19, despite trials showing it didnâ\u0080\u0099t provide a benefit, Giroir said: â\u0080\u009cRight now, hydroxychloroquine, I canâ\u0080\u0099t recommend that.â\u0080\u009d He did say, however, that therapies such as Gilead Sciences Inc.â\u0080\u0099s GILD, +0.82% Â remdesivir and steroids were effective, and that a vaccine was â\u0080\u009creally on the horizon.â\u0080\u009d Meanwhile, the World Health Organization warned Monday that there might never be a â\u0080\u009csilver bulletâ\u0080\u009d for the coronavirus, according to Agence France-Presse (AFP). That comes after Dr. Michael Osterholm, an epidemiologist at the University of Minnesota who predicted in January that the coronavirus would become the next pandemic, told MarketWatch that he believed Americans will be living with the coronavirus for decades.Latest tallies There are now 18.15 million confirmed cases of COVID-19 world-wide, the Johns Hopkins data show, and at least 690,624 people have died. More than 10.7 million people have recovered. Brazil is second to the U.S. with 2.7 million cases and 94,104 deaths, but is first with nearly 2.1 million recovered. India is third measured by cases at 1.8 million, followed by Russia with 854,641, South Africa with 511,485 and Mexico with 439,046. The U.K. has 307,251 cases and 46,295 fatalities, the highest in Europe and fourth highest in the world. Mexico has risen to third in the world in deaths with 47,746. China, where the illness was first reported late last year, has 88,065 cases, and 4,672 fatalities. The Philippines, which saw its new caseload surpass 100,000, has ordered a renewed lockdown, and Australiaâ\u0080\u0099s Victoria state imposed a â\u0080\u009cstate of disasterâ\u0080\u009d as new restrictions were imposed across the region, according to an Associated Press report.Whatâ\u0080\u0099s the latest medical news? Eli Lilly & Co. LLY, +2.20% Â said Monday that it has started a Phase 3 trial for a treatment that aims to prevent COVID-19 infections in residents and workers in nursing homes. The trial, expected to enroll 2,400 people by September, will be conducted with the National Institute of Allergy and Infectious Diseases, with plans to release the late-stage data sometime in the fourth quarter. Lilly is testing an experimental antibody it developed with the privately held AbCellera Biologics Inc. to see if it can prevent infections in people who live or work in a facility that has recently reported a case of the coronavirus. The antibody was identified in the blood sample of one of the first people in the U.S. to test positive for the virus. Also Monday, AbbVie Inc. ABBV, +0.41%, Amgen Inc. AMGN, -1.41% Â and Takeda Pharmaceutical Co. Ltd. TAK, +0.16% Â 4502, +1.56% said they have started enrolling patients in a clinical trial testing three of their drugs as treatments for severely ill and hospitalized COVID-19 patients. The companies are using a platform aimed at minimizing the number of clinical-trial participants and the time it takes to test those drugs under an umbrella group called the COVID R&D Alliance. GlaxoSmithKline PLC GSK, +1.10% Â GSK, +1.52% Â and Sanofi SNY, +0.89% Â SAN, +1.20% Â said Monday that they are in advanced discussions with the European Union to supply up to 300 million doses of a COVID-19 vaccine. GlaxoSmithKline said the vaccine candidate uses Sanofiâ\u0080\u0099s technology to produce an influenza vaccine, and Glaxoâ\u0080\u0099s adjuvant technology.What are companies saying? â\u0080¢ Avis Budget Group Inc. CAR, +1.28% Â plans to offer $350 million in senior notes due 2027, joining the many companies issuing record amounts of debt during the pandemic. The 5.75% notes will be offered as additional notes under the debt dated as of July 2019, in which $400 million in 5.75% senior notes due 2027 were previously issued. The rental car company expects to use the proceeds from the notes offering to redeem $100 million of 5.50% senior notes due 2023, with the rest to be used for general corporate purposes. The company has said last week that it has $1.5 billion in liquidity at the end of the second quarter, and estimated that cash burn would be approximately $900 million, including $100 million in debt retirement. â\u0080¢ Clorox Co. CLX, +0.90% Â reported a fiscal fourth-quarter profit and revenue that beat expectations, as it benefited from demand for cleaning products as a result of the pandemic, while providing an in-line outlook. Sales grew 21.9% to $1.98 billion to beat the FactSet consensus of $1.87 billion, as household and wellness sales, which includes cleaning and professional products, rose 33%. For fiscal 2021, the company expects EPS to be down in the mid-single-digit to be up in the mid-single-digit percentage range, while the FactSet consensus of $7.35 implies a 0.1% decline. â\u0080¢ Upscale department-store chain Lord & Taylor and its owner, clothing rental startup Le Tote Inc., have filed for chapter 11 bankruptcy protection. The filing Sunday in U.S. Bankruptcy Court in Richmond, Va., came less than a year after Le Tote bought the chain from Hudsonâ\u0080\u0099s Bay Co. in a $100 million deal. Lord & Taylor has 38 locations in the U.S., according to the filing, and about 650 employees. Some of the stores, which have been closed since March due to the pandemic, reportedly had new â\u0080\u009cstore closingâ\u0080\u009d signs put up Sunday. Department stores have been particularly hard hit by the pandemic, and Lord & Taylorâ\u0080\u0099s bankruptcy filing follows those by JCPenney Co. JCPNQ, -3.42%, Neiman Marcus Inc. and J.Crew Co. â\u0080¢ Mack-Cali Realty Corp. CLI, -2.51% Â reported Monday adjusted funds from operations that missed expectations as revenue surprisingly fell, as the real-estate investment trust has experienced challenges as a result of the pandemic. Office collections averaged 96% during the quarter and 98% in July, while residential collections averaged 98% in the quarter and 99% in July. The company didnâ\u0080\u0099t provide financial guidance given the uncertainties associated with the pandemic. Interim Chief Executive MaryAnne Gilmartin said the company has begun its search for a permanent CEO. â\u0080¢ Marathon Petroleum Corp. MPC, -3.21%, fresh from the sale of its gas stations to the owners of the 7-Eleven convenience store chain for $21 billion in the largest U.S. energy deal of the year, posted second-quarter earnings, showing a smaller-than-expected adjusted loss but revenue that lagged behind estimates. Revenue fell to $15.024 billion from $33.529 billion, below the $21.729 billion FactSet consensus. â\u0080\u009cOur second quarter results reflect a full three months of the challenges COVID has created for our business,â\u0080\u009d Chief Executive Michael J. Hennigan said in a statement. â\u0080\u009cWe began April with demand at historic lows. Despite seeing some recovery during the quarter, demand for our products and services continues to be significantly depressed, particularly across the West Coast and Midwest.â\u0080\u009d The company is indefinitely idling its Gallup and Martinez refineries and evaluating a strategic repositioning of Martinez to a renewable diesel facility. Itâ\u0080\u0099s on track to deliver $1.4 billion capex cuts and at least $950 million of operating expense cuts. â\u0080¢ Menswear retailer Tailored Brands Inc. US:TLRD Â , the parent company of Menâ\u0080\u0099s Wearhouse and Jos. A. Bank, filed for chapter 11 bankruptcy protection Sunday, The Wall Street Journal reported. The clothier has been hit hard by pandemic-related store shutdowns, reporting last month that first-quarter sales were down 60%. Since July 1, Tailored Brands has missed interest payments on bonds, slashed its corporate workforce by 20%, announced plans to close up to 500 stores and was notified that it will be delisted by the New York Stock Exchange. The company operated more than 1,400 stores in the U.S. and Canada as of Feb. 1, and employed more than 1,900 people. â\u0080¢ Tyson Foods Inc. TSN, -1.71% Â reported third-quarter earnings that beat expectations. Beef sales fell to $3.65 billion from $4.16 billion last year, though the average price for beef rose 11.6%. Tyson attributed a reduced sales volume to lower capacity caused by a first-quarter fire at a production facility that led to its temporary closure. Average pork prices also rose, up 0.8%, with sales totaling $1.12 billion, down from $1.32 billion. Tyson chicken prices fell 2.4%, and chicken sales fell to $3.11 billion from $3.33 billion. Lower food-service demand hurt chicken sales, the company said. Tyson incurred COVID-19-related incremental expenses of $340 million during the quarter, including worker bonuses, testing and personal protective equipment. Tyson didnâ\u0080\u0099t provide guidance due to the uncertainty surrounding the pandemic. â\u0080¢ Beyond Meat Inc. BYND, +0.80% Â said Monday that its Beyond Burgers will be sold at Walmart Inc.â\u0080\u0099s WMT, +1.00% Â warehouse chain Samâ\u0080\u0099s Club, and at BJâ\u0080\u0099s Wholesale Club Holdings Inc. BJ, +1.19% Â Beyond Meat began selling at Costco Wholesale Corp. COST, +1.19% Â last summer. The news comes just days after rival plant-based burger maker Impossible Foods Inc. began rolling out its Impossible Burgers at nearly 2,100 Walmart Supercenters and Neighborhood Markets nationwide. Walmart is also selling Impossible Burgers on its website."}]}