{"article": [{"url": "https://www.marketwatch.com/story/trump-says-he-thinks-supreme-court-will-rule-on-election-outcome-so-9th-justice-needed-2020-09-23-161035612", "published": 1600881140.0, "headline": "Trump says Supreme Court will need 9th justice to decide election outcome", "body": "President Donald Trump on Wednesday suggested the Supreme Court will have to make a ruling on the Nov. 3 presidential election, so a new justice for the high court should be confirmed before Election Day. “I think it’s better if you go before the election, because I think this scam that the Democrats are pulling — it’s a scam — the scam will be before the United States Supreme Court,” Trump told reporters at the White House, in an apparent reference to efforts to increase mail-in voting during the coronavirus pandemic. “I think having a 4-4 situation is not a good situation, if you get that. I don’t know that you’d get that. I think it should be 8-0 or 9-0, but just in case it would be more political than it should be, I think it’s very important to have a ninth justice.” Related:Biden to senators: Extinguish the ‘flames’ engulfing U.S. politics by not ‘jamming’ through a Supreme Court justice Opinion:Here’s what has to happen for President Trump and Mitch McConnell to seat a new Supreme Court justice before Election Day The Republican-led Senate appears poised to move forward with confirming a replacement for the late liberal Justice Ruth Bader Ginsburg, who died Friday. Four GOP senators could halt a quick confirmation as the party has a 53-47 majority in that chamber, but only two have said they opposed a vote before Nov. 3. Trump on Wednesday said he expects to announce his nominee around 5 p.m. Eastern Time on Saturday. Read more:5 things to know about Trump’s possible Supreme Court picks And see:Democrats score Ginsburg-related surge in donations, after Biden topped Trump last month in cash on hand iframe.twitter-tweet { width: 100% !important; } The president has frequently made unsubstantiated claims about fraud with mail-in ballots, and experts have been pushing back. “I want people to know many of us, and I’m one of them, have looked into vote fraud for decades, and there are certainly isolated examples, but it’s just not there. This is made up. It is a fiction,” said Larry Sabato, director of the University of Virginia’s Center for Politics, said in a webcast last week. Sabato also said “turnout is critical, and if you can increase turnout in either party using mail-in ballots, then you’ll do it. The Republicans are trying to do that in Florida.” Related:Trump suddenly supports mail-in voting — for the key swing state of Florida Some analysts attributed Monday’s selloff for U.S. stocks SPX, +0.87% DJIA, +0.56% in part to the Ginsburg replacement battle amplifying jitters over the election and another coronavirus aid package."}]}