{"article": [{"url": "https://www.marketwatch.com/story/ackman-says-hes-long-term-bullish-on-the-stock-market-but-bearish-on-highly-indebted-companies-11595429359", "published": 1595415440.0, "headline": "Ackman says he's 'long-term bullish' on the stock market but 'bearish' on highly indebted companies", "body": "Pershing Square Capital Management hedge-fund manager Bill Ackman is upbeat on the stock market over the long haul, he told CNBC on Wednesday, but warned that a number of highly leveraged companies in America face a reckoning amid the economic effects of the global viral outbreak. \"We have today a short position in a high-yield index. We are bearish on highly levered companies,\" Ackman said, adding that he is cautious on the market over the coming period. “ 'We are long-term bullish on America; We are long-term bullish on the markets.' ” - Bill Ackman The prominent investor back in March spooked the Street when he warned that \"hell is coming,\" as the COVID-19 pandemic took root in the U.S., bringing global markets to their knees. Reports indicated that Ackman generated $2 billion in profits on a mix of bets on the market in the ensuing period after his comments, which raised eyebrows within the investment community at the time because the investor was seen as deeply bearish on the outlook for the market and economy. The S&P 500 SPX, +0.87% has already gained nearly 46% since putting in a recent low on March 23 in the wake of the coronavirus pandemic. The Dow Jones Industrial Average DJIA, +0.56% has climbed by about 44%, while the technology-heavy Nasdaq Composite Index COMP, +1.39% has surged 56% over the same period, FactSet data show. Ackman's interview with CNBC comes as Pershing Square is making a debut a special-purpose acquisition company, or SPAC, on the New York Stock Exchange. Ackman's investment vehicle, known as Pershing Square Tontine Holdings PSTH.U, intends to seek a minority position in a \"private, large capitalization, high-quality, growth company,\" according to public documents."}]}