{"article": [{"url": "https://www.marketwatch.com/story/supreme-court-reinstates-south-carolina-requirement-that-absentee-ballot-requests-be-witnessed-2020-10-06", "published": 1602064280.0, "headline": "Supreme Court reinstates South Carolina requirement that absentee-ballot requests be witnessed", "body": "WASHINGTON (AP) — The Supreme Court on Monday reinstated a requirement that South Carolina residents voting by mail in November’s election get a witness to sign their ballots. Democrats had sought to have the requirement put on hold because of the coronavirus pandemic, but Republicans had defended it as deterring fraud. While the high court reinstated the requirement as a lawsuit over it proceeds, voters have already started returning ballots. More than 200,000 absentee ballots have been mailed and 18,000 returned, according to the state’s election commission. The court said that any ballots cast before the court’s action Monday evening “and received within two days of this order may not be rejected for failing to comply with the witness requirement.” Don’t miss:Trump wants supporters to ‘watch very carefully’ at the polls — what does he mean, what is a ‘poll watcher,’ and who gets to be one? State Republican Party Chairman Drew McKissick cheered the decision. “Despite the Democrats’ efforts to hijack a pandemic and use it to meddle with our election laws, they’ve lost,” he said in a statement. “We’re pleased the Supreme Court reinstated the witness signature requirement and recognized its importance in helping to prevent election fraud.” State Democratic Party Chairman Trav Robertson expressed disappointment with the decision. “Our hope is that no one gets COVID-19 trying to find a witness. We are disappointed but elections have consequences,” he said in a statement. South Carolina has had a witness requirement for absentee voters since 1953. Under the current law, voters returning mail-in ballots swear an oath printed on the return envelope that confirms they are eligible to vote and that the ballot inside is theirs, among other things. The oath has to be witnessed by one other person who has to sign below the voter’s signature and write their address. Pointing to the coronavirus pandemic, state and national Democratic Party organizations and several individual voters challenged the requirement and other parts of state election law. And a judge blocked the witness requirement before the state’s primary in June. After the primary and response to the pandemic, state lawmakers made changes to the state’s election law, including allowing all residents to vote absentee in November. But they left the witness requirement in place. U.S. District Court Judge J. Michelle Childs, an appointee of President Barack Obama, late last month put the witness requirement on hold for the presidential election. She wrote that it could increase the risk of some voters of contracting the virus and require other voters already infected with the virus to risk exposing witnesses. A three-judge panel of the U.S. Court of Appeals for the 4th Circuit reinstated the requirement before the full appeals court reversed course and put it on hold again. As is typical when the Supreme Court acts on an emergency basis, the justices did not explain their decision. But Justice Brett Kavanaugh, writing only for himself, said he agreed with it for two reasons. He said it wasn’t for a court to second-guess the lawmakers’ decision to retain the witness requirement during the pandemic. And he said that for many years the Supreme Court has “emphasized that federal courts ordinarily should not alter state election rules in the period close to an election.” Three other justices — Clarence Thomas, Samuel Alito and Neil Gorsuch — would have required ballots that have already been returned to have a witness signature to count. The Supreme Court has recently dealt with other cases involving ballot witness requirements for November’s election. In Rhode Island, the court left in place an agreement by state officials to allow residents to vote by mail without getting signatures from two witnesses or a notary. But in Alabama, where a court had put on hold in three large counties a requirement that voters get their absentee ballot notarized or witnessed by two adults, the justices reinstated it. Approximately a dozen states that require mail-in ballot envelopes to be signed by one or more witnesses or a notary. Opinion:Republican attempts to suppress the vote must be stopped Also see: Minor ballot and application issues breathe life into Trump claim of mail-in voting ‘disaster’"}]}