{"article": [{"url": "https://www.marketwatch.com/story/chief-justice-roberts-recently-fell-and-hit-his-head-spent-a-night-in-a-hospital-2020-07-07", "published": 1594165040.0, "headline": "Chief Justice Roberts recently fell and hit his head, spent a night in a hospital", "body": "WASHINGTON — Chief Justice John Roberts spent a night in a hospital last month after he fell and injured his forehead, a Supreme Court spokeswoman said Tuesday night. Roberts was walking for exercise near his home June 21 when he fell, court spokeswoman Kathleen L. Arberg said in an emailed statement. The injury required sutures, she said, and out of an abundance of caution, Roberts stayed in the hospital overnight. Roberts’ injury and hospitalization was first reported by The Washington Post, which reported that the fall happened at the Chevy Chase Club in Maryland. Roberts, 65, suffered a seizure at his summer home in Maine in 2007, causing a fall that resulted in minor scrapes, and had a similar episode in 1993. Arberg said that Roberts’ doctors “ruled out a seizure” this time. “They believe the fall was likely due to light-headedness caused by dehydration,” she said. The fall took place three days after the court grabbed headlines with a 5-4 decision written by Roberts rejecting President Donald Trump’s effort to end legal protections for 650,000 young immigrants. Supreme Court justices are not required to disclose injuries or health issues. However, during the coronavirus pandemic, Arberg has confirmed on a regular basis that the justices are in good health. Other justices, including Justice Ruth Bader Ginsburg, have at times notified the public about hospitalizations. Most recently, in May, when the justices heard arguments by telephone because of the coronavirus pandemic, the 87-year-old Ginsburg made public the fact she was at a Maryland hospital to receive nonsurgical treatment for an infection caused by a gallstone. She spent one night at the hospital and participated in court arguments by telephone from her hospital room. The Supreme Court is wrapping up the release of opinions for cases argued in May. Five cases remain before the court is expected to take its summer break."}]}