{"article": [{"url": "https://www.marketwatch.com/story/new-jersey-postponed-indoor-dining-as-new-york-makes-decision-on-wednesday-why-is-it-so-dangerous-2020-07-01", "published": 1596001520.0, "headline": "After pausing indoor dining, California records over 10,000 new COVID-19 cases. Fauci says itâ\u0080\u0099s more dangerous than outdoors â\u0080\u0094 hereâ\u0080\u0099s why", "body": "In an extensive interview with MarketWatch, Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases for three decades, was on the front lines of the AIDS pandemic in the early 1980s, cautioned people about eating at restaurants. MarketWatch personal-finance editor Quentin Fottrell asked Fauci whether it was really more dangerous to eat indoors at a restaurant than outdoors. Fauci replied that people should think twice before going, â\u0080\u009cYes, absolutely. Indoors is much worse than outdoors.â\u0080\u009d â\u0080\u009cIf youâ\u0080\u0099re going to go to a restaurant, try as best as you can to have outdoor seating that is properly spaced between the tables,â\u0080\u009d Fauci said. â\u0080\u009cI am not going to restaurants right now.â\u0080\u009d His comments come after several states have rolled back their plans to allow indoor dining. “ â\u0080\u0098Indoors is much worse than outdoors.â\u0080\u0099 ” â\u0080\u0094 Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases Last month, Gov. Gavin Newsom announced a rollback of operations state-wide at restaurants as well as bars, zoos, wineries, museums, card rooms, and movie theatres. â\u0080\u009cThis is in every county in the state of California, not just those on the watch list,â\u0080\u009d he said. He said the coronavirus was spreading at an â\u0080\u009calarming rate.â\u0080\u009d In addition, the shutdown also affects indoor operations of gyms, places of worship, offices for non-critical offices, hairdressers, beauty salons, indoor malls, and other places of businesses in 30 counties on Californiaâ\u0080\u0099s â\u0080\u009dmonitoring list,â\u0080\u009d and represent 80% in the state of California. â\u0080\u009cWeâ\u0080\u0099ve made this point on multiple occasions and, that is, weâ\u0080\u0099re moving back into a modification mode of our original stay-at-home order,â\u0080\u009d Newsom said. â\u0080\u009cThis continues to be a deadly disease.â\u0080\u009d He added, â\u0080\u009cItâ\u0080\u0099s a dynamic list. Counties come on and, in some cases, counties come off.â\u0080\u009d As of Wednesday, COVID-19, the disease caused by the virus SARS-CoV-2, had infected 16.7 million people globally and 4.3 million in the U.S. It had killed over 654,103 people worldwide and at least 148,011 in the U.S., according to Johns Hopkins University. “ Prior to Californiaâ\u0080\u0099s state-wide announcement, New Jersey restaurants were set to reopen for indoor dining on July 2, but days before Gov. Phil Murphy said that it wonâ\u0080\u0099t happen. ” California reported 10,042 new cases in California and 167 new deaths on Tuesday, bringing the total number of cases there to 473,500 and deaths to 8,716. New York has the most number of deaths (32,653), followed by New Jersey (15,825) and Massachusetts (8,679). Prior to Californiaâ\u0080\u0099s state-wide announcement, New Jersey restaurants were set to reopen for indoor dining on July 2, but days before Gov. Phil Murphy said that it wonâ\u0080\u0099t happen. New York Gov. Andrew Cuomo, however, only halted indoor dining in New York City, which was set to reopen the week after July 4, and not across the state. â\u0080\u009cThis is a New York City only modification because frankly, itâ\u0080\u0099s a problem that is most pronounced in New York City,â\u0080\u009d Cuomo said earlier last month. â\u0080\u009cNew York State is doing great, but I feel that there are storm clouds on the horizon,â\u0080\u009d he added. â\u0080\u009cOutdoor dining has worked very well all across the state, New York City included,â\u0080\u009d Cuomo said on July 2. That said, â\u0080\u009cthere have been no major outbreaks related to indoor dining,â\u0080\u009d a New York Department of Health spokesman told MarketWatch. “ â\u0080\u0098Thereâ\u0080\u0099s nothing magical about six feet. Thatâ\u0080\u0099s about that average distance respiratory droplets can travel, so being further apart from people is always better.â\u0080\u0099 ” â\u0080\u0094 Ryan Malosh, an infectious disease epidemiologist at the University of Michigan School of Public Health â\u0080\u009cWe have seen spikes in other states driven in part by the return of patrons to indoor dining establishments where they are seated and without face coverings for significant periods of time,â\u0080\u009d Murphy said during a briefing held June 29. So what makes indoor dining riskier? For starters, it can be much harder to space tables further apart when youâ\u0080\u0099re inside. Even though six feet is the widely publicized distance people should maintain from one another to avoid potentially coming in contact with respiratory droplets that can transmit coronavirus, thereâ\u0080\u0099s scientific evidence that these droplets have the ability to travel well beyond six feet. â\u0080\u009cThereâ\u0080\u0099s nothing magical about six feet,â\u0080\u009d said Ryan Malosh, an infectious disease epidemiologist at the University of Michigan School of Public Health. â\u0080\u009cThatâ\u0080\u0099s about that average distance respiratory droplets can travel, so being further apart from people is always better.â\u0080\u009d On top of that, air filtration is generally better outdoors than indoors because particles have more room to be dispersed, Malosh said. â\u0080\u009cOutdoors, a light breeze can disperse particles with no constraint on the distance they can then travel.â\u0080\u009d Diners donâ\u0080\u0099t tend to wear masks outdoors. If people wear masks indoors, however, that can significantly lower the chances of dispersing virus-containing particles, said Thomas Russo, chief of the division of infectious disease at the University at Buffalo. “ â\u0080\u0098Itâ\u0080\u0099s already going to be dicey going into the school year and getting elementary students to wear masks is going to be hard, but itâ\u0080\u0099s an important activity thatâ\u0080\u0099s much different than going into restaurant indoors.â\u0080\u0099 ” â\u0080\u0094 Thomas Russo, chief of the division of infectious disease at the University at Buffalo In fact, over 140 clients who visited a hair salon based in Springfield-Greene County, Mo. where two stylists tested positive for coronavirus did not contract the virus themselves. The countyâ\u0080\u0099s Director of Health, Clay Goddard, cited the â\u0080\u009cvalue of maskingâ\u0080\u009d as the reason 140 clients and six other employees at the salon did not contract coronavirus. Meanwhile, more than 100 cases of coronavirus were traced back to one bar in East Lansing, Mich. which reopened on June 8. Malosh used this as an example of the increased risk of dining indoors. The bar, Harperâ\u0080\u0099s Restaurant & Brew Pub, has since closed down to install â\u0080\u009cair purifying technology,â\u0080\u009d according to a statement made on Facebook FB, +0.26% Â on June 22. (Harperâ\u0080\u0099s did not respond to MarketWatchâ\u0080\u0099s request for a comment.) Even though malls and movie theaters in some statesâ\u0080\u0099 reopening plans are allowed to reopen after restaurants can reopen for indoor dining, Russo said indoor dining poses greater risks. Related: How COVID-19 could spread on college campuses. Will students be safe? â\u0080\u009cWhenever thereâ\u0080\u0099s a scenario where everyone can wear masks at all times the risk is lower,â\u0080\u009d Russo said. â\u0080\u009cWhen eating you physically canâ\u0080\u0099t wear a mask but you can minimize that risk by popping it back on between bites.â\u0080\u009d States like New York and Jersey which have been hit particularly hard by the virus, are also planning to reopen schools in the fall and â\u0080\u009cwant to start off the school year with the best possible conditions,â\u0080\u009d Russo told MarketWatch. â\u0080\u009cItâ\u0080\u0099s already going to be dicey going into the school year and getting elementary students to wear masks is going to be hard, but itâ\u0080\u0099s an important activity thatâ\u0080\u0099s much different than going into a restaurant indoors.â\u0080\u009d"}]}