{"article": [{"url": "https://www.marketwatch.com/story/ballot-drop-boxes-are-safe-secure-and-have-been-used-by-republicans-and-democrats-for-decades-so-why-is-trump-bashing-them-2020-08-24", "published": 1601457800.0, "headline": "Ballot drop boxes are safe, secure and have been used by Republicans and Democrats for decades â\u0080\u0094 so why is Trump bashing them?", "body": "Thereâ\u0080\u0099s no denying that COVID-19 has thrown a wrench into the U.S. elections, upending Americans' expectation that everyone will vote on the same day. Thankfully, we have safe alternatives to the traditional Election Day act of closing a curtain and pulling a lever at a polling place. Absentee voting, early voting and ballot drop boxes are tried-and-true tools that states can easily use so people can vote safely during this pandemic. The problem is that Americans aren't just dealing with a once-in-a-century pandemic. We are also faced with a president who is intent on undermining trust in our elections with false claims of voter fraud, and who creates partisan friction over non-partisan issues. While mail-in voting has primarily been in the presidentâ\u0080\u0099s cross-hairs, another essential voter tool is under attack from the Trump administration: ballot drop boxes. Unsurprisingly, President Donald Trump has taken to Twitter to make his case: â\u0080\u009cSome states use â\u0080\u0098drop boxesâ\u0080\u0099 for the collection of Universal Mail-in Ballots,â\u0080\u009d the president tweeted on Aug. 17. â\u0080\u009cSo who is going to â\u0080\u0098collectâ\u0080\u0099 the Ballots, and what might be done to them prior to tabulation? A Rigged Election? So bad for our Country. Only Absentee Ballots acceptable!â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } This assertion couldnâ\u0080\u0099t be more wrong. Ballot drop boxes, like voting by mail, are a safe, secure and a time-tested way of collecting voterâ\u0080\u0099s ballots. These large metal steel containers provide an accessible location where voters can return their absentee or mail-in ballots directly to the local election administrators. Drop boxes have been in use for decades, particularly in Western states. These physically secure receptacles create a number of advantages for running safe elections â\u0080\u0094 especially now, when the U.S. Postal Service is also under threat from the Trump administration. Â Hand-delivering oneâ\u0080\u0099s own ballot instills voters with justified confidence that their vote has been cast, counted and isnâ\u0080\u0099t lost in the ether. Additionally, drop boxes can be available around the clock, allowing voters to cast their ballots whenever it is convenient. During this pandemic, when avoiding crowds is key for protecting public health, more time to vote equals more space to vote safely. Given these advantages, many states are making the smart move to provide voters with this option in the November election. Some states that are either accelerating or expanding the use of drop boxes include: Arizona; Iowa; Michigan; Kansas; Pennsylvania; Washington; California; Colorado; Illinois; Massachusetts; Wisconsin; Idaho; Georgia and South Carolina. To find a drop box near you, check with your stateâ\u0080\u0099s election officials.) Read:Start planning now for how you will vote in November As for Trump's specific concerns about who collects the ballots and what happens to them, his own administration provides the answer. The federal Elections Assistance Commission has clear recommendations on how states can safely and effectively utilize ballot drop boxes. These include: â\u0080¢â\u0080\u0089 24/7 video monitoring of drop boxes to ensure security. â\u0080¢â\u0080\u0089 Bipartisan teams of election officials for ballot collection. â\u0080¢â\u0080\u0089 A strict chain of custody procedures to ensure that only authorized elections officials ever handle ballots. If clear recommendations from the federal agency tasked with helping states run elections arenâ\u0080\u0099t enough to help states get ballot drop boxes right, we can look to existing state procedures to see that these programs work.Â For example, Colorado not only keeps locked drop boxes under 24-hour video surveillance, it also has a bipartisan team of election officials who collect ballots at least once a day. These poll workers track custody of the ballots every step of the way, from the box to an official counting room. With such rigorous standards, itâ\u0080\u0099s no surprise that 75% of all ballots in Colorado are returned via drop boxes â\u0080\u0094 without any taint whatsoever of â\u0080\u009crigged elections.â\u0080\u009dÂ So donâ\u0080\u0099t be distracted by Trump's Twitter rants or his administration's frivolous, unwinnable lawsuits. Ballot drop boxes are a smart, socially distanced and secure way to give you a safe option to cast your ballot. When using a drop box, you can be confident that your vote will be counted and your voice will be heard. Joe Ready is director of U.S. PIRGâ\u0080\u0099s (Public Interest Research Group) Democracy for the People Campaign. More:Trump is openly sabotaging the election, and hereâ\u0080\u0099s how you can stop him Plus: Iâ\u0080\u0099m the Republican secretary of state in Washington â\u0080\u0094 and I believe voting by mail works Â"}]}