{"article": [{"url": "https://www.marketwatch.com/story/critics-of-trump-white-house-decry-latest-friday-night-massacre-as-postmaster-general-sidelines-two-dozen-usps-officials-2020-08-09", "published": 1597049600.0, "headline": "Critics of Trump White House decry latest â\u0080\u0098Friday night massacreâ\u0080\u0099 as postmaster general sidelines two dozen USPS officials", "body": "WASHINGTON (AP) â\u0080\u0094 Mail piling up. Constant attacks from the president. Cuts to overtime as record numbers of ballots are expected to pass through post offices this fall. The success of the 2020 presidential election could hinge on a most unlikely government agency: the U.S. Postal Service. Current signs are not promising. See:Congress urges Postal Service to immediately undo changes slowing mail Plus:Postmaster General Louis DeJoy says election mail will not be slowed down The Postal Service already was facing questions over how it would handle the expected spike of mail-in ballots due to the coronavirus pandemic, but several operational changes imposed by its new leader have led to mail backlogs across the United States as rumors of additional cutbacks swirl, fueling worries about the November vote. â\u0080\u009cIt seems like theyâ\u0080\u0099re just trying to turn customers away from the post office,â\u0080\u009d said Jim Sizemore, president of the American Postal Workers Union chapter in the Cincinnati region. He said his offices are behind on deliveries because of new rules specifying when mail can go out. The pandemic has forced states to expand voting by mail as a safe alternative to in-person polling places. Some states are opting to send ballots to voters or allowing people to use fear of the virus as a reason to cast an absentee ballot. Thatâ\u0080\u0099s led to predictions of an an unprecedented amount of mail voting in the presidential election. Trailing in the polls, President Donald Trump has been sowing public distrust in the Postal Serviceâ\u0080\u0099s ability to adequately deliver ballots and has, without evidence, said allowing more people to vote by mail will result in rampant corruption. The agencyâ\u0080\u0099s new leader, Postmaster General Louis DeJoy, a former supply-chain CEO and a major donor to Trump and other Republicans, has pushed cost-cutting measures to eliminate overtime pay and hold mail until the next day if postal distribution centers are running late. DeJoy, 63, of North Carolina, was tapped to head the service by a Trump-appointed board of governors and started in June. He is the first postmaster general in nearly two decades who is not a career postal employee. DeJoy has said repeatedly that the Postal Service is in a financially untenable position and needs to rein in expenses. This past week, it reported $2.2 billion in losses during the three months that ended in June. Postal leaders want at least a $10 billion infusion from Congress as well as regulatory changes that would end a costly mandate that they fund in advance billions of dollars in retiree health benefits. Key Words (April 2020):White House officials may or may not have dropped â\u0080\u0098v-bombâ\u0080\u0099 but made clear Trumpâ\u0080\u0099s opposition to post-office rescue funds in CARES Act â\u0080\u009cWithout dramatic change, there is no end in sight, and we face an impending liquidity crisis,â\u0080\u009d DeJoy told the Postal Serviceâ\u0080\u0099s governing board Friday, before news emerged that evening that DeJoy had jettisoned or reassigned some two dozen top officials. Observers said his actions appeared to centralize mail-processing power around him. Critics called it the latest â\u0080\u009cFriday night massacreâ\u0080\u009d undertaken by the Trump administration in recent months, joining the ranks of the firings of a number of inspectors general at a variety of agencies and Cabinet departments and Attorney General William Barrâ\u0080\u0099s claim in a Friday-night news release in June that U.S. Attorney Geoffrey Berman of the Southern District of New York was stepping down, only to be answered by a statement from Berman that Barrâ\u0080\u0099s version of events was false. (Barr later said with a laugh in congressional testimony that Berman perhaps didnâ\u0080\u0099t know he was stepping down.) Sen. Elizabeth Warren, a Massachusetts Democrat, said she sees signs of deliberate sabotage in DeJoyâ\u0080\u0099s actions since taking over the agency this summer: iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Memos from post office leadership, obtained by the Associated Press, detailed an elimination of overtime and a halting of late-delivery trips that are sometimes needed to make sure deliveries arrive on time. One document said if distribution centers are running behind, â\u0080\u009cthey will keep the mail for the next day.â\u0080\u009d Another said: â\u0080\u009cOne aspect of these changes that may be difficult for employees is that â\u0080\u0094 temporarily â\u0080\u0094 we may see mail left behind or mail on the workroom floor or docks.â\u0080\u009d Additional records obtained by AP outline upcoming reductions of hours at post offices, including closures during lunch and on Saturdays. Rumors have also circulated about the potential for entire offices to shutter, after the Postal Service told Sen. Joe Manchin, D-W.Va., that regional managers there have identified 12 offices for â\u0080\u009cfeasibility studies.â\u0080\u009d Postal employees have been recently instructed not to talk to news media while on duty, according to another memo obtained by AP. The changes have taken their toll on the Postal Serviceâ\u0080\u0099s 630,000 employees. â\u0080\u009cAs they risk their health each day along with other front-line essential workers, letter carriers have become angry, frustrated and embarrassed by various USPS management initiatives that are now resulting in delayed mail and undelivered routes in many areas of the country,â\u0080\u0099â\u0080\u0099 said Fredric Rolando, president of the National Association of Letter Carriers, which represents nearly 300,000 carriers nationwide. The new policies have angered lawmakers from both parties and drawn criticism from former President Barack Obama, who said the current administration is â\u0080\u009cundermining the Postal Service in an election thatâ\u0080\u0099s going to be dependent on mail-in ballots.â\u0080\u009d DeJoy has been the target of multiple letters from members of Congress who have called on the postmaster general to rescind his measures and have complained about a lack of transparency from the agency. Eighty-four House members, including four Republicans, signed a letter that said it is â\u0080\u009cvital that the Postal Service does not reduce mail delivery hours, which could harm rural communities, seniors, small businesses and millions of Americans who rely on the mail for critical letters and packages.â\u0080\u009d House Speaker Nancy Pelosi, D-Calif., and Senate Minority Leader Chuck Schumer, D-N.Y., had a closed-door meeting with DeJoy this past week to discuss the agencyâ\u0080\u0099s worsening performance and need for emergency funding. Schumer later described it as â\u0080\u009ca heated discussion.â\u0080\u009d Pelosi and Schumer followed up with a letter to DeJoy that said the operational changes â\u0080\u009cthreaten the timely delivery of mail â\u0080\u0094 including medicines for seniors, paychecks for workers, and absentee ballots for voters â\u0080\u0094 that is essential to millions of Americans.â\u0080\u009d Schumer said Monday on MSNBC that the DeJoy meeting â\u0080\u0094 which after three Schumer calls to the newly installed postmaster general went unreturned â\u0080\u0094 was â\u0080\u009ca disgraceâ\u0080\u009d and that DeJoy showed himself to be â\u0080\u009cso far over his head.â\u0080\u009d During a meeting Friday with the Postal Service governing board, DeJoy said the agency is not slowing down election mail and remains committed to fulfilling its role in elections. â\u0080\u009cAlthough there will likely be an unprecedented increase in election mail volume due to the pandemic, the Postal Service has ample capacity to deliver all election mail securely and on-time in accordance with our delivery standards, and we will do so,â\u0080\u009d he said. â\u0080\u009cHowever, as discussed, we cannot correct the errors of the Election Boards if they fail to deploy processes that take our normal processing and delivery standards into account.â\u0080\u009d In West Virginia, Sini Melvin, president of an American Postal Workers Union chapter in a northern part of the state, said she has serious concerns about the post officeâ\u0080\u0099s ability to deliver ballots on time this fall if current policies hold. â\u0080\u009cItâ\u0080\u0099s like theyâ\u0080\u0099re setting us up for failure,â\u0080\u009d she said. Schumer said he and Pelosi insisted that the post office rescind language limiting overtime and hiring and stood ready to address the matter legislatively. The minority leader labeled the post office, particularly in this pandemic era, â\u0080\u009cvitalâ\u0080\u009d and a â\u0080\u009cwellspring of our democracy.â\u0080\u009d MarketWatch contributed."}]}