{"article": [{"url": "https://www.marketwatch.com/story/popular-trading-platforms-td-ameritrade-robinhood-others-face-outages-as-tesla-and-apple-stocks-split-2020-08-31", "published": 1598878220.0, "headline": "Popular trading platforms TD Ameritrade, Robinhood, and others faced outages early Monday as Tesla and Apple stocks split", "body": "Users of a number of popular trading platforms on Monday complained of downed systems, slowness and an inability to trade, coming as two of the two most prominent stocks were trading on a split-adjusted basis for the first time. TD Ameritrade told MarketWatch that the issue has since been resolved but noted that clients had \"experienced high levels of slowness on the TD Ameritrade web platforms and the TD Ameritrade mobile app.\" She said the company was \"working with impacted clients to address any concerns they may have.\" A Robinhood spokeswoman said that \"some customers were experiencing issues with delayed order status updates,\" but said that the issue was fixed and \"Robinhood is operational.\" \"We apologize for the inconvenience,\" the Robinhood spokeswoman said. Neither platform commented on the cause of the slowness or delays. Joe Saluzzi, partner, co-head of Equity Trading at Themis Trading, told MarketWatch that he has been observing a wave of stocks changing hands in Tesla TSLA, +1.89% and Apple shares AAPL, +1.74% and wondered if this could be causing some problems with various online trading systems. \"It's an enormous amount of volume. You can't even blink and they're going through.\" A message from a Twitter handled associated with PJ Matlock, CEO of Atlas Trading in New Jersey, said that Vanguard, Charles Schwab SCHW, +1.29%, and Robinhood were experiencing issues on Monday. He suggested that a wider problem was at play across the Street. The problems come as Apple Inc. AAPL, +1.74% has completed a 4-for-1 stock split and Tesla Inc. TSLA, +1.89% also has split its stock 5-for-1. A number of other changes were taking place in the Dow Jones Industrial Average DJIA, +0.56%, including the inclusion of Amgen AMGN, -1.41%, Salesforce.com CRM, +2.21% and Honeywell International HON, +0.34%. Calls to the other trading platforms weren't immediately returned. Saluzzi said that the problems had appeared to be relegated to the retail platforms, as he didn't see any problems in professional trading systems. Of the likelihood it was associated with the changes occurring in the Dow and with Tesla and Apple, the trading pro said: \"Nothing is coincidental.\""}]}