{"article": [{"url": "https://www.marketwatch.com/story/uk-consumer-confidence-remains-gloomy-2020-08-20", "published": 1597951100.0, "headline": "U.K. consumer confidence remains gloomy", "body": "U.K. consumer confidence remained at deeply depressed levels in August as Britons waited to see what state the economy will be in once it emerges from the coronavirus crisis, data published Friday showed. A measure of consumer confidence compiled by German market research firm GfK held steady at minus 27 this month, unchanged from July. While the overall figure was unchanged, the data suggested that U.K. consumers were becoming increasingly gloomy about the economy but more positive about their own finances and ability to make large purchases. This was perhaps as a result of government measures to support furloughed workers and encourage spending, GfK said, warning these measures won't last indefinitely. A subindex gauging consumers' views on the strength of the economy over the last year fell by one point to minus 62. Another subindex gauging how they felt the economy would perform over the next 12 months also fell by one point to minus 42. Subindexes measuring how U.K. consumers perceived their own financial situation offered a more mixed picture. Consumers reported they were more likely to make large purchases and felt more confident about their finances over the next year, but were gloomier about how much money they had to spend over the last 12 months. Government subsidies to encourage dining out were likely behind those improvements, GfK said. But such measures are unlikely to drive other types of spending, while payments to furloughed workers are set to end in October, which will likely drive up unemployment, the firm noted. \"Employment is now the big issue because the pandemic has ended years of job security,\" said Joe Staton, client strategy director at GfK. GfK based its reading on a survey of 2,000 adults between August 1 and 13 and produces the index on behalf of the European Commission. Write to Will Horner at william.horner@wsj.com"}]}