{"article": [{"url": "https://www.marketwatch.com/story/for-nikola-stock-no-news-was-not-good-news-2020-08-05", "published": 1596695060.0, "headline": "For Nikola stock, no news was not good news", "body": "Wall Street sold off shares of Nikola Corp. on Wednesday, disappointed that the company had no major announcements to take the sting out of a disappointing second quarter. Nikola NKLA, -1.36% shares extended losses on Wednesday, a day after the electric-vehicle maker reported a wider-than-expected adjusted quarterly loss and said the COVID-19 pandemic disrupted its supply chain. Shares traded as low as $32.15, down as much as 17%, before recouping some losses. The stock is on track for its largest one-day percentage drop since July 24, when it fell 12%. Wednesday’s drop also snaps a three-day winning streak and whittles year-to-date gains to 234%, which compare with gains of around 3% for the S&P 500 index. SPX, +0.87% “The company did not report any meaningful new business development along with its 2Q earnings, likely putting large pressure on the stock price today,” Emmanuel Rosner at Deutsche Bank said in a note Wednesday. Related:Fisker is going public: Five things to know about the electric-car maker ahead of its IPO It confirmed, however, it is “well on track” to deliver “critical” milestones over the next few months, including lining up an OEM manufacturing partner for its Badger pickup truck and commercial collaboration partners for its hydrogen stations, and some of the arrangements could be formally announced soon, Rosner said, keeping his rating on the stock at hold. “They seem to involve industry leaders in their respective fields (large commercial fleets, leading pickup manufacturers, global energy companies) which if finalized, could provide solid external validation for Nikola’s business plan,” Rosner said. Analysts at J.P. Morgan led by Paul Coster, said that Nikola’s second-quarter results “basically met expectations.” With the catalysts ahead, “we therefore recommend accumulating shares in NKLA.” Don’t miss:Here’s how much Ford stock has lost under outgoing CEO Jim Hackett The analysts reiterated their equivalent of a buy rating on the shares with a price target of $45, representing upside of around 30% from Wednesday’s share price. Nikola’s first quarter as a public company laid out its long-term vision, Jeffrey Osborne at Cowen said in his note. “Management struck a confident tone” regarding key initiatives for the next few months, he said. Cowen kept its equivalent of a buy rating on the stock and its $79 price target, reflecting “the many unique characteristics to the Nikola story as well as the scarcity value of the first to market zero emission heavy-duty truck company,” Osborne said. See also:Nikola on road to ‘disrupt transportation,’ JP Morgan says “We also note the bevy of items that are not in our model that we believe can accrete to investors over time, which could provide further upside to our price target. We have high confidence that the ecosystem can drive revenue growth and a path to mid-teens EBITDA margins over time.” Nikola went public in June, and shares doubled shortly after. In a matter of days, Tesla Inc. TSLA, +1.89% Chief Executive Elon Musk was urging his company to “go all out” with the Tesla Semi, the Silicon Valley auto maker’s long-haul electric truck expected to be available in 2021. Nikola’s popularity is also part of a wave of IPOs through a special purpose acquisition corporation, or SPAC, also called blank-check companies. Electric-car maker Fisker Inc. also chose to go public through a SPAC."}]}