{"article": [{"url": "https://www.marketwatch.com/story/3-dumb-financial-mistakes-that-made-my-life-harder-11592579825", "published": 1592573840.0, "headline": "3 dumb financial mistakes that made my life harder", "body": "I’ve been managing my own finances for a long time. Along the way, I did some things right that served me well and some things that didn’t—including three big blunders. My money-management journey started when I got into a new middle school that was 12 miles from home. The daily commute involved a short bus ride to the nearest railroad station, a 20-minute trip on a suburban train and then a quick walk. To save money, I skipped the bus ride on my way home and walked instead. My parents okayed it and let me keep the nickels and dimes. My first lesson in frugality turned into a lifetime habit. I was lucky to get an early start on my career in software development. Not only have I enjoyed the work, but also I’ve valued the steady employment and income. I’m fortunate that I never had to worry about missing a paycheck. You’d think that an early start, steady income and good savings habits would be a sure shot recipe for financial success. I thought so, too. But alas, I didn’t know what I didn’t know. My lack of basic financial literacy during the first half of my working life led to three major money blunders. Blunder No. 1: Mistaking the sidelines for the playground. Some people choose to stay on the sidelines, sitting on cash while they await a better time to invest in the stock market. Such market timing is controversial, but at least it’s intentional. In my case, I wrongly assumed that bank accounts and certificates of deposit were good investments for the future. I was clueless about other asset classes and their long-term return potential. Result? Though I saved a lot in my early years, my investment growth was anemic. By not dollar-cost averaging into stocks. I missed out on the magic of stock market compounding. When I learned that asset allocation is the primary driver of investment returns, the cause of my portfolio’s chronic low returns became obvious. I changed course, but the damage already done was huge. Blunder No. 2: Lacking long-term financial goals. I was good at taking care of near-term money matters, but oblivious to longer-term goals. Instead of planning, I was saving aimlessly. My approach proved to be a dumb one. Examples? I rented for too long because I never gave homeownership serious thought. Many friends bought their first homes early on. I could have easily followed suit. Renting vs. owning can be a tricky decision for many folks. But buying would have been a slam dunk in my case—if I had given it some thought. By the time our need for a single-family home in a good school district became obvious, the local housing market was already on a tear. I was almost priced out of the market by the mid-2000s housing bubble. Luckily, I found a small place that met all our important criteria. Even so, I had to stretch, borrowing more than I wanted to. It took me years to get the burden of that mortgage off my back. Blunder No. 3: Underutilizing tax-sheltered accounts. I had always viewed a high tax bill as a nice problem to have. Paying hefty taxes meant I was making good money, right? Wrong. Little did I know that high taxes can also be a sign of financial ignorance, as it was in my case. I still pay the penalty for that ignorance. How? I missed years of IRA contributions because I knew nothing about them. Even my 401(k) contributions were at the default low level—enough to get the full employer match, yet far below the allowable maximum. I saved consistently throughout my working years, but most of it ended up in taxable accounts. I paid a lot of tax on my investment earnings, especially in my high-income years. It took me years to realize my goof. By then, I’d already missed the boat for contributions to both tax-free Roth IRAs and tax-deferred traditional IRAs. Thankfully, my employer’s 401(k) plan offered the chance to make mega-backdoor Roth conversions. I took full advantage of the plan, maximizing both pre-tax and after-tax contributions in an effort to make up for lost time. Did any of these blunders destroy my finances? No. I was protected by my steady career and frugal lifestyle. Still, these mistakes made my financial life much harder than it needed to be. This column originally appeared on Humble Dollar. It was republished with permission. A software engineer by profession, Sanjib Saha is transitioning to early retirement. His previous articles include Freedom Formula, Feelin’ Groovy and Ready or Not. Self-taught in investments, Sanjib passed the Series 65 licensing exam as a non-industry candidate. He’s passionate about raising financial literacy and enjoys helping others with their finances."}]}