{"article": [{"url": "https://www.marketwatch.com/story/a-fast-and-violent-rally-awaits-in-cyclical-stocks-and-it-wont-take-a-vaccine-to-cause-it-one-strategist-says-2020-07-23", "published": 1595495900.0, "headline": "A â\u0080\u0098fast and violentâ\u0080\u0099 rally awaits in cyclical stocks, and it wonâ\u0080\u0099t take a vaccine to cause it, one strategist says", "body": "Right now, there is a tug of war playing out between cyclical stocks and what has become the defensive play, the technology sector, on a seemingly daily basis. â\u0080\u009cWashington and the Fed continue to push money into the system. And if the economy stays weak, then bonds and defensives will do quite well,â\u0080\u009d says Bill Callahan, investment strategist at Schroder Investment Management in New York. â\u0080\u009cIf cases slow down and the economy recovers, youâ\u0080\u0099re going to see explosive moves higher in more cyclical equities and commodities,â\u0080\u009d says Callahan. For now, he jokes, big tech stocks are â\u0080\u009cthe new Treasurys â\u0080\u0094 any hint of bad news sends the tech stocks soaring.â\u0080\u009d From a strictly markets perspective, the recent increase in virus cases has come at a good time, he says. â\u0080\u009cFrom a humanitarian perspective, we donâ\u0080\u0099t want anyone to get sick, and from an economic perspective, we donâ\u0080\u0099t want anyone to have to shut down, but the second spike may have come at a really good time for markets, because it gives Washington the cover to do another huge round of stimulus that gets spent in the real economy,â\u0080\u009d he says. The market experience from April shows that investors just need signs of progress, not certainty, on coronavirus. â\u0080\u009cEventually we know that the cases will peak and move down. And I think that the market is really going to like that, and I think that, in particular, some of the more cyclical stocks will like it,â\u0080\u009d he says. In terms of which sectors would benefit, Callahan highlights the travel and leisure, financials and energy sectors, without identifying particular companies. â\u0080\u009c40 dollars a barrel [for oil] doesnâ\u0080\u0099t work for anyone,â\u0080\u009d he says of energy. The key point he makes, however, is that a full recovery isnâ\u0080\u0099t needed. â\u0080\u009cIf youâ\u0080\u0099re a professional investor, itâ\u0080\u0099s really hard to go to your investors and say, â\u0080\u0098Well, I bought banks instead of Amazon, and thatâ\u0080\u0099s why I underperformed,â\u0080\u009d he says. â\u0080\u009cPeople donâ\u0080\u0099t want to hear, â\u0080\u0098Well the valuations looked whatever.â\u0080\u0099â\u0080\u009d So, everybody is kind of on one side of the boat with the safety tech trade. So when you get better news, that snapback, that closing of the gap between performance is going to be fast and violent.â\u0080\u009d For now, he advises trimming the position on some of the winners and start looking at stocks that are trading as if â\u0080\u009citâ\u0080\u0099s the end of days.â\u0080\u009d The buzz The news on the coronavirus front wasnâ\u0080\u0099t good on Wednesday â\u0080\u0094 increases in deaths, new cases and the positive test rate in the U.S., according to data from the COVID-19 tracking project. Tesla TSLA, +1.89% Â reported a surprise profit for the second quarter, giving the electric-car maker four consecutive periods of profitability and putting it on track to enter the S&P 500 SPX, +0.87%. Software giant Microsoft MSFT, +2.48% Â reported record revenue in its fiscal fourth quarter, and guided to revenue in its key divisions that either met or exceeded Wall Street estimates. AT&T T, -1.01% Â reported a lower-than-expected profit and Twitter TWTR, -0.23% Â reported stronger-than-forecast subscriber numbers. Jobless claims data showed the first increase in weekly claims since late March, as U.S. initial jobless claims rose 109,000 to 1.42 million in week ended July 18. Meanwhile Republican lawmakers are debating the extent of extra jobless benefits as they craft a new stimulus bill. The mayor of Portland, Oregon, was tear-gassed by federal agents in another night of protest, while President Donald Trump said he would send more officers into cities. The markets Stock futures ES00, +1.13% Â seemed to be losing steam as the open approached. Gold futures GC00, +2.17% Â were stronger while silver SI00, +5.96% Â edged back after two days of strong gains. Chinese stocks SHCOMP, +1.67% Â fell on rising U.S.-China tensions, while European stocks SXXP, +0.55% Â were led higher on results from consumer goods giant Unilever UNA, +1.69% Â and Mercedes-Benz owner Daimler DAI, -1.01%. The chart Economists at Citi arenâ\u0080\u0099t optimistic on the likely path of business investment, as this chart shows. â\u0080\u009cAlthough there may be pent-up consumer demand bolstering retail sales, and restocking of inventories boosting industrial production, neither of the rebounds constitutes a recovery. Business investment is the ingredient key for a sustained recovery,â\u0080\u009d they say. Random reads The cast of director Christopher Nolanâ\u0080\u0099s latest movie â\u0080\u009cTenetâ\u0080\u009d has a hard time explaining it. A major U.K. soccer club was willing to hand over $1.25 million to a hacker before a bank intervened. How hydropanels are bringing water to the desert. Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. Be sure to check the Need to Know item. The emailed version will be sent out at about 7:30 a.m. Eastern."}]}