{"article": [{"url": "https://www.marketwatch.com/story/my-grandchildren-give-meaning-to-my-lifewhen-will-it-be-safe-to-see-them-again-2020-09-23", "published": 1600851380.0, "headline": "My grandchildren give meaning to my lifeâ\u0080¦When will it be safe to see them again?", "body": "This article is reprinted by permission from NextAvenue.org. When will I see my grandchildren again? When will it be safe for us to be together? These questions haunt me every morning as I wake up to another day of the pandemic. I miss our grandkids, I yearn for them - and I admit I sometimes feel depressed that I can't see them. It's a combination of separation anxiety and empty nest syndrome that I haven't felt for years. Making a socially distanced visit just isn't possible for us. They live too far away and in opposite directions. Our two grown children, who each have two kids, live in different states: Massachusetts and Maryland. My husband and I live right in the middle, in New Jersey. This used to be ideal for lengthy visits: In 4 ½ hours, we could drive north or south and be with one of them that afternoon. But currently it's just frustrating; far enough away for us to have to stay overnight. Since my husband and I are both in our 70s, it's unsafe for us to emerge fully into the newly reopening world. On this at least, the CDC (Centers for Disease Control and Prevention) and WHO (World Health Organization) agree.Being a grandparent gives meaning to life Although we're healthy, we do have one condition that tags us as vulnerable - we're considered \"elderly.\" OK, not super-elderly, like my amazing, active 94-year-old cousin, but well over 65, the scientific world's threshold for old age. Since retiring from my publishing career almost 10 years ago, I've thrown myself into the role of grandmother. It has given new and profound meaning to my life. I turned my home office into a room for visiting grandkids, complete with a pullout daybed, pink-and-gray bedspread and pillows from Pottery Barn Teen, stuffed animals and a poster by the artist Banksy on the wall - the one with the little girl reaching for the heart-shaped balloon and the graffiti that reads \"There's always hope.\" iframe.twitter-tweet { width: 100% !important; } My bookshelf is loaded with kids' books and art supplies. Every Christmas, we jam the whole family into our suburban townhouse for a week, with the help of port-a-cribs and air mattresses. Before COVID-19, we would drive to see one of our kids' families every few weeks, staying over for a long weekend or more. We were there when needed - when a grandchild was born, during school vacations or to just give their parents a break.Reunions are risky When coronavirus showed up in mid-March, my husband and I were in a rented condo in Sarasota, Fla., awaiting a visit from our son and his family, which included a toddler and an infant. When we had first arrived in early March, the beaches and restaurants were filled. We'd gone to plays, movies and an opera. You might like: Biden's 401(k) plan: Changing tax incentive for retirement is a great idea About a week later, the world changed. We began to hear the term \"social distancing\" and to consciously move our chairs away from others. Eating indoors at a restaurant, when we heard a waiter coughing, we canceled our order, apologized and left. Our son and his wife wisely decided to stay home in Maryland. My husband and I left the rental early and flew back to New Jersey, wearing paper masks and cleaning our armrests with Lysol wipes. That was March 18. Since then, we've been sheltering in place, anxiously keeping up with the news of the virus. We haven't hugged our grandchildren since last Christmas, and this Christmas looks doubtful. With Phase 3 reopenings and schools and day care likely to start again in the fall, our grandkids and their parents will be even more exposed to the virus, making reunions with them fraught with danger.Gratitude for Zoom and FaceTime Yes, we do virtual grandparenting. I give thanks every day for Zoom ZM, +2.89%  and FaceTime. After a few weeks of poorly timed calls (when one or the other of us was in the bathroom), we developed a routine: About five times a week, our son calls us at 7:30 p.m. so we can say good night to our one-year-old and three-year-old granddaughters on FaceTime. We might read them a book (one that we both have copies of), sing a lullaby to them or just chat and smile. We get to blow lots of kisses back and forth. Read: Who is looking out for your retirement? At our son's suggestion, we downloaded Caribu, an interactive activity app that lets us take turns coloring with the little ones and reading books while they turn virtual pages. But our connection keeps freezing and it's hard to get the kids on board with virtual stories. Setting a structure works well with our older grandkids, ages 7 and 9. We have a Zoom meeting scheduled every Friday morning. For an hour, we play games that adapt well to screens, such as Scattergories, 20 Questions, Pictionary and Create a Story (we each add a line and I type them out and email the completed story later). At the end of each session, we read them a chapter of \"Watership Down,\" one of our favorite books. The kids are huge animal lovers and it looks like I might need to censor some of the upcoming violent scenes.'There is always hope' I'm grateful all the kids are young and still excited to visit with their grandparents. I have a friend whose teenage grandkids are mainly interested in hanging with their friends, both virtually and actually. When my friend is on the phone with their parents, the teens will exchange a quick few sentences - if they're around - but then disappear. No matter how busy we try to keep ourselves with other projects, my friend and I share the same feeling of underlying anxiety and depression. Don't miss: Goopa, Mawpaw and Grandma Duck? How do grandparents get their names? Our grandchildren are growing. The littlest just celebrated her first birthday with us via Zoom. The oldest is looking more like a preadolescent - with blue ombre tint on her red hair - and her brother has lost his babyness. I worry that we'll never see them in real life again. Meanwhile, we hope they'll feel our love virtually until the happy day when we can be together physically. I'm dying to see my grandchildren. But I don't want to die from seeing my grandchildren. Until then, I will just have to wait. As the Banksy poster says, \"There is always hope.\" Wendy Schuman has held editorial posts as Beliefnet.com and Parents Magazine. She is currently a freelance writer based in West Orange, NJ. This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}