{"article": [{"url": "https://www.marketwatch.com/story/california-makes-face-masks-mandatory-when-outside-the-home-2020-06-18", "published": 1592497700.0, "headline": "California makes face masks mandatory when outside the home", "body": "SACRAMENTO, Calif. — California will require people to wear masks in most indoor settings and outdoors when distancing isn’t possible under a statewide order issued Thursday. “Science shows that face coverings and masks work,” Gov Gavin Newsom said in a statement announcing the order. “They are critical to keeping those who are around you safe, keeping businesses open and restarting our economy.” A number of other states including Michigan, New York, Maine, Delaware and Maryland already have statewide mask orders in place. See Also:Can the federal government stop the NFL from playing? Plus, other burning questions about the NFL’s return The order comes as California broadly reopens the economy; in most counties, people can now shop, dine in at restaurants, get their hair done and go to church, among other things. Meanwhile, coronavirus cases are increasing, something the state says is expected as more people get tested. More than 3,400 people were in the hospital as of Wednesday, the most patients hospitalized since April. The order will require people to wear masks when inside or in line for any indoor public spaces, in healthcare settings like hospitals and pharmacies, while waiting for or riding public transportation and in outdoor spaces where its not possible to stay six feet apart from other people. Until now, the Democratic governor had let local governments decide whether to mandate masks, an issue that’s become politically fraught as some Americans resist orders to wear them. He said he’s issuing the order now because too many people are going out in public without face coverings as businesses, restaurants and other sectors of the economy reopen. Orange County’s public health officer resigned last week after she faced threats over her order that people wear masks, and the county sheriff said he wouldn’t enforce it. Los Angeles County requires people to wear masks whenever they are outside their homes, as do San Francisco and Santa Clara counties. The state’s news release didn’t say how it would enforce the order or what the penalty would be for people who don’t comply. The order also applies to workplaces where people interact with the public, prepare or package food and share common spaces like hallways and elevators. Office workers would have to wear masks if they can’t physically distance. The order includes several exceptions, including for outdoor recreation and exercise such as walking, hiking, running or bicycling. But if people are doing such activities and cannot stay six feet apart from others, the state says they should wear masks. Other exceptions include: Children under 2, people with medical conditions that prevent them from wearing a mask, people who are hearing impaired or communicate with people who are hearing impaired and people obtaining receiving treatments on their nose and mouth. There’s also an exception if wearing a face covering would violate workplace safety guidelines. People eating out at restaurants wouldn’t have to wear masks when they are eating and drinking as long as they are six feet away from others. For most people, the coronavirus causes mild or moderate symptoms, such as fever and cough. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death."}]}