{"article": [{"url": "https://www.marketwatch.com/story/high-volatility-is-here-to-stay-for-2020-goldman-names-31-stocks-to-deliver-the-best-risk-adjusted-returns-amid-the-turbulence-2020-06-29", "published": 1593499700.0, "headline": "High volatility is here to stay in 2020. Goldman names 31 stocks to deliver the best returns amid the turbulence", "body": "High volatility and low risk-adjusted returns are likely to linger for months to come, Goldman Sachs strategists have warned. After one of the worst first quarters in history for U.S. stocks, the second quarter looks set to be one of the best in decades. Goldman strategist said volatility would remain elevated until the end of 2020 and expected the S&P 500 SPX, +0.87% to close the year at 3,000 points. The grim milestones of 10 million global coronavirus cases and more than 500,000 deaths, along with spikes in a number of U.S. states in recent days, have reminded investors of the risk posed by the pandemic. Of the 10 million cases worldwide, more than 2.5 million have come from the U.S., according to data by Johns Hopkins University. The U.S. also hit a daily record for new cases on Friday, reporting 44,000 new infections, and lockdown measures have been reinstated in Texas and Florida. “Consensus expects 9% upside to the typical stock over the next 12 months and volatility should remain elevated through the rest of the year, suggesting low risk-adjusted returns in the coming months,” the strategists said. The investment bank’s portfolio strategy research team added 31 stocks to its high Sharpe ratio basket, which now tilts toward health-care providers, media, information technology services, and aerospace & defense industries. The Sharpe ratio measures the risk-adjusted return of an investment, with a higher ratio having a more attractive return once risk is factored in. Goldman’s high Sharpe ratio basket has underperformed the S&P 500 year-to-date by 591 basis points, which the team put down to its tilt toward value stocks. Historically, the basket has outperformed the S&P 500 in 66% of semiannual periods since 1999 by an average of 271 basis points. The basket outperformed the index in May and early June, as economic data improved and value stocks rallied, they said, but has lagged behind since as fears of a second wave have mounted. Following the rebalance, Goldman said the basket offered superior prospective returns to the S&P 500. Western Digital WDC, -1.49% , Merck & Co MRK, -0.14% , Concho Resources CXO, -1.22% , Philip Morris International PM, +0.70% and Verizon Communications VZ, +0.23% were among the new constituents with the highest ratio of expected return to implied six-month volatility. General Motors GM, -0.15% , Comcast CMCSA, -0.99% , Mondelez MDLZ, +1.41% and Coca-Cola KO, +0.69% are among the existing members with the highest ratios."}]}