{"article": [{"url": "https://www.marketwatch.com/story/watchdog-group-tallies-250-million-in-coronavirus-aid-fraud-with-money-spent-on-sports-cars-strip-clubs-gambling-and-crypto-bets-2020-10-08", "published": 1602165920.0, "headline": "Watchdog group tallies $250 million in coronavirus-aid fraud with money spent on sports cars, strip clubs, gambling and crypto bets", "body": "The U.S. Department of Justice has brought charges against at least 82 individuals, in cases where $250 million in fraudulent loans were sought in the six months since the Small Business Administration began disbursing loans under the Trump Administration’s Paycheck Protection Program, according to a tally by the Project on Government Oversight released Thursday. “The alleged fraudsters used the money to buy Lamborghini sports cars, go to strip clubs, take gambling trips to Las Vegas, invest money in a cryptocurrency account, make risky stock market bets, purchase a 40-foot yacht and a $1 million row house in Washington, DC, and other expenses not allowed by law,” according to the report. In one case, a Florida man allegedly used a $4 million loan in part to purchase a $318,000 Lamborghini Huracán EVO. In another case, former professional football player Joshua Bellamy allegedly received a $1.2 million loan, part of which he spent at the Seminole Hard Rock Hotel and Casino in Florida and on high-end jewelry. A large share of fraudulent loans were approved by lenders with close ties to financial technology companies, including Cross River Bank and Celtic Bank Corp., the analysis showed. Cross River Bank declined to comment and Celtic Bank did not immediately responded to a request for comment. A Tuesday report from Bloomberg Businessweek said that fintech companies “handled 75% of the approved PPP loans that have been connected to fraud by the U.S. Department of Justice,” despite the fact that those companies arranged only 15% of PPP loans overall. A September report by the Miami Herald pointed to online lender Kabbage as the source of more than 15 fraudulent loans. “Programs of such scale as the PPP will see challenges,” Kabbage spokesperson Paul Bernardini told the paper. “The SBA’s guidance had lenders rely on PPP applicants to provide data they attested to be true and accurate, including their date of incorporation.” The Paycheck Protection Program does rely on “self-certifications” whereby originating banks are allowed to rely on borrowers’ own attestations that economic uncertainty related to COVID-19 made the loans necessary to maintain payroll and make mortgage, lease and utilities payments. According to a July report from the Government Accountability Office, “To streamline the process, SBA required minimal loan underwriting from lenders—limited to actions such as confirming receipt of borrower certifications and supporting payroll documentation—leaving the program more susceptible to fraudulent applications.” These lax underwriting standards were thought to be necessary to encourage banks to participate in the program. If banks were held responsible for preventing fraud on the front end of the program, the fear was that they would be wary of participating the program at all, or would at least be dangerously slow in disbursing much needed relief. Meanwhile, placing these allegations of fraud in the context of the overall size of the program is revealing. The POGO analysis shows that just $113 million were successfully obtained by those accused of fraud, a small fraction of the roughly $500 billion disbursed by the SBA. POGO identified that Cross River Bank processed 15 allegedly fraudulent loans, also a small fraction of the roughly 200,000 PPP loans the bank issued, according to SBA data. For comparison’s sake, the Special Investigator General for the Troubled Asset Relief Program, set up to stabilize the financial system in the wake of the 2008-2009 crisis, recovered $11 billion in ill-gotten gains out of a roughly $700 billion program."}]}