{"article": [{"url": "https://www.marketwatch.com/story/us-shale-oil-production-may-take-years-to-recover-from-covid-19-demand-slump-2020-07-24", "published": 1595591540.0, "headline": "U.S. shale oil production may take years to recover from COVID-19 demand slump", "body": "U.S. shale oil production has dropped since mid-March, with energy demand hit by the coronavirus pandemic and domestic producers potentially cutting this year’s capital expenditures by around half, leading to expectations that output may not fully recover for years. “To say that U.S. shale oil has struggled since mid-March would be a big understatement,” says David Grumhaus, co-CIO at Duff & Phelps Investment Management. “The double whammy of Covid-related demand destruction combined with the Saudi-Russian price war in early March sent oil prices spiraling downward, putting significant pressure on U.S. shale.” He estimates that U.S. onshore oil production has fallen by roughly 20%, or 2 million barrels per day since March, and is unlikely to see a big rebound “in the near or medium term.” Oil prices dropped in April, with U.S. West Texas Intermediate crude futures CL.1, -1.62% US:CLU20 settling at a negative level for the first time on record and global benchmark Brent crude BRN.1, -0.07% UK:BRNU20 falling to their lowest finish since February 2002. That has contributed to a slew of oil-company bankruptcies, though prices recently bounced back to levels not seen since March. “Shale operators are facing a mountain of debt that comes due soon,” says Rene Santos, manager of North America supply, analytics at S&P Global Platts. Around 24 oil companies have also filed for Chapter 11 bankruptcy so far this year and the count is “likely to continue to increase.” U.S. horizontal oil rigs, those that drill shale wells, have declined by 75% since mid-March and the “short-term outlook is negative,” says Santos. Even if WTI oil climbs back to pre-Covid-19 levels of around $50 and operators start to increase rigs at that level, he says that would not change the shale oil outlook, as prices would need to see months of “stable higher prices,” and production would take months to react. Domestic shale production may recover somewhat in the next couple of months then decline again, pulling U.S. shale oil output down to 6.1 million barrels per day by year-end 2021, a 27% drop from March 2020, according to Santos. In June, domestic shale oil output was at around 7.3 million barrels per day, and he does not expect it to climb back to March level of 8.4 million barrels per day before the end of 2023. Also see:Why Shanghai oil futures won’t become a global crude benchmark anytime soon Chris Duncan, research analyst at Brandes Investment Partners, says U.S. producers are forecast to cut capital expenditures by around 50% this year from last year, with the “magnitude of spending cuts” poised to “ensure that U.S. oil production will continue to fall over the near term.” He points out that only a “handful” of U.S. shale companies from 2017 through 2019 earned what his firm would consider to be “their cost of capital or better,” even under an oil-price environment that averaged close to $60 and amid significant improvements in drilling efficiency that lowered costs. “ ‘As it stands, the “average” U.S. shale company has been a terrible investment. We expect that to continue to be the case until the industry shrinks meaningfully from current levels.’ ” — Chris Duncan, Brandes Investment Partners “As it stands, the ‘average’ U.S. shale company has been a terrible investment,” says Duncan. “We expect that to continue to be the case until the industry shrinks meaningfully from current levels.” Among related exchange-traded funds, the VanEck Vectors Unconventional Oil & Gas ETF FRAK, -0.97% has fallen by around 39% this year. However, Santos says U.S. shale oil is “probably a good long-term investment.” The resource is “very large, with the Permian being as large as the biggest oilfield in Saudi Arabia.” The “breakevens,” or oil price needed to get a return on new U.S. shale oil, are favorable around $38 for WTI, the pipeline infrastructure is capable of handling large increases in production and the nation continues to be a leader in shale production technology."}]}