{"article": [{"url": "https://www.marketwatch.com/story/panicking-about-your-tesla-shares-these-charts-will-make-you-feel-a-lot-better-11599585796", "published": 1599582860.0, "headline": "Panicking about Tesla? These charts will make you feel a lot better", "body": "MareketWatch photo illustration/iStockphoto The ride up was nice, but, ouch, that ride down? By the end of August, shares of Tesla TSLA, +1.89% were up almost 500%, year to date, crushing the short-sellers and defying all the skeptics in a pandemic-bucking ride that paced a scorching market for high-tech disrupters. But Tesla’s dizzying run has hit the skids of late, with the stock down 21% Tuesday alone to put its 5-day drop up to about 34%. That’s a painful reversal for those arriving late to the Tesla party, but it’s also to be expected as even the most stellar long-term plays in history have endured similar, and much worse, drawdowns. Of course, Tesla has plenty of company in this nasty September retreat, with high-fliers like Overstock OSTK, +1.21%, Peloton PTON, +6.97% and Zoom ZM, +2.89% all surrendering chunks of their outsized gains in recent sessions. The good news: This is completely normal and healthy. Read: ‘Pods of excess’ will pop this bubble, investor warns “Even if these companies live up to their now lofty expectations and their stocks end up being grand slam investments, it’s not going to be a straight line up and to the right,” Ritholtz Wealth Management’s Ben Carlson explained. “These companies could become some of the most successful stocks of the next few decades and they will still crash spectacularly at some point.” He pointed to several examples to back his point. Apple AAPL, +1.74%, for instance, has rallied almost 120,000% (19.5% annualized) since its legendary journey kicked off back in the early 1980s. Along the way, it’s dropped more than 75% three different times and has been cut in half several other times. Then there’s Amazon AMZN, +3.01%, which is up up almost 170,000% (a whopping 38% annualized) since 1997. However, at one point during that nosebleed ascent, the stock crashed almost 95% to go along with multiple declines of 30%. It’s not just among the tech juggernauts either. Walmart WMT, +1.00%, over the course of nearly five decades, has seen its stock gain more than 321,000%. The shares have lost 30% or more eight times and were stuck in negative territory from 2000 to 2012. The list goes on and on, but you get the idea. “This is what happens to successful companies and successful stocks,” Carlson wrote. “If you want to earn big returns in the stock market, expect to live with big losses to get there.” Plenty of “successful” stocks came under heavy pressure during Tuesday’s trading session, with the Dow Jones Industrial Average DJIA, +0.56%, Nasdaq Composite COMP, +1.39% and S&P 500 SPX, +0.87% all closing deep in the red."}]}