{"article": [{"url": "https://www.marketwatch.com/story/oil-edges-higher-but-fears-about-coronavirus-fueled-hit-to-demand-weigh-11601295489", "published": 1601308100.0, "headline": "Oil prices finish higher, but rise in coronavirus cases feeds demand concerns", "body": "Crude-oil futures ended higher Monday, recouping some of last week’s losses, but concerns that the rise in coronavirus cases throughout the globe will lead to weaker energy demand has grown. “The main concern remains the sustainability of the tentative global economic recovery seen since 2Q, and the possible impact of a spike in infections into the northern hemisphere winter,” said Stephen Innes, chief global markets strategist at AXIcorp. There is “sufficient wiggle room” built into the production cut agreement between members of Organization of the Petroleum Exporting Countries and their allies “to absorb minor demand shock, but it remains essential for OPEC+ to show the deal is working well,” he said in a market update. “For oil prices to resume their uptrend, investors likely need to turn more optimistic about global growth prospects, which seem most likely to hinge on Covid control in various countries and the outlook for vaccine approval and distribution,” said Innes. Still, “given current testing hit rates, it may be a few more weeks before Covid case growth starts to ease, so it’s most likely oil bulls will remain penned up for weeks or longer. ” Contributing to support to oil prices Monday, however, was a possible disruption to oil output in Norway. The Norwegian Oil and Gas Association said oil firms in Norway plan to close down 22% of the country’s oil-and-gas output, or 900,000 barrels of oil equivalent per day, if oil workers go on strike Wednesday, Reuters reported Friday. “Oil is likely to see volatility this week” on the back of the worries surrounding the potential oil workers’ strike in Norway, said David Madden, market analyst at CMC Markets UK, in a Monday update. West Texas Intermediate crude for November delivery CL.1, -1.62% CLX20, -1.62% climbed 35 cents, or 0.9%, to settle at $40.60 a barrel on the New York Mercantile Exchange. Front-month November Brent BRN00, -0.07% UK:BRX0 rose 51 cents, or 1.2%, at $42.43 a barrel on ICE Futures Europe. The November contract expires at the end of Wednesday trading. December Brent BRNZ20, -0.07%, the most actively traded contract, climbed 46 cents, or 1.1%, to reach $42.87 a barrel. Last week, based on the front-month contracts, WTI, the U.S. benchmark, declined 2.6% for the week, and global benchmark Brent crude marked a weekly loss of nearly 2.9%, according to Dow Jones Market Data. U.S. shale oil drillers, in particular, have been hurt by the decline in demand caused by the pandemic. On Monday, Devon Energy Corp. DVN, -2.42% and WPX Energy Inc. WPX, -1.88% announced that they will combine in an all-stock merger of equals with an enterprise value of about $12 billion. The deal is expected to close in the first quarter of 2021. Some major energy officials said they see challenges for oil prices climbing substantially in the fourth quarter, citing an uneven recovery from the pandemic that has unsettled much of the developed world and harmed energy uptake. Russian Energy Minister Alexander Novak, speaking at an online conference of energy ministries from G-20 countries over the weekend, said that oil demand has stabilized in recent months but could fall by up to 10%, Reuters reported. The energy minister attributed his slumping demand outlook to the possibility of a second wave of the COVID-19 pandemic. Chris Bake, executive committee member at the world’s biggest independent oil trader Vitol Group, concurred with Russia’s view, saying that oil prices in the fourth quarter will be vulnerable due to fresh limitations that some countries were reinstating due to a resurgence of the epidemic. “It doesn’t feel like we have a huge catalyst,” Bake said, speaking at a conference hosted by Gulf Intelligence, adding that the outlook now appears more uncertain than it did weeks ago, Bloomberg News reported. The global tally for confirmed cases of the coronavirus that causes COVID-19 climbed to 33.2 million on Monday, according to data aggregated by Johns Hopkins University, while the death toll rose to 999,273, nearing the grim one-million mark. Petroleum products also climbed Monday to post a fourth straight session gain. October gasoline RBV0 tacked on 2.7% to $1.2466 a gallon, while October heating oil HOV0 added 1.2% at $1.1395 a gallon. However, October natural gas NGV20, -2.27% settled at $2.101 per million British thermal units, down 1.8%, on the contract’s expiration day. The new front-month November contract NGX20, +5.17% settled at $2.795, down 0.4%."}]}