{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-rise-over-200-points-nasdaq-set-to-add-to-record-rally-ahead-of-key-jobs-report-2020-07-02", "published": 1593710780.0, "headline": "Dow books slight gain, Nasdaq ends at a record as rise in coronavirus cases caps rally on strong jobs report", "body": "U.S. stock indexes ended a choppy session Thursday with meager gains to close out a holiday-shortened week, as a record rise in new coronavirus cases in states like Florida helped to erode some of the optimism surrounding a stronger-than-expected monthly employment report for June. U.S. financial markets will be closed on Friday to observe the July Fourth holiday which falls on Saturday this year. How did benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% closed 92.39 points, or 0.4%, higher to finish at 25,827.36, while the S&P 500 index SPX, +0.87% added 14.15 points, or 0.5%, to reach 3,130.01. Meanwhile, the Nasdaq Composite Index COMP, +1.39% gained 53 points, or 0.5%, close at 10,207.63, booking its second straight record close but well off its intraday high at 10,310.36. For the holiday-shortened week, the Dow rose 3.3%, the S&P 500 notched a return of 4%, while the Nasdaq logged a 4.6% weekly return.What drove the market? Market participants were reluctant to drive the broad market significantly higher on Thursday after Reuters reported that Florida shattered records on Thursday when it reported over 10,000 new coronavirus cases, representing the biggest one-day increase in the state since the pandemic started. Markets also lost some momentum after a report indicated that a final-stage trial of a Moderna MRNA, +0.09% coronavirus vaccine candidate was delayed, according to a report from STAT News. The pandemic news gradually chipped away at what was shaping up to be a potent rally for equities following upbeat reports on the U.S. labor market. Labor Department data showed that the U.S. added back 4.8 million jobs in June compared with expectations for a rise of 3.7 million and the unemployment rate fell for the second straight month to 11.1%. Millions of Americans have returned to work since states began to reopen business activity in May, but the economy isn’t back to normal. The U.S. lost more than 22 million jobs during the height of the public-health crisis and only restored 7.5 million of them in the past two months. Meanwhile, weekly data also published Thursday showed new applications for traditional jobless benefits continued to slow, falling to 14.3 million in the seven days ended June 27 from 1.48 million in the prior week. However, the number of people receiving traditional jobless benefits rose 59,000 in the week ended June 20 to 19.29 million. President Donald Trump called the data “spectacular news,” during a briefing at the White House Thursday morning. “Today’s announcement proves that our economy is roaring back” from the impact of the coronavirus pandemic,” he said. The labor-market report represents a positive for the economy that has been battered by business closures to beat back the viral outbreak, but analysts reacted cautiously because the data doesn’t reflect some of the rollbacks of restrictions on business activity by states experiencing a resurgence of new cases. The U.S. saw 52,000 new COVID-19 cases Wednesday, according to data compiled by Johns Hopkins University, a new one-day record in the U.S., implying that the battle against the spread of the virus is far from over, which will make a V-shaped, or rapid and sharp, economic recovery nearly impossible. Katie Nixon, chief investment officer at Northern Trust Wealth Management, said that the spike in cases has changed the behaviors of companies like Apple Inc. AAPL, +1.74%, who announced that it was re-closing more stores on Wednesday. The shift in expectations about when businesses can reopen has sparked a mini rotation into stocks that are viewed as benefitting from workers and consumers staying at home. “Of course, we now know that reopening plans have been changed, with many states and cities reversing course. At the same time, and regardless of what authorities are recommending, we see companies (like Apple) and consumers changing their plans and slowing down,” Nixon said. “This has led to a ‘re-rotation’ of sorts back to the stocks that proved resilient in a ‘stay at home’ environment,” she explained. Katie Stockton, market technician and founder of Fairlead Strategies, told MarketWatch that recent wobbles in markets have come during a consolidation phase after an otherwise strong rally for equities since a recent bout of volatility in mid-June. She described recent trading as “healthy, as it relieved overbought conditions.” “We’re getting a bit more constructive now, though there’s still what I would consider to be a healthy level of skepticism out there. That can fuel an uptrend whether it makes sense fundamentally or not,“ Stockton said. Look for news headlines to drive the market from here on, she said, since investors feel like “we don’t have any visibility into the fundamentals of the economy.” In other economic reports on Thursday, a reading of factory orders showed a 0.8% rise in May, the first in three months. Which stocks were in focus? Shares of Tesla Inc. TSLA, +1.89% jumped 8% after a Wedbush analyst boosted his stock price target to $2,000. PayPal Inc. shares PYPL, +2.18% finished 0.1% lower after an analyst upped his stock price target to $200 from $176. Alexion Pharmaceuticals Inc. ALXN, +1.12% shares slipped 0.1% after the Securities and Exchange Commission said the company would pay $21 million to resolve charges that it paid Russian and Turkish officials to promote its immunosuppressive drug Soliris. Shares of Alaska Air Group Inc. ALK, +0.15% rose 2.2% after the airline said it had secured $1.2 billion in private funding. Shares of Moderna Inc. MRNA, +0.09% closed trading 4.9% lower after the STAT News report. Shares of Lemonade Inc. LMND, +12.82%, the mobile insurance company, soared 139% in its public debut on the New York Stock Exchange Thursday. How did other assets perform? West Texas Intermediate U.S. crude US:CLQ20 for August delivery settled at $40.65 a barrel on the New York Mercantile Exchange, up 2.1%, in part thanks to dwindling inventories. In precious metals, August gold futures US:GCQ20 rose $10.10, or 0.6%, to finish at $1,790 an ounce. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% was down 1.2 basis points at 0.670% after the strong jobs report pushed investors into riskier assets. Bond prices move inversely to yields. The greenback fell 0.1% against a basket of its major rivals, based on trading in the ICE U.S. Dollar Index DXY, -0.58%. In European equities, the Stoxx Europe 600 index SXXP, +0.55% closed 2% higher, and London’s FTSE 100 UKX, +0.64% finished with a 1.3% gain. In Asian markets overnight, the Japanese Nikkei NIK, -0.11% edged up 0.1%, Hong Kong’s Hang Seng HSI, -0.30% throttled nearly 3% higher, and the Shanghai Composite Index SHCOMP, +1.67% closed up 2.1%. Read next:It’s going to be a long, hot, up-and-down, go-nowhere summer in the stock market, but don’t sell yet"}]}