{"article": [{"url": "https://www.marketwatch.com/story/the-solution-to-the-retirement-crisis-is-still-in-its-infancy-11601997204", "published": 1601983280.0, "headline": "The solution to the retirement crisis is still in its infancy", "body": "Illustration by Kevin Whipple The year is 2100 and a worker is facing retirement. She’s been a conscientious employee, but she hasn’t been able to save much for her future because of years of family caretaking, student debt and low wages. But she’ll be able to enjoy retirement. That’s because she had money set aside for her on the day she was born, and it’s compounded over decades as she’s aged. She didn’t get this nest egg from her parents and it isn’t Social Security — though the government does manage it. This asset, an interest-bearing account, is also known as a “baby bond.” Legislators, financial experts and social analysts say baby bonds could solve money problems dogging Americans in old age. Not all Americans are prepared for the future. The trust funds that support Social Security — a lifeline for many elderly Americans — are at risk of depletion in the next 15 years, but politicians have yet to decide on a solution. And not everyone has access to a workplace retirement account, or can afford to invest for their old age. The pandemic has made things worse for many people. Millions of workers have lost their jobs because of the health crisis, and statistics show some races suffer more than others in building wealth. Even before the coronavirus crisis began, workers had trouble saving for their futures. Roughly half of Americans do not participate in an employer-sponsored retirement account, such as a 401(k) plan, according to a 2018 Stanford Center on Longevity report. Enter a proposal for “baby bonds” targeting retirement security. The concept, created by financial adviser Ric Edelman, would act as a supplement to Social Security, but it could eventually replace it and wouldn’t cost the government any money. There are many proposals floating around about baby bonds, including one from New Jersey Sen. Cory Booker, but Edelman’s focuses solely on retirement concerns. Edelman’s proposal is “The T.R.U.S.T. Fund for America,” short for “Tomorrow’s Retirement for the U.S. Today.” Edelman and his wife, Jean, started Edelman Financial Services in 1987, which merged with Financial Engines, an automated investment platform, in 2018. Edelman, founder of Edelman Financial Engines, has also authored numerous personal finance books, including “The Truth About Your Future,” and is the host of a weekly podcast of the same name. “We are facing long-term economic challenges,” Edelman said. “This program is designed to help solve retirement security for today’s children.” This is how his proposal works. At birth, children would receive an account with $7,500. The money would come from investors, such as corporations, pensions and those who already purchase government bonds, and would be invested in a new type of investment similar to Series EE bonds, an already established interest-bearing account. This new investment would be earmarked specifically for this program. None of the money would come from taxpayer funding. The invested money would grow over the span of 30 years, at which point those bonds would pay interest to the investors, as other savings bonds currently do today. The rest of the money in those accounts, which Americans could not touch, would continue to grow until the recipient was around 66 years old — similar to Social Security’s Full Retirement Age index. “ A $7,500 investment goes a long way. That investment at birth in this type of proposal would grow to become the equivalent of an average person’s Social Security benefit. ” There are still details to work out, such as if there would be a tax credit or how the government could encourage investors to participate in this program. Still, the concept of investing in specific bonds like this is not uncommon — individual investors, corporations and pensions already allocate a portion of their portfolios to a variety of assets, some of which serve specific purposes. Pensions, for example, invest in real estate and gold. Investing in something like this form of a “baby bond” would just be a way to fund this security, which is providing the investors with interest, while allowing the program to remain independent of government funding. The program’s calculations account for Americans living until age 100, much longer than the average life expectancy of about 86 years old. Under this plan, any money that a retiree did not get because she died before turning 100 would be returned to the program to be distributed to those who live beyond their 100th birthdays. An independent federal agency would oversee this program, similarly to the way an independent agency manages the Thrift Savings Plan, the retirement account system for government workers. A $7,500 investment goes a long way. That investment at birth in this type of proposal would grow to become the equivalent of an average person’s Social Security benefit, Edelman said. The average monthly Social Security benefit in June was $1,514, or about $18,170 a year, though how much a beneficiary receives depends on factors including age, when she claimed, earnings through her career and how many years she paid into the system. This means people who rely on Social Security for most, if not all, of their retirement income would get twice as much money when they’re older, or — in a worst-case scenario — this income would replace Social Security benefits if that program were to falter. A child with a $6,750 government-funded portfolio of index funds could earn $1 million by retirement, Bill Ackman, the chairman of Pershing Square Capital Management, said in an investors note. “My proposal gives the same benefit with a one-time contribution of $7,500 because my proposal allows money to grow from birth — the average American doesn’t get a job until his 20s, and that’s when they begin payroll taxes,” Edelman said. “The power of compounding does miraculous things.” Baby bonds have the potential to keep more Americans out of poverty in retirement, but the idea is not without its weaknesses, said Jialu Streeter, a research scholar at the Stanford Center on Longevity. For Edelman’s proposal to work, some assumptions have to be made, including the interest and return rates on this money, the strength of the equity market to handle this influx of cash and the credibility of the government to manage these funds for centuries. Still, something must be done to rectify the retirement crisis. Although there is no magic number someone needs to save for retirement security — that amount depends on numerous factors, including health, location, family and lifestyle — a person could expect to require hundreds of thousands of dollars over the course of retirement. Health care in retirement alone for a 65-year-old couple leaving the workforce in 2020 is roughly $295,000, and that does not include over-the-counter medications, glasses or long-term care insurance, according to Fidelity Investments. The Fidelity figure also doesn’t take into consideration housing, groceries, familial responsibility and lifestyle. Americans need roughly 70% of their pre-retirement income to live comfortably after leaving the workforce, according to the New School’s Schwartz Center for Economic Policy Analysis. For someone who earns $75,000 a year, that’s about $52,500 a year that needs to be replaced — or three times the average amount Americans receive in Social Security retirement benefits in a given year. Not all workers are able to achieve that replacement ratio, however. The average worker who retires at 62 replaces about 55% of their pre-retirement income, and the pandemic has the potential to drop that figure to about 48%. On top of that, unexpected hardships, such as the current crisis, have the potential to derail any retirement plan, as some Americans have recently experienced. Congress passed sweeping legislation in December to bolster retirement security. The law, called the Secure Act, allowed small businesses to band together to offer their employees employer-sponsored retirement accounts, as well as welcomed annuities into 401(k) plans more freely and pushed back required minimum distributions. The Secure Act also encouraged auto-enrollment of workplace retirement accounts, which has proven to help many Americans save more money for their futures by automatically placing them into a retirement plan and contributing a portion of their paychecks. The other variations of the baby bond proposal focus more on other major life milestones that could help Americans on their journeys to retirement — including those that end up becoming the reasons why people don’t have enough saved for their old age. Sen. Booker and Darrick Hamilton, an economics and urban policy professor at The New School, have proposed two additional versions of the baby bond. As part of Booker’s proposal, a child would get a $1,000 endowment at birth and additional deposits could be made in the following years based on family income. The money, which the government would fund, would be invested in Treasurys or mutual funds. The assets could only be touched beginning at age 18 for milestone events, such as to pay for college tuition or help fund the down payment of a home. “This is saying everyone as a birthright has access to capital,” Hamilton said during an Urban Institute virtual event alongside Sen. Booker. “At birth, you get an account and that forges a stakeholder society, similar to Social Security, that is independent of your race, your family, your gender or your family’s circumstance.” Under their plans, the money set aside in these interest-bearing accounts could be used for qualifying circumstances, such as paying for higher education, starting a business or funding a down payment for a home, said Kilolo Kijakazi, a fellow at the Urban Institute. “This proposal can solve all of the challenges that we are facing,” she said. Those major events contribute to the barriers of retirement security. For example, student debt deters workers from saving money for their futures because they’re trying to pay down thousands of dollars in staggering student loans. An entrepreneur could generate substantial earnings with the start of her business, but that becomes challenging without capital. A home is a key way to build wealth, but entering the housing market is difficult and unaffordable without a substantial down payment. Minorities face even higher hurdles in these milestones than their white counterparts, studies have shown. Implementing baby bonds would be just one step in the right direction, Booker said. “It has a multiplier effect,” he said. “When you create more wealth in America, it tends to grow and spread more equally and create more opportunities for us all.”"}]}