{"article": [{"url": "https://www.marketwatch.com/story/consumer-sentiment-remains-down-in-the-dumps-in-august-and-pessimism-reigns-2020-08-14", "published": 1597404560.0, "headline": "Consumer sentiment remains weak in August amid swirling coronavirus pessimism", "body": "Americans didn’t feel any better about the economy or their own financial situation in August than they did in the previous month, reflecting broad worries about the still-spreading coronavirus and the likelihood of a slow recovery, a new survey showed. The preliminary reading of the consumer sentiment survey in August edged up to 72.8 from 72.5 in July, but it’s still just barely above the pandemic low, the University of Michigan said Friday. Americans regained some confidence in the early stages of the recovery in May and early June, but their hopes for a faster rebound were dashed by a fresh outbreak of the coronavirus during the summer. Read:Retail sales climb again and return to precrisis levels, but growth slows as stimulus fades What happened: Consumers expressed low confidence in the current state of the economy. An index that measures attitudes right now slipped to 82.5 from 82.8. An index that measures expectations for the next six months rose slightly to 66.5 from 65.9. Yet most Americans think it will be years before the economy returns to normal. “Bad economic times are anticipated to persist not only during the year ahead, but the majority of consumers expect no return to a period of uninterrupted growth over the next five years,” said Richard Curtin, the chief economist of the sentiment survey. Curtin said the political deadlock in Washington over whether to restore the recently expired $600 federal benefit for the unemployed and other measures to help the economy has forced households to save more and left them increasingly uncertain about what lies ahead. Read:‘A massive welfare economy’ - federal aid prevents even steeper GDP collapse The big picture: The amount of confidence Americans have in the economy and their own financial security has a good record of predicting the future. Until they feel more secure, the economy is unlikely to make a rapid recovery. What could help restore some confidence are further measures from Washington to support the economy. President Trump has temporarily ordered a $300 federal stipend for the unemployed, but the money will run out by September. So far the two parties remain far apart on the next stimulus package, with both sides posturing and seeking political advantage ahead of the pivotal 2020 election. Read: Did the expired $600 federal jobless benefit keep people from going back to work? What they are saying? “Consumer Sentiment remains beaten down and hasn’t recovered from the sharp drop in the spring,” said Robert Frick, corporate economist at Navy Federal Credit Union. “In the absence of another round of fiscal support, consumers attitudes will likely be more cautious, which could restrain spending and the pace of recovery going forward,” said Rubeela Farooqi, chief U.S. economist at High Frequency Economics. Read: Jobless claims fall below 1 million for first time since start of coronavirus pandemic Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% were wavering in late-morning Friday trade. Stocks have been rising in fits and starts over the past few weeks."}]}