{"article": [{"url": "https://www.marketwatch.com/story/housing-starts-climb-43-in-may-as-buyers-return-and-builders-aim-to-speed-up-work-2020-06-17", "published": 1592387660.0, "headline": "Housing starts climb 4.3% in May as buyers return and builders aim to speed up work", "body": "The numbers: Construction of new houses rose 4.3% in May as a reopening U.S. economy and ultra-low mortgage rates drew more buyers and encouraged builders to start to speed up work. Housing starts climbed to an annual rate of 974,000 last month from a five-year low of 934,000 in April, the Commerce Department said Wednesday. It was the first increase since January. Economists polled by MarketWatch has forecast starts to rise to a 1.13 million rate. That’s how many new homes would be built in a year if the level of construction was the same each month. Although the increase was less than expected, a sharp rise in builder permits indicates construction is on track to expand more rapidly soon. Permits to build new houses jumped 14.4 % to a 1.22 million annual pace. What’s lighting a fire under builders is a surge in applications to buy a new home. They rose for the ninth week in row, a separate report showed, and hit an 11-year high. Mortgage applications were a remarkable 21% higher in mid-June than they were one year ago, based on data from the Mortgage Bankers Association. What happened: Housing starts surged 21.5% in the West and 12.8% in the Northeast, the region hit hardest by the coronavirus. Yet new construction fell 16% in the South, the region with the fastest-growing real estate market. It was the third decline in a row. Construction on new homes also dipped 1.5% in the Midwest. Almost all the increase in new construction, what’s more, involved multifamily units such as apartment buildings and condo complexes. Work on single-family homes — the bulk of the housing market — was flat. Permits rose in all four regions, however. See: MarketWatch Economic Calendar Big picture: The pace of home construction had crested to 16.2 million annual rate in January to mark a 14-year high. Although the market hasn’t returned close to pre-crisis levels, it’s expected to continue to improve during the busy summer season. The biggest lure is extremely low mortgage rates. The average rate of a 30-year-fixed mortgage recently fell to a record low 3.30%, a deal too good to pass up for prospective buyers who feel secure about their jobs. A strong housing market will help the economy recovery faster: New buyers need to furnish their homes and buy other goods and services once they move in. Still, many economists question how long the housing rebound can go on if unemployment remains high and economy struggles to recover from the pandemic. What they are saying? “We aren’t much bothered about the undershoot in starts,” wrote chief economist Ian Shepherdson of Pantheon Macroeconomics. “The outlook is very positive, given the astonishing surge in mortgage demand.” “Interest rates are going to stay low for a long time, but they are staying that way because of record numbers of unemployed. And that will be the biggest constraint on stronger housing activity,” said senior economist Jennifer Lee of BMO Capital Markets. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% rose in early Wednesday trades. Stocks surged Tuesday on reports the Trump White House is working on a new stimulus package to help the economy weather the coronavirus crisis."}]}