{"article": [{"url": "https://www.marketwatch.com/story/indoor-dining-in-new-york-city-would-be-negligent-and-reckless-without-enforcement-plan-cuomo-says-2020-09-08", "published": 1599585080.0, "headline": "Indoor dining in New York City would be 'negligent and reckless' without enforcement plan, Cuomo says", "body": "Gov. Andrew Cuomo doubled down on his stance that New York City isn't ready to reopen indoor dining, saying in a news conference Tuesday that reopening would be \"negligent and reckless\" without a specific compliance and enforcement plan from local officials. The statement comes a week after a group of more than 300 restaurants filed a class-action lawsuit over the ongoing indoor dining bans, alleging that Cuomo's executive orders are unconstitutional, and seeking more than $2 billion in damages. The restaurants are being represented by James Mermigis, the same attorney who represented a group of gym owners in a similar class-action lawsuit in August. \"We are aware of the economic pain,\" Cuomo said. \"We have seen that opening bars has created a compliance and enforcement nightmare. From our experience upstate, opening dining caused issues.\" Though indoor dining is currently allowed in other parts of the state, Cuomo said, \"based on the number of people they have going [to restaurants] and our investigators checking their investigators, they're doing better compliance [than New York City].\" \"I am very disappointed that the governor feels this way, considering that the NYC region continues to have an infection rate under 1% and has outperformed at least five other regions in the state,\" Mr. Mermigis told MarketWatch via email. \"The data certainly doesn't support the governor's comments and we will just continue with the injunction motions.\" New Jersey, meanwhile, allowed indoor dining to resume last Friday, at 25% capacity. Don't miss: There are seven coronavirus vaccine candidates being tested in the U.S. - here's where they stand Currently, the Sheriff's office is the only city agency tasked with enforcing bar and restaurant compliance, the governor added, saying that the State Liquor Authority had no further resources to help with inspections and that the city must come up with its own robust enforcement plan. \"Restaurants double the number of bars,\" Cuomo said. \"Who's going to do the enforcement? The NYPD could do it. Health inspectors could do it, sanitation inspectors could do it. Any regulatory inspector could do it. But they could have been doing the bars, too, and they didn't.\" Last week, the governor also suggested the creation of an NYPD task force of 4,000 officers focused on restaurant compliance, in response to City Council Speaker Corey Johnson's call for immediate reopening of indoor dining in the city.Other New York City news: Statewide, the Covid-19 infection rate was 0.96% Monday, and has remained below 1% for 32 days. In New York City the infection rate was 0.9%.â\u0080¨ Several colleges across the state have already seen COVID-19 outbreaks, and any school with more than 100 cases must notify the state Department of Health immediately and may have to transition to remote learning, Cuomo said.â\u0080¨ All K-12 schools must report data each day to the state Department of Health, which will create an online portal where parents can see information including how many positive cases among students and staff have been reported per school and school district; what kind of testing was conducted; and how many students and staff are on site. Delaware, Maryland, Ohio and West Virginia have been added to the list of states with a travel advisory requiring a 14-day quarantine for visitors to New York. In total, 34 states are now under travel advisory, along with Guam. The U.S. Virgin Islands and Puerto Rico have both been removed from the list. Coronavirus update: Global case tally tops 27.3 million, and U.S. accounts for a quarter, as 9 drug-company CEOs pledge to 'stand with science' in vaccine development"}]}