{"article": [{"url": "https://www.marketwatch.com/story/us-says-it-has-closed-consulate-in-chengdu-china-2020-07-26", "published": 1595814740.0, "headline": "China takes control of U.S. consulate in Chengdu", "body": "CHENGDU, China — Chinese authorities took control of the former U.S. consulate in the southwestern Chinese city of Chengdu on Monday after it was ordered closed amid rising tensions between the global powers. China ordered the mission to be shut in retaliation for a U.S. order to close the Chinese Consulate in Houston. The tit-for-tat closings marked a significant escalation in the multiple disputes between the countries over issues ranging from trade and technology to national security, human rights, Taiwan and Hong Kong. A State Department statement expressed disappointment, saying the consulate “has stood at the center of our relations with the people in Western China, including Tibet, for 35 years.” “We are disappointed by the Chinese Communist Party’s decision and will strive to continue our outreach to the people in this important region through our other posts in China,” the statement said. China’s foreign ministry issued a brief notice saying “competent authorities” entered through the front entrance and took over the premises after U.S. diplomats closed it at 10 a.m. A day earlier, China’s foreign ministry issued a statement of protest over what it called intrusions into the Houston consulate that violated the Vienna Convention on Consular Relations and the China-US Consular Convention. “The Chinese side deplores and firmly opposes the U.S. move of forcibly entering China’s Consulate General in Houston and has lodged solemn representations. China will make legitimate and necessary reactions,” the statement said. China maintains consulates in San Francisco, Los Angeles, Chicago and New York in addition to its embassy in Washington. The U.S. has four other consulates in China and an embassy in Beijing, keeping the sides in parity in terms of diplomatic missions. The Chengdu consulate briefly came to prominence when the police chief of the nearby city of Chongqing fled there in 2012, precipitating the downfall of Chongqing’s politically ambitious leader Bo Xilai in China’s biggest political scandal in decades. It also played host to former Vice President Joe Biden during a visit when the current prospective Democratic Party presidential candidate was accompanied by China’s now-leader Xi Jinping. The American flag was taken down at the Chengdu mission at 6:18 a.m., China’s state broadcaster CCTV said on its social media account. Police closed off a two- to three-block area around the consulate, cutting off virtually any view of the property including the flag. A few vehicles were allowed through after police checks, and others could be seen moving in the distance. Moving trucks arrived at the U.S. consulate the previous day and left a few hours later. Late Sunday night, flatbed trailers entered the complex. One later emerged carrying a large shipping container and a crane. Before the area was closed, the impending closure of the consulate drew a steady stream of onlookers over the weekend as Chengdu, like Houston, found itself in the limelight of international politics. People stopped to take selfies and photos, jamming a sidewalk busy with shoppers and families with strollers on a sunny day in the city of Chengdu, the capital of Sichuan province. A little boy posed with a small Chinese flag before plainclothes police shooed him away as foreign media cameras zoomed in. Police had shut the street and sidewalk in front of the consulate and set up metal barriers along the sidewalk on the other side of the tree-lined road. Uniformed and plainclothes officers kept watch on both sides of the barriers after scattered incidents following the Chengdu announcement on Friday, including a man who set off firecrackers and hecklers who cursed at foreign media shooting video and photos of the scene. A man who tired to unfurl a large placard late Sunday that he called an open letter to the Chinese government was quickly taken away. Earlier, a bus left the consulate grounds and what appeared to be embassy staff spoke with plainclothes police before retreating back behind the property’s solid black gates. It wasn’t clear who or what was on the bus. Three medium-size trucks arrived and left a few hours later, and cars with diplomatic plates departed in between. The U.S. alleged that the Houston consulate was a nest of Chinese spies who tried to steal data from facilities in Texas, including the Texas A&M medical system and the University of Texas MD Anderson Cancer Center in Houston. China said the allegations were “malicious slander.”"}]}