{"article": [{"url": "https://www.marketwatch.com/story/letter-from-arizona-hospitals-grapple-with-a-surge-in-coronavirus-cases-while-life-outside-continues-as-normal-2020-06-27", "published": 1593426800.0, "headline": "Letter from Arizona: Hospitals grapple with a surge in coronavirus cases, while life outside continues as normal", "body": "Arizona — Walking the streets of Tucson or Phoenix can give the impression that the pandemic never existed in Arizona. People are going about their business as usual and construction on the border wall on the southern border with Mexico appears to be gaining momentum. President Donald Trump made a trip to the state this week for a rally in a private church in the northern part of the city, attended by thousands of young people, few of whom wore masks. He marked the completion of the 200th mile of the border wall in Yuma. And that’s part of the problem, health workers say. More people need to wear masks to prevent the spread of COVID-19, the disease caused by the new coronavirus. “ While restaurants and bars generally followed the protocols, life continues like normal here. ” While restaurants, bars, and barbershops generally followed the protocols, life continues like normal here. Case in point: The state does not require masks to be worn in public, while many cities, including Phoenix, have adopted their own mask requirement. The early easing of the stay-at-home orders may have influenced the new surge of cases. Governor Doug Ducey, a Republican, let barbershops and salons reopen on May 8. Starting May 11, Arizona restaurants were allowed to offer dine-in services again. The scenes inside many of the state’s hospitals tell a different story, as medical staff desperately work to attend to the rising number of coronavirus patients. On Friday, hospitals across the state have activated their emergency surge plans to deal with the increase in coronavirus patients. “When we opened up our state, people started interacting with each other without practicing physical distance or wearing face masks as recommended by the CDC,” said Christian Bime, who is the head of the division of Pulmonary Care at the Banner University Medical Center in Tucson, in the southern part of the state. “Naturally, you can expect more infections this way,” he says. Maria Singleton, a volunteer for Samaritans from Ajo, in Pima County: ‘The construction of the wall sped up in February. It coincided with when COVID-19 came in.’ Gaia Squarc ‘These are things that happen once in a lifetime’ When Bime moved from Cameroon, in Africa, to Michigan in the United States, years ago, he never imagined he’d have to wake up at 4 a.m. every day to face a pandemic as a frontline doctor in Arizona. “These are things that happen once in a lifetime,” says Bime, who is the head of the division of Pulmonary Care at the Banner University Medical Center in Tucson, in the southern part of the state. The U.S. hit its highest single-day count of confirmed coronavirus cases of 40,135 on Friday, Arizona reported 3,428 new cases, according to the Arizona Department Healthcare Services database. “ The U.S. hit its highest single-day count of coronavirus cases of 40,135 on Friday, Arizona 3,428 new cases. ” Along with Florida and Texas, some refer to Arizona as one of the frontrunners to become the new New York, as the new epicenter of the virus. “The main problem we have to face is the increase of patients that we are admitting to our hospitals, especially to the intensive care unit, over the past few weeks,” said Bime. Along with his colleagues, he works every day, from dawn to sunset, and late into the evening, to provide care for as many patients as possible. “In an ordinary situation, you may have some patients who are very sick, and others that are not so sick. With coronavirus, almost all of them in the intensive care unit need a ventilator,” says Bime, while sharing a glimmer of optimism: “The positive thing is that so far we have enough ventilators.” As of Friday, 86% of current inpatient beds and 88% of ICU beds were in use, in Arizona, far more than the usual occupation rate versus 62% and 68% respectively before the coronavirus’ first wave hit Arizona in late March, according to the Arizona Department Healthcare Services database. And Pima County, where Bime’s hospital is located, is the second hardest-hit county in the state, with more than 6,800 positive cases and at least 266 deaths. If the rate of hospitalization is 7% across the state, Pima County counts 670 out of the 4514 hospitalizations overall. This round of infection is different from the first wave of coronavirus cases in April and May, Bime said: “Now we are hospitalizing younger people with severe disease, too, in a range of 40-to-60-year-old.” Arizona is one of the 19 states with the trend of new coronavirus cases still increasing. Pictured: Starbucks in the Arrowhead Town Center in Glendale, Ariz. on June 20. Getty Gaia SquarcImages ‘The construction of the wall sped up in February’ Pima County is one of the hardest hit by the pandemic, according to the Arizona Department Healthcare Services database. “The construction of the wall sped up in February. It coincided with when COVID-19 came in,” says Maria Singleton, a volunteer for Samaritans from Ajo, in Pima County. She also has a unique perspective on the wall. On Nov. 9, 1989, she witnessed the Berlin wall collapse in Europe, where she lived. Now she is witnessing the construction of a new wall as well as the outbreak of a new pandemic. She is part of a group of volunteers that organizes every week activities to rescue and to help migrants who cross the border, visits the border at least once a week, and has observed the increase in the number of trucks. “ On Nov. 9, 1989, Maria Singleton witnessed the Berlin wall collapse in Europe, where she lived. ” Singleton lives on a street that leads to the national park close to the border. We spent an hour on her street, and observed the trucks heading toward the border. Locals on Facebook FB, +0.26% have shared Singleton’s concerns about the influx of workers. Ajo is among the poorest towns in Arizona. Households here have a median annual income of $33,178, close to half the median annual income of $61,937 in the U.S., according to the U.S. Census Bureau. “The virus hit poor and elder communities hard, and Ajo is one of them,” says Singleton. Her house is not far from Ajo’s historic center. The number of trucks she has seen driving south to build the wall at the border and the number of coronavirus cases have both been increasing in the last weeks, she said. “We have one little clinic here, but for the most part, people have to drive to Phoenix or Tucson if they want to go to hospitals. The outskirts of Phoenix are 90 miles away,” says Singleton. When she moved to Ajo, she was imagining living in a quiet place. “Now I find myself at the epicenter of everything,” she says. Singleton and other residents are worried about the presence of so many workers coming to Ajo from across the U.S. “When they are in town, they never wear masks,” she adds. In a tiny village surrounded by mountains and kissed by the sun in Arizona close to New Mexico and far from Ajo and the southern border, Leonela Nelson, 36, a Navajo who works as a research program coordinator at Johns Hopkins Center for American Indian Health, and her family have managed to avoid the worst of the pandemic. “A majority of the outbreak is in the larger cities hours away from here now,” she says. “When in April I saw the lines outside the few grocery stores we have, I was scared.” But the Navajo Nation, an American Indian territory covering more than 17,000,000 acres between Arizona, New Mexico, and Utah, struggled to contain the pandemic, which caused 7,320 cases and 350 deaths. “What is the CDC’s first recommendation over the novel coronavirus? ‘Washing your hands.’ In the Nation, about 30% of the people do not even have running water,” Nelson says. During the peak of the outbreak inside the reservation, the Navajo Nation government intensified testing and tracing and committed to a coronavirus-focused education campaign. The sign Dikos Ntsaaígíí-Náhást’éíts’áadah, which means COVID-19 in the Navajo language, was everywhere, in tiny Teec Nos Pos. “My aunt got the coronavirus, and she spent weeks in the hospital,” says Nelson. Her aunt is in her mid-60s, and she did not have pre-existing health conditions, but it took almost a month before she recovered. Nelson stopped by her house almost every day to check that everything was still in order. “She is getting better now, although it was a tough time for my family,” she says. Bime, meanwhile, wakes up thinking about patients like Nelson’s aunt every morning in Tucson. He is optimistic that they will get through this, but is less sure about how long that will take. “The greatest challenge that we experience in critical care units is that we can’t let families see the patients in person,” he says. Sometimes frontline workers have to replace the physical connection between them. “With one hand, you have the smartphone with Facetime AAPL, +1.74%, and with the other, you hold the hand of the patients like you were a family member.” Gov. Doug Ducey allowed individual Arizona cities to create their own policies about face-covering requirements and enforcement on Wednesday. Getty Images"}]}