{"article": [{"url": "https://www.marketwatch.com/story/michelle-obama-blasts-president-trump-urges-americans-to-vote-joe-biden-like-your-lives-depend-on-it-11601992489", "published": 1601988140.0, "headline": "Michelle Obama blasts President Trump, urges Americans to vote for Joe Biden 'like your lives depend on it'", "body": "Michelle Obama Getty Images “ 'Because this is a difficult, a confusing time â\u0080¦ and when people hear these lies and crazy conspiracies repeated over and over and over again, they don't know what to think. With everything going on in their lives, they don't have time to fact-check falsehoods being spread throughout the internet. And even reasonable people might get scared. And the one thing this president is really, really good at is using fear and confusion and spreading lies to win.' ” That's former first lady Michelle Obama delivering a scathing attack on President Trump in a 24-minute video posted on YouTube GOOG, +1.97% GOOGL, +1.82% on Tuesday morning in which she urged her fellow Americans to vote for Joe Biden \"like your lives depend on it.\" Obama called out Trump for \"failure\" on the pandemic as well as for racist fearmongering. She accused him of seeking to \"gaslight the American people by acting like this pandemic is not a real threat,\" even as she didn't directly point to the president's COVID-19 diagnosis. \"If you're a parent like me, you're feeling the consequences of this president's failure to take this pandemic seriously â\u0080¦ from his constant downplaying of the importance of masks and social distancing â\u0080¦ to his relentless pressure on schools to open without offering a clear plan or meaningful support to keep students and teachers safe,\" she said. The first lady also went after Trump for devoting his life to \"enriching himself, his family, and other wealthy people\" in contrast to Biden. \"He boasts about gains in the stock market SPX, +0.87%, but when you look at the lives of regular folks â\u0080¦ there's nothing much to brag about,\" she said. Amid all the Trump bashing, Obama praised Biden for having \"lived his life guided by values and principles that mirror ones that most Americans can recognize. I know Joe,\" she said. \"He's a good man who understands the struggles of everyday folks.\" Watch the full video: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } |"}]}