{"article": [{"url": "https://www.marketwatch.com/story/a-portfolio-of-stocks-being-bought-by-mom-and-pop-investors-is-trouncing-wall-st-pros-heres-what-theyre-buying-2020-06-15", "published": 1592654480.0, "headline": "A portfolio of stocks being bought by mom-and-pop investors is trouncing Wall Street pros â\u0080\u0094 hereâ\u0080\u0099s what theyâ\u0080\u0099re buying", "body": "Itâ\u0080\u0099s no secret that retail investors have been stepping up their participation in the stock market lately, but the degree by which they have outperformed professional investors may be coming into greater focus. A basket of equities that have been eagerly bought by individual investors since the depths of the coronavirus-induced selloff on March 23 has returned 61%, compared with returns of 45% for a portfolio of investments owned by mutual funds and hedge funds, according to Goldman Sachs data, including prominent analyst David Kostin. The Wall Street pros, who have consistently lagged behind the overall market since the last crisis in 12 years ago, now may find themselves lagging behind mom-and-pop investors by a whopping 16 percentage points, according to the bankâ\u0080\u0099s research. The Goldman analysts report that much of the outperformance by individual investors occurred in the middle of May, as upbeat data on declines in the spread of the deadly pandemic and less-bad economic reports encouraged bargain hunting in cyclicals, including small-capitalization stocks, and shares of companies that are economically sensitive and would therefore benefit from signs of improvement in the business climate. Such stocks were â\u0080\u009cquickly embraced by value-seeking retail investors, and now make up a large portion of our retail basket,â\u0080\u009d Goldman researchers wrote (see attached chart). Source: Goldman Sachs Some of the investments that retail investors have scooped up include shares of Penn National Gaming PENN, -1.50%, Moderna Inc. MRNA, +0.09% Â , Tesla Inc. TSLA, +1.89% Â , MGM Resorts International MGM, -2.59%, Royal Caribbean Cruises Ltd. RCL, +2.59%, Marathon Oil Corp MRO, -2.74%, Snap Inc. SNAP, -0.18%, GoPro Inc. GPRO, -0.48%, Norwegian Cruise Line Holdings Ltd. NCLH, +2.91%, Groupon Inc. GRPN, -0.33%, Nvidia Corp. NVDA, -0.54%, Ford Motor Co. F, -1.36%, General Motors GM, -0.15%, Facebook FB, +0.26% Â and Apple AAPL, +1.74%, to name a few. Check out: Here are the biggest stock-market bets among institutional and retail investors, ranked The performance of retail investors comes as the increased activity by retail investors has drawn more scrutiny in recent weeks, Some have argued that growing interest in markets by average Joes and Janes may signal that the stock market may be entering a frothy period. The main U.S. stock gauges, the Dow Jones Industrial Average DJIA, +0.56%, the S&P 500 index SPX, +0.87% and the Nasdaq Composite Index COMP, +1.39%, last week registered their worst weekly declines since March 20, amid worries of rich stock-market valuations, concerns about growing signs of the COVID-19 pandemic and grim economic outlook. Read: Itâ\u0080\u0099s like the Wild West with â\u0080\u0098get-rich-quick crowdâ\u0080\u0099 vs. Wall Street pros, but itâ\u0080\u0099s too easy to blame retail investors for â\u0080\u0098rampant speculationâ\u0080\u0099"}]}