{"article": [{"url": "https://www.marketwatch.com/story/heres-where-biden-and-trump-stand-on-antitrust-social-media-and-other-tech-issues-2020-10-01", "published": 1601573360.0, "headline": "Hereâ\u0080\u0099s where Biden and Trump stand on antitrust, social media and other tech issues", "body": "President Donald Trump and former Vice President Joe Biden donâ\u0080\u0099t agree on many issues, but they do share a wariness toward Big Tech that should maintain or even escalate antitrust scrutiny of the largest U.S. tech companies no matter who wins on Nov. 3. In the middle of antitrust investigations into four of the most prominent companies in the world â\u0080\u0094 Alphabet Inc.â\u0080\u0099s Google GOOGL, +1.82% Â , GOOG, +1.97% Â Facebook Inc. FB, +0.26% Â , Amazon.com Inc. AMZN, +3.01% Â , and Apple Inc. AAPL, +1.74% Â â\u0080\u0094 both Trump and Biden have stopped short of calling for companies to be broken up. But their animus toward an industry that has grown to be distrusted by many Americans reflects a golden rule in politics: Run against the corporate boogeyman. Democrats and Republicans have approached tech issues with different motivations in recent years, but will continue the â\u0080\u009ctechlashâ\u0080\u009d for at least four more years because itâ\u0080\u0099s what the public wants to counterbalance the industryâ\u0080\u0099s growing market power and cultural influence, Capital Alpha Partners analyst Robert Kaminsky told MarketWatch. Republicans have focused their agenda on what they deem an anticonservative bias on social-media platforms, while Democrats are pivoting toward anticompetitive business practices and consumer-privacy rights, and the winners in November will determine the direction of the response. â\u0080\u009cI see no end to bipartisan criticism of Big Tech,â\u0080\u009d Kaminsky said. The Trump administration has threatened broad regulatory actions against internet companies for what the president and other Republicans claim is anticonservative bias, while maintaining antitrust investigations of Google and Facebook, and fighting in the courts for bans on Chinese-owned apps such as TikTok and WeChat. Trumpâ\u0080\u0099s Justice Department is reportedly close to filing a lawsuit against Googleâ\u0080\u0099s search and advertising business before the election that likely would spill over into the next administration. The Federal Trade Commission, meanwhile, is preparing a possible lawsuit against Facebook by the end of the year over unspecified antitrust violations. The FTC continues its probe of Amazon, while the status of the Justice Departmentâ\u0080\u0099s investigation of Apple remains unclear. For more: Big Tech turning on one another amid antitrust probes and litigation Biden, who was vice president during the Silicon Valley-friendly administration of President Barack Obama, has been critical of Big Techâ\u0080\u0099s market power. He supports stringent antitrust oversight and online privacy rules, but leans heavily toward forcing social-media companies to better police their sites against false information. Biden has proposed a minimum federal tax aimed at companies like Amazon, and vowed government action to help workers under threat from innovations such as self-driving cars. Here is how the two main 2020 presidential candidates stack up on the issues. Breaking Up Big Tech Despite the lineage of a pro-Silicon Valley Obama administration that has some conservatives and progressives fretting that Biden would settle antitrust cases if elected, a campaign spokesman strongly suggested otherwise. â\u0080\u009cJoe Biden has long said one of the greatest sins is the abuse of power,â\u0080\u009d Matt Hill told The Wall Street Journal in September. â\u0080\u009cMany technology giants and their executives have not only abused their power, but misled the American people, damaged our democracy and evaded any form of responsibility. That ends with a President Biden.â\u0080\u009d A policy task force Biden created with Sen. Bernie Sanders, I-Vt., recommends breaking up companies for anticompetitive behavior, but only â\u0080\u009cas a last resort.â\u0080\u009d See also: Hereâ\u0080\u0099s where Trump and Biden stand on China and other trade issues Trump, who routinely bashes Amazon Chief Executive Jeff Bezos â\u0080\u0094 who also owns the Washington Post â\u0080\u0094 has established civil relations with Apple CEO Tim Cook and Facebook CEO Mark Zuckerberg. But he has been vague when asked about Big Tech, saying, â\u0080\u009cThere is something going on in terms of monopoly.â\u0080\u009d Still, one possible outcome of the federal governmentâ\u0080\u0099s continuing antitrust investigations is breaking up companies. Read more: Google could face antitrust charges from Justice Department this month The administration also finds itself entangled in a legal dispute between Microsoft Corp. MSFT, +2.48% Â , which was awarded a 10-year, $10 billion cloud-computing contract with the Pentagon, and Amazon, whose executives are convinced the deal was awarded for political reasons. The Trump campaign did not respond to an email message. Social Media Regulation Social-media companies have felt the rhetorical sting of both presidential candidates, largely around one of the only major laws governing the internet that the federal government has managed to pass. Even though Trump benefited greatly from an aggressive digital campaign to win the White House in 2016, he continues to claim â\u0080\u0094 in tweets â\u0080\u0094 that platforms unfairly censor conservative viewpoints. Things spiraled in May, when Twitter Inc. TWTR, -0.23% Â slapped fact-checking labels on Trump tweets for the first time, prompting the president to threaten to introduce legislation that would weaken Section 230 of the Communications Decency Act, a 1996 federal law that exempts online platforms from legal liability for material users post, for the most part. Trump subsequently called for repeal of Section 230 in a Sept. 8 tweet. Neither action has had much effect. Read: Hereâ\u0080\u0099s where Trump and Biden stand on health care On Thursday, the Republican-run Senate Commerce Committee voted to subpoena Zuckerberg, Twitter CEO Jack Dorsey, and Alphabet CEO Sundar Pichai to appear for a hearing on Section 230. Committee chairman Roger Wicker, R-Miss., said the hearing, which has no assigned date, would be to address allegations of anticonservative bias on social-media platforms. Biden, who has criticized Facebookâ\u0080\u0099s policies on political ads and manipulated videos, was the only Democratic presidential candidate who called for revoking Section 230 in the primaries. On Tuesday, the Biden campaign eviscerated Facebook as â\u0080\u009cthe nationâ\u0080\u0099s foremost propagator of disinformation about the voting processâ\u0080\u009d in a letter to Zuckerberg lamenting Facebookâ\u0080\u0099s refusal to remove voting misinformation posted by Trump. The differing views on Section 230 highlights contrasting political approaches. â\u0080\u009cWhenever you have a platform dealing with content, there will be an argument over removal of content, which is the Republicansâ\u0080\u0099 view, vs. failure to remove content, which is where the Democrats stand,â\u0080\u009d Paven Malhotra, a Silicon Valley attorney who specializes in intellectual property, told MarketWatch. â\u0080\u009cNonetheless, I expect a groundswell of movement next year by both parties to modify 230.â\u0080\u009d Data Privacy As Congress wends its way toward federal consumer privacy legislation, Biden has voiced support for national privacy â\u0080\u009cstandards not unlike the Europeans,â\u0080\u009d an apparent reference to the European Unionâ\u0080\u0099s strict General Data Protection Regulation. The Trump administration, in turn, has criticized Silicon Valley over the issue of encryption. The president called for a boycott of Apple early in his presidency for the companyâ\u0080\u0099s refusal to unlock iPhones used by mass shooters in San Bernardino, Calif., and has continued to push that issue. For more: Hereâ\u0080\u0099s where Trump and Biden stand on climate change In recent months, the Trump administration has ramped up attacks on GDPR, calling it a restrictive system that provides cover to cybercriminals and threatens public health. â\u0080\u009cWe do have serious concerns about its [the GDPRâ\u0080\u0099s] overly restrictive implications for public safety and law enforcement,â\u0080\u009d U.S. Deputy Assistant Secretary of State for Cyber Rob Strayer, told Politico in late June. â\u0080\u009cWe definitely find that divergent interpretations [of the law] are also an issue, chilling some of the commerce that could be taking place.â\u0080\u009d High-speed Broadband Access The pandemic has forced millions of Americans to work from home and attend school, putting a premium on high-speed broadband and exposing inequalities in availability of the technology nationally. Both candidates support some plan to bring ultrafast connections to everyone: The FTC in January approved a $20 billion rural broadband expansion fund, while Biden said he plans a $20 billion investment in rural broadband infrastructure as part of a package his team proposed to spend money collected from tax increases on wealthy Americans. Gig Jobs Biden has suggested using government regulation to force â\u0080\u009cgig economyâ\u0080\u009d businesses to pay for benefits to their independent contractors by reclassifying them as employees.The Trump campaign claims a California gig-worker law that does that will â\u0080\u009ctake away workersâ\u0080\u0099 opportunity to make their own schedules and participate in a free and open gig economy.â\u0080\u009d The Labor Department, led by Trump appointee Eugene Scalia, last year said people offering services on online sites or apps should be considered employees of the consumer who hires them, making it difficult for gig workers to win labor disputes. See also: How Trump and Biden tax policies could affect your paycheck"}]}