{"article": [{"url": "https://www.marketwatch.com/story/the-july-15-tax-deadline-is-almost-here-heres-one-reason-not-to-worry-if-youre-dreading-it-2020-07-01", "published": 1594728980.0, "headline": "The July 15 tax deadline is almost here â\u0080\u0094 hereâ\u0080\u0099s one good reason NOT to worry", "body": "Americans are approximately two days away from the filing deadline in this prolonged tax season and the Internal Revenue Service has received 6.3 million fewer returns than the same point last year, when the filing deadline had come and gone. Hereâ\u0080\u0099s a potential bright spot for anyone dreading the July 15 filing deadline: Thereâ\u0080\u0099s still a good chance they have a refund waiting for them, according to experts studying their own client files and IRS statistics. H&R Block HRB, -1.80% Â estimates that more than half of its clients who still havenâ\u0080\u0099t filed yet are due a refund, according to Andy Phillips, director of the national tax preparation chainâ\u0080\u0099s Tax Institute. “ â\u0080\u0098The July Fourth holiday will be a wake-up call. Folks will realize the deadline is coming quickly and I need to act.â\u0080\u0099 ” â\u0080\u0094 Andy Phillips, director of H&R Blockâ\u0080\u0099s Tax Institute Of course, there have been many issues large and small preoccupying people during the coronavirus outbreak, but Phillips said â\u0080\u009cthe July Fourth holiday will be a wake-up call. Folks will realize the deadline is coming quickly and I need to act.â\u0080\u009d Taxpayers should be receiving approximately 18 million more refunds before the year is through, according to Lisa Greene-Lewis, a tax expert and CPA at TurboTax INTU, +2.03%. IRS statistics show itâ\u0080\u0099s issued 111.8 million refunds for income tax overpayment last year. So far this year, itâ\u0080\u0099s sent out 93.2 million refunds â\u0080\u0094 a difference of 18.6 million. The gap should close, Greene-Lewis said. Much has changed during the past year, but not the federal income tax codeâ\u0080\u0099s provisions, she noted. This season marked the second year under the Tax Cuts and Jobs Act, which reduced the corporate rate and most personal income rates. Thinking of any new, major tax changes in effect, Greene-Lewis said, â\u0080\u009cthereâ\u0080\u0099s none I can really think of that would be significant.â\u0080\u009d Last year, the average refund came to $2,869. The average refund this year now stands at $2,763 (and refunds on returns filed after April 15 will also pay a small amount of interest.)Why havenâ\u0080\u0099t more people collected their refunds? America is grappling with double-digit unemployment rates and the $2.2 trillion stimulus bill has sent approximately 160 million stimulus checks to households to quickly supply them with cash. So why wouldnâ\u0080\u0099t taxpayers quickly get their refund too? Around one-third of people (36%) in a 100-person mid-May H&R Block survey said they still hadnâ\u0080\u0099t filed their taxes because of procrastination. Thirty-one percent said they didnâ\u0080\u0099t feel safe going somewhere to file their taxes amid the coronavirus pandemic, the survey said. Donâ\u0080\u0099t miss:My state is reopening restaurants and movie theaters. Am I selfish if I go, or am I selfish if I stay home? Phillips said H&R Block has tried allaying worries with measures like remote document drop-offs, extra space between desks and an array of online services. Rebecca Thompson, project director of Prosperity Nowâ\u0080\u0099s Taxpayer Opportunity Network, also thinks the usual end-of-season procrastination comes into play. The Taxpayer Opportunity Network is a convening body for Volunteer Income Tax Assistance (VITA) sites, an IRS filing program for people making up to $56,000. The pandemic closed the VITA sites and most are now preparing returns via online submissions or document drop-offs, she said. At this point, when many people make their initial start through the online portal, Thompson said â\u0080\u009cthey are getting stuck gathering their documents, which, I say is a function of procrastination.â\u0080\u009d “ â\u0080\u0098I am going to hazard a guess that people due a refund who havenâ\u0080\u0099t filed yet are not hard up for cash.â\u0080\u0099 ” â\u0080\u0094 Rebecca Thompson, project director of Prosperity Nowâ\u0080\u0099s Taxpayer Opportunity Network Taxpayers with the greatest need for refunds and tax credits will often file early in the season that starts in January, Thompson said. â\u0080\u009cI am going to hazard a guess that people due a refund who havenâ\u0080\u0099t filed yet are not hard up for cash,â\u0080\u009d she said. Compared to past years, Thompson said she hasnâ\u0080\u0099t seen more people put off filing because they canâ\u0080\u0099t afford their taxes. Experts have previously said taxpayers who owe money and canâ\u0080\u0099t pay it in full should at least try to pay a portion. The IRS can also work out installment plans. â\u0080\u0098De facto second stimulusâ\u0080\u0099 Though many people might be waiting for a refund because they havenâ\u0080\u0099t filed yet, many other people may be waiting for the IRS to send their refund money. So far, the IRS has processed 126.5 million individual returns, an 11.4% drop from the same point last year. The IRS has been pulled in many different directions this tax season because, among other things, itâ\u0080\u0099s also had to distribute stimulus checks. One consequence is limited staffing to process paper returns. The agency is prioritizing refunds from paper returns and customer service operations as it reopens offices across the country, IRS Commissioner Charles Rettig testified Tuesday at a Senate Finance Committee hearing. Sen. Rob Portman, a Republican from Ohio, said his office has received hundreds of calls from people â\u0080\u009cwho did not have the means to file electronically who need their refund to just make it financially.â\u0080\u009d “ â\u0080\u0098This of course, would be a de facto second stimulus. I mean, it would be huge if we could get this money out the door. So it seems to me that should be our top priority right now.â\u0080\u0099 ” â\u0080\u0094 Sen. Rob Portman on refund checks Those still unissued refund checks â\u0080\u009cwould be a de facto second stimulus. I mean, it would be huge if we could get this money out the door,â\u0080\u009d Portman said. Rettig said the IRS is focused on the paper returns and is processing about one million every week. â\u0080\u009cGoing through and getting those out is a priority,â\u0080\u009d he said.Some are waiting to file for strategic reasons Devin Pope doesnâ\u0080\u0099t like waiting to file his taxes, but heâ\u0080\u0099s doing it this year on the hope it might get him a second stimulus check. The senior wealth adviser and partner at Albion Financial Group in Salt Lake City, Utah is giving the same advice to clients who havenâ\u0080\u0099t filed yet. “ â\u0080\u0098Donâ\u0080\u0099t quite hit the button, and letâ\u0080\u0099s see if they are able to pass something in the coming weeks.â\u0080\u0099 ” â\u0080\u0094 Devin Pope, senior wealth adviser and partner at Albion Financial Group â\u0080\u009cDonâ\u0080\u0099t quite hit the button, and letâ\u0080\u0099s see if they are able to pass something in the coming weeks,â\u0080\u009d Pope said, referring to federal lawmakers who are starting to consider another stimulus bill and a second round of direct checks. In Huntersville, N.C., Brandon Opre, founder of Trust Tree Financial, says some of his clients are due a refund, but they are waiting â\u0080\u009cbecause if there is a second round of stimulus checks, their higher 2019 income would work against them.â\u0080\u009d From Utah to North Carolina, these people are playing the waiting game because theyâ\u0080\u0099re wagering any new stimulus bill would use the same stimulus check eligibility rules as the Coronavirus Aid, Relief, and Economic Security (CARES) act. See also:How the $2.2 trillion CARES Act helps Americans save money on their 2019 taxes In the CARES act, the IRS used 2019 tax returns to figure out who qualified for direct checks. The agency sent $1,200 checks to people making under $75,000 and $2,400 checks to married couples making less than $150,000. The one-time payments decreased over that threshold and stopped at $99,000 for an individual and $198,000 for a couple. If the IRS doesnâ\u0080\u0099t have the 2019 returns, it looks at the 2018 returns. An individual could make too much money in their 2019 income taxes and still get a stimulus check if the IRS can only access their 2018 returns. Itâ\u0080\u0099s not likely Congress will pass a new stimulus bill before July 15, says Pope. But heâ\u0080\u0099ll take his chances. â\u0080\u009cI think itâ\u0080\u0099s worth waiting,â\u0080\u009d he said."}]}