{"article": [{"url": "https://www.marketwatch.com/story/trump-doctor-anticipates-safe-return-to-public-events-on-saturday-after-covid-19-treatment-2020-10-08", "published": 1602195140.0, "headline": "Trump doctor anticipates â\u0080\u0098safe returnâ\u0080\u0099 to public events on Saturday after COVID-19 treatment", "body": "Donald Trumpâ\u0080\u0099s doctor on Thursday said that the president is likely to return public engagements on Saturday after completing treatment for COVID-19. â\u0080\u009cToday the President has completed his course of therapy for COVID-19 as prescribed by his team of physicians,â\u0080\u009d Dr. Sean Conley said in a public memo. â\u0080\u009cSince returning home, his physical exam has remained stable and devoid of any indications to suggest progression of illness,â\u0080\u009d Conley wrote. â\u0080\u009cOverall heâ\u0080\u0099s responded extremely well to treatment, without evidence on examination of adverse therapeutic effects. Saturday will be day 10 since Thursdayâ\u0080\u0099s diagnosis, and based on the trajectory of advanced diagnostics the team has been conducting, I fully anticipate the Presidentâ\u0080\u0099s safe return to public engagements at that time.â\u0080\u009d Trump, 74, received experimental â\u0080\u009cpolyclonal antibodiesâ\u0080\u009d and oxygen at the White House on Friday after being diagnosed with the virus Thursday. Trump was hospitalized three nights at Walter Reed National Military Medical Center in Bethesda, Md., after arriving by helicopter Friday. Trump was discharged Monday. At the hospital, he received doses of the antiviral drug remdesivir and the steroid dexamethasone. In a Thursday interview with Fox Business Network, Trump attributed his apparently rapid recovery with him being â\u0080\u009ca perfect physical specimenâ\u0080\u009d and â\u0080\u009cextremely young.â\u0080\u009d House Speaker Nancy Pelosi (D-Calif.) questioned Trumpâ\u0080\u0099s sanity and unveiled a bill to set up a commission to analyze the presidentâ\u0080\u0099s mental fitness, to potentially justify his removal from power under the 25th Amendment. Trump is anxious to return to the campaign trail in the remaining weeks before the Nov. 3 election. On Thursday morning, the Commission on Presidential Debates said that it would make next Thursdayâ\u0080\u0099s scheduled debate in Miami between Trump and Democratic candidate Joe Biden a virtual forum â\u0080\u0094 which Trump rejected. Biden in turn rejected Trumpâ\u0080\u0099s proposal to delay the remaining two debates. In taped remarks, Trump credited the polyclonal antibodies infusion with making him feel better almost immediately. He reported no symptoms on Tuesday or Wednesday, Conley said in prior releases. A version of this report appears on NYPost.com."}]}