{"article": [{"url": "https://www.marketwatch.com/story/mayor-of-portland-to-trump-get-your-troops-out-of-the-city-2020-07-18", "published": 1595067380.0, "headline": "Mayor of Portland to Trump: Get your troops out of the city", "body": "The mayor of Portland, Ore., demanded Friday that President Donald Trump remove militarized federal agents he deployed to the city after some detained people on streets far from federal property they were sent to protect. “Keep your troops in your own buildings, or have them leave our city,” Mayor Ted Wheeler said at a news conference. Gov. Kate Brown said Trump is looking for a confrontation in the hopes of winning political points elsewhere. It also serves as a distraction from the coronavirus pandemic, which is causing spiking numbers of infections in Oregon and the nation. Brown’s spokesman, Charles Boyle, said Friday that arresting people without probable cause is “extraordinarily concerning and a violation of their civil liberties and constitutional rights.” Oregon Attorney General Ellen Rosenblum said she would file a lawsuit in federal court against the U.S. Department of Homeland Security, the Marshals Service, Customs and Border Protection and Federal Protection Service alleging they have violated the civil rights of Oregonians by detaining them without probable cause. She will also seek a temporary restraining order against them. The ACLU of Oregon said the federal agents appear to be violating people’s rights, which “should concern everyone in the United States.” “Usually when we see people in unmarked cars forcibly grab someone off the street we call it kidnapping,” said Jann Carson, interim executive director of the American Civil Liberties Union of Oregon. “The actions of the militarized federal officers are flat-out unconstitutional and will not go unanswered.” Federal officers have charged at least 13 people with crimes related to the protests so far, Oregon Public Broadcasting reported Thursday. Some have been detained by the federal courthouse, which has been the scene of protests. But others were grabbed blocks away. “This is part of the core media strategy out of Trump’s White House: to use federal troops to bolster his sagging polling data,” Wheeler said. “And it is an absolute abuse of federal law-enforcement officials.” One video showed two people in helmets and green camouflage with “police” patches and no further identification grabbing a person on the sidewalk, handcuffing them and taking them into an unmarked vehicle. “Who are you?” someone asks the pair, who do not respond. At least some of the federal officers belong to the Department of Homeland Security. Customs and Border Protection said in a statement that its agents had information indicating the person in the video was suspected of assaulting federal agents or destroying federal property. “Once CBP agents approached the suspect, a large and violent mob moved towards their location. For everyone’s safety, CBP agents quickly moved the suspect to a safer location,” the agency said. However, the video shows no mob. In another case, Mark Pettibone, 29, said a minivan rolled up to him around 2 a.m. Wednesday and four or five people got out “looking like they were deployed to a Middle Eastern war.” Pettibone told the Associated Press he got to his knees as the group approached. They dragged him into the van without identifying themselves or responding to his questions and pulled his beanie over his eyes so he couldn’t see, he said. “I figured I was just going to disappear for an indefinite amount of time,” Pettibone said. Pettibone said he was put into a cell and officers dumped the contents of his backpack, with one remarking: “Oh, this is a bunch of nothing.” After he asked for a lawyer, Pettibone was allowed to leave. “Authoritarian governments, not democratic republics, send unmarked authorities after protesters,” Democratic U.S. Sen. Jeff Merkley said in a tweet. U.S. Attorney Billy Williams in Portland said Friday he has requested the Department of Homeland Security Office of the Inspector General to investigate the actions of DHS personnel. In a letter Friday, Oregon’s two senators and two of its House members demanded that U.S. Attorney General William Barr and Homeland Security Acting Secretary Chad Wolf immediately withdraw “these federal paramilitary forces from our state.” The members of Congress also said they’ll be asking the DHS inspector general and the U.S. Department of Justice to investigate the presence and actions of federal forces in Portland. “It’s painfully clear this administration is focused purely on escalating violence without answering my repeated requests for why this expeditionary force is in Portland and under what constitutional authority,” Democratic Sen. Ron Wyden said. On Thursday night, federal officers deployed tear gas and fired non-lethal rounds into a crowd of protesters. Wolf visited Portland on Thursday and called the demonstrators, who are protesting racism and police brutality, “violent anarchists.” Wolf blamed state and city authorities for not putting an end to the protests. But Portland police said Friday they wound up arresting 20 people overnight. At least two protests occurred Thursday night, one near the federal courthouse and the other by a police station in another part of the city. Police told protesters to leave that site after announcing they heard some chanting about burning down the building. Protester Paul Frazier said Friday the chant was “much more rhetorical than an actual statement.” Portland Police Chief Chuck Lovell told reporters Friday that his officers are in contact with the federal agents, but that neither controls the others’ actions. “We do communicate with federal officers for the purpose of situational awareness and deconfliction,” Lovell said. “We’re operating in a very, very close proximity to one another.” The American Civil Liberties Union Foundation of Oregon on Friday added the federal government to a lawsuit it filed earlier to halt the use of crowd control measures, including tear gas and rubber bullets, against journalists and legal observers at protests in Portland. “The lawsuit is one of many the ACLU will be filing against federal authorities in Portland for their unconstitutional attacks on people protesting the police killing of George Floyd,” the group said. Tensions have escalated in the past two weeks, particularly after an officer with the U.S. Marshals Service fired a less-lethal round at a protester’s head on July 11, critically injuring him. The protests following the police killing of Floyd in Minneapolis have often devolved into violent clashes between smaller groups and the police."}]}