{"article": [{"url": "https://www.marketwatch.com/story/the-big-ten-will-play-football-this-season-after-all-11600266109", "published": 1600263500.0, "headline": "Big Ten reverses field and will play football this fall after all", "body": "Ohio State Buckeyes celebrate after a win against the Wisconsin Badgers in the Big Ten Football Championship. Joe Robbins/Getty Images The Big Ten is going to play football this fall after all. The Big Ten announced on Aug. 11 that it was pushing fall sports, including its cash-cow football programs, to the spring because of the coronavirus pandemic, but the conference changed course Wednesday, citing improved confidence in virus testing. The Big Ten said its Council of Presidents and Chancellors voted unanimously Tuesday to restart sports. The emergence of daily rapid-response COVID-19 testing, not available when university presidents and chancellors decided to pull the plug on the season, helped trigger a re-vote. The new season is now slated to begin on the weekend of Oct. 24. Each university is to play an abbreviated eight-game schedule. Big Ten Commissioner Kevin Warren said during a press conference on Wednesday that the conference “went to work to establish our Big Ten return-to -competition task force.” President Donald Trump for weeks has been campaigning for the Big Ten to play its football season, with several of its marquee programs located in Electoral College battlegrounds, including in Pennsylvania, Michigan and Wisconsin, as well as Ohio and Iowa and others. Trump had previously spoken to Warren, but a university president volunteered that Trump had had no bearing on the decision, NBC News reported. To the extent the president’s name came up at all, that university leader reportedly told NBC, it was a negative, because the conference wanted to make sure the decision did not smack of politics. iframe.twitter-tweet { width: 100% !important; } The Pac-12 is the only remaining major conference that will not be playing football in the fall. However, there have been reports that there’s some momentum for a “mid to ate November” return for the Pac-12, according to ESPN. The Associated Press contributed to this report."}]}