{"article": [{"url": "https://www.marketwatch.com/story/what-the-federal-reserve-inflation-policy-means-for-your-retirement-savings-2020-08-28", "published": 1598686160.0, "headline": "What the Federal Reserve inflation policy means for your retirement savings", "body": "The Federal Reserve has kept interest rates low for more than a year, and new policy may keep it that way for the foreseeable future too, it said in a policy statement on Thursday. The central bank said it would tolerate inflation “moderately above 2%,” though it did not specify what exactly that meant. Dallas Fed President Robert Kaplan clarified later that day that inflation could range between an annual rate of 2.25% and 2.5%. If that happens, the Federal Reserve may not increase interest rates as frequently. Inflation measures how quickly (or not) the price of goods and services grows, while the interest rate a lender uses to charge a borrower is often based on the Federal Reserve’s federal funds rate — the latter may influence the former. Interest rates have remained quite low in recent months. Nearly a year ago, the Federal Reserve cut interest rates to less than 2%, then again earlier this year to around 1% and then, at the start of the pandemic, interest rates were between 0% and 0.25%. Low interest rates can be good for consumers, who may indirectly benefit with slightly lower rates for credit card debt and mortgages — but it could also adversely affect retirement savings, as the growth of certain investments will be stunted. “The Fed policy makes it crystal clear that we should expect low interest rates for years,” said Larry Luxenberg, principal at Lexington Avenue Capital Management. “Truly safe investments won’t yield much.” See: I’m a 57-year-old nurse with no retirement savings and I want to retire within seven years. What can I do? The problem: The closer someone gets to retirement, the more likely their portfolios are to represent conservative investments, such as bonds. These “safe assets,” in response, will see a reduction in returns, said Eric Walters, managing partner and founder of Summit Hill Wealth. “As a result, they need to review their plans for retirement using lower return assumptions,” he said. Many plans rely on average historical rates of returns, which could be between 4% and 5% for intermediate bonds, he said. “Using these assumptions now for a retirement plan could be disastrous when actual interest rates for 10-year Treasurys are 0.74%.” Not all Americans are adequately prepared for retirement, either. Near-retirees may not have as much (or any) retirement savings, and rely on cash and cash-equivalents, like certificates of deposit, which suffer in low-interest rate environments. Bank accounts, including checking and savings, accrue less interest during these times. Those in their 60s may not have to worry just yet, said Jennifer Weber, vice president of financial planning at Weber Asset Management, especially as people are living longer and healthier lives and may be working well into their 60s and 70s. According to actuarial tables, “a person who is 65 and in good health still has decades to live,” Weber pointed out. “This individual should have a reasonable amount in the stock market (assuming he/she has enough in savings) since the stock market tends to do well in a low-interest rate environment.” Still, near-retirees should be on the lookout for how this new policy may impact their nest egg. Low rates could affect pension buyout offers and single premium annuities, which could be locked into permanently low rates, said Malcolm Ethridge, executive vice president and a financial adviser at CIC Wealth. Investors may turn to stocks to compensate for their bond interest loss, said Michelle Buonincontri, a financial adviser with “Being Mindful in Divorce.” “This potentially creates greater exposure in the stock market and risk for investors that may have previously used safer bonds to subsidize retirement income needs,” she said. But they should try to avoid relying too heavily on equities, which have current valuations higher than historical norms, Walters said. “Retirees need to prepare a financial plan with lower projected returns for equities,” Walters said. “By using lower projected returns for bonds and equities, retirees can work to avoid running out of money and need to ask for help from their kids or trying to go back to work.”"}]}