{"article": [{"url": "https://www.marketwatch.com/story/new-york-new-jersey-and-connecticut-want-people-coming-from-hot-spots-to-quarantine-but-how-will-they-enforce-it-2020-06-25", "published": 1593450260.0, "headline": "New York, New Jersey and Connecticut want people coming from hot spots to quarantine - but how will they enforce it?", "body": "As the coronavirus infection rate drops in New York, New Jersey and Connecticut but rises elsewhere, the tri-state area's governors say people arriving from new hot spots will have to self-isolate for 14 days. President Donald Trump is at least one person who won't be getting fined for breaking the quarantine advisory. He had planned to travel to his golf club in Bedminster, N.J. over weekend, but cancelled the trip. “ 'I think they're going to honor it because people at the end of the day, they get it now. It took them too long to get it but this country gets it now.' ” - New York State Gov. Andrew Cuomo Before Trump called off the trip, Murphy said the commander-in-chief would not be subject to the quarantine. Murphy has said Trump counts as an essential worker and a White House spokesman has added \"the president of the United States is not a civilian.\" In late March, President Trump briefly mulled the idea of quarantining three states, but backed off the idea. Meanwhile, state officials will have to try enforcing the new \"joint incoming travel advisory\" in a densely-populated region with major cities, international airports and the Interstate-95 highway running through. So how will they do it? In New York at least, Gov. Andrew Cuomo said there will be \"random checks\" on visitors after they fly into the state, potential police questioning for people with out-of-state license plates, a hotline to report violators, and fines up to $10,000. \"I think they're going to honor [the advisory] because people at the end of the day, they get it now. It took them too long to get it but this country gets it now,\" Cuomo said on CNN. “ 'We welcome everyone to New Jersey, but we simply ask you to join us in our shared sacrifice to keep ourselves moving in the right direction.' ” - N.J. Gov. Phil Murphy In New Jersey and Connecticut, officials make it sound more like an honor system. \"We welcome everyone to New Jersey, but we simply ask you to join us in our shared sacrifice to keep ourselves moving in the right direction,\" New Jersey Gov. Phil Murphy said last week, adding, \"This is not a polite recommendation. This is a strong advisory.\" If travelers come to the Garden State, they shouldn't plan on eating inside a restaurant any time soon. Indoor dining was supposed to start Thursday, but after coronavirus spikes \"in other states driven by, in part, the return of indoor dining, we have decided to postpone indoor dining indefinitely. New York City Mayor Bill DeBlasio tweeted TWTR, -0.23%  Monday that he was reconsidering opening up indoor dining in the city. The COVID-19 pandemic, which was first identified in Wuhan, China in December, had infected 10,199,798 people globally and 2,534,981 in the U.S. as of Monday. It had claimed at least 502,947 lives worldwide, 125,928 of which were in the U.S., according to Johns Hopkins University's Center for Systems Science and Engineering. The Dow Jones Industrial Index DJIA, +0.56%  and the S&P 500 SPX, +0.87%  ended higher Monday, recovering lost ground after last week's losses that were due to reports of a surge of coronavirus in U.S. states that have loosened restrictions. Fauci has said he was hopeful that a coronavirus vaccine could be developed by early 2021. A hot spot is defined as a state with a COVID-19 positivity rate of 10% or higher over a seven-day rolling average, according to the advisory. It can also apply to states where the rate is higher than 10 cases for every 100,000 residents. States above those levels as of Wednesday were Alabama, Arkansas, Arizona, Florida, North Carolina, South Carolina, Washington, Utah and Texas, according to Cuomo. New York was once America's epicenter for the outbreak and the point of the quarantine advisory is to avoid that happening again, he said. Last week, Texas Gov. Abbott ordered the closure of all bars and restrictions on outdoor activities. Restaurants can still have dine-in service at 50% capacity. Texas is the first state to re-impose restrictions after lifting them. Abbott lifted the state's stay-at-home order on April 30. The three states say they will update their websites to specify the states under the quarantine advisory. New York's site can be found here. Essential workers and first responders are exempt. So are people from hot spots who pass through and stay under 24 hours. “ Cuomo and Murphy have acknowledged they can't put up travel checkpoints. ” Cuomo and Murphy acknowledged that state authorities can't set up travel checkpoints. New York is home to John F. Kennedy International Airport and LaGuardia Airport. New Jersey has Newark Liberty International Airport. The states can't regulate in-bound and out-bound flights in the area's airports, because that's a job for the federal government. But Murphy and Cuomo - especially Cuomo - say they will put teeth on the rules if people are caught breaking the quarantine on their turf. (The quarantine advisory also applies to in-state residents returning from hot spot states.) For example, Cuomo said Thursday that state officials can get the names of people who fly in. \"You fly in here from another state, we know what flight you came in on. And we'll have inspectors who are randomly looking at the names on the list and calling to follow up to make sure you're quarantining.\" A New York traffic stop could lead to a violation too, Cuomo said a day earlier. \"You get pulled over by a police officer, 'Oh, you're a Florida license. When did you get here?' You can't lie, because he can look it up. Port Authority has all the records and Port Authority is going to make all the travel records available,\" Cuomo said. People can also report a non-compliant individual to state authorities, he noted. Cuomo said each state will enforce the advisory differently, but in New York, fines for someone found breaking the quarantine start at $2,000 and run to $10,000. The quarantine advisory relies on people doing the right thing just like all sorts of laws, Cuomo has noted. “ 'You could argue that every law is the honor system until you get caught, right?' ” - Gov. Andrew Cuomo \"You could argue that every law is the honor system until you get caught, right?,\" Cuomo told reporters when announcing the advisory Wednesday. \"You can speed in a car until you get caught, and then you get penalized. So, it's almost any law. â\u0080¦ You can violate the quarantine until you get caught. And then when you get caught you're in mandatory quarantine and you're fined thousands of dollars.\" Murphy said in New Jersey, the health department has the power to fine individuals if it finds \"specific instances of flagrant non-compliance.\" Despite that potential power, Murphy emphasized the quarantine is asking \"folks to take on a big amount of personal responsibility to do the right thing.\" The states will \"aggressively pursue a public relations campaign\" at airports, highways and train stations to spread the word on the quarantine advisory, Murphy said. \"The key here with the mandate when it comes to the travel guidance is the uniform messaging and the personal responsibility elements,\" said Max Reiss, a spokesman for Connecticut Governor Ned Lamont. \"The state has been successful in mitigating the spread of COVID-19 by utilizing a similar strategy in the past when it has come to social distancing and the wearing of face coverings.\" For the time being, Connecticut has no plans to use police, National Guard or fines for enforcement, Reiss told MarketWatch. 'Even leaky or partial quarantines are effective' The three states will have difficulty enforcing the quarantine advisory, according to Dr. Jeff Engel, senior advisor to the COVID-19 Response at the Council of State and Territorial Epidemiologists, a professional association. “ 'I just don't think we have the capacity to track people that carefully in the U.S.' ” - Dr. Jeff Engel, senior advisor to the COVID-19 Response at the Council of State and Territorial Epidemiologists \"I just don't think we have the capacity to track people that carefully in the U.S.,\" he said. But it's still worth testing out, Engel said. \"Even leaky or partial quarantines are effective in reducing disease transmission.\" Several states have 14-day mandates for out-of-state visitors, such as Alaska, Maine and Hawaii. But this new advisory is innovative because it's regional, Engel said. \"Particularly in metropolitan areas that cross state borders, state borders are absolutely trivial\" in a pandemic, Engel said. The advisory may deter some visitors, but at the very least, Engel said, \"it's a potent way to enforce the public messaging\" on the steps needed to slow the spread. This story was updated on June 29."}]}