{"article": [{"url": "https://www.marketwatch.com/story/sacha-baron-cohen-calls-facebook-trumps-willing-accomplice-in-spreading-conspiracy-theories-2020-10-08", "published": 1602168380.0, "headline": "Sacha Baron Cohen calls Facebook Trumpâ\u0080\u0099s â\u0080\u0098willing accompliceâ\u0080\u0099 in spreading conspiracy theories", "body": "Borat isnâ\u0080\u0099t finished with Facebook yet. British comedian and satirist Sacha Baron Cohen â\u0080\u0094 who has a history of pushing buttons with the movie â\u0080\u009cBoratâ\u0080\u009d and TV series â\u0080\u009cWho Is America?â\u0080\u009d â\u0080\u0094 calls the social network President Donald Trumpâ\u0080\u0099s â\u0080\u009cwilling accompliceâ\u0080\u009d as â\u0080\u009cthe greatest propaganda machine in historyâ\u0080\u009d in a new op-ed for Time. In his column â\u0080\u009cWe Must Save Democracy From Conspiraciesâ\u0080\u009d, Cohen refers to studies that show people are especially susceptible to misinformation and conspiracy theories during periods of great uncertainty â\u0080\u0094 such as the coronavirus pandemic, the resulting economic crisis, and the racial reckoning that Americans have been facing this year. And he accuses the president of exploiting the publicâ\u0080\u0099s fear and uncertainty, and claims that Facebook FB, +0.26% Â has given him the platform to do so. “ â\u0080\u009cThe Demagogue in Chief has a willing accomplice in Mark Zuckerbergâ\u0080\u0099s Facebook â\u0080\u0094 a megaphone that historyâ\u0080\u0099s worst autocrats could only dream of.â\u0080\u009d ” â\u0080\u0094 Sacha Baron Cohen Cohen writes that Facebookâ\u0080\u0099s algorithm â\u0080\u009cdeliberately amplifies content that generates more engagement,â\u0080\u009d and quotes an anonymous Facebook executive who recently told Politico that â\u0080\u009cRight-wing populism is always more engagingâ\u0080\u009d because it triggers â\u0080\u009canger, fearâ\u0080\u009d and â\u0080\u009can incredibly strong, primitive emotion.â\u0080\u009d Indeed, six of the top 10 best-performing link posts by U.S. Facebook pages over 24 hours on Wednesday were from conservative sources, including radio host and Fox News contributor Dan Bongino, Fox News, and Donald Trump for President. iframe.twitter-tweet { width: 100% !important; } A Facebook spokesperson told MarketWatch by email that: â\u0080\u009cWe enforce our rules against anyone, including politicians, who try to use our platform to suppress voting or spread harmful misinformation about COVID-19. Weâ\u0080\u0099ve removed posts from President Trump making harmful claims about COVID-19 â\u0080\u0094 including one this week equating the virus with the flu â\u0080\u0094 and weâ\u0080\u0099ve applied many labels to his posts on voting noting that vote-by-mail is a trustworthy method.â\u0080\u009d Cohen also didnâ\u0080\u0099t pull any punches against Facebook while giving a speech hosted by the Anti-Defamation League last November. Then, he claimed that if Facebook had existed in the 1930s, it would have allowed Adolf Hitler to post ads for his â\u0080\u009csolutionâ\u0080\u009d to the â\u0080\u009cJewish problemâ\u0080\u009d on the platform, because the social network cares â\u0080\u009cmore about boosting their share price than about protecting democracy.â\u0080\u009d But he also noted that Twitter TWTR, -0.23% Â and the Alphabet-owned Google TWTR, -0.23% Â were part of the problem, too. Read: Sacha Baron Cohen amplifies his sharp rebuke of big tech companies, while Facebook insists itâ\u0080\u0099s antiâ\u0080\u0093hate speech Facebook responded at the time by saying that Cohen had â\u0080\u009cmisrepresentedâ\u0080\u009d its policies. â\u0080\u009cHate speech is actually banned on our platform,â\u0080\u009d the statement read. â\u0080\u009cWe ban people who advocate for violence and we remove anyone who praises or supports it. Nobody â\u0080\u0094 including politicians â\u0080\u0094 can advocate or advertise hate, violence or mass murder on Facebook.â\u0080\u009d And in January, Cohen tweeted out a Guardian investigation looking at 218,100 political ads on Facebook, which found that Trumpâ\u0080\u0099s re-election campaign spent about $20 million in 2019 to target conservative voters, far outspending any other presidential candidate. iframe.twitter-tweet { width: 100% !important; } â\u0080\u009cTerrifying,â\u0080\u009d he tweeted, adding that history would judge Mark Zuckerberg harshly â\u0080\u0094 â\u0080\u009cif we still have historians after you help destroy democracy!â\u0080\u009d It should be noted that social media sites have stepped up their anti-misinformation campaigns this year, with Facebook banning controversial conspiracy group QAnon on Oct. 6, and removing all of its content across its platforms. Both Twitter and Facebook also flagged a Monday tweet by President Trump that made false claims comparing the coronavirus and the flu, with Facebook pulling down the post. And social media companies also removed the controversial â\u0080\u009cplandemicâ\u0080\u009d video that was pushing misleading information about hydroxychloroquine as a COVID-19 treatment over the summer. The Big Tech companies have been in the hot seat this year for their business practices, including their alleged complicity in the spread of misinformation. A House Judiciary subcommittee report released this week even suggests breaking apart tech companies like Facebook, Apple, AMZN, +3.01% Â and Google. This article has been updated with a response from Facebook."}]}