{"article": [{"url": "https://www.marketwatch.com/story/us-manufacturers-expand-in-july-for-third-straight-month-ism-finds-but-executives-say-not-all-the-jobs-are-coming-back-2020-08-03", "published": 1596453860.0, "headline": "U.S. manufacturers expand in July for third straight month, ISM finds, but executives say not all the jobs are coming back", "body": "The numbers: American manufacturers expanded in July for the third month in a row, but senior executives say production remains well below pre-pandemic levels and not all the jobs are coming back soon. The Institute for Supply Management said its manufacturing index rose to 54.2% from 52.6% in June, marking the highest level in 15 months. Economists surveyed by MarketWatch had forecast the index to total 53.6%. The high level of the index is somewhat misleading, economists point out. Although readings over 50% indicate growth, the index doesn’t measure the actual amount of production or tell how much it has improved. The survey basically asks executives if their businesses are doing better or worse compared to the prior month. “Diffusion indexes like the ISM capture rates of change of activity, not levels, and output remains depressed,” said chief economist Ian Shepherdson of Pantheon Macroeconomics. Other economic signposts such as durable-goods orders, industrial production and the monthly U.S. jobs report show that companies are producing significantly fewer goods and employing fewer workers than they were before the pandemic. The index had fallen to an 11-year low of 41.5% in April during the height of the crisis. Read: Economy suffers titanic 32.9% plunge in 2nd quarter, points to drawn-out recovery Also:‘A massive welfare economy’ - federal aid prevents even steeper GDP collapse What happened: The ISM’s indexes for new orders, production and employment all rose. The index for new orders jumped to 61.5% from 56.4%, while the production gauge rose to 62.1% from 57.3%. The employment index, meanwhile, edged up to 44.2% from 42.1%, but numbers below 50% signal that companies are still cutting jobs. Read:Job trouble? Wave of rehiring after economy reopened to fade in July after viral spiral “Incoming orders are slow. This is usually our busiest time of the year, but production is reduced due to lack of demand. Additional layoffs expected,” said an executive at a furniture maker. “Overall business remains down almost 70%, said an executive at a manufacturer of transportation equipment. “We are hanging on to as many employees as possible, but we will have to lay off 30% or more for at least two to three months until September or October.” Thirteen of the 18 industries tracked by ISM expanded in July, unchanged from the prior month. The ISM index is compiled from a survey of executives who order raw materials and other supplies for their companies. The gauge tends to rise or fall in tandem with the health of the economy. See: MarketWatch Economic Calendar Big picture: Manufacturers have fared better than the much larger service side of the economy that has been devastated by the coronavirus. Most companies are open and seeing an improvement in sales and orders after a sharp slump early in the crisis. The global pandemic has wreaked havoc on world trade, however, and reduced demand for a variety of consumer and industrial goods in the U.S. and abroad. It is going to take a long time for the U.S. and global economies to recover, especially if companies don’t bring back all of their workers and unemployment remains high. What they are saying? “Naturally, after an economy has been shut down and then reopened by government fiat, huge numbers of respondents will answer that business conditions, orders, production, etc. are better than they were when the economy was fully or partly shut down,” wrote MFR chief economist Joshua Shapiro in a note to clients. “This is akin to if someone started banging their head against a brick wall, then stopped doing that and was asked if they were feeling better. Of course, the answer would be ‘yes, I feel better now.’ What that answer wouldn’t reveal is how much better they felt, nor would it disclose how they felt relative to before they started banging their head on the wall.” See:MarketWatch Coronavirus Recovery Tracker Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% rose modestly in Monday trades.The ISM report briefly helped to extend market gains."}]}