{"article": [{"url": "https://www.marketwatch.com/story/pelosi-opens-door-to-no-august-break-for-house-if-next-coronavirus-relief-bill-isnt-done-2020-07-14", "published": 1594746200.0, "headline": "Pelosi opens door to no August break for House if next coronavirus relief bill isn't done", "body": "House Speaker Nancy Pelosi raised the possibility that House lawmakers will hold off on their August break until a deal is reached on a new coronavirus relief bill, including an extension of more-generous jobless benefits. Appearing on CNN Tuesday, Pelosi was asked if she was willing to forego or delay that break. The California Democrat answered: \"Oh, we absolutely have to. We also have to come to an agreement.\" Currently, the Democratic-controlled House is scheduled to recess July 31 for a five-week break ending Sept. 8. But the second-ranking Democrat, Rep. Steny Hoyer of Maryland, told colleagues Monday to prepare to remain in session the first week of August, which would sync up with the Senate calendar. Pelosi's remarks open the door to a possibly even longer extended bargaining period with the Republican-run Senate and the White House over the next COVID-19 bill. Some analysts previously had predicted that another big coronavirus aid package was likely to come by the end of this month. Lawmakers are out of Washington, D.C., now, but are set to return Monday and start talks in earnest. Senate Republicans have already staked out opposition to the idea of extending without any changes the extra $600 per week add-on to unemployment benefits that was created in the March coronavirus aid bill. Because some workers, particularly low-wage ones, make more with the add-on than they did while working, they say it discourages jobless from seeking new work, even as unemployment is above 11%. Sen. Tim Scott, a South Carolina Republican, told reporters Monday he was opposed to extending the add-on, which is set to expire near the end of this month. \"I wasn't for it last time and I'm not for it this time,\" he said. Senate Majority Leader Mitch McConnell, a Kentucky Republican, has said his colleagues will focus on boosting COVID-19 liability protections for businesses, schools and other organizations in the next bill aid bill. Pelosi Tuesday was skeptical. \"Does he mean essential workers have to go to work, if they don't they lose their unemployment Insurance, and if they get sick there, they have no recourse?\" she asked."}]}