{"article": [{"url": "https://www.marketwatch.com/story/etf-wrap-batten-down-the-hatches-11600961578", "published": 1600947620.0, "headline": "ETF Wrap: Batten down the hatches", "body": "What just happened? What’s the story of the past week? In brief: the selloff is worsening, the election is looming, and no help is coming from Washington. We covered the impact of a European second wave on ETFs with exposure to the Continent, the worst day in three months for financials, and more. Here at ETF Wrap, we didn’t set out to deliver an edition that was all about risk avoidance – but that’s what people wanted to talk about. Thanks for reading. Does cash rule everything around you? Into an ETF landscape filled with novel new ideas about how to protect against downside risk – from defined outcome to tail-risk-riding– comes a new entrant. In mid-September, Cabana Asset Management launched a suite of “Target Drawdown ETFs,” with five separate options TDSC, +0.18% for the amount of downside (“drawdown”) an investor is willing to absorb. Cabana’s funds differ from some of the newer players in one important sense: they’ve been around for a decade, enjoying great success as an offering in separately-managed accounts. In fact, the ETFs launched with over $1 billion in assets under management, making it one of the largest launches in years. The funds use an algorithm to rebalance across asset classes in response to macro changes, Cabana CEO Chadd Mason told MarketWatch. The algorithm saw warning signs before the March decline, Mason said, and reallocated to the U.S. dollar, one of the few asset classes that held up at that time. Just as important, for the Cabana team, is that end investors find the products easy to understand and, “once they can see that it does do what it purports to do, it really gives the investor a lot of confidence to stay invested,” rather than fleeing to cash, Mason said. Is there an ETF for that? How else can investors hedge against the volatility and uncertainty that’s likely to characterize the next few months? Dan Weiskopf, portfolio manager for Toroso Investments, recommends the AGFiQ US Market Neutral Anti-Beta Fund BTAL, +0.15%. The fund “goes long low-beta (stocks) and short high-beta,” Weiskopf explained. “It goes up when the market goes down because high-beta typically goes down more than low-beta. What you end up with is a place to hide when the market goes down.” From the market top of February 19 to the bottom, March 23, when the S&P 500 lost one-third of its value, BTAL was up about 9%, according to FactSet data. In the year to date, it’s gained 7.4%, more than the S&P 500 SPX, +0.87%, but less than the Nasdaq COMP, +1.39%. Top 5 gainers of the last week WisdomTree Cloud Computing WCLD, +2.88% 4.4% TrueShares Technology, AI & Deep Learning LRNZ, +2.10% 4.3% Renaissance IPO IPO, +1.98% 3.5% SPDR FactSet Innovative Technology ETF XITK, +1.81% 2.6% SPDR S&P Internet ETF XWEB, +1.32% 2.5% Source: FactSet, through close of trading Wednesday, September 23, excluding ETNs and leveraged products Top 5 losers of the last week SPDR S&P Oil & Gas Equipment & Services XES, -1.65% -10.3% iShares U.S. Oil Equipment & Services IEZ, -1.42% -9.9% Invesco Dynamic Oil & Gas Services PXJ, -1.42% -9.7% InfraCap MLP AMZA, -0.19% -9.2% SPDR S&P Regional Banking KRE, -1.12% -9.1% Source: FactSet, through close of trading Wednesday, September 23, excluding ETNs and leveraged products Top 5 biggest flows gainers of the last week Shares Core S&P 500 IVV, +0.87% $4.69 billion Invesco QQQ Trust QQQ, +1.52% $1.59 billion Vanguard S&P 500 ETF VOO, +0.89% $1.17 billion SPDR Dow Jones Industrial Average DIA, +0.57% $569.6 million iShares 20+ Year Treasury Bond TLT, -0.01% $558.1 Source: FactSet, through close of trading Wednesday, September 23, excluding ETNs and leveraged products"}]}