{"article": [{"url": "https://www.marketwatch.com/story/trumps-jaw-dropping-calls-with-foreign-leaders-threaten-national-security-cnn-report-claims-2020-06-29", "published": 1593459380.0, "headline": "Trumpâ\u0080\u0099s jaw-dropping calls with foreign leaders threaten national security, Carl Bernstein report for CNN claims", "body": "A bombshell report by CNN late Monday claims President Donald Trump is so unprepared, outplayed and abusive on phone calls with foreign leaders that he poses a national security threat. The report by Carl Bernstein, who helped expose the Watergate scandal in the 1970s, said a number of onetime Trump White House advisers thought Trump was â\u0080\u009cdelusionalâ\u0080\u009d in dealing with foreign leaders, believing he could either bully or charm almost anyone. Bernstein wrote: â\u0080\u009cIn hundreds of highly classified phone calls with foreign heads of state, President Donald Trump was so consistently unprepared for discussion of serious issues, so often outplayed in his conversations with powerful leaders like Russian President Vladimir Putin and Turkish President Recep Tayyip ErdoÄ\u009fan, and so abusive to leaders of Americaâ\u0080\u0099s principal allies, that the calls helped convince some senior U.S. officials â\u0080\u0094 including his former secretaries of state and defense, two national security advisers and his longest-serving chief of staff â\u0080\u0094 that the President himself posed a danger to the national security of the United States, according to White House and intelligence officials intimately familiar with the contents of the conversations.â\u0080\u009d The CNN report, citing a number of unnamed officials who were interviewed repeatedly over a four-month period, claims Trump was particularly harsh on female leaders, such as German Chancellor Angela Merkel and former British Prime Minister Theresa May, calling Merkel â\u0080\u009cstupidâ\u0080\u009d and berating May for being weak. On the other hand, Trump reportedly pandered and spoke boastfully to autocrats such as Putin, Erdogan and Saudi Crown Prince Mohammed bin Salman, bragging about his wealth and insulting previous administrations. Also see:White House aware of Russian bounties in 2019 and Trump was briefed, officials say Bernstein wrote that his findings correspond to allegations made by former national security adviser John Bolton in his new book, but are more extensive, â\u0080\u009cand seemingly more damning.â\u0080\u009d Sources told Bernstein that Trump regularly conflated his own personal interests with national interests. The report said calls with Putin and ErdoÄ\u009fan were particularly worrisome, as Trump was â\u0080\u009calmost never being prepared substantively and thus leaving him susceptible to being taken advantage of in various ways.â\u0080\u009d According to Bernstein: â\u0080\u009cOne person familiar with almost all the conversations with the leaders of Russia, Turkey, Canada, Australia and western Europe described the calls cumulatively as â\u0080\u0098abominationsâ\u0080\u0099 so grievous to U.S. national security interests that if members of Congress heard from witnesses to the actual conversations or read the texts and contemporaneous notes, even many senior Republican members would no longer be able to retain confidence in the President.â\u0080\u009d The White House did not respond to CNN for comment, and Trump did not immediately tweet a response."}]}