{"article": [{"url": "https://www.marketwatch.com/story/the-government-clearly-kept-the-economy-afloat-in-the-second-quarter-but-now-were-apparently-going-to-be-on-our-own-2020-07-30", "published": 1596180860.0, "headline": "The government kept the economy afloat in the second quarter, so why are Republicans in a rush to pull the support away right before the election?", "body": "The quarterly report on gross domestic product released on Thursday showed just how terrible the economic collapse in the second quarter was, with GDP plunging at a record 32.9% annual rate. But the report also shows that massive government relief kept U.S. households afloat as millions of workers lost their jobs and vast swathes of the economy were shuttered to wait out the storm. This raises the $3 trillion question: Why would President Donald Trump and his Republican enablers in the Senate allow the safety net to be pulled away from tens of millions of voters just before a crucial Election Day? Let’s be honest: The decline in output from April to June would have been much worse if households hadn’t been able to spend what they did. Those relief payments fueled the rebound in consumer spending in May and June that gave us hope for a quick recovery in the economy. Follow the latest developments in the coronavirus pandemic Here’s a refresher of what happened. As part of the CARES Act relief package, Congress sent out $1,200 checks to tens of millions of Americans. Unemployment benefits were supercharged, small businesses got grants to tide them over for a couple of months, and state and local governments got some money to defray the costs of dealing with the pandemic. The benefits and tax provisions combined boosted GDP by about 11 percentage points, according to the fiscal impulse measure calculated by the Hutchins Center at the Brookings Institution. So, the decline in GDP would have been 44% instead of 32.9% without the support. Altogether, the CARES Act provided about $600 billion to households in the second quarter, the Bureau of Economic Analysis said. The impact of the government relief on personal incomes was dramatic. Real disposable personal incomes increased by a record 9.7% (45% annualized), even though wages fell 6.8% and income from small businesses fell 13.2%. Excluding government transfer payments such as the $1,200 checks and unemployment checks, real disposable incomes plunged a record 6.1% quarterly (22.3% annualized). Those government checks are the only reason the personal savings rate soared to a record 25.7% of disposable incomes. And those savings are the only thing that’s kept tens of millions of families from starving or from losing their homes. If the benefits aren’t extended, millions will fall into poverty when their savings run dry, and the businesses that rely on their spending will then fail. If the country goes over this fiscal cliff, millions could wind up living in ramshackle “Trump Towers” beneath freeway overpasses. Yet much of the government aid is fading away just as the pandemic tightens its grip. Negotiations have broken down on another package of aid to U.S. households, states and businesses. No one knows if they’ll get another $1,200 check, or if unemployment checks will get another boost, or if state and local governments will get any relief at all. Democrats want another huge package of aid totaling more than $3 trillion, including extension of the controversial $600-a-week payment to people receiving unemployment benefits. Republicans can’t even agree among themselves on what they want, but none of them seem to favor doing what’s needed. Laughably, they are bemoaning what saving America would do to the national debt. Federal Reserve Chairman Jerome Powell once again rebuked the government for inaction. “A full recovery is unlikely until people are confident that it’s safe to re-engage in a broad range of activities,” he said in his press conference on Wednesday. “The path forward will also depend on policy actions taken at all levels of government to provide relief and to support the recovery for as long as needed.” Typically, the party in power would support more stimulus, especially in an election year. No politician wants to play bad cop right before an election. But Trump isn’t typical. He reluctantly agreed to the earlier pandemic responses. Now he’s boxed himself into a corner. If he calls for more than a minimum amount of relief, that’s a tacit admission that the coronavirus pandemic isn’t under control and that the economy isn’t bouncing back like you’ve never seen. As I wrote in April, Trump’s electoral strategy is to declare victory over the virus, regardless of the facts. It looks like he’s sticking to that plan, no matter how many lives are shattered by his denial of the truth. And the Republican leadership seems committed to going down with Trump."}]}