{"article": [{"url": "https://www.marketwatch.com/story/facebook-in-the-age-of-covid-19-users-are-online-but-will-advertisers-pay-to-get-to-them-2020-04-06", "published": 1595847980.0, "headline": "Facebook has weathered many storms, but the latest are coming for its core", "body": "The coronavirus pandemic sent users to Facebook Inc.’s social-networking, messaging and live-streaming platforms in record numbers, but little else has gone right for Mark Zuckerberg’s company amid COVID-19’s spread. Facebook FB, +0.26% is in the jaws of a world-wide advertising boycott, faces withering criticism of its hands-off policy toward President Donald Trump’s missives on its platform, and a deepening investigation of its business practices by federal regulators. Zuckerberg will testify at a Congressional antitrust subcommittee hearing July 29. Amid all of that, the social-media giant is bracing for a rare down quarter when it reports second-quarter earnings results on July 30. (The results, originally scheduled July 29, were moved back a day when the hearing was rescheduled from July 27 so as not to conflict with a memorial for the late Rep. John Lewis at the U.S. Capitol.) Facebook should have experience with this kind of drama: The company has faced chaos before in the wake of the 2016 presidential election, and has continued to rack up record revenue, share prices and market valuations, but the twin storms of COVID-19 and social unrest are both aiming for Facebook’s core business, advertising. More than 1,000 companies from Coca-Cola Co. KO, +0.69% to Verizon Communications Inc. VZ, +0.23% are boycotting Facebook ads because of hate speech on its platforms amid a larger social protest movement across the U.S. and around the world. While large advertisers publicly proclaim they will not use Facebook, small- and medium-size businesses — which account for three-fourths of Facebook’s advertising revenue —— are facing the most extreme damage from the pandemic and cutting their ad spending in response. See also: Here are the major brands that have pulled ads from Facebook If there is a silver lining, it could be the hundreds of millions of dollars in political ads Facebook should collect between now and the Nov. 3 general election. In last year’s third-quarter earnings call, Chief Executive Mark Zuckerberg estimated ads from politicians to be “less than 0.5% of our revenue next year.” This would be about $400 million, based on FactSet analysts’ forecast of $77.4 billion in revenue in 2020. But that very notion — especially after the allegations of misleading information on Facebook played out during the 2016 election — is a pillar of the July boycott. Unless Facebook seriously cleans up this area, some major brands are likely to extend their pause in advertising on the platform, according to analysts and advertising experts. Nearly three of four Americans (72%) do not want political campaigns to be able to micro-target them through digital ads, according to a recent poll from the Knight Foundation/Gallup. A majority (59%) believe online political ads should display who paid for them, how much, and who they target. And 20% favor an outright ban on digital election campaign ads. The immediate impact of the boycott, as measured by what Facebook’s top 100 advertisers spent in the U.S. on July 1, was significant. They spent $11.2 million this year, down 18% from $13.8 million on July 1, 2019, according to research firm Pathmatics Inc. The biggest blow came with the absence of The Walt Disney Co. DIS, +1.53% , Facebook’s top U.S. advertiser for the first six months of 2020. Disney spent about $210 million on Facebook ads for Disney+ in the U.S. in the first half of this year, Pathmatics estimates. From June 25-30, Disney spent $1.41 million. Another major ad customer, Starbucks Corp. SBUX, +0.53% , spent about $1.2 million on Facebook from June 25-30, before starting its boycott. Read more: The Facebook ad boycott could pay off for companies more than advertising on Facebook And yet, Facebook has been able to easily weather the storm because its top 100 advertisers account for less than 20% of revenue, and its top-50 make up just 6%, according to Ad Age magazine. The top 100 advertisers accounted for about 15% of daily U.S. revenue in 2019, based on data from Pathmatics. More significantly, 76% of ad sales come from some 8 million paying customers, many of whom are medium- and small-sized businesses that are coping with a major economic downturn. Some 160 million businesses have a presence on Facebook, the company confirmed. “Given Facebook’s high auction density, we believe there are plenty of other advertisers who will step in take advantage of (potentially) lower-priced inventory,” J.P. Morgan analyst Doug Anmuth said in a July 15 note. Business in the age of COVID-19: Read how other large companies will be affected by the coronavirus Jefferies analyst Brent Thill expects the ban to be temporary as ad spending escalates in the second half of 2020. More than 100 U.S. brands and agencies plan to increase their digital budgets more than 25% year-over-year in the third quarter, according to an IAB survey in June. Conversely, in a March survey, the advertisers said they would reduce digital ad budgets by 20% in May and June. “We do not expect a V-shaped recovery in ad demand, but we believe there is substantial evidence indicating digital advertising is more resilient than traditional channels like linear TV,” Thill wrote in a July 13 note. For Q2, he modeled average ad spending would decline 2% year-over-year, with growth in Q3 (9%) and Q4 (18%). “We anticipate the share shift to digital advertising to accelerate in 2020,” Thill said. The long-term trend favors Facebook and Alphabet’s Google GOOGL, +1.82% GOOG, +1.97% over Twitter Inc. TWTR, -0.23% and Snap Inc. SNAP, -0.18% , he said. Digital advertising will increase its share of the overall advertising market in the U.S. this year to 60% from 55%, according to eMarketer analyst Nicole Perrin. She expects digital to grow nearly 2% this year — a fraction of the 17% she predicted before COVID-19 — while television ad spending will decline 15% and print will dive 25%. See also: Facebook is both benefiting and battered by the coronavirus impactWhat the numbers are saying Revenue: Analysts on average expect Facebook to report $17.3 billion in second-quarter revenue, according to FactSet, down from $20.57 billion expected at the end of 2019. Monthly active users, a key indicator of Facebook’s growth and advertising appeal, are projected at 2.62 billion by FactSet, up 8% from the 2.41 billion reported a year ago. Earnings: Average analyst expectations from FactSet are for earnings of $1.39 a share, down from $2.13 a share at the beginning of the year. Stock movement: Through Wednesday, shares are up 13% in 2020, with most of the gains coming since mid-March and outbreak of COVID-19. At a market value of about $685 billion, Facebook lags behind rival Alphabet but significantly ahead of Twitter and Snap. The broader S&P 500 index SPX, +0.87% is up 0.2% this year.What the company is saying July 27: Facebook reschedules Q2 results to July 30 after House resets Big Tech hearing to July 29. Read more: Facebook pushes earnings report to Thursday after Big Tech hearing is rescheduled July 4: Zuckerberg says he’s not worried about the boycott and has no intention of changing company policy, according to a new report. “We’re not gonna change our policies or approach on anything because of a threat to a small percent of our revenue, or to any percent of our revenue,” he said, according to The Information, which cited a transcript of remarks Zuckerberg gave at an employees-only virtual town hall. June 28: Zuckerberg implemented policy changes during a virtual town hall meeting as more major advertisers joined a boycott of the platform and shares sank. Zuckerberg announced several steps to eliminate hateful content in ads, tamp down on false claims leading to the 2020 elections, and make progress on racial justice. He added Facebook will hide or block content considered hateful or that could harm voting, with no exception for politicians, as Twitter has done to President Trump and others. Zuckerberg had previously spoken out against Twitter’s approach. April 29: Facebook reported better-than-expected quarterly revenue but missed on earnings. Still, the company managed to double its profit from a year ago, sending its shares up 10% in after-hours trading. Facebook warned its business “has been impacted by the COVID-19 pandemic and, like all companies, we are facing a period of unprecedented uncertainty in our business outlook.” What analysts are saying • “About two-thirds of agencies and brands surveyed say Facebook/Instagram offers the best ROI with nearly one-third pointing to Google/YouTube as their best performing platform.” — Loop Capital Markets analyst Rob Sanderson, maintaining a buy rating on Facebook shares, while raising its price target to $265 from $215, on July 20. • “FB remains one of our best ideas we continue to like it into 2Q earnings. Industry discussions checks suggest the online ad market has rebounded well since bottoming in April, w/FB benefiting from: 1) its large base of 8M+ advertisers; 2) heavy exposure to performance-based/DR ads; 3) strong user engagement scale; 4) proven ROI; 5) lower exposure to travel (LSD-MSD %).” — J.P. Morgan analyst Doug Anmuth, on raising his rating to overweight and price target to $290 from $245, on July 15. • “We do not expect a V-shaped recovery in ad demand, but we believe there is substantial evidence indicating digital advertising is more resilient than traditional channels like linear TV… In 2020, we expect digital’s share of total spend to expand by 400bps to 54%, as advertisers value the flexibility, measurability, and surging usage of platforms like FB, GOOG, and SNAP.” – Jefferies analyst Brent Thill, on maintaining a buy rating and raising Facebook’s price target to $285 from $250, on July 13. This article is part of a series tracking the effects of the COVID-19 pandemic on major businesses, and will be updated. It was originally published on April 6."}]}