{"article": [{"url": "https://www.marketwatch.com/story/travel-will-never-ever-go-back-to-the-way-it-was-airbnb-ceo-says-2020-06-28", "published": 1593370280.0, "headline": "'Travel will never, ever go back to the way it was,' Airbnb CEO says", "body": "“ \"Travel will never, ever go back to the way it was pre-COVID.\" ” That's the grim view of Airbnb Inc. co-founder and Chief Executive Brian Chesky, in an interview published Sunday by Axios. \"I will go on the record to say that travel will never, ever go back to the way it was pre-COVID. It just won't,\" Chesky told Axios. \"There are sometimes months when decades of transformation happen.\" Chesky predicted that vacationers will stay closer to home in the future, largely limiting their travel to places within driving distance, with national parks becoming even more popular destinations. \"I think you're going to start to see travel becoming more intimate, more local, to smaller communities,\" he said, citing Airbnb data that shows travel within countries is recovering to normal levels. But its international business is still being hit hard. \"People are not getting on airplanes, they're not crossing borders, they're not meaningfully traveling to cities, they're not traveling for business.\" Read: Is it safer to stay at a hotel or an Airbnb during your summer vacation? 'We need to balance sanity and risk' \"People will, one day, get back on planes,\" Chesky told Axios. \"But one of the things that I do think is a fairly permanent shift is ... a redistribution of where travelers go.\" Chesky said the changes hurt convention business for years to come. \"I think a lot of people are going to realize they don't need to get on an airplane to have a meeting,\" he said. While its business is improving, the global shutdowns caused by the coronavirus pandemic had a devastating effect on Airbnb. The San Francisco-based company laid off nearly 25% of its workforce in early May, and raised about $2 billion in equity and debt to boost its balance sheet. Its long-anticipated initial public offering seems unlikely to happen anytime soon, though Cheskly told Bloomberg News in June that \"We're not ruling out going public this year.\""}]}