{"article": [{"url": "https://www.marketwatch.com/story/michigan-assembled-ford-ranger-named-most-american-made-car-in-annual-list-that-includes-tesla-for-first-time-2020-06-23", "published": 1592899100.0, "headline": "Michigan-assembled Ford Ranger named â\u0080\u0098most American-made carâ\u0080\u0099 in annual list that includes Tesla for first time", "body": "The Michigan-built Ford Motor Co. Ranger pickup, resurrected for the U.S. market in 2019, ranks No. 1 among the most-American-made vehicles, a 15-year-old list for which high-ranking Tesla, which assembles its luxury electric cars in Fremont, Calif., participated for the first time. Behind the Ford F, -1.36% Â , No. 2 is claimed by Fiat Chrysler Automobilesâ\u0080\u0099 FCAU, -0.95% Â Jeep Cherokee, assembled in northern Illinois. Tesla, meanwhile, took three spots among the top 10 on the 2020 American Made Index (AMI), for which Cars.com, the index creator, relies both on company data and its own research. This is the first year Tesla TSLA, +1.89% Â has willingly participated in the AMI, shaking up the results. It likely would have ranked high in other recent years as well. Honda Motor Co. HMC, -1.21% Â and General Motors GM, -0.15% Â also hold top spots on the index this year. The AMI ranks cars based on five factors: assembly location, parts sourcing as determined by the American Automobile Labeling Act that dates to the 1990s, U.S. factory employment relative to vehicle production, engine and transmission sourcing. In total, the 2020 AMI ranked cars from 13 automakers built in 14 states. Top 10 Make and Model Assembly Location 1. Ford Ranger Wayne, Mich. 2. Jeep Cherokee Belvidere, Ill. 3. Tesla Model S Fremont, Calif. 4. Tesla Model 3 Fremont, Calif. 5. Honda Odyssey Lincoln, Ala. 6. Honda Ridgeline Lincoln, Ala. 7. Honda Passport Lincoln, Ala. 8. Chevrolet Corvette Bowling Green, Ky. 9. Tesla Model X Fremont, Calif. 10. Chevrolet Colorado Wentzville, Mo. To view the complete list, visit www.cars.com/ami. â\u0080\u009cOf some 350 cars on the market for 2020, 91 models qualified for our index,â\u0080\u009d said Kelsey Mays, Cars.comâ\u0080\u0099s CARS, -2.80% Â senior consumer affairs and vehicle evaluations editor. â\u0080\u009cThe auto industry is highly globalized, but these 91 models bring jobs to America and investments to our local communities â\u0080\u0094 a growing concern for Americans in the current climate.â\u0080\u009d â\u0080\u009cMany consumers presume that today cars are predominantly not built here,â\u0080\u009d said Mays. â\u0080\u009cThatâ\u0080\u0099s not the case.â\u0080\u009d Read:U.S. entered recession in February after end of longest expansion in history, NBER finds The Tesla Model S OEM Eric Perry Photography Asked if newly rewritten trade agreements, particularly the U.S.-Mexico-Canada (USMCA) agreement, were expected to change the list of the future, Mays said itâ\u0080\u0099s too soon to tell, but added â\u0080\u009cthe super-home-grown car decline has been a pretty nonpartisan thing.â\u0080\u009d The impact of the COVID-19 pandemic on the economy and, in turn, on consumer decisions has impacted car-buying, according to separate research from Cars.com. It found that 70% of shoppers consider a carâ\u0080\u0099s U.S. economic impact a significant or deciding factor in their vehicle purchase; thatâ\u0080\u0099s up from 66% who indicated the same in 2019. The COVID-19 pandemic has further impacted Americansâ\u0080\u0099 desire to â\u0080\u009cbuy local.â\u0080\u009d The survey found that 37% of consumers indicated they are more likely to buy an American-made car due to the current health and economic crisis, while just 4% said they were less likely. “ â\u0080\u0098The auto industry is highly globalized, but these 91 models bring jobs to America and investments to our local communities.â\u0080\u0099 ” â\u0080\u0094 Kelsey Mays of Cars.com Tesla CEO Elon Musk controversially defied coronavirus shutdown orders in May to keep his Fremont, Calif., production line rolling. Musk had criticised stay-at-home measures, calling them â\u0080\u009cfascistâ\u0080\u009d and dared officials to arrest him at one point. His plant was reopened later in the month, with Alameda County approval, after employees were reportedly told the county health department had approved its health and safety plans. Tesla shares are up 137% in the year to date and up more than 350% over the past year. The S&P 500 SPX, +0.87% Â is down 3.5% in the year so far, up 5.8% from one year earlier. Fordâ\u0080\u0099s stock performance reveals a 32% drop in the year to date. GM is off 27% over the same span."}]}