{"article": [{"url": "https://www.marketwatch.com/story/as-months-of-closures-wear-on-new-york-city-yoga-studios-move-onlineor-shut-their-doors-permanently-2020-09-11", "published": 1599825980.0, "headline": "As months of closures wear on, New York City yoga studios move onlineâ\u0080\u0094or shut their doors permanently", "body": "With studios closed since March, streaming yoga classes from the floor of a cramped apartment has become a well-worn quarantine trope over the past six months. And itâ\u0080\u0099s one that may carry on even longer than expected. While New York City gyms have spent the past few weeks reopening their doors â\u0080\u0094 complete with new distancing, mask and sanitization requirements â\u0080\u0094 city officials have restricted group fitness classes indefinitely, leaving yoga studios in a state of limbo.Â Like restaurant and gym owners before them, a group of boutique fitness studio owners is now suing the city over the ongoing closures, saying that theyâ\u0080\u0099ve been kept from â\u0080\u009ctheir liberty and property interests without due process.â\u0080\u009d (The mayorâ\u0080\u0099s office declined to comment on pending litigation.) â\u0080\u009cWe are taking our reopening plans day-by-day. Currently we have limited information about guidelines around operations,â\u0080\u009d said Sarah Larson Levey, founder and CEO of Y7 Studio, which has workout spaces across New York City. â\u0080\u009cWe are confident in our ability to open and operate safely, but it will all depend on guidance from the government.â\u0080\u009dÂ Many studios have pivoted to a brisk online business of streaming classes, but as the pandemic wears on, studios ranging from YogaWorks, a national franchise with multiple locations in the city, to Maha Rose and NamaStuy, independent studios in Greenpoint and Bed-Stuy, respectively, have opted to permanently shutter their physical storefronts.Â â\u0080\u009cWe are in the process of giving up leases,â\u0080\u009d said New York City-based Sky Ting Yoga co-founder Krissy Jones. Current reopening plans limit gyms to one-third of their total capacity, a requirement that would be financially onerous even if indoor classes were permitted, Jones added. â\u0080\u009cIt doesnâ\u0080\u0099t work with our business model to open with 30% capacity, everyone wearing masks, a special HVAC system,â\u0080\u009d she said. â\u0080\u009cIf [landlords] gave us 30% of the rent, then we could operate at 30% of capacity.â\u0080\u009d Yoga studios are often small businesses rather than national chains, and unlike gyms that rely on high-price monthly fees for memberships that often go unused, studios tend to also offer classes for drop-in, per-class rates. All of it combines to create a particularly acute level of financial strain amid pandemic-related closures. â\u0080\u009cIâ\u0080\u0099m starting to hear now that studio owners are feeling forced or choosing to move on from the brick and mortar studio,â\u0080\u009d said Shannon Roche, president and CEO of the Yoga Alliance, a Virginia-based nonprofit organization that provides business resources, safety and ethical standards to 7,000 member yoga schools across the U.S. â\u0080\u009cWhat weâ\u0080\u0099re trying to do right now is to help our teachers and schools transition to different ways of teaching yoga if they want to. A lot of members are going online.â\u0080\u009dÂ A closed yoga studio in Brooklyn. Pete Catapano /MarketWatch While the initial round of Paycheck Protection Program, or PPP, loans was a shot in the arm for struggling studios, more federal aid is needed to prevent further closures, owners say, and in the meantime, many yoga teachers face reduced or eliminated work schedules. In some cases, studios have scrambled to find ways to provide aid themselves. â\u0080\u009cWhen we closed the studios, we immediately cut all leadership salaries to be able to provide an emergency pay package to support employeesâ\u0080\u0099 immediate needs in the short term,â\u0080\u009d Levey said.Â Also see: The COVID recession has decimated some states, but barely touched others The switch to digital classes was a relatively seamless one for yoga studios compared with other fitness facilities, with many studios and instructors already offering online classes, and an exercise format that lends itself relatively well to at-home workouts. Sky Ting, for instance, had already launched a digital platform, Sky Ting TV, in 2019, charging $20 a month for unlimited access to video content and classes, compared with its usual $25 drop-in fee and $190 a month membership cost for in-person classes. â\u0080\u009cOnce quarantine started, we saw such an increase in our subscribers,â\u0080\u009d Jones said. â\u0080\u009cIt totally transformed our business model. Weâ\u0080\u0099re digital first now.â\u0080\u009d The flexibility of digital teaching has also enabled instructors to branch out on their own as they seek out other ways to make ends meet, and many have launched their own online classes and videos on the side. â\u0080\u009cMy anecdotal sense is that at this point, a lot of teachers are still kind of doing what they used to do, which is a little bit of teaching on their own with clients theyâ\u0080\u0099ve known for years, and they have an affiliation with a studio, too,â\u0080\u009d Roche said..â\u0080\u009d For both studios and individual instructors, however, profit margins for online classes are lower than they are for in-person instruction, and the closure of brick-and-mortars has left some instructors and studio support staff out of work entirely. Add to that stiff competition from existing digital yoga empires such as the Yoga With Adriene YouTube channel, which has seen an explosion of popularity during the pandemic, and studios face a financial situation thatâ\u0080\u0099s unsustainable, without a clear end in sight. â\u0080\u009cOur business has come to an almost complete standstill,â\u0080\u009d Levey said. â\u0080\u009cWhile online streaming has been a way for us to continue to engage with our community, it is not making up for the strong in-studio business we were doing.â\u0080\u009dÂ Read next: The COVID-19 pandemic is about to enter its most treacherous phase Without a fresh influx of government aid or a clear reopening plan, more of the cityâ\u0080\u0099s studios are likely to close their doors permanently. â\u0080\u009cWhat weâ\u0080\u0099re seeing with yoga studios is probably reflective of a lot of industries,â\u0080\u009d Roche said. â\u0080\u009cReal estate is just really expensive, and there hasnâ\u0080\u0099t been a ton of government support to mitigate that.â\u0080\u009d â\u0080\u009cYoga studios, by and large, are kind of traditional mom-and-pop, very small businesses, itâ\u0080\u0099s a labor of love,â\u0080\u009d she added. â\u0080\u009cThey donâ\u0080\u0099t have huge margins. If [closures] go on for a sustained period of time, itâ\u0080\u0099s hard to keep that up.â\u0080\u009d"}]}