{"article": [{"url": "https://www.marketwatch.com/story/the-simplest-way-to-cut-your-tax-bill-even-if-your-name-isnt-trump-11601478272", "published": 1601464640.0, "headline": "The simplest way to cut your tax bill â\u0080\u0094 even if your name isnâ\u0080\u0099t Trump", "body": "No wonder he's happy - apparently he's getting a great deal on his taxes Andrew Caballero-Reynolds/Agence France-Presse/Getty Images When it comes to Donald Trump and his taxes, I know what youâ\u0080\u0099re going to say. â\u0080\u009cHey, Guy Who Writes About Money! Stop telling me how outraged Iâ\u0080\u0099m supposed to be about Trumpâ\u0080\u0099s taxes. Tell me something usefulâ\u0080\u0094like how I can get the same kind of deal.â\u0080\u009d Well, hereâ\u0080\u0099s some great news. Iâ\u0080\u0099ve got your back. For years Iâ\u0080\u0099ve been trying to interest publishers in a book called â\u0080\u009cHow To Steal Like Wall Street.â\u0080\u009d No, not another book about how plutocrats work the system on taxes, debts and everything. But a tongue-in-cheek book on how you and me, the ordinary Joe or Jane, might do the same. (Cue that long-forgotten sports classic Gamesmanship.) Oh boy, is there a lot of material. Imagine if we all acted like Wall Street. A case in point is the buzz about Donald Trumpâ\u0080\u0099s taxes.Â According to the New York Times,Â the president paid no taxesâ\u0080\u0094federal income taxes, that is â\u0080\u0094 in at least 10 years this millennium, and paid just $750 in 2016, the year he was elected president, and 2017. Trump responded by slamming the Times as â\u0080\u009cthe Fake News Media,â\u0080\u009d adding that he had paid â\u0080\u009cmany millions of dollars in taxes but was entitled, like everyone else, to depreciation & tax credits.â\u0080\u009d But letâ\u0080\u0099s get away from the political and talk aboutÂ the personal. As a commenter on the Reddit forum Financial Independence, going under the label IH8Tumbleweeds, put it while talking about his own finances, â\u0080\u009cMy philosophy in life (family, taxes, politics, money) has been â\u0080\u009ctell me what the rules of the game are, and Iâ\u0080\u0099ll figure out how to winâ\u0080\u009d. I see so many people whining how they can never succeed in the current â\u0080\u0098systemâ\u0080\u0099 (thankfully not so much on this thread), when in reality, no one is going to come along and change the rules for you personally so you can succeed. Itâ\u0080\u0099s your job to win given the current system the best we can.â\u0080\u009d So, given the current system, how can you win? The single best tax shelter available to every Joe andÂ JaneÂ in America is the retirement system. Most people already know that if you are a salaried employee you can contribute $19,500 a year to your 401(k) or the equivalent at work, all tax-deferred. Not everyone knows that they can add another $6,500 a year once theyâ\u0080\u0099ve turned 50. On top of that they can save another $6,000 a year in an IRA, and that also rises to $7,000, once you turn 50. And if you have a nonworking spouse you can contribute the same again for them. If you already have access to a 401(k) at work, these contributions may not be deductible from your taxable income, if youâ\u0080\u0099re above certain income limits. Read: A spousal IRA may be the best gift you can give to your nonworking spouse But even if youâ\u0080\u0099re not, you can make a nondeductible contribution and immediately convert it to a Roth, which means you wonâ\u0080\u0099t pay any future taxes on your gains. (There are some convoluted rules which mean you may pay some upfront taxes on this Roth conversion.) Not taking full advantage of these means youâ\u0080\u0099re paying too much tax. Itâ\u0080\u0099s that simple.Â But these deals pale compared to what you can get if, like Trump, you run your own business, or more usefully for most of us, youâ\u0080\u0099re self-employed. Anyone who really wants to â\u0080\u009cwinâ\u0080\u009d at the American tax system needs to get out of payroll serfdom.Â During the years I worked as a freelance writer my gross income fell, but I ended up ahead because my taxes absolutely collapsed.Â Yes, there are (legal) business deductions available to the self-employed. (Incidentally, as a general principle, Iâ\u0080\u0099m not sure why a TV star shouldnâ\u0080\u0099t be able to deduct the costs of his hair stylist, but thatâ\u0080\u0099s a matter for the accountants and the IRS.)Â But the real kickers,Â onceÂ again, are the retirement plans: The Self-Employed or SEP IRA, and the Solo 401(k). Every time I get in an Uber UBER, -0.18% or a Lyft LYFT, +2.16% I ask the driver if they have one. So far not one to whom Iâ\u0080\u0099ve spoken has even heard of these accounts. So theyâ\u0080\u0099re effectively just volunteering to pay too much taxâ\u0080\u0094without realizing it, of course. Naturally, not everyone can afford to take full advantage of these plans. But if they can, they are just leaving money on the table. The SEP-IRA lets you save 25% of your self-employed income tax-deferred, up to a maximum of $57,000. A Solo 401(k) lets you save more because you are basically able to contribute as the employer and the employee, and the IRS says the $57,000 maximum doesnâ\u0080\u0099t include catch-up limits for those age 50 or over. Tax-sheltered retirement plans donâ\u0080\u0099t save you from all taxes. If you save the money tax-deferred, you will have to pay taxes on the money you withdraw when you retire. But how much that comes to is going to depend on your own circumstances. Chances are good youâ\u0080\u0099ll be in a lower tax bracket when youâ\u0080\u0099re old than when youâ\u0080\u0099re working. According to the Federal Reserve, the median income of a working family is about $70,000. That of a retired household: Just $36,000, or barely half that. Most importantly of all is that these accounts essentially offer â\u0080\u0098poverty insurance.â\u0080\u0099 Thatâ\u0080\u0099s because income taxes (of course) are progressive. So, yes, if you have plenty of money in retirement and a good income you could end up paying significant income taxes on your IRA and 401(k) withdrawals. On the other hand, if youâ\u0080\u0099re broke in retirement and desperate for every nickel, you wonâ\u0080\u0099t pay much income tax on your withdrawalsâ\u0080\u0094or any at all."}]}