{"article": [{"url": "https://www.marketwatch.com/story/live-positive-age-positive-the-secret-to-wealth-and-health-as-you-grow-older-2020-07-31", "published": 1597498340.0, "headline": "Live positive, age positive: The secret to wealth and health as you grow older", "body": "This article is reprinted by permission from NextAvenue.org. Back in the 1990s, when I worked at Money magazine, David Lereah was a go-to source for our real estate stories. His job then: chief economist at the Mortgage Bankers Association (he later held that job at the National Association of Realtors). I lost track of Lereah until his new, and wholly surprising, book recently arrived: “The Power of Positive Aging.” And boy does he have a story to tell. At age 62, a few years ago, Lereah was diagnosed with stage 3 esophageal cancer. “The doctor looked at me and he didn’t say ‘You’re going to be fine, we will beat this,’” Lereah told me. “He said, ‘This is going to be most difficult challenge of your life and I don’t have any guarantees.’ He scared the s*** out of me. As he left the room, the nurse looked at me and said: ‘David, if you beat this cancer, it was only an inconvenience in your life.’ And that really rang a bell for me.” The nurse’s words also changed pretty much everything about the way Lereah, who lives in Port St. Lucie, Fla., now looks at life and the way he deals with aging. And it’s why he felt compelled to write the “Positive Aging” book — to help others see the light — and to start the United We Age nonprofit group. Here are highlights from my conversation with Lereah: Next Avenue: How are you feeling? What is your life like these days? David Lereah: I’m feeling very good, actually. I still have some physical limits. I sleep on a 45-degree angle because they had to cut half of my stomach out and half of my esophagus is gone. I have some endurance issues as well. So, there are some real physical limitations. But, as the theme of the book stresses, I’ve got such a positive outlook that these things don’t annoy me. I am now a walker and walk 10,000 to 12,000 steps a day; that’s over 5 miles. On a good day, I walk 15,000 steps. It’s not a big deal that I no longer play golf or tennis because I can’t bend down to pick up the balls. I just no longer have expectations to play them.‘We don’t know how to grow old’ You write in the book that we don’t know how to grow old. Why do you say that? I break down aging into three aging ‘rooms:’ the Positive Aging Room, the Practical Aging Room and God’s Waiting Room. Most of us are in the Practical Aging Room and that’s a good one. It means you will try to age gracefully. Maybe you have a bucket list of things do to find meaning in life. But you will have some bouts of anxiety over thinking about mortality. You will have depression on occasion when something significant happens to you, either a serious physical decline or mental decline. It’s going to jolt us and most of us are not prepared to handle a serious situation. We need to then have more wherewithal to cope with that serious challenge. With a positive mindset, you become more spiritual. People who are Practically Aging are the lucky ones. They don’t experience serious marks of aging. They won the lottery. And people in God’s Waiting Room? In my travels, I’ve seen God’s Waiting Room. These are people who simply sit and wait for their name to be called to leave this life. They’re bitter and show little energy or interest in the world around them. They’re usually indifferent about their lives. When you go to a senior residential facility or a long-term care facility, you can spot someone in God’s Waiting Room. Is positive aging the same as successful aging? I don’t have a Ph.D. in gerontology; I have one in economics. So, I’m learning the aging literature. And I what I found was missing in what I read about successful aging was spiritual health. If you’re particularly positive about aging, it takes you to successful aging.Science and positive aging What does science tell us about positive aging? It’s incredibly good for our health. I saw a 2019 study that said positive thinking can result in an 11% to 15% longer lifespan and can increase your likelihood of living to 85 or older. And Elizabeth Blackburn, who won the Nobel Prize [and was a 2017 Next Avenue Influencer in Aging] found that some behaviors of positive aging had the unintended effect of protecting and lengthening your telomeres, which act as an aging clock in every cell. It’s difficult to make a blanket statement that if you practice positive aging you will live longer. But I think we can make a pretty strong statement by inserting the word ‘may.’ There is a likelihood your lifespan will be extended by practicing positive aging, due to healthy telomeres. We have 50,000 to 70,000 unconscious thoughts a day and 80% of them are negative. It takes practice to become positive. And what does positive aging have to do with ageism? The roadblocks to aging in America are ageism, the ‘alone crisis’ and attitudes about being ‘forever young.’ We live in a forever-young society that says you’re swimming upstream against the current as you age. Young people are looked on as healthy and older people as stale and useless. And you tell people ‘it’s time to reclaim your life.’ What do you mean? I have six building blocks for positive aging: Your inner spirit; mindfulness; positivity; the Four As [acceptance, adaptation, appreciation and attitude]; social support and balance. Reclaiming your life has to do with: ‘All right, now that you’ve learned what type of behavior you should be exhibiting and the lifestyles you should be living, let’s look at the activities you can get involved with as a positive-aging mindset.’ One of them is to write a bio legacy, your life story. It gets people to think long and hard about their life and what they did and how meaningful it was. It will give them a boost of energy to do more meaningful things in their senior years.Aging: ‘A blessing and a curse’ You call aging ‘a blessing and a curse’ and your subtitle is ‘successfully coping with the inconveniences of aging.’ What do you mean? Aging is a curse because we’re physically and mentally declining and at limit, we’ll be gone. It’s finality. But it’s a blessing because once you embrace the power of positive aging, you look at growing old as a journey of transition. While you are transitioning, the really neat part there is that aging becomes an inconvenience. You might like: I want year-round outdoor living — dry summers and no snow — on $4,000 a month. Where should I retire? On my journey since being diagnosed with cancer, I’ve realized that every mark of aging we experience as humans are inconveniences. They change the quality of our life, but we’re still living. Those who’ve been through tough, life-threatening diseases know as long as life continues, it’s great. Looking at aging as having inconveniences helps you get through any physical or mental challenge in front of you. You say positive aging saved your life. How? Mindfulness saved my life; living in the present moment. Before my diagnosis, I was on TV every week, I was riding high. I wrote a book, “Are You Missing the Real Estate Boom?” And that came out virtually the same week we announced the real estate bust at the National Association of Realtors. I wrote the book two years before it came out. So, I got creamed by the internet and rightly so. I had ended up buying seven properties, thinking the boom would continue for at least another year. It didn’t. So, I got depressed and had a lot of anxiety. I didn’t know what positive aging was at the time. I started to read Buddhism and learned about how to stay in the present moment. “The Power of Now” by Eckhart Tolle was one of my favorite books. That’s how I survived that crisis, and it’s how I survived cancer. By living in the moment. Balancing, to me, is critical. I’ve seen too many good people who were out of balance; it destroys them. When you’re out of balance, you’re stressed, you have anxiety, sometimes depression. A balanced life means you’re more at peace. Read: Why early retirement IS all it’s cracked up to be If you keep the same expectations as you had as a younger person, you will be way out of balance and very frustrated. You need to revise your expectations and live in a world of possibilities. Whenever I have an ailment, I am always saying: ‘I am more than my physical body.’ It just makes me feel better.The coronavirus and positive aging What does COVID-19 mean for positive aging? From a positive aging standpoint, it’s about: How do you cope with the threat of getting COVID-19? The first thing you need to do is strengthen your ability to fight the virus, and that’s your immune system. Eat the right foods, like squash and carrots and spinach and fruits and broccoli and salmon and dairy and nuts and eggs. Exercise is very big. Take 5,000 steps a day at a minimum; get to 10,000 if you can. Get enough sleep. That’s very difficult for a lot of older people. The real key is to reduce anxiety and depression and calm your fears. If you’ve never meditated before, just do five minutes in the morning and five minutes at night. A lot of us who do meditation have apps for that on our smartphones, like Headspace or Calm. They take you through the meditations to reduce anxiety. If people want to pray, that works as well. If you pray in groups, it’s energizing. You’ve started something called United We Age. What is that? It’s very local right now, but with big ideas. Our initial goal is to provide social support to people around Port St. Lucie who have no social support. In long-term care facilities, about 50% of people have no family or friends. So, we’ve created Friends for Seniors programs. We deliver to those facilities and we get wish lists from people there of what they want. Very simple items. Sometimes they want teddy bears or a big bag of candy or clothing. Also see: Why having a bucket list can be a big mistake We go shopping, and on their birthday, we come and spend time with them, so they feel like they’re alive. On Christmas, we march in and give out presents. We’re sort of playing Santa Claus. It’s a very rewarding experience. We plan to expand to Vero Beach, about 25 miles away, and then continue to expand. People in other states have been asking if they could do something like it. We will try to set up franchises and let them run it.Money, work and positive aging I usually write and edit articles about personal finances and about work and careers. How do those topics play into positive aging? There’s a great connection there. When you have a positive mindset, you relieve a lot of stress from your life so now you have the emotional wherewithal to take on what’s out there in the business world or the financial world. And you’re doing it with appreciation and with the right attitude. So, positive aging is good for your wealth and good for your health? Yes, I like the way you put that. Most definitely. Richard Eisenberg is the Senior Web Editor of the Money & Security and Work & Purpose channels of Next Avenue and Managing Editor for the site. He is the author of “How to Avoid a Mid-Life Financial Crisis” and has been a personal finance editor at Money, Yahoo, Good Housekeeping, and CBS Moneywatch. Follow him on Twitter. This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}