{"article": [{"url": "https://www.marketwatch.com/story/pelosi-wants-to-keep-fiscal-stimulus-government-shutdown-talks-separate-as-lawmakers-eye-september-free-for-all-11599165498", "published": 1599228140.0, "headline": "Shutdown prospects dim, but so do fiscal-stimulus odds as Dems, White House eye separate tracks ahead of September free-for-all", "body": "The U.S. Capitol in Washington. (AFP via Getty Images) An agreement to keep a temporary government-funding bill clean of extraneous provisions will likely ease fears of another government shutdown. But it may come at the cost of a robust coronavirus-aid package that many economists say is needed to tamp down the possibility of a double-dip recession. A source familiar with the plan said House Speaker Nancy Pelosi and Treasury Secretary Steven Mnuchin “agreed it should be clean as they both want to keep government open.” There was no discussion of how long the stopgap resolution should last. The informal pact came after increased speculation ahead of lawmakers’ looming return to Washington that the Sept. 30 deadline, rather than spurring a deal on stimulus, could result in another government shutdown similar to the 34-day one in late 2018 and early 2019. “The agreement reached this week by the Treasury Secretary and our negotiations team to have a continuing resolution to continue to fund the government when the fiscal year runs out at the end of this month means that now we can focus just on another relief bill,” Vice President Mike Pence said Friday on CNBC. But some observers worry that without the stick of the shutdown, the carrot of the political popularity of passing more aid — an idea with broad bipartisan support in general, if not on the specifics — won’t be enough. Supporters of a go-slow approach to additional stimulus gained ammunition Friday when the August jobs report showed unemployment dropping to a lower-than-expected 8.4%. Read more: U.S. regains 1.4 million jobs in August and unemployment drops to 8.4% as economic recovery shows resilience Senate Republicans, who have had trouble coalescing around an alternative plan, were aiming to introduce aid legislation upon their return to Washington next week. It’s unclear if that timeline and the outlines of that package will be affected by Friday’s report. “We’ll see if we get one put together,” said Sen. Deb Fischer, a Nebraska Republican, after presiding over a short ceremonial Senate session. Talks over another coronavirus financial-aid package foundered in July, and attempts to restart them in August failed. Pelosi said Democrats were willing to come down to $2.2 trillion for the plan, while Mark Meadows, the White House chief of staff, said the Trump administration’s offer had come up to $1.1 trillion. Read: Double-dip recession chances significant, ex-CBO chiefs say, citing ‘policymaking malpractice’ Pelosi remains convinced of the urgency of getting a stimulus package, her spokesman said. “She has said she believes they should be separate, as the COVID package is urgent and needs to come ASAP,” Pelosi spokesman Drew Hammill said in an email. But combining the talks with the consequence of a shutdown if they do not succeed may be the best way to get a deal, observers say. “There’s a decent chance they can work something out in the end, but I don’t see how it’s possible,” said Jim Manley, a former spokesman for Harry Reid, the Democratic Senate Majority Leader from 2007 to 2015. “Combined, it would raise the likelihood that both get done,” said a former Republican congressional leadership aide, speaking on condition of anonymity. “I’m getting more and more pessimistic about substantial COVID response legislation,” the former aide said, noting the closer it gets to the Nov. 3 elections the harder it will be for either side to make significant concessions. If the bills are separated though, the former aide said, a path could be cleared easily for a stopgap spending bill by itself that would keep the government open into the potential post-election lame-duck period. “There’s definitely a danger of shutdown,” the ex-aide said. If the president is trailing in the polls, he could insist on provisions in the continuing resolution that Democrats could not accept, forcing their hand. “The president is the real wild card in this,” Manley agreed. As if keeping the government’s lights on and finishing hard-fought negotiations that started in July weren’t enough, Congress faces a Sept. 30 deadline to do two more things: Extend the legislative authority for federal transportation and flood-insurance programs. Absent a reauthorization, the flood-insurance program’s ability to borrow money to cover losses would be reduced from $30 billion to $1 billion, according to the Congressional Research Service. The transportation bill had been seen as the legislative vehicle to do a big infrastructure bill, a prospect that now seems remote. In addition to those extensions, which typically would be rolled into a stopgap spending bill, both the House and Senate face the prospect of votes on bills that, charitably speaking, are not expected to be signed into law soon but are instead meant to boost support for the parties ahead of the November elections. In the House, in the week of Sept. 21, a vote is expected on a bill to largely decriminalize marijuana at the federal level. The Senate will have a procedural vote on a federal judge nomination upon its return Sept. 8 but could turn to other issues afterwards. Before leaving for the summer recess in August, Senate Majority Leader Mitch McConnell advanced three House bills procedurally, including one on statehood for the District of Columbia, potentially easing their way for floor votes in September. Manley said those would be “message bills designed to boost the base.” Even so, they will eat into precious floor time. Between traditional Thursday departures and two religious holidays in the month, the Senate is likely to be in session only 11 days through Sept. 30. While House committees will work next week, the full House is also set to be in session for only 11 days before the end of the month."}]}