{"article": [{"url": "https://www.marketwatch.com/story/amid-summit-stalemate-eu-leader-pleads-for-unity-to-pass-massive-coronavirus-recovery-fund-2020-07-19", "published": 1595203580.0, "headline": "Amid summit stalemate, EU leader pleads for unity to pass massive coronavirus recovery fund", "body": "BRUSSELS — Seeking to tug at the hearts of all European Union leaders, EU Council president Charles Michel implored them late Sunday to overcome their fundamental divisions and agree on an unprecedented 1.85 trillion-euro ($2.1 trillion) EU budget and coronavirus recovery fund to tackle the crisis. After three days of fruitless talks, Michel conjured up during an official dinner the vision of the 600,000 dead that COVID-19 has claimed around the world and the unprecedented recession it has wrought on the bloc. “Are the 27 EU leaders capable of building European unity and trust or, because of a deep rift, will we present ourselves as a weak Europe, undermined by distrust,” he asked the leaders at the end of another day of divisive negotiations. The text of the behind-closed-doors speech was obtained by The Associated Press. “I wish that we succeed in getting a deal and that the European media can headline tomorrow that the EU succeeded in a Mission Impossible,” Michel said. Early on the fourth day of talks — the summit was meant to last only two — the leaders still had not reached a compromise. As dawn broke Monday in Brussels, they were still in the marathon summit after haggling through the night over the size and terms of the recovery fund. Even with German Chancellor Angela Merkel and French President Emmanuel Macron negotiating as the closest of partners, the traditionally powerful Franco-German alliance could not get the bloc’s 27 quarreling nations in line. Often negotiating outdoors on a sundeck in the Europa summit center in Brussels, the blue skies and fresh breeze had no impact on the mood. Undiplomatic terms like “”hate” and “grumpy” have been thrown around between leaders during marathon negotiations that should have drawn everyone closer together to fight a historic recession in the bloc. “Whether there will be a solution, I still can’t say,” Merkel said. The pandemic has sent the EU into a tailspin, killing around 135,000 of its citizens and sending its economy into an estimated contraction of 8.3% this year. The bloc’s executive has proposed a 750 billion-euro coronavirus fund, partly based on common borrowing, to be sent as loans and grants to the countries hit hardest by the pandemic. That comes on top of the seven-year 1 trillion-euro EU budget that leaders have been haggling over for months even before the pandemic hit. All nations agree they need to band together but five richer countries in the north, led by the Netherlands, want strict controls on spending, while struggling southern nations like Spain and Italy say those conditions should be kept to a minimum. At their dinner table Sunday night, the leaders could mull a proposal from the five wealthy northern nations that suggested a coronavirus recovery fund with 350 million euros of grants and the same amount again in loans. The five EU nations nicknamed “the frugals” — the Netherlands, Austria, Finland, Sweden and Denmark — had long opposed any grants at all. Merkel and Macron walked out of heated talks before dawn Sunday with the frugals, bemoaning their lack of commitment to a common cause. “They ran off in a bad mood,” Dutch Prime Minister Mark Rutte said. Rutte has long been known as a European bridge builder, but this weekend his tough negotiating stance is being blamed for holding up a deal. He and his allies are pushing for labor market and pension reforms to be linked to EU handouts and a “brake” enabling EU nations to monitor and, if necessary, halt projects that are being paid for by the recovery fund. “He can’t ask us to do specific reforms,” Italian Prime Minister Giuseppe Conte said. “Once (the aid) is approved, each country will present its proposals.” Another member of the frugals, Austrian Chancellor Sebastian Kurz, said he still believed a deal was possible, but there is a “long way to go,” the Austria Press Agency cited Kurz as saying. Rutte also wants a link to be made between the handout of EU funds and the rule of law — a connection aimed at Poland and Hungary, countries with right-wing populist governments that many in the EU think are sliding away from democratic rule. That drew a harsh response from hardline Hungarian Prime Minister Viktor Orban. “I don’t know what is the personal reason for the Dutch prime minister to hate me or Hungary, but he’s attacking so harshly and making very clear that because Hungary, in his opinion, does not respect the rule of law, (it) must be punished financially,” Orban said. Macron said leaders need to compromise but still respect the underlying principles and goals of the EU. “It is still possible, but these compromises, I say very clearly, will not be made at the cost of European ambition,” he said."}]}