{"article": [{"url": "https://www.marketwatch.com/story/des-moines-pushes-back-as-iowas-trump-aligned-governor-insists-on-classroom-return-2020-09-20", "published": 1600631240.0, "headline": "Des Moines pushes back as Iowa's Trump-aligned governor insists on classroom return", "body": "DES MOINES, Iowa (AP) - Students in Iowa's largest school system are facing the possibility that this most unusual school year could stretch into next summer, and the district could be hit with crippling bills because of a dispute with the governor over the safety of returning to classrooms during the coronavirus pandemic. Des Moines school officials have repeatedly refused to abide by Republican Gov. Kim Reynolds's order requiring the state's 327 school districts to hold at least half their classes in-person rather than online. For Des Moines, it's a question of trying to keep its more than 33,000 students and 5,000 staffers from contracting the disease. But after the school board last week again voted to violate Reynolds's order, the governor called the action \"unacceptable\" and began the process for punishing the district. Reynolds has dismissed Des Moines officials' concerns, noting that nearly all other Iowa districts have reopened their classrooms despite some virus outbreaks and the occasional need to quarantine students, saying, \"Where there's a will, there's a way.\" School districts across the country have struggled with the decision of whether to return to classrooms despite the risk of coronavirus infections or shift to online learning, and the choice is especially stark for Iowa's capital city. Des Moines has had one of the nation's highest rates of people testing positive for COVID-19, and school board members ask how it would be possible to enforce social distancing rules in their crowded classrooms and packed school buses. The school board delayed the start of school by a week as the district sought a court injunction to block the governor's order, arguing that she had overstepped her authority. A judge initially sided with the governor, but the district proceeded with its plan to distribute thousands of laptops to students and launched a completely online course offering on Sept. 8. District officials have said they're deeply troubled to be out of compliance with state standards, but they believe the governor has put them in a no-win situation by ordering students to spend at least half their time in classroom. Reynolds's order does allow waivers allowing online-only instruction, but only for districts where more than 15% of people test positive for the virus, which is triple the 5% positivity rate that the Centers for Disease Control and Prevention and other health experts say would be appropriate for resuming in-person classes. The district notes that 31% of its staff members have health concerns that put them at higher risk from COVID-19 and 10% are older than 60. If forced to resume classes, officials contend that many teachers and bus drivers would quit rather than risk being infected by the virus. The positivity rate in Polk County, where most of Des Moines is located, reached 12% earlier in September but recently dropped to about 7%. \"Except for our state Department of Public Health, every other health expert we talk to doesn't understand why we're even having to have this fight because they recognize it isn't safe for us to reopen our schools,\" said Des Moines Superintendent Tom Ahart. \"It feels like operating in an alternate reality.\" If they find the district is out of compliance, state officials could take a variety of actions, including requiring the district to keep students in classes until the end of June - nearly a month later than usual. A district official said each additional day would cost about $1.5 million, draining the district's reserves within days. District officials have assured students that they will get credit for the online classes they're taking, but parent Jason Hahn told school board members at a recent online meeting that he was worried they could be wrong, since the district lost the first round in its lawsuit. The longer the district continues with only online learning, the deeper the financial risk, he said. \"The end result of continuing to operate without an approved plan will likely be a district that loses accreditation and that is bankrupt,\" Hahn said. \"This scenario would be catastrophic for the community, the district and the students.\" Reynolds is the only Midwest governor to issue a statewide order requiring in-person instruction, with all other states in the region leaving decisions to local school districts. Reynolds, a strong supporter of President Donald Trump, who has demanded on Twitter that \"SCHOOLS MUST OPEN IN THE FALL,\" also has refused to issue a statewide mask requirement and told at least 10 cities that they can't enforce local mandates because they would exceed her actions. Capitol Report (Aug. 12):'Go play football,' Trump says, urging schools to reopen in fall Although the Des Moines lawsuit hasn't been resolved, a judge ruled that the state has power over school districts, even if its rationale is based on flawed coronavirus benchmarks. In a separate lawsuit, another judge sided with the state and against Iowa City schools and a teachers union, saying the governor has broad emergency powers that local school boards don't have. The union, the Iowa State Education Association, opposed the governor's action, but a teacher walkout is unlikely because state law prohibits public employees from striking. The state first issued its requirements to school districts in July, and at a news conference Wednesday, the governor expressed exasperation at what she called Des Moines' \"slow walk to compliance.\" Asked how the state would respond, Education Department Director Ann Lebo wouldn't be specific but said the agency would begin a process to punish the district for not complying. \"We were very hopeful to work with the district to find a solution,\" Lebo said. \"At this point it seems they are well into a plan that is out of compliance and will continue to do so, so we will have to initiate that process on our end.\" The school board will discuss the issue again Monday night and will consider a plan still being developed that would include a part-time return to classrooms. Middle school Spanish teacher Trisha Peckosh, who has children in the district, said it's hard to see how the district and state will resolve the dispute. It's true that students would learn better if they were in classroom, but Des Moines is right to worry about the safety of students and staff, she said. \"Everybody is in such a hard position,\" she said. \"Every time you come up with a solution that could work, there's a roadblock.\""}]}