{"article": [{"url": "https://www.marketwatch.com/story/funnys-never-easy-now-try-it-in-a-pandemic-2020-10-09", "published": 1602253760.0, "headline": "Funnyâ\u0080\u0099s never easy! Now try it in a pandemic!", "body": "Heard any good coronavirus jokes lately? If so, it wasnâ\u0080\u0099t in a New York City comedy club. The clubs have been empty, dark and forlorn since March. The gyms are open. The bowling alleys are open. So are the nail salons, tattoo parlors and blow-out bars. Even the restaurants are open again with inside dining now capped at 25%. So why not the cityâ\u0080\u0099s comedy clubs? Is there something uniquely risky about a two-drink minimum or making fun of how totally messed up the world is and how ewed-scray all of us are? Yes, laughter is contagious and stand-up comics have been known to kill. But doesnâ\u0080\u0099t Gov. Andrew Cuomo realize? Those are just metaphors! â\u0080\u009cI challenge anyone to explain why comedy clubs would be less safe to operate than restaurants or bowling alleys,â\u0080\u009d said state Sen. Michael Gianaris of Queens, whoâ\u0080\u0099s carried the club-ownersâ\u0080\u0099 case to Albany. â\u0080\u009cThere is no good reason to keep them closed when these other establishments are open. All that does is further hurt our economic recovery.â\u0080\u009d Chris Mazzilli owns the Gotham Comedy Club on West 23rd Street, a 25-year fixture on the cityâ\u0080\u0099s comedy scene.Â â\u0080\u009cI respect the job the mayor and the governor have to do,â\u0080\u009d he said. â\u0080\u009cI really do. But somebody should revisit us and see how we are set up to respond. We sell tickets online. So we can do contact tracing. We can social distance the tables. Everybody can wear a mask. We can put up plexiglass. Just give us the guidelines that you think are safe. We will follow them.â\u0080\u009d Unlike at regular bars, Mazzilli noted, all his patrons sit at tables. The ceilings are high and the ventilation system really cranks.Â â\u0080\u009cIf I had to keep the tables 10 feet apart, I could do that,â\u0080\u009d he said. â\u0080\u009cBut itâ\u0080\u0099s hard to plan for the future when we donâ\u0080\u0099t know what the future might be.â\u0080\u009d And what about the comics who work the cityâ\u0080\u0099s dozens of small and large venues? Well, theyâ\u0080\u0099ve all had time to work on their writing and discover the joys and frustrations of trying to be funny on Zoom ZM, +2.89% Â â\u0080\u009cArtists have to be resilient,â\u0080\u009d said Jim Mendrinos, whoâ\u0080\u0099s been a familiar face in New York comedy for three decades and is the author of â\u0080\u009cThe Complete Idiotâ\u0080\u0099s Guide to Comedy Writing.â\u0080\u009d Â â\u0080\u009cBut this is definitely testing everyoneâ\u0080\u0099s resilience.â\u0080\u009d He and his friends are trying everything, Mendrinos said. â\u0080\u009cI have done rooftop shows. I have done backyard shows. I have done park shows. I have done drive-in shows â\u0080\u0094 in New York City with the people sitting in their cars. Who knew that was even possible?â\u0080\u009d But the club owners canâ\u0080\u0099t afford to risk their state liquor licenses, he said, until they get a green light from Albany. You might like: Hereâ\u0080\u0099s everything coming to Netflix in October 2020 â\u0080\u0094 and whatâ\u0080\u0099s leaving And, no, comedy over Zoom isnâ\u0080\u0099t quite the same. â\u0080\u009cThis is a reactive art form,â\u0080\u009d Mendrinos said. â\u0080\u009cThe comic feeds on the energy of the audience. The audience feeds on the energy of the comic. Itâ\u0080\u0099s a symbiotic relationship.â\u0080\u009d Even the magic of two-way audio streaming doesnâ\u0080\u0099t equal hearing laughter in the room. â\u0080\u009cWe depend on split-second timing. I am watching a lot of experienced comics struggle with the time lag on line.â\u0080\u009d Those with a storytelling bent have it easier than comics who employ a fast-paced, set-up-punchline, set-up-punchline style. â\u0080\u009cBut thereâ\u0080\u0099s a learning curve no matter what the style is,â\u0080\u009d Mendrinos said. Maureen Langan, who pitches her topical style as â\u0080\u009calways fun, always smart,â\u0080\u009d agrees that times have been trying for everyone in comedy. Or as she puts it: â\u0080\u009cWines sales are up, and itâ\u0080\u0099s not just me.â\u0080\u009d But she too has used the club lull to build up other parts of her career.Â Maureen Langan has been taking more corporate hosting gigs and expanding her audio and video podcast, â\u0080\u009cHanging with Langan.â\u0080\u009d Courtesy Maureen Langan â\u0080\u009cI donâ\u0080\u0099t love the Zoom shows and the virtual tip jars,â\u0080\u009d said Langan, who grew up in Lake Hiawatha, New Jersey, where there is no lake, before moving to the city. â\u0080\u009cFor me, the allure of stand-up is being live and connecting with people and all the effervescence. So Iâ\u0080\u0099ve been calling on my skills as a broadcast journalist.â\u0080\u009d Also read: In the NYC subways: No fines, no arrests. Instead, â\u0080\u0098mask liaisonsâ\u0080\u0099 in blue Having spent years as a TV anchor and radio talk host in New York and San Francisco, Langan has been taking more corporate hosting gigs and expanding her audio and video podcast, â\u0080\u009cHanging with Langan.â\u0080\u009d â\u0080\u009cNowâ\u0080\u0099s the time to do this,â\u0080\u009d she said. â\u0080\u009cSo I keep asking, â\u0080\u0098How do I get on this platform? What website goes where?â\u0080\u0099â\u0080\u009d Sheâ\u0080\u0099s already moving her audience to Facebook Live FB, +0.26% Â , her own website, Spotify SPOT, +0.08% Â and various Apple AAPL, +1.74% Â platforms. Sheâ\u0080\u0099s also building a subscription model through Patreon, where fans are offered virtual happy hours, inside comedy dirt, behind-the-scenes access and â\u0080\u009cDonâ\u0080\u0099t Make Me Hate Youâ\u0080\u009d T-shirts. â\u0080\u009cBut my heart really hurts for my comedy friends,â\u0080\u009d she said. â\u0080\u009cTheyâ\u0080\u0099re the best group of people â\u0080\u0094 educated, really hard working. And they are struggling now. I worry about them. No one has any idea how long this is going to last.â\u0080\u009d Ellis Henican is an author based in New York and a former newspaper columnist."}]}