{"article": [{"url": "https://www.marketwatch.com/story/we-have-each-other-saddled-with-remote-learning-college-students-create-off-campus-dorm-experiences-of-their-own-11596094192", "published": 1596137180.0, "headline": "â\u0080\u0098We have each otherâ\u0080\u0099: Saddled with remote learning, college students create off-campus dorm experiences of their own", "body": "Students move out of their dorm at the University of Michigan in March. As fall approaches, some students are living off campus this fall, even if they're taking their classes remotely. (Photo by Gregory Shamus/Getty Images) Gregory Shamus/Getty Images Like thousands of students across the country, Harlow Brooks has resigned herself to the fact that her first year of college will be different from what she expected.Â The 19-year-old, who is beginning her film degree at the University of Southern California this fall, will be taking all of her classes online this first semester. Instead of meeting her fellow classmates walking from session to session at orientation, Brooks was introduced to them over Zoom.Â But sheâ\u0080\u0099s not giving up on one aspect of the college experience â\u0080\u0094 living among her peers. Though USC is encouraging undergraduates to reconsider living on or close to campus this fall, Brooks and her friends have created a dorm-like existence on their own. Brooksâ\u0080\u0099 pod of eight formed after individual members met each other in big Zoom sessions that got smaller and smaller and eventually turned into a group chat.Â They started sending each other Zillow Z, -0.74% listings for places to live together kind of as a joke and then realized they could make the jokes a reality. It took some effort, including a PowerPoint presentation and masked visits to potential housing options to convince their parents. But now, Brooks and three other women are renting an off-campus apartment in the same building as the other, four, male members of the group.Â Harlow Brooks is planning to live with friends in off-campus housing this fall. â\u0080\u009cIf we are going to be isolated from the world, it might as well be really fun and we have each other,â\u0080\u009d Brooks said. The arrangement also allows them to avoid some of the less-pleasant rituals of dorm life, like schlepping towels and shower shoes to shared stalls.Â Â â\u0080\u009cEven though itâ\u0080\u0099s going to be so different than the traditional dorm experience I actually think itâ\u0080\u0099s going to be a lot better in a lot of ways,â\u0080\u009d Brooks said. â\u0080\u009cNobody is going to be moving somewhere where they donâ\u0080\u0099t know anybody.â\u0080\u009dTrend could mitigate any fallout for the student housing industry A confluence of factors mean that Brooksâ\u0080\u0099 decision may be a popular one, at least among some students, this fall even as many colleges are deciding to hold classes totally or largely online. That could be a boon â\u0080\u0094 or at least mitigate any fallout â\u0080\u0094 for the student housing industry, while higher education and other sectors are squeezed during the pandemic.Â Â There are a variety of reasons why students still may show up to college towns to learn virtually. For one, students, who finished up high school or their spring college semester from their childhood bedrooms, are eager for their independence â\u0080\u0094 and in many cases, their parents are eager to give it to them. In addition, living in their college towns allows students to capture some semblance of college life and attend classes or events easily if they suddenly resume in-person.Â But perhaps most practically, many returning students signed leases for off-campus housing months ago â\u0080\u0094 industry experts say landlords that specialize in student housing are typically signing up tenants beginning in October of the previous year â\u0080\u0094 and are loath to let that money go, even if they wonâ\u0080\u0099t be attending classes in person.Â â\u0080\u009cMost of those leases are signed,â\u0080\u009d said Barbara Denham, senior economist at Moodyâ\u0080\u0099s Analyticsâ\u0080\u0099 REIS. â\u0080\u009cItâ\u0080\u0099s an odd property type in that leases are signed a year in advance.â\u0080\u009dÂ Pre-leasing activity is down some from this time last year In June, apartment buildings that cater to students but arenâ\u0080\u0099t owned by universities, reported occupancy levels of 74.9% for fall 2020, according to data from RealPage, a property management software company. Thatâ\u0080\u0099s down slightly from this time last year when so-called pre-lease occupancy was at 79%, Real Page found.Â â\u0080\u009cOff-campus housing is extremely well-positioned as a desirable consumer product in a pandemic environment,â\u0080\u009d said Bill Bayless, the chief executive officer of American Campus Communities ACC, -0.72%, a major developer, owner and manager of student housing communities.Â Baylessâ\u0080\u0099 firm is betting that students and parents will prefer housing thatâ\u0080\u0099s more like a typical apartment than a dorm â\u0080\u0094 thereâ\u0080\u0099s rarely a communal bathroom or kitchen in off-campus student housing, though students do frequently share bedrooms.Â Still, students who live off-campus, wonâ\u0080\u0099t be under the auspices of their colleges and whatever protocols theyâ\u0080\u0099ve put in place in their residence halls. ACC is partnering with RB RB, +0.48%, the makers of Lysol, to develop a program â\u0080\u0094 called, â\u0080\u009cBe safe. Be smart. Do your part. with Lysol Protection,â\u0080\u009d â\u0080\u0094 that will include reminding residents of ways to help stop the spread of the virus, educating them on which products to use, and providing staff with protocol and products to ensure communal spaces are properly cleaned.Â One of the companyâ\u0080\u0099s buildings had a COVID outbreak in early summer where 41 residents contracted the virus, Bayless disclosed on a July earnings call. The residents quarantined and as of June 29, there were no cases reported in that property, he said.Â So far, 90.1% of ACCâ\u0080\u0099s beds are leased for the coming academic year. Thatâ\u0080\u0099s compared to a pre-lease rate of 93.5% at this time last year, the company announced in July as part of its second quarter earnings report. At properties serving campuses that have announced theyâ\u0080\u0099ll be fully virtual, ACCâ\u0080\u0099s prelease activity is at 90%, according to the July earnings call, with no-shows and requests to break leases representing a potentially 5% decrease in occupancy.Â That some students still want to be near their universities regardless of how their classes are delivered is â\u0080\u009cencouragingâ\u0080\u009d for the off-campus housing industry, said Jennifer Cassidy, executive vice president and chief operating officer at Campus Advantage, a property management company that specializes in student housing.Â â\u0080\u009cEven if there are colleges that in the long-term do move to more virtual, students want to be around their peers and they want to be in-market,â\u0080\u009d she said. Â When the pandemic first began, it wasnâ\u0080\u0099t quite clear how students and families would approach the idea of living near campus. In March, Campus Advantage was â\u0080\u009cinundated with requests to break lease contracts,â\u0080\u009d Cassidy said. The company didnâ\u0080\u0099t break lease contracts, but worked with tenants to provide deferred payment arrangements.Â For students who donâ\u0080\u0099t want to return to their properties this fall, the company will provide them with available subleasing options, Cassidy said.Â During the pandemic period so far, ACC provided $8.6 million in rent relief to residents of its off-campus buildings facing financial difficulty. There may be less of a need to provide relief this academic year because studentsâ\u0080\u0099 financial aid packages â\u0080\u0094 which include any loan or grant money they might use for off-campus housing â\u0080\u0094 will more closely match their familyâ\u0080\u0099s current financial circumstances, Bayless said.Â In April and May, shortly after colleges sent students home and before they started announcing their plans for the fall en masse, off-campus housing operators saw less interest than typical in signing leases for the upcoming year, according to Real Page. But leasing activity started to pick back up in June. At ACC, the company is predicting that the number of residents who either donâ\u0080\u0099t show up or request to be let out of their leases will be higher than last year, according to the July earnings call.Â Still, Bayless said heâ\u0080\u0099s â\u0080\u009ccautiously optimisticâ\u0080\u009d the company could experience a â\u0080\u009clate surgeâ\u0080\u009d in the leasing season as fall nears. In many cases, universities that are opening their residence halls are doing so at reduced capacity, pushing students who might have lived in dorms to look elsewhere.Â Carl Whitaker, market analytics senior manager, at RealPage, wrote in an email that those trends couldÂ â\u0080\u009cresult in some spillover demand,â\u0080\u009d for the off-campus housing industry as a whole.Â Never considered living off-campus before the pandemic Before the pandemic hit, Lelia Saffold had never considered that she would live off-campus this year. Typically, her school, Meredith College in Raleigh, N.C., requires freshmen and sophomores to live on campus. But in late June, school officials announced that in light of the pandemic, theyâ\u0080\u0099d be relaxing that requirement. Saffold and her potential roommates hustled to find housing.Â â\u0080\u009cIt was a little stressful,â\u0080\u009d Saffold said of the experience in early July. â\u0080\u009cThereâ\u0080\u0099s a whole rush of students who are trying to find apartments and leases were filling up really quickly. Within a day or two we had to find this complex and apply and sign for a lease.â\u0080\u009d Harlow Brooks is planning to live with friends in off-campus housing this fall. Saffold and her roommate were able to find an apartment theyâ\u0080\u0099re happy with. In addition, theyâ\u0080\u0099re in agreement about the pandemic-related rules theyâ\u0080\u0099ll be observing in the apartment: Theyâ\u0080\u0099re limiting themselves essentially to one guest each for the entirety of the semester and those guests will have to wear masks inside the apartment.Â Though the experience wonâ\u0080\u0099t be much like traditional college living, Saffold knew that after months at home with her mom and stepdad she wanted to be back near campus for school. For one, as a dance major, she will be attending the occasional class in-person. In addition, having her own space and some independence will help her be in the right mindset for school, even if most of her courses are online.Â Still, before Meredithâ\u0080\u0099s announcement, Saffold was worried about the prospect of living in a dorm this year. â\u0080\u009cAs much fun as it is and as much of a community as it is, itâ\u0080\u0099s like a petri dish for germs,â\u0080\u009d Saffold said of dorms. â\u0080\u009cAs soon as one person on the hall gets sick, everybody gets sick.â\u0080\u009dFewer students in dorms could exacerbate collegesâ\u0080\u0099 financial challenges Having fewer students in dorms this fall is likely to exacerbate collegesâ\u0080\u0099 financial challenges. Small, private schools, whose business modelsâ\u0080\u0099 were showing signs of cracking even before the pandemic, rely on housing as a key source of revenue, said Kevin McClure, an associate professor of higher education at University of North Carolina Wilmington.Â For these schools, â\u0080\u009cthe idea of not having students on campus for another semester paying for housing feels catastrophic,â\u0080\u009d he said.Â Even at larger universities where housing facilities are essentially self-sustaining entities with their own balance sheets, in a scenario where the buildings are generating less revenue than expected, universities may have to kick in to cover costs, he said.Â Perhaps more broadly, housing availability may influence whether students enroll and tuition is a major source of funds for most schools. â\u0080\u009cHousing is a key ingredient in basically a residential campus experience happening at all,â\u0080\u009d McClure said.Â Some schools have argued that extends to off-campus housing as well. At Cornell University, officials decided to bring students back to campus for the fall, in part because they believed students would come to Ithaca, New York, where Cornell is based, and life off-campus, even if courses were completely virtual.Â â\u0080\u009cIn that scenario, Cornell would have had no authority to mandate testing or restrict studentsâ\u0080\u0099 behavior,â\u0080\u009d the university said in a release.Â â\u0080\u009cIt demonstrates an acknowledgement that at these bigger universities that have surrounding towns that are housing college students, colleges can say for all intents and purposes that is a private community where we donâ\u0080\u0099t have jurisdiction,â\u0080\u009d McClure said of Cornellâ\u0080\u0099s and other, similar decisions.Â Watching campus culture closely Parthi Dasondi, 20, will be watching the bar and frat culture closely at Rutgers University this fall when she moves to New Brunswick, New Jersey, where one of the schoolâ\u0080\u0099s campuses is located, for her senior year. The school announced in July that it would be offering basically all of its coursework online and severely limiting capacity in on-campus housing.Â Still, like in any town, local bars remain open with outdoor-only seating and if students resume their pre-COVID patterns of frequenting those watering holes and large gatherings at fraternity houses and other locations â\u0080\u009cincessantlyâ\u0080\u009d then it could change her plans, Dasondi said. But sheâ\u0080\u0099s optimistic that students can return to New Brunswick and stay safe.Â â\u0080\u009cIf there were to be a really bad outbreak at Rutgers-New Brunswick thatâ\u0080\u0099s when I would consider going back home,â\u0080\u009d she said. â\u0080\u009cI hope that it doesnâ\u0080\u0099t come to me moving back home.â\u0080\u009dÂ Â Parthi Dasondi rushed to find off-campus housing for this fall after her school announced it would be offering very limited housing on campus. Dasondi, a biological sciences major and cognitive science and creative writing double minor, spent the last two years commuting from her parentsâ\u0080\u0099 house in Edison, N.J., and was looking forward to a senior year in New Brunswick. Sheâ\u0080\u0099d signed up to live on campus with roommates, but once the school made their decision on the fall semester, she found herself scrambling to find off-campus housing.Â Now it looks likely sheâ\u0080\u0099ll live in an off-campus house with four roommates. Theyâ\u0080\u0099re currently negotiating the rent. Under typical circumstances, thereâ\u0080\u0099d be little room to negotiate â\u0080\u0094 the house is in a prime location near a good stop on the collegeâ\u0080\u0099s shuttle route. But given that classes are remote, â\u0080\u009cwe donâ\u0080\u0099t need to use those anymore,â\u0080\u009d Dasondi said. The women are hoping theyâ\u0080\u0099ll have some leverage since itâ\u0080\u0099s likely not as many students will come to New Brunswick this fall.Â Dasondi said sheâ\u0080\u0099s committed to spending this year near her college. â\u0080\u009cWhen youâ\u0080\u0099re at an age where youâ\u0080\u0099re growing up and looking for more independence, [living at home] is not something thatâ\u0080\u0099s going to help you grow,â\u0080\u009d she said.Â Dasondi and her roommates plan to get tested for COVID-19 and quarantine before they move in and they also plan to discuss the precautions theyâ\u0080\u0099ll be taking to protect themselves and their community from the virus â\u0080\u0094 plans that theyâ\u0080\u0099ll continue to discuss and evaluate once they live together.Â Â Â â\u0080\u009cI want to be able to say I was safe during the pandemic and I still got to have my senior year,â\u0080\u009d she said."}]}