{"article": [{"url": "https://www.marketwatch.com/story/texas-surpasses-10-000-new-coronavirus-cases-in-single-day-for-first-time-11594157620", "published": 1594143680.0, "headline": "Texas surpasses 10,000 new coronavirus cases in single day for first time", "body": "AUSTIN, Texas (AP) — Texas surpassed 10,000 new coronavirus cases in a single day Tuesday for the first time, crossing a sobering milestone rarely seen since the pandemic first hit the U.S. in March. The record high of 10,028 new cases in Texas served as another alarming new measure of the swift resurgence of COVID-19 nationwide and the failures of the country’s response. Republican Gov. Greg Abbott of Texas aggressively began one of America’s fastest reopenings in May, but reversed course last week, ordering bars closed and mandating face coverings in much of the state. New York and Florida are the only other states to record more than 10,000 new cases in a single day. New York hit that grim total back in April, when New York City hospitals were overwhelmed and hundreds of people were dying every day. Florida topped 10,000 confirmed cases last week. Texas surged past 8,000 statewide hospitalizations for the first time over the Fourth of July weekend — a more than quadruple increase in the past month. Mayors in some of the state’s biggest cities — including Austin, San Antonio and Houston, which also are among the biggest in the U.S. — have warned that hospitals could soon become overwhelmed with coronavirus patients. Deaths remain lower in Texas compared to other big states. As of Tuesday, Texas has confirmed that at least 2,715 people have died due to COVID-19. But fatalities have climbed in recent days, and in addition to an alarming acceleration in new cases in Texas, the seven-day infection rate has climbed to 13.5%. The number of infections is thought to be far higher because many people have not been tested, and studies suggest people can be infected with the virus without feeling sick."}]}