{"article": [{"url": "https://www.marketwatch.com/story/you-have-a-degree-but-who-do-you-know-why-student-debt-is-a-racial-justice-issue-2020-06-15", "published": 1592561000.0, "headline": "â\u0080\u0098You have a degree, but who do you know?â\u0080\u0099 Why student debt is a racial-justice issue", "body": "As a young adult, Kevin Gordon listened to all the messages his parents, community and American society at large were sending him. â\u0080\u009cWhen I was growing up, a lot of my peers, growing up as black people, [and I] were told to go to college because itâ\u0080\u0099s the only way that we can get good paying jobs, let alone a good job period,â\u0080\u009d Gordon said. So Gordon went, attending a state school, Northern Illinois University, an affordable choice compared to other options. After graduating, Gordon decided to follow in his parentsâ\u0080\u0099 and brotherâ\u0080\u0099s footsteps, staying on for a masterâ\u0080\u0099s degree in sports management. â\u0080\u009cI did want to put myself in a better position to get a job, and to get a higher paying job in the pay scale by having a higher level of education.â\u0080\u009d “ Centuries of policies have hindered black families from building wealth, and deprived institutions that educate black students of resources and discrimination in the labor market. ” But two years after graduating with his masterâ\u0080\u0099s degree, Gordon is still searching for a stable job that uses his degrees, like working as an athletic director in a high school or as the head of athletics for a parks department. He also has more than $75,000 in student debt, a sum he recently reckoned with as he scoured his credit report to prepare to buy a car (a purchase he ultimately didnâ\u0080\u0099t go through with). The U.S. higher-education finance system is just one of the many products of the systemic racism embedded in our society that have been the focus of protests over the past few weeks experts say. A combination of centuries of policies that have hindered black families from building wealth, decades of decisions that have deprived institutions that educate black students of resources and discrimination in the labor market have meant that black borrowers struggle more with student debt than their white counterparts. In his job search, Gordon can feel evidence of such well-documented discrimination black candidates face in the labor market. â\u0080\u009cYou told me to get these degrees to be eligible, but now Iâ\u0080\u0099m not eligible because I donâ\u0080\u0099t have the experience,â\u0080\u009d he said. â\u0080\u009cNow we can talk real â\u0080\u0094 itâ\u0080\u0099s about, â\u0080\u0098Now you have a degree, but who do you know?â\u0080\u0099 Itâ\u0080\u0099s just a part of this system, itâ\u0080\u0099s how itâ\u0080\u0099s all set up.â\u0080\u009d So instead of a full-time job, Gordon cobbles together work as a high-school and college basketball official, substitute teacher and also does some investing in the stock and foreign exchange markets. The challenge of affording college on his familyâ\u0080\u0099s middle-class income combined with the challenge of finding a job has made Gordon feel as if he doesnâ\u0080\u0099t â\u0080\u009chave that ability to be financially free.â\u0080\u009d â\u0080\u009cEven if I made $50,000 a year, I eventually would be able to pay off my debt, and wouldnâ\u0080\u0099t have a problem with paying off my debt if that was the case.â\u0080\u009d Kevin Gordon graduated with his masterâ\u0080\u0099s degree in 2018. Courtesy of Kevin Gordon The systemic racism embedded in college-finance system Black families are more likely to borrow to pay for college and when they do, they borrow more on average than white families. After college, black borrowers face more challenges repaying their loans. According to data from students who entered college during the 2003-2004 academic year analyzed by Judith Scott-Clayton, a professor of economics and education at Columbia Universityâ\u0080\u0099s Teachers College, 21% of black students who graduated with a bachelorâ\u0080\u0099s degree defaulted on their student loans 12 years after entering college. Just 18% of white borrowers who dropped out of college defaulted during the same period. Defaulting on a student loan has devastating consequences â\u0080\u0094 it ruins a borrowerâ\u0080\u0099s credit, puts their tax refund, Social Security check and even wages at risk of being garnished and prohibits them from taking on more federal student debt to attend college, which could improve their earnings prospects. “ 21% of black students who graduated with a BA defaulted on their student loans 12 years after entering college. Just 18% of white borrowers who dropped out of college defaulted. ” But even looking at those who arenâ\u0080\u0099t in that most dire of circumstances thereâ\u0080\u0099s still a large gap in outcomes between black and white borrowers. Twelve years after starting college, white men have paid off 44% of their student loan balances on average, while black men saw their balances grow by 11%, according to an analysis from Demos, a left-leaning think tank. White women paid down 28% of their balances during the same period, while black women saw their debt loads grow 13%. Taken together, this data indicates that student debt, a tool thatâ\u0080\u0099s supposed to help borrowers move up the economic ladder through education, is actually widening the racial wealth gap. Historically, student debt has been thought of as an individual problem requiring an individual solution. But as balances and the overall debt has grown thereâ\u0080\u0099s been recognition from both sides of the aisle that the issue is about more than where students decide to go to college or whether they have a job while in school. Nowhere is the systemic challenges to the student-loan system more clear than the disproportionate impact it has on black borrowers. â\u0080\u009cThis crisis is not the result of choices that black people made,â\u0080\u009d said Victoria Jackson, a senior policy analyst for higher education at the Education Trust, a nonprofit focused on equity in education. â\u0080\u009cIt is the result of choices that policy makers made,â\u0080\u009d she said. “ â\u0080\u0098This crisis is not the result of choices that black people made, it is the result of choices that policy makers made.â\u0080\u0099 ” â\u0080\u0094 Victoria Jackson, senior policy analyst for higher education at the Education Trust Some of those choices are particular to higher education. For example, historically black colleges and universities havenâ\u0080\u0099t had access to the same financial resources available to predominantly white institutions, making it more difficult for them to provide grants, despite educating large swaths of students with financial need. In addition, over the past several years many states and schools have shifted towards awarding more scholarship aid based on merit instead of need. Since the criteria used to define merit â\u0080\u0094 such as standardized test scores â\u0080\u0094 privilege white, wealthier students, black students have suffered from change. Those same dynamics â\u0080\u0094 combined with inequality already present in the kindergarten through 12th grade school system â\u0080\u0094 mean that black students are less likely to get access to the type of wealthy institutions that can afford to provide generous financial aid. For-profit colleges have been accused of targeting black students At the same time that black students have limited access to elite and wealthy institutions theyâ\u0080\u0099re also more likely to be targeted by predatory for-profit colleges. This trend has been well-documented in books like â\u0080\u009cLower Ed: The Troubling Rise of For-Profit Colleges in the New Economy,â\u0080\u009d by Tressie McMillan Cottom, a sociologist and professor at University of North Carolinaâ\u0080\u0099s School of Information. More recently, a group of students sued Florida Career College (FCC) in April, alleging the school used deceptive practices to lure students into taking on debt for degrees that had little value in the labor market. The school targeted the black community specifically in these efforts, the suit alleges, by advertising on billboards in majority black communities, sending representatives for outreach at majority black high schools and advertising on social media platforms that allow companies to direct advertising according to interests like â\u0080\u009cAfrican Americansâ\u0080\u009d and/or â\u0080\u009cAfrican American Culture.â\u0080\u009d “ Just as college campuses have become more diverse, state and federal governments have pulled back on funding them. ” The majority of students enrolled at FCC campuses (except one) were black in fall 2018, according to court documents, even though the schools are located in majority white or Latino communities. Earnings for students who attended two of the schoolâ\u0080\u0099s campuses between 2014 and 2016 ranged from $12,800 and $24,500, the suit alleges. Among students who left the school in 2013 or 2014, 77% were unable to repay even one dollar of their student loan balance, according to court documents. FCC did not respond to request for comment. This alleged pattern is part of a broader dynamic affecting black students in higher education called predatory inclusion, defined by Louise Seamster, a professor at the University of Iowa who studies race and economic inequality, as â\u0080\u009ca turn from former exclusion of a marginalized group, to inclusion, but on terms that negates the benefits.â\u0080\u009d Predatory inclusion doesnâ\u0080\u0099t just impact the for-profit college landscape, itâ\u0080\u0099s also present in the public college system, higher-education commentators add. Just as college campuses have become more diverse, state and federal governments have pulled back on funding them, meaning that students and families have to shoulder more of the financial burden. â\u0080\u009cMore people need to be thinking about the way that weâ\u0080\u0099ve created structures and weâ\u0080\u0099ve created a set of choices that are not great when it comes to financing higher education for black students,â\u0080\u009d said Dominique Baker, a professor of education policy and leadership at Southern Methodist University. â\u0080\u009cWe have to think carefully about the options that we provide to students and the ways that some think that those options are race-neutral,â\u0080\u009d she added. â\u0080\u009cDue to the history of our country and the way structures have been set up they very much are not race-neutral options.â\u0080\u009dRacial wealth gap means that black families tend to borrow more But itâ\u0080\u0099s not just the higher education system thatâ\u0080\u0099s contributing to the gulf in financial outcomes between black and white students. A history of policies that have prevented black households from building wealth and discrimination in the labor market have meant that black families typically have less wealth to rely in paying for college, so they borrow more, and that black graduates face more obstacles in getting jobs that could help them repay their debt. “ Black families typically have less wealth to rely in paying for college, so they borrow more, and that black graduates face more obstacles in getting jobs that could help them repay their debt. ” This systemic racism in the credit and wealth-building systems compound the problem, said Ashley Harrington, the federal policy director at the Center for Responsible Lending. For example, in 2012 the Obama administration tightened credit standards for parents to access the PLUS loans, a federal loan program parents can use to pay for their kidsâ\u0080\u0099 college. That change meant the government would look at a parentâ\u0080\u0099s credit history in the five years leading up to when they planned to borrow for certain adverse events. Those five years overlapped with the subprime mortgage crisis, which disproportionately impacted black families. Tens of thousands of families whose children attended HBCUs were denied loans as a result of the change, putting those students at risk of not being able to attend college. â\u0080\u009cAll of these things are connected and they matter,â\u0080\u009d Harrington said, â\u0080\u009cthey just continue to build on each other.â\u0080\u009d Over the past few years advocacy organizations have been trying to get the public and lawmakers to view our nationâ\u0080\u0099s student-loan problem and possible solutions, like debt-free college and some measure of student-debt forgiveness, through a lens of racial justice. EdTrust is seeking participants for a national study on student debt held by people of color. CRL released a study with the NAACP last year on the topic. Right now, the NAACP is in the process of trying to â\u0080\u009camplifyâ\u0080\u009d the black student-debt experience through a campaign focused on this topic, said Russell Boyd, the national field organizer for the NAACPâ\u0080\u0099s Youth and College division. This effort is particularly urgent at a time when black people are bearing the brunt of the coronavirus pandemic and dealing with the trauma that comes with the racial unrest over the past few weeks, Boyd said. â\u0080\u009cIf black lives did truly matter that would not just be a reactive statement, that would be proactive,â\u0080\u009d Boyd said. â\u0080\u009cThat would mean that black education would matter.â\u0080\u009d"}]}