{"article": [{"url": "https://www.marketwatch.com/story/uk-strikes-two-new-deals-for-90-million-covid-19-vaccine-doses-2020-08-14", "published": 1597407200.0, "headline": "U.K. strikes two Covid-19 vaccine deals for 90 million doses", "body": "The U.K. government said on Friday that it has signed deals for a further 90 million doses of coronavirus vaccines, as the country races to secure supplies of experimental shots to fight the pandemic. Under the new in-principle agreements, U.S. drug developer Novavax NVAX, +0.18% will provide 60 million doses of its coronavirus vaccine to the U.K. Janssen Pharmaceutica, a division of Johnson & Johnson JNJ, +1.39% will supply the U.K. with 30 million doses of its candidate. With today’s announcement, the U.K. has now secured access to six different candidates, across four different vaccine type, taking its potential stockpile to 340 million doses — one of the biggest in the world. That is enough for five doses per person. “The government’s strategy to build a portfolio of promising vaccine candidates will ensure we have the best chance possible of finding one that works, U.K. business secretary Alok Sharma said in a statement. “Today’s agreements will not only benefit people in the U.K. but will ensure fair and equitable access of a vaccine around the world, potentially protecting hundreds of millions of lives.” he added. If the vaccines are safe and successful in clinical trials, both could be delivered to the U.K. in mid-2021, the government said. Read:U.K. signs deals with BioNTech, Pfizer, and Valneva for COVID-19 vaccines The deals come as the European Commission said on Friday that it had reached an agreement with FTSE-100 listed AstraZeneca AZN, +0.63% to buy at least 300 million doses of its potential COVID-19 vaccine. On Friday, Novavax said it would deliver 60 million doses of its coronavirus vaccine to the U.K. as early as the first quarter of 2021. As part of the agreement, the U.K. will fund a late-stage trial of Novavax’s NVAX, +0.18% vaccine candidate to assess the efficacy of the vaccine on the country’s population. The trial, which is scheduled to start in the third quarter of 2020, will be a study in about 9,000 adults between 18 years and 85 years of age to protect against symptomatic COVID-19 disease as well as evaluate antibody and T-cell responses, Novavax said in a statement. Read:Novavax says its COVID-19 vaccine shows promising results in early study Kate Bingham, chair of the U.K. government’s Vaccines Taskforce, said it is encouraging that Novavax’s recent clinical data shows their vaccine triggers an immune response greater than that in patients who have recovered from the disease. “We believe that Novavax has a highly innovative vaccine that could be the first in its class of protein-based vaccine options. We are happy to partner with them and global organizations such as CEPI [Coalition for Epidemic Preparedness Innovations] to further our mutual commitments to ensure global access to the vaccine,” she said. Separately, Johnson & Johnson said its Belgian subsidiary Janssen will supply the U.K. government with its candidate known as Ad26.COV2-S with an initial sale of 30 million doses on a not-for-profit basis for emergency pandemic use. The U.K. has an option to buy an additional 22 million doses. Ministers have also agreed in principle to co-fund a global clinical study of the Janssen vaccine. The next phase of clinical trials is expected to begin later this year to look at whether providing two doses of their vaccine candidate to participants provides long-term protection against coronavirus. Read:Johnson & Johnson starts trial of COVID-19 vaccine after producing immune response in primates In July, the government also said it had secured early access to 90 million vaccine doses of two possible COVID-19 vaccines being developed by a partnership between Germany’s BioNTech BNTX, +1.23% and U.S. drugmaker Pfizer PFE, -0.27%, as well as one by French group Valneva. The same month, GlaxoSmithKline GSK, +1.52% said it had taken a stake in German vaccines maker CureVac. The U.K. government had previously announced a deal with AstraZeneca for the drugmaker to produce 100 million doses of its potential vaccine being developed in partnership with the University of Oxford. Novavax said it would join with Fujifilm Diosynth Biotechnologies to manufacture the antigen component of its coronavirus vaccine candidate, NVX-CoV2373, from its Billingham, Stockton-on-Tees site in the U.K., to produce as many as 180 million doses of the vaccine annually."}]}