{"article": [{"url": "https://www.marketwatch.com/story/american-airlines-to-cut-19000-amid-the-pandemic-2020-08-25", "published": 1598356880.0, "headline": "American Airlines to cut 19,000 amid the pandemic", "body": "DALLAS (AP) — American Airlines AAL, +0.34% said Tuesday it will eliminate 19,000 jobs in October as it struggles with a sharp downturn in travel because of the pandemic. Flight attendants will bear the heaviest cuts, with 8,100 losing their jobs. The furloughs and management layoffs announced Tuesday are in addition to 23,500 employees who accepted buyouts, retired early or took long-term leaves of absence. American began the year with about 140,000 employees but expects fewer than 100,000 to remain in October. U.S. air travel plunged 95% by April, a few weeks after the first significant coronavirus outbreaks in the United States. Passenger traffic has recovered slightly since then but remains down 70% from a year ago, and carriers say they need fewer workers. American’s announcement comes one day after Delta Air Lines DAL, +0.39% said it will furlough 1,941 pilots in October unless it reaches a cost-cutting deal with the pilots’ union. In March, passenger airlines got $25 billion from the government to save jobs for six months, and American was the biggest beneficiary, receiving $5.8 billion. The money, and an accompanying ban on furloughs, expire after Sept. 30, although airlines and their labor unions are lobbying Congress for another $25 billion and a six-month reprieve from job cuts. When the federal relief was approved, “it was assumed that by Sept. 30, the virus would be under control and demand for air travel would have returned. That is obviously not the case,” American CEO Doug Parker and President Robert Isom said in a letter to employees on Tuesday. American plans to fly less than half its usual schedule — and only one-fourth of its lucrative international service — in the fourth quarter. The airline, based in Fort Worth, Texas, announced last week that it will pull out of 15 smaller U.S. cities in October, a move that was seen as a warning shot to Washington that it should approve more money for airline payrolls. “The one possibility of avoiding these involuntary reductions on Oct. 1 is a clean extension” of the payroll relief, Parker and Isom said in their letter to employees. Airlines were the only industry to get special treatment in a $2.2 trillion virus-relief measure approved in March. There is broad support in Congress for extending that help, but it is stalled by a breakdown in negotiations between the White House and congressional Democrats over a new aid package."}]}