{"article": [{"url": "https://www.marketwatch.com/story/end-of-paycheck-protection-program-looms-but-concerns-are-muted-on-capitol-hill-11596578718", "published": 1596564800.0, "headline": "End of Paycheck Protection Program looms, but concerns are muted on Capitol Hill", "body": "Sen. Marco Rubio speaks to the press at the U.S. Capitol in May.Getty Images The Paycheck Protection Program, the initiative that gave forgivable loans to businesses in return for not laying off workers during the pandemic, appears on track to expire at week’s end. And, so far, no one on Capitol Hill seems terribly concerned. The PPP was a flashpoint for lawmakers earlier in the year when it ran out of borrowing authority and was headed toward expiration in July, but was saved by a bipartisan bill. “That money we want to repurpose for other issues,” Treasury Secretary Steven Mnuchin told reporters Monday after meeting with House Speaker Nancy Pelosi and Senate Democratic Leader Chuck Schumer on broader coronavirus aid talks. “We’re less focused on that,” he said. There are signs thath interest in the program has run its course. As of July 31, the program had a little over 5 million loans outstanding, worth $521.4 billion, according to the Small Business Administration. Almost another $140 billion in lending authority remains untapped. In mid-June, the loan numbers stood at 4.6 million loans totaling $512.3 billion. The program, whose previous end date of July 31 was extended in early July, is now set to expire Saturday. If it does expire, barring an unlikely agreement on larger economic stimulus bill or a last-minute reprieve, the PPP would join two other major provisions in the March CARES Act that have not been renewed. The others were the $600-a-week federal add-on to state unemployment benefits that recently lapsed, and the moratorium on evictions of renters in buildings backed by federally guaranteed loans. The latter expired July 25, but a requirement that tenants be given a 30-day notice before being evicted puts the practical eviction moratorium expiration at Aug. 24. While the White House has used the unemployment insurance and eviction moratorium dates to push the Democrats toward a narrow stimulus bill, at least one GOP supporter of the PPP did not seem too worried by the nearing program lapse. “Yeah, although at this point, it appears that those who could have benefited from the first round of PPP have used it, which is why there’s a need for a second round,” Sen. Marco Rubio, the Florida Republican who helped craft the PPP in the CARES Act, told reporters Tuesday. “In essence, we think we have hit the bottom in terms of the number of companies that could have benefited from the first round. So our hope is that we can, we can get a second round going,” he said. Axios reported Rubio and Maine Repubican Sen. Susan Collins had filed amendments to a pending Senate bill meant as a “shell” for yet-to-be-determined coronavirus legislation that would both extend the Aug. 8 expiration and allow for businesses to file for a second tranche of help. Rubio told reporters that Republicans and Democrats aren’t that far apart on renewing PPP but it is being held back by the disagreement over whether to move a larger package as Democrats want, or a narrower one, as the White House wants, and how the federal supplement to state jobless benefits is revived. “I’ve told you guys this before, if this was only about PPP, we would have been done already. There are differences — they’re not wide. But, obviously it’s interlaced with all these other issues that are a bit more controversial,” he said. A survey released last week by the U.S. Chamber of Commerce found many small businesses, which were the target of PPP aid, remained worried about the pandemic’s impact on their bottom lines. Seventy-eight percent of businesses surveyed said they were worried about the coronavirus’ impact, with 65% saying they were worried about closing down again or remaining closed in the event of a spike in cases."}]}