{"article": [{"url": "https://www.marketwatch.com/story/private-equity-returns-have-gone-up-that-may-not-last-2020-06-18", "published": 1592460260.0, "headline": "Private equity returns are rising. That may not last.", "body": "The State Street Private Equity Index (SSPEI) posted its second-highest quarterly performance in the past two years with a return of 4.35% in the last three months of 2019, up from 0.82% in the third quarter of the same year. The improved figures will come as a relief to investors who have questioned private equity’s outperformance claim as returns have essentially matched those of the U.S. stock market over the past decade. Research by Harvard professor Josh Lerner and the consultancy Bain & Co. published in February showed that investors who had placed money into private equity made an average annual return of 15.3% in the 10 years to June 2019. That compared with the 15.5% they would have made had they put the money into the S&P 500, the report showed. “Private equity performance rebounded in Q4 and scored a respectable 14.22% annualized return for 2019. The total capital raised in 2019 also surpassed the previous peak in 2007,” said Will Kinlaw, head of State Street Associates, a division of State Street Global Markets. However, he cautioned that returns this year could come under pressure as the true impact of the crisis filters through to the numbers. “Certainly, the environment has changed considerably since the beginning of 2020 and it will take several months for us to better understand the impact of the global pandemic on private equity. The private equity cash flows that we are tracking up to March 2020 are showing clear signs of stress,” Kinlaw said. He added: “The distribution rate in the first three months of 2020 is sitting at its lowest level in a decade.” Read:Can private equity continue performing and sustain its high fees? Private equity is sitting on dry powder — or uninvested capital — of approximately $1.5 trillion, according to data from Preqin. European-focused private-equity funds recorded a quarterly gain of 8.13% in dollar-denominated terms for the fourth quarter of 2019 (5.01% in EUR-denominated internal rates of return), according to State Street STT, +2.20%. In USD-denominated terms, U.S.-focused private-equity funds posted a 3.77% return during the period, an increase from 0.87% in the third quarter. Funds focusing on the rest of the world returned 3.11%, up from 1.12% in the previous quarter of 2019. Read:Private equity numbers aren’t as ugly as they appear Venture capital funds, which previously returned -0.05% in Q3, rallied and posted a 5.68% return. That was followed by the performance of buyout funds, at 4.24%, and private debt funds, which returned 2.43%, according to the State Street Private Equity Index. The index is based on directly-sourced limited partnership data and represents more than $3 trillion in private-equity investments, with over 3,100 private equity partnerships, as of December 31, 2019. Health-care funds led among sectors with a strong quarterly return at 8.13%, rebounding from -0.21% in the third quarter. In October, for example, health-care-focused private-equity firm ArchiMed exited Italian dental group Primo, delivering a return of three times to investors. ArchiMed said that the sale to Italian private-equity firm Aksia represents an internal rate of return of 36%. Information technology funds posted the second-best quarterly return of 6.33%, up from 1.14% in the previous quarter. However, energy funds remained in negative territory for the third-straight quarter with -2.77% in the last three months of 2019, compared with -3.39% in the third quarter."}]}