{"article": [{"url": "https://www.marketwatch.com/story/trump-tweets-dont-be-afraid-of-covid-americans-tell-him-why-theyre-still-scared-2020-10-05", "published": 1601975840.0, "headline": "Trump tweets, 'Don't be afraid of Covid,' sparking heated Twitter exchanges", "body": "As President Trump prepared to leave Walter Reed Medical Center on Monday, he tweeted this upbeat message out to the public: “ 'Feeling really good! Don't be afraid of Covid. Don't let it dominate your life. We have developed, under the Trump administration, some really great drugs & knowledge.' ” - President Donald Trump The phrase \"Don't be afraid of Covid\" became a trending topic on Twitter TWTR, -0.23%  on Monday afternoon, with many people accusing the presidential post of being tone deaf or irresponsible, considering that close to 210,000 Americans and counting have died from COVID-19 this year, and the U.S. has recorded 7.4 million cases - leading the world in both pandemic metrics. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } What's more, many people have reported suffering coronavirus-related health problems continuing for months after their initial diagnoses, raising concerns about the long-term effects of the virus. Read: A lung doctor on what she's learning about coronavirus 'long haulers': shortness of breath, fatigue, and depression but also 'improvement over time' Supporters of the president responded positively to his tweet. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Still, the overwhelming response on Twitter was negative, with critics pointing out that Trump was given COVID-19 treatments usually reserved for people who are more seriously ill than Trump has been depicted as being, as well as experimental therapies that most people don't have access to. It should be noted that an estimated 30 million Americans under 65 don't have health insurance, according to 2018 CDC data. And another 5.4 million people who were laid off from their jobs during the pandemic are uninsured, according to a July study by the Families USA advocacy group. Read:The unemployment rate has gone down, but fewer Americans expect to return to their old jobs Plus, about 33.6 million Americans, or 24% of U.S. civilian workers, don't have access to paid sick leave in the event that they or someone in their household gets sick. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } The president returned to the White House on Monday evening, mounting a staircase and lingering on a balcony long enough to see off Marine One, pose for photographs and record a video message. He removed his mask almost immediately. Here is what MarketWatch has reported about the president's health, his treatments and the potential impact of his diagnosis on the election so far. His doctor noted he may not be \"out of the woods yet.\""}]}