{"article": [{"url": "https://www.marketwatch.com/story/u-k-consumers-more-confident-on-economic-outlook-than-widely-thought-according-to-new-report-11595254894", "published": 1595240960.0, "headline": "U.K. consumers more confident on economic outlook than widely thought, according to new report", "body": "Some shoppers wear masks as a precaution against the transmission of the novel coronavirus as they walk along the pavement on Oxford Street in London, England, on July 14, 2020. AFP via Getty Images U.K. consumer confidence has been shifting upward since March and continues to make a steady recovery, according to a new report. Contrary to recent studies that have presented the majority of Britons as feeling decidedly downbeat during the lockdown caused by the coronavirus pandemic, research from London-based Elgin Partners has found that U.K. consumers have been more bullish on economic recovery, even as many still stay at home, with potentially calamitous consequences for shops, bars and restaurants. The U.K. has recently implemented eye-catching initiatives to try to lift consumer confidence in the wake of the lockdown. Last week, Chancellor of the Exchequer Rishi Sunak announced that the government would pay half the cost of meals eaten out by Britons, in a bid to boost the ailing hospitality sector. In May, according to polling from research firm Ipsos Mori, nearly two-thirds (61%) of Britons said they would be uncomfortable using public transport or frequenting bars and restaurants. Official consumer confidence indexes (CCIs) have suggested the U.K. has nearly hit an all-time low during the coronavirus crisis. But a new report entitled “Measuring Confidence in the Age of COVID” from London-based political strategy company Elgin Partners suggests that U.K. consumer confidence has been growing in the past four months. The report states the discrepancy arises because most CCIs don’t factor in key behavioral factors — such as anxiety and well-being — which affect retail sentiment and are integral to the mind-set of the modern consumer. Additionally, other consumer confidence measures don’t track or reflect the stock market rally that has occurred in recent months. Elgin Partners’ new Social Confidence Index (SCI) tracks six indicators across three areas: confidence in government, confidence in the public and confidence in personal well-being. “The traditional CCIs are yet to show a recovery. Instead, they are either continuing to fall, or flatline,” the report states. “Whereas the SCI model reveals a recovery in consumer confidence from March to April through to June.” Elgin Partners The report notes the U.K. government’s messaging on COVID-19 could have contributed to public morale being lower: “The data suggests that the rate of the recovery in consumer confidence is being held back by perceptions of government handling of the crisis.” The report added: “This economic recovery will be unique. It is an economic and a social event. At its core will be a confident consumer. To accurately measure and model attitudes and behaviors requires innovation. “Whilst ‘economic scarring’ is often cited as the defining legacy of the COVID-crash, the extent of ‘social scarring’ will ultimately influence the pace — and shape — of recovery. Government policy needs to address this dynamic…reviving economic confidence cannot be left to the Treasury as with previous recoveries.”"}]}