{"article": [{"url": "https://www.marketwatch.com/story/9-smart-dog-accessories-for-your-car-2020-08-14", "published": 1597381940.0, "headline": "9 smart dog accessories for your car", "body": "As more families opt to travel in cars vs. planes this year, it’s more important than ever to be comfortable and prepare for the unexpected. This is truer still when traveling with a pet. Here are some accessories to make your next trip with the fur-kid safer and more comfortable.Dog seat belt iStock Securing a pet is among the most important measures to take to keep everyone safe in the car. There are a variety of dog seat belts and restrainers to meet the needs of any size breed, and many cost less than $15. You can find a selection to fit your dogs’ needs at sites such as AMZN, +3.01% and Chewy. CHWY, +4.96% Pet hammock istock If your dog is being treated to the entire back seat, these hammocks are ideal. They attach to the front and rear headrests to create a private space for your pet while also acting as a cover to protect your seats. They work well, preventing your dog from falling off the seat and into the footwell. Look for one that will allow you to buckle in your pet – safety first, remember?Pet ramp WeatherTech.com As more car buyers switch to SUVs, that can mean more difficulty for the family pet getting up and into these higher-riding vehicles. This is truer still for smaller and older dogs. A ramp can help ease the process. There are many ramps available, but we suggest one that is built well to support your dog, folds for easy storage and has a nonslip surface. WeatherTech recently started offering this one shown here that looks particularly promising. Check out: A first look at Toyota’s new RAV4 plug-in hybridRear side window shades Even with the AC blasting, the rear seat of a vehicle can be a warm place. This is especially true when driving through hot regions in the summer months. Some vehicles are also more prone to this than others, such as SUVs with big windows or cars without rear air vents. Putting stick-on shade coverings inside the windows can mean the difference between a dog that pants and one that rests more comfortably. These can be found for under $20 online, at auto-parts stores, and in the car-care section of big-box retailers. (People often use them for babies.)Spill-proof water bowl You already know you must bring cool, fresh water on your ride with Fido. But getting said water from jug to mouth can pose a dilemma. A no-spill water bowl like the UPSKY is a good solution, and even has nonslip feet. Also see: 8 new luxury SUVs for under $50,000Calming treats If your dog is prone to getting anxious in cars, consider a calming treat. There are many varieties by several makers, and they can be ordered online or purchased at a pet store. Bonus: You can use these as incentive for getting into the car.Portable fan If your vehicle doesn’t have rear air vents, one way to help get air moving in back is with a plug-in fan, used with the AC (a fan alone does not really cool a dog.) Many vehicles have a 12-volt or AC socket in back or even USB power plugs. With a 12-volt or AC socket you can plug in an ordinary fan (if it’s a socket you’ll need a converter), or if there’s a USB port you can get a small USB-powered fan. Another option are those “portable air cooler” devices that are popping up. They act as swamp coolers and can chill the air if you freeze the filter cartridge beforehand. Just beware of water sloshing in them or the humidity they put out. Dog car freshener No matter how much you try to air your car out, your dog’s smell will probably linger long after your road trip is done. These air fresheners can help fight the funk, and their paw design shows where your priorities lie. Pet booster seat AKC.org If your dog has a big heart but small stature, a booster seat might be in order. Several available on the American Kennel Club site will give your smaller dog a leg up for better comfort and visibility, all while allowing them to be safe and restrained. AKC booster seats and beds Read next: The 10 best new cars for dog owners This story originally ran on Autotrader.com."}]}