{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-rise-as-global-stocks-sell-off-amid-fears-of-a-resurgence-in-us-coronavirus-cases-2020-06-11", "published": 1591884560.0, "headline": "Gold ends higher as global stocks sell off amid fears of a resurgence in U.S. coronavirus cases", "body": "Gold futures climbed on Thursday to their highest finish in more than a week, supported by growing concerns of a resurgence in U.S. cases of coronavirus and a sobering economic outlook from the Federal Reserve. Fed Chairman Jerome Powell’s comments Wednesday “revealed his deep uncertainty regarding the recovery of the U.S. economy, stating that he expected interest rates to remain near zero through 2022,” said Jeff Klearman, portfolio manager at GraniteShares, which offers the GraniteShares Gold Trust BAR, +1.88% The Fed’s updated policy statement and projections indicate that it expects a 6.5% contraction by the end of the year on a year-over-year basis, with the unemployment rate ending at 9.3%, well above the Fed’s estimate of the long-run rate forecast of 4.1%. “Powell’s comments caused U.S. stock markets to move lower and gold prices to shoot higher with investor economic growth and recovery expectations falling,” Klearman told MarketWatch. “Gold prices were also supported by the Fed’s promise to continue its unprecedented monetary stimulus amid falling inflation until data shows the economy improving.” “While Powell’s comments focused on the uncertainty of the fallout from the pandemic lockdown, investor anxiety of a possible coronavirus “second wave” also supported gold prices while pushing equity markets lower,” he said. The number of U.S. coronavirus infections passed the two million mark and over 112,000 Americans have died, according to Johns Hopkins University. “With the ‘opportunity cost’ of gold zero or even positive, real rates significantly below zero, unprecedented monetary stimulus here and abroad as well as growing uncertainty about U.S. and global economic growth, gold prices seem to be strongly supported with very little reason to see gold prices move lower in the near future,” said Klearman. August gold US:GCQ20 rose $19.10, or 1.1%, to settle at $1,739.80 an ounce, marking the highest settlement for a most-active contract since June 1, according to FactSet data. Prices on Wednesday, which settled a half-hour before the 2 p.m. Fed policy statement and interest rate projections, fell by less than 0.1%. The winner of recent developments in the market has been “gold, which jumped back towards the upper bound of the range it has been trapped in for months now,” said Marios Hadjikyriacos, investment analyst at XM. Still, economic data released Thursday weren’t quite as bad as the market expected. The number of Americans who applied for jobless benefits in early June slowed to 1.54 million from a revised 1.9 million at the end of May, according to the U.S. Labor Department. The producer price index rose 0.4% in May after a record 1.3% decline in the prior month. Among other metals Wednesday, July silver US:SIN20 settled 9 cents, or 0.5%, higher at $17.889 an ounce, after finishing Wednesday’s action virtually unchanged. July copper US:HGN20 shed 7 cents, or 2.6%, at $2.5865 a pound, after gaining 2.2%, a day earlier. Prices for the industrial metal finished lower for the first time in six sessions. The copper market has seen some profit taking with a portion of the trade “a little discouraged” by the Fed’s view that the return to self-sustained growth could be a “very long road,” analysts at Zaner Metals wrote in a daily commentary. July platinum US:PLN20 fell $22, or 2.6%, at $824 an ounce, while September palladium US:PAU20 shed $20.70, or 1.1%, to end at $1,910.10 an ounce."}]}