{"article": [{"url": "https://www.marketwatch.com/story/this-innovation-could-do-for-investing-what-napster-and-the-ipod-did-for-music-and-financial-services-may-never-be-the-same-2020-07-31", "published": 1597670960.0, "headline": "This innovation could do for investing what Napster and the iPod did for music - and financial services may never be the same", "body": "Consider the mix tape. Decades ago, it was the most technologically advanced way to share a batch of music. A lineup of songs specially curated by the right person could say \"I love you\" or bring back memories of a shared experience. Then the technology advanced. Now, with a few clicks, we can make our own electronic mixes any day and for any occasion - or allow cloud-based virtual assistants to surprise us. Now consider the mutual fund. Decades ago, it was one of the most common ways to invest. For a smallish fee, an ordinary investor could buy into a portfolio of stocks or bonds specially curated by a financial expert. But just as with music, movies, cars, pharmaceuticals, robotics, money and so many other products, investing has evolved. An innovation often called \"direct indexing\" is gaining ground with affluent investors, and is likely to soon start to reach the retail masses. If mutual funds were mix tapes and exchange-traded funds were like the deejay machines that made an appearance in mall record stores for a few years, direct indexing is Spotify SPOT, +0.08%  or Pandora: personal, technological, disruptive, and even a little sexy. The idea is simple, and it isn't new. Big institutional investors like pension funds have long used customized indexes that reflected certain priorities for their portfolios. Rather than investing in the entire S&P 500 SPX, +0.87%  , they'll select for large-cap stocks with a value tilt, leaving out tobacco companies, for example. \"All that's changed over time is the thresholds for accessing an index have gotten lower and lower,\" said Dave Nadig, an index industry veteran now serving as chief investment officer and director of research at ETF Database. \"It's just a software problem. And the technology required to produce that customized account has plummeted to the point where it's almost retail. It's not quite mom-and-pop, but it's heading there.\" One of the many companies trying to solve the \"software problem\" is O'Shaughnessy Asset Management. Canvas, O'Shaughnessy's direct indexing product, is shared with a select few registered investment advisors who can offer it as a service to their clients. For that client, access to Canvas means that rather than holding a bunch of individual securities that may or may not mesh well together, or being at the whim of fund creators who select the securities inside their funds according to their own beliefs, he can create a customized index that makes sense for him, in very specific ways. That could mean starting with the S&P 500, then stripping out the two companies where a husband and wife work and already hold big chunks of the firms' equity. It may be a broad index of stocks less fossil fuels, or private prisons, or other companies whose missions or practices offend particular sensibilities. Those features were familiar to Canvas' creators, but Patrick O'Shaughnessy, the company's CEO, told MarketWatch that one of the biggest surprises from seeing the program in action - it's been in service since November - had to do with investors' taxes. \"We didn't anticipate how much effort we would spend customizing tax profiles, setting limits on the capital gains tax a client might be willing to pay,\" O'Shaughnessy said. \"Setting limits\" may be putting it mildly. Direct indexing's secret sauce may be just as much about actively managing tax-loss harvesting for clients as it is about keeping portfolios ESG-friendly. That means that a program like Canvas will watch for stocks that are losing value, and sell them in order to offset capital gains on others that have gained. For many observers, the problems direct indexing aims to solve may sound like nice ones to have. It's a uniquely first-world complaint to inherit a substantial stash of the stock of a Fortune 500 company, say, or to have the resources to devote to actively strategizing how to avoid capital gains taxes. But industry participants say direct indexing is just another innovation that starts with early adopters and diffuses its way outward. \"Tesla TSLA, +1.89%  started with the Roadster, and then came the Model X, Model S, and Model 3,\" O'Shaughnessy said. \"The best way to perfect a technology is to attack the hardest use case first. Our customers tend to be very wealthy, ultra-high-net-worth individuals with peculiar tax settings or circumstances: complicated financial lives. Our marginal costs are high enough that we couldn't do this today for retail investors, but all of these direct solutions will keep pushing down market.\" One early sign of that push downstream is a \"stock-level tax-loss harvesting\" service offered by robo advisor Wealthfront. The service is available for accounts as low as $100,000, and, as a company spokesperson told MarketWatch, the appeal of saving on taxes is a universal: hardly something reserved for the wealthy. But Wealthfront declined to say how many clients were actively using the product. See: 'Most people don't want to be called average,' says Betterment's Dan Egan, who designs financial tools for them anyway Nadig, who's watched - and helped launch - multiple rounds of disruption in the fund industry himself, thinks a more interesting player is Charles Schwab Corp. Nadig and many other observers believe the company is moving quietly, but deliberately, toward offering direct indexing broadly, a step that will democratize it. Schwab in June began offering what it calls stock \"slices,\" fractional shares that will make direct indexing much easier for smaller accounts. For big-ticket portfolios, pricier stocks like, say, Amazon.com Inc. AMZN, +3.01%  , aren't a problem. But a $50,000 account that intends to invest in an index of 400 stocks requires fractional shares in order to have a position in a stock that costs $3,000. The company had previously purchased another direct-indexing concern called Motif. And they have the enormous reach to be able to swallow low enough margins to democratize the process, Nadig said in an interview. James Werner, a financial advisor with Austin, Texas-based Silicon Hills Wealth Management, is also carefully watching the advance of direct indexing. Werner estimates about 20% of his firm's clients are using the service, with great success, and notes that it's particularly popular among younger investors. He calls Canvas \"the next generation\" of direct indexing capability, and says with a laugh that \"the next generation beyond that\" - likely one enabled by Schwab - is going to replace financial advisors like himself. Related:As boomers hand over the keys to the stock market, sustainability-minded younger investors let their consciences lead But if a bespoke, technology-oriented investing tool is going to put anyone out of a job, it's more likely to be portfolio managers, especially those that dominate the index-investing space, sources said. \"The big loser here is not financial advisers,\" Nadig said. \"The big loser here is BlackRock or State Street. Their business is taking other people's intellectual property (indexes), packaging it up and distributing them to customers.\" A player like Schwab - although, in Nadig's mind, there is no other player like Schwab, which he describes as \"soup to nuts from one guy with $100 in a checking account up to hundreds of billions they manage themselves\" - is uniquely positioned to integrate indexing, trading, relationships with individual investors around the country, and all the back-end machinations in between. But Ben Johnson, director of global ETF research at Morningstar, thinks calling for the death of the fund industry is premature, if only because of the enormous inertia that surrounds investor decisions. Johnson also believes that the fuss over direct indexing belies a very straightforward reality: \"For all intents and purposes this is just another form of active management.\" While a handful of investors will be well-served by the ability to invest according to their conscience or around their family fortunes, most people are better off sticking with a true index - that is, owning the market outright in a fund like Vanguard's popular S&P 500 index fund VOO, +0.89%  - Johnson said in an interview. \"I've been predicting the end of the brokerage industry for 30 years,\" said Barry Ritholtz, the co-founder, chairman and chief investment office of Ritholtz Wealth Management, a New York-based investment advisory with $1.5 billion in assets, and a Canvas client. Straightforward indexing \"works for 90% of the people out there. This is more sophisticated and maybe a little intimidating to a lot of people,\" Ritholtz said. In Morningstar's last annual analysis of the performance of passive and active funds, only 23% of all active funds topped the average of their passive rivals over the 10-year period ended June 2019. That's another important distinction about direct indexing. For all the discussion about customization, it's still centered around the idea that investing needs to start somewhere, to participate in a broad market in some way, even if it gets trimmed or tweaked. That's a vastly different proposition than the way many individuals approach investing - buying a little of this, a little of that, rolling over something from an old account, and so on. And as Ritholtz points out, it's much easier to implement a robust tax-loss harvesting strategy with hundreds of stocks than with a few dozen. Still, as with any disruptive innovation it's hard to know exactly what the future will bring. James Werner is struck by how his direct-indexing clients behaved through the March market meltdown, bringing a sense of ownership to their portfolios that he thinks was a vastly different experience than previous downturns. \"People have much stronger staying power, if they have a connection with the stocks that they own as opposed to just having things in a nebulous exchange-traded fund,\" Werner said. \"In conversation after conversation, people just said, I'm not worried about that, it'll come back.\" See:A 'Hippocratic oath' for financial advisers? The SEC's new 'Regulation Best Interest' gets mixed reviews."}]}