{"article": [{"url": "https://www.marketwatch.com/story/all-i-hear-is-old-timers-say-that-the-retail-bros-are-going-to-get-crushed-the-supreme-leader-of-stock-market-day-traders-saysbut-im-beating-them-like-a-drum-2020-06-26", "published": 1593357260.0, "headline": "'All I hear is old-timers say that the retail bros are going to get crushed,' Barstool's David Portnoy says - but 'I'm beating them like a drum'", "body": "“ 'All I hear is old-timers say that the retail bros are going to get crushed. That they've lived through this before. That the pride comes before the fall. â\u0080¦ Yet here I am. Beating them like a drum for the past three months at their own game.' ” That's Barstool Sports founder Dave Portnoy appearing to fully embrace his unofficial role as leader of an army of day traders that has taken Wall Street by storm amid a public health crisis that has rocked Wall Street and the economy. In an op-ed on Fox Business on Friday, Portnoy claims a financial community that initially embraced him as a newbie bringing a younger crowd's attention to the world of investing became resentful of the success that he seemed to be enjoying using his unique brand of equity trading. See: AOC goes after Barstool founder Dave Portnoy on Twitter over labor unions \"The finance community welcomed me with open arms. But then something funny happened along the way. I started winning and they started losing. The more I won, the more mad they got,\" he writes in the op-ed. \"Yet I ask them, how many global pandemics have they actually lived through? The answer is zero.\" The outspoken Barstool founder-cum-go-go trader has drawn outsize attention as an avatar of the young investors that have made massive, and so far successful, bets on a powerful recovery for stocks from their March lows. The Dow Jones Industrial Average DJIA, +0.56% and the S&P 500 SPX, +0.87% have soared 35% since hitting a low point on March 23 amid a coronavirus-induced rout. The Nasdaq Composite Index COMP, +1.39%, meanwhile, has vaulted 43% higher and earlier this month notched its first closing record since Feb. 19. Check out:There's absolutely no reason to own U.S. equities right now,' strategist says, citing 'an unholy speculative mix' Amid that run-up, those traders have gobbled up shares of large-capitalization technology-related stocks, including Facebook Inc. FB, +0.26%, Amazon.com AMZN, +3.01%, Apple AAPL, +1.74%, Microsoft MSFT, +2.48% and Google and YouTube parent Alphabet GOOG, +1.97% GOOGL, +1.82%, which have been among the biggest gainers during the market's recovery from the economic fallout of the pandemic. On top of that, those speculative investors have also bought stocks that were brutalized in the initial selloff, including airlines and travel-related companies, including American Airlines Group Inc. AAL, +0.34%, Delta Air Lines Inc. DAL, +0.39%, Carnival Corp. CCL, +0.51%  and Royal Caribbean Cruises Ltd. RCL, +2.59%. Some have made the case that an era of zero-commission discount brokerage trades, ushered in by Charles Schwab SCHW, +1.29%, and platforms like Robinhood that cater to younger investors, combined with a dearth of diversions due to COVID-19 lockdowns and unemployment over the past few months, have created a perfect environment for newly minted day traders like Portnoy. Portnoy has been cast as the \"supreme leader\" of this band of investors by the Financial Times, which has described his acolytes as \"retail bros.\" The antics of Portnoy have been notable and outlandish, including live streaming his trading exploits, picking investments based on selecting letters at random from a bag of Scrabble tiles and declaring himself better suited to the current investing environment than legendary long-range investor Warren Buffett. \"I'm not saying I had a better career. â\u0080¦ He's one of the best ever to do it,\" he said. \"I'm the new breed. I'm the new generation. There's nobody who can argue that Warren Buffett is better at the stock market than I am right now. I'm better than he is. That's a fact,\" he said. On Friday, he claimed that he has \"as much experience in this trading climate as they do.\" \"And maybe the very fact that I'm not burdened with their history has allowed me to see this market for what it is, while they have failed miserably,\" he added. Day traders, however, may have been smarting on Friday, as rising cases of the coronavirus knocked returns lower for bullish investors. Check out: It's like the Wild West with 'get-rich-quick crowd' vs. Wall Street pros, but it's too easy to blame retail investors for 'rampant speculation'"}]}