{"article": [{"url": "https://www.marketwatch.com/story/feds-kaplan-worries-recovery-may-be-slowed-if-coronavirus-health-practices-remain-uneven-2020-06-14", "published": 1592140280.0, "headline": "Fed's Kaplan worries economy's recovery may be slowed if coronavirus health practices remain 'uneven'", "body": "Dallas Fed President Robert Kaplan said Sunday that public health procedures to combat the coronavirus were just as important as government funding for the nascent economic recovery and that, to date, the efforts to reduce coronavirus infections have been \"uneven.\" In an interview on CBS's \"Face the Nation,\" Kaplan said experts tell him that it is \"critical\" that people \"widely\" wear masks and that there is good testing and contact tracing. \"The extent we do that well will determine how quickly we recover. We'll grow faster if we do those things well,\" Kaplan said. \"And right now, it's relatively uneven.\" Fed officials say they are doing all they can to help the economy recover. There is an undercurrent of concern in their comments over how efforts to stem the pandemic, normally outside the purview of central banking, are going. On Friday, Richmond Fed President Thomas Barkin called on the government and business to develop a common set of standards so consumers feel safe shopping and eating at restaurants. Texas is one state seeing rising coronavirus cases, especially in Austin and Houston. Kaplan said that officials assumed there would be more coronavirus cases as part of the reopening. \"The thing we're watching is - are there so many cases it is overwhelming the health-care system - and we're not seeing that at all here,\" he said. The Dallas Fed president said the unemployment rate was on its way down. \"We're going to get positive job growth in June, July from here,\" he said. However, even with the job growth, the jobless rate will finish the year at 8% or higher, he said. See: White House economic adviser Larry Kudlow downplays concern about second coronavirus wave Congressional spending \"is going to be very important from here,\" Kaplan said. Asked if he meant Congress should spend more money, Kaplan said: \"I am being careful as a central banker not to tell fiscal authorities what to do.\" The Dow Jones Industrial Average DJIA, +0.56% was down 1,505 points last week to 25,605. Stocks fell sharply after Fed Chairman Jerome Powell gave a grim outlook for the economy. Read:Dovish Fed sees no rate hikes for years Powell said there was a \"long road\" ahead for the economy to return to full employment and the outlook was uncertain. He said millions of workers won't get to go back to their old jobs. The Fed chairman will get to revise and extend his remarks when he testifies to Congress on Tuesday and Wednesday."}]}