{"article": [{"url": "https://www.marketwatch.com/story/white-house-economic-advisor-kudlow-downplays-fear-of-second-coronavirus-wave-2020-06-14", "published": 1592131700.0, "headline": "White House economic adviser Larry Kudlow downplays concern about second coronavirus wave", "body": "White House economic adviser Larry Kudlow on Sunday downplayed the increase in coronavirus cases seen in many states and said the country “has got to open.” There is growing concern that nearly two dozen states are seeing rises in diagnosed COVID-19 cases after they began to reopen and lift restrictions on movement. In an interview on CNN’s “State of the Union,” Kudlow suggested that the rise in cases stemmed from increased testing and that increased hospitalization numbers were from a resumption of elective surgeries. “Although the case rate has increased a bit, we’re not talking about a second round here,” Kudlow said. “Fatality rates continue to be very low,” he said. “That is probably the ultra-key metric.” “The country has got to open,” he said, returning to a theme the White House and allies have voiced in past months: “The costs of not opening may exceed the costs of closing down. I think we’re on the right track here.” Kudlow painted an upbeat forecast for the economy. “We are on our way — we are reopening,” Kudlow said. He said the economy was at a “turning point.” “You’ve got a lot of positive, green-shoot indicators,” he said. Kudlow predicted “a big, big” increase in retail sales in May. The government will release those data on Tuesday. Economists surveyed by Econoday expect a rebound of 7.5% after a 16.4% decline in the prior month. In addition, the Apple mobility index, which tracks the movement of consumers, is “practically prepandemic,” Kudlow said. “This economy is now in the recovery stage — that’s the key point I want to make this morning,” he said. “I think there is a very good chance you are going to get the V-shaped recovery, and I think the second half of the year ... will be a good 20% economic growth and the unemployment rate will fall,” he added. A V-shaped recovery refers to a quick snap-back in economic growth rather than a slower sustained rebound. Fed Chairman Jerome Powell has been more cautious, telling reporters this week that there would be a “long road” before the economy is fully recovered. Kudlow said the White House was against extending the extra $600 a week in unemployment benefits that people out of work have been able to collect on top of what they get from their state. This benefit expires at the end of July. And he defended Treasury Secretary Steven Mnuchin’s decision not to release the names of the recipients of the $660 billion in small-business loans under the government’s Paycheck Protection Program. See:The U.S. ‘can’t shut down the economy again,’ Treasury Secretary Mnuchin says"}]}