{"article": [{"url": "https://www.marketwatch.com/story/should-everyone-invest-in-a-roth-2020-07-27", "published": 1595847800.0, "headline": "Should everyone invest in a Roth?", "body": "Q: With all the debt our country is piling up, taxes have to rise. Doesn’t that make Roth contributions and conversions and avoiding pretax contributions no brainers? — Ted in Charleston A.: Ted, Getting money into a Roth account is a great tax strategy for a lot of people but I can’t quite label it a no -brainer for everyone. 80% of older Americans can't afford to retire - COVID-19 isn't helping I think tax rate increases due to several factors are a very reasonable assumption but that alone should not dictate whether to fund a Roth account over a traditional retirement account with pretax funds. More important than increases in rates generally is the difference between the rate that applies to you at the time the Roth account is funded and the rate applicable to you when money is withdrawn. Read: The Roth strategy we wish we’d built for early retirement Roth accounts are funded with after-tax money. You pay tax now, to avoid paying later. This is smart tax strategy if the rate you pay now is lower than the rate the rate that would be paid later. Figuring out the rate you pay now is straight forward but predicting future rates is more challenging because you will have multiple rates at play. Congress can and likely will change the rates in the future. In fact, if new legislation isn’t passed rates revert to the pre-2018 schedules. However, even if no legislation were ever passed, the future tax rates that apply to you can still vary. Watch: How to decide if you should invest in a 401(k), Roth 401(k), Roth IRA, or IRA For instance, if you are married you face the rates that apply to married couples. At some point one of you will pass away. The survivor of the two of you then pays on the scale of a single filer. Ultimately when the last of the two of you passes, your beneficiaries pay at whatever rate applies to them. Meanwhile, if any of the parties receiving distributions moves to a new state, the difference in state income-tax rates would be a factor. Let’s not forget that the rate that actually applies in any given year is also a function of income during that year. Congress can raise rates but if your income declines as it might during retirement, you may not face a higher tax rate in the future. On the other hand, a raise, an increasing income from a growing business, the start of required minimum distributions or Social Security, and the inheritance of a traditional retirement account can all increase future income levels. Read: A brand new reason to fall in love with Roth IRA conversions An example of when funding a Roth is not wise is in the case of a high-income taxpayer that expects a big drop in income when they retire. It is better to fund the retirement account and take a deduction for the contribution against the current year’s high tax rate because the future rate is likely lower due to the drop in income. Legislative issues matter but the heart of the issue is your confidence level about what future rates will apply to your situation as your income and brackets change over time. If you have a question for Dan, please email him with “MarketWatch Q&A” on the subject line. Dan Moisand is a financial planner with Moisand Fitzgerald Tamayo. His comments are for informational purposes only and are not a substitute for personalized advice. Consult your adviser about what is best for you. Some questions are edited for brevity."}]}