{"article": [{"url": "https://www.marketwatch.com/story/moats-will-make-all-the-difference-for-cloud-companies-as-tech-costs-come-under-pressure-2020-07-08", "published": 1594365500.0, "headline": "'Moats' will make all the difference for cloud companies as tech costs come under pressure", "body": "\"The most important thing [is] trying to find a business with a wide and long-lasting moat around it â\u0080¦ protecting a terrific economic castle with an honest lord in charge of the castle.\" - Warren Buffett, 1995 Berkshire Hathaway shareholder meeting An economic moat - or lasting competitive advantage - ought to be top of mind for technology investors as momentum stocks are soaring. Shares of Fastly FSLY, +9.38%, a cutting-edge cloud company, have soared four-fold this year as investors have piled on. That shows that trading on stock price has become popular as the gains have been easy. Identifying moats, on the other hand, requires deep knowledge of the underlying business - and hands investors bigger returns. Two fallacies There are two fallacies with the idea that everything is accounted for in stock prices. The first is that investor conviction slips if a stock tanks. A stock can fall for many reasons, including profit taking, an economic slump or a hiccup in earnings. In fact, from July to September 2019, the drawdown across cloud-software stocks ranged from 23% to 46%, seemingly on no bad news. (I previously covered this topic here.) For some cloud-software companies it was a steeper sell-off than the drawdown between February and March 2020. Therefore, trading on price may not work in the long run as growth stocks can suffer violent declines seemingly out of nowhere. The second reason that trading on momentum can be harmful: If a tech company truly has a greenfield market with high margins and a runway for growth, competitors will circle quickly. That can erode the addressable market and forward projections.Switching costs Most cloud-software companies come with higher switching costs because it's time-consuming to swap out tools and platforms unless a competitor offers serious, quantifiable advantages. The market capitalization of the public cloud market stands at $1 trillion. Today, there are more than 140 private and public cloud companies each worth over $1 billion. Yet there are 57,000 software companies nipping at their heels, as estimated by peer-to-peer review site G2, with a substantial portion likely already cloud software or soon to be. When picturing the odds of 140 to 57,000, a locust storm comes to mind. Although there is no argument over the enormity of the market and the migration of budgets, there isn't much of a discussion around the limited number of customers that cloud software must appeal to. There is budget to be spent, but I believe every customer will become increasingly more valuable as the migration to cloud accelerates and there are fewer new customers to convert. Twilio is one of the few software as a service (SaaS) companies that have been in business for at least a decade. The company re-accelerated its revenue from the 40%-50% range to 68%-77% by the end of 2018. The company later acquired SendGrid and had Covid-19 tailwinds, resulting in year-over-year revenue growth of 57%, even with greater than $1 billion in annual sales. Those numbers are especially impressive compared with peers of similar vintage who are struggling to tread water above 20% revenue growth. Twilio, Box, Dropbox Box BOX, +1.01%  and Dropbox DBX, +3.66%  are cloud-storage companies mainly for internal teams, whereas Twilio is customer-facing with the risk of costing valuable downtime should a competitor not have equal coverage. To switch from Twilio, you have to port numbers, negotiate contracts with a new carrier, determine if the carrier covers all of the countries needed for your applications, and that the call quality and sending SMS is reliable. In 2017, Uber UBER, -0.18%  had a $60 million annual run rate with Twilio and decided to source different vendors. Even at this level, the company did not build the capability in-house and still remained with Twilio for high-performance messaging. Eventually, Uber migrated to Twilio's main direct competitor - MessageBird. Despite chipping away at Twilio since 2011, MessageBird has about 15,000 customers compared with Twilio's 65,000. The company has been able to do this by serving the developer market and building out an extensive API library and documentation in which telecom features are integrated through a few simple lines of code. When looking at the net revenue retention rate, Twilio has been above the 120% line for many years, with some banner years of 150. (The rate measures the change in recurring revenue from customers over time.) As of 2020, Twilio leads the SaaS category with a 143% rate. The advantages of neutrality The ultimate high-switching costs are at the infrastructure level. While software companies will battle it out this year, especially the horizontally integrated and the vertically integrated, infrastructure companies can rest easy. Hundreds of cloud software companies crowd the public and private markets, yet they all funnel into cloud infrastructure. As John Dinsdale, chief analyst at Synergy Research Group, said, the leading hyperscale data center operators \"are better positioned than most types of companies to ride out the crises.\" He went on to say that hyperscale firms would see substantive tailwinds. Amazon's AMZN, +3.01%  AWS, Microsoft's MSFT, +2.48%  Azure and Google Cloud (sold by Alphabet GOOG, +1.97%  GOOGL, +1.82% ) have high switching costs, with products like Okta OKTA, -0.47%  specializing in being independent and working across any cloud environment. The moat that Okta seeks to establish is to provide identity access management no matter the private or public cloud environment. There are a few reasons companies are more likely to go with a proven brand like Okta for identity access management (IAM). For one, IAM allows access to the company's most critical systems and assets. Also, in order for IAM to work effectively, chief information security officers (CISOs) must put all of their eggs in one basket. Therefore, a best-of-breed independent solution can create a moat by being flexible and reliable. To accentuate its agnosticism, Okta recently came out with end-to-end password-less access that works seamlessly across iOS, iPadOS, macOS, Android and Windows. That said, moats are really only proven by how long a company lasts, and few cloud SaaS companies have a long tenure. There is an informative article from Jerry Chen, a partner at venture-capital firm Greylock, in which he looks at Salesforce's CRM, +2.21%  moat and concludes the company is built on \"deep IP [intellectual property],\" \"benefits from economies of scale\" and \"over time accumulates more data and operating knowledge as they get deeper with a company's workflow and business processes.\" Perhaps the highest switching cost in technology is training employees and developers. Adobe ADBE, +2.30%, like Salesforce, has certified experts and owns file names, such as PDF or PSD. Content creation must be transferable across operating systems and devices. Adobe Acrobat, despite being a cheaper product, facilitates a halo effect for Photoshop, Illustrator and the broader suite by helping Adobe's files become ubiquitous. The education around Creative Cloud would take years to replace, and this is why the product can demand premium pricing.Developer constraints MongoDB MDB, +2.45%, due to becoming a universal NoSQL option, is in the lead for most-wanted database skills. Being agnostic certainly helps, meaning that the competition between Oracle-owned MySQL, Microsoft-owned SQL Server and Amazon-owned DynamoDB helps MongoDB because it is neutral and does not compete with those companies across other, more lucrative revenue segments. https://www.revealera.com/ When Microsoft hires employees, it will not advertise for DynamoDB experience, but it will seek MongoDB experience, helping MongoDB establish itself as a universal database program. Similar to Twilio, MongoDB has maintained over 40% revenue growth for most of its trading history and often reports above 50% and even 70% revenue growth, such as in one period last year. This kind of consistency above 40% with surprise earnings beats, despite massive competitors such as Amazon's AWS/DynamoDB, is only possible when you have a moat of some kind. Alteryx AYX, +3.43%  is also a heavily advertised job skillset for citizen-data scientists. Alteryx charges a premium price. It will be determined this year if the pricing structure remains resilient long-term as tech budgets come under review. Overall, cost-benefit analyses will be pertinent in the immediate term, and moats may be evident only in the long term. Those who trade on price will have immediate gratification while those who take the time to analyze moats may have bigger gains and more restful nights. The writer owns shares of TWLO, MDB, MSFT and OKTA. Beth Kindig is a MarketWatch columnist and San Francisco-based technology analyst with more than a decade of experience in analyzing private and public tech companies. She publishes a free newsletter on tech stocks at Beth.Technology and runs a premium research service."}]}