{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-can-spread-in-the-air-beyond-any-reasonable-doubt-over-200-scientists-tell-the-world-health-organization-2020-07-06", "published": 1594045700.0, "headline": "Coronavirus can spread in the air 'beyond any reasonable doubt,' over 200 scientists tell the World Health Organization", "body": "LONDON (AP) - More than 200 scientists have called for the World Health Organization and others to acknowledge that the coronavirus can spread in the air - a change that could alter some of the current measures being taken to stop the pandemic. In a letter published this week in the journal Clinical Infectious Diseases, two scientists from Australia and the U.S. wrote that studies have shown \"beyond any reasonable doubt that viruses are released during exhalation, talking and coughing in microdroplets small enough to remain aloft in the air.\" That means people in certain indoor conditions could be at greater risk of being infected than was previously thought. The WHO has long maintained that COVID-19 is spread via larger respiratory droplets, most often when people cough or sneeze, that fall to the ground. It has dismissed the possibility of airborne transmission, except for certain high-risk medical procedures, like when patients are first put on breathing machines. In a statement on Monday, the U.N. health agency said it was aware of the article and was reviewing it with technical experts. WHO has been criticized in recent weeks and months for its seeming divergence from the scientific community. The organization for months declined to recommend mask-wearing, partly out of supply concerns and has also continued to describe the transmission of COVID-19 from people without symptoms as \"rare.\" The letter was endorsed by 239 scientists from a variety of fields. It stated that the issue of whether or not COVID-19 was airborne was of \"heightened significance\" as many countries stop restrictive lockdown measures. The authors cited previous studies suggesting that germs closely related to the new virus were spread via airborne transmission. They said \"there is every reason to expect\" that the coronavirus behaves similarly. They also cited a Washington state choir practice and research about a poorly ventilated restaurant in Guangzhou, China, each of which raised the possibility of infections from airborne droplets. \"We are concerned that the lack of recognition of the risk of airborne transmission of COVID-19 and the lack of clear recommendations on the control measures against the airborne virus will have significant consequences,\" the scientists wrote. \"People may think they are fully protected by adhering to the current recommendations but in fact, additional airborne interventions are needed.\" Scientists around the world have been working furiously to understand the new virus. The U.S. Centers for Disease Control and Prevention says it is thought to mainly jump from person to person through close contact, but adds: \"We are still learning about how the virus spreads.\" Martin McKee, a professor of European Public Health at the London School of Hygiene and Tropical Medicine who was not linked to the letter, said the scientists' arguments sounded \"entirely reasonable.\" \"Part of the problem is that everybody at WHO was moving with the paradigm of influenza, even though we know there are lots of differences between influenza and coronaviruses,\" he said. McKee noted that with Britain's recent reopening of its pubs, restaurants and salons, the possibility of airborne coronavirus transmission might mean stricter interventions are needed indoors, including more mask-wearing and continued physical distancing. \"We're getting accumulating evidence about super-spreading events happening in indoor spaces where there are large numbers of people in confined spaces,\" he said. \"Many of these are in exactly the circumstances that governments now want to open up.\""}]}