{"article": [{"url": "https://www.marketwatch.com/story/the-number-of-americans-skipping-mortgage-payments-is-falling-except-among-these-borrowers-2020-08-05", "published": 1596889880.0, "headline": "The number of Americans skipping mortgage payments is falling - except among these borrowers", "body": "For nearly two months now, the share of mortgage borrowers who has received approval to skip their monthly loan payments has fallen precipitously. But a new trend has begun to develop, which indicates that some homeowners are facing more financial pressure as the coronavirus pandemic continues. The percentage of Ginnie Mae loans in forbearance increased one basis point to 10.28%, according to the most recent data released Monday by the Mortgage Bankers Association. It was the second straight week in which the share of Ginnie Mae loans in forbearance increased by this month - prior to that the percentage had decreased for multiple weeks. Forbearance plans allow mortgage borrowers to make reduced payments or skip monthly payments. Under the CARES Act, any borrower with a federally-backed mortgage was allowed to request forbearance from their loan servicer. That included Ginnie Mae loans. Ginnie Mae functions similarly to Fannie Mae FNMA, +0.73%  and Freddie Mac FMCC, +0.52%, and securitizes loans made through government programs including Federal Housing Administration (FHA) loans, Department of Veterans Affairs (VA) loans and U.S. Department of Agriculture (USDA) loans. \"The Ginnie Mae segment tends to have more lower-income families and communities of color than the conventional market,\" said Ed Demarco, president of the Housing Policy Council, a trade organization. \"And these groups have been disproportionately harmed financially by the pandemic and its related shutdowns.\" Government programs typically have less stringent requirements for prospective borrowers than Fannie and Freddie do, including lower credit scores and higher loan-to-value ratios. As a result, these loan programs are especially popular with first-time home buyers. “ 'The Ginnie Mae segment tends to have more lower-income families and communities of color than the conventional market.' ” - Ed Demarco, president of the Housing Policy Council The rise of the forbearance rate in this segment therefore suggests that people who were first-time home buyers are more sensitive to the fluctuations in the economy right now. \"The job market has cooled somewhat over the past few weeks, with layoffs increasing and other indications that the economic rebound may be losing some steam because of the rising COVID-19 cases throughout the country,\" Mike Fratantoni, chief economist at the Mortgage Bankers Association, wrote in the report. \"It is therefore not surprising to see this situation first impact the Ginnie Mae segment of the market.\" Additionally, the $600 expanded unemployment insurance benefits ended last week, and lawmakers have yet to approve a replacement. As a result, those who were laid off because of the pandemic will likely face even more financial pressure in the coming weeks. How much of that pressure will be exerted on homeowners isn't clear though. \"The job loss so far has been disproportionately skewed to renters rather than homeowners - it's hard to extrapolate how many homeowners have been helped by the expanded unemployment benefits,\" said Rick Sharga, executive vice president at RealtyTrac, a foreclosure listings and search portal. Additionally, many homeowners requested forbearance but continued to make their monthly payments as usual. These people likely viewed forbearance as a safety net if they lost their jobs and the bottom fell out. The number of Americans doing this, though, could soon drop because of the expiration of the expanded unemployment, said Karan Kaul, senior research associate at the Urban Institute's Housing Finance Policy Center. That would be a negative development for the mortgage industry that wouldn't be reflected as an uptick in the forbearance rate, since those Americans are already counted as being in forbearance. “ 'If you're a borrower and can't make a payment at the end of forbearance, you have the option of just selling your home and buying a less expensive home or renting.' ” - Karan Kaul, senior research associate at the Urban Institute's Housing Finance Policy Center Whether continued weakness in the economy will result in many of these mortgage borrowers going into default or foreclosure once their forbearance period ends remains to be seen. The CARES Act stipulated that Americans could receive forbearance for up to one year. As a result, the U.S. won't likely see the number of people in default or foreclosure increase notably until at least the third or fourth quarter of next year, Kaul said. But there's ample reason to believe that the coronavirus pandemic won't lead to a repeat of the foreclosure crisis that triggered to the Great Recession. Homeowners will have a wide array of options to modify their home loans if forbearance ends and they're still in financial trouble - many of these options didn't exist prior to the foreclosure crisis, Kaul said. Borrowers are not required to make a lump-sum or balloon payment at the end of their loan's forbearance period, Kaul said. Rather, they can work with their servicer to come up with a repayment plan that works best for them. In many cases this will mean simply tacking on the missed payments to the end of the loan's term. And if borrowers are in a position where their monthly payments are no longer affordable when the forbearance period ends, they can also request a loan modification from their servicer to adjust the size of the monthly payments, loan term and interest rate. Plus, homeowners today have more equity built into their homes, unlike in 2008 when many people owed more than their home was worth due to falling property prices and the ability to take out piggyback loans. So if a homeowner reaches the end of forbearance and cannot afford the repayment options their servicer offers even after a loan modification, they do not need to lose their home to foreclosure. \"If you're a borrower and can't make a payment at the end of forbearance, you have the option of just selling your home and buying a less expensive home or renting,\" Kaul said."}]}