{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-death-toll-on-verge-of-200000-as-new-cases-rose-by-more-than-50000-in-a-day-2020-09-22", "published": 1600788560.0, "headline": "Coronavirus update: U.S. death toll passes 200,000, as new cases rose by more than 50,000 in a day", "body": "The number of deaths as a result of the coronavirus that causes COVID-19 surpassed 200,000 in the U.S., as the global total moved closer to 1 million, which prompted new shutdown measures in the U.K., even as President Donald Trump went against facts and his own previous statements by saying virtually nobody was affected. Amid a surge in new cases globally, British Prime Minister Boris Johnson announced new restrictions aimed at curbing the virus’s spread, after the U.K.’s chief medical officers raised the nation’s COVID-19 alert level to four from three, as the Associated Press reported. The restrictions include closing pubs, bars and other venues by 10 p.m., and imposing stiff fines to those who disobey quarantine rules. The U.K. isn’t the only European country seeing a spike in cases, as official figures from Russia on Tuesday showed new cases increase by 6,215 in 24 hours, a 20% increase since the start of the month, according to the New York Times. Meanwhile, daily cases in Spain and France rose to more than 13,000. That pales in comparison with the U.S., however, which saw 54,874 new cases on Monday, and at least 428 deaths. The new case tally is 31% above the average of 41,812 cases a day over the past week, which was a 7% increase from the average two weeks earlier, New York Times data show. The total U.S. case tally rose to 6,875,085 while the death toll reached 200,284, according to data aggregated by Johns Hopkins University, both by far the highest numbers in the world. Globally, cases grew to 31,424,898 and deaths rose to 966,776. New York Times President Trump contradicted facts and himself, by saying in a rally in Ohio that the coronavirus affects “virtually nobody,” and really only affects elderly people, and elderly people with other health problems. He said in some states, where there have been thousands affected by the coronavirus, it affected “nobody young.” According to the American Academy of Pediatrics, 587,948 total children have tested positive for COVID-19 as of Sept. 17, representing 10.3% of total cases at the time. In the two weeks to Sept. 17, there were 74,553 new child cases reported, a 15% increase over the previous two-week period. And in states reporting, children represented 0.5% to 3.7% of total reported hospitalizations, and children represented 0.0% to 0.33% of all COVID-19 deaths. And in an interview with journalist Bob Woodward released earlier this month, Trump acknowledged that the virus didn’t just affect old people, that there were “plenty of young people” affected. He responded to a backlash over his playing down of the virus by saying he didn’t want to create a panic. Don’t miss: Trump knew the coronavirus was ‘deadly stuff’ but wanted to ‘play it down,’ according to Woodward book. Trump had also reportedly said in March that if his administration can keep the COVID-19 death toll to 100,000, it will have done a “very good job.” The stock market was headed for a higher close, with the Dow Jones Industrial Average DJIA, +0.56% rising 87 points, or 0.3%, in afternoon trading, to put it on course for the first gain in four session, while the S&P 500 index SPX, +0.87% gained 0.7% and the Nasdaq Composite COMP, +1.39% climbed 1.2% and were set to snap four-day losing streaks. See Market Snapshot.In other news: • A Walmart Inc. WMT, +1.00% executive said the company is testing drone deliveries of COVID-19 test collection kits in partnership with Quest Diagnostics Inc. DGX, +0.33% . Quest has received authorization from the Food and Drug Administration during the pandemic for five COVID-19 diagnostic tests. The project will test delivering COVID-19 test collection kits to single-family homes in North Las Vegas and Cheektowaga, New York, located within a mile of a Walmart supercenter next month, according to Tom Ward, Walmart’s SVP of customer product, who wrote a blog post on Tuesday. The people who receive a test kit by drone delivery perform the nasal swab at home and mail it back to Quest. “There’s a lot we can learn from our drone delivery pilots to help determine what roles drones can play in pandemic response, health care delivery, and retail,” he wrote. • Sanofi SNY, +0.89% SAN, +1.20% and GlaxoSmithKline GSK, +1.10% GSK, +1.52% announced Tuesday that the companies have signed agreements with Canada to supply up to 72 million doses of their COVID-19 vaccine, starting in 2021. The companies had initiated a Phase 1/2 study on their vaccine candidate on Sept. 3, and expect first results in early December to support the initiation of a Phase 3 study before the end of the year. The companies said if the data is sufficient, they plan to request regulatory approval in the first half of 2021. “To address a global health crisis of this magnitude, it takes partnerships and we are grateful to Canada for its collaboration, and to [GlaxoSmithKline] for partnering with us to develop a safe and effective vaccine,” said Thomas Triomphe, global head of Sanofi Pasteur. Separately, Moderna Inc. MRNA, +0.09% said Canada has increased its order commitment to 20 million doses of the company’s COVID-19 vaccine candidate, mRNA-1273. Moderna said its Phase 3 study has enrolled more than 75% of its participants. • A federal vaccine advisory committee will put off a vote on recommending who should get the initial doses of any COVID-19 vaccine in the U.S., until the committee learns more about the vaccines that could become available first, according to a report in The Wall Street Journal. The Advisory Committee on Immunization Practices was originally expected to vote on Tuesday, the WSJ report said. Prior discussions at ACIP meetings indicated that a prioritization plan is likely to reserve initial doses for front-line health-care workers, as well as place a high priority on workers in essential industries and people at greatest risk for death. • Olivia Troye, an advisor to Vice President Mike Pence who spent eight months on the Trumps administration’s coronavirus task force, said on “NBC Nightly News” that President Trump was really focused on public image and his personal agenda, rather than the task force’s agenda. Troye said Trump suggested that COVID could be a good thing, because it means he wouldn’t have to shake hands, which he said was gross. Troye left the White House in July, she said so she could tell the truth about what was happening. Trump responded by saying Troye was a disgruntled employee, but he had no idea who she was. • In a virtual speech at the United Nations General Assembly on Tuesday, President Trump blamed China for the coronavirus pandemic and said the U.N. must hold that country accountable. China’s leader Xi Jinping was set to speak later on Tuesday.Latest tallies Within the U.S., there were 27 states in which new cases increased in the past week, compared with 20 states last week, according to JHU data. Meanwhile, there were 28 states in which positivity rates of COVID-19 tests topped the 5% threshold, including 12 states in which the positivity rate was above 10%. The highest positivity rates were 17.4% for South Dakota, 17.0% for Wisconsin and 16.6% for Idaho. The World Health Organization said positivity rates should remain under 5%. While the U.S. led the world in cases and deaths, Brazil has the second highest death toll at 137,272 and third highest case tally at 4,558,040. India is third with 88,935 deaths and second with 5,562,663 cases. Mexico is fourth with 73,697 deaths and seventh with 700,580 cases. The U.K. has 41,951 deaths, the highest death toll in Europe and fifth highest in the world, and 406,053 cases. China, where the illness was first reported late last year, has 90,389 cases and 4,737 fatalities, according to its official numbers. Global recoveries reached 21,546,587, the JHU data show. While the U.S. was first in cases and deaths, it was third in recoveries with 2,615,974, behind Brazil at 3,993,432 and India at 4,497,867."}]}