{"article": [{"url": "https://www.marketwatch.com/story/fitbit-unveils-new-sense-smartwatch-revamps-inspire-and-versa-devices-2020-08-25", "published": 1598346620.0, "headline": "Fitbit unveils new Sense smartwatch, revamps Inspire and Versa devices", "body": "After a sleepy start to the year, Fitbit Inc. is rolling out three new products meant to cater to people who must increasingly exercise at home on their own due to the COVID-19 crisis. The move comes as Fitbit FIT, -0.14% is in the process of being acquired by Alphabet Inc.’s GOOG, +1.97% GOOGL, +1.82% Google, though the deal has come under scrutiny from regulators, particularly in Europe, who are looking into whether the deal would provide Google access to data that could give it an unfair edge over its advertising competitors. Fitbit Chief Executive James Park still expects the deal to close later this year, though he told MarketWatch that the company’s traction in devices and services gives it a “strong foundation” whether the company is independent or part of Google. Fitbit announced Tuesday that it’s launching a new smartwatch, the Sense, which places heavy emphasis on stress-management capabilities in addition to other health features. The company is also introducing revamped versions of its Versa smartwatch and Inspire fitness tracker. The Fitbit Sense, which will sell for $329.95, features an electrodermal activity (EDA) sensor that measures electrical changes in sweat levels when users put their palms over the watch face. The company says that these readings can give users a sense of their stress levels and help them manage stress in conjunction with guided digital meditation sessions offered by Fitbit. The Sense also has Fitbit’s “new PurePulse 2.0” heart-rate technology, which the company says merges a new “multi-path heart rate sensor” with an updated algorithm. This allows for personalized alerts when a user’s heart rate gets too low or too high. In addition, the Sense comes with a skin-temperature sensor that can detect potential signs of fever. The device is meant to offer a “holistic view of health,” according to Park, which is something he said that people “have really been looking for” during the pandemic. In particular, he expects there will be interest in the stress-management features, given that some people have experienced emotional health effects from limited contact with their social circles. The Versa 3, which will sell for $229.95, comes with the option to use Google Assistant voice technology, whereas the previous Versa model only offered Amazon.com Inc.’s AMZN, +3.01% Alexa built into the device. The Versa 3 will have a built-in microphone and speaker for voice calls as well as the company’s new heart-rate technology. Both the Versa 3 and Sense have six-plus days of battery life, according to Fitbit’s release. They will work with the same charger and the same accessories, which include watchbands from designers Pendleton and Victor Glemaud. “For all this technology to really impact people, they have to wear the device and love wearing it,” Park said. “We’re taking a lot of medical-grade technology and bringing it into the consumer space, but people aren’t excited to wear medical devices.” For him, that’s why Fitbit has to “think from more of a consumer and fashion perspective rather than a health and medical-device perspective.” Fitbit’s Inspire 2 tracker comes with heart-rate tracking and marks an upgrade from its predecessors with 10 days of battery life, which Fitbit says is the longest of any of its devices. The tracker also will have a brighter screen and support the company’s Active Zone Minutes metric, a personalized gauge of activity level that looks at a user’s heart rate. The Inspire 2 device will sell for $99.95 and comes with a free one-year trial of Fitbit Premium, the company’s subscription offering that lets users access virtual workouts and see more detailed breakdowns of their health data. “Rather than keep lowering the price of the hardware, we thought bundling with software would be of benefit to users,” Park said. Fitbit’s original Inspire HR device sold for $99.95 and offered just a three-month trial of Premium as of Monday evening. Park told MarketWatch that before the pandemic, Fitbit had been offering one-week trials of Premium but lengthened that period to 90 days given that more people were looking to engage in workouts on their own amid gym closures. The company disclosed earlier in August that it has surpassed half a million paid Premium subscribers. The Premium subscription sells for $9.99 a month. The Sense watch will come with a six-month trial of Premium, and Fitbit says that all Premium users will have access to a new health dashboard tracking more of their health metrics over time. Park told MarketWatch that the fall launch period is crucial not just because of the upcoming holiday season, but also because the COVID-19 crisis has more people working out independently. In California, people “can’t even go outside” due to wildfires, Park said, so “solutions like Fitbit are more important to people during this time period.” Read: Apple patents reveal ambitions in augmented reality and more The company has also held discussions with colleges about using the new Inspire 2 device as a way to monitor student and faculty health in conjunction with traditional testing, according to Park. There’s been “a lot of interest” but the discussions “are still early,” he said. With the fall launch, Fitbit has a bigger array of new products than it had earlier in the year. The company reported a 30% drop in devices sold for the June quarter, which it said reflected the launch of only one new product in the first half of 2020 compared with four in the first half of 2019. Fitbit shares have lost about 2% over the past three months as the S&P 500 SPX, +0.87% has risen 16%."}]}