{"article": [{"url": "https://www.marketwatch.com/story/i-tried-walking-more-than-three-blocks-paying-the-price-with-chest-pains-and-crippling-fatigue-one-womans-long-recovery-from-covid-19-2020-08-24", "published": 1599060740.0, "headline": "â\u0080\u0098I tried walking more than 3 blocks, paying the price with chest pains and crippling fatigueâ\u0080\u0099: One womanâ\u0080\u0099s long-haul recovery from COVID-19", "body": "New York City â\u0080\u0094 Today is day 141. Iâ\u0080\u0099ll save you doing the math: Day 1 was April 3. It was a Friday, a month before my 46th birthday when the doctor at my local walk-in clinic told me to consider this Day 1 of COVID. Like everyone else in New York, I was already quarantining and my wife was just getting over the virus, though I hadnâ\u0080\u0099t been overly concerned about getting it myself. The doctorâ\u0080\u0099s last words to me were to expect a couple of rough weeks ahead â\u0080\u0094 sheâ\u0080\u0099d seen it hit runners extra hard. Sometimes, I feel embarrassed calling myself a runner â\u0080\u0094 Iâ\u0080\u0099ve never done a marathon and I didnâ\u0080\u0099t discover my love of running until my 30s. But for over a decade, Iâ\u0080\u0099ve been running five or six miles several times a week. Pre-COVID me could run up the steps from Riverside Park to street level without a problem and do a decent time in a 10-kilometer race. Pre-COVID me did not get short of breath sitting on the couch as I had done the night before. For the next two weeks, running was the farthest thing from my mind. Navigating the journey from the bed to the couch so my wife could tackle the sweat-drenched sheets was as much as I could handle. My fever bounced around 102, refusing to come down even with Tylenol. My doctor put me on hydroxychloroquine â\u0080\u0094 a drug that has since been discredited by many in the medical community as an effective treatment for coronavirus â\u0080\u0094 and texted several times a day, telling me if my blood oxygen fell lower, I would have to go to the ER. Related: Another warning from the 1918 flu for COVID-19: â\u0080\u0098Survival does not mean that individuals fully recoveredâ\u0080\u0099 Yvonne Cassidy: â\u0080\u0098The doctorâ\u0080\u0099s last words to me were to expect a couple of rough weeks ahead â\u0080\u0094 sheâ\u0080\u0099d seen it hit runners extra hard.â\u0080\u0099 â\u0080\u0098Day 14: A chest X-ray revealed secondary pneumoniaâ\u0080\u0099 Back at the walk-in clinic on Day 14, a chest X-ray revealed secondary pneumonia. My wife and I are the same age and neither with underlying conditions. Her COVID presented as body aches, nausea and fatigue. We had been dealt totally different versions of this chameleon virus. The day the fever broke was a miracle. I woke naturally with a clear-ish mind. The sheets were dry, the thought of food was not repulsive. The thermometer confirmed what I already knew and I felt elated â\u0080\u0094 I was cured! It lasted quite a while â\u0080\u0094 the elation â\u0080\u0094 and I even wrote about my experience. That my energy levels were still on the floor three weeks later, that I still needed my inhaler was to be expected. I had to be patient. Patience is not my strong suit and around Day 40 â\u0080\u0094 frustrated with sticking to the three-block walking limit suggested by my doctor â\u0080\u0094 I decided to make the jump to six. But three blocks from home, panic set in â\u0080\u0094 my body had hit a wall, I would never make it back. I did, of course, shuffling, sitting, shuffling again. Runners of all ages loped by me and I hated them all. Over the next few weeks, I tried increasing my walking distance, every time paying the price with chest pains, breathlessness and a crippling fatigue. My wife told me I was doing too much, that I looked like a ghost after these excursions. But it was past Day 50, coming towards the end of May. Over a disjointed telehealth call that dropped three times I tried to explain my symptoms to my doctor through my iPhone screen. He told me heâ\u0080\u0099d get me in to see him as soon as in-person visits started again. Looking back, those days â\u0080\u0094 in the 60s â\u0080\u0094 were the worst, when the fear that I might never get better really started to take hold. By then, Iâ\u0080\u0099d gotten my life back â\u0080\u0094 I was working from home and, on a good day, I could walk 10, even 12 blocks. But the trade-off was a fatigue that kept me couch-bound for hours, intermittent chest pains and the need for an inhaler. My days set aside for writing became recuperation days and my novel remained untouched. Popping out to get something from the shop, making dinner, even talking on the phone were activities that were out of reach. Sure, I had my life back, but it wasnâ\u0080\u0099t my life. It was someone elseâ\u0080\u0099s life. At least, that is how it felt. Also see:Johns Hopkins scientists examining weird side effects of COVID-19 suggest one way coronavirus â\u0080\u0098gains a foothold in the bodyâ\u0080\u0099 Yvonne Cassidy: â\u0080\u0098Over a disjointed telehealth call that dropped three times I tried to explain my symptoms to my doctor through my iPhone screen.â\u0080\u0099 â\u0080\u0098Day 68: I read my doctor a list of my symptomsâ\u0080\u0099 On Day 68, I read my doctor a list of my symptoms. And of all the tests and medical information he gave me that day, the most important thing I learned was that many of his younger patients had the same lingering symptoms I had. Until that point, as far as I knew, there were only three types of COVID: The mild version, the version that put you in hospital and the version that killed you. I didnâ\u0080\u0099t know there were others like me, stuck on a post-COVID plateau, not sick anymore, but not better either. It turned out we were a group who had a name: We were COVID long-haulers. The Mayo Clinic and medical journals had published pieces about us. We had support groups on social media. We even had a hashtag. We were frustrated and afraid. When people asked us if we were feeling better, we mostly said, â\u0080\u009cYes,â\u0080\u009d because anything else was too complicated. Those days that followed my doctorâ\u0080\u0099s appointment marked a turning point of sorts. Donâ\u0080\u0099t get me wrong, the 70s and 80s were no picnic and the 90s had some real challenges too. Even earlier today â\u0080\u0094 midway through this piece â\u0080\u0094 I had to take a nap. Pre-COVID me was not a napper. But as with anything difficult Iâ\u0080\u0099ve ever faced, knowing that Iâ\u0080\u0099m not alone and being able to share and listen to others has been a huge part not only of my healing, but of my acceptance of the impact of this virus. With my doctorâ\u0080\u0099s guidance I introduced a very slow five-minute jog into my already slow walking schedule. The first time I did it, my chest burned and I doubled over, hands on knees, gasping for breath. But there was something about knowing these symptoms were to be expected and not feared that changed my attitude, something about scheduling time to recover in advance that helped me not to resist it. In the brief weeks before 2020 became â\u0080\u009c2020â\u0080\u009d I had toyed with training for a marathon. Since day 68, Iâ\u0080\u0099ve applied the same single-mindedness of purpose to my physical recovery as I imagine I would have to that kind of training. Except the goal isnâ\u0080\u0099t 26 miles. Todayâ\u0080\u0099s goal was 30 minutes. I know I am one of the lucky ones. I canâ\u0080\u0099t run as far or as fast as before but I know others who would love to be where I am. And one day, I hope to be fully back to my pre-COVID self. Iâ\u0080\u0099ll keep counting until I get there. Yvonne Cassidy is the published author of four novels including â\u0080\u009cThe Other Boyâ\u0080\u009d and â\u0080\u009cIâ\u0080\u0099m Right Here.â\u0080\u009d She lives in New York City with her wife Danielle. This essay is part of a MarketWatch series, â\u0080\u0098Dispatches from a pandemic.â\u0080\u0099 Yvonne Cassidy: â\u0080\u0098I didnâ\u0080\u0099t know there were others like me, stuck on a post-COVID plateau, not sick anymore, but not better either. It turned out we were a group who had a name: We were COVID long-haulers.â\u0080\u0099"}]}