{"article": [{"url": "https://www.marketwatch.com/story/new-york-culture-creaks-back-to-life-covid-style-2020-07-17", "published": 1594990460.0, "headline": "New York culture creaks back to life, COVID-style", "body": "It was fun while it lasted. But New York isn’t New Orleans, and the go-cup is gone. The drinkers up here just couldn’t handle it, turning city sidewalks into raucous block parties, forgetting their masks, forgetting their manners, forgetting the six-feet rule, and most of all, forgetting how hard everyone has worked for the past four months to tame the deadly pandemic and turn this former hot spot into a cool zone. What, and have a bunch of sloppy drunks make the virus explode again? Not as long as Andrew Cuomo is still in the governor’s office. Nobody wants a second wave of COVID-19, least of all the man who navigated the state out of the first one, however imperfectly. “We are having issues of compliance, especially in New York City, especially around bars and restaurants,” Cuomo said from Albany late Thursday, as he weighed whether to proceed with the Phase 4 reopening currently set for Monday. “I am going to limit it if we do it,” he said. “Only outdoor activities, which means malls don’t open and cultural institutions can open but only outdoors. No indoor activities.” And then there are the bars and restaurants, fighting desperately to stay alive without infecting the people who patronize them. “What you see in New York City is these outdoor block parties selling alcohol. And you have large congregations. That is not what we anticipated. We have to be careful about that. We are going to add additional regulations.” The upshot: No more walk-up beer, wine or cocktails. No booze without food. From now on, if you want to get sloshed in New York City, then plop into a chair at a sidewalk table and order something to eat. And for establishments that flagrantly violate the new regs—oh, the State Liquor Authority has a special deal for you. It goes by the name Three Strikes and You’re Closed. Such are the New York culture wars of today. Also read: You can sip a canned cocktail and save the bees at the same time High, low and in between, almost all the things that make New York exciting are closed, canceled, suspended or being live-streamed from empty venues. The comedy clubs are dark. The live-music joints are quiet. The nightclubs are ancient memories. Thankfully, the entertainment news isn’t entirely bleak. Opening day for the Yankees and Mets is set for next week. Playing in April’s usual position is July. The Brooklyn Nets are sealed in a bubble at Disney World DIS, +1.53% , practicing for nobody-quite-knows-what. That still puts them ahead of their crosstown cousins, the Knicks, who are in the NBA equivalent of the witness protection program. But don’t hold your breath on Broadway. It’s done for the year. See: Closed attractions and travel restrictions put New York City’s $70 billion tourism industry on hold indefinitely “We’ll be back, and we have so many more stories to tell,” Broadway League president Charlotte St. Martin said valiantly, trying to put the best possible spin on things. The lights will brighten again, she promised, “as soon as it’s safe to do so,” but under no circumstances before Jan. 3. The Metropolitan Museum of Art announced this week that the doors will reopen to visitors Thursdays through Mondays starting on Aug. 29. “The safety of our staff and visitors remains our greatest concern,” said Daniel Weiss, the Met’s president and CEO, issuing the caveat that now precedes every such announcement. Then, with appropriate passion, Weiss made the case for why the Met’s reopening is so vital to New York. “The museum can serve as a reminder of the power of the human spirit and the capacity of art to bring comfort, inspire resilience, and help us better understand each other and the world around us.” Who says we can’t use all of that just about now? Still, Cuomo did not sound overly impressed when he heard about the museum’s big announcement—and not the least bit bound by it. “What’s gonna happen Aug. 29?” he asked. “I don’t know. Nobody knows. I think they can plan to reopen, and then we’ll see what the facts say.” To be fair, the Met has an easier path than Broadway does — and not just because some of the ceilings are so high the building might as well be considered outdoors. Read: New York City’s 4,000 nail salons face uphill battle after reopening Social distancing is a whole lot easier in a museum than in a theater, and the Met’s economics are far more forgiving. For one thing, there’s the museum’s $3.6 billion endowment. For another, the paintings and sculptures are on duty 24-7 whether the patrons show up or not. Here’s hoping they can all reopen more quickly than New Yorkers expect them to. Just don’t try prowling the galleries with an open container in hand. Ellis Henican is an author based in New York City and a former newspaper columnist."}]}