{"article": [{"url": "https://www.marketwatch.com/story/fed-wont-be-happy-with-how-the-economy-is-performing-but-is-not-perturbed-enough-to-take-aggressive-action-2020-07-28", "published": 1596012860.0, "headline": "Fed wonâ\u0080\u0099t be happy with how the economy is performing, but is holding off on next bazooka for now", "body": "The Federal Reserve wonâ\u0080\u0099t be happy with what it sees when it looks at the economic outlook, but isnâ\u0080\u0099t ready to pull the trigger on any major policy changes, at least not yet. â\u0080\u009cThe Fed is not ready to make radical changes or aggressive changes here,â\u0080\u009d said Ethan Harris, the head of global economic research at Bank of America, in an interview. Fed officials will gather for the second day of virtual meeting on Wednesday. Little is expected to be announced publicly beyond continued emphasis on a dovish policy stance, said Robert Perli, head of global policy at Cornerstone Macro. There is talk that the Fed is preparing to publicly pledge to keep rates at zero until inflation reaches or moves above its 2% target. But thatâ\u0080\u0099s pretty thin gruel and no surprise to Fed watchers, who widely think the Fed has had that policy in place since early last year. Fed Chairman Jerome Powell will hold a press conference at 2:30 p.m.. At the beginning of the crisis in mid-March, Fed officials said July 1 might be a good time to assess the initial health of the economy after the blow from the coronavirus pandemic. So what is the Fed seeing? After two months of signs of a rebound in May and June, real-time data suggests the U.S. economy is stalling. There has been an upsurge in COVID-19 infections, and that appears to be weighing on growth. It is dawning on everyone that â\u0080\u009cto constrain the virus, in addition to masks, you have to maintain some limits on economic activity,â\u0080\u009d said Avery Shenfeld, an economist at CIBC. A substantially weaker economic outcome is just about as likely as their â\u0080\u009cbase-caseâ\u0080\u009d of a slow and steadily improving economy, according to the Fed staff. Fed policy has already been forced into a situation where itâ\u0080\u0099s nursing along some companies and businesses that in normal times would have gone under. Market discipline has evaporated. In addition, a big chunk of the population is on financial life-support from the government, Harris noted. â\u0080\u009cAt least for the duration of this crisis, weâ\u0080\u0099re basically a socialist economy,â\u0080\u009d he said. Fiscal policy at the moment is more important than more dovish talk from the Fed. What would get the Fed off the sidelines? Evidence that it is losing the battle against inflation, Harris said. While thatâ\u0080\u0099s not apparent yet, Harris thinks itâ\u0080\u0099s a matter of time. The Fedâ\u0080\u0099s best remaining policy option under these circumstances would be to peg the interest rates on the U.S. 10-year Treasury note, Harris said. This is called â\u0080\u009cyield-curve control.â\u0080\u009d â\u0080\u009cI think there is a good chance that it comes at some point, either in the fall if the economy doesnâ\u0080\u0099t pick up, or some point down the road,â\u0080\u009d Harris said. â\u0080\u009cYield-curve control is much easier than trying to fiddle around with QE, and is the one macro tool that would show a significant step forward,â\u0080\u009d he said. James Sweeney, chief economist for Credit Suisse, agreed: â\u0080\u009cYield-curve control is the next big bazooka to be fired at a time when youâ\u0080\u0099re in severe market and growing stress. So hopefully it doesnâ\u0080\u0099t show up. But thatâ\u0080\u0099s the big option.â\u0080\u009d Fed officials have been talking about yield-curve control over the past few weeks, but mainly at the short end of the yield curve. Pegging shorter-term rates would be inconsequential, Harris said. Doing so at the longer end is a more serious step, but that is where thereâ\u0080\u0099s room to push down rates, Harris noted. Harris thinks the Fed can peg the 10-year in a low-rate environment. â\u0080\u009cNo one is going to challenge the Fed on that,â\u0080\u009d he said. If the economy is still wounded, then the next tool would be for the central bank to engineer direct purchases of equities, although the market is doing fine without it, Harris said. That would set off a firestorm of criticism, though that isnâ\u0080\u0099t likely to deter the Fed. â\u0080\u009cAll of these things seem kind of crazy until youâ\u0080\u0099re in a position that you have nothing left,â\u0080\u009d Harris said. â\u0080\u009cI think what happens to every central bank when they start to get into the bottom of their tool-kit, they start holding their nose and introducing things. They realize that to do nothing, or admit that you could do nothing, is even worse than adopting a policy that is unpopular and may not even be that effective,â\u0080\u009d he said. The 10-year Treasury yield TMUBMUSD10Y, 0.777% Â has recently been stuck in a trading range close between 0.6% and 0.9% over the past few months. Thatâ\u0080\u0099s not far from its 52-week low of 0.501 hit at the start of the pandemic in mid-March. â\u0080\u009cThe market is behaving as if yield curve control is already implemented. It serves the Fedâ\u0080\u0099s objectives. Thatâ\u0080\u0099s a good thing,â\u0080\u009d Sweeney said."}]}