{"article": [{"url": "https://www.marketwatch.com/story/will-covid-19-force-older-workers-to-retire-2020-07-08", "published": 1594227560.0, "headline": "Will COVID-19 force older workers to retire?", "body": "Reporters repeatedly ask whether COVID-19 will lead to a spike in retirement among older workers. Older workers will face both an economy with high levels of unemployment and a virus that puts them more at risk than their younger counterparts. Thus, they might voluntarily withdraw if unable to work at home or if they wade into the labor market only to find no jobs available. Retirements did increase during the Great Recession. The percentage of 62-years-olds claiming Social Security had been trending downward (see Figure 1), declining from 58.9% in 1995 to 42.2% in 2008, the eve of the economic crisis. This downward trend reflected improvements in health, education, and life expectancy, a shift from defined benefit to 401(k) plans, a drop in retiree health insurance coverage, and a decline in the physical nature of jobs. The Great Recession produced a temporary reversal in that downward trend, as the take-up of Social Security at age 62 jumped from 42.2% in 2007 to 46.9% in 2009 and then dropped back down to trend. I would expect this pattern to repeat itself in the wake of COVID-19. In fact, some very early data show that an uptick in retirements is already under way. The data come from the monthly Current Population Survey, which is used as the basis for the unemployment report. The survey’s rotating interview pattern makes it possible to link households across time. Specifically, households are interviewed for four consecutive months, then not interviewed for eight months, then interviewed again for another four consecutive months before exiting the survey. This pattern allows us to see the labor force transition for a subset of households between April 2019 and April 2020. As a basis of comparison, we also looked at the transitions of a different subset of households between April 2018 and April 2019. The results are shown in Tables 1a and 1b. Let’s start with those ages 65+. In April 2020, 54.2% of those who had been employed in April 2019 were still working and 25.5% had retired. The rest fell into one of the three other categories. In April 2019, 75.7% of those 65+ who had been working in April 2018 were still working and 18.5% had retired. Thus, the percentage of previous workers retired had already increased by 7 percentage points in April 2020 – only a month into the shutdown. The pattern is less dramatic for those ages 55 to 64, but with the surge in unemployment for this group, more retirements are likely. In short, a surge in retirements seems inevitable. The good news is that Social Security serves as a safety net for older workers who cannot find employment. The bad news is that claiming at 62 locks recipients into low levels of monthly benefits — benefits claimed at 70 are 77% higher than those claimed at 62. My hope is that once the economy recovers, the trend toward working longer will resume."}]}