{"article": [{"url": "https://www.marketwatch.com/story/as-trump-calls-for-supporters-to-watch-very-carefully-at-the-polls-what-is-a-poll-watcher-and-who-gets-to-be-one-2020-10-02", "published": 1602236960.0, "headline": "What is a â\u0080\u0098poll watcherâ\u0080\u0099 and who gets to be one on Election Day?", "body": "The first presidential debate was full of cross talk, incomplete answers and unfinished statements, but President Donald Trump made one thing clear: he wants his backers keeping a close eye on polling places. â\u0080\u009cIâ\u0080\u0099m urging my supporters to go into the polls and watch very carefully because thatâ\u0080\u0099s what has to happen,â\u0080\u009d he said. More than a week earlier, the presidentâ\u0080\u0099s son, Donald Trump, Jr. asked in a campaign video for re-election supporters to join the â\u0080\u009carmy for Trumpâ\u0080\u0099s election security operation.â\u0080\u009d â\u0080\u009cWe need you to help us watch them, not just on Election Day, but also during early voting and at the counting boards,â\u0080\u009d Trump, Jr. said. State laws across the country allow designated poll watchers at voting sites. They are typically appointed by candidates, political parties or political action committees, and their primary purpose â\u0080\u009cis to ensure that their party has a fair chance of winning an election,â\u0080\u009d according to the National Conference of State Legislatures. In some states, poll watchers are allowed to challenge a voterâ\u0080\u0099s eligibility to vote. Trumpâ\u0080\u0099s critics, like Pennsylvania Attorney Josh Shapiro, said the presidentâ\u0080\u0099s debate comments were a coded call for crowds to scare away specific groups of voters. â\u0080\u009cThis is about bringing people into Black and brown communities to try and intimidate them,â\u0080\u009d Shapiro, a Democrat in a swing state, said Wednesday on MSNBC. Steve Simon, the Secretary of State in Minnesota, another swing state, told Axios he had logistical worries. â\u0080\u009cI fear his supporters will take it upon themselves to mobilize large numbers to go to the pollsâ\u0080\u009d in order to watch operations, he said. â\u0080\u009cThe Presidentâ\u0080\u0099s Campaign, like all Democrat and Republican campaigns, are recruiting election workers and observers to help out on Election Day,â\u0080\u009d said Justin Clark, deputy campaign manager, in Trumpâ\u0080\u0099s re-election bid. â\u0080\u009cThis isnâ\u0080\u0099t about intimidation but about transparency in the election process. Anything to the contrary is just demagoguery.â\u0080\u009d So whatâ\u0080\u0099s bona fide â\u0080\u009cpoll watchingâ\u0080\u009d and who gets to do it? Hereâ\u0080\u0099s a look:The difference between poll workers and poll watchers Poll workers are volunteers performing roles such as checking in voters, directing them to the ballot booth and generally trying to make Election Day operations run smoothly. Poll watchers are typically political party or candidate appointees who serve as the eyes and ears to ensure there are no problems at their assigned polling place. Organizations for or against ballot questions can also appoint poll watchers, according to the National Conference of State Legislatures. The same organization notes many states, but not all, say parties only get one designated watcher at a site. Poll workers are usually paid (and the pay can reach $350 and higher). If poll watchers make money, election law experts say thatâ\u0080\u0099s between the watcher and the political party or candidateâ\u0080\u0099s group that appoints them. “ A poll watcher could be watching out for complaints about voting machine problems, turned away voters or too many ballots handed to one voter. But varying state laws govern what they can say and do about any perceived problem. ” The designated watchers can be on the lookout for things like complaints about voting machine glitches, voters being turned away or too many ballots being handed to a voter. In some states, they are allowed to challenge someoneâ\u0080\u0099s attempt to vote, perhaps by raising questions about they are a local resident. Varying state laws set different rules on what watchers can do about perceived problems, who they can talk to and even where they can be inside the polling place so as not to be an interference. In many states, names of appointed poll watchers must be sent over to officials ahead of Election Day so poll workers know who to expect will be coming in as a designated poll watcher. “ â\u0080\u0098The role of the poll watcher is a really valuable and important part of the democratic processâ\u0080\u0099 ... But without rules, â\u0080\u0098transparency can get really out of hand, really quickly.â\u0080\u0099 ” Laws allow poll watchers so the public has â\u0080\u009cstructured transparency,â\u0080\u009d according to Rebecca Green, an election law professor at the College of William & Mary. This lets outside observers make sure voting rules are followed, all while providing an orderly election, Green said. â\u0080\u009cThe role of the poll watcher is a really valuable and important part of the democratic process,â\u0080\u009d she said. But without rules in place, â\u0080\u009ctransparency can get really out of hand, really quickly.â\u0080\u009d Can I just show up and watch whatâ\u0080\u0099s happening at a poll site? No you canâ\u0080\u0099t. First off, thereâ\u0080\u0099s a need for an orderly process, said Steven Huefner, an election law professor at Ohio State University. But itâ\u0080\u0099s also related to laws barring political demonstrations too close to polling sites and laws forbidding party materials inside polling sites, he said. â\u0080\u009cWe have a lot of controls on polling places that are intended to protect each voterâ\u0080\u0099s ability to cast a free and independent vote,â\u0080\u009d Huefner said. Actually, Wisconsinâ\u0080\u0099s laws let any member of the public show up at a polling site to be a poll watcher, Green noted. But the law gives election officials the power to cordon them to a certain spot and throw them out if they are disruptive. â\u0080\u009cWisconsin is an outlier in its openness,â\u0080\u009d Green said. Wisconsin happens to be a 2020 battle ground state. Trump won the state in 2016. Polls aggregated at RealClearPolitics.com show he is currently trailing Biden in the state. At the debate, Trump said there was â\u0080\u009ca big problemâ\u0080\u009d in Philadelphia. â\u0080\u009cIn Philadelphia, they went into watch, they were called poll watchers, a very safe, very nice thing. They were thrown out. They werenâ\u0080\u0099t allowed to watch. You know why? Because bad things happen in Philadelphia,â\u0080\u009d Trump said. Earlier that day, the city opened satellite election offices so people could request, fill out and submit mail ballots. The offices, however, arenâ\u0080\u0099t traditional polling sites and the state of Pennsylvania only allows poll observation on Election Day, according to the Philadelphia Inquirer. See also:4 common mistakes that could get your mail-in ballot rejected â\u0080\u0094 and how to make sure your vote is counted The state hasnâ\u0080\u0099t any certified poll watchers, but it will before Nov. 3, the media outlet noted. Forty states have a formal accreditation process for poll watchers, according to the National Conference on State Legislatures. In one instance, a woman arrived at a Philadelphia satellite office, reportedly saying she was a poll watcher for the Trump campaign. An office supervisor said she could not be inside unless she wanted to personally use the officeâ\u0080\u0099s service, the Inquirer said. The Trump campaign on Thursday sued the city over its rules against poll watchers at the satellite offices, the Associated Press reported. In one election, a â\u0080\u0098national ballot security task forceâ\u0080\u0099 patrolled polling sites Poll watching laws arenâ\u0080\u0099t new, but the 2020 race has thrust them into a new context. After a 1981 New Jersey gubernatorial race, the Republican National Committee and the stateâ\u0080\u0099s GOP committee entered into a consent decree in federal court under which they agreed let a judge review any â\u0080\u009cballot securityâ\u0080\u009d initiatives. The 1982 consent decree followed a close Republican win where members of a â\u0080\u009cnational ballot security task forceâ\u0080\u009d linked to the GOP committees demanded voter registration cards from minority voters and chased some voters from the polls. The decree lapsed in 2018. The lengthy period before the expiration â\u0080\u009cought to have given everybody ample time to develop appropriate patterns and practices, and habits for how we watch the polls. My hope is we donâ\u0080\u0099t see a return of intimidation tactics.â\u0080\u009d Without the decree in effect, Huefner said he is â\u0080\u009ca little more nervous about what might occur.â\u0080\u009d"}]}