{"article": [{"url": "https://www.marketwatch.com/story/bidens-selection-of-harris-is-modestly-positive-for-cannabis-industry-but-negative-for-financial-stocks-analysts-say-2020-08-12", "published": 1597313360.0, "headline": "Bidenâ\u0080\u0099s selection of Harris is â\u0080\u0098modestly positiveâ\u0080\u0099 for cannabis industry, but â\u0080\u0098negative for financial stocks,â\u0080\u0099 analysts say", "body": "In the wake of Joe Bidenâ\u0080\u0099s selection of Kamala Harris as his running mate, Wall Street analysts are offering predictions on what the pick could mean for some key industries if the Democratic duo wins the November election. The choice by Biden as he aims to oust President Donald Trump from the White House is viewed as likely to affect the cannabis industry MJ, +0.26% Â and the financial sector XLF, +0.11%, as well as potentially energy XLE, -1.59% Â and Big Tech XLK, +1.52% Â . The presumptive Democratic presidential nomineeâ\u0080\u0099s decision on his vice president is â\u0080\u009cmodestly positive for cannabis as she is an advocate for legalization,â\u0080\u009d said Jaret Seiberg, an analyst at Cowen Washington Research Group, in a note. Harris, Californiaâ\u0080\u0099s junior senator, is a sponsor of legislation to decriminalize marijuana at the federal level â\u0080\u0094 the Marijuana Opportunity Reinvestment and Expungement (MORE) Act, Seiberg added. The Democratic-controlled House Judiciary Committee passed the MORE Act in November, but the bill hasnâ\u0080\u0099t gotten anywhere in the Republican-run Senate. â\u0080\u009cSo she would be a voice for legalization within the Biden administration if he wins in November. That is positive, but Team Biden already was going to sign whatever legalization measure Congress could deliver,â\u0080\u009d Seiberg wrote. The Cowen analyst said his shop also views Bidenâ\u0080\u0099s pick of Harris as â\u0080\u009cmodestly negative for financials,â\u0080\u009d noting she opposed a 2018 bank deregulation law. In addition, Seiberg said Harris is likely to advocate for increased enforcement actions by the Consumer Financial Protection Bureau, but a Biden administration already had been on track â\u0080\u009cseek to boost CFPB enforcement.â\u0080\u009d Related:Kamala Harris on student-loan forgiveness, Medicare, universal basic income, credit scores â\u0080\u0094 and a tax on trading stocks KBW analyst Brian Gardner offered a similar take on what Bidenâ\u0080\u0099s VP pick could mean for the financial sector. â\u0080\u009cWe see the selection of Sen. Harris as a negative for financial stocks,â\u0080\u009d Gardner said in a note, but he added that his shop does not think overall that Bidenâ\u0080\u0099s announcement â\u0080\u009cwill have a material impact on the markets â\u0080\u0094 vice presidential candidates rarely impact the outcome of an election or a presidentâ\u0080\u0099s agenda.â\u0080\u009d Opinion:Bidenâ\u0080\u0099s pick of Harris wonâ\u0080\u0099t make or break the 2020 election Even so, the analyst said that while Harris â\u0080\u009cdoes not have the same history with the financial sector as Senator Elizabeth Warren,â\u0080\u009d who is known for taking on the sector, KBW had been viewing the California lawmaker as â\u0080\u009camong the more negative possible candidates for financial stocks.â\u0080\u009d Gardner noted that while she was Californiaâ\u0080\u0099s attorney general, Harris â\u0080\u009cwithdrew from national negotiations regarding the foreclosure crisis and later obtained a large settlement for California.â\u0080\u009d He also cited her opposition to the 2018 bank deregulation law, and the fact that during her presidential campaign she â\u0080\u009cproposed a financial transaction tax (FTT) to pay for her Medicare for All plan.â\u0080\u009d â\u0080\u009cThe FTT is a concept that has gained traction among Democrats, and we expect that a Biden administration and congressional Democrats will push for some form of it if they win in November,â\u0080\u009d Gardner wrote. Related:Hereâ\u0080\u0099s how a Biden presidency could hurt financial stocks Other analysts see Harris potentially touching a range of industries. â\u0080\u009cHarris has shown a real interest in civil rights issues as it relates to prisons, consumer finance, student lending, climate change, and housing, as well as big tech privacy issues. Those are issues Biden could be inclined to hand off to Harris, who would work in conjunction with an active executive branch,â\u0080\u009d analysts at Beacon Policy Advisors said in a note. Read more:Kamala Harris is a friend, not foe, of Big Tech She counts as a â\u0080\u009crelatively progressive pick on energy and environment,â\u0080\u009d wrote analysts at Height Capital Markets. â\u0080\u009cShe was an original co-sponsor of the Green New Deal and has a heavy track record on energy and environmental justice dating back to her time as Californiaâ\u0080\u0099s Attorney General. Importantly, Sen. Harris has said that she would end the use of the filibuster in order to pass the Green New Deal,â\u0080\u009d Heightâ\u0080\u0099s team said. Related:As vague as it is, the Green New Deal could have a real impact on Corporate America. Hereâ\u0080\u0099s why The senator â\u0080\u009cnotably oscillatedâ\u0080\u009d on health-care policy during the Democratic presidential primary, initially supporting â\u0080\u009cMedicare for Allâ\u0080\u009d before â\u0080\u009cwalking that support back,â\u0080\u009d the Height analysts added. â\u0080\u009cWe do not believe a Harris Vice Presidency meaningfully changes Bidenâ\u0080\u0099s health care XLV, +0.90% Â agenda.â\u0080\u009d Now read:Donâ\u0080\u0099t buy health-care stocks if Democrats sweep the November elections, these contrarian analysts say Also:What â\u0080\u0098Medicare for Allâ\u0080\u0099 would do to the health-care sector This story was first published on Aug. 12, 2020."}]}