{"article": [{"url": "https://www.marketwatch.com/story/online-sales-double-at-tesco-boosting-profits-as-new-boss-promises-christmas-wont-be-canceled-11602062819", "published": 1602078860.0, "headline": "Online sales double at Tesco, boosting profits as new boss promises a merry Christmas despite coronavirus", "body": "Tesco supermarket store in York, northern England, on March 30, 2020. AFP via Getty Images Shares in Tesco increased 4% on Tuesday, as the supermarket giant posted a 28.7% rise in first-half profit as shoppers bought more food during the pandemic and online sales doubled. An increasing number of customers locked-down due to the coronavirus crisis, and unable to visit favorite restaurants, has been boosting sales at grocers. In the U.S., rival Walmart WMT, +1.00% had posted solid second-quarter earnings back in August, with total revenues growing 5.6%. Tesco TSCO, +1.80%, Britain’s largest grocer, which has outlets across Europe in Hungary, Poland, Slovakia and the Czech Republic, has also seen a change in shopping habits with people buying more items in fewer larger shopping trips in an attempt to avoid unnecessary trips out of the home. Its new chief executive Ken Murphy, who joined from Walgreens Boots Alliance WBA, -1.96% and is just one week into the job, said growth in the half was most marked in online, with sales up 69% and the rate of growth reaching 90% during the second quarter. The firm more than doubled the number of delivery slots from 600,000 to 1.5 million a week during the period. But it noted a large cost in keeping customers and staff safe, having spent £533 million ($688 million) on COVID-related materials, such as personal protective equipment, set to rise to £725 million. Read: Boardroom shuffles become latest coping mechanism for companies battling COVID-19 fallout Tesco, which employs an army of 400,000 shop workers in around 7,000 stores, saw pretax profit rise to £551 million for the 26 weeks to the end of August, from £428 million for the same period the previous year. Half-year revenues were flat at £28 billion. It is one of the few companies still paying a dividend, and has increased the interim shareholder payout by 20.8% to 3.20 pence per share. Speaking on a conference call, Murphy said: “This was a strong first half. I’m really happy with the strategy and the direction of the company.” When asked about the holidays and whether Christmas might be canceled because of coronavirus and restrictions over gathering in large numbers, he said: “We’re convinced that we will have as good a Christmas as possible in the circumstances. I think people will be very keen to celebrate Christmas this year. I think it’s a particularly special time for family and friends.” Read: U.K. Prime Minister Boris Johnson unveils new coronavirus restrictions that could last 6 months — including pub and restaurant curfews Murphy said the sale of Tesco’s businesses in Thailand, Malaysia and Poland are progressing well. Over the past few years, Tesco been scaling back its international operations, having announced an exit from its Fresh & Easy startup in the U.S. in 2013. Murphy said: “There are no plans to move into any new markets. We will keep a watching brief for opportunities, but there is absolutely no strategy at this point in time for geographical expansion.” Last week Walmart also scaled back its foreign footprint, selling a controlling stake in U.K. grocer Asda for £6.8 billion. Read: Walmart Sells U.K. Grocer Asda in $8.7 Billion Deal. Here’s Why It Could Benefit From Further Windfalls. During the period, Tesco settled a dispute with shareholders relating to an alleged fraud dating back to 2014, paying a one-off £93 million charge."}]}