{"article": [{"url": "https://www.marketwatch.com/story/new-york-city-to-set-up-covid-checkpoints-at-bridges-and-tunnels-2020-08-05", "published": 1596651200.0, "headline": "New York City to set up COVID checkpoints at bridges and tunnels", "body": "New York City will set up checkpoints at bridges and tunnels into the five boroughs to help enforce a state-mandated quarantine order for people traveling from high-risk states. “We’ve got 35 states now that have dangerously high infection rates. There’s a lot to be concerned about,” Mayor Bill de Blasio said as he announced the checkpoints on Wednesday. “We have to focus on people coming in from outside.” The state has already roped in airlines and the Port Authority police to ensure passengers arriving through New York’s airports fill out paperwork with their contact and travel information. But both state and local leaders have said there’s a blind spot when it comes to car and bus travel. The four-dozen states subjected to the quarantine order include Rhode Island, Maryland and Washington, D.C., all within easy driving distance of the five boroughs. The city’s decision to double down on the quarantine comes as roughly one-fifth of all recent cases stemmed from travelers from other states, said Dr. Ted Long, head of the city’s test-and-trace operation. The percentage of people tested coming back positive in New York City, formerly the national epicenter of the disease, stood at about 2% on Wednesday. Also read: Student-parents prepare to juggle triple duty of college, work and child care this fall Ramped-up enforcement would also focus on education about resources available to them while in isolation, including free food and medication delivery or even placement at a quarantine hotel, Long said. “We need you to safely separate,” he said. The Sheriff’s Office will coordinate with other law enforcement agencies to run the checkpoints at major bridge and tunnel crossings, such as the Lincoln Tunnel and the George Washington Bridge. Officers will likely carry out random, as opposed to targeted, checks and ask those passengers to fill out the state’s traveler health form, New York City Sheriff Joe Fucito said at Wednesday’s briefing. The mayor’s Public Engagement Unit will also deploy people to stop travelers at Penn Station and the Port Authority starting Thursday. Refusal to fill out the form can result in a $2,000 fine under state law. Fucito suggested the checkpoints could take different forms, depending on car congestion. “We don’t want to back up traffic.” His office, which also leads enforcement efforts among bars and restaurants at night, will likely have greater presence at checkpoints during the day, he added. More New York City news: Urban oases reopen, providing a much-needed escape for shut-in residents The state’s quarantine order requires anyone who’s spent more than 24 hours in one of the restricted states to self-quarantine for two weeks or else face fines and penalties up to $10,000. The rule applies to residents both from out of state and New Yorkers returning from hot spots. Both the city and broader state have managed to contain what was once the most severe outbreak in the country. This week, the city experienced a three-day streak without a single death from COVID-19. Meanwhile, statewide hospitalizations were down to 564, the lowest since mid-March and down from a daily peak of nearly 20,000. Only 0.87% of tests came back positive on Tuesday, among the lowest that figure has been."}]}