{"article": [{"url": "https://www.marketwatch.com/story/slacks-anticompetitive-claim-vs-microsoft-says-the-software-giant-feels-threatened-2020-07-22", "published": 1595442680.0, "headline": "Slack's anticompetitive claim vs. Microsoft says the software giant feels 'threatened'", "body": "Slack Technologies Inc.'s antitrust claim against Microsoft Corp. before the European Commission - days before four major tech company CEOs are to testify before Congress on similar matters - is the latest twist in an industry roiled in debates and investigations over monopolistic business practices. Slack's WORK, +3.36%  complaint, alleging Microsoft MSFT, +2.48%  bundled Teams within its popular Office productivity suite to illegally to gain a competitive advantage, underscores systemic targeting of the San Francisco-based company that represents an \"existential threat\" to Slack, company officials said in a Zoom ZM, +2.89%  videoconference Wednesday morning. By tying Teams to Office for free, Slack charges, Microsoft is \"force installing [Teams] for millions, blocking its removal, and hiding the true cost to enterprise customers.\" \"All we want is fair competition,\" said Slack General Counsel David Schellhase, who is asking the EC to \"referee.\" \"Slack threatens Microsoft's hold on business email, the cornerstone of Office, which means Slack threatens Microsoft's lock on enterprise software.\" The legal challenge, which has been long in the making, could be followed by a similar action in the U.S., he said. Because Slack's complaint is specific in nature, it is unlikely another other company would join its case. Microsoft says it is providing information to the European Commission. \"We created Teams to combine the ability to collaborate with the ability to connect via video, because that's what people want,\" a Microsoft spokesperson said. \"With COVID-19, the market has embraced Teams in record numbers while Slack suffered from its absence of videoconferencing. We're committed to offering customers not only the best of new innovation, but a wide variety of choice in how they purchase and use the product.\" Slack's legal gambit, which comes amid investigations by the Justice Department and Federal Trade Commission into the competitive behavior of four tech giants, bypasses the U.S. for European authorities who have shown little hesitation in levying fines. The EC will review Slack's complaint and decide whether to open a formal investigation. On Monday, the chief executives of Google parent Alphabet Inc. GOOGL, +1.82%  GOOG, +1.97%  , Amazon.com Inc. AMZN, +3.01%  , Apple Inc. AAPL, +1.74%  , and Facebook Inc. FB, +0.26%  are to face questions from the House Judiciary Antitrust Subcommittee. Microsoft, the subject of an epic DOJ antitrust investigation in the 1990s, is not part of the hearing or any government probe. Despite the antitrust claim, Slack Chief Executive Stewart Butterfield has insisted in interviews, including one with MarketWatch, that Teams is not a competitor to Slack. \"If Microsoft is such a competitive threat to Slack as it says, we would not have grown in sales and $1 million customers,\" Butterfield said in April. \"I mean, 44 million is an impressive number, but that is out of 200 million Office 365 customers. That's about a 20% adoption rate.\" Read more: Slack CEO details 'most productive' week in company history, hits back at Microsoft Usage of Microsoft Teams swelled to 75 million in June from 44 million in March. Slack, by comparison, has grown in recent months, to 12.5 million in late March. In a conference call with analysts late Wednesday following Microsoft's fiscal fourth-quarter results, Microsoft CEO Satya Nadella noted that Teams surpassed 5 billion meeting minutes in one day during the quarter, and now boasts 69 accounts with more than 100,000 users. See also: Microsoft reports record revenue to wrap up a record-breaking fiscal year If not for Teams, Slack's growth would be better, Trevor Soames, who has been practicing EU competition and regulatory law for more than 30 years, said in the Zoom meeting. He did not, however, provide specific marketing numbers. Wall Street analysts, however, are skeptical of a strong regulatory response. \"While MSFT has taken a lot of market share, much of this has resulted from 'upgrading' its existing Skype communications software to Teams,\" Mizuho Securities analyst Gregg Moskowitz said in a note Wednesday. \"Since this is an effective replacement for Skype for Business, we believe that MSFT is likely within its rights to offer this 'free' upgrade to its installed base, and that there will presumably be few complaints from European customers, whose rights the EC are charged to protect.\" \"We would be surprised to see WORK initiate a formal complaint in the US, which in our view would have a very low likelihood of success,\" wrote Moskowitz, who maintains a price target of $225 for Microsoft shares and $29 for Slack. Slack's stock, down 4.7% in trading Wednesday, has rallied 38% this year. Microsoft shares, which were flat Wednesday, have climbed 33% in 2020. The Dow Jones Industrial Average DJIA, +0.56%  has slipped 6%."}]}