{"article": [{"url": "https://www.marketwatch.com/story/i-have-4-goals-for-my-money-in-retirement-11595440416", "published": 1595590880.0, "headline": "I have 4 goals for my money in retirement", "body": "New Line Cinema/Courtesy Everett Collection I’m probably a year or two away from regularly tapping my portfolio for income. That prospect—coupled with this year’s market turmoil—has led me to tinker with my investment mix and ponder how I’ll generate cash once I’m retired. One surprising result: I have more in stocks today than I’ve had at any time in the past three years, and I’m thinking of increasing my allocation even further. Since 2014, I’ve thought of myself as semi-retired. I’m working harder than ever, but these days I only take on projects I enjoy. I earn just a third of what I made when I worked on Wall Street and I expect that to dwindle further in the years ahead. That’ll leave me heavily dependent on my financial accounts. Currently, I’m 76% in stocks and 24% in bonds and cash investments. If I figure in the private mortgage I wrote for my daughter—which I consider comparable to a bond investment—the mix is more like 67% stocks and 33% conservative investments. How am I going to take this mix of assets and generate income? I think in terms of four goals. 1. I want income I can’t outlive. The mortgage I wrote for my daughter pays me income every month. Assuming she doesn’t move or refinance, I have another 25 years of checks coming my way. At age 57, this is an income stream I hope to outlive—but I could be wrong. I also want some income I’m guaranteed not to outlive. Research suggests our ability to manage money deteriorates as we age. Research also suggests that retirees with predictable income tend to be happier. Where to get that predictable lifetime income? At the top of my list is Social Security, which I plan to claim at age 70. In addition, I intend to make a series of immediate fixed annuity purchases, possibly starting as early as age 60. By making multiple purchases over 10 years or so, I can buy from multiple insurers—thus limiting my exposure should any one insurer go belly up—and I’ll benefit if interest rates head higher from today’s anemic level. I know many folks hate the idea that they’ll make a big annuity purchase, only to keel over a few months later. That’s why I like the idea of buying gradually. It lowers the stakes associated with each purchase and, by starting to buy at age 60, I’m confident I’ll get at least some income back, even if I do go to an early grave. 2. I want a pool of cash I can count on. As I buy more immediate annuities and once I claim Social Security, I’ll need less cash each year from my portfolio. But for the money I do need to withdraw, I want to be confident it’ll be there. To that end, I’ve taken my already conservative bond portfolio and made it more so. In June, I swapped my intermediate-term inflation-indexed bond fund for a short-term inflation-indexed bond fund, and I sold my short-term corporate fund and replaced it with a short-term government fund. In other words, all my bond money is now in government bonds, and the duration is so short that it’s almost like holding cash investments. All this reflects my evolving view of bonds. They’re no longer a good source of income. How could they be with yields so low? Instead, their sole role is to provide portfolio protection, acting as both a shock absorber and a place from which to draw spending money when stocks are struggling. My goal is to have at least enough in my two short-term government bond funds to cover my next five years of portfolio withdrawals. Right now, I’m above that level. With 24% in bonds and assuming a 4% withdrawal rate, my bond holdings would cover six years of portfolio withdrawals. On top of that, I’m not even drawing on my portfolio today, because I have enough income coming in to cover my living expenses. That makes me wonder whether I should further reduce my bond holdings and invest more in stocks. 3. I want long-run growth. This, of course, is the reason to own stocks. If your goal is healthy long-run inflation-beating investment gains, stocks remain your best bet—and arguably your only one. And remember, even in a low-inflation environment, retirees most assuredly need growth. At 2% a year, inflation will increase our cost of living by 49% after 20 years. Through February and March, I aggressively bought stocks, and then saw my portfolio’s stock allocation jump as the market rebounded. That meant I went from 66% stocks at the Feb. 19 peak to today’s 76%. I readily concede that my current stock allocation will strike some readers as high. But it causes me no sleepless nights. I’m globally diversified and all in index funds, with a tilt toward smaller companies, value stocks and emerging markets. Some parts of the global stock market will undoubtedly struggle in the decades ahead and most active managers will lag behind the market averages. But because I’m indexed and globally diversified—plus I’m over-weighted in some of the stock market’s least loved sectors—I figure the chances that I’ll suffer atrocious long-run performance are modest. 4. I want to help my kids. I have money in a regular taxable account, traditional retirement accounts and Roth accounts. Once retired, I plan to use my traditional retirement accounts to cover my spending needs and to fund my immediate annuity purchases. Meanwhile, I hope to keep both my taxable and Roth accounts intact, and then bequeath them to my kids. My Roth accounts are 100% in stocks, and my taxable account is close to it, so I’m hoping the accounts will notch handsome gains between now and whenever I shuffle off this mortal coil. Congress, alas, has nixed the stretch IRA for most beneficiaries, with the notable exception of a husband or wife. Still, non-spouse beneficiaries have 10 years to empty inherited retirement accounts—which means my children will get 10 years of additional tax-free growth after they inherit my Roths. Meanwhile, my taxable account holds two stock index funds with large capital gains. Ideally, I’d also leave them untouched. Why? Under current rules, a taxable account benefits from the step up in cost basis upon death, thus nixing any embedded capital gains tax bill. Is all of the above set in stone? Far from it. If interest rates rose, bonds may once again become an attractive source of income. If my health deteriorates, I’d stop the immediate annuity purchases and claim Social Security right away. If retirement proves more expensive than I anticipate—or the markets less generous—I may need to tap my Roth and taxable accounts. But that’s how it is with plans: They give you a broad direction—but you almost always have to make adjustments along the way. This column originally appeared on Humble Dollar. It was republished with permission. Jonathan Clements is the editor of HumbleDollar.com, the author of “From Here to Financial Happiness,” and former personal finance columnist for The Wall Street Journal."}]}