{"article": [{"url": "https://www.marketwatch.com/story/adobe-stock-rises-as-subscription-revenue-tops-street-view-2020-06-11", "published": 1591896980.0, "headline": "Adobe stock rises as coronavirus work-from-home shift boosts subscription revenue", "body": "Adobe Inc. shares rose in the extended session Thursday after the software company’s earnings and contract revenue topped Wall Street estimates as the drive for mobile workplaces because of COVID-19 increased demand for its digital products. Adobe ADBE, +2.30% shares rose 4.4% after hours, following a 4.7% decline in the regular session to close at $387.67. The use of digital documents as millions of people shifted to work-from-home environments because of the COVID-19 pandemic was a huge driver in the company’s digital products, the company said. “The tectonic shift toward ‘all things digital’ across all customer segments globally will serve as a tailwind to our growth initiatives as we emerge from this crisis,” said Shantanu Narayen, president and chief executive of Adobe, in a statement. The company reported second-quarter net income of $1.1 billion, or $2.27 a share, compared with $632.6 million, or $1.29 a share, in the year-ago period. Adjusted earnings were $2.45 a share, compared with $1.83 a share a year ago. Revenue rose to $3.13 billion from $2.74 billion in the year-ago quarter. Analysts surveyed by FactSet had forecast earnings of $2.32 a share on revenue of $3.16 billion. When Adobe reported earnings back in March, the company had forecast second-quarter earnings of about $2.35 a share on revenue of about $3.18 billion, factoring in uncertainty over COVID-19, while the Street had modeled earnings of $2.33 a share on revenue of $3.22 billion. Annual recurring revenue, a software-as-a-service metric that shows how much revenue the company can expect based on subscriptions, for digital media was $9.17 billion. Analysts had forecast $9.11 billion. That record ARR highlighted “how mission-critical creative and document solutions are in engaging remotely,” said John Murphy, Adobe chief financial officer, in a statement. ARR for Adobe’s creative segment was $7.93 billion, while the Street had forecast $7.92 billion, and ARR for its document cloud segment was $1.24 billion, compared with the Street forecast of $1.19 billion. Adobe expects third-quarter adjusted earnings of about $2.40 a share on revenue of about $3.15 billion, while analysts had forecast earnings of $2.46 a share on revenue of $3.26 billion. The company is not forecasting results for the year citing the “macroeconomic environment and the strategic shifts for advertising cloud.” Of the 28 analysts who cover Adobe, 19 have buy or overweight ratings, eight have hold ratings, and one has an underweight rating, along with an average price target of $365.65, according to FactSet data. Adobe shares are up nearly 18% for the year, contrasting with a 7% decline in the S&P 500 index SPX, +0.87% and compared with a 6% rise in the tech-heavy Nasdaq Composite Index COMP, +1.39% and a 12% increase in the iShares Expanded Tech-Software Sector ETF IGV, +1.85%."}]}