{"article": [{"url": "https://www.marketwatch.com/story/ftse-100-surges-and-the-pound-holds-firm-despite-u-k-economys-worst-ever-fall-11597239086", "published": 1597235180.0, "headline": "FTSE 100 surges and the pound holds firm despite U.K. economyâ\u0080\u0099s worst ever fall", "body": "The U.K. officially entered recession in the second quarter, as gross domestic product fell 20.4% amid the coronavirus pandemic. paul ellis/Agence France-Presse/Getty Images The FTSE 100 surged 2% on Wednesday and the pound held steady as the U.K. economy suffered its worst ever fall in the second quarter. U.K. gross domestic product plunged 20.4% in the three months from April to June â\u0080\u0094 the worst performance of any major European economy during the pandemic. However, there were signs of a recovery as the economy bounced back 8.7% in June. The U.K.â\u0080\u0099s blue-chip index UKX, +0.64% closed 2% higher as investors hoped the U.K.â\u0080\u0099s dip into recession may lead to more stimulus, while the more domestically-exposed FTSE 250 MCX, +0.71% rose 0.5%. Bank of England deputy governor Dave Ramsden had said on Tuesday that the central bank would step up quantitative easing if the economy slows and struggles again.Â Â The pound GBPUSD, +0.83% was largely unmoved against the U.S. dollar, despite the U.K. economyâ\u0080\u0099s record collapse. Â Â Â Strong gains for key stocks, including oil major Royal Dutch Shell RDSA, +2.08% and HSBC HSBA, -1.49%, helped the index higher, said Chris Beauchamp, chief market analyst at IG. â\u0080\u009cThe former [Shell] has gained thanks to renewed strength in the oil price BRN00, -0.07%, while a lack of further developments in U.S.-China tensions has allowed HSBC and Asian peer Standard Chartered STAN, -1.38% to make up some lost ground,â\u0080\u009d he added. The 20.4% fall in GDP beat expectations of a 21.2% drop but is double the hit taken by Germany and more severe than that of hard-hit countries Italy and Spain. Dean Turner, UBS Global Wealth Management economist, said the data showed the worst was behind the U.K. economy. â\u0080\u009cIn our view, U.K. assets look undervalued. In this environment we continue to maintain a preference for U.K. equities relative to other eurozone stocks, and expect sterling to strengthen versus a weaker dollar over the next 12 months,â\u0080\u009d he added.Stocks in focus Just Eat Takeaway JET, +1.22% stock rose 3.2%, after the food delivery company reported surging revenue and orders in the first half of the year when it benefited from coronavirus lockdowns across Europe. However, the company said pretax losses widened to â\u0082¬121 million, from â\u0082¬7 million a year earlier, mainly driven by costs related to the merger between Just Eat and Takeaway.com and the proposed acquisition of Grubhub. Admiral Group ADM, +0.94% shares climbed 7.3%, as the U.K.-listed insurance company said it would pay the special dividend it deferred at the height of the pandemic after a 31% rise in first-half pretax profit. Balfour Beatty BBY, -1.29% shares fell 1.6%, as the FTSE 250 infrastructure giant posted a Â£26 million pretax loss in the first half of the year when the COVID-19 crisis halted construction work."}]}