{"article": [{"url": "https://www.marketwatch.com/story/were-getting-great-reports-from-the-doctors-trump-tweets-second-video-from-walter-reed-2020-10-04", "published": 1601881460.0, "headline": "â\u0080\u0098Weâ\u0080\u0099re getting great reports from the doctorsâ\u0080\u0099: Trump tweets second video from Walter Reed â\u0080\u0094 and later gives thumbs-up to supporters from motorcade", "body": "President Donald Trump tweeted a second video of himself on Sunday afternoon from the Walter Reed Medical Center to update the nation on his progress after being diagnosed with COVID-19, the disease caused by SARS-CoV-2. Shortly afterwards, the president drove by cheering supporters outside the hospital. He was barely visible in the back of the car, waving from the back seat while wearing a black mask, and giving the crowd a thumbs-up. â\u0080\u009cWeâ\u0080\u0099re getting great reports from the doctors,â\u0080\u009d Trump said in a video on Twitter while standing, dressed in a white shirt and navy blue suit. â\u0080\u009cThis is an incredible hospital, Walter Reed. The work they do is just absolutely amazing, and I want to thank them all.â\u0080\u009d (He also released a video from the hospital on Saturday.) See Trumpâ\u0080\u0099s motorcade outside Walter Reed: iframe.twitter-tweet { width: 100% !important; } Trump, 74, was moved from the White House to Walter Reed Medical Center late Friday, the same day that he and first lady Melania Trump had tested positive for coronavirus. His medical regimen highlighted how the president is in a high-risk group for more serious illness from COVID-19. He appeared upbeat on Sunday evening. â\u0080\u009cIâ\u0080\u0099ve also gotten to meet some of the soldiers and first responders and what a group,â\u0080\u009d Trump said. â\u0080\u009cI also think weâ\u0080\u0099re going to pay a little surprise to some of the great patriots we have on the street, and theyâ\u0080\u0099ve been out there for a long time.â\u0080\u009d Trump suggested he would pay them a visit. â\u0080\u009cTheyâ\u0080\u0099ve got Trump flags and they love our country, and Iâ\u0080\u0099m not telling anybody but you, but Iâ\u0080\u0099m about to make a surprise visit so perhaps Iâ\u0080\u0099ll get there before you get to see me,â\u0080\u009d he added. See Trumpâ\u0080\u0099s latest video: iframe.twitter-tweet { width: 100% !important; } Trump also said heâ\u0080\u0099s learning a lot about COVID-19. â\u0080\u009cBut when I look at the enthusiasm and weâ\u0080\u0099ve had enthusiasm probably like nobodyâ\u0080\u0099s ever had,â\u0080\u009d the president added. â\u0080\u009cItâ\u0080\u0099s been a very interesting journey. Iâ\u0080\u0099ve learned a lot about COVID. I learned it by really going to school.â\u0080\u009d â\u0080\u009cThis is the real school,â\u0080\u009d Trump added. â\u0080\u009cThis isnâ\u0080\u0099t the â\u0080\u0098letâ\u0080\u0099s read the bookâ\u0080\u0099 school, and I get it and I understand it, and itâ\u0080\u0099s a very interesting thing and Iâ\u0080\u0099m going to be letting you know about it.â\u0080\u009d He signed off: â\u0080\u009cIn the meantime, we love the USA, and we love whatâ\u0080\u0099s happening. Thank you.â\u0080\u009d He was given a dose of Regeneron Pharmaceuticals Inc.â\u0080\u0099s REGN, +0.36% Â experimental neutralizing antibody cocktail, in addition to Gilead Sciences Inc.â\u0080\u0099s GILD, +0.82% Â remdesivir. The president also received supplemental oxygen at least once, and dexamethasone, Dr. Sean Conley, Trumpâ\u0080\u0099s physician, said Sunday. Trump could leave the hospital as early as Monday and continue to receive care at the White House if his condition continues to improve, Conley added. Related: Hereâ\u0080\u0099s how Trumpâ\u0080\u0099s positive coronavirus test has shaken up the campaign â\u0080\u0094 plus what could happen next Dr. Sean Conley, physician to President Donald Trump, briefs reporters at Walter Reed National Military Medical Center in Bethesda, Md., Oct. 3. Trump was admitted to the hospital after contracting the coronavirus. (Photo: Susan Walsh/AP.) COVID-19 has now infected 35 million people worldwide The Dow Jones Industrial Index DJIA, +0.56%, the S&P 500 SPX, +0.87% Â and the Nasdaq Composite COMP, +1.39% all closed lower Friday in the wake of the presidentâ\u0080\u0099s diagnosis; the Nasdaq was down 2.2% at dayâ\u0080\u0099s end. Doubts about traction for further fiscal stimulus from Washington may be another factor discouraging investors who have been betting on Republicans and Democrats striking a deal to offer additional relief. As of Sunday, COVID-19 has now killed at least 1,034,865 people worldwide, and 209,749 in the U.S., according to data aggregated by Johns Hopkins University. The U.S. still has the worldâ\u0080\u0099s highest number of COVID-19 cases (7,412,911), just ahead of India (6,549,373) and Brazil (4,906,833). Worldwide, there has been at least 35,011,322 confirmed cases, which mostly does not account for asymptomatic cases. Several companies in the U.S. and overseas are working on a vaccine. AstraZeneca AZN, +1.16%, in combination with Oxford University; BioNTech SE BNTX, +1.23% Â and partner Pfizer PFE, -0.27% ; GlaxoSmithKline GSK, +1.10% ; Johnson & Johnson JNJ, +1.39% ; Merck & Co. MERK, +1.59% ; Moderna MRNA, +0.09% ; and Sanofi SAN, -1.48% Â are among those working to get a vaccine through trials, in the hope one will be ready in and/or by 2021."}]}