{"article": [{"url": "https://www.marketwatch.com/story/options-bets-that-the-stock-market-will-continue-to-soar-have-exploded-to-dot-com-bubble-levels-11598558379", "published": 1598687120.0, "headline": "Options bets that the stock market will continue to soar have exploded to dot-com bubble levels", "body": "Even as the stock market trades in record-setting territory despite the economy being in the throes of a viral pandemic, Wall Street bets for further gains are around their highest levels since the dot-com bubble, according to research from Bespoke Investment Group. Options bets that the S&P 500 SPX, +0.87% will extend its run-up in months to come have roughly doubled, far exceeding trading in securities that would be used to bet that a decline in stock values was imminent. Call options give holders the right but not the obligation to buy a certain number of shares (100 per option contract) at a certain price (strike price) by a certain date (expiration date). Calls are viewed as bullish bets on an asset, as opposed to put options, and Bespoke indicates that appetite for calls, particularly among individual investors, has boomed. “Retail enthusiasm for the market via commission-free trading apps plus the huge volatility earlier this year have led to a massive boom in options volumes,” the analysts at BIG wrote. “Most of the increase in trading activity in these derivatives has gone to calls,” they wrote (see chart below). Bespoke Investment Group The bullish posture in the options market comes as market participants are growing increasingly concerned that the market’s rally, which has taken the S&P 500 and the Nasdaq Composite Index COMP, +1.39% from the depths of a coronavirus-induced selloff back in March to a series of all-time highs in a few short months (The Dow Jones Industrial Average DJIA, +0.56% stands within 4% of its own record high last hit on Feb. 12), is getting ahead of itself and primed to fall. Bespoke writes that it is difficult to predict when a market slide might occur but notes that the degree to which leveraged bets have been made on further upside might magnify the downturn should a bearish catalyst arise. “In any event, the prevalence of call buying is in our view a clear-cut signal that sentiment is extended after a blistering equity market rally since March,” the analysts wrote. As of Thursday afternoon, the S&P 500 was on pace for its 19th record close of 2020 and its fifth straight record finish, which would represent its longest streak of all-time closing highs since a six-session period ended Jan. 9, 2018, according to Dow Jones Market Data. A number of strategists have expressed concern that markets are tilting toward euphoria after the seemingly incessant climb. Indeed, Sean Darby, global head of strategies at Jefferies, in a research note earlier this week said that some “indicators are beginning to move into the ‘euphoria’ stage, and cautioned that managing drawdown risk is coming to the fore.” One measure of the market’s concerns, however, remains elevated. The Cboe Volatility Index VIX, -5.15% VX00, -6.66% has remained above its historical average of 19.40 for 131 straight trading days, which is the longest period above its historic norm since the 335 trading days ended Dec. 21, 2009, amid the 2007-09 financial crisis. The VIX, which typically jumps during big stock-market selloffs, also tends to fall back during long, gradual rallies, has remained stubbornly elevated, at around 24.37, at last check. Analysts at DataTrek, in a Thursday note, said that the elevated VIX and the rise in stocks is unusual but not unprecedented, drawing a comparison to the period between 1996 and 2000 when the VIX held well above 20 without lasting damage to the stock market’s rally. The VIX “remained consistently over 20 in 1997 (S&P 500 +33%), 1998 (+28%) and 1999 (+21%). Stress periods in 1997 (Asia Crisis) and 1998 (Long Term Capital) even took the VIX over 35 with no lasting damage to the rally in U.S. stocks,” DataTrek wrote. However, Jesse Felder, author of the popular Felder Report financial blog, notes that recently the volatility index and stocks have been rising in tandem, which he described as a bearish sign in the short run. On Thursday, in fact, the VIX was up 4.5% as stocks were rising. Felder said extended divergences from the normal relationship can signal “an impending reversal.”"}]}