{"article": [{"url": "https://www.marketwatch.com/story/as-trump-and-biden-trade-age-insults-older-workers-suffer-11594934554", "published": 1595249300.0, "headline": "As Trump and Biden trade age insults, older workers suffer", "body": "The age insults don’t stop coming. President Donald Trump, 74, repeatedly criticizes former Vice President Joe Biden, 77, the presumptive Democratic presidential nominee, for his mental fitness. It’s a repetitive refrain of his suggesting that Biden has grown confused and would be incapable of tackling the job. Recently, in an interview with Fox News host Sean Hannity, Trump crowed that he had taken a cognitive test and “aced it,” while contending that Biden “couldn’t pass” a similar test. I don’t want to get into a political discussion here, but age bashing is a trigger for me. As someone who has spent decades studying the job market and helping older workers find jobs, it rankles me to hear senility used as a playing card so flippantly and with presumably an underlying agenda. In fairness, both men have publicly contested each other’s mental health. “This president talks about cognitive capability, Biden said during a press conference in Wilmington. Del. “He doesn’t seem to be cognitively aware of what’s going on.” (The comment was referring to intelligence reports of Russian bounties being offered on U.S, troops in Afghanistan.) Cognitive verdicts should be left to the medical experts. I have no insight into the factual basis of these assertions. But they do cut close to the bone. My father lived with Alzheimer’s disease for 10 years, and my 90-year-old mother, who I help care for, also has a form of dementia. These kinds of statements should not be tossed about as a way to sling mud. It may be a campaign tactic, but older workers be forewarned. Ageism runs deep in our culture–especially in the workplace. This kind of bias is pervasive and starts at the top, even as an off-the-cuff comment that sows a seed and adds to the perception of older adults as less than. Those of us over 50 are well acquainted with ageism, and new results from the National Poll on Healthy Aging, conducted by the University of Michigan Institute for Healthcare Policy and Innovation, back that up. The national sample of more than 2,000 adults aged 50 to 80 reported that more than 80% of those polled say they commonly experience at least one form of ageism in their day-to-day lives. “Everyday ageism is part of American culture and one of the most common and socially condoned forms of prejudice and discrimination,” said Julie Ober Allen, a research fellow at the U-M Institute for Social Research who partnered with the poll team to develop the questions and analyze the results. And recently, the Longevity Project, in collaboration with the Stanford Center on Longevity, held an engaging virtual panel discussion on “A New Ageism? Fallout from the Pandemic” to explore the public and media response to the pandemic and what it means for the perception of older Americans in civil society. The conversation included Richard Eisenberg, managing editor of Next Avenue; Paul Irving, chairman of the Milken Institute Center for the Future of Aging; and Louise Aronson, a geriatrician and professor of medicine at the UCSF Division of Geriatrics and author of Elderhood: Redefining Aging, Transforming Medicine, Reimagining Life. I recommend you take the time to watch and learn. Befuddled imagery and negative language about older workers have the power to take someone out of the job market—whether it is true or not, whether it is spoken aloud to and broadcast to millions of people, or just a an internalized stereotype running through a hiring manager’s mind. Given the current state of the labor market and economy due to COVID-19, many workers in their 60s and 70s will need to stay on the job longer. This trend had already begun due to people living longer, ostensibly healthier lives, and the desire to stay mentally engaged and financially secure to pay for these bonus years. Then too, many workers need to keep working out of necessity because they simply haven’t been able to save adequately for retirement, in part because they didn’t have access to a retirement plan from an employer. As I wrote in this MarketWatch column, ageism is alive and well in the hiring process. I know from my personal research that older job seekers are discouraged by job postings that use youthful prompts such as “high-energy.” Let’s get loud here. There is a huge upside for hiring and retaining workers 50+. It’s a trifecta. Employers and workers benefit, as does the economy. “We’ve increased our life expectancy by 50% in the last 100 years,” said Dr. Linda Fried, dean of Columbia University Mailman School of Public Health. “Society can’t afford to lose the assets of older workers: the experience, expertise, commitment, and reliability—and the accumulated knowledge of a lifespan.” The reality is the experience that Fried refers should be considered a plus when it comes to hiring or retaining an older employee. When you’re over 60, or heck, 70, you’re loyal. You’re not as likely to jump jobs. You’re probably a solid decision maker and problem-solver from the get-go. You’ve honed those critical-thinking skills over your career. Meantime, workers who have decades of experience generally have well-honed communication skills. They didn’t cut their teeth on email, texting or social media, and typically have a good grasp of essential written, oral and people skills. And they often have management, marketing, and finance chops, and rich industry knowledge. Toss in strong professional networks and client networks. And don’t get me started about the magic of older entrepreneurs, who are best prepared to become entrepreneurs because they have “higher levels of human capital, social capital, and financial capital,” Cal J. Halvorsen, a retirement researcher and assistant professor at the Boston College School of Social Work, told me when I interviewed him for my book, Never Too Old To Get Rich. “Human capital might be, for example, education and work experience,” he said. “Social capital would be their social network. Financial capital would be their financial assets and wealth. If you have higher levels of these, it has been shown that you can be more successful in entrepreneurship.” These forms of capital tend to increase with age, because you have had more time to cultivate them. As a result, older people in general would likely be more successful at entrepreneurship than younger ones, Halvorsen said. Now back to ageism. In 1968, gerontologist and psychiatrist Dr. Robert N. Butler coined the term “ageism.” He wrote: “Ageism can be defined as a systematic stereotyping of and discrimination against people because they are old, just as racism and sexism accomplish this with skin color and gender. Ageism is manifested in a wide range of phenomena, on both individual and institutional levels—stereotypes and myths, outright disdain and dislike, simple subtle avoidance of contact, and discriminatory practices in housing, employment, and services of all kinds.” Given that many Americans are living longer and are productive and mentally sharp well into their eighth decade, this kind of thinking must change and not be seen as a way to get a snarky laugh from supporters. Using senility as a weapon to discredit someone for a job is a dangerous precedent in an era where the number of Americans who plan to keep working as long as they have a will and a way is on the rise. Kerry Hannon is a leading expert and strategist on work and jobs, entrepreneurship, personal finance and retirement. Kerry is the author of more than a dozen books, including Great Pajama Jobs: Your Complete Guide to Working From Home, Never Too Old To Get Rich: The Entrepreneurs Guide To Starting a Business Mid-Life, Great Jobs for Everyone 50+, and Money Confidence. Follow her on Twitter @kerryhannon."}]}