{"article": [{"url": "https://www.marketwatch.com/story/biden-and-other-democrats-accuse-trump-of-stoking-racial-tensions-encouraging-violence-2020-08-30", "published": 1598809400.0, "headline": "Biden and other Democrats accuse Trump of stoking racial tensions, encouraging violence", "body": "WASHINGTON — Democrats on Sunday accused President Donald Trump of trying to inflame racial tensions to benefit his campaign as he praised supporters who clashed with protesters in Portland, Oregon, where one man died overnight, and announced he will travel to Kenosha, Wisconsin, amid anger over the shooting of another Black man by police. Trump’s tweets came hours after a man identified as a supporter of a right-wing group was shot and killed in Portland when a large caravan of Trump’s supporters and Black Lives Matter protesters clashed in the city’s streets. Trump praised the caravan participants as “GREAT PATRIOTS!” and blamed the city’s Democratic mayor for the death. Trump has throughout the summer cast American cities as under siege by violence and lawlessness, despite the fact that most of the protests demonstrating against racial injustice have been largely peaceful. With about nine weeks until Election Day, some of his advisers see an aggressive “law and order” message as the best way for the president to turn voters against his Democratic rival, Joe Biden, and regain the support of suburban voters, particularly women, who have abandoned him. But Democrats accuse Trump of rooting for unrest and trying to stoke further violence for political gain instead of ratcheting down tensions. Biden in a statement said he “unequivocally” condemned violence on all sides, while accusing Trump of “recklessly encouraging” it. “He may think that war in our streets is good for his reelection chances, but that is not presidential leadership — or even basic human compassion,” Biden said. “Do you seriously wonder, Mr. President, why this is the first time in decades that America has seen this level of violence?” asked Portland Mayor Ted Wheeler. “It’s you who have created the hate and the division.” The White House pushed back. “The only people to blame for the violence and riots in our streets are liberal politicians and their incompetent policies that have failed to get control of these destructive situations,” White House spokesman Judd Deere said. Trump prepared to travel this week to Kenosha, Wisconsin, where tensions are still raw after police shot Jacob Blake, a 29-year-old Black man, in the back seven times, leaving him paralyzed. The shooting has ignited new demonstrations against racial injustice and police brutality months after George Floyd’s death at the hands of a Minneapolis police officer touched off a wider reckoning on race. Rep. Karen Bass, a California Democrat who leads the Congressional Black Caucus, said Trump is “doing everything he can to fan the flames.” “I think his visit has one purpose, and one purpose only. And that is to agitate things and to make things worse,” Bass said Sunday on CNN’s “State of the Union.” “It is clear his campaign is all about law and order. It is a throwback to the past. And he’s going to do everything to disrupt law and order in this time period.” Trump has cast the upcoming election as clash between “law and order” and anarchy, and he has denounced protesters as “thugs” while sharply defending police. That theme was front-and-center at last week’s Republican National Convention, which used recent protest footage to paint a foreboding and violent picture of the future if Biden denies Trump a second term. While the protests this year have largely been peaceful, many businesses have been vandalized and buildings burned. That destruction will be highlighted Tuesday when Trump travels to Kenosha, where he will be meeting with law enforcement officers and “surveying” the damage, Deere said. Asked if Trump planned to meet with Blake’s family, Judd said the president’s schedule had yet to be finalized, but Blake’s attorney, Benjamin Crump, told CBS News the family “has not been contacted” by Trump “at this time.” News of the visit drew swift condemnation from local Democratic leaders, including Wisconsin Lt. Gov. Mandela Barnes. “I don’t know how, given any of the previous statements that the president made, that he intends to come here to be helpful. And we absolutely don’t need that right now,” Barnes said in an interview with CNN. Former NAACP President Cornell William Brooks told the network that Trump would be “turning Air Force One into a gasoline truck” and “bringing gas to a fire.” “The president is going to make a bad situation worse,” Brooks said. Trump has had little to say about the Blake shooting, which was captured on cellphone video. “Well, I’m looking into it very strongly. I’ll be getting reports,” he said in an interview Friday with a local New Hampshire television station. “It was not a good sight. I didn’t like the sight of it, certainly, and I think most people would agree with that.” Trump offered a similar response Saturday when asked about Kyle Rittenhouse, the white 17-year-old who has been charged with fatally shooting two protesters and wounding a third Tuesday after he traveled to Kenosha, apparently to defend the city from protesters. Attorneys representing Rittenhouse, who was seen walking with an AR-15, have said he acted in self-defense. Trump told reporters Saturday the case is “under investigation right now” and that “we’re looking at it very, very carefully.” But Trump on Sunday appeared to lend support to the teenager when he liked a retweet of a series of messages that began, “Kyle Rittenhouse is a good example of why I decided to vote for Trump.” The circumstances of Saturday night’s shooting in Portland remain unclear.Video from the city shows sporadic fighting, as well as Trump supporters firing paintball pellets at opponents and using bear spray as counterprotesters threw things at the Trump caravan. The victim is a member of Patriot Prayer, a right-wing group whose members have frequently clashed with protesters in Portland in the past, its founder, Joey Gibson, said Sunday. White House officials, meanwhile, continued to blame local leaders for allowing the protests to continue. “We’ve had over 200 anarchists and they’re not peaceful protesters. These are people that every night commit violent acts,” Trump’s chief of staff, Mark Meadows, said on NBC’s “Meet the Press.” Acting Homeland Security Secretary Chad Wolf said on ABC’s “This Week” that “if the governor had taken action early on after Day One, Day Two of some of that violent activity occurring there, we probably — a lot of this could have been avoided. Unfortunately, he acted a little too late.” Republican Sen. Ron Johnson of Wisconsin urged calm, while also laying blame. “When you encourage the disdain for the police, you encourage criminals. When you do little or nothing to stop rioting, you encourage anarchy. So when you are encouraging criminals and anarchy, people’s lives are lost,” Johnson said on CNN’s “State of the Union.”"}]}