{"article": [{"url": "https://www.marketwatch.com/story/stock-market-strategists-have-never-been-more-confused-in-june-about-the-year-end-outlook-for-equities-by-this-measure-2020-06-30", "published": 1593554780.0, "headline": "Why stock-market strategists have never been more confused in June about the year-end outlook for equities", "body": "It has been the best of times and the worst of times for U.S. equity benchmarks over the past two quarters, and that is, perhaps, why Wall Street analysts are facing their most befuddling challenge yet. The Dow Jones Industrial Average DJIA, +0.56% and the S&P 500 SPX, +0.87% just put in their best quarterly performances since 1938 in the aftermath of a bruising pandemic that took hold in March, according to Dow Jones Market Data. That performance would be stellar if it weren’t for a few simple facts: The Dow booked its worst first six months of a calendar year since the 2008 financial crisis, while the S&P 500 notched its worst first half of the year in a decade. In other words, the returns enjoyed this quarter came after a troubling quarter that was ushered in by the emergence of the COVID-19 epidemic in the U.S. and its subsequent punishing effect on the economy, with businesses compelled into hibernations to curtail the spread of the deadly infection. Since hitting a March 23 low at 2,237.40, the S&P 500 has surged 38% to nearly 3,100, while the Dow has climbed 38.5% and the Nasdaq Composite Index COMP, +1.39% has rallied about 46%. The problem is that there’s no clear consensus on where the market goes from this point, and strategists have been more inclined to raise their year-end outlooks for the S&P 500 rather than lower them, even as the markets have run briskly higher past their targets and as coronavirus cases have staged a resurgence in parts of the U.S. Jason Goepfert, head of SentimentTrader and founder of independent investment research firm Sundial Capital Research, wrote in a Tuesday note that based on standard deviations, strategists have never been so confused about the outlook into the end of a year (see attached chart): Meanwhile, Bloomberg News, citing a recent research survey from DataTrek Research co-founder Nicholas Colas, noted that a fifth of poll respondents said the S&P 500 will finish out the year up 10% from its current levels, with roughly the same number predicting that it will end the year down by that degree. Goepfert estimated that based on another way to consider strategists’ standard deviation, expressed as a share of the S&P 500 at the end of June, the current divergence by analysts is only the widest since 2009. To be sure, that is still a fairly wide breadth (see attached chart): The Sundial analysts said that the average year-end target for analysts is 2,998 for the S&P 500, about 3% below where it is currently. That target matches the lowest-ever year-end target relative to where the S&P was trading at the end of June, according to Goepfert. However, that may be a good thing. When the average target was that low, the market tended to fare well in the subsequent six- and 12-month periods, even if the near-term market returns weren’t stellar. Goepfert said that the S&P 500 returned an average of more than 7% over the next six months, roughly July through December. It is when the strategists are more uniformly bullish that problems arise, he said, pointing out that the market tends to return a negative-1.7% through the end of the year during those periods. The Wall Street Journal wrote that Bank of America’s analysts put a 2,900 year-end price target on the S&P, abandoning previous calls of 2600 and 3100. Goldman lifted the low end of its three-month target to 2750 from 2400 in late May as the index hovered around its year-end projection of 3000, the paper reported. Of course, it is impossible to know where the market will end up by the end of this dramatic year, considering all the variables that the market must digest, including a 2020 presidential election that could knock equities around and a economy that has seen tens of millions lose their jobs over the course of a few short months."}]}