{"article": [{"url": "https://www.marketwatch.com/story/trumps-idea-on-changing-social-security-funding-has-the-potential-to-break-an-impasse-on-much-needed-reforms-2020-09-09", "published": 1599814460.0, "headline": "Trump's idea on changing Social Security funding has the potential to break an impasse on much-needed reforms", "body": "President Trump has proposed a dramatic change to how Social Security is financed. But Trump's controversial proposal to fund Social Security with income taxes rather than payroll taxes opens the door to reforms that both Democrats and Republicans might support. On Aug. 8, President Trump issued an executive order that would temporarily defer the collection of Social Security payroll taxes through the end of the year, meaning that these taxes wouldn't be owed until Americans file their tax returns in April 2021. But President Trump made clear in an Aug. 12 news conference that his real goal is to replace the Social Security payroll tax with revenues drawn from the general tax fund, the vast majority of which is income taxes. This idea faces both practical and philosophical hurdles, but could help the political parties finally come together to fix Social Security. Read:Paul Brandus says this is one Trump tax cut you really don't want The first problem with funding Social Security via income taxes is obvious: the federal budget is already in deficit, which means there isn't room to fund Social Security with general revenues without significantly cutting other programs or raising income taxes. And that tax increase wouldn't be tiny. In 2019, the federal government collected about $1.7 trillion in individual income taxes, versus nearly $1 trillion in Social Security payroll taxes. Even if the President's plan would replace only the employees' 6.2% payroll tax, that would mean about an additional $500 billion in general tax revenues needed. Moreover, funding Social Security with income taxes is also contrary to the program's history, in which benefit were funded with a flat rate tax that applied to all earnings up to a maximum, which is currently $137,700 per year. The payroll tax contributed to the view that Social Security is an \"earned benefit\" rather than a welfare plan. Read:This eye-opening experience has me rethinking how Social Security figures into my retirement planning But most Democrats have already given up on the idea of truly earned benefits, since their Social Security proposals focus on lifting the payroll tax cap and making the rich carry more of the load. Income-tax financing would simply take that idea in a more progressive direction. While about 15% of earnings accrue to employees with salaries above the $137,700 payroll tax ceiling, almost half of total income taxes are paid by households with incomes above that level. More than one-third of income taxes are paid by the top 1% alone. But what is in it for Republicans? The answer is that an income-tax-financed safety retirement net need not be nearly as expensive as the current Social Security program. For instance, Australia's Age Pension costs around one-fifth of what Social Security does, because it merely supplements households' own savings to ensure a minimum standard of living in retirement. Canada and New Zealand also use income tax-financed programs to provide a strong base of retirement income. Read:Australia's safety net for retirees is generous and comprehensive - and complicated For this idea to work, though, the U.S. would need to follow Australia's lead by signing up every worker for a retirement savings account with automatic contributions. Those contributions could be funded using the payroll taxes that no longer would be needed to fund Social Security. Once transitioned into place - which admittedly would take years - the result would be higher private savings, particularly for lower-income households, which reduces wealth inequality and boosts the economy. And while income taxes would be higher, total government spending on Social Security would be lower. To be clear, this is my plan, not President Trump's. But for income tax-funding of Social Security to work, for it to overcome 30 years of Congressional inaction on Social Security, it needs to think creatively and offer something to both sides. Because the traditional menu of reforms - payroll tax rate increases, higher retirement ages, lower cost-of-living adjustments and so forth - haven't motivated Congress to action. Follow MarketWatch's coverage of all things Social Security here. Andrew G. Biggs is a resident scholar at the American Enterprise Institute and former principal deputy commissioner of the Social Security Administration during the George W. Bush administration. Follow him on Twitter @biggsag."}]}