{"article": [{"url": "https://www.marketwatch.com/story/microsoft-reports-record-revenue-to-wrap-up-a-record-breaking-fiscal-year-2020-07-22", "published": 1595443220.0, "headline": "Microsoft reports record revenue to wrap up a record-breaking fiscal year", "body": "Microsoft Corp. wrapped up a record-breaking year Wednesday by announcing record quarterly revenue, but shares still shrank from near-record highs in after-hours trading. Microsoft MSFT, +2.48% reported fiscal fourth-quarter earnings of $11.2 billion, or $1.46 a share, on revenue of $38 billion Wednesday, after posting earnings of $1.71 a share on sales of $33.71 billion a year ago. Analysts on average expected profit of $1.34 a share on sales of $36.54 billion, according to FactSet. That performance wraps up a year of record profit and sales, despite the onset of the COVID-19 pandemic toward the end of Microsoft’s fiscal year. For the year, Microsoft reported earnings of $44.28 billion on sales of $143 billion, up 13% and 14% respectively from the previous year’s record performance. Microsoft stock has appreciated amid the gains. Shares are up more than 34% so far this year as the S&P 500 SPX, +0.87% has gained 1.4%, pushing Microsoft’s market capitalization higher than $1.6 trillion. Shares ducked between 2% and 3% lower in after-hours trading Wednesday immediately after the results, after closing at $211.75, a few dollars short of the record close of $214.32 set earlier this month. Those gains could well continue. In a conference call with analysts late Wednesday, Microsoft Chief Financial Officer Amy Hood offered fiscal first-quarter revenue guidance for Productivity and Business Solutions ($11.65 billion to $11.9 billion), Intelligent Cloud ($12.55 billion to $12.8 billion), and More Personal Computing ($10.95 billion to $11.35 billion) that was roughly in line or slightly above FactSet estimates. Several times during the call, Hood and Chief Executive Satya Nadella noted the continued strong performance of cloud and Microsoft’s Teams communication and collaboration platform. Microsoft has prospered during the pandemic as its Azure cloud-computing offering and cloud-software offerings have become more essential as its corporate customers sent employees home to work remotely. The legacy personal-computer business has also been hot, as companies and consumers replace equipment that is suddenly getting more use amid shelter-in-place restrictions due to the virus. See also: Microsoft’s push to the cloud may save it from a coronavirus crash Microsoft announced on Wednesday that its “Intelligent Cloud” division, which includes Azure and other offerings such as on-premises servers, racked up $13.4 billion in sales in the fiscal fourth quarter, up 17% and higher than the average analyst estimate of $13.11 billion. Microsoft, which does not break out Azure performance individually, said that revenue for the cloud-computing division rose 47%. “Our commercial cloud surpassed $50 billion in annual revenue for the first time this year. And this quarter our commercial bookings were better than expected, growing 12% year-over-year,” Hood said in Wednesday’s announcement. The “More Personal Computing” segment, which includes the legacy Windows business as well as Xbox gaming and some other properties, reported revenue of $12.9 billion, up 14% from $11.28 billion a year ago. Analysts on average expected the PC-focused business to produce revenue of $11.48 billion, according to FactSet. “Productivity & Business Solutions,” which comprises most of the cloud-software assets, including Teams and LinkedIn, reported revenue of $11.8 billion, up 6% from a year ago but below the average analyst estimate of $11.91 billion. Use of Teams swelled to 75 million in June from 44 million in March, prompting an antitrust complaint from Slack Technologies Inc. WORK, +3.36% to the European Commission earlier in the day. Microsoft announced layoffs at LinkedIn earlier this week, but said the division’s revenue increased 10% in the quarter. LinkedIn layoffs are not the only changes at Microsoft amid the pandemic. The company also decided to shut down its retail stores during the quarter, and also shuttered videogame-streaming effort Mixer, shipping the assets to Facebook Inc. FB, +0.26% . The company said Wednesday that it recorded a charge of $450 million in the quarter related to the closure of its retail stores, though that was more than wiped away by a $2.6 billion net tax income benefit. Read: Tech has been a pandemic savior and been richly rewarded. So what happens now? While such moves could be a sign of concern for investors, analysts are still positive on Microsoft’s prospects because of Nadella’s successes in refocusing the business on the fly. Since Nadella took over as CEO in early 2014 and made cloud the core focus for Microsoft, shares have more than quintupled. “They’ve made the right poker moves, Nadella has had one of the most transformative turnarounds in the last 30 years,” Wedbush analyst Dan Ives said when asked about the retail and Mixer decisions in a tech-earnings interview with MarketWatch earlier this month. Ives has an outperform rating and $260 price target on Microsoft stock. In assessing the quarter in a note late Wednesday, Ives maintained his rating and price target. “For Redmond, this cloud shift and WFH [work from home] dynamic looks here to stay and the company stands to be a major beneficiary of this trend on its flagship Azure/Office 365 franchise over the coming years,” he said. Contributing: Jon Swartz"}]}