{"article": [{"url": "https://www.marketwatch.com/story/trump-launches-comeback-rally-in-tulsa-amid-empty-seats-and-new-coronavirus-cases-on-his-staff-2020-06-20", "published": 1592730740.0, "headline": "Trump launches comeback rally in Tulsa amid empty seats and new coronavirus cases on his staff", "body": "TULSA, Okla. — President Donald Trump used his comeback rally to try to define the upcoming election as a choice between national heritage and left-wing radicalism, but his intended show of political force during the pandemic was thousands short of a full house and partly overshadowed by new coronavirus cases among his campaign staff. Trump ignored health warnings and held his first rally in 110 days in what was one of the largest indoor gatherings in the world during an outbreak that has killed about 120,000 Americans and put 40 million out of work. The rally Saturday night in Tulsa was meant to restart his reelection effort less than five months before the November election. “The choice in 2020 is very simple,” Trump said. “Do you want to bow before the left-wing mob, or do you want to stand up tall and proud as Americans?” After a three-month break from rallies, Trump returned to regular themes, including boasts about the pre-pandemic economy and complaints about the media. He made no mention of some of the flashpoints roiling the nation, including the abrupt firing of a U.S. attorney in Manhattan, the damaging new book from his former national security adviser or the killing of George Floyd. Trump aired pent-up grievances about the coronavirus, which he mocked as the “Kung flu,” a racist term for COVID-19, which originated in China. He tried to defend his handling of the pandemic, even as cases continue to surge in many states, including Oklahoma. He complained that robust testing was making his record look bad and suggested the testing effort should slow down. “Here’s the bad part. When you do testing to that extent, you’re going to find more cases,” Trump said. “So I said to my people, ‘Slow the testing down.’ They test and they test.” In response, Trump’s Democratic opponent, Joe Biden, tweeted, “Speed up the testing.” A White House adviser, Peter Navarro, told CNN’s “State of the Union” on Sunday that Trump’s remark was “tongue in cheek.” In the hours before the rally, crowds were significantly lighter than expected, and campaign officials scrapped plans for Trump to speak at an overflow space outdoors. Inside the 19,000-seat BOK Center, Trump thundered that “the silent majority is stronger than ever before.” Tulsa Fire Department spokesperson Andy Little said the city fire marshal’s office reported a crowd of just less than 6,200 in the arena. Trump tried to explain away the crowd size by blaming the media for scaring people and by insisting there were protesters outside who were “doing bad things.” Hundreds of demonstrators flooded the city’s downtown streets and blocked traffic at times, but police reported just a handful of arrests. Before the rally, Trump’s campaign disclosed that that six staff members who were helping set up for the event had tested positive for the coronavirus. Campaign communications director Tim Murtaugh said neither the affected staffers nor anyone who was in immediate contact with them would attend the event. The president raged to aides that those positive cases had been made public, according to two White House and campaign officials who spoke on condition of anonymity because they weren’t authorized to speak publicly about private conversations. During the rally, Trump leaned in hard on cultural issues, including the push to tear down statues and and rename military bases honoring Confederate figures in the wake of nationwide protests about racial injustice. “The unhinged left-wing mob is trying to vandalize our history, desecrate our monuments, our beautiful monuments,” Trump said. “They want to demolish our heritage so they can impose their new repressive regime in its place.” Large gatherings in the United States were shut down in March because of the coronavirus. The Tulsa event was scheduled over the protests of local health officials as COVID-19 cases spiked in many states. The choice of host city and date — originally Friday, Juneteenth, in a city where a 1921 racist attack killed as many as 300 people — prompted anger and protests against racial injustice. Trump and his advisers forged forward, believing that a return to the rally stage would reenergize the president, who is furious that he has fallen behind Biden in polls, and reassure increasingly anxious Republicans. But Trump has struggled to land effective attacks against Biden, and his broadsides against the former vice president did not draw nearly the applause as did his digs at his 2016 opponent, Hillary Clinton. City officials had expected a crowd of 100,000 people or more in downtown Tulsa. Trump’s campaign declared that it had received over 1 million ticket requests. The crowd that gathered was far less than that, though the rally, being broadcast on cable, also targeted voters in battleground states such as Pennsylvania, North Carolina and Florida. There were social media claims that people had registered for the rally with no intention of attending. Murtaugh, dismissing the potential impact, said “leftists always fool themselves into thinking they’re being clever,’’ and he noted that rallies are general admission, with first come, first served. The president’s campaign tried to point fingers elsewhere over the smaller-than-expected crowds, accusing protesters of blocking access to metal detectors and preventing people from entering the rally. Three Associated Press journalists reporting in Tulsa for several hours leading up to the president’s speech did not see protesters block entry to the area where the rally was held. The campaign handed out masks and hand sanitizer, but there was no requirement that participants use them and few did. Participants also underwent a temperature check."}]}