{"article": [{"url": "https://www.marketwatch.com/story/im-a-32-year-old-stay-at-home-mom-and-my-husband-earns-150000-a-year-will-i-ever-be-able-to-enjoy-a-retirement-2020-06-15", "published": 1596278060.0, "headline": "I'm a 32-year-old stay-at-home mom, and my husband earns $150,000 a year. Will I ever be able to enjoy a retirement?", "body": "Dear MarketWatch, I've been a stay-at-home mom for five years to a 4-year-old and 2-year-old. I'm 32 and I don't see a clear deadline for when I can return to work. My husband makes 150k a year and is contributing to his 401(k) at 3% with a 3% match. My question is, how do I secure a financial future for myself? Obviously I need to go back to work but am I too late in the game to be able to enjoy \"retirement\" years? Any help is appreciated! M.K. Dear M.K., You're definitely not too late to enjoy your future retirement years. As financial adviser Stephanie Genkin told me, people usually aren't starting to save for retirement until their 30s anyway, so you're on track with many other Americans. \"32 is certainly not 'game over' - it's 'game on',\" she said. But in order to create a secure retirement later in life, there are a few steps you'll have to take right now. The first is keeping your financial house in order. Before you can really ramp up your retirement savings, make sure you have an emergency fund. Most financial advisers will suggest having three to six months' worth of living expenses stashed away in a savings account, and you'd probably want to aim for the latter as you have two little kids at home. The coronavirus crisis has highlighted the importance of an emergency savings account, said Lisa Ernst, executive director of Savvy Ladies, a nonprofit organization with financial education programs for women. \"The trap we see a lot of women get into regardless of their age is they don't think that bad things will ever happen,\" she said. \"The last couple of months have taught us you can be living your life and all of a sudden everything changes.\" It never hurts to analyze your spending, too. This includes reviewing your credit card and utilities statements. Are you spending on services you don't actually care about? Can you work with your cable company to lower your monthly bill? You can also break down your spending into wants and needs, so that you can better reflect on where that money is going and if it makes you happy, Ernst said. Once you have those figured out, it's time to look at your investing options. You may not have the luxury of opening your own 401(k) as a stay-at-home mom, but you can still fund a spousal individual retirement account. Typically, IRAs must be funded with earned income. But when couples have one person working and the other not, they can contribute on behalf of the nonworking spouse. Their tax filing status must be married filing jointly to do so. A spousal Roth IRA would be a good start for you on your retirement savings journey, said Genkin, who is the founder of advisory firm My Financial Planner. They are funded with after-tax dollars, so when it comes time to withdraw from these accounts, the money will have grown tax-free and the withdrawals won't be taxed. They're also useful in the event of an emergency, as individuals can withdraw any of their own contributions (but not the earnings that accrued - there are separate rules for those distributions). In 2020, the contribution limit for a Roth IRA is $6,000 (or $7,000 for someone 50 or older). The couples' modified adjusted gross income (when married filing jointly) must be less than $196,000 to participate, so you're in the clear. Here's more information about spousal IRAs and how they work. There's an added bonus this year: If you have any spare money lying around, you can use it to fund a Roth IRA for 2019. In order to do so, call the financial firm you plan on using for your IRA and tell them you'd like the account to be funded for 2019. Individuals can max out their IRAs until the following year's Tax Day. When the CARES Act granted an extension for filing taxes until July 15 in light of the coronavirus crisis, it gave taxpayers an additional three months to put money in their accounts on behalf of the prior year. The fact that your husband is contributing to his 401(k) plan - and gets an employer match - is fantastic. If possible, and for the benefit of you both, maybe consider increasing that contribution 1 percentage point every year. That account is meant to fund retirement for your husband and you, so its contributions should reflect that. A recent study found families are not accounting for the nonworking spouse when relying on the other's income for retirement savings. Increasing the contribution, if only one or 2 percentage points at a time, will help create a secure retirement for the two of you, Genkin said. \"It's hard for young families with kids,\" she said. Although every dollar counts during this period, you likely won't feel the pain of getting less money in a paycheck if you increase the contribution once a year - especially if the account is a traditional 401(k), which is funded with pretax dollars, she said. Eventually, when more money comes in, you can consider opening another IRA on your husband's behalf or looking at other types of investment accounts. Stay-at-home moms have one of the hardest jobs. You're the chief executive officer of your family, taking care of the health and well-being of little ones while also abiding by strict schedules and budgets. \"They're running little companies,\" Ernst said. Still, there are a few nonfinancial tasks you can add to your list as you keep your retirement plans in the back of your mind. One task: Talk to your husband about the family finances. Money is a naturally emotional topic, and discussing it with a loved one can be stressful at times. Ernst suggests \"financial dates,\" where you sit down - maybe with a glass of wine or a cup of coffee - and talk over the last month or quarter's finances and what you expect you'll need to spend in the upcoming cycle. This is also a great time to chat about future plans and savings strategies. If you want help learning about money before talking about it, there are a few great resources specifically for women about savings, debt, investing and building wealth. Savvy Ladies and Ladies Get Paid are two examples. Another: If you are interested in entering the workforce in the future, stay up-to-date on the field you're interested in. That way, when it's time for an interview, you can tout all of the skills and education you have learned on the matter while you were taking care of your family at home. There is a significant retirement savings gap between men and women, and it usually has to do with pay discrepancies and the fact that women are more likely to leave a job to care for family members, including children and sick or elderly loved ones. An absence in the workforce also eats away at potential Social Security payments in the future, as those benefits are tied to numerous factors, including years in the workforce and earnings during that time. Workers' spouses are also eligible for Social Security benefits based on the working spouse's earnings - spousal benefits can be as much as half of the worker's benefit, though it depends on the spouse's age at retirement, the Social Security Administration said. To answer your question as directly as possible: It's not too late. You got this!"}]}