{"article": [{"url": "https://www.marketwatch.com/story/mondays-stock-market-selloff-sets-up-worst-september-in-18-years-11600706182", "published": 1600699880.0, "headline": "Mondayâ\u0080\u0099s stock-market selloff sets up worst September in 18 years", "body": "September trading is living up to its billing and then some. Stocks on Monday were seemingly unraveling a bullish trend that now risks thrusting U.S. equity benchmarks into a bearish tilt that could set the stage for the worst September selloff in years for the major equity gauges. The broad-market S&P 500 index SPX, +0.87% was down 2.5% at 3,326, at last check, putting it on the brink of sinking to 3,222.76, representing a 10% drop from its recent Sept. 2 record peak. A decline of 10% from a recent peak would meet the widely accepted definition for a correction but also sets the stage for an ugly September for the index. With a decline of about 7.5%, the index is on track for its steepest decline in a September, since 2002, when it crumbled 11% in the month on the back of growing fears of inflating internet-related stocks, according to Dow Jones Market Data. The Dow Jones Industrial Average DJIA, +0.56% was off by about 3% on the session, with the index looking at a month-to-date drop of 5.6%, which would represent its sharpest drop in September since 2011, if the decline holds at this level through the month. The tech-heavy Nasdaq Composite Index COMP, +1.39%, which has helped to support the lionâ\u0080\u0099s share of the marketâ\u0080\u0099s rebound from late-March coronavirus-induced lows, is down 9.8% in the month to date, setting up the possibility of its steepest September drop since 2008, at the height of anxieties during the 2007-08 financial crisis. Mondayâ\u0080\u0099s decline for stocks comes amid concerns about lofty valuations for highflying stocks that have led the market on the way up since March, but itâ\u0080\u0099s also fueled by an array of risks including delays to additional fiscal-stimulus packages, an increasingly heated U.S. election campaign season, amplified by the fight to replace Supreme Court Justice Ruth Bader Ginsburg, continuing tensions with China and the threat of renewed lockdowns in many places because of rising COVID-19 cases here and abroad. Read: The stock market is on a tear, but now comes September, the worst month of the year September is a historically poor month for stocks, with the 124-year-old Dow falling an average of 1% on the month, versus an average gain in all other months of 0.7%. Since 1937, the S&P 500 also has declinedÂ 1%, in September, on average, while the Nasdaq Composite has seen an average fall of 0.5%, according to Dow Jones."}]}