{"article": [{"url": "https://www.marketwatch.com/story/dow-ends-friday-around-3-off-record-closing-high-as-stock-market-wraps-up-best-august-in-36-years-2020-08-28", "published": 1598631680.0, "headline": "Dow ends Friday around 3% off record closing high as stock market is on track for best August in 36 years", "body": "U.S. stocks on Friday wrapped up the week and day higher, capping a powerful monthly rally for equities that leaves the main benchmarks at or near records, powered by gains in technology and e-commerce stocks as well as financials, amid growing optimism around coronavirus cures and treatments. The moves for the week were also framed largely by a speech from Federal Reserve Chairman Jerome Powell that likely ushered in an era of looser monetary policy after the central bank dropped its longstanding practice of pre-emptively lifting rates to head off higher inflation. The Dow Jones Industrial Average DJIA, +0.56% rose 0.6% at 28,653, the S&P 500 index SPX, +0.87% closed up 0.7% at 3,508, while the Nasdaq Composite Index COMP, +1.39% rose 0.6% to end at 11,696 (all closing levels are on a preliminary basis). Both the S&P 500 and the Nasdaq wrapped up the session at records. The Dow closed up positive for the year, erasing its coronavirus-induced losses, for a week-to-date gain of 0.4%. The blue-chip benchmarks is about 3% shy of its Feb. 12 record closing high. For the week, the Dow rose 2.6%, the S&P 500 surged 3.3%, while the Nasdaq Composite notched a weekly gain of 3.4%. For the month so far, the Dow gained 8.4%, the S&P 500 rose 7.2%, while the Nasdaq ended August up 8.8%. The gains for the Dow and the S&P 500 represent the best August returns thus far since 1984, according to Dow Jones Market Data. For the Nasdaq, it is the best August so far since 2000. In economic reports, data showed U.S. personal income rose 0.4% in July, while consumer spending was up 1.9%. Economists surveyed by MarketWatch expect had expected income to fall another 0.4% after a 1.1% drop in June. Spending was expected to show a 1.6% rise after a 5.6% increase in June. Separately, the final reading of the University of Michigan's August consumer sentiment index came in at 74.1 versus a preliminary reading of 72.8 and up from 72.5 in July."}]}