{"article": [{"url": "https://www.marketwatch.com/story/airline-stocks-led-higher-by-delta-air-after-travel-demand-rises-to-post-covid-19-high-2020-09-14", "published": 1600096520.0, "headline": "Airline stocks led higher by Delta Air after travel demand rises to post-COVID-19 high", "body": "Airline stocks were broadly higher Monday, led by Delta Air Lines Inc., after more positive travel demand data, with a surge in the broader stock market also providing support. The U.S. Global Jets exchange-traded fund JETS, +0.16% hiked up 2.0% in afternoon trading, while the Dow Jones Transportation Average DJT, +0.84% gained 0.5%, as all six of its airline components gained ground. Meanwhile, the Dow Jones Industrial Average DJIA, +0.56% rallied 310 points, or 1.1%. The gains come as data from the Transportation Security Administration showed that an average of 738,038 people went through TSA travel security checkpoints each day for the week ended Sept. 13. That’s above the 715,145 daily average of the previous week, which includes most of the Labor Day holiday weekend, which tends to see a boost in travel demand. Read more about Labor Day travel demand. Last week’s daily average was also the highest since the week ended March 22, and is well above the post-COVID-19 pandemic low of 97,799 for the week ended April 19. The gain in the daily average the past two weeks comes after the average fell for two-straight weeks during the second half of August. Delta Air’s stock DAL, +0.39% rose 3.2% to pace the sector’s gainers. The air carrier said earlier that it and its SkyMiles IP Ltd. subsidiary are planning to raise $6.5 billion through a bond offering and by entering a senior secured term loan facility. The company also said that while it is eligible to receive $5.4 billion in emergency relief through the Coronavirus Aid, Relief and Economic Securities (CARES) Act payroll support program, it doesn’t intend to participate in the program. For the quarter ending September, Delta said it expects system capacity to be down about 60% from a year ago, with domestic capacity down 50% and international capacity down 80%. BofA Securities analyst Andrew Didora raised his price target on Delta’s stock to $36 from $31, but kept his rating at neutral. Among other Dow transport components, shares of Southwest Airlines Co. LUV, +1.89% advanced 2.8%, American Airlines Group Inc. AAL, +0.34% climbed 1.8%, JetBlue Airways Corp. JBLU, -0.07% rose 2.1%, Alaska Air Group Inc. ALK, +0.15% climbed 2.2% and United Airlines Holdings Inc. UAL, +0.32% rallied 1.8%. Elsewhere, shares of Spirit Airlines Inc. SAVE, +1.35% surged 2.8%, Hawaiian Airlines parent Hawaiian Holdings Inc. HA, +0.36% gained 1.2% and Allegiant Travel Co. ALGT, +2.16% rose 2.2%. BofA Securities analyst Andrew Didora said he views airline stocks as options on a recovery from the COVID-19 crisis, and prefers those with longer duration in the form of liquidity runways. Didora said Southwest and Alaska Air, which he rates buy, have liquidity into 2023, while underperform-rated American and Hawaiian have the shortest runways, until August 2021. He raised his stock price targets for Alaska Air to $55 from $50, for JetBlue to $13 from $12, for Spirit Airlines to $12 from $10 and for Allegiant Travel to $147 from $130. He kept his targets for American at $, for United at $40, for Southwest at $44 and for Hawaiian at $14."}]}