{"article": [{"url": "https://www.marketwatch.com/story/how-to-assess-the-risks-before-you-invest-in-a-spac-11602261758", "published": 1602247820.0, "headline": "How to assess the risks before you invest in a SPAC", "body": "MarketWatch photo illustration/iStockphoto Special purpose acquisition companies (SPACs) are the “flavor of the year” in the capital markets—but will they leave a bad taste in investors’ mouths? As the founder of a business dedicated to training financial professionals in topics such as corporate finance, financial modeling and valuation, I have real concerns that some investors, particularly retail investors, may not understand what they’re getting into when they buy shares in a “blank check” company. SPAC sponsors, investment banks and investors clearly have no hesitation about jumping on the SPAC bandwagon. There have been 128 SPAC public offerings so far this year, raising an aggregate of more than $49 billion, according to SPAC Insider. At least for now, SPACs are outstripping conventional capital raising vehicles: funds raised through SPAC deals exceeded traditional IPOs for most of the third quarter. Read: 2020 is the year of the SPAC — yet traditional IPOs offer better returns, report finds The intense interest in SPACs is certainly understandable. Sponsors are able to access capital through a process that is faster than a traditional IPO, provides considerable flexibility in completing an acquisition, and leaves them with a potentially lucrative 20% stake in the equity of the SPAC. Target companies are able to go public without the loss of control that might accompany a straight M&A transaction. And retail investors see an opportunity to participate in a buyout, a privilege that is usually available only to sophisticated private equity or venture investors. The stock-market performance of some SPACs, such as DraftKings Inc. DKNG, -4.51%, which has surged since its debut, has helped to entice investors. Upward pressure on target company prices Where I have some concern is that as the capital raised by SPACs grows exponentially and the time to make an acquisition grows short, there may be pressure on SPAC sponsors to do deals at unrealistic valuations. Each SPAC generally has a window of 24 months to complete a transaction before it must liquidate and return its capital to investors. At this writing, 113 of the SPACs that completed IPOs in 2020, and 30 of the 2019 vintage, are still searching for targets. If the demand for deals exceeds the supply of quality acquisition targets, there can be adverse consequences for investors. “ The latest flurry of SPAC offerings has attracted sponsors from the worlds of sports, politics or other realms not known for investment acumen. ” One possibility is that a SPAC sponsor may feel pressure to do a deal at an unrealistically high price, which will impact the future return to investors. Conversely, if investors fail to approve an unattractively priced acquisition, the SPAC may have no choice but to return the capital, which means the investors’ money has been tied up for two years with no upside. Unfortunately, many retail investors are not equipped to assess the valuation of a SPAC’s target company if it has no operating history, revenue or cash flow. If a SPAC is buying such a start-up venture, investors may be voting to approve a transaction whose purported value is based on future growth projections or unproven strategies. Venture capital and private-equity firms are paid to make such judgments, but individual investors may not be comfortable with, or equipped to understand, that level of uncertainty and risk. In contrast, Utz Quality Foods UTZ, -0.60% went public on the NYSE in late August through an acquisition by a SPAC called Collier Creek Holdings. Utz is a maker of snacks with a nearly 100-year history and 2019 sales of nearly $770 million. Its value could be assessed by discounting cash flows, using public company comparables, and analyzing similar precedent transactions. Most SPAC acquisitions, however, don’t fit that profile. Carefully evaluate SPAC sponsors—and targets Since a SPAC is by definition a shell with no operating cash flow and no specified target at the time of their IPO, how can investors make informed investment decisions? Ultimately, it comes down to the capability and reputation of the sponsor. A significant number of recent SPACs have been launched by seasoned private-equity players. These PE firms presumably know their way around M&A deals. But the latest flurry of SPAC offerings has also attracted sponsors from the worlds of sports, politics or other realms not known for investment acumen. Investors would be well advised to carefully research the credentials and track record of any SPAC sponsor. If you already own shares in a SPAC, it will be important to take a hard look at the acquisition you are being asked to vote on. For example, Playboy Enterprises Inc. recently agreed to go public by merging with a SPAC called Mountain Crest Acquisition Corp. MCAC, -0.10% Also achieving public company status via a SPAC was electric truck maker Nikola Corp. NKLA, -1.36% While both companies may ultimately succeed, some investors believe Playboy needs to demonstrate the validity of its current business model, and Nikola has faced fraud allegations from short sellers. Read: Here’s what Wall Street is saying about Nikola founder’s ‘shocking’ departure When assessing an acquisition target, SPAC investors may want to ask such questions as: Is the target business established and generating cash flow? If not, does it have a viable strategy and is it positioned to achieve its goals? Will the company need to make major investments in technology, talent or other resources to succeed? How accomplished is the management team, and are they staying with the company after its acquisition by the SPAC? Does the target company have a durable, competitive advantage, such as a patent or cutting edge technology, that gives them “a wide and long-lasting moat,” to quote from Warren Buffet’s most important factor when evaluating an investment? What are the target’s biggest risks factors? The SPAC structure is certainly an important capital raising vehicle, and offers benefits to sponsors, company managements and investors. But investors must not underestimate the difficulty of valuing a SPAC or its designated target. The “fear of missing out” on the SPAC boom is no substitute for sound judgment in evaluating a SPAC investment. Scott Rostan is CEO of Training The Street."}]}