{"article": [{"url": "https://www.marketwatch.com/story/silver-poor-mans-gold-no-more-2020-07-30", "published": 1596269960.0, "headline": "Silver: poor manâ\u0080\u0099s gold no more?", "body": "Investors have focused on a rise in record prices for gold, but silverâ\u0080\u0099s up about 25% in Julyâ\u0080\u0094the metalâ\u0080\u0099s second-biggest monthly gain on recordâ\u0080\u0094and itâ\u0080\u0099s still undervalued compared with the yellow metal. â\u0080\u009cSilver is often called the â\u0080\u0098poor manâ\u0080\u0099s goldâ\u0080\u0099 because some of the same factors that cause gold prices to rise do the same thing to silver prices,â\u0080\u009d says Ed Moy, chief market strategist at gold retailer Valaurum. â\u0080\u009cAnd what is driving gold prices now are mainly the fear of inflation due to the magnitude of the monetary and fiscal stimulus worldwide, and the flight to safety due to the uncertainty around how and when the global economy will recover.â\u0080\u009d Silver, however, is â\u0080\u009ccheaper per ounceâ\u0080\u009d than gold, and its prices are much more volatile, he says. It has also been â\u0080\u009clagging behind goldâ\u0080\u0099s riseâ\u0080\u009d and the ratio of the number of ounces of silver to buy one ounce of gold is historically high, implying that either â\u0080\u009cgold is overpriced or silver is underpriced.â\u0080\u009d “ If silver is underpriced, â\u0080\u0098there is a lot of money to be made.â\u0080\u0099 ” â\u0080\u0094 Ed Moy, Valaurum If silver is underpriced, â\u0080\u009cthere is a lot of money to be made,â\u0080\u009d says Moy, who was director of the U.S. Mint from 2006 to 2011. Silver futures US:SIU20 Â SI00, +5.96% Â settled at $24.501 an ounce on July 27, the highest for a most-active contract since August 2013. As of July 30, they traded about 25% higher this month, but stand nowhere near the record-high $48.599 from April 2011. In comparison, gold US:GCQ20 GC00, +2.17% Â climbed to a record settlement at $1,953.40 on July 29, up around 8.5% this month. Read:Gold rides to a record, with prospects for $2,000 an ounce stronger than ever â\u0080\u009cSilver is not even halfway to its all-time high,â\u0080\u009d says Ryan Giannotto, director of research at exchange-traded-fund-issuer GraniteShares. While itâ\u0080\u0099s unlikely silver would more than double in the immediate future, itâ\u0080\u0099s â\u0080\u009cunwise to rule out extreme scenarios.â\u0080\u009d It takes more than 80 ounces of silver to buy one ounce of gold. Though the ratio has seen a significant decline in recent months, itâ\u0080\u0099s still well above the typical gold-to-silver ratio, which Moy pegs at one ounce of gold to 60 ounces of silver. Read Metals Stocks column:Gold prices suffer first loss in 10 sessions Ross Norman, CEO of precious-metals news and information provider Metals Daily, says the ratio between the metals rose to a 4,000-year high at 126 on March 18. â\u0080\u009cIt has been clear for some time that silver was excessively cheap compared to gold,â\u0080\u009d he says. The ratio is still historically high, â\u0080\u009csuggesting there is scope for greater gains in silver still.â\u0080\u009d He says gold â\u0080\u009coften looks to silver to â\u0080\u0098authenticateâ\u0080\u0099 its rally,â\u0080\u009d and if the differential between the two metals becomes too wide, as it has recently, then gold â\u0080\u009cstalls.â\u0080\u009d For now, gold, at an all-time high, is largely â\u0080\u009cuntethered from technical resistance levels.â\u0080\u009d For those looking to invest in the silver market, futures contracts are â\u0080\u009cgood for experienced speculators who know how to navigate complicated transactions and have time to make moment-by-moment decisions and compete with financial investment professionals,â\u0080\u009d says Moy. For most individual investors, government-made silver bullion coins are an attractive way to invest, he says, and governments guarantee the weight, content, and purity of each coin. A spokesman for the U.S. Mint said the bureau has shipped 604,000 more ounces of silver bullion this year through June, compared with the same time last year. Coins, however, may see â\u0080\u009csteep commission markupsâ\u0080\u009d over the spot price, says Giannotto. He considers ETFs the â\u0080\u009cbest, easiest, and lowest-cost way to access precious metals.â\u0080\u009d The silver-backed iShares Silver Trust SLV, +5.54% Â has gained around 28% in July. Silver can â\u0080\u009ctrade idiosyncratically and, at times, violently,â\u0080\u009d so those entering the market may want to consider â\u0080\u009cbalancing out exposure with other historically less-volatile precious metals such as gold or platinum,â\u0080\u009d says Giannotto."}]}