{"article": [{"url": "https://www.marketwatch.com/story/clean-energy-technology-often-faces-a-valley-of-death-this-idea-would-change-that-2020-10-09", "published": 1602247100.0, "headline": "Clean-energy technology often faces a 'valley of death' - this idea would change that", "body": "To address climate change over the coming decades, all nations will need to transition to energy resources that emit less carbon. This transformation, already under way, will require many new technologies. The U.S. is a world leader in scientific research and technological development. But new inventions have to be brought to market and then widely adopted to have a deep impact. And in the clean energy field, the United States doesn't do as well at making that happen as one might be expect, given its strength in basic research. The energy transition might stall if the U.S. doesn't overcome this problem, endangering human health and the environment. Research I carried out with Jetta L. Wong, the founding director of the Office of Technology Transitions at the U.S. Department of Energy, suggests that creating a new foundation that would be authorized by Congress to work closely with the Energy Department could help.'Valley of death' Government policies to help clean energy companies commercialize their technologies are necessary because markets tend to be biased against them. This is true for many types of innovation, but it is particularly so for low-carbon innovation. The general problem is so well-known it has a catchy name: \"the valley of death.\" It takes money to turn a prototype into a product and persuade customers to buy it. It's also risky. And it takes time. These hurdles deter investors, particularly when a project requires a lot of money, takes a long time and has uncertain returns. The valley of death - often depicted as a desert - is a metaphor for what innovators experience. They have to stay on a tight budget for as long as it takes for their businesses to become self-sustaining. The valley of death is less challenging for software innovations like smartphone apps. A few people can write the code. If the app is a hit, it can be distributed almost instantly to billions of users. Profits can come in quickly and really pile up. But for hardware innovations that can reduce the greenhouse gas emissions that cause climate change - innovations such as new ways to make steel or cement or generate electricity - the valley is much wider and deeper. These methods and machines are very complex and expensive to develop and install. They would replace existing systems that are more familiar, and usually less costly, and may last a long time. Most potential customers prefer to see multiyear track records of reliability and affordability before they commit to adopting such innovations. As a result, many energy innovators never get enough funding to cross the valley of death. Promising tech never gets a chance to prove what it can do. Some technological pathways are never pursued because of a fear of failure. The Energy Department has sought to bridge the valley of death for clean energy innovations, with some success. But its efforts are inevitably limited by the complex legal requirements that bind all federal agencies and a risk-averse culture that makes it difficult to move quickly and aggressively. The 'valley of death' is a metaphor for how long it can take to scale up innovations and inventions. Jetta Wong/Information Technology & Innovation Foundation, CC BY-SA Longtime precedents The idea that a government agency such as the Department of Energy should create a private foundation to help it solve a problem like the \"valley of death\" may strike you as odd. But there are precedents. The oldest federal philanthropic partner of this kind, the National Park Foundation, dates from 1935. Our research turned up eight others with missions ranging from agricultural research to public land stewardship to advancing military medicine. Since they are free from many government regulations and raise most of their funding from private sources, these foundations can undertake tasks that federal agencies might have trouble carrying out. They can move more quickly, too. This model is particularly useful for creating and funding complex public-private partnerships to advance science and technology related to an agency's mission. A great example is Accelerating COVID-19 Therapeutic Interventions and Vaccines. The Foundation for the National Institutes of Health coordinates this partnership, which involves government agencies, funders and drugmakers. Set up in a matter of weeks in the spring of 2020, it has already led to numerous clinical trials.To-do list The work of a clean energy foundation set up along these lines might focus on challenges that are too complex for either the public or the private sector to tackle alone. Such challenges cause particularly wicked valleys of death for would-be innovators. For instance, maritime shipping causes about 3% of global carbon emissions. Cleaning up emissions from ships and port operations is not as simple as swapping out dirty engines for clean ones. Zero-carbon ports may need new kinds of fueling facilities for ships and trucks and new systems for handling freight and passengers. Their physical layouts may need to be redesigned. Getting these tasks done will require many different kinds of companies to collaborate with public agencies from all levels of government, including the Navy. Innovators trying to reduce carbon emissions from agriculture, mining, construction and manufacturing will have to surmount similar challenges. A clean energy foundation might convene stakeholders, mobilize private and philanthropic partners and devise strategies to bring technology solutions to these challenges to market. It could bring to these collaborations access to the world-class expertise and facilities of the department's 17 national laboratories and network of academic researchers. A clean energy foundation could also work with states and localities to deepen the public-private partnerships that fuel these efforts. For instance, it could help the National Renewable Energy Laboratory just outside of Denver to collaborate more easily and fruitfully with Colorado clean energy innovators. It could also tap into experts affiliated with the Energy Department to fill gaps in places lacking major federal labs. A foundation focused on technology commercialization would complement many existing Energy Department programs, rather than substitute for them. For instance, it may be able to work around bureaucratic barriers to seed new initiatives that could then be taken up on a larger scale by the government itself.Next steps A clean energy foundation would work best if Congress authorized it, and lawmakers are moving in that direction. After a hearing in July on Capitol Hill, a bipartisan authorization measure was included in an energy package that passed the House of Representatives on Sept. 24. This measure would direct the Energy Department to establish a nonprofit, independent foundation to work with it on innovation initiatives. The foundation would have the ability to raise funds from private donors to support technology commercialization. It would direct the department to work closely with the foundation and cut some of the red tape that would otherwise impede a close relationship. Companion legislation is pending in the Senate. David M. Hart is professor of public policy at George Mason University. This article was published with permission from The Conversation."}]}