{"article": [{"url": "https://www.marketwatch.com/story/beyond-meat-incogmeato-impossible-foods-up-ante-in-plant-based-meat-market-2020-08-27", "published": 1598512100.0, "headline": "Beyond Meat, Incogmeato, Impossible Foods up ante in plant-based meat market", "body": "Consumers hungry for more plant-based meat options are getting plenty Thursday. Beyond Meat Inc. BYND, +0.80% launched an e-commerce site, shop.beyondmeat.com, that offers its products directly to consumers, while Incogmeato by MorningStar Farms is offering the largest new product line launch in the brand’s 40-year history. The direct-to-consumer site is the digital equivalent to Beyond’s presence in more than 26,000 retail outlets nationwide, including Target Corp. TGT, +1.14% and Amazon.com Inc.’s AMZN, +3.01% Whole Foods Market Inc., as well as club stores such as Costco Wholesale Corp. COST, +1.19% and BJ’s Wholesale Club Holdings Inc. BJ, +1.19% . Meanwhile, MorningStar Farms, a division of Kellogg Co. KELL, +0.84% , is rolling out a Iine of meatless burger patties, bratwurst, Italian sausage, and Chik’n nuggets as part of a nationwide marketing campaign, according to Sara Young, general manager of plant-based protein at Incogmeato, told MarketWatch in a phone interview. Young said 60% of Americans want to try plant-based proteins, based on a Cambridge Group study. The moves come amid a significant ramp-up in the distribution of meat-less products to consumers. Since March, Impossible Foods Inc. has increased its presence at grocery outlets 60 times to 9,000 stores that include Kroger Co. KR, +0.46% and Walmart Inc. WMT, +1.00% . Additionally, Impossible products are sold through Starbucks Corp.’s SBUX, +0.53% 15,000 stores. In June, Impossible launched a direct-to-consumer e-commerce site with free delivery for orders over $75 in the continental United States. This week, Impossible said its flagship product is now available in packages of two pre-formed, quarter-pound (4-oz.) burger patties at nearly 2,000 grocery stores nationwide owned by Kroger. Read more: Impossible Foods gets $200 million in funding"}]}