{"article": [{"url": "https://www.marketwatch.com/story/more-than-3-in-4-college-students-plan-to-return-to-campus-this-fall-but-they-promise-not-to-party-2020-07-15", "published": 1595063600.0, "headline": "More than 3 in 4 college students plan to return to campus this fall - but they promise not to party", "body": "College students are ready to return to campus this fall - and most promise to put academics and public safety over partying in the midst of the pandemic. In fact, 76% of students in a new College Reaction/Axios poll said they plan to return to campus if their schools give them the option, and 66% said they would attend in-person classes if those were on the table. Most said they were willing to wear face masks and download an app to conduct contact tracing, and 67% would leave campus again if there was a major outbreak in their community. What's more, a whopping 79% of surveyed students said that they wouldn't attend parties the way they did before the COVID-19 pandemic swept the globe and forced schools to close. And even if athletic events stage a comeback, 71% of students said they would sit out going to games. Related:Should you attend college next fall? Before deciding, here are all the questions you should NOT be afraid to ask The poll was conducted online between July 13-14 from a representative sample of 800 college students. But a few students that MarketWatch spoke with questioned the results, and shared their own concerns about returning to campus while novel coronavirus cases continue to spike across most of the U.S., and the global case tally has passed 13.3 million. Incoming William & Mary sophomore Jonny H., who declined to give his last name, said he plans to opt out of his dorm agreement and live with friends in an off-campus apartment while attending online classes, even if his campus is open. And he said that many of his classmates are taking gap semesters or staying home, since they fear getting sick or getting their families sick. \"I'm just not sure how safe it is having so many people from different places back in one area,\" said Jonny, 19. \"Stuff like the flu and mono already travel really easily on college campuses, so I know a coronavirus outbreak could harm a lot of people at my school.\" Daniel Schoester, 20, a senior at Wilfrid Laurier University in Ontario, Canada, said that his school made \"the right call\" in moving almost all classes online this fall, except for some science labs that may have to be held in person. The business major plans to live off campus with friends rather than in the dorms, because he's concerned about contracting the coronavirus without realizing it. \"Getting it and passing it on to my family, that's the biggest fear,\" he said. But he would be up for attending smaller in-person classes with social distancing measures if they were available this fall. \"I would be way more comfortable with 15 or 20 people in classes than if it were 50, or those first-year classes that have like 1,000 people in a lecture hall. That would be a bad idea,\" he said. \"But I would prefer to go to campus,\" he continued, \"because you get to connect with people and with what you're learning about more than you would with a Zoom ZM, +2.89%  call.\" Read more:How COVID-19 could spread on college campuses. Will students be safe? Schools, students and parents are grappling with the challenges of returning to campuses and in-person classes this fall, especially considering the petri dish environments where young adults share dorms and dining halls, or pack into classes, sporting events and extracurricular activities. One model run by a University of Pennsylvania mathematics professor found that with no interventions, more than 2,000 people would be infected within 30 days of the first COVID-19 infection, and about 90% of the school population would end up infected by midterms. But the model found that safety measures such as keeping large classes online and mandating facial coverings and masks, as well as moving smaller classes into bigger classrooms to allow for social distancing, had a significant impact in limiting the spread of the virus. Many colleges are trying to balance health and safety with revenue concerns, as so many schools rely on tuition, housing and parking fees, meal plans and other auxiliaries to stay afloat. So that's why the majority of colleges that have announced their fall semester plans still intend to bring students back for an in-person semester. Harvard, on the other hand, has announced that all of its classes will be held online this fall, while Yale, Princeton, Rutgers and the University of Massachusetts at Amherst are leaning towards a hybrid model, with most classes being offered remotely. Princeton is opening its campus to freshman and juniors in the fall, while sophomores and seniors can return to campus in the spring, for example, to reduce population density. Rutgers will offer \"extremely limited\" on-campus housing, and campus events will be suspended this fall. Read more:Harvard and other elite schools say classes will be mostly remote this fall Suspending campus events may be a smart call. Both Jonny and Schoester questioned how realistic it is to expect coeds to refuse the temptation of socializing and partying, especially in light of recent reports of outbreaks among young adults that have been traced back to bars and July 4th parties. \"I don't think a lot of students will stick to their word and stay away from parties or social events, including me,\" Jonny admitted. \"I think the temptation will be too much for a lot of students.\" Schoester agreed, noting that bars have reopened with outdoor drinking and dining patios in his area, which are \"packed every single night\" and draw long lines. But it isn't so surprising that students are willing to risk coronavirus exposure to return to school. Traditional gap year options are a no-go. \"You can't travel,\" Schoester noted. And finding work can be a tall order in this pandemic-ravaged economy. In fact, a recent graduate went viral on LinkedIn after posting about how grateful she is to find a job stocking shelves at Target TGT, +1.14%. As the Axios survey noted, \"returning to a much tamer campus with far more restrictions sounds a lot better than not going back at all.\" Read more of MarketWatch's coronavirus coverage here."}]}