{"article": [{"url": "https://www.marketwatch.com/story/weekend-reads-a-breakdown-of-all-the-covid-19-relief-programs-for-consumers-2020-07-10", "published": 1594455680.0, "headline": "Weekend reads: A breakdown of all the COVID-19 relief programs for consumers", "body": "Even after many months of tragedy and shutdowns, the coronavirus crisis continues to unfold. It was easy to expect a steady, organized reopening of businesses, state by state, but the new outbreak of infections has complicated the economic recovery. Joy Wiltermuth shares a guide that lists various assistance programs for people suffering financial losses from the coronavirus crisis, and eligibility requirements. Related:Coronavirus is changing us — but which of these lessons are we learning?Where to retire Silvia Ascarelli continues her series offering readers retirement destinations to fit their personal circumstances. This couple is eyeing North Carolina and South Carolina — but not along the coast. Where should you go? Try MarketWatch’s retirement location tool for a customized set of answers.Avoid these mistakes when selecting a retirement destination Don’t focus just on low taxes, writes CD Moriarty. And consider whether your vacation spot truly works for everyday life. Ready to head back to the office? iStockphoto Will you really have to go back to the office when the boss says it’s time? Elizabeth Tippett, an associate professor at the University of Oregon’s School of Law in Eugene, explains what your options might be if your employer insists you stop working from home.How to protect yourself when you lend money to a family member Even with the best of intentions among everyone involved, you can take a painful financial hit if you lend money to a family member. Bill Bischoff explains how to make a tax-smart loan.Will you ever achieve financial independence? Alessandra Malito helps a reader who feels overwhelmed with debt, a growing family and the need to move for work.An overlooked investment opportunity brought about by COVID-19 Michael Brush says stocks in this industry are overly discounted and that this is the time to buy. More from Brush:Five ways to beat the stock market — from a fund manager who’s done this for years FactSet Bank earnings season The KBW Bank Index BKX, -0.33% has fallen 38.6% this year (with dividends reinvested), while the S&P 500 index SPX, +0.87% is down only 1.4%. Some investors see an opportunity in cheaply valued bank stocks, while others steer clear amid the economic uncertainty. Here’s what to expect when the largest U.S. banks report their second-quarter results next week. Want more from MarketWatch? Sign up for this and other newsletters, and get the latest news, personal finance and investing advice."}]}