{"article": [{"url": "https://www.marketwatch.com/story/an-estimated-500-000-people-in-oregon-forced-to-flee-wildfires-11599833943", "published": 1599825800.0, "headline": "An estimated 500,000 people in Oregon forced to flee wildfires", "body": "Dora Negrete is consoled consoled by her son Hector Rocha after seeing their destroyed mobile home at the Talent Mobile Estates, Thursday, Sept. 10, 2020, in Talent, Ore., after wildfires devastates the region. (AP Photo/Paula Bronstein) AP PHOENIX, Ore. (AP) — Deadly wildfires in heavily populated northwest Oregon were growing, with hundreds of thousands of people told to flee encroaching flames while residents to the south tearfully assessed their losses. The number of people evacuated statewide because of fires rose to an estimated 500,000 — more than 10 percent of the state’s 4.2 million people, the Oregon Office of Emergency Management reported late Thursday. One fire approached Molalla, triggering a mandatory evacuation order for the community of about 9,000 located 30 miles (48 kilometers) south of Portland. A police car rolled through the streets with a loudspeaker blaring “evacuate now.” Inmates were being moved from a women’s prison less than a mile (1.6 kilometers) from Interstate 5 in Portland’s southern suburbs “out of an abundance of caution,” the Oregon Department of Corrections said. With two large fires threatening to merge, some firefighters in Clackamas County, which includes Molalla, were told to disengage temporarily because of the danger. Officials tried to reassure residents who abandoned their homes and law enforcement officials said police patrols would be stepped up to prevent looting. The local fire department said on Twitter: “To be clear, your firefighters are still working hard on the wildfires in Clackamas County. They are taking a ‘tactical pause’ to allow firefighters to reposition, get accountability & evaluate extreme fire conditions.” Buildings are engulfed in flames as a wildfire ravages the central Oregon town of Talent near Medford late Tuesday, Sept. 8, 2020. (Kevin Jantzer via AP) AP “We haven’t abandoned you,” the fire officials said. Residents of the small Oregon town of Phoenix near the California state line walked through a scene of devastation after one of the state’s many wildfires wiped out much of their community. A mobile home park, houses and businesses were burned, leaving twisted remains on charred ground. Many of the residents were immigrants, with few resources to draw on. Artemio Guterrez stood helplessly next to his pick-up, surveying the rubble of his mobile home. His children sat quietly in the truck bed and waited for him to salvage what he could. He found a ceramic pot with a smiley face on it, some charred miniature houses from a Christmas-themed village and a cross that formed when two pieces of glass melted together. Guterrez, a single father of four, had been at work at a vineyard nearby when he saw thick smoke spreading through Rogue River Valley. He raced home just in time to snatch his kids from the trailer park where they live alongside dozens of other Mexican families. They got out only with the clothes they were wearing. “I’m going to start all over again. It’s not easy but it’s not impossible either. You have to be a little tough in situations like this,” said Guterrez, who had just returned from his mother’s funeral in Mexico. Entire mobile home parks with many units occupied by Mexican immigrants who worked in nearby vineyards or doing construction were reduced to ash in Phoenix and nearby Talent. “We’re kind of like a family. We’ve known each other for years, since we came here or even before then,” Guterrez said of his neighbors at Talent Mobile Estates. “We’re living day by day.” As the fire approached Phoenix, Jonathan Weir defied evacuation orders, even as flames 30 feet (9 meters) high shot from trees. Fearing for his life, he drove his car to the entrance of a nearby mobile home park, where his tires began melting. His home was destroyed as the fire hopscotched through the town of 4,000 residents. “There were flames across the street from me, flames to the right of me, flames to the left of me. I just watched everything burn,” Weir told a reporter. The Federal Emergency Management Agency estimated that 600 homes were burned by the fire that started in Ashland and tore through Phoenix, the Mail Tribune of Medford reported. Oregon officials haven’t released an exact death count for the wildfires but at least four fatalities have been reported in the state. One person was killed in wildfires in Washington. Oregon officials said they were shocked by the number of simultaneous fires, which stood at 37 Thursday, according to the state Office of Emergency Management. Gov. Kate Brown said more than 1,400 square miles (3,600 square kilometers) have burned in Oregon over the past three days, nearly double the land that burns in a typical year in the state and an area greater than the size of Rhode Island. The Pacific Northwest fires fueled unsubstantiated social media posts blaming coordinated groups of arsonists from both the far left and far right for setting the blazes. Officials turned to Facebook to squash the competing narratives. Journalists have captured searing, intimate images of active and dangerous wildfires burning in California, due in large part to a decades-old state law that guarantees press virtually unfettered access to disaster sites in evacuated areas that are off-limits to the public. The access isn’t as open in other states prone to wildfires. Back in Phoenix, Marty Curtis considered herself lucky. Her house was spared and she escaped with her cat, Louie. “You could see the flames. You could hear things popping — gas tanks and propane tanks exploding,” she said. “I have my house. I have my life. I have my cat and I have my job — and right now, that’s all I need.” Selsky reported from Salem, Oregon. Associated Press writers Sara Cline in Salem; Nick Geranios in Spokane, Washington; and Lisa Baumann in Seattle contributed to this report. AP freelance photographer Paula Bronstein also contributed to this report from Talent and Phoenix, Oregon. At a news conference Thursday, Gov. Kate Brown said there have been fatalities but the exact number is not yet known. There have been at least three reported fire deaths in the state."}]}