{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-vaccine-still-might-not-lead-to-herd-immunity-in-us-fauci-warns-2020-06-28", "published": 1593388700.0, "headline": "Coronavirus vaccine still might not lead to herd immunity in U.S., Fauci warns", "body": "The U.S. is “unlikely” to develop herd immunity to COVID-19, Dr. Anthony Fauci said Sunday, due to the likely combination of only a partially effective vaccine and the large number of people who refuse to take it. Speaking Sunday night to CNN’s Elizabeth Cohen as part of the Aspen Ideas Festival, Fauci said he would “settle” for a coronavirus vaccine that is 70% to 75% effective. By comparison, a measles vaccine is 97% to 98% effective. “That would be wonderful if we get there,” Fauci, the government’s top infectious disease expert, said. “I don’t think we will. I would settle for a 70, 75% effective vaccine.” Fauci said he remains confident a vaccine will be developed. A number of promising drugs are in development, and it is hoped a vaccine can be distributed as soon as the end of the year, though officials warn that is likely an overly optimistic view. Read: Race for a COVID-19 vaccine has drug makers scaling up manufacturing — before one is developed But Fauci pointed out another obstacle: “There is a general anti-science, anti-authority, anti-vaccine feeling among some people in this country — an alarmingly large percentage of people, relatively speaking.” “We have a lot of work to do” on educating the public about a potential vaccine, Fauci said. “It’s not going to be easy.” According to a CNN poll in June, about one-third of Americans would not get a coronavirus vaccine if one were to be developed and widely distributed at a low cost. Herd immunity is only achieved once “a sufficient proportion of a population is immune to an infectious disease (through vaccination and/or prior illness) to make its spread from person to person unlikely,” according to the CDC. Watch the whole interview here: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } ."}]}