{"article": [{"url": "https://www.marketwatch.com/story/france-uk-to-extend-rules-on-face-coverings-in-public-2020-07-14", "published": 1594728740.0, "headline": "France, U.K. to extend rules on face coverings in public", "body": "LONDON (AP) — British Health Secretary Matt Hancock said Tuesday that the wearing of face coverings will be mandatory in shops and supermarkets in England. The requirement is expected to take effect from July 24. The decision follows weeks of prevarication by the government over their worth during the coronavirus pandemic. On the other side of the English Channel, amid signs of a slight virus resurgence in France, President Emmanuel Macron said Tuesday he also wants to require masks inside all indoor public spaces by Aug. 1. Hancock told lawmakers in the House of Commons that face coverings can help keep people working in shops safe and can give people more confidence to shop safely. “We are not out of the woods yet so let us all do our utmost to keep this virus cornered and enjoy summer safely,” he said. Already, people in England have to wear face coverings on public transport and in a hospital setting. Anyone not wearing a face covering in the environments outlined by the government could be fined 100 pounds ($125) and shops can refuse entry to anyone failing to comply. Children under 11 and those with certain disabilities will be exempt. Hancock stressed that wearing a face covering complements the other measures aimed at keeping a lid on the pandemic, such as washing hands and abiding by social distancing rules. Hancock said “we cannot let our progress today lead to complacency tomorrow.” Many European nations, including Germany, Spain, Italy and Greece, already require masks to be worn in enclosed spaces. Britain and France have taken a more relaxed attitude to face coverings, recommending masks but not requiring them — at least until now. British Prime Minister Boris Johnson, who in the spring spent a week in the hospital being treated for COVID-19, had not been seen in public in a mask until last week. On Monday morning, he urged people to wear them. Monday evening, his government announced it would be compulsory. In an interview with French television networks marking Bastille Day, France’s Macron said “the best prevention” against the virus is masks, social distancing and hand washing. Recent rave parties in France and widespread backsliding on social distancing – even within Macron’s presidential palace and other government facilities - have raised concern lately, so the government has been weighing tougher mask guidance. British authorities are hoping the public will simply comply. London Mayor Sadiq Khan told the BBC he believed that “Londoners by and large will follow the rules,” without too much need for the police. “The problem is not the issue of enforcement, the problem is the mixed messages and the confused communications,’’ Khan said. Environment Secretary George Eustice also did not rule out the possibility that mandatory face coverings would become compulsory in offices and other workplaces in the future. He told the BBC on Tuesday that the government was taking “one step at a time and we’ve taken the view in this next step that we should make it mandatory in retail environments.” The new requirement only applies to in England. Scotland has already made masks mandatory in stores. A growing body of evidence suggests wearing face coverings brings some benefit in preventing the spread of the virus."}]}