{"article": [{"url": "https://www.marketwatch.com/story/wimbledon-is-cancelled-this-year-but-it-will-still-pay-out-125-million-in-prize-money-to-be-split-among-620-players-2020-07-10", "published": 1594383260.0, "headline": "Wimbledon is cancelled this year, but it will still pay out $12.5 million in prize money, to be split among 620 players", "body": "WIMBLEDON, England (AP) — Wimbledon will pay out $12.5 million in prize money to 620 players despite the tournament’s cancellation because of the coronavirus pandemic, the All England Club said Friday. After consulting with its insurance provider, club officials said 256 players who would have competed in the main draw will each receive 25,000 pounds ($31,000), while 224 players who would have competed in qualifying will each receive 12,500 pounds ($15,600). “Immediately following the cancellation of The Championships, we turned our attention to how we could assist those who help make Wimbledon happen,” All England Club chief executive Richard Lewis said. In addition, 120 players who would have competed in doubles will each receive 6,250 pounds ($7,800); 16 players who would have competed in the wheelchair events will each receive 6,000 pounds ($7,500); and four players who would have competed in the quad wheelchair events will each receive 5,000 pounds ($6,200). “We know these months of uncertainty have been very worrying for these groups, including the players, many of whom have faced financial difficulty during this period and who would have quite rightly anticipated the opportunity to earn prize money at Wimbledon based on their world ranking,” Lewis said. The pandemic forced officials to cancel the tournament for the first time since 1945. “We are pleased that our insurance policy has allowed us to recognize the impact of the cancellation on the players and that we are now in a position to offer this payment as a reward for the hard work they have invested in building their ranking to a point where they would have gained direct entry into The Championships 2020,” Lewis said. The club also announced that the grass court seeding formula used since 2002 “has served its time.” Beginning in 2021, seeding for the men’s singles draw will be based solely on ranking, the club said, but there will be no change to the method of seeding for the women."}]}