{"article": [{"url": "https://www.marketwatch.com/story/justice-department-lawyers-to-testify-before-house-judiciary-committee-about-doj-politicization-under-william-barr-2020-06-16", "published": 1592333300.0, "headline": "Justice Department lawyers to testify before House Judiciary Committee about DOJ politicization under William Barr", "body": "WASHINGTON (AP) — House Democrats have subpoenaed two Justice Department lawyers to testify before the Judiciary Committee about the politicization of the agency in the Trump administration, the committee’s chairman said Tuesday. The subpoenas set up a potential showdown between Congress and Attorney General William Barr about whether the prosecutors would be allowed to appear before the committee and what they would be permitted to discuss. The subpoenas were announced Tuesday for Aaron Zelinsky, a career Justice Department prosecutor who worked on cases as part of special counsel Robert Mueller’s investigation, including the case against Trump ally Roger Stone, and John Elias, a career official in the department’s antitrust division. Zelinsky was one of the four lawyers who prosecuted Stone and quit the case after the Justice Department overruled them and said it would take the extraordinary step of lowering the amount of prison time it would seek for the president’s longtime ally and confidant. He currently works in the U.S. attorney’s office in Maryland. “The Attorney General — who cites his busy schedule as a basis for refusing to appear before the House Judiciary Committee but has made time for multiple television interviews — may have abdicated his responsibility to Congress, but the brave men and women of our civil service have not,” the committee’s chairman, Jerrold Nadler, D-N.Y., said in a statement. iframe.twitter-tweet { width: 100% !important; } Nadler said the committee wants to hear from prosecutors and former department officials who “will speak to the lasting damage the President and the Attorney General have inflicted on the Department of Justice.” He said in a statement that Zelinsky could shed additional light on the circumstances surrounding the Stone case and Elias can speak about “improperly motivated activity” in the antitrust division. Whether or not line prosecutors can testify about internal department matters without permission remains the subject of legal dispute, though other Trump administration officials who have been subpoenaed by Congress and want to comply with the demands have done so. Barr told the AP last year that the Justice Department would seek to block any attempt by Congress to subpoena members of the special counsel’s team. A Justice Department spokesperson declined to comment on the subpoenas. A former official — Donald Ayer, who served as deputy attorney general under President George H.W. Bush and is a frequent critic of Barr — is also scheduled to appear before the committee at the June 24 hearing. Stone was convicted in November on all seven counts of an indictment that accused him of lying to Congress, tampering with a witness and obstructing the House investigation into whether the Trump campaign coordinated with Russia to tip the 2016 election. He was the sixth Trump aide or adviser to be convicted on charges brought as part of Mueller’s investigation into Russian interference in the 2016 U.S. presidential election. Before his Feb. 20 sentencing, the Justice Department leadership backed away from its initial recommendation just hours after Trump tweeted his displeasure at the recommendation of up to nine years in prison, saying it had been too harsh. Trump’s tweeting led to a brief flare-up between him and Barr. Stone was sentenced to serve more than three years in prison plus two years’ probation and a $20,000 fine. He’s scheduled to report to prison by the end of the month."}]}