{"article": [{"url": "https://www.marketwatch.com/story/when-it-comes-to-social-security-these-strategies-can-pay-off-for-married-couples-2020-09-29", "published": 1601909960.0, "headline": "When it comes to Social Security, these strategies can pay off for married couples", "body": "When you’re part of a couple, you make financial decisions together. That’s especially true for the critical decision about when to start collecting Social Security benefits, which can mean a lot of money over many years. In a perfect world, everyone would wait until he or she turns 70 to claim benefits, even if it means having to sell stocks at a loss, because that’s when you max out your benefits and every year you wait gets you an automatic 8% increase. Sometimes, though, taking Social Security at 62, when you first become eligible, can make sense, no matter what the Personal Finance Police tell you. Those general rules of thumb still hold in claiming Social Security for couples. The rules are more straightforward since Congress ended the “file and suspend” strategy, a benefit-maximizing loophole big enough to drive an 18-wheeler through. But there are some wrinkles you need to be aware of, especially if there are big gaps in age or income between you and your spouse. (Incidentally, same-sex married couples have the same legal rights to Social Security spousal, survivor, and death benefits as male-female couples do.) The primary difference between filing individually and filing jointly is that, as Fidelity put it, “each member of a couple can claim at different dates and may be eligible for spousal benefits.” Spousal benefits are particularly suited for couples in which there’s a big disparity in lifetime earnings between the two spouses. In traditional families, the husband earned a higher income for life and the wife either stayed home to raise the children or worked part time or for far fewer years. (Social Security calculates annual benefits based on income in your 35 highest earning years.) Nowadays, according to the U.S. Census Bureau, wives outearn husbands in nearly one in every four couples. So, in all situations, it makes sense to crunch the numbers. Gather together the statements the Social Security Administration sends out three months before your birthday every year. (Or, if you prefer, create an online My Social Security account at www.ssa.gov.) It will give you a year-by-year record of your earnings and an estimate of future Social Security benefits. Then, sit down with your spouse and compare notes. If 50% of the higher earning spouse’s benefits are more than the full benefit the lower earning spouse would get, the spousal benefit may be the way to go. (If you are eligible for both, you will receive the higher amount of the two.) But if you decide to take spousal benefits instead of your own, you’ll have to wait until the higher earner files for benefits and the spouse reaches full retirement age—66 or 67, depending on when you were born—to get that 50%. (You can’t apply for spousal benefits until the spouse whose earnings you’d use as a benchmark is already collecting Social Security.) If you file for spousal benefits at 62, you may get as little as 32.5% of the higher-earning worker’s benefits. (Benefits are reduced by 25/36 of a percent for each month before full retirement age, up to 36 months. Hey, don’t blame me—I don’t write these ridiculously complex rules.) There’s one exception: According to the Social Security Administration, if the spouse is caring for a child who is under 16 or receives Social Security disability benefits, retiring at 62 will not reduce that 50% of spousal benefits. So, what’s a good claiming strategy for couples? Well, I hate to bore you, but waiting until the higher earner is 70 to collect benefits makes a lot of sense. It won’t affect spousal benefits for the lower-earning spouse — normally 50% of the higher earning spouse’s benefits at full retirement age (66 or 67) — but it will mean more income for the higher earning spouse and the couple. Well, I hate to bore you, but waiting until the higher earner is 70 to collect benefits makes a lot of sense. That’s because by waiting until then, that higher earning spouse locks in a much richer benefit of which 50% will go to the lower-earning spouse through spousal benefits. “Consider having the lower earner collect first and having the higher earner wait. Over time, the higher earner’s increases will be worth more than the lower earner’s increases,” suggests Vanguard. And if the higher earner’s benefits are more than twice as high as the spouse’s, the lower-earning spouse can claim for his or her regular Social Security benefits first and then apply for the larger spousal benefits later on when the higher earning spouse starts collecting—at age 70, say. Divorced or surviving spouses have specific issues to deal with, as do older parents of minor children. I’ll get into them in a future column."}]}