{"article": [{"url": "https://www.marketwatch.com/story/16-stocks-from-adobe-to-home-depot-to-zillow-to-help-you-tap-into-the-housing-boom-2020-10-06", "published": 1602145220.0, "headline": "16 stocks - from Adobe to Home Depot to Zillow - to help you tap into the housing boom", "body": "The U.S. housing market is a beneficiary of people's desire to spread out amid the coronavirus. But even after the pandemic ends, the notion of crowding into business districts for work will be obsolete for many people. There are various ways for investors to try to take advantage of this trend. One way is by investing in home builders and their suppliers. You can read about those here, with a breakdown of three U.S. home construction and supply ETFs' holdings. As a follow-up, here are comments from money managers about how investors might best play the U.S. housing market for the long term.A return to household formation Iman Brivanlou is the managing director for high-income equities at TCW Global, an asset manager based in Los Angeles that manages about $225 billion, mainly for institutional clients. He is also the portfolio manger of the TCW Global Real Estate Fund. The fund's institutional shares TGREX, -0.34% are rated five stars (the highest) by Morningstar. The fund has only about $9 million in assets but is managed with the same strategy Brivanlou uses to run global real-estate investment portfolios for institutional clients. During an interview, Brivanou said he expected U.S. household formation among millennials to pick up after it stalled during the years following the 2008 financial crisis. There was a \"lost decade of formation,\" he said, as some millennials \"preferred to live near where the action was,\" he said. But some investors expected household formation to rise as millennials got older and wanted families, bringing about \"the age-old desire of a larger home and a nice school district - things you find in the suburbs,\" he added. \"Now, accelerated by Covid, we see the latter interpretation vindicated,\" Brivanou said. All of the above, plus incredibly low mortgage interest rates, point to another five to 10 years of strong housing-market growth, he said. Brivanou wasn't at liberty to discuss individual stocks, but the top holdings of the TCW Global Real Estate Fund are listed below. Looking far ahead, he advised investors to think about artificial intelligence and related technological developments, including autonomous vehicles, and how these will affect the real-estate market: \"AI [artificial intelligence], right now, is impacting the market at the semiconductor and technology level. But in five to 10 years, there will be real estate winners and losers.\"Housing and related investment plays Ellen Hazen, a portfolio manager at F.L.Putnam Investment Management Co. in Wellesley, Mass., doesn't agree with Brivanlou's thesis about renewed household formation among millennials, because of a \"lack of growth in real wages for the lower half of the distribution.\" That problem is combined with a mix of newly built homes that leans toward the larger and more expensive, and tight credit standards among mortgage lenders, she said during an interview. But Hazen listed many companies that should benefit from the strong U.S. housing market, or more broadly, \"covid-related plays.\" These include software companies that gain not only from the stay-at-home trend, but from the accelerating corporate trend of outsourcing as many core network and other IT functions as possible. Hazen named Adobe Inc. ADBE, +2.30%, Amazon.com Inc. AMZN, +3.01%  and Microsoft Corp. MSFT, +2.48%. All three have soared this year: FactSet When asked about high valuations for these stocks, Hazen said: \"Almost nothing in the U.S. equity market is undervalued these days. If you are going to pay up for a stock anyway, you should look where you have the highest secular growth, and that is more in software.\" Sales growth rates are included in the stock table below. Related plays on the higher-use of bandwidth are Crown Castle International Corp. CCI, +0.95%  and American Tower Corp. AMT, +0.46%, which own cell towers and lease them to major wireless telecommunication service providers. Moving closer to housing, Hazen named TJX Cos. TJX, -0.18%, which runs TJ Maxx and Marshalls stores, but also operates HomeGoods, which follows a similar discounted retail concept as the other two, with new products hitting the shelves every week. She listed Sherwin-Williams Co. SHW, +1.47%, which distributes its paint only through its own stores. This \"leads to higher structural margins,\" Hazen said. For direct housing plays, in addition to the obvious suppliers (Home Depot Inc. HD, +0.49%  and Lowe's Cos. LOW, +1.38% ), she highlighted Mowhawk Industries Inc. MHK, -4.37%, which makes flooring materials; Beacon Roofing Supply Inc. BECN, +0.16% ; Masco Corp. MAS, +0.22%, which makes various plumbing and other products used by builders; and Fortune Brands Home & Security Inc. FBHS, -0.71%, another supplier of various products used in home construction. Zillow, eXp Gerald Sparrow manages the Sparrow Growth Fund SGNFX, +1.71%, which has a five-star rating from Morningstar. He screens for high unit-sales growth when selecting companies for the fund, which held 141 stocks as of Sept. 30. Sparrow holds shares of online real-estate-database company Zillow Group Inc. Z, -0.74% and a smaller rival, eXp World Holdings  Inc. EXPI, +9.16%. Zillow reported a 28% increase in second-quarter revenue from a year earlier, while eXp's sales were up 33%. An off-the-beaten path investment Charles Lemonides of ValueWorks in New York shared a specific way of investing in the residential real-estate market in Hawaii: Maui Land & Pineapple Co. MLP, +0.61%, which holds nearly 800 lots in Maui that are subdivided and ready to be built on, with permits held by the company. During an interview, Lemonides said the company had obtained the permits before the housing-market crash that began in 2008, and had sold very little since then. But now, he believes Maui is \"right at the cusp\" of a long period for very strong housing demand. \"We think they will realize $250,000 to $500,000 per lot in profit, selling to builders,\" he said, which would mean \"value\" of $10 to $20 per share. The shares closed at $10.98 on Oct. 5, and beyond those lots, the company \"owns miles of coastline and thousands and thousands of acres in the mountains\" that could eventually be subdivided and sold to builders. As you can see, the stock has been volatile over the past five years: FactSet \"It had a huge run a few years ago, when we took off some exposure. And we are building exposure again at these prices,\" Lemonides said.Stock metrics Here are all the individual stocks mentioned by the money managers interviewed for this article, sorted alphabetically. To see all the data, you will need to scroll the table at the bottom: Company Ticker Total return - 2020 Revenue growth - most recent reported quarter from year-earlier Forward P/E Adobe Inc. ADBE, +2.30%  48% 14% 45.0 Amazon.com Inc. AMZN, +3.01%  73% 40% 89.7 American Tower Corp. AMT, +0.46%  7% 1% 50.9 Beacon Roofing Supply Inc. BECN, +0.16%  2% -7% 15.3 Crown Castle International Corp CCI, +0.95%  21% 0% 68.6 eXp World Holdings Inc. EXPI, +9.16%  347% 33% 108.6 Fortune Brands Home & Security Inc. FBHS, -0.71%  37% -9% 21.9 Home Depot Inc. HD, +0.49%  32% 23% 24.3 Lowe's Cos. Inc. LOW, +1.38%  43% 30% 20.6 Masco Corp. MAS, +0.22%  18% -4% 19.6 Maui Land & Pineapple Co. Inc. MLP, +0.61%  -2% -31% N/A Microsoft Corp. MSFT, +2.48%  34% 13% 32.7 Mohawk Industries Inc. MHK, -4.37%  -22% -21% 13.3 Sherwin-Williams Co. SHW, +1.47%  19% -6% 27.8 TJX Cos. TJX, -0.18%  -5% -32% 28.0 Zillow Group Inc. Class C Z, -0.74%  140% 28% 1529.9 Source: FactSet You can click on the tickers for more about each company, including news coverage, ratings and price targets. Many of the quarterly revenue figures show severe declines, because of the second-quarter coronavirus lockdown. The forward price-to-earnings ratios are high for many of these companies, especially when compared with the S&P 500 Index SPX, +0.87%, which has a forward P/E ratio of 25.5. But investors are placing a premium on growth, and a rapidly expanding company such as Zillow is much more focused on reinvesting into its business than showing a profit. This is a familiar story for investors who rode Amazon.com to such tremendous gains by patiently holding the shares. Before considering any individual stock for investment, it is important for you to do your own research to form an opinion of how well the company will compete over the next decade. Jamie Hopkins, director of retirement research at Carson Group, which provides support services to hundreds of investment advisory firms and manages about $13.5 billion for its own clients, brought a note of caution to the discussion: \"I would not steer clear entirely, but I would caution people against trying to bet that the last six months' trend is going to be the next year's trend.\" In other words, shares of home builders and suppliers won't shoot up forever. \"The stock market tends to react to information quickly,\" anticipating trends and easily overshooting them, he added. Hopkins expects \"some changes to that behavior\" in the housing market over the next year, and pointed to another reason for caution and maybe even a change of direction: \"A lot depends on timing we cannot control, such as vaccines. So I would ask, what didn't do well over the last nine months? Some of that may be an opportunity.\"Fund holdings Here are the top 10 holdings of the TCW Global Real Estate Fund as of Aug. 31: Company Ticker Share of portfolio Total return - 2020 Industry CBRE Group Inc. Class A CBRE, -2.13%  5.3% -21% Real-estate Development Chatham Lodging Trust CLDT, -1.17%  4.5% -59% REIT - Hotels American Tower Corp. AMT, +0.46%  4.2% 7% REIT - Cellular Towers Front Yard Residential Corp. Class B RESI, -0.51%  4.2% -23% REIT - Rental Homes Vonovia SE VNA, -0.27%  4.0% 27% Real-estate Development Mid-America Apartment Communities Inc. MAA, -0.97%  3.9% -3% REIT - Apartment Communities Summit Industrial Income REIT SMU.UT, -0.84%  3.3% 12% REIT - Light Industrial Equinix Inc. EQIX, +0.60%  3.3% 37% REIT - Data Centers Longfor Group Holdings Ltd. 960, -2.33%  3.3% 22% REIT - Various Jones Lang LaSalle Inc. JLL, -0.77%  3.0% -42% Real-estate Development Extended Stay America Inc. STAY, +0.24%  3.0% -15% Hotels Goodman Group GMG, -0.37%  3.0% 39% REIT - Industrial, Offices Segro PLC SGRO, +0.44%  2.9% 10% REIT - Warehouses, Light Industrial Toll Brothers Inc. TOL, +1.21% 2.8% 26% Homebuilding Invitation Homes Inc. INVH, -0.80%  2.7% 0.1% REIT - Single-family Home Leasing Source: FactSet Don't miss:Professional investors have their eye on these eight stocks as the used-car market in the U.S. moves online"}]}