{"article": [{"url": "https://www.marketwatch.com/story/square-stock-gains-after-company-purchases-50-million-in-bitcoin-11602164665", "published": 1602150740.0, "headline": "Square stock gains after company purchases $50 million in bitcoin", "body": "Fintech company Square has been upbeat about bitcoin for years and announced Thursday that it has purchased $50 million worth of the cryptocurrency. Square Square Inc. shares are up in morning trading Thursday after the company announced that it purchased $50 million worth of bitcoin. The company’s purchase of about 4,709 bitcoins amounts to roughly 1 percent of Square SQ, +2.06% ‘s total assets as of the second quarter, according to a release. “We believe that bitcoin BTCUSD, +3.22% has the potential to be a more ubiquitous currency in the future,” Chief Financial Officer Amrita Ahuja said in the release. “As it grows in adoption, we intend to learn and participate in a disciplined way. For a company that is building products based on a more inclusive future, this investment is a step on that journey.” The company called cryptocurrency “an instrument of economic empowerment” that “provides a way for the world to participate in a global monetary system.” Square was among the first mainstream companies to become involved with bitcoin several years back when it began letting users of its Cash App peer-to-peer service buy and sell the cryptocurrency. Chief Executive Jack Dorsey has been upbeat about bitcoin’s potential. “Bitcoin, for us, is not stopping at buying and selling,” he said on a company earnings call in 2018. “We do believe that this is a transformational technology for our industry, and we want to learn as quickly as possible.” The company launched an independent team called Square Crypto in 2019, according to its release about the $50 million investment. The Square Crypto team is focused on “contributing to bitcoin open-source work for the benefit of all.” Square shares have risen 35% over the past three months as the S&P 500 SPX, +0.87% has gained 7.8%."}]}