{"article": [{"url": "https://www.marketwatch.com/story/fed-sees-interest-rates-near-zero-until-end-of-2023-sets-new-economic-conditions-to-be-met-before-raising-rates-2020-09-16", "published": 1600272920.0, "headline": "Fed sees interest rates near zero until end of 2023, sets new economic conditions to be met before raising rates", "body": "The Federal Reserve on Wednesday said it doesn’t expect to raise rates until the end of 2023 at the earliest and it set out new economic conditions that must be met before it will raise them. In a statement, the Fed said it decided to keep its policy interest rate at near zero and expects this will be appropriate until two things happen: labor market conditions return to the “maximum employment” and inflation has risen to 2% and “is on track to moderately exceed 2% for some time.” Greg McBride, chief financial analyst at Bankrate.com, said this language means investors should “get used to the low rates because they are here to stay.” However, Seth Carpenter, economist at UBS, said the Fed guidance was “vague.” “The guidance means they need their own forecast for inflation to be above 2%, but they are not tying it to the realized level of inflation,” Carpenter said. Powell defended the guidance as “powerful” and “durable.” There were two dissents to the Fed forward guidance. Dallas Fed President Rob Kaplan seemed to favor the prior guidance and wanted the Fed to retain greater flexibility once the economy was on track to meet its two goals. Minneapolis Fed President Neel Kashkari proposed a much more streamlined guidance that the Fed would maintain rates close to zero until core inflation has reached 2% on a sustained basis. Josh Shapiro, chief U.S. economist at MFR Inc. said it was “a bit unseemly” to have two dissents so soon after the committee adopted a new policy framework, but Powell said the dissents were a sign of a healthy debate. “We’re the first major central bank to adopt this framework. There is no cookbook. And so of course there would be a wide range of views,” Powell said. He said the Fed would work to earn credibility. The Fed decision was something of a surprise as most economists thought the Fed would hold off on its forward guidance until November or December. The Fed said again that the path of the economy will depend on the course of the coronavirus pandemic though. Separately, the Fed released its economic forecasts to 2023. The central bank’s so called “dot plot” of likely interest rates projects no hike through the end of 2023, with only 4 of 17 of the policy making officials penciling in a rate hike. The Fed also said it will continue to purchase at least $120 billion per month of Treasurys and agency mortgage-backed securities to help smooth markets and help “foster accommodative financial conditions.” Follow:Live blog of Fed decision and press conference The Fed statement reflects the central bank’s decision in August to adopt a new strategy to hit its 2% inflation target over time and not every year. So if inflation under-performs, as it has for the past several years, the Fed will tolerate higher inflation for a time. Stocks gave up most of their gains after the Fed announcement. The Dow Jones Industrial Average DJIA, +0.56% closed up 43 points after being up by 200 points prior to the Fed decision."}]}