{"article": [{"url": "https://www.marketwatch.com/story/millions-of-african-americans-and-native-americans-were-uninsured-pre-pandemic-having-covid-19-is-scary-enough-without-worrying-youll-be-bankrupted-2020-06-10", "published": 1592045060.0, "headline": "Millions of African Americans and Native Americans were uninsured as pandemic hit: â\u0080\u0098Having COVID-19 is scary enoughâ\u0080\u0099", "body": "Typically health insurance is tied to employment â\u0080\u0094 which makes being laid off in the midst of a pandemic all the more difficult. But 18.2 million Americans would have had difficulty affording medical care if they contracted a severe case of COVID-19, even if they werenâ\u0080\u0099t laid off from their jobs. Thatâ\u0080\u0099s because they were either uninsured or inadequately insured prior to the coronavirus pandemic, according to a study published in the latest edition of the Journal of General Internal Medicine. Also see: Lost your job and health insurance due to coronavirus? Hereâ\u0080\u0099s how to get coverage before time runs out African Americans, Native Americans and lower-income individuals have been found to be at a higher risk of contracting a more severe case of COVID-19 than Caucasians due to many factors, including access to quality health care and their roles in frontline jobs, and higher rates of diabetes and heart disease, which also have socio-economic causes. Black COVID-19 patients have 2.7 times the odds of being admitted to the hospital compared to non-Hispanic white patients. “ Between May 21 and May 26, 20.5 million U.S. adults were uninsured, 15.5 million of whom were also unemployed. ” â\u0080\u009cThe pandemic is laying bare the lethal inequality of American society and American health care,â\u0080\u009d said lead author Adam Gaffney, a pulmonary and critical care physician at the Cambridge Health Alliance and Harvard Medical School. â\u0080\u009cOur ICU has been flooded with poor and minority patients; having COVID-19 is scary enough without worrying that youâ\u0080\u0099ll be bankrupted by medical bills,â\u0080\u009d he added. Most recently, the U.S. Census Bureau found that between May 21 and May 26, 20.5 million U.S. adults were uninsured, 15.5 million of whom were also unemployed. In 2018, some 27.5 million Americans did not have health insurance at any point during the year, according to the U.S. Census Bureauâ\u0080\u0099s annual report on health insurance coverage. A year prior, 25.6 million were uninsured. But even for those who are insured, many lack out-of-network coverage or live in states that have failed to expand Medicaid. To date, 36 states and the District of Columbia have expanded Medicaid coverage where adults can qualify based on income if their household income is 138% of the federal poverty level. If they qualify for it, they may be eligible for free or low-cost comprehensive health-insurance coverage. But high-risk people living in states that did not expand their Medicaid coverage, â\u0080\u009chad 52% higher odds of being inadequately insured relative to those in expansion states,â\u0080\u009d the latest study found."}]}