{"article": [{"url": "https://www.marketwatch.com/story/facebook-to-halt-political-ads-in-u-s-indefinitely-after-polls-close-nov-3-11602108311", "published": 1602094400.0, "headline": "Facebook to halt political ads in U.S. indefinitely after polls close Nov. 3", "body": "Facebook says it will stop all political ads in the U.S. after polls close on Nov. 3. Getty Images Facebook Inc. on Wednesday announced that political ads in the U.S. will be banned for at least a week after polls close Nov. 3, the social-media company’s latest move to limit the spread of election misinformation on its platforms. “While ads are an important way to express voice, we plan to temporarily stop running all social issue, electoral, or political ads in the U.S. after the polls close on November 3, to reduce opportunities for confusion or abuse,” the company announced in a blog post. “We will notify advertisers when this policy is lifted.” The ban is expected to last a week, but that could change, according to Sara Schiff, Facebook’s product lead for political advertising. “These are important steps for Facebook to take to combat disinformation and the premature calling of election results before every vote is counted,” Vanita Gupta, chief executive of The Leadership Conference on Civil and Human Rights, said in a statement. Facebook’s FB, +0.26% move is the latest in a series of measures to preserve election integrity, after its platforms were used to spread misinformation and disinformation ahead of the 2016 election. On Tuesday, the company said it is banning all content from QAnon across its platforms, one of its most aggressive actions yet to tamp down misinformation on its platforms. In August, the social-media company removed 1,500 pages, groups and profiles associated with the group. Last month, Facebook took its first action to limit political advertising in the U.S. with a ban of news ads in the week preceding the Nov. 3 elections amid unrelenting criticism that its platform fuels misinformation and is a haven for far-right groups. The social-networking company says it has helped register 2.5 million people to vote, and it has helped 100,000 people sign up as poll workers. Facebook is one of several companies with social media presences that are frantically shoring up defenses to avoid a repeat of the misinformation campaigns that plagued their services. Read more: Facebook hardens digital defense for misinformation ahead of elections In August, Google parent Alphabet Inc. GOOGL, +1.82% GOOG, +1.97% introduced new Google Search features that direct voters to verified information when they search for “how to vote” or “how to register.” Additionally, a new information panel on candidates will pop up when people search for federal or presidential candidates on YouTube. Twitter Inc. TWTR, -0.23% has said rolled out tools, policies and partnerships to help users register and prepare to vote by mail, and find local early-voting options. Snap Inc. SNAP, -0.18% announced the “Voter Registration Mini” tool so users can register to vote directly in Snapchat. It also posted a “Voter Guide” with information about topics such as voting by mail and voter registration."}]}