{"article": [{"url": "https://www.marketwatch.com/story/microsoft-says-tiktok-acquisition-talks-are-back-on-after-nadella-trump-chat-2020-08-02", "published": 1596404480.0, "headline": "Microsoft says TikTok acquisition talks are back on after Nadella, Trump chat", "body": "Microsoft Corp. said Sunday it is ready to continue acquisition talks with China’s TikTok, following a conversation between CEO Satya Nadella and President Donald Trump. “Microsoft fully appreciates the importance of addressing the president’s concerns,\" the tech giant said in a blog post Sunday. “It is committed to acquiring TikTok subject to a complete security review and providing proper economic benefits to the United States, including the United States Treasury.” Microsoft MSFT, +2.48% said it is looking to “move quickly” in negotiations with TikTok parent Bytedance, and hopes to have a deal in place by Sept. 15. “During this process, Microsoft looks forward to continuing dialogue with the United States government, including with the president,” the company said. Under a deal, Microsoft would end up owning and operating TikTok operations in the U.S., Canada, Australia and New Zealand. Microsoft said other American investors may take a minority stake. “This new structure would build on the experience TikTok users currently love, while adding world-class security, privacy, and digital safety protections,” Microsoft said. “Among other measures, Microsoft would ensure that all private data of TikTok’s American users is transferred to and remains in the United States.” Microsoft added that talks are still preliminary and may not result in a deal, and that it will have no further comment on the matter until there is “a definitive outcome” to the discussions. The Wall Street Journal reported Saturday that the talks had been put on hold after opposition from Trump. Last week, the president threatened to ban the popular video app from operating in the U.S. due to national security concerns. On Sunday, Secretary of State Mike Pompeo said TikTok was not the only Chinese-owned software company in the White House’s cross-hairs, and that Trump would “take care of” other companies that pose security risks. The Trump administration claims TikTok and other Chinese software companies pose risks because the could send private user data to the Chinese government. Critics say banning the up-and-coming TikTok would benefit companies such as Facebook Inc. FB, +0.26% and Alphabet’s GOOGL, +1.82% GOOG, +1.97% Google — which are already under government antitrust scrutiny — by removing a key competitor."}]}