{"article": [{"url": "https://www.marketwatch.com/story/california-aims-to-halt-sales-of-new-gas-powered-cars-11600884700", "published": 1600878140.0, "headline": "California aims to halt sales of new gas-powered cars", "body": "California Gov. Gavin Newsom. AP SACRAMENTO, Calif. (AP) — California will halt sales of new gasoline-powered passenger cars and trucks by 2035, Gov. Gavin Newsom announced Wednesday, a move he says will cut greenhouse gas emissions by 35% in the nation’s most populous state. The proposed rule would not ban people from owning gas-powered cars or selling them on the used car market. But it would end the sales of all new gasoline-powered passenger cars and trucks in the state of nearly 40 million people. California and the roughly dozen states that follow its lead on auto emissions standards make up a significant part of the U.S. auto market, giving the day’s move huge potential impact for the U.S. automobile industry as well as for long-term efforts against pollution and climate change, which is driven by fossil-fuel emissions. It also is likely to meet opposition from President Donald Trump, who wants to roll back tougher Obama-era auto emissions standards and is battling California to force it to comply. California already has rules mandating a certain percentage of new car sales must be electric or zero-emission vehicles. This rule, if implemented, would make California the first U.S. state with a plan to phase them out completely. At least 15 other countries have already made similar commitments, including Germany, France and Norway. Newsom’s order directs the California Air Resources Board to develop and approve regulations to meet the 2035 deadline. He also ordered them to make a rule requiring all medium and heavy-duty trucks be 100% zero-emission vehicles by 2045 “where feasible.” Newsom also directed state agencies to speed up development of charging stations across the state and called on the Legislature to eliminate new fracking licenses by 2024. Fracking is a technique that allows energy companies to extract huge volumes of oil and gas from shale rock deep underground. It involves injecting high-pressure mixtures of water, sand or gravel and chemicals into rock. Fracking opponents say the chemicals involved threaten water supplies and public health. California has a goal of relying 100% on clean, renewable energy by 2045. Gasoline and diesel-powered cars and trucks are the biggest impediment to reaching that goal as they account for more than half of the state’s carbon pollution. The order comes as massive wildfires have burned a record 5,600 square miles (14,500 square kilometers) in California this year. Experts say the size and intensity of the fires are aided by warmer temperatures and years of drought brought on by climate change."}]}