{"article": [{"url": "https://www.marketwatch.com/story/after-covid-19-what-is-the-future-of-health-care-for-older-americans-2020-08-05", "published": 1596816440.0, "headline": "After COVID-19, what is the future of health care for older Americans?", "body": "This article is reprinted by permission from NextAvenue.org. Once the coronavirus pandemic fades — whenever that happens — two health trends for America’s older adults seem nearly unquestionable. Medical appointments through telehealth will be common, especially for those on Medicare. And the need for geriatricians will be great. Since people over 65 have accounted for roughly 80% of the COVID-19 deaths in the U.S, according to the Centers for Disease Control and Prevention, the older adult population has been at the heart of the pandemic. Here’s what experts forecast regarding telehealth and physicians specializing in geriatrics post-pandemic:Telehealth In 2019, only 11% of U.S. consumers used telehealth — medical appointments via video or telephone — according to McKinsey & Company Health Care Systems and Services. But in recent months, McKinsey says, 46% have. Partly, the growth in telehealth has come because so many Americans haven’t been allowed into their doctors’ offices. Partly, doctors have come to embrace these types of appointments. But a key factor has been Medicare rule changes covering telehealth for people 65 and older in important ways. Related: Where will America’s oldest people live after COVID-19? During the pandemic, Medicare beneficiaries can receive telehealth in any location, including their homes. Before that, they had to either live in a rural area or go to a clinic, hospital or certain other types of medical facilities. See: 5 things you probably didn’t know about Medicare And throughout the coronavirus outbreak, Medicare can pay physicians the same rate as for in-person visits. Pre-COVID-19, telehealth through Medicare also required interactive audio and video between the practitioner and the patient; now, audio alone is allowed. Medicare has recently more than doubled the number of services beneficiaries can receive through telehealth — adding 135, including physical, occupational and speech therapy services. The result of all this? Before the pandemic, about 13,000 people in fee-for-service Medicare received telehealth in a week. These days, roughly 1.7 million do. Over 9 million Medicare beneficiaries have received a telehealth service during the pandemic. Private Medicare Advantage plans can now offer the latest telehealth technology as part of their basic benefit, too. Now, more than half of those plans do, for up to 13.7 million enrollees. Said Seema Verma, administrator for the federal Centers for Medicare and Medicaid Services, in a July 15, 2020 Health Affairs blog about Medicare’s telehealth expansion: “It’s hard to imagine merely reverting to the way things were before.” Rep. Kevin Brady, the lead Republican on the House Ways and Means Committee, is currently drafting legislation to make permanent Medicare’s telehealth changes created in the pandemic. Penny Shaffer, South Florida market president of Florida Blue, the state’s oldest and largest health insurer, says the increase in telehealth for older adults has been the biggest health care impact of COVID-19 for them. “There’s a lot to say for the convenience of interacting with a provider from the comfort of your home: it’s safer in many ways, given no travel or transport is required, and there’s no interaction with other patients in waiting rooms,” she notes. But, as Judith Graham of Kaiser Health News recently wrote, not all Americans have access to technology or can afford tech devices. Some have health issues (like dementia, hearing loss and impaired vision) preventing them from using telehealth. And some need translation services. Read: How to get the most out of a telehealth appointment: 9 tips Mario Schlosser, CEO of the tech-focused health insurer Oscar, noted that the total number of health visits by his policyholders during the pandemic has dropped in half. Shaffer, of Florida Blue, acknowledges that while telehealth isn’t the right method for every condition, patient or situation, “there are a number of encounters that can be satisfied with a telehealth visit.” Florida Blue, like other health insurers, envisions even greater use of technology and virtual visits in the future to monitor patients with chronic conditions and as a postsurgical tool, to reduce the risk of infection. That prediction was echoed by Catherine McCallum, a clinical social worker and aging care management consultant who runs Coral Life Strategies in Bethesda, Md. Also see: Why older Americans are more likely to be harmed by medical care McCallum also likes telehealth patients’ ability to schedule appointments quickly, rather than having to wait too long for an appointment. “But,” she adds, “not all medical practices set up their own secure line; some rely on Zoom ZM, +2.89% or another platform, which has shown to be less secure.” McCallum says there can be other difficulties and limitations relying on video health visits, especially for counseling patients, too. “Right now, when we speak with patients using applications like Zoom, especially older adults, we have to get very specific about what they need to do and how to interact with the computer or smartphone,” she says. “And we have to remind them to turn off other devices.” However, McCallum is confident that older patients will increasingly become more comfortable with the technology — and that it will become more available and user friendly. As an insurer, the long-term financing of telehealth is very much a concern for Shaffer. She fears that post-COVID-19, Medicare reimbursement rates will return to paying doctors less for telehealth visits than in-person ones. Schlosser, of Oscar Health, feels that identical reimbursement rates for virtual and in-person visits will be unsustainable, but acknowledges that health providers will want to ensure they’re compensated adequately for virtual visits. He also believes that once the pandemic crisis passes, people who pay for their own health care are likely to raise more questions about why doctors are charging the same for telehealth visits as for in-person visits since they don’t always feel that they get the same level of service. And Robert Sullivan, a health care consultant and formerly the chief operations officer for Health Industries Advisory at the tax and consulting firm PricewaterhouseCoopers, predicts that the greater use of technology for medical records during the pandemic will have a long-lasting, positive effect on health care costs due to better medical database management. “For the longest time,” he says, “all your medical records were with your family physician. And if you needed to send information to a specialist or just needed to check on your own status, you had to get the information from your doctor. That was costly for the provider as well as for the insurance companies.” But there’s been a huge growth in the use of third-party data management of medical records during COVID-19. That portability, Sullivan believes, will save money for doctors’ offices and insurers.Geriatric medicine “The big change for me as a result of COVID-19 is the heightened awareness of the need for more geriatric physicians,” says Sullivan. “We’re already woefully short of the number of geriatric physicians and that number is going to get even worse in the future.” According to the American Geriatric Society, there are about 7,000 certified geriatricians in the United States. But the federal Health Resources & Services Administration, which tracks data on the workforce that’s needed, estimates that by 2025, the U.S. needs to have close to 23,000 geriatric physicians to accommodate the number of boomers, who’ll then be 61 to 79. Read: The case for defunding nursing homes and replacing them with a radically different model One of the reasons for this discrepancy: the expected income for those going in geriatrics. “Geriatric medicine has not been the most lucrative specialty,” Sullivan says. The American Geriatric Society reports that the average income for a geriatrician is lower than even for family practice, even though the specialty requires an additional year of schooling. According to ZipRecruiter, the average pay for a geriatrician in the U.S. is $198,740. By contrast, average pay for family physicians is about $208,000. Still, Sullivan says he’s optimistic about future prospects for geriatricians. “I think the pandemic put the spotlight on older adults, which will likely increase the number of people going into the field. And,” he adds, “it’s also likely to increase the income for geriatric physicians as the demand becomes greater.” Young people seem to agree. In his School of Aging Studies class at the University of Maryland Baltimore County, Prof. Steve Gurney, asked his young college students whether they thought there would be more emphasis in the health community on geriatric medicine in the post COVID-19 world. Almost all of the comments were similar to this one: “COVID-19 made us more aware of the health risk factors our elderly population faces. People, including myself, have kept our older generation in mind more now than ever before. And moving forward, people will have a better understanding of geriatric medicine and its importance.” Bart Astor, an expert in life transitions and elder care, is the author of “AARP Roadmap for the Rest of Your Life: Smart Choices About Money, Health, Work, Lifestyle and Pursuing Your Dreams” and “Baby Boomer’s Guide to Caring for Aging Parents.” His website is BartAstor.com and he can be reached at Bart@BartAstor.com. @bartastor This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}