{"article": [{"url": "https://www.marketwatch.com/story/dr-fauci-outlines-3-ways-america-can-beat-coronavirus-2020-08-15", "published": 1598244860.0, "headline": "Dr. Fauci says the U.S. can learn from Asian countries and island nations in the battle against COVID-19", "body": "What can the U.S. do differently? Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, delivered some blunt messages to the public during an online video interview. There are three key reasons why many island nations and Asian countries, such as New Zealand, Singapore and South Korea, have managed to control the coronavirus, he said. Aside from social distancing and masks, he said these countries took many correct approaches to deal with their respective outbreaks and, as a result, have created the right environment to begin opening up their economies again. Public health and economic health are not mutually exclusive, he added, or a matter of either/or. This, Fauci said, is what we can learn those countries: 1. Outdoors is better than indoors: In a recent interview on Instagram FB, +0.26%, actor Matthew McConaughey asked Fauci if certain smaller island nations have more successfully battled coronavirus because residents spend more time outdoors. He replied, “It’s conceivable that that’s the case.” Fauci added that outdoors is preferable for sports, restaurants and school classes. Fauci also said that aiming for 100% herd immunity — as Sweden attempted — instead of closing schools and businesses to flatten the curve of new cases of COVID-19, would have dire consequences for the American people. “If everyone contracted it, a lot of people are going to die,” the doctor said. “The death toll would be enormous and totally unacceptable.” Anders Tegnell, the Swedish epidemiologist who masterminded the plan, admitted the country made a mistake. “If we were to encounter the same illness with the same knowledge that we have today, I think our response would land somewhere in between what Sweden did and what the rest of the world has done,” he said in June when the country hit the highest death rate in Europe. In a separate Facebook Live chat with Rhode Island Gov. Gina Raimondo, Fauci said windows should remain open on school buses, and students should wear their masks as much as possible. “If you look at the super-spreader events that have occurred, they’re almost always inside,” he said, citing major outbreaks at nursing homes, meat-packing warehouses, prisons and weddings. See:Reports of COVID cases are growing on college campuses as schools bring students back for in-person classes 2. Shut down decisively to stop outbreaks: And asked why so many Asian countries have had relative success in controlling outbreaks of COVID-19, Fauci said, “When they shut down, they shut down like, ‘Bang!’ When we shut down, it was never in the level that the Asian countries did.” Fauci said the stop/start and disparate approaches to shutting down in the U.S. has not worked out as well. Fauci also said it’s not a simple choice between public health and economic health. “The quicker you pull together and get it down, the quicker you get back to normal. We’re all in this together. Unless we do this together, we’re not going to get this under control,” he said. “To think that you can ignore the biologic and get the economy back, it’s not going to happen. You have got to do both.” The U.S. cannot afford a prolonged resurgence of the virus now or in the fall, health professionals say. For one, it’s harder to get people to practice social distancing and stay home again, especially after they’ve already abided by stay-at-home orders in the early part of the first wave of the virus. South and Western states have experienced a spike in cases after relaxing measures. Secondly, the effect on the economy could push the U.S. into a prolonged recession, even greater than the one already predicted by some economists. Thirdly, the flu season will already be upon us in the winter and those symptoms are easily confused with those of COVID-19. Fourthly, too few people will be immune to COVID-19 after this first wave ends to support herd immunity. Actor Matthew McConaughey interviewed infectious-disease specialist Dr. Anthony Fauci on Instagram. Instagram Also see: Dr. Fauci tells MarketWatch: I would not get on a plane or eat inside a restaurant 3. Contract tracing helps stop community transmission. Fauci said it’s crucial to create the conditions to allow authorities to conduct contact tracing, and prevent community transmission. He used sports as an example. “If you’re in a red zone where the level of virus is so high, sure you can try to do sports normally, but the chances are you’re going to get people infected,” he said. Young people who play or attend sports events are more likely to become “super spreaders” and behave as if they don’t have the virus and be the source of community transmissions, Fauci said in the 40-minute interview. “Many of them are going to be young, so they’re not going to get sick. They go out into the community.” At that point, he said, the origin of the spread is much harder to trace. Countries like South Korea, New Zealand and China — where the virus is believed to have originated in a food market in Wuhan late last year — appear to have had more success in beating back COVID-19. Earlier this week, for example, New Zealand moved fast to lock down Auckland after the return of COVID after 102 days of reporting no new infections. “Act as if you have COVID, and as though people around you have COVID,” Prime Minister Jacinda Ardern told a press conference. The island nation moved quickly and decisively to respond to the pandemic, banning non-New Zealand nationals traveling from China before there were any cases in the country, and those nationals who arrived from China were forced to quarantine for 14 days. Coronavirus update:As of Monday, COVID-19 has now killed at least 808,928 people worldwide. The U.S. has the world’s highest number of confirmed COVID-19 cases (5,703,586) and deaths (176,808). Worldwide, confirmed cases are now at 23,434,221, according to data aggregated by Johns Hopkins University, which does not, for the most part, account for asymptomatic cases. The Dow Jones Industrial Index DJIA, +0.56%, the S&P 500 SPX, +0.87% and the Nasdaq Composite COMP, +1.39% ended higher Friday. Last week, the Federal Reserve minutes urged Congress for more pandemic aid, underscoring the challenge to the country’s economic recovery as the world anxiously awaits a COVID-19 vaccine. AstraZeneca AZN, +1.16%, in combination with Oxford University; BioNTech SE BNTX, +1.23% and partner Pfizer PFE, -0.27% ; GlaxoSmithKline GSK, +1.10% Johnson & Johnson JNJ, +1.39% ; Merck & Co. MERK, +1.59% ; Moderna MRNA, +0.09% ; and Sanofi SAN, -1.48% are among those currently working toward COVID-19 vaccines."}]}