{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-pop-higher-as-buffett-picks-up-shares-of-worlds-second-largest-miner-2020-08-17", "published": 1597675100.0, "headline": "Gold prices notch best day in about four months with 2.5% gain", "body": "Gold prices rallied Monday, with the gain helping the precious metal put in the best one-day gain in about four months on the back of a slide in government bond yields and the U.S. dollar, which were raising the appeal of the precious commodity. But the yellow metal also may have drawn additional interest after a public filing that offered a peek of holdings of Warren Buffett’s Berkshire Hathaway Inc. BRK.A, +0.06% BRK.B, +0.24% revealed that the conglomerate had taken a new stake last quarter in the world’s second-largest gold miner, Barrick Gold Corp. BLK, +1.18% Read: Did Warren Buffett just bet against the U.S. economy? His latest investment raises some questions Last week, gold came under pressure as U.S. Treasurys climbed to an eight -week high, detracting from the appeal of bullion. However, gold enthusiasts insists that uncertainty about the economic landscape fostered by the COVID-19 pandemic make bullion a solid long-term bet, particularly as countries spend trillions to support their economies. On Monday, Treasury yields were slipping, with the 10-year Treasury note rate TMUBMUSD10Y, 0.777% at 0.676% and a gauge of the U.S. dollar against a half-dozen currencies, the ICE U.S. Dollar Index DXY, -0.58%, off 0.1%. Gold benefits from lower yields because it doesn’t offer a coupon and a weaker dollar can make bullion more attractive to users of other currencies. Some experts view gold and silver’s recent pullback from a recent powerful uptrend as consolidation ahead of its next phase. Gold suffered a sharp pullback on Tuesday that helped to snap a weekly win streak. “We will have a new bullish signal with a clear surpass of $1,965, in a scenario that remains dominated by coronavirus news and fears of further lockdowns,” wrote Carlo Alberto De Casa, chief analyst at ActivTrades in a note. “Expectations for further actions by central banks remain ever present and this is another supportive element for gold. A fresh decline below the support zone of $1,920-$1,930 would denote weakness.” Indeed, the People’s Bank of China on Monday injected fresh liquidity into its financial system while it kept the rate steady at 2.95% on a one-year medium term lending facility $100.74 billion while it deals with the effects of the viral outbreak, Reuters reported. December gold GCZ20, +2.17% GC00, +2.17% rose $48.90, or 2.5%, to settle at $1.998.70 an ounce, marking its best daily climb on a point and percentage basis since April 22, after the metal on Friday notched a weekly decline of about 3.9%, highlighted last Tuesday by the biggest daily dollar decline since April 15, 2013. Meanwhile, September silver prices US:SIU20 added $1.57, or 6%, to finish at $27.667 an ounce following a 5.3% weekly loss. Elsewhere on Comex, September copper US:HGU20 added 4.25 cents, or 1.5%, to settle at $2.9015 a pound. October platinum PLV20, +3.99% gained $8.50, or 0.9%, to finish at $967.60 an ounce, while September palladium US:PAU20 rose $90, or 4.2%, to settle at $2,233.80 an ounce."}]}