{"article": [{"url": "https://www.marketwatch.com/story/how-you-can-channel-your-outrage-into-practical-activism-to-help-create-a-better-world-11595425510", "published": 1595511380.0, "headline": "How you can channel your outrage into practical activism to help create a better world", "body": "Steve Davis has been making a difference for over 40 years as a CEO, entrepreneur, teacher and practical activist, Stuart Isett Face it. We’re living through a challenging moment in business, and in history. Whether you’re an investor, an executive, an employee, or an interested citizen—and whatever your political orientation—today’s headlines keep us all spinning, often pushing us toward outrage and despair. Even if we aren’t doomscrolling, the facts remain that a tragic pandemic is spreading, many businesses are closing, a toxic political culture is dividing us, inequality is becoming more visible, and the planet is warming. This leaves us shaking our heads and searching for ways to engage—dare I say it, as activists for change. Activism is a word that often alarms people, particularly in the business community. It conjures images of street protesters or disgruntled shareholders. Or maybe translates as billionaire philanthropists or front-line health workers. Meaningful change While all of those play important roles in social change, there are ample opportunities for the rest of us to engage too. I’ve spent 40 years in activism—while running multimillion-dollar tech organizations and sitting on corporate boards—and I can assure you that there is a route toward encouraging effective, meaningful change—as a practical activist. Practical activism can be shaped in big ways and small, improving our collective well-being and making our world better. It is often invisible and somewhat unsexy. One of its central tenets is building alliances, with an eye toward improving systems, shifting public policies and changing corporate behavior. In other words, practical activism focuses on the long term. It targets the nuts and bolts of problem-solving to get stuff done.Some examples As an example, consider the work of Celine Soubranne, a senior executive at AXA AXA, -0.25%, one of the largest insurance and asset management corporations in the world. On a personal level, Soubranne has become increasingly alarmed at waning biodiversity, and she was able to show AXA’s leadership how environmentally sound investment strategies—such as divesting from tobacco and coal—would be in the firm’s interest. Soubranne helped make this case and succeeded in shifting corporate policy. That’s activism with lasting impact, and it happened largely behind the scenes. Soubranne strikes me as a classic practical activist. She identified a global trend—climate science—and leveraged it to effect change. The good news is that there are many such opportunities, even amid today’s challenges. Powerful social and economic undercurrents are reshaping our world in positive ways, including the astounding growth of a global middle class; the rising strength of community voices; a growing emphasis on equity; ongoing innovation in digital technology; and renewed energy for bringing ideas to scale. Practical activists like Soubranne channel these trends to generate momentum. Perhaps you’re not so much a corporate officer as an inventor type. After living in Rwanda, engineer Keller Rinaudo was so charged up about inequities in health care there that he created Zipline, which uses drones to deliver blood and other medical supplies to every citizen in that country. More recently, Zipline’s drones have been delivering PPEs to health workers fighting COVID-19 in North Carolina. If you are in finance, maybe the work of Joel Holsinger resonates. Holsinger, a partner at Ares Management, became so outraged at inequities in global health and education that he and his partners created a charitable fund from the fees they charge investors, and they are funneling that money toward organizations making a difference. Build bridges first It’s a great example of taking the tools you know best and using them to support action. The bridge-building at the heart of practical activism often requires setting aside preconceptions, or refusing to be dissuaded by political differences, to achieve a common goal. Rinaudo had to forge partnerships with government health ministries, civil aviation authorities and hospital staff. Holsinger, denizen of the corporate world, found ways to partner with the global health nonprofit PATH. The course I teach at Stanford Business School is dedicated to the importance of these multisector partnerships in reducing poverty, improving health, and boosting environmental sustainability. It’s a wonky term, but at bottom ‘multisector’ just means engaging people from business, government and nonprofits to pull on the same oar. The results can be powerful. And those partnerships offer ample opportunity for business-minded practical activists to get involved, especially as lower-income consumers become a larger markets to serve. There is no single playbook on how to be a practical activist. But for each of us, the work starts with a commitment to direct our outrage toward getting something done. A nice side benefit is that taking action almost always leads to more optimism. And optimism itself generates energy that drives change.Keep your eyes on the prize Despite undeniably frightening headlines, pull back from the day to day and you’ll see that extraordinary inventions are still coming to the fore. Innovators continue to collaborate for advances that will propel our species forward. And a new generation of leaders is stepping up. It’s easy to lose sight of this in the daily noise, but citizens, governments and institutions are building a world where more people live longer, healthier lives than at any time in human history. So in this moment of turmoil, consider what you have to offer and roll up your sleeves. Yes, it’s possible to do good while doing well. It might also make you feel better. Steve Davis is a lecturer at Stanford Business School and was former CEO of PATH, a global health innovation leader. The five trends powering practical activism and the stories of these and other leading practical activists are featured in his forthcoming book, “Undercurrents: Channeling Outrage to Spark Practical Activism” (Wiley, October 2020)."}]}