{"article": [{"url": "https://www.marketwatch.com/story/trumps-visa-restrictions-are-already-pushing-american-jobs-overseas-11595428425", "published": 1595438060.0, "headline": "Trump's visa restrictions are already pushing American jobs overseas", "body": "President Donald Trump signed an executive order to revamp the H-1B visa program while visiting Wisconsin tool manufacturer Snap-On in April 2017. Getty Images On June 22, the Trump administration announced expansive new bans on worker visas-in addition to an extension of restrictions on new green cards-under the premise of protecting American jobs and spurring economic recovery in the United States. But the announcement-which is only one in the Trump administration's ongoing efforts to block legal immigration, beginning with the \"Buy American Hire American\" executive order in 2017-is likely to have precisely the opposite effect: sending jobs, innovation, investment, and economic growth abroad instead.1. These actions will motivate companies to move jobs out of the U.S. Prominent American companies like Duolingo and Boston Consulting Group (BCG) have already announced that rather than rescinding offers to those affected by the new visa rules, they will simply move those jobs to Canada or elsewhere. And they are not outliers, nor is this without precedent. In a recent paper, I show that U.S. multinational companies have already offshored tens of thousands of jobs and opened new foreign affiliates in response to H-1B visa restrictions much less severe than those being implemented now. The countries that benefited the most at the time-and are likely to benefit once again now-were China, India, and Canada. I find that U.S. multinational companies particularly increased employment in those three locations in response to the growing constraints of the H-1B visa cap, even as U.S.-based employment at the same firms remained flat. That response is likely to be amplified under the much more restrictive regime being put into place now, particularly as remote work becomes more common. In other words, rather than going to Americans, those jobs are likely to go to another country.2. Entrepreneurial immigrants will start businesses outside of the U.S. Nearly half of all Fortune 500 companies were founded by immigrants or their children. A quarter of all new firms are created by immigrants. Research shows that not only are immigrants 80% more likely than Americans to start new firms, but that the higher propensity to start new firms applies to all firm sizes. As a result, immigrants act more as \"job creators\" than \"job takers\"; immigrant-founder firms create 42 percent more jobs than native-founder firms. So if immigrants originally destined for the U.S. instead choose to go to Canada-for example-instead, they also create new jobs for Canadians, rather than for Americans.3. Investors will seek investment opportunities elsewhere. Jobs are not all that will go to other countries as a result of these expansive visa bans. Foreign investment is tightly linked to immigration; even ancestral links from immigration a century ago continue to drive foreign investment today. Innovation is also tightly linked to immigration. Immigrants patent at double the native rate, increase firm patenting, and enhance the innovativeness of native scientists by introducing new and complementary knowledge and ideas. History provides a clear example of what happens to American innovation when immigration flows are restricted; immigration quotas in the 1920s caused a significant decline in American innovation-at least in part because Americans were actually less innovative without immigrants around. Furthermore, Israeli science benefited when at least some scientists moved there instead. Halting immigration will not only reduce innovation and investment in the U.S., but will likely send that innovation and investment to countries that welcome foreign talent with open arms. President Trump's order to block hundreds of thousands of immigrants from working in the U.S. will not improve unemployment for American citizens. It will not aid economic recovery. Instead, it will send jobs, innovation, and investment-and hence economic growth-to those countries who are not so shortsighted as to ban the very people who are instrumental in ensuring America's future economic prosperity. Britta Glennon is an assistant professor at the Wharton School of Business at the University of Pennsylvania in Philadelphia. Follow her on Twitter @BrittaGlennon. This was first published by the Brookings Institution. Also read: Telemigrants are coming for your white-collar job, and a wall won't stop them"}]}