{"article": [{"url": "https://www.marketwatch.com/story/welcome-to-new-york-see-you-in-two-weeks-2020-06-26", "published": 1593273560.0, "headline": "Welcome to New York! See you in two weeks!", "body": "Hey, New Yorkers: Have you spotted any fresh Texans skulking down Broadway? Any newcomers from Florida or Arizona traipsing up Fifth Avenue? Warning: Keep your social distance, and tighten your COVID mask. These visitors are supposed to be quarantining indoors, where they can’t infect the suddenly healthy New York folks, and no sneaking off to the leafy suburbs of New Jersey or Connecticut, either. The governors of all three states have signed a legally binding travel advisory ordering 14 days of self-isolation for anyone coming from one of the coronavirus-spike states, which are bunched across the American south and west. Unless you’ve spent a lot of time in New York City, you may not realize how surreal this cold shoulder is. New York likes to exploit its new arrivals and sometimes elevate them, not make them feel unwelcome. IDs have never been checked at the Jersey line. But June has brought a real coronavirus switcheroo. New York, which had led the nation in infections and deaths, surprised everyone, locking down long enough to become America’s bent-curve poster child. And now, states that rushed to reopen are all of a sudden seeing their case counts Texas two-stepping like never before. Alabama, Missouri and Nevada all reported single-day highs on Thursday. Arizona, California, Florida and South Carolina reported rolling-average highs. And in Texas, Gov. Greg Abbott blinked. For months, the governor had been among the quickest to abandon coronavirus precautions. Now confronting what he concedes is a “massive outbreak,” he is reversing course and suspending all further Texas reopenings. He closed Texas bars and even called off face lifts, tummy tucks and other elective surgeries to keep hospital beds free for life-or-death COVID cases.. See: Bill Gates says poor U.S. response is making pandemic picture ‘more bleak than I would have expected’ Meanwhile, New York state’s coronavirus hospitalizations have fallen below 1,000, the lowest since mid-March. Did anyone even think this was possible? The positive-test rate has sunk so low, 1%, that Mayor Bill de Blasio predicts a Phase 3 reopening on July 6, which would include indoor dining (at 50% occupancy), nail salons, tattoo studios and massage parlors, the legitimate kind. “The data is telling us ‘yes’ right now,” de Blasio said. But all that’s for New Yorkers. If you’re an out-of-towner, the next questions is, “From where?” Gov. Andrew Cuomo is making the point that hospitality has its limits. After a multistate barrage of quarantine threats from other governors, he is hardly hiding his delight at the turnaround. Directly addressing Abbott, Florida’s Gov. Ron DeSantis and others, Cuomo took his best shot Thursday on CNN: “You played politics with this virus, and you lost. You told the people of your state, and you told the people of this country, the White House, ‘Don’t worry about it. Just open up. Go about your business. This is all Democratic hyperbole.’ Oh, really? Now you see 27 states with the numbers going up. You see the death projections going up. You see the economy going down. It was never politics. It was always science.” The governors of New York, Connecticut and New Jersey have signed a legally binding travel advisory ordering quarantine for visitors from some states. Kevin P. Coughlin / Office of Gov. Andrew M. Cuomo These new virus spikes are having a real impact, throwing previous calculations into all kinds of doubt. They aren’t a second wave. It’s too soon for that. The weather isn’t even cool yet. Too many states are bending the first-wave curve—in exactly the wrong way. And so the demand for tests is overwhelming the supply in Arizona. Walt Disney Co. DIS, +1.53% has delayed the reopening of its California theme parks, previously set for July 17. The stock market has gotten jumpy again. U.S. jobless claims topped 1 million for the 14th week. The only good news, it seems, is that the American economy is so deflated now, there’s less air pollution. Take a deep breath and enjoy it. Just don’t lower your mask if anyone else is around. The next question in New York is this one: How far will Cuomo go to enforce the spike-state quarantine? Will violators be arrested? If so, where will they be held? Or is public shaming what all this is about? When DeSantis and the other governors were threatening New Yorkers, the talk was mostly bluster, as things turned out. Hardly anyone was cited, sued or jailed. Don’t miss: The coronavirus-led economic recession may be over, but the depression has barely begun From the beginning of the coronavirus crisis, Cuomo has emphasized that his state has neither the will nor the resources to compel compliance. Moral persuasion is the primary tool. That was true of the social distancing and the mask wearing. It’ll likely be true again. There’s a difference between legally binding and practically enforceable. But if Abbott or DeSantis happens to turn up in Times Square? Well, that could spark a reaction. Given the bitter back story, it could be a while before they can return to Austin or Tallahassee. This being New York, they’d better bring their toothbrushes and a change of underwear. Ellis Henican is an author based in New York City and a former newspaper columnist."}]}