{"article": [{"url": "https://www.marketwatch.com/story/its-certainly-sobering-to-know-that-new-york-will-be-without-broadway-this-summer-why-broadway-cant-bounce-back-from-the-coronavirus-shutdown-any-time-soon-2020-05-15", "published": 1602243440.0, "headline": "Broadway wonâ\u0080\u0099t reopen until June 2021 because of the pandemic â\u0080\u0094 3 reasons why theaters will be closed for so long", "body": "Theater fans wonâ\u0080\u0099t be able to give their regards to Broadway in person until June 2021 at the earliest. And certain factors could prevent New York Cityâ\u0080\u0099s theaters from reopening for quite some time. The Broadway League, the trade group that represents theater owners and producers, announced Friday that Broadway performances would be canceled through May 30, 2021 because of the coronavirus outbreak. Theaters are offering exchanges and refunds for tickets purchased for performances through then. The closure of Broadway, which began in March, led producers to pull the plug on some productions. Disney DIS, +1.53% Â said in May that it would close its Broadway musical production of â\u0080\u009cFrozenâ\u0080\u009d because of the pandemic. Previously, producers said the curtain had fallen for good on the productions of two plays, â\u0080\u009cHangmenâ\u0080\u009d and â\u0080\u009cWhoâ\u0080\u0099s Afraid of Virginia Woolf?â\u0080\u009d When the Broadway League previously announced that the Great White Way would remain closed through Labor Day, Charlotte St. Martin, the organizationâ\u0080\u0099s president, told MarketWatch that there was a significant chance performance cancellations would be extended further. Thatâ\u0080\u0099s because the arts and entertainment industry was in the fourth phase of New York stateâ\u0080\u0099s official reopening plan, which calls for gradually putting certain business sectors back online as long as the state meets certain metrics. â\u0080\u009cWe literally cannot reopen unless there is a confidence in the safety of the cast and crew and theatergoers,â\u0080\u009d St. Martin told MarketWatch in May. â\u0080\u009cSo we donâ\u0080\u0099t really know when that will be and thatâ\u0080\u0099s part of the challenge weâ\u0080\u0099re facing.â\u0080\u009d There are three big challenges facing Broadway shows in the age of coronavirus that could hamper its chances at reopening: No. 1: Nearly 16% of Broadway theatergoers are over the age of 65. And once you remove tourists from the equation, that percentage goes higher, industry experts said. No. 2: During the 2018-2019 season, tourists from outside the New York metropolitan area purchased 65% of the tickets sold for Broadway shows, according to data from the Broadway League, and nearly one in five Broadway audience members was visiting from abroad. No. 3: Many of the theaters are over 100 years old, and feature narrow aisles, seats arranged very close together and tiny bathrooms. Audience sizes would need to be reduced significantly to adhere to health expertsâ\u0080\u0099 guidelines to keep people at least six feet away from each other. Also see: â\u0080\u0098Hamiltonâ\u0080\u0099 movie is dropping exclusively on Disney+ this July Guaranteeing the safety of audiences and theater professionals will be difficult given the limitations presented by the theaters themselves. Social distancing isnâ\u0080\u0099t possible in most Broadway theaters, St. Martin added. “ â\u0080\u0098Social distancing just doesnâ\u0080\u0099t allow a show to be viable financially.â\u0080\u0099 ” â\u0080\u0094 Charlotte St. Martin, president of the Broadway League Backstage, actors and crew members are often in extremely close quarters, which makes the risk of transmitting an airborne illness like the coronavirus that causes COVID-19 much higher. â\u0080\u009cSocial distancing just doesnâ\u0080\u0099t allow a show to be viable financially,â\u0080\u009d St. Martin said. But even setting aside the troublesome logistics of reopening, there are other factors that will limit Broadwayâ\u0080\u0099s ability to bounce back from the coronavirus pandemic.Tourists are a key part of Broadwayâ\u0080\u0099s audience Read more:Letter from New York, epicenter of coronavirus: â\u0080\u0098The streets are virtually empty, but the birds go on singingâ\u0080\u0099 With such a large share of the audience for a Broadway show on any given day being made up of out-of-town visitors, Broadwayâ\u0080\u0099s ability to bounce back will very much depend on New York Cityâ\u0080\u0099s tourism sectorâ\u0080\u0099s ability to return to full strength. And if the past is any indication, that could take quite some time. â\u0080\u009cItâ\u0080\u0099s a completely different world that weâ\u0080\u0099re in now versus 9/11,â\u0080\u009d said Gregg Arst, president of theatrical ticketing analytics and consulting firm Tanna. â\u0080\u009cBut the example there is that it took about four years for international tourism to get back up to pre-9/11 levels.â\u0080\u009d “ Tourists purchased 65% of the tickets sold for Broadway shows last season. ” As a result, if Broadway reopens before tourism in New York has rebounded, producers are going to look to fill the seats at their shows with audience members from New York and its suburbs. That pivot could pose some difficulty for longer-running shows like â\u0080\u009cWickedâ\u0080\u009d and â\u0080\u009cChicago.â\u0080\u009d New York audiences are already familiar with those shows, which could make them a tougher sell. â\u0080\u009cThe freshness of a new Broadway show has its own enticement,â\u0080\u009d he said. â\u0080\u009cThe new shows may have an easier time going after the local audiences but the older legacy shows may be able to use this moment to really reinvigorate New York and the fabric of Broadway as part of their lives.â\u0080\u009dBroadwayâ\u0080\u0099s local audience tends to skew older Itâ\u0080\u0099s not really the case that when you look out at a Broadway audience you see a sea of grey hair. While there is a perception that Broadway theatergoers skew older, St. Martin said, the reality is that the average age of an audience member was 42.3 last season. â\u0080\u009cItâ\u0080\u0099s not spring chickens, but itâ\u0080\u0099s not the older audience,â\u0080\u009d St. Martin said. â\u0080\u009cYou take away all the tourists, whatâ\u0080\u0099s left? The Manhattan audiences tend to skew even older,â\u0080\u009d said Bill Hofstetter, a New York-based theater marketer. “ Almost 16% of Broadway theatergoers are over the age of 65 ” Older people are particularly susceptible to life-threatening complications from COVID-19. As a result, many older theatergoers feel more trepidation about returning to the seats of the Great White Way. A May study of New York City theatergoers conducted by Shugoll Research, a Maryland-based marketing research firm, found that 23% of people 55 and older said they were very unlikely to return to the theater. Another 45% said they would wait six months or longer before seeing shows again. Only 21% said they were very likely to start seeing shows again in the coming season. â\u0080\u009cWould you let your father go into a theater?â\u0080\u009d Hofstetter said. While older audience members are an important part of the theatergoing community, St. Martin noted that the industryâ\u0080\u0099s calculations on when to reopen wouldnâ\u0080\u0099t be based on any one group. â\u0080\u009cOur audience has to be safe no matter what age they are,â\u0080\u009d she said. Donâ\u0080\u0099t miss: â\u0080\u0098Opening up does not mean social activitiesâ\u0080\u0099: Your coronavirus guide to safely commuting, shopping, traveling and visiting the doctor as states reopenHow Broadway bounces back New York is highly dependent on Broadway reopening in order to thrive in a post-coronavirus world. In its last season, Broadway contributed $14.7 billion worth of economic impact to the Big Apple. â\u0080\u009cThatâ\u0080\u0099s people who stay in the hotels and eat in the restaurant because theyâ\u0080\u0099re here to see a Broadway show,â\u0080\u009d St. Martin said. Right. â\u0080\u009cBroadway is often called the beating heart of New York City, but it also provides real jobs that deliver real benefit to not just the Times Square area, but to the entire city.â\u0080\u009d In previous times of hardship the city has lent a hand â\u0080\u0094 following the terrorist attacks of September 11, 2001, the city subsidized the purchase of tens of thousands of tickets to Broadway shows. But as St. Martin noted, that â\u0080\u009cdoesnâ\u0080\u0099t even fill a house in one night.â\u0080\u009d And that relief would only come after the city has dealt with more pressing priorities. “ â\u0080\u0098Broadway is often called the beating heart of New York City, but it also provides real jobs that deliver real benefit to not just the Time Square area, but to the entire city.â\u0080\u0099 ” â\u0080\u0094 Charlotte St. Martin, president of the Broadway League Broadway, in the meantime, could borrow from the approach airlines have taken as they grapple with waves of cancellations because of the coronavirus, Arst said. â\u0080\u009cAirlines are looking out a year in advance,â\u0080\u009d he said. Most airlines are providing travelers with vouchers rather than cash refunds if they proactively cancel their travel plans because of COVID-19. Broadway could take a similar approach and try to entice people to exchange their tickets for next summer rather than cancel. â\u0080\u009cThatâ\u0080\u0099s not to say the customer is not just going to want their money back because there are customers who need that economic relief as well,â\u0080\u009d Arst noted. Beyond Broadway, regional theaters, touring shows and off-Broadway productions could have an easier time reopening, Hofstetter added. And theatergoers can expect to see discounts when shows return, industry experts said, though these could be limited depending on how many people shows can seat. Whatever route Broadway producers and theater owners choose, this historical closure will be challenging to bounce back from. â\u0080\u009cItâ\u0080\u0099s certainly sobering to know New York will be without Broadway this summer,â\u0080\u009d Arst said. This story was updated on Oct. 9, 2020."}]}