{"article": [{"url": "https://www.marketwatch.com/story/durable-goods-orders-climb-73-in-june-as-automaker-surge-offsets-boeing-weakness-2020-07-27", "published": 1595843540.0, "headline": "Durable-goods orders climb 7.3% in June as auto maker surge offsets Boeing weakness", "body": "The numbers: Orders for durable goods lasting at least three years rose strongly in June for the second straight month after historic declines in the early spring, but the momentum might be hard to sustain in the wake of more coronavirus cases and somewhat tighter government restrictions. Orders climbed 7.3% last month, the government said Monday. Wall Street economists had expected a 7% increase. What happened: Orders for new cars and trucks leapt 86% last month as auto makers made up more lost ground after getting slammed early in the pandemic. Auto and parts orders are still 25% lower in the first half of 2020 compared with the same period a year earlier, however. Aircraft manufacturers posted a whopping 462% decline in bookings. Boeing BA, -0.39% has seen demand for its planes dry up after a plunge in global travel during the coronavirus outbreak. The company only booked a single order in June and suffered nearly 200 cancellations. The company has also struggled to return its grounded 737 Max jets back into operation after a pair of deadly accidents in 2019. Read:Durable-goods orders climb 7.3% in June as auto maker surge offsets Boeing weakness If cars and planes are stripped out, orders rose a more modest 3.3%. Bookings rose for primary metals, fabricated-metal parts and heavy machinery. They fell slightly for computers. A key measure of business investment, known as core orders, also rose 3.3% last month. These orders exclude defense and transportation. Yet business investment had softened before the pandemic largely due to a major trade war between the U.S. and China and there’s little reason to expect a big snapback soon, economists say. Investment is running below last year’s pace. See:MarketWatch coronavirus recovery tracker The big picture: The momentum in manufacturing in May and most of June may be starting to wane after another surge in coronavirus cases, but the gains are unlikely to be reversed unless there’s another wave of shutdown orders nationwide. Still, further progress will be much slower until the coronavirus is contained. What they are saying?“Opening up the country brought life back into the economy, and the return of jobs, which is critical,” said senior economist Jennifer Lee of BMO Capital Markets. “However, opening up also brought the virus back into communities and that, alone, is the biggest risk to this recovery.” Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% rose in Monday trades."}]}