{"article": [{"url": "https://www.marketwatch.com/story/a-tale-of-two-2-billion-chinese-ipos-headed-in-very-different-directions-2020-08-13", "published": 1597395560.0, "headline": "A tale of two $2 billion Chinese IPOs headed in very different directions", "body": "KE Holdings Inc. on Thursday became the first Chinese initial public offering to raise $2 billion from a U.S. listing since iQiyi Inc., then saw its stock soar 87% into the close. Less than an hour later, iQiyi gave a stark reminder of the rocky path that many young Chinese stocks have walked on U.S. exchanges. Hovering over everything is the possibility that all Chinese companies could soon have to choose between living up to the laws of their own country or allowing U.S. investors greater visibility into their finances. IQiyi IQ, +0.84% IQ, +0.84%, a streaming company often dubbed the Netflix of China, announced that the Securities and Exchange Commission is investigating allegations that it was inflating its user numbers, revenue and other metrics, and shares plunged to a 12% decline in after-hours trading. IQiyi said it has hired “professional advisers” and begun an internal investigation. IQiyi went public in March 2018 at $18 a share, and has largely stayed higher than that level on the public markets. It fell lower this past April, though, when Wolfpack Research, a short seller focused on Chinese IPOs, issued an alarming report about iQiyi’s allegedly inflated numbers. Dan David’s firm based its report on in-person surveys of people in iQiyi’s target demographic, credit reports for all related entities and holding companies, and data from two Chinese advertising agencies with access to iQiyi data. That tale feels too familiar to U.S. investors in Chinese stocks. Not long before Wolfpack’s iQiyi report, Luckin Coffee Inc. LKNCY, -12.24%, dubbed the Starbucks of China, plunged after similar accusations of over-inflating numbers. Luckin has now lost 94% of its value, and the stock has been delisted from the Nasdaq and is now trading over the counter. Luckin, however, was not the first company to pull the wool over the eyes of investors. According to Stop The China Hustle, a website created by Geoinvesting to draw attention to the issue, U.S. investors have been defrauded of more than $50 billion by publicly traded Chinese companies listed on the NYSE or the Nasdaq over the past 10 years. More from Therese: The cautionary tale of Luckin Coffee While Chinese IPOs are required to file financial statements and other corporate filings with the SEC, they are extremely risky for investors. These companies have complex business structures created to evade both litigation from investors and repercussions from the Chinese government, which prohibits foreign investment in certain types of Chinese companies, including technology firms. In addition, their auditing firms do not have access to what is called the working papers of the company, so they can only conduct their audits based on materials they are given by company executives. Chinese deals are starting to get attention in Washington, with the Senate passing the “Hold Foreign Companies Accountable Act” in May. But the current heavy-handed approach, which seeks to de-list companies that do not allow for audit inspections after three years, would actually further hurt U.S. investors. In addition, as relations between the U.S. and China continue to deteriorate, the latest legislative efforts have been described by some pundits as attempting to advance foreign policy under the guise of securities laws, according to scholars at the Cato Institute, a Washington think tank. Also read:Washington is finally paying attention to Chinese IPOs, but Wall Street may pay the consequences. Yet nothing stops the constant parade of Chinese companies on Wall Street. According to Renaissance Capital, which tracks IPOs and manages IPO ETFs IPO, +1.98% IPOS, +1.22%, 18 Chinese companies, including KE Holdings BEKE, +2.48% , have gone public so far this year, raising $5.5 billion, excluding blank-check companies (yes, China is getting involved in those too). That compares with 13 deals that raised $2.7 billion in the same time frame last year. So far this year, Chinese companies have already raised more cash than the full year of 2019, when 25 companies raised $3.5 billion, according to Dealogic. See also: The CEO who made one of Silicon Valley’s worst acquisitions wants a $400 million blank check Investors clearly cannot get enough of Chinese initial public offerings. Since they missed the boat on the real Netflix and many other now-hot tech companies in the U.S., they are hoping to catch the upside on a copycat company with an even more massive addressable market in China. But until these companies are held to the same accounting standards as U.S. companies, they will always be much higher risk because it is easier for executives to fudge or fabricate numbers with fewer safeguards and watchdogs. Investors need to be cognizant of the big risks."}]}