{"article": [{"url": "https://www.marketwatch.com/story/us-government-bond-yields-steady-to-start-holiday-shortened-week-2020-06-29", "published": 1593450980.0, "headline": "U.S. government bond yields hold steady, kick off holiday-shortened week", "body": "U.S. Treasury yields were mostly unchanged Monday, after rates last week for long-dated debt hit a six-week low, amid rising cases of COVID-19 here and elsewhere in the globe. Debt investors are anticipating that the equity and fixed-income markets could face some month-end and quarter-end gyrations as money managers rebalance their portfolios after a brisk run-up for stocks. Markets will be closed on Friday in observance of the Fourth of July holiday and the bond market closes an hour early on Thursday due to the holiday. What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% was unchanged at 0.636%, after the benchmark bond touched its lowest level since May 14 on Friday. The 2-year note rate TMUBMUSD02Y, 0.156% edged 0.8 basis point lower to 0.158%, extending a move to its lowest level since June 1. Meanwhile, the 30-year bond yield TMUBMUSD30Y, 1.576% added 1.8 basis points to 1.390%, snapping a three session streak of heading lower. Bond yields fall as prices rise.What’s driving Treasurys? Growing cases in of coronavirus and the implications of a weaker global economy have helped to stoke appetite for government debt, keeping yields anchored lower as stocks have rallied on the back of optimism around positive economic data and a barrage of fiscal and monetary stimulus. Read: Debt from AT&T and other corporate giants saw biggest purchases from the Fed The number of confirmed COVID-19 cases topped 10 million around the world and the death toll surpassed a half million over the weekend, with Florida, South Carolina and Nevada all recorded their highest number of new infections in a single day. New Jersey on Monday postponed allowing indoor dining ‘indefinitely,’ while New York Gov. Andrew Cuomo said he might halt next Monday’s Phase III reopening, which would include allowing indoor dining and less restrictions on personal services, as well as outdoor activities. U.S. Health and Human Services Secretary Alex Azar warned on Sunday that “the window is closing” for his country to take action to curb the virus, as he predicted rising deaths and hospitalizations in the next couple of weeks. Arizona, California, Florida, Nevada and South Carolina are among the states that have become worrying focal points. In Europe, U.K. Prime Minister Boris Johnson pledged to spend tens billions of pounds to salvage the economy, building hospitals, schools, housing developments and “shovel-ready” road and rail projects, he said in an interview with The Mail on Sunday. Meanwhile, in China, industrial profits in May were up 6% from a year earlier, representing the first increase in 2020, official statistics released over the weekend showed. U.S. pending homes sales in May staged a historic rebound, soaring 44.3% in May as compared with April, the National Association of Realtors reported Monday, potentially signaling that the worst in residential real-estate may have passed. What are market participants saying? “Now that U.S. Treasury yields have joined Japanese and eurozone government bond yields at levels below 1%, the global search for yield has intensified as the pool of even moderately-yielding assets is shrinking,” said Peter Wilson, Wells Fargo Investment Institute’s global fixed-income strategist, in a note Monday."}]}