{"article": [{"url": "https://www.marketwatch.com/story/another-positive-coronavirus-test-for-titans-raises-total-to-23-cases-games-now-in-jeopardy-11602166871", "published": 1602154100.0, "headline": "Another positive virus test for the NFLâ\u0080\u0099s Titans raises total to 23 cases, games now in jeopardy", "body": "MINNEAPOLIS, MN - SEPTEMBER 27: Joshua Kalu #46 of the Tennessee Titans and his teammates take the field before the game against the Minnesota Vikings at U.S. Bank Stadium on September 27, 2020 in Minneapolis, Minnesota. (Photo by Stephen Maturen/Getty Images) Stephen Maturen/Getty Images NASHVILLE, Tenn. (AP) â\u0080\u0094 The Tennessee Titans have had another positive test result to raise their outbreak to 23 cases, a person familiar with the situation told The Associated Press on Thursday. Also, an inconclusive positive result from Wednesday now is positive. The Titansâ\u0080\u0099 facility remains closed and the team remains prohibited from any in-person activities, putting Sundayâ\u0080\u0099s game with Buffalo (4-0) at risk of at least being postponed. See also: Could Amazon buy more NFL TV rights? Now 21 have been returned since Sept. 29 with at least one positive test on eight of the past 10 days with the latest results, according to the person who spoke to the AP on condition of anonymity because neither the NFL nor the Titans announced the latest results. The NFL already postponed, then rescheduled the Titansâ\u0080\u0099 game with Pittsburgh from Oct. 4 to Oct. 25. See also: â\u0080\u0098Everybody is strugglingâ\u0080\u0099 â\u0080\u0094 how Olympic athletes are coping with Tokyo 2020 being postponed a year ESPN is reporting that many around the NFL are not happy with the Titans. iframe.twitter-tweet { width: 100% !important; } The Patriots are missing a second straight day of practice Thursday after reigning NFL Defensive Player of the year Stephon Gilmore joined quarterback Cam Newton on the reserve/COVID-19 list Wednesday. New England also has a defensive tackle from the practice squad on the list in the leagueâ\u0080\u0099s other mini-outbreak. The franchise has continued daily testing since the NFL told the Titans to close their facility on Sept. 29. The league sent all 32 teams a memo Thursday with a list of new protocols for clubs to follow when dealing with an outbreak or having been exposed to an outbreak during the coronavirus pandemic."}]}