{"article": [{"url": "https://www.marketwatch.com/story/u-k-prime-minister-rails-against-calls-to-let-the-virus-take-its-course-warning-the-nation-is-at-a-critical-moment-11601490057", "published": 1601554220.0, "headline": "Boris Johnson rails against calls to let the virus 'take its course,' warning the nation is at a 'critical moment'", "body": "Prime Minister Boris Johnson speaks at a remote press conference to update the nation on the COVID-19 pandemic, inside 10 Downing Street in London, England, on September 30, 2020. This was the 100th coronavirus briefing since the pandemic hit the U.K. POOL/AFP via Getty Images The U.K. would see a huge loss of life if it sought to let the virus \"take its course,\" said Prime Minister Boris Johnson, who addressed the public on Wednesday, warning the country had reached a critical moment with the biggest rise in daily coronavirus cases since the pandemic began. There were 7,108 new coronavirus infections on Wednesday and 71 new deaths, despite a range of new restrictions aimed at keeping the virus under control, including closing pubs and restaurants at 10 p.m. every evening and restricting social gatherings to a maximum of six people. Johnson said he would not hesitate \"to take further measures\" that would \"be more costly than the ones we put into effect now,\" adding that if citizens work together now \"then we give ourselves the best possible chance of avoiding that outcome, and avoiding further measures.\" Read: European governments grapple with lockdown fatigue and rising protests against new coronavirus restrictions He also railed against changing course to control the virus through a herd-like immunity. This is when a high proportion of a population has contracted or been vaccinated against an infectious disease, the likelihood of others in the population being infected is drastically reduced. This is a coveted yet challenging goal in a world without a COVID-19 vaccine. It is something that Sweden has flirted with. Johnson said: \"I know that some people will think we should give up and let the virus take its course, despite the huge loss of life that that would potentially entail. I have to say, I profoundly disagree, I don't think it is what the British people want, I don't think they want to throw in the sponge, they want to fight and defeat this virus, and that is what we're going to do.\" \"I don't want to go back to a national lockdown,\" he said. Read: Sweden is developing herd immunity, some of the country's experts claim, but the figures say otherwise The prime minister's caution against letting the virus take its course came as he faces a rebellion from within his own Conservative Party over his executive powers to create restrictions. According to reports, over 80 Conservative members backed an amendment to the Coronavirus Act aimed at allowing Parliament to debate and vote on coronavirus measures. Though the amendment to curtail emergency powers wasn't allowed by the Speaker of the House of Commons on Wednesday, the rebellion marks a lack of confidence from within the ruling party's ranks. This bloc would have been enough to swing the balance of power in the 650-seat parliament, of which the Conservatives control 364 seats. The health secretary, Matt Hancock, promised that Parliament would be consulted on significant national measures. Read: Police clash with protesters at U.K. COVID-19 demonstration against lockdowns Johnson also said that the government has ordered 32 billion items of personal protective equipment (PPE) and would have a four-month stockpile of masks, visors, gowns, and other items for the winter. By December, the government expects U.K. manufacturers to be able to meet 70% of the demand for PPE, compared with 1% before the pandemic began. Johnson also noted that the number of mechanical ventilators available to the health service has been tripled to 31,500 over the last six months. Read: Spanish government orders a heavily infected Madrid to shut down Johnson explained the best way to protect the health service, to keep children in school and the economy moving, is to follow the rules, adding he will address the nation regularly with updates. \"At this critical moment, when I know people will be wanting to know the details,\" he said, \"I will be providing regular updates through these news conferences.\" Johnson began his speech by paying tribute to students who have recently returned to university under severe and unusual circumstances. Thousands of students around the U.K. are in isolation as coronavirus outbreaks sweep campuses. \"I can assure everybody at universities that plans are being put in place to allow students home safely for Christmas,\" Johnson said. Watch: Prime Minister Boris Johnson hosts government coronavirus briefing div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Read: Italian president hits back at Boris Johnson over 'freedom loving' COVID-19 remarks"}]}