{"article": [{"url": "https://www.marketwatch.com/story/feds-say-ex-ebay-staff-sent-roaches-bloody-pig-face-to-critics-2020-06-15", "published": 1592235740.0, "headline": "Former eBay executives charged with terrorizing a couple who ran a newsletter by sending live cockroaches and spiders to their home", "body": "Six former eBay Inc. EBAY, +6.47% employees have been charged with waging an extensive campaign to terrorize and intimidate the editor and publisher of an online newsletter with threats and disturbing deliveries to their home, including live spiders and cockroaches, federal authorities said Monday. Executives were upset about the newsletter’s coverage, so their employees set out to ruin the lives of the couple who ran the website, sending a funeral wreath, bloody pig face Halloween mask and other alarming items to their home, authorities said. The employees also sent pornographic magazines with the husband’s name on it to their neighbor’s house and planned to break into the couple’s garage to install a GPS device on their car, officials said. “This was a determined, systematic effort by senior employees of a major company to destroy the lives of a couple in Natick all because they published content that company executives didn’t like. For a while they succeeded, psychologically devastating these victims for weeks as they desperately tried to figure out what was going on and stop it,” Massachusetts U.S. Attorney Andrew Lelling told reporters. James Baugh, of San Jose, California, who was eBay’s senior director of safety & security, and David Harville, of New York City, was eBay’s director of global resiliency, are charged with conspiracy to commit cyberstalking and conspiracy to tamper with witnesses. The other former eBay employees charged are Stephanie Popp, former senior manager of global intelligence; Brian Gilbert, former senior manager of special operations for eBay’s Global Security Team; Stephanie Stockwell, former manager of eBay’s Global Intelligence Center; and Veronica Zea, a former eBay contractor who worked as an intelligence analyst in the Global Intelligence Center. There were no lawyers listed for them in court documents. Court documents detail how two members of the company’s executive leadership team orchestrated a plot to go after the couple after the newsletter published an article about litigation involving eBay. One executive who is not named in court documents directed Baugh to “take her down,” referring to the newsletter’s editor, according to court documents. The executive texted another unnamed executive: “We are going to crush this lady,” court documents say. In addition to the disturbing deliveries, the employees set up fake social media accounts to send threatening messages to the couple, authorities said. After the bloody pig mask was delivered, the editor received a message saying: “DO I HAVE UR ATTENTION NOW????,” according to court documents. They also posted the couple’s names and address online, advertising things like yard sales and encouraging strangers to knock on the door if they weren’t outside. Authorities said the staff lied to police about eBay’s involvement in the cyberstalking campaign, and lied to company lawyers about their roles. Gilbert, a former police captain in Santa Clara California, even reached out to the couple to offer help in stopping the harassment, authorities said. “They hoped this ‘white knight strategy’ would create some good will toward the company, result in more favorable articles and please eBay’s management,” said Joseph Bonavolonta, special agent in charge of the FBI office in Boston. An internal investigation was launched after eBay was notified by law enforcement in August of “suspicious actions by its security personnel,” company officials wrote in a prepared statement. The employees were fired in September, the company said. The company’s then-CEO Devin Wenig also stepped down in September. Wenig said at the time that he was stepping down over differences with the board of directors and the company didn’t clarify Monday whether this investigation played a role in his departure. The committee formed by the company’s board of directors to oversee the investigation said eBay “took these allegations very seriously from the outset.” “Upon learning of them, eBay moved quickly to investigate thoroughly and take appropriate action,” it said."}]}