{"article": [{"url": "https://www.marketwatch.com/story/congress-should-consider-breaking-up-big-tech-and-limiting-acquisitions-11602015983", "published": 1602004280.0, "headline": "Congress should consider breaking up Big Tech and limiting acquisitions, House report says", "body": "Facebook Inc. Chief Executive Mark Zuckerberg testified remotely at a contentious July hearing before the House Judiciary Subcommittee on Antitrust, Commercial and Administrative Law. Getty Images Big Tech poses a grave threat to markets that might require breaking up the most prominent U.S. tech companies and limiting their acquisitions, concluded a House subcommittee report issued Tuesday. The House Judiciary Antitrust, Commercial and Administrative Law Subcommittee has held hearings for more than a year to investigate the business practices of Amazon.com Inc. AMZN, Apple Inc. AAPL, Facebook Inc. FB, and Google parent Alphabet Inc. GOOGL GOOG Last week, the Judiciary subcommittee held its seventh and final hearing, and issued a withering report on the companies’ actions Tuesday. “To put it simply, companies that once were scrappy, underdog startups that challenged the status quo have become the kinds of monopolies we last saw in the era of oil barons and railroad tycoons,” Rep. David Cicilline, D-R.I., chairman of the House Judiciary Antitrust, Commercial and Administrative Law Subcommittee, said in a statement accompanying the report. “Although these firms have delivered clear benefits to society, the dominance of Amazon, Apple, Facebook, and Google has come at a price.” The 449-page report suggests breaking apart tech companies in an effort to separate businesses so they do not benefit each other and potentially harm competition, as well as other potential measures. “These firms typically run the marketplace while also competing in it — a position that enables them to write one set of rules for others, while they play by another, or to engage in a form of their own private quasi regulation that is unaccountable to anyone but themselves,” Cicilline said. Rep. Jim Jordan, R-Ohio, a ranking member of the committee who has frequently invoked charges of anti-conservative bias against Silicon Valley, had a different view. “Big tech is out to get conservatives,” he said in a statement. “Unfortunately, the Democrats’ partisan report ignores this fundamental problem and potential solutions and instead advances radical proposals that would refashion antitrust law in the vision of the far left.” The report also suggests that Congress decree that “any acquisition by a dominant platform would be presumed anticompetitive unless the merging parties could show that the transaction was necessary for serving the public interest and that similar benefits could not be achieved through internal growth and expansion.” The most contentious hearing came in late July, when the chief executives of all four companies faced a barrage of piercing questions about their market power and business strategies. Read more: Antitrust questions bruise but don’t break Big Tech CEOs in historic hearing At the time of those hearings, Cicilline — a fierce critic of Big Tech — said many of their business practices “have harmful economic effects. They discourage entrepreneurship, destroy jobs, hike costs, and degrade quality. Simply put: They have too much power. This power staves off new forms of competition, creativity, and innovation.” While some tech observers initially called the recommendations overly ambitious, others said they may be merely providing broad guidelines to potential reforms in the next Congress. “My biggest concern is it tries to do too much by effectively addressing privacy, competition, and free speech,” said Will Rinehart, senior research fellow at Center for Growth and Opportunities, an economic research firm. “I hoped it would be more focused on competition.” If the Democrats win control of the Senate, and maintain a majority in the House following the Nov. 3 elections, the party is widely expected to ramp up investigations and legislation of Big Tech. Sens. Elizabeth Warren of Massachusetts, Amy Klobuchar of Minnesota, and Richard Blumenthal of Connecticut are expected to lead the political charge. Read more: If the Democrats win the Senate, Big Tech better be ready for a bigger fight “The House staff report lays out clearly how our online marketplace is increasingly stacked against us, and is not serving consumers fairly,” Marta Tellado, CEO of Consumer Reports, said in a statement. “A handful of powerful companies are restricting and controlling the choices of everyone else, in order to enrich and entrench themselves.” Pro-business groups immediately pushed back at the report, claiming such punitive actions would damage small businesses. “It is clear that Rep. David Cicilline and House Democrats do not understand the extraordinary value that so-called “Big Tech” digital platforms deliver to our economy, and most importantly, to small businesses during the COVID-19 recession,” Jake Ward, president of the Connected Commerce Council, said in a statement. “Amid a global pandemic that has cost American lives, decimated the U.S. economy, and disrupted our way of life, small business tools and services made by America’s leading technology companies are helping millions of Main Street businesses adapt and survive,” Ward said. News of the report sent shares of Amazon, Alphabet, Facebook, and Apple down in trading Tuesday amid President Trump’s avowal to end stimulus negotiations until after the election. Amazon’s stock took the biggest hit, dropping 3%. Apple was down 2.9%, while Facebook declined 2.3%, and Google slid 2.1%. Despite a sell-off by jittery investors on Tuesday, Wedbush Securities analyst Daniel Ives said he believes tech stocks could rally another 15% by the end of the year, led by Apple, Microsoft Corp. MSFT, +2.48%, Salesforce.com Inc. CRM, +2.21%, and others. “While the political landscape remains in flux, regardless of a Biden or Trump Presidency, we continue to see the path higher for tech stocks given the underlying fundamental drivers that should be front and center during 3Q earnings over the coming weeks with no signs of slowing down heading into 2021,” Ives said in a note late Tuesday."}]}