{"article": [{"url": "https://www.marketwatch.com/story/these-money-and-investing-tips-can-help-you-build-a-portfolio-that-can-stand-the-test-of-time-2020-10-04", "published": 1601821580.0, "headline": "These money and investing tips can help you build a portfolio that can stand the test of time", "body": "Don’t miss these top money and investing features: Don’t just default to the S&P 500: Consider this simple four-fund portfolio Warren Buffett knows these are the best investors to follow with your own money Why S&P 500 returns could be flat until 2030 unless you reinvest dividends You have ample savings. So why are you scared of running out of money? Who will win the presidential election? Look at stock markets for clues These money and investing stories, popular with MarketWatch readers over the past week, offer advice and insights about how to be a patient, prudent buyer who is comfortable holding stocks and other assets for the long-term — making course corrections as needed. INVESTING NEWS & TRENDSDon’t just default to the S&P 500: Consider this simple four-fund portfolio You’ll get the comfort of the ubiquitous index with exposure to historically higher performanceDon’t just default to the S&P 500: Consider this simple four-fund portfolio Why this frustrated value stock pro sees shades of 1999 in the market now — and bargains in the future Buying growth stocks at any price typically comes at a price, writes Vitaliy Katsenelson.Why this frustrated value stock pro sees shades of 1999 in the market now — and bargains in the futureWarren Buffett knows these are the best investors to follow with your own money Savvy ‘quality shareholders’ back smartly run companies and enjoy superior returns. Warren Buffett knows these are the best investors to follow with your own moneyWhy S&P 500 returns could be flat until 2030 unless you reinvest dividends U.S. market’s expected 10-year return suffers when stock ownership is above-average — like now.Why S&P 500 returns could be flat until 2030 unless you reinvest dividendsHere’s the shocking truth about Robinhood investors vs. Wall Street stock pros Individual investors as a group are doing better than most U.S. equity mutual funds.Here’s the shocking truth about Robinhood investors vs. Wall Street stock prosWhat’s the biggest threat that retirees face? It’s probably not what you thinkWhat’s the biggest threat that retirees face?You have ample savings. So why are you scared of running out of money? Distress over not having enough is all-too-common — even among the wealthy.You have ample savings. So why are you scared of running out of money?Who will win the presidential election? Look at stock markets for clues The stock market doesn’t decide who wins the election, but history shows that a weak performance in the run-up to the vote favors the challenger — and vice versa.Who will win the presidential election? Look at stock markets for clues"}]}