{"article": [{"url": "https://www.marketwatch.com/story/residents-flee-gulf-coast-ahead-of-two-potential-hurricanes-2020-08-23", "published": 1598226680.0, "headline": "Residents flee Gulf Coast ahead of two potential hurricanes", "body": "NEW ORLEANS — The Gulf Coast braced Sunday for a potentially devastating hit from twin hurricanes as two dangerous storms swirled toward the U.S from the Gulf of Mexico and the Caribbean. Officials feared a history-making onslaught of life-threatening winds and flooding along the coast, stretching from Texas to Alabama. A storm dubbed Marco grew into a hurricane Sunday as it churned up the Gulf of Mexico toward Louisiana. But, Marco’s intensity was fluctuating, forecasters said, and the system was downgraded to a tropical storm Sunday night. Another potential hurricane, Tropical Storm Laura, lashed the Dominican Republic and Haiti, and was tracking toward the same region of the U.S. coast, carrying the risk of growing into a far more powerful storm. Experts said computer models show Laura could make landfall with winds exceeding 110 mph, and rain bands from both storms could bring a combined total of 2 feet of rain to parts of Louisiana and several feet of potentially deadly storm surge. iframe.twitter-tweet { width: 100% !important; } “There has never been anything we’ve seen like this before, where you can have possibly two hurricanes hitting within miles of each over a 48-hour period,” said Benjamin Schott, meteorologist in charge of the National Weather Service’s Slidell, Louisiana, office. The combination of the rain and storm surge in a day or two means “you’re looking at a potential for a major flood event that lasts for some time,” said weather service tropical program coordinator Joel Cline. “And that’s not even talking about the wind.’’ Where precisely Marco was headed — and when the storm might arrive — remained elusive Sunday. President Donald Trump approved Louisiana’s request for federal help related to the pair of storms, Louisiana Gov. John Bel Edwards said in a news release Sunday. He had submitted the request to Trump and the Federal Emergency Management Agency on Saturday. Trump also approved an emergency declaration for Mississippi, according to a White House news release late Sunday. Marco was initially expected to make landfall Monday, but the National Hurricane Center said that “a major shift” in a majority of their computer models now show the storm stalling off the Louisiana coast for a few days before landing west of New Orleans — and likely weakening before hitting the state. However, skeptical meteorologists at the center were waiting to see if the trends continue before making a dramatic revision in their forecast. Marco is a small storm that may be pushed westward along the Louisiana coast, delaying landfall but worsening storm surge, Cline said. The prospect of piggybacked hurricanes was reviving all-too-fresh memories of damage caused by Hurricane Katrina, which struck the Gulf Coast on Aug. 29, 2005. The storm has been blamed for as many as 1,800 deaths and levee breaches in New Orleans led to catastrophic flooding. “What we know is there’s going to be storm surge from Marco, we know that that water is not going to recede hardly at all before Laura hits, and so we’ve not seen this before and that’s why people need to be paying particular attention,” Edwards warned at a Sunday briefing. Along the main drag on the barrier island of Grand Isle, south of New Orleans, Starfish Restaurant manager Nicole Fantiny could see an exodus of people driving off the island. “They are all packing up and leaving,” she said. Fantiny wasn’t planning to leave, at least for Marco, but she was anxious about the possible one-two punch from both storms. Her husband works with the town’s fire and police departments, so she said they are always among the last ones to leave. “My house was built in 1938 so I think we’re good,” she said hopefully. Marco had been expected to dance above and below hurricane status after hitting the 75 mph-wind mark Sunday afternoon. “The central Gulf could be really under the gun between Marco and Laura in back-to-back succession,’’ said Colorado State University hurricane researcher Phil Klotzbach. “Certainly both of these storms can impact New Orleans significantly. It just remains to be seen if the track for Laura tracks a bit to the west.” University of Miami hurricane researcher Brian McNoldy warned that anyone in New Orleans should be alarmed by the threat. At issue from possible dual hits: whether the levee system can withstand the stress, he said. In New Orleans, the city’s aging drainage system has been a particular point of concern in recent years after an intense 2017 storm flooded streets and raised questions about the system’s viability. Because the city is surrounded by levees and parts are below sea level, rainwater must be pumped out to prevent flooding. Any storm system that sits over the city and dumps rain for extended periods of time, or bands of rain that come in rapid succession, is a cause for concern. New Orleans resident Matthew Meloy and two friends loaded a van with cases of bottled water in the parking lot of a New Orleans Walmart Sunday. He said they still have a lot of storm preparations ahead. “Check the batteries, flashlights, stocking up on food and trying to park the car on the highest point possible we can find,” he said. “I already spent like 40 minutes this morning filling up the tanks in the cars.” Tourists were strolling through the New Orleans French Quarter under overcast skies as workers boarded up shop windows. Louisiana corrections officials were evacuating 500 inmates from a jail in Plaquemines Parish, near the coast, to another facility in preparation for the storms. In Kenner, just outside New Orleans, resident P.J. Hahn said checkout lines in a Sam’s Club reached to the back of the store, while authorities said 114 oil and gas producing platforms in the Gulf have been evacuated as the storms churn toward the Louisiana coast. Because of strong winds from the southwest, Marco may attain and then lose hurricane status before it hits land, meteorologists said. But those winds could be gone when Laura ventures to the central Gulf, where the usually bathtub-warm water is a degree or two warmer than normal, Klotzbach said. The warmer the water, the stronger the fuel for a hurricane. “It, unfortunately, might peak in intensity about landfall. That’s the one thing I worry about with this one,” MIT meteorology professor Kerry Emanuel said of Laura. His multiple computer simulations show a decent chance of winds of more than 110 mph for Laura at landfall, as do other computer models. The key for Laura’s future is how it survives Cuba. Originally forecast to rake over almost the entire length of the island and potentially weaken, the storm late Sunday moved further south, skirting the island. If that continues, it is more likely to come out strong enough to power up over the favorable environment of the Gulf of Mexico, Klotzbach said. If that continues, Laura could hit further west in the Gulf, possibly into Texas instead of Louisiana, he said. If it hits Louisiana that would break the record for two named storms hitting the state so close together. The current record is five days apart in 1885, Klotzbach said. And there’s one long-term possibility that adds to the risk. As Laura moves north after landfall into Oklahoma, there’s a chance it will be caught up into the jet stream, travel east and emerge over North Carolina and return to tropical storm status, McNoldy and Klotzbach said. By Sunday night, Laura was 125 miles southeast of Camaguey, Cuba, with 60 mph winds moving west-northwest at 21 mph. Marco was 185 miles south-southeast of the mouth of the Mississippi River, with 70 mph winds, moving north-northwest at 12 mph. In Empire, Louisiana, about 50 miles south of New Orleans near the mouth of the Mississippi River, shrimp, oyster and fishing boats line the docks. It was eerily quiet Sunday evening, as most fishermen had already secured their boats. Mike Bartholemey was putting extra blocks of wood under his recently dry docked 50-foot shrimp boat “Big Mike,” out of his concern that hurricane winds might topple his boat to the ground. In Venice, a fishing town on the Mississippi River, shrimper Acy Cooper was up early Sunday to move his three shrimp boats from the harbor into the bayous nearby to ride out the storm. It’s the same area where he moored his boat during Hurricane Katrina. The boat survived; his house in Venice did not."}]}