{"article": [{"url": "https://www.marketwatch.com/story/amazon-reaches-1-million-workers-as-pandemic-pushes-total-up-11596136565", "published": 1596122660.0, "headline": "Amazon reaches 1 million workers amid pandemic hiring frenzy", "body": "Amazon has reached the 1 million milestone for employees, though its earnings report Thursday afternoon is expected to report a number just shy of that mark as many workers are still listed as temporary. AFP via Getty Images In the latest indication that the COVID-19 pandemic has been a boon for Big Tech and especially Amazon.com Inc., Amazon’s workforce has grown to 1 million. The milestone was first revealed in the prepared remarks of CEO Jeff Bezos for his testimony Wednesday before a House antitrust subcommittee hearing examining the tech giants’ dominance. The figure includes the 175,000 temporary workers the company has hired during the pandemic, 125,000 of whom will be given the chance to become permanent employees. “Amazon directly employs a million people, many of them entry-level and paid by the hour,” Bezos said in his prepared testimony, which was cut due to time constraints during the actual hearing. “We don’t just employ highly educated computer scientists and MBAs in Seattle and Silicon Valley. We hire and train hundreds of thousands of people in states across the country.” Amazon AMZN, +3.01% has added 159,600 employees since March 31, when the internet and retail giant last reported its official headcount as 840,400 and is up sharply from 630,600 a year earlier. Since the pandemic sparked shelter-in-place orders and increased demand for online shopping and delivery, the Seattle-based company has hired workers for fulfillment, operations and other duties. Because some of those workers are seasonal or temporary, the official headcount in Amazon’s earnings report, which is scheduled for Thursday afternoon, will be slightly lower, a company spokesman said Wednesday. As the coronavirus crisis has bolstered Amazon’s business, it has also brought renewed scrutiny of the conditions under which many of its employees work. The company, which has historically fought its workers’ attempts to unionize, has seen COVID-19 infections at its warehouses and fired an employee who organized a walkout over working conditions in a Staten Island, New York warehouse in March. There have also been coronavirus cases at its Whole Foods stores. See: Amazon warehouse employees sue company over possible exposure to coronavirus: report Despite the criticism about the working conditions of Amazon’s lower-paid workers, Bezos in his written testimony touted the benefits the company offers to those workers, including a program that pays 95% of training costs for certificates or diplomas in high-demand fields. See: Amazon executive says he quit to protest firings of workers who spoke out Amazon’s top retail competitor, Walmart WMT, +1.00%, is the largest employer in the U.S., employing 2.2 million workers at its stores. The legacy brick-and-mortar retailer said this week that it has hired 400,000 workers during the pandemic."}]}