{"article": [{"url": "https://www.marketwatch.com/story/sp-500-nasdaq-score-record-closes-as-stock-reclaim-perch-at-all-time-highs-2020-08-18", "published": 1597770500.0, "headline": "S&P 500, Nasdaq score record closes, as stock reclaim perch at all-time highs", "body": "MARKETWATCH FRONT PAGE Major U.S. stock indexes finished Tuesday mostly in record territory, despite ongoing wrangling in Congress over a further coronavirus aid and concerns about how the economy will fare when an unprecedented raft of fiscal stimulus eventually burns off. See full story.University of North Carolina abandons in-person classes after COVID cases grow — and outbreaks are happening at several other campuses UNC Chapel Hill said it would move classes online after multiple clusters of coronavirus cases. Colleges across the country that have brought students back to campus are reporting dozens of positive cases of COVID-19. See full story. Life will never be the same for people over 60 — even with a COVID-19 vaccine Most will keep taking precautions. Here’s a preview of post-vaccine life for older Americans. See full story.Another warning from 1918 ‘Spanish flu’ for COVID-19: ‘Survival does not mean that individuals fully recovered’ ‘We may never know the true mortality consequences of 1918 because of incomplete or inaccurate record keeping, issues that also undermine our ability to quantify the impact of COVID-19.’ See full story.California’s landmark privacy law is Facebook’s next ‘nightmare’ The ominous legal cloud of CCPA, which one data-security expert calls the most far-reaching law impacting California businesses, goes far beyond Facebook. Some 500,000 companies nationwide who deal in data in the Golden State are affected under the law’s broad rules. See full story.MARKETWATCH PERSONAL FINANCE A new working paper looks at the effects of the 1918 influenza and COVID-19 pandemics on mortality and the economy, plus the role of non-pharmaceutical interventions. See full story."}]}