{"article": [{"url": "https://www.marketwatch.com/story/another-cruel-irony-of-new-yorks-post-covid-comeback-2020-07-24", "published": 1595603000.0, "headline": "Another cruel irony of New Yorkâ\u0080\u0099s post-COVID comeback", "body": "Nothing says New York quite like a crowded subway. Now be careful what you wish for. They are finally coming back. Crowded, of course, is a relative concept. In the pre-COVID-19 days, rush-hour subway cars could be ranked according to a four-tier hierarchy: Crowded. Violating-My-Personal-Space Crowded. Actually-Causing-Me-Physical-Pain Crowded. And: I-Donâ\u0080\u0099t-Think-I-Can-Squeeze-onto-This-Train-But-I-Really-Need-to-Get-to-Work-So-Iâ\u0080\u0099m-Gonna-Try Crowded. And there was one bonus category that all New Yorkers got to know. The car was inexplicably empty. Then, the doors popped open and a horrible stench wafted out. Suddenly, riders whoâ\u0080\u0099d thought theyâ\u0080\u0099d hit the jackpot were frantically scrambling onto another car.Â None of that is back yet. But one-third to one-half of the seats were taken on an uptown No. 2 train pulling into 14th Street in Manhattan on Friday morning, which is a whole lot more than you could have said a month ago. A few stragglers were even standing by the doors. But those are not the measures that matter most to New York subway riders. Their calculations are always more personal. â\u0080\u009cI have one question when I get on the train,â\u0080\u009d said Karen Kramer, a graphic artist who lives in Crown Heights, Brooklyn. â\u0080\u009cWill someone I donâ\u0080\u0099t know be in the seat next to me?â\u0080\u009d Itâ\u0080\u0099s the exact same question that air-travel passengers are asking their airlines. No, say Delta DAL, +0.39% Â and JetBlue. JBLU, -0.07% Â Maybe, say American AAL, +0.34% Â and United. UAL, +0.32% Â Kramer was doing what she could for safety, keeping her arms folded, not touching anything and covering her face with a black-cloth mask. Mask wearing isnâ\u0080\u0099t at 100% in the subway these days, but itâ\u0080\u0099s awfully close. And the cars are still looking spiffy from the overnight shutdowns and the extra attention of New York City Transitâ\u0080\u0099s cleaning crews. In Kramerâ\u0080\u0099s car, number 7119, no one appeared to be homeless, and only one panhandler â\u0080\u0094 holding a paper coffee cup, saying nothing â\u0080\u0094 had come through on her 25-minute ride from President Street, she said. All these developments are signs that, as the U.S. logs its 4 millionth coronavirus infection and other states are spiking to record highs, New York is ever so gradually coming back to life. Also see: New York sees increase in virus infections among 20-somethings â\u0080\u009cFunny thing is,â\u0080\u009d Kramer said, â\u0080\u009cthe fear thatâ\u0080\u0099s kept people off the subway is also whatâ\u0080\u0099s made the subway nice. Since all this started, itâ\u0080\u0099s been like having your own private subway car.â\u0080\u009d Please donâ\u0080\u0099t get used to it. Itâ\u0080\u0099s not economically viable, as state, local and transit officials keep reminding everyone. No transit system the size of New Yorkâ\u0080\u0099s can operate for long without millions and millions of daily riders. Since COVID-19 came around, the $17 billion Metropolitan Transportation Authority budget has lost so much in fares, tolls, subsidies, real estate taxes and other revenues, no one has any idea how such a deep budget hole will ever be filled. But a revived economy means a revived transit system, and thatâ\u0080\u0099s at least a start. How else are all those Midtown and Downtown office buildings supposed to get filled? According to Mayor Bill de Blasio, subway ridership is up 75% from the COVID low. Bus ridership is up 57%. Traffic is up 23% on the East River bridges and 17% on the Harlem River bridges. Those numbers do sound promising, though in some cases the cityâ\u0080\u0099s stay-at-home policies had cut human movement as much as 90%. â\u0080\u009cFor the first time in a while,â\u0080\u009d the mayor noted, â\u0080\u009cwe see subway ridership passing bus ridership over all. Which means more and more people are feeling confident they can go into the subway and feel safe.â\u0080\u009d And the case count seems to be saying, Press ahead. â\u0080\u009cIâ\u0080\u0099m proud to say that our rates of new cases of the coronavirus through all our phases of reopening have not had an uptick whatsoever,â\u0080\u009d Dr. Ted Long, who heads the cityâ\u0080\u0099s Test and Trace Corps, said in a Manhattan briefing on Thursday. â\u0080\u009cTheyâ\u0080\u0099ve been completely stable.â\u0080\u009d And donâ\u0080\u0099t forget the city buses. In some ways, they tell the yay-boo story even more clearly than the subways do. The bottom line: More riders, slower trips. In April, daily bus ridership hit a low of 430,000. In the past couple of weeks, itâ\u0080\u0099s been in the 1.2-million range. Those numbers are still half of the pre-pandemic peaks. But theyâ\u0080\u0099re another indication of a city reawakening. Just donâ\u0080\u0099t expect to get there comfortably or fast. Also read: New York culture creaks back to life, COVID-style Craig Cipriano, the acting senior vice president of NYC Transitâ\u0080\u0099s Department of Buses, was crowing to the MTAâ\u0080\u0099s Transit and Bus Committee about rising ridership. But even he quickly added: â\u0080\u009cOur buses continue to navigate through multiple new obstacles to the normal flow of traffic.â\u0080\u009d Congratulations, New York. Youâ\u0080\u0099re coming back to life again. Please enjoy the returning discomfort and delays. Ellis Henican is an author based in New York City and a former newspaper columnist."}]}