{"article": [{"url": "https://www.marketwatch.com/story/bolton-book-adds-urgency-to-trump-bid-to-depict-himself-as-a-china-hawk-and-to-paint-biden-as-a-beijing-apologist-2020-06-18", "published": 1592602460.0, "headline": "Bolton book adds urgency to Trump bid to depict himself as a China hawk and to paint Biden as a Beijing apologist", "body": "NEW YORK (AP) — The Trump re-election campaign has been running television ads seeking to portray presumptive Democratic presidential nominee Joe Biden as a puppet of China, but, during a 2019 meeting in Osaka, Japan, President Donald Trump warned Chinese President Xi Jinping that Democrats were actually hostile to China, according to a new book by former Trump national-security adviser John Bolton. “The Bolton allegations are just the most noxious and hateful cherry on top of a sundae that already existed here,” Ron Klain, a longtime Biden adviser, said in an interview. “We have seen for three years that Donald Trump has curried favor with authoritarian regimes that are willing to help him personally and politically.” The Bolton memoir is set to be published June 23, and, though it went under White House review in late December, the Justice Department has embarked on a last-ditch bid to block its distribution. Trump, who for years has boasted of the warm friendship he believed he’d developed with Xi, has sought to create a perception of daylight in that relationship as his campaign zeroed in on a plan to attack Biden, chairman of the Senate Foreign Relations Committee before serving as vice president to Barack Obama, as overly tolerant toward Beijing. See:Leaked National Republican Senatorial Committee memo recommends talking points characterizing China as an enemy and Democrats as soft on the issue There’s new urgency to that mission as additional episodes described in the Bolton book reportedly see Trump acceding to China’s construction of a de facto concentration camp to house members of its Uighur Muslim minority and pleading with Xi to commit to the purchase of more U.S. agricultural output to shore up Trump’s electoral standing in “farm states.” In the past two days, Trump has inked bipartisan legislation passed weeks earlier by Congress on standing up to China over its treatment of the Uighurs and contradicted his own top trade negotiator to suggest a willingness to decouple from China. Trump takes seemingly every opportunity, and creates others, to blame China for not just the origin of the coronavirus-borne disease COVID-19 but its spread to the U.S. He even brought it up in his commencement address last weekend at West Point. The virus, he told the graduating cadets, “came to our shores from a distant land called China.” He’s also packaged the U.S.’s partial block on flights from China in the early days of the viral outbreak as hawkish and can credibly call attention to trade tariffs imposed on China (even if he regularly mischaracterizes those tariffs as requiring Chinese companies to deposit funds into U.S. coffers). Detail from the cover of John Bolton's forthcoming — pending resolution of Trump administration challenges to its release — book, titled \"The Room Where It Happened: A White House Memoir.\" Simon & Schuster “The upper Midwest was in a decline, and it’s because those jobs are in China and we won [in 2016] with that,” said Steve Bannon, the chief executive officer of Trump’s last campaign, in a recent interview. “Trump can still deliver a tough message about getting those jobs back.” “ Trump’s claim that the book is ‘pure fiction’ is at odds with the administration’s effort to shield information in the book from public consumption because of its being classified, as nonfacts cannot be classified. ” In the Bolton book, Trump is described as pivoting “stunningly” in a conversation with Xi, with only interpreters present, from Xi’s Uighur crackdown to his own re-election prospects, “alluding to China’s economic capability to affect the ongoing campaigns, pleading with Xi to ensure he’d win.” Bolton wrote that this section of the book would have recorded Trump’s exact words, “but the government’s pre-publication review process has decided otherwise.” From the MarketWatch archives (July 2019):The trade war is over — and the winner is China, writes Howard Gold The White House worked furiously to block the book, asking a federal court for an emergency temporary restraining order Wednesday against its release. Bolton’s allegations that Trump solicited Chinese help for his re-election effort carried echoes of Trump’s attempt to get political help from Ukraine, which led to his impeachment. “I am hard-pressed to identify any significant Trump decision during my tenure that wasn’t driven by re-election calculations,” Bolton wrote. The 577-page book paints an unvarnished portrait of Trump and his administration, amounting to the most vivid, first-person account yet of how Trump conducts himself in office. Several former officials have written books, though most have been more flattering toward the president. Others have indicated they were saving their accounts of their time working for Trump until after he left office to speak more candidly. The Associated Press obtained a copy of Bolton’s book in advance of its release next week. Bolton, Trump’s national-security adviser for a 17-month period ending last September, said Congress should have expanded the scope of its impeachment inquiry to include such incidents as occurred in Trump’s dealings with Xi. Capitol Report:Trump asked China’s Xi to buy U.S. farm products to help him win re-election, Bolton book says U.S. Trade Representative Robert Lighthizer said Wednesday that he attended a meeting between Trump and Xi at the Group of 20 industrialized nations in Osaka but never heard Trump pleading with Xi to buy more agriculture products to ensure he would win re-election. Market Pulse:China reportedly set to speed purchases of U.S. agriculture products Deeply critical of the president and much of his senior team, Bolton wrote that because staff had served him so poorly, Trump “saw conspiracies behind rocks, and remained stunningly uninformed on how to run the White House, let alone the huge federal government.” He added that while he was at the White House, Trump typically had only two intelligence briefings a week “and in most of those, he spoke at greater length than the briefers, often on matters completely unrelated to the subjects at hand.” On Thursday Trump denounced the book as “a compilation of lies and made up stories, all intended to make me look bad.” “Many of the ridiculous statements [Bolton] attributes to me were never made, pure fiction,” he tweeted, a claim that appears to be at odds with any effort to shield information in the book from public consumption because of its being classified. It can in fact, be read as a tacit admission that many of Bolton’s allegations were accurate. Trump accused Bolton of violating the law by releasing the book, telling Fox News Channel’s “Hannity” on Wednesday: “It’s highly classified information, and he did not have approval.” The book includes embarrassing claims by Bolton that Trump thought Finland was part of Russia; didn’t know that the United Kingdom was a nuclear power, as it has been for decades; and called reporters “scumbags” who should be “executed.” The book, titled “The Room Where It Happened: A White House Memoir,” is set to be released Tuesday by ViacomCBS VIAC, -2.34% VIACA, -2.18% unit Simon & Schuster. It has been the subject of a lengthy battle between Bolton and the White House. The Justice Department sued on Tuesday in an effort to delay publication of the book, claiming that it still contained highly classified information and that a required review by the National Security Council had not been concluded. According to the filing, a career official determined no classified material remained in April, but national-security adviser Robert O’Brien initiated a secondary review that deemed additional information to be classified. Bolton wrote that he was asked to add phrases like, “in my view,” to make it clear he was expressing his opinion instead of relying on sensitive information. In others, he was asked to describe matters more generally. He was asked to remove quotation marks nearly every time he recounts conversations between Trump and foreign leaders or himself and foreign leaders. Bolton wrote that he raised some of his concerns about Trump’s conversations with foreign leaders to Attorney General William Barr and flagged similar worries with White House attorneys and Secretary of State Mike Pompeo. “The pattern looked like obstruction of justice as a way of life, which we couldn’t accept,” he wrote. Trump continually pandered to Xi, Bolton wrote. At a White House Christmas dinner in 2018, Bolton said Trump asked why the U.S. was sanctioning China over its treatment of Uighurs. China suspects Uighurs, who are predominantly Muslim and culturally and ethnically distinct from the majority Han Chinese population, of harboring separatist tendencies. In recent years, China has dramatically escalated its campaign against them by detaining more than 1 million people in internment camps and prisons. “At the opening dinner of the Osaka G-20 meeting, with only interpreters present, Xi explained to Trump why he was basically building concentration camps in Xinjiang,” Bolton wrote. “According to our interpreter, Trump said that Xi should go ahead with building the camps, which he thought was exactly the right thing to do. “ In the book, Bolton describes every Trump decision as being guided by concerns for his own re-election, a claim that evokes the scandal that sparked Trump’s impeachment last year. The book alleges that Trump directly tied providing congressionally approved military aid to Ukraine to the country’s willingness to conduct investigations into Joe Biden and Biden’s son Hunter. In one conversation, Trump said “he wasn’t in favor of sending them anything until all the Russia-investigation materials related to Clinton and Biden had been turned over,” according to Bolton. Trump’s decision to withhold military assistance to Ukraine until it agreed to investigate Biden led the House to charge Trump with abuse of power. The aid was ultimately released once the holdup became public. The GOP-controlled Senate ultimately acquitted the president on that count and a count of obstructing Congress’s investigation of the incident. Bolton was called to testify before House lawmakers conducting the impeachment inquiry, but he declined, suggesting he wanted a federal court to decide whether he should heed a White House directive not to cooperate with the inquiry. Why a Bolton Testimony Could Be Bad News for the White House House Intelligence Chairman Adam Schiff, D-Calif., who managed the impeachment case against Trump, said Thursday that “we’ll never know” if Bolton’s testimony might have made a difference in the case. Schiff told “CBS This Morning” that Bolton’s decision to save his information for his book was “the price the country had to pay for John Bolton’s putting profit above country.” MarketWatch contributed to this report."}]}