{"article": [{"url": "https://www.marketwatch.com/story/home-prices-kept-on-rising-in-may-but-at-a-slower-rate-case-shiller-index-shows-2020-07-28", "published": 1595930360.0, "headline": "Home prices kept on rising in May, but at a slower rate, Case-Shiller index shows", "body": "The numbers: Home-price appreciation maintained a steady pace in May amid the coronavirus pandemic, according to a major price barometer released Tuesday. The S&P CoreLogic Case-Shiller 20-city price index posted a 3.7% year-over-year gain in May, down from 3.9% the previous month. On a monthly basis, the index increased 0.4% between April and May. What happened: The national index released as part of the report noted a 4.5% increase in national home prices over the past year. Phoenix continued to lead the country with a 9% annual price gain in May, followed once again by Seattle with a 6.8% increase. Tampa, Fla., came in third, with a 6% uptick. But a look at the individual cities in the 20-city index shows that home-price growth could be slowing. Overall, the pace of price growth only increased in three of the 19 cities Case-Shiller analyzed — the 20-city list again didn’t include Detroit this month because transaction records for Wayne County, Mich., were unavailable, the report noted. “More data will obviously be required in order to know whether May’s report represents a reversal of the previous path of accelerating prices or merely a slight deviation from an otherwise intact trend,” Craig Lazzara, managing director and global head of index investment strategy at S&P Dow Jones Indices, said in the report. “Even if prices continue to decelerate, that is quite different from an environment in which prices actually decline.” The big picture: Home prices have remained mostly insulated from the pressures of the coronavirus pandemic thus far. Falling mortgage rates have boosted the demand for homes among buyers, as the record-low interest rate environment has made purchasing property more affordable for many people. At the same time, though, the supply of homes for sale nationwide remains severely constrained. Many home sellers have stayed on the side lines and held off from listing their properties because of concerns related to the state of the economy. Even before the pandemic, the country’s housing inventory was falling well short of demand. For years, the formation of new households exceeded the pace of home-building, creating a shortage. That gap between the demand for homes and the country’s inventory has pushed prices higher. And that gap explains why most economists argue that home prices will continue to rise even if the job market takes another hit from the pandemic. “Even under a pessimistic outlook for the labor market, the housing market would benefit from a house-buying power boost as mortgage rates are likely to be pressured lower. In this case, house price appreciation remains strong, but doesn’t accelerate,” Mark Fleming, chief economist at title insurer First American, wrote in a report released Monday. There are some signs though that prices could end up falling. The house price index released last week by the Federal Housing Finance Agency indicated that home-prices nationally fell 0.3% on a monthly basis between April and May, despite a 4.9% annual gain. And economist Robert Shiller, who co-founded the Case-Shiller index, predicted that home prices may decline in cities across the country as the pandemic accelerates the shift toward suburban and rural areas. What they’re saying: “Home listings have been evaporating from the market which is putting strong upward pressure on prices that have already surpassed their pre-pandemic pace,” said George Ratiu, senior economist at Realtor.com. “Without a significant influx of supply — both new and existing — the market will run out of steam in the second half of the year.”"}]}