{"article": [{"url": "https://www.marketwatch.com/story/macys-kohls-suffer-as-brands-competitors-and-e-commerce-step-in-to-replace-department-stores-2020-07-22", "published": 1595578220.0, "headline": "Macyâ\u0080\u0099s, Kohlâ\u0080\u0099s suffer as brands, competitors and e-commerce step in to replace department stores", "body": "Macyâ\u0080\u0099s Inc. and Kohlâ\u0080\u0099s Corp. were downgraded Wednesday to sell from neutral at UBS, with analysts putting their confidence in brands that are able to capture sales on their own rather than relying on third-party sellers like department stores. UBS halved its price target on Macyâ\u0080\u0099s M, -0.95% Â to $3 from $6, and cut its Kohlâ\u0080\u0099s KSS, -1.64% Â price target to $14 from $17.50. The coronavirus pandemic is accelerating the consumer shift to e-commerce, and UBS forecasts that many stores will shutter for good. â\u0080\u009cTo deliver steady long-term growth, we believe brands can no longer rely on malls or department stores to drive traffic,â\u0080\u009d analysts led by Jay Sole wrote. â\u0080\u009cBrands have to generate their own audiences and become destinations.â\u0080\u009d See:The back-to-school shopping season will be a â\u0080\u0098dudâ\u0080\u0099 one analyst says, but the NRF is forecasting a record breaker UBS has six brands that it rates buy for their ability to generate sales on their own: Nike Inc. NKE, +0.97% Â ; Levi Strauss & Co. LEVI, -2.24% Â ; Skechers Inc. SKX, -1.75% Â , which reports its second-quarter earnings on Thursday; American Eagle Outfitters Inc. AEO, -0.97% Â ; Calvin Klein parent PVH Corp. PVH, -2.18% Â ; and Michael Kors parent Capri Holdings Ltd. CPRI, +2.55% Â Analysts also initiated Canada Goose Holdings Inc. GOOS, +0.58% Â (price target $30) and Ugg parent Deckers Outdoor Inc. DECK, +2.42% Â (price target $250) at buy. UBS also initiated four brands neutral: Crocs Inc. CROX, +1.25% Â , Gildan Activewear Inc. GIL, +1.70% Â , Steve Madden Inc. SHOO, -2.09% Â and Lee jeans parent Kontoor Brands Inc. KTB, +1.89% Â . â\u0080\u009cWe define â\u0080\u0098premiumâ\u0080\u0099 to mean a companyâ\u0080\u0099s value proposition allows it to earn a high gross margin,â\u0080\u009d UBS said. â\u0080\u009cThis enables a company to have a profitable direct-to-consumer (DTC) business.â\u0080\u009d With increased control over their branding and inventory, these â\u0080\u009cpremiumâ\u0080\u009d brands can drive customer loyalty and â\u0080\u009cstrong returnsâ\u0080\u009d that will help them to maintain high margins, analysts said. â\u0080\u009cWe think the â\u0080\u0098Go It Aloneâ\u0080\u0099 moment has arrived,â\u0080\u009d UBS said. â\u0080\u009cThis means brands should plan for a future that does not rely on department stores or malls to help generate traffic or drive growth. The ideal business model will be one where a brand can profitably sell directly to consumers either online or in-store.â\u0080\u009d Also:Online food prices jump as food companies struggle to meet demand All of this is bad news for department stores that are unable to compete with other brands and retailers. â\u0080\u009cBrands are increasingly keeping the highest quality merchandise for their own channels,â\u0080\u009d UBS said. â\u0080\u009cOff-price [like TJX Cos. TJX, -0.18% Â ] has the best value for money. Online pure-plays like Amazon AMZN, +3.01% Â have the widest selection. The mass channel (e.g. Walmart WMT, +1.00% Â ) offers the lowest prices.â\u0080\u009d UBS forecasts that department stores will account for 13% of the North American market share for clothes, shoes and accessories by 2024. Department stores accounted for 47% of market share in 2003, it estimates. â\u0080\u009cThe COVID-19 crisis came during an already tough time for department stores,â\u0080\u009d wrote Bank of America analysts in a recent note. Weak mall traffic hurt sales, and the shift to e-commerce had already begun before the pandemic. With stores closed, department stores had to shift their priorities to liquidity rather than investing in their businesses to keep up with the competition and changing consumer trends. In March, Macyâ\u0080\u0099s drew down all of its $1.5 billion in credit. Macyâ\u0080\u0099s and Kohlâ\u0080\u0099s were expected to spend hundreds of millions of dollars on labor with all stores closed. Cowen analysts anticipated that the retailers had about five months of available cash. At the beginning of July, Macyâ\u0080\u0099s reported losses and revenue in line with expectations. Kohlâ\u0080\u0099s has reported to a first-quarter loss as well, and missed the FactSet revenue consensus. Read:Kohlâ\u0080\u0099s says it will eliminate eight womenâ\u0080\u0099s brands including Jennifer Lopez and PopSugar in favor of more active gear â\u0080\u009cWe expect the investment cycle to continue indefinitely, as department stores play catch-up on store investments and also chase new technologies to remain competitive,â\u0080\u009d wrote Bank of America analysts led by Lorraine Hutchinson. â\u0080\u009cHowever, the budgets available to do so have shrunk, as department stores have had to lever up amidst the COVID-19 crisis in order to shore up their balance sheets. Unfortunately, in our view, department stores that do not keep pace with technological advancements and consumersâ\u0080\u0099 demand for increased convenience are at a competitive disadvantage.â\u0080\u009d The path ahead will be tough as well, with consumer confidence shaky and unemployment rates high. Surges in coronavirus cases in a number of states are also putting the brakes on a recovery. â\u0080\u009cThe challenges of debt will result in a slew of bankruptcies, namely mall-based apparel retailers and department stores,â\u0080\u009d wrote CFRA analyst Camilla Yanushevsky in a report from earlier this month. â\u0080\u009cFailing retailers are generally highly leveraged and grappling with deteriorating cash flows and weak profitability. Burdened by high debt-servicing costs, many have little wiggle room to invest in new technologies or evolve their business model.â\u0080\u009d Among the retailers that CFRA says are â\u0080\u009camong the most highly leveraged retailers and face elevated bankruptcy risksâ\u0080\u009d are Macyâ\u0080\u0099s, Kohlâ\u0080\u0099s, Dillardâ\u0080\u0099s Inc. DDS, +0.47% Â , Nordstrom Inc. JWN, -2.18% Â and Victoriaâ\u0080\u0099s Secret parent, L Brands Inc. LB, -0.98% Â . Macyâ\u0080\u0099s stock has slumped 60.8% for the year to date. Kohlâ\u0080\u0099s is down 56.7%. The ProShares Decline of the Retail Store ETF EMTY, +0.20% Â has fallen 9.4% for the period, and the S&P 500 index SPX, +0.87% Â has gained 0.2% so far in 2020."}]}