{"article": [{"url": "https://www.marketwatch.com/story/why-lumber-prices-defied-pandemic-related-pressure-to-score-a-nearly-60-quarterly-gain-2020-07-10", "published": 1594382540.0, "headline": "Why lumber prices defied pandemic-related pressure to score a nearly 60% quarterly gain", "body": "Lumber prices made a big comeback in the second quarter, with a nearly 60% jump for the period more than making up for a loss in the first three months of the year, as home builders rebounded from the initial effects of the pandemic. Lumber prices and their rapid rise, particularly in the three weeks ended on July 2, have exposed an industry that was or is “underinventoried to meet current demand,” says Greg Kuta, president of lumber broker Westline Capital Strategies. Most-active lumber futures US:LBU20 gained 56.5% in the second quarter, following a loss of more than 31% in the first quarter. In the three-week period ended on July 2, prices climbed by roughly 28%. They settled at $481.90 per 1,000 board feet on Thursday. When COVID-19 entered the picture, the “ensuing economic calamity” shut down all sectors, including residential construction, and the “uncertainty significantly disrupted the perception of future demand and the consumption of lumber,” Kuta says. The “production side witnessed a complete collapse of takeaway and, in turn, was forced to make the hard decision of curtailing production in an attempt to match the immediate collapse in demand.” Against that backdrop, Canadian lumber shipments to the U.S. for the second quarter, year on year, were down by just under 19%, leading to lumber’s “explosive rally off of the April lows,” says Kuta. He points out that the idea of “stopping and then restarting production, similar to flipping a light switch on/off, doesn’t work in the real world of sawmill production.” It takes weeks to bring curtailed output back online as the industry moves to rehire laid-off workers, retool equipment, and rebuild the transportation chain to ship the wood out of the mills, he says. Meanwhile, “the backlog of existing business (on the books pre-COVID-19) proved to be very large,” and the expected void in housing and lumber demand has been “less severe in both quantity and duration throughout the ongoing pandemic,” says Kuta, adding that housing demand has been a leading indicator back to the upside. U.S. construction of new houses climbed by 4.3% in May to an annual rate of 974,000, up from a five-year low of 934,000 in April, according to government data. New-home sales, meanwhile, rose nearly 17% to a seasonally adjusted annual rate of 676,000 in May. “ ‘The housing metrics coming out of the first wave of the virus show an insatiable need for housing...’ ” — Greg Kuta, Westline Capital Strategies “The housing metrics coming out of the first wave of the virus show an insatiable need for housing and have exposed the major issues that existed pre-COVID that still exist today—a shortage of existing-home inventory, a finite housing labor pool to actually build new homes, and a shortage of entry-level homes to satisfy the entry-level home buyer,” says Kuta. Historically low mortgage rates also help to boost housing demand, he says. Based upon the annual review earlier this spring by the U.S. Commerce Department, spruce-, pine- and fir-producing sawmills in Canada will see their duty rate reduced by about 50% starting on Oct. 1, says Kuta. That will cut their production costs by about $30 to $35 per 1,000 board feet and help profitability—and bring both eastern and western Canadian sawmill production back online for the rest of 2020 and into the first quarter of next year, he says. Despite that, the trend for lumber prices is still up, until demand begins to “show signs of slowing and production catches up with existing demand,” says Kuta, who sees prices in the range of $300 to $500 for the rest of 2020. There’s potential to move higher, but “the ability to maintain these numbers and not see a bigger correction into the back half of the year is questionable, at best, especially heading into the November election.”"}]}