{"article": [{"url": "https://www.marketwatch.com/story/oracle-stock-rallies-as-results-top-wall-street-estimates-11599768559", "published": 1599760940.0, "headline": "Oracle stock rallies as results, outlook top Wall Street estimates", "body": "Getty Images Oracle Corp. shares rallied in the extended session Thursday after the database software company’s results and outlook topped Wall Street estimates. On a conference call, Oracle ORCL, +0.42% Chief Executive Safra Catz forecast fiscal second-quarter adjusted earnings of 98 cents to $1.02 a share on flat to 2% growth in revenue, or $9.62 billion to $9.81 billion. Analysts surveyed by FactSet had forecast earnings of 94 cents a share on revenue of $9.58 billion. For the fiscal first quarter, Oracle reported net income of $2.25 billion, or 72 cents a share, compared with $2.14 billion, or 63 cents a share, in the year-ago period. Adjusted earnings, which exclude stock-based compensation expenses and other items, were 93 cents a share, compared with 81 cents a share in the year-ago period. Revenue rose to $9.37 billion from $9.22 billion in the year-ago quarter. Analysts expected earnings of 86 cents a share on revenue of $9.17 billion, while Oracle had forecast 84 cents to 88 cents a share on revenue between $9.13 billion and $9.31 billion. “Our infrastructure businesses are also growing rapidly as revenue from Zoom ZM, +2.89% more than doubled from Q4 last year to Q1 in this year,” Catz said in a statement. “I have a high level of confidence that our revenue will accelerate as we move on past COVID-19.” From the get-go, Oracle was mum about reports it was looking to acquire video-sharing platform TikTok, which is being targeted by President Donald Trump as a security threat because it’s owned by a Chinese company, ByteDance. Oracle co-founder and Chairman Larry Ellison hosted a Trump fundraiser earlier this year, and Trump has voiced support for Oracle taking over TikTok. “I want to make sure you understand that we will be making no comments regarding the press reports about TikTok, so there’s no need to ask,” Catz said at the beginning of the call. Shares, which had surged as much as 6%, were last up around 3.5% after hours, following a 0.3% decline in the regular session to close at $56.80."}]}