{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-death-toll-edges-toward-900000-as-astrazeneca-halts-vaccine-trial-after-patient-struck-by-illness-2020-09-09", "published": 1599663980.0, "headline": "Coronavirus update: Global death toll edges toward 900,000 as AstraZeneca halts vaccine trial after patient struck by illness", "body": "The number of confirmed deaths from the coronavirus that causes COVID-19 worldwide edged closer to 900,000 on Wednesday, and the U.S. death toll moved close to 190,000, as AstraZeneca halted trials of its vaccine candidate after one participant was struck by an unexplained illness. The news sent AstraZeneca shares AZN, +1.16% AZN, +0.63% lower, while the stocks of other drug makers developing vaccines, including Pfizer Inc., BioNTech SE and Moderna Inc. MRNA, +0.09% rallied. In an emailed statement, AstraZeneca said: “As part of the ongoing randomized, controlled global trials of the Oxford coronavirus vaccine, our standard review process was triggered and we voluntarily paused vaccination to allow review of safety data by an independent committee.” It added that it is working to expedite the review of the single event to minimize any potential impact on the trial timeline. “We are committed to the safety of our participants and the highest standards of conduct in our trials.” See:Vaccinating children against the flu is ‘more important than ever’ this year: pediatricians A report in the New York Times said that the volunteer in the U.K. trial received a diagnosis of transverse myelitis, an inflammatory syndrome that affects the spinal cord. “However, the timing of this diagnosis, and whether it was directly linked to AstraZeneca’s vaccine, is still unknown,” the NY Times said. The British drugmaker declined to the comment. The Financial Times later reported that the trial may resume as early as next week, citing people familiar with the matter. For more, read:AstraZeneca stock falls as drugmaker pauses vaccine trial after volunteer’s ‘unexplained illness’ The news comes a day after AstraZeneca and eight other drug makers working on vaccines made a joint pledge to “stand with science” on coronavirus vaccines, making clear that they would not move forward with such products before demonstrating their safety and efficacy. The unusual pledge comes amid concerns the Trump administration may try to rush out a vaccine before the November presidential election. Don’t miss: There are seven coronavirus vaccine candidates being tested in the U.S. — here’s where they stand The World Health Organization reiterated Wednesday that safety has to come first with vaccine development. Dr. Soumya Swaminathan, chief scientist at the WHO, said at a news briefing that regardless of the speed with which drug makers are working, “it doesn’t mean that we start compromising or cutting corners on what would normally be assessed.” Dr. Anthony Fauci, head of the National Institute for Allergies and Infectious Diseases and a member of the White House Task Force created to manage the pandemic, agreed. In an interview with CBS, Fauci said it’s routine for a late-stage trial of a vaccine to be put on hold because of side effects, describing it as a safety valve, as the AP reported. Fauci said a safe and effective coronavirus vaccine may be ready in early 2021. “The more likely scenario is that we will know by the end of this calendar year and hopefully we’ll be able to start vaccinations in earnest as we begin early 2021,” he said. In other news: • French Prime Minister Jean Castex tested negative for the coronavirus in an initial test. Castex was tested after he spent part of the weekend with the head of the Tour de France cycling race, Christian Prudhomme, who tested positive, according to Reuters. France’s cabinet is holding its weekly meeting remotely for the first time since the end of the virus lockdown, AFP reported, and Castex is self-isolating at his official Paris Matignon residence for seven days. • The British government is banning gatherings of more than six people in England, as officials try to keep a lid on daily new coronavirus infections after a sharp spike across the U.K. that has been largely blamed on party-going young adults disregarding social distancing rules, the AP reported. The law in England will change from next week to reduce the number of people who can gather socially from 30 to six, with some exemptions. The number of confirmed cases of the virus rose to almost 3,000 on Sunday, before dipping to 2,460 on Tuesday. Failure to comply could result in a 100-pound ($130) fine. The U.K. has the fifth highest death toll from COVID-19 in the world at 41,675, according to data aggregated by Johns Hopkins University. On a per capita basis, it has the fourth highest mortality rate in the world with 61 deaths per 100,000 people, after Peru, Belgium and Spain, according to AFP data. • Greece’s largest migrant camp on the island of Lesbos was destroyed in a fire that has left more than 13,000 asylum seekers homeless, the BBC reported. The Greek government has declared a four-day state of emergency. It’s unclear how the blaze began with some locals blaming migrants and others blaming locals. The UNHCR, the UN refugee agency, said it was aware of “tensions” between nearby townsfolk and the migrants. “We urge all to exercise restraint,” it said, and asked anyone who had been at the camp “to restrict their movements and stay near [the site], as a temporary solution is being found to shelter them.” • Former Italian Prime Minister Silvio Berlusconi, who is in hospital in Milan after testing positive for COVID-19 last week, said doctors treating him have told him he was “No. 1” for the severity of his viral load, the Guardian reported. Berlusconi, 83, said that of the thousands of coronavirus tests carried out at San Raffaele hospital, doctors told him that he had the worst viral load. “[The virus] is very bad,” he said. “I’m giving it my all, I hope to make it and to get back on track,” he said in a phone call to a candidate from his Forza Italia party, the paper reported. Read now: How Black doctors are answering the call to reform medical education — and bringing COVID-19 vaccine trials to communities of colorLatest tallies There are now 27.6 million confirmed cases of COVID-19 worldwide, the Johns Hopkins data showed, and 898,426 people have died. At least 18.6 million people have recovered. The U.S. has 6.3 million cases and 189,718 deaths. The U.S. added 28,550 new cases on Tuesday and 462 deaths, according to a New York Times tracker. That was down from an average of 36,704 over the past week, which was down 13% from the average two weeks earlier, the paper said. There are concerns those numbers could start to tick up if infections were spread by people gathering in large numbers over the Labor Day weekend, according to the Washington Post. Brazil has the second-highest death toll at 127,464 and 4.16 million cases. India is third with 73,890 deaths and 4.37 million cases. Mexico has fourth-highest death toll at 68,484 and 652,860 cases. China, where the illness was first reported last year, has 90,087 cases and 4,733 deaths, according to its official numbers. Is there other medical news? Pfizer Inc. PFE, -0.27% and BioNTech SE BNTX, +1.23% plan to pursue regulatory review for their COVID-19 vaccine candidate BNT162b2 in October, depending on the success of the vaccine in late-stage clinical trials, MarketWatch’s Jaimy Lee reported. However, the companies did not say what countries they plan to seek review in. “When the [Phase 3] study reads out will depend on multiple variables but right now, our model, our best case, predicts that we will have an answer by the end of October,” Pfizer CEO Albert Bourla said Tuesday on the Today show, later noting that he means a clinical answer, not a regulatory one. See also:To defeat COVID-19, ‘we need a unified national strategy,’ says public health expert Dr. Howard Koh The companies also announced findings from the preclinical study of BNT162b2, which were published as a preprint, showing that when the vaccine was tested in macaques it prevented infection with the virus. The companies also concluded exploratory talks with the European Commission (EU) for a proposed deal to supply 200 million doses of their vaccine candidate to the EU. The deal would include an option for an additional 100 million doses. T The deliveries would start by the end of 2020, subject to regulatory authorization. Financial terms under discussion were not disclosed. “We have activated our supply chain, most importantly our site in Belgium, and are starting to manufacture so that our vaccine would be available as soon as possible, if our clinical trials prove successful and regulatory approval is granted,” said Pfizer Chief Executive Albert Bourla.What are companies saying? • Alaska Air Group Inc. ALK, +0.15% expects third-quarter capacity to be down about 55% from the year-earlier period as the pandemic continues to weigh. The airline expects September revenue to be down 70% to 75%, after a 72% decline in August. It expects its passenger load factor to come to 40% to 45%, after 46% in August. It expects available seat miles to be down about 50% after being down 51% in September. The company’s cash burn is expected to total about $150 million in September, after $80 million in August. The carrier had about $3.6 billion in cash as of Sept. 8. • G-III Apparel Group Ltd. GIII, +0.78% swung to a loss in the second quarter from a profit a year ago and posted sales that fell short of expectations, as the pandemic weighed. Second-quarter losses include a 53-cents-per-share loss due to the liquidation of 110 Wilsons Leather and 89 G.H. Bass stores. Other G-III brands include Donna Karan and Andrew Marc, and licenses for brands like Guess, Cole Haan and Calvin Klein. “We have reset our order book for the balance of the year and shifted our product assortment to athleisure, jeans, casual sportswear and coats,” said G-III Chief Executive Morris Goldfarb in a statement. For the second half of the fiscal year, G-III forecasts a sales decline in the range of 28% to 33%. The company did not provide additional guidance due to uncertainty from the pandemic. • Hawaiian Airlines parent Hawaiian Holdings Inc. HA, +0.36% provided an update on recent developments, including a modified reinstatement of a 14-day quarantine requirement imposed on passengers traveling from the Island of Oahu to the counties of Maui, Kauai and Hawaii, given an increase in COVID-19 case counts on Oahu. The requirement is effective Aug. 11. Separately, the air carrier expects capacity for the third quarter to be down 87% from the same period a year ago, which is slightly lower than previous forecasts, as a result of reduced travel demand resulting from government actions. Regarding demand, the company said flow passengers for the third quarter through Aug. 31 were down 87% and revenue passenger miles were 96% below last year’s levels. Hawaiian said it received confirmation that its allocation of the Coronavirus Aid, Relief and Economic Security (CARES) Act funds increased to $420 million from $364 million. The company has until Sept. 30 to determine whether it will draw any portion of those funds. • HD Supply Holdings Inc. HDS, -0.09% reported fiscal second-quarter profit that beat expectations while sales fell in line with forecasts. The industrial distributor company’s facilities maintenance sales fell 8.3% to $761 million, but topped the FactSet consensus of $752.2 million, while construction and industrial sales slipped 0.3% to $793 million to miss expectations of $802.3 million. The company said it was not providing a financial outlook for the third quarter or the full year, given uncertainties over the effects of the COVID-19 pandemic, but said August sales were $518 million, representing an average daily decline of 0.7%. • LVMH Moet Hennessy MC, +1.15% will not be able to complete the previously announced takeover of U.S. luxury goods retailer Tiffany TIF, +0.37% “as it stands.” LVMH cited both a letter from the French government asking for a delay in light of the threat of tariffs on French products by the U.S., as well as Tiffany’s request to extend the deadline from Nov. 24 to Dec. 31. Tiffany for its part filed a lawsuit in Delaware to enforce the acquisition. “The lawsuit not only makes clear that LVMH is in breach of its obligations relating to obtaining antitrust clearance, but also refutes LVMH’s suggestions that it can avoid completing the acquisition by claiming Tiffany has undergone a Material Adverse Effect (”MAE”) or breached its obligations under the Merger Agreement, or that the transaction is in some way inconsistent with its patriotic duties as a French corporation,” said the Tiffany release. • MasterCraft Boat Holdings Inc. MCFT, +3.78%, the recreational powerboat maker, reported a narrower-than-expected fiscal fourth-quarter loss and provided an upbeat sales outlook. Sales for the quarter, which is historically the lowest of the year, dropped 58% to $51.1 million, due primarily to lost production as a result of COVID-19-related shutdowns, but was above the FactSet consensus of $36.8 million. Dealer inventories at the end of the fiscal year were 40% to 50% lower than a year ago. For the first quarter, the company expects sales to be down in the low-to-mid teens percentage range, while the current FactSet consensus of $86.2 million implies a 21.5% decline. • Rocket Companies Inc.’s RKT, +1.01% Quicken Loans subsidiaries are planning to offer $1.25 billion in senior notes due 2029 and 2031. The mortgage and financial services company, which went public last month, said it expects to use the proceeds from the debt offerings to pay down all of the $1.25 billion of 5.75% senior notes due 2025. Rocket joins the many companies issuing record levels of debt during the pandemic. • United Airlines Holdings Inc. UAL, +0.32% lowered its outlook for third-quarter capacity and passenger revenue, and but said it has witnessed “a moderate improvement” in travel demand over the past couple of weeks. United now expects third-quarter capacity to be down 70% from a year ago, compared with previous guidance for a 65% decline. Passenger revenue is now expected to be down 85%, versus previous guidance for an 83% decline. “The company does not currently expect the recovery from COVID-19 to follow a linear path. As such, the company’s actual flown capacity may differ materially from its currently scheduled capacity,” United said. The company affirmed its Q3 average daily cash burn rate of $25 million, and said it still expects total available liquidity to be over $18 billion at the end of the quarter. • United Parcel Service Inc. UPS, +0.27% expects to hire more than 100,000 employees for the holiday season, which is the same as last year despite expectations of record seasonal volume. . The seasonal hires will support expected increase in package volume that is expected to begin in October and continue through January. “We’re preparing for a record peak holiday season. The COVID-19 pandemic has made our services more important than ever,” said Chief Human Resources Officer Charlene Thomas. The package delivery giant said that over the past three years, about 35% of seasonal hires were later hired for permanent positions. About one-third of UPS’s current 123,000 employees started in seasonal positions."}]}