{"article": [{"url": "https://www.marketwatch.com/story/lululemon-athletica-is-the-top-publicly-traded-specialty-retailer-says-susquehanna-2020-06-12", "published": 1592306480.0, "headline": "Lululemon Athletica is the top publicly traded  specialty retailer, says Susquehanna", "body": "The most recent quarter was a difficult one for Lululemon Athletica Inc., just as it was for most retailers during the coronavirus pandemic, but analysts list a number of ways that Lululemon excelled, with Susquehanna Financial Group giving the company top marks. “Lululemon has managed through the crisis better than every company in our coverage universe (with Nike perhaps the lone exception),” wrote analysts led by Sam Poser. “Lululemon has cemented its position as the best publicly-traded company in the specialty retailer sector, in our view.” Lululemon LULU, +2.52% reported a 17% revenue decline in the first-quarter to $652 million, missing the FactSet consensus for $692 million. Earnings per share of 22 cents were ahead of FactSet expectations for 20 cents. Read:The North Face parent VF Corp. sees sales uptick as people head outdoors, or to their backyards, during the coronavirus pandemic Despite the sales miss, analysts highlight scores of reasons to be optimistic about the long-term future of the company. “Lululemon continues to develop guest relations and drive sales with its digital platforms through the evolving productivity of its CRM [customer relationship management] capabilities in the face of store closures,” wrote Susquehanna. “Lululemon remains one of few companies out there that will emerge from the COVID-19 crisis stronger than it was when the crisis began.” Susquehanna rates Lululemon stock positive with a $360 price target, up from $240. Raymond James analysts note that Lululemon continued to pay its workers and didn’t take a big earnings hit in the process. “[W]e point to the fact that Lululemon was able to pay its associates despite stores being closed for much of the quarter while still delivering a healthy profit, an impressive feat for any retailer,” analysts wrote. Raymond James rates Lululemon stock strong buy with a $335 price target. Also:Kim Kardashian and Kylie Jenner gain momentum, which is good for Coty, Bank of America says In addition to paying its workers, Lululemon’s Chief Executive Calvin McDonald points out that the company also continued to pay its rent and its vendors for merchandise. “We believe that by supporting our collective and helping them navigate the day-to-day realities of this period, we will build even stronger relationships and increase the already strong loyalty and trust in Lululemon,” McDonald said, according to a FactSet transcript. “These decisions are right for our people and right for our brand.” Analysts at MKM Partners see these actions as insurance for the future. “Unlike select peers who cut back orders suddenly and sharply, Lululemon honored its commitments with vendors, which we believe will strengthen its relationships/vendor loyalty (this could be a risk factor for others, and particularly if vendors go out of business),” analysts said. MKM rates Lululemon stock buy with a $378 12-month target and recommends investors “buy on any weakness.” Lululemon stock is up 31.7% for the year to date. The S&P SPDR Retail ETF XRT, +0.05% is down 7.7% for 2020 so far. And the S&P 500 index SPX, +0.87% has tumbled nearly 4% for the period. Don’t miss:RH is planning to open hotels and sell houses, but analysts ask whether it can pull it off Wedbush analysts note that “no additional markdown was taken” during the quarter. And Bank of America says that inventory grew 41% year-over-year, but there’s little danger of that merchandise being sold at fire-sale prices. “Unlike nearly every other retailer, Lululemon did not take a writedown but instead acted quickly to align future orders with new demand levels,” analysts led by Rafe Jadrosich wrote. “Product teams were also able to restage deliveries and will now stagger new releases during the remainder of the year.” Moreover, much of its merchandise isn’t specific to any season, a point that Lululemon’s McDonald focused on. “We benefit from an inventory with relatively high percentage core product; about 40% overall, that has a shelf life beyond the current season and with limited markdown risk,” he said. Wedbush rates Lululemon stock neutral with a $300 price target. Bank of America rates Lululemon shares buy with a $340 price objective."}]}