{"article": [{"url": "https://www.marketwatch.com/story/housing-starts-soar-226-in-july-as-americans-head-for-the-suburbs-in-search-of-larger-abodes-2020-08-18", "published": 1597745240.0, "headline": "Housing starts soar 22.6% in July as Americans re-enter the housing market in droves", "body": "The numbers: Home-building activity has staged a significant turnaround from the coronavirus-related slowdown. U.S. home builders began construction on homes at a seasonally-adjusted annual rate of 1.496 million in July, up 22.6% from the previous month and 23.4% from a year ago, the U.S. Census Bureau reported Tuesday. The pace of home building is now 7% down from the pre-coronavirus high. Permitting activity occurred at a seasonally-adjusted annual rate of 1.495 million, up 18.8% from June and 9.4% from July 2019. Economists polled by MarketWatch had expected housing starts to occur at a pace of 1.252 million and building permits to come in at a pace of 1.33 million. What happened: Increases in both single-family and multifamily starts contributed to the overall increase. Construction on buildings with five or more units increased 56.7% on a monthly basis, while single-family starts rose 8.2%. Likewise, the increase in building permits occurred across all types of housing: one-unit homes (up 17%), homes with between two and four units (up 12.5%) and buildings with five or more units (up 23.5%). “The gap between permitted homes and started homes continues to grow,” said Danielle Hale, chief economist at Realtor.com. “This growing gap signals extra capacity on the permit side, but may mean that despite record confidence, builders have trouble completing jobs.” July single-family home completions were down 1.8% from June and 0.4% from a year ago. All regions experienced an overall uptick in housing starts despite rising coronavirus cases across many parts of the country, led by the 35.3% increase in the Northeast. However, single-family starts actually fell slightly between June and July in both the Northeast and the Midwest. Permitting rose relatively uniformly across the country, with all four major regions seeing upticks. Big picture: Americans’ demand for homes was at a fever pitch before the pandemic, and it’s now returned in earnest. Low mortgage rates have made buying a home a more affordable proposition for millions of Americans, while the reality of living, working and attending school at home has prompted many households to search for bigger properties, particularly in the suburbs. However, there is a shortage of existing homes for sale to meet this excess demand. And that’s creating more interest in newly-built homes, which is a boon to the home-building sector. But the rise in homes sales amid the pandemic is not a uniquely American phenomenon — and that’s actually a problem for U.S. buyers and builders. Home sales hit a record high in July in Canada, leaving America’s northern neighbor with severe inventory constraints. As a result, housing starts in Canada have climbed to a two-and-a-half year high in July, according to an analysis from BMO Capital Markets. Much of the lumber used to build homes in imported from Canada — and now with the surge in Canadian home-building activity, American builders are facing more competition for the product. All this demand came as a surprise to lumber producers, and lumber prices have skyrocketed as a result. At the very least, that’s threatening the margins for U.S. home builders. Down the road though it could mean higher prices for American home buyers. What they’re saying: “Would-be home buyers are heeding the calls of the suburban and the rural and, at the very least, of bigger abodes,” Michael Gregory, deputy chief economist at BMO Capital Markets, wrote in a research note. “Meanwhile, single-family existing homes available for sale hit a new record low in June (seasonally adjusted), causing more purchasers to opt for the new home segment… or at least check it out.” “While risks remain to the homebuilding outlook, as these figures capture decisions made months ago, possibly prior to the acceleration in virus cases, with homebuilder confidence reaching a record high in August, the housing sector should remain one of the most resilient areas of the economy,” Katherine Judge, an economist at CIBC Capital Market, wrote in a research note."}]}