{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-rise-as-twin-storms-shut-in-more-than-half-of-gulf-of-mexico-production-2020-08-24", "published": 1598266220.0, "headline": "Oil prices edge up as twin storms shut in more than half of Gulf of Mexico production", "body": "Oil futures rose Monday as a pair of tropical storms, which are expected to make landfall within days of each other, closed in on the Gulf of Mexico, forcing the shutdown of offshore drilling rigs responsible for more than half of the region’s crude production and nearly half of its natural-gas output. The price move for oil is “marginal,” given the large amount of output that is shut, said Bjornar Tonhaugen, head of oil markets at Rystad Energy. “Today is more of an opportunity to see that even such a sudden event is weak to really put aside the concerns that Covid-19 has brought upon market participants.” “Yes, a dip in oil production provides a breath to traders, who have been seeing global output rising over the last weeks, amid a demand recovery lag, but what will really make a difference is news from the recovery front,” he explained in a daily note. West Texas Intermediate crude for October delivery CL.1, -1.62% US:CLV20, the U.S. benchmark, rose 23 cents, or 0.5%, to $42.57 a barrel on the New York Mercantile Exchange. October Brent crude UK:BRNV20, the global benchmark, was up 43 cents, or 1%, at $44.78 a barrel on ICE Futures Europe. Based on information submitted by operators, the Bureau of Safety and Environmental Enforcement on Sunday estimated that 57.6% of current Gulf oil production has been shut in, along with 44.6% of natural-gas output. That equates to around 1.1 million barrels a day of oil output. “While there is a focus on oil production at the moment, we will need to keep an eye on refining activity, which is vulnerable to flooding,” said Warren Patterson, head of commodities strategy at ING, in a note, adding that Hurricane Harvey in 2017 saw refinery run rates in the country fall from more than 96% to less than 77%, which led to a strong rally in refined product margins. A storm named Marco temporarily grew into a hurricane Sunday as it moved toward Louisiana. It was subsequently downgraded to a tropical storm Sunday night. Another potential hurricane, Tropical Storm Laura, hit the Dominican Republic and Haiti, and was on track for the same region of the U.S. coast. See:Residents flee Gulf Coast ahead of two potential hurricanes Analysts said oil might also be finding support as global equities rallied, lifted by optimism over a decision by the U.S. Food and Drug Administration to grant approval for emergency use of convalescent plasma, the antibody-rich component of blood taken from recovered COVID-19 patients. Medical experts said the treatment may provide benefits to those battling the disease, but that there isn’t conclusive evidence of its effectiveness, while questions remain about when it should be administered and dosage. Some market watchers, meanwhile, said crude’s gains were restrained by continued concerns over prospects for crude demand as the pandemic continues. “Both the benchmarks, in fact, retreated by 1% on Friday exactly over concerns on a growing glut [amid] slow demand, meaning Monday’s gains are insignificant in the grander scheme of things,” said Mihir Kapadia, chief executive of Sun Global Investments. “We can only see solid gains once news of a vaccine emerges, as it will impact the larger economic structure for good.” September natural gas US:NGU20 was up 2.1% at $2.50 per million British thermal units. September gasoline US:RBU20 jumped 4.3% to $1.3393 a gallon, while September heating oil US:HOU20 rallied 3.3% to $1.2473 a gallon. Traders are buying petroleum products ahead of the storm “in case some refineries get flooded or the power goes out,” Phil Flynn, senior market analyst at The Price Futures Group, told MarketWatch. For oil, there is still demand concerns surrounding COVID-19 that “will be made worse when these storm hit land,” he said. However, if Laura gains strength to become a major hurricane, “it would have the potential to keep production offline longer.”"}]}