{"article": [{"url": "https://www.marketwatch.com/story/tech-companies-are-offering-parents-additional-benefits-as-covid-19-threatens-schools-return-11596505660", "published": 1596528500.0, "headline": "Tech companies are offering parents additional benefits as COVID-19 threatens schools' return", "body": "As many schools begin the school year with distance learning because of the pandemic, tech companies are making accommodations for their employees with children. MarketWatch photo illustration/iStockphoto File this under how the COVID-19 pandemic has changed everything: The famous perks offered by tech companies no longer revolve around keeping people on campus as long as possible. Instead of ping-pong tables or free-flowing alcohol, tech companies are now offering help with parenting, which could be particularly useful as many children begin the school year from home as coronavirus cases continue to rise. Some of the biggest tech companies are offering additional paid time off, are paying for backup child care, or both. Alphabet Inc.'s GOOGL, +1.82% GOOG, +1.97% Google, Facebook Inc. FB, +0.26%, Microsoft Corp. MSFT, +2.48% and Salesforce.com Inc. CRM, +2.21% are providing weeks of extra paid leave for employees who need to care for their kids (or parents). Google also announced last week that its employees can work from home through next June, and Salesforce says its employees can work from home as long as their children are home from school. On Facebook's earnings call last week, CEO Mark Zuckerberg said \"There's currently no end in sight for when our teams here will be able to return to our offices\" - although in context, he said this as part of expressing his frustration with the government's handling of the pandemic. Some companies, such as Amazon.com Inc. AMZN, +3.01%, Netflix Inc. NFLX, +1.43% and Nvidia Corp. NVDA, -0.54%, are also paying for employee memberships to services like Care.com, where parents can find backup child care. Massachusetts-based Care.com says it has added more than 800,000 employees as users of its service, which includes in-home backup child care, across the United States since mid-March. Tutor.com, which provides tutoring for students in K-12 and even college, has seen an \"explosion\" in interest from companies that may want to offer the company's services as a perk. Whereas it used to field five to 10 inquiries a year, since April it has received 84 inquiries via a form on its website, said Sandi White, vice president and general manager of the New York-based company. \"Everyone's saying 'oh no, how are we going to help our employees juggle both remote work and remote learning?'\" White said. Apple Inc. AAPL, +1.74% employees, like those at other tech companies, say they have been told to talk to their managers about their scheduling needs. And those who work at Netflix and other Silicon Valley companies that offer unlimited paid time off may have to take advantage of that fringe benefit. Not that they all feel comfortable doing so. \"Our management has been pushing us to use some PTO to stem the feeling of burnout recently,\" said a program manager at one such company, one of several tech workers MarketWatch spoke with who asked to remain anonymous. But he added, \"I always have a feeling of anxiety when on PTO because of what awaits me at work.\" Still, he intends to take some of the time he's entitled to as he expects to need to help his son and daughter navigate distance learning. Some parents of younger children, especially, are feeling creeping anxiety based on their experiences from when schools had to go into emergency distance-learning mode in the spring. One woman who works at a sizable Silicon Valley startup said that at the end of last school year, she and her husband blocked time off on their work calendars to help their two sons who were home from school. \"Then we logged on to work once the kids went to sleep, from 10 p.m. to 2 a.m. some nights,\" she said. Another woman who works at a much bigger company in the valley said she would sometimes log on until 3 a.m. While she expressed gratitude that her job allows her to work from home, she said when she responds to her company surveys, she's honest about how stressful it can be to take care of school-age kids while working full time. Extra PTO might come in handy for people like them, whose kids are too young to go online, pay attention and do their work without guidance and supervision. Google, which already offered six weeks of what it calls carer's leave, added eight weeks on top of that because of the COVID-19 crisis, a spokeswoman said. Facebook's pandemic leave for caregivers totals 50 days through the end of the year; Microsoft is offering 12 weeks; and Salesforce has temporarily added six weeks of leave, according to spokespeople for the companies. In California, employees are entitled to up to eight weeks of partially paid family leave, while the federal Family Medical Leave Act allows for varying lengths of unpaid leave. The paid pandemic-related leave from tech companies could allow their employees to stay on the job while taking paid time off as they need it. For example, Microsoft said its employees can take the offered leave in any increments they want, while Salesforce said its employees could take off one week at a time. Whatever the perks tech employees have or don't have, many of them are counting on understanding managers who will let them skip meetings or maybe log off at certain times during the day as they deal with their children at home. A startup tech worker said he feels lucky to have survived a couple of rounds of layoffs, but it doesn't change the fact that he needs support as he does his job and deals with four kids, including two who are school-age and one still in diapers. His wife, a nurse who works graveyard shifts, is also home during the day, but they both have their hands full. When it gets too hectic, he said they used to be able to call their moms for help with the kids. But because of COVID-19, they worry about possibly exposing their elderly parents and have tried to avoid doing that lately. \"I try to work it out, I try to multitask,\" he said. He has a lot of Zoom meetings but feels his company has been flexible so far when it comes to timing. Roy America, a recruiter for Genentech, said he is emphasizing exactly that to potential employees of the biotech giant: \"We are willing to be a lot more flexible for parents who have kids.\" See: From nanny services to 'private educators,' wealthy parents are paying up to $100 an hour for 'teaching pods' during the pandemic And if all fails, some tech employees - like the one who has stayed up till 2 a.m. finishing her work - are exploring pandemic pods, in which a small group of families hire an in-person teacher to help their children."}]}