{"article": [{"url": "https://www.marketwatch.com/story/biden-leads-trump-50-to-41-new-poll-finds-2020-08-16", "published": 1597597700.0, "headline": "Biden leads Trump, 50% to 41%, new poll finds", "body": "President Donald Trump and former Vice President Joe Biden start their nominating conventions this month with Trump struggling to reach a level of job approval that would make re-election more likely and his challenger drawing soft support that could present turnout challenges, the latest Wall Street Journal/NBC News poll shows. Less than three months before November’s election, 50% of registered voters nationally say they would vote for Biden if the election were held now, while 41% back Trump. That is essentially unchanged from Biden’s 11-point lead a month ago and is similar to his advantage much of this year. Biden, however, is failing to generate widespread enthusiasm, the poll finds. For the past year he has been viewed more negatively than positively among the broader electorate — as has been the president — although Biden’s positive rating increased 5 percentage points between July and August to reach 39%. “This poll is a warning for Democrats and the Biden team that there is still a lot of work to be done,” said Peter Hart, a Democratic pollster who worked on the survey with Bill McInturff, a Republican, and Jeff Horwitt, a Democrat. In another sign of potential softness in the Democrats’ support, 58% of those who back Biden say their vote is more in opposition to Trump than in favor of their chosen candidate. By contrast, those planning to cast a ballot for Trump are more enthusiastic about their choice, with almost three-quarters saying their vote is more for him than against Biden. An expanded version of this report appears on WSJ.com. Also popular on WSJ.com: Home Depot braced for COVID pain — then Americans remodeled. Coronavirus chased off tourists — lots of locals don’t want them ever flocking back."}]}