{"article": [{"url": "https://www.marketwatch.com/story/this-spot-on-predictor-of-who-will-win-the-2020-presidential-election-is-not-the-stock-market-or-even-opinion-polls-2020-07-07", "published": 1594476560.0, "headline": "This spot-on predictor of who will win the 2020 presidential election is not the stock market or even opinion polls", "body": "Does the stock market predict the winner of U.S. presidential elections? Many argue that it does, pointing to the historical correlation between the incumbent party retaining the White House and the stock market’s strength in the months leading up to Election Day in November. Given President Donald Trump’s preoccupation with the stock market, he apparently agrees. Recently he tweeted that if he’s not re-elected, investors’ 401(k)s will disintegrate and disappear — though one major Wall Street firm sees quite a different outcome for retirement savers if Trump’s presumptive challenger Joe Biden is elected. Read: How to position your portfolio for a Joe Biden presidency I’m not so sure about this alleged correlation between the stock market and the incumbent party’s chances of retaining the White House. Consider what I found upon analyzing the Dow Jones Industrial Average’s DJIA, +0.56% return in every U.S. presidential election since 1900. I searched for any correlations between the Dow’s pre-election strength and whether the incumbent political party retaining the White House. I measured that strength over periods as short as the month prior, to as long as the entire year-to-date period (10+ months). The results do not inspire statistical confidence. While some of the correlations appeared to be impressive, the majority were not significant at the 95% confidence level that statisticians often use when determining if a correlation is real. The lack of any consistent pattern suggests that there is less here than meets the eye, and so investors shouldn’t count out Trump’s re-election chances even if the stock market performs poorly between now and Election Day. For example, the stock market’s year-to-date strength on Election Day is not correlated with the incumbent party’s chances. Nor is the market’s strength over the eight months leading up to the election. But, strangely, when the focus is on market strength over a period whose length is between these two — specifically, nine months rather than eight or 10 — the result in fact does become statistically significant. Unless one can come up with a theory why market strength over a nine-month horizon should be predictive of the election outcome, but not over a slightly shorter or longer time horizon, then we should dismiss this apparent correlation. The same inconsistency emerged when I focused on shorter time periods. The market’s return over the three months prior to the election is significantly correlated with the incumbent party’s chances—but not over the 1-month or 6-month periods prior to Election Day. This is especially important to keep in mind now since a factoid that’s making the rounds on Wall Street right now is that the stock market’s return over the three months prior to elections can predict the outcome.Watch the betting markets If these results aren’t enough to lead you to question the stock market’s record as an election handicapper, check out electronic betting markets such as PredictIt.org and the University of Iowa’s Iowa Electronic Markets. These online futures markets allow users to bet on various outcomes, such as whether Trump will win re-election. The futures that trade on these sites are all-or-nothing contracts, paying 100% if the particular outcome comes to pass and nothing if it doesn’t. Accordingly, prices reflect investors’ collective bets about that outcome’s probabilities. Extensive research has found that online betting markets are better at forecasting the presidential election outcome than opinion polls. Correlating the stock market’s gyrations with those of the Trump contract at PredictIt.org, for example, as shown in the chart above, provides insight into what investors collectively think of the president’s re-election chances. As of July 6, the PredictIt.org odds of Trump’s winning re-election are 40% — down from above 50% less than three months ago. Over those three months, in contrast, the S&P 500 SPX, +0.87% gained 20%. These results make it hard to argue that the stock market will decline if Trump’s odds of winning re-election sink even further. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com More: Here’s the real reason that Mary Trump’s tell-all book matters in the presidential election Also read: Trump, Biden fight for primacy on social media platforms"}]}