{"article": [{"url": "https://www.marketwatch.com/story/finance-is-like-done-everybodys-bought-everybody-else-with-low-cost-debt-says-valueact-founder-jeff-ubben-elizabeth-warren-was-right-2020-06-23", "published": 1593082400.0, "headline": "â\u0080\u0098Finance is, like, done. Everybodyâ\u0080\u0099s bought everybody else with low-cost debtâ\u0080\u0099 says ValueAct co-founder Jeff Ubben â\u0080\u0094 â\u0080\u0098Elizabeth Warren was rightâ\u0080\u0099", "body": "The 58-year-old co-founder of ValueAct Capital, Jeff Ubben, told the Financial Times that heâ\u0080\u0099s calling it quits at the investment fund that he co-founded about two decades ago in San Francisco. “ â\u0080\u0098Finance is, like, done. Everybodyâ\u0080\u0099s bought everybody else with low-cost debt. Everybodyâ\u0080\u0099s maximized their margin. Theyâ\u0080\u0099ve bought all their shares backâ\u0080\u0089.â\u0080\u0089.â\u0080\u0089.â\u0080\u0089Thereâ\u0080\u0099s nothing there. Every industry has about three players. Elizabeth Warren is right.â\u0080\u0099 ” Ubben had already stepped down as chief investment officer at the fund in 2017 and as CEO at the beginning of 2020, amid a round of changes in January at the activist hedge fund, and is now leaving altogether to kick off a new environmental and social-impact investment company that he calls Inclusive Capital Partners. In an article published Tuesday by the FT, Ubben expressed some frustration with the status quo on Wall Street: â\u0080\u009cCompanies, as governed today, with investors asking for more current returns and more buybacks and so forth, arenâ\u0080\u0099t working for society or nature.â\u0080\u009d ValueAct and Ubben had established a reputation as a hedge that sat on the friendlier end of the spectrum of investor activism. He said that his efforts to invest in so-called impact investing, which is a style of investing focused on generating social and environmental change on top of an investment return. Ubben told the FT that that style of investing didnâ\u0080\u0099t naturally sit alongside traditional investing, so he decided to branch off and created his own fund. Thematic investing â\u0080\u0094 focused on environmental, social and governance, or ESG, practices â\u0080\u0094 have prospered even against the backdrop of the coronavirus pandemic that has infected more than 9 million people so far. Indeed, in the first four months of 2020, investors poured a record of at least $12.2 billion into funds that characterize themselves as ESG, according to investment research platform Morningstar Direct. ESG funds also have booked better-than-average returns, despite this yearâ\u0080\u0099s wild ride in markets that has pulled the S&P 500 index SPX, +0.87% Â down 3% and the Dow Jones Industrial DJIA, +0.56% Â off 8.3%. More than 70% of ESG funds across all asset classes performed better than their counterparts during the first four months of the year, the Wall Street Journal reported. Read: The decline of the U.S. dollar could happen at â\u0080\u0098warp speedâ\u0080\u0099 in the era of coronavirus, warns prominent economist Stephen Roach See:Stock-market legend who called 3 financial bubbles says this one is the â\u0080\u0098Real McCoy,â\u0080\u0099 this is â\u0080\u0098crazy stuffâ\u0080\u0099"}]}