{"article": [{"url": "https://www.marketwatch.com/story/paypal-ceo-says-corporate-activism-can-help-spur-the-tipping-point-that-brings-social-change-2020-06-29", "published": 1593444680.0, "headline": "PayPal CEO says corporate activism can help spur the 'tipping point' that brings social change", "body": "An earlier version of this story incorrectly stated PayPal's stock move for the year. The stock is up 55% on a year-to-date basis. PayPal Chief Executive Dan Schulman Patrick T. Fallon/Bloomberg PayPal Holdings Inc. Chief Executive Dan Schulman argues that corporations have a key role to play in reaching the \"tipping point\" that can bring about social change. The payment technology company announced earlier in June that it was committing $530 million toward helping minority-owned businesses. PayPal's PYPL, +2.18%  commitment includes grants to and investments in Black-owned and minority-owned businesses. Schulman said that the grant money is crucial because Black businesses routinely face higher hurdles to traditional loan opportunities, according to a recent interview with CNET. \"Even during good times, the amount of financing they can raise, whether it be equity financing or just loans, is much lower than the national average,\" he said. \"But in this time, it's practically impossible for them to get a loan.\" Schulman said that PayPal has already disbursed $10 million in grants, not loans, as part of the program. Read: Venmo and Square's Cash App were going gangbusters before the pandemic - now they're doing even better While the company doesn't have an end date for when it plans to have disbursed its entire $530 million commitment, Schulman said that PayPal wants to \"start moving on it ASAP\" while at the same time making sure there are funds remaining over a longer span. \"Some of it [is] more short term-oriented, but we also put in place a very substantial amount of money to help over the long term, because at some point, the marches start to fade away, but the problem still exists,\" he said. PayPal is focused on \"multiyear commitments\" beyond one-time grants, according to Schulman. In Schulman's view, the pandemic has given people more time to reflect on racial issues in the U.S., allowing them to \"[tap] into the consciousness of the country,\" though there's more work to be done. \"I think the key is to take advantage of this moment, whether it be nonprofits, organizations that fight for social justice, and the private sector to really step up, because I think things need to start tipping and then they hit a tipping point and then they keep moving,\" he said. He stated that people need to \"do more than just condemn racism.\" Instead, they need to be \"antiracist,\" which to him means that they \"have to be a part of the fight.\" PayPal had taken a stand on social issues in the past, banning social-network site Gab.com from using its services due to the presence of hateful speech on the Gab platform leading up to the 2018 shooting at a Pittsburgh synagogue. PayPal's Schulman has argued that the company's broader mission has a social component as well since PayPal's digital financial tools can make money management easier for those without traditional bank accounts. PayPal's stock has gained 55% year to date, while the S&P 500 index SPX, +0.87%  has slipped 5.8%."}]}