{"article": [{"url": "https://www.marketwatch.com/story/hertz-pulls-potentially-worthless-share-offering-2020-06-17", "published": 1592460980.0, "headline": "Hertz pulls potentially worthless share offering", "body": "Hertz Global Holdings Inc. pulled its controversial share offering after security regulators vowed to review it, the car-rental company said in a filing Wednesday. Hertz HTZ, -1.78% filed Monday to offer up to $500 million in shares, aiming to cash in on a surge in investor’s interest on its rallying stock despite having filed for bankruptcy protection on May 22, drowning in debt and hit hard by global restrictions on travel designed to slow to spread of the coronavirus pandemic. In the Wednesday filing, Hertz said it had been “advised orally” by employees with the Securities and Exchange Commission’s division of corporation finance on Monday afternoon that they planned to review the offering’s prospectus. After discussions with the SEC employees, sales “were promptly suspended pending further understanding of the nature and timing of the staff’s review,” Hertz said in Wednesday’s filing. The company’s advisers “have been in regular contact with the Commission” since that initial contact, Hertz said. Earlier Wednesday, SEC Chairman Jay Clayton told CNBC the regulator had issues with Hertz’s plan to sell potentially worthless stock, and that it had let Hertz know it had “comments” on the company’s disclosure. In most cases companies would then halt their efforts until the issues were resolved, Clayton said. A bankruptcy judge late Friday ruled in favor of Hertz’s proposal, surprising many investors. In the Monday’s share-offering prospectus, Hertz repeatedly warned potential investors its shares could end up being “worthless” amid the bankruptcy proceedings. The filing, studded with other dire warnings, was also notable for what it didn’t have: Any details about a reorganization plan and what would happen with Hertz assets, many of which are tied to securities. Shares of Hertz shot higher after the halt,which came in midday trading. They pared some gains as the session drew to a close, however. The stock is up 96% so far this month, compared with gains around 2% and 3% for the S&P 500 index SPX, +0.87% and the Dow Jones Industrial Average DJIA, +0.56% in the same period. The stock is down 87% so far this year."}]}