{"article": [{"url": "https://www.marketwatch.com/story/armenia-and-azerbaijan-are-in-a-deadly-fight-over-the-nagorno-karabakh-region-01601303838", "published": 1601335820.0, "headline": "Dozens killed as Armenia and Azerbaijan continue fighting in disputed Nagorno-Karabakh region", "body": "An Azerbaijan's rocket launches from missile system at the contact line of the self-proclaimed Republic of Nagorno-Karabakh, Azerbaijan., on Monday. Azerbaijan's Defense Ministry via AP YEREVAN, Armenia — Armenian and Azerbaijani forces fought over the separatist region of Nagorno-Karabakh for a second day Monday, with both sides blaming each other for resuming the attacks that reportedly killed and wounded dozens as the decades-old conflict has reignited. The Azerbaijani Defense Ministry claimed Armenian forces shelled the town of Tartar, while Armenian officials said the fighting continued overnight and Baku resumed “offensive operations” in the morning. Azerbaijani military officials told the Interfax news agency that over 550 Armenian troops have been “destroyed (including those wounded)” in a claim that Armenia denied. According to officials in the predominantly Armenian enclave of Nagorno-Karabakh, 58 servicemen on their side have been killed so far. The territory’s Defense on Sunday also reported two civilian deaths — a woman and her grandchild. About 200 troops have been wounded, but many were only slightly hurt and have returned to action, the Armenian Defense Ministry said. Azerbaijani authorities said nine civilians were killed and 32 wounded on their side. Azerbaijani President Ilham Aliyev said Sunday there were losses among Baku’s forces, too, but he didn’t elaborate. The heavy fighting broke out Sunday in the region that lies within Azerbaijan but has been under the control of ethnic Armenian forces backed by the Yerevan government since 1994 at the end of a separatist war. Azerbaijan said it destroyed two Armenian tanks, and Nagorno-Karabakh’s Defense Ministry reported that Baku “lost 10 armored vehicles in a tank battle.” The Armenian Defense Ministry said that, while the fighting continued, “all offensives of the Azerbaijani Armed Forces were successfully suppressed, the enemy was thrown back” and suffered losses. Nagorno-Karabakh — a region in the Caucasus Mountains about 1,700 square miles or about the size of the U.S. state of Delaware — is 30 miles from the Armenian border. Soldiers backed by Armenia also occupy some Azerbaijani territory outside the region. The European Union urged both sides to stop fighting and return to the negotiating table, following similar calls by Iran, Russia, France and the United States. “We hope and we urge everyone to everything they can in order to prevent an all-out war from breaking out, because this is the last thing the region needs,” European Commission spokesman Peter Stano said in Brussels. “There is no military solution to this conflict.” Five European countries — Belgium, Estonia, France, Germany and the United Kingdom — asked for a closed-door meeting of the U.N. Security Council on the escalating conflict on Tuesday. U.N. Secretary-General Antonio Guterres spoke to both Aliyev and Armenian Prime Minister Nikol Pashinian and called for “an immediate stop to the fighting, a de-escalation of tensions and a return to meaningful negotiations without preconditions or delay,” spokesman Stephane Dujarric said. Kremlin spokesman Dmitry Peskov said the situation “is a cause for concern for Moscow and other countries.” “We believe that the hostilities should be immediately ended,” Peskov said, adding that the process of resolving the conflict should shift into “a politico-diplomatic” dimension. Armenia’s Foreign Ministry accused Turkey, which sides with Azerbaijan in the conflict, of supporting “this aggression.” “Turkish military experts are fighting side by side with Azerbaijan, who are using Turkish weapons, including UAVs and warplanes,” the ministry said. The situation “clearly indicates” that people in Nagorno-Karabakh are fighting against “a Turkish-Azerbaijani alliance,” the statement said. Both Armenia and Turkey accused each other of recruiting foreign mercenaries. Omer Celik, spokesman for Turkish President Recep Tayyip Erdogan’s ruling party, denied reports that Turkey had sent arms or foreign fighters to Azerbaijan. “Armenia is disturbed by Turkey’s solidarity with Azerbaijan and is producing lies against Turkey,” Celik tweeted. Erdogan reiterated Turkey’s support for Azerbaijan and said Armenia’s immediate withdrawal from the region was the only way to ensure peace. “All other impositions and threats will not only be unjust and unlawful, but will continue to indulge Armenia,” he said. Erdogan criticized France, the U.S. and Russia — the three chairs of the so-called Minsk group that was set up in 1992 to resolve the Nagorno-Karabakh conflict — saying they had failed to resolve the issue for 30 years. “They have done their best not to solve this issue. And now they come and counsel and issue threats. They say ‘is Turkey here, is the Turkish military here?’” Erdogan said. “Whose lands were occupied? Azerbaijan’s lands. … Nobody asks for (Armenia) to account. Azerbaijan has been forced to take the matters into its own hands,” he added."}]}