{"article": [{"url": "https://www.marketwatch.com/story/most-americans-are-worried-about-foreign-interference-in-the-election-01601648756", "published": 1601647940.0, "headline": "Three in four Americans are worried about foreign interference in the presidential election", "body": "President Donald Trump and Russian President Vladimir Putin walk together to an event at the G20 summit in Osaka, Japan, in June 2019. AP Photo/Susan Walsh WASHINGTON (AP) — Most Americans are concerned at least somewhat by the potential for foreign interference in November’s election, and a majority believes that Russia sought in 2016 to influence the outcome of that race, according to a new poll that underscores the anxiety and political divisions heading into the final weeks of the presidential contest. The poll from the University of Chicago Harris School of Public Policy and the Associated Press-NORC Center for Public Affairs Research shows that about three-quarters of Americans are at least somewhat concerned about interference, whether in the form of tampering with voting systems and election results, stealing data from campaigns, or influencing the candidates themselves or the way voters think about them. Still, no more than half are “extremely” or “very” concerned about each of those possibilities. The poll was taken as intelligence officials warn of ongoing efforts by foreign adversaries to interfere in American politics, including a concerted Russian effort to denigrate Democratic presidential nominee Joe Biden. FBI Director Christopher Wray told lawmakers last month that Russia was continuing to use social-media propaganda to try to influence the election, though he said officials had not seen targeting of voting-system infrastructure. Officials also say they don’t have intelligence that foreign countries are targeting the vote-by-mail process. See: Wisconsin Republican Ron Johnson on defensive over probe of Biden and Ukraine in wake of intelligence assessment about ongoing Russian election interference The extent of concern about 2020 election interference breaks largely along partisan lines, with 68% of Biden supporters saying they are “extremely” or “very” concerned about foreign countries influencing how Americans perceive the candidates, according to the poll. Among supporters of President Donald Trump, 30% are extremely or very concerned, with 29% saying they are somewhat concerned. Foreign interference or influence could theoretically take many shapes. Besides meddling with voting systems — which officials say would be hard to do in such a way as to materially affect results — or shaping voters’ perception of the candidates, there are also potential concerns about stealing information from a candidate or party or influencing candidates themselves. Dawn Jackson, 61, who is retired and lives in Gilbert, Ariz., and plans to vote for Trump, said she is not exceedingly concerned. “My opinion is countries have interfered in elections for a long, long time, and I am positive the United States has done their share of trying to interfere in other countries’ elections,” Jackson said. “So what goes around comes around.” But Nancy Camfield, 68, of Frankfort, Ill., who supports Biden, said she is among those concerned about foreign influence through social media, especially because intelligence officials have been sounding the alarms. “When former FBI directors and intelligence-agency employees say that they know that’s going on, and Trump denies it, well, I’d rather believe the experts,” Camfield said. Austin Wright, an assistant professor at the University of Chicago’s Harris School, said it was striking that Americans are not more concerned by the threat of foreign interference given the range of dangers. He suggested that may have to do with domestic concerns currently occupying public attention, and with the fact that some American leaders — including Trump — are themselves working to undermine confidence in the election. “We don’t have to worry about foreign countries doing that anymore. We have plenty of actors who are more than happy to completely undermine our democratic institutions with the short-term goal of four more years of the Trump administration,” Wright said. The concerns are heightened by Russian interference in 2016, when intelligence operatives stole Democratic emails that were then published online in the weeks before the election and when Russians used social media to push out content aimed at sowing discord in America. A majority of Americans, or 69%, believe Russia tried to influence the results of the 2016 election. About 9 in 10 Biden supporters feel that way, compared with roughly half of Trump backers. Michael Asmar, 53, a software engineer from Vernon, Conn., who plans to vote for Trump, said he didn’t doubt that foreign countries were trying to interfere in the election. But he said he thought they were doing so “on their own terms” without any solicitation from Trump. “With the fully connected world we have now with Facebook FB, +0.26% and all that, I think it’s very easy for anybody to really sway opinions,” Asmar said. “I think that certainly Russia, China — anybody, really — looking to meddle in an election could do that.” The August intelligence assessment that outlined ongoing Russian interference also noted that China regards Trump as unpredictable, prefers that he lose to Biden and has been working to shape U.S. policy. Trump has seized on that finding as he and several other senior administration officials have tried to make the case that Beijing is the more assertive adversary. Trump has repeatedly maintained that China is working to defeat him, though Microsoft MSFT, +2.48% noted in a blog post last month that among those targeted by Chinese state-backed hackers are people associated with the Biden campaign. Learn more: Pelosi and fellow Democrats say Russia poses urgent threat to 2020 election and China and Iran don’t belong in the same conversation Also: Bolton book adds urgency to Trump bid to depict himself as a China hawk and to paint Biden as a Beijing apologist Overall, 46% of Americans disapprove of Trump’s relationship with Russia, compared with 26% who approve. An additional 27% say they neither approve nor disapprove. A slim majority of Trump supporters, 55%, approve of Trump’s handling of Russia, with just 7% disapproving. Among Biden backers, 84% say they disapprove. Trump has said he has been tougher than anyone on Russia, but Democrats have criticized him for what they see as his failure to publicly call out Russian President Vladimir Putin for election interference or to even accept the intelligence community’s findings that Russia meddled in 2016. Trump supporters are somewhat more likely to support strengthening ties with Russia over weakening them, 54% to 42%, while three-quarters of Biden supporters endorse weaker ties with Russia."}]}