{"article": [{"url": "https://www.marketwatch.com/story/gold-buoyed-as-rising-coronavirus-cases-boost-expectations-for-additional-stimulus-2020-07-20", "published": 1595253980.0, "headline": "Silver marks highest finish since 2016; gold ends higher for a second session", "body": "Silver futures marked their highest finish since 2016 and gold ended higher for a second straight session Monday, with both precious metals finding support as the rise in global COVID-19 cases threatened economic recovery, raising expectations for additional fiscal stimulus measures to Expectations for lower interest rates and more stimulus, as well as rising debt “and a myriad of global economic worries of slower recovery and pandemic headlines,” amid U.S.-China tensions have prompted investors to “keep buying dips in gold and silver,” said George Gero, managing director at RBC Wealth Management, in a note. Gold for August delivery GC00, +2.17% on Comex rose $7.40, or 0.4%, to settle at $1,817.40 an ounce. That was the highest most-active contract settlement since July 8, when prices above $1,820 marked the highest level since September 2011. September silver US:SIU20 added 43 cents, or 2.2%, to end at $20.192 an ounce—the highest most-active contract finish since August 2016, according to Dow Jones Market Data. Read:Why silver is trading at a nearly 4-year high A hard-fought summit meeting of European Union leaders in Brussels was reportedly near agreement on a huge spending program, including a €750 billion rescue fund after a disagreement over the breakdown between grants and loans to debt-strapped governments. Meanwhile, U.S. lawmakers were set to begin talks over an additional coronavirus aid bill. “The €390 billion of grants and €360 billion of loans that are now being talked about [in Europe] mean additional mountains of debt and further currency debasement,” said Daniel Briesemann, analyst at Commerzbank, in a note. “Gold should therefore profit as a store of value. Further financial aid to overcome the corona crisis is likewise being discussed in the US. This is also necessary given that the first corona emergency aid packages will soon come to an end.” The global number of confirmed cases of the coronavirus that causes COVID-19 climbed to 14.5 million on Monday, according to data aggregated by Johns Hopkins University, and the death toll rose to 606,206. The U.S. saw 64,650 new infections on Sunday, down from the 66,026 counted on Saturday and Friday’s record of more than 76,000. The U.S. now has 3.77 million cases, or about a quarter of the global total, and 140,534 deaths. Gold futures on Friday registered a sixth weekly gain in a row, buoyed by a combination of rising expectations for additional fiscal stimulus in Europe and the U.S. as well as uncertainty over the global economic outlook as the COVID-19 cases continue to rise. In other Comex action Monday, the September copper contract US:HGU20 tacked on 0.4% to $2.9155 a pound. October platinum PLV20, +3.99% rose 1% to $857.90 an ounce and September palladium US:PAU20 settled at $2,109.40 an ounce, up 1.8%."}]}