{"article": [{"url": "https://www.marketwatch.com/story/the-stunning-retail-sales-surge-in-may-is-great-news-but-dont-expect-a-repeat-2020-06-16", "published": 1592315720.0, "headline": "The stunning retail-sales surge in May is great news, but don't expect a repeat", "body": "The end of the coronavirus pandemic lockdowns sent Americans back out in droves to their favorite stores in May, delivering a record 17.7% spike in retail sales that astonished Wall Street. Yet the big question is this: Can the rebound in consumer spending - the driving force of the U.S. economy - carry on once all the pentup demand that built up during the lockdown is met and government aid to families and unemployed workers fades away? Read:Retail sales surge a record 17.7% in May, but coronavirus wounds still visible The partial recovery in sales in May was helped not just by states beginning to reopen their economies. The federal government also provided up to $1,200 in onetime stimulus to families and made unemployment benefits more generous for the millions of people who lost their jobs. \"The economy is recovering, but when you start at historic lows and you reopen, that should not surprise anyone,\" said Joel Naroff of Naroff Economic Advisors. \"The issue over the next two or three months will not be how big a gain we get, but how close we get to the end of 2019 levels.\" Getting back to retail-sales numbers at the end of 2019 is likely to be a huge challenge. Even after the spike in May, receipts are still 8% below precrisis levels. Washington is preparing further relief measures, but it has no plans to send out another round of $1,200 checks. The Trump White House and Republican-controlled Senate also favor a reduction in emergency unemployment benefits that in many cases pay workers more to stay home than to return to work. Extended jobless benefits run out at the end of July. Read:Consumer sentiment climbs again in June as reopening U.S. economy eases worries See: MarketWatch Economic Calendar The quick return of tens of millions of lost jobs is by no means certain though, especially in an era of social distancing requirements. Restaurants, airlines, hotels, sports leagues, entertainment venues and certain segments of the retail industry are sure to struggle to get back to normal with so many customers hesitant to gather in large groups. \"Sectors most affected by ongoing social distancing requirements will take longer to recover,\" said senior U.S. economist Andrew Hunter at Capital Economics. Although the official unemployment rate fell in May to 13.3% from a record 14.7%, some 20 million Americans were still out of work at the end of the month. A large chunk of them could be sidelined for much longer and that will weigh on consumer spending in the months ahead. \"Millions of households are caught in the high unemployment rate trap and they will not be feeling as optimistic any time soon,\" said Robert Dye, chief economist at Comerica Bank in Dallas. A further complication could be a recent increase in COVID-19 cases in some U.S. states probably resulting more people returning to work as well as the mass protests over police brutality. If the increases in COVID-19 infections occur as economies reopen, then some states may pull back in allowing people to have greater access to shops, restaurants, etc,\" wrote David Berson, chief economist at Nationwide. \"Additionally, consumers may be more reticent about potential exposure."}]}