{"article": [{"url": "https://www.marketwatch.com/story/covid-19-devastated-nursing-homes-here-are-safer-more-cost-effective-options-11602245129", "published": 1602239840.0, "headline": "COVID-19 devastated nursing homes â\u0080\u0094 here are safer, more cost-effective options", "body": "Illustration by Kevin Whipple During a March 13 video chat with her mother, who was living in a Georgia nursing home on lockdown, Kelly Chapman noticed the worker facilitating the call wasnâ\u0080\u0099t wearing a mask or gloves. After learning hours later that the nursing home had five confirmed COVID-19 cases, she arranged to remove her then 79-year-old mom, Wilma, from the facility â\u0080\u0094Â and, while picking up her mother the next day, observed an employee entering the building sans personal protective equipment. It turned out that Wilma, who lives with multiple mental illnesses and blindness, had also contracted COVID-19, which takes a disproportionate toll on older people. Wilma transmitted a mild case of the disease to her daughter, spent several days in the hospital, and then came to live full-time with Chapman, who is residing temporarily in Atlanta. Her first two or three months as a caregiver, Chapman cried every day. Caring for an elderly loved one â\u0080\u0094 particularly one with mental disabilities â\u0080\u0094 is challenging for a single person, she said, even with a Medicaid nurse aide helping six hours a day starting in June. But even on their most stressful days, Chapman still believes her mother is safer and less isolated than she would be in a long-term care facility during a pandemic. â\u0080\u009cI must tell myself that over and over on the hard days,â\u0080\u009d she told MarketWatch. While the two have since tested negative for coronavirus and Chapman has started flying standby at her flight-attendant job after months of unpaid leave, both are now struggling with â\u0080\u009clong-haulerâ\u0080\u009d symptoms, she said â\u0080\u0094 complicating Chapmanâ\u0080\u0099s plans to sustain her full-time return to work while caring for her mother, who now needs even more hands-on attention. She is weighing the possibility of returning her mom to a nursing facility, but hopes to make home care work. â\u0080\u009cIn my heart of hearts, I still believe this is the better way to go,â\u0080\u009d she said. â\u0080\u009cI just donâ\u0080\u0099t know if I can handle it.â\u0080\u009d After COVID-19 ravaged congregate living facilities across the U.S., long-term care advocates are hoping tragedy can inspire a meaningful shift in how the country cares for â\u0080\u0094 and spends on â\u0080\u0094 its elderly people. The coronavirus had killed at least 57,008 U.S. nursing-home residents as of the week ending Sept. 20, according to government data, to say nothing of reports suggesting undercounted deaths and additional hundreds of COVID-19 staff deaths. Homes with a substantial share of Black and Latino residents were harder hit. Widespread facility lockdowns left seniors isolated and families bereft.Â “ â\u0080\u009cCOVID did bring more awareness of how bad things are in nursing homes. It has forced people to face it: We canâ\u0080\u0099t just put people in these homes and forget about them. We need to think about how to improve them.â\u0080\u009d ” â\u0080\u0094 Nora Super, the senior director of the Milken Institute Center for the Future of Aging What went so wrong? Observers point to staffing shortages, insufficient testing and personal protective equipment, existing infection-control shortcomings and chronic underfunding of long-term care. Nursing homes already struggled with understaffing, low pay, and depression and loneliness among residents prior to the pandemic. With these deficiencies laid bare, long-term care experts predict the pandemic will accelerate a years-long push to direct the United Statesâ\u0080\u0099 fast-aging population away from institutionalization and toward home and community-based settings. At the same time, many are calling for substantial upgrades to nursing-home conditions, including by creating smaller, more self-contained settings within facilities, and providing fairer compensation and benefits for their largely underpaid workforce. â\u0080\u009cCOVID did bring more awareness of how bad things are in nursing homes,â\u0080\u009d Nora Super, the senior director of the Milken Institute Center for the Future of Aging, told MarketWatch. â\u0080\u009cIt has forced people to face it: We canâ\u0080\u0099t just put people in these homes and forget about them. We need to think about how to improve them.â\u0080\u009d Kelly Chapman decided to remove her mother, Wilma, from a Georgia nursing home in March. Courtesy of Kelly Chapman Experts who spoke with MarketWatch said a big part of the solution lies in increasing the amount of money that Medicaid pays for nursing-home stays, as well as in boosting funding for seniors to receive care in residential and community settings. The American Health Care Association/National Center for Assisted Living, a top nursing-home industry group, told MarketWatch in a statement that â\u0080\u009cthere is no denying that nursing home residents have been uniquely impacted by COVID-19.â\u0080\u009dÂ â\u0080\u009cHowever, the additional tragedy has been the failure of the public health system at every level to prioritize and direct resources to these residents and caregivers when we knew they were especially vulnerable and lacking resources,â\u0080\u009d the organization added. â\u0080\u009cLetâ\u0080\u0099s focus on prioritizing nursing homes for resources to address COVID-19 right now, and invest on making them better for the future. That means fully funding Medicaid for the actual cost to provide care, so residents receive the best.â\u0080\u009d A â\u0080\u0098brokenâ\u0080\u0099 payment model The average American reaching 65 today will rack up some $138,000 in future long-term services and support, according to the Milken Institute â\u0080\u0094 but since most people incorrectly assume Medicare will cover these costs, many neglect to budget for their costs of care, Medicaid eligibility and insurance options.Â â\u0080\u009cWho wants to plan for long-term care? Not really anyone, because theyâ\u0080\u0099re going to say, â\u0080\u0098I donâ\u0080\u0099t need it,â\u0080\u0099â\u0080\u009d Jasmine Travers, an assistant professor at the NYU Rory Meyers College of Nursing who researches long-term care, told MarketWatch. Yet about seven in 10 adults who live to age 65 will develop â\u0080\u009csevereâ\u0080\u009d needs for long-term services and supports, research shows. Nursing homes exist at one end of a facility-based long-term care spectrum that also includes assisted-living facilities, residential-care facilities and continuing-care retirement communities. Some 1.3 million residents lived in about 15,600 nursing homes in 2016, the most recent year for which government data was available, and around seven in 10 facilities were under for-profit ownership.Â Private-equity ownership of nursing homes has risen in recent years, leading advocates to accuse owners of prizing profits over patient well-being. Out-of-pocket nursing-home costs, meanwhile, have increased more quickly than other medical-care prices.Â Medicaid provides the largest funding source for nursing homes; other sources include private pay and long-term care insurance. Contrary to popular belief, Medicare doesnâ\u0080\u0099t pay for long-term care; it will cover skilled nursing facility stays of up to 100 days, typically for rehabilitative purposes after a hospital discharge. But â\u0080\u009cMedicare, as a rule, pays better than Medicaid,â\u0080\u009d Super said, so this relatively small fraction of short-stay patients proves far more profitable for nursing homes. The pandemic upended this revenue model as common surgeries like hip and knee replacements were put on hold, she said; many nursing facilities, fearing COVID-19 exposure, also stopped taking in patients discharged from hospitals. Nursing homes faced financial strain. This phenomenon magnified existing cracks in the incentive structure for nursing-home funding, argued a recent peer-reviewed article by Joseph Ouslander, the executive editor of the Journal of the American Geriatrics Society, and Harvard Medical School health-care policy professor David Grabowski. â\u0080\u009cThe model of paying huge margins for Medicare short-stay residents while underpaying for long-stay Medicaid residents is broken,â\u0080\u009d they wrote. â\u0080\u009cIt is time to align better payments and costs across Medicare and Medicaid residents. Ideas include federalizing payment of long-stay residents and ensuring that payments for short-stay residents more closely mirror costs.â\u0080\u009d Travers pointed to research linking state Medicaid investments with better quality of care. â\u0080\u009cThere needs to be more Medicaid funding for nursing homes,â\u0080\u009d she said. â\u0080\u009cGone are the days when nursing homes can try to juggle between these other types of payments.â\u0080\u009d How to fix nursing homes Many long-term care experts agree that the pandemic should spur improvements within the nursing-home system to better protect residents and workers â\u0080\u0094 including by modifying physical spaces and thinking smaller. Smaller, more community-based settings for elder care â\u0080\u0094 even if theyâ\u0080\u0099re just existing nursing homes divvied up into smaller â\u0080\u009cpodsâ\u0080\u009d â\u0080\u0094Â can help prevent infections from ripping through large congregate populations, and perhaps prevent an entire facility from needing to go into lockdown during an infectious-disease outbreak, said Carol Bradley Bursack, the founder of Minding Our Elders, a caregiver-support resource. â\u0080\u009cWeâ\u0080\u0099re stuck on this model of these huge, huge nursing homes,â\u0080\u009d she said. But there must also be substantial investment in the nursing assistants who care for residents, experts say, if only because staff members working at more than one facility appear to have contributed to coronavirus transmission. â\u0080\u009cWe need to pay nursing assistants a living wage so that they donâ\u0080\u0099t have to work multiple jobs,â\u0080\u009d Travers said. These workers, a large proportion of whom are women, racial and ethnic minorities and/or immigrants, also need paid sick leave so theyâ\u0080\u0099re able to stay home when they donâ\u0080\u0099t feel well, she added. â\u0080\u009cTheyâ\u0080\u0099re probably living in congregate housing, taking public transportation and also working multiple jobs, increasing the likelihood of spreading the COVID virus.â\u0080\u009d Amit Arya, a University of Toronto palliative-care specialist with a focus on long-term care, described similar working conditions in Canadian nursing homes. â\u0080\u009cWe have to remember that at heart, the interests of the patients and the workers are the same,â\u0080\u009d he said. â\u0080\u009cWe have to pay people a living wage.â\u0080\u009d COVID-19 can also lead to positive changes in the clinical realm, Ouslander told MarketWatch â\u0080\u0094Â including reducing unnecessary transfers of long-term care patients to the emergency department; increasing the use of telehealth visits when appropriate; reducing the administration of inappropriate and unnecessary medications, which can preserve staff time and resources and minimize their interactions with patients; and bolstering advance-care planning with care-limiting orders such as â\u0080\u009cdo not hospitalize unless absolutely necessary for comfort,â\u0080\u009d which can help avoid uncomfortable and often futile care in patients who rapidly deteriorate. Looking beyond nursing homes When it comes to funding long-term care services beyond nursing homes, thereâ\u0080\u0099s been a longstanding â\u0080\u009cinstitutional biasâ\u0080\u009d within Medicaid, said Robyn Grant, the director of public policy and advocacy at the National Consumer Voice for Quality Long-Term Care. While home and community-based services now account for a greater share of total Medicaid long-term services and supports expenditures than institutional settings, and many states have expanded the availability of such services in recent years, coverage tends to be optional and varies widely in scope. States use federal waivers to offer most home and community-based services, according to the Kaiser Family Foundation. Super and other experts predicted a further movement out of institutional settings and toward offering more services in the home and community. â\u0080\u009c[S]trong investment in home- and community-based services will lessen the number of individuals relying on nursing homes for their care,â\u0080\u009d Ouslander and Grabowski wrote in their article. In July, the nonprofit National Council on Aging advocated for boosting federal assistance to expand access to home-care services. Innovative alternatives to nursing homes have sprung up over the years. One such model is Community Aging in Placeâ\u0080\u0094Advancing Better Living for Elders (CAPABLE), a Johns Hopkins School of Nursing program that sends a registered nurse, an occupational therapist and a licensed handyperson to enable seniors, especially those who are low-income people of color, to live safely and independently at home. The Joe Biden-approved program, which began as a trial in Baltimore and now operates in more than 25 sites across the country, translates about $3,000 in program costs per person into $20,000 in medical cost savings. On the government side, the PACE (Programs of All-Inclusive Care for the Elderly) program works with people aged 55 and older who require a nursing home-level of care to fulfill their health needs in the community. The program, which grew out of a model pioneered in San Franciscoâ\u0080\u0099s Chinatown, provides Medicare and/or Medicaid participants with services and care at an adult day health-care center, as well as at home and by referral. But the program is also only available in 31 states and may require participants to use a PACE-preferred doctor; a 2014 literature review also found mixed evidence of its cost-effectiveness. Assisted-living facilities could be one alternative for people who donâ\u0080\u0099t need round-the-clock care, but Medicaid coverage of these services lacks consistency state by state. â\u0080\u009cThere is such a lack of Medicaid-funded assisted living, so itâ\u0080\u0099s just not affordable for the vast majority of people, or only for a short period of time,â\u0080\u009d Grant said. â\u0080\u009cPeople are often forced to receive care, frankly, in a nursing home, when if there were services available in the community they could be there â\u0080\u0094 or even stay in assisted living.â\u0080\u009d Select states have also introduced publicly funded long-term care plans. The Washington State Long-Term Care Trust Act, signed into law in 2019 and projected to yield nearly $4 billion in state Medicaid savings by 2052, will use taxpayer contributions to aid older individuals with a lifetime benefit of $36,500 to be put toward resources like professional services, respite for family caregivers, adaptations to make a home more accessible, home-delivered meals, transportation, and nursing-home and assisted-living services. Hawaiiâ\u0080\u0099s Kupuna Caregivers Program, a pilot that began in 2018, aims to alleviate unpaid caregiversâ\u0080\u0099 financial strain. And many advocates tout the Green House model, a small-homes approach in which 10 to 12 residents get their own private rooms and bathrooms with access to an open kitchen and common area. â\u0080\u009cItâ\u0080\u0099s much, much more home-like,â\u0080\u009d Grant said. A June report showed that 95% of Green House facilities had stayed COVID-19-free between early February and late May, while cases and deaths among residents and staff were lower compared to national nursing-home data. Long-term care could be much simpler if Medicare and Medicaid would cover more services in the home so that people could stay there longer, Bursack said. â\u0080\u009cThat could save a significant amount [of money], and generally speaking, that is the first choice of most people who are aging,â\u0080\u009d she said. â\u0080\u009cThey can choose what level of care they need until they get to a point where they absolutely need nursing-home care â\u0080\u0094 and not everyone gets there.â\u0080\u009d Arya echoed the call to invest more money in home care. (While Canadaâ\u0080\u0099s health-care system differs greatly from that of the U.S., the country also found its nursing homes devastated by COVID-19.) This investment will be cheaper for the system from a health-economics perspective, he said.Â â\u0080\u009cAs our population rapidly ages, having new buildings set up is going to cost a lot more in terms of capital expenditure. Instead, it can be a win-win, potentially, to have people age at home,â\u0080\u009d Arya said. â\u0080\u009cIâ\u0080\u0099m not saying we will be able to have everyone at home â\u0080¦ but perhaps a section of people will avoid it, and many people may be able to delay ending up in one of these buildings.â\u0080\u009d Nursing homes probably arenâ\u0080\u0099t going anywhere An â\u0080\u009centrenchedâ\u0080\u009d and powerful nursing-home lobby has thwarted some state efforts to fund more home-based care options, said Bob Stephen, the AARPâ\u0080\u0099s vice president for health and caregiving. Many legislators, particularly in the South, have business ties to nursing homes themselves, Super added â\u0080\u0094 â\u0080\u009cso it can be difficult to get policies passed in the state when thereâ\u0080\u0099s such a heavy bias toward nursing homes in the legislature to begin with.â\u0080\u009d AHCA/NCAL, the nursing-home industry group, told MarketWatch that â\u0080\u009cindividuals who require long term services and supports should be able to access the setting of their choice as well as the most appropriate setting for their needs.â\u0080\u009dÂ â\u0080\u009cWe support efforts to expand home and community-based settings, but not at the expense of nursing home care. Each long term care setting has an important role to play; each contributing to a continuum of care. We encourage policymakers to pursue efforts that increase long term coverage and options for beneficiaries as well as support every type of long term setting, so they can provide the best care possible,â\u0080\u009d the group said. â\u0080\u009cLetâ\u0080\u0099s not pit provider against provider â\u0080\u0094 letâ\u0080\u0099s focus on the needs and preferences of the individual, who deserves the utmost care at every step of the journey.â\u0080\u009d Ouslander, meanwhile, argued that most nursing-home residents likely do need to be there. â\u0080\u009cWeâ\u0080\u0099ve known that for every person in a nursing home, thereâ\u0080\u0099s two or three at home who are just as disabled. â\u0080¦ Those people have the environment and the social support and the financial wherewithal and their physical and mental resilience to live at home,â\u0080\u009d he said. â\u0080\u009cThe people who are in nursing homes or assisted-living facilities largely donâ\u0080\u0099t have those things.â\u0080\u009d If all the money aligned, living at home or in the community could be more of a reality for some people, he said â\u0080\u0094 but these arrangements arenâ\u0080\u0099t so easy to execute. â\u0080\u009cAre there some that might be able to live in the community with appropriate support? Yes, some,â\u0080\u009d he added. â\u0080\u009c[But] I donâ\u0080\u0099t believe itâ\u0080\u0099s the majority.â\u0080\u009d Case in point: â\u0080\u009cWeâ\u0080\u0099ve heard stories of families that decide theyâ\u0080\u0099re going to keep their loved one at home instead of a nursing home, but then they find themselves basically over their head,â\u0080\u009d Stephen said. Ouslander said he and his wife had found it extremely difficult to care for his mother at home, even with the resources and know-how to do so. And Chapman, months after assuming her caregiver role, is still taking things day by day and trying her best. She has inquired about increasing the hours of care available through Medicaid, though she isnâ\u0080\u0099t yet sure how sheâ\u0080\u0099ll pay for the balance of care. But while the situation isnâ\u0080\u0099t easy for her or her mother, Chapman believes itâ\u0080\u0099s superior to the alternative. â\u0080\u009cI know some people would say, â\u0080\u0098Well, be glad your motherâ\u0080\u0099s here,â\u0080\u0099â\u0080\u009d Chapman said. â\u0080\u009cI think you can be glad your motherâ\u0080\u0099s here, I think you can be glad your motherâ\u0080\u0099s not in a nursing home, and I think caregiving can be a challenge.â\u0080\u009d"}]}