{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-trade-near-the-flatline-as-dollar-softens-2020-08-31", "published": 1598884640.0, "headline": "Gold prices end higher, with most-active prices suffer first monthly loss in 6 months", "body": "Gold futures ended higher Monday, buoyed by weakness in the U.S. dollar, but prices still finished a bit lower for the month in the wake of five consecutive monthly gains. Overall, bullion continues to be viewed as a haven in the face of the COVID-19 pandemic, and the precious metal drew increased attention last week after the Federal Reserve said it is shifting to a policy of average inflation targeting, which would effectively see policy makers end the practice of pre-emptively hiking interest rates to stave off inflation. That setup is viewed as a bullish one for gold, which is viewed as a hedge against rising inflation. Read:Fed’s Clarida says new inflation-fighting strategy has roots in failure of old approach Expectations for a low-rate regime in the U.S., and in much of the developed world, and softness in the U.S. dollar also has boosted appetite for gold, experts say. “Gold will continue to be one of the best beneficiaries of the dollar’s weakness so expect to see a retest above $2,000 in the upcoming weeks,” wrote Hussein Sayed, chief market strategist at FXTM, in a Monday note. December gold GCZ20, +2.17% GC00, +2.17% rose $3.70, or 0.2%, to settle at $1,978.60 an ounce. Gold’s latest move comes as the U.S. dollar was off 0.3%, as measured by the ICE U.S. Dollar Index DXY, -0.58%, a gauge of the buck against a half-dozen currencies. The most-active December silver contract SIZ20, +5.96% SI00, +5.96%, meanwhile, added 80 cents, or 2.9%, at $28.594 an ounce. Hope for some pickup in economic activity, amid optimism over potential coronavirus treatments, also has boosted appetite for silver, which is viewed as both an industrial and precious metal. China’s official gauge of business activity expanded faster in August, with the nonmanufacturing purchasing managers index rising to 55.2, compared with 54.2 in July. For the month of August, gold lost nearly 0.4%, while silver climbed by about 18%, based on the front-month contracts, according to Dow Jones Market Data. Investors are “deferring to a slowing in the pace of growth improvement and U.S. election uncertainty coming into keen focus as the reason to own gold and remain short the dollar,” said Stephen Innes, chief global markets strategist at AxiCorp, in a market update. “I suspect this week’s jobs data could be a lively affair,” he added. U.S. August nonfarm payrolls data are due Friday. Among other metals traded on Comex, December copper HGZ20, +1.38% settled at $3.0615 a pound, up 1.4% for the session, with prices posting weekly gain of almost 6.8%. Copper futures settled at their highest since June 2018. Copper traders “apparently sees the [Chinese] nonmanufacturing PMI improvement as a sign that the economic recovery is broadening,” said analysts at Zaner Metals, in a note Monday. October platinum PLV20, +3.99% shed 0.2% to $937.90 an ounce, with prices ending the month around 2.1% higher, and December palladium PAZ20, +2.31% added 2.1% to $2,279.30 an ounce—up nearly 6.3% for the month."}]}