{"article": [{"url": "https://www.marketwatch.com/story/us-durable-goods-orders-leap-112-in-july-on-strong-demand-for-autos-and-cars-2020-08-26", "published": 1598460800.0, "headline": "U.S. durable-goods orders leap 11.2% in July on strong demand for cars and trucks", "body": "The numbers: Orders for durable goods lasting at least three years surged 11.2% in July largely because of strong consumer demand for new cars and trucks, but business spending outside the auto industry was softer and investment grew more slowly. The increase in orders last month — the third in a row — easily topped the 4.8% forecast of economists surveyed by MarketWatch. Yet demand for industrial goods was less robust if autos and airplanes are excluded. New orders rose a smaller 2.4% minus transportation, the government said Wednesday. Big ups and downs in transportation often distort the underlying pace of demand. New industrial orders still remain about 6% below the precrisis peak. What happened: Orders for new cars and trucks jumped 22% last month after a nearly 24% gain in June. Auto sales have been surprisingly strong during the summer as Americans took advantage of low interest rates and discounted pricing. Bookings in July were actually higher last month compared to July 2019. Auto orders are likely to moderate soon now that plants have reopened and auto manufacturers are operating closer to normal capacity. Sales to corporate customers are still depressed and demand usually wanes in the fall. Airline orders only declined half as much in July as they did in June, the government said, reflecting fewer cancellations. That also contributed to the better than expected increase in industrial orders last month. Boeing BA, -0.39% has suffered hundreds of cancellations and received very few orders for new planes this year after travel around the world plunged during the coronavirus crisis. The company had already been under severe financial strain after the grounding of its 737 Max plane following a pair of deadly crashes last year. The future isn’t looking much better. American Airlines on Tuesday said it would lay off or furlough 19,000 workers because so few people are flying. Orders for most other industrial goods rose, but more slowly. Bookings increased 4% for electrical equipment including appliances, 2% for fabricated-metal parts, 2% for machinery and 2% for computers and electronics. A key measure of business investment, known as core orders, edged up 1.9% last month and has returned close to pre-crisis levels. These orders exclude defense and transportation. Business investment was already weak before the pandemic, however, and is unlikely to regain its full strength until the virus is brought under control at home and abroad. The disease has wreaked havoc on the global trading system and forced businesses to preserve cash in case the economy worsens. See:MarketWatch coronavirus recovery tracker The big picture: The good news is that key parts of the economy have returned close to pre-crisis trends. Auto and most other American manufacturers have rebounded smartly from the pandemic and fared better than the much larger service side of the economy. Yet manufacturers can’t grow significantly faster until the U.S. and rest of the world contain the virus and start to return to normal. It could take a year or more before that’s the case. What they are saying? “U.S. durable goods orders made more progress toward recovering in July despite the resurgence in the virus,” said economist Katherine Judge of CIBC Economics, but “we continue to see the recovery in business investment from here as occurring relatively slowly given the prevalence of spare capacity.” Market reaction: The Dow Jones Industrial Average DJIA, +0.56% fell in early Wednesday trades while and Standard & Poor’s 500 SPX, +0.87% ended slightly higher."}]}