{"article": [{"url": "https://www.marketwatch.com/story/you-are-so-full-of-st-billionaire-mark-cuban-spars-with-ted-cruz-over-nba-ratings-11602004217", "published": 1602075620.0, "headline": "â\u0080\u0098You are so full of shâ\u0080\u0093â\u0080\u0099: Billionaire Mark Cuban spars with Ted Cruz over NBA ratings", "body": "Mark Cuban at a Dallas Mavericks game. Christian Petersen/Getty Images “ â\u0080\u0098You are so full of shit.â\u0080\u0099 ” Thatâ\u0080\u0099s Mark Cuban, billionaire owner of the NBAâ\u0080\u0099s Dallas Mavericks, calling out Sen. Ted Cruz on Twitter TWTR, -0.23% for relishing in the poor ratings for this yearâ\u0080\u0099s NBA Finals. iframe.twitter-tweet { width: 100% !important; } The NBA Finals this year between the Los Angeles Lakers and the Miami Heat have by various accounts struggled to attract viewers. Some factors may include, if not be limited to, the NBAâ\u0080\u0099s competing with NFL games for the first time and cable televisionâ\u0080\u0099s election focus. Republican Cruz, however, thinks itâ\u0080\u0099s because the NBA has turned â\u0080\u009cevery game into a left-wing political lecture.â\u0080\u009d See also: â\u0080\u0098Everybody is strugglingâ\u0080\u0099: How Olympic athletes are coping with Tokyo 2020 being postponed a year The NBA, who is playing this yearâ\u0080\u0099s NBA Finals in the ESPN Wide World of Sports Complex in Walt Disney World Resort DIS, near Orlando, Fla., has painted the words â\u0080\u009cBlack Lives Matterâ\u0080\u009d on all the the courts. Various players and coaches have engaged in protests throughout their time in the NBA bubble, including kneeling during the national anthem and refusing to play several playoff games in the wake of the shooting of Jacob Blake in Wisconsin. iframe.twitter-tweet { width: 100% !important; } Cuban was quick to call out Cruz for rooting against a business that employs thousands of people in their shared home state of Texas. This is not the first time Cuban and Cruz have feuded on Twitter. Cuban once told Cruz to â\u0080\u009chave some balls for once.â\u0080\u009d"}]}