{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-death-toll-tops-150000-as-florida-california-north-carolina-and-idaho-see-record-one-day-totals-2020-07-30", "published": 1596125540.0, "headline": "Coronavirus update: U.S. death toll tops 150,000 as Florida, California, North Carolina and Idaho set one-day records", "body": "The U.S. counted more than 1,400 deaths from the coronavirus illness COVID-19 on Wednesday, boosting the total to more than 150,000, as Florida, California, North Carolina and Idaho all recorded record single-day totals, in the latest sign the pandemic is far from contained. Just six months since the first cases of COVID-19 were reported from China, the U.S. has 4.4 million confirmed cases, according to data aggregated by Johns Hopkins University, the highest in the world, and the highest death toll at 150,717, roughly a quarter of the 667,744 counted by the Johns Hopkins data. Early hot spot New York and neighboring states have succeeded in getting the spread under control after months of lockdown orders and a slow reopening process. Indoor dining is still not allowed in New York and bars remain closed, except for outdoor, delivery or pick-up service. But the virus has spread across the rest of the country, and is moving fast in the Sunbelt states which reopened early, and picking up pace in the central states. There were more than 68,000 new infections counted on Wednesday, above the average of about 65,000 a day recorded in the last week. Thirty states have seen cases increase over the last 14 days, according to a New York Times tracker. Florida has counted 71,804 new cases in the past week, the tracker shows, equal to 334 per 100,000. Mississippi has seen 8,733 cases in the past week, for a per capita rate of 293 per 100,000 people. Dr. Anthony Fauci, head of the National Institute for Allergies and Infectious Diseases, said states in the Midwest, including Ohio and Indiana, as well as Tennessee and Kentucky, are starting to have a “very early indication” of rising positivity rates, “a surefire sign that you've got to be really careful,” he told ABC Anchor George Stephanopolous earlier this week. Hospitalizations remain high, reaching more than 57,000 on Wednesday, according to the COVID Tracking Project, although they are backing away from the peak of 59,940 set on April 15. But states including Texas are reporting that their health systems are being stretched to capacity and they need more staff. The White House Task Force warned Wednesday that 21 states are currently flashing “code red,” meaning they have each recorded more than 100 new cases per 100,000 people in the last seven days. Dr. Michael Osterholm, epidemiologist at the University of Minnesota and one of the nation’s leading experts, told MarketWatch in an interview that he expects America will be dealing with this virus forever. “Effective and safe vaccines and hopefully ones with some durability will be very important, even critical tools, in fighting it. But the whole world is going to be experiencing COVID-19 ‘til the end of time. We’re not going to be vaccinating our way out of this to eight-plus billion people in the world right now. And if we don’t get durable immunity, we’re potentially looking at revaccination on a routine basis, if we can do that. We’ve really got to come to grips with actually living with this virus, for at least my lifetime, and at the same time, it doesn’t mean we can’t do a lot about it.” Vietnam’s First Coronavirus Cases in Months Highlight Global Challenges What’s the economy saying? There was grim news on the economic front with the latest GDP data showing exactly how much the pandemic has hurt growth, MarketWatch's Jeffry Bartash reported. The economy contracted at a record 32.9% annual pace in the second quarter, underscoring just how big a hole the U.S. finds itself in as it labors to recover from the deepest recession in American history. The damage from the first global pandemic in a century was almost as bad as Wall Street expected. Analysts polled by MarketWatch had forecast a 35% decline in gross domestic product at an annual pace, the official scorecard of the U.S. economy. The economy began to recover in mid-May after a severe contraction at the beginning of the quarter, but the U.S. faces a long road back, analysts say. Millions of Americans are still out of work, thousands of businesses have closed and many of those that remain open have had to scale back operations because of tepid demand or ongoing government restrictions. See also:Consumer confidence wanes in July and points to rockier economic recovery The recent surge in coronavirus cases in about half of U.S. states, especially large ones such as Texas, Florida and California, has also dealt a blow to the economy. Previously, GDP had never shrunk by more than 10% on an annualized basis in any quarter since the government began keeping track shortly after World War II. “The virus is the boss,” said corporate economist Robert Frick of Navy Federal Credit Union. “The longer this goes on, the deeper the damage.” A separate report found the number of Americans applying for jobless benefits rose for the second straight week, a sign economic growth could be stalling in late July. Claims had been on a steady decline after peaking in late March. Initial jobless claims rose by 12,000 to 1.434 million in the week ended July 25, the Labor Department said Thursday. Economists surveyed by MarketWatch had been looking for 1.51 million new claims. A new federal relief program for so-called “gig” workers like Uber drivers, totaled 829,607 last week. See now:New York metropolitan area lost nearly 1.5 million jobs in June, the most of any U.S. city The number of people already collecting economic benefits, known as continuing claims, rose by 867,000 to 17.06 million. These claims are reported with a one-week lag. This is a sign that workers are staying on unemployment longer and rehiring has slowed. It is the first increase in continuing claims since late May.What’s the latest medical news? Johnson & Johnson JNJ, +1.39% said its lead vaccine candidate protected against infection with the coronavirus that causes COVID-19, in preclinical studies. The vaccine provided a robust immune response as demonstrated by “neutralizing antibodies,” successfully preventing subsequent infection and providing complete or near-complete protection in the lungs from the virus in nonhuman primates, the company said. Based on the strength of the data, a Phase 1/2a first-in-human clinical trial of the vaccine candidate, Ad26.COV2.S, in healthy volunteers, has now commenced in the United States and Belgium, the company said. Discussions are under way with partners with the objective to start a pivotal Phase 3 clinical trial of the single vaccine dose versus placebo in September, pending the interim data of the Phase 1 and 2 trials and approval of regulators, Johnson & Johnson said. Meanwhile, Fauci told ABC News on Wednesday that eye protection may be required at some point to help contain the spread of the virus, as MarketWatch’s Nicole Lyn Pesce reported. Fauci explained that the novel coronavirus that causes COVID-19 infects mucosal surfaces — or parts of the body including the eyes, nose and mouth that secrete mucus to stop pathogens and dirt from getting into your body. So “perfect protection” of your mucosal surfaces would include covering every one of them up, he said. “Theoretically you should protect all of the mucosal surfaces, so if you have goggles or an eye shield, you should use it,” he said. His comments weren’t entirely welcomed on social media, where many are already protesting at state and local government mandates on face masks. What are companies saying? Earnings season brought numbers from some household name companies on Thursday, and included the first report from Big Oil, when ConocoPhillips COP, -1.12% posted a wider-than-expected adjusted loss on Thursday, as weak oil prices and slack demand during the pandemic caused it to curtail production. DuPont de Nemours Inc. DD, +0.06% swung to a loss as it booked a $2.5 billion non-cash impairment charge in the company’s transportation and industrial segment, which was hurt by the global slowdown in the automotive industry during stay-at-home orders to contain the pandemic. Kellogg Co. K, +0.96% fared better, buoyed by strong demand for its cereals and frozen foods as consumers ate more at home. “Amid the COVID-19 crisis, demand for packaged foods for at-home consumption remained elevated for longer than anticipated,” the company said in a statement. “This drove higher sales of the company’s products in retail channels, more than offsetting a related decline in foods sold in away-from-home channels.” Underwear maker Hanesbrands Inc. HBI, +1.41% enjoyed a bump after pivoting to making personal protective equipment, such as masks and gowns. And KFC, Taco Bell and Pizza Hut parent Yum Brands Inc. YUM, +0.08% beat sales expectations, while Procter & Gamble Co. PG, +0.89% enjoyed a boost from demand for cleaning products. Four tech giants, Amazon.com Inc. AMZN, +3.01%, Apple Inc. AAPL, +1.74%, Alphabet Inc. GOOGL, +1.82% GOOG, +1.97% and Facebook Inc. FB, +0.26%, will report their earnings after the bell, a day after a bruising grilling at a congressional hearing on antitrust issues in big tech. Read also:Stock buybacks have totaled $5.3 trillion over the past decade — has that contributed to U.S. pandemic failures? Here’s the latest news about companies and COVID-19: • Comcast Corp. CMCSA, -0.99% saw revenue and earnings decline in the second quarter as the company felt the sting of the COVID-19 crisis, but shares rose after the media giant topped expectations on both metrics. Comcast generated $14.4 billion in revenue from its cable business and the company saw record second-quarter customer relationship net additions for that part of the business. Comcast also witnessed its best second quarter for high-speed internet net additions in 13 years. Total customer relationships increased by 217,000 and total high-speed internet net additions came in at 323,000, not including over 600,000 high-risk or free-internet customers that still receive the company’s service. The Peacock service, which launched to Comcast Xfinity subscribers in April and the general public in July, has racked up 10 million sign-ups so far. • ConocoPhillips COP, -1.12% posted weaker-than-expected earnings on Thursday. The company said it had net income of $300 million, or 24 cents a share, down from $1.6 billion, or $1.40 a share, in the year-earlier period. Excluding special items, the company had an adjusted loss per share of 92 cents, wider than the 58 cents loss consensus of FactSet analysts. Special items were mostly a realized gain on the completion of the Australia-West divestiture and an unrealized gain on Cenovus Energy equity. “Headline second-quarter performance was dominated by weak realized prices, coupled with our rational economic action to curtail production in favor of expected higher future prices,” Chief Executive Ryan Lance said in a statement. . • Dunkin’ Brands Group Inc. DNKN, +1.26% reported a second-quarter adjusted profit that fell below expectations, but revenue that fell less than forecast, and said that it was reinstating its dividend program. U.S. Dunkin’ same-store sales dropped 18.7%, as a decline in traffic resulting from the pandemic offset an increase in the average ticket, which was driven by a shift to family-size bulk orders and snacking. Baskin-Robbins U.S. same-store sales fell 6.0%. Separately, Dunkin’ announced a dividend of 40.25 cents a share, payable Sept. 9 to shareholders of record on Sept. 1. • DuPont de Nemours Inc.’s DD, +0.06% net loss widened. “We delivered on our structural cost commitments and generated organic revenue growth in the Electronics & Imaging and Nutrition & Biosciences segments despite significant declines in global economic activity,” Chief Executive Ed Breen said in a statement. “Additionally, we saw continued strength in Tyvek (R) protective garment and water end markets, achieving double digit revenue growth for the second consecutive quarter.” The company is expecting third-quarter adjusted EPS of 71 cents to 73 cents, compared with a FactSet consensus of 71 cents. • Eli Lilly & Co. LLY, +2.20% beat profit expectations and raised its full-year outlook, while revenue fell shy. The estimated negative impact of the pandemic on revenue was about $500 million, including $250 million from decreased customer buying and $250 million from delayed new patient prescription trends. Among Lilly’s biggest selling drugs, Trulicity revenue rose 20% to $1.23 billion to match the FactSet consensus, while Humalog revenue fell 18% to $555.1 million to miss expectations of $610.5 million. For 2020, Lilly raised its adjusted EPS guidance range to $7.20 to $7.40 from $6.70 to $6.90, while the FactSet consensus was $6.84. • Hanesbrands Inc. reported a surprise second-quarter profit and a big sales beat, resulting from its ability to pivot to producing face masks and medical gowns amid the pandemic and a 68% jump in online sales. Sales fell 1.3% to $1.74 billion, but were above the FactSet consensus of $1.17 billion, boosted by $752 million in sales of personal protective garments. The company expects to sell more than $150 million of protective garments in the second half of 2020, excluding the potential for additional government contracts. • Hologic Inc. HOLX, +1.61%, the medical technology company, reported fiscal third-quarter earnings that beat Wall Street expectations. “Strong demand for our COVID tests and the ongoing recovery of our other divisions are enabling us to provide guidance for the fourth quarter of fiscal 2020,” Chief Financial Officer Karleen Oberton said in a statement. Because the business environment remains “unpredictable,” however, the company provided wider guidance ranges than usual, Oberton said. Hologic guided for sales between $925 million and $1.025 billion for the fiscal fourth quarter, and adjusted EPS between 95 cents and $1.15. • Molson Coors Beverage Co. TAP, -1.87% trounced estimates for its second quarter despite the disruption caused by the pandemic. “As expected, we experienced a significant adverse volume impact in the second quarter of 2020 resulting from the closure of the on-premise channel in nearly all of our markets for most of the quarter,” the company said. “Specifically, for the second quarter of 2020, we estimate that nearly all of our consolidated net sales resulted from off-premise consumption.” The shift to off-premise and certain packaging, strained the company’s supply chain and package availability, particularly with aluminum can demand and other packaging materials, said the statement. The company isn’t offering guidance, given the uncertainty created by the pandemic although it cautioned that it expects operations to continue to be disrupted in the rest of fiscal 2020 and possibly beyond. • Northrop Grumman Corp. NOC, -1.37% posted better-than-expected earnings for the second quarter, as profit and sales rose during the pandemic, and the company raised its full-year guidance. Sales at the company’s aeronautics systems division rose 7% to $2.925 billion; sales at defense systems fell 2% to $1.886 billion; mission systems sales rose 2% to $2.446 billion; and space systems sales rose 15% to $2.048 billion. The company ended the quarter with a backlog of $70 billion. Looking ahead, Northrop is now expecting full-year sales to range from $35.3 billion to $35.6 billion, up from its April guidance of 35.0 billion to $35.4 billion. It expects free cash flow to range from $3.150 billion to $3.550 billion, up from prior guidance of $3.150 billion to $3.450 billion. • PayPal Holdings Inc. PYPL, +2.18% topped earnings and revenue expectations amid booming growth in online transactions. PayPal’s total payment volume, or the value of transactions flowing through the PayPal platform, rose to $222 billion from $172 billion, while analysts were looking for $210 billion. The company also saw about $37 billion in Venmo payment volume. Overall, PayPal added 21.3 million net new active accounts in the period. The company had more than 60 million active Venmo accounts as of the second quarter, which the company defines as accounts that have completed a transaction within a 12-month span. For the third quarter, PayPal expects 30% growth in total payment volume, 25% growth in revenue on a currency-neutral basis, and 25% growth in adjusted earnings per share. • Procter & Gamble Co. PG, +0.89% reported fiscal fourth-quarter profit and revenue that beat expectations and provided an upbeat outlook, amid increased demand for household cleaning and personal health products during the pandemic. Sales rose 4% to $17.70 billion, above the FactSet consensus of $16.95 billion, as volumes grew 3% and prices rose 2%. For fiscal 2021, P&G expects core EPS growth of 3% to 7% from 2020 core EPS of $5.12, while the current FactSet EPS consensus of $5.23 implies 2.1% growth. • Tyson Foods Inc. TSN, -1.71% plans to add 200 nurses and administrative support staff, to the current more than 400 people working in the food company’s health services team. The new hirings come as Tyson launched a new COVID-19 monitoring program, which includes the creation of a new chief medical officer position. The new program involves weekly testing of employees at its facilities, including some who have no symptoms. “What we’re adopting is a strategic, ongoing approach to combating COVID-19,” said Chief Administrative Officer Donnie King. • United Parcel Service Inc. UPS, +0.27% reported second-quarter profit at revenue that were well above expectations, amid a surge in residential demand and health care shipments that emerged from the pandemic. Domestic package revenue grew 17.3% to $13.07 billion to top expectations of $11.15 billion. In the U.S., average daily volume rose 22.8%, while demand for residential delivery soared, with business-to-consumer shipments increasing 65.2%. • Yum Brands Inc. reported second-quarter sales that fell less than forecast, with sales improving as the quarter progressed as restaurants reopened and as digital sales reached record highs during the pandemic. The results included a 21-cents per share benefit related to the change in fair value of the investment in Grubhub. KFC same-store sales fell 21%, in line with the FactSet consensus; Pizza Hut same-store sales declined 9%, compared with expectations of an 8.2% decline; and Taco Bell same-store sales fell 8% versus expectations of a 10.7% drop. Habit Burger Grill same-store sales fell 18%. • Yum China Holdings Inc. YUMC, +0.50% said a resurgence of COVID-19 cases in some areas of China hobbled its second-quarter results. Yum, which operates KFC, Pizza Hut and other brands in China said that more than 99% of its stores in the country are open, but sales and profits are trending “unevenly.” Moreover, sales improved in April and May but softened again in June. “Sales were primarily impacted by significantly reduced traffic at transportation and tourist locations, delayed and shortened school holidays and resurging regional infections,” Yum China said."}]}