{"article": [{"url": "https://www.marketwatch.com/story/the-unemployment-rate-has-gone-down-but-fewer-americans-expect-to-return-to-their-old-jobs-11601929685", "published": 1601975720.0, "headline": "The unemployment rate has gone down, but fewer Americans expect to return to their old jobs", "body": "United Airlines recently announced plans to furlough more than16,000 workers including pilots, flight attendants and technicians. (Photo by Justin Sullivan/Getty Images) Justin Sullivan/Getty Images In most previous U.S. recessions, it was rare that the share of unemployed Americans who were waiting to be called back to their prior jobs exceeded the share without any job. But for the majority of the pandemic thus far, that has been the case, according to a study by Robert Hall, a Stanford University economics professor, and Marianna Kudlyak, a research adviser at the Federal Reserve Bank of San Francisco. Being furloughed, as millions of Americans have been during the pandemic-induced economic downturn, means effectively that your job still exists and your employer may rehire you once business conditions improve. People who don’t fall into that category are unemployed without a job to potentially return to. The state of waiting to be called back to work is known as “recall-unemployment.” It tends to be a temporary form of unemployment, and “dissipates much more quickly [than jobless-unemployment],” Hall and Kudlyak wrote in their paper distributed by the National Bureau of Economic Research. Don’t miss: U.S. unemployment rate falls to pandemic low of 7.9%, but that’s not the whole story In April, the recall-unemployment rate was 11.5%, the researchers calculated, using data collected by the Bureau of Labor Statistics and the U.S. Census Bureau in its monthly Current Population Survey. (The CPS is used to calculate the overall unemployment rate each month.) Meanwhile, the jobless-unemployment rate hovered at 3.2%, just 0.2 percentage points higher than in February 2020. “ ‘The overall picture of the labor market, considering the shock that occurred in March and April, is somewhat better than forecasts that were made earlier in the pandemic period’ ” — Robert Hall, economics professor at Stanford University But in August the trend started to reverse course. As millions of Americans were called back to work, the overall unemployment and recall-unemployment rates declined, while the jobless-unemployment rate increased. That’s a sign that it will take longer for some unemployed Americans to be reemployed, and that they could ultimately experience extended periods of unemployment. Source: \"Unemployed With Jobs and Without Jobs\" by Robert Hall and Marianna Kudlyak In September, the recall-unemployment rate declined to 2.9% and the jobless-unemployment rate rose to 5%. Meanwhile, the overall unemployment rate fell to 7.9% from 8.4% the month prior and 14.7% in April. Related: Disney to lay off 28,000 workers, exec says California ‘exacerbated’ pandemic’s effects “One obvious potential reason for this phenomenon is that employers are becoming less optimistic and are canceling advice they give to their idle workers about the prospects for recall,” Hall and Kudlyak wrote. “A related possibility is that individuals previously expecting recall have abandoned that hope and are actively looking for new jobs.” But given that the overall unemployment rate has come down much more quickly than in past recessions the U.S. has experienced, Hall and Kudlyak conclude that “the market for job-seekers is reasonably favorable.” “Of course, any increase in unemployment is unfortunate,” Hall told MarketWatch in an email, “but the overall picture of the labor market, considering the shock that occurred in March and April, is somewhat better than forecasts that were made earlier in the pandemic period.”"}]}