{"article": [{"url": "https://www.marketwatch.com/story/1-in-5-americans-say-theyre-more-likely-to-wear-masks-and-practice-social-distancing-after-trumps-covid-19-diagnosis-11602008210", "published": 1602062480.0, "headline": "1 in 5 Americans say theyâ\u0080\u0099re more likely to wear masks and practice social distancing after Trumpâ\u0080\u0099s COVID-19 diagnosis", "body": "President Trump returned to the White House Monday evening after spending three nights at Walter Reed National Military Medical Center. Nicholas Kamm/Agence France-Presse/Getty Images President Trumpâ\u0080\u0099s COVID-19 diagnosis may have inspired some Americans to take stronger protective measures against the disease, but many still donâ\u0080\u0099t trust the commander-in-chief as a reliable source of information about the pandemic, a new survey suggests. Twenty-one percent of respondents to the latest wave of the Axios/Ipsos Coronavirus Index said the news of Trump testing positive for the coronavirus had made them more likely to wear a mask, including 15% who said it made them â\u0080\u009cmuch more likelyâ\u0080\u009d to do so. All told, 88% reported wearing a mask â\u0080\u009cat all timesâ\u0080\u009d or â\u0080\u009csometimesâ\u0080\u009d when leaving their home. Another 21% said the news of Trumpâ\u0080\u0099s diagnosis had made them more likely to maintain a distance of at least six feet from other people, including 14% who indicated they were â\u0080\u009cmuch more likely.â\u0080\u009d Overall, 89% said they practiced social distancing â\u0080\u009cat all timesâ\u0080\u009d or â\u0080\u009csometimesâ\u0080\u009d when leaving their home. Asked how much trust they had in the president to provide them with accurate coronavirus information, 70% of respondents said â\u0080\u009cnone at allâ\u0080\u009d (54%) or â\u0080\u009cnot very muchâ\u0080\u009d (16%). Six in 10 said there was no change in how likely they were to trust the president to provide accurate information about COVID-19 amid news of his diagnosis; another 23% said the news made them less likely to trust him, and 17% said it made them more likely to trust him. The nationally representative survey of 1,004 U.S. adults was conducted Oct. 1 to Oct. 5. Trump tweeted his diagnosis in the early morning of Oct. 2. Questions about Trumpâ\u0080\u0099s COVID-19 diagnosis were added one day after the survey began, according to Ipsos, and included responses from 405 participants. Trump, who was hospitalized for three days at Walter Reed National Military Medical Center, returned to the White House on Monday evening. His physician, Navy Cmdr. Sean Conley, said during a briefing earlier Monday that the president had â\u0080\u009ccontinued to improveâ\u0080\u009d but wasnâ\u0080\u0099t yet â\u0080\u009cout of the woods.â\u0080\u009d Conley declined to answer certain questions, including ones about the presidentâ\u0080\u0099s lung scans and the date of his most recent negative coronavirus test. The president, who has given mixed messages on mask-wearing throughout the pandemic and often declined to wear one in public, removed his mask before entering the White House upon his return from the hospital. â\u0080\u009cFeeling really good! Donâ\u0080\u0099t be afraid of Covid. Donâ\u0080\u0099t let it dominate your life,â\u0080\u009d Trump tweeted prior to his hospital discharge. â\u0080\u009cWe have developed, under the Trump Administration, some really great drugs & knowledge. I feel better than I did 20 years ago!â\u0080\u009d A number of other people in Trumpâ\u0080\u0099s inner circle and top Republicans have also announced they tested positive for COVID-19 in recent days, including First Lady Melania Trump, former counselor to the president Kellyanne Conway, White House press secretary Kayleigh McEnany, former New Jersey Gov. Chris Christie, Sen. Mike Lee of Utah and Sen. Thom Tillis of North Carolina.Â Many were present at an outdoor ceremony and/or indoor reception held at the White House Sept. 26 to celebrate the nomination of Judge Amy Coney Barrett to the Supreme Court. Photos from the day show that masks and social distancing were scarce. Reports indicate the White House has relied on rapid tests in lieu of other protocols recommended by public-health experts. The White House is opting not to conduct contact tracing of guests and staff present at the Barrett event, the New York Times reported, citing a White House official familiar with the plans. Officials will instead notify those who came into close contact with Trump during the two days before he tested positive Thursday evening, according to the Times. Democratic presidential nominee Joe Biden, for his part, has taken a more stringent approach to masking and social distancing at his public appearances. â\u0080\u009cFolks, we can save nearly 100,000 lives by the end of the year if everyone wears a mask in public,â\u0080\u009d the former vice president tweeted Tuesday. â\u0080\u009cDo your part. Protect your neighbors. Wear a mask.â\u0080\u009d"}]}