{"article": [{"url": "https://www.marketwatch.com/story/sp-500-adds-three-companies-not-named-tesla-sending-car-companys-shares-down-2020-09-04", "published": 1599555560.0, "headline": "S&P 500 adds three companies not named Tesla â\u0080\u0094 â\u0080\u0098a bit of a shocker,â\u0080\u0099 analyst says", "body": "Three new names will be added to the S&P 500 index this month, but none of them are Tesla Inc. S&P Dow Jones Indices announced Friday afternoon that it will add three companies to the S&P 500 SPX, +0.87% Â â\u0080\u0094 Catalent Inc. CTLT, +1.90% Â , Etsy Inc. ETSY, +5.11% Â and Teradyne Inc. TER, +4.38% Tesla Inc. TSLA, +1.89% Â was thought to be in line for the addition after announcing a fourth consecutive quarter of profitability, a requirement of the index, which many observers cited as a reason for a gigantic increase in the electric-car companyâ\u0080\u0099s stock in recent weeks. â\u0080\u009cS&P 500 inclusion now likely a done deal,â\u0080\u009d Wedbush analyst Dan Ives said after Tesla reported a profitable quarter in July. When reached Friday, Ives said, â\u0080\u009cThe Champagne was on ice to get into the S&P 500, [it] was baked into shares.â\u0080\u009d â\u0080\u009cThis was a bit of a shocker and the Street assumed this was a foregone conclusion,â\u0080\u009d Ives said in an email to MarketWatch. â\u0080\u009cTesla not getting into the S&P 500 club is a head scratcher and the stock will likely be down for the indexing implications.â\u0080\u009d Ives reiterated his neutral rating on Tesla shares in a note later Friday. Only 22% of sell-side analysts tracked by FactSet consider Tesla a â\u0080\u009cbuyâ\u0080\u009d as of Friday afternoon, which was actually an increase from earlier in the week, but still well lower than other stocks in the S&P 500 index. Tesla stock has added more than 31% since announcing second-quarter earnings on the afternoon of July 22, though that performance has declined this week â\u0080\u0094 at the end of Mondayâ\u0080\u0099s trading session, the stock had gained 56% since earnings. Shares have suffered this week in the wake of a stock split, the announcement of a plan to sell up to $5 billion in fresh shares, and insider selling. Overall, the electric-car companyâ\u0080\u0099s shares have still quintupled this year, pushing its market capitalization to $380 billion as of Fridayâ\u0080\u0099s closing bell. Three previous members of the S&P Midcap 400 will move up to the larger index instead, replacing three other companies that moved down to the midcap index, H&R Block Inc. HRB, -1.80% Â , Coty Inc. COTY, -5.08% Â and Kohlâ\u0080\u0099s Corp. KSS, -1.64% Â The changes will take effect before the open of trading on Sept. 21. Tesla stock fell more than 6% in after-hours trading following the announcement. Catalent shares rose nearly 3%, Etsy shares added more than 5%, and Teradyne stock increased more than 2%."}]}