{"article": [{"url": "https://www.marketwatch.com/story/more-and-more-americans-dont-want-trump-fully-reopening-schools-yet-2020-08-12", "published": 1597242200.0, "headline": "More and more Americans donâ\u0080\u0099t want Trump fully reopening schools yet", "body": "Most Americans arenâ\u0080\u0099t ready for in-person schooling at the beginning of this academic year â\u0080\u0094 and their numbers are going up. The latest Politico/Morning Consult poll of almost 2,000 registered voters finds that 59% oppose the Trump administrationâ\u0080\u0099s call to fully reopen K-12 schools, which is up 6 percentage points from the 53% who were against this just last month. Whatâ\u0080\u0099s more, 56% of those surveyed said they donâ\u0080\u0099t want day-care centers to fully reopen just yet, which is up from 53% in July. As for higher education, 57% of respondents said they opposed reopening colleges and universities with in-person classes for the fall semester, which is up from 50% last month. Senate Republicans have proposed given tens of billions of dollars to schools that reopen during the coronavirus pandemic, arguing that these learning centers will need more funding than those that stay closed. And in July, President Trump threatened federal funding for schools, writing â\u0080\u009cMay cut off funding if not open!â\u0080\u009d in a Twitter TWTR, -0.23% Â post. iframe.twitter-tweet { width: 100% !important; } But most voters across the political spectrum feel that funding shouldnâ\u0080\u0099t change, according to the Politico report, with 42% of Democrats and 45% of Republicans in the survey saying the allocations should remain as is. (Almost one in four Republicans did say that federal dollars should be decreased for those schools that stay closed, however.) Related:Inside the struggle to close the education equality gap exacerbated by COVID-19 Trump and Education Secretary Betsy DeVos have continued to call for reopening schools, even as the number of confirmed cases of COVID-19 in the U.S. has topped 5.15 million, and Florida and Georgia have recorded record one-day death tolls. And while many schools in rural and suburban Georgia, Tennessee and Mississippi already reopened in early August, some have now been forced to close again as students and teachers have tested positive for COVID-19,Â as the New York Times reported. One school in Georgiaâ\u0080\u0099s Cherokee County has ordered more than 900 students and staff to quarantine after 59 people tested positive. A Georgia middle school also went viral after reopening last week when some students posted pictures of packed hallways, with many kids not wearing masks. Two students involved with sharing the posts online were suspended. The public outcry over their suspensions led the school to reverse course before it temporarily closed after several people tested positive for the virus. While health experts had hoped that kids were being spared by the coronavirus early in the pandemic, thereâ\u0080\u0099s growing evidence that they not only get infected, but they may potentially spread the virus even more than adults. About 97,000 kids tested positive for the coronavirus in just two weeks in July â\u0080\u0094 marking a 40% increase in the number of American kids testing positive between July 16 and July 30 alone. And a small study of 47 COVID-19 infected children under age 11 in Germany found that even asymptotic kids had viral loads on par with those of adults, if not more, while a Chicago study also found evidence that young children under 5 carry 10 to 100 times more COVID-19 genetic material in their noses than other age groups. Follow MarketWatchâ\u0080\u0099s coronavirus coverage here."}]}