{"article": [{"url": "https://www.marketwatch.com/story/they-spy-on-us-trump-imposes-new-round-of-restrictions-on-huawei-2020-08-17", "published": 1597662860.0, "headline": "'They spy on us' - Trump imposes new round of restrictions on Huawei", "body": "WASHINGTON (AP) - The U.S. is imposing another round of restrictions on China's Huawei as President Donald Trump renewed accusations that the company's telecommunications equipment is used for spying. \"We don't want their equipment in the United States because they spy on us,\" Trump told Fox on Monday. \"And any country that uses it, we're not going to do anything in terms of sharing intelligence.\" The Commerce Department's new rules, rolled out Monday, will further block Huawei from accessing chip technology. A Huawei executive said this month that the company was running out of processor chips to make smartphones due to U.S. sanctions and that it might be forced to stop production of its own advanced chips. Huawei has been at the center of rising U.S.-Chinese tensions over technology and security. The standoff has now enveloped the popular Chinese-owned video app TikTok and China-based messaging service WeChat, both of which are under the threat of a ban in the U.S. starting in September. Huawei has repeatedly denied accusations it might facilitate Chinese spying. Chinese officials have accused Washington of using national security as an excuse to stop a competitor to U.S. tech industries. U.S. Commerce Secretary Wilbur Ross told Fox Business on Monday that the new action is enforcement-focused and not \"directly related to the trade talks\" between the U.S. and China. Washington cut off Huawei's access to U.S. components and technology, including Google's music and other smartphone services, last year. Those penalties were tightened in May when the White House barred vendors worldwide from using U.S. technology to produce components for Huawei. The Commerce Department said Monday that it's tightening restrictions because Huawei has \"continuously tried to evade\" them. The new rule is designed to block Huawei's access to commercially available chips made with tools acquired from the U.S. The U.S. also added 38 Huawei affiliates to an existing list of companies banned from receiving some sensitive technologies. And it ended an exemption that had allowed some Huawei customers in the U.S. to keep using its equipment and software."}]}