{"article": [{"url": "https://www.marketwatch.com/story/existing-home-sales-drop-in-may-but-signs-point-to-a-big-rebound-in-the-real-estate-market-this-summer-2020-06-22", "published": 1592822720.0, "headline": "Existing-home sales drop in May, but signs point to a big rebound in the real-estate market this summer", "body": "The numbers: Sales of previously owned homes slid 9.7% in May as the coronavirus pandemic continued to weigh on the U.S. real-estate market. Existing-home sales occurred at a seasonally adjusted annual pace of 3.91 million, the National Association of Realtors reported Monday. It was the lowest level for existing-home sales since July 2010. Compared with last year, sales were down 26.6% in May. “Home sales will surely rise in the upcoming months with the economy reopening, and could even surpass one-year-ago figures in the second half of the year,” Lawrence Yun, chief economist for the National Association of Realtors, said in the report. What happened: On a regional basis, sales fell most notably in the Northeast, where they were down 13%. Every region saw a decrease in sales last month. There was a 4.8-month supply of homes for sale in May, down from a 4-month supply in April. Typically, a 6-month supply of homes is considered indicative of a balanced market. Compared to a year ago, though, housing inventory was down 19%. Additionally, the median existing-home price last month was $284,600, up 2.3% from May 2019. The big picture: The continued downturn in home sales in May was widely expected, given that the pending home sales report for April represented the largest decline since the National Association of Realtors began tracking the data in 2001. The pending-home-sales report reflect real-estate transactions where a contract was signed but the sale had not yet closed, and it is considered to be a barometer for future existing-home-sales reports. The existing-home-sales report, meanwhile, measures transaction closings. Read more:Mortgage rates drop to another record low — here’s why Americans may not want to wait too much longer before locking rates in Consequently, the downturn in pending home sales in March and April served as a warning that May’s existing home sales numbers would be down considerably. “The report will probably not show significant improvement until June data are reported in July,” TD Securities wrote in a research note. May’s report aside, most signs point toward a rebound in the housing market following the downturn caused by the coronavirus pandemic. The number of applications for mortgages to purchase homes reached an 11-year high last week, and purchase mortgage application activity overall has fully rebounded from its coronavirus-related dip. Pending sales activity has continued to rise as summer has rolled in, with many economists arguing that most people who wanted to buy a home simply delayed their purchase because of the coronavirus rather than forgoing it entirely. But not all parts of the country will necessarily see the same rebound. Research from Realtor.com shows that demand for homes may be much higher in the suburbs and rural areas than in cities, based on the number of views that online listings for homes in the suburbs have been getting. And the downturn in the supply of homes for sale could prove problematic for buyers. Simply put, if there aren’t many homes to buy, sales activity will be constrained. What they’re saying: “Any disappointment should be fleeting; this is old news, and the leading indicators for home sales are soaring,” Ian Shepherdson, chief economist at Pantheon Macroeconomics, said in a research note. “The summer will be strong.” Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and the S&P 500 SPX, +0.87% were both up slightly in Monday morning trading despite the downturn in May existing home sales. The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% was down slightly, however."}]}