{"article": [{"url": "https://www.marketwatch.com/story/white-houses-meadows-says-he-accepts-that-kamala-harris-is-eligible-for-vp-2020-08-16", "published": 1597596920.0, "headline": "White Houseâ\u0080\u0099s Meadows says he accepts that Kamala Harris is eligible for VP", "body": "WASHINGTON â\u0080\u0094 White House chief of staff Mark Meadows said Sunday he accepts that Sen. Kamala Harris is eligible to serve as vice president, rejecting a false and racist conspiracy theory that President Donald Trump had promoted. â\u0080\u009cSure,â\u0080\u009d said Meadows, when asked on CNNâ\u0080\u0099s â\u0080\u009cState of the Unionâ\u0080\u009d whether he acknowledges the fact that she meets the constitutional requirements to be president or vice president. â\u0080\u009cAnd I think the president spoke to this yesterday. This is not something that weâ\u0080\u0099re going to pursue.â\u0080\u009d Trump twice this past week declined to say whether he believed she met the requirements when asked about social media claims that the California senator and former presidential candidate couldnâ\u0080\u0099t serve in the White House because her parents were immigrants to the United States. Trump initially said Thursday that he had just heard the claim and had â\u0080\u009cno idea if thatâ\u0080\u0099s right,â\u0080\u009d but that the charge was serious and he would look into it. Pressed again Saturday to accept her eligibility, Trump demurred, saying at a news conference at his New Jersey golf club that it didnâ\u0080\u0099t bother him but he had â\u0080\u009cnot got into it in great detail.â\u0080\u009d Harris is without question eligible for the office. Harris, 55, was born in Oakland, Calif., making her a natural-born U.S. citizen and eligible to be president if Joe Biden were unable to serve a full term. Her father, an economist from Jamaica, and her mother, a cancer researcher from India, met at the University of California, Berkeley, as graduate students. The Constitution requires a vice president to meet the eligibility requirements to be president. That includes being a natural-born U.S. citizen, at least 35 years old and a resident in the U.S. for at least 14 years â\u0080\u0094 all criteria that Harris fulfills. When asked about Trumpâ\u0080\u0099s promotion of the conspiracy theory about her, Harris said in an interview released Sunday that she and Biden fully expect Trump and his campaign to engage in â\u0080\u009cliesâ\u0080\u009d and â\u0080\u009cdeceptionâ\u0080\u009d in a bid to beat Democrats in the Nov. 3 election. â\u0080\u009cTheyâ\u0080\u0099re going to engage in an attempt to distract from the real issues that are impacting the American people,â\u0080\u009d she told TheGrio. â\u0080\u009cAnd I expect that they will engage in dirty tactics. And this is going to be a knockdown, drag-out. And weâ\u0080\u0099re ready.â\u0080\u009d Harris is the first Black woman and Asian American to compete on a major partyâ\u0080\u0099s presidential ticket. Trump in past years indulged in the false conspiracy theory that President Barack Obama was born abroad. Only after mounting pressure during his 2016 campaign did Trump disavow the claims. Jason Miller, a Trump campaign adviser, said Sunday on ABCâ\u0080\u0099s â\u0080\u009cThis Weekâ\u0080\u009d that the campaign would not be promoting the conspiracy theory. â\u0080\u009cThis is something that the media brings up to him in his press conferences or interview formats,â\u0080\u009d he said. â\u0080\u009cItâ\u0080\u0099s not something that anyone in our campaign is talking about.â\u0080\u009d â\u0080\u009cItâ\u0080\u0099s case closed. End of story.â\u0080\u009d"}]}