{"article": [{"url": "https://www.marketwatch.com/story/harley-davidson-swings-to-q2-loss-plans-overhaul-of-operating-model-with-new-5-year-plan-2020-07-28", "published": 1595926460.0, "headline": "Harley-Davidson swings to Q2 loss, plans overhaul of operating model with new 5-year plan", "body": "Harley-Davidson Inc. shares HOG, -3.31% slid 2.9% premarket Tuesday, after the iconic motorcycle company swung to a loss in the second quarter and unveiled an overhaul of its business that will see it exit certain markets and streamline its product line. Milwaukee-based Harley swung to a loss of $92 million, or 60 cents a share, in the quarter, after a profit of $196 million, or $1.23 a share, in the year-earlier period. Its adjusted loss per share came to 35 cents, short of the FactSet consensus for earnings of 11 cents a share. Revenue fell 47% to $865 million from $1.633 billion, ahead of the $761 million FactSet consensus. U.S. motorcycle sales fell 27% to $31.3 million, EMEA sales fell 30% to $11 million and Asia Pacific sales were down 10% to $6.9 million. The company is not offering guidance, given the uncertainty created by the pandemic. Harley is planning a 'Rewire' restructuring of its global operating model, that will impact all areas of the business from commercial operations to center-led support functions. That process will build to a new five-year plan, to be called 'Hardwire.' \"Building on our strong brand legacy, we are reinvigorating our core profit driving business -- powered by our strongest dealers, most exciting products and careful inventory management, while focusing on the most important opportunities for future expansion,\" Chief Executive Jochen Zeitz said in a statement. The plan includes 700 job cuts that were previously announced and a streamlining of motorbike models by about 30%. The company will focus on about 50 markets in North America, Europe and Asia Pacific that currently account for most of its volume and growth potential. The company is planning a marketing campaign featuring \"Aquaman\" actor Jason Momoa. The company expects too save $250 million in cash in 2020 and to book a $42 million restructuring charge. Shares have fallen 21% in the year to date, while the S&P 500 SPX, +0.87% has gained 0.3%."}]}