{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-antibodies-do-not-fade-quickly-new-study-finds-2020-09-01", "published": 1598983520.0, "headline": "Coronavirus antibodies do not fade quickly, new study finds", "body": "Antibodies that people make to fight the new coronavirus last for at least four months after diagnosis and do not fade quickly as some earlier reports suggested, scientists have found. Tuesday’s report, from tests on more than 30,000 people in Iceland, is the most extensive work yet on the immune system’s response to the virus over time, and is good news for efforts to develop vaccines. If a vaccine can spur production of long-lasting antibodies as natural infection seems to do, it gives hope that “immunity to this unpredictable and highly contagious virus may not be fleeting,” scientists from Harvard University and the U.S. National Institutes of Health wrote in a commentary published with the study in the New England Journal of Medicine. One of the big mysteries of the pandemic is whether having had the coronavirus helps protect against future infection, and for how long. Some smaller studies previously suggested that antibodies may disappear quickly and that some people with few or no symptoms may not make many at all. The new study was done by Reykjavik-based deCODE Genetics, a subsidiary of the U.S. biotech company Amgen AMGN, -1.41% , with several hospitals, universities and health officials in Iceland. The country tested 15% of its population since late February, when its first COVID-19 cases were detected, giving a solid base for comparisons. Scientists used two different types of coronavirus testing: the kind from nose swabs or other samples that detects bits of the virus, indicating infection, and tests that measure antibodies in the blood, which can show whether someone was infected now or in the past. Blood samples were analyzed from 30,576 people using various methods, and someone was counted as a case if at least two of the antibody tests were positive. These included a range of people, from those without symptoms to people hospitalized with signs of COVID-19. In a subgroup who tested positive, further testing found that antibodies rose for two months after their infection initially was diagnosed and then plateaued and remained stable for four months. Previous studies suggesting antibodies faded quickly may have been just looking at the first wave of antibodies the immune system makes in response to infection; those studies mostly looked 28 days after diagnosis. A second wave of antibodies forms after a month or two into infection, and this seems more stable and long-lasting, the researchers report. The results don’t necessarily mean that all countries’ populations will be the same, or that every person has this sort of response. Other scientists recently documented at least two cases where people seem to have been reinfected with the coronavirus months after their first bout. The new study also found: — Testing through the bits-of-virus method that’s commonly done in community settings missed nearly half of people who were found to have had the virus by blood antibody testing. That means the blood tests are far more reliable and better for tracking spread of the disease in a region and for guiding decisions and returning to work or school, researchers say. — Nearly a third of infections were in people who reported no symptoms. — Nearly 1% of Iceland’s population was infected in this first wave of the pandemic, meaning the other 99% are still vulnerable to the virus. — The infection fatality rate was 0.3%. That’s about three times the fatality rate of seasonal flu and in keeping with some other more recent estimates, said Dr. Derek Angus, critical care chief at the University of Pittsburgh Medical Center. Although many studies have been reporting death rates based on specific groups such as hospitalized patients, the rate of death among all infected with the coronavirus has been unknown. The news that natural antibodies don’t quickly disappear “will be encouraging for people working on vaccines,” Angus said."}]}