{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-edge-lower-from-2-month-high-amid-feds-policy-framework-shift-2020-08-28", "published": 1598633600.0, "headline": "Long-dated Treasury yields stabilize near 2-month high after Powell articulates Fed's new framework", "body": "U.S. long-term Treasury yields slipped Friday as investors processed data on the health of the economy in the aftermath of the Federal Reserve's historic shift in its monetary policy framework a day earlier. On Thursday, Fed Chairman Jerome Powell said the central bank would aim for an average annual inflation rate of 2%, shifting longstanding policy that are likely to have lasting impacts on financial asset prices. How did Treasurys perform? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 1.7 basis points to 0.727%, while the 30-year bond yield TMUBMUSD30Y, 1.576%  pulled back 0.9 basis point to 1.508%, after the long bonds on Thursday notched their highest yields since mid-June, according to Dow Jones Market Data. The shorter 2-year note rate TMUBMUSD02Y, 0.156%, meanwhile, retreated 2.3 basis points to 0.135% on Friday. Bond prices move inversely to yields. For the week, the 2-year note shed 1 basis point, enough for its sharpest weekly fall in about a month, the 10-year yield rose 8.8 basis points, while the 30-year rate tacked on 15.5 basis points. What drove Treasurys? Fixed-income markets were parsing the Fed's decision on Thursday to alter its policy framework by aiming for a yearly average inflation rate of 2%. in contrast with the past policy of pre-emptively raising rates when inflation neared 2%. The Fed's new policy thinking also allows the labor market to strengthen, with unemployment lower for longer periods without it raising alarms by policy makers. Need to Know:The Fed might never hike rates again. Here are growth stocks for the long run, according to one strategist On Friday, investors digested a batch of economic reports. Data showed U.S. personal income rose 0.4% in July, while consumer spending was up 1.9%. Economists surveyed by MarketWatch had expected income to fall another 0.4% after a 1.1% drop in June. Spending was expected to show a 1.6% rise after a 5.6% increase in June. Spending on durable goods was up 12.2%, while spending on services was down 9.3% for a net shortfall of 4.6% in total consumer demand, said Aneta Markowska, chief financial economist at Jefferies, adding that the variation in spending patterns explains \"part of the disconnect between the stock market and the economy, since the former has much less exposure to the service sector than the latter.\" Meanwhile, the final reading of the University of Michigan's August consumer sentiment index came in at 74.1 versus a preliminary reading of 72.8 and up from 72.5 in July. The data come as Fed officials on Friday offered a measured outlook for the U.S. economy, which is still wrestling with the COVID-19 pandemic. \"I do believe that the recovery is likely to be a slow one,\" said Cleveland Fed President Loretta Mester, in an interview on CNBC. In at later interview on the business network, Philadelphia Fed President Patrick Harker said he thought job growth and consumer spending were moving sideways in August. \"It will take a while for the employment situation to heal,\" he said. Harker and Mester are voting members on the Fed's interest-rate committee this year. Separately, market participants were watching news that Prime Minister Shinzo Abe would resign due to illness. Abe, whose term ends in September 2021, is expected to remain in office until a new party leader is elected and formally approved by parliament. Read:Who will replace Shinzo Abe? 5 things investors need to know about the resignation of Japan's prime minister The Japanese 10-year government bond TMBMKJP-10Y, 0.034%, or JGB, was trading with a yield of 0.059%. Japanese shares fell sharply, leaving the Nikkei 225 Index NIK, -0.11%  down 1.4%. What did market participants say? \"Powell characterized permissible overshoots as moderate (which is to say not large) and for some time (which is to say not permanent), but he emphasized that it was important for people to 'understand that this is not a formulaic approach [â\u0080¦] the Committee will continue to consider all of the things that it typically considers in making monetary policy, but we'll aspire to have inflation run above 2% after periods in which it runs for an extended period below 2%',\" wrote Morgan Stanley analysts in a research report published on Friday. \"For every dollar invested in the broad US equity market, companies are earning 4.4%. Every dollar invested in a 10-year US Treasury rate yields roughly 0.5%. Seen through that lens, it's hard to make the case that equities aren't attractive. Low interest rates tend to be supportive for equity multiples, as they inflate the value of future cash flow and tend to push equity market multiples higher,\" wrote Invesco Global Market strategists Brian Levitt and Talley Leger in a Friday research note."}]}