{"article": [{"url": "https://www.marketwatch.com/story/my-daughter-wont-speak-to-me-her-therapist-said-were-a-toxic-family-should-i-stop-paying-her-college-tuition-to-force-her-into-family-counseling-2020-09-28", "published": 1601400920.0, "headline": "My daughter won't speak to me. Her therapist said we're a toxic family. Should I stop paying her college tuition to force her into family counseling?", "body": "Dear Moneyist, I am the mother of a college freshman who is distancing herself from me and my husband. We also have 16-year-old twins, a boy and a girl. My younger daughter suffers from depression and anxiety. The twins both have ADHD. My daughter was in an outpatient program and outpatient family therapy. My husband and I attended two sessions. My older daughter came with us to a third session. The therapist ended the session and said that we were a toxic family and we had parentified our kids. My younger daughter had a lot of issues in middle school, and her sister felt bad for being mean to her. So now it is the girls against the rest of us. My older daughter has decided to distance herself from us. She got COVID-19 and came home for two weeks. The Moneyist:'He doesn't give me any money': My husband has been making secret payments to his parents. Should I tell him to stop? I gave her a card. It said that I would really like to move our relationship forward and asked her what I needed to do, and she never responded. She has been using my younger daughter as a mouthpiece when she wants to address me or my husband. I think this shouldn't happen due to my younger daughter's mental health issues. She does call when I send her things in the mail, but the call is usually brief and she hangs up quickly. They are also saying my husband is mean and doesn't love them. The Moneyist: 'We bet on the wrong horse': I co-signed my nephew's $55K student loan: He has no degree and no job. What should we do? I have bipolar disorder, and there was a period when I was in and out of the hospital. So I know things were tough on her. My question is this: We are paying 100% of my eldest daughter's tuition for fall 2020. Our goal is for her to graduate without debt. With this distancing going on, I really don't want to continue paying for her. I would, however, if she agreed to participate in counseling. I know that using money as a cudgel is probably not the best solution, and they already think we are materialistic. Do you think I should withdraw her tuition fees? The Mother Dear Mother, If you want to prove your family therapist right by parentifying your children - forcing them to fend for themselves and take out student loans that could take a decade or more to pay off - then stop paying their tuition. Your children are certainly privileged that they have parents who can afford to pay for their tuition. But to use money as a bargaining chip further complicates an already fractured relationship, and would merely be an act of buying their cooperation and/or love. To take away that funding would be a petulant act, and to use it as a cudgel to attend therapy would be counterproductive. It would merely create even more resentment, and/or force your children to show up to therapy for all the wrong reasons. It would make the situation worse, not better. Show them understanding and compassion, acknowledge the mistakes you made in the past, and express a willingness to do better. The Moneyist: My wife had a baby in June. She has $160,000 in student loans - and just asked for my 'blessing' to work part time Parental love should not be transactional, in an ideal world. The more your daughter pulls away, the more you seem to push. You are trying to control something - your daughter's feelings for you - that is out of your control. That is a fool's game. You committed to paying her fees. Don't pull the rug from under her now. Tell her you are there whenever she needs you, acknowledge that you made mistakes as a parent, and tell her you will respect her wishes and give her the space she needs. Be the bigger person. That requires letting go of your injured pride and having not a small amount of humility. You will have to ease up on your own righteous indignation and quell your anger. Lead by example: If you don't want your daughter to talk badly about you, don't criticize your daughter. Be the one who shows unconditional love and support. Be the one who expresses compassion and an even temperament. Be the parent. You can email The Moneyist with any financial and ethical questions at qfottrell@marketwatch.com. Want to read more?Follow Quentin Fottrell on Twitterand read more of his columns here. Hello there, MarketWatchers. Check out the Moneyist private Facebook FB, +0.26%  group where we look for answers to life's thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}