{"article": [{"url": "https://www.marketwatch.com/story/private-equity-firm-sycamore-poised-to-buy-jcpenney-merge-it-with-belks-2020-07-27", "published": 1595928380.0, "headline": "Private-equity firm Sycamore poised to buy J.C. Penney, merge it with North Carolina chain Belks; Penney brand likely to vanish", "body": "The private-equity firm that backed out of a deal to buy Victoria’s Secret in the midst of the coronavirus pandemic appears poised to win an auction to buy the department-store chain J.C. Penney out of bankruptcy, the New York Post has learned. New York–based Sycamore Partners has offered $1.75 billion to buy the 118-year-old chain with plans to merge it with Belks, a source described as having knowledge of the situation reportedly told the Post. Sycamore sees J.C. Penney JCPNQ, -3.42% JCP, -2.53% helping to revive the North Carolina–based Belks, itself a struggling department-store chain with 300 stores located mostly in the South, the source said. Along with Belks, Sycamore owns the retailers Talbots, Staples and The Limited. “JCP is the lifeboat for Belks, which wants to compete with Macy’s nationally,” the source explained. Also in the running for Penney is Saks Fifth Avenue owner Hudson’s Bay Co., which offered $1.7 billion, and mall operators Simon Property SPG, -3.35% and Brookfield Property BPY, -0.72%, which have teamed up with a $1.65 billion offer, sources said. While the deal is still subject to approval from the court as well as from Penney’s lenders, creditors and board, Sycamore has been in the lead since bids were due on July 22, sources said. “The bidders were told that Belks/Sycamore submitted the strongest bid to acquire JCP,” one source said. A second source, however, noted that all of the bidders are still in the running. “The three bids are being analyzed, and, because there’s not a big difference between them, it means that all three are seeing a similar valuation,” this person said. Both J.C. Penney and Belks, founded in 1888 and thus 14 years older than Penney, have suffered from declining sales amid competition from fresher brands and online retailers like Amazon AMZN, +3.01%. J.C. Penney was also saddled with $5 billion in debt when it filed for bankruptcy protection. The Sycamore plan involves rebranding some 250 J.C. Penney stores as Belks stores in markets where the two retailers don’t overlap. The rest of the J.C. Penney locations would be liquidated, the source said. Plano, Texas–based J.C. Penney operated 850 stores when it filed for bankruptcy protection on May 15. In June, it announced plans to close at least 154 stores permanently. Belks CEO Lisa Harper would run the combined entity. While Sycamore isn’t interested in keeping the J.C. Penney brand, it would acquire the rights to the name and could sell the intellectual property at a later date, a source said. Sycamore acquired Belks in 2015. Harper replaced Tim Belks as CEO the following year — marking the first time the family-owned store chain was run by someone outside the family. Earlier this year, Sycamore offered $1 billion for a controlling stake in iconic but troubled lingerie peddler Victoria’s Secret. But the buyout firm wiggled out of the deal in May by claiming that the retailer’s parent company, L Brands, had violated the terms of their deal by closing Victoria’s Secret stores and failing to pay their rent during the pandemic. Two weeks later, L Brand’s billionaire founder Retail legend Leslie Wexner retired after 56 years at the helm. JCPenney and Sycamore declined to comment. This report originally appeared on NYPost.com."}]}