{"article": [{"url": "https://www.marketwatch.com/story/expect-violently-flat-markets-but-be-ready-to-buy-the-dip-analyst-says-2020-06-15", "published": 1593939680.0, "headline": "Expect â\u0080\u0098violently flatâ\u0080\u0099 markets, but be ready to buy the dip, analyst says", "body": "Markets may have sold off in response to a resurgence in COVID-19 cases as local economies begin to re-open, but one analyst thinks itâ\u0080\u0099s a buying opportunity, not a reason to retreat. As long as new cases donâ\u0080\u0099t significantly strain the health care system, and Americans donâ\u0080\u0099t lose their nerve and return to hunkering down at home, Evercore ISIâ\u0080\u0099s Dennis DeBusschere thinks markets could be in for a â\u0080\u009csharp rebound,â\u0080\u009d and his team has designed a portfolio of stocks designed to benefit from it. In the near term, however, he expects â\u0080\u009cviolently flat markets.â\u0080\u009d â\u0080\u009cA significant COVID second wave would continue to drive asset prices lower, but with vaccine development continuing, little correlation between economic re-openings and increased case growth and hospitalization data at the national level,â\u0080\u009d investors should consider dips as a buying opportunity, DeBusschere said in a note out Monday. Related:The next 10% up in the S&P 500 is all about the pandemic recovery â\u0080\u0094 and itâ\u0080\u0099s doable, this analyst says Some assumptions are key to this thesis. For one, Evercore research currently shows â\u0080\u009cplenty of ICU capacity in every stateâ\u0080\u009d â\u0080\u0094 but that could change, referring to intensive care units. Also, the firmâ\u0080\u0099s base case is for another fiscal package later in the summer, for as much as $1-1.5 trillion. But the give-and-take between governments trying to dampen unsafe activities even as Americans keep trying to return to normal, in DeBusschereâ\u0080\u0099s word, â\u0080\u009cis a risk that will help keep volatility high and markets violently flat near term.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } That means investors may keep rotating between factors â\u0080\u0094 like swapping exposure to risk-on strategies like value for risk-off ones like earnings quality â\u0080\u0094 he said. Still, one small piece of evidence that the path for stocks may be gradually up over the coming months, rather than down, is that Evercoreâ\u0080\u0099s â\u0080\u009crecoveryâ\u0080\u009d portfolio of stocks â\u0080\u0094 those that will benefit from a positive economic outcome â\u0080\u0094 is beating its â\u0080\u009cquarantineâ\u0080\u009d portfolio. The recovery portfolio includes names from Apple Inc. AAPL, +1.74% Â to Zions Bancorp ZION, -1.75%, with exposure to some of the areas that have been beaten down over the past few months, as investors stuck with proven winners. It includes Delta Airlines Inc. DAL, +0.39% Â , United Airlines Holdings Inc. UAL, +0.32% Â , and Walt Disney Co., DIS, +1.53% Â for example, as well as energy plays like Concho Resources Inc. CXO, -1.22% Â and Frontline Ltd. FRO, -1.45% Â But it also features some of the names investors have favored through the recent disruption, and are likely to continue to benefit, like UnitedHealth UNH, +1.68% Â and Amazon.com AMZN, +3.01%. See:Wall Streetâ\u0080\u0099s road warriors have spent the past three months grounded. Howâ\u0080\u0099s that working out?"}]}