{"article": [{"url": "https://www.marketwatch.com/story/dont-just-default-to-the-sp-500-consider-this-simple-four-fund-portfolio-2020-10-01", "published": 1601714720.0, "headline": "Don't just default to the S&P 500: Consider this simple four-fund portfolio", "body": "In recent weeks lots of investors have been asking me if they should consider the simple combination of four equity funds that I've been recommending for the past few years. I've repeatedly argued that this combination is a terrific way to capture the well-known long-term benefits of small-cap stocks and value stocks. People usually say they can see this could be right for some people. But how do they know whether it will be right for them? It's a good question, and I think the answer depends on your answers to two deceptively simple questions: First, how much time do you have? Second, what are you worried about? To back up for a second, just what is this four-fund combination? It's built on four index funds (or exchange-traded funds) that include the most basic U.S. equity asset classes: large-cap blend stocks (the S&P 500 SPX, +0.87%, in other words), large-cap value stocks, small-cap blend stocks, and small-cap value stocks. Asset class Vanguard fund Fidelity fund ETF S&P 500 VFIAX FXAIX VOO Large value VVIAX FLCOX RPV Small blend VTMSX FSSNX IJR Small value VSIAX FISVX SLYV That combination will give you the familiarity and comfort of the Standard & Poor's 500 Index, along with exposure to the historical performance advantages of value stocks and stocks of smaller companies. This combination has outperformed the S&P 500 Index in six of the past nine decades. But maybe you don't have decades to wait around for your desired results. That leads me to the first question you should ask yourself: How much time do you have? Over the past 30 calendar years, from 1990 through 2019, this combination had a compound annual growth rate of 11.8%. That's a big improvement over the more familiar S&P 500's performance of 10.0%. Obviously, the next 30 years won't be exactly like the 30 years we just experienced. But for the sake of discussion, let's slice and dice those 30 years a bit. (I'm indebted to Chris Pederson for the following calculations.) If we assume your goal was to outperform the S&P 500, in any five-year period from 1990 through 2019, you would have had a 58% chance of success. Over all the 10-year periods, your success rate would have risen to 61%. If your holding period was 15 years, your success rate would have been 75%. In any 20-year period, you had an 86% chance of outperforming the S&P 500. And in any 25-year period, your success rate in beating the S&P 500 with this four-fund combo would have been 100%. (Even though this is patently obvious, it's also interesting to note that if you invested only in the S&P 500 instead of this combination, your chances of outperforming the index were exactly zero.) So what to make of this? If you have a time horizon of at least five years, you had a better-than-even chance of outperforming the S&P 500. No guarantee, of course!) The other basic question: What worries you? Let's look at a few possibilities and see what the data shows. Worried about ditching the familiar, high-quality stocks that make up the S&P 500 Index? In the four-fund combo, you'll still have those stocks, but only in 25% of your portfolio. This concern is about your comfort, and no data can give you the answer. Worried about how many calendar years you will underperform the S&P 500? If this is presented as a two-way contest, since 1990, the four-fund combo \"won\" 17 times, and the S&P 500 \"won\" 12 times. The winner: the four-fund combo. Worried about the number of calendar years your portfolio will lose money? In this period, the S&P 500 lost money in six calendar years; the four-fund combo lost in seven calendar years. Interestingly, they weren't always the same years. The nod goes to the S&P 500. Worried about the cumulative losses in all those losing years? (This worry is probably confined to statistical wonks, but we do have data.) The six years of losses in the S&P 500 added up to 87.6%; in the four-fund combination, the total was 90.3%. This is close enough I'd call it a toss-up. (And total gains from all the \"winning\" years were 431% for the S&P 500 vs. 496% for the four-fund combo.) Worried about the worst single calendar year you might have to endure? In both cases, that would have been 2008, when the S&P 500 lost 37% and the four-fund combo lost 38.2%. Although this is a \"win\" for the S&P 500, a loss of 37% is nothing to brag about. I hesitate to call all these worries trivial. But none of them is worth a lot of angst. However, investors can and should be legitimately concerned about how their portfolios might do in a sustained market downturn. This 30-year period gives us the unpleasant example of 2000-2002, when the S&P 500 had successive annual losses of 9.1%, 11.9%, and 22.1%, respectively. The compound loss was 37.6%, which would have reduced $100 to $62.38. In those same three years, the four-fund combo gained 7.3%, then gained 8.4%, then lost 13.7%. That would have turned $100 into $100.37. That's a very substantial difference, and it resulted from one simple factor: diversification. During this difficult period, the small-cap, small-cap value, and large-cap value stocks in this four-fund portfolio provided the diversification to turn a 37.6% cumulative loss into a break-even result. Fortunately, periods like that don't come along very often. But when they do, the four-fund combo is a great source of \"defense\" for investors. For more on this four-fund portfolio and 10 other popular strategies, check out my video presentation, \"Which is the best 1-, 2-, 3- or 4-fund strategy?\" Richard Buck contributed to this article."}]}