{"article": [{"url": "https://www.marketwatch.com/story/from-travel-and-shopping-to-health-care-life-will-never-be-the-same-for-people-over-60-even-with-a-vaccine-2020-08-17", "published": 1599315380.0, "headline": "Life will never be the same for people over 60 â\u0080\u0094 even with a COVID-19 vaccine", "body": "This article is reprinted by permission from NextAvenue.org. It is part of theÂ Coronavirus Outbreak: What You Need To Know Special Report. Imagine this scenario, perhaps a year or two in the future: An effective COVID-19 vaccine is routinely available, and the world is moving forward. Life, however, will likely never be the same â\u0080\u0094 particularly for people over 60. That is the conclusion of geriatric medical doctors, aging experts, futurists and industry specialists. Experts say that in the aftermath of theÂ pandemic, nearly everything will change, from the way older people receive health care to how they travel and shop. Also overturned: their work life and relationships with one another. â\u0080\u009cIn the past few months, the entire world has had a near-death experience,â\u0080\u009d said Ken Dychtwald, CEO of Age Wave, a think tank on aging around the world. â\u0080\u009cWeâ\u0080\u0099ve been forced to stop and think: I could die, or someone I love could die. When those events happen, people think about what matters and what they will do differently.â\u0080\u009d Older adults are uniquely vulnerable because their immune systems tend to deteriorate with age, making it so much harder for them to battle not just COVID-19 but all infectious diseases. They are also more likely to suffer other health conditions, like heart and respiratory diseases, that make it tougher to fight or recover from illness. Read: Yes, you may still be able to retire one day So itâ\u0080\u0099s no surprise that even in the future, when a COVID-19 vaccine is widely available â\u0080\u0094 and widely used â\u0080\u0094 most older adults will be taking additional precautions. â\u0080\u009cBefore COVID-19, baby boomers â\u0080\u0094 those born after 1945 but before 1965 â\u0080\u0094 felt reassured that with all the benefits of modern medicine, they could live for years and years,â\u0080\u009d said Dr. Mehrdad Ayati, who teaches geriatric medicine at Stanford University School of Medicine and advises the U.S. Senate Special Committee on Aging. â\u0080\u009cWhat we never calculated was that a pandemic could totally change the dialogue.â\u0080\u009d It has. Hereâ\u0080\u0099s a preview of post-vaccine life for older Americans:Medical care Time to learn all about online health care.Â Only 62% of people over 75 use the internet â\u0080\u0094 and fewer than 28% are comfortable with social media, according to data from the Pew Research Center. â\u0080\u009cThatâ\u0080\u0099s lethal in the modern age of health care,â\u0080\u009d Dychtwald said. So, there will be a drumbeat to make them fluent users of online health care.â\u0080¨â\u0080¨â\u0080¨ 1 in 3 visits will beÂ telemedicine.Â Dr. Ronan Factora, a geriatrician at Cleveland Clinic, said he saw no patients age 60 and up via telemedicine before the pandemic. He predicted that by the time a COVID-19 vaccine is available, at least a third of those visits will be virtual. â\u0080\u009cIt will become a significant part of my practice,â\u0080\u009d he said. Older patients likely will see their doctors more often than once a year for a checkup and benefit from improved overall health care, he said. Many doctors instead of just one.Â More regular remote care will be bolstered by a team of doctors, said Dr. Greg Poland, professor of medicine and infectious diseases at the Mayo Clinic. The team model â\u0080\u009callows me to see more patients more efficiently,â\u0080\u009d he said. â\u0080\u009cIf everyone has to come to the office and wait for the nurse to bring them in from the waiting room, well, thatâ\u0080\u0099s an inherent drag on my productivity.â\u0080\u009d Drugstores will do more vaccinations.Â To avoid the germs in doctorsâ\u0080\u0099 offices, older patients will prefer to go to drugstores for regular vaccinations such as flu shots, Factora said. Your plumbing will be your doctor.Â In the not-too-distant future â\u0080\u0094 perhaps just a few years from now â\u0080\u0094 older Americans will have special devices at home to regularly analyze urine and fecal samples, Dychtwald said, letting them avoid the doctorâ\u0080\u0099s office. Travel Punch up the Google GOOG, +1.97% Â Maps.Â Many trips of 800 miles or less will likely become road trips instead of flights, said Ed Perkins, a syndicated travel columnist for The Chicago Tribune. Perkins, who is 90, said thatâ\u0080\u0099s certainly what he plans to do â\u0080\u0094 even after thereâ\u0080\u0099s a vaccine. Regional and local travel will replace foreign travel.Â Dychtwald, who is 70, said he will be much less inclined to travel abroad. For example, he said, onetime plans with his wife to visit India are now unlikely, even if a good vaccine is available, because they want to avoid large concentrations of people. That said, each year only 25% of people 65 and up travel outside the U.S., vs. 45% of the general population, according to a survey by Visa V, +1.80% Â . The most popular trip for older adults: visiting grandchildren. Demand for business class will grow.Â When older travelers who are financially able choose to fly, they will more frequently book roomy business-class seats because they wonâ\u0080\u0099t want to sit too close to other passengers, Factora said. Buying three seats for two.Â Older couples who fly together â\u0080\u0094 and have the money â\u0080\u0094 will pay for all three seats on a flight so no one is between them, Perkins said. Hotels will market medical care.Â Medical capability will be built into more travel options, Dychtwald said. For example, some hotels will advertise a doctor on-site or one close by. â\u0080\u009cThe era is over of being removed from health care and feeling comfortable,â\u0080\u009d Dychtwald said. Disinfecting will be a sales pitch.Â Expect a rich combination of health and safety â\u0080\u009ctheaterâ\u0080\u009d â\u0080\u0094 particularly on cruises that host many older travelers. Perkins said: â\u0080\u009cEmployees will be wandering around with disinfecting fogs and wiping everything ten times.â\u0080\u009d Cruises will require proof of vaccination. Passengers â\u0080\u0094 as well as cruise employees â\u0080\u0094 will likely have to prove theyâ\u0080\u0099ve been vaccinated before traveling, Factora said. Eating Local eateries will gain trust.Â Neighborhood and small-market restaurants will draw loyal customers â\u0080\u0094 mainly because they know and trust the owners, said Christopher Muller, a hospitality professor at Boston University. Safety will be a restaurantâ\u0080\u0099s bragging point.Â To appeal to older diners in particular, restaurants will prominently display safety-inspection signage and visibly signal their cleanliness standards, Muller said. They will even hire employees exclusively to wipe down tables, chairs and all high-touch points â\u0080\u0094 and these employees will be easy to identify and very visible. Home life and shopping The homecoming.Â Because of so many COVID-19 deaths in nursing homes, more older adults will leave assisted living facilities and nursing homes to move in with their families, Factora said. â\u0080\u009cFamilies will generally move closer together,â\u0080\u009d he said. The fortress.Â Home delivery of almost everything will become the norm for older Americans, and in-person shopping will become much less common, Factora said. An increase in grocery deliveries.Â The 60-and-up workforce increasingly will be reluctant to work anywhere but from home and will be very slow to re-embrace grocery shopping. â\u0080\u009cInstacart delivery will become the new normal for them,â\u0080\u009d Dychtwald said. Also see: Social Security could be vulnerable under President Trumpâ\u0080\u0099s plan for payroll taxesGatherings Forced social distancing.Â Whenever or wherever large families gather, people exhibiting COVID-like symptoms may not be welcomed under any circumstances, Ayati said. Older adults will disengage, at a cost.Â Depression will skyrocket among older people who isolate from family get-togethers and large gatherings, Ayati said. â\u0080\u009cAs the older population pulls back from engaging in society, this is a very bad thing.â\u0080\u009d Public restrooms will be revamped.Â For germ avoidance, theyâ\u0080\u0099ll increasingly get no-touch toilets, urinals, sinks and entrances and exits. â\u0080\u009cOne of the most disastrous places you can go into is a public restroom,â\u0080\u009d Poland said. â\u0080\u009cThatâ\u0080\u0099s about the riskiest place.â\u0080\u009d Bruce Horovitz, a national freelance writer and media training consultant, is a former USA Today marketing report and Los Angeles Times marketing columnist.Â He can be reached atÂ brucehorovitz@gmail.com This article is reprinted by permission from NextAvenue.org, Â© 2020 Twin Cities Public Television, Inc. All rights reserved."}]}