{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-fall-on-signs-of-rising-crude-inventories-stimulus-uncertainty-11602072959", "published": 1602083900.0, "headline": "Oil settles lower, but pares losses as hurricane threat cuts Gulf oil output", "body": "Storage in focus. Johannes Eisele/Agence France-Presse/Getty Images Oil futures settled lower on Wednesday, undermined by a weekly rise in U.S. crude-oil inventories and concern about demand given the muddled outlook for another round of fiscal stimulus by Congress in response to the COVID-19 pandemic. Prices, however, finished off the session’s worst levels following news that more than 80% of oil production in the Gulf of Mexico has been halted as a major hurricane approaches the region. Traders continued to track Hurricane Delta, which was expected to move over the southern Gulf of Mexico Wednesday afternoon. It’s forecast to approach the northern Gulf Coast on Friday. The Bureau of Safety and Environmental Enforcement estimated that 80.42% of Gulf oil production and 49.26% of natural-gas output was shut in as of Wednesday afternoon in anticipation of the storm. The hurricane will need to be monitored “for exact strength and track as we go into the end of the week,” Tariq Zahir, managing member at Tyche Capital Advisors, told MarketWatch. West Texas Intermediate crude for November delivery CLX20, -1.62% CL.1, -1.62% on the New York Mercantile Exchange fell 72 cents, or 1.8%, to settle at $39.95 a barrel after trading as low as $39.28. December Brent crude BRNZ20, -0.07% BRN00, -0.07% shed 66 cents, or nearly 1.6%, to $41.99 a barrel on ICE Futures Europe. President Donald Trump late Tuesday pulled the plug on fiscal stimulus negotiations with Congress. The decision prompted a sharp selloff in U.S. stocks and losses in oil futures in afternoon trade. Trump later demanded action, however, on piecemeal aid measures. For now “outside factors” are likely to drive the next movement in the energy markets, said Zahir. “When the president announced he is instructing his team to walk away from any stimulus and aid to certain sectors, the markets went into an immediate risk off posture,” he said. However, the president walked back the comments slightly, “asking for a deal for the airlines and direct payments to the public.” That prompted some risk-on sentiment, with U.S. benchmark stock indexes higher Wednesday. Trump is now calling on Congress to send him individual relief measures, including $1,200 stimulus checks for consumers and aid for airlines and small businesses. The partial turnabout was credited with boosting the U.S. stock market Wednesday, but the price reaction in crude oil signals “the market isn’t buying it and we need to accept that immediate consumer relief in the U.S. will be hard to come by, at least until the election is over,” wrote analysts at JBC Energy, a Vienna-based consulting firm, in a note. Need to Know: Why the U.S. economy could hit ‘stall speed’ as stimulus talks collapse Meanwhile, the Energy Information Administration reported Wednesday that U.S. crude inventories rose by 500,000 barrels for the week ended Oct. 2. That followed three consecutive weeks of declines and compared with an average fall of 2 million barrels expected by analysts polled by S&P Global Platts. The American Petroleum Institute on Tuesday had reported a rise of 951,000 barrels. The EIA data also showed crude stocks at the Cushing, Okla., storage hub edged up by 400,000 barrels for the week. Gasoline supply, meanwhile, fell by 1.4 million barrels, while distillate stockpiles declined by 1 million barrels. The S&P Global Platts survey had shown expectations for supply declines of 800,000 barrels for gasoline and 2.9 million barrels for distillates. On Nymex, November gasoline RBX20, -2.11% fell by 2.8% to $1.2009 a gallon and November heating oil HOX20, -0.05% lost 2.3% to $1.1608 a gallon. Natural-gas futures Wednesday moved up, with the November contract NGX20, +5.17% tacking on 3.4% to settle at $2.606 per million British thermal units, after losing 3.6% a day earlier."}]}