{"article": [{"url": "https://www.marketwatch.com/story/feds-barkin-says-economy-could-suffer-relapse-without-more-washington-stimulus-2020-08-11", "published": 1597156760.0, "headline": "Fedâ\u0080\u0099s Barkin says economy could suffer relapse without more Washington stimulus", "body": "A recession of â\u0080\u009chistoric proportionsâ\u0080\u009d could take another turn for the worse if a stalemated Congress fails to provide more financial aid to beleaguered workers and businesses hammered by the coronavirus pandemic, the president of the Richmond Federal Reserve warned. Thomas Barkin, chief of one of 12 regional branches of the central bank, sounded an alarm at a â\u0080\u009cdigital town hallâ\u0080\u009d held on Tuesday by the Center for Regional Economic Competitiveness. Senior Fed officials have become increasingly alarmed by the standoff among Democrats and Republicans over the size and scope of the next financial aid package, including an extension of federal unemployment benefits. Normally very reticent to give advice to Congress, theyâ\u0080\u0099ve been relatively open in their views that the economy needs more help from Washington. Chicago Fed President Charles Evans called the impasse â\u0080\u009can unfortunate developmentâ\u0080\u009d in an interview Sunday on CBSâ\u0080\u0099s â\u0080\u009cFace the Nation.â\u0080\u009d â\u0080\u009cAnother support package is really, in my opinion, important,â\u0080\u009d Evans said. Barkin has been similarly outspoken. Heâ\u0080\u0099s said that what initially seemed like an economic pothole has turned into a sinkhole. Without the right stimulus, he said Tuesday, the economy could suffer a relapse. Read: The economy took another body blow from Covid-19 in July. Just how bad was it? In an attempted end-run around Democrats, President Trump over the weekend signed a series of executive orders that aim to protect renters, student borrowers and the unemployed. Included in his orders was an extension of federal unemployment benefits at a reduce rate of $300 from an original $600. Democrats, some Republicans and many economists say thatâ\u0080\u0099s not enough. Itâ\u0080\u0099s unclear if the parties will resume negotiations. Lower unemployment benefits would especially hurt blue-collar workers, Barkin said, while more economic uncertainty could deter white-collar employees who feel more secure in their jobs from spending extra money. Even if a vaccine is developed, Barkin suggested the labor market could show visible scars for quite some time, a warning thatâ\u0080\u0099s been echoed on Wall Street. See: U.S. will have a delayed effect of â\u0080\u0098seeing the normal effects of recession,â\u0080\u0099 says JPMorganâ\u0080\u0099s Dimon Some companies may have discovered they can make do with fewer workers, Barking suggested, while others would be hesitant to go back to prior employment levels until demand for goods and services returns to normal Barkin also said he saw little evidence of broad U.S. inflation in goods and service despite the Fed dropping a key interest rate to near zero and Washington spending trillions to combat the virus. Yet he also acknowledged that low rates may be â\u0080\u009cencouraging demand for stocksâ\u0080\u009d â\u0080\u0094 what some critics call a form of â\u0080\u009casset inflation.â\u0080\u009d Read:Wholesale prices surge 0.6%, but donâ\u0080\u0099t be fooled: Inflation no threat to the economy The U.S. stock market DJIA, +0.56% Â has rebounded sharply from pandemic lows and the Dow Jones Industrial Average is only a few thousand points off its record high and the S&P 500 SPX, +0.87% Â within striking distance of its all-time high."}]}