{"article": [{"url": "https://www.marketwatch.com/story/we-need-joe-biden-as-our-next-president-sanders-makes-case-for-his-former-rival-2020-08-17", "published": 1597743380.0, "headline": "â\u0080\u0098We need Joe Biden as our next presidentâ\u0080\u0099: Sanders makes case for his former rival", "body": "Sen. Bernie Sanders ripped President Donald Trump and delivered a forceful speech in favor of Joe Biden during the Democratic National Convention on Monday, urging those who voted for other candidates in the partyâ\u0080\u0099s primary to get behind the former vice presidentâ\u0080\u0099s White House bid. â\u0080\u009cWe need Joe Biden as our next president,â\u0080\u009d Sanders, a Vermont independent, said via video to the convention, an almost entirely virtual event due to the coronavirus pandemic. The prime speaking spot for Sanders â\u0080\u0094 who ran against Biden in the Democratic presidential primary â\u0080\u0094 was a significant nod to the progressive wing of the party. And itâ\u0080\u0099s not the only one: On Tuesday, Rep. Alexandria Ocasio-Cortez of New York, another progressive standard-bearer, is scheduled to speak. Also read:Michelle Obama rips Trump as â\u0080\u0098wrong president for our countryâ\u0080\u0099 in DNC speech. After Sandersâ\u0080\u0099 exit from the primaries, backers of both the Vermont senator and Biden bridged some of their policy divides in recommendations of joint task forces. But gaps remained on key issues, with progressive ideas like the â\u0080\u009cGreen New Dealâ\u0080\u009d and â\u0080\u009cMedicare for Allâ\u0080\u009d not making it into the recommendations. Sanders in his speech acknowledged that he and Biden disagree on issues including health care. But he lauded Bidenâ\u0080\u0099s support of raising the federal minimum wage to $15 an hour, making it easier for workers to join unions, and fighting the threat of climate change. Trump is attacking Biden as a â\u0080\u009cTrojan Horse for socialism,â\u0080\u009d who is beholden to progressives like Sanders. Trump has charged that markets SPX, +0.87% Â and the economy would sink under Biden and his running mate Kamala Harris â\u0080\u0094 even as some analysts say a Democratic sweep would be best for Wall Street. Opinion:The stock market would love a Democratic sweep in November."}]}