{"article": [{"url": "https://www.marketwatch.com/story/us-durable-goods-orders-rebound-158-in-may-but-manufacturers-face-long-struggle-2020-06-25", "published": 1593080900.0, "headline": "U.S. durable-goods orders rebound 15.8% in May, but manufacturers face long struggle", "body": "Orders for durable goods such as autos surged in May after historic declines in the early spring when the U.S. was locked down, but manufacturers are likely to struggle to make a more rapid recovery amid a fresh outbreak of the coronavirus and a depressed global economy. Orders jumped 15.8% last month, the government said Thursday. Economists polled by MarketWatch had predicted a 10.3% increase in goods meant to last at least three years. The rebound in manufacturing and other key parts of the economy suggests the U.S. may have already exited what could turn out to be the shortest and deepest recession in American history. Yet orders had tumbled 18% in April and almost 17% in March, so manufacturers have lots of ground to make up. It’s won’t be easy, economists say. The U.S. is expected to experience big hiccups as employees and companies grope for ways to return to work safely amid on ongoing viral outbreak. A new wave of cases in the states that reopened earliest could even sidetrack the fledgling recovery. Read:Jobless claims dip to 1.48 million, but slow decline signals choppy recovery What happened: Orders for automakers, whose bookings fell by two-thirds in March and April, climbed 28% last month, although they still remain well below pre-crisis levels. Aircraft manufacturers, mainly Boeing BA, -0.39%, also saw good news of sorts. The giant manufacturer basically reported zero new orders in May, but cancellations declined. That accounted for almost half the increase in durable-goods orders last month. The airline industry remains mired in a deep slump, though. Airlines have suffered a collapse in passenger traffic and are barely scraping by even with massive government assistance. It could be years before domestic and global travel returns to normal and demand for new planes is restored. If cars and planes are stripped out, orders grew a much smaller 4%. Bookings rose 9.1% for metals and 7.4% for fabricated parts. Orders barely rose for computers and heavy machinery. A key measure of business investment, known as core orders, edged up 2.3% last month. These orders exclude defense and transportation. Already weak before the pandemic, business investment is likely to remain low until companies get a better sense of how rapidly the economy is recovering and to what extent customers come back. The big picture: The first phase of the recovery got off to a pretty good start, but that may have been the easy part. The economy was all but certain to get a big boost when states reopened and that’s exactly what happened. The next phase may prove more troublesome, especially after a fresh outbreak of coronavirus cases in states that were among the first to reopen. Customers could become hesitant again to venture out and further government restrictions could restrain the recovery. What they are saying? ‘Manufacturing is starting to rebound, but full recovery is a long way off,” said chief economist Ian Shepherdson of Pantheon Macroeconomics. “The gradual loosening of social distancing measures was bound to unleash some pent-up activity, but the initial sugar rush will soon fade,” wrote Oren Klachkin and Gregory Daco of Oxford Economics. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% fell in Thursday trades."}]}