{"article": [{"url": "https://www.marketwatch.com/story/big-techs-latest-reckoning-is-coming-as-it-continues-to-rack-up-record-valuations-2020-07-13", "published": 1594726880.0, "headline": "Big Tech's latest reckoning is coming as it continues to rack up record valuations", "body": "Tech's Big Four CEOs should be nervous as they approach a virtual July 27 hearing before the House Judiciary Antitrust Subcommittee. So why aren't they? Apple Inc.'s AAPL, +1.74%  Tim Cook, Amazon.com Inc.'s AMZN, +3.01%  Jeff Bezos, Facebook Inc.'s FB, +0.26%  Mark Zuckerberg and Alphabet Inc.'s GOOGL, +1.82%  GOOG, +1.97%  Sundar Pichai can think of 5 trillion reasons why: That's the collective market value, in dollars, of their companies. All but Facebook are worth at least $1 trillion. The fab four have never been worth more, as they gobble up market share and expand into other segments through a flurry of acquisitions. As Apple hurtles toward becoming the first company to reach $2 trillion in market value, shares of Amazon and Alphabet catapulted to record highs after Mizuho analyst James Lee raised his price targets for both, citing jumps in cloud spending in the financial services, retail and health-care industries. Read more: Amazon, Alphabet stocks rise toward records after Mizuho lifts price targets See also: Apple $2 trillion? This chart might have you rethinking your investment The steep ascent of Big Tech, which is fueling a resurgent stock market despite a deepening pandemic, underscores the enduring power of the industry as consumption of it escalates in a work-from-home economy. This is particularly pronounced among the Mount Rushmore of tech, minus Microsoft Corp. MSFT, +2.48%  . Their products and services have become essential for shopping (via Amazon and Google), entertainment (Apple and Google's YouTube), news and how-to tutorials (Google search), and socializing (Facebook). And that doesn't include sharp spikes in the use of smartphones (Apple and Google) and the cloud (Google, Amazon and Microsoft). \"If anything, the pandemic has furthered Americans' dependence on technology for groceries, goods, communication, entertainment,\" Rebecca Allensworth, a law professor at Vanderbilt University, told MarketWatch in a phone interview. \"This is a further opportunity to solidify power of these companies.\" How the House Judiciary Antitrust Subcommittee interprets the growing financial power of tech's Big Four, and how it sways the subcommittee's calculus, remains a closely guarded secret. A staffer declined comment. \"Since last June, the subcommittee has been investigating the dominance of a small number of digital platforms and the adequacy of existing antitrust laws and enforcement,\" Rep. David Cicilline, D-R.I., chairman of the subcommittee, said in a statement. \"Given the central role these corporations play in the lives of the American people, it is critical that their CEOs are forthcoming.\" None of the companies scheduled to testify were willing to talk on the record, but representatives from at least two note a stark contrast between fostering competition and undercutting successful companies that are fueling the U.S. economy and global economic leadership. There is also a sense of Congress shifting blame from its own shortcomings and unpopularity to increasingly powerful tech companies and their influence in a divided society, these people said. A resulting fear among the companies is potential damage to U.S. economic stalwarts at a time when China has made no secret about its plan to dominate the tech industry and industry standards. This much is true: All four have been \"called into the principal's office,\" Allensworth said, and for profoundly different reasons. Facebook is caught in a vortex of bad news as the Federal Trade Commission mulls its No. 2 standing in digital advertising, aided in large part by its acquisitions of Instagram and WhatsApp. The spread of coronavirus has accelerated the shift in advertising from billboards, newspapers and radio to digital platforms like Facebook, Google and Amazon. Ironically, antitrust regulators' scrutiny comes amid a worldwide boycott of Facebook in July by hundreds of brands - including heavyweights Coca-Cola Co. KO, +0.69%  , Verizon Communications Inc. VZ, +0.23%  , Starbucks Corp. SBUX, +0.53%  , Unilever UL, +1.44%  , and SAP SAP, +0.65%  - in protest of hate speech and misinformation that appears on the social media company's digital platforms. Read more: Facebook considers banning U.S. political ads ahead of election, report says See also: Here are the major brands that have pulled ads from Facebook Last week, leaders of four of the organizations coordinating the #StopHateForProfit advertising boycott met with Facebook CEO Mark Zuckerberg, Chief Operating Officer Sheryl Sandberg, Chief Product Officer Chris Cox and others. Facebook also faces immense pressure over its hands-off policy regarding political advertising, and is reportedly considering a ban on such ads ahead of the U.S. election in November. If it follows through, it could lose out on hundreds of millions of dollars, according to RBC Capital Markets. Google, which reportedly hopes to avert an EU antitrust investigation into its planned $2.1 billion acquisition of Fitbit Inc. FIT, -0.14%  by promising not to use Fitbit's health data to help it target ads, appears to be in the crosshairs of Attorney General William Barr as well. In the coming months, the Justice Department is expected to decide whether to file a lawsuit charging Alphabet's Google with abuse of power in the market for advertising technology and search products. The government is also examining allegations that Google abused its dominance over search, according to published reports. Ultimately, a successful suit conceivably could reshape Google's business - not to mention a large swath of the economy - and put a throttle to several years of unfettered growth in Silicon Valley. Google hinted in a recent 67-page filing that although it accounts for nearly 30% of spending in the digital ad market worldwide, it isn't enough to overcharge customers and squeeze competitors. Apple, which is grappling with COVID-19's impact on its retail operations, could be vulnerable too over accusations of how it wields market power. Late last year, email app developer Blix said it had data showing Apple suppressed App Store rankings of products that compete with Apple's own apps. In October, Blix sued Apple, alleging patent infringement and antitrust violations. On its website, Apple says its App Store provides \"equal opportunities to developers to deliver their apps and services across iPhone, iPad, Mac, Apple TV and Apple Watch.\" Amazon competes in a number of defined markets, antitrust experts such as Herbert Hovenkamp at the University of Pennsylvania point out. It is how the company interlinks those markets that has drawn the attention of antitrust investigators. It all makes for an interesting intersection of politics, economic power and cultural ethos when Cook, Bezos, Zuckerberg and Pichai testify before Congress on July 27. But will it be enough to evince significant change? At least one legal expert continues to have his doubts. \"Do they continue to act with impunity? Does the 2020 election change the calculus? There will be marginal changes on both counts,\" Andrew Jay Schwartzman, senior counselor with the Benton Institute for Broadband & Society, told MarketWatch. \"I don't see any signs the companies are compelled to make fundamental changes in the course they have been following.\""}]}