{"article": [{"url": "https://www.marketwatch.com/story/hes-34-years-old-and-owns-550-million-worth-of-apple-so-why-is-he-hoping-the-stock-gets-hammered-again-2020-06-22", "published": 1593258980.0, "headline": "Heâ\u0080\u0099s 34 years old and owns $550 million worth of Apple â\u0080\u0094 so why is he hoping the stock gets hammered?", "body": "Ryan Cohen isnâ\u0080\u0099t like other 34-year-olds. Not just because heâ\u0080\u0099s the billionaire founder of online pet retailer Chewy CHWY, +4.96% Â , but also because of his unique approach to handling all that money. Invest in another startup? Not yet, though heâ\u0080\u0099s played with the idea. Throw it into some big real estate venture? Nah. Stick it somewhere safe and chill on a beach? Not his style. No, the wealthy entrepreneur, who sold Chewy to PetSmart in 2017 for a cool $3.35 billion, decided to toss the bulk of his fortune into just two stocks: Apple AAPL, +1.74% Â and Wells Fargo WFC, Â , Despite wild fluctuations along the way, he wouldnâ\u0080\u0099t change a thing. “ â\u0080\u0098Iâ\u0080\u0099m happy to be misunderstood.â\u0080\u0099 ” Wealth managers traditionally tend to advocate a diversified investment portfolio, composed of a mix of 60% equities and 40% fixed-income assets, depending on age. Cohenâ\u0080\u0099s two-stock approach is very atypical and, even ill-advised, experts might argue. So, where did he get the idea to fly in the face of conventional Wall Street wisdom? â\u0080\u009cI learned from dad when I was 13,â\u0080\u009d he told MarketWatch. â\u0080\u009cHe showed me a chart comparing real estate to stock market returns, and it was really easy decision. Iâ\u0080\u0099ve been doing it ever since.â\u0080\u009d In a piece he wrote for Entrepreneur.com last month, Cohen described his late father, Ted Cohen, as a â\u0080\u009csuccessful glassware importer with an impeccable work ethicâ\u0080\u009d who wasnâ\u0080\u0099t interested in making a quick buck or accumulating material possessions. â\u0080\u009cEvery year, through thick and thin, he invested his savings into the stock market. He believed the real money was made through time in the market, not timing the market,â\u0080\u009d Cohen wrote. â\u0080\u009cHe bought blue chip companies and held them forever. His 20-year annualized stock returns were over 10 %. He never borrowed money or paid interest.â\u0080\u009d Cohen, however, admits he has a difficult time finding attractive alternatives, so when something comes along that he truly believes in, he jumps in head first. And Apple ticks all his boxes. â\u0080\u009cThe company has been underestimated for a long time. Appleâ\u0080\u0099s the king of the jungle. What the iPhone has done for our lives is unbelievable,â\u0080\u009d said Cohen, who lays claim to being Appleâ\u0080\u0099s biggest individual shareholder. â\u0080\u009cI only wish the stock would go down.â\u0080\u009d Down? Yes, down. And his wish came true earlier this year. Temporarily. In February, Apple surpassed a record high that made his stake worth more than half a billion dollars. A few weeks later, the coronavirus panic crushed the market and cut Apple shares by a third, leaving Cohen with a peak-to-trough paper loss of more than $151 million in that investment alone. The iPhone maker reclaimed that all-time high earlier this month for the first time since February and was trading in record territory on Monday. If that decline were to happen again, Cohen would gladly be there to scoop up more shares. In fact, he said that, if the price fell far enough, heâ\u0080\u0099d have no problem putting his entire net worth into it. â\u0080\u009cYou have to have the temperament. Iâ\u0080\u0099m happy to be misunderstood,â\u0080\u009d he said, adding that growing Chewy from nothing into a retail force hardened his resolve and gave him the confidence to go against the grain. â\u0080\u009cItâ\u0080\u0099s important not to be swayed by daily headlines and volatility.â\u0080\u009d That resolve has also been tested with his investment in Wells Fargo, which represents the other of half of his one-two investment combo. Unlike Apple, Wells hasnâ\u0080\u0099t bounced back from its recent declines, which means Cohen is sticking to the plan and adding to his position. â\u0080\u009cThe terminal value of the business hasnâ\u0080\u0099t changed because of coronavirus,â\u0080\u009d he said. While Wells Fargo is his clear favorite in the banking space, heâ\u0080\u0099s bullish on the sector in general. He views financial behemoths JPMorgan Chase & Co. JPM, -0.57% and Bank of America BAC, +0.47% also as compelling investments. As for the broader market, he says â\u0080\u009cthe single-biggest factor in determining valuations are interest rates,â\u0080\u009d and as long as they stay low, or even rise slowly, equities will perform. The less-risky alternatives just donâ\u0080\u0099t have enough upside in this climate, Cohen said. The stock market was rallying on Monday, with the Dow DJIA, +0.56%, Nasdaq COMP, +1.39% and S&P 500 SPX, +0.87% all attempting to recover from opening losses, and extend their recent rally from coronavirus lows put in back in March."}]}