{"article": [{"url": "https://www.marketwatch.com/story/jobless-claims-continue-slow-but-steady-descent-in-late-june-2020-07-02", "published": 1593685400.0, "headline": "U.S. jobless claims continue slow but steady descent in late June, falling to 1.43 million", "body": "The numbers: New applications for traditional jobless benefits continued a slow and steady descent in late June, moving in the right direction but at a slow pace that shows the labor market is still struggling to recover after the biggest wave of layoffs in American history. Initial jobless claims, a rough gauge of layoffs, dipped to 1.43 million in the seven days ended June 27 from 1.48 million in the prior week, the Labor Department said Thursday. The figures are seasonally adjusted. Economists polled by MarketWatch had forecast 1.40 million new claims. These figures reflect applications filed the normal way through state unemployment offices. Read: In latest dark twist of pandemic, companies appear to be cutting wages An additional 839,563 people applied for benefits last week through a temporary federal-relief program. The number of people receiving traditional jobless benefits, meanwhile, rose 59,000 in the week ended June 20 to 19.29 million. These are known as continuing claims. This is the first increase after three straight weekly declines, and could be a slgn that progress in the labor market is stalling. Read:Consumer confidence jumps to 3-month high, but still well below precrisis levels What happened: New jobless claims have been receding gradually as Americans return to work and the economy reopens. Yet millions still haven’t been able to go back to their old jobs and some have few prospects of doing so, especially in industries such as travel and tourism. In the separate monthly June employment report also released Thursday due to the July 4 holiday, the government said a net 4.8 million new jobs were created or restored. The U.S. lost more than 22 million jobs in March and April, however, during the height of the pandemic. The unemployment rate fell to 11.1% in June from 13.3% in the prior month.The data was stronger than expected. Economists contend the monthly employment report presents a more accurate picture of the labor market than weekly new jobless claims. States have overwhelmed by applications, including many duplicate claims, and some like Kentucky have fallen behind in processing applications that were filed weeks or months ago. More than 50 million new claims have been filed since mid-March. Before the crisis the states processed fewer than 225,000 claims a week. See: Marketwatch’s Coronavirus Economic Recovery Tracker Big picture: The economy experienced a big jolt of adrenaline once states began to reopen. What’s comes next is less easy to determine, especially after a fresh outbreak of coronavirus cases in states such as Texas, Florida and California that were among to first to relax restrictions. Other states like New York have since decided to go more slowly on reopening. What the latest outbreak underscores, economists say, is that the shape of the recovery is highly dependent on whether the virus is brought under control and treatments are discovered. They predict more bumps ahead as consumers and businesses navigate an uncertain future. What are they saying? “This report confirms that while activity may have bounced back strongly in the first phase of the recovery, the employment rebound has been lagging. The healing process will be a multi-year development with downside risks from renewed infections,” said Nancy Vanden Houten, economist at Oxford Economics. Market reaction:The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% were rose in Thursday trades on the strong jobs report."}]}