{"article": [{"url": "https://www.marketwatch.com/story/pelosi-threatens-to-keep-house-in-session-until-fiscal-stimulus-deal-done-11600183767", "published": 1600192100.0, "headline": "Pelosi threatens to keep House in session until fiscal stimulus deal done", "body": "Speaker of the House Nancy Pelosi. (Getty Images) U.S. House Speaker Nancy Pelosi said Tuesday she may keep the chamber in session, and House lawmakers in Washington, until another fiscal stimulus deal is done, raising the ante on the issue. “We are committed to staying here until we have an agreement, an agreement that meets the needs of the American people. We’re optimistic that the White House at least will understand that we have to do some things,” Pelosi said in an appearance on CNBC. Later, though, Pelosi’s top lieutenant, Democratic Whip Steny Hoyer, said House members may simply be on call to return to Washington to vote on a bill, not necessarily staying in the capital. That was the case in August, when House lawmakers returned to their districts but were called upon to return to Washington to vote on a postal bill. “I don’t think there is a difference” between that stance and what Pelosi was referring to, Hoyer told reporters on a weekly press call. Hoyer said keeping rank-and-file members in Washington was unnecessary to get another deal done. “Obviously we’re not going to negotiate this on the floor. Members don’t have to be on the floor to do this,” he said. Instead, any bargain would be hashed out by party leaders, including Pelosi, Senate Democratic leader Chuck Schumer and Senate Majority Leader Mitch McConnell, Hoyer said. Odds for another major stimulus package to be passed before the Nov. 3 presidential election dimmed considerably earlier, after Pelosi, McConnell and Treasury Secretary Steven Mnuchin all said the focus should be on passing a temporary spending bill to keep the government operating after Sept. 30. A stimulus package had been expected to hitch a ride with the yet-to-be negotiated continuing resolution, but once the decision was made to keep the issues separate, prospects for a standalone stimulus plan faded. Senate Republicans united behind a narrow bill last week in their first week back in session since August, but it was blocked by Senate Democrats. Republicans have said Democrats refuse to negotiate and that much less stimulus is needed than Democrats desire. Pelosi has said Democrats have lowered the amount they are seeking but Republicans and the White House have not proposed packages big enough to deal with the coronoavirus pandemic and its economic impact. The House is currently scheduled to recess to allow lawmakers to hit the election campaign trail on Oct. 2, two days after the Sept. 30 fiscal year-end deadline. Pelosi made similar comments about canceling the traditional August break if no deal was reached, but ultimately sent lawmakers home except for one weekend to vote on postal legislation. Pelosi’s hardline stance has rankled some in her caucus, who would rather have a small deal than go into the last weeks of the fall campaign season empty-handed. Some 25 House Democrats are part of a bipartisan group that calls itself the Problem Solvers Caucus, which proposed a $1.5 trillion plan as a compromise. “What brings us together — 25 Democrats and 25 Republicans — is our shared goal of finding a pragmatic solution — a bipartisan path forward — to help get negotiators to return to the table,” said group co-chair Rep. Josh Gottheimer, a Democrat from New Jersey. Pelosi on Tuesday continued to downplay the benefits of a narrow deal, in part because she said it was unlikely other issues would be taken up later. “There is no later with this administration. This is the opportunity,” she said. “A skinny deal is a Republican bill. That is not a deal, at all.” In a show of support for Pelosi’s stance, eight House committee chairmen and chairwomen late in the day publicly rejected the bipartisan Problem Solvers Caucus’ plan. “When it comes to bolstering the public health system, supporting state and local governments, and assisting struggling families, the Problem Solvers’ proposal leaves too many needs unmet,” the group of committee leaders wrote in a joint statement."}]}