{"article": [{"url": "https://www.marketwatch.com/story/how-small-business-owners-can-avoid-penalties-for-unpaid-federal-payroll-taxes-2020-08-10", "published": 1597038980.0, "headline": "How small business owners can avoid penalties for unpaid federal payroll taxes", "body": "The federal government considers some tax sins to be much worse than others. One egregious sin is failing to pay over federal income and employment taxes that have been withheld from employee paychecks. In the COVID-19 era, that can happen to a cash-strapped business. If it does, the IRS can assess the so-called 100% penalty against any responsible person. The 100% penalty is so-named because the entire unpaid federal payroll tax amount can be assessed as a penalty against a responsible person or several responsible persons. The idea behind the 100% penalty is that the Feds should be able to collect withheld but unpaid federal payroll taxes from unscrupulous individuals who had control over an employer’s finances. Fair enough in theory. However, as you will see, it doesn’t take all that much to be classified as a responsible person who is exposed to the 100% penalty. Unscrupulousness is not necessarily required. Thankfully, the Coronavirus Aid, Relief, and Economic Security (CARES) Act grants some meaningful federal payroll tax relief for this year without any eligibility rules. While future legislation might provide additional payroll tax relief, this column explains what’s available right now. But first, let’s cover how the dreaded 100% penalty works and why it’s so important to avoid it. Here goes. Who is a responsible person? The 100% penalty can only be assessed against a so-called responsible person. That could be a shareholder, director, officer, or employee of a corporation; a partner or employee of a partnership; or a member (owner) or employee of a multi-member LLC. It can also be assessed against an employee of a sole proprietorship or an employee of a single-member (one owner) LLC. To be hit with the 100% penalty, the individual must: (1) be responsible for collecting, accounting for, and paying over withheld federal taxes and (2) willfully fail to pay over those taxes. Willful means intentional, deliberate, voluntary, and knowing — as opposed to accidental. The mere authority to sign checks when directed to do so by a higher-up does not establish responsible person status. There must also be knowledge of and control over the finances of the business. However, you cannot deflect responsible person status by simply assigning signature authority over bank accounts to someone else. That said, the IRS will look first and look hard at individuals who have check-signing authority. Courts have examined several factors beyond check-signing authority to determine responsible person status, including whether the individual: (1) is an officer or director; (2) owns shares or possesses an entrepreneurial stake in the company; (3) is active in the management of day-to-day affairs of the company; (4) has the ability to hire and fire employees; (5) makes decisions regarding which, when, and in what order outstanding debts or taxes will be paid; and (6) exercises daily control over bank accounts and records of disbursements. In certain circumstances, outside parties such as lenders, attorneys, and accountants can also be responsible persons. For example, a tax attorney who actively participated in managing the finances of several corporations in which he had invested was found to be a responsible person, because he had check-signing authority and had previously exercised his authority as a corporate officer to correct the corporation’s failure to pay over employment taxes. In another case, an accounting firm was found to be a responsible person when it prepared a corporation’s tax returns, discussed the company’s budget and financial status with the company president, and authorized the payment of corporate bills without prior approval.Real-life horror stories The preceding outside-party scenarios are scary enough, but it’s even scarier for insiders. For example: A corporation’s newly hired CFO became aware that the company was several years behind on its payroll taxes and notified the company’s CEO of the situation. The CFO and CEO then informed the company’s board of directors. Although the company apparently had sufficient funds to pay the taxes, no payments were made. After the CFO and CEO were both fired, the IRS assessed the 100% penalty against them both for withheld but unpaid taxes that accrued during their tenures. The First Circuit Court of Appeals upheld an earlier district court ruling that the two officers were responsible persons who acted willfully by paying other expenses instead of the federal tax liabilities. Therefore, they were both personally liable for the 100% penalty. In another case, the IRS ruled that a volunteer member of a charitable organization’s board of trustees who had knowledge of the organization’s tax delinquency and authority to decide whether to pay the taxes was a responsible person. The president of a day care center’s board of directors, who was not paid for his work and was not involved in day-to-day operations, was found to be a responsible person because he secured loans for the center, directed its tax payments, and reviewed its financial reports. In yet another case, the executor of a deceased individual’s estate was found to be a responsible person when the operators of an inn (which was an asset of the estate that the executor was administering) failed to pay over withheld federal payroll taxes. Bottom line: As you can see, application of the responsible person rules can sometimes equate to the time-honored observation that “no good deed goes unpunished.” Ugh. CARES Act offers federal payroll tax deferral relief to all employers Enough bad stuff. The good news is that a CARES Act COVID-19 relief measure allows your business to defer the 6.2% employer portion of the Social Security tax component of FICA tax owed on the first $137,700 of an employee’s 2020 wages — for wages paid during the deferral period. The deferral period began on the 3/27/20 and will end on 12/31/20. Your business must then pay the deferred payroll tax amount in two installments: * Half by 12/31/21 * The remaining half by 12/31/22. This payroll tax deferral deal is available to all employers, small and large alike, with no requirement to show any specific COVID-19-related financial distress.CARES Act offers relief to self-employed folks, too If you’re self-employed, you’re not exposed to the 100% penalty issue unless you have employees. But you’re effectively exposed to a 100% penalty for any unpaid federal self-employment (SE) tax. Paying in that tax is all on you. Plus, you’ll be hit with an interest charge penalty if your quarterly estimated federal income tax payments don’t cover your SE tax bill. Thankfully, another CARES Act COVID-19 relief measure allows you to defer half of your liability for the 12.4% Social Security tax component of the SE tax for the deferral period. The 12.4% Social Security tax hits the first $137,700 of your 2020 net SE income. The SE tax deferral period began on 3/27/20 and will end on 12/31/20. You must then pay the deferred SE tax amount in two installments: * Half by 12/31/21 * The remaining half by 12/31/22. Takeaways When you participate in running a business or any entity that has not paid over federal payroll taxes that were withheld from employee paychecks, you run the risk of the IRS tagging you as a responsible person and being assessed the 100% penalty. If that happens, you may ultimately prove that you’re not a responsible person after all and get off the hook. But that could involve heavy professional fees and months (or more) of nerve-wracking stress. So, please consult your tax advisor about what records you should be keeping and what actions you should be taking (or not taking) to avoid exposure to the 100% penalty. Take advantage of the available CARES Act federal payroll tax deferral relief. If you’re self-employed, take advantage of the available CARES Act SE tax deferral relief."}]}