{"article": [{"url": "https://www.marketwatch.com/story/nikolas-stock-rockets-after-gm-takes-2-billion-equity-stake-announces-partnership-2020-09-08", "published": 1599581540.0, "headline": "Nikolaâ\u0080\u0099s stock rockets after GM takes $2 billion equity stake, announces partnership", "body": "Shares of Nikola Corp. rocketed higher Tuesday, after the battery- and hydrogen-electric vehicles maker disclosed a large equity investment by General Motors Co., as well as a â\u0080\u009cpotential game changingâ\u0080\u009d partnership to build the Nikola Badger pickup truck. The Phoenix-based Nikola NKLA, -1.36% Â said in a filing with the Securities and Exchange Commission that it entered into a subscription agreement last Thursday in which it will issue and sell 47.7 million shares of common stock to GM GM, -0.15%, valued at $2.0 billion. The value of the agreement was based on a stock price of $41.93, which was 16.1% above Thursdayâ\u0080\u0099s closing price of $36.13, but 16.2% below Tuesdayâ\u0080\u0099s closing price of $50.05. Nikola said the price per share was based on a volume-weighted average price over â\u0080\u009ca period of timeâ\u0080\u009d ending Sept. 2. The stock soared 40.8% in very active trading, to the highest close since July 16. Trading volume ballooned to 133.2 million shares, enough to make the stock the third-most active on the Nasdaq exchange, according to FactSet, and well more than the full-day average of about 15.5 million shares. “ â\u0080\u009cThere have been many skeptics around Nikola and its founder Trevor Miltonâ\u0080\u0099s ambitions over the coming years, which now get thrown out the window with stalwart GM making a major strategic bet on Nikola for the next decade on the EV and fuel cell front.â\u0080\u009d ” â\u0080\u0094 Wedbush analyst Dan Ives GM said Tuesday that it will be subject to lockup provisions, in which there will be restrictions on share sales starting in one year and ending in June 2025. â\u0080\u009cYou couldnâ\u0080\u0099t dream of a better partnership than this,â\u0080\u009d said Nikola Founder and Executive Chairman Trevor Milton. â\u0080\u009cBy joining together, we get access to their validated parts for all of our programs, General Motorsâ\u0080\u0099 Ultium battery technology and a multibillion-dollar fuel cell program ready for production.â\u0080\u009d Nikola had alluded to a deal last month when it reported second-quarter results, when the company said one of the milestones the company should be measured by is the announcement of an original equipment manufacturing (OEM) partner for the Badger by the end of 2020. Read more about Nikolaâ\u0080\u0099s Q2 results. And as part of the agreement, GM will provide Nikola access to its parts and components, including its Ultium battery technology, and GM will engineer, sanction, validate and manufacture the battery-electric and fuel-cell versions of Nikolaâ\u0080\u0099s Nikola Badger truck. GM will also be entitled to nominate one member for election to Nikolaâ\u0080\u0099s board of directors, who is â\u0080\u009creasonably acceptableâ\u0080\u009d to current board members. â\u0080\u009cWe are growing our presence in multiple high-volume EV segments while building scale to lower battery and fuel cell costs and increase profitability,â\u0080\u009d said GM Chief Executive Mary Barra. â\u0080\u009cIn addition, applying General Motorsâ\u0080\u0099 electrified technology solutions to the heavy-duty class of commercial vehicles is another important step in fulfilling our vision of a zero-emissions future.â\u0080\u009d Wedbush analyst Dan Ives said the partnership was a â\u0080\u009cpotential game changingâ\u0080\u009d deal for Nikola, as it could save the company more than $4 billion in battery and powertrain costs over the next decade, and more than $1 billion in engineering and validation costs. â\u0080\u009cThis news is a huge shot in the arm for Nikola and cements credibility not just for its Badger production slated to begin by the end of 2022 but for its hydrogen fuel cell ambitions and semi-truck vision going forward,â\u0080\u009d Ives wrote in a note to clients. â\u0080\u009cThere have been many skeptics around Nikola and its founder Trevor Miltonâ\u0080\u0099s ambitions over the coming years, which now get thrown out the window with stalwart GM making a major strategic bet on Nikola for the next decade on the EV and fuel cell front.â\u0080\u009d See related: Nikola stock dips after report of CEO exaggerations. Nikolaâ\u0080\u0099s stock has powered up 385.0% year to date, while the S&P 500 index SPX, +0.87% Â has gained 3.1%. Nikola will remain responsible for the sales and marketing of the Badger, which is expected to make its public debut at Nikola World 2020 in Arizona, scheduled for Dec. 3 to Dec. 5. Badger production is expected to start in late 2022, at a location to be announced later. In â\u0080\u009ccelebrationâ\u0080\u009d of the GM partnership, Nikola said preorder reservations for the Badger are now available for $100. Nikolaâ\u0080\u0099s stock surge helped provide a boost to the shares of fellow EV truck maker Workhorse Group Inc. WKHS, +12.62%, which ran up 8.5% to a record close of $21.38. Meanwhile, industry leader Tesla Inc.â\u0080\u0099s stock TSLA, +1.89% Â plunged 21.1%, after S&P DJ Indices made changes to the benchmark S&P 500 index, and did not include Tesla, despite widespread speculation that it would be added. Donâ\u0080\u0099t miss: Tesla stock tumbles toward second bear market in 6 months."}]}