{"article": [{"url": "https://www.marketwatch.com/story/the-real-reason-for-the-stock-markets-7-plunge-shouldnt-surprise-you-and-it-happens-every-time-2020-06-11", "published": 1592034680.0, "headline": "The real reason for the stock marketâ\u0080\u0099s 7% plunge shouldnâ\u0080\u0099t surprise you â\u0080\u0094 and it happens every time", "body": "Hereâ\u0080\u0099s why the U.S. stock market plunged on Thursday: Too many bulls. Youâ\u0080\u0099ll hear other explanations, such as the risk of a second wave of COVID-19 infections and the Fedâ\u0080\u0099s grim outlook for the U.S. economy. But such factors canâ\u0080\u0099t really explain why the Dow Jones Industrial Average DJIA, +0.56% Â lost 6.9% and the S&P 500 SPX, +0.87% Â fell 5.9% on Thursday. After all, new COVID-19 cases have been disturbingly high for several weeks; the number reported on Thursday was not significantly different than any other day of recent weeks. And for some time now health experts have been expressing concern about a potentially even more lethal second wave of infections this coming winter. One indicator that helps fill this explanatory void is market sentiment. Only this week did bullishness among short-term market timers start to reach a dangerous extreme; contrarians therefore were not particularly surprised by Thursdayâ\u0080\u0099s decline. As recently as a week ago, short-term stock market timers were â\u0080\u009csurprisingly subdued.â\u0080\u009d Because of that, contrarians were predicting that â\u0080\u009cthe Nasdaq is likely to hit an all-time high.â\u0080\u009d The Nasdaq Composite COMP, +1.39% did indeed reach a new high earlier this week, closing above the 10,000 level on Wednesday â\u0080\u0094 only to lose 5.3% a day later. “ Sentiment wonâ\u0080\u0099t shift back to supporting higher prices until thereâ\u0080\u0099s a lot more skepticism. ” Unfortunately for stock investorsâ\u0080\u0099 near-term prospects, market-timer sentiment wonâ\u0080\u0099t shift back to supporting higher prices until thereâ\u0080\u0099s a lot more skepticism. Thursdayâ\u0080\u0099s plunge started that process, but thereâ\u0080\u0099s a long way to go. Consider the average recommended stock market exposure level among several dozen short-term stock market timers that I monitor on a daily basis (as measured by the Hulbert Stock Newsletter Sentiment Index, or HSNSI). Earlier this week, this average rose to 62.5%, which was at the 91st percentile of the distribution of daily HSNSI readings since 2000. Thatâ\u0080\u0099s just inside the zone of extreme bullishness, as defined by being in the top 10% of such readingsâ\u0080\u0094as you can see from the accompanying chart. The typical pattern is that, once the HSNSI rises into this zone of extreme bullishness, it drops significantly. It often falls back to the 10th percentile or lower. The threshold for that zone of extreme bearishness is minus 2.7%, a reading that would indicate that the average timer is allocating 2.7% of his short-term equity trading portfolio to going short. Weâ\u0080\u0099re far from that now. In the wake of Thursdayâ\u0080\u0099s plunge, the HSNSI dropped back just to 53.6%, which is still at the 77th percentile of the historical distribution. Itâ\u0080\u0099s hard to predict how much further the market will need to drop to cause the average short-term market timer to enter that zone of extreme bearishness. Itâ\u0080\u0099s possible that just a few days of volatility will do the trick, but it also could be a long, hot summer for stock investors. Contrarians insist that thereâ\u0080\u0099s no need to predict, since we can sit back and let the market timers tell their story on a day-by-day basis. Weâ\u0080\u0099ll know soon enough when those timers throw in the towel and contrarians again become willing to bet on a rising market. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com More from MarketWatch: Low-information â\u0080\u0098investorsâ\u0080\u0099 rule the stock market â\u0080\u0094 at least until they lose every cent Beware of these popular stocks when the crisis â\u0080\u0098gradually, then suddenlyâ\u0080\u0099 emerges, fund manager warns These U.S. stocks paced the marketâ\u0080\u0099s brutal decline Thursday"}]}