{"article": [{"url": "https://www.marketwatch.com/story/what-the-1921-tulsa-race-massacre-can-teach-us-about-the-racial-wealth-gap-in-2020-2020-06-19", "published": 1592641340.0, "headline": "One day after Juneteenth, Trump will hold a rally in Tulsa, where a massacre destroyed 'Black Wall Street' nearly 100 years ago", "body": "The past few weeks have brought renewed attention to the systemic racism embedded in so many institutions in American society, including those that we rely on to build wealth. There are few events more illustrative of the obstacles black Americans have historically faced to accessing economic prosperity than the Tulsa Race Massacre of 1921. In roughly 24 hours, a white mob destroyed an estimated at least $1.47 million - or more than $20 million in today's dollars - of black-owned homes and businesses, according to a state report on the event released in 2001. Despite economic and general segregation, black Tulsans had built a prosperous business district in the Greenwood neighborhood of Tulsa, known as Black Wall Street. But a false allegation of assault made by a white woman against a black man was enough to ignite a riot fueled by decades of economic jealousy that burned that thriving community to the ground. In a recent viral video on Instagram FB, +0.26%  author Kimberly Latrice Jones used the game of Monopoly to explain the impact of events like the Tulsa massacre on the racial wealth gap. That history continues to inform the lived experience of black Americans: As of 2016, the median black household had a net worth of roughly $17,000 compared with $171,000 for the median white household, according to one estimate. \"If I play 400 rounds of Monopoly with you and I have to play and give you every dime I made and for 50 years every time that I played, if you didn't like what I did you got to burn it like they did in Tulsa â\u0080¦ how can you win, how can you win? You can't win. The game is fixed,\" Jones said in the video. Put another way: \"The event that was the massacre, it's actually a great disruptor of the economic well-being of black folks and it also disrupts the transfer of wealth intergenerationally,\" said Hannibal B. Johnson, the author of \"Black Wall Street: From Riot to Renaissance in Tulsa's Historic Greenwood District.\" Amid this backdrop, President Donald Trump will hold a campaign rally in Tulsa on June 20, the day after Juneteenth, which commemorates the emancipation of enslaved people following the Civil War. The local newspaper, the Tulsa World, decried the decision in an editorial. \"There's no reason to think a Trump appearance in Tulsa will have any effect on November's election outcome in Tulsa or Oklahoma,\" the paper wrote. \"It has already concentrated the world's attention [on] the fact that Trump will be rallying in a city that 99 years ago was the site of a bloody race massacre.\"The building of Black Wall Street Black Americans first arrived in what would become the state of Oklahoma during the 1830s and 1840s as part of the forced migration of Native American tribes to the area. The five tribes that traveled to Oklahoma as part of the Trail of Tears owned black slaves, intermarried with the black community and also counted some freedman among their members. Following the Civil War, the black members of these communities became formal members of these tribes in most cases. Eventually, the federal government got rid of tribal sovereignty and in exchange allotted individual members of the tribes plots of land. The black members of these tribes in Oklahoma received land too. This arrangement provided black Americans in Oklahoma relatively unique access to private property, a tool they were able to use to build wealth, said Russell Cobb, the author of \"The Great Oklahoma Swindle: Race, Religion and Lies in America's Weirdest State.\" \"It took its cues from Harlem and Chicago, but what distinguishes the Greenwood District from Harlem and even Chicago is land ownership,\" said Quraysh Ali Lansana, a poet, author and professor, who is teaching a course on Black Wall Street's history at Oklahoma State University's Tulsa campus. \"Black folks owned their land and owned their property.\" Though land ownership set Oklahoma's black residents apart from many black Americans in other parts of the country, they were still subject to the Jim Crow laws and severe segregation present in the rest of the region. \"They couldn't for example get the same extension of credit as white people could get,\" Johnson said. \"They couldn't patronize white shops and white businesses. The Greenwood community, Black Wall Street, was a community borne of necessity.\" Despite the name that's stuck for decades, people didn't actually trade stocks there; what the community created was really more of a Black Main Street, Johnson said. In 1920, the year before the massacre, Greenwood boasted six billiards halls, 23 grocers or meat markets, 20 restaurants and four hotels, according to data compiled by Chris Messer, now a professor at Colorado State University-Pueblo, as part of his doctoral dissertation, \"The Tulsa Race Riot of 1921: Determining its causes and its framing.\" Messer's research indicates that there were also three dentists, eight lawyers, 19 physicians or surgeons, 20 skilled craftspeople and eight bankers, among other professionals. Walter White, an NAACP official who investigated the Tulsa violence at the time, described the wealth in the community in a dispatch for The Nation magazine, noting that there were two black men each with a net worth of $150,000 - about $2.2 million in today's dollars - two worth $100,000 and three worth $50,000. \"These are black folks in the early nineteen teens and the early 1900s when oppression was really palpable,\" Johnson said. \"That they were able to carve out this little oasis of prosperity is remarkable.\"'Bitter Resentment' But that wealth engendered \"bitter resentment,\" from members of Tulsa's white community, who felt that members of an \"'inferior race,' are exceedingly presumptuous in achieving greater economic prosperity than they who are members of a divinely ordered superior race,\" White wrote. An allegation (later proven false) from a white woman that a black man attempted to assault her in an elevator and the publicity it received in a local newspaper, the Tulsa Tribune - headlined \"Nab Negro for Attacking Girl In Elevator\" - provided the \"spark that set off the blaze,\" White wrote. But he cited a variety of other factors, including jealousy over Greenwood's economic prosperity, that had been stoking tension for decades. After the man was arrested, crowds gathered outside the courthouse where he was being held. Black Greenwood residents, worried about his safety in an era of frequent lynchings, came armed to protect him. A white man tried to disarm one of the black men, a scuffle ensued, then a shot rang out. A white mob went into Greenwood and leveled the community, killing up to 300 people, leaving the area's black residents homeless, and destroying their businesses. An black photographer evaluates the ruins of the Midway hotel in Greenwood. Special Collections, McFarlin Library, The University of Tulsa An example of the resentment the white mob felt over the black community's economic success: A white man led a group to destroy his own place of employment, a black-owned printing plant with $25,000-worth of printing equipment inside, White wrote. 'If it got too successful it would be destroyed' The destruction of Tulsa's black business community left other black businesspeople fearful of becoming too prosperous, said Mehrsa Baradaran, a professor at the University of California-Irvine's law school. As Baradaran describes in her book, \"The Color of Money: Black Banks and the Racial Wealth Gap,\" black businessmen in Durham, North Carolina, took steps to make sure their achievements never outshined their white neighbors' - like keeping their buildings lower in height than those of their white counterparts. \"They just made sure that they were never going to be a threat to the other businesses,\" Baradaran said. \"Imagine if your business, if it got too successful it would be destroyed.\" That experience was a counterpoint to the promise made by white and black boosters of a self-help philosophy, who argued that black Americans could achieve the power they were unable to access through the political and legal system, simply by becoming prosperous, Baradaran said. See also:5 ways to support black-owned businesses: 'It's not rocket science - people just choose not to do it' \"You can't create wealth and maintain it if the state won't protect your property, if the state protects property otherwise,\" Baradaran said. Evidence indicates that police not only failed to stop the destruction of Black Wall Street, but also participated in it. In addition, black residents of Greenwood were unable to get any insurance payouts to compensate for property damage as a result of the violence. Eventually, the motivations undergirding the events like the Tulsa massacre became coded into law, Baradaran said. Instead of using bombs, fires and threats to prevent black economic success, white America turned in the mid-20th century to legal structures, like homeowner's associations, redlining and racial covenants that kept back homeowners and businesses segregated in a less-prosperous economy. \"The law really does step in and the violence becomes less necessary,\" Baradaran said. Greenwood rebuilt In the years immediately following the Tulsa Race Massacre, the residents of Greenwood who remained were able to rebuild Black Wall Street. The community thrived for decades until an interstate highway was routed through it as part of a plan for \"urban renewal\" - a program implemented in cities across the country during the mid-20th century that often bifurcated communities of color, Baradaran said. Integration, which provided black Tulsans the opportunity to shop in the white community, but also took money outside of the black community, also played a role in the decline of Black Wall Street, Johnson said. In the decades since, activists and community members have been working to draw attention to the history of Black Wall Street and ensure that residents, the nation and the world learn the story of the neighborhood's entrepreneurial success and the Tulsa Race Massacre. These efforts have ramped up in the past few years in the lead up to the 100th anniversary of the violence. Earlier this year, the city announced a plan to excavate a small area of a Tulsa cemetery to look for evidence of a mass grave. This year, the state also required public schools to teach students about the massacre and the history of the neighborhood it destroyed. J. Kavin Ross, a photojournalist for the Greenwood Tribune, said he worries that Trump's divisive rhetoric at a rally during the weekend of Juneteenth, a day that commemorates the freeing of black slaves following the Civil War, could erode some of that progress. Still, he's hopeful the spotlight could help further his cause. Ross' father helped bring attention to the massacre through a 1970s magazine article and later as a state representative. Don Ross introduced the bill that required the state to commission a study of the massacre; the ensuing report recommended that survivors of the violence and their descendents be paid reparations. \"What comes with a presidential visit is international press,\" Ross said. \"That brings a lot of attention towards the Greenwood area that's been hidden for so many decades. As we're about to come on our 100th year, we want all the attention possible to be focused on Tulsa and on the Black Wall Street area.\""}]}