{"article": [{"url": "https://www.marketwatch.com/story/ive-been-married-42-years-i-cook-clean-and-take-care-of-our-finances-he-paid-for-a-trip-to-paris-then-asked-for-the-money-back-2020-10-07", "published": 1602164840.0, "headline": "We've been married 42 years. I cook, clean and take care of our finances. He paid for a trip to Paris, then asked for the money back", "body": "Dear Moneyist, I have been married for 42 years. He is a nice man, with a good personality and great social skills. I do housework and take care of other appointments as needed. I cook, do small home repairs and painting, etc., and take care of all our financial planning. I worked in a medical career. He was in IT at a prestigious university. I am getting older. He has this idea that I have all of this money. I do not. I manage it. Everything is in both our names. I manage all our finances. His income is five times my income. He has always been very passive-aggressive. If I ask him for help with tasks, he acts very put-upon and I end up angry. He forgets things that I ask him to do on purpose, and is always late delivering. The Moneyist:'I feel very bitter': My late father gave my sister power of attorney. She kept $100K of his savings. Should I pursue legal action? He does not do any important little things for me. For instance, he pretends to forget to pick up flowers. We have not been to a movie together for the longest time. He is not interested. He has said he will NOT go out to dinner with me or travel. He paid for a trip to Paris in 2018, then he wanted the money back. He takes no responsibility for managing our finances or our lives, but he loves to go to the gym and hike by himself. He does not chase women, gamble or drink heavily. For the past 20 years, I have gone on little jaunts on my own to see old friends and family. I went to Boston last January for a weekend for my birthday. It was fun. I went to museums and took myself out for dinners. I liked it. Another time, I went to Seattle alone for three weeks. I attended lots of musical events, including symphony and opera. I plan to do more travel post-COVID. What else can I do? Moreover, what might I realistically expect from him in the years ahead, especially when we finally retire? Still Vital Dear Vital, Could he allow you to see a few of those social skills? I have a rule for all relationships, romantic or otherwise. Some people will give you coffee beans, and others will leave you the grinds. Your husband saves his coffee beans for others and brings the grinds home. You are his cook, housekeeper, bookkeeper, event planner, personal assistant, and fixer-upper. That hasn't changed over the course of your 42 years of marriage, and it won't change after you retire. The transactional nature of your marriage was brought into sharp relief when your husband asked for the money back from the trip to Paris. But your marriage appears to be based on many unspoken transactions. He earns the lion's share of your household's income, and you make up for that by taking care of his needs. I've said this before and I'll say it again: Love is an action. It's not a word or a wedding band or a belief, or even a commitment to live together. The Moneyist: My mom gave $250K to my aunt to buy a home. My aunt has a mild intellectual disability and I'm afraid someone will take advantage of her You can't rely on your husband to change, so what can you do? You can use your retirement to travel, take classes and build up your social life in other ways, and tell your husband that he needs to take care of himself. Or you could take a page out of the book belonging to the woman whose husband had an affair after 20 years, and file for divorce. That way, you will be free to live your own life. You can change. But change doesn't take time - it takes work. That involves looking at yourself, too, as well as your marriage. Everything is a choice, and you have chosen this life. Why? What did you get out of it? Companionship, financial security, a sense of belonging, the feeling that you are needed? Or does this fulfill a role of martyr? You could do this for another 42 years and tell friends about his odd behavior, but sooner or later, people will tire of hearing the stories. And there are no Nobel Prizes for putting up with self-centered people. You are not responsible for your husband. You are only responsible for yourself. You can email The Moneyist with any financial and ethical questions related to coronavirus at qfottrell@marketwatch.com Hello there, MarketWatchers. Check outthe Moneyist private Facebook FB, +0.26%  group where we look for answers to life's thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}