{"article": [{"url": "https://www.marketwatch.com/story/abbott-exec-why-better-covid-19-tests-may-help-the-us-get-back-to-normal-2020-09-30", "published": 1601809940.0, "headline": "Abbott exec: Why better COVID-19 tests may help the U.S. get back to normal", "body": "This interview is part of a series of conversations MarketWatch is conducting with the leading voices in the U.S. on the COVID-19 pandemic. In less than seven months, Abbott Laboratories has introduced six COVID-19 tests, each a little different than the last, and that’s all part of the diagnostics company’s strategy to keep improving and enhancing tests that can detect current and past infections with the novel coronavirus. “These viruses all behave a little differently,” said John Hackett, divisional VP of applied research and technology for Abbott Laboratories’ ABT, +1.02% diagnostics business. “As we learn more about them, we adapt. Right from the beginning, we looked at this as an iterative process, because we’re learning as we go along.” Hackett runs the company’s global virus surveillance program and the team of workers who developed the six COVID-19 diagnostic and serologic tests that have received emergency use authorization (EUA) from the Food and Drug Administration during this pandemic. A diagnostic test, which can be a molecular or antigen test, reveals a current infection, while serologic tests detect antibodies, which indicate previous exposure or infection to the novel coronavirus. Abbott has long focused on tests for blood-borne illnesses like hepatitis and HIV, bringing to market the first test used to screen blood donors for HIV in 1985. When outbreaks of the Zika virus were first reported back in 2015, Abbott shifted gears, getting a molecular test that could diagnose infections with the mosquito-borne virus authorized by early 2017. With SARS-CoV-2, the stakes are even higher. Abbott received its first EUA for the m2000 diagnostic test on March 18, just one week after the World Health Organization declared a pandemic, and among its five other COVID-19 tests is a $5 antigen test that can report results with 15 minutes. The company’s stock has rallied 21.2% since the start of the year. That said, there have been challenges. A small study was published as a preprint in mid-May, meaning it hadn’t been peer-reviewed, questioning the accuracy of one Abbott diagnostic test. The FDA issued an alert telling health care providers to consider a backup test. A spokesperson for the company said the test has “accuracy rates as high as 94.7%.” MarketWatch: What was the first moment you realized what the world was going to be dealing with in terms of COVID-19? John Hackett: I recall in late December discussing it with Gavin Cloherty, who heads up our infectious disease program under me. As information became more publicly available, as we moved into early January — and, of course, the sequence of the first virus was January 11 — we started doing foundational work thinking about if we were going to develop a test, how would we do it. We went from a world where there were very few cases reported and there wasn’t evidence early on, at least publicly being provided, that indicated human-to-human transmission, and then we were watching that scenario as it changed. Frankly, by the end of January, we were realizing we definitely needed tests that could detect the virus directly. MarketWatch: Abbott has had a handful of diagnostic and antibody tests authorized by the Food and Drug Administration during the pandemic. How did you think about speed versus accuracy given the nature of this pandemic? Hackett: The Zika EUA — that took nine months from start to EUA approval. We launched m2000 in a month. The other question is: How are you going to supply it? You can create the best test in the world and not be able to scale. In all of these programs, there has been parallel ongoing work done on risk because you don’t know where we’re going to be with the finished product. But it was the only way that we could set up and get a reliable supply chain. MarketWatch: There has been some debate in the medical community about what role antibody tests should play. How do you think about the role of antibody tests now and into the future as well? MarketWatch: The antibody testing world is evolving already and will continue to evolve. There’s no one test that’s going to be able to do it all. As we were developing our first antibody test, there were a lot of things to think about: Which protein of the virus do you target? Do you target nucleic acid or spike? We know, based on MERS and the original SARS outbreak, that both those proteins can trigger a very strong immune response. But this is a new virus, and you need the right samples. You also need to be able to create the right types of recombinant proteins. Looking at IgG antibodies, which is what we focused on first, we hope that could have some relationship to protection. But none of us knew the answer, and we’re still determining that answer. IgM is next. Usually, IgM emerges before IgG. [Editor’s note: People who have been infected with the virus can develop IgM and IgG antibodies. The Centers for Disease Control and Prevention said it’s uncommon for IgM to develop without IgG. These are the antibodies that serologic tests are looking for although some people who have contracted the virus do not develop any antibodies.] But these used together can be advantageous to a physician. Even the molecular tests, when you’re sampling the nasopharyngeal cavity, early after symptom onset, there can be very high levels of virus, but even those decline over time. If a patient comes in a week or two weeks after symptom onset, having antibody, in addition to molecular, can be a real advantage. We’re working on tests where we’re looking at, for example, quantitation of IgG. So, not only is it present, but how much is there? This could become very important. Even when we have a vaccine, how would you differentiate an individual who has been vaccinated from someone who’s actually had natural infection? You don’t want a serologic test that can only detect antibodies elicited by the vaccine. MarketWatch: We’ve heard there have been a few reports of reinfection. How do you think about something like the possibility of reinfection when it comes to test development? Hackett: We really don’t have a clear answer on reinfection. We know for certain that the strain of virus that the individual [in Hong Kong]had initially was different than the strain of virus, which is being detected subsequently. With typical, common human coronaviruses, it seems that the antibody response wanes over time. Well, from an immunologic standpoint, if a person was reinfected, would you actually see those antibody levels increase? That actually could be a very sensitive measure that an individual has been infected. And again, quantitative antibody tests could be of real interest here. And it’s something we’re exploring. And just because antibody levels wane doesn’t mean there isn’t hope. Because you also have the T-cells. [Editor’s note: T- cells are another measure used to assess the immune response.] You have the other arm of the immune system, which can be active, and it may well be that if an individual is re-exposed, that arm is what provides much of the defense. We’re getting to nine months, 10 months — this has been our window to learn about this virus. We have a great deal to learn yet. MarketWatch: Abbott recently launched an antigen test and a mobile app that allows people to share their results with others, such as employers. When I read about this, it reminded me of the concept of immunity passports. What role do you see that app playing six months or a year into the future? Are we all going to have some version of this on our phones? Hackett: We were recognizing that we had laboratory-based tests. We’re testing people. We still had a lot of new infections occurring. And the fundamental question is: How are we going to open schools? How are we going to open workplaces again? The concept behind that [test and app] is we need something that’s fast, easy to use, portable, and preferably not have an instrument. This mobile app, its overall goal is trying to ensure safer access as we get back to workplaces, schools, and other organizations. Antigen tests will never be as sensitive as laboratory-based PCR tests. But they are sensitive and can be accurate. And the key thing is that we’re identifying individuals who are contagious, who have potential to spread the disease. The app assists being able to utilize that data. The goal is to help people be more confident about returning to life. If you have a negative test, the health care provider would essentially program that in. The individual on the app would see that they were negative. You could use that like a boarding pass. MarketWatch: Is the future of COVID-19 testing still a swab? Is it saliva-based? Hackett: We’re actively looking at that. As we learn more about the virus, we think about other places we could go. The BinaxNOW test was developed with the concept of a nasal swab, not nasopharyngeal, so big difference. [Editor’s note: A nasal swab is much less invasive than the nasopharyngeal swab, which enters much further into someone’s airway.] It may be that the virus levels are slightly different between the nasopharyngeal compartment and the nasal compartment. But it’s so much more convenient for both the patient as well as the health care provider, because the nasopharyngeal can trigger coughing, sneezing. It’s a challenge, which can spread the virus. Saliva is very appealing, and we’re looking at it in various applications, too. These viruses all behave a little differently. As we learn more about them, we adapt. Right from the beginning, we looked at this as going to be an iterative process, because we’re learning as we go along. And, you know, we want to fine-tune to really be able to capture and diagnose infections like we need to. This Q&A has been edited for clarity and length. Read more A Word from the Experts interviews: • Philadelphia pediatrician Paul Offit: Prepare to wear masks and socially distance even after getting COVID-19 vaccine • To defeat COVID-19, ‘we need a unified national strategy,’ says public health expert Dr. Howard Koh • A lung doctor on what she’s learning about coronavirus ‘long haulers’: shortness of breath, fatigue, and depression but also ‘improvement over time’"}]}