{"article": [{"url": "https://www.marketwatch.com/story/mitt-romney-says-fellow-senate-republican-ron-johnsons-probe-into-biden-son-is-not-a-legitimate-function-of-government-2020-09-16", "published": 1600330640.0, "headline": "Mitt Romney says fellow Senate Republican Ron Johnsonâ\u0080\u0099s probe into Biden son is not a legitimate function of government", "body": "WASHINGTON (AP) â\u0080\u0094 Republican Sen. Mitt Romney is sharply criticizing an investigation by his own party into Democratic presidential nominee Joe Bidenâ\u0080\u0099s son, saying itâ\u0080\u0099s â\u0080\u009cnot the legitimate role of governmentâ\u0080\u009d to try and damage political opponents. GOP Sen. Ron Johnson, chairman of the Senate Homeland Security and Governmental Affairs, has said the committee will issue a report before the Nov. 3 election on Hunter Bidenâ\u0080\u0099s activities in Ukraine. Johnson, a close ally of President Donald Trump, is leading the investigation into Burisma, a gas company in Ukraine that paid Hunter Biden to serve as a board member while Joe Biden was vice president to President Barack Obama. He has been quoted as saying he thought his investigation â\u0080\u009cwould certainly help Donald Trump win re-election.â\u0080\u009d See:Wisconsin Republican Ron Johnson on defensive over probe of Biden and Ukraine in wake of intelligence assessment about ongoing Russian election interference Most Republican senators have been on board with Johnsonâ\u0080\u0099s inquiry. But Romney, a frequent Trump critic, has repeatedly made clear he has concerns about politicizing the committeeâ\u0080\u0099s work. “ â\u0080\u0098Obviously, it is the province of campaigns and political partiesâ\u0080\u0099 opposition research, the media, to carry out political endeavors, to learn about or dust up oneâ\u0080\u0099s opponent. But itâ\u0080\u0099s not the legitimate role of government or Congress, or for taxpayer expense to be used in an effort to damage political opponents.â\u0080\u0099 ” â\u0080\u0094 Sen. Mitt Romney The Utah lawmaker, who was the 2012 Republican presidential candidate, had his strongest words yet for what he called the â\u0080\u009cBiden-Burismaâ\u0080\u009d investigation at a committee meeting Wednesday, saying that the inquiry from the â\u0080\u009coutset had the earmarks of a political exercise.â\u0080\u009d Romney added: â\u0080\u009cObviously, it is the province of campaigns and political partiesâ\u0080\u0099 opposition research, the media, to carry out political endeavors, to learn about or dust up oneâ\u0080\u0099s opponent. But itâ\u0080\u0099s not the legitimate role of government or Congress, or for taxpayer expense to be used in an effort to damage political opponents.â\u0080\u009d From the archives (March 2020):Romney says he will vote to back fellow Republican Ron Johnsonâ\u0080\u0099s push to investigate Burisma and Bidens Johnson did not respond to the comments during the meeting. But he had earlier withdrawn from the meetingâ\u0080\u0099s agenda a vote to authorize an additional subpoena, a move that Romney praised. Senate Homeland Security and Governmental Affairs Committee Chairman Ron Johnson of Wisconsin speaks during a Wednesday meeting of the committee. Associated Press A committee aide said that the subpoena was withdrawn because the witness, Bridget Brink, the U.S. ambassador to Slovakia, had agreed to testify voluntarily. The aide was not authorized to publicly discuss committee work taking place in private and spoke on condition of anonymity. In a statement responding to Romneyâ\u0080\u0099s comments, Johnson spokesman Ben Voelkel said â\u0080\u009cthe American people have the right to knowâ\u0080\u009d the facts of the investigation. â\u0080\u009cThis is Congress,â\u0080\u009d Voelkel said. â\u0080\u009cEverything here has implications for politics and elections. The Committee is expressly authorized to investigate conflicts of interest, and its investigation into Burisma and U.S.-Ukraine policy began well before the Democratic nominee for President had been decided.â\u0080\u009d There is no evidence of wrongdoing by the Bidens, and Hunter Biden has denied using his influence with his father to aid Burisma. In a statement, Joe Biden spokesman Andrew Bates called the investigation â\u0080\u009cdisgraceful.â\u0080\u009d NBC News reported early Thursday that the Johnson-led committee would hear later in the day from a former State Department official who has reportedly told colleagues that Burisma had no bearing on U.S. policy toward Ukraine. “ Johnson objected as Senate Minority Leader Chuck Schumer and Sen. Ron Wyden offered a resolution calling for â\u0080\u0098the cessation of any Senate investigation or activity that allows Congress to act as a conduit for Russian disinformation.â\u0080\u0099 ” Senate Democrats have strongly objected to the inquiry and have charged that Johnson could be amplifying Russian propaganda to hurt Biden. After Wednesdayâ\u0080\u0099s meeting, Senate Democratic leader Chuck Schumer of New York and Sen. Ron Wyden, an Oregon Democrat, offered a resolution calling for â\u0080\u009cthe cessation of any Senate investigation or activity that allows Congress to act as a conduit for Russian disinformation.â\u0080\u009d Johnson himself came to the floor to object, preventing the measureâ\u0080\u0099s passage. He denied that any Russian disinformation was part of the investigation, calling the Democratsâ\u0080\u0099 resolution â\u0080\u009cfalse chargesâ\u0080\u009d and â\u0080\u009cwild claims against me.â\u0080\u009d Republicans coming to Trumpâ\u0080\u0099s defense during and after last yearâ\u0080\u0099s impeachment trial have encouraged investigations of Hunter Bidenâ\u0080\u0099s activities, questioning whether his highly paid job created a conflict of interest for Joe Biden as the elder Biden worked on Ukraine policy in the Obama administration. Trump has frequently mentioned Hunter Bidenâ\u0080\u0099s activities during his re-election campaign. The presidentâ\u0080\u0099s efforts to have Ukraine investigate Hunter Bidenâ\u0080\u0099s role were also at the heart of last yearâ\u0080\u0099s House impeachment investigation. Trump asked Ukrainian President Volodymyr Zelensky to investigate the Bidens on a July phone call that was later revealed by a whistleblowerâ\u0080\u0099s complaint. The House impeached Trump in December for pressuring the Ukrainian government on investigations while withholding military aid to the country. The Senate acquitted him in February. Romney was the only Republican to vote for one of the articles of impeachment. See:Republican report on impeachment says Trump acted prudently and out of a â\u0080\u0098deepseatedâ\u0080\u0099 concern about corruption in Ukraine Johnsonâ\u0080\u0099s committee, along with the Senate Judiciary Committee, is also looking into the origins of the Justice Departmentâ\u0080\u0099s Russia probe. The committee voted a second time to issue subpoenas in that investigation. MarketWatch contributed. Read on:Top federal prosecutor quits Barr-ordered Durham probe into origins of Russia-Trump investigation"}]}