{"article": [{"url": "https://www.marketwatch.com/story/u-s-will-have-a-delayed-effect-of-seeing-the-normal-effects-of-recession-says-jpmorgans-dimon-11597160306", "published": 1597148240.0, "headline": "U.S. will eventually experience 'the normal effects of recession,' says J.P. Morgan's Jamie Dimon", "body": "“ 'We're in a recession, but you're going to have a delayed effect of seeing the normal effects of recession.' ” - Jamie Dimon, CEO of JPMorgan Chase & Co. That is Jamie Dimon, CEO of JPMorgan Chase & Co., offering his view on the outlook for the economy in amid the continuing coronavirus pandemic. Speaking to MSNBC's Stephanie Ruhle in an interview that aired on Tuesday, the billionaire CEO of the nation's largest bank by market value forecast a tough road ahead for recovery from the recession that Americans currently find themselves mired in. The bank boss noted that that the pandemic and the government and central-bank response to it have created a disconnect between the real economy and the stock market, with the Dow Jones Industrial Average DJIA, +0.56% rising on Tuesday and the S&P 500 index SPX, +0.87% within a stone's throw of its record high and the Nasdaq Composite Index COMP, +1.39% having produced 32 record highs already in 2020. Meanwhile, millions of people are out of work as the spread of the disease has forced an extension, and sometimes a reimposition, of business closures intended to limit the contagion, while lawmakers have failed to agree upon additional stimulus for those out-of-work Americans after relief measures expired at the end of last month. Dimon said that the public health crisis would eventually impact incomes. \"We can't be doing this a year from now and think that it won't cause devastation in the economy,\" he said of talks from lawmakers about providing a fresh round of assistance to individuals. Dimon said that the pandemic created by the spread of the novel coronavirus is likely to have lasting effects well into the future, as consumers remain skittish about returning to and achieving some semblance of normalcy in the near term. \"There's going to be some scar tissue from this one, but we have a chance to recover,\" the CEO said. In a separate interview with CNN, Dimon said that he was encouraged by some signs that the viral spread was slowing in some states and hopeful that the U.S. would eventually get the disease under control. \"We will win that war,\" the J.P. Morgan Chase JPM, -0.57% head told CNN's chief business correspondent, Christine Romans, recently, predicting that the U.S. unemployment rate would fall to around or below 7% by next year. Dimon is making the media rounds as he joins an initiative to work with institutions and nonprofits to hire people from marginalized communities, including Blacks, in the wake of heightened sensitive around racial injustice following the killing of George Floyd back in May. \"The pace is quick, the world has become more complex, and these problems of education, and jobs, infrastructure, immigration - if you fixed these things we will have a far more just society,\" Dimon said."}]}