{"article": [{"url": "https://www.marketwatch.com/story/feds-williams-warns-that-us-economy-far-from-healthy-even-if-worst-of-the-coronavirus-outbreak-is-over-2020-06-30", "published": 1593519980.0, "headline": "Fed's Williams warns that U.S. economy far from healthy even if worst of the coronavirus outbreak is over", "body": "The economy seems to be on the mend from the worst of the early days of the coronavirus pandemic but remains damaged, said New York Fed President John Williams on Tuesday. \"There have been signs that we may be past the worst of the extreme economic distress and early indications of a recovery have started to emerge,\" Williams said, in a virtual talk sponsored by the Institute of International Finance. Consumer spending has rebounded, and building permits have risen, which is a sign of strength in construction, Williams said. In addition, the high unemployment rate has started to recede from peak levels, though job losses remain elevated. “ \"We are traveling down a narrow path, balancing a return of economic activity with effective containment of COVID-19,\" New York Fed President John Williams. ” While these improvement are welcome, \"the economy is still far from healthy and a full recovery will likely take years to achieve,\" Williams predicts. The outbreak of COVID-19 will continue to be \"at center stage\" during the recovery, he said. High-frequency economic data indicate that there are signs of a slowdown in southern and western states in the U.S., which are seeing a resurgence in cases of the disease derived from the novel strain of coronavirus. \"A strong economic recovery depends on effective and sustained containment of COVID-19,\" he said. At this point, however, health officials are focused on limiting the spread of the deadly pathogen. Williams is a member of Fed Chairman Jerome Powell's inner-circle. His comments are similar to Powell's prepared remarks that were released by the House Financial Services on Monday. The Fed chairman will take questions from lawmakers starting at 12:30 p.m. Eastern. Powell said the economy has entered an important new phase sooner than expected but said it comes with a challenge of keeping the virus in check. Both Williams and Powell emphasized that much remains unknown about how the pandemic will play out in the months ahead. \"We are traveling down a narrow path, balancing a return of economic activity with effective containment of COVID-19,\" he said. Williams said the Fed's purchases of over $2 trillion of assets and 11 lending programs have helped to loosen areas of financial markets that seized up back in March as the pandemic was taking root in the U.S. The New York Fed president, which maintains a permanent vote as a part of the Federal Open Market Committee by dint of that position's oversight of many of the nation's largest financial institutions, said the central bank remains ready to use its \"full range of tools to support the economy to bring about a full and robust recovery.\" During the question and answer session, Williams said he wouldn't say the Fed would never use negative interest rates as a tool, but said he preferred other tools. Asked what other policies the Fed might undertake, Williams said the Fed was collecting evidence and looking to get a \"better read\" on where the U.S. economy was likely to go. Only then would the Fed think about other policy choices. Stocks were trading mostly higher, with the Dow Jones Industrial Average DJIA, +0.56% the S&P 500 index SPX, +0.87% and the Nasdaq Composite COMP, +1.39%  rising near midday Tuesday trade."}]}