{"article": [{"url": "https://www.marketwatch.com/story/rebuilding-america-paves-the-way-for-gains-in-these-construction-and-engineering-stocks-2020-06-18", "published": 1592480240.0, "headline": "Rebuilding America paves the way for potential gains in these construction and engineering stocks", "body": "Given the amped-up level of political rancor, it might seem like President Trump’s $1 trillion infrastructure spending plan announced Tuesday is dead on arrival. After all, Democrats could be wary of allowing him credit for a big spending plan right ahead of the elections. This would be the wrong conclusion. Some variation on Trump’s spending proposal stands a good chance of getting into law soon, for the reasons below. If approved, it would boost the prospects of the 30 stocks and ETFs that my fund manager infrastructure Sherpas single out below. First, three reasons why a wide-ranging infrastructure-spending plan may finally get approved: Reason 1. If Democrats foot-drag on Trump’s proposal, they might be accused of obstructionism, says Brian Sponheimer, an infrastructure analyst who helps manage the Gabelli Asset Fund GABAX, +0.40%. That would make them look bad because more than a few people have noticed we need to spend more on roads and bridges, and communications and electrical-grid upgrades. A smaller federal infrastructure spending plan now in place expires in September. Reason 2. At a time when politicians are looking for ways to spend to get us out of the Covid-19 lockdown recession, infrastructure seems like a handy way to go. “If infrastructure is part of the general fiscal stimulus plan, that makes it more palatable,” says Sponheimer. Treasury Secretary Steven Mnuchin has said all along that infrastructure spending will be part of phase four of Covid-19 stimulus, and it looks like that may be the case. U.S. unemployment levels have soared. “Adding jobs to long-duration projects in the recovery phase makes sense,” says Stifel infrastructure analyst Stanley Elliott. The Portland Cement Association says $1 billion in infrastructure spending creates upward of 40,000 jobs, Elliott notes. “We spend so much money on other countries, and they don’t appreciate it,” says Trump. “We are going to spend money on our own country; it is going to be our jobs, our equipment.” Reason 3. There’s more bipartisan support now because a lot of Democratic governors are getting antsy about recession-induced tax revenue shortfalls crimping their own infrastructure spending programs, points out Eric Marshall of Hodges Capital Management. “A lot of the Democratic governors are asking for relief,” he says. “If coronavirus did not happen, there probably would not be a highway bill before the election. Now there is a chance something might get done here.” The pressure is on because the federal Fixing America’s Surface Transportation (FAST) Act infrastructure spending law expires Sept. 30. We see bipartisan support for action to fill the gap in the following measures in the works. The House Committee on Transportation and Infrastructure is near the final stages of pushing out a spending plan that would allocate $494 billion over five years. A Senate plan would allocate $287 billion for highways over five years. “These bills represent a 43% and 27% increase from prior spending levels on highways under the FAST Act,” says Elliott. “We remain increasingly encouraged by the news flow.” Any infrastructure spending plan would support continued strength in broader indices like the S&P 500 SPX, +0.87% and the Dow Jones Industrial Average DJIA, +0.56%, but it would be especially good for infrastructure stocks. Here’s a quick roundup of names to consider. Basic materials To build roads and bridges, you need aggregates, cement and rebar. And lots of it. It takes 38,000 tons of aggregates to construct a single-lane mile for a four-lane interstate project, says Elliott, at Stifel. A highway spending plan would benefit the main players in the building-materials space. Goldman Sachs recently had a “buy” rating and a $140 price target on Vulcan Materials VMC, -1.50%. It also had a “buy” rating on Martin Marietta Materials MLM, -0.98%, with a $227 price target. “We remain positive on the aggregates pricing story,” says Goldman analyst Jerry Revich. “Martin Marietta Materials’ strong market-share position drives its ability to push pricing through the cycle.” Stifel’s Elliott says those two companies would benefit the most, since about half their sales historically have been tied to public construction. For rebar, consider Commercial Metals CMC, -0.65%, the largest rebar manufacture in North America. “I don’t think we’re going to buy a lot of rebar from China,” says Marshall, referring to the ongoing trade tensions. Nucor NUE, -1.17% is second-largest manufacturer of rebar. Other supplying construction materials include Eagle Materials EXP, -0.50%, one of the largest cement makers in the U.S., and Cemex CX, -0.97%, Summit Materials SUM, -2.93% and U.S. Concrete USCR, -2.02%. Picks and shovels The big players in construction equipment are Caterpillar CAT, +1.45% and Deere DE, +0.24%, but don’t stop there. Goldman Sachs has a “buy” rating on both of those names, but also on Oshkosh OSK, -0.31%, in construction equipment, which Goldman added to its “conviction list” June 4. Others to consider include Terex TEX, -1.80% and Astec Industries ASTE, -0.98% in equipment supply, and Herc HRI, -0.47% in heavy-equipment rentals, says Sponheimer at Gabelli.Engineering and construction To get large construction projects done, governments need help from contractors and construction-engineering companies. Go-to names in this area include Jacobs Engineering J, +0.33%, Fluor FLR, -0.99% and Granite Construction GVA, +0.81%. A smaller name in construction engineering that Sponheimer likes is AECOM ACM, +0.17%. Another small-cap name to consider is Primoris Services PRIM, +0.10%, specializing in replacing water and energy pipelines that get torn up in construction projects and need to be replaced, says Marshall. Wasatch Global Advisors portfolio manager Brian Bythrow likes NV5 Global NVEE, +0.54% in inspection and aerial mapping, and Construction Partners ROAD, +1.16%, which helps with highway, bridge and airport construction. Also consider Honeywell International HON, +0.34% because it has a division in next-generation air-traffic-control systems that would benefit from airport modernization, says Sponheimer.Communications infrastructure Trump likes to include rural broadband and 5G buildout in his definition of “infrastructure.” His proposal this week allocates funding for those areas. Companies that may benefit include American Tower AMT, +0.46%, Crown Castle International CCI, +0.95% and SBA Communications SBAC, -0.21% in cell towers. Also consider Dycom Industries DY, +4.21% and MasTec MTZ, +0.40% in telecom construction and engineering.ETFs If you like investing via exchange traded funds (ETFs), here are some to consider: iShares U.S. Infrastructure IFRA, -0.03%, iShares Global Infrastructure IGF, +0.09%, the SPDR S&P Global Infrastructure GII, +0.04% and the ProShares DJ Brookfield Global Infrastructure TOLZ, -0.30%. What could go wrong with the infrastructure trade? We typically think of infrastructure as roads and bridges. But politicians have their own agendas, so they invent their own definitions. While Trump likes to include broadband in his definition, Democrats go even further to include education, health care and renewable energy. Debates on how much to include for each of those categories could stall progress on any spending bills. At the time of publication, Michael Brush had no positions in any stocks mentioned in this column. Brush has suggested MLM, USCR, CAT, TEX, HRI, FLR, GVA, AMT, CCI, DY and MTZ in his stock newsletter, Brush Up on Stocks. Brush is a Manhattan-based financial writer who has covered business for the New York Times and The Economist Group, and he attended Columbia Business School. Follow Brush on Twitter: @mbrushstocks."}]}