{"article": [{"url": "https://www.marketwatch.com/story/walmart-best-buy-now-require-customers-to-wear-face-coverings-at-its-stores-2020-07-15", "published": 1595680220.0, "headline": "Walmart, CVS, Loweâ\u0080\u0099s among the retailers that will start requiring face coverings on Monday", "body": "Walmart Inc., CVS Health Corp. and Loweâ\u0080\u0099s Cos. are among the retailers that have new face covering requirements for customers that go into effect nationwide on Monday. Walmartâ\u0080\u0099s WMT, +1.00% Â face covering requirement applies to all U.S. stores and Samâ\u0080\u0099s Club warehouses. Face coverings were already required at 65% of locations in cities and towns where there was a face covering government mandate. The company has more than 5,000 stores and clubs in the U.S. Customers can expect to see signs about the new policy and workers have been trained on new protocols, according to a blog post by Dacona Smith, chief operating officer of Walmart U.S., and Lance de la Rosa, chief operating officer of Samâ\u0080\u0099s Club. Read: Will wearing a face mask protect you from COVID-19? Itâ\u0080\u0099s complicated. Here are the 5 biggest mask myths Walmart has also created a new role, health ambassador, who will receive special training to alert customers of the rule and find ways to resolve issues that arise from those who refuse to wear a mask or cannot wear one. Samâ\u0080\u0099s Club will provide a mask to members who donâ\u0080\u0099t have one at no charge. All stores will also have a single entrance to ensure consistency. â\u0080\u009cWe know some people have differing opinions on this topic. We also recognize the role we can play to help protect the health and well-being of the communities we serve by following the evolving guidance of health officials like the CDC,â\u0080\u009d the blog post said. CVS Health Corp. CVS, -1.76% Â tweeted the launch of its face covering requirement. iframe.twitter-tweet { width: 100% !important; } Loweâ\u0080\u0099s LOW, +1.38% Â announced the requirement alongside its home improvement retail competitor Home Depot Inc. HD, +0.49% Â last week. Home Depot will launch its new policy on Wednesday. Home Depot has assigned â\u0080\u009csocial distancing captainsâ\u0080\u009d as well as store associates to hand out complimentary masks. Loweâ\u0080\u0099s will also make masks available for free. For many retailers, an alternative presented for customers who choose not to wear a mask while in the store is to shop online with purchases delivered at home or made available through the retailerâ\u0080\u0099s buy-online-pickup-in-store capability. Bed Bath & Beyond Inc. BBBY, -1.37% Â said Friday that its mask policy will be in effect by July 24 and include the flagship store brand and others such as Cost Plus World Market and Buybuy Baby. Target Corp. TGT, +1.14% Â said Thursday that it will require all customers to wear face coverings at its stores starting August 1, except for those with underlying conditions and young children. The retailer already requires face coverings at more than 80% of its stores. For those who donâ\u0080\u0099t have a face covering, the store can provide one. Gap Inc. GPS, -0.10% Â has also announced a face covering policy that launches on August 1. The rule will apply to brands including Old Navy, Banana Republic and the namesake Gap chain. Best Buy Co. Inc. BBY, +1.45% Â face covering requirement goes into effect on Wednesday. â\u0080\u009cAny customer who has a concern about wearing a mask will be able to shop Best Buy via our website and app and choose home delivery or contactless curbside pickup, which remains in place at all our stores,â\u0080\u009d the company said on its site. Kroger will require face coverings on July 22. â\u0080\u009cWe are taking this extra step now because we recognize additional precautions are needed to protect our country,â\u0080\u009d the company said in a statement. Grocery pickup will remain free for those who would prefer to use that service rather than wear a mask. Starbucks Corp. SBUX, +0.53% Â and Rite Aid Corp. RAD, -2.04% Â are among the other retailers that have also recently put a face mask policy in place. The National Retail Federation is now encouraging all retailers to adopt a face covering policy in order to protect workers as well as customers. â\u0080\u009cWe hope [the] announcement by Walmart â\u0080\u0093 the worldâ\u0080\u0099s largest retailer â\u0080\u0093 that it will be enforcing a policy requiring customers to wear a mask to shop in their stores is a tipping point in this public health debate,â\u0080\u009d the group said in a statement. See:Coronavirus update: COVID-19 is far from contained and could rival 1918 flu pandemic that killed 50 million, experts warn â\u0080\u009cWorkers serving customers should not have to make a critical decision as to whether they should risk exposure to infection or lose their jobs because a minority of people refuse to wear masks in order to help stop the spread of the deadly coronavirus.â\u0080\u009d The NRF also included a reminder that retailers are â\u0080\u009cprivate businessesâ\u0080\u009d that can adopt legal policies to protect their associates and shoppers. â\u0080\u009cShopping in a store is a privilege, not a right,â\u0080\u009d the group said. Marc Perrone, president of the United Food and Commercial Workers International union, also calls on government officials to make face coverings mandatory. â\u0080\u009cWith governors in the majority of states refusing to make masks mandatory, millions of Americans are needlessly being put in danger every day,â\u0080\u009d he said in a statement. â\u0080\u009cItâ\u0080\u0099s time for elected leaders to pull their heads out of the sand and make masks mandatory in all 50 states to protect these brave workers and the millions of families they serve.â\u0080\u009d Moreover, the union is calling for enforcement by trained professionals, rather than retail workers who are â\u0080\u009calready stretched thin during this pandemic.â\u0080\u009d Commenters on Twitter are already preparing for all the videos of the backlash from angry Walmart shoppers who want to shop without a mask. iframe.twitter-tweet { width: 100% !important; } Walmart stock has gained 10.6% over the year so far while the Dow Jones Industrial Average DJIA, +0.56% Â is down 6.5%."}]}