{"article": [{"url": "https://www.marketwatch.com/story/fuelcell-energy-quietly-dropped-mention-of-two-contracts-that-are-focus-of-short-sellers-criticism-11601996352", "published": 1601982440.0, "headline": "FuelCell Energy quietly dropped mention of two contracts that are focus of short seller's criticism", "body": "Image provided by FuelCell Energy. A hydrogen-fuel-cell maker whose stock has surged in the past year quietly stopped mentioning two key contract awards that were to form more than a third of its operating portfolio but did not come to fruition. The company, FuelCell Energy FCEL, +10.08%, saw its stock fall 6% on Monday after a short-selling firm, Night Market Research, alleged FuelCell had lost two contracts. FuelCell on Tuesday said the \"awards are not, and never have been, part of FuelCell Energy's backlog, and have no impact on the company's 2022 financial goals, including revenue growth and adjusted EBITDA.\" That caused the stock to rally 5% in opening trades. Reached by MarketWatch, the Long Island Power Authority said it didn't cancel contracts but also didn't execute them. \"The two FuelCell contracts (the 18.5 [megawatt] Brookhaven Rail Terminal and the 13.9 [megawatt] Clare Rose project) were not cancelled, they were never executed. LIPA declined to execute the contracts based on reduced load growth in Yaphank and East Yaphank,\" said a spokeswoman for LIPA. Those two contracts represented 38% by rated capacity of the \"projects in process, including those in backlog and awards,\" that FuelCell had as of July 31, 2019, according to a Securities and Exchange Commission filing. The awards represented approximately $636.3 million of \"future revenue potential,\" the company stated as recently as Sept. 9, 2019, though FuelCell never included them in its backlog. A later SEC filing, reflecting the status as of Oct. 31, 2019, does not mention the two LIPA contracts. No filing was made in between to disclose this change. FuelCell now says that \"there can be no assurances that any project awards, including these project awards, will result in executed power purchase agreements.\" It added that it doesn't agree that the New York Climate Leadership and Community Protection Act negates the awards. The short-selling firm, Night Market, said the law would invalidate the award because FuelCell's hydrogen cells rely on conventional energy for power. The company said its generation backlog was $1.1 billion as of July 31, 2020. The company's loss in the quarter ending July 31 nearly doubled to $16.1 million. Last week, the company raised more than $100 million in an equity offering backed by J.P. Morgan Securities, Barclays Capital and Canaccord Genuity. Shares in FuelCell, whose customers include Exxon Mobil XOM, -1.47%, have surged 492% over the past year. The company says its technology generates electricity directly from a fuel, such as natural gas or renewable biogas, by reforming the fuel inside the fuel cell to produce hydrogen."}]}