{"article": [{"url": "https://www.marketwatch.com/story/chevron-shares-slide-premarket-as-oil-major-post-wider-than-expected-loss-and-revenue-lags-estimates-2020-07-31", "published": 1596179120.0, "headline": "Chevron shares slide premarket as oil major post wider-than-expected loss and revenue lags estimates", "body": "Chevron Corp. shares CVX, -1.62% slid 3.7% in premarket trade Friday, after the oil giant posted weaker-than-expected earnings for the second quarter, hit by the twin effects of a weak oil price and depressed demand during the coronavirus pandemic. San Ramon, Calif.-based Chevron said it had a net loss of $8.3 billion, or $4.44 a share, in the quarter, after income of $4.3 billion, or $2.27 a share, in the year-earlier period. The number includes impairments and other net charges of $1.8 billion relating to downward revisions to the company's commodity price outlook, severance accruals of $780 million, and a gain of $310 million on the sale of Azerbaijan assets. The company also fully impaired its $2.6 billion investment in Venezuela due to uncertainty associated with the current operating environment and overall outlook. Foreign currency effects decreased earnings by $437 million. Excluding those items, the company's adjusted per-share loss came to $1.59, wider than the loss per share of 93 cents forecast by FactSet analysts. Revenue slid to $16 billion from $36 billion a year ago, also below the $21.9 billion FactSet consensus. \"The past few months have presented unique challenges,\" said CEO Michael K. Wirths said in a statement. \"The economic impact of the response to COVID-19 significantly reduced demand for our products and lowered commodity prices. Given the uncertainties associated with economic recovery, and ample oil and gas supplies, we made a downward revision to our commodity price outlook which resulted in asset impairments and other charges.\" While demand and commodity prices have shown signs of recovery, \"they are not back to pre-pandemic levels, and financial results may continue to be depressed into the third quarter 2020,\" he wrote. Shares have fallen 27% in the year to date, while the S&P 500 SPX, +0.87% has gained 0.5%."}]}