{"article": [{"url": "https://www.marketwatch.com/story/us-industrial-output-cools-in-august-after-strong-gains-earlier-in-summer-2020-09-15", "published": 1600166060.0, "headline": "U.S. industrial output cools in August after strong gain earlier in summer", "body": "The numbers: U.S. industrial production rose 0.4% in August, a much smaller gain than in the prior two months, the Federal Reserve reported Tuesday. The gain in August was close to Wall Street expectations of a 0.5% gain, according to a survey by MarketWatch. Manufacturing production surged a revised 6.1% in June - revised from a 5.7% gain. It slowed a bit to a revised 3.5% gain in July - up from prior estimate of a 3% rise. The index is still 7.3% below its pre-pandemic February level. What happened: Manufacturing output rose 1% in August but the gains for most manufacturing industries have gradually slowed since June, the Fed said. Mining production fell 2.5% in August as hurricanes and tropical storms battered the Gulf of Mexico and caused sharp but temporary declines in oil and gas extraction. Production of cars and trucks fell 3.7% in August after a strong gain in the prior month. Utilities fell 0.4% after a strong 3.8% rise in July.. Capacity utilization rose to 71.4% in August. The capacity utilization rate reflects the limits to operating the nation’s factories, mines and utilities. Big picture: Manufacturing has been a bright spot in the economy as it has been easier to re-engineer factories during COVID-19 than it has been to reopen the shuttered service economy. Economists think the big uplift from the early summer is over. Read:Economy needs more certainty, top economist says What are they saying? “The industrial sector is recovering from the Viral Recession, but growth will be slower through the rest of 2020 and in 2021. There were big increases in output in the spring and early summer as factories reopened, but with demand throughout the U.S. and global economies still down substantially from early 2020, it will be more difficult to eke out near-term gains,” Gus Faucher, chief economist of The PNC Financial Group. Market reaction: Stocks opened higher on Tuesday with the Dow Jones Industrial Average DJIA, +0.56% up 174 points in morning trading."}]}