{"article": [{"url": "https://www.marketwatch.com/story/going-executive-order-route-for-fiscal-stimulus-poses-risks-questions-for-white-house-11596813764", "published": 1596799820.0, "headline": "Going executive order route for fiscal stimulus poses risks, questions for White House", "body": "Treasury Secretary Steven Mnuchin leaves a Republican policy lunch on Capitol Hill in Washington on July 21, 2020. (Photo by Olivier DOULIERY / AFP) (Photo by OLIVIER DOULIERY/AFP via Getty Images) An attempt to use executive orders to provide the economic aid the White House and Democrats have been haggling over for weeks to combat the impact of the coronvirus pandemic on the economy raises a thicket of political and legal questions for President Donald Trump. If Congress cannot agree on another sweeping aid bill, can Trump provide enough stimulus to the economy to ease the hit from the coronavirus and resulting lockdowns and boost his reelection odds? And can he do that without running afoul of long-standing laws governing how federal money is spent and Congress’ “power of the purse”? Sen. Chuck Schumer, the New Yorker who leads Senate Democrats, urged Trump to avoid the executive powers route Thursday night after the House Speaker Nancy Pelosi met with White House Chief of Staff Mark Meadows and Treasury Secretary Steven Mnuchin but reached no agreement. “An executive order will leave millions of people out. It will be litigated. It won’t be effective and things will get worse. So we urge them to rethink their position,” Schumer told reporters. Earlier in the day, Trump had said he told his staff to look at ways to revive the lapsed $600 a week federal unemployment supplemental payment, extend an eviction moratorium that for practical purposes ends in late August, extend student loan relief and create a payroll tax cut. iframe.twitter-tweet { width: 100% !important; } Meadows said going the executive order route was a last resort, but Democratic intransigence could force Trump’s hand. “We’ve been here now going on 2 weeks and we still don’t have a deal and his willingness to take action through his executive powers should be applauded, because he’s coming to the realization that perhaps some of our Democrats both in the House and senate are not serious about compromise and are not serious about trying to meet the needs of the American people,” he said Thursday night. The Trump administration’s history with laws about how to spend money has been spotty. It has been in a legal tussle with Congress over redirecting money for other purposes to instead be used for wall construction on the Southwestern border. And the move to delay congressionally approved aid to Ukraine, in addition to jump starting the impeachment process, violated the 1974 law meant to prohibit presidents from picking and choosing what funds get spent, according to the Government Accountability Office. Bill Hoagland, senior vice president with the Bipartisan Policy Center in Washington and formerly a long-time budget staffer for Republicans on Capitol Hill, said Trump was probably on firmer legal ground with extending the eviction moratorium and changing payroll tax collections. “I think the answer is clear that some things he can do via Executive Order legally, others he probably can do but could be challenged in court (question here is who is going to challenge) and others he might do but will have minimal economic impact,” Hoagland said in an email. But Hoagland said the basis for reviving the unemployment add-on was murkier. If Trump used yet-be-spent money from the March coronavirus CARES law, it is unclear it would be enough to get through the election, even at a level less than $600 a week. “More importantly, this reminds me of the reprogramming of military construction funding for building a wall. I think it would be challenged, particularly by mayors and governors who may not have spent CARES money to date but had plans on the books to spend. Interesting politics on this as to who would actually bring suit,” Hoagland said. Wall Street economists said their baseline assumption remained that Congress would ultimately pass a new stimulus measure as failure to pass a plan would hit the economy hard. “It would be a huge loss in disposable income, extremely quickly,” said Jeremy Schwartz, vice president on the global Strategy and economics team at Credit Suisse. “You’re talking about tens of billions of dollars a month which is relatively unprecedented.” Still, the fight may not be over, only paused. If lawmakers don’t return to Washington this month, they still have to come back in September to approve a stopgap spending bill to keep the government open after the end of the fiscal year Sept. 30. That could provide another opportunity to reexamine where the economy is and how much of a boost it needs, but with the added challenge of avoiding yet another government shutdown. Hoagland, though, said he thinks a unilateral move by the White House would ensure no more talks until after the election, and worse outcome for the budget deficit than Republicans who opposed a deal because it would spend too much. “In fact I would argue this unilateral move on the President’s part will likely also guarantee that those Senate Republicans up in purple states, will not be coming back and, if anything, with a Democratic Congress and likely Democratic president, the fiscal situation long-term will be much worse,” he said."}]}