{"article": [{"url": "https://www.marketwatch.com/story/did-the-600-extra-unemployment-benefit-reduce-employment-a-major-new-study-provides-an-answer-2020-07-28", "published": 1596517100.0, "headline": "Did the extra $600 unemployment benefit stop people from job hunting? These Yale economists say they finally have an answer", "body": "The supplemental $600 a week that unemployed Americans have been receiving as part of the $2.2 trillion CARES Act expires this month. It has been welcomed by millions of Americans who are out of work and struggling to make ends meet due to the economic shock from the coronavirus pandemic. But employers and some members of the Trump administration have argued that it has also acted as a disincentive for many people to go back to work, particularly those who were earning relatively low wages before the countrywide closure of businesses. The GOP unveiled the HEALS Act last week, which called for slimmer 70% wage replacement in supplemental unemployment benefits and legal liability shields for businesses afraid that consumers and employers will sue them if they catch COVID-19, among other things. The HEALS Act stands for the Health, Economic Assistance, Liability Protection and Schools Act. This time around, Republicans are proposing the same stimulus-check amounts and using the same income-eligibility rules as the CARES Act. But are those who are unemployed and receiving the extra $600 really stop looking for work and/or refuse to go back to their jobs? A new paper by a team of Yale University economists say they have found an answer. ”Workers facing larger expansions in unemployment insurance benefits have returned to their previous jobs over time at similar rates as others,” they wrote. “We find no evidence that more generous benefits disincentivized work either at the onset of the expansion or as firms looked to return to business over time. In future research, it will be important to assess whether the same results hold when states move to reopen.” Related: I’m 63, a widow and lost my job because of COVID. I don’t have much in savings and feel lost. What can I do? The extra unemployment benefits were introduced by the CARES Act on March 27 to ease the burden of the economic fallout from closed businesses. That additional $600, which is set to expire on July 31, was designed to cover 100% of the average U.S. wage when combined with existing unemployment benefits, the economists said, and depends on several factors, including their earnings history and their home state’s schedule of benefits. (Two-thirds of Americans claiming unemployment due to the pandemic are receiving more unemployment insurance than they earned on the job.) “The data do not show a relationship between benefit generosity and employment paths after the CARES Act,” said Joseph Altonji, the Thomas DeWitt Cuyler Professor of Economics in the Faculty of Arts and Sciences, and a co-author of the Yale report. Workers receiving larger increases in unemployment benefits experienced very similar gains in employment by early May relative to workers with less-generous benefit increases, the report stated, and people with more generously expanded benefits also resumed working at a similar or slightly quicker rate than others did. The Chicago Federal Reserve found a similar trend. “Those currently collecting benefits search more than twice as intensely as those who have exhausted their benefits,” a recent study conducted by the Chicago Fed concluded. Typically, unemployment benefits last six months and on average pay individuals approximately 35% of their previous weekly salary, according to the Chicago Fed. People on unemployment benefits on average spend more than 14 hours a week job searching and send more than 12 applications a month. As of Tuesday, COVID-19, the disease caused by the virus SARS-CoV-2, had infected at least 18.3 million people globally and 4.7 million in the U.S. It had killed over 693,968 people worldwide and at least 155,471 in the U.S. Cases in California hit 520,707 and deaths reached 9,507 as it reported 8,258 new cases Monday and 134 new deaths, compared to 4,381 new cases and 35 new deaths Sunday. New York has the most fatalities (32,719) followed by New Jersey (15,846). The Dow Jones Industrial Index DJIA, +0.56% closed higher Monday, as investors tracked round two of the potential fiscal stimulus. The S&P 500 SPX, +0.87% and Nasdaq Composite COMP, +1.39% also entered the week higher; some of the industry’s largest and most powerful players — Apple AAPL, +1.74% Facebook FB, +0.26%, Amazon. AMZN, +3.01% and Google parent Alphabet Inc. GOOGL, +1.82% GOOG, +1.97% — reported their results last week."}]}