{"article": [{"url": "https://www.marketwatch.com/story/class-of-2020-graduate-on-leaving-school-in-a-covid-economy-im-just-going-to-get-any-job-that-i-can-to-make-use-of-myself-11594331751", "published": 1594375700.0, "headline": "Class of 2020 graduate on leaving school in a COVID economy: â\u0080\u0098Iâ\u0080\u0099m just going to get any job that I can to make use of myselfâ\u0080\u0099", "body": "Maia Hass recently graduated from Florida State University. At the beginning of her senior year of college last fall, Maia Hassâ\u0080\u0099s goal of working in a marketing role at an entertainment company, like Disney DIS, +1.53%, seemed totally attainable.Â Her peers who walked across college stages earlier that year entered a healthy job market, and Hass, 21, was hustling. A double major in marketing and international affairs, she spent weekends at a coffee shop perfecting her resume and cover letters and applying to jobs.Â But now, several months, a global pandemic and an accompanying economic downturn later, Hass feels lucky to be working, even if she isnâ\u0080\u0099t doing what she expected. Earlier this month, Hassâ\u0080\u0099s post announcing her new role as an employee stocking shelves, working the cash register and doing other tasks at Target TGT, +1.14%, racked up more than 30,000 reactions and more than 1,000 comments on LinkedIn.Â â\u0080\u009cThe world is still trying to put itself back together and I understand that itâ\u0080\u0099ll take time before more opportunities arise,â\u0080\u009d she wrote. â\u0080\u009cI am confident that the right job will come to me when the time is right.â\u0080\u009dYoung workers disproportionately affected by the downturn Though Hass is maintaining a positive attitude, her post is an indication of the challenges young people are facing in todayâ\u0080\u0099s economy. Recessions are often challenging for workers with the least experience, but this economic downturn has devastated the sectors where workers ages 16 to 24 are disproportionately represented. Exacerbating these challenges are the unprecedented levels of student debt young adults often have to assume in order to receive their degrees.Â Are you a recent graduate navigating the job market? We want to hear from you: email jberman@marketwatch.com In 2019, 25.8% of these young workers had jobs in leisure and hospitality compared to 7.4% of workers 25-years-old and older, according to an analysis of data from the Bureau of Labor Statistics by Elise Gould, a senior economist at the Economic Policy Institute, a labor-focused think tank. That sector lost nearly 41.8% of its jobs between February and May 2020.Â Â A large share of young workers also had jobs in the retail trade sector, which lost nearly 12.8% of its jobs during the same period, according to Gouldâ\u0080\u0099s analysis. In 2019, 18.9% of workers 16 to 24 had jobs in this sector compared to 9.4% of workers 25-years-old and older.Â Those trends are different from what we often see during a downturn and what we saw during the Great Recession when soft demand from consumers meant that sectors like manufacturing and construction were most acutely affected, Gould said. â\u0080\u009cThere was less of an age componentâ\u0080\u009d then, she said. This time, the sectors most impacted are those that have a lot of interaction with the public and those are the same industries that employ a lot of young workers, Gould said.Â “ â\u0080\u0098Graduating into a recession has long lasting effects for your career.â\u0080\u0099 ” â\u0080\u0094 Elise Gould, senior economist at the Economic Policy Institute â\u0080\u009cGraduating into a recession has long lasting effects for your career,â\u0080\u009d Gould said. The longer this downturn lasts, the more likely it is to be â\u0080\u009cmore than just a blip on young peopleâ\u0080\u0099s career trajectory,â\u0080\u009d Gould said.Â â\u0080\u009cWhen the unemployment rate is higher, employers can be choosy,â\u0080\u009d Gould said. â\u0080\u009cThereâ\u0080\u0099s a lot of workers out there â\u0080\u0094 why pick the younger, least-experienced ones?â\u0080\u009d Employersâ\u0080\u0099 power in a soft labor market also has particularly dire consequences for Black and Hispanic workers because it allows more room for discrimination in hiring. Indeed, young Black and Hispanic workers have higher jobless rates during this pandemic than their white and Asian counterparts, Gould found.Â Tired of staring at LinkedIn After graduating in May, Hass spent about a month and a half searching for jobs, estimating that she sent out about 60 applications. Sheâ\u0080\u0099s currently living at home with her mom in Chicago. She wasnâ\u0080\u0099t worried about repaying student loans because she was able to fund her in-state tuition at Florida State University through scholarships and grants. Still, she was eager to find a job. Making little headway in the midst of a pandemic, Hass decided to switch strategies.Â â\u0080\u009cI was just like Iâ\u0080\u0099m tired of sitting in bed all day and not doing anything, driving myself crazy and staring at LinkedIn,â\u0080\u009d she said. â\u0080\u009cIâ\u0080\u0099m just going to get any job that I can to make use of myself.â\u0080\u009d Last month, she earned $15 per hour at Target, which works out to roughly $30,000 a year. Entry-level business majors in the class of 2019 were projected to earn $57,657 , according to a report from the National Association of Colleges and Employers. Like many members of the class of 2020, Hass had already suffered a series of disappointments. There was the pandemic-related end to interview processes that otherwise seemed to be going well. And of course, Hass missed so many of the milestones typically associated with the end of college.Â â\u0080\u0098I watched graduation online like everyone else and I just criedâ\u0080\u0099 Because she left school for spring break and never came back, Hass didnâ\u0080\u0099t get the chance to say goodbye to her friends and professors. â\u0080\u009cI watched graduation online like everyone else,â\u0080\u009d she said, â\u0080\u009cand I just cried.â\u0080\u009dÂ Graduating college â\u0080\u009cwasnâ\u0080\u0099t casual,â\u0080\u009d for her, Hass said. â\u0080\u009cthe fact that I wasnâ\u0080\u0099t able to celebrate it really hurt.â\u0080\u009d Hass, whose parents didnâ\u0080\u0099t go to college, navigated the process of applying to school with help from her high school friends and their parents. They advised her to volunteer and participate in extracurricular activities to make herself an attractive applicant.Â Once Hass got to school, she recognized her experience was different from that of many of her classmates. Some had grown up knowing they were going to attend college and as they talked about things like finding internships, Hass said she didnâ\u0080\u0099t know where to start. She joined a business fraternity, which helped her get a sense of future career prospects and prepare her for the job market.Â She watched in awe as some of her new college friends posted pictures on social media of beautiful houses by the water, the likes of which sheâ\u0080\u0099d never visited in her life. â\u0080\u009cI realized that Iâ\u0080\u0099m different,â\u0080\u009d Hass said. â\u0080\u009cI came from a different background and I still kind of succeeded.â\u0080\u009dÂ â\u0080\u009cItâ\u0080\u0099s been hard of course,â\u0080\u009d she added. â\u0080\u009cSometimes I wonder if I lived in that house and I had parents that had the money and resources to give me a boost, maybe I would have still done something else.â\u0080\u009d But Hass dismissed that notion quickly, saying â\u0080\u009cI canâ\u0080\u0099t keep thinking like that.â\u0080\u009dÂ She decided to post on LinkedIn to help get out of the funk of disappointment that this period has brought. â\u0080\u009cOver the last few months, I feel like Iâ\u0080\u0099ve lost all confidence in my job seeking abilities and thereâ\u0080\u0099s nothing I can do, but wait.â\u0080\u009d The generous feedback Hass has received so far on the post, including from people who had similar experiences during the last recession, has helped encourage her to resume her job search, she said. Sheâ\u0080\u0099s also hopeful the post may attract attention or a DM from potential employers. â\u0080\u009cIâ\u0080\u0099m just crossing my fingers that it will lead to something,â\u0080\u009d Hass said.Â"}]}