{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-aim-to-extend-gains-as-investors-await-apple-event-fresh-data-and-start-of-fed-gathering-2020-09-15", "published": 1600188020.0, "headline": "Dow erases early climb, S&P 500 notches third straight gain as tech stocks extend rebound from last week's rout", "body": "U.S. stocks finished mostly higher on Tuesday as the blue-chip Dow shed early gains ahead of a policy update by the Federal Reserve. The Nasdaq led the broader market rally as technology shares continued to make up lost ground from last week's selloff.How are equity benchmarks performing? The Dow Jones Industrial Average DJIA, +0.56%  rose 2.27 points to finish at 27,995.60, while the S&P 500 SPX, +0.87%  gained 17.66 points, or 0.5%, to trade at 3,401.20, marking its third straight increase. The Nasdaq Composite COMP, +1.39%  finished up 133.67 points, or 1.2%, at 11,190.32, logging back-to-back gains. On Monday, the Dow rose 327.69 points, or 1.2%, to finish at 27,993.33, after briefly trading above the 28,000 threshold. The S&P 500 added 42.57 points, or 1.3%, closing at 3,383.54. The Nasdaq Composite climbed 203.11 points, or 1.7%, to end at 11,056.65, rebounding from a rout that last week saw the tech-heavy index enter correction territory by falling more than 10% from a record high.What's driving the market? A pickup in merger-and-acquisition activity in helped tech shares regain their footing after last week's selloff, perhaps prompting investors to reason that valuations weren't so stretched if companies like chip maker Nvidia Corp. NVDA, -0.54%  were poised to make acquisitions, said Elliott Savage, portfolio manager for the YCG Enhanced Fund, in an interview. Nvidia on Sunday said it reached an agreement to buy Arm Holdings from SoftBank for $40 billion. Caution remains in order though, he said. A sharp rally by stocks off the March pandemic lows has been fueled by a combination of improving earnings for certain tech-oriented companies able to grow market share as well as by increased speculative interest. While investors largely gave companies a pass on second-quarter earnings, third quarter results will likely face tougher scrutiny, and political uncertainty surrounding the November presidential election could add to the potential for increased volatility, Savage said. Investors were heartened Monday by positive news on a vaccine against COVID-19 from AstraZeneca AZN, +1.16%  and BioNTech BNTX, +1.23% and were watching Tuesday for a product launch by Apple Inc. AAPL, +1.74% as well as several IPOs. \"Each positive vaccine headline brings more clarity on the timing and potential success of vaccine delivery, illuminating the light at the end of the tunnel for this pandemic and the economic devastation it has wrought across many industries,\" said Michael Reynolds, an investment strategy officer at Glenmede Trust Co., in e-mailed comments. The Federal Reserve started its policy-setting meeting on Tuesday, which will be followed by a news conference and policy statement on Wednesday, while central-bank decisions from the Bank of England and the Bank of Japan are due on Thursday. The meeting of the policy-setting Federal Open Market Committee also would be the first since the central bank introduced its new policy framework of average-inflation targeting. In his post-meeting news conference, Federal Reserve Chairman Jerome Powell is likely to be peppered by questions about how the Fed intends to measure maximum employment and average inflation, said Steven Ricchiuto, U.S. chief economist at Mizuho Securities. While the committee \"will want to keep policy as flexible as possible by keeping these aspects of policy vague, the press will try to nail Chairman Powell down to specifics so that the deviations from target can be quantified,\" he said. Investors are also watching for Snowflake Inc., a cloud-computing company, which is set to list on the New York Stock Exchange this week and has the backing of Warren Buffett's Berkshire Hathaway BRK.A, +0.06% BRK.B, +0.24%  and Salesforce.com CRM, +2.21%. On Monday, Snowflake raised the proposed price range for its initial public offering to $100 to $110, up from a prior $75 to $85. The company is planning to offer 28 million shares to raise up to $3.08 billion. Check out:Snowflake IPO: 5 things to know about the Berkshire-backed company as it heads for record software offering See: IPO market gears up for busiest week since May of 2019-Uber's IPO week-with 12 deals on tap Apple Inc. AAPL, +1.74% held its first virtual-only product reveal, where the Cupertino, Calif., tech behemoth showed off its latest smartwatch, a debut which may provide a fresh catalyst for shares of the popular company. The iPhone maker also released a new workout class subscription service. Apple shares rose 0.2%. Analysts said a positive tone for equities was also helped by economic data from China, where retail sales grew in August for the first time in 2020. Sales grew 0.5% year-over-year last month, according to China's National Bureau of Statistics. In U.S. economic data, the New York Fed's Empire State business conditions index rose 13.3 points to 17 in September. Economists had expected a reading of 6, according to a survey by Econoday. The gain reverses a 14-point decline in August. U.S. industrial production rose 0.4% in August after a revised 3.5% gain in July.Which stocks were in focus? Shares of Oracle Corp. ORCL, +0.42%  closed up 2.5% after The Wall Street Journal reported that the Trump administration was reviewing the companies bid to become the \"strategic partner\" for TikTok's U.S. operations, which is owned by China-based ByteDance. BioNTech BNTX, +1.23%  shares fell 0.8% even after the drug company said it would receive up to 375 million euros ($445.9 million) in funding from the German Federal Ministry of Education and Research to support the accelerated development of a COVID-19 vaccine in collaboration with partner Pfizer Inc. PFE, -0.27% and Fosun Pharma. Shares of Charles Schwab Corp. SCHW, +1.29%  slipped 2.8% after the discount broker provided a downbeat third-quarter revenue outlook. Nikola Corp. NKLA, -1.36%  shares dropped 8.4% after a report that the Securities and Exchange Commission is looking into allegations made last week by short seller Hindenburg Research, which called the electric truck maker an \"intricate fraud.\" Nikola has denied the allegations. Bentley Systems Inc. set terms of its initial public offering, with the pricing valuing the company at up to $4.96 billion. How are other markets trading? The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777%  rose around a single basis point to 0.678% as a positive tone for stocks and other risky assets diminished demand for traditional havens like government bonds. Bond prices move inversely to yields. The ICE U.S. Dollar Index DXY, -0.58%, which tracks the performance of the greenback against its major rivals, was flat. Gold futures GCZ20, +2.17% rose 0.2% to settle at a two-week high of $1,956.30 an ounce, on the New York Mercantile Exchange. The U.S. crude oil benchmark CL.1, -1.62%  added 2.7% to finish at $38.28 a barrel as Hurricane Sally, a dangerous, Category 2 storm, closed in on the Gulf Coast. Global equities were on the rise, with the Stoxx Europe 600 index SXXP, +0.55%  gaining 0.7%, while the U.K.'s benchmark FTSE 100 UKX, +0.64% rose 1.3%. In Asia, Hong Kong's Hang Seng Index HSI, -0.30% rose 0.4% and the Shanghai Composite Index SHCOMP, +1.67%  advanced 0.5%. Japan's Nikkei NIK, -0.11% fell 0.4%. Mark DeCambre contributed to this report."}]}