{"article": [{"url": "https://www.marketwatch.com/story/here-are-the-major-brands-that-have-pulled-ads-from-facebook-2020-06-30", "published": 1594991120.0, "headline": "Here are the major brands that have pulled ads from Facebook", "body": "Since an advertising boycott of Facebook Inc. was organized in mid-June, a veritable Who’s Who of major brands have either added their names to the #StopHateForProfit campaign or otherwise pulled their ads. Facebook makes almost all of its revenue via advertising. Still, analysts are expecting the company to take a less-than-5% revenue hit due the boycott. The social-media giant has more than 8 million paying advertisers, Rohit Kulkarni, executive director at MKM Partners, noted this week in a note to clients. Civil rights groups have called on large advertisers to pause their Facebook advertising for the month of July, to protest what they say is the company’s inability to properly rein in racist and violent content and misinformation. Facebook shares FB, +0.26% are down 2.4% over the past month, but are up nearly 11% year to date, compared to the S&P 500’s SPX, +0.87% 4% decline this year. Of the more than 1,000 companies worldwide that have joined the ad boycott, some of the most prominent include: Adidas AG ADDDF, +2.15% * Arc’teryx Bayer AG BAYER, +0.33% Ben & Jerry’s Homemade Holdings Inc. Beam Suntory Inc. Birchbox Blue Bottle Coffee Inc. Blue Shield of California Chobani Clorox* CLX, +0.90% Coca-Cola Co. KO, +0.69% Dashlane Denny’s Corp. DENN, +0.76% Diageo plc DGEAF, +1.90% Eddie Bauer LLC Eileen Fisher Ford Motor Co. F, -1.36% Hershey Co. HSY, +1.47% Honda Motor Co. HMC, -1.21% HP Inc. HPQ, -0.15% JanSport Kimberly-Clark Corp. KMB, +1.45% Levi Strauss & Co. LEVI, -2.24% Magnolia Pictures Massachusetts Mutual Life Insurance Co. Microsoft Corp. MSFT, +2.48% Patagonia Inc. Patreon Pfizer Inc. PFE, -0.27% Puma SE PMMAF, +0.55% The North Face Recreational Equipment Inc. SAP AG SAP, +0.65% Starbucks Corp. SBUX, +0.53% Upwork Inc. UPWK, +1.71% Unilever UL, +1.44% Vans Verizon Communications Inc. VZ, +0.23% Vertex Pharmaceuticals Inc. VRTX, +0.52% * Pulled ads, but have not formally joined the campaign."}]}