{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-slip-early-friday-but-sp-500-and-nasdaq-aim-to-rebound-to-end-the-week-2020-09-18", "published": 1600447100.0, "headline": "Stocks close lower, notching third straight weekly loss as tech-led sell-off intensifies", "body": "U.S. stock indexes closed lower Friday, notching a third straight weekly loss, amid uncertainty about a fresh round of fiscal stimulus from Washington, concerns about tensions between the U.S. and China, and worries about the sluggish pace of economic recovery. The day’s trading action also marked quadruple witching, which refers to the simultaneous expiration of single-stock options, single-stock futures, and stock-index options and stock-index futures, which has traditionally been associated with some intraday volatility. How did major benchmarks trade? The Dow Jones Industrial Average DJIA, +0.56% closed at 27,657.42, down 244.56 points or 0.9%. The S&P 500 index SPX, +0.87% shed 37.54 points, or 1.1%, to close at 3,319.47. Friday’s session marked the first time the broad index closed below its 50-day moving average, 3,343.42, since April 23. The Nasdaq Composite Index COMP, +1.39% fell 116.99 points, 1.1%, to close at 10,793.28. For the week, the Dow lost less than 0.1%, the S&P 500 was down 0.6%, and the Nasdaq fell 0.6%. The Dow is down 2.72% for the month-to-date, the S&P500 down 5.17% and Nasdaq Composite down 8.34%. Read:Sell Rosh Hashana, buy Yom Kippur? Why some traders put stock in this strategyWhat drove the market? Investors continue to look for progress on fiscal stimulus talks in Washington which many consider crucial to underpin the economic recovery from the coronavirus pandemic and sustain the stock market’s gains. Congressional lawmakers planned to introduce a bill Friday that would see the U.S. government funded through mid-December but U.S. House Speaker Nancy Pelosi said Friday the airlines and restaurant industries both need help that could be in another big economic stimulus package. House Democrats had passed a $3.5 trillion relief bill in May, but more recently in negotiations with White House officials said they would accept a $2.2 trillion deal, the Wall Street Journal reported. House Speaker Nancy Pelosi said Democrats could push for more than their previous offer of $2.2 trillion but isn’t willing to advocate for anything less than her less proposal. On the geopolitical front, the U.S. Commerce Department said Friday it is prohibiting transactions involving Tencent’s WeChat and Bytedance’s TikTok. The order makes no mention of the Oracle Corp. ORCL, +0.42% deal with TikTok but said “the President has provided until November 12 for the national security concerns posed by TikTok to be resolved.” The news highlights lingering Sino-American testiness. Investor angst over the impact of the Federal Reserve’s policy update on Wednesday is still rippling through the market also after the central bank indicated that the economic recovery could be a long one and that it did not expect to lift interest rates for at least another three or four years, The central bank’s policy update on Wednesday marked its first since it outlined its average-inflation target strategy to avoid falling into the quicksand of low inflation by keeping interest rates close to 0% until the labor market achieves maximum employment and inflation has risen to its 2% target “and is on track to moderately exceed 2% for some time.” That intention is “a unilaterally supportive message for stocks and risk assets over the long term,” said Michael Stritch, chief investment officer at BMO Wealth Management. The challenge for investors, Stritch noted, is the near term. “We’re going to need some political clarity, and we have to get some vaccine clarity. There are a lot of assumptions out there right now and until some of those are confirmed or refuted, we will probably continue to see choppiness.” For now, Stritch’s team is favoring what he calls “quality growth” stocks. “I don’t want to embrace a cyclical value story just yet,” he said in an interview. “I would pay up for certainty rather than make a big bet on timing the economic recovery.” Read: Coronavirus tally: Global cases of COVID-19 top 30 million, 946,490 deaths and U.S. death toll close to 200,000 Meanwhile, the Fed is embarking on a second round of stress tests for the banking sector amid the coronavirus epidemic and is reportedly considering extending limits to dividend payments and share buybacks on the industry. In U.S. economic data, the University of Michigan said the preliminary reading of its U.S. consumer sentiment index in September was 78.9, up from 74.1 in the prior month, better than average estimates from economists polled by MarketWatch, who expected a reading of 75.9. The U.S. current-account deficit, a measure of the nation’s debt to other countries, widened sharply in the second quarter. The current-account deficit widened to $170 billion from a revised $111.5 billion in the first quarter. Which stocks were in focus? XL Fleet, a provider of electric vehicle technology, said Friday it has agreed to merge with Pivotal Investment Corporation II PIC, +3.02% , a special purpose acquisition corporation, or SPAC, in a deal with a pro forma enterprise value of about $1 billion. Shares of PIC gained more than 14%. Shares of Swiss-based Roche Holding AG ROG, +1.80% were in focus on Friday after the drug maker said hospitalized COVID-19 patients taking rheumatoid arthritis drug Actemra were less likely to need mechanical ventilation than those receiving placebo. U.S. listed Roche shares were up 1.8%. Shares of U.S. Steel Corp. X, -1.99% rose nearly 5% Friday, after the steel producer provided an upbeat third-quarter outlook, including a “significantly better” performance expected for its flat-rolled business and signs that the tubular business has bottomed. Oracle ORCL, +0.42% shares slipped 0.7% amid the TikTok developments. A trio of stocks surged in the first day of trading after their initial public offerings: Compass Pathways PLC CMPS, -9.16% shares rocketed 71% higher, Unity Software Inc. U, +8.43% shares advanced 32%, and Athira Pharma ATHA, -1.11% shares surged by double-digits in early trade before settling to a 0.7% gain for the day. How did other markets fare? The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% rose about one basis point to 0.695%, continuing to trade in a narrow range. Bond prices move inversely to yields. The ICE U.S. Dollar Index DXY, -0.58%, which tracks the performance of the greenback against its major rivals, was flat at 92.96. Gold futures GCZ20, +2.17% headed 0.6%, $12.20, higher on Comex to settle at $1,962.10 an ounce. Futures for the U.S. crude oil benchmark CL.1, -1.62% reversed early gains to trade 9 cents lower, near $40.88 a barrel as OPEC+ emphasized the importance of complying with output cuts during its monthly meeting on Thursday. Stoxx Europe 600 index SXXP, +0.55% lost 0.7% to close at 368.78, while the U.K.’s benchmark FTSE 100 UKX, +0.64% ended trading at 6,007.05, also 0.7% lower. In Asia, Hong Kong’s Hang Seng Index HSI, -0.30% closed 0.5% higher and the Shanghai Composite SHCOMP, +1.67% lost advanced 2.1%. Japan’s Nikkei NIK, -0.11% inched up 0.2%. Read next: Just launched: an ETF made for black swan moments like these"}]}