{"article": [{"url": "https://www.marketwatch.com/story/are-you-overlooking-this-critical-factor-in-deciding-what-is-the-best-place-to-retire-2020-09-09", "published": 1599912920.0, "headline": "Are you overlooking this critical factor in deciding what is the â\u0080\u0098best placeâ\u0080\u0099 to retire?", "body": "This article is reprinted by permission from NextAvenue.org. When Bill and Annemarie Kachur retired in early 2016, they saw no reason to go anywhere. The gray shingled bungalow in Myrtle Beach, S.C. had been their home for more than 15 years. â\u0080\u009cIâ\u0080\u0099ve been here so long, itâ\u0080\u0099s a sense of roots now for me,â\u0080\u009d says Bill, 65, who spent his early career hopping around the country, working on-air at various radio stations. Plus, they were already in a haven for retirees. â\u0080\u009cI like the fact that there isnâ\u0080\u0099t a winter,â\u0080\u009d says Annemarie, whoâ\u0080\u0099ll be 65 in September. But in recent years, their idyllic spot about 2Â½ miles from the Atlantic Ocean has revealed an ominous side: hurricane season. â\u0080\u009cI just noticed that the last four or five years, we keep getting hammered,â\u0080\u009d recalls Bill. Two hurricane evacuations since 2016 Since 2016, the Kachurs have ridden out four hurricanes, including two evacuations to safer ground. â\u0080\u009cTen months out of the year, itâ\u0080\u0099s great,â\u0080\u009d says Bill. â\u0080\u009cAnd then thereâ\u0080\u0099s a couple months out of the year when youâ\u0080\u0099re walking on eggshells and youâ\u0080\u0099re a little bit concerned about whatâ\u0080\u0099s blowinâ\u0080\u0099 in the wind, so to speak.â\u0080\u009d Warm, beachy spots on the Atlantic, Pacific and Gulf Coasts have been retirement magnets for decades. But, as Hurricane Laura just underscored, theyâ\u0080\u0099re also squarely in the crosshairs of the changing climate, effects of which are already evident in many of the nationâ\u0080\u0099s most popular retirement destinations.Climate change and retirement location decisions â\u0080\u009cCurrent climate andÂ future climateÂ is absolutely something that people should be thinking about when deciding where to live, where to retire,â\u0080\u009d advises Radley Horton, a climate scientist at Columbia Universityâ\u0080\u0099s Earth Institute, who has focused on climate adaptation strategies. â\u0080\u009cThose are absolutely critical concerns when you think about impacts directly on the home, but also livability outdoors â\u0080\u0094 things like critical infrastructure, too,â\u0080\u009d says Horton. Rising seas are threatening things we tend to take for granted in many areas, like major freeways, airports and sewage treatment plants. The hazards of wildfires and extreme heat are also intensifying due to climate change. Coastal communities are particularly at risk. As the atmosphere warms, it retains more water vapor, which often translates into tropical storms that dump previously unseen amounts of precipitation â\u0080\u0094 more than 50 inches within 48 hours for Hurricane Harvey, when it stalled over the Houston area in August 2017. Harvey remains one of the costliest weather disasters on record, causing $125 billion in damage.A frightening future Climate change experts believe the future looks even more harrowing. Whether itâ\u0080\u0099s ferocious winds, storm surge or rain-driven flooding, Eric Jay Dolan writes inÂ â\u0080\u009cA Furious Sky,â\u0080\u009d his 500-year history of hurricanes, â\u0080\u009cbecause of global warming, hurricanes of the future will most likely be worse than those of the past.â\u0080\u009d And extreme weather events are expected to become more common as global heating intensifies. A recent survey by Stanford University, the Resources for the Future research group and the ReconMR research firm, however, found that 68% of Americans want the U.S. government to do more to deal with global warming. Some popular lists of top retirement spots include environmental factors such as air quality, but itâ\u0080\u0099s rare to see any consideration given to present and future impacts from climate change.What the best places lists say (and donâ\u0080\u0099t say) Take the U.S. News list ofÂ 25 Best Places to Retire in 2020. It includes nine cities in Florida, citing â\u0080\u009caffordable homes, low taxes and high ratings for happiness and desirability.â\u0080\u009d No. 14, Miami, is not only in Hurricane Alley, but already sees â\u0080\u009csunny-dayâ\u0080\u009d flooding at high tides on a regular basis, the result of rising sea levels. For the first time, Forbes magazine hasÂ included climate risk in its latest Top 25 listÂ of most desirable retirement towns. But the list is still heavily clustered along the southeast coast of the country. Cities on it, from Virginia Beach, Va. to Savannah, Ga. to Sarasota, Fla., are all strung out along Hurricane Alley. The Forbes list also includes Mesa and Green Valley in Arizona, a state which has experienced record heat of late. Interestingly, no place in California makes the grade. Prohibitive real-estate prices are no doubt a factor, but relentless droughts and a string of increasingly catastrophic wildfire seasons have given many people pause about making the Golden State their home in retirement.In Arizona, heat and water worries Six years ago, Gail Fox Johnson and her husband, John, sold their home in Marin County, Calif. and moved into a planned, 55+ community outside Scottsville, Ariz. Though Gail describes their new surroundings outside as â\u0080\u009cstaggeringly beautiful,â\u0080\u009d they might not stay. â\u0080\u009cThe heat is so bad that you cannot go out of your house,â\u0080\u009d she says. â\u0080\u009cYou canâ\u0080\u0099t take the dog for a walk without booties.â\u0080\u009d A recent record-setting stretch of heat got the couple thinking about returning to the West Coast, where Johnâ\u0080\u0099s sons still live. â\u0080\u009cForty-two days of over 110, and 25 consecutive days of over 115,â\u0080\u009d she recited. â\u0080\u009cHell, we canâ\u0080\u0099t even go out.â\u0080\u009d The Phoenix area has had 50 days of 110 F or higher this summer. Also see:Iâ\u0080\u0099ve got a budget of $3,300 a month and want to be near some â\u0080\u0098wildâ\u0080\u0099 areas â\u0080\u0094 where should I retire? Fox Johnson also worries about future water supplies in her central Arizona area, as development of another 2,000 homes looms nearby, with plans to tap into her communityâ\u0080\u0099s water supply. Scientists say that drought is an increasing threat to southwestern states, with the future of water supplies from the Colorado River in doubt.Americaâ\u0080\u0099s most climate-proof city? No place will be immune from the impacts of a warming planet. In 2019, the New York Times touted Duluth, Minn. as Americaâ\u0080\u0099s most climate-proof city, arguing that because of geographic factors, the region â\u0080\u009cwill be one of the few places in America where the effects of climate change may be more easily managed.â\u0080\u009d Read: â\u0080\u0098I hate the humidity and can do with a lot less snow and ice, and my husband hates the extreme heatâ\u0080\u0099 â\u0080\u0094 where should we retire? But even Duluth is facing climate change challenges. Itâ\u0080\u0099s contending with fluctuating water levels in Lake Superior, which threaten shoreline development. More southern Midwestern cities face the threat of extreme heat waves.The warming problem in the Midwest University of Notre Dameâ\u0080\u0099sÂ Global Adaptation Initiative researchers have assessed climate riskÂ in 278 U.S. cities, through their Urban Adaptation Assessment tool. They concluded that â\u0080\u009ceight of the top 10 cities facing the highest likelihood of extreme heat in 2040 are located in the Midwest.â\u0080\u009d That list includes a cluster of cities in Michigan, from Detroit in the east to Grand Rapids in the West. Cincinnati, Indianapolis and Dayton, Ohio also face high probability of future heat events, according to Notre Dame researchers. The city with the highest probability of an extreme heat event in 2040, according to Notre Dame: Clarksville, Tenn. The Notre Dame assessment also lets you plug in the name of any big city to determine its climate change risk and readiness.Which locales seem less risky? No place is wholly immune, of course. But areas like New England and the Pacific Northwest have steep coastlines which provide a buffer against high-tide flooding and storm surge. Horton says higher elevations inland should also provide some climate change protection, not just from flooding but also from rising temperatures and humidity. â\u0080\u009cIn general,â\u0080\u009d he says, â\u0080\u009canywhere you have elevation, even itâ\u0080\u0099s just 1,000 feet, 1,500 feet, protects you from humid heat, which is particularly dangerous.â\u0080\u009d Paradoxically, adds Horton, â\u0080\u009cThereâ\u0080\u0099s been migration away from some of the places that are looking relatively good in the future â\u0080\u0094 places like the Great Lakes.â\u0080\u009d Meanwhile, the Kachurs are pondering whether theyâ\u0080\u0099ve found retirement serenity in Myrtle Beach or if a move to higher ground â\u0080\u0094 maybe the Piedmont region of North Carolina â\u0080\u0094 would be prudent. There, Bill might finally be freed of something thatâ\u0080\u0099s become a nearly annual ritual: putting metal hurricane shutters over the windows. â\u0080\u009cThe 65-year-old is thinking about the 75-year-old in me and do I want to be doing that in 10 years?â\u0080\u009d he muses. â\u0080\u009cAnd the answer is no.â\u0080\u009d Craig Millerâ\u0080\u0099s career in broadcasting and journalism spans more than 40 years, though since 2008, his focus has been on tracking climate science and policy. Miller launched and edited the award-winning Climate Watch multimedia initiative for KQED in San Francisco, where he remained a science editor until August of 2019. Prior to KQED, he spent two decades as a television reporter and documentary producer at major-market stations, as well as CNN and MSNBC. When heâ\u0080\u0099s not working, his favorite spot is in his kayak on a scenic river or mountain lake. This article is reprinted by permission from NextAvenue.org, Â© 2020 Twin Cities Public Television, Inc. All rights reserved."}]}