{"article": [{"url": "https://www.marketwatch.com/story/house-passes-bipartisan-stopgap-funding-bill-to-avert-government-shutdown-at-months-end-2020-09-22", "published": 1600809020.0, "headline": "House passes bipartisan stopgap funding bill to avert government shutdown at monthâ\u0080\u0099s end", "body": "WASHINGTON (AP) â\u0080\u0094 In a sweeping bipartisan vote that takes a government shutdown off the table, the House passed a temporary government-wide funding bill Tuesday night, shortly after President Donald Trump prevailed in a behind-the-scenes fight over his farm bailout. The stopgap measure, which next heads to the Republican-controlled Senate, will keep federal agencies fully up and running into December, giving lame-duck lawmakers time to digest the election and decide whether to pass the annual government funding bills by then or kick them to the next administration. The budget year ends Sept. 30. “ Trump announced a new $13 billion allotment of bailout funding at a political rally in Wisconsin last week. ” The 359-57 vote came after considerable behind-the-scenes battling over proposed add-ons. The final agreement gives the administration continued immediate authority to dole out Agriculture Department subsidies in the run-up to Election Day. House Speaker Nancy Pelosi, D-Calif., retreated from an initial draft that sparked a furor with Republicans and farm-state Democrats. Instead, in talks Tuesday, Pelosi restored a farm aid funding patch sought by the administration, which has sparked the ire of Democrats who said it plays political favorites as it gives out bailout money to farmers and ranchers. In return, Pelosi won COVID-related food aid for the poor, including a higher food benefit for families whose children are unable to receive free or reduced lunches because schools are closed over the coronavirus. Another add-on would permit states to remove hurdles to food stamps and nutrition aid to low-income mothers that are more difficult to clear during the pandemic. The deal permitted the measure to speed through the House after a swift debate that should ensure smooth sailing in the GOP-held Senate before next Wednesdayâ\u0080\u0099s deadline. Thereâ\u0080\u0099s no appetite on either side for a government shutdown. “ â\u0080\u0098The Trump administration has proven they cannot be trusted to distribute payments fairly.â\u0080\u0099 ” â\u0080\u0094 Sen. Debbie Stabenow, a Michigan Democrat On Monday, Democrats released a version of the stopgap measure that did not contain the farm bailout provision, enraging Republicans and putting passage of the measure in doubt. It became apparent that Pelosi did not have the votes to pass it â\u0080\u0094 Senate Majority Leader Mitch McConnell, R-Ky., dismissed it as a â\u0080\u009crough draftâ\u0080\u009d â\u0080\u0094 and negotiations continued. Democrats complain that the Trump administration has favored southern states such as Georgia â\u0080\u0094 a key swing state and home of Agriculture Secretary Sonny Perdue â\u0080\u0094 and larger producers in distributing bailout funds. Farmers are suffering from low commodity prices and the effects of higher tariffs imposed by Trump. Trump announced a new $13 billion allotment of bailout funding at a political rally in Wisconsin last week. From the archives (October 2019):Trump agriculture secretary says during Wisconsin visit that family-run dairy farms may not survive â\u0080\u009cThe Trump administration has proven they cannot be trusted to distribute payments fairly,â\u0080\u009d said Sen. Debbie Stabenow of Michigan, top Democrat on the Agriculture Committee. She added that the Agriculture Department doesnâ\u0080\u0099t need the authority to meet farm bill obligations and will get the money in November anyway. But other Democrats, including endangered House incumbents in states like Iowa and Minnesota, pressed for the farm aid. See:Trump rails against flag burning, activist athletes at Wisconsin rally, saying $13 billion would begin flowing â\u0080\u0098starting next weekâ\u0080\u0099 to help farmers â\u0080\u009cNow is not the time to be playing politics with aid to farmers or the assistance needed to save our families and local economies from economic disaster,â\u0080\u009d said freshman Rep. Abby Finkenauer, D-Iowa. The measure is the bare minimum accomplishment for Capitol Hillâ\u0080\u0099s powerful Appropriations committees, who pride themselves on their deal-making abilities despite gridlock in other corners of Congress. It came after bipartisan negotiations on a huge COVID-19 relief package imploded and appear unlikely to be rekindled â\u0080\u0094 especially since the death of Supreme Court Justice Ruth Bader Ginsburg has upended U.S. politics. â\u0080\u009cWe need to keep the government open but we also need additional COVID relief for the American people,â\u0080\u009d said Rep. Debbie Wasserman Schultz, D-Fla. The legislation â\u0080\u0094 called a continuing resolution, or CR, in Washington-speak â\u0080\u0094 would keep every federal agency running at current funding levels through Dec. 11, which will keep the government afloat past an election that could reshuffle Washingtonâ\u0080\u0099s balance of power. The measure also extends many programs whose funding or authorizations lapse on Sept. 30, including the federal flood insurance program, highway and transit programs, and a long set of extensions of various health programs, such as a provision to prevent Medicaid cuts to hospitals that serve many poor people. It also finances the possible transition to a new administration if Joe Biden wins the White House and would stave off an unwelcome COVID-caused increase in Medicare Part B premiums for outpatient doctor visits. The underlying stopgap measure deals with the 30% of the federal governmentâ\u0080\u0099s day-to-day budget that goes to Cabinet agency operations funded by Congress each year. The annual appropriations process broke down in the Senate this year and itâ\u0080\u0099s unclear but probably unlikely that the $1.3 trillion in agency spending bills will be enacted this year, even in a post-election lame duck session, especially if Biden is elected to replace Trump. In the past, both Democrats and Republicans have sought to use government funding deadlines and must-past temporary funding bills as leverage to try to win concessions elsewhere on Washingtonâ\u0080\u0099s agenda. Such efforts invariably fail. Republicans in 2013 used it in a failed attempt to prevent implementation of the so-called Obamacare health law, and Senate Democrats returned the favor in 2018 in a futile effort to force debate on permitting immigrants brought into the country illegally as children to remain in the U.S. Pelosi studiously avoided such a confrontation this time."}]}