{"article": [{"url": "https://www.marketwatch.com/story/america-is-facing-an-eviction-crisis-as-moratoriums-expire-this-is-a-potential-catastrophe-2020-07-23", "published": 1595767340.0, "headline": "America is facing an eviction crisis as moratoriums expire: â\u0080\u0098This is a potential catastropheâ\u0080\u0099", "body": "The United States is facing a possible tsunami of evictions caused by the coronavirus pandemic. The CARES Act, which was signed into law in March, established a temporary moratorium on evictions for all rental units that were backed by some form of federally financing, including Fannie Mae FNMA, +0.73% Â and Freddie Mac FMCC, +0.52% Â loans. That moratorium is scheduled to end on Saturday. The CARES Act moratorium protected some 12.3 million rental units nationwide, a report from the Urban Institute estimated. And while many cities and states passed their own eviction moratoriums, many of those have either already expired or are set to end soon. â\u0080\u009cThis is a potential catastrophe,â\u0080\u009d Senate Minority Leader Chuck Schumer, a Democrat from New York, said during a press conference Wednesday. Congressional Democrats have proposed multiple pieces of legislation in recent weeks aimed at extending and expanding the federal eviction moratorium. Last month, Sen. Elizabeth Warren of Massachusetts introduced a bill that would extend the CARES Act moratorium for another eight months until March 2021 and expand the protections to nearly all renters nationwide. Under Warrenâ\u0080\u0099s legislation, landlords would be barred from charging renters fees for missed payments. Landlords would also be required to provide 30 daysâ\u0080\u0099 notice for evictions when the moratorium ended. â\u0080\u009cRenters often donâ\u0080\u0099t know if theyâ\u0080\u0099re covered by the federal moratorium,â\u0080\u009d Warren said during the press conference on Wednesday. â\u0080\u009cFailing to put a safeguard in place to keep people in their homes is most likely to harm the most vulnerable Americans.â\u0080\u009d “ â\u0080\u0098Renters often donâ\u0080\u0099t know if theyâ\u0080\u0099re covered by the federal moratorium.â\u0080\u0099 ” â\u0080\u0094 Sen. Elizabeth Warren of Massachusetts Separately, Sen. Kamala Harris of California unveiled legislation last week nicknamed the RELIEF Act that would ban evictions and foreclosures for a year. The bill includes additional provisions that prevent utilities companies from ending service, landlords from raising the rent on tenants and negative credit reports amid the economic crisis caused by the pandemic. â\u0080\u009cHousing is a human right, and thatâ\u0080\u0099s why we need this comprehensive plan to help keep Americans safe and in their homes throughout the COVID-19 pandemic,â\u0080\u009d Harris said in an announcement regarding the legislation. Both Harris and Warren are being considered for the vice presidential slot alongside presumptive presidential nominee Joe Biden. Also see:â\u0080\u0098Landlords are just trying to pay bills like everyone else.â\u0080\u0099 The coronavirus could hit mom-and-pop landlords hard as tenants miss rent paymentsMillions of Americans are at risk of eviction A look at data from the U.S. Census Bureau shows how severe the eviction crisis could become. The agencyâ\u0080\u0099s most recent household survey found that nearly one in five renters â\u0080\u0094 which equates to roughly 14 million renters â\u0080\u0094 either didnâ\u0080\u0099t pay the rent last month at all or delayed their payment. These are households that are at serious risk of eviction if moratoriums expire. In cities where local and state eviction moratoriums have lifted, evictions are indeed happening. In Houston, Texas, there were 550 eviction filings over the past week, and more than 1,700 over the past month, according to the most recent data from the Eviction Lab at Princeton University. Texas had an eviction moratorium go in effect in March, but it ended back in May. In cities like Houston, some renters were still protected by the federal moratorium. They could now too be at risk of eviction if lawmakers donâ\u0080\u0099t extend it. And matters arenâ\u0080\u0099t sure to improve. The Census survey found that more than 9 million renters have no confidence in their ability to pay the rent next month, while another 14 million were only slightly confident they could. Renters of color are disproportionately more at risk of losing their housing. More than one-quarter of Black renters nationwide missed last monthâ\u0080\u0099s rental payment, the Census Bureau survey data show. And nearly one in six Black renters said they have no confidence that they will be able to pay the following monthâ\u0080\u0099s rent. “ â\u0080\u0098If these protections are allowed to expire without further support, we risk facing a wave of evictions that would disrupt the lives of vulnerable renters across the county.â\u0080\u0099 ” â\u0080\u0094 Chris Salviati, housing economist at real-estate website Apartment List Separately, research from the National Multifamily Housing Council suggests that 91.3% of apartment households had made a full or partial rent payment by July 20, meaning that nearly 1 million households who live in apartments did not pay. The crisis could be especially acute in high-cost real-estate markets. In Santa Clara County, California, which is home to Apple AAPL, +1.74% Â and Google GOOG, +1.97% Â , among many other tech companies, a recent report estimated that more than 43,000 household are at risk of eviction. Thatâ\u0080\u0099s 16 times the number of evictions for a full year in the county typically. In addition to the federal moratorium ending, the extra $600 in weekly unemployment benefits from the federal government are scheduled to stop at the end of July. Republican lawmakers are reportedly floating the possibility of extending the benefits at a reduced amount capped at $400 a month until a longer-term relief package could be finalized. And while many households benefited from the one-time stimulus payments, the $1,200 payment that individuals received was only slightly larger than the national median rent, which was $1,023 as of 2018. The pandemic has exacerbated issues related to housing affordability across the country â\u0080\u009cThe pandemic has forced millions of Americans into sudden financial hardship, and the combination of direct stimulus and eviction moratoriums has been crucial in helping these folks maintain housing stability in recent months,â\u0080\u009d said Chris Salviati, housing economist at real-estate website Apartment List. â\u0080\u009cIf these protections are allowed to expire without further support, we risk facing a wave of evictions that would disrupt the lives of vulnerable renters across the county.â\u0080\u009d A recent report from the National Low-Income Housing Coalition found that one in four renter households, which equates to 11 million households, have incomes so low that they cannot afford most market-rate apartments. In 2020, there were only four states â\u0080\u0094West Virginia, Kentucky, Mississippi and Arkansas â\u0080\u0094 where a full-time worker earning $15 an hour could afford a two-bedroom home without spending over a third of their income on rent, the National Low-Income Housing Coalition found. In the context of an ongoing pandemic, the threat of a rise in evictions also amounts to a public health concern. â\u0080\u009cThis pandemic is a stark reminder that housing is health care,â\u0080\u009d Diane Yentel, president and CEO of the National Low Income Housing Coalition, told MarketWatch in March when the moratoriums nationwide were first going into effect.Activists, industry groups call for rental assistance Progressive activists and trade associations that represent landlords agree that lawmakers need to go further in terms of addressing rentersâ\u0080\u0099 needs amid the pandemic. â\u0080\u009cA robust rental assistance program is the only policy that both addresses the basic need of housing for renters and ensures apartment owners can pay the bills to keep rental housing operational,â\u0080\u009d Greg Brown, senior vice president of government relations at the National Apartment Association, told MarketWatch in an e-mail. Brown argued that apartment owners have aimed to avoid evictions by offering payment plans and waiving late fees. â\u0080\u009cUnchecked claims of mass evictions have consequences that steer policymakersâ\u0080\u0099 attention away from the policy we desperately need to keep Americaâ\u0080\u0099s 43 million renters safely housed and the apartment industry solvent â\u0080\u0094 emergency rental assistance,â\u0080\u009d Brown said. “ â\u0080\u0098The alternative to not canceling the rent is the complete bottoming out of the market.â\u0080\u0099 ” â\u0080\u0094 Tara Raghuveer, housing campaign director at Peopleâ\u0080\u0099s Action Sen. Sherrod Brown of Ohio, a Democrat, introduced legislation in May that would create a $100 billion emergency rental assistance program to help households during the pandemic. The National Low-Income Housing Coalition has also called for lawmakers to establish temporary rental assistance. The organizationâ\u0080\u0099s research has estimated that it would cost $99.5 billion to cover all current and projected cost-burdened, low-income renters. Read more:â\u0080\u0098The housing emergency most harms people of color:â\u0080\u0099 Black Americans face an unequal housing market â\u0080\u0094 and coronavirus could make it worse Some activists, however, have advocated for rent forgiveness in lieu of rental assistance. Former vice president and presumptive Democratic presidential nominee Joe Biden has voiced his support for that approach, and Rep. Ilhan Omar, a Democrat of Minnesota, has introduced legislation that would achieve it. Forgiving or canceling rent would mean that landlords would seek assistance rather than tenants. Trade groups oppose Omarâ\u0080\u0099s legislation, arguing it doesnâ\u0080\u0099t adequately address the issue. But activists say that without rent forgiveness, the economyâ\u0080\u0099s recovery is in jeopardy. â\u0080\u009cThe alternative to not canceling the rent is the complete bottoming out of the market,â\u0080\u009d Tara Raghuveer, housing campaign director at Peopleâ\u0080\u0099s Action, a political network devoted to grassroots organizing, told MarketWatch in May. â\u0080\u009cAnd tens of millions of people literally never financially recovering from this moment.â\u0080\u009d"}]}