{"article": [{"url": "https://www.marketwatch.com/story/heres-what-stock-market-investors-think-is-the-biggest-factor-in-their-investing-as-coronavirus-cases-risehint-it-isnt-a-second-wave-2020-06-19", "published": 1592642360.0, "headline": "Here's what stock-market investors think is the biggest factor in their investing as coronavirus cases rise-hint: it isn't a second wave", "body": "Worries about rising coronavirus infections in parts of America have the stock market on edge this week. COVID-19 cases in Arizona, Florida, the Carolinas, California and Texas, have jumped, with those states registering record-high, single-day increases on Thursday. The re-emergence of the novel strain of coronavirus that causes COVID-19 compelled the World Health Organization at a Friday briefing to say that the pandemic has entered a \"new and dangerous phase,\" coming 101 days after the organization declared the virus a pandemic. Making the point, Apple Inc. AAPL, +1.74%  announceed it was re-closing nearly a dozen stores as infections rose in some states. The stock-market buckled amid the news, ending a volatile day mostly lower, but all three U.S. benchmark indexes ended higher for the week. However, a recent survey by Jefferies Financial Group indicates that the rise in coronavirus cases is not the central worry for investors. The investment firm's survey indicates that the shape of the economic recovery is the single-biggest factor by far for the investment community (see attached chart). \"For the last few months, markets have largely ignored economic data, blindly following the Fed. That may be changing,\" analysts Aneta Markowska and Thomas Simons wrote in a Friday report. Indeed, economists and investors have been engaged in an alphabet-centered debate over the likely shape of the recovery from the recession caused by the COVID-19 pandemic. The questions center on whether gross domestic product growth plotted on a graph would look like the letter 'V', that is a short, sharp recovery, as opposed to a 'W\" representing a double-dip recession, or even a 'U', signaling a slow recovery. Read: 'The dollar is going to fall very, very sharply,' warns prominent Yale economist That said, the strategists note that small-business activity appears to be losing momentum at a national level, citing declines in employment and the number of businesses that are open, amid the restart of activity in all 50 states. What shape the recovery takes may be the most important question, but it may also be the most difficult to determine at this juncture, which makes the answer, perhaps, all the more significant. Check out: Stock-market legend who called 3 financial bubbles says this one is the 'Real McCoy,' this is 'crazy stuff'"}]}