{"article": [{"url": "https://www.marketwatch.com/story/trump-administration-threatens-to-start-fining-hospitals-that-fail-to-report-daily-coronavirus-data-2020-08-26", "published": 1598439740.0, "headline": "Trump Administration threatens to start fining hospitals that fail to report daily coronavirus data to HHS", "body": "WASHINGTON (AP) — Threatening fines and funding cutoffs, the Trump administration on Tuesday issued new COVID-19 requirements for nursing homes and hospitals, prompting immediate pushback from beleaguered industries. To check the spread of the coronavirus in nursing homes, the Centers for Medicare and Medicaid Services announced it will require facilities to test staff regularly or face fines. The move comes months after the White House first urged governors to test all nursing home residents and staff. With residents, nursing homes are being required to offer them coronavirus tests if there is an outbreak or if any show symptoms. Officials also reinforced a reporting mandate for hospitals. It included a thinly veiled threat to cut off Medicare and Medicaid funds to facilities that fail to report certain COVID-19 data daily to the federal Health and Human Services Department. Hospitals responded with a sharp rebuke, calling the move “heavy-handed” and raising the specter of loss of vital services for local communities in a pandemic, less than three months before Election Day. Long-term care facilities represent less than 1% of the U.S. population, but they account for 42% of the COVID-19 deaths, with more than 70,000 fatalities reported by the COVID Tracking Project. The plight of frail elders in nursing homes is politically sensitive for President Donald Trump, who is trying to maintain support from older voters amid disapproval of the government’s pandemic response. His administration is distributing fast-test machines to nursing homes, but there are continued reports that cases have been rising and facilities still face shortages of supplies like masks. “Our recommendations for testing in nursing homes go back as far back as March and April,” said Seema Verma, head of the Centers for Medicare and Medicaid Services, or CMS. “What’s different about today is that this is now a requirement ... we want to make sure every single nursing home is complying.” Independent research indicates that the coronavirus most likely gets into nursing homes via staffers who unwittingly bring it in from surrounding communities where it has started to spread. Staffers who have yet to develop symptoms may have no clue that they’re infected. Verma said the testing requirement for staff will be keyed to the level of virus activity in local areas. If the positive rate is below 5%, nursing homes will have to test staff once a month. If the rate is 5% - 10%, testing will be required once a week. If the rate is above 10%, staff will have to be tested twice a week. Florida, Iowa and Nevada are examples of states where the COVID-19 positive rate is now above 10%. The government will provide $2.5 billion to help nursing homes with testing costs, Verma also announced. The administration’s campaign to distribute fast-test machines and an initial supply of tests is supposed to be done by the end of September. The nursing home industry said it supports mandatory testing as long as facilities are given what they need to comply with requirements. Mark Parkinson, head of the industry group American Health Care Association, said nursing homes in many parts of the country still can’t get timely results on COVID-19 tests. CMS “must factor in the delays that continue to be a reality,” Parkinson said in a statement. “Otherwise facilities could face fines for circumstances beyond their control and be conducting tests that are so delayed that they have little clinical value.” The hospital reporting requirement that was also announced Tuesday follows confusion and misgivings surrounding a Trump administration directive that facilities send critical COVID-19 data directly to HHS instead of the Centers for Disease Control and Prevention, as had been the case. The information includes numbers of confirmed or suspected COVID-19 cases, how many intensive-care beds are occupied, and the availability of essential supplies and equipment such as ventilators and masks and gowns. The regulation basically says if hospitals want to continue to participate in Medicare and Medicaid, they must report the information as required. The American Hospital Association called for the requirement to be immediately rescinded. “Hospitals and health systems consistently have put forward a good faith effort to report the data needed to battle COVID-19 under very trying circumstances, despite the ever-changing requests from the government on data reporting,” Rick Pollack, president of the American Hospital Association, said in a statement. “Since February, the government has made at least six changes to how they want hospitals to report data.” Federal statistics show that 94% of hospitals are reporting the required data, said Pollack. He added his organization has done some investigation of its own and found that in some cases hospitals had sent in their reports, but the information had not gotten through the government system. “It’s beyond perplexing why CMS would use a regulatory sledgehammer — threatening Medicare participation — to the very organizations that are on the front lines in the fight against COVID-19.” CMS chief Verma said the requirement is meant to correct deficiencies in reporting vital data needed to track and contain the pandemic."}]}