{"article": [{"url": "https://www.marketwatch.com/story/us-trade-deficit-in-goods-climbs-35-in-august-to-record-829-billion-2020-09-29", "published": 1601375120.0, "headline": "U.S. trade deficit in goods climbs 3.5% in August to record $82.9 billion", "body": "The numbers: The U.S. trade deficit in goods rose 3.5% in August to a record $82.9 billion, reflecting a sluggish rebound in exports that’s weighing on the broader economy and could slow the recovery from the coronavirus pandemic. Economists polled by MarketWatch has forecast a small decline in the trade gap. Read:Pelosi, Mnuchin agree to keep talking on COVID-19 aid, but no deal near What happened: Imports of foreign goods such as autos and consumer goods climbed 3.1% in August to $201.3 billion and returned to pre-pandemic levels. The same can’t be said for exports. They rose 2.8% in August to $118.3 billion, the U.S. Census Bureau said Tuesday, but are still down about 13% compared to just before the pandemic struck. The advanced report only includes goods. Services such as travel and tourism aren’t included until the full report that gets released next week. Services have been hurt even worse with few people flying and traveling to other countries. A larger trade deficit subtracts from gross domestic product, the official scorecard for the U.S. economy. An advanced look at wholesale inventories, meanwhile, showed a 0.5% increase in August. And an early look at retail inventories pointed to a 0.8% gain. The big picture: The snapback in imports shows Americans are more willing to buy more cell phones, BMWs and other goods they’ve long sought from overseas suppliers. Imports sank early in the pandemic due to disruptions in global trade and depressed demand after millions of Americans lost their jobs. The increases in wholesale and retail inventories are also a good sign, signaling that retailers are restocking their shelves ahead of the Christmas season. The slower rebound in exports, however, is a drag on the economy. And American exporters face the prospect of tougher sales amid a fresh outbreak of the coronavirus in Europe and other markets. If exports start to flag, it will deter manufacturers and other companies from bringing back more jobs. What they are saying?: “The recovery in exports appears to be slowing down and with second waves of the virus materializing globally, we expect their recovery to be protracted and choppy ahead,” wrote economist Katherine Judge of CIBC. “Growth in imports could also slow ahead given that the U.S. economy is now on a slower recovery trajectory.”Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 index SPX, +0.87% fell slightly in Tuesday trades."}]}