{"article": [{"url": "https://www.marketwatch.com/story/heres-exactly-what-americans-have-been-splurging-on-during-quarantine-2020-06-17", "published": 1592745620.0, "headline": "What Americans splurged on during the first 100 days of the coronavirus pandemic", "body": "It’s 100 days since the World Health Organization declared the coronavirus outbreak a pandemic. Have stay-at-home orders changed U.S. shopping habits? “With the increased financial pressure and job insecurity, many consumers will redistribute their spending or saving in certain areas,” a new analysis by Nielsen found. “On the basis of observations in previous crisis situations and consumer surveys, we believe that changes in spending patterns will particularly affect the areas of fashion, take-away, travel/holidays and replacement purchases.” “ The hoarding at grocery stores appears to have eased, for now at least. ” For starters, consumers may be planning more road trips this summer instead of air travel. U.S. retail sales jumped by 17.7% in May, the government said this week. Economists polled by MarketWatch had forecast an 8.5% increase. Sales at auto dealers soared 44%; excluding cars, overall retail sales increased by 12.4%; the auto sector generally accounts for one-fifth of all retail spending. The hoarding at grocery stores appears to have eased, for now at least. Grocery sales rose 1.3% in sales after a record 14.4% spike in April. Due to the lockdown of businesses in most states, health and personal care — including pharmacies, salons and barbers — ticked up just 0.4%. It remains to be seen whether people will be rushing back to salons, or if they will stick to social-distancing rules. Also read:Why gardening during a pandemic is so comforting — ‘There are certain very stabilizing forces in gardening that can ground us when we are feeling shaky Food-service restaurants were down 40%. With almost 80% of consumers in surveys expressing a desire to work more from home in the future, people will cook more at home, Nielsen said. In Switzerland, which emerged earlier than other countries from the pandemic, daily purchases of food and fresh food will continue to show higher growth rates in the coming months, it said. “ With consumers wish to work remotely, more people will cook at home. ” Some people have had both the time and money to upgrade their wardrobe, even if it’s just for Zoom ZM, +2.89% conference calls, given the amount of time many people are staying in their homes. Sales soared 188% at clothing stores, 90% at home-furnishing stores and 88% at stores that sell books, music and sporting goods, a significant rebound from April and March. Target, among other big-box stores in the U.S., saw “a rapid increase in traffic and sales” for discretionary goods driven by the distribution of stimulus checks, CEO Brian Cornell said in a conference last month. “We certainly saw an uptick as we reported starting on April 15, as those checks arrived across America,” he added. It remains to be seen whether people will be rushing back to salons, or stick to social-distancing rules. AP Photo/Charlie Neibergall Also see:‘I’ll never give my wife $1,200 to blow her stimulus check. She’ll get a couple of hundred bucks to go shopping.’ What’s wrong with that? Still, many people are merely trying to stay above water. Nearly one-third (30%) of people said they used their $1,200 stimulus checks to pay bills, according to a survey released this month. The May unemployment rate dropped to 13.3% from 14.7% the month before, and millions of Americans are clearly struggling to make ends meet. “ 30% of people said they used their $1,200 stimulus checks to pay bills. ” Those bills — for cellphones, utilities, cable TV and rent — are the No. 1 priority, even more than essentials and “relief spending” on apparel, TVs, video games and sporting goods at Walmart WMT, +1.00%, Costco COST, +1.19% and Target TGT, +1.14%. “It’s alarming to look at how many Americans used these funds to keep a roof over their head,” according to YouGov. There’s growing concern among many people that the economy won’t restart in time to save them from the choice between paying their rent or mortgage and going hungry. One-third of homeowners have less than $500 — or, worse, nothing — set aside for an emergency home repair, a Harris Poll released this month found. The number of confirmed COVID-19 cases continues to rise. As of Sunday, less than six months after the first reports of the novel coronavirus, the COVID-19 pandemic, there were 2,264,168 confirmed cases of COVID-19 in the U.S. and 119,796 deaths, including 31,083 deaths in New York, the most of any state in the country. Worldwide, there were 8,835,095 confirmed cases and 465,284 deaths as of Sunday, according to Johns Hopkins University. The Dow Jones Industrial Index DJIA, +0.56% and the S&P 500 SPX, +0.87% ended weaker Friday, as the market mulled hopes of a potential therapeutic steroid treatment and vaccine research."}]}