{"article": [{"url": "https://www.marketwatch.com/story/stocks-are-rallying-because-fears-of-a-contested-election-are-fading-11602178345", "published": 1602232340.0, "headline": "Stocks are rallying because fears of a contested election are fading", "body": "Drew Angerer/Getty Images The protracted fight in Washington over the next stimulus package has been a focus for Wall Street, but the bigger catalyst likely driving stocks higher this week is polls that point to a more decisive election outcome in November. That’s the growing consensus from investors who say the recent rally in Wall Street isn’t about the ups and downs of fiscal stimulus negotiations, which they view as unlikely to result in something concrete this year, but instead reflect the dwindling odds of a contested election outcome. “The most convincing explanation in our view isn’t so much the likely outcome of the election itself, but rather speculation as to the increasing clarity of the result,” said analysts at Rabobank. Before polls were showing a significant lead by Democratic candidate Joe Biden, investors worried that the large amount of mail-in voting could mean an election result that remains known until days after Nov. 3. The ensuing political uncertainty could keep markets on edge for days. But a larger margin of victory, if Biden is elected, likely would mean a result will be an announced on the day of the election, a boost to risk assets that were pricing in elevated volatility in the days and weeks after the election. “In assuaging concerns over either a contested result or an unwillingness on the part of Trump to accept the outcome of the election, this development is lowering the risk of protracted political uncertainty in the wake of Nov. 3 and the attendant likelihood of resurgent civil unrest. This then looks to explain both the recent risk on tone and the broad-based move on the part of risky assets,” said Rabobank analysts. The S&P 500 SPX, +0.87% is up 2.9% this week, while the Dow Jones Industrial Average DJIA, +0.56% has advanced 2.7% over the same stretch, FactSet data show. Some analysts also suggested that the possibility of a more aggressive fiscal stimulus package next year, if there is a Democratic clean sweep, already has been driving stock market gains. But Rabobank’s team thinks the internal dynamics of the recent equity rally hint at other drivers. For example, technology shares this week have managed to keep pace with gains in the broader market, despite some congressional Democrats calling for additional regulations to curb the power of the tech giants. Read: If the Democrats win the Senate, Big Tech better be ready for a bigger fight Barclays analysts point out that trading in futures pegged to the Cboe Volatility Index VIX, -5.15% contract also have shown traders expect less volatility in the wake of the election. Futures for the “VIX,” which measures expected volatility over the coming 30 days for the S&P 500, can offer a hedge against increased market turbulence. In the past few weeks, VIX futures for mid to late November have pointed to more equity volatility than for futures in October, reflecting worries around an uncertain election outcome as the reverse was true for previous presidential elections. But that trend has appeared to reverse this week. A widely traded VIX futures contract expiring on November 18 is down to 31.18, after peaking as high as 35 last Friday, the chart below shows. Prices for November VIX futures have started to fall Cboe “The market is assigning a lower probability of an uncertain outcome. In other words, the market appears to be most concerned about an ambiguous scenario and, at least in the short term, would prefer a clean outcome even if that were a Biden win,” said Barclays analysts. Still, markets haven’t completely discounted the potential for some turbulence next month. November VIX futures are still trading at elevated levels, notes Nicholas Colas at DataTrek, who suggested current pricing reflects a 50-50 chance between a clear and contested election."}]}