{"article": [{"url": "https://www.marketwatch.com/story/patrick-mahomes-to-lead-voter-registration-drive-ahead-of-the-november-elections-2020-06-12", "published": 1591971920.0, "headline": "Super Bowl MVP Patrick Mahomes to lead a voter registration drive ahead of the November elections", "body": "KANSAS CITY, Mo. (AP) — Patrick Mahomes and Tyrann Mathieu knew they had a platform to speak out about social injustice given their visibility and stature with the Super Bowl champion Kansas City Chiefs. The question was what to do with it. The young quarterback and star safety, both of whom have been active the past couple of years in the Kansas City community, wanted to do more than just talk. They wanted their words to lead into action. And that’s why they have joined with the Chiefs in the beginnings of a voter registration drive ahead of the November elections. See also: Joe Biden is the new favorite over Donald Trump in the 2020 election “If we’re able to impact voter registration and give those people a voice and let those people go into their communities and select heir leaders, that’s going to be very important going forward,” Mathieu said. “If you want to change anything, you’re going to have to educate people on what it is they have to do to change things. A lot of times it’s more than just protesting. They really have to find a call to action. I think voter registration can impact a lot of people.” There were about 245 million registered voters for the last presidential election in 2016, according to the U.S. Census Bureau, but that represents only about 64.2% of those eligible to vote. The numbers were even more bleak among young people with just over half — 50.8% in the 18-24 demographic — registering and 43% turning out at the polls. That happens to be the demographic of Mahomes, who won’t turn 25 until September. The Chiefs plan to announce the details of the voter registration drive at a later date, but coach Andy Reid said it has the support of owner Clark Hunt and everyone in the front office. In fact, Hunt has spoken to a number of players since the death of George Floyd at the knee of a Minneapolis police officer sparked protests nationwide, and his willingness to do whatever it takes to help affect change resonated within the diverse NFL locker room. “Listen, Clark was unbelievable. He was so proud of those guys,” Reid said, “and he called them and talked to them and that’s how Clark does it. He’s unbelievable with guys that way, and he’s all-in and our guys know it. That’s why you don’t hear a lot of chatter. They know they have an open ear to talk.” Mahomes and Mathieu also had prominent roles in a video organized by New Orleans Saints wide receiver Michael Thomas that addressed social injustice, and both have used their social media accounts to discuss issues of diversity and inclusion. “I believe in both my statement and the video we made. That stuff needed to be said,” explained Mahomes, who comes from a mixed-race family with a black father and white mother, giving him a unique perspective on the issue. “We need to come together and show that black lives do matter. It’s great to feel the support we got from the Chiefs, from Coach Reid, and I’ve talked to (NFL commissioner) Roger Goodell and he’s shown his support for us.” Mahomes said he discussed the social unrest with his father, former major league pitcher Pat Mahomes, and his godfather, former reliever LaTroy Hawkins. He also spoke with a number of current and former NFL players. His goal was to educate himself before trying to educate anybody else. “I’m always going to be informed of my decision, and understand there’s going to be good and bad,” Mahomes said, “but I’m going to stand behind my words and take whatever consequences come with it, and hopefully they’re positive. But I’m going to be the best person I can be first, whatever that is.” Mathieu was largely quiet after quarterback Collin Kaepernick’s decision to take a knee to protest social injustice, but he explained that he was busy focused on himself — he was dealing with injuries and personal issues at the time. But with all those troubles in the past, the 28-year-old safety wanted to make sure he was at the forefront of the discussion now. “I don’t think our intentions are to be heroes. We just saw ourselves as the guys to say something, and I know a lot of us, it’s been going on for a while, this problem,” he said. “Most of us would consider this the second time around. And the first time around a lot of us didn’t speak up. A lot of us weren’t vocal for a lot of reasons. And right now, collectively, I think a lot of guys just want to see things pushed forward the right way.”"}]}