{"article": [{"url": "https://www.marketwatch.com/story/what-microsofts-7-5-billion-bet-on-gaming-says-about-its-future-11600706502", "published": 1600692560.0, "headline": "What Microsoftâ\u0080\u0099s $7.5 billion bet on gaming says about its future", "body": "Microsoft plans to purchase game developer Bethesda Softworks' parent company in a $7.5 billion deal Microsoft Microsoft Corp. made a big bet on gaming Monday when it announced that it intends to purchase ZeniMax Media, the parent of game publisher Bethesda Softworks, for $7.5 billion in cash. The company wasted little time beefing up its consumer business after falling short in its attempt to buy the U.S. business of TikTok. With the ZeniMax Media acquisition, it sees room to enhance its Game Pass streaming service by adding Bethesdaâ\u0080\u0099s franchises, including â\u0080\u009cThe Elder Scrollsâ\u0080\u009d and â\u0080\u009cFallout.â\u0080\u009d Microsoftâ\u0080\u0099s stock MSFT, +2.48% was down 0.6% in midday trading Monday. Read: Big Tech is turning on one another amid antitrust probes and litigation Wedbush analyst Daniel Ives called the planned acquisition a â\u0080\u009csmart strategic moveâ\u0080\u009d that strengthens Game Pass, brings in new creation teams, and lets the company capitalize on â\u0080\u009cStarfield,â\u0080\u009d a much anticipated game thatâ\u0080\u0099s currently being developed. â\u0080\u009cWe note that this acquisition comes in the wake of the failed TikTok deal as Nadella continues to remain laser focused on growing the consumer side of the house, while the flagship enterprise/cloud Azure and Office 365 business is humming along at an accelerated growth pace,â\u0080\u009d Ives wrote, while maintaining an outperform rating and $260 target price on the stock. He said that the deal makes sense strategically heading into Microsoftâ\u0080\u0099s â\u0080\u009chighly anticipated new console releaseâ\u0080\u009d and that it highlights how Microsoft â\u0080\u009crecognizes its need for consumer-based revenue growth,â\u0080\u009d which this acquisition could help drive. Microsoft Chief Executive Satya Nadella said in a release that â\u0080\u009cquality differentiated content is the engine behind the growth and value of Xbox Game Pass,â\u0080\u009d while heralding gaming as â\u0080\u009cthe most expansive category in the entertainment industry.â\u0080\u009d The company intends to bring existing Bethesda titles to Game Pass and add future games to the service on the same day that they launch for Xbox and PC. Microsoft anticipates that the ZeniMax Media deal will close in the second half of fiscal 2021 and that it will have â\u0080\u009cminimal impactâ\u0080\u009d on the companyâ\u0080\u0099s operating income for fiscal 2021 and fiscal 2022. Donâ\u0080\u0099t miss: Microsoft says Appleâ\u0080\u0099s threat against â\u0080\u0098Fortniteâ\u0080\u0099 maker would hurt entire videogame industry â\u0080\u009cWhile we expect this acquisition to be largely immaterial to Microsoft near-term given the companyâ\u0080\u0099s scale, we believe this acquisition signals that Microsoft is serious about gaming,â\u0080\u009d Evercore ISI analyst Kirk Materne said in a note to clients. Materne argued that gaming could become the â\u0080\u009cthird pillarâ\u0080\u009d of Microsoftâ\u0080\u0099s investment narrative in the coming years as gaming-as-a-service becomes a more prominent part of the industry. In that world, â\u0080\u009cvendors that can provide gamers with a unique experience through the combination of having great content and a great platform are best positioned to take share in the $109 billion gaming market,â\u0080\u009d he wrote, while maintaining an outperform rating and $250 price target on Microsoftâ\u0080\u0099s stock. Microsoft shares have added about 1% over the past three months as the Dow Jones Industrial Average DJIA, +0.56% has risen 3.4%."}]}