{"article": [{"url": "https://www.marketwatch.com/story/im-looking-to-retire-in-a-warm-place-that-has-a-socially-liberal-mindset-and-lots-of-live-music-and-im-a-die-hard-skier-where-should-i-go-2020-07-29", "published": 1600441940.0, "headline": "I'm looking to retire in a warm place that has a 'socially liberal mindset' and lots of live music - and I'm a die-hard skier. Where should I go?", "body": "Dear MarketWatch, I just turned 50, and I have started thinking seriously about my retirement plans with my wife. While I have always planned to retire to Florida where much of my extended family resides, I have heard that Florida retirement communities are very conservative-minded. Being part of a mixed-race couple and having a socially liberal mindset regarding things like health care and gun control, I would like to find a place where there is a thriving retiree community with a more open mind-set. Ideally the location would offer plenty of outdoor recreation but have more brewpubs with live music than golf courses. We would like warm, but I am also a die-hard skier so mountain access within maybe four hours would be a major plus. We think we'll have a nest egg of $2 million plus the proceeds from the sale of our house. Any ideas? Sean Sean, You certainly don't need to go to Florida to have a wonderful retirement (although you might like Gulfport, suggested here). And retirement doesn't have to mean a retirement community and golf. Here's an interesting challenge: Try summing up your retirement motto in just 7 letters. Read:Four questions to ask when looking for a 55+ active adult community Why not spend some of your vacation time experiencing possible retirement spots in the offseason? That could give you a better idea of whether an area is really for you, potentially avoiding an expensive mistake. Or maybe you're able to take advantage of America's newfound flexibility to work from home and can spend even more time in one spot? An added bonus: you still have time to make adjustments in your savings rate if your nest egg doesn't grow as much as you expect. It also never hurts to set up a spreadsheet to double-check your budget assumptions. Read:4 questions to answer before you make any big changes to your life in retirement Also:I tested 2 free Social Security retirement calculators, and here's what I found If state taxes are a concern, talk to a tax professional about your situation. Remember that places change - and I don't just mean the ever-climbing number of brewpubs. Given that you may not be retiring for another decade, treat these suggestions as just a starting point. Ogden, with the mountains behind it. iStockphoto Ogden, Utah If you want to keep skiing in retirement, is there anything better than the powder out west? Live in Ogden and you could easily ski in a different place every day of the week, including Park City and Alta, within a 90-minute drive. Close to 90,000 people live in this city 40 minutes north of Salt Lake City that's home to Weber State University, a public school. Livability includes Ogden in its 2019 list of best places to live and a 2018 list of affordable mountain towns. While you'd be hard-pressed to find a liberal part of Utah (Park City? Moab?), a local calls this town politically moderate. Note that Donald Trump got less than 50% of the vote in this county. Yes, the Denver area will have more brewpubs and live music and will be more socially liberal, but it's also a lot pricier. The price-to-income ratio in Ogden is 3.9, vs. 5.3 for Denver, according to Realtor.com, which like MarketWatch is owned by News Corp. The median price that a home sold for last year is more than $100,000 more in the Denver area. So in the interest of stretching your retirement savings further, Ogden may be the better choice. But do explore the Denver and Boulder suburbs as well. Realtor.com notes that the median price that homes sold for in the Denver area last year range widely, from $335,000 in Adams County (northeast of Denver) to $500,00 in Douglas County (south of Denver). You can see what's on the market now in Ogden on Realtor.com Here's Denver for comparison. You'll get your warm weather - average July highs in Ogden are 91 degrees. That's similar to Denver weather, though with less rain. Ogden winters, however, are colder. A mountain view from outside Santa Fe. Courtesy Tourism Santa Fe Santa Fe, New Mexico The capital of New Mexico has retirees galore - a quarter of the county's 150,000 residents are 65 or older - and the ski slopes of Taos are just 90 minutes up the road. Livability calls it one of the best places for those who've experienced a personal transformation - and retirement is, among other things, just that. You will find several brewpubs with live music, free music on the plaza downtown several nights a week in July and August (when there's no pandemic, of course). When you want to play outside, head north and you'll be in forests; head south and it's a sparser, more desert-like environment. You'd also have the opportunity to visit some pueblo villages on their feast days; outsiders otherwise are generally not welcome. Liberal? Absolutely. The county went heavily for Hillary Clinton in 2016. At 7,000 feet in elevation, Santa Fe does get some snow in the winter, but you rarely have to shovel. Average winter highs are in the 40s. As for summer, July's highs average 85 degrees. Housing here is expensive by Southwest standards; Realtor.com says the median price of homes sold last year was $323,000, or more than the $298,000 average in Ogden. You can see here what's on the market right now. Retirees tend to live in established neighborhoods, rather than over-55 communities, though there are several of those. Santa Fe also doesn't get an influx of snowbirds that, for example, the Phoenix area does, so your new friends are likely to be around all year. And there are plenty of newcomers: In 2018, 35% of those who moved to a new residence in Santa Fe came from out of state, according to Census Bureau data. The median age of Santa Fe residents who were born out of state is 56.3 years old, compared to 31.7 years old among city residents born in New Mexico. When Santa Fe feels too small, Albuquerque is an hour away (reachable by train for when you don't want to drive). We've written about it here and here. It's also a short flight from Albuquerque to Denver if you want to ski the Rockies, with shuttle service to the airport from the train station in Albuquerque. Joseph Sohm/Shutterstock Nashville, Tennesee But maybe music, not skiing, is the bigger priority. And you'd like it a touch warmer in winter. For countless music options every night, what about the Music City? You can find just about any kind in Nashville, not just country. In fact, the Music City moniker didn't originate with country - it goes back to Fisk University's Jubilee Singers, which introduced much of the world to Negro spirituals. The National Museum of African-American Music will have its virtual opening this fall. Breweries, too, would be plentiful - close to three dozen at last count, according to the Brewers Association. I realize this could be a bit of a stretch; after all, the skiing nearby won't be what you get out west, so spontaneously catching fresh powder won't happen. But I wanted to include an option outside the mountain states, and Nashville would be warmer than either Ogden or Santa Fe, especially in the winter. U.S. News & World Report ranks Nashville and its nearly 700,000 residents 8th among its list of best places to retire (and four of the seven ahead of it are in Florida). Surprised? The presence of Vanderbilt University, three historically black colleges and universities plus and 16 other colleges keeps it younger and more accepting. You'd also have the buzz of a bigger city and can choose from distinct neighborhoods. Downtown is changing fast - an estimated 13,000 people live there now, compared to less than 5,000 a decade ago, and you can still avoid the bachelor and bachelorette parties. Nashville has plenty of parks and, yes, lakes. Beaches, whether on the Atlantic or Gulf coasts, are within seven hours. You can get your ski fix within four hours in the mountains east of Knoxville. Or you fly out west. But you won't deal with much snow outside your door; average highs in January are in the upper 40s, much warmer than Ogden. Overall, the cost of living is below the U.S. average, unlike Santa Fe. A big plus for Tennessee is taxes - no state income taxes, and the phase-out of its tax on investment income (known as the Hall Tax) will be completed on Jan. 1. The tradeoff is a higher sales tax. Of course, tax rates could change by the time you are ready to retire. So could the state's political leanings. While Tennessee is a Republican state, Davidson County, which includes Nashville, is one of the three counties in the state that voted for Clinton in 2016. But if you want to test out your new community while still working, booming Nashville is the place. It has the jobs and the corporate headquarters that you won't find in Sante Fe or Ogden. Amazon picked Nashville for its Operations Center of Excellence, and Facebook is building a data center in Gallatin, northeast of Nashville. Be warned that traffic from the suburbs can be awful, so consider some walkable neighborhoods within Nashville. One is the more urban East Nashville, the center of the city's food scene, home to many locally owned businesses and a population that mixes young with old-timers. Southern Living summed it up as \"If Brooklyn moved to Tennessee.\" Another is 12 South, considered a better fit for those who loved suburban life and, according to Southern Living, one of the South's best neighborhoods. You'll find more boutiques and specialty stores there. Here's what's for sale across Nashville right now. If Nashville is close but not quite it, the Raleigh-Durham area or the area around Asheville, N.C., might appeal. Readers, what's your advice for Sean?"}]}