{"article": [{"url": "https://www.marketwatch.com/story/trump-will-be-trumpeting-his-accomplishments-on-thursday-as-he-accepts-republican-nomination-2020-08-26", "published": 1598540120.0, "headline": "Trump to attack Biden tonight as a 'weak candidate with a poor record' while accepting Republican nomination", "body": "President Donald Trump looks set to blast Democratic nominee Joe Biden as he accepts the Republican Party's nomination on Thursday night and aims to sell voters on backing him in November. He also is expected to talk up his achievements since his inauguration and pledge other accomplishments if he's re-elected, as well as highlight a $750 million deal with Abbott Laboratories ABT, +1.02%  for the company's new rapid-response COVID-19 antigen tests. Trump's speech is slated to serve as the grand finale for the four-day, mostly virtual Republican Nation Convention, and it's due to be delivered from the White House grounds. His address on Thursday night will follow testimonials earlier in the week from a range of speakers, including Donald Trump Jr. and Nikki Haley on Monday, first lady Melania Trump and Secretary of State Mike Pompeo on Tuesday, and Vice President Mike Pence on Wednesday. \"Tonight the president will deliver a tough speech, because Americans have tough choices in front of them,\" the Trump re-election campaign's communications director, Tim Murtaugh, told reporters during a conference call Thursday. Murtaugh said Trump will draw a contrast between his \"exemplary\" record and Biden's \"47-year record of failure as an elected official in Washington, D.C.\" The Republican incumbent's spokesman said Trump will accuse Biden of running \"as an empty shell of a candidate - a Trojan horse of a candidate - that is being filled with the agenda of the radical leftists who are now in charge of the Democrat Party.\" Pence on Wednesday also described Biden as a Trojan horse. In addition, the president will \"describe Joe Biden as a weak candidate with a poor record,\" as well as \"lay out his vision and things he wants to accomplish in a second term,\" Murtaugh said. \"The president will place a strong emphasis on jobs and economic recovery and economic excellence vs. Joe Biden's record as one who has raised taxes, will raise taxes and has been a champion of outsourcing our jobs to other countries,\" the Trump spokesman added. He will cast the former vice president as having a \"radical left-wing agenda on a variety of topics,\" such as \"our nation's borders, taxes, energy policy, trade, China, of course, and areas involving crime.\" \"The president will also compare his record of mounting an unprecedented effort to combat the coronavirus vs. Joe Biden's basement strategy of sitting on the sidelines and offering nothing but useless criticisms,\" Murtaugh said. \"The president will talk about the hurricane, and the preparations that have been made and ask for God's blessing for the people who are in its path. And he will also talk about the unrest that we have seen in American cities, including Kenosha, Minneapolis, Portland, Seattle, Chicago and other cities.\" See:Hurricane Laura downgraded to category 3 as it moves across Louisiana And read:How the 2020 hurricane season could end up rivaling the worst on record Meanwhile, the Biden campaign's deputy campaign manager and communications director, Kate Bedingfield, said in a statement early Thursday that Trump has \"called himself a wartime president, but instead of rallying the country in the fight against the single greatest challenge facing our nation, he and Mike Pence are waving the white flag of defeat, betting everything on the pandemic simply 'disappearing' - all while trying to tear our nation apart.\" \"The American people cannot afford to wait any longer for this administration to finally take this threat seriously,\" she added. The Biden campaign also has said the GOP convention's speakers have been revealing an \"inability to make any affirmative case for Trump's re-election after he's made the United States the hardest-hit country by the pandemic in the entire world, and made divisive poison his calling card.\" In Biden's speech last week at the Democratic convention, the former vice president cast himself as \"an ally of the light, not the darkness,\" as he pledged to rebuild the battered U.S. economy and tackle the coronavirus pandemic. The longest economic expansion in American history ended earlier this year as nationwide lockdowns to contain the coronavirus pandemic hammered businesses and workers. The biggest unknown about the U.S. economy right now could be just how much the recent loss of federal aid will stunt a recovery that already has lost steam. Among the other speakers due to make remarks at the GOP event on Thursday night are Sen. Majority Leader Mitch McConnell, Rudy Giuliani, Sen. Tom Cotton of Arkansas, House Minority Leader Kevin McCarthy, Housing Secretary Ben Carson and Ivanka Trump, who is slated to introduce her dad before his speech. Trump already has spoken at the Republican National Convention, having been featured in videos and having made an in-person appearance on Monday during roll-call voting in Charlotte, N.C. In his remarks Monday, the president criticized Biden for not traveling to last week's Democratic convention due to ongoing public-health concerns, and Trump continued his long-running attacks against mail-in ballots. The accomplishments that he might talk up on Thursday include the 2017 tax cuts, a new trade deal with Canada and Mexico, and a 2018 criminal-justice reform law. Related:Trump suddenly supports mail-in voting - for the key swing state of Florida And see:Trump's convention breaks norms - and possibly the Hatch Act In RealClearPolitics averages of polls as of Thursday, Biden is leading Trump by 7.1 percentage points in nationwide surveys and by 3.7 points in key swing states that are likely to decide the November election. Opinion:Trump, running for re-election, is faking it on the economy and the pandemic Counterpoint:Don't count Trump out - here's how he can still win in November The main U.S. stock gauges DJIA, +0.56%  were recently trading higher Thursday, after the S&P 500 SPX, +0.87% and Nasdaq Composite COMP, +1.39% closed Wednesday at fresh all-time peaks. This is an update version of a report first published on Aug. 26, 2020."}]}