{"article": [{"url": "https://www.marketwatch.com/story/no-one-will-be-left-without-hope-uk-unveils-30-billion-jobs-plan-to-prevent-mass-unemployment-2020-07-08", "published": 1594210400.0, "headline": "The U.K. unveils Â£30 billion jobs plan to prevent mass unemployment", "body": "The U.K. government has set out a Â£30 billion plan to protect jobs and prevent mass unemployment as a result of the coronavirus pandemic. Chancellor of the Exchequer Rishi Sunak unveiled a package of measures in his summer statement on Wednesday, which includes a Â£2 billion youth employment program aimed at 16 to 24-year-olds and incentives for businesses to bring back furloughed staff. â\u0080\u009cPeople need to know that although hardship lies ahead, no one will be left without hope. Our plan has a clear goal: to protect, support and create jobs,â\u0080\u009d Sunak told British lawmakers. However, he said the countryâ\u0080\u0099s public finances needed to be put back on a â\u0080\u009csustainable footingâ\u0080\u009d in the medium term, with a budget and spending review in the autumn. AJ Bell analyst Tom Selby said a â\u0080\u009ctax-grab seems almost inevitable.â\u0080\u009d Sunakâ\u0080\u0099s announcement also boosted the struggling hospitality sector, through a value-added tax cut and 50% meal discounts for every person in the U.K. to eat at restaurants during August. In a bid to reinvigorate the housing market, stamp duty â\u0080\u0094 a property tax on buyers â\u0080\u0094 has been cut until March 2021. The first Â£500,000 of all property sales will be exempt from the tax, raising the threshold from Â£125,000. House prices in the U.K. fell for a fourth consecutive month in June, the Halifax House Index found this week, while a Nationwide report said prices fell annually for the first time since 2012. The tax freeze may grab the headlines and is expected to drive house prices higher, but the bulk of the Chancellorâ\u0080\u0099s announcement was about tackling unemployment. Job retention bonus The U.K.â\u0080\u0099s job retention scheme, which sees the government pay up to 80% of wages of staff forced into temporary leave, will come to an end in October. Sunak said leaving the program open would give people â\u0080\u009cfalse hopeâ\u0080\u009d of having a job to return to. Instead he unveiled a â\u0080\u0098job retention bonusâ\u0080\u0099 in a bid to encourage businesses to bring those employees back to work. The government will give businesses Â£1,000 for every furloughed employee still in the job by the end of January. The policy could cost up to Â£9 billion if all the nine million people relying on the program return to work, the Chancellor said in Parliament. ING Economics developed markets economist James Smith said. â\u0080\u009cClearly if you are a business that has either had capacity significantly reduced by the new safety measures, or have seen demand collapse due to changing consumer habits, itâ\u0080\u0099s unlikely to save jobs when the furlough scheme is unwound.â\u0080\u009d He added: â\u0080\u009cBut nevertheless this scheme should at face value help cushion some of the blow for firms more widely.â\u0080\u009d Youth employment A Â£2 billion â\u0080\u009ckick-start schemeâ\u0080\u009d has been announced to create more jobs for young people. Younger workers have been particularly impacted by the coronavirus pandemic as many work in hard-hit industries, such as hospitality. The program will see the government fund six-month work placements for people aged 16-24 at risk of long-term unemployment. The funding will cover 100% of the national minimum wage for 25 hours a week, which employers will be able to top up. Businesses will also be given Â£2,000 for every apprentice they hire under the age of 25. Dame Carolyn Fairbairn, director-general of business group the Confederation of British Industry, said the plan was a â\u0080\u009cmuch-needed down payment in young peopleâ\u0080\u0099s futures.â\u0080\u009d â\u0080\u009cBusiness and Government must now work to deliver the scheme simply and at speed. There can be no time lost in preparing young people who are entering one of the toughest jobs markets weâ\u0080\u0099ve seen in decades,â\u0080\u009d she added."}]}