{"article": [{"url": "https://www.marketwatch.com/story/ipo-market-springs-back-to-life-after-two-months-in-a-deep-freeze-2020-06-29", "published": 1593419540.0, "headline": "Global IPO market springs back to life after two months in a deep freeze", "body": "The global market for initial public offerings is starting to thaw after being placed in a deep freeze during April and May, when companies put plans for new listings on ice at the height of the coronavirus pandemic. IPO activity declined across all regions during the second quarter, as equity markets tanked on fears of a global recession. But in recent days a string of companies have made their stock market debuts or filed their intention to list in the coming months. Globally, there were only 97 listings — down 48% year-over-year — and a 67% decrease in proceeds to $13.2 billion compared with April and May 2019, according to data from EY’s quarterly Global IPO Trends report. This brought down overall IPO activity for the first half of the year, with volumes and proceeds falling by 19% and 8%, respectively, compared with the same period a year earlier. Read:Coronavirus-driven selling chills IPO market as just one company braves market this week Paul Go, EY Global IPO Leader, said that although IPO activity declined in April and May 2020 because of lockdowns in most markets that closed the economy, there has been a strong rebound in June. “Well-prepared companies, in the right sectors and business models that can successfully adjust during the pandemic, will find the right window of opportunity amid turbulent capital market for the rest of 2020,” Go said. The few bright spots were in the technology, industrials and health care sectors. There were 85 technology company listings, which raised $16.9 billion. Industrials saw 83 IPOs raise $9.6bn and health care had seven IPOs that raised $15bn, according to EY. U.S. exchanges still accounted for the majority of IPOs in the Americas in the first half of 2020, accounting for 79% of total deal volume with 64 deals, and 91% of proceeds with $22.3bn raised as a string of companies braved the equity markets. Also:U.S. IPO market to reopen with a bang as the biggest deal of the year takes off On June 26, Lemonade, LMND, +12.82% the insurance startup backed by SoftBank Group SFT, -2.28% announced that it was looking to raise up to $286 million in its U.S. IPO with a price range of $23 to $26. Earlier in June, Vroom VRM, -0.26% raised $467.5 million in its IPO, with the online used-car seller seeing its shares more than double in value on its debut. “With stock prices rebounding and market sentiment improving, we are seeing signs of recovery in the IPO market. Nearly a third of the IPOs in the first half of 2020 occurred in June. IPO pipeline continues to build as issuers look to go public in the second half of 2020 or early 2021,” said Jackie Kelley, EY Americas IPO Leader. Not all IPOs are going as planned. The same day Lemonade listed, Albertsons Companies ACI, +1.71% priced its offering below expectations at $16 a share, according to The Wall Street Journal, in a sign of weak investor demand. The U.S. supermarket operator raised $800 million through the sale of 50 million shares as its private equity owner Cerberus Capital Management moved to cash out of its investment. Newly listed companies gained 20% on average in their first day of trading in 2020, the biggest annual rise on their first day of trading since the height of the tech boom in 2000, when the average for U.S.-listed IPOs was 70%, according to data from Dealogic cited by the WSJ. In Europe, after a strong start to the year, IPO volumes and proceeds declined 47% and 48% respectively, as the pandemic significantly curtailed activity from March through to May. However, the continent is also starting to show signs of life. Coffee group JDE Peet’s, which owns the Peet’s coffee brand in the U.S., raised €2.25 billion ($2.5 billion) in its Amsterdam listing on May 29, in Europe’s largest IPO since 2018. Read:Peet’s Coffee Parent Goes Public Just as More People Caffeinate From Home The second largest IPO this year took place in Milan, after the Italian filter maker GVS GVS, -0.32% raised €497 million on June 19, sending its shares up by almost 20% on its first day of trading. After an initial hiatus of physical roadshows that were hampered by social-distancing, bankers have adjusted to a new way of working. JDE Peet’s virtual roadshow took just 3 days to complete, compared with the average two-week period. “During the COVID-19 pandemic, we’ve seen a new remote IPO environment, with virtual investor meetings, real-time feedback and shortened roadshow periods to limit the short-term market risks,” Martin Steinbach, EY Europe, Middle East, India & Africa IPO Leader, said. “With volatility levels trending down and rebounds in main indexes, markets are adaptable, resilient and supportive for IPO activity to pick up in the second half of 2020, especially in technology, and pharmaceuticals and life science sectors,” he added."}]}