{"article": [{"url": "https://www.marketwatch.com/story/president-trump-takes-quick-spin-outside-hospital-to-greet-supporters-following-twitter-teaser-2020-10-04", "published": 1601834840.0, "headline": "President Trump takes quick spin outside hospital to greet supporters following Twitter teaser", "body": "Minutes after teasing the action in a Twitter video, President Trump Sunday evening left Walter Reed Medical Center for a quick motorcade spin outside to greet supporters who have been rallying there as he battles COVID-19. Trump departed the hospital in an armored SUV and remained in the vehicle as he drove past a flag-waving and cheering crowd outside Walter Reed National Military Medical Center. The one-minute video from the president had more than 1.5 million views within minutes. The president was back in his suite at the medical center shortly after the tour. “Getting great reports from the doctors. This is a great hospital here, Walter Reed. The work they do is just absolutely amazing and I want to thank them all, the nurses, the doctors, everybody here. I’ve also gotten to meet some of the soldiers and the first responders and what a group.” Trump said in the video. “I also think we are going to pay a little surprise to some of the great patriots that we have out on the streets and they’ve been out there for a long time and they’ve got Trump flags. They love our country, so I’m not telling anybody but you but I’m about to make a little surprise visit. So perhaps I’ll get there before you get to see me, but I just when I look at the enthusiasm, and we have enthusiasm that like probably nobody has ever had. People that love the job we’re doing, we have more enthusiasm than maybe anybody.” “So it’s been an interesting journey. I learned a lot about COVID. I learned it by really going to school. This is a real school. This isn’t a ‘let’s read the book’ school. And I get it and I understand it. And it’s a very interesting thing. I’m going to be letting you know about it. But in the meantime we love the U.S.A. and we love what’s happening. Thank you.” Trump departed the hospital in an armored SUV and remained in the vehicle as he drove past a flag-waving and cheering crowd outside Walter Reed National Military Medical Center. Trump did not alert the pool of reporters who are supposed to travel with him before leaving the hospital."}]}