{"article": [{"url": "https://www.marketwatch.com/story/the-case-for-trump-11601851731", "published": 1601983580.0, "headline": "The case for giving Trump four more years in the White House", "body": "MarketWatch photo illustration/Getty Images, iStockphoto The president’s primary responsibilities are to protect national security and enable inclusive prosperity. President Donald Trump’s record and former Vice President Joe Biden’s facile vision make the incumbent the better choice. China is poised to have the largest economy and most powerful navy in the world in the 2030s. It’s bent on stifling criticism of its repressive practices, continuing protectionism harmful to the West, and offering its brand of authoritarian capitalism as a model to others. Democrats and European leaders recognize the threats posed by China’s mercantilism and technology theft. Biden would relent more to European sensibilities and rely more on the World Trade Organization than Trump to address China. Whereas the Europeans, save the U.K., seem little interested in confronting Chinese power, Japan, Australia, India and South Korea have active policies to disengage supply chains from China and increase defense spending. Other Asian states, like the Philippines and Vietnam, won’t be able to play both sides. The world is devolving into competing spheres with growth driven by high-tech behemoths. China offers other nations the means to control domestic populations—facial recognition and individual tracking technologies undergirding its Social Credit System and repression of Muslims in Xinjian—and Trojan horses like Huawei’s 5G and TikTok. America offers an open technology system where entrepreneurs can build wealth and create jobs. Businesses are prospering on Amazon’s AMZN, +3.01% and Microsoft’s MSFT, +2.48% clouds, and manufacturers and traditional service enterprises are finding better ways to compete with robotics and artificial intelligence. China’s growing military power makes America’s defense commitment to Taiwan increasingly precarious. Unless we shift resources from the Middle East and Europe to the Pacific, spend more on defense and establish a forward deployment base—finally replace Subic Bay—our friends in the region will see the futility in relying on America. Trump has engineered detente between Israel and Arab Gulf states. With the tentative approval of Saudi Arabia, the U.A.E and Bahrain have established diplomatic relations with the Jewish state and a Semitic alliance appears forming to confront Iran. He has engineered newly initiated peace talks between the Taliban and government in Afghanistan. After decades of frustrated diplomacy, Trump is getting the Europeans to recognize they must take more responsibility for regional defense. These should permit the U.S. military’s shift toward Asia, whereas Biden would falsely seek to resurrect the old regime in NATO and overburden our forces with responsibilities both on the continent and in the Middle East. He has said little about shoring up America’s navy and other military assets. He heads a party with an influential left wing that advocates isolationist trade policies and less military spending—the Obama/Biden administration cut the Pentagon’s budget. For American high tech to thrive and create opportunities for better jobs, it requires broad global markets. Access in Asia and elsewhere requires our allies feel secure and not throw their lot with China. Biden’s has said too little about these issues, and America can’t afford to vote for an unknown quantity. Domestically, he advocates a European-style industrial policy—forcing the great transformation from a fossil fuel to a renewable-energy-based economy quicker than the science permits by forcing America into electric vehicles and other green technologies sooner than those are economically viable. The Obama/Biden experience with high-speed rail illustrate where that can lead but this time on a grander scale. Enabling violent radical groups to hijack peaceful demonstrations by handicapping police and promoting progressive policies with histories of failure would worsen conditions and harden inequality. The Obama-Biden administration aggressively promoted systemic changes in policing in cities like Chicago, but those often hosted this summer’s violence and destruction of property. Civil disorder hardly opens doors to jobs creating investments in minority communities. The Obama-Biden recovery did too little to improve the relative economic status of Blacks and Hispanics. Whereas poverty declined and the incomes of those groups relative to whites improved more during the Trump expansion until interrupted by the pandemic. Growth—not raising taxes, more spending on social programs and intervention into private employment decisions—is the best prescription for raising wages and reducing inequality. Personal style aside, Trump sees our choices as they are. Biden’s return to normalcy would take America back to policies that experience shows don’t work. Peter Morici is an economist and emeritus business professor at the University of Maryland, and a national columnist.More on the election: Three in four Americans are worried about foreign interference in the presidential election Why Biden is better for the economy than Trump Ballot drop boxes are safe, secure and have been used by Republicans and Democrats for decades—so why is Trump bashing them?"}]}