{"article": [{"url": "https://www.marketwatch.com/story/manhattan-prosecutor-cites-extensive-and-protracted-criminal-conduct-at-the-trump-organization-in-defending-records-demand-2020-08-03", "published": 1596480620.0, "headline": "Manhattan prosecutor cites â\u0080\u0098extensive and protracted criminal conduct at the Trump Organizationâ\u0080\u0099 in defending records demand", "body": "NEW YORK â\u0080\u0094 A New York City prosecutor fighting to get President Donald Trumpâ\u0080\u0099s tax returns told a judge Monday he was justified in demanding them because of public reports of â\u0080\u009cextensive and protracted criminal conduct at the Trump Organization.â\u0080\u009d Manhattan District Attorney District Attorney Cyrus R. Vance, Jr. is seeking eight years of the Republican presidentâ\u0080\u0099s personal and corporate tax records, but has disclosed little about what prompted him to request the records, other than part of the investigation related to payoffs to two women to keep them quiet about alleged affairs with Trump. In a court filing Monday, attorneys for Vance, a Democrat, said the president wasnâ\u0080\u0099t entitled to know the exact nature of the grand jury probe, which they called a â\u0080\u009ccomplex financial investigation.â\u0080\u009d They noted, though, that at the time the subpoena for the tax filings was issued to Trumpâ\u0080\u0099s accountants, â\u0080\u009cthere were public allegations of possible criminal activityâ\u0080\u009d at the presidentâ\u0080\u0099s company â\u0080\u009cdating back over a decade.â\u0080\u009d They cited several newspaper articles, including one in which the Washington Post examined allegations that Trump had a practice of sending financial statements to potential business partners and banks that inflated the worth of his projects by claiming they were bigger or more potentially lucrative than they actually were. Another article described congressional testimony by Trumpâ\u0080\u0099s former lawyer, Michael Cohen, who said the president would overstate the value of his business interests to impress people or lenders, but then deflate the value of assets when trying to reduce his taxes. The attorneys also cited reports of past non-criminal investigations by New York regulators into whether the conduct described by Cohen amounted to bank or insurance fraud. â\u0080\u009cThese reports describe transactions involving individual and corporate actors based in New York County, but whose conduct at times extended beyond New Yorkâ\u0080\u0099s borders. This possible criminal activity occurred within the applicable statutes of limitations, particularly if the transactions involved a continuing pattern of conduct,â\u0080\u009d the lawyers said. Trumpâ\u0080\u0099s legal team has argued that the subpoena for his tax filings was issued in bad faith and amounted to harassment of the president. Speaking to reporters later Monday, Trump called the district attorneyâ\u0080\u0099s investigation another attempt by Democrats to damage him. â\u0080\u009cThis is just a continuation of the witch hunt. Itâ\u0080\u0099s Democrat stuff. They failed with Mueller. They failed with everything. They failed with Congress. They failed at every stage of the game. This has been going on for three and a half, four years,â\u0080\u009d Trump said, referring to special counsel Robert Muellerâ\u0080\u0099s investigation of alleged Russian interference in the 2016 election. The Supreme Court last month rejected claims by Trumpâ\u0080\u0099s lawyers that the president could not be criminally investigated while he was in office. Vanceâ\u0080\u0099s lawyers urged U.S. District Judge Victor Marrero to swiftly reject Trumpâ\u0080\u0099s further arguments that the subpoenas were improper, saying the baseless claims were threatening the investigation. â\u0080\u009cEvery day that goes by is another day Plaintiff effectively achieves the â\u0080\u0098temporary absolute immunityâ\u0080\u0099 that was rejected by this Court, the Court of Appeals, and the Supreme Court,â\u0080\u009d Vanceâ\u0080\u0099s lawyers said. Marrero has scheduled arguments to be fully submitted by mid-August. Vance sought the tax records in part for a probe of how Cohen arranged during the 2016 presidential race to keep the porn actress Stormy Daniels and model Karen McDougal from airing claims of extramarital affairs with Trump. Trump has denied the affairs. Cohen is serving the last two years of a three-year prison sentence in home confinement after pleading guilty to campaign finance violations, lying to Congress and tax crimes. He said he plans to publish a book critical of the president before the November election. If the court orders Trumpâ\u0080\u0099s accounting firm to give his tax returns to the grand jury, they could be used in any criminal inquiry, but would not be released publicly. Grand jury documents are secret in New York."}]}