{"article": [{"url": "https://www.marketwatch.com/story/suze-orman-urges-investors-to-stay-away-from-traditional-401ks-2020-06-17", "published": 1592840660.0, "headline": "Suze Orman: â\u0080\u0098You have to be crazyâ\u0080\u0099 to put your money in this investment", "body": "“ â\u0080\u0098Please, if you have the ability to do a Roth 401K, 403B, or a TSP, or a Roth IRA, those are the type of retirement accounts that you want to be in. Stay away from the traditional ones.â\u0080\u0099 ” Thatâ\u0080\u0099s personal-finance celebrity Suze Orman offering some advice on the â\u0080\u009cPivotâ\u0080\u009d podcast this week about what investors should be doing during the coronavirus pandemic. With traditional IRAs or 401(k)s, savers get the tax break immediately upon the contribution, allowing their investments to grow tax-free, and then have to pay the taxes upon withdrawal. But there are better ways to save for retirement, considering the current climate, Orman explained. â\u0080\u009cWith a Roth, you pay taxes today, and in the long run, when you take it out, itâ\u0080\u0099s tax-free,â\u0080\u009d she said. â\u0080\u009cWhy? Do you really think that tax brackets arenâ\u0080\u0099t going to have to go up five, 10, 15 years from now in order to pay for all the debt that weâ\u0080\u0099re carrying? Of course theyâ\u0080\u0099re going to have to.â\u0080\u009d Bottom line: Take advantage of â\u0080\u009cthe lowest tax bracketsâ\u0080\u009d weâ\u0080\u0099re likely to see for a long time. As for where to put the cash, Orman said she sees a sideways stock market for a while, with investors essentially forced to partake, in light of the alternatives. â\u0080\u009cAre they going to put it in a 10-year Treasury at 0.76%? The possibility of negative interest rates?â\u0080\u009d she said. â\u0080\u009cYou have to be crazy, if you ask me, to be in bonds at this point in time.â\u0080\u009d For most people, her suggestion is just to stick with the Vanguard Total Stock Market ETF VTI, +0.84% Â . Donâ\u0080\u0099t even consider individual stocks, she said, unless youâ\u0080\u0099re super rich. The broad market has been holding up nicely this week, though the Dow Jones Industrial Average DJIA, +0.56% was down slightly Wednesday, giving back gains from earlier in the session."}]}