{"article": [{"url": "https://www.marketwatch.com/story/google-could-face-antitrust-charges-from-justice-department-this-month-2020-09-03", "published": 1599227540.0, "headline": "Google could face antitrust charges from Justice Department this month", "body": "An antitrust case against Google is coming as soon as this month. Justice Department officials have pressured attorneys working on the case to wrap things up quickly so that an action can be brought against Alphabet Inc. GOOGL, +1.82% GOOG, +1.97% , the parent company of Google and YouTube, multiple sources told the New York Times on Thursday. MarketWatch was able to independently confirm the timing of the antitrust action. A Justice Department spokeswoman declined to comment on the Times report. A company spokesman said Google would “continue to engage with ongoing investigations” and that its business practices enabled “increased choice and competition.” Google shares were flat in after-hours trading on Thursday. The reasoning behind a rush to action underscores a belief among some antitrust experts that the Trump administration is seeking punitive measures against Big Tech for its influence over consumers and multiple markets to curry favor with voters. Anger toward the largest tech companies has resonated across political parties, from liberals to conservatives. But some questioned the swift timetable, which could ultimately wreak havoc on a stock market driven by tech companies. On Thursday, tech shares were battered badly in a massive selloff. “I’m a little puzzled by the strategy here. Rush out a half-baked case to protect Google? Rush out any case to appease public sentiment?” antitrust lawyer Paul Swanson told MarketWatch. Google has been the most likely of the four tech companies under federal investigation — the others are Apple Inc. AAPL, +1.74% , Facebook Inc. FB, +0.26% , and Amazon.com Inc. AMZN, +3.01% — to face punitive action, according to at least two recent reports. The Justice Department and a group of state attorneys general may file antitrust lawsuits focusing broadly on how Google leverages its dominant search business to stifle competition, according to a Wall Street Journal report. At the same time, the Justice Department and state attorneys general are investigating the pricing and operations of Google’s Network division, a business that sells services that handle almost every step a digital ad takes, said a Bloomberg report. Should the government act, it could have far-reaching implications for search and location marketers, says Greg Sterling, vice president of insights at software company Uberall. “One of the potential remedies in any antitrust case would be to break Google up into separate companies: Google (Search Ads), Maps, YouTube, Android and Chrome potentially,” Sterling said in a statement. “Separating Google Maps (and potentially Waze) from Google would have a potentially significant impact on local search. “That could create new openings for other mapping and local search competitors. Google might also be motivated to create a new mapping property that would directly compete with Maps.” Of course, the political calculus of such moves during a presidential election year brings deep economic implications, Anurag Chandra, a partner at venture-capital firm Fort Ross Ventures, told MarketWatch. “I’m growing skeptical that we will see anything definitive regarding an anitrust action before the election,” he said. “The administration, despite its feelings about monopolization, needs a strong economy. A concrete action against Big Tech could drive down their stock and blunt market momentum that has been aided by tech companies.”"}]}