{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-kick-off-september-with-gains-buoyed-by-falling-dollar-2020-09-01", "published": 1598973800.0, "headline": "U.S. oil prices log first gain in 4 sessions as upbeat economic data boost demand prospects", "body": "Oil futures notched modest gains on Tuesday, with U.S. prices up for the first time in four sessions, finding support as some economic data show signs of recovery, boosting prospects for energy demand. Prices are “aided by broader economic sentiment,” said Robbie Fraser, senior commodity analyst at Schneider Electric, in a Tuesday note. “Relatively bullish Chinese manufacturing data has reinforced the view that East Asia continues to push closer to pre-COVID demand levels—a core component of any long-term oil price recovery. In the U.S. Tuesday, the Institute for Supply Management said its manufacturing index rose to 56% in August, up a fourth month in a row, from 54.2% in July. West Texas Intermediate crude for October delivery CL.1, -1.62% US:CLV20 on the New York Mercantile Exchange rose 15 cents, or nearly 0.4%, to settle at $42.76 a barrel, while November Brent crude UK:BRNX20 BRN.1, -0.07%, the global benchmark, settled 30 cents, or 0.7%, higher at $45.58 a barrel on ICE Futures Europe. Earlier weakness in the dollar had provided a lift to dollar-denominated oil prices, with the ICE U.S. Dollar Index DXY, -0.58%, a measure of the currency against a basket of six major rivals, touching 91.746, its lowest since 2018. The index, however, moved up in the wake of a better-than-expected U.S. manufacturing survey reading. Oil futures lost ground Monday but WTI logged its fourth straight monthly rise and Brent rose for a fifth straight month. In other energy trading Tuesday, October gasoline US:RBV20 rose 0.9% to $1.2247 a gallon, while October heating oil US:HOV20 added 1.1% at $1.2308 a gallon. October natural-gas futures US:NGV20 fell 3.9% to $2.527 per million British thermal units. Front-month futures prices ended August with a gain of 46%, the largest since September 2009, according to Dow Jones Market Data. Traders awaited weekly data on U.S. petroleum supplies due out late Tuesday from the American Petroleum Institute and early Wednesday from the Energy Information Administration. On average, analysts forecast a 1.2 million-barrel fall in crude inventories for the week ended Aug. 28, according to survey conducted by S&P Global Platts. They also expect to see a weekly drop of 4.7 million barrel in gasoline supplies and a decline of 900,000 barrel in distillate stocks. Meanwhile, energy production in the Gulf of Mexico region has seen significant recovery following Hurricane Laura last week. The Bureau of Safety and Environmental Enforcement on Tuesday estimated that about 28.4% of the current oil production in the Gulf of Mexico has been shut in, along with around 25% of natural-gas output. Around the time Laura reached the Gulf Coast early Thursday, around 84% of oil output was shut in. The West Hackberry Strategic Petroleum Reserve facility in Louisiana remains offline and has sustained “considerable damage” from the storm, S&P Global Platts reported Monday, citing an email from the U.S. Energy Department, which also said there is no danger of contamination or concern of oil spills. The storage site has an authorized storage capacity of 220.4 million barrels. Reuters on Tuesday reported that oil production by the Organization of the Petroleum Exporting Countries rose by 950,000 barrels per day to 24.27 million barrels per day in August, from July, following a three-decade output low in June. The move followed a decision by OPEC and its allies to taper collective output cuts to 7.7 million barrels per day starting May 1 from record cuts of 9.7 million barrels a day."}]}