{"article": [{"url": "https://www.marketwatch.com/story/democratic-lawmakers-signal-concern-about-coronavirus-vaccine-pricing-speed-of-development-2020-07-21", "published": 1595400320.0, "headline": "Democratic lawmakers signal concern about coronavirus vaccine pricing, speed of development", "body": "Lawmakers peppered pharmaceutical executives with questions about how COVID-19 vaccines will be manufactured, priced and distributed on Tuesday, the day after promising early-stage clinical data was released for two coronavirus vaccine candidates. The questions asked by members of a House Committee on Energy and Commerce subcommittee at a hearing on Capitol Hill point to growing concerns about the speed at which the experimental vaccines are moving through clinical trials and the millions of federal dollars that have already been awarded to some drugmakers. Executives from AstraZeneca AZN, +1.16% AZN, +0.63%, Johnson & Johnson JNJ, +1.39%, Merck & Co. Inc. MRK, -0.14%, Moderna Inc. MRNA, +0.09%, and Pfizer Inc. PFE, -0.27% testified. Some drugmakers have said they expect to have a working vaccine by the end of the year, and the Trump administration has also stated that a vaccine will be ready by January as part of Operation Warp Speed, which has reportedly received $10 billion in taxpayer money. Read: Investors cheer as two coronavirus vaccine candidates report T-cell responses, but findings are still early stage “It is possible that a COVID-19 vaccine may become available by the end of this year or early next year,” Rep. Diana DeGette, a Colorado Democrat, said during the hearing. “That’s a rare bit of good news in this harrowing time. But while some public health experts are bullish on the development of the vaccine. We must remind ourselves that plenty can still go wrong.” The race to develop a COVID-19 vaccine that can prevent infections with the coronavirus is moving faster than any vaccine development program of the past. Part of that urgency is driven by the economic need to safely reopen schools, events, and workplaces and to prevent more infections and deaths, which have disproportionately impacted Americans so far. The U.S. now has more than 3.8 million cases and at least 141,426 people have died in the roughly six months since the first coronavirus infection was detected here. At least five candidates have moved into clinical trials in the U.S., and vaccines are being developed by AstraZeneca and the University of Oxford, BioNTech BNTX, +1.23% and Pfizer, Inovio Pharmaceuticals Inc. INO, -1.36%, Moderna, and Novavax Inc. NVAX, +0.18%. Researchers on Monday shared early-stage preliminary data demonstrating antibody and T-cell responses for two of those experimental vaccines. Here are the key takeaways from Tuesday’s hearing: On the price of a vaccine: “Will you sell your vaccine at cost and provide on-track transparency so that we can verify you aren’t making a profit?” Rep. Jan Schakowsky, an Illinois Democrat, asked each executive. • Moderna “will not sell at a cost.” • “The agreement we have with [Biomedical Advanced Research and Development Authority] for the 300 million doses — we are selling that to the government at no profit,” AstraZeneca’s Dr. Mene Pangalos said. • “We will not be selling [a] vaccine at cost,” said Merck’s Dr. Julie Gerberding, a former director of the Centers for Disease Control and Prevention. (Merck is still in the preclinical phase for its two COVID-19 vaccine candidates.) • Johnson & Johnson JNJ, +1.39%, which is expected to start a Phase 1/2a clinical trial for its vaccine candidate this month, will provide a “vaccine at a not-for-profit price during the emergency pandemic.” • Pfizer has committed to pricing its vaccine to be “consistent with the emergency global health emergency that we’re facing,” with chief business officer John Young noting that “a vaccine is meaningless if people are unable to afford it.” On receiving federal funding: J&J and Moderna have each been awarded about $500 million, while AstraZeneca will receive up to $1.2 billion, according to Rep. Joe Kennedy, a Democrat from Massachusetts. Pfizer, on the other hand, hasn’t accepted federal dollars for its COVID-19 vaccine program. On whether speed is sacrificing safety or efficacy: No, says AstraZeneca’s Pangalos, in part due to “unprecedented” interactions with regulators and a round-the-clock workforce. In response to a question about the influence of the administration on the Food and Drug Administration’s regulatory process, he also noted that vaccines will face regulatory scrutiny in every country, saying that a vaccine’s safety and efficacy must also meet those standards, not just the ones set in the U.S. “A lot needs to be done in parallel, but it can be done safely and without compromising any of the standards that we usually undertake for any clinical trial,” said Dr. Macaya Douoguih, head of clinical development and medical affairs for J&J’s vaccines business. Moderna President Dr. Stephen Hoge said the company’s collaboration with the National Institutes of Health requires an independent data safety and monitoring board. On potential distribution challenges for a COVID-19 vaccine: Douoguih said that while the administration will ultimately decide distribution based on the funding agreement, J&J has developed a framework that puts high risk and high medical need individuals at the top of the distribution chain. Gerberding called for the National Academy of Medicine to ensure fair and equitable distribution of a vaccine."}]}