{"article": [{"url": "https://www.marketwatch.com/story/trump-dumps-campaign-manager-brad-parscale-for-gop-veteran-2020-07-15", "published": 1594852760.0, "headline": "Trump dumps campaign manager Brad Parscale for GOP veteran", "body": "WASHINGTON — President Donald Trump shook up his campaign staff Wednesday amid sinking poll numbers less than four months before the election, replacing campaign manager Brad Parscale with veteran GOP operative Bill Stepien. “I am pleased to announce that Bill Stepien has been promoted to the role of Trump Campaign Manager,” Trump said on Facebook. “Brad Parscale, who has been with me for a very long time and has led our tremendous digital and data strategies, will remain in that role, while being a Senior Advisor to the campaign.” Trump and Parscale’s relationship had been increasingly strained, with the president annoyed by the publicity Parscale had garnered in the role. But the final straw appeared to be a Tulsa, Oklahoma, rally last month that drew an unexpectedly low crowd of about 6,200 people after Parscale had bragged that more than a million people had requested tickets. The president was furious. The shakeup injected familiar turmoil to Trump’s 2020 campaign, which had so far largely avoided the regular staff churn that dominated the president’s 2016 campaign and his White House. It comes as Trump has been struggling in his reelection campaign against presumptive Democratic presidential nominee Joe Biden, with the nation facing health and economic crises during a pandemic that has killed more than 135,000 Americans. The staff change was not expected to alter the day-to-day running of the campaign. News of the shuffle was delivered to Parscale on Wednesday afternoon by White House adviser and Trump son-in-law Jared Kushner. Parscale, a political novice, ran Trump’s digital advertising in 2016 and was credited with helping bring about his surprise victory that year. Stepien has been in politics for years, working for former New Jersey Gov. Chris Christie and serving as Trump’s national field director in 2016. Parscale had been increasingly sidelined in the weeks since the Tulsa rally and as the president’s public and private poll numbers have taken a hit amid the pandemic. Speculation had been rampant about who might be promoted to lead the operation, with names like former Trump strategist Steve Bannon floated. Parscale is a close ally of Kushner, who wields ultimate control over the campaign. A Florida resident, he had not been a regular presence of late in the campaign’s Arlington, Virginia, headquarters, sparking some resentments among staffers. Rather than parting ways completely, Parscale was retained in part because of the difficulty the campaign would have faced in rebuilding its digital advertising operation so close to the Nov. 3 general election. While the Republican National Committee owned most of the campaign’s data, voter modeling and outreach tools, Parscale ran most of the microtargeted online advertising that Trump aides believed were key in 2016. Parscale’s digital advertising firm was among the campaign’s most significant vendors, and some in Trump’s orbit have alleged that the former campaign manager was profiting off the president’s reelection. Parscale has repeatedly denied the claims. Trump has been pressed by allies in recent months to expand his political circle and more forcefully define his run against Biden. Last month, Trump announced a promotion for Stepien and returned former communications chief Jason Miller to his campaign, taking away some of Parscale’s clout and influence. Biden also shuffled his campaign team, albeit much earlier in the cycle, amid a disastrous stretch in his primary run. For Biden, the moves marked genuine shakeups that expanded and changed how his campaign operated. Biden elevated Anita Dunn, effectively displacing his first campaign manager, Greg Schultz, after a fourth-place Iowa finish and as he was already headed for a second embarrassing finish in New Hampshire. Dunn had joined Biden at the outset of his campaign after having served President Barack Obama as a top communications adviser. With Dunn’s urging, Biden hired his current campaign manager, Jen O’Malley Dillon, in March after Dunn and others helped resurrect Biden in Nevada and South Carolina and put him on the path to the nomination. Schultz is now at the Democratic National Committee, helping lead the joint battleground strategy among the national party, the Biden campaign and state parties."}]}