{"article": [{"url": "https://www.marketwatch.com/story/people-search-less-for-jobs-after-they-exhaust-their-unemployment-benefits-chicago-fed-study-says-2020-06-24", "published": 1593079700.0, "headline": "People receiving unemployment benefits are MORE likely to look for jobs, Chicago Fed study finds", "body": "Unemployment benefits have been a touchy subject for lawmakers lately, as the supplemental $600 a week that unemployed Americans have been receiving as part of the $2.2 trillion CARES Act expires next month. Members of the Trump administration argue that the extra $600 creates a disincentive for the more than 20 million unemployed Americans to search for a new job — especially given that two-thirds of Americans who are out of work due to the pandemic are receiving more money in unemployment benefits than they got from their jobs. In turn, they hold that when unemployed Americans stop receiving that extra $600 next month — if lawmakers fail to enact new legislation — unemployed people will put more effort into finding a new job. Related: The extra $600 Americans get in weekly unemployment benefits ends next month — here’s what lawmakers are proposing to replace it But a recent study by the Chicago Federal Reserve found just the opposite to be true. “ People on unemployment benefits on average spend more than 14 hours a week job searching and send more than 12 applications a month. ” “Those currently collecting benefits search more than twice as intensely as those who have exhausted their benefits,” states a recent study conducted by the Chicago Fed. Typically, unemployment benefits last six months and on average pay individuals approximately 35% of their previous weekly salary, according to the Chicago Fed. By August 1, Americans who lost their jobs in early March and have been receiving state unemployment benefits will continue to receive them, but will get $600 less than they were previously getting. Don’t miss: White House ‘very seriously considering’ another stimulus bill — here’s how the CARES Act has impacted poverty rates “We are particularly interested in understanding the relationship between unemployment benefits and job search now, given the sharp increase in unemployment during the ongoing Covid-19 crisis and the high levels of additional [unemployment insurance] benefits available as part of the recent federal Coronavirus Aid, Relief, and Economic Security (CARES) Act,” the Chicago Fed researchers noted. People on unemployment benefits on average spend more than 14 hours a week job searching and send more than 12 applications a month. Unlike those who have exhausted their benefits, they are more likely to not settle for a job that pays less than what they were previously paid. People who have exhausted their benefits spend over 12 hours a week job searching on average and send out over 9 applications a month, the Chicago Fed study found. If an individual is unable to secure a new job within that six-month period, they become more pessimistic about job opportunities, and hence are more likely to accept a job that pays less than what they previously made, the Chicago Fed researchers concluded. Furthermore, the longer they remain unemployed, the less employable they appear in the eyes of employers, “leaving these individuals with fewer and lower-quality job offers,” the study stated."}]}