{"article": [{"url": "https://www.marketwatch.com/story/biden-warns-russia-other-countries-not-to-interfere-in-election-2020-07-20", "published": 1595340320.0, "headline": "Biden warns Russia and other countries that interference in 2020 election wonâ\u0080\u0099t go unpunished", "body": "WASHINGTON â\u0080\u0094 Presumptive Democratic presidential nominee Joe Biden said Monday that he is putting Russia and other foreign governments â\u0080\u009con noticeâ\u0080\u009d that he would act aggressively as president to counter any interference in U.S. elections. The statement came hours after Democratic leaders issued a new warning that Congress appears to be the target of a foreign interference campaign. Biden said in a statement that he would treat foreign interference as â\u0080\u009can adversarial act that significantly affects the relationship between the United States and the interfering nationâ\u0080\u0099s government.â\u0080\u009d He criticized President Donald Trump for not doing enough in response to U.S. intelligence agenciesâ\u0080\u0099 assessment that Russia interfered in the 2016 presidential election. â\u0080\u009cIf any foreign power recklessly chooses to interfere in our democracy, I will not hesitate to respond as president to impose substantial and lasting costs,â\u0080\u009d Biden said. The new alarms give a renewed urgency to concerns that foreign actors could be trying to influence the vote or sow disinformation. Biden said last week that he had begun receiving intelligence briefings and warned that Russia, China and other adversaries were attempting to undermine the presidential election. â\u0080\u009cWe know from before, and I guarantee you I know now because now I get briefings again. The Russians are still engaged, trying to de-legitimize our electoral process. Fact,â\u0080\u009d Biden said Friday, not revealing details or evidence. â\u0080\u009cChina and others are engaged as well in activities designed for us to lose confidence in the outcome.â\u0080\u009d During an online fundraiser Monday night, Biden added: â\u0080\u009cItâ\u0080\u0099s going to be tough, thereâ\u0080\u0099s not much I can do about it now except talk about it, and expose it, but it is a serious concern. It is truly a violation of our sovereignty.â\u0080\u009d And in an interview on MSNBC, Biden said Russian President Vladimir Putin â\u0080\u009cknows I mean what I say.â\u0080\u009d The Democratic leaders said in a letter to FBI Director Christopher Wray on Monday that they are concerned that Congress appears to be the target of a â\u0080\u009cconcerted foreign interference campaignâ\u0080\u009d to influence the 2020 presidential election. They asked Wray for an all-members, classified briefing on the matter of election interference before the August recess. The letter from House Speaker Nancy Pelosi, Senate Democratic Leader Chuck Schumer and the top Democrats on the House and Senate intelligence committees contains no details about the threats, though they describe them as serious and specific. â\u0080\u009cWe are gravely concerned, in particular, that Congress appears to be the target of a concerted foreign interference campaign, which seeks to launder and amplify disinformation in order to influence congressional activity, public debate, and the presidential election in November,â\u0080\u009d wrote Pelosi, Schumer, House Intelligence Committee Chairman Adam Schiff, D-Calif., and Virginia Sen. Mark Warner, the top Democrat on the Senate Intelligence panel. A congressional official familiar with the letter said that there was a classified addendum â\u0080\u009cto ensure a clear and unambiguous record of the counterintelligence threats of concern.â\u0080\u009d The person, who was granted anonymity to describe the confidential letter, said the addendum largely draws from the executive branchâ\u0080\u0099s own reporting and analysis. The FBI said it had received the letter but declined to provide further comment. While the Democratsâ\u0080\u0099 exact concerns were unclear, there have been worries since Trump was elected that Russiaâ\u0080\u0099s efforts to sow American chaos are ongoing in the 2020 election. The 2016 effort included hacking of Democratic email accounts during the campaign by Russian military intelligence officials and the subsequent disclosure by WikiLeaks. Intelligence authorities said that hack-and-leak operation was aimed at helping Trumpâ\u0080\u0099s presidential campaign and harming that of his Democratic opponent, Hillary Clinton. Russians also used a covert social media campaign to spread misinformation and posts aimed at dividing American public opinion. In the end, former special counsel Robert Mueller charged 25 Russian nationals for their roles in foreign interference and influence during the campaign. Democrats, including members of the Senate intelligence panel, have voiced concerns that an ongoing Republican probe into Bidenâ\u0080\u0099s son, Hunter Biden, and his work in Ukraine would amplify Russian disinformation. That probe is being led by Senate Homeland Security and Governmental Affairs Chairman Ron Johnson, R-Wis. Frank Figliuzzi, former FBI assistant director for counterintelligence, suggested in a tweet that a subtext of the Democratsâ\u0080\u0099 request is that they believe Russia to be supplying the GOP with Biden disinformation. iframe.twitter-tweet { width: 100% !important; } In a statement, Johnson spokesman Austin Altenburg said the committeeâ\u0080\u0099s staff had already requested and received a briefing on Russian disinformation and Johnson had requested an additional briefing at the member level. While Biden criticized Trump for not acting aggressively against Russia, his pledge that his intelligence community would report â\u0080\u009cpublicly and in a timely mannerâ\u0080\u009d on any foreign efforts to interfere in an American election also appeared to be a course correction of sorts to the approach of the Obama administration, which waited months after Russian hacks of Democratic email accounts in 2016 to officially attribute them to Moscow. Officials did so only after a rigorous internal debate over what they should say. Even when the administration did issue its October 2016 statement blaming Russia for the hacks, it did not mention Putin by name nor an ongoing effort to determine whether the Kremlinâ\u0080\u0099s election interference efforts were being coordinated with the Trump campaign. Democrats were reported to be wary of risking an appearance of politicizing intelligence in a way that could be perceived as assisting the presidential campaign of Hillary Clinton. An effort to put out a bipartisan statement on the matter was reportedly blocked by Senate Majority Leader Mitch McConnell, who a year ago blocked consideration in the Republican-led chamber of a House-passed bill to bolster election security, calling it unnecessary. More recently, Senate Republicans were reported to have stripped from the National Defense Authorization Act, as a condition of the legislationâ\u0080\u0099s passage, a provision requiring presidential campaigns to report any attempts by foreign entities to involve themselves in a U.S. election. Clinton, who would go on to lose the 2016 presidential election to Trump, said Monday she was â\u0080\u009cgladâ\u0080\u009d Biden was speaking up. â\u0080\u009cItâ\u0080\u0099s very clear that Russia succeeded,â\u0080\u009d she told MSNBC. â\u0080\u009cThey believed that they were able to influence the minds and even the votes of Americans, so why would they stop?â\u0080\u009d MarketWatch and other news services contributed."}]}