{"article": [{"url": "https://www.marketwatch.com/story/feds-kaplan-says-worried-new-forward-guidance-will-spark-risky-trading-2020-09-21", "published": 1600686440.0, "headline": "Fedâ\u0080\u0099s Kaplan says heâ\u0080\u0099s worried new forward guidance will spark risky trading", "body": "The new Federal Reserve forward guidance could create â\u0080\u009cfragilitiesâ\u0080\u009d and â\u0080\u009cexcessesâ\u0080\u009d in financial markets, said Dallas Fed President Rob Kaplan on Monday. Last week, the Fed promised to hold its policy rate close to 0% until inflation is on track to â\u0080\u009cmoderately exceedâ\u0080\u009d the central bankâ\u0080\u0099s 2% target â\u0080\u009cfor some time.â\u0080\u009d Kaplan, along Minnesota Fed President Neel Kashkari, was one of two dissenters to the framing of this so-called forward guidance, which provides market participants some guidance about the future path of interest rates. The Federal Open Market Committee earlier this month debuted its new forward guidance. Kashkari said the problem with the Fedâ\u0080\u0099s new guidance is that it still holds on to the importance of the unknowable variable of a maximum sustainable job level. One reason for his opposition, Kaplan said, was it gives institutional investors a signal â\u0080\u009cyouâ\u0080\u0099re going to need to take more risks,â\u0080\u009d Kaplan said in an interview on Bloomberg Television. â\u0080\u009cExcessive risk taking...can create fragilities and other excesses in the system which are hard to see in real time and easier to see in hindsight and can create issues for us,â\u0080\u009d Kaplan said, in an interview by Bloomberg News. â\u0080\u009cI felt the costs were not worth the benefits,â\u0080\u009d he added. The Dallas Fed president said there wasnâ\u0080\u0099t much benefit from announcing forward guidance last week because financial markets already believe the Fed will hold its policy rate steady for years. Kaplan was upbeat about the U.S. economy, seeing a strong fourth quarter and â\u0080\u009cabove trend growthâ\u0080\u009d in 2021. It is clear that the economy will snap back sharply in July-September as the lockdown from the pandemic from April and May ended. Kaplan said this forecast was predicated by some additional spending from Congress to help the economy. â\u0080\u009cIâ\u0080\u0099m still hopeful for it. And I think itâ\u0080\u0099s important to this recovery,â\u0080\u009d he said. There is growing worry that the fight over the new vacancy on the Supreme Court sinks the slim chances of another fiscal package until next year. Stocks opened sharply lower on Monday with the Dow Jones Industrial Average DJIA, +0.56% Â down over 800 points."}]}