{"article": [{"url": "https://www.marketwatch.com/story/covid-related-us-e-commerce-growth-slows-as-store-reopenings-attract-quarantine-fatigued-customers-adobe-2020-09-14", "published": 1600155260.0, "headline": "COVID-related U.S. e-commerce growth slows as store reopenings attract quarantine-fatigued customers: Adobe", "body": "U.S. online shopping has soared during the coronavirus pandemic, but as stores began to reopen, foot traffic returned amid ‘quarantine fatigue,’ according to the latest data from the Adobe Digital Economy Index. E-commerce sales jumped 42% year-over-year in August, reaching $63 billion, according to Adobe ADBE, +2.30% data. However, activity slowed compared with July, when e-commerce sales were up 55%. More than a quarter of consumers (27%) said they were more comfortable shopping in stores in August than they were in July. “While online shopping continues to dominate, we’re now seeing a slowdown in growth as more people return to shopping in bricks-and-mortar stores and consumers curb their online spending across certain categories, like apparel,” said Vivek Pandya, senior digital insights manager at Adobe Digital Insights in a statement. See:Retailers are shutting stores amid COVID-19 but could be getting stronger in the process, says BMO There had been concerns that stores would remain empty of customers for the foreseeable future due to customer fears about crowds, social distancing and other issues tied to the spread of COVID-19. But experts say that people are looking for a reason to get away from home after spending so much time there over recent months. “Ever since mid-April, smartphone location data has reflected ‘quarantine fatigue’ as consumers began to feel restless and tired of staying at home,” Sam Zietz, chief executive of TouchSuite, a financial technology company. “Warmer temperatures are contributing to that desire to get out of the house. We believe that consumers are getting more comfortable with the idea of visiting stores if they perceive the store has implemented COVID-specific policies and measures.”Online sales are still going gangbusters Many retailers are rethinking their store strategy to reach customers who are shopping from home and on mobile devices. Since March, consumers have spent an additional $107 billion online, with online spend totaling $497 billion. And as of August, there were 130 days in which online sales exceeded $2 billion. Last year, that number was two days, outside of the holiday shopping season. And:Halloween sales forecast could be frightful to companies trying to create holiday season momentum Forty percent of online sales are on smartphones, with $190 billion spent on the devices this year. Online grocery is also surging because of COVID-19, according to Raymond James analysts, with 60% of respondents to the Raymond James Online Grocery Survey saying they’ve purchased groceries digitally, up from 46% pre-COVID. Raymond James forecasts that online grocery penetration will double to 6% in 2020, with sales of $50 billion, a number analysts say could be conservative. The 2020 U.S. food and beverage market is about $800 billion, according to analysts. “We believe traditional grocers have the most to lose, though many are also increasingly investing in online grocery capabilities including automation and would note Instacart as a key technology partner to many traditional grocers,” analysts said. Raymond James thinks Amazon.com Inc. AMZN, +3.01% and Walmart Inc. WMT, +1.00% are the big winners in the online grocery shift, with Walmart+, which will offer unlimited free delivery, launching on September 15. Consumers are still nervous about travel, with domestic flight bookings down 58% for the month, according to Adobe. Nearly three-quarters of consumers (73%) say they plan to travel by car rather than air over the next six months. Don’t miss:After an unprecedented hard landing, the airline industry is facing a long path to a new takeoff The Amplify Online Retail ETF IBUY, +1.39% has soared 67.6% for the year to date. The SPDR S&P Retail ETF XRT, +0.05% has gained 10.7%. And the S&P 500 index SPX, +0.87% is up 4.7% for the period."}]}