{"article": [{"url": "https://www.marketwatch.com/story/investigation-finds-noose-at-nascar-track-had-been-there-since-october-no-charges-to-be-filed-2020-06-23", "published": 1592936660.0, "headline": "Investigation finds noose at NASCAR track had been there since October; no charges to be filed", "body": "The noose found hanging in Bubba Wallace’s garage stall at Talladega Superspeedway had been there since at least last October, federal authorities said Tuesday in announcing there will be no charges filed in an incident that rocked NASCAR and its only fulltime Black driver. U.S. Attorney Jay Town and FBI Special Agent in Charge Johnnie Sharp Jr. said an investigation determined “although the noose is now known to have been in garage number 4 in 2019, nobody could have known Mr. Wallace would be assigned to garage number 4 last week.” A crew member for Richard Petty Motorsports discovered the noose Sunday at the Alabama race track. NASCAR was alerted and contacted the FBI, which sent 15 agents to the track to investigate. They determined no federal crime was committed. The statement said the garage stall was assigned to Wallace last week in advance of the race scheduled for Sunday but held on Monday because of rain. Through video confirmed by NASCAR it was discovered the noose “was in that garage as early as October 2019.” The agencies said the evidence did not support federal charges. Wallace successfully pushed the stock car series to ban the Confederate flag at its venues less than two weeks ago. There has been criticism of the ban by some longtime fans and security had been stepped up for Wallace, a 26-year-old Alabama native who has worn in the last month a shirt over his firesuit that read “I Can’t Breathe.” His paint scheme for a race in Virginia was Black Lives Matter. NASCAR said in a statement that “the FBI report concludes, and photographic evidence confirms, that the garage door pull rope fashioned like a noose had been positioned there since as early as last fall. This was obviously well before the 43 team’s arrival and garage assignment.” The Wood Brothers Racing team said one of its employees informed the team he recalled “seeing a tied handle in the garage pull down rope from last fall,” when NASCAR raced at Talladega in October. The team said it immediately alerted NASCAR and assisted the investigation. The discovery of the noose stunned the stock car series as it is taking an active position in a push for inclusion while distancing itself from its rocky racial history. The series first tried to ban the Confederate flag five years ago but did nothing to enforce the order. Wallace two weeks ago renewed the call for a ban and NASCAR answered but has yet to detail how it will stop the display. Talladega marked the first race since the coronavirus pandemic that fans were permitted — 5,000 were allowed to purchase tickets — and some upset with the flag ban paraded past the main entrance with the Southern symbol. A banner flew over the speedway Sunday of a Confederate flag that read “Defund NASCAR.” NASCAR announced late Sunday the noose had been discovered and the industry rallied around Wallace. All 39 of his rival drivers and their crews helped push Wallace’s car to the front of pit road before the national anthem and stood behind him in solidarity. Wallace was joined by his team owner, Hall of Famer Richard Petty, who gently placed a hand on Wallace’s shoulder as he sobbed. Wallace after the race went to the fencing along the grandstands and greeted supporters. “The sport is changing,” he said."}]}