{"article": [{"url": "https://www.marketwatch.com/story/how-can-the-companies-that-help-us-pay-for-goods-survive-a-coronavirus-shutdown-2020-04-14", "published": 1595598860.0, "headline": "Muted spending growth in pandemic doesn't cancel big opportunities for payments companies", "body": "COVID-19 is creating short-term spending pain for many payment providers, but it's also driving new purchasing habits that could leave the companies in a stronger position once the crisis is over. While credit-card networks Visa Inc. V, +1.80%  and Mastercard Inc. MA, +2.09%  have seen payment-volume growth pressured by temporary business closures, elevated unemployment and a cutback on international travel, the companies have also seen people increasingly move their spending online-something that likely bodes well for the future. E-commerce has remained a bright spot for the card companies even as some in-person categories show rebounds. Visa reports earnings after the closing bell on Tuesday, July 28, followed by PayPal on Wednesday. Mastercard posts results in the morning on Thursday, July 30, and Square's results are due up after the market closes on Wednesday, Aug. 5. Visa's domestic card-present volumes-basically in-person spending-improved to a year-over-year decline of 20% exiting May, compared with a nearly 50% decline for much of April. Still, as in-person shopping trends got better, e-commerce volumes continued to grow as well, up nearly 40% exiting May for its highest weekly growth rate of the pandemic. PayPal Holdings Inc. PYPL, +2.18%  does nearly all of its business online, and the company disclosed on its last earnings call in May that the COVID-19 crisis led to its largest-ever day of transaction volume earlier that month, above even Black Friday and Cyber Monday. Business in the Age of COVID-19: See how the most prominent companies in U.S. are being affected by coronavirus Some of the overall growth in e-commerce spending comes from existing online shoppers who are doing more of their purchases on the web, but payments companies are also seeing new e-commerce users join the fray. In Latin America alone, 13 million Visa cardholders completed online transactions for the first time in the March quarter, the company's chief product officer told MarketWatch. It's a trend that has the broader industry feeling optimistic. \"The secular shift from cash and check to electronic forms of payment is important, and we expect it to accelerate coming out of this crisis,\" Mastercard Chief Executive Ajay Banga said on the company's last earnings call in April. For Square Inc. SQ, +2.06%  , the story is a bit more nuanced. Analysts see a longer recovery ahead for the company's seller business since many Square merchants have substantial bricks-and-mortar operations. The bright spot has been Square's Cash App, which lets people send money to friends, trade equities, and pay for goods with an associated debit card. Read: Venmo and Square's Cash App were going gangbusters before the pandemic - now they're doing even better Square's Cash App and PayPal's Venmo brought new users in during the pandemic by facilitating the direct deposit of stimulus payments straight to Square or Venmo accounts. Now the companies will look to keep these users engaged with other revenue-generating services. See more: PayPal and Square see improvements in April, but Square has a longer road aheadHow the stocks are reacting Square's stock has been the best performer lately amid enthusiasm for the Cash App. The stock has rallied 124% over the past three months and its up 104% so far in 2020. PayPal shares are up 64% in a three-month span, roughly matching their year-to-date gains, while Visa shares have climbed 23% over three months and 5% on the year. Mastercard's stock is up 26% and 4%, respectively, over those spans. The S&P 500 SPX, +0.87%  has risen 17% in the past three months and its up about 1% on the year. The companies and their numbers Visa: \"Many countries are showing spending improvement,\" the company said in a June 1 filing. Visa disclosed that U.S. debit volumes were up 4% from a year ago for the first two months of the June quarter, while domestic credit volumes were off 25% and overall U.S. volumes were down 11%. Speaking at an investor conference a few days later, Oliver Jenkyn, Visa's executive vice president for North America, said that COVID-19 could drive a $100 billion annual shift from credit cards to debit cards over time as consumers moved toward more conservative purchasing habits. Analysts surveyed by FactSet expect that Visa will report $4.82 billion in fiscal third-quarter revenue, compared with estimates for $5.56 billion as of late March. Adjusted earnings estimates have fallen to $1.03 a share from $1.32 as of the end of March. Mastercard: The company disclosed in a June 24 release that switched volumes were down 1% year-over-year in the week ended June 21, with U.S. volumes up 5% and world-wide volumes excluding the U.S. down 5%. Mastercard cited \"continued improvement in discretionary categories such as clothing, gas, home improvement, restaurants, auto and domestic travel.\" The company also said that travel within Europe has helped to drive slight improvements in cross-border spending, though cross-border volumes were still off 41% in the June 21 week, compared with a 44% drop in the last full week of May. The FactSet consensus calls for $3.24 billion in June-quarter revenue, compared with estimates for $4.02 billion as of late March. Analysts expect adjusted earnings per share of $1.17, whereas they were projecting $1.75 for the quarter as of the end of March. PayPal: Chief Executive Dan Schulman told MarketWatch after the company's last report that April \"was probably the strongest month for PayPal since we became a public company.\" The question is whether PayPal will continue to see increased interest in online shopping as people begin going back to their normal routines. Chief Financial Officer John Rainey sought to address that at a June 2 investor conference, saying that PayPal continues to see \"elevated\" e-commerce spending in markets that were quicker to relax shelter-in-place restrictions. He said that while it \"remains to be seen\" whether e-commerce spending would stay at these elevated levels, \"some of these shifts are likely to be permanent.\" Don't miss: PayPal CEO says corporate activism can help spur the 'tipping point' that brings social change Second-quarter earnings estimates for PayPal have come up in recent months, as analysts now project 87 cents in adjusted EPS, whereas they were calling for 82 cents as of March 31. Revenue estimates have been largely flat: Analysts predict $4.99 billion, compared with a prior expectation for $5 billion. See also: PayPal has 'big upside potential' for second quarter, says Bank of America Square: Chief Financial Officer Amrita Ahuja said on Square's May 6 earnings call that card-present volumes were down about 60% from a year earlier during the last two weeks of March, though the company saw \"early signs of potential stabilization and improvement\" in April. The company's Cash App hit a new high for net new monthly transacting users in March and then topped that high in April. Analysts now project $532.8 million in June-quarter revenue for Square, compared with estimates for $583.5 million as of late March and $737.1 million as of late February. The FactSet consensus models a 5-cent adjusted loss per share for the quarter. Analysts had been looking for 8 cents in adjusted EPS as of late March and 22 cents as of late February. What analysts are saying â\u0080¢ \"We believe June quarterly results will be neutral for the payments/fintech sector,\" wrote Wedbush analyst Moshe Katri, who expects weak transaction trends bricks-and-mortar small businesses to be offset by booming e-commerce growth. He argued in a July 22 note that the outlook for the second half of the year could be impacted by sustained pressures on cross-border travel as well as pauses in credit and debit volume growth in the last couple of weeks now that some states are pulling back on their reopening plans. â\u0080¢ \"It feels a bit scary to say it out loud, but the COVID- 19 pandemic appears to be ushering in a new era of peace and collaboration between the payments system and governments,\" wrote MoffettNathanson's Lisa Ellis in a July 10 note. The payments sector has had a \"love-hate\" relationship with the public sector but now governments seem to be cooperating more with payments companies like Square and PayPal, which helped facilitate Paycheck Protection Program loans and disburse stimulus payments. â\u0080¢ The pandemic \"finally\" offers PayPal \"a window of opportunity to break into offline (historically the company's Achilles heel),\" wrote Bernstein's Harshita Rawat in a July 17 note. The company has rolled out a QR-code payment option amid growing demand for touchless payments. QR codes have the potential to be a disruptive force across the payments landscape but Rawat doesn't expect them to \"take over the (payments) developed world\" over the next five years. This article is part of a series tracking the effects of the COVID-19 pandemic on major businesses, and will be updated. It was originally published April 14."}]}