{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-in-the-red-as-investors-fret-about-rising-us-covid-19-infections-2020-06-24", "published": 1592974880.0, "headline": "European stocks in the red as investors fret about rising U.S. Covid-19 infections", "body": "European stocks fell Wednesday, as markets struggled to gain traction against a backdrop of rising coronavirus cases in the U.S. Technology stocks were a bright spot after a record session for the Nasdaq Composite. The Stoxx Europe 600 index SXXP, +0.55% slid 1.2% to 362.99, after a 1.3% gain on Tuesday. Elsewhere, the German DAX 30 index DAX, +0.06% fell 1.4%, the French CAC 40 PX1, +0.71% dropped 1.4% and the FTSE 100 index UKX, +0.64% fell 1.5%. Wall Street was also building up to a loss for Wednesday, with Dow Jones Industrial Average futures YM00, +0.82% dropping more than 200 points. The Dow DJIA, +0.56% and S&P 500 SPX, +0.87% saw a second session of gains on Tuesday, and the Nasdaq Composite COMP, +1.39% booked a fresh record close, led by shares of Apple AAPL, +1.74% . “There is a total lack of direction and little predictability across the market with one outstanding behavior — buying the dips in equities and increasing hedges via safe-haven assets against a possibly sharp market rout. It is increasingly clear to everyone that most equity prices are artificially bloated,” said Ipek Ozkardeskaya, senior analyst at Swissquote Bank, in a note to clients. Data showed the Ifo business climate index for Germany rose to a reading of 86.2 in June from 79.5 in May. The number came in slightly above consensus. Dr. Anthony Fauci, the top virus expert in the U.S., told a House committee on Tuesday that the next two weeks would be critical in trying to keep the virus under control, amid a worrying case rise in Texas, Florida and Arizona. The European Union is reportedly mulling a ban on American travelers due to the fact the pandemic is not under control in that country. U.K. Prime Minister Boris Johnson said Tuesday that pubs, restaurants and cinemas will reopen in early July, despite warnings from scientists that such moves, alongside easing of the two-meter social distancing rule to one meter, could allow for a resurgence of the virus. Shares of heavily weighted pharmaceutical groups weighed on stock indexes. Shares of AstraZeneca PLC AZN, +1.16% AZN, +0.63% fell over 1% and GlaxoSmithKline PLC GSK, +1.10% GSK, +1.52% dropped nearly 2%. Among stocks on the move, chip names were rising after big tech gains in the U.S.. Shares of Dialog Semiconductor PLC DLG, +0.66% climbed nearly 9%, and ams AG AMS, +2.05% was up nearly 5%. Plus:Are tech stocks headed for a new bubble? Don’t miss Barron’s Investing in Tech virtual conference Shares of Europcar Mobility Group SA EUCAR, -2.94% jumped nearly 7% after multiple media reports said Volkswagen AG VOW3, -0.40% may be mulling an bid for the car-rental group. Neither company would comment on the report to Bloomberg. Volkswagen shares fell 1.7%. Shares of Sweden’s Evolution Gaming Group AB EVO, +6.92% fell more than 7%, after the live casino software provider said it has made an all-share public takeover for shareholders of rival gaming solutions group NetEnt AB. Shares of NetEnt AB NET.B, +6.01% surged 30%."}]}