{"article": [{"url": "https://www.marketwatch.com/story/the-recovery-is-going-to-be-a-slow-one-feds-mester-says-2020-08-28", "published": 1598609780.0, "headline": "â\u0080\u0098The recovery is going to be a slow one,â\u0080\u0099 Fedâ\u0080\u0099s Mester says", "body": "The U.S. economy is likely to continue to recover, but with fits and starts tied to progress on the coronavirus, a top Federal Reserve official said Friday. â\u0080\u009cI do believe that the recovery is likely to be a slow one,â\u0080\u009d said Cleveland Fed President Loretta Mester, in an interview on CNBC. â\u0080\u009cThere is more pain out there that we are going to have to support the economy through,â\u0080\u009d Mester said. Fiscal policy â\u0080\u009cis going to have to be at the table too,â\u0080\u009d she said. Mester, who is a voting member of the Fedâ\u0080\u0099s interest-rate committee this year, said that job growth has tempered in her districts as businesses remain uncertain. The government will release August employment report next Friday. Mester said the economy would move forward with â\u0080\u009cfits and starts.â\u0080\u009d Thatâ\u0080\u0099s very similar to the outlook presented by Fed Chairman Jerome Powell in his speech to the Jackson Hole conference on Thursday. Mester said the rise and fall in coronavirus cases is a key factor in the outlook. In regions of the country where the virus picked up at the end of June, there was a slowdown in activity. Mester is a voting member of the Fedâ\u0080\u0099s interest-rate committee this year. Several top Fed officials are speaking Friday, a tradition around the central bankâ\u0080\u0099s annual policy statement. In at later interview, Philadelphia Fed President Patrick Harker said he thought job growth and consumer spending were moving sideways in August. There are 27 million Americans on some form of unemployment, he said. The labor market wonâ\u0080\u0099t return to its pre-pandemic strength for quite a while. â\u0080\u009cIt will take a while for the employment situation to heal,â\u0080\u009d he said. Harker is also a voting member on the Fedâ\u0080\u0099s interest-rate committee this year. Asked how high he would tolerate inflation under the Fedâ\u0080\u0099s new average inflation target strategy, Harker said the speed of inflation mattered just as much as the overall level. Stocks were higher on Friday on expectation the new Fed policy means continued an easy policy stance for the central bank. The Dow Jones Industrial Average DJIA, +0.56% Â was up 75 points in morning trading"}]}