{"article": [{"url": "https://www.marketwatch.com/story/ipo-like-its-1999-market-hitting-dot-com-boom-levels-as-snowflake-and-other-cloud-software-stocks-keep-popping-2020-09-17", "published": 1600451120.0, "headline": "IPO like itâ\u0080\u0099s 1999: Snowflake and other software stocks pop as market nears dot-com-boom levels", "body": "As the importance of cloud software has grown in the global pandemic, cloud-software companies have become the most stark example of initial public offerings reaching dot-com-boom levels â\u0080\u0094 and beyond. This week saw stunning performance of four big software IPOs. On Wednesday, two cloud-software companies debuted on a storied day on Wall Street, ringing the bell on their respective exchanges virtually and then seeing their shares soar in a way that would have stood out even in 1999. Snowflake Inc. SNOW, -0.91% pulled in a record amount for a software company, and shares soared nearly 112% in their first day on the New York Stock Exchange to a market valuation of more than $70 billion. DealLogic said Snowflake had the largest valuation of a company to double its price in a market debut, based on data stretching back to 1995. Matthew Kennedy, a senior market strategist at Renaissance Capital, which manages two IPO-focused ETFs IPO, +1.98% Â IPOS, +1.22%, said there has not been an IPO that raised more than $1 billion to double in its first trading day since 2000; Snowflake likely raised more than $4 billion. The closest comparisons this year, he said, would be BigCommerce Holdings BIGC, +7.29%, which soared 201% in August, and nCino Inc. NCNO, +1.50% whichÂ jumped 195% in July. Snowflake was not alone in the software sector this week. JFrog Ltd. FROG, +0.85%, a service that lets companies quickly and seamlessly release their software upgrades to all their users and/or employees, debuted Wednesday on the Nasdaq. Like Snowflake, the company increased its IPO range and priced above the elevated target, then saw shares jump in their debut, though to a lesser degree. Later Wednesday, cloud-based AI software developer Sumo Logic Inc. SUMO, +0.33% Â priced its IPO higher than the projected range, and shares jumped more than 20% Thursday; and on Friday, Unity Software Inc. U, +8.43% Â , a platform for developing 3-D content including videogames, soared 31.4% after pricing higher than an elevated range. For more: Snowflake was red-hot and JFrog took a big jump in market debuts In the case of Snowflake, investors clearly were excited by the companyâ\u0080\u0099s market, where its cloud-based data platform competes with both cloud-service providers and legacy database software companies like Oracle Corp. ORCL, +0.42%. They also were excited to be part of a deal alongside Warren Buffettâ\u0080\u0099s Berkshire Hathaway Corp. BRK.A, +0.06% Â BRK.B, +0.24% â\u0080\u0094 typically averse to both technology companies and IPOs â\u0080\u0094 as well as Salesforce.com Inc. CRM, +2.21%. Both companies bought 250 million shares at the IPO price, while Berkshire bought 4 million more shares from Snowflakeâ\u0080\u0099s former chief executive. See also: Five things to know about Snowflakeâ\u0080\u0099s record software IPO The COVID-19 pandemic has also provided a boost for cloud-software companies, as companies seek to roll out and strengthen already existing relationships with companies that can help employees maintain productivity while working from home. JFrog, like Zoom Video Inc. ZM, +2.89%, has seen a huge surge of interest in the pandemic, though executives said it is taking longer to close deals. JFrogâ\u0080\u0099s 5,800 paying customers range from giant tech companies like Microsoft Corp. MSFT, +2.48% Â to financial institutions like American Express Co. AXP, +0.26% Â and Morgan Stanley MS, -0.34% Â to industrial firms. â\u0080\u009cSoftware is becoming a really integral part of our lives, and COVID just crystallized the need for digital transformation,â\u0080\u009d Jacob Shulman, chief financial officer of JFrog, told MarketWatch in an interview Wednesday afternoon. â\u0080\u009cThatâ\u0080\u0099s where our products help customers.â\u0080\u009d It isnâ\u0080\u0099t just software, though â\u0080\u0094 the IPO market has been on a major tear this year. Jay Ritter, a Cordell eminent scholar in the department of finance at the University of Florida, said that excluding this week, the first-day returns of IPOs so far this year were averaging about 42% â\u0080\u0094 â\u0080\u009cthe highest average since the internet bubble.â\u0080\u009d One big difference from the companies that went public in 1999-2000, Ritter noted, is that many of those young internet companies had very little revenue. â\u0080\u009cWhereas this year almost all the tech companies, like Snowflake, have significant sales,â\u0080\u009d he said. â\u0080\u009cThey are older, they have demonstrated they have a product or a service that sells and while many of them arenâ\u0080\u0099t profitable yet, they have demonstrated they are not just vaporware.â\u0080\u009d From 2015: Why this tech boom is different than the dot-com bubble Ritter pointed out that Snowflake is also realizing another near-record: For money left on the table by the company, referring to the gap between the funds raised in the offering that go to the company, and the surge in the stock after it has begun trading in the open market. â\u0080\u009cIt looks like it will be in the $4 billion vicinity, just after Visa,â\u0080\u009d which left $5.075 billion on the table in its 2008 IPO of 406 million shares, Ritter said. Snowflake only offered 28 million shares. â\u0080\u009cThe market is really paying up for growth,â\u0080\u009d Ritter said. â\u0080\u009cIs the market paying too much? Itâ\u0080\u0099s really difficult to argue that they are paying too little.â\u0080\u009d For investors who want in on these high-flying cloud companies, it is impossible to pay less. But that feels a whole lot like the hysteria for young tech companies and their promises of growth back in 1999."}]}