{"article": [{"url": "https://www.marketwatch.com/story/pence-and-other-trump-campaign-figures-to-attend-montana-event-hosted-by-qanon-followers-2020-09-09", "published": 1599724340.0, "headline": "Pence and other Trump campaign figures to attend Montana event hosted by QAnon followers", "body": "WASHINGTON (AP) — Vice President Mike Pence and top officials from President Donald Trump’s campaign are slated to attend a Montana fundraiser next week hosted by a couple who have expressed support for the QAnon conspiracy theory, according to an event invitation obtained by The Associated Press and a review of social-media postings. See:Trump praises QAnon conspiracy theorists, says he appreciates their support Also:President Trump welcomes the support, but Lindsey Graham pronounces QAnon ‘batsh— crazy’ The hosts of the fundraiser, Caryn and Michael Borland, have shared QAnon memes and retweeted posts from QAnon accounts, their social-media activity shows. The baseless conspiracy theory posits that Trump is fighting entrenched enemies in the government and also involves satanism and child sex trafficking. Beyond Pence, the Sept. 14 fundraiser in Bozeman, Mont., is expected to draw influential figures in the president’s orbit including Kimberly Guilfoyle, a top Trump fundraising official who is dating Donald Trump Jr., GOP chairwoman Ronna McDaniel, Republican National Committee finance chairman Todd Ricketts and RNC co-chairman Tommy Hicks Jr., the event invitation shows. While many Republicans have dismissed QAnon, the fundraiser is another sign of how the conspiracy theory is gaining a foothold in the party. Trump has hailed Georgia congressional candidate Marjorie Taylor Greene, another QAnon supporter, as a “future Republican star.” The president has refused to condemn QAnon, recently telling reporters that the conspiracy theory is “gaining in popularity” and that its supporters “like me very much.” See:QAnon supporter who made racist videos wins Republican primary in Georgia Plus:QAnon conspiracy theory is on the ballot in some states this November Representatives for Pence declined to comment on the fundraiser, though the vice president has previously called QAnon a “conspiracy theory.” “I don’t know anything about QAnon, and I dismiss it out of hand,” he told CBS last month. Representatives for the Trump campaign didn’t immediately comment on the fundraiser. Caryn and Michael Borland did not return a call seeking comment on the event. QAnon is a wide-ranging conspiracy fiction spread largely through the internet, centered on the baseless belief that Trump is waging a secret campaign against enemies in the “deep state” and a child sex trafficking ring run by satanic pedophiles and cannibals. It is based on cryptic postings by the anonymous “Q,” purportedly a government insider. The story has grown to include other long-standing conspiracy theories, gaining traction among some extreme Trump supporters. The movement is often likened to a right-wing cult; some followers have run for office, primarily in the Republican Party, though some have been independent or run as third-party candidates. Trump has refused to say QAnon is false. The Borlands have shared multiple QAnon social-media posts, as well as other discredited conspiracies. Michael Borland prominently features several QAnon “Q” logos on his Facebook page. One features a flaming “Q” with a Christian cross in the middle. He has also shared the QAnon oath as well as its slogan, which states: “Where We Go One We Go All.” From his Twitter account, which also features the “Q” logo, he also shared a post that labeled the Black Lives Matter movement “terrorists” and made his own threat to shoot protesters, according to a June 25 post. Read:Pence says Democrats went ‘negative’ at convention, previews a law-and-order thrust at Republican gathering Caryn Borland has retweeted or engaged with QAnon Twitter TWTR, -0.23% accounts. In April, she responded to a pro-Trump Tweet from a QAnon account by replying “Always” with a praying hands emoji. The couple has donated over $220,000 to Trump’s re-election, the bulk of which was made in Caryn Borland’s name. They were guests at the president’s renominating convention last month. They posed for photos from the White House South Lawn, including one that shows Michael Alfaro, a Trump fundraiser from Illinois, in the foreground. Alfaro, who is also slated to attend the Montana fundraiser, responded in the comments: “Working for the Borland family on South Lawn!” The couple also said they dined with Republican Sen. Rand Paul of Kentucky, according to a caption on a Aug. 27 Facebook photo of the couple and Paul. Michael Borland also posed for a photo that same day with House Minority Leader Kevin McCarthy of California, Borland’s Facebook account shows. The couple previously posed for a picture with Trump, which Michael Borland posted to Facebook FB, +0.26% on Dec. 20. Read on: Here’s what’s behind the crackpot — and baseless — Wayfair child-trafficking conspiracy theory"}]}