{"article": [{"url": "https://www.marketwatch.com/story/trumps-covid-19-what-the-latest-election-turmoil-might-mean-for-your-401-k-11601656116", "published": 1601642420.0, "headline": "Trumpâ\u0080\u0099s COVID-19: What the latest election turmoil might mean for your 401(k)", "body": "And we thought the debate would be the big story of the week. AFP via Getty Images Wow. As if the election campaign couldnâ\u0080\u0099t get any crazier, now Donald and Melania Trump announced they have COVID-19. Like any decent person, I wish them both healthy and speedy recoveries. Ditto White House adviser Hope Hicks, who has also tested positiveâ\u0080\u0094and, indeed, everyone else who gets this horrible virus. Like most of you, I know people whoâ\u0080\u0099ve lost family and friends to COVID-19 and Iâ\u0080\u0099m sure there is more to come. Already one million have died world-wide, including apparently more than 200,000 here in the United States. Where this leaves the political campaign is a subject Iâ\u0080\u0099ll leave to others. But if it causes any further election turmoil, the subject here is what that might mean for you, your investments, and your retirement portfolio. As it happens I was already been looking at what any election turmoil might mean for your investments, following president Trumpâ\u0080\u0099s recent warnings he might dispute the results if he suspected electoral fraud. And the same conclusions apply, but even more so. In a nutshell: If the election causes any market turmoil ahead, thatâ\u0080\u0099s going to be good news, at least for your investments (it may be bad news for other reasons). The reason? Warren Buffett, as usual, put it best. â\u0080\u009cOnly those who will be sellers of equities in the near future should be happy at seeing stocks rise,â\u0080\u009d he wrote in the 1997 Berkshire Hathaway annual report. â\u0080\u009cProspective purchasers should much prefer sinking prices.â\u0080\u009d Buffett compared us ordinary investors to people who eat hamburgers but donâ\u0080\u0099t own cattle, or people who buy cars but donâ\u0080\u0099t make them. We should want beef and cars to be cheaper, not more expensive. Our reaction to rising stock prices while we are investing â\u0080\u009cmakes no sense,â\u0080\u009d he wrote. A quick reminder: Buffett has built a fortune of $80 billion, entirely from investing in stocks. So he probably has a fair idea what heâ\u0080\u0099s talking about. And Ron Guay, an adviser in Sunnyvale, Calif., tells me that if there are any bumps ahead investors should stay focused on how long they may have until retirement. For many of his clients, he says, itâ\u0080\u0099s 10 or 20 years. So theyâ\u0080\u0099re adding money to their investments, not taking it out. â\u0080\u009cIf the market does decline materially as a result of a disputed election (or for any other reason under the sun),â\u0080\u009d Guay says. â\u0080\u009cThis means that you are accumulating shares at discounted prices,â\u0080\u009d and that is â\u0080\u009ca good thing,â\u0080\u009d not a bad one. Even before the latest news, investors were trying to digest the implications of president Trumpâ\u0080\u0099s comments about a possible disputed election. This had caused a lot of breast-beating in the media. But there was reason to suspect the comments were said only for effect. Trump, after all, is a master at playing the media, dominating the story line, and changing the subject. Around this point in the election cycle four years ago he was threatening to lock Hillary Clinton up in jail if he won. Instead, the only people who ended up taking a perp walk were people on his side, like Paul Manafort, Michael Cohen and Roger Stone. But his threats back then served their purpose, completely changing the story line from the Access Hollywood tapes. Meanwhile, how much do we know about what a seriously disputed presidential election would mean for markets? We have exactly one data point to draw on: The election in 2000, between George W. Bush and Al Gore. During the political turmoil that followed Bush v. Gore, and the saga of the â\u0080\u009changing chads,â\u0080\u009d Roger Stoneâ\u0080\u0099s infamous â\u0080\u009cBrooks Brothersâ\u0080\u009d fake riot, and the successful Republican bid to stop the Florida recount, the S&P 500 SPX, +0.87% fell nearly 10% and the Nasdaq CompositeÂ COMP, +1.39% plunged nearly 25% at one point. And safe havens rose: Gold GOLD, +2.86% rose as much as 4%, at one point, and long-term Treasury bonds TMUBMUSD30Y, 1.576% rose nearly 7%. With the benefit of hindsight, your smart move on the day of the election was to sell all your tech stocks and buy long bond funds like Vanguardâ\u0080\u0099s Long-Term Treasury Bond VUSTX, -0.06% fund. But. First, you canâ\u0080\u0099t draw any long-term conclusions from a single instance. Financial strategists keep suffering from â\u0080\u009cphysics envy,â\u0080\u009d andÂ thinkÂ theyâ\u0080\u0099ve discovered the boiling point of financial waterÂ in oneÂ atmosphere. But markets arenâ\u0080\u0099t physics. Going into the 2000 election, gold was around $265 an ounce. Its was near generational lows, was cheap by almost any measure, and had plenty of room to rise. Today: $1,915. And back then the yield, or interest rate, on 30 year Treasury bonds was 5.9%, and well above the rate of inflation. Bonds offered plenty of value as a safe haven. Today the interest rate is 1.46%. Thatâ\u0080\u0099s actually less than inflation. So the bullish case is pretty slim. Sure, back then the Nasdaq Composite was deflating from an epic tech bubble, and you can argue weâ\u0080\u0099re in another one right now. But thereâ\u0080\u0099s also a big difference. By November 2000 the bubble had already been deflating for nine months. This time around it hasnâ\u0080\u0099t. What really hit investors back then wasnâ\u0080\u0099t the disputed election, but valuations. We may think the S&P 500 looks ridiculously expensive today, on a so-called â\u0080\u009cShillerâ\u0080\u009d or â\u0080\u009ccyclically-adjustedâ\u0080\u009d ratio of 30 times the lastÂ 10Â yearsâ\u0080\u0099 earnings. But in November 2000 it was trading on around 40 times the previousÂ 10Â yearsâ\u0080\u0099 earnings, during an era of madness never seen before (or since). The good news? Those who were not invested in overvalued assets back then did fine. For example U.S. small cap value stocks, which were cheap at the time, fell no more than 5% during the Bush v. Gore recount battle, and ended the year higher than they were on election day. Real-estate investment trusts rose during the crisis and ended the year nearly 10% higher than they were on election day. This time around, itâ\u0080\u0099s pretty easy to find assets that donâ\u0080\u0099t look like theyâ\u0080\u0099re in a bubble. U.S. small cap value stocks (again), as measured for example by the SPDR S&P 600 Small Cap Value SLYV, +0.01% exchange-traded fund, are lower than they were in 2013. Whether theyâ\u0080\u0099re going to prove a terrific investment is another matter â\u0080\u0094 there are smart people on both sides of the debate. But itâ\u0080\u0099s hard to argue theyâ\u0080\u0099re in the midst of a massive overvaluation bubble. Ditto many overseas markets. They have gone nowhere for a decade or more, especially when measured in U.S. dollar terms. Emerging market stocks, as measured by the MSCI Emerging Markets index, are lower than they were in 2007 and 2018. And â\u0080\u009cInternationalâ\u0080\u009d stocks, as measured by the MSCI EAFE index of developed international marketsâ\u0080\u0094Europe, Japan and so forthâ\u0080\u0094has barely advanced inÂ 20Â years. Jon Ulin, a financial adviser in Boca Raton, Fla., tells me investors need to avoid reacting emotionally to day-to-day election coverage.Â â\u0080\u009cWe remind our clients that when headline news drives humans and quants to sell out of the market while driving volatility, that it may actually be a great buying opportunity whether you are sitting on cash or dollar-cost averaging into your employerâ\u0080\u0099s 401(k),â\u0080\u009d he says."}]}