{"article": [{"url": "https://www.marketwatch.com/story/lemonade-ipo-5-things-to-know-about-the-online-insurer-2020-07-01", "published": 1593711080.0, "headline": "Lemonade IPO: 5 things to know about the online insurer", "body": "As the world is buffeted by digital and societal revolutions, Lemonade Inc. is hoping to leverage the uncertainty created by those upheavals to reshape an industry meant to provide peace of mind: insurance. On Thursday, Lemonade’s US:LMND became 2020’s best IPO debut after the mobile-based insurance startup’s stock closed up 139% to finish at $69.41 on the New York Stock Exchange, hitting an intraday high of $70.80. Late Wednesday, Lemonade priced its initial public offering at $29 a share, above the already increased IPO pricing to range of $26 to $28 a share, which topped a previous range of $23 to $26 apiece. The New York-based company, founded in 2016, said in its filing with the Securities and Exchange Commission that it uses artificial intelligence and big-data algorithms to streamline the processes of buying insurance and filing claims, while minimizing volatility and “maximizing trust and social impact.” The company is attempting to approach the insurance industry the way companies like CrowdStrike Holdings Inc. US:CRWD and Salesforce.com Inc. US:CRM approached the software industry — by reimagining a legacy business for the world that exists now. Lemonade says it wants to be an insurance company “built from scratch on a digital substrate, a contemporary business model and no legacy.” When Lemonade was founded back in 2016, data and analytics firm Verisk made special note about millennials and the insurance industry, noting that the generation had different expectations from companies they solicited and demanded tech-savvy solutions. “The insurance industry may also discover that maintaining the customer loyalty of millennials is a challenge,” Verisk said. “Millennials have a perceived reputation (earned or not) that they’re not bound to traditional models of customer loyalty.” Here are five things to know about Lemonade:Stock debut puts Lemonade at more than double its valuation from SoftBank The company sold 11 million shares, with up to 1.7 million available to underwriters to cover overallotments. Underwriters include Goldman Sachs, Morgan Stanley, Allen & Co., Barclays, JMP Securities, Oppenheimer & Co., William Blair and LionTree. Thursday’s stock surge values the company at as much as $3.81 billion Before the IPO, the company had already raised $480 million through several funding rounds, according to Crunchbase, with a $300 million round in April 2019 led by SoftBank Group Corp. JP:9984 bestowing a “pre-money” valuation of $1.7 billion.Founders’ letter reads like a manifesto called ‘Our Lemonade Stand’ Lemonade seeks to rewrite the rules on the insurance industry through a David versus Goliath dynamic, Chief Executive Daniel Schreiber and Chief Operating Officer Shai Wininger said in their founder’s letter, included in the filing. Stating that the insurance industry has been swept up and altered in previous industrial revolutions, the current “fourth industrial revolution” will be no different, the founders say. “As transformative as the prior revolutions were for insurance, there is reason to believe that today’s will be even more so,” the founders said. “No part of the value chain is immune this time: distribution models, business models, statistical tools, systems of management, cost structures, corporate structures, corporate culture, technology stacks, user experience, marketing channels, data sources, data uses, value propositions, human capital — all these and more are being upended.” To that end, the company’s mission is to “harness technology and social impact to be the world’s most loved insurance company.”Focusing on first-time customers with few assets Lemonade said that 70% of its customers are under the age of 35 and that about 90% of customers were not switching from another insurer as a result of how the company pitches itself. “We bring insurance to the mobile-first, digitally-native world,” the company said in its SEC filing. “Our playful bots make for a fun and intuitive interaction at any age, all the more so to a generation that grew up with a smartphone.” Renters-insurance quotes take about two minutes, while homeowners-insurance quotes take about three minutes. Claims are paid out in as little as three seconds, the company claims. ”Companies built on human brokers and claims agents have many strengths, no doubt, but appealing to millennials and Gen Zers is not chief among them,” Lemonade said. The company reported 2019 revenue of $67.3 million, up from $22.5 million in 2018, and a 2019 loss of $108.5 million, wider than the loss of $52.9 million in the previous year. Currently, Lemonade only offers renters and homeowners insurance in the U.S., along with contents and liability insurance in Germany and the Netherlands. Lemonade’s strategy is to expand into other insurance products like auto, life and umbrella policies as its young customer base matures.Social advocacy is built into the business model, and it’s a risk factor With consumers exercising power through social movements like Me Too and Black Lives Matter, prompting businesses around the world to change practices and alter the optics of certain brands, Lemonade goes one further by making social advocacy a major part of its brand. When Lemonade customers sign up, they designate a charitable cause where “we aim to donate leftover money,” or residual premiums, in an annual donation known as the “Giveback.” In 2019, Lemonade donated $600,000 to 26 nonprofit causes, a big surge given the company has donated a total of $800,000 since it started the program in 2017. However, what is intended as an appeal to socially conscious young adults also poses risks, the company discloses. “The novelty of our business model makes its efficacy unpredictable and susceptible to unintended consequences,” the company said. “Our commitment to charitable giving through our Giveback program may not align our interests with those of our customers to the extent anticipated,” Lemonade said. “Moreover, our commitment to charitable giving may not resonate with our existing customers or may fail to attract new customers.” In its filing, Lemonade said it competes with traditional insurers like Allstate Corp. US:ALL, Farmers Insurance Group, Liberty Mutual Group, State Farm Insurance Cos., and Travelers Cos. US:TRV. There are, however, other app-based insurance companies offering renters insurance policies, such as Assurant Inc., which claims to donate $4 million a year to charities and relief efforts. San Francisco-based Gabi Personal Insurance Agency Inc., which has raised $39.1 million in venture capital, seeks to take a customer’s existing coverage and find better quotes from other insurers. There’s also Sure Inc., which acts as a curation platform for partnering insurance companies. Private equity, management hold big share majorities Once the IPO closes, SoftBank is expected to own a 21.8% stake in the company, with Sequoia Capital and Aleph LP each holding a 8.3% stake, and General Catalyst Group with a 5.9% stake. Among the company’s founders, Daniel Schreiber will hold a 28.3% stake and Shai Wininger will hold a 29% stake. Lemonade, however, said that large stakeholders will not be able to vote with more than 9.9% of the outstanding stock in the company without first getting approval of the New York State Department of Financial Services. “In the event that such approval does not permit the holder to vote more than 9.90%, the positive excess of voting rights shall be distributed pro rata among the stockholders not subject to this restriction,” the company said in its filing."}]}