{"article": [{"url": "https://www.marketwatch.com/story/dramatic-changes-in-the-arctic-suggest-climate-change-could-return-earth-to-pliocene-conditions-of-3-million-years-ago-11601495655", "published": 1601712740.0, "headline": "Dramatic changes in the Arctic suggest climate change could return Earth to Pliocene conditions of 3 million years ago", "body": "Norway's Svalbard archipelago, which lies about 750 miles north of the Arctic Circle, experienced record-breaking heat this summer. Sean Gallup/Getty Images Every year, sea ice cover in the Arctic Ocean shrinks to a low point in mid-September. This year it measures just 1.44 million square miles (3.74 million square kilometers) – the second-lowest value in the 42 years since satellites began taking measurements. The ice today covers only 50% of the area it covered 40 years agoin late summer. This year’s minimum ice extent is the lowest in the 42-year-old satellite record except for 2012, reinforcing a long-term downward trend in Arctic ice cover. Each of the past four decades averages successively less summer sea ice. NSIDC As the Intergovernmental Panel on Climate Change has shown, carbon dioxide levels in the atmosphere are higher than at any time in human history. The last time that atmospheric CO2 concentrations reached today’s level – about 412 parts per million – was 3 million years ago, during the Pliocene Epoch. As geoscientists who study the evolution of Earth’s climate and how it creates conditions for life, we see evolving conditions in the Arctic as an indicator of how climate change could transform the planet. If global greenhouse gas emissions continue to rise, they could return the Earth to Pliocene conditions, with higher sea levels, shifted weather patterns and altered conditions in both the natural world and human societies.The Pliocene Arctic We are part of a team of scientists who analyzed sediment cores from Lake El’gygytgyn in northeast Russia in 2013 to understand the Arctic’s climate under higher atmospheric carbon dioxide levels. Fossil pollen preserved in these cores shows that the Pliocene Arctic was very different from its current state. Today the Arctic is a treeless plain with only sparse tundra vegetation, such as grasses, sedges and a few flowering plants. In contrast, the Russian sediment cores contained pollen from trees such as larch, spruce, fir and hemlock. This shows that boreal forests, which today end hundreds of miles farther south and west in Russia and at the Arctic Circle in Alaska, once reached all the way to the Arctic Ocean across much of Arctic Russia and North America. Because the Arctic was much warmer in the Pliocene, the Greenland Ice Sheet did not exist. Small glaciers along Greenland’s mountainous eastern coast were among the few places with year-round ice in the Arctic. The Pliocene Earth had ice only at one end – in Antarctica – and that ice was less extensive and more susceptible to melting. Because the oceans were warmer and there were no large ice sheets in the Northern Hemisphere, sea levels were 30 feet to 50 feet (9 to 15 meters) higher around the globe than they are today. Coastlines were far inland from their current locations. The areas that are now California’s Central Valley, the Florida Peninsula and the Gulf Coast all were underwater. So was the land where major coastal cities like New York, Miami, Los Angeles, Houston and Seattle stand. Warmer winters across what is now the western U.S. reduced snowpack, which these days supplies much of the region’s water. Today’s Midwest and Great Plains were so much warmer and dryer that it would have been impossible to grow corn or wheat there.Why was there so much CO2 in the Pliocene? How did CO2 concentrations during the Pliocene reach levels similar to today’s? Humans would not appear on Earth for at least another million years, and our use of fossil fuels is even more recent. The answer is that some natural processes that have occurred on Earth throughout its history release CO2 to the atmosphere, while others consume it. The main system that keeps these dynamics in balance and controls Earth’s climate is a natural global thermostat, regulated by rocks that chemically react with CO2 and pull it out of the atmosphere. The Greenhouse Effect leads to increases in surface temperatures and, in some places, rainfall. Together these accelerate silicate rock weathering. Faster weathering in turn removes more CO2 from the atmosphere (yellow arrow). The strength of the Greenhouse Effect relies on atmospheric CO2 levels. Gretashum/Wikipedia In soils, certain rocks continually break down into new materials in reactions that consume CO2. These reactions tend to speed up when temperatures and rainfall are higher – exactly the climate conditions that occur when atmospheric greenhouse gas concentrations rise. But this thermostat has a built-in control. When CO2 and temperatures increase and rock weathering accelerates, it pulls more CO2 from the atmosphere. If CO2 begins to fall, temperatures cool and rock weathering slows globally, pulling out less CO2. Rock weathering reactions also can work faster where soil contains lots of newly exposed mineral surfaces. Examples include areas with high erosion or periods when Earth’s tectonic processes pushed land upward, creating major mountain chains with steep slopes. The rock weathering thermostat operates at a geologically slow pace. For example, at the end of the Age of Dinosaurs about 65 million years ago, scientists estimate that atmospheric CO2 levels were between 2,000 and 4,000 parts per million. It took over 50 million years to reduce them naturally to around 400 parts per million in the Pliocene. Because natural changes in CO2 levels happened very slowly, cyclic shifts in Earth’s climate system were also very slow. Ecosystems had millions of years to adapt, adjust and slowly respond to changing climates.A Pliocene-like future? Today human activities are overwhelming the natural processes that pull CO2 out of the atmosphere. At the dawn of the Industrial Era in 1750, atmospheric CO2 stood at about 280 parts per million. It has taken humans only 200 years to completely reverse the trajectory begun 50 million years ago and return the planet to CO2 levels not experienced for millions of years. Most of that shift has happened since World War II. Yearly increases of 2-3 parts per million now are common. And in response, the Earth is warming at a fast pace. Since roughly 1880 the planet has warmed by 1 degree Celsius (2 degrees Fahrenheit)– many times faster than any warming episode in the past 65 million years of Earth’s history. In the Arctic, losses of reflective snow and ice cover have amplified this warming to +5 C (9 F). As a result, summertime Arctic sea ice coverage is trending lower and lower. Scientists project that the Arctic will be completely ice-free in summerwithin the next two decades. This isn’t the only evidence of drastic Arctic warming. Scientists have recorded extreme summer melt rates across the Greenland Ice Sheet. In early August, Canada’s last remaining ice shelf, in the territory of Nunavut, collapsed into the sea. Parts of Arctic Siberia and Svalbard, a group of Norwegian islands in the Arctic Ocean, reached record-shattering high temperatures this summer. Coastal cities, agricultural breadbasket regions and water supplies for many communities all will be radically different if this planet returns to a Pliocene CO2 world. This future is not inevitable – but avoiding it will require big steps now to decrease fossil fuel use and turn down Earth’s thermostat. Julie Brigham-Grette is a professor of geosciences at the University of Massachusetts Amherst. Steve Petsch is an associate professor of geosciences at the University of Massachusetts Amherst. This was first published by The Conversation — “The Arctic hasn’t been this warm for 3 million years – and that foreshadows big changes for the rest of the planet“. .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; margin-bottom: 5px; } .at16units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body.at12units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body .header .wsj-interactive.generic-iframe-embed[name=\"\"], body.at8units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body.at4units .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .header .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; }"}]}