{"article": [{"url": "https://www.marketwatch.com/story/child-care-duties-forced-working-moms-to-take-time-off-work-at-the-beginning-of-the-pandemic-while-dads-werent-affected-2020-08-20", "published": 1598108300.0, "headline": "COVID-19 forced working mothers to take time off work - rather than fathers", "body": "Working mothers got hit with a one-two punch in the early days of the pandemic. Because child-care demands fell mostly on their shoulders, moms who were lucky enough to keep their jobs were not so lucky in the domestic sphere as shutdown orders kept children home from school, new research by the U.S. Census Bureau and Federal Reserve suggests. In states with early shutdown orders, mothers took one of two paths, both less than ideal: They temporarily took time off their jobs to care for children, or they worked more hours on nights and weekends while balancing domestic duties, research by U.S. Census Bureau principal economist Misty Heggeness and senior researcher Jason Fields found. Both options have the potential to create stress and to reduce the quality of a mother's job performance, which could then hinder future career advancement, Heggeness noted in a previous paper published by the Federal Reserve Bank of Minneapolis. In some cases, moms were working extra hours to compensate for the lost wages of other working-age adults in the household. \"Trying to balance family life in a pandemic while working more hours than their male counterparts also generates an explosive environment where mothers are vulnerable to increased stress, decreased mental health, and reduced overall wellbeing,\" Heggeness wrote. Workers in states with early shutdowns were 20% more likely than those in states that hadn't shut down yet to take temporary leave from their jobs, Heggeness wrote in the earlier paper. That rate \"appears to be driven solely by mothers who temporarily stopped working,\" she said. Mothers in states where schools and businesses closed early saw a 53.2% increase in taking leave from work. Fathers and women without children saw no significant difference in leave time between early closure and late closure states. See also: The COVID-19 recession will widen the gender pay gap - but there might be a silver lining While some research has shown that fathers increased their child-care work during the pandemic, mothers still did the bulk of the labor. That household-level disparity persists, despite broader gains for women in society. For some couples, the question of who should take on child-care duty when schools closed often revolved around which spouse made more money. In about 70% of married heterosexual couples, wives are the lower-earning spouse, and lower-earning spouses typically leave the workforce to care for children before the higher-earning spouse, previous research has shown. It's not enough to strive for gender equity in C-suites and on corporate boards, Heggeness concluded. Those gains don't mean much if parents, especially mothers, lack affordable child care while they work, she said. \"Without these systems, mommy will forever be stressed and vulnerable to career scarring during any major crisis like this pandemic or any other event that triggers an increase in domestic tasks within her household,\" Heggeness wrote. Heggeness called for a public discussion of plans for affordable, high-quality child care. Democratic presidential nominee Joe Biden announced a $775 billion plan last month calling for tax credits of up to $8,000 to help low-income and middle-class families pay for child care. President Donald Trump has not announced a child-care proposal as part of his reelection campaign, but earlier this year requested $1 billion in funding for affordable child care in his proposed budget."}]}