{"article": [{"url": "https://www.marketwatch.com/story/democrats-chances-of-senate-takeover-rise-and-that-could-affect-health-care-energy-and-financial-services-analysts-say-2020-06-19", "published": 1592816540.0, "headline": "Democratsâ\u0080\u0099 chances of Senate takeover rise, and that could affect health care, energy and financial services, analysts say", "body": "As presumptive Democratic presidential nominee Joe Bidenâ\u0080\u0099s polling lead over President Donald Trump grows, analysts say Democratsâ\u0080\u0099 chances of taking control of the Senate are rising as well. â\u0080\u009cWe raise our estimate of the likelihood that Democrats will win control of the Senate from 25% to 35% based on the Cook Political Report downgrade of Republican seats in MT, GA, and AK,â\u0080\u009d said analysts at Height Capital Markets in a note on Friday. The influential Cook Political Report has changed its rating for a Senate race in Montana, where Republican incumbent Steve Daines faces Democratic Gov. Steve Bullock, to â\u0080\u009cToss Upâ\u0080\u009d from â\u0080\u009cLean Republican.â\u0080\u009d It also recently has switched one of Georgiaâ\u0080\u0099s Senate contests, where GOP incumbent David Perdue is running against Democratic challenger Jon Ossoff, to â\u0080\u009cLean Republicanâ\u0080\u009d from â\u0080\u009cLikely Republican,â\u0080\u009d as well as adjusted its rating for an Alaska race, where GOP incumbent Dan Sullivan faces challenger Al Gross, to â\u0080\u009cLikely Republicanâ\u0080\u009d from â\u0080\u009cSolid Republican.â\u0080\u009d Gross is running as an independent â\u0080\u009cwith the blessing of national Democrats,â\u0080\u009d according to Cookâ\u0080\u0099s analysis. â\u0080\u009cMoreover, recent polling data suggests vulnerability for Republicans in AZ, CO, and IA,â\u0080\u009d the Height analysts said. GOP Sen. Martha McSally of Arizona is being challenged by Democrat Mark Kelly, while Republican Sen. Cory Gardner of Colorado is expected to face off against former Democratic Gov. Jon Hickenlooper, though Hickenlooper still must defeat rival Andrew Romanoff in a June 30 primary. In Iowa, GOP Sen. Joni Ernst is running against Democrat Theresa Greenfield. Related:This indicator shows investors are worried about a November â\u0080\u0098Blue Wave,â\u0080\u0099 and Democratic corporate tax hikes The Republican-controlled Senateâ\u0080\u0099s passage last Wednesday of a conservation bill was widely viewed as an effort to aid the November election prospects of Daines and Gardner, who championed the measure. The GOP holds 53 seats in the chamber, where ties are broken by the vice president. Health care XLV, +0.90% Â , energy XLE, -1.59% Â and financial services XLF, +0.11% Â are among the sector that could be affected by a Democratic-run Senate, according to Heightâ\u0080\u0099s analysts. â\u0080\u009cModest drug-pricing reform (Medicare Part D) and Affordable Care Act enhancement are more likely in a Democratic Senate, but with a narrow majority, major reforms like drug-price negotiation or a public option would be difficult given infighting and the filibuster,â\u0080\u009d they said. The most affected areas in the energy sector would be â\u0080\u009crenewable energy tax credits and oil industry tax cuts,â\u0080\u009d and in financial services, the â\u0080\u009crisk comes from Biden nominees for regulatory bodies.â\u0080\u009d Read more:Biden unveils plan that would add a public option to Obamacare The Height teamâ\u0080\u0099s views have some similarities with a take last month from analysts at Capital Alpha Partners, who said they see increasing chances for Democrats to take the White House and the Senate while maintaining control of the House of Representatives. â\u0080\u009cCapital Alpha now flips to predict 55% odds of a Democratic White House and Senate,â\u0080\u009d the analysts wrote in a May note. They said that outcome could hurt â\u0080\u009chealth care, energy, financial, defense, and other sectors we have long labeled as â\u0080\u0098red stocks,â\u0080\u0099 or better positioned under Republican control.â\u0080\u009d Related:Bidenâ\u0080\u0099s lead grows to 12 points in Fox News poll And see:Bidenâ\u0080\u0099s VP search is getting â\u0080\u0098outsized attentionâ\u0080\u0099 and could even shake the stock market â\u0080\u009cNewly at risk might be not only the Trump administrationâ\u0080\u0099s deregulatory agenda but the 2017 tax cuts,â\u0080\u009d Capital Alphaâ\u0080\u0099s team added. â\u0080\u009cPerhaps winning, however, could be â\u0080\u0098blue stocksâ\u0080\u0099 in the infrastructure, clean energy, Medicaid HMO, and housing sectors.â\u0080\u009d This report was first published on June 19, 2020."}]}