{"article": [{"url": "https://www.marketwatch.com/story/trump-not-letting-coronavirus-guidelines-or-local-rules-get-in-the-way-of-his-campaign-rallies-2020-09-14", "published": 1600119680.0, "headline": "Trump not letting coronavirus guidelines or local rules get in the way of his campaign rallies", "body": "WASHINGTON — President Donald Trump is running as the “law and order” candidate. But that hasn’t stopped him and his campaign from openly defying state emergency orders and flouting his own administration’s coronavirus guidelines as he holds ever-growing rallies in battleground states. Democratic governors and local leaders have urged the president to reconsider the events, warning that he’s putting lives at risk. But they have largely not tried to block the gatherings of thousands of people, which Trump and his team deem “peaceful protests” protected by the First Amendment. “If you can join tens of thousands of people protesting in the streets, gamble in a casino, or burn down small businesses in riots, you can gather peacefully under the 1st Amendment to hear from the President of the United States,” Tim Murtaugh, a Trump campaign spokesperson, said in a statement. Trump’s refusal to abide by health guidelines — even those crafted by his own administration — underscores the extent to which he believes projecting an image of normalcy is vital to winning in November, even as the country approaches 200,000 deaths from COVID-19. Trump has tried to use this summer’s mass protests over racial injustice and police misconduct as cover for his rallies, making the case that, if demonstrators can gather en masse, so can his supporters. So far, Democratic governors have declined to stand in his way, refusing to become a foil to Trump and feed into his narrative that liberals are trying to deny Republicans their First Amendment rights. Trump’s campaign insisted that it takes appropriate health precautions, including handing out masks and hand sanitizer and checking the temperatures of rallygoers. But images of thousands of maskless supporters standing shoulder to shoulder remain jarring in a country where sports are still played in empty arenas and concerts have been largely banned. That’s especially true for those who have lost loved ones or spent months isolating at home and worry that rallies will further spread infection, undermining hard-fought progress. An indoor rally that Trump held in Tulsa, Oklahoma, in June was blamed for a surge of virus infections there. Trump held an indoor rally at the Xtreme Manufacturing facility in Henderson, Nevada, on Sunday night. The state restricts gatherings to 50 people — based on White House reopening guidelines —- but thousands of supporters packed into the warehouse space nonetheless. Relatively few people wore masks. “This is an insult to every Nevadan who has followed the directives, made sacrifices, and put their neighbors before themselves,” said Nevada Gov. Steve Sisolak, a Democrat. The city of Henderson on Monday announced that it was fining Xtreme Manufacturing $3,000. Sisolak slammed the rally as “shameful, dangerous and irresponsible.” But it does not appear the governor would try to prevent a replay. If Trump returns to the state for another rally, said COVID-19 response director Caleb Cage, state officials will continue to encourage his campaign to follow state law and directives. In some other states, the rallies are legal. In North Carolina, an order signed by Democratic Gov. Roy Cooper limits outdoor gatherings to 50 people and mandates masks in public, but “activities constituting the exercise of First Amendment rights” are exempt. The state’s top public health official, Dr. Mandy Cohen, played down calls for stricter enforcement last week as she criticized Trump for holding a rally at the Winston-Salem airport, where thousands of supporters crammed together without masks. “This isn’t really about mandates and enforcement. It’s about leadership,” Cohen told reporters. “By using the First Amendment exemption for mass gatherings under the governor’s executive order in this way, they’re making it much harder for North Carolina to get our children back in school and people back to work safely,” said Dory MacMillan, a spokesperson for Cooper. In Michigan, political speech is exempt from Democratic Gov. Gretchen Whitmer’s order limiting the size of outdoor gatherings. And while Whitmer’s office issued a memo saying people engaging in First Amendment activities still must adhere to social distancing measures, the state hasn’t moved to enforce the rules at Trump’s rallies or during protests. “We hope the president would care enough about his supporters and their friends and families that he would encourage social distancing and mask wearing,” said Ryan Jarvi, a spokesperson for Democratic Attorney General Dana Nessel. Nevada is one state where Trump has encountered resistance. His campaign had originally planned to hold a pair of rallies over the weekend in Las Vegas and Reno, but those plans were scuttled after the Reno-Tahoe Airport Authority warned one of the hosts that the rally would violate the governor’s restrictions and the terms of the company’s lease. Trump’s campaign immediately moved to blame Sisolak for the pushback, but the governor’s office insisted it had had no involvement. Trump told the Las Vegas Review-Journal in an interview Sunday that “he did not believe he was subject” to the order and blamed Sisolak for forcing him to abandon plans for the outdoors rallies. “They canceled six different sites because the governor wouldn’t let it happen, all external sites,” the president said. The campaign did not respond to questions about what sites they had tried. Upcoming rallies in Wisconsin on Thursday and Minnesota on Friday will be held in open-air airplane hangars, and neither state caps attendance on outdoor events, even though COVID-19 cases have been surging in Wisconsin. Ashley Mukasa, a spokesperson for Winnebago County Health Department, said the county doesn’t have any local ordinances that would allow it to issue or enforce local health orders. However, the agency briefed Trump’s advance team about the statewide mask mandate, she said. “They wanted to avoid breaking any laws,” Mukasa said. In Minnesota, where Democratic Gov. Tim Walz has long been reluctant to spar publicly with Trump, the virus order exempts anything that would limit “the movement of federal officials in Minnesota while acting in their official capacity.” Beltrami County’s public health director, Cynthia Borgen, said the state’s health department had decided the president’s visit would fall under that exemption — even though he will be there to campaign. For one activist from the state, Trump’s co-opting of the term peaceful protest represents “a new low.” “His actions are a mockery of legitimate peaceful protests that have been happening in Minnesota and around the country regarding our stances against police violence and brutality,” said Nekima Levy Armstrong, a civil rights lawyer and former president of the Minneapolis NAACP. Trump on Monday again drew hundreds of supporters to an indoor event in Phoenix that his campaign advertised as a “Latinos for Trump roundtable,” limiting scrutiny, but that had the feel of something different. “This is supposed to be a roundtable, but it looks like a rally,” he told the crowd. Most in the audience did not wear masks, though tables filled with hundreds of unused masks were at the entrance to the event. Arizona Gov. Doug Ducey, a Republican, has consistently refused to criticize Trump for holding large gatherings in the state, including a packed campaign event at a Phoenix church in June, when Arizona was seeing a surge in coronavirus cases. “The constitutional rights of Arizonans are going to be protected,” Ducey said. “They’ve been protected the entire time. They’re nonnegotiable.”"}]}