{"article": [{"url": "https://www.marketwatch.com/story/house-panel-blasts-boeing-faa-for-crashes-01600250577", "published": 1600236620.0, "headline": "House panel blasts Boeing, FAA for crashes", "body": "(FILES) In this file photo taken on June 29, 2020 a Boeing 737 MAX jet lands following a Federal Aviation Administration (FAA) test flight at Boeing Field in Seattle, Washington. jason redmond/Agence France-Presse/Getty Images A House committee issued a scathing report Wednesday questioning whether Boeing and government regulators have recognized the problems that caused two deadly 737 Max jet crashes and whether either will be willing to make significant changes to fix them. Staff members from the Democrat-controlled Transportation Committee blamed the crashes that killed 346 people on the “horrific culmination” of failed government oversight, design flaws and a lack of action at Boeing despite knowing about problems. The committee identified many deficiencies in the Federal Aviation Administration approval process for new jetliners. But both the agency and Boeing BA, -0.39% have said certification of the Max complied with FAA regulations, the 246-page report said. “The fact that a compliant airplane suffered from two deadly crashes in less than five months is clear evidence that the current regulatory system is fundamentally flawed and needs to be repaired,” the staff wrote in the report released early Wednesday. The report highlights the need for legislation to fix the approval process and deal with the FAA’s delegation of some oversight tasks to aircraft manufacturer employees, said Committee Chairman Peter DeFazio, D-Oregon. “Obviously the system is inadequate,” DeFazio said. “We will be adopting significant reforms.” He wouldn’t give details of possible changes, saying committee leaders are in talks with Republicans about legislation. He said the committee won’t scrap the delegation program, and he hopes to reach agreement on reforms before year’s end."}]}