{"article": [{"url": "https://www.marketwatch.com/story/ncaa-division-ii-and-iii-fall-sports-championships-have-been-canceled-2020-08-05", "published": 1596651140.0, "headline": "NCAA Division II and III fall sports championships have been canceled", "body": "NCAA Division II and Division III championships in fall sports for the 2020-’21 season have been canceled due to the coronavirus pandemic. The NCAA Board of Governors on Wednesday directed each division of the NCAA to decide independently by Aug. 21 whether it will be able to conduct championship events safely in fall sports such as soccer, volleyball and lower levels of football during the pandemic. The Presidents Council for both Division II and Division III decided independently on Wednesday to cancel fall sports championships. iframe.twitter-tweet { width: 100% !important; } “Looking at the health and safety challenges we face this fall during this unprecedented time, we had to make this tough decision to cancel championships for fall sports this academic year in the best interest of our student-athlete and member institutions,” said Tori Murden McClure, Division III Presidents Council chair and president at Spalding University. “Our Championships Committee reviewed the financial and logistical ramifications if Division III fall sports championships were conducted in the spring and found it was logistically untenable and financially prohibitive. Our Management Council reached the same conclusion. Moving forward, we will try to maximize the championships experience for our winter and spring sport student-athletes, who unfortunately were short-changed last academic year.” The Presidents Council is each association’s highest governing body. The council has also stated that championships will not be made up in the spring. While championship competition for this fall is canceled, this does not mean all college sports are canceled this fall. Schools and athletic conferences are still permitted to conduct their own practices, preseasons and regular seasons as long as the school follow the NCAA’s return-to-sport guidelines. “First and foremost, we need to make sure we provide a safe environment for college athletes to compete for an opportunity to play in NCAA championships,” NCAA President Mark Emmert said in a statement. “A decision based on the realities in each division will provide clarity for conferences and campuses as they determine how to safely begin the academic year and the return to sports.” Meanwhile, the newly independent University of Connecticut became the first major college football program to cancel its season because of COVID-19 disruptions. The NCAA board also said schools must honor an athlete’s scholarship if the athlete opts out of the coming season because of concerns about COVID-19, and it directed each division to determine no later than Aug. 14 whether opting-out athletes could retain a year of eligibility. iframe.twitter-tweet { width: 100% !important; } Discussions on the future of Division I fall sports are ongoing, according to the NCAA. The Associated Press contributed to this report."}]}