{"article": [{"url": "https://www.marketwatch.com/story/inovio-shares-tumble-as-analysts-say-covid-19-vaccine-update-left-more-questions-than-answers-2020-08-11", "published": 1597212560.0, "headline": "Inovio shares tumble as analysts say COVID-19 vaccine update left more questions than answers", "body": "Inovio Pharmaceuticals Inc. shares tumbled 22% Tuesday, a day after the company reported a wider-than-expected second-quarter loss and offered a limited update on its COVID-19 vaccine candidate which is currently in clinical trials. The stock INO, -1.36% is still up 343% on the year after gaining early in the coronavirus pandemic on hopes for its vaccine candidate, INO-4800, one of many in trials around the world. Plymouth Meeting, Pennsylvania-based Inovio develops DNA based immunotherapies and vaccines for a range of diseases, including HPV, but hasn’t yet had a product approved for treatment. The company said it expects to start a Phase 2/3 trial of INO-4800 in September, and is working to expand manufacturing capacity to produce at least 100 million doses in 2021. Inovio said that 38 out of 38 patients in its Phase 1 trial achieved overall immunological responses, either through binding antibodies, neutralizing antibodies, or T cell responses. That compares with 34 out of 36 patients in the first update offered in June. The two additional patients were suspected to have been infected with COVID-19 in June, but were later found to be COVID-free and were added to the data. In case you missed it:These 23 companies are working on coronavirus treatments or vaccines — here’s where things stand Inovio said it expanded the 40-patient early-stage clinical trial by another 80 participants, aged 18 and higher. The company also added a lower dose to broaden its safety and immunogenicity database. Data from the Phase 1 trial has been submitted to a medical journal and is undergoing a peer-review before publication See also: Russia’s accelerated COVID-19 vaccine greeted with alarm as experts say Phase 3 trial is essential Stifel analysts lowered their stock price target to $16 from $24 and reiterated a hold rating and said the numbers and conference call “left us (again) with more questions than answers on numerous fronts.” See also:This Seattle man volunteered to be injected with an experimental COVID-19 vaccine: ‘It was kind of my duty as a healthy individual to step up’ These include disclosure and public timelines for INO-4800 and the continued “high-level characterization of marginally-incremental INO-4800 P1 immunogenicity/safety data,” analysts led by Stephen Willey wrote in a note clients. “Our hesitancy to attribute any INO-4800-related value in our model persists and our previously reduced discount rate (9%) reflected improved perception re: the likelihood of procuring third party funding,” said the Stifel note. “We believe these lingering questions, coupled with an acceleration of the competitive development landscape (and difficult-to-beat immunogenicity hurdles), forces us to revisit that assumption.” See also: Hahn: FDA won’t make regulatory decisions based on preprints or news releases Late Monday, the biotechnology company reported a second-quarter net loss that widened to $128.7 million, or 83 cents a share, from a loss of $29.4 million, or 30 cents a share, while the FactSet consensus was for a narrowing of the loss to 17 cents a share. Revenue nearly doubled to $267,000 but fell well short of expectations of $2.6 million. Maxim analysts Naureen Quibria and Jason McCarthy, who also rate the stock a hold, took a more upbeat view, saying the early results appear encouraging. “Lending additional support to the program is demonstration of immune responses in non-human primates (NHP) 3 months (13 weeks) following vaccination when challenged, indicative of the animals’ ability to generate memory responses and thus potential durability of INO-4800,” they wrote in a note to clients. There were just six adverse events, mostly to do with the injection site, that proved transitory, they wrote. “Important to note, the safety profile of INO-4800 compares favorably to those on the market and other vaccine candidates currently in development for COVID-19,” they wrote. See now: Dr. Osterholm: Americans will be living with the coronavirus for decades Inovio said it has started early-stage trials in China and South Korea and expects to offer data in the fourth quarter. The company has received funding for trials from the Department of Defense ($71 million); from Oslo-based The Coalition for Epidemic Preparedness Innovations ($17.2 million) and from the Bill & Melinda Gates Foundation ($5 million). Benchmark analyst Aydin Huseynov said he is optimistic for the Phase 2/3 trial and noted its safety profile was better than that achieved by Moderna Inc.’s MRNA, +0.09% 45-patient trial. “We think the safety profile of any vaccine candidate to be administered to millions or billions of individuals would have to be extremely favorable to attract a majority of the population (including elderly) for a mass vaccination,” the analyst wrote. Huseynov is expecting readouts from trials of two other Inovio vaccine candidates, one for cervical dysplasia and one for glioblastoma, that are expected in the fourth quarter to achieve “extra attention’ given developments with INO-4800. The analyst rates the stock a buy with a $36 price target, or more than double its current price. See:Dr. Fauci recommends wearing goggles to prevent catching the coronavirus"}]}