{"article": [{"url": "https://www.marketwatch.com/story/teslas-earnings-on-tap-next-week-will-a-loss-end-its-blowout-stock-rally-2020-07-13", "published": 1595400560.0, "headline": "Tesla's earnings on tap this week: Will a loss end its blowout stock rally?", "body": "Tesla Inc.'s second-quarter results come amid another massive rally for the stock, which has boosted the company's valuation to nearly $300 billion. The Silicon Valley car maker TSLA, +1.89%  is expected to report quarterly numbers on Wednesday after the bell. A call with analysts at 5:30 p.m. Eastern will follow. Tesla's shares have quadrupled in price this year, with volume nearly tripling this week from a six-month average. The rally has pushed the electric car maker's market value to around $280 billion, making Tesla the most valued car company in the world after Japan's Toyota Motor Co. TM, -0.65%, which sold more than 10 million vehicles last year, including 2.4 million in North America. Don't miss:Tesla at $2,000 is new 'bull case' for Morgan Stanley Wall Street is calling for GAAP and adjusted quarterly losses for Tesla's second quarter, but that hasn't quelled hopes that Tesla could surprise markets with a quarterly profit, which would put the stock on track to join the S&P 500 index within three to six months. One of the criteria for the index's inclusion is GAAP profitability for four consecutive quarters. Joining a major index would get Tesla shares to the portfolios of thousands of index-tracking funds, and send managed funds scrambling to catch up with it as well. Here's what to expect: Earnings: Consensus from 33 Wall Street analysts polled by FactSet calls for a GAAP loss of 80 cents a share, which would compare with a GAAP loss of $2.31 a share in the first quarter of 2019. The analysts expect an adjusted loss of 2 cents a share, which would compare with an adjusted loss of $1.12 a share a year ago. Estimize, a crowdsourcing platform that gathers estimates from Wall Street analysts, as well as buy-side analysts, fund managers, company executives, academics and others, is expecting an adjusted profit of 18 cents a share. Revenue: The analysts surveyed by FactSet expect sales of $5.15 billion for Tesla, down from $6.35 billion a year ago. Estimize sees revenue of $5.41 billion for the company. Stock movement: So far this year, Tesla shares have gained 260%, a stark contrast with losses of around 7% for the Dow Jones Industrial Average DJIA, +0.56%  and breakeven for the S&P 500 index SPX, +0.87%  in the same period. What else to expect: A clearer picture of the coronavirus pandemic impact on the company will likely emerge with the quarterly results. For most of the three-month period, Tesla's sole U.S. car-making factory in Fremont, Calif., was closed (and became a point of contention between Chief Executive Elon Musk and local health authorities, with the factory reopening against shutdown orders), with production from Tesla's Shanghai factory offsetting some of the effects of Fremont's closing. The share rally, which started in December, most recently picked up steam after the company earlier this month reported better-than-expected second-quarter sales without Fremont at full speed. The stock's valuation is likely \"dislocated from traditional valuation metrics,\" analysts at Evercore ISI said in a recent note. Tesla could \"weaponize it,\" and go for another equity raise, despite having done so as recently as February, they said. The money could be used to improve its balance sheet, and expand capacity faster. More clarity on the pace of Model Y production and deliveries is also high on investor's list for the quarter. See also:Tesla stock rockets higher as quarterly sales crush expectations Tesla lumped second-quarter production and sales of the Model Y, a compact SUV, with those of the Model 3, saying that it sold 80,050 and produced 75,946 of both, the vast majority being Model 3s. Besides the focus on demand for the Model Y, Wall Street is bound to parse out any mention of 2020 sales goals. Tesla in April said it has the \"capacity installed\" to deliver more than half a million vehicles in 2020 \"despite announced production interruptions.\" The analysts at Evercore ISI on Monday tweaked higher their expectations for 2020 deliveries to 460,000 vehicles, from their previous expectation of 435,000 vehicles. The FactSet consensus calls for 435,000 units to be sold this year. Another potential catalyst for the shares is around the corner, and Tesla could provide more details about it during the call. Tesla has set its \"battery day\" for Sept. 22 alongside its annual shareholder meeting. The expectation is that the company will unveil a \"million mile\" battery and showcase advances that would put the company comfortably ahead of competition. Battery-technology innovations \"remain the key ingredients in Tesla's success on the battery front and we believe the company is getting closer to announcing the million mile battery,\" Dan Ives of Wedbush said in a recent note. Such a battery could \"last for decades, withstand all types of weather/terrain, and be another major milestone for the Tesla ecosystem.\""}]}