{"article": [{"url": "https://www.marketwatch.com/story/the-triple-wtf-chart-of-the-year-put-your-brain-on-tesla-autopilot-and-believe-11598979889", "published": 1598979200.0, "headline": "The â\u0080\u0098Triple-WTFâ\u0080\u0099 chart of the year: â\u0080\u0098You just have to put your brain on Tesla Autopilot and believeâ\u0080\u0099", "body": "MarketWatch photo illustration/Getty Images/ iStockphoto Wolf Richter couldnâ\u0080\u0099t wrap his brain around the â\u0080\u009csupernatural phenomenonâ\u0080\u009d way back in February when he warned investors to steer clear of shorting it. He then bestowed the stock with â\u0080\u009cround-trip chart of the yearâ\u0080\u009d honors a few months after that. Now, with Tesla stock TSLA, +1.89% splitting and pushing even deeper into uncharted territory, Wolf Richter of the popular Wolf Street blog just posted another chart to commemorate the occasion. â\u0080\u009cTeslaâ\u0080\u0099s market cap soared by $64 billion in eight hours, including after hours. Thatâ\u0080\u0099s $8 billion in â\u0080\u0098value createdâ\u0080\u0099 per hour,â\u0080\u009d Richter wrote in a blog post late Monday. â\u0080\u009cIf you have to ask, â\u0080\u0098value created by doing what,â\u0080\u0099 then you donâ\u0080\u0099t have the right stuff. Simple as that.â\u0080\u009d He then put Teslaâ\u0080\u0099s market cap in perspective: Apple AAPL, +1.74% : $2.21 trillion Amazon AMZN, +3.01% : $1.73 trillion Microsoft MSFT, +2.48% : $1.71 trillion Google GOOG, +1.97% : $1.11 trillion Facebook FB, +0.26% : $835 billion Berkshire Hathaway BRK.A, +0.06% : $521 billion Tesla: $476 billionÂ â\u0080\u009cTesla, the minuscule automaker with a global market share of less than 1%, isnâ\u0080\u0099t actually an automaker with stagnant revenues in a long-term stagnant or declining industry, but a data company with a secret government contract to populate Mars or whatever,â\u0080\u009d Richter wrote, with more than a hint of sarcasm. â\u0080\u009cYou just have to put your brain on Tesla Autopilot and believe.â\u0080\u009d Read: His short just got â\u0080\u0098obliterated,â\u0080\u0099 but this Tesla bear keeps trying TeslaÂ gave up gains on Tuesday, after the company took advantage of the stockâ\u0080\u0099s best monthly performance in seven yearsÂ to raise more capital. Before the disclosure, the stock wasÂ rallying premarket. The broader market, however, closed in the green, with the Dow Jones Industrial Average DJIA, +0.56%, Â S&P 500 SPX, +0.87% Â and NasdaqÂ COMP, +1.39% all higher."}]}