{"article": [{"url": "https://www.marketwatch.com/story/long-island-will-enter-phase-3-wednesday-but-the-future-of-movie-theaters-and-malls-is-unknown-2020-06-23", "published": 1592937620.0, "headline": "Long Island will enter Phase 3 Wednesday, but the future of movie theaters and malls is unknown", "body": "Life on Long Island will look a little more normal on Wednesday, as the downstate region enters the third phase of its reopening on Wednesday. Restaurants and bars will be allowed to serve customers indoors at a reduced capacity, while tattoo artists, nail salons and spas will accept customers for the first time in three months. Eateries and salons located in malls might have months before they can reopen, however, as a member of the state’s coronavirus task force reportedly said that malls, movie theaters and gyms won’t reopen as part of the fourth and final phase, the Albany Times Union reported on Tuesday. So far, only mall stores with exterior entrances have been allowed to reopen, leaving most indoor shopping centers as well as gyms and theaters in limbo for the foreseeable future. State budget director Robert Mujica reportedly broke the news to local leaders in a conference call on Tuesday, the Times Union reported. The governor’s office did not immediately return a request for comment. See: Coronavirus Hearing: Airlines must take extreme precautions to keep passengers safe Long Island, where many New York City residents decamped at the start of the crisis, enters Phase 3 on Wednesday after weathering one of the worst coronavirus outbreaks in the country, with the virus killing around 4,700 people. On Monday, 77 people on Long Island tested positive for coronavirus, down from a daily high of several thousand in early April, according to the state health department. Statewide, just under 600 people tested positive for the disease on Monday and 27 people died, Gov. Andrew Cuomo said on Tuesday, reiterating the state’s gradual approach to reopening. “We’re seeing in other states what happens when you just reopen with no regard for metrics or data — it’s bad for public health and for the economy,” Cuomo said in a statement. Long Island follows the Hudson Valley, which entered Phase 3 on Tuesday. Both areas provide some respite to New York City residents, who live in between and who’ve only just begun Phase 2 of reopening this week. New York is now one of only three states on track to contain the virus, according to Covid Act Now, a multidisciplinary organization of data scientists, epidemiologists and other public health experts. The only other states successfully containing the disease are Massachusetts and New Jersey. Be sure to read: Fauci says COVID-19 has one characteristic he’s never seen before: ‘I’ve been dealing with viral outbreaks for the last 40 years’ “We went from one of the highest infection rates to one of the lowest and we did it by making decisions based on the science, the data and the facts — not on politics,” Cuomo said, telling New York not to “blow” their progress. Other New York City developments: Child care funding: As parts of the state move toward the fourth and final phase of reopening, Cuomo announced the state would put aside $65 million in federal funding it received through the CARES Act to support child care programs. Centers can apply for a grant to cover 50% of the cost of opening a new classroom, up to $6,000. Fireworks: Mayor Bill de Blasio announced that the Macy’s M, -0.95% Fourth of July fireworks show will take place in short spurts around the five boroughs and over multiple days from June 28 to July 1, culminating in a finale show on Saturday, July 4."}]}