{"article": [{"url": "https://www.marketwatch.com/story/snap-stock-drops-in-late-trading-as-losses-grow-sales-and-users-continue-to-increase-2020-07-21", "published": 1595355980.0, "headline": "Snap stock drops in late trading as losses grow, but sales and users continue to increase", "body": "Snap Inc.’s losses widened in the second quarter as Snapchat’s parent company dealt with the effects of the COVID-19 pandemic, sending shares lower in after-hours trading Tuesday afternoon. Snap SNAP, -0.18% shares were down 11% immediately after the report was released Tuesday, before recovering somewhat to a 4% loss after an optimistic peek at Q3. The company said it lost $326 million, or 23 cents a share, compared with a loss of $255.2 million, or 19 cents a share, in the year-ago quarter. After adjusting for stock-based compensation and other factors, Snap reported a loss of $95.6 million, or 9 cents a share, compared with an adjusted loss of $78.7 million, or 6 cents a share, a year ago. Revenue improved 17% to $454 million from $388 million a year ago. The company declined to project what its results could be for the third quarter. Analysts surveyed by FactSet had expected an adjusted loss of 9 cents a share on sales of $442 million. Daily active users, an important measure of the service’s popularity, improved 17% to 238 million, roughly in line with the average analyst forecast of 238.5 million. Snap said that users increased from the previous quarter and the previous year in all of its geographies. It forecast a range of between 242 million and 244 million in the third quarter. “We are grateful that the resilience of our business has allowed us to remain focused on our future growth and opportunity,” Snap Chief Executive Evan Spiegel said in a statement announcing the quarterly results. In prepared remarks, Snap Chief Financial Officer Derek Andersen estimated year-over-year Q3 revenue growth of 32% through July 19. “While we are cautiously optimistic that these trends could sustain over time, we are also conscious that operating conditions may remain volatile, and that economic conditions could further deteriorate,” he said. Advertising demand in Q3 historically has been bolstered by factors that “appear unlikely to materialize in the same way they have in prior years, including the back-to-school season, film release schedules, and the operations of various sports leagues,” Andersen said. “At this point in time it is difficult to predict how these factors may impact advertising demand in the remainder of Q3. Our best estimate at this point is that our full-quarter revenue growth rate is likely to be below our quarter-to-date estimated actual growth rate, and as a result we have built our internal investment plan based on revenue growth of approximately 20%.” The second-quarter jump in revenue heartened analysts, who have trained a keen eye on the financial performance of Snap during the first wave of COVID-19 in the spring. As the first major social-media company to report in the June quarter, it offered a first look at the economic damage wrought by the escalating pandemic. Snap is expected to continue to benefit, like Facebook Inc. FB, +0.26% , from a return of advertisers in the second half of the year as well as filch some ad sales from Facebook, which is the target of an advertising boycott of more than 1,000 companies in July for offensive content on its platforms. Digital media platforms, in particular, are the most likely destination spot for brands in place of billboards and traditional channels like linear TV, according to Wall Street analysts. Snap is most frequently mentioned as a “share gainer outside the duopoly” of Facebook and Google parent Alphabet Inc. GOOGL, +1.82% GOOG, +1.97%, Loop Capital Markets analyst Rob Sanderson said in a July 20 note. “We conducted scenario analyses that show the potential for double-digit stock returns over the next three years, with potentially 20%+ returns for Snap,” Jefferies analyst Brent Thill added in a July 13 note that maintained an overweight rating on Snap shares, and raised its price target to $30 from $20. In a July 15 note, J.P. Morgan analyst Doug Anmuth picked Snap and Facebook as the most promising stocks, followed by Alphabet, Pinterest Inc. PINS, -0.50% and Twitter Inc. TWTR, -0.23% . Anmuth maintained an overweight rating on Snap’s stock, and raised his price target to $28 from $22 Snap’s shares have improved 52% this year. The broader S&P 500 index SPX, +0.87% is up 0.8% in 2020."}]}