{"article": [{"url": "https://www.marketwatch.com/story/foreign-buying-of-american-real-estate-plunged-before-the-pandemic-will-covid-19-push-it-even-lower-2020-08-06", "published": 1596888320.0, "headline": "Foreign buying of American real estate plunged before the coronavirus pandemic - and experts say it's only going to get worse", "body": "Foreign buyers are purchasing fewer and fewer American homes. And the coronavirus pandemic could cause a serious pullback in new investment in U.S. residential real estate from international buyers. During the 12-month period ending in March 2020, foreign buyers purchased 154,000 existing homes in the U.S., down 16% from the previous year, according to a new report from the National Association of Realtors. This was the smallest number of existing-homes that international buyers have purchased since 2011, and the third consecutive year that the number decreased. Altogether, international buyers purchased $74 billion-worth of U.S. residential real-estate, down from $77.9 billion the year before and $121 billion two years ago. The report includes purchases by buyers who live abroad as well as foreign residents in the U.S. China was the largest buyer of U.S. homes once again, accounting for the purchase of 18,400 homes worth roughly $11.5 billion. But among the top five international buyers - which also included Canada, Mexico, India and Colombia - China was the only country where the number and value of homes purchased between 2019 and 2020 decreased. “ 'The Chinese government has become much more restrictive about how much cash they can take out of the country.' ” - Lawrence Yun, chief economist at the National Association of Realtors Don't miss:Coronavirus slows China's property market to a crawl - and even the most robust real-estate app is no match A number of factors have reduced Chinese interest in U.S. real estate in recent years - including government efforts to stem these purchases. \"The Chinese government has become much more restrictive about how much cash they can take out of the country,\" said Lawrence Yun, chief economist at the National Association of Realtors. \"There's always a way to go around it, but the fact that the Chinese government is placing capital controls means there could be more monitoring of their citizens,\" Yun added. \"Just the sense the government may be watching them has reduced the number of Chinese buyers here in the U.S.\" Continued trade tensions between the U.S. and China has also worked to hold back some activity, as have restrictions on visa issuance to Chinese visitors.How the pandemic will affect international purchases of U.S. homes The National Association of Realtors (NAR) report only covers the period between April 2019 and March 2020, so it doesn't reflect the full impact of the coronavirus pandemic. But even before the pandemic became a crisis here in the U.S. it was having an effect on home-buying activity. Back in February, when China was still the main epicenter for the pandemic, real-estate agents told MarketWatch that uncertainty and travel restrictions had led Chinese investors to pull out of planned deals. Much has changed since then. The U.S. now has the largest number of cases worldwide, and many countries have imposed travel restrictions. This will seriously curtail foreign buying of U.S. real-estate, Yun said. \"For the most part, people need to see the property in person,\" Yun said. Buyers from abroad aren't just purchasing properties for investment purposes. Also see:Real-estate reckoning on 'master bedrooms' as a racist term took place after years of discussion - yet many home builders dropped the term years ago Over half (51%) of non-resident foreign home buyers plan to use the property as a primary residence or vacation home, while another 10% expect to have it double as a rental property and vacation home, according to NAR data. “ Over half of non-resident home buyers use the property as a primary residence or vacation home. ” Moreover, the most popular real-estate markets for foreign buyers are located in states with some of the highest coronavirus case counts. Florida was the top destination for foreign buyers, followed by California, Texas, New York and New Jersey. Given the difficulty and risks posed by traveling, many foreign buyers may decide to hold off on buying an American home until they can enjoy it. International buyers also don't have the same incentives to buy a home in the U.S. right now as their American peers. \"International buyers are much more likely to buy with cash or use more limited financing,\" said Danielle Hale, chief economist at Realtor.com. \"As a result, we don't see a surge in international demand when interest rates drop.\" A number of factors could provide a boost to international demand, though. The upcoming presidential election could result in a dramatic shift in international relations depending on the outcome. \"A Biden administration could potentially be more welcoming,\" Yun said. The U.S. real-estate market's quick rebound from its coronavirus lows could be a draw in and of itself for foreign buyers, said Daren Blomquist, vice president of market economics at Auction.com, a listing site for foreclosed properties. Plus, some economists have suggested that the flight to the suburbs could lead to softer prices for properties in major cities, which could attract foreign buyers. Ultimately, though, a decline in international buying isn't likely to hurt the U.S. real-estate market, because foreign buyers only account for 4% of existing-home sales. In fact, it could be the opposite. \"The fact that foreigners have stepped back is actually providing a better chance for domestic buyers to get those properties,\" Yun said."}]}