{"article": [{"url": "https://www.marketwatch.com/story/fed-wont-begin-to-think-about-raising-rates-until-inflation-is-clearly-at-2-clarida-says-2020-09-23", "published": 1600881380.0, "headline": "Fed officials struggle to convince investors their new policy strategy will be helpful", "body": "Federal Reserve officials hit the lecture circuit on Wednesday with the aim of convincing investors that their new policy strategy would be helpful for the economy over the longer term. Last week, the Fed said it expected to leave rates near zero until inflation has risen to 2% and is on track to moderately exceed that level for some time. Financial markets didn’t react much to the update at all. Even when inflation hits the 2% target, the central bank won’t automatically raise rates but will assess whether a tightening is needed, said Fed Vice Chairman Richard Clarida, in an interview on Bloomberg Television. “We expect that rates will be at the current level, which is basically zero, until actual observed PCE inflation has reached 2%,” Clarida said, referring the central bank’s preferred measure of personal-consumption expenditures. “We could actually keep rates at this level beyond that,” he said. Markets had interpreted remarks from Chicago Fed President Charles Evans on Tuesday as suggesting the central bank could lift off prior to hitting the 2% target. The dollar DXY, -0.58%, notably, gained in a move market participants pinned in part on the regional Fed leader’s remarks. On Wednesday, Evans said he was just pointing out that rates could rise before inflation averages 2% over a period of time. “I really thought that I was pretty much reading out what our September policy statement was saying,” Evans said during a talk sponsored by MNI. Evans said he preferred to let inflation run hot so that it would average 2% and he did not support a “timid” overshoot. He said a 2.5% inflation rate for some period of time “is likely in the cards,” but noted that his colleagues seem to be discussing a potential lower 2.2% rate. In a subsequent discussion with reporters, Evans expanded to say that the Fed will have to work very hard to get inflation up to 2%. ‘I think you have to provide a lot of accommodation and I think if you’re at all skittish about how much you overshoot 2% while you have maintained inflation expectations relatively consistent with 2%, you make your job a lot more difficult,” he said. Read: Fed’s Evans says recessionary dynamics are a risk without more fiscal support Fed watchers note that some of the confusion comes because the Fed has not defined the period when inflation would average 2% and how much inflation could rise above target without raising concern. “The confusion over how to read Evans underlines the need for the Fed leadership to start fleshing out its currently vague ‘overshooting’ formula sooner rather than later in order to secure and extend the credibility gains associated with its strategy shift and help sustain supportive financial conditions at a difficult moment,” said Krishna Guha, a former Fed staffer and now vice chairman of Evercore ISI. Evans said the Fed would have more conversations about the guidance and acknowledged the issue was a communications challenge for the central bank. Other observers note the debate about higher inflation is a problem that remains years away. At the moment, the economy is struggling out of the deep hole from the coronavirus pandemic. In a speech at lunchtime, Boston Fed President Eric Rosengren said he was concerned the economy was more fragile than the economic data over the summer suggested. Read:Fed’s Rosengren is less optimistic than many of his central bank colleagues. Fed Vice Chairman for Supervision Randal Quarles was more upbeat. In a speech to the Institute for International Bankers, he said that the U.S. economy looked like it could avoid the worst-care scenarios from the pandemic. In total, eight of 17 senior Fed officials spoke in public on Wednesday. The one thing that Fed officials all agreed on is the need for more Congressional spending to support the economic recovery. In testimony to Congress on Wednesday, Fed Chairman Jerome Powell said that the power of congressional spending to help the economy is “unequaled by anything else.” But prospects of more spending prior to the November election have dimmed. Reporters pressed Evans on whether the Fed might alter its asset purchase program. At the moment, the Fed is buying $120 billion in Treasurys and mortgage backed securities every month. Fed watchers said the Fed could change the maturity profile of the Treasury purchases or increase the size of its purchases. Evans said the Fed was waiting for developments with the virus before it could decide how much accommodation was needed. “When we get closer to the vicinity of ... 6% unemployment ... I think that would be definitely a time to tune up our forward guidance for asset purchases. We may well do it before that. I think it is ongoing conversations,” Evans said. The Dow Jones Industrial Average DJIA, +0.56% was down over 500 points on Wednesday as the tech sector, in particular, suffered."}]}