{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-rally-as-iea-report-points-to-record-appetite-for-crude-next-year-2020-06-16", "published": 1592321300.0, "headline": "Oil prices gain more than 3% as IEA report points to record rise in crude appetite next year", "body": "Oil futures finished with a more than 3% gain on Tuesday as a monthly report from the International Energy Agency forecast a record rise in demand for crude and its byproducts next year, but only after first dropping significantly in the current year. The International Energy Agency said that while the world’s demand for crude will drop by 8.1 million barrels a day in 2020, “the largest in history,” demand in 2021 will bounce back by 5.7 million barrels a day, the “largest one-year jump ever recorded.” “Demand destruction in the early part of the year was slightly less than expected, although still unprecedented,” the IEA said. The Paris-based agency also warned that the impact of the COVID-19 pandemic on global economies should not be underestimated. “We acknowledge that there are places where the number of new Covid-19 cases reported each day remains high and economic activity, and thus oil demand, could remain subdued for longer than elsewhere,” it said. Against the backdrop, West Texas Intermediate crude for July delivery CL.1, -1.62% US:CLN20, the U.S. benchmark, rose $1.26, or 3.4%, to settle at $38.38 a barrel on the New York Mercantile Exchange, after hitting highs above $39 during the session. Prices rose 2.4% on Monday. Global benchmark Brent oil for August delivery UK:BRNQ20 picked up $1.24, or 3.1%, at $40.96 a barrel on ICE Futures Europe after gaining 2.6% in the previous session. A monthly report from the Organization of the Petroleum Exporting Countries is due Wednesday, after the cartel and its allies, in a group known as OPEC+, agreed earlier this month to extend production cuts of nearly 10 million barrels per day through July and to review the status of adherence to those reductions monthly. However, output in the U.S., which isn’t a signatory to the OPEC+ agreement, has shown signs of further declines, with the Energy Information Administration on Monday forecasting a July decline of 93,000 barrels per day in oil production from seven major U.S. shale plays. Meanwhile, an OPEC-led meeting of the Joint Ministerial Monitoring Committee, or JMMC, to review compliance with the recent global production cuts will be held this week. “Eyes are on another coming meeting as well,” wrote Bjornar Tonhaugen, head of oil markets at Rystad Energy, in a daily research note. “Thursday’s production cut compliance committee meeting isn’t one to miss. It may not be taking any decision on production cuts, but it will be very indicative of the mood within OPEC+,” he wrote. On the bearish side for oil, “concerns about a second wave of COVID-19 cases in a number of U.S. states, as well as a recent uptick in the Chinese capital of Beijing are sure to gain the market’s attention over at least the near-term,” said Robbie Fraser, senior commodity analyst at Schneider Electric, in a daily note. “The market rally for much of May and early June was at least partially tied to stabilizing demand prospects and rebounds off record lows, which could be challenged by another significant wave of confirmed cases,” he said. Weekly data on U.S. petroleum supplies will be released by the American Petroleum Institute late Tuesday, with official figures from the EIA due out Wednesday morning. On average, analysts at S&P Global Platts expect the EIA to report a decline of 3.5 million barrels in U.S. crude supplies for the week ended June 12. They also forecast an inventory decline of 2.2 million barrels for gasoline, but distillates, which include heating oil and diesel, are seen higher by 3.1 million barrels. On Nymex, July gasoline US:RBN20 tacked on 3.6% to $1.2073 a gallon and July heating US:HON20 rose 4% to $1.1822 a gallon. July natural gas settled at $1.614 per million British thermal units, down 3.3%. Read:Why natural-gas prices haven’t yet bottomed despite this year’s 20% drop"}]}