{"article": [{"url": "https://www.marketwatch.com/story/why-septembers-selloff-has-these-savvy-traders-convinced-that-stock-prices-are-going-up-2020-09-22", "published": 1600766480.0, "headline": "Why Septemberâ\u0080\u0099s selloff has these savvy traders convinced that stock prices are going up", "body": "Recent U.S. stock market weakness does not represent the beginning of a new bear market, according to a contrarian analysis of short-term market timers. Thatâ\u0080\u0099s because those timers have reacted to the marketâ\u0080\u0099s recent pullback by rapidly turning bearish. At major tops, in contrast, their typical behavior is to stubbornly hold onto their bullishness. To be sure, two weeks ago I reported that contrarians had already reached a similar conclusion, and the market is lower today. The S&P 500 SPX, +0.87% Â is down 1.8%, for example, and the Russell 2000 Index RUT, +0.55% is down 0.8. (These losses are as of Mondayâ\u0080\u0099s close.) Contrarians are even more confident now that the marketâ\u0080\u0099s early-September all-time high does not represent the bull marketâ\u0080\u0099s last gasp. Thatâ\u0080\u0099s for two reasons. The first is that short-term stock market timers over the past two weeks have become even more bearish. In fact, the average recommended equity exposure level among close to 100 short-term stock market timers I monitor has dropped into negative territory, meaning that they on average are recommending that their clients allocate some of their equity trading portfolios to going short the market. These timers on average are betting that the stock market is headed lower, in other words. And, as contrarians constantly remind us, the majority is usually wrong. To put the short-term market timersâ\u0080\u0099 pessimism in perspective, consider the historical range for the Hulbert Stock Newsletter Sentiment Index (HSNSI), which reflects their average recommended equity exposure. Since 2000, more than 90% of the HSNSIâ\u0080\u0099s daily readings have been higher than where it stands today. As you can see from the accompanying chart, this puts the latest HSNSI reading into the zone that some contrarians consider to represent extreme bearishness. The other reason contrarians are not dissuaded from their bullish call: The jury is still out. According to the statistical tests to which Iâ\u0080\u0099ve subjected the HSNSI over the past decade, its greatest explanatory power lies at the three-month horizon. Thereâ\u0080\u0099s still have more than two months left until the jury reaches its verdict. One way of appreciating this is by comparing the returns of the Russell 2000 subsequent to extreme bullish and extreme sentiment over the past decade. I chose the Russell 2000 for illustration because the small- and midcap sectors it reflects are those most susceptible to investor sentiment. Subsequent to extreme bullish sentiment since 2010 (HSNSI readings in the top 10% of the historical distribution) Subsequent to extreme bearish sentiment since 2010 (HSNSI readings in the bottom 10% of the historical distribution) Russell 2000 over subsequent one month -0.6% +3.5% Russell 2000 over subsequent two months -0.6% +7.5% Russell 2000 over subsequent three months -2.6% +10.0% Russell 2000 over subsequent four months -3.8% +12.1% Of course, there are no guarantees. Market-timer sentiment is not the only factor that moves the market. Still, the recent behavior of those market timers is more reminiscent of past market corrections than of the beginnings of major bear markets. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com Read:CNBCâ\u0080\u0099s Jim Cramer says enough is enough: â\u0080\u0098This is the beginning of the end of the selloffâ\u0080\u0099 More:This mutual fund may have cracked the â\u0080\u0098Buffett Codeâ\u0080\u0099 â\u0080\u0094 Berkshire Hathawayâ\u0080\u0099s secret sauce"}]}