{"article": [{"url": "https://www.marketwatch.com/story/trade-deficit-falls-75-in-june-but-imports-and-exports-still-way-below-year-ago-levels-2020-08-05", "published": 1596620120.0, "headline": "Trade deficit falls 7.5% in June, but imports and exports still way below year-ago levels", "body": "The numbers: The U.S. trade deficit fell by 7.5% in June after a partial rebound in exports, but the flow of cross-border transactions remained depressed by the global coronavirus pandemic and are still a sore spot for the economy. The trade gap shrank to $50.7 billion in June from $54.8 billion in the prior month, the U.S. Census Bureau said Wednesday. That was in line with the forecast of economists polled by MarketWatch. A smaller deficit is normally a good thing because it adds to gross domestic product, the official scorecard for the U.S. economy. Yet both imports and exports are well below year-ago levels, reflecting reduced demand by American consumers hurt by the pandemic as well as a smalller appetite by other countries for U.S. goods and services. Last week, the U.S. government said GDP declined at a nearly 33% annual pace in the second quarter, marking the biggest decline on record. Read: Economy suffers titanic 32.9% plunge in 2nd quarter, points to drawn-out recovery Also:‘A massive welfare economy’ - federal aid prevents even steeper GDP collapse What happened: U.S. exports jumped 9.5% in June, led by higher shipments of autos and parts as well as fuel oil. Even after the increase, however, exports were almost 16% off last year’s pace. Imports rose a smaller 4.7%. The U.S. took in more foreign-made autos, cell phones and computers, but imports of industrial supplies fell sharply. Imports were 14.2% below last year’s level. The deficit in goods with China fell slightly to a seasonally adjusted $26.7 billion in June. The gap with China in the first six months of 2020 declined to $142.2 billion from $183.2 billion in the first half of 2019, reflecting ongoing trade tensions with the U.S. as well as the impact from the virus. The U.S. imposed a variety of tariffs on China before the outbreak and many of them remain in place. Yet instead of the overall deficit declining, the U.S. has replaced Chinese imports with imports from other countries. Read:Job trouble? Wave of rehiring after economy reopened to fade in July after viral spiral The big picture: Global trade has partly rebounded after a semi-collapse during the early stages of the pandemic, but a full recovery is likely to take awhile. All the world’s major economies have been stunted by the coronavirus and safeguards to prevent the spread of the disease have also slowed the flow of trade. What they are saying? “Trade flows have been weak and will likely remain restrained owing to a weak global growth backdrop and subdued demand at home and abroad,” said Rubeela Farooqi, chief U.S. economist of High Frequency Economics, in a note to clients. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 index SPX, +0.87% were set to open modestly higher in Wednesday trades. Stocks have traded in a narrow range for the past few weeks."}]}