{"article": [{"url": "https://www.marketwatch.com/story/despite-pandemic-trump-administration-urges-supreme-court-to-end-affordable-care-act-2020-06-25", "published": 1593129740.0, "headline": "Despite pandemic, Trump administration urges Supreme Court to end Affordable Care Act", "body": "WASHINGTON — In the midst of the coronavirus pandemic, the Trump administration on Thursday urged the Supreme Court to overturn the Affordable Care Act. The administration’s latest high court filing came the same day the government reported that close to half a million people who lost their health insurance amid the economic shutdown to slow the spread of COVID-19 have gotten coverage through HealthCare.gov. The administration’s legal brief makes no mention of the virus. Some 20 million Americans could lose their health coverage and protections for people with preexisting health conditions also would be put at risk if the court agrees with the administration in a case that won’t be heard before the fall. In the case before the Supreme Court, Texas and other conservative-led states argue that the ACA was essentially rendered unconstitutional after Congress passed tax legislation in 2017 that eliminated the law’s unpopular fines for not having health insurance, but left in place its requirement that virtually all Americans have coverage. After failing to repeal “Obamacare” in 2017 when Republicans fully controlled Congress, President Donald Trump has put the weight of his administration behind the legal challenge. If the health insurance requirement is invalidated, “then it necessarily follows that the rest of the ACA must also fall,” Solicitor General Noel Francisco wrote Thursday. The Trump administration’s views on what parts of the ACA might be kept or replaced if the law is overturned have shifted over time. But in legal arguments, it has always supported getting rid of “Obamacare” provisions that prohibit insurance companies from discriminating against people on account of their medical history. Nonetheless, Trump has repeatedly assured Americans that people with preexisting conditions would still be protected. Neither the White House nor congressional Republicans have specified how. The new sign-ups for health coverage come from the Centers for Medicare and Medicaid Services. The figures are partial because they don’t include sign-ups from states that run their own health insurance marketplaces. Major states like California and New York are not counted in the federal statistics. An estimated 27 million people may have lost job-based coverage due to layoffs, and it’s unclear what — if anything — they’re turning to as a fallback. People who lose employer health care are eligible for a special sign-up period for subsidized plans under the Obama-era law. Many may also qualify for Medicaid. The Trump administration has been criticized for not doing as much as states like California to publicize these readily available backups. In response, administration officials say they have updated the HealthCare.gov website to make it easier for consumers to find information on special sign-up periods. Thursday’s report from the government showed that about 487,000 people signed up with HealthCare.gov after losing their workplace coverage this year. That’s an increase of 46% from the same time period last year."}]}