{"article": [{"url": "https://www.marketwatch.com/story/cannabis-whiskey-and-mobile-bike-repair-these-entrepreneurs-are-thriving-in-the-pandemic-2020-07-27", "published": 1595514860.0, "headline": "Cannabis, whiskey, and mobile bike repair: These entrepreneurs are thriving in the pandemic", "body": "This article is reprinted by permission from NextAvenue.org. It is part of the America’s Entrepreneurs report. Running a small business can be daunting in the best of times. Throw in a pandemic and it can be devastating. But some older entrepreneurs are thriving during COVID-19 because of growing demand for their particular products and services. Here are three of their stories:Joe Sandschulte: Mobile bike repairman Joe Sandschulte, 66, spends his days driving his Bicycle Fixer van through the streets of suburban Seattle. He can’t keep up with the demand for his mobile bike repair service. Sales this spring were up about 50% over last year because the COVID-19 stay-at-home orders have led more people to bike rather than drive. Bike shops have seen an uptick in sales nationwide with the boom in socially distanced recreation and transportation. But mobile bike repair services like Sandschulte’s are especially hot, given continuing fears about going back into brick-and-mortar stores. “I still see three or four clients a day. But instead of repairing one bike, I will repair a whole family’s worth of bikes — three or four. People love the convenience,” Sandschulte says. He left his position as a bike shop service manager seven years ago to open the mobile business. At the time, his wife worried about her husband giving up benefits and a steady paycheck. Things were tough at first. “The first year, it wasn’t exactly raining money,” Sandschulte recalls. But he built up his business with a steady clientele of home and corporate clients who don’t miss lugging their bikes to the repair shop. Also see: This entrepreneur says you’re never too old to launch your own startup, even in this economy These days, Sandschulte loves working on his own and is committed to giving quality service to every bike owner, whether it’s an old hand-me-down or a $10,000 custom-built racing bike. He plans to ride the business into his 70s. “I’m doing my own thing. I just love the freedom,” Sandschulte says. 80% of older Americans can't afford to retire - COVID-19 isn't helping Rebecca Myers: Medical marijuana grower and processor In September 2019, Rebecca Myers — who describes herself as over 50 — opened FarmaceuticalRX, a medical marijuana grower and processing facility, inside a former steel mill in western Pennsylvania. Six months later, the pandemic hit, and Myers worried she’d have to shut it down. But that didn’t happen. The reason: Pennsylvania Gov. Tom Wolf deemed medical marijuana an essential business. “Who would have thought the day would come that the government deemed a medical marijuana business essential?” says Myers. “But we all know it’s true. Patients need us more than ever during this incredibly anxious and emotional time.” Myers has also weathered the pandemic storm by being proactive. After reading early reports of the devastation of COVID-19 in China, she implemented social distancing, masks and gloves inside the plant. If employees have COVID-related symptoms and exposure, they get paid sick leave. You might like: 10 tips for starting your own business when you’re over 50 FarmaceuticalRX currently sells its products in dispensaries throughout Pennsylvania and operates a dispensary in Ohio. Myers plans to start cultivating and processing in Ohio, too. This career path was never one she envisioned. “If you had told me 20 years ago that I would be running a business that grew marijuana, I would have laughed,” says Myers. Previously, as a former district attorney in the Bronx, she prosecuted drug and other crimes. She has also worked in the opiate treatment industry. And the former Division 1 basketball player — Myers was starting point guard at Fordham University — had never partied like other college students. But then a family medical crisis made her realize the urgent need for medical marijuana. A cousin was diagnosed with osteosarcoma (a type of bone cancer) and had his leg amputated; medical marijuana was the only thing getting him through the punishing chemotherapy treatments. But it was still illegal in Ohio. Myers ran into many people with similar stories about sick loved ones who couldn’t get medical marijuana. So she spent $14 million to renovate two buildings from the former Sharon Steel Corp. in Farrell, Pa. But since “I don’t have a green thumb,” she says, Myers traveled around the country to interview the best organic growers. She also began partnering with Penn State University, Case Western Reserve University and Harvard Medical School’s Dana–Farber Cancer Institute on medical research. Aside from wanting to get medical marijuana to people who needed it, Myers also yearned to bring jobs back to a region that struggled for decades following the collapse of the steel industry. Also see: I want to take money out of my Roth IRA tax-free — when can I do that? Currently, her company has 77 employees at its two locations. “There are a lot of wonderful people with a great work ethic,” Myers says.Mark Meyer: Microdistiller Mark Meyer, now 69, was preparing to retire from being a lawyer when his adult children approached him with an idea: starting a family microdistillery. He and his wife, Mary Ellen, a retired occupational therapist, were shocked. “We weren’t even whiskey drinkers. We drank a little wine,” Mary Ellen says. But the idea grew on them, and Wigle Distillery, which makes craft whiskey and other spirits, was born in 2012. The first distillery to open In Pittsburgh since Prohibition, it was named after a founder of the Whiskey Rebellion. A Whiskey Rebellion of a different kind erupted in Pennsylvania in March 2020 when Pennsylvania liquor stores closed due to the COVID-19 pandemic and customers howled in protest. To make things worse, the initial version of the state’s online ordering system was a glitch-filled failure. Wigle Distillery’s new mail-order service has helped the company survive after its six retail locations were ordered closed in March. WigleWhiskey.com Meyer was able to benefit from the Whiskey Rebellion because he had convinced the Pennsylvania Liquor Control Board to allow the same mail-in service granted to state stores years ago. That part of his business had never gained traction until the pandemic hit. Wigle has also been offering curbside pickup services during COVID-19. In addition to helping his customers, Meyer says the changes in his business have been a “lifesaver” for his award-winning craft brewery. The new mail-order service has helped Wigle Distillery survive after its six retail locations were ordered closed in March. The company reopened one retail location in June. For all the ups and downs, Meyer says he believes whiskey is as recession-proof as any business. “If spirits can survive Prohibition, it shows just how resilient it is,” he says. Cristina Rouvalis is a freelance writer whose work has appeared in Hemispheres, PARADE, Esquire.com, AARP the Magazine, Fortune.com, Inc. and Parents. This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved. It is part of America’s Entrepreneurs, a Next Avenue initiative made possible by the Richard M. Schulze Family Foundation and EIX, the Entrepreneur and Innovation Exchange."}]}