{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-up-150-points-as-investors-monitor-trump-response-to-coronavirus-treatment-11601854016", "published": 1601915900.0, "headline": "Dow ends 465 points higher after Trump cleared to leave hospital after 3-night stay", "body": "U.S. stock indexes closed higher Monday on optimism about President Donald Trump’s response to COVID-19 treatments and hopes for additional fiscal stimulus, both potentially poised to blunt the the pandemic’s toll.How did stock benchmarks trade? The Dow Jones Industrial Average DJIA closed 465.83 points higher, or 1.7%, at 28,148.64. The S&P 500 SPX advanced 60.16 points, or 1.8%, to end at 3,408.60, while the Nasdaq Composite COMP finished up 257.47 points at 11,332.49, a gain of 2.3%. The Russel 2000 Index RUT, +0.55% of small-capitalization stocks outperformed, ending 2.8% higher, a gain of 42.67 points, to close at 1,581.96. The Dow DJIA, +0.56% on Friday fell 134.09 points, or 0.5%, to 27,682.81, but benchmarks ended well off session lows after the initial news of Trump’s diagnosis. The S&P 500 on Friday ended 32.36 points lower, down 1% at 3,348.44, while the Nasdaq Composite finished 251.49 points lower, down 2.2%, at 11,075.02.What drove the market? A key driver for U.S. stocks on Monday was hope that experimental drugs used to treat Trump for COVID-19 might become more widely available to the public during the pandemic than expected. Read: History shows stock-market investors are quick to shrug off presidential health woes “If the leader of the free world is taking an experimental drug,” it could mean that drug developers might be able to push through COVID-19 therapies sooner than expected, said Robert Pavlik, chief investment strategist at SlateStone Wealth, in an interview. “Also, there’s a belief that we’re closer to some type of stimulus from Congress,” he said. Trump tweeted on Monday afternoon that he would be discharged from Walter Reed National Military Medical Center at 6:30 p.m., following a three-night stay. iframe.twitter-tweet { width: 100% !important; } Trump’s physician Sean Conley said Trump met or exceeded discharge criteria, but that he’s not yet “out of the woods” and that the next seven days will be crucial. Coronavirus update: Coronavirus update: Global case tally tops 35 million and deaths exceed 1 million, while Trump says ‘don’t be afraid of COVID’ Investors were bracing for a volatile run-up to the Nov. 3 presidential election even before Trump’s diagnosis last week. On Monday, the West Wing outbreak grew, including after White House press secretary Kayleigh McEnany tested positive. Trump’s contraction of the virus also “could lead to far broader adoption of mask-wearing as average Americans,” wrote Kristina Hooper, Invesco’s chief global markets strategist. “In turn, this could slow the spread of COVID-19, which should be a significant positive for the economy, especially as we worry about a possible second wave this fall.” New York City on Monday said that schools in hotspots, including several ZIP Codes in Brooklyn and Queens, will close Tuesday. French authorities placed Paris back on “high alert” for COVID-19 Monday, banning festivals and closing bars in the French capital and limiting social gatherings. Hooper also said Senate Republicans now might recognize “how virulent the disease is, which could in turn prompt them to agree to a larger stimulus package.” Results of a Wall Street Journal/NBC News poll conducted in the two days following Tuesday’s highly contentious presidential debate, but before news of Trump’s COVID-19 diagnosis, showed Biden expanding his lead to 14 percentage points, a 53% to 39% advantage, among registered voters. The survey showed Biden with an 8-point lead last month and an 11-point advantage in July, previously his largest margin of the campaign. Analysts said prospects for a more decisive outcome on Nov. 3 could be a positive for markets. Fears have grown of an inconclusive election result that could see weeks of contentious political and legal wrangling. A growing lead for Biden also could make the White House and congressional Republicans more willing to give in to Democratic demands during drawn-out negotiations for a new round of stimulus to support the U.S. economy and households. Trump on Saturday also tweeted in favor of another round of stimulus. Fresh economic data also bolstered optimism for assets viewed as risky. The Institute for Supply Management said its index of activity among nonmanufacturing companies rose to 57.8% last month from 56.9% in August. Any number above 50 represents an expansion in industrial activity. Underlining the positives in the report, the employment portion of the ISM survey suggested more companies were adding jobs than they were letting go. As for the Federal Reserve, Chicago Fed President Charles Evans said inflation could temporarily shoot above 2% next spring, testing the central bank’s new inflation framework. Which stocks were in focus? Slack Technologies, Inc. WORK, +3.36% shares rose 1.8%, after the messaging service on Monday was working to repair service disruptions. Shares of Tesla Inc. TSLA, +1.89% gained 2.6% after the electric car maker reported quarterly sales Friday that topped Wall Street forecasts and hit a record. MyoKardia Inc. MYOK, +0.25% shares jumped 57.8% after the biotechnology company confirmed that it agreed to be bought out by Bristol-Myers Squibb Co. BMY, +0.32% in a deal valued at $13.1 billion in cash. Bristol Myers shares gained 0.8%. Shares of Norwegian Cruise Line Holdings Ltd. NCLH fell 1.6% after the cruise operator extended the suspension of cruises to include those embarking Nov. 1 through Nov. 30 Chinese streaming-video company iQiyi Inc. IQ said an internal review “did not uncover any evidence that would substantiate the allegations” made by short seller Wolfpack Research that it had engaged in fraudulent behavior. Shares advanced 2.4%. Regeneron Pharmaceuticals REGN, +0.36% shares and Gilead Sciences Inc GILD, +0.82% shares gained 7.1% and 2.3%, respectively, after Trump was treated over the weekend with their COVID-19 medicines. Trump previously held financial stakes in each company, according to several news reports. Westwater Resources Inc WWR, +2.56% soared 87.3% Monday, after the battery-materials company praisedTrump’s recent executive order supporting the development of a U.S. supply of graphite. Cineworld CINE, +0.54% shares plunged 36.2% on Monday, after the world’s second-largest movie chain confirmed it will temporarily close its cinemas in the U.K. and the U.S., putting 45,000 jobs at risk. How did other markets fare? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% climbed 6.6 basis points to 0.76%. Bond prices move inversely to yields. U.S. benchmark crude futures for November delivery CLX20, -1.62% gained 5.9%, to finish at $39.22 a barrel on the New York Mercantile Exchange Gold futures for December delivery GCZ20, +2.17% rose 0.7%, to settle at $1,920.10 an ounce on Comex, the highest finish in just over two weeks. In global equities, the Stoxx Europe 600 index SXXP, +0.55% closed 0.8% higher, while the U.K.’s FTSE 100 UKX, +0.64% gained 0.7% In Asian markets, the Hong Kong Index HSI, -0.30% closed up 1.3%, Japan’s Nikkei 225 Index NIK, -0.11% advanced 1.7%, while the South Korea’s Kospi 180721, +0.21% rose by 1.3%. The ICE U.S. Dollar index DXY, -0.58%, a gauge of the greenback’s strength against a basket of currency trading partners, was off about 0.4%. Check out: Barron’s Oct. 6 Health Care Roundtable William Watts contributed reporting"}]}