{"article": [{"url": "https://www.marketwatch.com/story/walmart-to-hire-20-000-seasonal-workers-stocks-up-on-tvs-for-the-holidays-11600867811", "published": 1600936340.0, "headline": "Walmart to hire 20,000 seasonal workers, stocks up on TVs for the holidays", "body": "Walmart is preparing for a holiday season that will be impacted by the coronavirus Walmart Walmart Inc. says it has started the holiday hiring process, seeking 20,000 workers to help with a season that is starting earlier and relying more on digital due to COVID-19. Walmart’s WMT, +1.00% new hires will join its e-commerce fulfillment centers. Pay will range from $15.75 to $23.75 an hour and will begin right away, with shifts assigned as quickly as 48 hours after a new hire has applied for a job. Seasonal hires will stay on through Jan.1, 2021, and many roles could turn permanent. Walmart has hired more than 500,000 workers since March across stores and elsewhere in the business. Read: Holiday sales forecast to grow 1% to 2.6% during new October-to-December shopping season: AlixPartners The retail giant is also stocking up on items that have grown in demand since the start of the pandemic, like bicycles, exercise equipment and athleisure gear. The company is also stocking up on pet items “to ensure it has great gifts for the newest member of many families since the pandemic began,” it said in an announcement. Walmart has also increased its inventory of electronics items like TVs and laptops. The retailer already announced its hot toys of the season. See: Here is Walmart’s list of the hottest toys for the holidays With the shopping calendar out of whack due to the coronavirus pandemic, experts say the holiday season will start even before Halloween, with some speculating as early as Oct. 10, or 10/10/2020. Media reports on Wednesday said Amazon.com Inc. AMZN, +3.01% ‘s delayed Prime Day event, which normally takes place in the summer, will be held on Oct. 13. Walmart, Target Corp. TGT, +1.14% and other retailers have announced Thanksgiving Day store closures this year. And Walmart is touting its contactless options, like store pickup and contactless payments, for this year’s pandemic-impacted shopping season. Don’t miss: The holiday shopping season could start on 10/10/2020 with retailers hopeful that consumers will turn out early Workers and customers will be required to wear face coverings in stores, plastic barriers have been installed at checkout and other parts of the store and the flow of traffic will be managed to aid with social distancing. Consumers still have another holiday, Halloween, to celebrate before reaching Thanksgiving and beyond. Many consumers are expected to stay close to home without the traditional Halloween party or trick-or-treating this year due to the pandemic. Also: Halloween sales forecast could be frightful to companies trying to create holiday season momentum Walmart stock has gained 14.4% for 2020 to date while the Dow Jones Industrial Average DJIA, +0.56% is down 6.2% for the period."}]}