{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-tumble-550-points-as-stock-market-investors-watch-rising-cases-of-coronavirus-fed-offers-grim-outlook-of-us-economy-2020-06-11", "published": 1591893920.0, "headline": "Dow plunges 7%, marks worst day since March as Fedâ\u0080\u0099s grim outlook and rising cases of coronavirus unsettle bulls", "body": "U.S. stocks on Thursday marked the worst day since the height of the coronavirus-induced rout, amid signs of a re-acceleration of cases of COVID-19, and as investors digested Wednesdayâ\u0080\u0099s sobering economic outlook from Federal Reserve Chairman Jerome Powell. The market moves came even as the number of Americans filing for first-time jobless benefits declined again in the most recent week. How did benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% Â closed down 1,861.82 points, or 6.9%, to 25,128.17, marking the indexâ\u0080\u0099s worst daily drop since March 16, FactSet data show. All 30 of the blue-chip indexâ\u0080\u0099s components ended lower led by Boeing Co. BA, -0.39% Â and Dow Inc. DOW, -0.04%. Meanwhile, the S&P 500 SPX, +0.87% was down 188.04 points, or 5.9%, to finish at 3,002.10, led by brutal declines in the energy sector SP500.10, -1.59% Â , down 9.5%, and financials SP500.40, +0.06%, off 8.2%. Only one of the S&P 500â\u0080\u0099s components finished in positive territory and that was grocery chain Kroger Co. KR, +0.46%, Â up a modest 0.4%. Both the S&P 500 and the Dow finished at their lowest levels since May 26, Dow Jones Market Data showed. The Nasdaq Composite COMP, +1.39% ended down about 527.62 points, or 5.3%, at 9,492.73, one day after charting a record above 10,000. The technology-laden index closed at its lowest level since May 29. The small-cap Russell 2000 RUT, +0.55% slid 111.17 points, or 7.6%, to 1,356.22.What drove the market? A broad and vicious risk-off mood took hold of Wall Street on Thursday, puncturing a bullish uptrend that had been fueled by signs of progressively successful reopenings from coronavirus lockdowns. However, doubts raised about the pace and quality of the recovery from the current recession raised by Powell on Wednesday and signs of rising cases of COVID-19 forced investors to reassess their positions, experts said. The number of U.S. coronavirus infections passed the two million mark and over 112,000 Americans have died, according to Johns Hopkins University. Despite fewer cases being recorded in some cities and states, the seven-day average of new cases over the past two weeks is still rising in more than 20 states, leading investors to worry about a second wave of the epidemic just as business activity is resuming. The global case tally for the coronavirus climbed to 7.39 million on Thursday.. The death toll rose to 417,022. On Wednesday, the Fedâ\u0080\u0099s updated policy statement and projections indicated that it expects a 6.5% contraction by the end of the year on a year-over-year basis, with the unemployment rate ending at 9.3%, well above the Fedâ\u0080\u0099s estimate of the long-run rate forecast of 4.1%. The central bankâ\u0080\u0099s dour outlook has a lot to do with the stock market selloff, said Kristina Hooper, Invesco chief global market strategist. â\u0080\u009cThe stock market has almost had blinders on,â\u0080\u009d Hooper said in an interview. â\u0080\u009cMore than one in three companies in the S&P 500 are dispensing with earnings guidance. So investors have anchored to data, which has been relatively positive about reopenings in various states, improvements in PMIs and the jobs report last week. In one fell swoop Jay Powell threw a lot of cold water on that narrative.â\u0080\u009d Hooper thinks the market moves of this week arenâ\u0080\u0099t necessarily the start of a sustained leg downward. â\u0080\u009cTypically the initial reaction to the Fed press conference is not the subsequent reaction. There needs to be some digestion by investors.â\u0080\u009d President Trump announced he will resume holding election rallies with the first in Tulsa, Okla., on June 19 but he isnâ\u0080\u0099t expected to require that attendees practice social distancing. Meanwhile, U.S. Treasury Secretary Steven Mnuchin said the U.S. shouldnâ\u0080\u0099t shut down the economy again even if there is another surge in coronavirus cases. FED RECAP: Fed provides update on economic outlook and policy thinking In U.S. economic data Thursday, another 1.54 million Americans filed for initial jobless claims, the government said. That beat expectations for 1.565 million people seeking unemployment benefits, according to the Econoday consensus. Although new jobless claims have been falling since March, more than 2.2 million applications for unemployment compensation were filed in the last week of May through state and federal relief programs. That is almost as many as the 2.5 million jobs regained by the economy in the entire month. Producer prices moved fractionally upward in May, the government said, notching their first increase in four months. Economists had forecast another decline.Which stocks are in focus? Childrenâ\u0080\u0099s Place Inc. PLCE, -6.78% shares finished down 3.9% after reporting results that missed analyst expectations and the company said it plans to shutter hundreds of stores. Shares of Oneok Inc. OKE, -1.22% Â tumbled 16% after the natural gas services company announced a public offering of 26 million shares of common stock. Shares of United Airlines Holdings Inc. UAL, +0.32%, Delta Air Lines Inc DAL, +0.39%, and American Airlines Group Inc. AAL, +0.34% all dropped sharply. Norwegian Cruise Line Holdings Ltd NCLH, +2.91% Carnival Corp. CCL, +0.51% shares ended off 16.5%, and fell 15.3%. Among the morningâ\u0080\u0099s biggest gainers were consumer staples producers that benefit from a more germ-conscious public: Clorox Co. CLX, +0.90% fell about 1.1%, reversing an earlier gain, while Church & Dwight Co. CHD, +1.77%, maker of Arm & Hammer, Oxiclean, and more, declined 1.4%. Regeneron Pharmaceuticals Inc. REGN, +0.36% fell 1.7% after the company said it had begun Phase 1 clinical trials on COVID-19 treatments. Grubhub Inc. GRUB, +0.83% shares rose 4.7% after the company agreed to be acquired by a Dutch company. Related:Here are the biggest stock-market bets among institutional and retail investors, rankedHow are other assets faring? Oil prices closed sharply lower Thursday. West Texas Intermediate US:CLN20 fell $3.26, or 8.2%, to settle at $36.34 a barrel on the New York Mercantile Exchange, marking the worst one-day slide since April 27. The greenback picked up 0.2% against its major rivals, as gauged by the ICE U.S. Dollar index DXY, -0.58%. In precious metals, August gold US:GCM20 on Comex rose $19.10, or 1.1%, to settle at $1,739.80 an ounce, as investors piled into less-risky assets. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% Â fell about 9.3 basis points to 0.651% after the central bank said rates were likely to remain lower for much longer. Bond prices move in the opposite direction of yields. In global equities, the Stoxx Europe 600 index SXXP, +0.55% finished the session down 4.1%, while the FTSE 100 index UKX, +0.64% shed about 4%. In Asia, Japanâ\u0080\u0099s Nikkei NIK, -0.11% tumbled 2.8%, the China CSI 300 000300, +2.04% Â finished 1.1% lower and Hong Kongâ\u0080\u0099s Hang Seng Index HSI, -0.30% closed off 2.3%. South Koreaâ\u0080\u0099s Kospi index 180721, +0.21% retreated 0.9%. Read next:JETS ETF joins the mile-high club, topping $1 billion in assets, even as air travel sinks 90%"}]}