{"article": [{"url": "https://www.marketwatch.com/story/asian-markets-advance-after-wall-street-rally-and-as-gold-extends-gains-2020-07-28", "published": 1595895140.0, "headline": "Asian markets advance after Wall Street rally, and as gold extends gains", "body": "Shares advanced in Asia on Tuesday after U.S. stocks resumed their upward march on Wall Street, while the price of gold pushed to nearly $1,970 per ounce. Share prices advanced across the region, with Tokyo’s Nikkei 225 index NIK, -0.11% up 0.1% and the Hang Seng HSI, -0.30% in Hong Kong adding 0.5%. The Shanghai Composite index SHCOMP, +1.67% advanced 0.6% and the Kospi 180721, +0.21% in Seoul rose 1.1%. Benchmark indexes in Taiwan Y9999, +1.10% , Singapore STI, -0.39% and Indonesia JAKIDX, +0.28% were mixed, while the S&P ASX/200 XJO, +0.00% in Sydney gained 0.2%. Shares of Samsung Electronics 005930, -0.33% surged in South Korea ahead of its new-smartphone unveiling event next week, while Mitsubishi Motors 7211, -4.23% plunged in Tokyo trading after a deep slump in sales and a ”shocking” warning that it expects its biggest annual operating loss in nearly two decades, according to Reuters. Much attention will be focused on a two-day meeting for the Federal Reserve that begins Tuesday, while hopes for more help for the American economy are rising as Congress debates another stimulus package. The closure of the U.S. Consulate in western China’s Chengdu, following the shutdown of China’s consulate in Houston, Texas, highlighted antagonisms between Washington and Beijing that are adding to jitters at a time when the coronavirus pandemic appears to be regaining its grip in parts of Asia, including Hong Kong, Japan and Vietnam. Such “acute geo-political uncertainties and socio-political strains all align with preference for a currency-like, safe-haven hard asset such as gold at the expense of the U.S. dollar,” Hayaki Narita of Mizuho Bank said in a commentary. The price of gold jumped $38.80 to $1,969.80 an ounce early Tuesday, up 2% to another record high. It’s unusual for the price of gold, which tends to rise when worries about the economy are high, to do so well at the same as stocks, which tend to wilt under such worries. But massive amounts of pandemic-fighting stimulus have flooded markets with ample supplies of cash seeking the highest possible returns. On Wall Street, the S&P 500 SPX, +0.87% climbed 0.6% to 3,239.41. The Dow Jones Industrial Average DJIA, +0.56% rose 0.4% to 26,584.77, and heavy buying of technology shares helped push the Nasdaq composite COMP, +1.39% 1.7% higher, to 10,536.27. “Amid the lack of fresh leads for the market, investors appeared to have once again turned to the safe choice of tech stocks, ones regarded to better weather the COVID-19 pandemic,” Jingyi Pan of IG said in a commentary. Investors are waiting to hear what the U.S. central bank says this week about the economy’s prospects and what it plans to do on interest rates. More than a third of the companies in the S&P 500 are scheduled to report how they fared from April through June. Several of the market’s most influential companies are scheduled to report this week, including Amazon AMZN, +3.01% , Apple AAPL, +1.74% , Facebook FB, +0.26% and Google’s parent company Alphabet GOOGL, +1.82% GOOG, +1.97% . Those four account for 16% of the S&P 500’s total value, which gives their movements outsized influence on the index. So far, profit reports have been better than Wall Street forecasts, though still far weaker than a year earlier because of the recession. But worries are rising about an uptick in layoffs across the country as businesses close down again amid growing coronavirus counts across much of the Sun Belt. Lawmakers are haggling over how to support the economy as an extra $600 in weekly unemployment benefits from the U.S. government is set to expire soon. Democrats and Republicans still have much to negotiate. The yield on the 10-year Treasury note ticked up to 0.62% from 0.60% late Monday. Benchmark U.S. crude US:CLU20 picked up 8 cents to $41.68 per barrel in electronic trading on the New York Mercantile Exchange. It gained 31 cents to settle at $41.60 per barrel on Monday. Brent crude UK:BRNU20 , the international standard, added 22 cents to $44.12 per barrel. In currency dealings, the U.S. dollar USDJPY, -0.38% slipped to 105.33 Japanese yen from 105.40 yen late Monday."}]}