{"article": [{"url": "https://www.marketwatch.com/story/next-week-well-learn-the-size-of-the-hole-the-us-economy-fell-into-when-covid-19-struck-2020-07-25", "published": 1595788100.0, "headline": "This week we'll learn the size of the hole the U.S. economy fell into when COVID-19 struck", "body": "There are good economic reports, there are bad ones, and in some rate cases there are ugly ones. This week, we get ugly. We will find out how deep a hole the U.S. economy fell into in the second quarter this year when non-essential businesses closed down in many parts of the U.S. and many workers sheltered at home to try to stop the spread of the coronavirus pandemic. The Commerce Department will release the Q2 GDP report at 8:30 a.m. on Thursday. \"We're looking for the worst postwar economic contraction in 62 years,\" said Sal Guatieri, senior economist at BMO Capital Markets. Economists polled by MarketWatch expect a contraction at a seasonally adjusted annual rate of 33% in the second quarter. That's much deeper than the previous worst-ever quarterly contraction of 10% seen in the first quarter of 1958. Economists think the economy rebounded in May and June as the lockdown of businesses ended and that there will be a rebound of growth in the third quarter that ends on Sept. 30, but Guatieri said the economy won't return to pre-pandemic growth levels until early 2022. \"There's going to be a more grinding recovery back to pre-virus levels.\" he said. And Jim O'Sullivan, chief U.S. macro strategist at TD Securities, is worried that the economy might contract again in the fourth quarter this year. \"It does look like on a monthly basis that things are starting to stall again,\" O'Sullivan said. The renewed outbreak of the coronavirus in Florida, Texas and Arizona, with COVID-19 cases now rising in 40 U.S. states, might dampen business activity and damage consumer sentiment. See: MarketWatch Coronavirus Recovery Tracker Expectations for a weak Q2 GDP report will cast a pall on the two-day Federal Reserve meeting on Tuesday and Wednesday next week. Fed Chairman Jerome Powell will talk with reporters at 2:30 p.m. after the second day of talks. Fed officials were aggressive in the early days of the crisis, cutting their policy interest rate to zero, buying bonds and mortgage-backed securities, and setting up loan programs designed to keep credit flowing in the economy. Officials have made clear they don't intend to raise interest rates until after the economy recovers. The central bankers are mulling other aggressive actions but no announcement is expected until the September meeting, at the earliest. Officials are holding off while waiting to gauge how the economy is likely to perform later this year. \"They want more clarity on where the economy is,\" said O'Sullivan. This week's U.S. economic calendar also features durable goods orders on Monday, the Case-Shiller national home price index Tuesday along with the Conference Board's consumer confidence index, weekly jobless benefit claims Thursday, and personal income and spending data on Friday. See also: U.S. Economic Calendar"}]}