{"article": [{"url": "https://www.marketwatch.com/story/virgin-airlines-announces-more-job-cuts-after-securing-a-16-billion-rescue-deal-2020-09-04", "published": 1599215300.0, "headline": "Virgin Airlines announces more job cuts after securing $1.6 billion rescue deal", "body": "U.K.-based Virgin Airlines on Friday announced it will let another 1,150 jobs go, after completing a £1.2 billion pound ($1.58 billion) rescue deal to help keep it afloat during the pandemic that has devastated the industry. Those job cuts will add to the 3,550 employees that have already been let go. Its rescue deal was approved by courts in the U.K. and the U.S. this week. The restructuring plan is based on a five-year business plan and hopes to return to profitability by 2022. The airline is controlled by holding company Virgin Atlantic Limited, which is 51% owned by The Virgin Group and 49% by Delta Air Lines DAL, +0.39%. The global airline industry has been hard hit by the coronvirus pandemic that has brought travel largely to a halt. Efforts to restart the tourism season in places such as Spain this summer proved chaotic, and many countries imposed quarantines on travelers coming back from that country and others as the virus has spread. Trans-Atlantic travel represents 70% of Virgin Atlantic’s network and the outlook for that segment “remains uncertain,” the company said, adding that “until travel returns in greater numbers, survival is predicated on reducing costs further and continuing to preserve cash.” “After the sacrifices so many of our people have made, further reducing the number of people we employ is heartbreaking but essential for survival. I truly hope that as demand returns, we will see many members of our team returning to us,” said Shai Weiss, chief executive officer of Virgin Atlantic, in a statement. Like many other countries, the jobs picture in the U.K. has been bleak, with 7.5 million furloughed or away from their jobs as of early August."}]}