{"article": [{"url": "https://www.marketwatch.com/story/apples-streaming-service-is-cheap-but-how-does-it-stack-up-against-amazon-netflix-and-disney-2019-09-11", "published": 1595152400.0, "headline": "NBCâ\u0080\u0099s Peacock is flying into the streaming wars â\u0080\u0094 how does it compare to Amazon, Netflix, Disney, Hulu, HBO Max and Apple?", "body": "Peacock is strutting into the crowded field of streaming services. The video subscription service launches Wednesday July 15 with tiered pricing that ranges from a free, ad-supported option to a $9.99 premium choice without commercials. Maybe the service is another feather in the cap for NBCUniversal and its parent company, Comcast CMCSA, -0.99%, but itâ\u0080\u0099s yet another choice for inundated consumers. Peacock will present hit television shows such as â\u0080\u009cParks and Recreation,â\u0080\u009d episodes from the â\u0080\u009cSaturday Night Liveâ\u0080\u009d vault, movies including â\u0080\u009cJurassic Parkâ\u0080\u009d and live sporting events. The coronavirus outbreak waylaid plans to stream the 2020 Toyko Olympics, which have been postponed until next year. But Peacock announced last week it will be offering more than 175 soccer matches in the 2020-2021 season for Englandâ\u0080\u0099s Premier League. It might sound like a good deal, but is Peacock flying to the front of the pack? In addition to Peacock, viewers also have AT&Tâ\u0080\u0099s T, -1.01% Â HBO Max, Netflix NFLX, +1.43%, Amazon AMZN, +3.01%, Disney DIS, +1.53%, Apple AAPL, +1.74% Â and Hulu. Experts have previously found that most families are willing to pay at most $50 a month for streaming services, typically paying for a maximum of three services. But B.J. Pichman, research manager at market research firm Comperemedia, said the pandemic has raised a number of questions about consumer streaming habits. One thingâ\u0080\u0099s for sure: the outbreak created more streaming subscribers across the industry, he said. But with stay-at-home orders relaxing and summer in full swing, Pichman wonders how many new streaming customers will stay on. Another question is whether customers in an uncertain economy will want to pay for an array of services, he noted. â\u0080\u009cThe pandemic will bring more people to streaming,â\u0080\u009d Pichman said. Some of those people will drop off, but many will stay, he said. â\u0080\u009cClearly, consumers are going to hit a subscription burnout point,â\u0080\u009d said James Willcox, senior electronics editors at Consumer Reports. But the pandemic could affect viewing habits two different ways, he said. Some cash-strapped subscribers might end services to save money. But others might be willing to spend a little more on other offerings because theyâ\u0080\u0099re not spending money going out to restaurants, concerts or movies. So the same question remains: what to watch and whatâ\u0080\u0099s the best bang for the buck? Hereâ\u0080\u0099s a look at the pros and cons. Peacock The pros: The new service from NBCUniversal comes in three versions. Thereâ\u0080\u0099s a free version with ads that will offer next-day access to certain current series, news and access to original content and a back catalogue that includes â\u0080\u009cLaw and Orderâ\u0080\u009d and the â\u0080\u009cSNL Vault.â\u0080\u009d In 2021, â\u0080\u009cThe Officeâ\u0080\u009d will come to Peacock from Netflix. The free version of Peacock alone has 13,000 hours of content and the premium versions will have over 20,000 hours, according to NBCUniversal. The Peacock Premium version, for $4.99, will add on extra content and the $9.99 comes ad-free. Peacock Premium has the 175 Premier League matches, though the free option will include the U.S. Open tennis tournament. Pichman said the service could be a nice beginner step for people who havenâ\u0080\u0099t seen what streaming can offer. â\u0080\u009cItâ\u0080\u0099s like streaming content for TV people,â\u0080\u009d he said. The cons: Part of the Peacock service is the capacity to stream live sports. This summer, that was supposed to included the 2020 summer Olympics in Tokyo. But organizers pushed the games back to 2021 due to the coronavirus pandemic. â\u0080\u009cThis was going to be their big tent pole. This hurts them a lot,â\u0080\u009d Pichman said. In his view, the $9.99 price tag for the premium version could be a little steep for the ad-free content thatâ\u0080\u0099s offered. Peacock also will not be available on Roku and Amazon Fire TV at the time of launch, according to the Wall Street Journal. HBO Max subscribers also currently canâ\u0080\u0099t watch on those platforms.HBO Max The pros: First of all, thereâ\u0080\u0099s HBO Max, HBO Now and HBO Go. Whatâ\u0080\u0099s the difference between them? HBO Max is a stand-alone streaming platform for customers, which, Pichman explained, will replace HBO Now. â\u0080\u009cIf youâ\u0080\u0099re a cord cutter and paying for HBO Now, now youâ\u0080\u0099re paying for HBO Max,â\u0080\u009d he said. HBO Go is the streaming platform for customers who already have the channel. For Pichman, HBO Maxâ\u0080\u0099s big allure is the content. Think of HBO Max as a â\u0080\u009cgrown up Disney Plus,â\u0080\u009d he said. Thatâ\u0080\u0099s because it will come right out of the gate with a range of time-tested shows, albeit some that skew darker than much of whatâ\u0080\u0099s on Disney. Thereâ\u0080\u0099s the unapologetically foul-mouthed â\u0080\u009cSouth Parkâ\u0080\u009d and streaming of DC superhero movies like the â\u0080\u009cBatmanâ\u0080\u009d franchise. The bleak, record-breaking â\u0080\u009cJokerâ\u0080\u009d will also be there. HBO Max also landed all of the â\u0080\u009cHarry Potterâ\u0080\u009d movies as well. The outlet has â\u0080\u009chuge well-known shows, arguably some of the best,â\u0080\u009d including TV icons like â\u0080\u009cThe Sopranos,â\u0080\u009d and more recent hits like â\u0080\u009cBig Little Liesâ\u0080\u009d and â\u0080\u009cSuccession.â\u0080\u009d It will also have classic shows like â\u0080\u009cThe Fresh Prince of Bel Air.â\u0080\u009d The cons: The price tag. HBO Max costs $14.99 a month. â\u0080\u009cWhen you look at the price across the competitive landscape, itâ\u0080\u0099s most expensive one,â\u0080\u009d Pichman said. Also, if an HBO Max subscriber wants to stream the service on their television via Roku or Amazon Fire, theyâ\u0080\u0099ll be out of luck for now, noted Willcox. Disney+ The pros: The Disney+ offering has everything from â\u0080\u009cStar Warsâ\u0080\u009d to â\u0080\u009cBambi.â\u0080\u009d â\u0080\u009cItâ\u0080\u0099s really great for families with children,â\u0080\u009d Pichman said. The service has 7,500 episodes from various Disney shows and 500 movies â\u0080\u0094 and thatâ\u0080\u0099s just the start, Pichman said. â\u0080\u009cTheyâ\u0080\u0099ve got a lot of runway with those series to do a lot of spin-offs,â\u0080\u009d Pichman noted. Earlier this month, Disney released the film version of the blockbuster Broadway musical â\u0080\u009cHamilton.â\u0080\u009d See also:Before you sign up for Disney+, this calculator adds up the â\u0080\u0098trueâ\u0080\u0099 cost of your streaming services The cons: Disney has a lot of offer, thatâ\u0080\u0099s for sure. But itâ\u0080\u0099s still just one service, Pichman noted. â\u0080\u009cThey donâ\u0080\u0099t have everything. Itâ\u0080\u0099s one house.â\u0080\u009dApple TV+ The pros: â\u0080\u009cThe upside is going to be completely fresh and exclusive content,â\u0080\u009d Pichman said. Not only that, it will probably look pretty slick too, he said â\u0080\u0094 â\u0080\u009ctypical Apple high production values.â\u0080\u009d Big names like director Steven Spielberg and actors Steve Carell and Jennifer Aniston signed on for projects, he noted. (Though come critics were pretty rough on Carrell and Anistonâ\u0080\u0099s â\u0080\u009cMorning Show.â\u0080\u009d) The video service went live Nov. 1, while a gaming service for another $4.99 a month started Sept. 19. Its monthly cost is $4.99. The cons: Thereâ\u0080\u0099s not really much of a back catalog of shows and movies to pick from â\u0080\u0094 not yet at least. All streaming services showcasing original content will be facing challenges in the coming months because the pandemic has put a halt on productions, Pichman noted. And that could especially crimp a platform like Apple, he added.Hulu The pros: â\u0080\u009cHuluâ\u0080\u0099s got a lot of content. Theyâ\u0080\u0099ve got a pretty great back catalog of old television programs,â\u0080\u009d he said. That includes past hit shows like â\u0080\u009cBobâ\u0080\u0099s Burgers,â\u0080\u009d â\u0080\u009cFamily Guyâ\u0080\u009d and â\u0080\u009c30 Rock.â\u0080\u009d And itâ\u0080\u0099s pretty quick to post current prime-time programming. â\u0080\u009cFor the cord cutter, they are not really missing out on any broadcast TV,â\u0080\u009d he said. The cons: â\u0080\u009cOriginal programing is pretty sparse right now,â\u0080\u009d noting that original shows like â\u0080\u009cThe Handmaidâ\u0080\u0099s Taleâ\u0080\u009d are few and far between, in his view. And then there are the commercials that viewers have to watch on the basic plan, which could actually be a pro or a con. â\u0080\u009cIf you donâ\u0080\u0099t mind the commercials, itâ\u0080\u0099s a very competitive price,â\u0080\u009d Pichman said. Netflix The pros: Choice, choice, choices. Thereâ\u0080\u0099s the catalog of Hollywood movies and televisions shows â\u0080\u0094 to be filled with â\u0080\u009cSeinfeldâ\u0080\u009d episodes starting next year â\u0080\u0094 and all the original programming like â\u0080\u009cStranger Things,â\u0080\u009d â\u0080\u009cBlack Mirrorâ\u0080\u009d and â\u0080\u009cOrange is the New Black.â\u0080\u009d â\u0080\u009cNetflix still has a lot of content,â\u0080\u009d and itâ\u0080\u0099s pouring money into creating even more, Pichman said. See also: Itâ\u0080\u0099s not your imagination â\u0080\u0094 Netflix doesnâ\u0080\u0099t have as many movies as it used to The cons: â\u0080\u009cNetflix is starting to look expensive in comparison,â\u0080\u009d Pichman said. While the Netflix basic plan is $8.99, the premium one is $15.99 a month. And some of the new programming coming out now leaves Pichman a little underwhelmed. â\u0080\u009cThe content coming out now feels a little rushed,â\u0080\u009d he said. Amazon Prime Video The pros: â\u0080\u009cThe fact you get it for free with Prime membership is fantastic,â\u0080\u009d said Pichman. And thereâ\u0080\u0099s also some good shows on there as well, he noted â\u0080\u0094 that includes shows like â\u0080\u009cTransparent,â\u0080\u009d the â\u0080\u009cJack Ryanâ\u0080\u009d series, and â\u0080\u009cThe Marvelous Mrs. Maisel.â\u0080\u009d The cons: â\u0080\u009cIt feels like a benefit for Amazon Prime people that most people donâ\u0080\u0099t know they have,â\u0080\u009d he said. There are certainly some hits on the programming, but there are misses too. â\u0080\u009cIt feels random,â\u0080\u009d Pichman said of the array of shows and movies. And while $119-a-year Amazon Prime memberships have their perks, they arenâ\u0080\u0099t for everyone. Comcast shares are down almost 8.5% this year compared to a 6.6% loss for the Dow Jones Industrial Average DJIA, +0.56% Â and a 1% decrease for the S&P 500 Index SPX, +0.87%. This story was updated on July 14, 2020."}]}