{"article": [{"url": "https://www.marketwatch.com/story/tesla-stock-rockets-higher-as-deliveries-crush-expectations-2020-07-02", "published": 1593689300.0, "headline": "Tesla stock rockets higher as quarterly sales crush expectations", "body": "Tesla Inc.’s massive stock rally continued Thursday after the Silicon Valley car maker easily topped sales expectations for the second quarter. Tesla TSLA, +1.89% said that it delivered roughly 90,650 vehicles in the second quarter, ahead of the 72,000 deliveries that analysts surveyed by FactSet had been predicting. Tesla’s actual delivery count, its proxy for sales, also came in comfortably above even the highest estimate tracked by FactSet, which was 86,000. The stock rose nearly 9%, trading as high as $1,228, putting it on track for another closing record. Tesla delivered 80,050 Model 3 and Model Y vehicles combined in the period, as well as 10,600 Model S and Model X vehicles in aggregate. The company announced that it produced 82,000 vehicles in the June quarter, though production in its main Fremont, Calif., factory was shut down for much of the quarter. Tesla’s factory there is now producing cars back at pre-pandemic levels, the company said. Read: Some workers complain Tesla has threatened firings if they don’t return to work “In our opinion, a 90,000 delivery number in this COVID lockdown environment is a jaw dropper and the bulls will run with this as a potential paradigm changer moving ahead,” Wedbush analyst Daniel Ives wrote after the delivery numbers came out, calling the numbers a “major home run.” His research indicates that China “appeared to be the star of the show” in the second quarter, though Tesla didn’t provide any regional breakdowns in its release. Prior to Tesla’s delivery report, Ives upped his price target on the stock to $1,250 from $1,000, even while maintaining a neutral rating. He also said that his bull case target is now $2,000. Don’t miss: These stocks, including Tesla and Apple, are the real winners for the second quarter of 2020 Analyst Garrett Nelson at CFRA increased his price target on Tesla shares by $400 to $1,100, implying 10% downside. Tesla was likely sitting on high inventory at the end of March, which contributed to the stronger-than-expected sales total, he said in a note. Garrett kept his hold rating on the stock. The market is giving Tesla “ample credit for future cash flow growth and (we) are reluctant to recommend purchase of the shares at these levels,” he said. Joseph Spak of RBC Capital also struck a more cautious note, seeing “signs of trouble” for Tesla’s older vehicle models and in markets where Teslas are not a novelty anymore. “Yes, (Tesla) was able to show good headline numbers relative to an auto industry that really felt impact of COVID-19,” he said. But Tesla benefited from entering China, where it had previously sold cars but started making cars only this year. “This of course, counts as growth, and new markets/products is part of the Tesla story,” but assuming about 30,000 Model 3s made in China, then that means that Model 3 and Model Y sales in the rest of the world, mainly mature markets such as North America and Europe, were down about 36% on the year, he said. “And, recall, there were North America/Europe price cuts on the (Model 3) this quarter, a move we generally view as one to stimulate demand. So once again we see some evidence that a Tesla product matures quickly after entering a market and pent-up demand is satisfied,” Spak wrote in the note. “Credit where credit is due to Tesla — but perhaps the most amazing thing about (Tesla) stock is the power of the narrative,” he said. Tesla’s quarterly deliveries “are further evidence that Tesla has the auto industry backed into a corner,” Gene Munster of Loup Ventures, a former Wall Street analyst turned venture capitalist, said in a note. “It’s becoming more and more difficult to envision a scenario in which legacy auto makers will find a way to meaningful expand the small share of EVs that they have today.” General Motors Co. GM, -0.15% on Wednesday reported second-quarter sales that were down 34%, while Toyota Motor Corp.’s TM, -0.65% sales fell by about one-third and Fiat Chrysler Automobiles NV FCAU, -0.95% reported a 39% decline. Auto makers offered discounts and financing deals to lure buyers, but these weren’t enough to offset factory and dealership closures due to the pandemic. “Tesla is winning because they have a product that is measurably better than both gas and electric competitors,” Munster said. Concerns that Tesla would eventually run out of cash and would not be able to make cars at a scale have been “meaningfully diminished.” As Tesla reports second-quarter results, the concern that the company is structurally unprofitable will also fade away. Based on the Thursday’s sales numbers, the company is likely to report better-than-expected profit in a month or so, he said. One concern remains, Munster said: Stock valuation. “If Tesla can continue to capture 70-80% share of the US EV market, we expect shares to remain richly valued and continue higher given the vast market potential,” he said. Tesla shares have rallied nearly 150% over the past three months and they’ve gained 400% over the past 12 months. The S&P 500 SPX, +0.87% is up 23% over a three-month span and 4.8% over the past year."}]}