{"article": [{"url": "https://www.marketwatch.com/story/deutsche-bank-goldman-and-jp-morgan-top-commercial-real-estate-finance-despite-covid-19-cracks-11602250715", "published": 1602237440.0, "headline": "Deutsche Bank, Goldman and JP Morgan top commercial real estate finance, despite COVID-19 cracks", "body": "The Manhattan skyline Spencer Platt/Getty Images Several Wall Street banks have come to dominate a corner of U.S. commercial real estate finance over the past seven months, even as the coronavirus pandemic has cast a long shadow over the market. Deutsche Bank DB, -0.85%, Goldman Sachs GS, -0.21% and JP Morgan Chase JPM, -0.57% each significantly grew their share of the roughly $550 billion commercial mortgage-backed securities (CMBS) market during the pandemic, according to a new report by Deutsche’s research arm. The CMBS market is a type of property finance where Wall Street banks make loans on hotels, skyscrapers, and other types of commercial buildings to package into bond deals that investors buy. This chart shows which Wall Street banks won — and lost — market share since the pandemic took hold in the U.S. COVID-19 Shake up Deutsche Bank Research, Index data Researchers categorized loans as pre-COVID from January to March, but as post-COVID as of April. Loans made by more than one bank went into the “other” category. By those metrics, Deutsche, long a major player in U.S. commercial real estate finance, ranked as the top lender in the sector, with a 20% market share of the “COVID-19” lending pie. Deutsche Bank has been a key financier of the sprawling Hudson Yards complex development on Manhattan’s far West Side, as well as a long time lender to President Donald Trump and his son-in-law Jared Kushner‘s real estate company. Goldman Sachs ranked second with a 18% lending share during the pandemic and JP Morgan third with a 15% slice. Deutsche Bank declined to comment. Goldman and JP Morgan did not respond to requests for comment.Eye on commercial real estate Investors have been looking forward to major banks providing an update on their commercial real-estate exposure for clues about the shape of the broader economy, when the third-quarter U.S. corporate earnings reporting season kicks off next week. See: Investors expect banks to kick off better Q3 earnings, but fear stimulus bridge for U.S. economy is crumbling Wall Street banks like CMBS financing because proceeds from bond sales can be used to make new loans, but also because the risks of a borrower defaulting also mostly sits with bond investors. Regulations introduced after the 2008 financial crisis have kept Wall Street lending partially in check, particularly after CMBS grew to a near $750 billion part of the bond market in 2007, and was hit by mass credit-rating downgrades during the global financial crisis. This Morgan Stanley chart shows the breakout of the near $3.8 trillion U.S. commercial real estate debt sector by lender. CRE debt by lender Morgan Stanley “It’s really a situation where the market has adapted to the circumstances,” said David Pascale Jr., a senior vice president at real estate adviser George Smith Partners in Los Angeles, about the CMBS market. As an example, he pointed to how many grocery stores, restaurants and retailers have embraced curbside delivery. Lenders and property owners also now have nearly a year’s worth of pandemic data to know if a property’s rents have gone up or down. “Lenders can’t underwrite a movie theater or gym right now, but they like grocery and drug stores,” Pascale said. And there’s still competition when lending on apartment buildings and industrial properties, as well as select retail and office projects. “The good news is that if you have a loan that qualifies for CMBS, your rate is something like 3% to 3.5%,” he said. Meanwhile, cracks in commercial real estate prices have been a concern during the pandemic, as more property owners struggle to stay current on their mortgages. Because property bondholders receive monthly updates, the CMBS market can serve as an early warning shot when stress might be building up more broadly in commercial real estate. The sector also has a “first stop” for borrowers facing problems keeping up on their debt on a building, called “special servicing,” where lenders begin to hash out a strategy for the property. About 10.5% of all CMBS loan were in special servicing in September, up from 2.8% in March, according to Trepp, a platform that tracks performance in the sector. But here’s the bottom line. Morgan Stanley analysts this week pointed out that commercial real-estate prices now stand 31% above the prior August 2007 peak, at a time when the pandemic has created “the greatest threat” to commercial real estate since the global financial crisis. Their base case calls for a 15%-20% decline in valuations, but their worst case is for a 25%-30% drop."}]}