{"article": [{"url": "https://www.marketwatch.com/story/fedex-standout-quarter-in-tough-conditions-boost-stock-to-best-gain-since-1986-2020-07-01", "published": 1593606200.0, "headline": "FedEx standout quarter in 'tough conditions' boost stock to best gain since 1986", "body": "Wall Street heaped praise and a stock-rating upgrade on FedEx Corp. on Wednesday, after the delivery and logistics company surprised investors with a better-than-expected quarter despite the drying out of its more profitable business deliveries business amid the coronavirus pandemic. Shares of FedEx FDX, +0.18%  rallied more than 14% on Wednesday, putting them on track for their best one-day percentage gain since September 1986, when the company shed its ZapMail faxing service after losing millions with the venture. A close around current levels would be the highest in six months. FedEx late Tuesday reported a fiscal fourth-quarter adjusted profit of $2.53 a share on sales of $17.4 billion. Analysts polled by FactSet had expected FedEx to report adjusted earnings of $1.58 a share on sales of $16.4 billion. Going in, Wall Street was worried business-to-consumer deliveries wouldn't be enough to make up for the halt in business-to-business deliveries, which are more profitable and were plentiful before worldwide shutdowns related to the pandemic. Don't miss: FedEx stock soars as online shopping sprees boost company's quarterly results. The quarter was \"severely affected\" by the COVID-19 pandemic, the company said, but the surge in business-to-consumer deliveries, with tweaks to improve profit margins, offset higher costs and other pandemic-related headwinds. Volumes for its FedEx Ground business grew 25% year-over-year. Analysts at J.P. Morgan, led by Brian Ossenbeck, raised their rating on FedEx stock to their equivalent of buy, pinning the upgrade on the \"solid EPS beat in tough conditions.\" FedEx Ground enjoyed better margins and the Express service weathered the collapse in business-to-business deliveries better than anticipated, the analysts said in a note Wednesday. Fiscal 2020 may be a \"throwaway\" year but FedEx is reaping the benefits of having invested in improvements with the Ground business, analysts with Raymond James said in their note. FedEx \"will weather the (admittedly) severe impacts from the coronavirus (and) we see limited further downside at current levels, though we are keeping a close eye on the macro,\" the Raymond James analysts said. The better margins for FedEx Ground were at the core of the quarterly beat, alongside resurfacing demand from Asia, Helane Becker at Cowen said. \"Accelerating macro trends are working in FedEx's favor, though uncertainty looms with the overall economy,\" she said. UBS analysts lifted their price target on FedEx to $181, from $158, implying a 29% upside for the shares. Fourth-quarter expectations were a \"low bar\" to clear as estimates were falling in recent weeks and investors had low expectations for the quarter, but FedEx cleared it and in the process showed Wall Street \"the spread in profitability between their B2C and B2B business is likely not as wide as perceived.\" Shares of FedEx have gained 5% year to date, contrasting with a loss of around 4% for the S&P 500 SPX, +0.87%  and the Dow Jones Industrial Average's DJIA, +0.56% decline of about 9%."}]}