{"article": [{"url": "https://www.marketwatch.com/story/trump-blasts-democratic-demands-for-postal-service-money-saying-mail-in-voting-would-be-fraudulent-2020-08-13", "published": 1597330460.0, "headline": "Trump blasts Democratic demands for postal-service money, saying mail-in voting would be â\u0080\u0098fraudulentâ\u0080\u0099", "body": "“ â\u0080\u0098They want $3.5 billion for something that will turn out to be fraudulent. They want $3.5 billion for the mail-in votes, OK. Universal mail-in ballots. They want $25 billion for the post office. Now they need that money in order to have the post office work, so it can take all of these millions and millions of ballots. Now in the meantime they arenâ\u0080\u0099t getting there. By the way, those are just two items, but if they donâ\u0080\u0099t get those two items, that means you canâ\u0080\u0099t have universal mail-in voting, because theyâ\u0080\u0099re not equipped to have it.â\u0080\u0099 ” â\u0080\u0094 President Donald Trump Those comments above came from President Donald Trump on Thursday, as he again delivered criticism of the U.S. Postal Service and mail-in voting. Trump made his remarks during a Fox Business Network interview, when he was asked about the issues preventing a deal with Democratic lawmakers on another coronavirus relief package. â\u0080\u009cYouâ\u0080\u0099ve seen how bad itâ\u0080\u0099s been with this Carolyn Maloney scam,â\u0080\u0099â\u0080\u009d Trump also said, referring to a Democratic primary election in New York between Maloney, a veteran Democratic congresswoman, and her challenger, Suraj Patel. Trump alleged that she â\u0080\u009cprobably lost, but they said, â\u0080\u0098Mail-in ballots â\u0080\u0094 itâ\u0080\u0099s all mixed up.â\u0080\u0099â\u0080\u009d Election officials in New York last week declared Maloney the winner. During the interview, the president also reiterated his past claims that the stock market SPX, +0.87% Â DJIA, +0.56% Â would crash if Democratic challenger Joe Biden wins the White House race in November. Trump has spent months bashing mail-in voting, though he did change his tune on the topic this month when it comes to the swing state of Florida. Related:â\u0080\u0098The Postal Service is a jokeâ\u0080\u0099: Trump threatens to block loan if agency doesnâ\u0080\u0099t raise prices House Speaker Nancy Pelosi criticized Trump following his remarks. â\u0080\u009cThe president says heâ\u0080\u0099s not putting up any money for absentee voting, and heâ\u0080\u0099s not putting up any money for the Postal Service â\u0080\u0094 undermining the health of our democracy,â\u0080\u009d the California Democrat told reporters on Thursday. Biden also responded to Trumpâ\u0080\u0099s comments. â\u0080\u009cPure Trump. He doesnâ\u0080\u0099t want an election,â\u0080\u009d the former vice president said. From the archives:Trump pressured U.S. postmaster general to jack up shipping rates for Amazon Trumpâ\u0080\u0099s new postmaster general, Louis DeJoy, recently disputed reports that his agency is slowing down election mail or any other mail and said it has â\u0080\u009cample capacity to deliver all election mail securely and on timeâ\u0080\u009d for the November election. DeJoy, a major Trump donor, also has drawn criticism for sidelining two dozen USPS officials, and he is facing scrutiny for maintaining a stake in his former company, which is a USPS contractor, and for buying stock options in Amazon.com Inc. AMZN, +3.01%, a key USPS customer."}]}