{"article": [{"url": "https://www.marketwatch.com/story/we-are-filling-the-stockpile-in-anticipation-of-a-possible-problem-in-the-fall-government-preparing-for-coronavirus-second-wave-2020-06-22", "published": 1592869820.0, "headline": "â\u0080\u0098We are filling the stockpile in anticipation of a possible problem in the fallâ\u0080\u0099: Government preparing for coronavirus second wave", "body": "The Trump administration is preparing for another round of coronavirus in the fall. â\u0080\u009cWe are filling the stockpile in anticipation of a possible problem in the fall,â\u0080\u009d White House trade adviser Peter Navarro told CNNâ\u0080\u0099s â\u0080\u009cState of the Unionâ\u0080\u009d show on Sunday. â\u0080\u009cWe are doing everything we can beneath the surface, working as hard as we possibly can.â\u0080\u009d He added, â\u0080\u009cYou prepare for what can possibly happen. Iâ\u0080\u0099m not saying itâ\u0080\u0099s going to happen, but of course you prepare.â\u0080\u009d “ â\u0080\u0098We are filling the stockpile in anticipation of a possible problem in the fall.â\u0080\u0099 ” â\u0080\u0094 White House trade adviser Peter Navarro The U.S. cannot afford to have a resurgence of the virus either now or in the fall, health professionals say. For one, itâ\u0080\u0099s harder to get people to practice social distancing and stay home again, especially after theyâ\u0080\u0099ve already abided by stay-at-home orders since mid-March. Secondly, the effect on the economy could push the U.S. into a prolonged recession. Thirdly, the flu season will already be upon us in the winter and flu symptoms are easily confused with those of COVID-19. Fourthly, only 10% to 20% of the U.S. population at the very most will be immune to COVID-19 next time around. During the great influenza pandemic of 1918, the second wave was worse than the first, partly due to a more virulent strain of the virus. The Organization for Economic Cooperation and Development released its twice-a-year economic outlook earlier this month, and presented two scenarios â\u0080\u0094 one where the coronavirus continues to recede, and another where a second wave of rapid contagion erupts later in 2020. It said a second wave of SARS-CoV-2 is as likely as not. Related:5 critical mistakes that created the biggest public-health crisis in a generation Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases for three decades and one of the leading experts on the pandemic in the U.S., said this month that a second wave was not inevitable, but he has also noted that the outbreak is far from over. â\u0080\u009cIn a period of four months, it has devastated the whole world. And it isnâ\u0080\u0099t over yet.â\u0080\u009d He added, â\u0080\u009cWhere is it going to end? Weâ\u0080\u0099re still at the beginning of it.â\u0080\u009d While COVID-19â\u0080\u0099s progress has slowed in major cities such as New York, confirmed coronavirus cases have risen by double-digit percentages in half-a-dozen states over the last week, and cases have risen by double-digit percentages in over a dozen states since Memorial Day. Four states have seen cases rise by nearly 4,000 on a daily basis. Many epidemiologists advise more caution when talking about the reduced prospect of a second wave. MarketWatch photo illustration/Getty Images Scientists are worried by large protests across the country, and by the rally President Trump held in Tulsa, Okla. over the weekend where most people did not wear masks. Asymptomatic transmission â\u0080\u009cis the Achillesâ\u0080\u0099 heel of COVID-19 pandemic control through the public-health strategies we have currently deployed,â\u0080\u009d according to a May 28 editorial in the New England Journal of Medicine. Letter from New York:â\u0080\u0098When I hear an ambulance, I wonder if thereâ\u0080\u0099s a coronavirus patient inside. Are there more 911 calls, or do I notice every distant siren?â\u0080\u0099 The editorial, by researchers Monica Gandhi, Deborah Yokoe and Diane Havlir at the University of California, San Francisco, referred to recent study of a coronavirus outbreak at a skilled nursing facility, which concluded that epidemiologic evaluations of COVID-19 outbreaks within skilled nursing facilities â\u0080\u009cstrongly demonstrate that our current approaches are inadequate.â\u0080\u009d The Dow Jones Industrial Index DJIA, +0.56% Â and the S&P 500 SPX, +0.87% Â ended slightly higher Monday, as investors weighed progress in COVID-19 vaccine research amid fears of a surge of coronavirus in U.S. states that have loosened restrictions, and as the number of confirmed COVID-19 cases continues to rise. The COVID-19 pandemic, which was first identified in Wuhan, China in December, had infected 9,074,624 people globally and 2,291,353 in the U.S. as of Monday. It had claimed at least 471,640 lives worldwide, 120,393 of which were in the U.S., according to Johns Hopkins Universityâ\u0080\u0099s Center for Systems Science and Engineering."}]}