{"article": [{"url": "https://www.marketwatch.com/story/how-do-you-know-when-youre-old-2020-08-26", "published": 1598451560.0, "headline": "How do you know when youâ\u0080\u0099re old?", "body": "When does someone hit â\u0080\u009cold ageâ\u0080\u009d? And what does it actually mean to be â\u0080\u009coldâ\u0080\u009d? Those were some of the questions Nathan Yau, a statistician who runs data analysis site FlowingData, posed in a recent post. Yau said the definition of â\u0080\u009cold ageâ\u0080\u009d is loose â\u0080\u0094 some people say it depends on gender, others by aesthetics â\u0080\u0094 but if we assume it is around 65 years old, in line with Medicare eligibility, then people are â\u0080\u009coldâ\u0080\u009d longer now than ever before. 80% of older Americans can't afford to retire - COVID-19 isn't helping Nearly a century ago, it was uncommon to find people who lived past 65 years old. Half of males saw their 65th birthday and 57% of women did, whereas today, men, on average, spend 11 years in â\u0080\u009cold ageâ\u0080\u009d and women get 16 years. See: More Americans are worried about retirement now â\u0080\u0094 and their plans have changed Naturally, the survival rate of people in 2020 dips at 50 years old and continues on the decline until it flatlines at around 100 years old, but itâ\u0080\u0099s a steady decrease into their 60s, 70s and even 80s. Nathan Yau Another way to define old age would be to link it to life expectancy, Yau said, citing research from a report about human life expectancy and aging. Doing so would keep someone â\u0080\u009coldâ\u0080\u009d for the same amount of time, but it would help people plan for their future and retirement. Instead of tagging the description to a specific age, people who will naturally live longer can plan for old age to come later. Life expectancy is a crucial aspect of retirement planning, even if it is difficult to determine. When someone has a rough idea of how long she will live, she can estimate how much money she needs to last her lifetime as well as how to spend it down in a timely fashion so she doesnâ\u0080\u0099t have too much or too little left before she dies. Also see:Will this group of workers outpace you? Actually, maybe Americans are living longer, and theyâ\u0080\u0099re healthier for longer, which means they work later in life. Of course, thatâ\u0080\u0099s not the case for everyone, depending on their medical history, familial responsibilities and if theyâ\u0080\u0099re working physically demanding jobs. Still, associating retirement with a fixed age, like 65, isnâ\u0080\u0099t always the best way to plan for this next stage of life, especially with many people working well into their 60s and 70s. Yau has also written about â\u0080\u009cfinding the new age for your age,â\u0080\u009d in light of society considering older people younger (â\u0080\u009c50 is the new 40,â\u0080\u009d for example). He looked at current and historical mortality data, and attempted to determine a new age for a personâ\u0080\u0099s current age. After using birth decades for comparison between men and women, he concluded the median difference between a personâ\u0080\u0099s actual age and â\u0080\u009cnew ageâ\u0080\u009d is about nine years. But that estimate changes depending on the decade being compared with 2020. For example, a 50-year-old in 2020 would be the â\u0080\u009cnew 38â\u0080\u009d of 1950 but the â\u0080\u009cnew 44â\u0080\u009d of 1980. You can see yours here."}]}