{"article": [{"url": "https://www.marketwatch.com/story/i-have-student-debt-a-mortgage-a-growing-family-and-im-relocating-for-work-how-do-i-save-for-retirement-2020-07-07", "published": 1594484240.0, "headline": "I have student debt, a mortgage, a growing family and I'm relocating for work - how do I save for retirement?", "body": "Dear MarketWatch, My wife and I are wondering how to begin growing our wealth. I am 34 and make $96,000, she is 33 and makes $45,000. We have a 1.5 year old at home and plans for another in the near future. I have around $37,000 in student loans left and we just opened a 30-year mortgage a year ago. We have $15,000 in a traditional savings account, I have a pension through public education, and she has a 401(k) with around $20,000 in it from an old job and another one with a few thousand in it she opened a year ago. She also has a Roth IRA a family member opened for her recently with $5,000. To muddy the waters, I will be searching for a new job next year which will mean a move with all the trappings (new mortgage, etc.), that will put me somewhere around $130,000. She is planning to stay home with the kids for a few years or work part time, if possible. Our total take home/spending difference averages around $1,000 each month that we can save, invest or put toward debt. The student loan has a 5.625% interest rate but is suspended right now because of the CARES Act. The payment is $242 a month. Our mortgage balance is $192,000 and that monthly payment is $1,427 but we pay a little extra each month. We'd love to refinance but the closing costs aren't worth it since we are likely selling it next spring or summer. We got a good deal in a seller's market in our Nebraska town and did some minor upgrades to the house. I realize after two years of interest, initial closing costs, maintenance, etc. we will still probably be losing money on this house, but I'm optimistic we will walk away with at least $20,000 cash when the sale is complete. My biggest concern is purchasing another house next summer and how to balance that with paying off this student loan and starting to save for retirement. Should we just sit tight and squirrel money away for a down payment rather than trying to invest in the current uncertain market? I'm nervous to tie a lot of it into retirement accounts that I can't touch, as well, even though I'm tempted to open a Roth IRA for myself and fully fund it for 2019 given the extended tax deadline this year. Doing that right now would leave us less than $10,000 in liquid cash. Thanks again, B.C. See: I have a seven-figure nest egg - am I saving too much for retirement? Dear B.C., First, a congratulations is in order - you've got money in the bank, you're paying extra toward your mortgage, you've got some retirement savings already stashed away as well as a pension and you're focusing on your finances. That's all great stuff. There are a lot of moving parts to this question but you're certainly not alone - many people in their 20s, 30s and beyond worry about how to save for retirement while they're juggling so many other present-day financial responsibilities, such as paying down student debt, starting a family, paying for child care and enjoying their lives at least a little bit. The good news is: You can, and should, still be putting money away for retirement, but financial advisers had a few other suggestions for you first. Ideally, you should start by beefing up your emergency savings. I know that probably sounds overwhelming considering you're talking about your mortgage, student debt and retirement savings, but because you expect to do so much within the next year or so, having more in your emergency savings will pay off. The $15,000 is a good start, which means you won't have to dedicate all of your extra cash flow to this type of account, but advisers suggest you have at least three months' worth of expenses - and probably closer to six months if your wife will be staying home for a few years, said Mary Beth Storjohann, chief marketing officer and partner at Abacus Wealth Partners. She suggests splitting that extra $1,000 so that half of it goes toward an emergency savings. The other half can go to a Roth individual retirement account, which, if you dedicated the $500 a month for a full year you'd hit the maximum contribution limit of $6,000 (also depending when you start contributing and if you make the final payment for that tax year by Tax Day). A hearty emergency savings account might seem boring or unnecessary, but especially in this moment of time, it's crucial. \"In this environment, nobody's job is safe,\" said Peter Palion, a financial adviser and founder of Master Plan Advisory. So many people have lost their jobs, suffered a reduction in wages or had unexpected expenses as a result of the current crisis that made them financially vulnerable. As for your student loans, you might have some options. Because you are in public education, you may qualify for student loan forgiveness. There are a few types, including one specifically for teachers who worked full time for five complete and consecutive years in a low-income elementary or secondary school. The program would forgive up to $17,500 on your loan. Here's more on that. Although that sounds like a dream, public service forgiveness loans haven't always worked for everyone - so you might want to keep tackling these debts as you go. You don't want to put that debt repayment off just to find out you didn't qualify because of some paperwork loophole. There are a lot of questions surrounding your relocation and potential new job, and some of them you may not even know the answers to yet. You should consider factors such as: what your current home will sell for, how much your future home will cost, the fees associated with both of those transactions and the unexpected costs during and after the move. This is yet another reason why you should focus on building up your liquid cash reserve, Palion said. Also, when you make that job switch, remember to look through employee benefits. Higher salaries are great, but you should also dive into health care coverage and retirement account benefits, Storjohann said. Staying at home to take care of the family is a hard job, and that transition will also affect your finances. If you ended up earning $130,000 but your wife stopped working for now, you'd actually see a loss of income around $10,000 a year. You and your wife should talk through that possibility and the finances that will come along with that scenario. The first few conversations should be around the logistics of these changes, Storjohann said. \"From there, once you shape your goals, it's like building your own financial plan,\" she said. Plan to meet on a monthly or biweekly basis to understand the household's spending and saving as you pursue these goals and then eventually achieve them. Create a financial spreadsheet or statement where you can update your numbers every six months, so that you clearly understand where your money is going, how it's working for you and where you can go from there. And even while your wife is staying at home with the kids, she can still be contributing to a retirement plan through a spousal IRA. A recent study found families don't often account for the nonworking spouse when relying on one income for retirement savings. What one does with old employer-sponsored plans is usually a personal preference, but she may want to consolidate her old 401(k) plan into her current plan or eventually roll them over into an IRA. The key in this particular situation however is to ensure she is getting the same high quality fund options (if not better) and low management fees. Also see: I'm a 32-year-old stay-at-home mom, and my husband earns $150,000 a year. Will I ever be able to enjoy a retirement? Saving for college is important for families, but it probably shouldn't be prioritized before retirement. \"Yes, they should be thinking about college funds but not at the expense of their retirement,\" said Juan Ros, a financial adviser at Forum Financial Management. For retirement, \"there are no loans you can get, no scholarships - it is just whatever you have.\" If you want to dedicate some of your extra cash flow to college savings, though, a 529 plan would be a good start. And it doesn't hurt if you are expecting a second child soon. \"With one child, it is going to be expensive,\" Palion said. \"With two, it is going to be twice as expensive.\" If you start with $50 a month, you'll have a \"pretty sum of money\" in 18 years, Palion said. Comparatively, if you started saving farther down the road, you'd have to hike up your contributions substantially to make up for the lost time. There are also other types of accounts, including Coverdell, custodial accounts and savings bonds. Here's a breakdown of some of the pros and cons of each avenue. There are a few tasks you should also consider, though you didn't mention them here, Ros said. Because you have a young family, and there is the possibility that they will rely on you for their major source of income, you should look into an estate plan, such as a will or trust depending on your state's rules. You and your wife should also get powers of attorney, so that you can dictate who your children's guardians are. And while you may have group life insurance through your employer, you should consider some type of term life insurance with a policy of at least $1 million, Ros said. At your age, that policy should be relatively cheap. Although it will cost a few thousand dollars most likely, getting these affairs in order would protect your family in the event something happened. As for your question regarding how to save for retirement: Having a pension through your public education job is a huge win, advisers said. You may also have access to a 403(b) plan, and if you do, you should consider contributing to it - especially if there is some sort of employer match. Your wife won't be able to participate in her 401(k) plans once she stops working at those jobs, but you both can work on investing in IRAs. There are traditional IRAs, which are funded with pretax dollars, and Roth IRAs, which are funded with after-tax dollars. There are advantages to both types of accounts, though it also doesn't hurt to diversify so that you have options in retirement to save on taxes. You definitely have a lot going on but you're on the right path. Have a question about your own retirement savings? Email us at HelpMeRetire@marketwatch.com."}]}