{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-death-toll-tops-201000-as-daily-tally-more-than-doubles-2020-09-23", "published": 1600876220.0, "headline": "Coronavirus update: U.S. death toll tops 201,000, as daily tally more than doubles", "body": "The number of deaths in the U.S. as a result of the coronavirus that causes COVID-19 surged past the 200,000 mark, while the global count climbed closer to 1 million, while Johnson & Johnson provided a dose with regards to its vaccine candidate. The sobering climb in the nation’s death toll comes while President Donald Trump continues to tout his administration’s handling of the pandemic at a largely maskless campaign rally in Pennsylvania. He also mocked presidential candidate Joe Biden for wearing masks, even as his administration’s health experts urged all Americans to wear face coverings to guard against the spread of the deadly contagion. The U.S. recorded at least 942 new coronavirus deaths on Tuesday, more than double the 428 deaths recorded the day before, even as the daily new case tally fell to 37,293 from 54,874. The new case tally was 10%, below the average of 41,490 cases a day over the past week, which was a 13% increase from the average two weeks earlier, New York Times data show. In total, the U.S. case tally rose to 6,921,817 while the death toll climbed to 201,459, according to data aggregated by Johns Hopkins University, both by far the highest numbers in the world. Globally, cases grew to 31717,955 and deaths rose to 973,176. In the U.S., 21 states are showing increases in new cases in the past week, according to JHU data. Among those states, those with the highest new daily counts are Texas at 6,885, Wisconsin at 1,672, Oklahoma at 1,164, New York at 754 and Colorado at 654. There are 29 states in which at least 5% of COVID-19 tests are positive, led by Arkansas at 20.7%, South Dakota at 17.9%, Idaho at 17.5%, Wisconsin at 17.3% and Iowa at 15.8%. According to the World Health Organization, positivity rates should remain below 5%. The New York Times Concerns over the potential effects of a rise in cases and deaths, as the pandemic carries on until the fall and winter months, spilled over onto Wall Street, as the Dow Jones Industrial Average DJIA, +0.56% tumbled 496 points, or 1.8%, and the S&P 500 index SPX, +0.87% slid 2.1%. Boston Federal Reserve President Eric Rosengren said he was less optimistic about the economic outlook than his colleagues. “I am concerned that a second wave of COVID-19 infections this fall and winter is likely, which could cause some states to impose new restrictions on mobility and face-to-face interactions,” Rosengren said, as MarketWatch’s Greg Robb reported. On the bright side, J&J JNJ, +1.39% said it launched a pivotal global Phase 3 trial of its COVID-19 vaccine candidate being developed by its Janssen Pharmaceutical subsidiary. The randomized, double-blind, placebo-controlled trial is studying the safety and efficacy of a single vaccine in up to 60,000 adults. There are now four experimental coronavirus vaccine candidates in late-stage studies, including candidates developed by AstraZeneca PLC AZN, +1.16% AZN, +0.63% and the University of Oxford, BioNTech SE BNTX, +1.23% and Pfizer Inc. PFE, -0.27%, Moderna Inc. MRNA, +0.09% and J&J. There are others in earlier-stage trials. Don’t miss: There are seven coronavirus vaccine candidates being tested in the U.S.—here’s where they stand. Also read: Opinion: Everything you need to know about what it would take for the FDA to approve a COVID-19 vaccine. Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, told Congress Wednesday that he expects to see data from the Phase 3 trials, indicating whether those vaccines are safe and effective, by “November or December” of this year. Meanwhile, President Trump reportedly said at the Pennsylvania rally that a vaccine won’t only be developed, but distributed “very very shortly.” He also said that his early and aggressive actions saved millions of lives.In other news: • U.S. health regulators have drafted guidelines requiring any COVID-19 vaccine candidate to meet rigorous standards before gaining clearance, according to a report in The Wall Street Journal, in an effort to assure the public that vaccines will be safe. The guidelines come amid concerns among regulators that the Trump administration has put politics ahead of science, and have interfered in decisions of federal health agencies. • The University of Notre Dame has postponed this weekend’s football game with the Wake Forest University, after seven players on its roster tested positive for the coronavirus this week. • The Centers for Disease Control and Prevention has issued new guidelines for Halloween, listing activities that fall in the higher, moderate and lower risk categories. The CDC said a costume mask isn’t a substitute for a cloth mask, and should not be used unless it is made of two or more layers of breathable fabric. The CDC recommended avoiding both traditional door-to-door trick-or-treating and trunk-and-treating, in which treats are handed from trunks of cars lined up in parking lots. The CDC said going to an indoor haunted house, attending crowded indoor costume parties and hayrides or tractor rides with people not in your household are also high-risk activities. Some moderate-risk activities are one-way trick-or-treating, in which goody bags are wrapped individually for people to grab and go; small, outdoor, open-air costume parade in which people are more than 6 feet apart; and having an outdoor Halloween movie night with local family friends, with people spaced at least 6 feet apart—“If screaming will likely occur, greater distancing is advised.” Lower-risk suggestions include carving pumpkins with members of your household, decorating your home or living space, having a virtual costume party and doing a scavenger hunt where children are given Halloween-themed things to look for while they walk outdoors “admiring Halloween decorations” at a distance. • Italy has reportedly shut its borders with France, saying it will now require COVID-19 tests for those travelers. • As the U.K. settles in with new restrictions amid an increase in new cases, Prime Minister Boris Johnson suggested that the U.K. has a worse infection rate than Italy or Germany because it is a “freedom loving country.”COVID-19 leaders outside of the U.S. Brazil has the second highest death toll at 138,105 and third highest case tally at 4,591,364 million. India is third with 90,020 deaths and second with 5,646,010 million cases. Mexico is fourth with 74,348 deaths and seventh with 705,263 cases. The U.K. has 41,951 deaths and 412,240 cases, the highest death toll in Europe and fifth highest in the world. Italy had 35,758 deaths and 302,537 cases, while Germany had 9,423 deaths and 279,025 cases. China, where the illness was first reported late last year, has 90,402 cases and 4,737 fatalities, according to its official numbers."}]}