{"article": [{"url": "https://www.marketwatch.com/story/this-isnt-the-college-experience-you-were-expecting-but-get-a-degree-anyway-2020-09-01", "published": 1598943140.0, "headline": "This isnâ\u0080\u0099t the college experience you were expecting â\u0080\u0094 but get a degree anyway", "body": "Having dropped off their children at college, parents are now home worrying that their sons and daughters might catch COVID-19. Theyâ\u0080\u0099re also concerned about how the current recession will impact their finances, future tuition increases, the burden of student debt and whether their children will find jobs when they graduate. I understand how they feel, but I work in higher education and study these financial issues, and the economic facts and numerous studies I have examined show that todayâ\u0080\u0099s college students should do just fine financially. Getting a bachelorâ\u0080\u0099s degree is definitely worth the cost and effort, even if you are unlucky and graduate during a really bad recession. Why? For one simple reason â\u0080\u0094 the alternative of not having a college degree is often so much worse. My eldest son graduated from Kenyon College this spring. When he went back to college in August 2019, he was excited about the many opportunities awaiting him in the hottest job market in half a century. This May, his graduation ceremony was held in our living room and he began his job search in the worse job market since the Great Depression. The pandemic has greatly harmed our economy and it will take years to heal. Some parents and high-school students are skeptical about the value of a four-year college degree in this post-pandemic world. The see that college costs keep rising. The College Board reports that from 1990 to 2020, after adjusting for inflation, the average cost of going to college at a private, four-year college has increased by 106%, while costs at an in-state, public four-year college have risen by 197%. Yet household income is growing slowly. The Federal Reserve Bank of St. Louis indicates that median household income, adjusted for inflation, was up only 11% over the previous 30 years. And that income is likely to drop during the pandemic recession (grey bars in chart below are previous recessions). Itâ\u0080\u0099s no surprise that student loans are on the rise. The Project for Student Debt notes that the average amount of student loan debt held by the 65% of graduates who have loans increased from $17,350 in 2000 to $29,200 in 2018. From the first quarter of 2004 to the first quarter 2020, student loan debt increased from $260 billion to $1.53 trillion, according to the Federal Reserve Bank of New York. Households have more in student loan debt than they have auto loans or credit-card debt. Default rates are higher for student loans than for mortgages, credit cards and auto loans. The NY Fed estimates there were 44.7 million student loan borrowers in 2017 in loan-repayment mode, and 6.9 million of these borrowers, more than 15%, were delinquent or in default on their loans. Read:Student-loan borrowers can skip payments until 2021, but that may not be long enough My son and many other recent graduates are having a hard time finding a job right now. They may be forced to take a job that they are overqualified for. For many, getting that perfect job may have to wait until after we have a COVID-19 vaccine. This is very similar to the situation that faced college graduates of the classes of 2008 to 2010 after the 2008-2009 financial crisis. A 2018 study indicated that as many as 43% of college graduates may be underemployed in their first job out of college, and such a result can impact student earnings for many years after graduation. All these facts considered, itâ\u0080\u0099s still better to get that degree. Hereâ\u0080\u0099s why: â\u0080¢â\u0080\u0089The unemployment rate for all college graduates over 25 years old jumped from 1.9% in February, before the COVID-19 outbreak mushroomed, to 8.4% in April and dropped to 6.9% in June. But the unemployment rate for high school graduates over 25 years old increased from 3.6% in February to 17.3% in April and dropped to 12.1% in June. Under all economic situations, booms to recessions, workers with a bachelorâ\u0080\u0099s degree or higher always have lower unemployment rates than individuals that have less education. â\u0080¢â\u0080\u0089A 2016 Georgetown University study found that 99% of the job growth created in the six-year period after the 2008 recession went to workers with some college education Nearly 3 out of every 4 jobs created went to a worker with a bachelorâ\u0080\u0099s degree or higher. Someone with a bachelorâ\u0080\u0099s degree will earn, on average, $1 million more over a lifetime than someone with just a high school diploma. Majors matter even more. There is a $3.4 million average lifetime income difference between the highest and lowest-paying college major. According to a 2020 U.S. Department of Education study, in 2018, the median earnings of those 25 to 34 years old with a bachelorâ\u0080\u0099s degree were $54,700 â\u0080\u0094 57% higher than the earnings of high school completers ($34,900). â\u0080¢â\u0080\u0089College costs less than the sticker price for most families. The College Board notes that most students who go to college receive grants and many parents receive federal income-tax benefits. What people actually paid increased on average by only 18% for private colleges and 28% for in-state public colleges over the past 10 years. In 2019, families received an average discount of 46% for a private college and 30% for an in-state, public college. Interest rates for federal student loans are at historic lows: 2.75 % for undergraduate students. In addition, the Federal Reserve Bank of New York reports that in 2017, nearly two-thirds of student loan borrowers owed less than $25,000. Less than one in five student-loan borrowers owed more than $50,000, and many of these students borrowed for both undergraduate and graduate and/or professional degrees). â\u0080¢â\u0080\u0089College graduates are more likely to work for an employer that offers retirement plans and health insurance. They also are more likely to exercise and vote and they are less likely to need public assistance, be in poverty, or smoke, according to the College Board. â\u0080¢â\u0080\u0089Demographics favor my son and his friends. There are approximately 78 million baby boomers. Thatâ\u0080\u0099s a lot people retiring, and their retirements will create many job openings. Todayâ\u0080\u0099s job drought will turn into a jobs flood in the near future. These demographics were a major cause of the very low unemployment rates prior to the pandemic and will be a major jobs tailwind as the economy recovers from the pandemic. A note of caution. All these benefits of college go out the window if a student doesnâ\u0080\u0099t graduate. Quitting college with student-loan debt means financial pain with modest economic gain. Yes, even some college will increase earnings over an individual with just a high school diploma, but the big economic payoff comes to those with that bachelorâ\u0080\u0099s degree. To be clear, you can obtain good-paying jobs without a four- year college degree. George Washington Universityâ\u0080\u0099s Center on Education and the Workforce has issued multiple studies identifying the benefits of associate degrees and certification programs, particularly in STEM (science, technology, engineering and math) fields. However, these studies indicate that these jobs are going to individuals with education beyond just a high school degree, such as an associate degree, certificate or some college. Have grit, persevere and complete college. A college degree doesnâ\u0080\u0099t come with a job guarantee â\u0080\u0094 but it usually beats the alternative. John Pelletier is director of the Center for Financial Literacy at Champlain College. Follow the Center @ChampFinLit."}]}