{"article": [{"url": "https://www.marketwatch.com/story/dont-give-up-on-low-volatility-stock-strategies-just-yet-despite-their-poor-recent-performance-2020-06-12", "published": 1592038340.0, "headline": "Don't give up on low-volatility stock strategies just yet, despite their poor recent performance", "body": "CHAPEL HILL, N.C. - Low-volatility ETFs appear to be yet another example of an investment product that should have protected investors during the coronavirus pandemic but didn't. These are exchange-traded funds that invest in stocks with the lowest trailing volatility. Researchers have found that such stocks not only continue to exhibit below-average volatility going forward, but also tend of outperform the overall market. That is definitely a winning combination. But the approach didn't work during the waterfall decline from the February market high to the March low. Take the Invesco S&P 500 Low Volatility ETF SPLV, +0.82%, which invests in the 100 stocks within the S&P 500 SPX, +0.87% that have the lowest trailing 12-month volatility. During that decline the ETF's return was 2.1 percentage points lower than the S&P 500 (minus 35.8% versus minus 33.7%). Adding insult to injury, the SPLV has also significantly lagged the broad market in the rally since the March lows. Between March 23 and June 10, the SPLV gained \"just\" 29.8%, 13.3 percentage points less than the S&P 500's 43.1%. Might the low-volatility approach have stopped working? I asked this question two months ago and concluded that we should give the strategy the benefit of the doubt. Given how poorly it's performed since then, however, it's time to take another look. For starters, let's put the SPLV's recent market-lagging performance into a much longer-term perspective. Take a look at the accompanying chart, which extends back to 1972 (courtesy of data from S&P Dow Jones Indices). The chart plots a ratio of the SPLV's trailing three-month return to that of the S&P 500 (all returns include the reinvestment of dividends). For the most recent three-month period (from the end of February through the end of May) this ratio stood at 0.898. Notice from the chart that while readings below 0.9 are unusual, they are not unprecedented. The other occasions were November 1980, twice in 1999, and May 2009. At a minimum, therefore, you cannot conclude from the magnitude of low-volatility's poor recent performance that the approach has permanently stopped working. To put this conclusion another way: The approach's excellent long-term record exists despite these occasional hiccups. Since February 1972, which is how far back S&P Dow Jones Indices has data, the S&P 500 Low Volatilty Index has produced a total return of 11.9% annualized, versus 10.4% for the S&P 500 itself. And not only did the low-volatility strategy beat the market by 1.5 annualized percentage points, it did so with 18% less volatility. Furthermore, a close reading of the chart shows something that is even more encouraging for beleaguered believers in low-volatility approaches: After each prior occasion in which the SPLV significantly lagged the S&P 500, it quickly reasserted its historical dominance. Such a recovery may have already started. During the market's plunge on Thursday, the S&P 500 fell 5.9% and the SPLV dropped 4.5% - a positive alpha of 1.4 percentage points. To be sure, I am drawing conclusions based on just four data points. As statisticians will remind us, that's far too few to support robust predictions. Nevertheless, if there is insufficient data to draw an optimistic forecast about an imminent resurgence of the low-volatility approach, it follows that there also is insufficient data to conclude that low-volatility strategies have permanently stopped working. Either way, we should continue to give them the benefit of the doubt. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com."}]}