{"article": [{"url": "https://www.marketwatch.com/story/that-travel-ban-trump-touts-bill-gates-says-it-made-the-pandemic-worse-11600626062", "published": 1600634300.0, "headline": "Bill Gates: Trumpâ\u0080\u0099s partial travel ban made coronavirus pandemic worse", "body": "Bill Gates. Getty Images “ â\u0080\u0098We created this rush, and we didnâ\u0080\u0099t have the ability to test or quarantine those people.â\u0080\u0099 ” Thatâ\u0080\u0099s billionaire philanthropist and Microsoft MSFT, +2.48% co-founderÂ Bill GatesÂ explaining in a â\u0080\u009cFox News Sundayâ\u0080\u009d interview how President Trumpâ\u0080\u0099s partial travel ban on China and later other countries may have actually worsened the coronavirus outbreak. â\u0080\u009cSo [the ban] seeded the disease here,â\u0080\u009d Gates told Fox host Chris Wallace. â\u0080\u009cYou know, the ban probably accelerated that, the way it was executed.â\u0080\u009d Trump issued a partial travel ban on China on Jan. 31, with initial reports having emerged late in 2019 of the outbreak in Wuhan, in Hubei Province. (Democratic presidential nominee Joe Biden had penned an op-ed four days earlier expressing his concerns that Trumpâ\u0080\u0099s lack of gravity and serial dismissals of science and expertise left him ill-equipped to manage an effective national response to a health crisis that Biden feared would grow to pandemic status, as occurred formally some six weeks later.) He followed up with more bans in February and March that covered Europe and other hot spots. The president often points to the bans as evidence of his prompt response. But thatâ\u0080\u0099s not how Gates sees it. â\u0080\u009cMarch saw this incredible explosion â\u0080\u0094 [with cases on] the West Coast coming from China and then the East Coast coming out of Europe â\u0080\u0094 and so, even though weâ\u0080\u0099d seen China and weâ\u0080\u0099d seen Europe, that testing capacity and clear message of how to behave wasnâ\u0080\u0099t there,â\u0080\u009d Gates explained. Here are his comments: iframe.twitter-tweet { width: 100% !important; } The U.S. currently leads the world in infections and deaths, with almost 6.8 million cases, according to the latest tally from Johns Hopkins. The death toll by numerous measures has topped 200,000."}]}