{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-bounce-but-concerns-remain-over-outlook-for-demand-2020-09-09", "published": 1599664520.0, "headline": "Oil prices finish higher, but concerns remain over outlook for demand", "body": "Oil futures finished higher Wednesday, with U.S. prices reclaiming less than half of the more than 7% drop suffered in the previous session as worries over the demand outlook, driven by the pandemic, continued to limit crude’s upside potential. “The bounce in oil prices reflects the market recovering from the oversold positions” Tuesday, said Manish Raj, chief financial officer at Velandera Energy, “As the flurry of panic-stricken traders was absorbed,” the market was balanced today, leading to a rebound. However, “this week’s volatility is a reflection of substantial uncertainty in oil demand,” Raj told MarketWatch. “Whereas gasoline demand has staged a handsome V-shaped recovery world-wide, and particularly so in the U.S., distillate and jet fuel demand is elusive to say the least.” West Texas Intermediate crude for October delivery CL.1, -1.62% US:CLV20 on the New York Mercantile Exchange rose $1.29, or 3.5%, to settle at $38.05 a barrel. November Brent crude BRN.1, -0.07% UK:BRNX20, the global benchmark, rose $1.01, or 2.5%, to $40.79 a barrel on ICE Futures Europe. Weekly data on U.S. petroleum supplies will be released late Wednesday from the American Petroleum Institute and Thursday morning from the Energy Information Administration. The reports are each delayed by a day due to Monday’s Labor Day holiday. On average, the EIA is expected to report a decline of 500,000 barrels in crude supplies for the week ended Sept. 4, according to analysts polled by S&P Global Platts. Gasoline supplies are likely to have fallen by 2.5 million barrels, while distillates, which include heating oil, are expected to be up by 300,000 barrels, the survey showed. On Nymex Wednesday, October gasoline US:RBV20 rose 1.5% at $1.1193 a gallon, while October heating oil US:HOV20 rose 2.7% to $1.1061 a gallon. In a monthly report issued Wednesday, the EIA raised its 2020 forecasts for WTI and Brent crude-oil prices, natural-gas prices, and U.S. crude production. I also lowered its 2021 growth forecast for global consumption of petroleum and liquid fuels by 500,000 barrels per day from its August forecast, to about 99.6 million barrels a day. WTI crude prices tumbled more than 7% on Tuesday, while Brent dropped more than 5% to fall below the $40-a-barrel level. The selloff reflected fears over the outlook for demand as the U.S. driving season, which runs from Memorial Day to Labor Day, came to an end and concerns also rose about the outlook for global crude demand. Read:How a big decline in China’s oil imports may ‘test the resiliency of the market’ A recent stock-market plunge, which saw the Nasdaq Composite COMP, +1.39% slide into correction territory on Tuesday likely added to the selloff in crude and other assets perceived as risky. A rise by the U.S. dollar in reaction to rising market volatility also weighed. A stronger dollar can weigh on commodities priced in the unit because it makes them more expensive to users of other currencies. The dollar, however, pulled back on Wednesday. Traders seek support from the discipline and resolve of the Organization of the Petroleum Exporting Countries and its allies “to not let prices go in a free fall,” said Raj. “Therefore, there exists a support level of around $40 Brent that is defensive and acts as a low threshold.” OPEC+ oil production climbed by 1.71 million barrels a day to 34.63 million barrels a day in August from a month earlier, according to an S&P Global Platts survey released Wednesday. According to calculations by Platts, OPEC+ achieved compliance of 97% with that new quota. OPEC+ had previously reached an agreement to ease record production cuts of 9.7 million barrels a day to 7.7 million barrels a day starting in August. Rounding out action on Nymex, October natural gas US:NGV20 edge up by nearly 0.3% to $2.406 per million British thermal unit, ahead of Thursday’s weekly EIA update on supplies of the commodity."}]}