{"article": [{"url": "https://www.marketwatch.com/story/i-told-my-unemployed-tenant-about-jobs-he-said-they-dont-pay-enough-and-sits-at-home-smoking-weed-now-he-wants-a-discount-what-do-i-do-2020-07-21", "published": 1596888260.0, "headline": "I told my unemployed tenant about jobs. He said they don't pay enough, and sits at home smoking weed. Now he wants a discount. What do I do?", "body": "Dear Moneyist, I have rented a house behind my own home to someone in the service industry who is out of a job because of COVID-19, and now he can't pay the full rent. I am fortunate enough to still have a job, but I am heavily in debt with student loans, my mortgage, and other bills. I work very hard, including early and late hours and weekends. I have referred my tenant to companies hiring during COVID-19, but he isn't interested or says it pays too low. Instead, he is hanging out with friends or his girlfriend, and always smoking weed. He tells me I should forgive or discount the rent. It should be noted that he is already getting a discount since the rent is well below market price. Part of me doesn't want to give him a discount since I work so hard and long hours, and he just hangs around being picky about work. Is that wrong of me? What should I do? Impatient Landlord Dear Impatient, Your tenant's situation reminds me of a cartoon I once saw featuring a fellow smoking marijuana and watching TV in his boxer shorts and a T-shirt in his parent's basement. The caption went something like \"Smoking weed has never done me any harm!\" The next box was the exact same image, except it was 20 years later, and the caption read: \"Smoking weed has never done me any harm!\" Several major cities across the U.S. have either issued temporary bans on evictions or are considering them amid the coronavirus outbreak. For millions of Americans who work for hourly wages below $15 an hour, and do not have paid sick leave or the option to work from home, the economic impact has depleted their savings and put them in a precarious position. The Moneyist: I filed a joint tax return with my estranged wife because she is a gambler and her finances are a mess. But I got NO stimulus check - what can I do? The Moneyist: I didn't get my stimulus check because I owe back child support. It's not fair. My stepchildren rely on me - what can I do? There are many people doing their best to find work and hang onto their homes. They deserve our full support. You may not know the actual circumstances of his income, but if he would make the same amount of money or more working, he should certainly take a job to pay his rent and bills, especially given that you took the time to help him. But he must be willing and able to help himself. Local governments in several U.S. cities have temporarily banned evictions as the coronavirus outbreak has worsened and, depending on where you live, it may get worse before it get better. Whatever you decide, make sure the law is on your side, and that you are comfortable with your decision. Listen to your gut! That said, if the work he was offered was enough to get by, he should take it. You've gone above and beyond your role as landlord and, thus far, you've done everything by the book, and I commend you in renting this apartment below the market rate. Step 1: Make sure he knows he's already getting this house at below the market rate. And Step 2? If the champagne is not chilled to the right temperature at this job or rental, suggest he find a place where it is. Coronavirus update: As of Saturday, COVID-19, the disease caused by the virus SARS-CoV-2, had infected at least 19.4 million people globally and 4.9 million in the U.S. It had killed over 722,303 people worldwide and at least 161,682 in the U.S., according to data aggregated by Johns Hopkins University. The stock market has been on a wild ride in recent months. The Dow Jones Industrial Index DJIA, +0.56% and the S&P 500 SPX, +0.87%  ended up Friday as investors awaited round two of a fiscal stimulus; the Nasdaq Composite's COMP, +1.39% 7-day winning streak ended."}]}