{"article": [{"url": "https://www.marketwatch.com/story/natural-gas-futures-rally-amid-storm-related-flooding-in-texas-11600884256", "published": 1600876580.0, "headline": "Natural-gas futures rally on storm-related disruptions and signs of stronger demand", "body": "Natural-gas futures rallied Wednesday, to settle at their highest in a week. Prices found support amid production slowdowns tied to recent storms as well as facility maintenance, and as flooding along the coast of the Gulf of Mexico that reportedly led to disruptions at export facilities, analysts said. The flow of natural gas to major hubs Sabine Pass and the Freeport LNG export facilities in Texas remains “greatly reduced” as Tropical Storm Beta unleashed flooding in the Houston area and inched toward Louisiana, said Christin Redmond, commodity analyst at Schneider Electric, in a daily note Wednesday. Beta made landfall as a tropical storm late Monday in Texas. By Wednesday, it was downgraded to a post-tropical cyclone, but flash flood watches are in effect across southeast Texas and southern Louisiana, the National Hurricane Center said Wednesday morning. This year marks only the second time that the Greek alphabet has been used to name storms, reflecting that the regular list of 21 names, ended with Tropical Storm Wilfred, have been exhausted. Deliveries of feed gas, which is natural gas that comes from field production, has seen a significant decline in recent days, Natural Gas Intelligence reported on Tuesday. It also said the Cameron, Corpus Christi, Freeport and Sabine Pass export terminals were in Beta’s path as the storm neared land. MarketWatch has left a message with Cheniere Energy requesting an operational update on the Sabine Pass facility. Luke Jackson, team lead, North America natural gas at S&P Global Platts, meanwhile, attributed the rally in natural gas to easing worries about stocks in the Gulf Coast hitting capacity. Production in the Northeast U.S. fell 1.5 billion cubic feet per day Wednesday, compared with the September month-to-date average, he told MarketWatch. “That drop is partly maintenance related, but also likely a function of the region’s own storage congestion and lack of demand, which is forcing prices lower and causing production to shut.” On Wednesday, the front-month October natural gas contract NGV20, -2.27% rose nearly 16%, or 29 cents, at $2.125 per million British thermal units on the New York Mercantile Exchange, for the biggest one-day percentage rise since early August, according to FactSet data. The settlement was the highest for a front month since Sept. 16. Export demand prospects “have a silver lining,” as well, with traders estimating that less than five U.S. cargoes have been cancelled for November loading, said Redmond. Given that, and “assuming that Gulf LNG export terminals or their surrounding power grids do not sustain substantial damages from Beta, feedgas demand should ramp up again quickly following the storm and could run near full capacity in October,” she said. Jackson also pointed out the rise in demand. U”.S. gas burns in the power sector have started to tick higher, with parts of the Gulf Coast rebounding from the lows” following the recent storm. Power generators are also showing “signs of fuel switching from coal back to gas following the sharp drop in Henry Hub prices the past week,” he said. So “lower supply in the Gulf, plus stronger demand, means less gas is being injected into storage.” Month to date, natural-gas futures have still lost around 19% amid a seasonal shift away from summer-related cooling demand. After the recent deep sell off, traders are “playing the one factor that always comes into focus” at this time of year: weather, said Tariq Zahir, managing member at Tyche Capital Advisors. “The last couple of winters have been milder than expected while forecasts this year are for a colder winter this year,” he told MarketWatch. “Most of the action has been on the front end of the curve where prices got hit hard, but we are seeing prices further out remain relatively strong.” December natural gas NGZ20, +2.31% trades at around $3.26 per million Btus, around 52% higher than the current front-month prices."}]}