{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-and-the-dollar-rise-amid-earnings-wave-slowing-virus-cases-11595921690", "published": 1595915840.0, "headline": "European stocks and the dollar rise amid earnings wave and slowing virus cases", "body": "An employee, wearing a protective face mask, assembles a battery-pack for electric cars at the assembly line at the PSA Peugeot Citroën plant in Trnava, Slovakia, on July 16, 2020. vladimir simicek/Agence France-Presse/Getty Images European stocks and the dollar rose on Tuesday, reversing the previous day’s sour tone as traders digest a wave of corporate results on both sides of the Atlantic and the latest coronavirus news. Down 0.3% on Monday, the Stoxx Europe 600 SXXP, +0.55% rose 0.5%. The German DAX DAX, +0.06%, French CAC 40 PX1, +0.71% and U.K. FTSE 100 UKX, +0.64% also gained. The euro EURUSD, +0.60% slipped, trading at $1.1726 vs. $1.1753 on Monday, when it reached the highest level since Sept. 25, 2018. Gold futures slipped after rising to a record on Monday. U.S. coronavirus numbers have improved, with deaths, new cases and the positive test rate on Monday declining, according to data from the COVID-19 project. That improvement comes as drugmaker Moderna started late-stage trial of its COVID-19 vaccine and as Republicans lawmakers introduced the latest stimulus package meant to offset the economic disruption from the coronavirus. “Stocks are largely showing modest gains as the optimism surrounding the U.S. $1 trillion stimulus package story is outweighing the health crisis,” said David Madden, market analyst at CMC Markets U.K. Investors largely cheered the earnings news released on Tuesday. Peugeot UG, -1.83% shares rose as the French automobile maker reported a surprise profit for the first half. Peugeot is planning to complete its merger with Fiat Chrysler Automobiles FCA, -1.38% before the end of the first quarter of 2021. Delivery Hero DHER, +3.67%, the German food-service delivery company, rose 3.3% after raising its fiscal year revenue guidance and saying it will top 1 billion orders on its platforms. LVMH Moet Hennessy MC, +1.15% shares slumped 4.5% as the luxury-goods giant reported an 84% drop in first-half profit on a 27% revenue fall. Following the 115-point gain for the Dow industrials DJIA, +0.56% on Monday, U.S. stock futures ES00, +1.13% were steady. U.S. earnings results are on tap from drugmaker Pfizer and technology company 3M, and, after the close, coffee chain Starbucks and credit card giant Visa."}]}