{"article": [{"url": "https://www.marketwatch.com/story/when-youre-in-physical-pain-youre-likely-to-spend-more-freely-11602168420", "published": 1602154520.0, "headline": "When youâ\u0080\u0099re in physical pain, youâ\u0080\u0099re likely to spend more freely", "body": "Miramax/Courtesy Everett Collection Suffering from pain causes consumers to spend more money than they otherwise would â\u0080\u0094 perhaps 20% more â\u0080\u0094 according toÂ new researchÂ I conducted. This is based on the idea of what marketing scholars call the â\u0080\u009cpain of paying.â\u0080\u009d It â\u0080\u009churtsâ\u0080\u009d when we give our hard-earned money to the cashier, even if doing so means receiving a product or service in kind. Itâ\u0080\u0099s a pain thatâ\u0080\u0099s bothÂ emotionalÂ and detectable inÂ neurological scans, but physical pain can mute it. In aÂ series of studies, I found that being in physical anguish reduces the pain of paying, and so people end up spending more money. In one study, participants were asked to place their hands in cold water, a common technique to induce pain, and view a computer mouse for sale on a screen. I found that people experiencing mild discomfort were 67% more likely to be interested in buying the mouse than those whose hands remained dry and pain-free. In another study conducted in Melbourne, Australia, people going in and out of a dentistâ\u0080\u0099s office were offered a coffee mug and asked how much theyâ\u0080\u0099d be willing to pay for it, from nothing to AU$12. People coming out of the office, who were more likely to be in pain because of their procedures, offered to pay an average of AU$4.42 for the mug, while those entering offered to pay AU$3.67. Because the same area of the human brain processes all sorts of pain, being in physical pain takes up more of the brainâ\u0080\u0099s resources, making it harder to process â\u0080\u0094 and feel â\u0080\u0094 other types of discomfort, such as emotional pain one might feel fromÂ being socially rejected by others, and theÂ pain of paying for things.Why it matters Nearly 1 in 5 AmericansÂ â\u0080\u0094 about 65 million â\u0080\u0094 experiences chronic pain, with similar shares inÂ Europe,Â AustraliaÂ andÂ China. Past research has studied how pain lowersÂ life satisfaction and psychological well-being. But I couldnâ\u0080\u0099t find any studies that looked at how pain affects consumer behavior, which is important because, after all, people in pain still need to make decisions about what to buy every day. I believe that my findings are important for another reason. The pain of paying helps usÂ avoid overspending. â\u0080\u009cRetail therapyâ\u0080\u009dÂ can be common during tough timesÂ like the pandemic, and the plethora of discounts and instant gratificationÂ when shopping onlineÂ can be tempting. My findings suggest that people in physical pain may be more susceptible to surge pricing and other marketing tricks that get people toÂ spend more money. Americans are already holdingÂ a lot of credit card debtÂ as it is.Whatâ\u0080\u0099s next My colleagues and I have also started looking at how physical pain influences what people choose to eat. Weâ\u0080\u0099re in the initial stages of the research, but we have early evidence that being in physical pain increases peopleâ\u0080\u0099s willingness to eat more fast food. The reason seems to be the same: We experience guilt when we eat too much junk food, and experiencing physical pain seems to decrease this emotion. Eugene Y. Chan is an associate professor in the division of consumer science at Purdue University in West Lafayette, Ind. This was first published by The Conversation â\u0080\u0094 â\u0080\u009cExperiencing physical pain can cause you toÂ overspendâ\u0080\u009c .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; margin-bottom: 5px; } .at16units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body.at12units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body .header .wsj-interactive.generic-iframe-embed[name=\"\"], body.at8units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body.at4units .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .header .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; }"}]}