{"article": [{"url": "https://www.marketwatch.com/story/powell-says-u-s-economy-needs-more-fiscal-support-11601995205", "published": 1602001880.0, "headline": "Powell says U.S. economy needs more fiscal support", "body": "Federal Reserve Chairman Jerome Powell Federal Reserve Chairman Jerome Powell on Tuesday reiterated his belief that the U.S. economy needs more fiscal support even though the recovery from the “natural disaster” of the coronavirus pandemic so far has been strong . In a speech to the National Association for Business Economics, Powell argued it was better for Congress to provide too much fiscal support than the reverse. “Too little support would lead to a weak recovery, creating unnecessary hardship for households and businesses,” Powell said. This would lead more businesses to declare bankruptcy and for households to run into severe economic distress. On the other hand, even if policy actions are more than is needed” it will not go to waste,” Powell said. “The recovery will be stronger and move faster if monetary policy and fiscal policy continue to work side by side to provide support to the economy until it is clearly out of the woods,” the Fed chairman said. Both political parties in Congress assert they want to pass a follow up to the CARES Act in March which provided $2.2 trillion in financial aid to businesses and the unemployed, but Senate Republicans have complained the new fiscal stimulus backed by Democrats is too expensive and they want a more targeted approach. Treasury Secretary Steven Mnuchin and Speaker Nancy Pelosi have been talking in an effort to break the stalemate over the stalled coronavirus relief bill. Late on Tuesday, President Donald Trump said he was ending the negotiations on deal. During a question and answer session, Powell said now is “not the time” to worry about getting the federal budget deficit back on a sustainable path. In his speech, Powell praised lawmakers for the four earlier fiscal measures passed in March and April, calling them “by far the largest and most innovative fiscal response to an economic crisis since the Great Depression.” The measures have muted the normal scary downward spiral that can occur when the economy slips into recession: where layoffs lead to lower consumer demand and thus more layoffs. This has helped the economy recover strongly from the “natural disaster” of the coronavirus pandemic, he said. But more help is needed because the outlook is highly uncertain. “There is a risk that the rapid gains from reopening may transition to a longer than expected slog back to full recovery as some segments struggle with the pandemic’s continued fallout,” Powell said. Even though the jobless rate has fallen to 7.9% in September from a pandemic peak of 14.7%, the labor market recovery “still had a long way to go,” he said. Powell highlighted how low income households have born the greater brunt of the pandemic. Employment of those in the bottom rung of the wage distribution scale remains 21% below its February level, while it was only 4% lower for workers who receive higher wages, the Fed chairman said. Read: Why Wall Street is doing great while Main Street is still closed Asked if he was concerned about a potential spike in inflation, Powell said disinflationary pressures persist all around the world. “We are still seeing downward pressure on inflation and I think its appropriate for central banks and certainly the Fed to take that into account,” he said. U.S. stocks fell Tuesday afternoon after Trump threw cold water on a stimulus deal, with the Dow Industrial Average DJIA, +0.56% closing down 375 points."}]}