{"article": [{"url": "https://www.marketwatch.com/story/4-common-mistakes-that-could-get-your-mail-in-ballot-rejected-and-how-to-make-sure-your-vote-is-counted-11601579628", "published": 1602235940.0, "headline": "4 common mistakes that could get your mail-in ballot rejected - and how to make sure your vote is counted", "body": "Several states have expanded vote-by-mail options during the pandemic. Mladen Antonov/AFP via Getty Images President Trump claimed without evidence at the first presidential debate that mail-in voting during the upcoming election would be rife with fraud, but the process is forging ahead: Several states have expanded opportunities to vote by mail during the pandemic, and some 72 million voters across the country have requested or been sent absentee ballots. While studies suggest that mail-in voting fraud - like voting fraud in general - is rare, the process does leave some room for user error: About 1% of absentee ballots that were returned and submitted for counting in the 2016 election were rejected, according to a report by the U.S. Election Assistance Commission, an independent, bipartisan commission. The most common pitfalls, according to the report: \"the signature on the ballot not matching the signature on the state's records,\" \"ballot not received on time/missed deadline\" and \"no voter signature.\" Other reasons for rejection included \"voter voted in person,\" \"no witness signature\" and \"problem with return materials.\" Meanwhile, the number of mail-in ballots thrown out during this year's primaries in 23 states surpassed the number of absentee and mail ballots rejected during the 2016 general election, the Washington Post reported. \"It is a very safe vote method if you know the rules and if you follow them correctly,\" Enrijeta Shino, an assistant professor of political science at the University of North Florida who studies elections and voting behavior, told MarketWatch. But \"the burden is on voters' responsibility to follow through and be careful,\" she added, especially without a poll worker there to help sort out the details. Research co-authored by Shino this year found that newly registered voters, racial and ethnic minorities, and younger voters in Georgia were disproportionately likely to have their mail ballots rejected during the 2018 midterm elections. Confused about the process? For starters, make sure you're registered to vote at your current address, especially if you've moved during the pandemic. Most states, including some that are allowing voters to use COVID-19 as an excuse, are letting eligible voters cast ballots by mail in the 2020 election. But the question of whether voters are automatically mailed ballots, automatically mailed applications for mail-in ballots, or must obtain the application themselves varies by state, as do the deadlines. Voters in five states must still provide a non-COVID-19-related excuse to cast an absentee ballot. Once you've got your ballot, here are the most common scenarios in which your mail vote could be invalidated - as well as strategies for how to avoid them: “ 'It might be a perfectly filled-out ballot and return envelope - but that doesn't matter, because it is considered late.' ” - Enrijeta Shino, an assistant professor of political science at the University of North Florida You didn't return your ballot on time \"If you want to vote by mail, do not wait until the last minute,\" Tappan Vickery, the director of voter engagement for the nonpartisan voter-participation group HeadCount, told MarketWatch. After all, Shino added, \"it might be a perfectly filled-out ballot and return envelope - but that doesn't matter, because it is considered late.\" Pay attention to the dates by which ballots in your state must be postmarked and received by the elections office, Vickery said, and return your ballot as soon as possible. HeadCount's tool lets you look up rules and deadlines for early and mail-in voting in your state. \"Get it done early and in the mail no later than [Oct.] 20th,\" she suggested. \"And if you can get it in earlier, try.\" If you haven't mailed your completed ballot by then, Vickery said, try to return it in person to your local elections office, polling place or ballot drop box. Rules for returning ballots in person vary by state, so check what your state allows. If you plan to have someone else return your completed ballot on your behalf, make sure that's allowed in your state, Vickery said. Take advantage of the ballot-tracking systems available in most states, she added, and be proactive about contacting your local elections office if you have any concerns.Your signature doesn't match Some people forget to sign their ballot where indicated or use a signature that doesn't match their voter registration record, Vickery said. A handful of states also require the signature of a witness, a rule that already appears to have caused some confusion since early voting began. \"A lot of times people vote their ballot, throw it in there, sign it in haste and don't read all the instructions,\" Vickery said. Like many other aspects of voting by mail, signature requirements are state-specific, she added. If you registered to vote at the DMV, your signature on file might match the one on your driver's license. If you registered through a standard voter-registration form, your signature would match that record. And if you don't remember what signature you provided, you can check the rules in your area for updating the signature your state has on file, Vickery said. Some states also have a process to \"cure\" signature discrepancies, during which they will notify you of a signature problem and give you a chance to rectify it. \"If you're in a state that has a cure period, pick up your phone, because your local elections office is going to call you from a weird number that you don't know and tell you have to do it by a certain day,\" Vickery said. \"If you don't pay attention, you could miss an opportunity to address a signature challenge.\" Of course, taking advantage of a chance to fix your signature means you need to have sent in your ballot with some time to spare, Shino added - not waited until the last day possible.You didn't use the correct envelopes to return the ballot Pay close attention to instructions for the envelopes provided with your ballot. These envelopes are designed to give voters privacy, not make it harder to vote, Vickery said - but they can still prove challenging for some people. \"If you blow through it, you're going to miss a detail and your ballot is going to get tossed out,\" she added. “ 'Don't drop your coffee on it; don't write on the edge. If you have personal commentary on a candidate, do not write it on your ballot around your vote.' ” - Tappan Vickery, the director of voter engagement for HeadCount For example, Pennsylvania requires voters to put their completed ballot into a secrecy envelope, place the secrecy envelope into a larger return envelope, and then sign the back of the return envelope. \"If you forget to put your ballot into the little envelope before you put it into the big envelope,\" Vickery said, \"your ballot is disqualified.\" Make sure you put a stamp on your return envelope if your state is one of the many that don't prepay postage for mail-in ballots.You didn't pay close enough attention to the little things Stick to black or dark blue ink, Vickery said, and be sure to completely fill in the ovals on your ballot. Don't mark them with check marks or Xs. Follow instructions for verifying your ballot, which might include submitting a copy of your photo ID with your completed ballot. \"Slow down and read all the instructions; have somebody check it for you,\" Vickery said. \"Don't assume you know how it works. Make sure you take your time with it.\" Remember that your ballot will be read by a machine. \"Like any Scantron, if it's been damaged, if it's not flat, there is the opportunity that it's not going to go through the machine properly,\" Vickery said. \"So absolutely don't drop your coffee on it; don't write on the edge. If you have personal commentary on a candidate, do not write it on your ballot around your vote.\" If your ballot gets stray marks on it, call your local elections office to say you have a spoiled ballot, she said. Officials will instruct you on how to obtain a new one.Not sure about voting by mail? If you don't anticipate being able to put in the effort to return your completed ballot correctly and on time, a better option might be to vote early in person - masked and socially distanced, of course - provided you feel safe doing so and your state allows it, Shino said. This option can help you avoid potential Election Day crowds, she said. Vickery also encouraged people who feel safe voting early in person to do so, particularly because states that didn't have robust vote-by-mail programs prior to the pandemic may be struggling to adjust. Everyone has a different risk tolerance, and some people may absolutely feel more comfortable voting by mail due to underlying health issues or community transmission in their area - but if you feel safe going to the grocery store, she said, \"hopefully you can feel safe going to vote early.\" \"It eliminates so many of these challenges and the burden on our system, and it makes it safer for people to be sure that their vote counts,\" she said. If you've already received your mail ballot but decide you want to vote in person, most (but not all) states allow you to bring your mail ballot to your polling place, where officials will cancel it out and allow you to vote in person, Vickery said. This isn't true of every state, so check the rules where you live. Failure to bring your mail ballot can lead to officials giving you a provisional ballot, which may not necessarily be counted, depending on your state's process, she said."}]}