{"article": [{"url": "https://www.marketwatch.com/story/the-coronavirus-led-economic-recession-may-be-over-but-the-depression-has-barely-begun-2020-06-26", "published": 1593252440.0, "headline": "The coronavirus-led economic recession may be over, but the depression has barely begun", "body": "Now that businesses are reopening and calling back furloughed workers, the COVID-19 recession may already be over. The depression has barely begun. The economy is growing again, but, with 2 million people filing for unemployment checks last week and about 30 million workers already on the dole, it’s still struggling mightily. There’s no official definition of a depression. Still, today’s economy seems to be a close fit: Millions of workers are losing their jobs permanently. Thousands of small businesses are closed permanently or operating at only a fraction of profitable levels. Debts are mounting, and incomes are not growing fast enough. State and local governments are slashing jobs and services. And only massive, but temporary, federal support prevents millions of families from falling into poverty. It’s no time to declare Mission Accomplished. Also read: ‘Make no mistake…the pandemic morphed into a Depression-like crisis,’ says UCLA economist, who predicts U.S. economy won’t recover from coronavirus until 2023No quick recovery It’s not just that the coronavirus pandemic is reaching new heights after a bungled reopening. That was to be expected. States experiencing rapidly growing case numbers are already seeing softer growth and even economic contraction in some cases, says Aneta Markowska, chief economist at Jefferies. Growth at small businesses has lost momentum nationally, she said. Some policy makers agree that the reinvigorated pandemic will hurt the economy for the rest of this year. “We’ll be in a situation where the economy is growing more slowly than we might have hoped a few months ago,” Boston Federal Reserve President Eric Rosengren said in an interview with Yahoo Finance this week. He expects the unemployment rate to remain above 10% for the rest of the year. Some economic forecasters are beginning to agree with Rosengren and other more pessimistic voices, and are dialing back their expectations for a V-shaped recovery that would return the economy to its pre-COVID level within a year. “Many factors point to what is more likely to be a quarter-to-quarter ‘V’ that does not have staying power, including that COVID is not vanquished, trade remains in contraction, business investment is collapsing, financial conditions are not loose, and equity markets are disconnected from the real economy, potentially contributing to uncertainty enhancing financial turbulence,” says a team of economists at Citi Research led by Catherine Mann. A longer-term worry is that vital parts of the economy — workers, businesses, lenders, creditors, and state and local governments — won’t get the support they need to survive financially until the virus is beaten. Bizarrely given the election calendar, there is little urgency in Washington for another round of stimulus payments, especially among Republicans. Treasury Secretary Steven Mnuchin wants the government to send out another check to everyone before Election Day (and Donald Trump apparently agrees), but anonymous White House aides and Republican senators have quashed that idea. Democrats in the House have passed a bill, but that proposal too is dead on arrival in the Senate. In the end, something will be done, but the fiscal response will be timid and underwhelming, as always. The pandemic is getting its fuel; the economy is not Here’s the thing: Both the coronavirus pandemic and the economy need fuel in order to grow, but right now, only the pandemic is getting enough. Both the pandemic and the economy rely on the most basic human behaviors to thrive: our sociability. The pandemic is getting all the fuel it needs to race out of control from the reckless way unmasked and unrepentant Americans are getting back together to work, play, shop and pray. These are also the behaviors that would literally sustain the American people (if done in a way that promotes public health). Consumer spending, which has traditionally been the bedrock of the economy, can’t save us this time because the economy is being starved of its starter fuel: income. In macroeconomics, it all starts with income. If you have income, you can spend, which then becomes income to the shopkeeper and her employees. And their spending then becomes someone else’s income, and so on and so forth.Starved of income growth But in America today, incomes are not growing fast enough, especially for working families, small businesses, and state and local governments. No income, no spending; no spending, no growth. In fact, incomes may be falling as one-time government payments, expanded unemployment benefits and support for small businesses expire or are scaled back. There’s another reason why consumer spending can’t spark a strong recovery: The upper-middle class and the rich aren’t spending the way they normally do, according to credit-card data analyzed by Raj Chetty’s Opportunity Insights. They aren’t going out to the theater, or dining out or taking expensive vacations because it’s too dangerous. Furthermore, why engage in conspicuous consumption if no one can see you do it? If the only people whose incomes haven’t plunged are unwilling to spend until the virus has been beaten, how can the businesses that cater to the carriage trade avoid layoffs and bankruptcy? If Washington won’t provide more support to working-class families now, there won’t be enough consumer spending to keep struggling Main Street businesses alive much longer. And if those businesses fail, other dominoes will fall. That’s what’s bothering the equity markets. Read:Consumer sentiment slips in late June as confidence in U.S. economic policies slumps to Trump-era lowState and local governments on the ropes The most immediate concern is the huge decline in state and local governments’ tax receipts, especially sales and hotel taxes. Current estimates suggest state government’s receipts for the upcoming fiscal year may be down by 10% to 20%, or about $500 billion, with local governments down an equal amount. The fiscal year for most states starts next week, and without massive support from Congress, most will be cutting services and employment severely. Already, 1.57 million state and local government workers have lost their jobs. Read:A warning to muni bond investors: Coronavirus recession will decimate state finances Also:State sales-tax receipts plunge as much as 41% in April amid coronavirus shutdowns — and May could be worse “It can really weigh on the economy if the states are in tight financial straits,” said Fed Chairman Jerome Powell, at a congressional hearing last week. Already, states and local governments are cutting back on their infrastructure spending and other services. State and local government spending collapsed after the Great Recession of 2008-2009 as well, which was a major factor in the slow recovery. The Democrats’ $3 trillion Heroes Act, languishing in the Senate, would provide significant grants to state and local governments to help them avoid spending and employment cuts, but Senate Leader Mitch McConnell has said bankruptcy is a better option. America seems to be exceptionally bad at public health, but it isn’t much better at economic policy. Rex Nutting is a MarketWatch columnist."}]}