{"article": [{"url": "https://www.marketwatch.com/story/fed-warns-stock-market-of-a-second-recession-if-the-coronavirus-pandemic-isnt-brought-under-control-2020-07-01", "published": 1593677840.0, "headline": "Fed warns stock market of a second recession if the coronavirus pandemic isnâ\u0080\u0099t brought under control", "body": "The Federal Reserve is a lot more worried about the economy than the stock market or the president are. Officials and staff economists at the Fed caution that a second wave of recession could sweep over the country later this year if the coronavirus pandemic isnâ\u0080\u0099t brought under control, according to a lengthy summary of the Fedâ\u0080\u0099s policy meeting held on June 9-10. The consensus forecast of Fed policy makers calls for a gradual recovery in the economy over the next several years, but the minutes of that June meeting released on Wednesday indicate that a more pessimistic projection was judged as â\u0080\u009cno less plausible than the baseline forecast,â\u0080\u009d by the staff economists who work up the most detailed (but classified) forecast of the economy. Also read: The coronavirus recession may be over, but the depression has barely begun Itâ\u0080\u0099s all going to depend on the health of the American people. The meeting took place before the latest surge of infections that have derailed or delayed plans to further open up businesses in several states. The stock market, however, has broadly shrugged off those infections. The S&P 500 index SPX, +0.87% rose 0.5% on Wednesday after surging 20% in the second quarter, which ended Tuesday. The minutes indicate that a surge like the one thatâ\u0080\u0099s now taken hold in many states was a major downside risk that was discussed behind the closed doors of the Fed in early June. The Fedâ\u0080\u0099s baseline scenario assumes that a gradual return of economic activity would not lead to a spike in COVID-19 cases, which has already killed more than 125,000 Americans. Social distancing and other public-health measures would keep the virus in check. In the more dire scenario sketched out by the staff who guide the appointed officials who make policy, â\u0080\u009ca second wave of the coronavirus outbreak, with another round of strict limitations on social interactions and business operations, was assumed to begin later this year, leading to a decrease in real GDP, a jump in the unemployment rate, and renewed downward pressure on inflation next year.â\u0080\u009d Also read: Goldman Sachs says if everyone wore a mask, it would be worth $1 trillion to the economy The policy-making officials voiced similar worries when they took their turn to talk at the meeting, although their language was not as direct as the staffâ\u0080\u0099s, at least in this version. The minutes are not a verbatim transcript, but a heavily edited summary of the frank discussions. A full transcript of the meeting will be released in five years. â\u0080\u009cA number of participants [among the five Fed governors and 12 district bank presidents] judged that there was a substantial likelihood of additional waves of outbreaks, which, in some scenarios, could result in further economic disruptions and possibly a protracted period of reduced economic activity,â\u0080\u009d according to the minutes. â\u0080\u0098Participants stressed that measures taken in the areas of health-care policy and fiscal policy, together with actions by households and businesses, would shape the prospects for a prompt and timely return of the U.S. economy to more normal conditions,â\u0080\u009d the summary said. Read:U.S. seen adding almost 4 million jobs in June â\u0080\u0094 but is the momentum already fading? Notably, that statement reveals that thereâ\u0080\u0099s not a lot more the Fed can do. Itâ\u0080\u0099s up to the public health and fiscal policy officials, as well as the private sector, to get us through this with a minimal loss of lives and damage to our livelihoods. That means wear a mask, keep your distance, test everyone you can, trace contacts, and isolate anyone who has the disease or who may have it. And it means Congress needs to provide more support for individuals, families, small businesses, and state and local governments. Read:Trump says he wants more stimulus checks: â\u0080\u0098I support actually larger numbers than the Democratsâ\u0080\u0099 Also:Hereâ\u0080\u0099s the latest on what we know works â\u0080\u0094 and doesnâ\u0080\u0099t work â\u0080\u0094 in treating coronavirus infections"}]}