{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-slide-in-wake-of-fed-meeting-2020-06-11", "published": 1591895840.0, "headline": "10-year Treasury yield erases recent gains as S&P 500 books near 6% loss", "body": "U.S. Treasury yields saw a dramatic drop on Thursday as investors rushed into government bonds for their haven appeal, amid concerns that a new wave of COVID-19 infections is hitting some states.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% slumped 9.3 basis points to 0.651%, its lowest since May 29, falling below where it traded before the release of Friday’s jobs report. The benchmark maturity saw its biggest daily drop since April 15, and has fallen nearly 30 basis points since hitting a recent high of 0.96% last Friday. The 2-year note rate TMUBMUSD02Y, 0.156% was unchanged at 0.177%. The 30-year bond yield TMUBMUSD30Y, 1.576% slipped 11.5 basis points to a three-week low of 1.401%, also seeing its largest daily drop since April 15.What’s driving Treasurys? Investors have concerns about the number of U.S. coronavirus infections passing the two million mark, with the nation’s death toll from the illness at more than 112,000, according to Johns Hopkins University. Despite fewer cases being recorded in some cities and states, the seven-day average of new cases over the last two weeks still is rising in more than 20 states, leading to worries about a second wave of the epidemic, just as business activity is resuming. Those concerns helped to drive a sustained selloff in stocks on Thursday, with the S&P 500 SPX, +0.87% and Dow Jones Industrial Average DJIA, +0.56% recording their biggest daily percentage declines since mid-March. On Wednesday the Fed’s updated policy statement and projections indicated that it expects a 6.5% contraction by the end of the year on a year-over-year basis, with the unemployment rate ending at 9.3%, well above the Fed’s estimate of the long-run rate forecast of 4.1%. Fed chair Jerome Powell suggested the central bank would not raise interest rates until 2022 as a result. See: Dovish Fed sees no interest-rate hikes for years, will keep buying assets In U.S. economic data, the latest reading of weekly jobless claims showed the number of Americans filing for unemployment benefits had increased by 1.54 million. Producer prices in May rose 0.4%, snapping three straight monthly declines. The Treasury Department saw healthy demand for an auction of $19 billion of 30-year bonds as the selloff in equities helped to draw demand for government paper.What did market participants’ say? “The second wave has arrived; or at least that is the impression one would get by glancing at the selloff in risk assets and the outperformance of 10- and 30-year Treasuries. Increasing incidence of Covid-19 cases have been reported in several states; the drop in domestic equities speaks to the reality that the pandemic is the most powerful influence on the global outlook,” said Ian Lyngen, head of U.S. rates strategy at BMO Capital Markets."}]}