{"article": [{"url": "https://www.marketwatch.com/story/major-banks-are-hauling-in-big-fees-from-debt-and-equity-underwriting-during-the-coronavirus-crisis-2020-07-14", "published": 1594813640.0, "headline": "Major banks are hauling in â\u0080\u0098big feesâ\u0080\u0099 from debt and equity underwriting during the coronavirus crisis", "body": "Cash might be king during a crisis but for top investment banks helping the Federal Reserve do â\u0080\u009cwhatever it takesâ\u0080\u009d to keep credit flowing during the pandemic, the ace in the hole has been capital markets fees. Take JPMorgan, Chase & Co. JPM, -0.57%, whichÂ recorded a chart-busting $33.8 billion of revenue for the second-quarter on Tuesday, despite the coronavirus recession, and a 54% jump in investment banking fees from a year ago. â\u0080\u009cNot to be a cheerleader, but 2Q20 showcased that there is good reason JPM is considered the industry leader,â\u0080\u009d a team led by Jesse Rosenthal, head of U.S. financial company research at CreditSights, wrote in a note following the bankâ\u0080\u0099s results. Citigroup Inc. C, +0.47% Â also on Tuesday reported $19.8 billion in revenue for the second-quarter, driven in part by a 68% surge in fixed-income trading revenue and a 131% jump in investment-grade debt underwriting activity from a year ago. â\u0080\u009cThe Fed plays a big part of that, because theyâ\u0080\u0099ve really opened up the capital markets,â\u0080\u009d said Stuart Plesser, a primary credit analyst for banks at S&P Global Ratings, in an interview Tuesday. He pointed to recent bond issuance records set by both U.S. investment-grade and high-yield companies during the pandemic, as examples of the ways several of the worldâ\u0080\u0099s largest investment banks have thrived as the Fed has offered more than $2 trillion in emergency funding facilities and major corporations have raced to build up war chests this year. â\u0080\u009cThatâ\u0080\u0099s generated big fees,â\u0080\u009d Plesser said of investment-banks, even though he also expects capital markets activity to get back to more â\u0080\u009cnormalâ\u0080\u009d levels in the yearâ\u0080\u0099s second half. Goldman Sachs Group GS, -0.21% Â on Wednesday reported a 41% jolt to revenue in the second-quarter from the same period last year, helped along by 93% jump in debt underwriting revenues for that period. Related: Wells Fargo blames COVID-19 and Fed rules, but also itself for disappointing results This chart from S&P shows capital markets revenue at larger investment banks already surging above $40 billion in the first quarter, the highest level in five years. Capital markets fees are key The credit-rating firm also charted how JPMorgan, Citigroup and Goldman have lead their peers in capital markets revenue in most years since 2010. How the majors stack up The Federal Reserve has increased its balance sheet to more than $7 trillion from less than $4 trillion about a year ago, in an effort to offset U.S. economic fallout during the pandemic. Big banks kicked off the second-quarter corporate earnings season earlier this week. The Dow Jones Industrial Average DJIA, +0.56% on Wednesday briefly traded above 27,000, while the S&P 500 index SPX, +0.87% Â was within striking distance of wiping out its losses for the year, with stocks driven higher by vaccine hopes and Goldmanâ\u0080\u0099s better-than-expected earnings results. Federal Reserve Gov. Lael Brainard on Tuesday also called for sustained large-scale asset purchases by the U.S. central bank to help the economy rebound amid a â\u0080\u009cthick fog of uncertaintyâ\u0080\u009d brought on by COVID-19, giving stocks a leg up."}]}