{"article": [{"url": "https://www.marketwatch.com/story/embarrassed-twitter-says-last-weeks-hack-targeted-130-accounts-2020-07-19", "published": 1595180420.0, "headline": "â\u0080\u0098Embarrassedâ\u0080\u0099 Twitter says last weekâ\u0080\u0099s hack targeted 130 accounts", "body": "OAKLAND, Calif. â\u0080\u0094 Twitter says the hack that compromised the accounts of some of its most high-profile users targeted 130 people. The hackers were able to reset the passwords of 45 of those accounts. The San Francisco-based company said in a blog post Saturday that for up to eight of these accounts the attackers also downloaded the accountâ\u0080\u0099s information through the â\u0080\u009cYour Twitter Dataâ\u0080\u009d tool. None of the eight were verified accounts, Twitter said, adding that it is contacting the owners of the affected accounts. â\u0080\u009cWeâ\u0080\u0099re embarrassed, weâ\u0080\u0099re disappointed, and more than anything, weâ\u0080\u0099re sorry. We know that we must work to regain your trust, and we will support all efforts to bring the perpetrators to justice,â\u0080\u009d Twitter TWTR, -0.23% Â said in the blog post. The July 17 attack broke into the Twitter accounts of world leaders, celebrities and tech moguls in one of the most high-profile security breaches in recent years. The attackers sent out tweets from the accounts of the public figures, offering to send $2,000 for every $1,000 sent to an anonymous bitcoin address. It highlighted a major flaw with the service millions of people have come to rely on as an essential communications tool. Allison Nixon, chief research officer at cybersecurity firm 221B said in an email Sunday that the people behind the attack appear to have come from the â\u0080\u009cOGâ\u0080\u009d community, a group interested in original, short Twitter handles such as @a, @b or @c, for instance. â\u0080\u009cBased upon what we have seen,the motivation for the most recent Twitter attack is similar to previous incidents we have observed in the OG community â\u0080\u0094 a combination of financial incentive, technical bragging rights, challenge, and disruption,â\u0080\u009d Nixon wrote. â\u0080\u009cThe OG community is not known to be tied to any nation state. Rather they are a disorganized crime community with a basic skillset and are a loosely organized group of serial fraudsters.â\u0080\u009d While this attack did not appear go further than the bitcoin BTCUSD, +3.44% Â ruse â\u0080\u0094 at least for now â\u0080\u0094 it raises questions about Twitterâ\u0080\u0099s ability to secure its service against election interference and misinformation ahead of the U.S. presidential election. â\u0080\u009cEntire markets and potentially elections may be manipulated or altered in this way,â\u0080\u009d Nixon said. â\u0080\u009cVictims of account takeovers generally do not know that the fraud has occurred, and generally cannot take security precautions to prevent it.â\u0080\u009d"}]}