{"article": [{"url": "https://www.marketwatch.com/story/micron-enthusiasm-cools-as-coronavirus-memory-chip-demand-boost-not-expected-to-last-2020-06-23", "published": 1592928920.0, "headline": "Micron enthusiasm cools as coronavirus memory-chip demand boost not expected to last", "body": "Micron Technology Inc. is proving to be a key measurement of how COVID-19 is rippling through the cloud as several memory-chip watchers are forecasting that the rush to reinforce a shelter-in-place digital infrastructure may have oversupplied the market. The latest indication that a COVID-19-inspired memory-chip glut is building for the year came on Tuesday, with BMO Capital analyst Ambrish Srivastava lowering his rating on Micron MU, -0.02% to market perform from outperform and cutting his price target to $55 from $60. Micron shares, which traded as low as $49.57 on the session, closed down 2.6% at $49.90, while the PHLX Semiconductor Index SOX, +1.77% SOX, +1.77% was up 0.2%, the S&P 500 index SPX, +0.87% advanced 0.4%, and the tech-heavy Nasdaq Composite Index COMP, +1.39% rose 0.7%. Micron specializes in DRAM and NAND memory chips. DRAM, or dynamic random access memory, is the type of memory commonly used in PCs and servers, while NAND chips are the flash memory chips used in USB drives and smaller devices, such as digital cameras. Srivastava said that data-center fundamentals are starting to decelerate for memory and that DRAM prices have “started to roll over the last 2-3 months.” “And if we had thought that the weakness in pricing was short term in nature, we probably would not have changed our view on the shares — especially given what continues to be a largely rational industry,” Srivastava said. “We probably would not have changed our rating if we had believed that the weakening spot pricing was a one quarter phenomena.” BMO’s downgrade follows one from Wedbush analyst Matt Bryson earlier in the month that cited weak chip pricing. Back in late March, analysts had debated how resilient Micron would be during the COVID-19 pandemic, when shelter-in-place and work-from-home initiatives ballooned demand for digital and cloud infrastructure. In late May, however, Micron boosted its outlook for the fiscal third quarter, and analysts modified their estimates accordingly. Analysts surveyed by FactSet expect fiscal third-quarter earnings of 74 cents a share on revenue of $5.26 billion from Micron, compared with $1.05 a share on revenue of $4.79 billion in the year-ago period. Back in March, the third-quarter earnings consensus from analysts was 55 cents a share on revenue of $4.92 billion. Orders for data-center servers increased in the second quarter because of “the gradual easing of supply-chain disruptions from the COVID-19 pandemic,” according to TrendForce Corp.’s DRAMeXchange research division. “Server demand in 1H20 has primarily benefited from applications in the pandemic-driven stay-at-home economy, such as teleconferencing and media streaming,” DRAMeXchange said on Monday. “However, as the inventory of [original design manufacturer] server barebones accumulates in 3Q20, [cloud service providers] are projected to abate their server orders; server unit shipments are thus expected to either hold flat in 3Q20 or undergo a slight QoQ dip.” “Looking at 2020 in its entirety, the data-center server demand from CSPs is projected to lead to a YoY growth of around 5% in global server shipments,” DRAMeXchange said. On the other hand, Wells Fargo analyst Aaron Rakers, who has an overweight rating and a $65 price target, said last week that he thinks the concern of a DRAM downturn is “overdone,” ahead of Micron’s earnings report scheduled for Monday after the close of markets. “While we expect Micron to offer up cautious comments on 2H2020 cloud demand/capacity digestion, our industry checks continue to point to only a moderate (1-2 week) server DRAM inventory build at major cloud vendors; most notable inventory builds seen at system OEMs, in our opinion,” Rakers said. Cowen analyst Karl Ackerman, who has an outperform rating and a $65 price target, remained steadfast in his estimation of Micron. Ackerman said that Micron “has improved its technology position vs. peers across both DRAM and NAND, arguing for structurally improved profitability.” Of the 36 analysts who cover Micron, 27 have buy or overweight ratings, eight have hold ratings, and one has a sell rating, along with a $62.59 average price target, according to FactSet data. For the year, Micron shares are off 7%, while the SOX is up 8%. Meanwhile, the S&P 500 is down and the Nasdaq is up 13%."}]}