{"article": [{"url": "https://www.marketwatch.com/story/stock-futures-struggle-for-direction-after-wednesday-drop-as-investors-await-jobless-claims-2020-09-24", "published": 1600967180.0, "headline": "Dow ekes out gain in turbulent trade as Wall Street struggles to shrug off market uncertainty", "body": "Stock benchmark indexes ended with modest gains Thursday, reflecting a market that has struggled to find its footing amid signs of softening economic data and a raft of uncertainties ahead. How did major benchmarks fare? The Dow Jones Industrial Average DJIA, +0.56% rose 52.31 points, or 0.2%, to close at 26,815.44, after touching an intraday peak of 27,094.85. The S&P 500 SPX, +0.87% picked up 9.67 points, or 0.3%, to end at 3,246.59, after earlier breaching a level below correction territory — defined as a drop of 10% from a recent peak — for the index at 3,222.76. The Nasdaq Composite Index COMP, +1.39% gained 39.28 points, or 0.4%, finishing at 10,672.27. What drove the market? Stocks were wobbly for most of Thursday, as investors waded through a morass of issues, including rancor on Capitol Hill, which has overshadowed progress on another pandemic spending bill. Market participants worry a lack of fresh stimulus would derail an economic rebound. In a bid to restart negotiations, House Democratic lawmakers have begun to prepare a new $2.4 trillion coronavirus aid package, $1 trillion smaller than their previous proposed bill, according to multiple published reports on Thursday. The news may have helped provide stocks with a brief boost in the last hour of trading Thursday, even though the discussed aid still eclipses the $500 billion package Senate Republicans proposed earlier this month. The size and scope of previous additional aid have been key sticking points that led prior rounds of talks to break down. Fresh attempts to drum up support for more aid for households, businesses and cities come as a weekly report in unemployment claims showed that job gains in the aftermath of the pandemic may be stalling, raising further fears about the shape of the U.S. economic recovery. Jobless claims rose 4,000 to 870,000, the Labor Department said Thursday, reflecting that slightly more Americans applied for state unemployment benefits in the week ended Sept. 19 than in the prior week. Economists surveyed by MarketWatch had been looking for claims to decline to 850,000. Claims in the prior week were raised 6,000 to 866,000. “While jobless claims under a million for four straight weeks could be considered a positive, we’re staring down a pretty stagnant labor market,” wrote Mike Loewengart, managing director for investment strategy at E-Trade Financial Corp. US:ETFC, in emailed remarks. Without additional stimulus from Washington, “jobless Americans will likely continue to exist in limbo,” Loewengart said. “Further, a shaky labor market translates into a skittish consumer, and in the face of a pandemic that seemingly won’t go away without a vaccine, the outlook for the economy certainly comes into question.” Remarks by Federal Reserve Chairman Jerome Powell in congressional testimony this week, as well as comments by other Fed policy makers, signaled that the central bank is taking a wait-and-see approach when it comes to further monetary stimulus beyond what’s already in place, while pointing to the need for Congress to act on fiscal stimulus. On top of that, fears of a contested presidential election on Nov. 3 also have begun to weigh on sentiment, analysts said. President Donald Trump on Wednesday refused to commit to a peaceful transition of power following the election, telling reporters “we’ll have to see what happens…I’ve been complaining very strongly about the ballots. And the ballots are a disaster.” Trump was referring to mail-in ballots, which he has asserted, without evidence, are prone to widespread fraud. Read:Why stock-market investors are starting to freak out about the 2020 election Trump also suggested the Supreme Court will have to make a ruling on the outcome of the election, emphasizing that a new justice, replacing Ruth Bader Ginsburg, should be confirmed before Election Day. “With an acrimonious battle over the Supreme Court nomination underway, it appears unlikely that a [stimulus] package will pass before the election,” said Mark Haefele, chief investment officer for UBS Global Wealth Management, in a note, though he remained confident that a bill would eventually be passed. Earlier in the session, markets briefly got a boost from solid housing figures. Sales of new single-family homes in August exceeded an annual rate of 1 million for the first time since 2006. New home sales occurred at a seasonally adjusted, annual rate of 1.011 million, the Census Bureau reported Thursday. That represents a 4.8% increase from a pace of 965,000 homes in July, which was raised from previous level. Compared with last year, new home sales are up 43%. Powell emphasized during a third day of congressional testimony Thursday that a fiscal package will be needed to keep the U.S. economy’s recent gains from sliding backward. “While the economy has been doing better than expected, I think there is downside risk,” Powell said. St. Louis Fed President James Bullard on Thursday said the U.S. economy is within reach of a nearly full recovery by the end of the year. Which companies were in focus? Shares of Penn National Gaming Inc. PENN, -1.50% fell 7.3% after announcing it would launch a public offering of 14 million shares. Accenture PLC ACN, +1.76% shares dropped 7% after the professional services and consulting company reported revenue and earnings that fell short of expectations. Shares of FedEx Corp. FDX, +0.18% rallied 1.2% Thursday, outpacing the Dow Jones Transportation Average DJT, +0.84%, after Stifel Nicolaus analyst David Ross turned bullish on the package delivery giant, citing signs that FedEx has been a beneficiary of the COVID-19 pandemic. Shares of E.W. Scripps Co. SSP, +0.45% rocketed 7.6% Thursday, after the TV station owner confirmed a deal to buy the broadcast network ION Media for $2.65 billion, in a deal backed by Warren Buffett. How did other markets fare? The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% fell 1.2 basis points at 0.664%. Bond prices move inversely to yields. The ICE U.S. Dollar Index DXY, -0.58%, a gauge of the greenback’s value relative to its major rivals, was virtually flat. Gold futures GCZ20, +2.17% gained $8.50, or nearly 0.5%, to settle at $1,876.90 an ounce, its first gain posed in four sessions.U.S. oil futures CLX20, -1.62% rose 38 cents, or nearly 1% to finish at $40.31 a barrel on the New York Mercantile Exchange. The pan-European Stoxx Europe 600 Index SXXP, +0.55% closed 1% lower and the U.K.’s benchmark FTSE 100 FTSE, +0.63% shed 1.3%. In Asia, Hong Kong’s Hang Seng Index HSI, -0.30% tumbled 1.8% and the Shanghai Composite Index SHCOMP, +1.67% closed 1.7% lower. Japan’s Nikkei NIK, -0.11% closed down 1.1%."}]}