{"article": [{"url": "https://www.marketwatch.com/story/pandemic-pc-boom-pushes-hp-sales-1-billion-higher-than-expected-stock-up-5-2020-08-27", "published": 1598603900.0, "headline": "Pandemic PC boom pushes HP sales $1 billion higher than expected", "body": "Continuing tech’s torrid earnings streak, HP Inc. shares are up 3% in premarket trading Friday after the company reported fiscal third-quarter sales that exceeded Wall Street estimates by $1 billion, thanks to a pandemic-influenced boom in personal-computer sales. HP HPQ, -0.15% reported net income of $734 million, or 52 cents a share, compared with net income of $1.2 billion, or 79 cents a share, in the year-ago quarter. Adjusted earnings were 49 cents per share, compared with 58 cents in the year-ago quarter. Revenue declined 2% to $14.3 billion from $14.6 billion a year ago, largely due to struggles in the company’s printing division, but demolished expectations by $1 billion. Analysts surveyed by FactSet forecast net income of 43 cents a share on sales of $13.3 billion. “PC sales were great. They have become essential. We are seeing a trend where there used to be one to two PCs per home; now, it is one per person at home because they are needed for work and learning,” HP Chief Executive Enrique Lores told MarketWatch in a phone call before the results were announced. “This is driving demand.” Reflecting its optimism, the company offered fourth-quarter adjusted earnings guidance of 50 cents to 54 cents a share. FactSet analysts had expected 50 cents a share. HP’s fiscal third-quarter performance benefited from ongoing demand for personal systems during the pandemic amid a remote-working and online-learning wave. PC sales improved 7% year-over-year. Patrick Moorhead, principal analyst at Moor Insights & Strategy, singled out “incredible” consumer PC revenue growth (42%, year-over-year) and notebook units (32%). “As mobility and high-powered, lightweight always-connected PCs become critical for not just the household, but every member in the household, we have seen demand soar,” Daniel Newman, principal analyst at Futurum, told MarketWatch. “HP has not only embraced this, but has been operationally efficient, which is a big driving factor in its beat on the top and bottom line.” The same held for Dell Technologies Inc. DELL, -0.39% and VMware Inc. VMW, +0.81% , both of whom reported brisk consumer PC demand in quarterly results Thursday. Read more: Dell, VMware shares rise on strength of working (and learning) from home HP’s quarter could have been even better, but supply constraints, as well as elevated components and logistics costs, pushed the printer business down 20%. Lores said he expected a bounceback in the current quarter as some commercial customers return. Office closures nationwide have undercut sales of printers and consumables for HP and others. Xerox Holdings Corp. XRX, -1.38% , which unsuccessfully pursued a $35 billion hostile bid for HP, last month reported a 38.5% decline in hardware sales in the June quarter. HP shares are down 9% this year. The broader S&P 500 index SPX, +0.87% is up 8% in 2020."}]}