{"article": [{"url": "https://www.marketwatch.com/story/asian-markets-gain-as-investors-look-ahead-to-fed-meeting-2020-09-13", "published": 1600041200.0, "headline": "Asian markets gain as investors look ahead to Fed meeting", "body": "Asian shares rose Monday, despite the rollercoaster ride that closed Wall Street last week, as traders awaited cues from the U.S. central bank expected later in the week. Japan’s ruling Liberal Democratic Party was set to pick a new leader, who will by definition become the prime minister because of the party’s control over the more powerful lower house of Parliament. Favored to win is veteran ruling party politician, Yoshihide Suga, who will continue Shinzo Abe’s “Abenomics” policies of easy lending and deregulation. “That decision should not be market moving as we fully expect a steady hand to remain on the tiller of Abenomics. Mr. Suga has signalled that no further rises in sales tax are on the horizon, but all else should stay the same,” said Jeffrey Halley, senior market analyst at Oanda. “Of more interest will be if Mr. Suga signals that a new election will be held to mandate his new government,” Halley said. Japan’s Nikkei 225 NIK, -0.11% gained 0.7%. Hong Kong’s Hang Seng HSI, -0.30% gained nearly 1%, while the Shanghai Composite SHCOMP, +1.67% rose 0.6%. Australia’s S&P/ASX 200 XJO, +0.00% added 0.6% while South Korea’s Kospi 180721, +0.21% jumped 1%. Stocks were about flat in Singapore STI, -0.39% , but rose in Taiwan Y9999, +1.10% and Indonesia JAKIDX, +0.28% . SoftBank 9984, -1.24% , which announced Sunday that it was selling Britain’s Arm Holdings to computer graphics chip company Nvidia NVDA, -0.54% for $40 billion, jumped 9.4% in morning trading. SoftBank spent $32 billion to acquire Arm in 2016. Nvidia is best known for its graphics processing chips, while Arm is renowned as an innovator in the “Internet of Things.” Also on players’ radar screen is the Federal Reserve Open Market Committee, which is meeting later in the week. The Federal Reserve’s massive aid for the economy has helped underpin the markets’ recovery from the coronavirus downturn by slashing short-term interest rates to record lows and buying up bonds to support markets. The Bank of Japan also is due to hold a policy meeting this week. No major changes are expected in its ultra-lax monetary policies. Stephen Innes, chief global market strategist at AxiCorp, noted that investors face “many uncertainties,” including the U.S. elections and the global pandemic. “Unquestionably the virus story is the dominant macro pivot event, especially for equities, and is more likely to be dominated by optimism surrounding a vaccine. Indeed investors will be keeping their eye on the vaccine prize,” he said. On Wall Street, the S&P 500 SPX, +0.87% rose 1.78, or 0.1%, to 3,340.97 after a day of the lightning-quick shifts in momentum that have rocked Wall Street recently. The Nasdaq composite COMP, +1.39% , which includes many of the superstar tech stocks that have been the focus of the market’s recent selling, lost 0.6% to 10,853.55 after also flip-flopping between gains and losses. The Dow Jones Industrial Average DJIA, +0.56% rose 0.5%, to 27,665.64. Analysts expect swings to continue to rattle markets for weeks, if not months, as investors wait for more clarity on several key issues. At the head of the list of uncertainties is what to do with Big Tech stocks, which critics have long said were due for a slide after soaring too high through the summer. In energy trading, benchmark U.S. crude US:CLV20 rose 12 cents to $37.45 a barrel in electronic trading on the New York Mercantile Exchange. Brent crude UK:BRNX20 , the international standard, stood unchanged at $39.83 a barrel. The U.S. dollar USDJPY, -0.38% inched down to 106.12 Japanese yen from 106.16 yen on Friday."}]}