{"article": [{"url": "https://www.marketwatch.com/story/new-labor-department-rule-changes-default-retirement-plan-disclosure-from-paper-to-electronic-2020-06-29", "published": 1594734740.0, "headline": "This one change could undermine the retirement security of millions of Americans", "body": "A previous version of this column incorrectly stated the number of Americans impacted by the new plan. It has been corrected. Paper will become a thing of the past for many retirees. Getty Images/iStockphoto On May 27 the U.S. Department of Labor (DOL) issued a new rule that would shift the way participants receive information about their retirement plan. To date, the default has been paper, with the participant having the ability to opt for electronic delivery. The new rule makes it much easier for plan administrators to make electronic delivery the default. This shift will undermine the retirement security of millions of American households. When Congress passed the Employee Retirement Income Security Act (ERISA) in 1974, it made clear that participants needed key information to understand their benefits and enforce their rights. The legislation ensured that participants and their beneficiaries were legally entitled to information about the rules governing the plan, the benefits they earned, the rights of surviving spouses, etc. Longstanding regulations have provided that, unless workers use a computer as an integral part of their jobs — so-called “wired at work” — or affirmatively tell the plan administrator that they would like to go paperless, workers and retirees must receive information about their retirement plan on paper, sent through the mail. Under the new rule, workers and retirees would be given a one-time paper notice telling them future information about their plan will be provided electronically unless they opt out and request paper. Opting out can seem a complex procedure and, given the importance of inertia emphasized by behavioral economists, most workers and retirees will not pursue that option. As a result, they will find themselves left with only electronic access to information about their plan. Even though plans will be required to notify participants when new documents are available, participants may need to enter passwords and search complex websites to find out their 401(k) balances and fees or the investment practices and cutbacks of their defined-benefit plans. Moreover, the rule generally requires documents to be made available for only one year, so participants would not have a permanent record unless they download and save documents themselves. More important, millions of older Americans do not use the internet regularly — including many lucky enough to have a retirement plan. Specifically, the Health and Retirement Study, a longitudinal survey of people ages 50 and older, asked “Do you regularly use the internet (or the World Wide Web), for sending and receiving email or for any other purpose, such as making purchases, searching for information, or making travel reservations?” Even limiting the population to just those people with either a defined-benefit plan or a 401(k)-type arrangement, the responses show that 14% of individuals ages 55-64 and 34% of individuals 65+ do not use the internet regularly. That means 15 million Americans will have no way to get information about their plan unless they opt out of the new default — something they are unlikely to do. The tragedy, of course, is that those most hurt by this new DOL rule are lower-income individuals. They have borne the brunt of the pandemic and the shutdown of the economy, and this new rule seems like such an unnecessary additional affront at this time."}]}