{"article": [{"url": "https://www.marketwatch.com/story/gold-remains-higher-after-rise-in-u-s-jobless-claims-11602162564", "published": 1602166520.0, "headline": "Gold settles higher on renewed prospects for another round of U.S. stimulus", "body": "Agence France-Presse/Getty Images Gold rose Thursday to stage a partial rebound from a more than one-week low a day earlier, buoyed by optimism over the renewed prospects for some sort of U.S fiscal stimulus. Prices held onto their gains after data on Thursday showed a larger-than-expected reading on U.S. first-time jobless claims. Gold sank when President Donald Trump pulled the plug on fiscal stimulus negotiations with Congress, reducing the prospect of more reflationary deficit spending, but the precious metal has found support as House Speaker Nancy Pelosi and Treasury Secretary Steven Mnuchin “talk about airline rescues and Trump says he wants more $1,200 [stimulus] checks, Adrian Ash, director of research at BullionVault, told MarketWatch. Gold for December delivery GCZ20, +2.17% on Comex climbed by $4.30, or 0.2%, to settle at $1,895.10 an ounce, while December silver SIZ20, +5.96% gave up earlier gains to finish with a loss of 2 cents, or 0.08%, at $23.876 an ounce. Gold held early gains after data showed first-time jobless claims fell to 840,000 last week from an upwardly revised 849,000 a week earlier, highlighting the need for more government spending to support the economic recovery from the coronavirus pandemic. Economists surveyed by MarketWatch had forecast a fall to 820,000. Gold’s downtrend since August “remains very much intact, despite the recovery since late September. A break through this week’s highs may make things more interesting though and could represent a momentum shift,” said Craig Erlam, senior market analyst at Oanda, in a note. “While I still think the decline since August is a corrective action, with more upside to come in the medium term, I remain unconvinced that the correction has run its course,” he said. “There’s clear support below around $1,850, if this goes then $1,800 could quickly come under pressure.” Other metals on Comex finished on a mixed note. December copper HGZ20, +1.38% tacked on 0.3% to $3.042 a pound. January platinum PLF21, +3.84% lost 0.3% to $864 an ounce, while December palladium PAZ20, +2.31% added 0.9% to $2,403 an ounce."}]}