{"article": [{"url": "https://www.marketwatch.com/story/struggling-with-how-to-care-for-your-elderly-loved-ones-these-experts-can-help-2020-10-07", "published": 1602162980.0, "headline": "Struggling with how to care for your elderly loved ones? These experts can help", "body": "Eldercare is rarely easy, even for the experts. Researchers on aging, senior care consultants and others in the field face the same challenges that beset many harried midcareer professionals with ailing parents. They try to make prudent decisions, often under duress, as their mom or dad struggle with health issues. Eldercare experts confront the tough choices and unrelenting stress that vex the rest of us when a parent needs help. But they know stuff that we don’t. They’re familiar with the range of care options and how to engage anxious parents in the process. “The most important thing to remember is that your parents are not children,” said Catharine Shepard, president of Senior Care Referral Specialists in Temecula Valley, Calif. “Parents need to feel as much power as possible. They don’t want to be dictated to.” She practiced what she preaches when guiding her elderly mother to decide to move into an assisted living facility. At the time, her mother was living with Shepard and her husband in their home. “One day I walked into the living room and saw my mother watching TV with her eyes glazed over and her mouth hanging wide open,” Shepard recalled. “I thought, ‘That’s not my mother.’” Her health was fine, but she wasn’t getting the social stimulation that she craved. Shepard and her husband worked full time, leaving her mother with little to do around the house. With her background in eldercare consulting, Shepard knew that seniors need social engagement to fight off isolation. So she took steps to encourage her mother to move into a lively community of her peers. “Loneliness can be horrific,” she said. “People say, ‘Oh, my mom and dad will never move from their home.’ But they may not realize that for some seniors, it’s better for them to be around more people and have more activities.” Soon after seeing her mother transfixed in front of the television, Shepard told her, “Mom, we need to recognize you’re a very friendly person and you enjoy being around others. It seems you might be missing some of that because we work full time. What do you think?” Initially, her mother expressed little interest in a change of scenery. But Shepard kept asking supportive, nonthreatening questions and letting her mother convince herself that it might make sense to explore a move. “Let’s look at some options and you can decide,” she told her mother. “What if, from an educational standpoint, we visit a few places?” Treating it like an outing, they toured a handful of assisted living facilities. Free of pressure, her mother eventually elected to move. “Within two weeks, she was so busy over there that I’d never find her in her room,” Shepard said. Her mother lived about five more years and died at age 94 in 2016. Researchers who study senior living communities have an advantage over those of us who lack familiarity with the different service models that cater to older people. If elderly parents face declining physical or mental health, options can range from keeping them at home with on-site aides working in shifts to adult day care to nursing homes to hospice. Gale Morgan sampled some of those services when coordinating care for her father with dementia. She’s a senior vice president at Mather, an Evanston, Ill.-based nonprofit organization that focuses on older adults. “I knew categories of care he could navigate and the questions to ask to find the best ones,” she said. To identify top memory care units, for example, she gathered data on staffing ratios, regulatory licenses and deficiencies. But she also drilled deeper. “I asked how often they do bathing and what does bathing look like,” she said. “I also asked about their care philosophy: Do they wake up everyone at 8 a.m. to eat or do they let residents get up and eat whenever they want? And do they help those who need it to eat—or just lead them to the table?” Still, even the experts overlook key steps. Morgan wishes that she had asked her parents about their lifestyle preferences when they were still at full health. “Instead, we didn’t have those critical conversations until there was a care need,” she said. “Had we talked early on about what they wanted their retirement lifestyle to look like and the best care environment [for that lifestyle], my parents would’ve moved into a continuing care retirement community. But by then, it was too late.”"}]}