{"article": [{"url": "https://www.marketwatch.com/story/temporary-layoffs-are-becoming-permanent-job-losses-11601412492", "published": 1601554700.0, "headline": "Temporary layoffs are becoming permanent job losses", "body": "As the duration of unemployment lengthens, it become more likely that the job loss is permanent, not just a temporary furlough. Despite recent positive economic reports, the U.S. economy is in a precarious position. Right now, the economy is dependent on the consumer’s ability to spend. Yet we know that current consumer spending numbers and habits are inflated; retail sales returned to pre-pandemic numbers over the summer, but this was largely due to boosted unemployment benefits. For the first time ever, personal income stayed high despite a high unemployment rate and a drop in labor compensation. Preview of Friday’s jobs report: U.S. September job report is going to show economy entering a weaker phase Don’t be fooled by the numbers. If Americans don’t come back to work or receive more government assistance, the consumer—and the economy—will finally be faced with the realities of the recession. Breaking news: Consumer spending climbs in August even as disposable incomes fall When the pandemic initially started the thought was that unemployment was going to be “temporary” and many who were laid off or furloughed would be returning to their jobs in short measure. This is not what is happening. Temporary layoffs are turning into permanent job losses, as reflected in August’s jobs report numbers. This could be attributed to a couple of factors. The Paycheck Protection Program for businesses, which provided support to keep additional workers employed, has expired. For some industries, such as the airline industry, the government funding was contingent on halting layoffs until the end of the third quarter—Sept. 30. This is why we are starting to see layoffs now, and is a trend that could continue well into the fourth quarter. Another factor is that businesses that had planned to close only temporarily have now decided to close permanently. Gone: COVID-19 could force up to half of New York City restaurants and bars to close for good According to the Q2 2020 Yelp Economic Average report, in April 2020, 79% of closed businesses said they were closing temporarily, while 21% announced permanent closings. Over the months that followed, the number of permanently closed businesses have steadily grown, while the inverse has been happening for temporary closings. By July, we saw the number of permanently closed businesses rise to more than 50% of the total number announced closings. Large corporations — including Ford F, -1.36%, MGM Resorts MGM, -2.59%, Coca-Cola KO, +0.69%, Salesforce CRM, +2.21% and Boeing BA, -0.39% — are announcing that furloughs are now becoming layoffs as the economic recession persists. This is a structural shift in the way we classify unemployment, which is on the rise, despite the fact that August unemployment numbers exceeded expectations. Read: Disney to lay off 28,000 workers, exec says California ‘exacerbated’ pandemic’s effects In reality, the number of marginally attached workers” is up. These people are not working and want a job, but haven’t actively searched for one in the last four weeks and therefore are not counted as unemployed. This could be because they are hesitant to return to the workforce or potentially don’t have coverage for child care or are home schooling. The bottom line is that without an additional stimulus, there is an impending “income cliff,” which will create a significant blow to the economy in the fourth quarter. This will be the first time in 2020 when real disposable income will drop to pre-pandemic levels and when the consumer will truly feel the impact of the current recession. Since we know that the health of the U.S. economy hinges on the spending ability of consumers, this approaching cliff will reverberate throughout the economy as we enter 2021. Also read: Private-sector job growth in September is strongest in three months: ADP Danielle Marceau is a senior economist at Prevedere."}]}