{"article": [{"url": "https://www.marketwatch.com/story/jeffrey-epstein-confidante-ghislaine-maxwell-reportedly-arrested-in-new-hampshire-2020-07-02", "published": 1593694040.0, "headline": "Jeffrey Epstein confidante Ghislaine Maxwell arrested in New Hampshire", "body": "British socialite Ghislaine Maxwell was arrested by the FBI on Thursday on charges she helped procure underage sex partners for financier Jeffrey Epstein. An indictment made public Thursday said Maxwell, who lived for years with Epstein and was his frequent travel companion on trips around the world, facilitated Epstein’s crimes by “helping Epstein to recruit, groom, and ultimately abuse “ girls as young as 14. It also said she participated in the sexual abuse. Epstein, 66, authorities determined, killed himself in a federal detention center in New York last summer while awaiting trial on sex trafficking charges. See:Attorney General Barr says Epstein’s death was a ‘perfect storm of screw-ups’ Maxwell has, for years, been accused by many women of recruiting them to give Epstein massages, during which they were pressured into sex. Those accusations, until now, never resulted in criminal charges. The indictment included counts of conspiracy to entice minors to travel to engage in illegal sex acts, enticement of a minor to travel to engage in illegal sex acts, conspiracy to transport minors with intent to engage in criminal sexual activity, transportation of a minor with intent to engage in criminal sexual activity and two counts of perjury. “Maxwell lied because the truth, as alleged, was almost unspeakable,” Audrey Strauss, the acting U.S. attorney in Manhattan, said at a news conference Thursday afternoon. She called the charges against Maxwell a “prequel” to the charges prosecutors brought last summer against Epstein. Messages were sent Thursday to several of Maxwell’s attorneys seeking comment. She has previously repeatedly denied wrongdoing and called some of the claims against her “absolute rubbish.” Among the most sensational accusations was a claim by one Epstein victim, Virginia Roberts Giuffre, that Maxwell arranged for her to have sex with Britain’s Prince Andrew at her London townhouse. Giuffre bolstered her allegations with a picture of her, Andrew and Giuffre that she said was taken at the time. Andrew denied her story and Maxwell, 58, said in one deposition that Giuffre was “totally lying.” Andrew was not mentioned by name in the indictment, and the charges covered Maxwell’s dealings with Epstein only in the period from 1994 through 1997, a period well before his alleged encounters with Giuffre in 2001. Brad Edwards, an attorney who represents Giuffre and several other Epstein victims, said his clients were relieved by the charges. “Today is a very good day,” he said. The indictment focused on Epstein’s alleged abuse of three specific girls at his Manhattan mansion and other residences in Palm Beach, Fla.; Sante Fe, N.M.; and London. Their names were not revealed in court filings. The indictment mirrored many of the claims previously made in civil lawsuits against Maxwell, saying she would “entice and groom” minor girls by asking them about their lives, their schools and their families. “Through this process, Maxwell and Epstein enticed victims to engage in sexual activity with Epstein. In some instances, Maxwell was present for and participated in the sexual abuse of minor victims,” the indictment said. The indictment said Maxwell repeatedly lied when questioned about her conduct. It says she committed perjury in 2016 in a deposition in a civil lawsuit, in part by denying knowledge of Epstein’s scheme to recruit underage girls. At the time the crimes occurred, Maxwell was in an intimate relationship with Epstein and also was paid by him to manage his various properties, according to the indictment, which included a photograph of Epstein with his arm around Maxwell and his head nuzzling hers. Epstein was initially investigated in Florida and pleaded guilty to state charges in 2008 that allowed him to avoid a lengthy prison sentence. He was free a little after a year in prison. At the time, a federal prosecutor in Florida signed off on an agreement, initially filed in secret, that barred the federal government from charging “any potential co-conspirators of Epstein.” Alexander Acosta, President Donald Trump’s former labor secretary, resigned last year after coming under fire for overseeing that deal when he was U.S. attorney in Miami. Geoffrey Berman, the former U.S. attorney in Manhattan, argued that federal prosecutors in New York were not bound by that agreement and brought a sweeping indictment against Epstein. Berman vowed to continue seeking justice for Epstein’s victims even after the financier’s death but was abruptly fired last month by President Donald Trump after a standoff with Attorney General William Barr. Maxwell’s indictment was celebrated by lawyers for some of Epstein’s accusers. Jennifer Araoz, a woman who says Epstein raped her in his New York mansion in 2002 when she was 15, said she feared the financier’s ring of conspirators for years. “Now that the ring has been taken down, I know that I can’t be hurt anymore,” Araoz, now 33, said in a statement. “Day after day, I have waited for the news that Maxwell would be arrested and held accountable for her actions. Her arrest is a step in that direction, and it truly means that the justice system didn’t forget about us.” Spencer T. Kuvin, who represents some of the women, said Maxwell was “hopefully be the first of many co-conspirators to face the consequences of this horrific crimes.” Maxwell was described in a lawsuit by another Epstein victim, Sarah Ransome, as the “highest-ranking employee” of Epstein’s alleged sex-trafficking enterprise. She oversaw and trained recruiters, developed recruiting plans and helped conceal the activity from law enforcement, the lawsuit alleged."}]}