{"article": [{"url": "https://www.marketwatch.com/story/a-body-blow-to-gender-equality-child-care-centers-struggle-to-reopen-while-others-may-raise-prices-to-survive-11601025894", "published": 1601371160.0, "headline": "â\u0080\u0098A body blow to gender equalityâ\u0080\u0099: Child-care centers struggle to reopen, while others may raise prices to survive", "body": "'The pandemic is just another layer of burden that we’re putting on women who want to be productive and want to work,' said economist Misty Heggeness. (Photo: iStock/Fly View Productions.) The U.S. child-care system is buckling under the weight of the coronavirus pandemic, new data suggests â\u0080\u0094Â and economists warn that a lack of feasible options during the economic downturn could leave some working mothersâ\u0080\u0099 careers in the lurch. After COVID-19 forced the closure of many child-care providers across the country, most states allowed for their reopening, according to a report published Thursday by the nonprofit Child Care Aware of America, which advocates for access to affordable child care. But 35% of child-care centers and 21% of family child-care programs in the country remained closed as of July.Â â\u0080\u009cTime will tell if these closures become permanent. If they do, this will pose a serious problem as our nation works to rebuild the economy,â\u0080\u009d the report authors wrote. â\u0080\u009cFor our economy to regain strength, we must have a steady, reliable workforce who arenâ\u0080\u0099t distracted by child-care worries.â\u0080\u009d The organization also suggested that child care could become more costly due to factors such as reduced capacity necessitated by physical distancing, supplies including personal protective equipment, training on new safety measures and communication of protocols to employees and parents.Â Changes to some statesâ\u0080\u0099 child-care licensing rules also allow for fewer children per classroom in an effort to prevent virus transmission, the report added.Â Meanwhile, more than half of the 32 states that provided July data had lost over a quarter of their child-care capacity, according to Child Care Aware. While child-care attendance and enrollment appear to have picked back up since plunging at the beginning of the pandemic, they hover below their levels at the start of the year â\u0080\u0094 offering â\u0080\u009cfurther evidence that child-care providers are struggling financially and many programs may not survive COVID-19,â\u0080\u009d the authors wrote. “ â\u0080\u0098A system that was already fragmented, unaffordable and inequitable was further weakened.â\u0080\u0099 ” â\u0080\u0094 Child Care Aware of Americ â\u0080\u009cOnce providers permanently leave the field, parents who were already struggling to find affordable child care that works for them will be at an even bigger disadvantage,â\u0080\u009d they said. States are still compiling new price information from providers, the report said, and â\u0080\u009cit may be at least a year before families feel the full impactâ\u0080\u009d of the coronavirus crisis on child-care affordability. Last March, Congress approved the Families First Coronavirus Response Act, the initial coronavirus relief bill. The new law requires small employers to provide limited paid-leave benefits to employees who are affected by the coronavirus emergency. However, companies with more than 500 employees are exempt, and companies with fewer than 50 employees can also apply for an exemption. A separate analysis published this month by the Center for American Progress, a left-leaning think tank, estimated that center-based child care that adheres to â\u0080\u009cenhanced health and safety requirementsâ\u0080\u009d cost 47% more on average than the cost of fulfilling requirements prior to the pandemic, an increase spurred largely by reduced program capacity and extra sanitation-related purchases. The cost of home-based family child care, moreover, has risen 70% on average since pre-COVID-19 times. Average monthly cost increases in center-based care â\u0080\u0094 just like child-care costs in general â\u0080\u0094 have varied widely by state, according to the organizationâ\u0080\u0099s â\u0080\u009cinteractive calculatorâ\u0080\u009d: South Dakota, for example, saw an estimated 8% increase from $777 before the pandemic to $842 during the crisis, while Georgia had a 115% increase from $548 to $1,177. As Child Care Aware notes, many families struggled to afford high-quality child care even before the pandemic struck, and child-care supply was already in decline. â\u0080\u009cA system that was already fragmented, unaffordable and inequitable was further weakened,â\u0080\u009d the authors wrote. So what does this all mean for working parents? â\u0080\u009cA lack of quality and affordable child care for working parents means that less parents are going to be working, and this is disproportionately going to affect more vulnerable groups who either A, have less resources, or B, traditionally are the ones responsible for taking care of kids,â\u0080\u009d Misty Heggeness, a principal economist and senior advisor at the U.S. Census Bureau, told MarketWatch. â\u0080\u009cThe two groups Iâ\u0080\u0099m thinking of are working moms and also families at the lower end of the earnings distribution,â\u0080\u009d she added. â\u0080\u009cI would also argue that that comfortably reaches up into middle-income families as well, especially as child-care costs continue to rise.â\u0080\u009d “ â\u0080\u0098A lack of quality and affordable child care for working parents means that less parents are going to be working.â\u0080\u0099 ” â\u0080\u0094 Misty Heggeness, an economist at the U.S. Census Bureau If child care isnâ\u0080\u0099t available and one parent needs to stay home with the kids, parents generally make the decision based on who in the family can make more money in the labor market, Heggeness said. In about 70% of dual-earner different-sex couples, men are the higher-earning partner, research has shown.Â â\u0080\u009cThat means that disproportionately, when thereâ\u0080\u0099s no child care available or itâ\u0080\u0099s too expensive, itâ\u0080\u0099s going to be the moms who are stepping back to take care of kids because their earnings arenâ\u0080\u0099t as high as their spouseâ\u0080\u0099s,â\u0080\u009d she said. â\u0080\u009cWomen will put their careers on the back burner to deal with the immediate emergency.â\u0080\u009d Â Over their entire adult working-age lifespan, then, these womenâ\u0080\u0099s total lifetime earnings will be less than they would have been otherwise, she said. Indeed, salaries and promotions start to diverge after heterosexual couples have children: A 2018 working paper distributed by the National Bureau of Economic Research and using Danish administrative data, for example, found that womenâ\u0080\u0099s incomes dropped almost 30% after the arrival of their first kid and never recovered. They also began to fall behind men in occupational rank. â\u0080\u009cThe pandemic is just another layer of burden that weâ\u0080\u0099re putting on women who want to be productive and want to work,â\u0080\u009d Heggeness said. â\u0080\u009cIt has the potential to hurt their careers.â\u0080\u009d Picture, for example, that an employer delegated tasks or assigned leaders for a new project during the early months of the pandemic, when many mothers had to step away from work to balance schooling or child care, Heggeness said. “ â\u0080\u0098Delays in promotion equal delays in pay increases.â\u0080\u0099 ” â\u0080\u0094 Misty Heggeness Those mothers would probably have had less of an ability to take on new roles and responsibilities for the project â\u0080\u0094 leaving coworkers without kids and men without the same level of child-care obligations to fill that space. Company leadership would, in turn, be more likely to consider those people for future opportunities and career advancement, she said. â\u0080\u009c[These womenâ\u0080\u0099s] ability to advance in the company is going to be delayed, and that in turn delays their ability to maximize their earnings,â\u0080\u009d Heggeness said. â\u0080\u009cDelays in promotion equal delays in pay increases.â\u0080\u009d Diane Swonk, the chief economist at the audit and tax firm Grant Thornton, told MarketWatch the child-care crisis â\u0080\u009chas the potential to metastasize into something that lowers our ability to grow going forward.â\u0080\u009d More than half of the 3.7 million people who have dropped out of the labor force since February are women, she said, pointing in particular to the pandemicâ\u0080\u0099s disproportionate economic impact on Black and Hispanic women. â\u0080\u009cThe blow is not only to low-wage households who can least afford it, but itâ\u0080\u0099s a gender issue across the board in terms of the pipeline to lead,â\u0080\u009d Swonk said. â\u0080\u009cIt has the potential to set back women not just in 2020, but for years to come. Itâ\u0080\u0099s a body blow to gender equality.â\u0080\u009d Child Care Aware called for $50 billion in dedicated public funding for the child-care system, improved mechanisms for data collection and dissemination, and additional investment in child-care resource and referral agencies (CCR&Rs) to provide resources for providers, kids and families. While itâ\u0080\u0099s great that many parents with resources have been able to create â\u0080\u009cDIY educational podsâ\u0080\u009d to salvage some work time while their children are in virtual school, Heggeness added, it would be even better if they mobilized themselves into a larger effort to help all parents. â\u0080\u009cIt would be neat if parents would instead put that energy into advocating for national solutions to this problem â\u0080\u0094 to insist to policymakers that we need solutions that are going to work for everyone in our society, that child care is an essential and critical component of a thriving and healthy economy,â\u0080\u009d she said."}]}