{"article": [{"url": "https://www.marketwatch.com/story/fact-checks-undercut-pence-and-other-convention-speakers-on-economy-jobs-veterans-health-care-and-policing-2020-08-27", "published": 1598537660.0, "headline": "Fact checks undercut Pence and other convention speakers on economy, jobs, veterans, health care and policing", "body": "WASHINGTON (AP) — Vice President Mike Pence and fellow Republicans pressed a distorted case Wednesday that President Donald Trump inherited a moribund economy from President Barack Obama and supercharged it. That’s not what happened. Speakers at the Republican National Convention also hailed Trump for protecting the health insurance of people with preexisting illness, flipping reality on its head as his administration tries to overturn the law that guarantees those protections. A look at how some of the rhetoric from the convention’s third night compares with the facts: On the economy Mike Pence: “Four years ago we inherited ... an economy struggling to break out of the slowest recovery since the Great Depression. ... In our first three years we built the greatest economy in the world.” The facts: That’s a highly misleading portrait. Obama started the longest expansion in U.S. history and prevailed over most of it. The expansion was indeed slow, but growth under Trump has basically been the same: 2.3% in the final four years of Obama compared with 2.5% in the first three years of Trump. Trump took office with unemployment at a low 4.7%, steady job growth and a falling federal budget deficit. “ Democratic presidential nominee Joe Biden does not propose defunding the police, and has said so explicitly, but rather giving them more money, conditioned on improvements in policing practices. ” And Trump’s record on economic growth is about to get crushed by the current recession brought on by the pandemic, a public health crisis that the White House said early on would not hurt the economy. Gov. Kristi Noem of South Dakota: “In just four years, President Trump has lifted people of all races and backgrounds out of poverty. He shrunk government and put money back into the pockets of hardworking, ordinary Americans.” The facts: Only this is true: Many Americans did get money back in the form of tax cuts and in direct government payments after the economy plunged into a recession this year as the coronavirus pandemic set in. Everything else is wrong. The government is still huge, not shrinking, as Noem said. Federal spending was 20.6% of gross domestic product in 2016, Obama’s last year, according to the White House Office of Management and Budget. That percentage has gone up and down but was 20.8% in 2019. It probably surged this year due to the fastest and sharpest downturn in modern U.S. history. The pandemic-induced recession has also flung millions of Americans back into poverty — as expanded government aid has expired. The unemployment rate is 10.2%, versus 4.7% when Trump took office. There are 14.8 million Americans collecting jobless aid, while just 2 million were doing so when Trump became president. See:Weekly U.S. initial jobless claims fall to 1 million and have been at or above the million mark every week but one since the advent of the pandemic On policing Pence: “When asked whether he’d support cutting funding to law enforcement, Joe Biden replied, ‘Yes, absolutely.’ Under President Trump, we will always stand with those who stand on the thin blue line, and we’re not going to defund the police.” The facts: That’s misleading, reliant upon a selective use of Biden’s words on the subject. Biden does not propose defunding the police, and has said so explicitly, but rather giving them more money, conditioned on improvements in policing practices. Biden’s actual position on this has been ignored at the GOP convention. Pence is referring to an excerpted video clip of Biden’s conversation with the liberal activist Ady Barkan. In the fuller conversation, Biden declined to support defunding police, his consistent stance. Don’t miss:Fact checking the Republican claim that Biden plans to defund the police, and Biden’s claim that Trump put brake on coronavirus tests Barkan raised the issue of police reform and asked whether Biden would funnel money into social services, mental health counseling and affordable housing to help reduce civilian interactions with police. Biden responded that he is calling for more money for mental health providers but “that’s not the same as getting rid of or defunding all the police” and that more money for community policing must be provided, too. Barkan asks: “So we agree that we can redirect some of the funding?” Biden then answers, “Absolutely, yes.” Biden then gave the caveat that he meant “not just redirect” federal money potentially but “condition” it on police improvements. “If they don’t eliminate chokeholds, they don’t get [federal] grants, if they don’t do the following, they don’t get any [federal] help,” Biden replied, noting federal aid is only a supplement to departments financed mainly by localities and states. On health care Kayleigh McEnany, White House press secretary: “I can tell you that this president stands by Americans with pre-existing conditions.” The facts: No, people with pre-existing medical problems have health-insurance protections because of Obama’s signature health-care law, which Trump is trying to dismantle. One of Trump’s alternatives to Obama’s law — short-term health insurance, already in place — doesn’t have to cover pre-existing conditions. Another alternative is association health plans, which are oriented to small businesses and sole proprietors and do cover pre-existing conditions. Neither of the alternatives appears to have made much difference in the market. Meanwhile, Trump’s administration is pressing the Supreme Court for a full repeal of the Obama-era law, including provisions that protect people with pre-existing conditions from health insurance discrimination. See:Despite pandemic, Trump administration urges Supreme Court to end Affordable Care Act With “Obamacare” still in place, pre-existing conditions continue to be covered by regular individual health insurance plans. Before the Affordable Care Act, any insurer could deny coverage — or charge more — to anyone with a pre-existing condition who was seeking to buy an individual policy. On Charlottesville Jack Brewer, former NFL player: “Are you going to allow the media to lie to you by falsely claiming that he said there are very fine white supremacists in Charlottesville? He didn’t say that. It’s a lie.” The facts: Trump said precisely this at a news conference: Racial protests in Charlottesville, Va., in 2017 had “very fine people on both sides.” One side was made up of a loosely connected mix of white nationalists, neo-Nazis and other far-right extremists. Key Words (Aug. 17, 2017):McConnell says there are ‘no good neo-Nazis’ after Trump’s ‘very fine people’ comment Key Words (Aug. 21, 2017):Paul Ryan: Trump ‘messed up’ his Charlottesville response Trump’s comment conveyed sympathy for racists by declining to single out and call out the violence they perpetuated and by suggesting the episode was merely a contest of legitimate grievances. The violence broke out after those protesters assembled to demonstrate against the city’s decision to remove a statue of Confederate Gen. Robert E. Lee. Pressed at the Aug. 15, 2017, news conference, Trump acknowledged there were “some very bad people” looking for trouble in the group protesting plans to remove the statue. “But you also had people that were very fine people on both sides,” he continued. “You had people in that group, excuse me, excuse me, I saw the same pictures as you did. You had people in that group that were there to protest the taking down of, to them, a very, very important statue and the renaming of a park, from Robert E. Lee to another name.” Later in the news conference, he tried to clarify that “I’m not talking about the neo-Nazis and the white nationalists — because they should be condemned totally.” But he went on to assert that the conspicuously racist rally — partly organized by white nationalist Richard Spencer and with former Ku Klux Klan head David Duke as a scheduled speaker — had many other people who weren’t white supremacists, and there are “two sides to a story ... two sides to the country.” On veterans Pence: “We reformed the VA, and Veterans Choice is now available for every veteran in America.” The facts: Veterans Choice is far from available to every veteran. It’s true that Trump expanded the Obama-era program, which allows veterans to see a private doctor for primary or mental-health care if their VA wait is 20 days (28 for specialty care) or their VA facility is 30 minutes or more away by car. But in March, the VA halted much of the program due to the coronavirus outbreak and restricted veterans’ access to private doctors, citing the added risks of infection and limited capacity at private hospitals. Under the temporary guidelines, the VA reviewed referrals for nonemergency care “on a case-by-case basis for immediate clinical need and with regard to the safety of the veteran when being seen in-person, regardless of wait time or drive time eligibility,” according to the VA. The move drew criticism from several veterans’ groups and conservatives as rendering the program ineffective. “ Minnesota’s sawmills lost 25 jobs under Obama, compared with 69 jobs lost during the first three years of the Trump administration. Paper mills did let go of 1,368 workers during Obama’s eight-year presidency, while 674 jobs have been shed under Trump. Nationwide, sawmill jobs improved under Obama and have declined during Trump’s first three years. ” On industrial jobs Scott Dane, representing Minnesota loggers and truckers: “But the last time Joe Biden was in the White House, Minnesota lost over half of its mills, thousands of jobs, and experienced nearly a decade of decline.” The facts: The decline in Minnesota’s sawmills and paper manufacturing has continued under Trump. And nationwide, sawmill jobs improved under Obama and slumped during Trump’s first three years. Minnesota lost 20% of its paper mills during Obama’s presidency, according to the Quarterly Census of Wages and Employment. It lost 18% of its sawmills. That’s a far cry from the “over half” claimed by Dane. The state’s sawmill sector lost 25 jobs under Obama, compared with 69 jobs lost during the first three years of the Trump administration. Paper mills did let go of 1,368 workers during Obama’s presidency, while 674 jobs were shed during the Trump era. But nationwide, the Obama era saw 7,221 new jobs in the sawmill sector. There were 69 sawmill jobs lost under Trump before the pandemic. Follow @APFactCheck on Twitter."}]}