{"article": [{"url": "https://www.marketwatch.com/story/lululemon-acquisition-mirror-could-generate-700-million-and-reach-600000-subscribers-by-2023-bank-of-america-2020-07-01", "published": 1593671240.0, "headline": "Lululemon acquisition Mirror could generate $700 million and reach 600,000 subscribers by 2023: Bank of America", "body": "With at-home fitness on the rise, in part due to the coronavirus pandemic, Bank of America analysts say Lululemon Athletica Inc.’s newly-acquired company Mirror could generate $700 million in revenue and reach 600,000 subscribers by 2023. If Mirror reached that revenue figure, it would account for about 10% of Lululemon’s LULU, +2.52% annual total. Calvin McDonald, Lululemon’s chief executive, said the deal will be financed with the company’s $1.5 billion in liquidity, with the transaction expected to close in a week or two. Mirror is an interactive workout platform that looks like a mirror when it isn’t in use, but becomes a screen showing fitness classes and more when activated. The core Mirror product starts at $1,495 and a subscription is $39 per month. Mirror launched in 2018 and had a previous partnership with Lululemon. Prior to the COVID-19 outbreak, at-home fitness was a growing business, with Bank of America forecasting disruption at the high end of the health club category as Mirror and other options make classes cheaper. Read: Kim Kardashian’s KKW Beauty gets a $1 billion valuation, but that’s 15% less than Kylie Jenner’s beauty brand Lululemon had also been investing in its digital capabilities, with 64% of the company’s digital visitors using a home workout, or “digital sweat,” option before coronavirus, 75% using one now, and 86% of those with home equipment saying they’ll use one at the same frequency or more going forward, according to data cited by McDonald, who spoke on a post-deal call, according to a FactSet transcript. “Mirror’s target customer is very similar to Lululemon’s higher income, active lifestyle customer base, which will lower its customer acquisition costs,” wrote Bank of America analysts led by Rafe Jadrosich. Bank of America rates Lululemon stock buy with a $340 price objective. “Recognizing the work-out-from-home surge, the idea behind the acquisition makes perfect sense,” wrote BMO Capital Markets analysts led by Simeon Siegel. “What the two companies ultimately do for each other remains to be seen. We love the brand, but are wary that sales and margins are approaching a crossroads.” BMO notes that Lululemon’s North American sales for the last 12 months totaled about $3.3 billion, approaching a revenue threshold that analysts say requires expensive marketing and other pricey investments to surpass. Also:Gap hopes it can burnish its image with a new Kanye West clothing line, repeating the rapper’s brand success with Adidas BMO also highlights the likely consumer overlap between Mirror and Peloton Interactive Inc. PTON, +6.97% , “suggesting Lululemon’s ability to reach and grab the incremental at-home fitness customer away from Peloton could be meaningful.” BMO rates Lululemon stock market perform with a $192 price target. Raymond James analysts see the acquisition as a long-term growth opportunity that bolsters the case for Lululemon’s stock price. Lululemon shares closed Tuesday up 6% to $312.01. The stock has rallied nearly 33% for the year to date while the S&P 500 index SPX, +0.87% has slipped 3.3% for the period. See: Nike’s COVID-related sales decline is a bump on the path to long-term growth, analysts say “We therefore see Lululemon’s acquisition of Mirror as extremely timely and one that positions it to benefit from a large shift in consumer behavior,” wrote Raymodn James analysts led by Matthew McClintock. “Importantly, we believe the acquisition could prove to be a boon to Lululemon’s valuation over time.” Raymond James rates Lululemon shares strong buy with a $335 price target."}]}