{"article": [{"url": "https://www.marketwatch.com/story/did-you-get-bad-news-from-your-doctor-get-a-second-opinion-the-right-way-2020-08-24", "published": 1598273300.0, "headline": "Did you get bad news from your doctor? Get a second opinion â\u0080\u0094 the right way", "body": "You get a dire diagnosis from your doctor. So you get a second opinion, right? Of course you do. 80% of older Americans can't afford to retire - COVID-19 isn't helping In theory, itâ\u0080\u0099s easy: Your doctor facilitates the process and refers you to a highly regarded specialist. You book an appointment soon, transfer your medical records and pay little or nothing because your insurance covers it. Except it doesnâ\u0080\u0099t always unfold that smoothly. But you can take prudent steps to increase your odds of gathering useful insight from a qualified pro with a minimum of hassle. â\u0080\u009cStart by having an open mind on learning more about your diagnosis,â\u0080\u009d said R. Ruth Linden, Ph.D., president of San Francisco-based Tree of Life Health Advocates. â\u0080\u009cGet input from multiple sources. Donâ\u0080\u0099t just go on blind faith and follow a diagnosis and treatment plan without trying to learn more.â\u0080\u009d Many patients react with fear and resignation after receiving a life-altering diagnosis, not realizing that digging for more information can pay off. A 2017 study by the Mayo Clinic found that 21% of patients who got a second opinion left with an entirely new diagnosis and 66% discovered that the second diagnosis further clarified or redefined the original one. Only 12% of second opinions confirmed the initial findings. â\u0080\u009cThe more pairs of eyes that review every piece of your medical record, the better,â\u0080\u009d Linden said. To find a superstar specialist for a second opinion, begin by asking your current doctor for a referral. Ideally, see someone whoâ\u0080\u0099s unaffiliated with your physicianâ\u0080\u0099s practice group. You can also conduct your own search. Check with your health insurer, a nearby universityâ\u0080\u0099s medical center or any advocacy groups that support patients with a similar diagnosis. Online resources can help, although their service models and fees vary. Best Doctors offers remote second opinions in which an expert reviews your diagnosis and issues a report. Second Opinion Expert assigns a specialist to consult with you via a secure video link. Dana-Farber Cancer Center serves patients with an initial diagnosis of cancer. Traditional health insurance typically will not cover the cost of these services, but your employer might offer free access to such programs as an employee benefit. If you see a specialist in person, prepare your questions in advance. Aside from asking if your first diagnosis and treatment plan are correct, probe to determine whether there are other options or courses of treatment and the risks and benefits of each. Bring a friend to take notes. â\u0080\u009cItâ\u0080\u0099s critical that all lab tests, diagnostic tests and doctor notes be sent beforehand [to the second-opinion specialist],â\u0080\u009d said Dr. Scott Josephs, chief medical officer at Cigna, a health insurer in Bloomfield, Conn. If the second opinion clashes with your first opinion, Josephs suggests listing the pros and cons identified by each medical expert as they relate to a particular course of action. Ask each doctor to scan your list, tweak it for accuracy and add to it as needed. Youâ\u0080\u0099re more apt to make a sound decision when you can synthesize everything youâ\u0080\u0099re heard in a clear, easy-to-digest manner. â\u0080\u009cYou may also want to get a third opinion,â\u0080\u009d Josephs added. While you can see yet another specialist, he says it might also be useful to contact others with knowledge of your condition and its aftereffects. When weighing whether to get back surgery, for example, talk to physical therapists or physiatrists who work with patients suffering from spinal pain. Even if the second opinion confirms your grim diagnosis, it still has value. Removing any doubt about where you stand makes you a more clear-eyed, empowered patient. â\u0080\u009cItâ\u0080\u0099s worth it if you need peace of mind,â\u0080\u009d said Dr. Federico Sanchez, system medical director at Aurora Cancer Care in Milwaukee. â\u0080\u009cIf the second opinion is bad news, youâ\u0080\u0099re more able to handle it if you donâ\u0080\u0099t get the answer you want or the promise of a cure.â\u0080\u009d"}]}