{"article": [{"url": "https://www.marketwatch.com/story/the-uss-trade-deficit-hasnt-been-this-wide-in-a-decade-and-a-half-2020-10-08", "published": 1602229940.0, "headline": "The U.S.â\u0080\u0099s trade deficit hasnâ\u0080\u0099t been this wide in a decade and a half", "body": "WASHINGTON (AP) â\u0080\u0094 The U.S. trade deficit rose in August to the highest level in 14 years. The Commerce Department reported Tuesday that the gap between the goods and services the United States sells and what it buys abroad climbed 5.9% in August to $67.1 billion, highest since August 2006. Exports rose 2.2% to $171.9 billion on a surge in shipments of soybeans, but imports rose more â\u0080\u0094 up 3.2% to $239 billion â\u0080\u0094 led by purchases of crude oil, cars and auto parts. Donâ\u0080\u0099t miss:Federal budget deficit hit record $3.1 trillion in just-ended fiscal 2020, CBO says The U.S. deficit with the rest of the world in the trade of goods such as airplanes and appliances set a record $83.9 billion in August. The United States ran a surplus of $16.8 billion in the trade of services such as banking and education, lowest since January 2012. The politically sensitive deficit in the trade of goods with China fell 6.7% to $26.4 billion. So far this year, the United States has recorded a trade gap of $421.8 billion, up 5.7% from January-August 2019. Hammered by the coronavirus and its fallout on the world economy, total U.S. trade â\u0080\u0094 exports plus imports â\u0080\u0094 is down 15.1% so far this year to $3.2 trillion. â\u0080\u009cOverall, trade flows remain subdued and the outlook is uncertain given a muted global growth and demand backdrop,â\u0080\u009d said Rubeela Farooqi, chief U.S. economist at High Frequency Economics. President Donald Trump campaigned on a pledge to bring down Americaâ\u0080\u0099s persistent trade deficits. He imposed taxes on imports of steel, aluminum and most products from China, among other things; and renegotiated a North American trade pact in an effort to encourage more production in the United States. But the trade deficit wonâ\u0080\u0099t yield easily to changes in trade policy. As the U.S. economy recovers from springtime shutdowns, Americans are buying more imported goods while foreign demand for U.S. products remains weak. In an unusual move, U.S. Trade Representative Robert Lighthizer issued a statement on the monthly trade deficit report Tuesday, defending the presidentâ\u0080\u0099s record. Lighthizer noted that the U.S. deficit in the trade of goods is down 2.4% so far this year and would have fallen more if it werenâ\u0080\u0099t for a surge in gold imports by investors using the precious metal to hedge against risks at a time of considerable uncertainty. He also said: â\u0080\u009cThe trade deficit increased in August because Americaâ\u0080\u0099s economy has recovered more quickly than our trade partners.â\u0080\u0099â\u0080\u0099 Barronâ\u0080\u0099s on MarketWatch:$67.1 billion â\u0080\u0094 thatâ\u0080\u0099s the U.S. trade deficit â\u0080\u0094 and two more important numbers to know"}]}