{"article": [{"url": "https://www.marketwatch.com/story/private-sector-job-growth-slows-sharply-in-july-adp-2020-08-05", "published": 1596620960.0, "headline": "Private sector job growth slows sharply in July: ADP", "body": "The numbers: The pace of U.S. private sector job growth slowed in July, perhaps as a result of the rising coronavirus infection rate. Private-sector employment rose 167,000 jobs in July, Automatic Data Processing Inc. reported Wednesday. The gain was well below forecasts from economists surveyed by Econoday who expected a gain of 1.9 million jobs. Job gains totaled 4.3 million in June and 3.3 million in May after a loss of 19.4 million in April, according to ADP data. What happened: Goods producers added only 1,000 jobs last month, down from 496,000 in June. Services producers added 166,000 jobs, the bulk of the job gains in the month but that was way down from 3.8 million in the prior month. By company size, there were private-sector-job gains in July of 63,000 at small employers, and 129,000 at large employers. Medium-sized employers lost 25,000 jobs. The slowdown was driven by the leisure and hospitality sector which added 38,000 jobs down from close to 2 million in June, noted Andrew Hunter, senior U.S. economist at Capital Economics. Big picture: The report is consistent with fears that the rebound is running out of steam, economists said. Analysts use the ADP data to get an indication of the Labor Department’s employment monthly report, which will be released Friday and covers government jobs in addition to the private sector. The signals from ADP has been distorted during the pandemic. Economists polled by MarketWatch expect the government’s report to show that nonfarm employment rose by 1.75 million jobs last month, compared with a June gain of 4.8 million and an increase of 2.7 million in May. ADP missed the May increase and fell short for the June gain. The unemployment rate in June was 11.1%, down from a postwar high of 14.7% in April. What ADP said? “The labor market recovery slowed in the month of July. We have seen the slowdown impact businesses of all sizes and sectors,” said Ahu Yildirmaz, co-head of the ADP Research Institute. What outside economists are saying: “Overall, this report largely confirms that the economy flattened in July after sharp rebounds in May and June,” said T.J. Connelly, head of research at Contingent Macro Research. Market reaction: The reaction to the data was muted. Stocks still opened higher on Wednesday. The Dow Jones Industrial DJIA, +0.56% has gained more than 2% so far this week."}]}