{"article": [{"url": "https://www.marketwatch.com/story/zoom-worthy-pieces-like-earrings-and-necklaces-are-selling-though-jewelry-is-expected-to-take-a-covid-19-hit-in-2020-11601918305", "published": 1601970260.0, "headline": "â\u0080\u0098Zoom-worthyâ\u0080\u0099 pieces like earrings and necklaces are selling though jewelry is expected to take a COVID-19 hit in 2020", "body": "Jewelry sales have focused on items that can be seen during videoconferences. Getty Images People who are working from home are still getting dressed up from the neck up for videoconference meetings, and Signet Jewelers Ltd. Chief Executive Virginia Drosos says earrings and pendants are selling as a result. But the jewelry category is expected to take a hit in 2020 due to COVID-19. Drosos told MarketWatch that â\u0080\u009cZoom-worthy jewelryâ\u0080\u009d and bridal pieces like engagement rings continue attract consumers during the pandemic. â\u0080\u009cConsumers are buying jewelry that represents the times,â\u0080\u009d Drosos said, highlighting things that are top-of-mind for consumers these days like good health and strong relationships. â\u0080\u009cWe arenâ\u0080\u0099t celebrating by going out to dinner or on a big vacation so buying something that memorializes where we are is important to people.â\u0080\u009d Many shoppers, even those buying jewelry, are heading to e-commerce sites to make a purchase or do research. â\u0080\u009cJewelry is a category that has moved slowly to online,â\u0080\u009d Drosos said. Watch: Why retail bankruptcies wonâ\u0080\u0099t necessarily create a â\u0080\u0098retail apocalypseâ\u0080\u0099 Signet SIG, -0.38% reported a 72.1% year-over-year e-commerce increase in its second-quarter earnings report on Sept. 3. August e-commerce growth was 65.2% according to a statement from Drosos in that report. Revenue for the quarter was $888 million, down from $1.36 billion last year. Same-store sales fell 31.3%. Signet reported a narrower-than-expected Â loss per share of $1.13. Shoppers are finding a reason to add a little bling to their coronavirus-casual outfits with a jewelry addition. â\u0080\u009cThe category was repositioned over lockdown as a way for consumers to dress up casual pieces,â\u0080\u009d reads a report from Edited, a retail market intelligence platform. â\u0080\u009cStatement earrings and bold necklaces were promoted under this theme and promoted as â\u0080\u0098webcam wins.â\u0080\u0099â\u0080\u009d Though these items are still finding an audience, many are not selling at full price. â\u0080\u009cAnalyzing the level of discounting taken on jewelry categories shows items such as earrings and necklaces reduced at a lower rate than in 2019,â\u0080\u009d said Edited market analyst Kayla Marci. Marci said earrings have an average discount of 31% compared with 35% last year, while necklaces are discounted at an average of 27% versus 35% in 2019. Based on the womenâ\u0080\u0099s items available for spring/summer 2020 in the U.S., the popular pricing was between $15 and $20. Read: Zoom could play an outsize role in campaign with Trump sidelined by COVID-19 â\u0080\u009cThis indicates they donâ\u0080\u0099t require such steep markdowns to sell through and with their entry price point serving as an option for consumers to treat themselves as a simple, low-cost way to dress up an outfit for video conferences or virtual events.â\u0080\u009d In fact, sales in the category are expected to take a sharp 17.7% in 2020, according to Euromonitor data. U.S. jewelry sales were $73.08 billion in 2019 and are expected to fall to $57.76 billion in 2020, a 21% drop. Signetâ\u0080\u0099s Drosos and others in the jewelry business are upbeat about the prospects for continued bridal jewelry sales during the pandemic. â\u0080\u009cEngagement and wedding jewelry will never go out of style: pandemic or not, love will continue,â\u0080\u009d saidÂ Madeline Fraser, founder and chief executive ofÂ Gemist, a direct-to-consumer jewelry seller that has seen an increase in home try-ons since the beginning of the year. â\u0080\u009cPeople are still getting engaged and married during this time, they are just doing it slightly differently.â\u0080\u009dÂ Donâ\u0080\u0099t miss: Bed Bath & Beyond turnaround under way, but analysts say outside forces are also giving the company a boost However, that category is also getting hurt by the pandemic, according to Euromonitor. â\u0080\u009cWhile jewelry sales are facing constraints from stores closures and consumersâ\u0080\u0099 prioritization of essential goods over more discretionary items, the category is also being severely impacted by the postponement and cancellations of major life events, especially weddings,â\u0080\u009d Euromonitor wrote in a July report. â\u0080\u009cWith many churches closed and large gatherings banned, consumers are postponing their weddings and the subsequent fine jewelry purchases that go along with them until next year at the earliest.â\u0080\u009d Signetâ\u0080\u0099s Drosos said the company, like most others in retail, is prepared for an earlier start to holiday shopping, with expectations that the Thanksgiving holiday weekend will still be a big one for the season. And: Halloween sales forecast could be frightful to companies trying to create holiday season momentum Signet is scheduled to report third-quarter earnings on Nov. 24, according to FactSet. Signet stock is down 7.8% for the year to date, but has soared nearly 90% over the past three months. The Consumer Discretionary Select Sector SPDR ETF XLY, +1.04% is up 19.8% for the year to date while the S&P 500 index SPX, +0.87% has gained 5.5% for the period."}]}