{"article": [{"url": "https://www.marketwatch.com/story/seattle-police-pledge-to-protect-chop-protest-zone-there-is-no-cop-free-zone-in-the-city-2020-06-16", "published": 1592319800.0, "headline": "Seattle police pledge to protect â\u0080\u0098CHOPâ\u0080\u0099 protest zone: â\u0080\u0098There is no cop-free zone in the cityâ\u0080\u0099", "body": "SEATTLE â\u0080\u0094 Seattleâ\u0080\u0099s police chief says officers will go into the several-block area being occupied by protesters if there are threats to public safety, even as President Donald Trump threatened federal intervention. Asked on Tuesday what actions he could order to disrupt the occupation, Trump responded: â\u0080\u009cAbout 10 different things â\u0080\u0094 any one of which would solve the problem quickly.â\u0080\u009d He said he had discussed the matter with Attorney General William Barr. Seattleâ\u0080\u0099s mayor, Jenny Durkan, faulted Trump in an interview with MSNBC for focusing on a four-block area in her city. â\u0080\u009cIâ\u0080\u0099m not going to be distracted by the president or anyone else,â\u0080\u009d she said. Listening to the voices of Black Lives Matter and black Americans generally on the topic of dismantling racially unjust systems, Durkan said, would hold her attention. â\u0080\u009cWeâ\u0080\u0099ll deal with community, [and] weâ\u0080\u0099ll have a resolution.â\u0080\u009d Seattle police pulled back from a part of the cityâ\u0080\u0099s Capitol Hill neighborhood after recent clashes with protesters. A festival-like atmosphere quickly emerged in the area, now called the â\u0080\u009cCapitol Hill Occupied Protest,â\u0080\u009d or CHOP, with participants painting a Black Lives Matter mural on the street and planting a community garden. Police Chief Carmen Best spoke after a business owner near the protest area complained that police didnâ\u0080\u0099t respond when he called 911 to report a break-in and vandalism. â\u0080\u009cThere is no cop-free zone in the city of Seattle,â\u0080\u009d Best said Monday. Best said officers have written multiple police reports for crimes reported in that area in the past 48 hours. She said dispatchers and officers are coordinating with crime victims or callers to meet police on the edges of the CHOP boundaries. She added that officers will go in if thereâ\u0080\u0099s an urgent situation."}]}