{"article": [{"url": "https://www.marketwatch.com/story/house-prices-are-back-to-their-pre-covid-pace-home-builder-confidence-rebounds-as-property-market-shows-signs-of-recovery-2020-06-16", "published": 1592302520.0, "headline": "Home builder confidence rebounds as property market shows signs of recovery", "body": "The numbers: The coronavirus pandemic may be far from over, but home builders have a positive outlook on the housing market for the first time since April. The National Association of Home Builders’ monthly confidence index rose 21 points to a reading of 58 in June, the trade group said Monday. It’s a marked rebound from April, when the index fell to its lowest level since June 2012. “Inventory is tight, mortgage applications are increasing, interest rates are low and confidence is rising,” said Dean Mon, chairman of the National Association of Home Builders and a home builder and developer in Shrewsbury, N.J. “And buyer traffic more than doubled in one month even as builders report growing online and phone inquiries stemming from the outbreak.” Index readings above 50 indicate improving confidence, while a figure below that threshold would signal the opposite. April was the first time since 2014 that the index has dropped below 50, and the index stayed below that threshold in May despite a slight improvement. What they’re saying: “The trends in mortgage applications suggest that of the components of GDP, residential investment should see the quickest rebound. How far that recovery progresses beyond the very near term will, however, be very dependent on how quickly the job market recovers and the unemployment rate falls,” said Avery Shenfeld, managing director and chief economist of CIBC Capital Markets. What happened: The components that make up the broader index all saw improved readings, with increases of more than 20 points. Builders’ outlook on current and future single-family sales rebounded into the positive territory, though they were still somewhat downbeat on the traffic of prospective buyers. On a regional basis, the index for builders in the Northeast saw the biggest improvement with a 31-point gain, though it remained in negative territory with a reading of 48. This is likely still an indication of how New York City was the epicenter for the pandemic in the U.S. The West had the highest reading, at 66, followed by the South and the Midwest. “ ‘The general sentiment from consumer surveys is that now is not a good time to sell a home because of COVID, economic uncertainty, and social unrest, but the data is saying the opposite.’ ” — Danielle Hale, chief economist for Realtor.com Big picture: The housing market’s recovery is continuing at a fairly steady clip. A strong indicator of this rebound can be seen in asking-price data. A recent report from Realtor.com showed that price gains have returned to their pre-coronavirus pace, according to data collected by Realtor.com. Low interest rates are boosting demand in the market, contributing to a marked increase in applications for loans used to purchase homes. At the same time, sellers have remained on the sidelines. “The general sentiment from consumer surveys is that now is not a good time to sell a home because of COVID, economic uncertainty, and social unrest, but the data is saying the opposite,” Danielle Hale, chief economist for Realtor.com, said in the report. “Home prices are back to their pre-COVID pace and we’re seeing listings spend slightly less time on the market than last week. But the housing market still needs more sellers in order to meet the surge in demand.” (Realtor.com is operated by News Corp NWSA, -1.35% subsidiary Move Inc., and MarketWatch is a unit of Dow Jones, which is also a subsidiary of News Corp.) Without that inventory, homes could come off the market faster than usual and prices could rise. That would be a positive for home-builders who could remain confident that any properties they construct will see foot traffic from prospective buyers, whether physically or virtually."}]}