{"article": [{"url": "https://www.marketwatch.com/story/its-ok-to-be-smart-stop-playing-politics-and-start-wearing-a-mask-biologist-urges-2020-07-05", "published": 1594481720.0, "headline": "Refusing to wear a mask? This video clip might change your mind", "body": "A cartoon posted on a local newspaper’s Facebook page is using the Holocaust to criticize Kansas Gov. Laura Kelly’s order requiring masks to curb the spread of the coronavirus. “Lockdown Laura says: Put on your mask … and step onto the cattle car,” the caption reads. Dane Hicks, chairman of Kansas’s Anderson County Republican Party, owns the paper and defended his cartoon even as the Democratic governor called on him to remove it. “The topic here is the governmental overreach which has been the hallmark of Gov. Kelly’s administration,” he told the New York Times. Hicks later apologized in a statement on Facebook, saying he was removing the cartoon after “some heartfelt and educational conversations” with Jewish leaders. Of course, that’s just another episode of political bickering over face masks. The divide is a head-scratcher to biologist Joe Hanson, who took to Twitter TWTR, -0.23% to state his case: iframe.twitter-tweet { width: 100% !important; } From there, Hanson went on to devote an entire segment of his “It’s Okay to Be Smart” show to the science behind how masks work and why rules requiring them shouldn’t be controversial. “In every pandemic in history, it’s the actions and choices of individual people that have made a difference,” he told 3.3 million subscribers to his YouTube channel. “A mask can stop a virus, but it also sends a message: We’re all in this together.” Here’s a GIF that pretty much sums it all up: iframe.twitter-tweet { width: 100% !important; } Watch the full video: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Meanwhile, the U.S. has recorded at least 120,168 new coronavirus cases over the July Fourth weekend, bring the total to 2,852,807 as of Sunday. New cases are up 42% in Florida over the past week, 32% in Arizona, 40% in Montana, 37% in the Virgin Islands, 33% in Idaho, 30% in South Carolina, 29% in Texas, 28% in Arizona, and up 21% in California over the same period."}]}