{"article": [{"url": "https://www.marketwatch.com/story/biden-to-brexit-britain-no-trade-deal-with-us-if-you-renege-on-ireland-2020-09-17", "published": 1600348280.0, "headline": "Biden to Brexit Britain: No trade deal with U.S. if you mess with Ireland", "body": "Democratic U.S. presidential candidate Joe Biden has said that the U.K. should not count on signing a trade deal with the U.S. if the Good Friday agreement that brought peace to Ireland in 1998 “becomes a casualty of Brexit.” - “Any trade deal between the U.S. and U.K. must be contingent upon respect for the Agreement and preventing the return of a hard border. Period,” the former vice president said in a tweet. iframe.twitter-tweet { width: 100% !important; } - The warning, after a similar one from House Speaker Nancy Pelosi, was triggered by a U.K. government bill currently being debated by Parliament that rows back on key elements of the “withdrawal agreement” signed last year with the European Union, which settled the status of Northern Ireland in relation to Europe’s single market. - Pelosi reiterated her warning in even stronger terms after meeting with U.K. Foreign Secretary Dominic Raab in Washington on Wednesday: “Whatever form it takes, Brexit cannot be allowed to imperil the Good Friday Agreement (....) If the U.K. violates its international agreements and Brexit undermines the Good Friday accord, there will be absolutely no chance of a U.S.-U.K. trade agreement passing the Congress,” she said in a statement. - A U.K. cabinet minister had earlier admitted that the bill did “break international law,” which led to the resignation of two top government lawyers, and a crisis within the ruling Conservative Party. The move by Prime Minister Boris Johnson has been criticized by all his living predecessors, including former Conservative premiers John Major and David Cameron. - Facing an uproar within the Conservative Party at the prospect of the U.K. reneging on its international obligations, Johnson has started talks with the reticents and opponents of the measure to try to find a way out of the latest political crisis, which adds to the embattled government’s problems. Read:Bank of England Stays Put but Warns of Perils Ahead The outlook: The ability to strike a bilateral trade deal with the U.S. is presented by Brexit advocates as one of the key examples of what they mean by “taking back control.” But even though London recently signed such a deal with Japan, the prospect of a quick deal with the U.S. is waning. Biden’s warning may help push Johnson further toward climbing down, which he seems to have started by negotiating with his own rebellious lawmakers. The U.K. prime minister may find it more difficult to deal with a Democratic administration if Biden wins in November. Johnson is seen as one of two European leaders, together with his Hungarian counterpart Viktor Orbán, to have expressed admiration for U.S. President Donald Trump. Read: EU offers ‘new trans-Atlantic agenda’ to the U.S., whoever is next president"}]}