{"article": [{"url": "https://www.marketwatch.com/story/dare-trump-to-sign-a-post-office-bill-pelosi-muses-on-an-option-11597428397", "published": 1597414460.0, "headline": "Dare Trump to sign a post office bill? Pelosi muses on an option", "body": "A U.S. Postal Service outpost is seen in the Longworth House Office Building on Capitol Hill in Washington, August 13, 2020. REUTERS/Sarah Silbiger House Speaker Nancy Pelosi raised the prospect Friday of trying to pass a stand-alone bill to give the U.S. Postal Service additional cash to cope with the coronavirus and ensure smooth mail-in balloting. Her comments came a day after President Trump initially said he would block extra money for the Postal Service because he said, without evidence, mail-in balloting was subject to fraud. Later in the day, Trump said he would not veto legislation, though, if it included such money and said he could sign something that included postal money. “Sure,” he said. “A separate thing, I would do it.” Read more: Trump blasts Democratic demands for postal-service money, saying mail-in voting would be ‘fraudulent’ “Is he saying that we can send him a single bill that is just about funding the post office? We’d be happy to do that,” Pelosi said in an interview on MSNBC. “But from what we see at the Postal Service and the removal of mailboxes, the removal of equipment within postal offices, and the rest is to undermine the Postal Service at a time when the Postal Service is needed more than ever,” she said. House Democrats had offered $25 billion for the Postal Service in their coronavirus aid bill that passed the House in May, $15 billion more than White House had reportedly proposed. Talks on that bill stalled out last week and any remaining hopes for a quick resolution evaporated yesterday with Senate Majority Leader Mitch McConnell beginning the Senate’s August break. Read more: Pelosi says sides remain ‘miles apart’ on stimulus bargaining House lawmakers left Washington July 31 and the House is out of session until Sept. 14 so Pelosi’s idea is unlikely to bear fruition soon, even if she were to commit to it. Coronavirus talks are expected to restart in September when lawmakers return to Washington, but they will face another obstacle: keeping the government open. Unless lawmakers pass at least a temporary funding bill, by Sept. 30, another government shutdown looms."}]}