{"article": [{"url": "https://www.marketwatch.com/story/why-some-nursing-homes-did-better-in-protecting-residents-from-coronavirus-2020-06-10", "published": 1591978220.0, "headline": "Why some nursing homes did better in protecting residents from coronavirus", "body": "The coronavirus pandemic has posed a serious threat to the U.S. long-term care industry. A third of all deaths have been nursing home residents or workers — in some states it’s more than half. Yet some long-term care facilities have managed to keep the virus at bay. For example, veterans’ homes in California have seen only a handful of cases among roughly 2,100 residents. And preliminary results of our research on COVID-19 cases and deaths in nursing homes also support the idea that some homes are doing better than others at protecting clients and staff from COVID-19. Why might this be? As scholars of public management, we have found that three factors likely play the biggest role in determining how well a nursing home responds to a disease outbreak: whether it operates for profit, the degree of government regulation and the quality of management.Profit versus quality care More than 15,000 nursing homes currently operate in the U.S. Most of them are for-profit facilities backed by private investors, but a small share are operated by nonprofits or government. For-profit companies selling the same product or service typically perform optimally in what’s known as a perfect market in which there’s plenty of competition and consumers have comprehensive information. More importantly, consumers are able to act on the information. The nursing home industry, however, is far from a perfect market. Residents — who require constant assistance due to serious physical and cognitive limitations —– are often unable to differentiate between good and bad care, advocate for themselves or choose a better facility. Their care is often arranged and paid by others. As a result, for-profit homes, which are motivated to keep costs low and profits high, tend to be understaffed and, on average, provide lower-quality care compared with public and nonprofit homes. In contrast, nonprofit and public homes tend to put higher emphasis on patient-centered care and reinvest their profits into better physical spaces, equipment and responsiveness to clients’ needs. The numbers back this up. Our ongoing research shows that government inspection of for-profit homes found nine violations in an average regulatory inspection cycle, compared with 6.4 at nonprofit homes and 6.8 at government homes. These trends have largely remained constant during the past two decades. As we examine the data on COVID-19 cases in nursing homes reported by states in real time and link them to the federal data on regulatory violations, we are observing more COVID-19 cases per capita in for-profit than nonprofit or public homes. So far, we’ve looked at homes in Illinois, Nevada, Colorado, South Carolina, Oklahoma and Oregon. While it is too early to draw firm conclusions, it appears likely that fewer regulatory violations will correlate with success in managing the outbreak.Government regulation is critical Federal and state government regulation aimed at protecting residents is another critical factor that influences nursing homes’ ability to combat infection. All nursing homes that accept Medicare or Medicaid must comply with federal regulations, while states are able to set their own rules for all facilities in addition to the federal minimums. A closer look at the variation among states offers strong evidence that more stringent regulation leads to better care quality. That is a key finding of our recent study on a voluntary federal program that provides biometric criminal background checks of front-line care workers such as nurses and health care aides. About half of U.S. states have signed on to the National Background Check Program. Nursing homes in those states have fewer deficiencies and higher 5-star ratings. Staffing requirements in nursing homes are regulated too. We looked at the impact of having more high-skilled nurses on the quality of care in counties hit hard by Hurricane Katrina in 2005. Facilities with a higher share of registered nurses on staff experienced little to no impact on residents’ health outcomes, such as mobility or personal hygiene, as well as on the number of regulatory violations, while most that witnessed significant evacuations saw a large increase in violations and deteriorating health. The federal government sets a minimum requirement of one registered nurse on staff at least eight hours a day. States are allowed to set their own higher standards — yet even these are considered insufficient by experts. One key problem is that many state regulations emphasize staffing levels, rather than staffing mix, which means there is little incentive for homes to hire more skilled and expensive personnel. While federal rules issued in 2016 would have strengthened staffing requirements, including one that required homes to have an infection specialist on staff, they have yet to take effect, and the Trump administration has taken steps to weaken them.Better management Our research also suggests that management plays a critical role in determining the level of care quality — and ultimately a facility’s ability to withstand COVID-19. Specifically, we have identified several key factors that make a meaningful difference and are certainly worth considering by those looking for a home for their loved one. For example, nursing home administrators who are more innovative and constantly looking for new ideastend to run better homes, keep costs lower and address organizational flaws. In addition, homes with managers who have been around for longer periods of time usually deliver better quality of care because this makes it easier to buffer external threats — such as a disease outbreak. We’ve also found that homes that engage residents and their families and apply their feedback in decision-making boast higher ratings and fewer health violations.Understanding the pitfalls Billionaire investor and philanthropist Warren Buffet is credited with saying that it is only when the tide goes out that you discover who has been swimming naked. COVID-19 seems to be having this kind of effect on nursing homes, exposing which ones were in a better position to handle a pandemic. And that’s why it’s essential for more states that are not publicly sharing their COVID-19 cases or deaths in nursing homes — such as Alaska, Hawaii and Idaho — to begin doing so. This will allow more research to be done and ensure that the U.S. nursing home industry is adequately prepared for the next pandemic when it inevitably comes. Anna Amirkhanyan is an associate professor of public administration and policy at the American University School of Public Affairs in Washington, D.C. Austin McCrea is a Ph.D. student at American University, and Kenneth J Meier is a distinguished scholar in residence at American University’s Department of Public Administration and Policy. This was first published by The Conversation — “Why some nursing homes are better than others at protecting residents and staff from COVID-19”"}]}