{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-edge-lower-as-traders-weigh-demand-outlook-2020-09-24", "published": 1600960340.0, "headline": "Oil prices end higher, buoyed by signs of tighter supplies", "body": "Oil futures finished higher on Thursday, supported by signs of tighter U.S. crude supplies, despite persistent concerns that rising cases of COVID-19 will lead to weaker energy demand. The commodity tallied a third climb in a row, but the gains have been modest and prices still remain lower for the week. “Oil prices need a shot of something,” said Phil Flynn, senior market analyst at The Price Futures Group, in a note. The U.S. Federal Reserve “wants it to be another shot of stimulus and perhaps a shot of a coronavirus vaccine,” he said. “Perhaps it’s another shot of compliance by the OPEC plus cartel, or maybe it just needs to get past September where hurricanes and storms impacted both supply and demand.” West Texas Intermediate crude for November delivery CL.1, -1.62% CLX20, -1.62% edged up by 38 cents, or nearly 1%, to settle at $40.31 a barrel on the New York Mercantile Exchange after tapping a low at $39.12. November Brent crude UK:BRNX20 BRN.1, -0.07%, the global benchmark, added 17 cents, or 0.4%, to trade at $41.94 a barrel on ICE Futures Europe. “Lifeless crude prices and frightful refining margins present a faltering demand recovery, especially with COVID cases rising again. But fortunately, OPEC’s supply constraint and a further fall in U.S. supply in 4Q and 2021 will provide the offset,” said Stephen Innes, chief global markets strategist at AxiCorp, in a note. Oil rose Wednesday after the Energy Information Administration reported that U.S. crude inventories fell for a second straight week, by 1.6 million barrels for the week ended Sept. 18. That was much less than the average forecast from analysts polled by S&P Global Platts for a decline of 4 million barrels, but the American Petroleum Institute on Tuesday had reported an increase of 691,000 barrels. Also, gasoline inventories fell by a larger-than-expected 4 million barrels, while distillate stocks unexpectedly declined by 3.4 million barrels. On Thursday, October gasoline US:RBV20 rose 1.2% to finish at $1.1957 a gallon, while October heating oil US:HOV20 settled at $1.1167 a gallon, up 0.8% Read:Here are two stocks that stand to benefit from California’s electric-vehicle push “The continued drop in U.S. oil supply and refinery challenges suggests a balancing of supply,” said Flynn. “It also indicates that we should see oil bottom and rally as we head into winter and out of the [refinery] maintenance season.” Also, “despite gridlock in Washington, oil demand should recover, and we face a balanced market globally that will add higher prices,” he said, though “the risk to this forecast is a massive” COVID-related shutdown. Natural-gas futures, meanwhile, notched back-to-back gains on Thursday as the U.S. Energy Information Administration reported Thursday that domestic supplies of natural gas rose by 66 billion cubic feet for the week ended Sept. 18. That was smaller than the increase of 77 billion cubic feet forecast by analysts polled by S&P Global Platts. October natural gas US:NGV20 climbed by 5.8% to settle at $2.248 per million British thermal units. Front-month prices tallied a two-day gain of almost 23%, the largest two-day rise since November 2018, according to Dow Jones Market Data. Read:Natural-gas futures rally on storm-related disruptions and signs of stronger demand"}]}