{"article": [{"url": "https://www.marketwatch.com/story/us-jobless-claims-are-rising-again-and-this-state-is-a-big-reason-why-2020-09-10", "published": 1599755420.0, "headline": "U.S. jobless claims are rising again â\u0080\u0094 and this state is a big reason for that", "body": "The number of Americans applying for jobless benefits through state or federal relief programs has climbed for four straight weeks, raising questions about whether more Americans are losing their jobs and causing a recovery in the labor market to fizzle out. New jobless claims in the U.S. rose to an unadjusted 1.7 million in early September from 1.59 million in the last week of August. They were also up from a post-pandemic low of 1.33 million five weeks earlier. Read:Jobless claims rise fourth straight week in sign of stalling labor market Worrisome? Yes. But maybe not as bad as it seems. The entire increase in new claims stems from a rising tide of people applying through a temporary federal program. Jobless claims filed traditionally through the states have fallen to the lowest level since the pandemic began. Whatâ\u0080\u0099s more, the state of California by itself accounts for more half of these new federal claims. The federal program was enacted early in the pandemic. For the first time, the government allowed self-employed workers and independent contractors such as freelance writers and Uber drivers to receive jobless benefits. Historically they were ineligible because they did not contribute to the joint state-federal compensation fund as do most companies. In any case, federal applications for benefits have almost doubled since early August, when they had declined to a nearly four-month low of 489,639. The government doesnâ\u0080\u0099t detail the reasons people file claims, so itâ\u0080\u0099s unclear why. Economists suggest several possibilities. Federal filings might have fallen after the end of July because an extra $600 unemployment stipend Washington had been providing on top of state benefits expired. Some people may have thought they were no long eligible for benefits or others may have chosen to go back to work because their unemployment checks did not pay enough. An executive order signed by President Donald Trump later in August authorizing $300 in extra weekly benefits, on the other hand, might have enticed more people worried about going back to work to apply. Trump acted after a divided Congress failed to extend the $600 stipend. Another federal law enacted early in the pandemic, meanwhile, also allows Americans to apply for benefits if they have to stay home to care for younger or older family members. The new school year could have encouraged more parents to seek benefits to care for children who cannot go back to school or day care. Then thereâ\u0080\u0099s California. The nationâ\u0080\u0099s largest state accounted for almost 52% of all new jobless claims filed last week through the federal program. California also generated 54% of all such federal claims in the prior week. The surge in California reflects the devastation caused by massive wildfires in the state, not to mention stricter rules imposed on businesses during the summer after another major coronavirus outbreak. Federal filings in most other states, however, are relatively low. Yet even if the rise in federal claims turns out to be temporary, what does seem clear is that the U.S. labor market is not improving as rapidly as it did earlier in the summer. New hiring slowed in July and August and a spate of fresh layoffs in the travel and hospitality industries are looming unless Congress approves more aid for beleaguered companies."}]}