{"article": [{"url": "https://www.marketwatch.com/story/cisco-looking-more-to-software-but-road-is-slower-due-to-the-pandemic-2020-08-12", "published": 1597304180.0, "headline": "Cisco looking more to software, but road is slower due to the pandemic", "body": "Cisco Systems Inc.’s earnings had a bright spot Wednesday, but the giant shadow of coronavirus blotted it out. Cisco CSCO, +0.15% collected more revenue from software and services than hardware for the first time in its just-completed fiscal year, a milestone in the company’s transition from its legacy hardware business to a tech company suited for the new era. That transition means much less in the age of COVID-19, however, as the pandemic is accelerating the downfall of the biggest sales drivers for Cisco and putting even more pressure on the company’s newer assets. Cisco reported that revenue dropped 9% in the fiscal fourth quarter to $12.2 billion, and predicted that sales would continue to decline at an equal or greater rate in the current period. In response, Cisco plans to cut $1 billion in costs, a supersized return to Cisco’s previous pattern of a large restructuring at the end of a fiscal year. Chief Financial Officer Kelly Kramer revealed to MarketWatch in an interview Wednesday afternoon that Cisco’s cost cuts would start with a voluntary retirement offering, and mentioned research and development as an area that would be targeted while declining to provide a target for job cuts. Kramer also announced her voluntary retirement Wednesday, an unrelated move that will allow her to move on to more board seats (she currently has two) and investing. Cisco’s revenue decline was led by its older networking products, with total product revenue down 13%, and declines across switching, routing, data center and wireless driven primarily by weakness in the commercial enterprise markets. Pockets of strength included the company’s more recent network and software-as-a-service offering, the Catalyst 9000, and double-digit growth in its WebEx video platform, which is seeing a surge of usage with many people working from home. Cisco unveiled the Catalyst 9000 in 2017 as part of its strategy to become more of a software and service provider, with a subscription model that offers networking software that helps companies automate more of their IT departments. And if a company is looking at modernizing its network, with everyone working from home, they are often looking at the CAT 9000, Chief Executive Chuck Robbins said. “Some of them are using this opportunity, with no one in their campus environments, to upgrade,” he told analysts on the company’s conference call. The revenue from these service-focused deals is more lucrative for Cisco, Kramer told MarketWatch. “You don’t recognize it for three years, but you are getting the revenue,” she said. “You get even more when they renew.” But with the pandemic hurting many of its other product areas, especially its sales to large corporate customers, it’s going to be a longer, slower road to transition to even more software sales. One analyst said that he believed the company should become more aggressive in M&A to fill in the gaps, just a few days after Cisco closed its purchase of ThousandEyes. Robbins said the company will continue to be disciplined, but that it is open to ideas and has a list of potential acquisition targets that Cisco maintains on a regular basis. Cisco indeed may have to speed up its moves to become more software- and services-focused, and could use the pandemic to score some deals. Fortunately, Kramer said she will stick around for the transition, but the restructuring may take up more focus before Cisco can start adding new entities."}]}