{"article": [{"url": "https://www.marketwatch.com/story/if-you-started-wearing-a-mask-today-this-is-how-many-lives-you-could-help-save-2020-08-07", "published": 1597086800.0, "headline": "If every American started wearing a face mask today, this is how many lives could be saved", "body": "Feeling lax about wearing a mask? Think again. As people get used to living with coronavirus, social distancing and mask protocols are also easing. As of Monday evening, COVID-19 infections are closing in on 20 million people globally, according to Johns Hopkins University’s Center for Systems Science and Engineering. It has now infected 5,075,678 people in the U.S., killed 163,282 in the U.S., and led to 732,889 deaths worldwide. The number of coronavirus cases is still rising in every region of the country. With 10,382 deaths, California is now the third U.S. state to register over 10,000 deaths after New York (32,781 deaths) and New Jersey (15,878 deaths). Texas has the fourth highest number of fatalities (9,177). America’s COVID-19 death toll in the U.S. could reach nearly 300,000 by Dec. 1, but consistent mask-wearing beginning today could save approximately 70,000 lives, according to new projections based on current fatality and infection rates from the Institute for Health Metrics and Evaluation (HME) at the University of Washington’s School of Medicine. “It appears that people are wearing masks and socially distancing more frequently as infections increase, then after a while as infections drop, people let their guard down and stop taking these measures to protect themselves and others which, of course, leads to more infections,” HME director Christopher Murray said, “and the potentially deadly cycle starts over again.” He said that there appear to be fewer transmissions of the virus in some southern and western states after recent surges, but deaths in California and Florida are still rising and will likely continue to increase for the next couple of weeks. The drop in infections appears to be related to a combination of local mandates for mask wearing in public spaces, and the closure of bars and restaurants. Source: Institute for Health Metrics and Evaluation at the University of Washington’s School of Medicine. “The public’s behavior had a direct correlation to the transmission of the virus and, in turn, the numbers of deaths,” Murray added. “Such efforts to act more cautiously and responsibly will be an important aspect of COVID-19 forecasting and the up-and-down patterns in individual states throughout the coming months and into next year.” Face masks help prevent patients from spreading the virus, but they are not as effective as protecting the healthy, health professionals say. On April 3, the Centers for Disease Control and Prevention recommended the use of cloth masks, saying they were useful for preventing the wearer from passing on the virus if he/she was asymptomatic. It reversed that stance, citing “new evidence.” Some previous studies have concluded that face masks have helped reduce contagion by reducing droplets being sprayed into the air during flu season; another Japanese-based study says this works when paired with vaccination, which is not an option in this case. It may be that they work in a small amount of cases and/or just wearing them helps to promote healthy behaviors. Source: Institute for Health Metrics and Evaluation at the University of Washington’s School of Medicine This study says N95 medical-grade masks do help filter viruses that are larger than 0.1 micrometers (One micrometer, um, is one millionth of a meter). The coronavirus is 0.125 um. “These products can help block large droplets expelled by the wearer, but also have been shown to have efficacy at filtering smaller particles and are designed to fit tightly to the face,” it said. Face masks are needed for health-care professionals. N95 masks are tighter-fitting than surgical masks and protect against small particles and large droplets, according to the CDC. In April, New York Gov. Andrew Cuomo ordered all New Yorkers to cover their faces in public when they can’t maintain a proper social distance, but not all states have followed suit. That same month, New York Mayor Bill de Blasio called for all grocery stores in New York, then the epicenter of the coronavirus pandemic in the U.S., to insist that customers wear masks while shopping. “I’m asking every store to put up a sign that you’re required to wear a face covering. This is another one of the things we have to do to protect each other,” he said at the time. Want to make your own mask? Here’s a simple DIY approach. Source: Institute for Health Metrics and Evaluation at the University of Washington’s School of Medicine “Everybody’s learning,” said Gregory Poland, who studies the immunogenetics of vaccine response in adults and children at the Mayo Clinic in Rochester, Minn. “We have just a few months experience with this virus. Face masks should be preserved for health-care workers who are at known obvious high risk.” And the DIY masks for everyone else? “They help as a memory aid not to touch your face.” Others are even more skeptical than that. Paul Glasziou, a professor of medicine at Bond University in Australia, and Chris Del Mar, a professor of public health at Bond, analyzed a dozen studies on face masks. They concluded: “Face masks may not do much without eye protection.” Experts say masks may also remind people of the seriousness of this public-health emergency. They say it’s best to avoid public settings. “People may also wear masks inappropriately, or touch a contaminated part of the mask when removing it and transfer the virus to their hand, then their eyes and thus to the nose,” they wrote in The Conversation. “Masks may also provide a false sense of security, meaning wearers might do riskier things such as going into crowded spaces and places.” President Donald Trump signed four executive orders on Saturday that include extending unemployment benefits after Congress failed to reach a deal on a stimulus package. The Dow Jones Industrial Index DJIA, +0.56% and S&P 500 SPX, +0.87% ended slightly up Monday as investors awaited round two of a fiscal stimulus; the Nasdaq Composite’s COMP, +1.39% ended down."}]}