{"article": [{"url": "https://www.marketwatch.com/story/heres-one-remarkable-difference-between-covid-19-and-the-1918-spanish-flu-2020-07-07", "published": 1594720640.0, "headline": "Hereâ\u0080\u0099s one â\u0080\u0098remarkableâ\u0080\u0099 difference between COVID-19 and the 1918 Spanish flu", "body": "The 2020 coronavirus and 1918 Spanish influenza pandemics share many similarities, but they also diverge on one key point. â\u0080\u009cA major difference between Spanish flu and COVID-19 is the age distribution of fatalities,â\u0080\u009d according to Deutsche Bank DB, -0.85%. â\u0080\u009cFor COVID-19, the elderly have been overwhelmingly the worst hit. For the Spanish flu of 1918, the young working-age population were severely affected too. In fact, the death rate from pneumonia and influenza that year among 25-34-year-olds in the United States was more than 50% higher than that for 65-74-year-olds. A remarkable difference to Covid-19.â\u0080\u009d Francis Yared, the global head of rates research at Deutsche Bank, said the overall mortality rate measured by weekly new deaths and weekly new cases is around one-third of the level observed in the second half of April. â\u0080\u009cSo we have an interesting situation at the moment, where rapidly rising cases in the U.S. are slowing reopenings (negative) but the death rate is falling (positive). This may eventually give us more faith that we are now better at living with the virus,â\u0080\u009d the bank said. “ There wasnâ\u0080\u0099t such a big trade-off between economic activity and public health during the 1918 Spanish flu, because you needed to suppress the virus to enable consumers to be more confident and for businesses to operate as normal. ” â\u0080\u0094 Deutsche Bank report During the 1918 flu, cities that implemented non-pharmaceutical interventions such as social distancing and school closures tended to have better economic outcomes over the medium term, Deutsche Bank added. â\u0080\u009cThis offered historical support to the argument that there wasnâ\u0080\u0099t such a big trade-off between economic activity and public health, because you needed to suppress the virus to enable consumers to be more confident and for businesses to operate as normal.â\u0080\u009d Some 500 million people, or one-third of the worldâ\u0080\u0099s population, became infected with the 1918 Spanish flu. An estimated 50 million people died worldwide, with about 675,000 deaths occurring in the U.S., according to the Centers for Disease Control and Prevention. â\u0080\u009cIt was caused by an H1N1 virus with genes of avian origin,â\u0080\u009d the agency added. During the 1918 flu pandemic, â\u0080\u009cmortality was high in people younger than 5 years old, 20-40 years old, and 65 years and older. The high mortality in healthy people, including those in the 20-40 year age group, was a unique feature of this pandemic,â\u0080\u009d the CDC said. â\u0080\u009cWith no vaccine to protect against influenza infection and no antibiotics to treat secondary bacterial infections that can be associated with influenza infections, control efforts worldwide were limited to non-pharmaceutical interventions.â\u0080\u009d COVID-19, the disease caused by the virus SARS-CoV-2, has already proved extremely infectious. It had infected 13.1 million people globally and more than 3.4 million in the U.S. as of Tuesday, according to official figures collated by Johns Hopkins Universityâ\u0080\u0099s Center for Systems Science and Engineering. The disease had claimed at least 573,664 lives worldwide and 135,615 in the U.S. Source: Centers for Disease Control and Prevention, U.S. Census Bureau, Haver Analytics, Deutsche Bank. Note: COVID-19 data use provisional death counts up to June 27, 2020; 1918 fatalities use Death Registration States. Letter from New York:â\u0080\u0098When I hear an ambulance, I wonder if thereâ\u0080\u0099s a coronavirus patient inside. Are there more 911 calls, or do I notice every distant siren?â\u0080\u0099 There are also some similarities between influenza and COVID-19, including their nearly identical symptoms: fever, coughing, night sweats, body aches, tiredness, and nausea and diarrhea in the most severe cases. Like all viruses, neither is treatable with antibiotics. They can both be spread through respiratory droplets from coughing and sneezing, but they come from two different virus families â\u0080\u0094 and ongoing research to develop a universal vaccine for influenza shows how tricky both influenza viruses and coronaviruses can be. “ â\u0080\u0098The 1918 Spanish fluâ\u0080\u0099s second wave was even more devastating than the first wave.â\u0080\u0099 ” â\u0080\u0094 Ravina Kullar, an adjunct faculty member at the University of California, Los Angeles Historians believe that a more virulent influenza strain hit during a hard three months in 1918 and was spread by troops moving through Europe during the First World War. â\u0080\u009cThe 1918 Spanish fluâ\u0080\u0099s second wave was even more devastating than the first wave,â\u0080\u009d Ravina Kullar, an infectious-disease expert with the Infectious Diseases Society of America and adjunct faculty member at the University of California, Los Angeles, told MarketWatch. A mutated strain would be a worst-case scenario for a second wave of SARS-CoV-2 this fall or winter. Though the 1918 pandemic is forever associated with Spain, this strain of H1N1 was discovered earlier in Germany, France, the U.K. and the U.S. But similar to the Communist Partyâ\u0080\u0099s response to the first cases of COVID-19 in Wuhan, China, World War I censorship buried or underplayed those reports. â\u0080\u009cIt is essential to consider the deep connections between the Great War and the influenza pandemic not simply as concurrent or consecutive crises, but more deeply intertwined,â\u0080\u009d historian James Harris wrote in an article about the pandemic. Doctors and members of the public, as of now, were spooked by how otherwise strong, healthy people fell victim to the 1918 influenza. Doctors today attribute that to the â\u0080\u009ccytokine storm,â\u0080\u009d a process where the immune system in healthy people reacts so strongly as to hurt the body. A hallmark of some viruses: A surge of immune cells and their activating compounds (cytokines) effectively turned the body against itself, led to an inflammation of the lungs, severe respiratory distress, leaving the body vulnerable to secondary bacterial pneumonia. The Dow Jones Industrial Index DJIA, +0.56% Â and the S&P 500 SPX, +0.87% Â were tepid Tuesday on hopes of progress in coronavirus vaccine research. Thereâ\u0080\u0099s been a surge of coronavirus in states that have loosened restrictions in recent weeks, particularly in Florida, Texas, California, and Arizona."}]}