{"article": [{"url": "https://www.marketwatch.com/story/what-landlords-are-saying-about-the-cdcs-eviction-ban-11599250996", "published": 1599303380.0, "headline": "What landlords are saying about the CDCâ\u0080\u0099s eviction ban", "body": "Renters and housing advocates protest pandemic evictions in Los Angeles Valerie Macon/Getty Images Landlords say the U.S. Centers for Disease Control and Preventionâ\u0080\u0099s unprecedented order for aÂ national moratorium on evictionsÂ doesnâ\u0080\u0099t solve pandemic problems without providing more rental assistance. The sweeping pause on evictions took hold Tuesday evening, cover some 40 million renters and will apply through Dec. 31 for qualifying tenants who fill out a form and deliver it to their landlords. Read: CDCâ\u0080\u0099s eviction moratorium doesnâ\u0080\u0099t automatically protect renters â\u0080\u0094 here are the strict criteria you must meet The CDCâ\u0080\u0099s finalized order aims to provide housing stability and prevent further spread of COVID-19, which top infectious disease expert Dr. Anthony Fauci said remains â\u0080\u009cunacceptably highâ\u0080\u009d going into Labor Day. But it also formalized a process that tenants and landlords across America have been trying to navigate on an ad hoc basis for months. See: California eviction moratorium is â\u0080\u0098a real nightmareâ\u0080\u0099 for renters to understand â\u0080\u0094 hereâ\u0080\u0099s what you need to know â\u0080\u009cI canâ\u0080\u0099t believe we didnâ\u0080\u0099t think of its sooner,â\u0080\u009d said Jonathan Needell, chief investment officer at Kairos Investment Management, of the CDCâ\u0080\u0099s eviction ban, which he views as the federal government recognizing â\u0080\u009cthat for health reasons, you canâ\u0080\u0099t put people on the street.â\u0080\u009d â\u0080\u009cThe reality is weâ\u0080\u0099ve been dealing with an eviction moratorium throughout this whole time anyway,â\u0080\u009d he said, referring to the hodgepodge of state and local orders that paused evictions since March, as well as courts that have been operating at limited capacity, creating backlogs for landlords looking to evict tenants who owe backrent. Prior to this weekâ\u0080\u0099s CDC order, renter evictions were picking back up in some major U.S. cities, including since the extra $600 in unemployment benefits expired in July. Around Houston, Texas, the largest city in the state, the Harris Country Counstableâ\u0080\u0099s office this week began working through a pile of 200 eviction orders in one of its eight precincts, according to a CNN report, which pegged the volume of judge-ordered evictions at roughly double the rate for an entire month prior to COVID. Those and other pending evictions nationally now are paused as landlords and tenants figure out the next steps. Kairos owns and operates a portfolio of commercial and multifamily properties that crisscross the nation from to Washington state to Texas to Florida, where Needell said multifamily rent collections have remained high in the 95% range despite the crisis. â\u0080\u009cI do think collections have been pretty good, probably to most peopleâ\u0080\u0099s surprise,â\u0080\u009d he told MarketWatch. But Needell also sees a need for some form of further stimulus for households until the coronavirus can be better managed. â\u0080\u009cWhat we have is a half-built bridge, over a ravine, but we donâ\u0080\u0099t know where the ravine ends.â\u0080\u009d House Speaker Nancy Pelosi and Treasury Secretary Steven Mnuchin, locked in a stalemate for weeks over the scope of additional pandemic aid for families and businesses, now also must strike a deal to avoid a government shutdown after current funding expires on Sept. 30. Related: Another coronavirus aid package is probably â\u0080\u0098not happeningâ\u0080\u0099 after August jobs report and deal to avoid government shutdown, analyst says Another perhaps underappreciated aspect of the CDCâ\u0080\u0099s national eviction halt is that it now sweeps up rental properties financed in private markets, in ways that already were impacting landlords of multifamily buildings with federally backed loans. That could impact Wall Streetâ\u0080\u0099s single-family rental push in the wake of the last decadeâ\u0080\u0099s foreclosure crisis, namely by Invitation Homes, Inc. INVH, -0.80% and American Homes 4 Rent AMH, -0.46%, Tricon Residential TCNGF, +1.11% and other institutional landlords that account for about 1% of the single-family rentals. Shares of all three rental operators were lower Friday, but so were the major stock indexes, including the Dow Jones Industrial Average DJIA, +0.56%, S&P 500 index SPX, +0.87% and Nasdaq Composite Index COMP, +1.39%, after Thursdayâ\u0080\u0099s sharp selloff. Invitation Homes said it already had been following the restrictions laid out by the CDC order â\u0080\u009csince early in the pandemic â\u0080\u0093 working with our residents facing COVID-related financial hardships and offering a variety of payment options so they can stay in their homes,â\u0080\u009d in a statement to MarketWatch. Tricon declined to comment. American Homes did not immediately respond. But as David Howard, executive director at the National Rental Home Council, a trade group for the single-family rental home industry, points out, â\u0080\u009cmom and popâ\u0080\u009d investors still own about 97% of the nationâ\u0080\u0099s near 23 million single-family rentals, often overseeing one to three properties. â\u0080\u009cWith this new moratorium some landlords in this country will end 2020 without having received rent for 9Â½ months, and thereâ\u0080\u0099s absolutely nothing to be done about it,â\u0080\u009d he told MarketWatch. â\u0080\u009cTrumpâ\u0080\u0099s new eviction ban provides no consideration for struggling landlords who have tenants not able to pay rent. These homeowners are essentially left with two options â\u0080\u0093 go deeper into debt to stay afloat or sell.â\u0080\u009d Howard suggests that a simple way to alleviate some of the stress building up in the sector would be for the Trump administration and Congress to come up with â\u0080\u009csensible rental assistance programsâ\u0080\u009d that â\u0080\u009cprovide immediate relief to both renters and landlords.â\u0080\u009d Early on during the pandemic, landlords with multifamily properties financed through housing giants Freddie Mac FMCC, +0.52% and Fannie Mae FNMA, +0.73% received breaks on their debt payments, but in August also were ordered to start informing tenants of expanded eviction protections through year-end, Forbes reported. But what the CDCâ\u0080\u0099s order wonâ\u0080\u0099t do is trump state or local eviction bans that provide the â\u0080\u009csame or greater level of public-health protection.â\u0080\u009d Eli Randel, chief strategy officer at CREXi, an online commercial real estate marketplace, said that details of how the CDC eviction pause will be applied or enforced remain a bit murky, which will take property owners time to sort out. However, Randel thinks temporary eviction bans are hardly the biggest driver shaping the investment landscape for rentals. â\u0080\u009cOne upon a time, the single-most relevant factor for determining which place people wanted to rent was that it needed to be located about 30 minutes away from work,â\u0080\u009d he told MarketWatch. â\u0080\u009cNow youâ\u0080\u0099re seeing an exodus away from some big employment centers, certainly in New York and L.A., as people are no longer constrained by coming into the office everyday.â\u0080\u009d"}]}