{"article": [{"url": "https://www.marketwatch.com/story/stop-moaning-about-pampered-politicians-and-fat-cat-ceos-4-tweaks-you-can-make-now-that-can-ripple-through-to-bigger-change-2020-10-07", "published": 1602060380.0, "headline": "Stop moaning about pampered politicians and fat-cat CEOs â\u0080\u0094 4 tweaks you can make now that can ripple through to bigger change", "body": "The decadeslong stagnation in the median U.S. family income combined with massive enrichment of the wealthiest has ever more outrage about both pampered Washington politicians and highly compensated corporate executives. The grievances are justified. Washington is a self-serving duopoly that protects itself by exploiting gerrymandering and resisting campaign finance reform. Corporate executives, typified by the members of the Business Roundtable, talk a big game but havenâ\u0080\u0099t done much yet other than continue to grind down wages, outsource and offshore jobs, and consolidate if not monopolize industries. While average Americans might be justified in their moaning, there are more positive steps you can take â\u0080\u0094 four of them in fact. These four seemingly small actions can re-establish citizens as a force to be reckoned with and ripple through to far bigger changes. The first thing you can do is consciously split your business to help foster competition, something economists call multi-homing. Take Uber sometimes, Lyft other times and taxis still other times. Get some of your news through your Facebook feed and still subscribe to your local newspaper. Use Facebook for some things, but rather than use Instagram (part of Facebook) for your photo sharing, use rival Snapchat. Buy some things from Amazon Prime and others from your local retailer. The natural tendency is the opposite. But that consumer behavior is driving consolidation of industries and the building of monopolies that go on to exploit the power that our purchasing patterns hand to them. The second is to use positive economic collective action. The boycott has been used to punish undesired corporate behavior ever since Cesar Chavez successfully organized the consumer boycott of green grapes in the late 1960s to punish growers for resisting unionization of grape-harvesting workers. A more recent innovation is the â\u0080\u0098buycott,â\u0080\u0099 which is organized to reward a company for engaging in desirable action. Canadian ketchup consumers joined a successful buycott to reward new-entrant Frenchâ\u0080\u0099s, which entered the Canadian market with locally sourced and processed ketchup when near-monopolist Heinz shuttered its Canadian production and shifted to imported ketchup. Thanks to the success of this tool, you can easily view available campaigns on www.buycott.com. The third is to fight the duopoly power in by supporting anti-gerrymandering campaigns. The gerrymandering of Congressional district serves the very specific purpose of making certain that no individualâ\u0080\u0099s vote in that district really matters. The election is a foregone conclusion so much so that 93% of incumbent House members who have sought reelection since 1964 have succeeded. Their only competition comes from within their own party, and historically parties prefer incumbents, who are more familiar with the workings of the system, which in any event still favors seniority in allocating positions on important Congressional committees. Fortunately, as with multi-homing and buycotts, it isnâ\u0080\u0099t all that difficult to help. You just have to sign petitions and then vote for state-level anti-gerrymandering provisions. Since 2000, seven states, led by Arizona, Florida and Michigan, have seen successful campaigns that have reined in gerrymandering. Harvard Business Review Press The fourth is to reject one-sided political relationships. American political relationships took a big step toward lopsidedness in the 1994 midterm elections, when the Republicans gained 56 House seats and nine Senate seats to take control of both houses of Congress for the first time in 52 years. Widely credited with this success was the Newt Gingrichâ\u0080\u0093inspired â\u0080\u009cContract with America,â\u0080\u009d which promised eight major legislative reforms and 10 specific bills that would be enacted if America voted in Republican congressional majorities. While Gingrichâ\u0080\u0099s proposal was a â\u0080\u009ccontractâ\u0080\u009d in some very basic sense, it was pretty one-sided. The electorate was asked to do one simple thing on one single dayâ\u0080\u0094pull a lever for a Republican congressional candidate in a polling stationâ\u0080\u0094and the politicians would do absolutely everything else for them. Though voters pulled that lever, the Republicansâ\u0080\u0099 Senate majority it produced failed to pass the majority of the 10 promised bills. However, the Contract with America was such a strikingly successful campaign formula that it deepened and solidified the trend by which politicians make disproportionate promises while encouraging citizens to feel that they have no responsibilities for doing anything. When politicians fail to produce what was promised, which is inevitable, voters complain bitterly but readily fall for an opposition that is selling an equally one-sided contract. In effect, a passive citizenry colludes with politicians to set up a series of failures, reinforcing disengagement from an apparently paralyzed democratic system. If that is to change, citizens need to ask politicians for a real job â\u0080\u0094 and donating to their campaigns is not an acceptable answer. A real job involves changed behavior, whether through altered purchasing habits or meaningful involvement in a social cause. While the cynic may argue that in fact citizens are powerless against entrenched politicians and powerful businesses, remember Mothers Against Drunk Driving (MADD). Neither politicians nor the alcoholic beverage industry nor bars and restaurants had any enthusiasm for tackling the human carnage of drunk driving â\u0080\u0094 until one such driver mowed down Candace Lightnerâ\u0080\u0099s daughter Cari in 1980. That precipitated Lightnerâ\u0080\u0099s founding of MADD and its mammothly successful grassroots campaign that resulted in the federal government pressuring states to raise the drinking age to 21 years by 1984. Lightner started with the small step of reaching out to relatives of other drunk-driving victims to explore ways they could work together, the sort of which anyone can take. Together they started their small, grassroots organization and ended up with a big outcome. Rather than wasting time moaning, it is important for every citizen to start in one of the four small ways described above. Roger L. Martin is professor emeritus at the Rotman School of Management at the University of Toronto, where he served as dean from 1998 to 2013, and the author of â\u0080\u009cWhen More Is Not Better: Overcoming Americaâ\u0080\u0099s Obsession with Economic Efficiency.â\u0080\u009d"}]}