{"article": [{"url": "https://www.marketwatch.com/story/he-doesnt-give-me-any-money-after-snooping-i-discovered-my-husband-is-making-secret-payments-to-his-parents-should-i-ask-him-to-stop-2020-09-23", "published": 1601137460.0, "headline": "â\u0080\u0098He doesnâ\u0080\u0099t give me any moneyâ\u0080\u0099: My husband has been making secret payments to his parents. Should I tell him to stop?", "body": "Dear Moneyist, My husband and I recently bought a home and some furniture on â\u0080\u009ceasy monthly installments.â\u0080\u009d My husband is the breadwinner, but I contribute as I work part time. My in-laws live overseas and have a large property; they are building a home for us to live in. For the last two and a half years, my husband has contributed more to his parentsâ\u0080\u0099 property development than what he pays for our home in the U.S. I asked him why he did that. He said that I would not have permitted him to give that kind of money to his parents. I said, â\u0080\u009cProbably not, but I would have probably agreed to a smaller amount.â\u0080\u009d I told him that I too have desires to make investments, plan for our future and wear nice jewelry. He said itâ\u0080\u0099s his duty to contribute. Should my husbandâ\u0080\u0099s contribution be compulsory? And should I agree to these contributions? He doesnâ\u0080\u0099t give me any money. On top of that, I had to find out about this through snooping. My parents also say you should give money to your parents. I believe this should be a mutual decision. Should I put an end to these payments or tell my husband to reduce them? Why are wives always ignored in such situations? Aggrieved Wife Dear Wife, These contributions are both marital funds and money your husband has earned. For that reason, itâ\u0080\u0099s reasonable to expect he would discuss it with you ahead of time, and itâ\u0080\u0099s reasonable for him to expect you to agree to some compromise. It appears that this property is also an investment in both of your futures, and should provide a second home for you now and/or in your retirement. Buying furniture on a monthly payment will result in a larger total payment, but if itâ\u0080\u0099s the only way you can pay your mortgage, contribute to this property development and furnish your home, it may be no bad thing. You donâ\u0080\u0099t say whether your husband has siblings, but I urge you to ensure that his contributions are fairly represented in the deed for this new home and/or your in-lawsâ\u0080\u0099 will. It is not healthy that your husband made these payments without consulting you. But if he is the breadwinner, and you began your marriage with your husband making the financial decisions, and you not making a financial contribution to the household, I can see how this kind of murky situation arose. There is a gift tax to such arrangements, and it took your furtive paper shuffling to discover that price. You can email The Moneyist with any financial and ethical questions related to coronavirus at qfottrell@marketwatch.com Hello there, MarketWatchers. Check outthe Moneyist private Facebook FB, +0.26% Â group where we look for answers to lifeâ\u0080\u0099s thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}