{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-climb-over-200-points-to-start-week-amid-vaccine-hope-and-weekend-deal-making-flurry-2020-09-14", "published": 1600102220.0, "headline": "Dow ends 327 points higher as stocks rebound amid vaccine hopes, IPO rush and corporate deal-making", "body": "U.S. stocks rose Monday, taking back a chunk of last week’s losses amid fresh hope for a coronavirus vaccine, a flurry of initial public offerings and potential corporate mash-ups, including reports that Oracle plans to forge a partnership with TikTok, the popular China-based social-media platform. How did equity benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% rose 327.69 points, or 1.2%, to finish at 27,993.33, after briefly trading above the 28,000 threshold. The S&P 500 SPX, +0.87% added 42.57 points, or 1.3%, closing at 3,383.54. The Nasdaq Composite COMP, +1.39% climbed 203.11 points, or 1.7%, to end at 11,056.65, snapping a two-session losing streak. The Russell 2000 index RUT, +0.55% of small-capitalization stocks rose 39.70 points, or 2.7%, to end at 1,536.97, outperforming the major stock benchmarks. Equities ended Friday with the Dow posting a weekly loss of 1.7%, while the S&P 500 fell 2.5% and the Nasdaq Composite Index dropped 4.1%, marking its worst weekly plunge since the period ended March 20, according to Dow Jones Market Data. What drove the market? Equities on Wall Street closed higher on Monday, as investors embraced positive developments on the vaccine front and geared up for the year’s busiest week so far for initial public offerings. Snowflake, a cloud-computing company, looks to lead the way, with plans to raise up to $3.08 billion at a valuation of up to $30.5 billion. A dozen companies are on tap to go public for the week, while aiming to raise a collective $6.8 billion. Read: IPO market gears up for busiest week since May of 2019 — Uber’s IPO week — with 12 deals on tap “That’s another positive affecting the market today,” said John Carey, director of U.S. equity income at Amundi Pioneer, of the slate of IPO and large batch of corporate tie-ups announced over the weekend. “Otherwise, we’ve got terrible fires in the Western part of the country that’s just devastating, civil unrest and an acrimonious political environment as this campaign season heats up,” he told MarketWatch. “Certainly, other things could be front-and-center any other week,” he said, adding that instead it’s “off to the races.” President Donald Trump visited the Sacramento, Calif., area on Monday and argued with Wade Crowfoot, California’s secretary for natural resources, about climate change’s role in the wildfires raging in the West. Joe Biden, campaigning in Delaware in his bid for the White House, attacked Trump’s responses to the wildfires and climate change on Monday, saying the fires represent “yet another crisis he won’t take responsibility for.” Major stock indexes were led higher Monday by shares of financial, energy and real-estate companies, after last week’s market turbulence led the technology-heavy Nasdaq Composite to post its steepest weekly decline since the height of the pandemic-driven selloff in March. Renewed hopes of a COVID-19 vaccine also were credited with sparking the move higher on Wall Street. Notably, AstraZeneca PLC AZN, +1.16% said over the weekend that U.K. clinical trials for its experimental coronavirus vaccine resumed after trials were paused due to an unexplained illness contracted by one of the participants who was given the vaccine. However, a restart of the trials in the U.S. remains on hold until at least midweek, until the U.S. Food and Drug Administration and a safety panel investigate the case, Reuters reported. Pfizer Inc.’s PFE, -0.27% CEO Albert Bourla in an interview with CBS News’ “Face the Nation,” on Sunday said the pharmaceutical giant should know if its own experimental COVID-19 vaccine works by the end of October — and if approved, it could be distributed in the U.S. by the end of the year. At the same time, some investors say they aren’t getting overconfident about the prospects of a coronavirus vaccine, as it remains unclear how swiftly a successful remedy could be produced in mass quantities and distributed widely. “The arrival of a vaccine will be a game-changer. But even if we start to see anything near broad distribution in the first quarter of next year, the turnaround is going to be gradual. As we have seen with testing, getting broad distribution and ubiquitous access isn’t trivial,” said James Meyer, chief investment officer at Tower Bridge Advisors. Shares of Oracle Corp. ORCL, +0.42% rose 4.3% Monday after it was named a strategic partner for the U.S. operations of ByteDance-owned TikTok, according to The Wall Street Journal, citing people familiar with the situation. Microsoft Corp. MSFT, +2.48%, which also was seen as a front-runner in negotiations for a deal to own or operate the U.S. operations of TikTok, said Sunday its bid had been rejected by ByteDance. Oracle confirmed that its name was submitted by ByteDance to serve as the “trusted technology provider” for TikTok, in a proposal given to the U.S. Treasury Department. An agreement to link up TikTok with a U.S. company comes amid rising tensions between America and China, with President Donald Trump threatening repeatedly to shut down TikTok in the U.S. if it isn’t sold to an American company by Sept. 15. Elsewhere on the tech scene, chip maker Nvidia Corp. NVDA, -0.54% agreed to buy British chip-designer Arm Holdings for more than $40 billion from SoftBank Group Corp. SFTBY, -1.46%, and drug maker Gilead Sciences GILD, +0.82% struck a deal to acquire Immunomedics IMMU, +0.31% and its breast-cancer drug Trodelvy for $21 billion, the Wall Street Journal reported. Which stocks were in focus? Shares of Seattle Genetics SGEN, +1.03% rallied 14.6% on Monday after it announced two cancer-drug-related deals with Merck & Co. Inc. Vaxart Inc.’s stock VXRT, +0.97% jumped 46.8% after the company said it had received the go-ahead from the Food and Drug Administration to begin testing its experimental oral COVID-19 vaccine in a Phase 1 clinical trial. Verizon Communications Inc. VZ, +0.23% announced Monday an agreement to buy mobile provider Tracfone from America Movil AMOV, +0.31% in a cash-and-stock deal that could be worth up to $6.9 billion. Verizon’s shares closed 0.9% higher. Wyndham Destinations Inc. WYND, -2.93% shares advanced 9.4% after it said that gross vacation ownership, or VOI, sales came to $168 million in July and August, with the trend improving in August from July. Gilead Sciences Inc. GILD, +0.82% will pay $21 billion to buy biotech Immunomedics Inc. and its breast-cancer drug. Gilead’s shares gained 2.2%. Tempur Sealy International Inc. TPX, +1.16% shares soared 8.4% after the mattress maker announced that it expects a 30% year-over-year increase in net sales in the third quarter. Uber Technologies, Inc. UBER, -0.18% shares closed 2.6% higher Monday, up for the fifth straight session and clinching their highest close since Feb. 24 when they settled at $38.31 a share, according to Dow Jones Market Data. Draft Kings Inc. DKNG, -4.51% shares soared 17.3% to a record close, its first since June 1, according to Dow Jones Market Data. Airline shares closed higher Monday amid more upbeat travel data, led by Delta Air Lines Inc, DAL, +0.39% Southwest Airlines Co. LUV, +1.89% American Airlines Group Inc. AAL, +0.34%, JetBlue Airways Corp. JBLU, -0.07%, Alaska Air Group Inc. ALK, +0.15% and United Airlines Holdings Inc. UAL, +0.32%. DAL, +0.39% Which markets were on the move? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% was flat at 0.669%. Bond prices move inversely to yields. Gold futures GCZ20, +2.17% on the New York Mercantile Exchange rose 0.8% to settle at $1,963.70 an ounce. Meanwhile, U.S. crude futures CL00, -1.62% fell 0.2% to end at $37.26 a barrel. In global equities, the Stoxx Europe 600 index SXXP, +0.55% rose 0.2% and the U.K.’s FTSE 100 UKX, +0.64% ended with a 0.1% loss. Japan’s Nikkei NIK, -0.11% closed 0.7% higher, while China’s CSI 300 index 000300, +2.04% gained 0.5%. The ICE U.S. Dollar Index DXY, -0.58%, a measure of the greenback’s strength against its major rivals, weakened 0.3%. Mark DeCambre contributed reporting"}]}