{"article": [{"url": "https://www.marketwatch.com/story/why-the-feds-new-index-approach-to-buying-us-corporate-debt-changes-everything-2020-06-18", "published": 1592497160.0, "headline": "Why the Fed's new index approach to buying U.S. corporate debt 'changes everything'", "body": "Borrowing by big U.S corporations was expected to slow down going into the summer after the first five months of the year saw a record $1 trillion worth of new investment-grade corporate bonds issued. But the pace of borrowing sped up again this week after the Federal Reserve unveiled changes to its $750 billion emergency corporate lending facility on Monday to make it easier for credit to flow to a broad-base of companies during the coronavirus pandemic. Specifically, the Fed said that it would start buying eligible corporate bonds included in standard indexes used in the secondary market, where debt trades on the open market once it's issued, rather than just buying corporate bond exchange traded funds. Those purchases, importantly, will no longer require certification, a formal process where a company shows it is not insolvent, but also that it would otherwise lack adequate access to funding at reasonable rates. Another potential sticking point is that certification also would require companies to say they have no conflicts of interest in relation to the CARES Act, which intend to prevent businesses owned by senior government officials from taking advantage of stimulus funds. \"The big difference is that this is going to allow them to buy bonds without companies having to certify any sort of eligibility,\" said David Del Vecchio, a portfolio manager at PGIM Fixed Income, in an interview. \"This new index-based approach really kind of changes everything.\" However, in testimony to Congress this week Fed Chairman Jerome Powell said the Fed would only materially increase its overall buying of corporate if credit markets seized up. Powell's remarks have not stopped companies from selling debt, however. Ford Motor Credit F, -1.36%  and Merck & Co MER, +27.69%  were among the companies that sold bonds maturing in five years or less and had investment-grade ratings, as of late March. Pacific Gas and Electric Co., which is issuing debt as it plans to exit bankruptcy with more leverage than ever before, also sold bonds this week that could be eligible for the Fed purchase program. The California power giant was able to ratchet back how much spread, or compensation over a risk free benchmark, it paid investors in the new bond deal, a sign of high demand and often also of a risk-on market. \"We are in a crazy place,\" said John Kaprich, investment director at Aware Asset Management, in an interview with MarketWatch. \"Don't get me wrong. I'm thankful for the Fed support. But my portfolio is volatile and I don't feel like I'm always getting compensated to take on that volatility.\" Goldman Sachs analysts recently noted that weekly issuance in investment-grade corporate bonds had been running at a pace of $71 billion from mid-March through late May, but in recent weeks plunged as low as $40 billion. This week alone though, investment-grade corporations have issued around $52 billion of bonds as of Wednesday, contributing to this year's tally of $1.2 trillion, according to BofA Global Research. The Fed may buy up to $250 billion of corporate bonds in the secondary market whereas in the larger primary market facility, where the Fed can directly purchase new corporate debt at issuance, it may buy up to $500 billion but borrowers must still meet the certification requirements. Even if the Fed's change to its secondary market corporate bond buying doesn't lead it to hoover up a large swathe of debt, it may serve as a reminder to investors that the central bank is willing to support markets whenever financial conditions deteriorate, as they briefly did last Thursday when the S&P 500 SPX, +0.87%  index fell nearly 6% in a single session. \"This is a booster shot to remind the market that they're still hanging around,\" said Patrick Leary, chief market strategist at Incapital, an underwriter of corporate bonds, in an interview. Read: Why it might be a gamble for companies to borrow directly from the Fed"}]}