{"article": [{"url": "https://www.marketwatch.com/story/sales-of-junk-bonds-hit-record-in-june-as-debt-saddled-corporations-rush-to-raise-cash-2020-06-30", "published": 1593532760.0, "headline": "Sales of 'junk' bonds hit record in June as debt-saddled corporations rush to raise cash", "body": "The most indebted companies in the U.S. sold the most bonds in a month ever, as corporate financial officers and investment bankers looked to take advantage of investor thirst for yield. Leveraged businesses have tapped capital markets as they look to build up their cash buffers amid the current COVID-19 pandemic, which has laid waste to the revenues of profitable businesses and stalled activity in factory floors. Much of this new supply has been underpinned by the Federal Reserve's support, which cut interest rates to zero and deployed credit facilities that directly bolstered the corporate debt market for the first time in the central bank's history. \"It's been an incredible calendar in the last couple of weeks,\" said Ted Swimmer, head of corporate finance at Citizens Bank, in an interview. \"The recent rise has recently been because of what we went through COVID in March. And with rates being at such low levels, more issuance would have been expected.\" Dealogic reported U.S. issuance among sub-investment grade, or junk-rated, companies stood at $51.5 billion in June, far outpacing the previous monthly record of $40.8 billion in September 2012. On the other side, cash has streamed into the bond market as money managers look to put the influx of capital to work. Morningstar reported funds focusing on junk debt enjoyed $19.8 billion of inflows this month. It's not clear, however, if corporate bond issuance will maintain its heady pace if the economic climate is too murky, as private equity and other investors may be unwilling to snap up companies with borrowed funds, said Swimmer. Total merger and acquisition activity slumped 85% from to $94.3 billion in the second quarter, versus the comparable quarter last year, according to Refinitiv. Though, issuance hit a monthly record in June, many businesses aren't taking it for granted amid worries that leveraged companies may see a repeat of February and March, when the pipeline for sub-investment grade bond issuance was blocked for days and weeks throughout late February and March. That exposed a weak spot for leveraged companies particularly reliant on being able to refinance new debt to continue operating. Back in March, the stock-market selloff saw the fastest ever 30% decline in the S&P 500 SPX, +0.87%. The rapid deterioration of investor sentiment spilled over into neighboring financial markets, lifting borrowing costs for cash-hungry high-yield corporations desperate to roll over their debt payments. Since then, the average cost to borrow funds by a basket of sub investment-grade issuers has come down considerably, and now stands at 6.88%, according to data from ICE Data Services, well below the peak of 11.38% back in March 23. See: Junk-bond issuance stops 'dead in its tracks' on coronavirus fears Still, the rush of new supply this month doesn't mean money managers are ruling out defaults and bankruptcies to afflict debt-addled firms, even with the Fed's considerable efforts to support the flow of credit. Moody's anticipates the default rate among high-yield companies to hit 14% in the next 12 months."}]}