{"article": [{"url": "https://www.marketwatch.com/story/harris-pence-debate-puts-spotlight-on-54-million-americans-with-pre-existing-conditions-and-how-they-would-be-covered-if-obamacare-falls-2020-10-08", "published": 1602238040.0, "headline": "Harris-Pence debate put spotlight on 54 million Americans with pre-existing conditions - and how they would be covered if Obamacare falls", "body": "Vice President Mike Pence and Sen. Kamala Harris engaged in a more civil, substantive debate than President Donald Trump and Democratic nominee Joe Biden did one week earlier. That's not to say the pair answered all the questions posed to them. One reply from Pence in particular could leave millions of Americans with pre-existing health conditions wishing for more. Moderator Susan Page asked Pence to \"tell us specifically, how would your administration protect Americans with pre-existing conditions to have access to affordable insurance if the Affordable Care Act (ACA) is struck down?\" Pence didn't answer the question, though, at another point in the evening, he said the Trump administration has plans \"to improve health care and protect pre-existing conditions for every American.\" That comes weeks after the president signed an executive order pledging protections so \"Americans with pre-existing conditions can obtain the insurance of their choice at affordable rates.\" But Harris didn't buy it. \"If you have a pre-existing condition, heart disease, diabetes, breast cancer, they're coming for you,\" she said during the debate. Between a coronavirus pandemic that had infected 7.6 million Americans as of Friday and a high-stakes Supreme Court case just weeks away, health insurance for people with pre-existing health conditions is on the minds of many. The ACA, also known as Obamacare, outlawed health insurance carriers from increasing prices or denying coverage for people due to their pre-existing conditions. There are 54 million non-elderly adults with a pre-existing condition that would have resulted in coverage denial without the ACA, according to the Kaiser Family Foundation. More than 100 million people also had health conditions that, without the law, would possibly result in higher premiums and coverage limits, wrote Larry Levitt, executive vice president for health policy at the foundation, which focuses public health matters. It's possible a coronavirus infection would become a pre-existing condition without the ACA, according to Levitt. He also noted that Trump's executive order on pre-existing conditions \"carries no force of law, and he has never released a plan to replace the ACA or protect people with pre-existing conditions.\" By October, the pandemic may have already added roughly 3.4 million adults under age 65 who contracted COVID-19 to the rolls of Americans with pre-existing conditions, according to The Commonwealth Fund, a private foundation offering grants and analysis on health care matters. If the current infection rate holds, the pandemic could add over 20,000 non-elderly adults daily to the number of Americans with pre-existing conditions, researchers at the foundation estimated. See also: 'We were frustrated and afraid': Some COVID-19 patients suffer lung and heart damage, but there's encouraging news for these 'long haulers' One week after Election Day, the Supreme Court will hear arguments in a case filed by an array of Republican attorneys general seeking to strike down the ACA, known an Obamacare. With the individual mandate penalty now at $0, the entire law falls apart, they argue. Harris's home state of California is leading the charge to defend the law and they say 20 million people could lose health coverage if the ACA falls. It remains to be seen whether eight justices will hear the case or nine justices will decide the matter. The confirmation hearing for Trump's Supreme Court nominee, Judge Amy Coney Barrett, is scheduled to start Oct. 12. Barrett would replace Justice Ruth Bader Ginsburg, a member of the court's liberal wing, who died at age 87 last month. The confirmation hearing is scheduled to roll on over the objections of Democrats like Harris. She reiterated those concerns at the debate, saying lawmakers should let the next president pick the next judge after the election. When Page asked Pence about specific protections for people with pre-existing conditions, he pivoted to whether Harris and Biden would work to \"pack the court\" if they won. That's a tactic where the party in power would add extra seats to the nine-person Supreme Court and fill those new seats with their own appointees. Harris didn't answer Pence's question. Harris and Biden say they want to build on Obamacare by adding a public health insurance option and lowering the Medicaid eligibility age to 60 from 65. On Thursday, a Trump campaign spokesman criticized the Biden-Harris plan and defended the current administration's work on health care matters. \"The Biden-Harris Bernie Sanders-inspired, socialist health care agenda would bankrupt U.S. taxpayers and eliminate quality access to health care for millions of Americans,\" said Ken Farnaso, deputy national press secretary. \"President Trump has fought to safeguard patients with pre-existing conditions, lower prescription drug prices, lower premiums, and will always put the health of patients first. The choice couldn't be more clear in November.\""}]}