{"article": [{"url": "https://www.marketwatch.com/story/todays-older-workers-may-see-the-first-cuts-to-social-security-benefits-2020-09-03", "published": 1601145800.0, "headline": "Today's older workers may see the first cuts to Social Security benefits", "body": "Many young Americans say they don't expect to get Social Security when they retire, but it's the older workers of today who may see the first cuts to their benefits. The Congressional Budget Office released an updated budget outlook on Wednesday, originally published in July, to reflect the impact the pandemic has had on the economy. In the report, the agency said the budget deficit will reach a record $3.3 trillion this year - and $13 trillion over the next decade. The national debt, which is projected to be 98% of gross domestic product this year, is also expected to surpass the levels of World War II next year, when it's expected to reach 104% in 2021. Among the numerous adverse effects of the current crisis is the steep incline in the expected insolvency dates for Social Security and Medicare's programs, which are expected to run out of money in 11 years compared with the previous projection of 15 years. See: Social Security recipients may be in for a rude awakening later this year The programs rely heavily on payroll taxes. The CBO expects reported receipts from payroll taxes to increase this year despite record levels of unemployment in recent months, but that will change in subsequent years, it said. Lower interest rates and price levels will also reduce the cost of Social Security and other related health care programs, according to the Committee for a Responsible Federal Budget, which did an analysis on CBO's updated outlook. Still, Social Security is in trouble. The two trust funds that support the program, which pays out retirement benefits as well as disability and survivorship benefits, are already at risk of running out of money within the next two decades. With the impact of the pandemic under review, the CBO estimates the insolvency date for Social Security Disability Insurance to be 2026, and the Social Security retirement program, known as Old-Age and Survivors Insurance, by 2031. Medicare Hospital Insurance faces insolvency by 2024 if nothing is done to rectify these projections. \"In other words, today's youngest retirees will face a sharp 25% drop in their benefits when they turn 73,\" the CRFB said in an analysis about the CBO's report. The cut is attributed to less tax revenue, an aging population that will inevitably claim Social Security benefits and trust fund assets that grow at a lower interest rate. Other research and policy organizations have even less conservative assessments - the Bipartisan Policy Center, for example, anticipates the two trust funds will be depleted around the time of the 2028 presidential election, according to an April 2020 analysis."}]}