{"article": [{"url": "https://www.marketwatch.com/story/us-chamber-pushes-for-liability-protections-scaled-back-jobless-benefits-in-next-coronavirus-bill-2020-07-16", "published": 1594914860.0, "headline": "U.S. Chamber pushes for liability protections, scaled-back jobless benefits in next coronavirus bill", "body": "The nation’s most high-profile business lobbying group laid out its markers for another coronavirus aid bill, including money to help schools reopen, reducing but not eliminating the jobless benefit add-on and more liability protections for firms. The U.S. Chamber of Commerce sent an 18-page letter Thursday to the White House and congressional leaders in both parties containing suggestions for the next bill. The letter comes as lawmakers are set to return to Washington next week and try to hammer out a new bill before the August break. Now see:Pelosi opens door to no August break for House if next coronavirus relief bill isn’t done. The price tag? According to Neil Bradley, executive vice president and chief policy officer for the Chamber, the group expects the next bill to not be as large as the House Democrats’ $3 trillion-plus bill in May. “I suspect we’ll end up somewhere slightly north of a trillion dollars, when you factor all of these things into the equation and things that aren’t on our list perhaps but are likely to be done by Congress,” Bradley told reporters in a conference call. The Chamber’s list includes a priority that has been mentioned by Senate Majority Leader Mitch McConnell as key ingredient for passage in that chamber: legal liability protections for businesses, non-profits and other organizations for damages related to COVID-19. “As if the pandemic and the economic downturn were not enough, employers are confronting the possibility of unwarranted lawsuits related to COVID that threaten their ability to operate and the economy’s ability to recover,” the Chamber wrote in its letter. The Chamber said it wanted liability protections for the length of the pandemic and the response to it for businesses, non-profits, health care providers and educational institutions that followed “applicable public health guidelines.” In contrast, House Speaker Nancy Pelosi has pushed for requiring businesses to follow Occupational Safety and Health Administration guidance Chamber officials say would be one-size-fits-all and unworkable. The Chamber endorsed retaining an add-on amount for payments to the jobless in addition to regular unemployment benefits, but it said it should be scaled back from the current $600 a week amount critics say is too generous. Also read:Goodbye, extra $600: Unemployment benefits won’t exceed former wages in next stimulus bill, Treasury’s Mnuchin says. In its stead, the Chamber suggested a variable add-on benefit to replace between 80% and 90% of a worker’s previous wage, capped at $400 a week. For states that cannot reprogram their systems to calculate the 80%-to-90% figure, the add-on should be half the maximum benefit for up to three months. The add-on amounts would phase out as each state’s jobless rate fell, reaching zero when the rate fell to 7%. The fate of the unemployment add-on is uncertain. House Speaker Nancy Pelosi has said the last week for which the current add-on will be credited is next week, to be paid out the following week, a timeline that likely precludes its renewal without at least a temporary break. At her weekly news conference, she accused Republicans of being stingy, particularly in light of the 2017 GOP-backed tax cuts. “When they’re giving away all this big money and they worry about $600 for families who need it so desperately, it just makes you wonder: who are they here for?” she asked. The Chamber letter also supported money for schools to help them reopen safely, an issue Pelosi has talked up recently. “What we’re suggesting is that schools need to pursue the plan that is best for them and the lack of funding to be able to implement that plan should not be a barrier to reopening,” Bradley said. In the letter, the Chamber also supported extending the Paycheck Protection Program through the end of the year and further easing its terms, upping the size of the employee retention tax credit, and giving aid to states to pay for COVID-19-related expenses and to make up for a large portion of revenues lost due to the pandemic."}]}