{"article": [{"url": "https://www.marketwatch.com/story/china-says-its-consulate-general-in-houston-has-been-ordered-shut-11595406195", "published": 1595407340.0, "headline": "China says its consulate in Houston has been ordered shut", "body": "Chinese Foreign Ministry spokesman Zhao Lijian takes a question at a daily media briefing in Beijing on April 8. Greg Baker/Agence France-Presse/Getty Images China on Wednesday said its consulate in Houston was ordered shut, pointing to further escalation in U.S.-Chinese tensions. China’s Foreign Ministry said it was ordered to shut the mission, which serves not just Texas but much of the South, in what it called an “unprecedented escalation.” China said there would be retaliation if the decision was not reversed. The U.S. State Department said the move was made to protect American intellectual property and private information, according to media reports citing a brief statement. The Justice Department on Tuesday accused two Chinese hackers of stealing trade secrets and trying to steal research on coronavirus vaccine candidates. Sen. Marco Rubio, a Florida Republican who recently has been banned from traveling to China, called the consulate a “spy center.” iframe.twitter-tweet { width: 100% !important; } The move had an impact on financial markets, with the dollar soaring against the Chinese yuan USDCNH, -0.71%. The dollar DXY, -0.58% also moved higher against other currencies, while U.S. stock futures ES00, +1.13% pointed to a slightly weaker start to Wednesday trading. The U.S. has taken a range of actions against China over allegations of both human-rights abuses and hacking. The U.S. imposed trade sanctions on 11 companies it says are involved in human-rights abuses in China’s largely Muslim northwestern region of Xinjiang. China’s new security law for Hong Kong also has raised tensions. Media reports from Houston said firefighters responded after consultate general officials burned documents. iframe.twitter-tweet { width: 100% !important; }"}]}