{"article": [{"url": "https://www.marketwatch.com/story/moderna-and-pfizers-covid-19-vaccine-candidates-require-ultra-low-temperatures-raising-questions-about-storage-distribution-2020-08-27", "published": 1598857460.0, "headline": "Moderna and Pfizerâ\u0080\u0099s COVID-19 vaccine candidates require ultra-low temperatures, raising questions about storage, distribution", "body": "The COVID-19 vaccine candidates being developed by Moderna Inc. and BioNTech and Pfizer Inc. will require stringent standards for refrigeration, and that may hamper how they are distributed to the hundreds of millions of Americans expecting to receive them. Shares of Moderna MRNA, +0.09% Â fell 3.5% in trading on Thursday, following a rally on Wednesday after the companyâ\u0080\u0099s disclosure that people older than 55 years old who participated in the Phase 1 trial had demonstrated neutralizing antibody titers. Pfizerâ\u0080\u0099s PFE, -0.27% Â stock was down 0.5% in Thursday trading, while BioNTech BNTX, +1.23% tumbled 3.4%. Read:Global case tally tops 24 million, U.S. tally above 5.8 million and CDC walks back change to testing guidance Executives from Moderna and Pfizer on Wednesday separately told the Centers for Disease Control and Preventionâ\u0080\u0099s Advisory Committee on Immunization Practice on Wednesday that mRNA-1273, which is Modernaâ\u0080\u0099s coronavirus vaccine candidate, requires a storage temperature of negative 4 degrees Fahrenheit. BioNTech and Pfizerâ\u0080\u0099s candidates, BN1162b2 and BNT162b2, need to be stored in negative 94 degrees Fahrenheit. â\u0080\u009cThese storage conditions would make traditional office or pharmacy administration very difficult,â\u0080\u009d SVB Leerink analysts wrote in a note to investors on Thursday. â\u0080\u009cThese conditions could be met at tertiary hospitals and laboratories and could be accommodated in intensive one-day vaccination events at such sites, but this would still only cover a fraction of the healthy population.â\u0080\u009d See also:Modernaâ\u0080\u0099s stock rises after it says COVID-19 vaccine candidate produced antibodies in older patients Officials at the Centers for Disease Control and Prevention said they are aware of the issue. Dr. Kathleen Dooling, a medical officer for the agencyâ\u0080\u0099s division of viral diseases, said Wednesday that storage, distribution, and handling requirements of these vaccines â\u0080\u009cwill make it very difficult for community clinics and local pharmacies to store and administer.â\u0080\u009d She also noted that most vaccines will have to be â\u0080\u009cadministered at centralized sites with adequate equipment and high throughput.â\u0080\u009d Pfizer will need to use ultralow temperature freezers and thermal shipper storage for its COVID-19 vaccine candidates, according to comments made by Dr. Nicholas Kitchin, senior director of Pfizerâ\u0080\u0099s vaccine clinical research and development group. The vaccines being developed by Moderna, BioNTech, and Pfizer are mRNA vaccines; however, other types of vaccines require less intense rules around storage. Concern about the difficulties of storing and shipping mMRNA COVID-19 vaccines to hundreds of millions of people could put the makers of these candidates at a competitive disadvantage, analysts say. It may also separate Modernaâ\u0080\u0099s vaccine from the ones being developed by BioNTech and Pfizer. Read: This Seattle man volunteered to be injected with an experimental COVID-19 vaccine: â\u0080\u0098It was kind of my duty as a healthy individual to step upâ\u0080\u0099 There are about half a dozen COVID-19 vaccine candidates in clinical trials in the U.S. However, not all of them are mRNA vaccines. The vaccine being developed by AstraZeneca AZN, +1.16% Â AZN, +0.63% Â and the University of Oxford is a recombinant viral vector vaccine, for example, while Inovio Pharmaceutical Inc.â\u0080\u0099s INO, -1.36% Â candidate is DNA-based. â\u0080\u009cInvestors are increasingly looking to storage and delivery conditions across vaccine candidates as they consider competitive positioning,â\u0080\u009d SVB Leerinkâ\u0080\u0099s Mani Faroohor said in a separate note to investors. Since the start of the year, Modernaâ\u0080\u0099s stock has soared 244.5%, shares of BioNTech have gained 91.9%, and Pfizerâ\u0080\u0099s stock is down 3.3%. The S&P 500 SPX, +0.87% Â is up 7.7% for the year."}]}