{"article": [{"url": "https://www.marketwatch.com/story/a-budding-recovery-could-run-into-trouble-after-the-election-warns-goldman-sachs-2020-06-16", "published": 1592300600.0, "headline": "A budding recovery could run into trouble after the election, warns Goldman Sachs", "body": "Stimulus in all shapes and sizes is spurring what looks like another day in the green for equities. The Federal Reserve said on Monday it will start buying individual corporate bonds, adding to a program previously limited to bond exchange-traded funds. Reports that the administration of President Donald Trump is considering a nearly $1 trillion infrastructure splurge are providing an extra boost. More help from central banks and governments adds credence to V-shaped — a sharp brutal decline followed by a strong bounce — recovery hopes, with Morgan Stanley among the backers of that outlook. And the economy remains a huge driver for stocks, which tanked when the Fed got super gloomy last week, and rallied earlier this month after some decent jobs news. Our call of the day comes from Goldman Sachs economists, who say there is a worry on the horizon involving just how much spending power investors will have in the next two years. They zero in on disposable income growth, which is simply what households can spend and save after they pay taxes. A team of economists, led by Jan Hatzius, estimates the U.S. had 25 million net job losses as of May, versus 9 million during the 2007-09 recession. For 2020, they see fiscal support via automatic stabilizers keeping incomes and consumption steady, turning what might have been a 3.4% drop in disposable income to full-year growth expected at around 4%. That is the good news. The bad news is that they expect a 2.3% fall in disposable income for 2021. “Barring Congressional extension of fiscal support well into 2021 — or an even sharper normalization of the jobless rate than we or consensus expect — consumer spending could therefore pose a significant risk to the budding recovery in the quarters following the election,” said Hatzius. The market Reports of a coronavirus drug and better-than-expected retails sales are fueling a huge surge in the Dow DJIA, +0.56% , S&P SPX, +0.87% and Nasdaq COMP, +1.39% in early action, while European stocks SXXP, +0.55% are also in rally mode. Asia saw powerful gains, led by a 4.7% soar for the Nikkei NIK, -0.11%. The chart Our chart from Bank of America Merrill Lynch’s May Fund Manager report shows how cash levels for institutional investors have dropped to 4.7% from 5.7%, which is the biggest monthly fall since August 2009: Much attention is focused lately on the surge in mom-and-pop retail investors using the no-fee Robinhood app to pile into beaten-down stocks. Billionaire investor Leon Cooperman says that will end in tears, but then maybe for the big players too? Also, those fund managers surveyed appear to have plenty of doubts about a V-shaped recovery: The buzz Markets are buzzing about a U.K. clinical trial of low-dose steroid treatment that has shown promising results for some critically ill Covid-19 patients. China reported 40 new coronavirus cases on Tuesday, linked to a wholesale market, as officials upped testing and lockdown measures. And U.K. travel has been blamed for two new cases in New Zealand, the first in weeks. After revoking emergency use authorization for hydroxychloroquine and chloroquine for treating COVID-19, the Food and Drug Administration has warned those drugs could interfere with Gilead’s GILD, +0.82% remdesivir. Retail sales rebounded hard in May. We will also get industrial production and a home builders index. Fed Chairman Jerome Powell will deliver his semiannual testimony to the Senate in the first of a two-day appearance. Later, we’ll hear from Fed Vice Chairman Richard Clarida. Martin Marietta Materials MLM, -0.98% and other construction stocks are surging on reports of that White House infrastructure plan. North Korea has apparently blown up a liaison building it uses with South Korea. Royalty Pharma RPRX, -0.04% , which buys royalties from drug companies, has raised $2.2 billion in what looks like the biggest initial public offering of the year so far. Apple AAPL, +1.74% is facing two EU antitrust investigations over apps. Shares are up after Citi boosted its price target to $400, a new high. Home builder Lennar LEN, +0.07% will report results, followed by technology group Oracle ORCL, +0.42% after the close.Random reads The internet wants to know why a U.S. bail bond fund that raised $20 million for protesters has only spent $200,000. Former eBay staffers charged with mailing spiders to harass couple. Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. Be sure to check the Need to Know item. The emailed version will be sent out at about 7:30 a.m. Eastern. Follow MarketWatch on Twitter, Instagram, Facebook."}]}