{"article": [{"url": "https://www.marketwatch.com/story/dow-looks-set-to-pull-back-thursday-as-it-closes-in-on-record-ahead-of-jobless-claims-report-2020-09-03", "published": 1599152120.0, "headline": "Dow ends more than 800 points lower as tech plunge gives stocks worst day since June", "body": "Technology and other high-flying stock sectors suffered steep losses Thursday as investors appetite waned following an extraordinary rally in the past month, dragging the rest of the stock market lower. How did stock-market benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% DJIA, +0.56% ended with a loss of 807.77 points, or 2.8%, at 28,292.73, after dropping more than 1,000 points at its session low. The S&P 500 SPX, +0.87% closed 125.78 points lower, down 3.5%, at 3,455.06. The Nasdaq Composite COMP, +1.39% tumbled 598.34 points, or 5%, to end at 11,458.10. The declines marked the biggest one-day drops for all three indexes since June. The fall came a day after the S&P 500 claimed its 22nd record close of the year, while the tech-heavy Nasdaq Composite arrived at its 43rd such all-time high and the Dow topped the 29,000 level for the first time since February. Thursday’s fall snapped a four-day win streak for the Nasdaq and a 10-day run of gains for the S&P 500’s tech sector. What drove the market? “In the absence of a specific catalyst, it’s easy to classify today’s swoon as profit-taking,” said Chris Zaccarelli, chief investment officer for Independent Advisor Alliance, noting that the “most-loved” parts of the market — the technology, consumer discretionary and communications services sectors — sold off the most. In One Chart:Tech stocks and the rest of the market are both very expensive -- but for very different reasons Given the scale of the market’s rally before Thursday’s swoon, analysts said it was premature to declare a tech-led correction to be under way, instead arguing that a near-term pullback was overdue and would likely prove healthy. “Tech stocks, and the overall market, hadn’t really had a bad day since June, so this is a healthy breather. It was never just going to be a straight line up. But the long-term structural support for technology has not changed and support for equities has not either,” said Esty Dwek, head of global macro strategy for Natixis Investment Managers, in emailed comments. Signs of rotation into sectors left behind by the stock market rally were easy to find. The S&P 500 index tech sector fell 5.8%, while the communications services and consumer discretionary sectors each dropped more than 3%. The energy sector, in contrast, fell just 0.7%, while financials declined 1.6%. Doubts about the prospect of further fiscal stimulus from Congress may be one factor discouraging investors who have been betting on Republicans and Democrats striking a deal later this month to offer additional relief to American consumers and businesses. On Tuesday, House Speaker Nancy Pelosi said Democrats and Republicans still have “serious differences,” following a brief phone call with Treasury Secretary Steven Mnuchin, reports said. Investors have also been calling for a rotation away from the leading tech stocks to the broader market in the hopes that it would strengthen the stock-market rally’s foundations. “There is a sort of benign way that this excess can be corrected through a process of rotation,” said Liz Ann Sonders, chief investment strategist at Schwab, in an interview. She said positive economic data could lay the path for a more sustainable rally. Thursday’s round of economic data continued to point to a steady recovery, though the prospects for the labor market were unclear ahead of Friday’s official jobs report. New applications for unemployment benefits in the latest weekly period ending in Aug. 29 fell 130,000 to a seasonally adjusted 881,000 or lower than the consensus estimate of 940,000 but this was after the Labor Department said last week it tweaked its seasonal adjustment method amid the COVID-19 pandemic. The unadjusted or real number of initial jobless claims rose slightly to 833,353 from 825,761, indicating there was barely any change last week in how many people are applying for benefits. In other data, a revised reading of U.S. second-quarter productivity rose 10.1%, while the trade deficit widened to $63.6 billion. The U.S. IHS Markit final purchasing managers index for the service sector for August was 55, up from 54.8 in July, while the Institute of Supply Management’s service sector indicator for August fell to 56.9 in August from 58.1 in July. Any number above 50 indicates an expansion in industrial activity. By most measures, the economy is still considerably weaker now than it was before the pandemic. Millions of Americans remain out of work, Congress is deadlocked over another financial-aid package, and many industries such as travel, tourism and entertainment are just a shell of their former selves. Read: U.S. likely added 1.2 million job in August, economists say, but hiring has slowedWhich stocks are in focus? Apple Inc. AAPL, +1.74% shares fell 8% for their worst day since March 16, when the plunged 12.9%. Facebook FB, +0.26% shares dropped 3.8% after announcing it would ban new political ads from running in the week before the Nov. 3 presidential election. Google parent Alphabet Inc. GOOG, +1.97% GOOGL, +1.82% ended 5% lower after reports the Justice Department could bring an antitrust case against the search giant as soon as this month. Cloud-based software firms also saw shares under pressure, with Salesforce.com Inc. CRM, +2.21% ending 7.8% lower. High-flying chip stocks also fell, with the Philadelphia Semiconductor Index SOX, +1.77% off 5.7%. Michaels Cos. Inc. shares MIK, -1.95% tumbled 13.6%, even after the arts and crafts retailer blew past estimates for the second quarter as stores reopened after being closed during the pandemic. Shares of Sanofi SNY, +0.89% declined 1.4% after the drugmaker and GlaxoSmithKline GSK, +1.10% said their COVID-19 vaccine candidate has entered a Phase 1/2 clinical trial. Arconic Corp. ARNC, +3.32% said Thursday it restored the salaries and 401K match for all of its U.S. salaried employees, including executives, on Sept. 1, after cutting them earlier this year to counter the impact of the coronavirus pandemic. Its shares fell 3.1%. Shares of Designer Brands Inc. DBI, -1.28% plummeted 19%, after the parent of the DSW Designer Shoe Warehouse retail chain reported a wider-than-expected fiscal second quarter How are other markets trading? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 2.9 basis points to 0.621%. Bond prices move inversely to yields. The ICE U.S. Dollar Index DXY, -0.58%, which tracks the performance of the greenback against its major rivals, fell 0.1%. Gold futures GCZ20, +2.17% ended lower. U.S. benchmark crude futures CL.1, -1.62% ended lower. The Stoxx Europe 600 index SXXP, +0.55% declined 1.4%, while the U.K.’s benchmark FTSE UKX, +0.64% lost 1.5%. In Asia, Hong Kong’s Hang Seng Index HSI, -0.30% fell 0.5% and China’s CSI 300 000300, +2.04% closed 0.6% lower. The Nikkei NIK, -0.11% rose 0.9%. Mark DeCambre contributed to this report."}]}