{"article": [{"url": "https://www.marketwatch.com/story/tropical-storm-isaias-near-hurricane-strength-as-it-moves-toward-carolinas-2020-08-03", "published": 1596535760.0, "headline": "Tropical storm Isaias spawns wild weather on the east coast", "body": "SOUTHPORT, N.C. (AP) — Tropical Storm Isaias spawned tornadoes and dumped rain during an inland march up the U.S. East Coast on Tuesday after making landfall as a hurricane in North Carolina, where it piled boats against the docks and caused floods and fires that displaced dozens of people. At least one person was killed when one of its twisters hit a mobile home park. Royce Potter, a fifth-generation seafood purveyor and owner of Potter’s Seafood in Southport, said he rode out the storm on a boat docked near his business after he got the impression from forecasters that his area would be spared. “They got this wrong,” he said, visibly shaken. “I’ve ridden storms out here for years.” The predicted storm surge and wind gusts left dozens of boats piled up against the docks, and many decks facing out on the water were smashed. People were out Tuesday morning raking debris or picking it up with their hands and dropping it in trash cans. iframe.twitter-tweet { width: 100% !important; } Isaias spawned multiple tornadoes, including one that caused at least one death and multiple injuries as it flattened a mobile home park in Windsor, North Carolina, according to Bertie County Sheriff John Holley. He said 10 homes were destroyed and crews are searching for several people who are unaccounted for. “It doesn’t look real, it looks like something on TV. Nothing is there,” Holley told reporters. “All my officers are down there at this time. Pretty much the entire trailer park is gone.” The hurricane’s eye moved over land near Ocean Isle Beach, North Carolina, just after 11 p.m. on Monday with maximum sustained winds of 85 mph (136 km/h), and its top winds dropped to 70 miles per hour (117 km/h) by early Tuesday. But forecasters said hurricane-force gusts were likely in the Chesapeake Bay region, and tropical storm conditions were expected across New England Tuesday night. “Potentially life-threatening urban flooding is possible in D.C., Baltimore and elsewhere along and just west of the I-95 corridor today,” the National Hurricane Center also warned. iframe.twitter-tweet { width: 100% !important; } “We don’t think there is going to be a whole lot of weakening, we still think there’s going to be very strong and gusty winds that will affect much of the mid-Atlantic and the Northeast over the next day or two,” hurricane specialist Robbie Berg told The Associated Press. Other tornadoes were confirmed by the national weather service, including two near Kilmarnock, Virginia, and Vienna, Maryland. Power outages also spread as trees fell, with more than 700,000 customers losing electricity, most of them in North Carolina and Virginia, according to PowerOutage.US, which tracks utility reports. Isaias (pronounced ees-ah-EE-ahs) toggled between tropical storm and hurricane strength throughout its path to the U.S. coast, killing two people in the Caribbean and trashing the Bahamas before brushing past Florida. Most of the significant damage seemed to be east and north of where the hurricane’s eye struck land. On North Carolina’s Oak Island, deputies had to rescue five adults and three children after the storm hit, causing damage along the beachfront and knocking electricity and sewer facilities offline, authorities said. The storm set off flooding and sparked five home fires in Ocean Isle Beach, North Carolina, Mayor Debbie Smith told WECT-TV, and firefighters from Horry County, South Carolina crossed the state line to help out, their spokesman, Tony Casey, told The Associated Press. Further up the coast, about 30 people were displaced by a fire at a condominium complex in Surf City, news outlets reported. It wasn’t immediately clear if the fires were connected to the storm. No injuries have been reported. And in Suffolk, Virginia, near the coast, multiple homes were damaged by falling trees, and city officials received reports of a possible tornado. A fire station downtown sustained damage including broken window. A photo posted by city officials showed a pile of bricks lying next to a damaged business. Coastal shops and restaurants had closed early in the Carolinas, where power began to flicker at oceanfront hotels and even the most adventurous of beachgoers abandoned the sand Monday night. The Hurricane Center warned oceanside home dwellers to brace for storm surge up to 5 feet (1.5 meters) and up to 8 inches (20 centimeters) of rain in spots. As the storm neared the shore, a gauge on a pier in Myrtle Beach recorded its third highest water level since it was set up in 1976. Only Hurricane Hugo in 1989 and Hurricane Matthew in 2016 pushed more salt water inland."}]}