{"article": [{"url": "https://www.marketwatch.com/story/why-asian-and-black-americans-continue-to-experience-covid-19-related-discrimination-and-what-you-can-do-about-it-2020-07-10", "published": 1594990340.0, "headline": "Why Asian and Black Americans continue to experience COVID-19-related discrimination â\u0080\u0094 and what you can do about it", "body": "COVID-19-related discrimination has dropped from its peak in April but still persists for Asian, Black and Latino Americans, new research suggests â\u0080\u0094 and experts say there are steps anyone can take to help eradicate it. Asian Americans in early June were more than twice as likely as white Americans (13% versus 5%) to report having recently experienced COVID-19-associated discrimination, according to results from the ongoing Understanding Coronavirus in America Study conducted by USC Dornsifeâ\u0080\u0099s Center for Economic and Social Research (CESR). Black (9%) and Latino Americans (9%) were nearly twice as likely as white people to report this experience. The survey measured perceived COVID-19-associated discrimination by whether respondents said they had been treated with less respect and courtesy than others, experienced people acting afraid of them, were harassed or threatened, or received poorer service at stores or restaurants due to â\u0080\u009cpeople thinking they might have the coronavirus.â\u0080\u009d â\u0080\u009cThis discrimination thatâ\u0080\u0099s associated with COVID-19 is real, and itâ\u0080\u0099s serious,â\u0080\u009d Ying Liu, a research scientist at CESR, told MarketWatch. â\u0080\u009cThough it seems like the trend is trending downward a little bit, still we see a substantial amount of people are still experiencing discrimination now, particularly among racial and ethnic minorities. ... The racial disparity we see is still very persistent.â\u0080\u009dRisk factors for experiencing coronavirus-related discrimination A new peer-reviewed study, co-authored by Liu and published this week in the American Journal of Preventive Medicine, analyzed nationally representative data from 3,665 respondents to March and April surveys from the same data source. It found that overall perceptions of discrimination related to COVID-19 rose from 4% to 10% between March and April, with Black and Asian Americans more likely than other groups to say they had experienced it. Meanwhile, perceiving COVID-19-related discrimination was associated with heightened mental distress, the study found, as measured by respondentsâ\u0080\u0099 feelings of anxiety and depression. â\u0080\u009cElevated risk among Asians in March confirms the media reports on hate crimes,â\u0080\u009d Liu and her co-authors wrote. â\u0080\u009cNon-Hispanic blacks are another group who persistently experience more [COVID-19-associated discrimination], and their risk increased from March to April,â\u0080\u009d they added. â\u0080\u009cThis could reflect the longstanding stereotypes associating non-Hispanic blacks with the spread of infectious diseases, while the increased risk in April could be attributable to media coverage on their disproportionately higher mortality rate due to COVID-19.â\u0080\u009d Moreover, face-mask wearers more likely than non-face-mask wearers to perceive COVID-related discrimination. This confirmed â\u0080\u009cmedia reports on the stigmatization of mask wearing during the pandemic, reflecting longstanding bias in the West and contradicting public messaging across different disease control phases,â\u0080\u009d the authors wrote. Heavy social media users were also potentially at greater risk than non-social media users for perceiving this type of discrimination, as were people who worked outside and wore face masks compared to those who didnâ\u0080\u0099t work. “ â\u0080\u0098We have these historical racist images of these two groups that have been a part of our country for a long time, and we have the current realities of whatâ\u0080\u0099s going on with COVID-19. Both of these are influencing the experiences that Asian Americans and Black Americans are reporting.â\u0080\u0099 ” â\u0080\u0094 Marya Mtshali, a Harvard University lecturer in women, gender and sexuality studies The study defined COVID-19-associated discrimination as self-reported perception of â\u0080\u009cdiscrimination toward people who share social or behavioral characteristics with COVID-19 patients but may not carry the novel virus.â\u0080\u009d As the researchers note, this type of discrimination first surfaced in online anti-Chinese rhetoric and in surging reports of racist incidents targeting Asian Americans. The novel coronavirus was first observed in Wuhan, China. A recent Pew Research Center survey showed a similar trend, finding that 39% of Asian Americans and 38% of Black Americans â\u0080\u0094 compared to 27% of Hispanic Americans and 13% of white Americans â\u0080\u0094 said people had acted uncomfortable around them because of their race or ethnicity since the COVID-19 outbreak. Asian and Black Americans were also more likely to report being the subject of jokes or slurs, and fearing threats or physical attacks. When it came to worrying others might be suspicious of them if they wore a mask in public because of their race or ethnicity, 42% of Black respondents and 36% of Asian respondents reported feeling this way, according to the Pew survey, in contrast to 23% of Hispanic respondents and 5% of white respondents.â\u0080\u0098Fear doesnâ\u0080\u0099t excuse people behaving very poorlyâ\u0080\u0099 â\u0080\u009cWe have these historical racist images of these two groups that have been a part of our country for a long time, and we have the current realities of whatâ\u0080\u0099s going on with COVID-19,â\u0080\u009d Marya Mtshali, a Harvard University lecturer on women, gender and sexuality studies, told MarketWatch. â\u0080\u009cBoth of these are influencing the experiences that Asian Americans and Black Americans are reporting.â\u0080\u009d Mtshali traced the origins of this discrimination, in part, back to historical racist imagery of Asian Americans related to lack of cleanliness and contagious disease. The fact that COVID-19 cases were first reported in China, she said, â\u0080\u009cfeeds into these unfair racist stereotypes of Asian Americans being harbingers of disease.â\u0080\u009d â\u0080\u009cWhen people may think of Asian Americans in regards to COVID-19, we have a lot of these things readily available to pull from our culture that we associate with Asian Americans that can result in fear,â\u0080\u009d she said. Longstanding stereotypical associations of Blackness with criminality may also play a role, Mtshali added. When some people see a Black person adhering to public-health guidance by wearing a scarf or bandana as a makeshift face covering, they might respond with fear, she said; at the same time, reports of COVID-19â\u0080\u0099s disproportionate impact on Black Americans could also be leading some people to unfairly fear that Black people they encounter might have coronavirus, she said. â\u0080\u009cTo make it very clear, fear doesnâ\u0080\u0099t excuse people behaving very poorly,â\u0080\u009d Mtshali said. Just as many white people are struggling with coronavirus-induced job loss and concerns of getting sick, so too are many minority communities, she said â\u0080\u0094 and â\u0080\u009cto have to add this public-health issue of racism and discrimination on top of that just makes things worse for these communities.â\u0080\u009d Richard Reddick, the associate dean for equity, community engagement and outreach at the University of Texas at Austinâ\u0080\u0099s College of Education, said that scapegoating was â\u0080\u009can unfortunate legacy of pandemics.â\u0080\u009d He also pointed to President Trumpâ\u0080\u0099s previous embrace of the term â\u0080\u009cChinese virus,â\u0080\u009d which experts warned could lead to discrimination against Asian Americans. “ â\u0080\u0098Promoting mask wearing might help not just with preventing new infections, but also with preventing this type of discrimination.â\u0080\u0099 ” â\u0080\u0094 Ying Liu, a research scientist at USC Dornsifeâ\u0080\u0099s Center for Economic and Social Research Trump more recently has referred to COVID-19 using the racist term â\u0080\u009ckung flu.â\u0080\u009d (Press Secretary Kayleigh McEnany last month denied that the president had used racist language in describing the coronavirus. â\u0080\u009cWhat the president does do is point to the fact that the origin of the virus was China,â\u0080\u009d she said. â\u0080\u009cItâ\u0080\u0099s a fair thing to point out.â\u0080\u009d) â\u0080\u009cLeadership matters,â\u0080\u009d Reddick said. The countryâ\u0080\u0099s top leaders making clear that such discrimination is unacceptable, and avoiding attaching a nationality to a virus that has spread globally, â\u0080\u009cwould have helped blunt some of these discussions,â\u0080\u009d he said. During the same June 22 briefing, McEnany said, â\u0080\u009cThe President has said very clearly, itâ\u0080\u0099s â\u0080\u0098important that we totally protect our Asian [American] community in the U.S. and all around the world. Theyâ\u0080\u0099re amazing people, and the spreading of the virus is not their fault in any way, shape, or form. Theyâ\u0080\u0099re working closely with us to get rid of it. We will prevail together. Itâ\u0080\u0099s very important.â\u0080\u0099â\u0080\u009dHow you can help fight COVID-19-related discrimination Wear a mask and encourage others to do so. This can help reduce the stigma associated with masks, Liu said. â\u0080\u009cPromoting mask wearing might help not just with preventing new infections, but also with preventing this type of discrimination,â\u0080\u009d she said, pointing to her study findings. â\u0080\u009cIf everyone wears it, you wonâ\u0080\u0099t have a second look if the person next to you wears it.â\u0080\u009d After all, Mtshali said, â\u0080\u009cthis will be the rest of 2020,â\u0080\u009d and possibly even 2021. â\u0080\u009cItâ\u0080\u0099s something that we need to get used to, and we need to normalize it so itâ\u0080\u0099s not associated with anything outside of just being a good member of your community and protecting others.â\u0080\u009d Wearing your own mask reminds others to wear theirs as well, she added. Speak up when you witness racism. Itâ\u0080\u0099s important to call out racism as a bystander, Mtshali said, and make the people around you understand that such actions and words are not OK. While it can be uncomfortable to intervene with friends and family, silence often equals acceptance, she said. â\u0080\u009cWeâ\u0080\u0099re talking about this a lot in regards to Black Lives Matter in this current moment, and trying to be more proactive at being anti-racist,â\u0080\u009d Mtshali said. â\u0080\u009c[But] when we talk about being anti-racist, itâ\u0080\u0099s important to understand weâ\u0080\u0099re talking about all races, not just one particular race.â\u0080\u009d Educate yourself on the history of racism in the U.S. When most Americans hear racist rhetoric today, â\u0080\u009cthey donâ\u0080\u0099t understand that itâ\u0080\u0099s part of this longer racist history,â\u0080\u009d Mtshali said. She recommended reading â\u0080\u009cYellow: Race in America Beyond Black and Whiteâ\u0080\u009d by Frank Wu and â\u0080\u009cA Different Mirror: A History of Multicultural Americaâ\u0080\u009d by Ronald Takaki. â\u0080\u009cIt would be really good for folks to crack open a book or two,â\u0080\u009d Reddick agreed, and to realize that â\u0080\u009cin times of pandemics, in times of great worldwide fear, scapegoating is a very common tactic thatâ\u0080\u0099s used to blame somebody.â\u0080\u009d He recommended an earlier book by Takaki, â\u0080\u009cStrangers from a Different Shore: A History of Asian Americans.â\u0080\u009d â\u0080\u009cThe more knowledge we have, weâ\u0080\u0099re able to then identify these racist tropes and call them out for what they are,â\u0080\u009d Mtshali said."}]}