{"article": [{"url": "https://www.marketwatch.com/story/eu-lawmakers-ask-jeff-bezos-if-amazon-is-spying-on-politicians-after-controversial-job-posting-11602161477", "published": 1602162620.0, "headline": "Amazon sought to hire intelligence analysts in EU spying row", "body": "Amazon said that it doesn’t spy on third party groups, but rather looks at public information to understand the environment in which it operates. Angela Weiss/Agence France-Presse/Getty Images European lawmakers have written to Amazon founder Jeff Bezos demanding to know whether the e-commerce giant intends to spy on labor organizers and political leaders, weeks after the company removed job posts for intelligence analysts. The open letter from Members of the European Parliament (MEPs) pressed Bezos for answers over whether the company intentionally targets trade unionists, its own workers, and politicians, and criticized Amazon AMZN, +3.01% for being “antiunion.” The job postings for two intelligence analysts to work in Phoenix, Arizona, were first reported last month. The role, according to the posting, would involve covering topics “including organized labor, activist groups, hostile political leaders.” The postings included organized labor alongside hate groups and terrorism as “topics of importance to Amazon.” Read: Amazon says over 19,000 of its employees have caught COVID-19 You can read the job posting for a senior intelligence analyst, digitally archived on Sept. 1, at this link. Amazon said that “the job post wasn’t an accurate description of the role — it was made in error and has since been corrected.” The MEPs told Bezos that they “wonder about your intentions with great concern.” “Does Amazon’s monitoring intentionally target trade unionists, Amazon workers, as well as political representatives (including ourselves) who could possibly express criticism of its activities?” The letter to Jeff Bezos, first published in the Guardian, was initiated by Leïla Chaibi of France’s left-wing La France Insoumise party, and signed by 37 other European Parliament lawmakers, mostly from left-wing and green parties. iframe.twitter-tweet { width: 100% !important; } It highlighted the posts’ inclusion of French and Spanish language skills as “highly desired,” and questioned whether the company intended to monitor people and groups in Europe. “Has Amazon already spied on Members of the European Parliament? Did it intend to?” Amazon said that it doesn’t spy on third-party groups, but rather looks at public information to understand the environment in which it operates. Calling the recruitment of employees to spy on internal and external threats “intolerable,” the MEPs also broadly criticized Amazon’s labor practices, including “intensity of tasks, a constant drive toward productivity, management based on timed control of manual gestures, and the use of blackmail on a worker’s individual performance.” The MEPs said these management practices were “more than questionable” and allowed the company “to avoid any form of workers’ collective organization.” Also: Amazon reaches 1 million workers amid pandemic hiring frenzy In response to the letter’s allegations on unions and working conditions, Amazon’s representatives said that they “already have works councils and employee bodies at Amazon.” “The fact is we already offer excellent pay, excellent benefits and excellent opportunities for career growth, all while working in a safe, modern work environment. At Amazon, these benefits and opportunities come with the job, as does the ability to communicate directly with the leadership of the company,” the company said. This isn’t the first time Amazon, which employs around one million people globally, has been criticized for its labor practices. On Sept. 30, a coalition of trade union leaders representing over 12 million workers called on the European Commission to investigate Amazon’s activities, including allegations that it surveilled its own employees. Previous reports, including a Guardian investigation from last year, have alleged that Amazon employees claim they have been subjected to poor working conditions and have been punished for getting injured on the job."}]}