{"article": [{"url": "https://www.marketwatch.com/story/square-stock-gets-an-upgrade-as-cash-app-enthusiasm-keeps-growing-11600960214", "published": 1600946300.0, "headline": "Square stock gets an upgrade as Cash App enthusiasm keeps growing", "body": "Square's Cash App offers peer-to-peer money-transfer services for free but makes money when users spend funds through an associated debit card. Square Square Inc. seems to be following the same playbook with its consumer-facing Cash App that it did with its merchant-oriented card-processing business, and that’s one reason to be upbeat about its stock, according to Oppenheimer analyst Jed Kelly. Read: Square to offer early access to earned wages for employees of its merchants He upgraded shares of Square SQ, +2.06% to outperform from perform Thursday, arguing that the company could see an “equal level of success” with the Cash App as it did with its card-processing dongle in the early 2010s. The stock is up 1.5% in morning trading. Kelly is optimistic about the company’s ability to continue amassing a wide base of users by offering free peer-to-peer payment services and then finding ways to monetize those users with things like the Cash Card debit card and small fees for those who want to instantly transfer their funds to their bank accounts. “We believe by reinvesting profits from prior Cash App cohorts, combined with its seller ecosystem, Square can develop significant network effects and products that will be challenging for other neo-banks to replicate in the digital wallet space,” he wrote in his note to clients, while $185. Square estimates a $63 billion total addressable market for the Cash App. Read: Venmo and Square’s Cash App were going gangbusters before the pandemic — now they’re doing even better Separately, Mizuho analyst Dan Dolev also chimed in with a cheery view of the Cash App Thursday, calling the business “unstoppable” and writing that the service’s total addressable market could double if Square got into new areas like small loans, insurance, and wealth management. Dolev wrote that the company benefits from better unit economics than traditional banks or neobanks because the Cash App’s peer-to-peer service enables it to more cheaply acquire new customers. Because of this, “Square does not need to recoup acquisition costs by offering mortgages like banks do,” he said. In Dolev’s view, investors shouldn’t worry about the sustainability of the Cash App’s revenue growth because “new products like Cash Card are following similar trajectories of the successful Instant Deposit product.” He maintained a buy rating and $225 price target on the stock. Square shares have rallied 141% so far this year compared with near flat performance for the S&P 500 SPX, +0.87%."}]}