{"article": [{"url": "https://www.marketwatch.com/story/judge-says-eric-trump-must-testify-in-new-york-probe-prior-to-election-11600891745", "published": 1600885040.0, "headline": "Judge says Eric Trump must testify in New York probe prior to election", "body": "Eric Trump delivers a pre-recorded speech on the second day of the Republican National Convention. olivier douliery/Agence France-Presse/Getty Images NEW YORK (AP) — Eric Trump must testify in a New York investigation into his family’s business practices before the November presidential election, a judge ruled Wednesday, rejecting his lawyers’ claims that his “extreme travel schedule” on the campaign trail warranted a delay. State Judge Arthur Engoron said President Donald Trump’s middle son, a Trump Organization executive, must comply with a subpoena to be deposed under oath no later than Oct. 7, adding that the court is not “bound by the timelines of the national election.” New York Attorney General Letitia James went to court to enforce Trump’s subpoena after his lawyers abruptly canceled a July interview with investigators in her office’s probe, which is focused on whether the Trump Organization lied about the value of its assets in order to get loans or tax benefits. Eric Trump, the company’s executive vice president of development and acquisitions, was first served with the subpoena in May. James, a Democrat, said in a statement after the ruling that “justice and the rule of law prevailed today.” Also see: Manhattan district attorney points to ‘mountainous record’ of alleged misdeeds in justifying request for Trump tax records “To be clear, no entity or individual is allowed to dictate how or when our investigation will proceed or set the parameters of a lawful investigation,” James said. “The court’s order today makes clear that no one is above the law, not even an organization or an individual with the name Trump.” A message seeking comment on the ruling was left with Eric Trump’s lawyer, Alan Futerfas. In a court filing last week, his lawyers said he was willing to comply with the subpoena, but that he could do so only after the Nov. 3 election. Beside scheduling conflicts related to his father’s reelection campaign, they said they wanted “to avoid the use of his deposition attendance for political purposes.” At Wednesday’s hearing, Futerfas said they were “happy for him to sit down and be deposed,” but that they needed more time before he testified to review with him thousands of pages of documents that James’ office is seeking as part of the civil probe. “As the world knows, there’s an election going on in about four weeks in this country, maybe five weeks,” Futerfas argued. “Eric Trump is a vital and integral part of that, and he’s traveling just about seven days a week.” Matthew Colangelo, a lawyer for the attorney general’s office, countered that Eric Trump’s lawyers didn’t have a legal basis to seek a delay and were doing so “simply on the grounds of personal inconvenience to the witness.” He argued that the typical compliance deadline courts have found is reasonable is five days. Eric Trump’s lawyers had proposed four dates for him to testify, the earliest being Nov. 19, which they contended was just after James’ office is scheduled to interview other witnesses in the investigation. Eric Trump switched lawyers in mid-July, Futerfas said, contributing to the need for a delay. Eric Trump did not participate in Wednesday’s hearing, which was held via Skype. Eric, the third of Trump’s five children, was scheduled to appear Wednesday at a campaign event in Glendale, Arizona, called “Evangelicals for Trump: Praise, Prayer, and Patriotism.” James went to court to compel Eric Trump and other business associates to testify and turn over documents as part of a civil investigation into whether the family’s company, the Trump Organization, lied about the value of assets including a suburban New York City estate. Investigators have yet to determine whether any law was broken, James’ office has said. James launched the investigation in March 2019 after President Trump’s longtime personal lawyer Michael Cohen told Congress that the president had repeatedly inflated the value of his assets to obtain more favorable terms for loans and insurance coverage. James’ investigators are looking into how the Trump Organization and its agents assessed the value of Seven Springs, a 212-acre estate north of Manhattan that President Trump purchased in 1995 with the intent of turning it into a golf club. After that project failed to progress, the elder Trump granted an easement over 158 acres to a conservation land trust in 2016 to qualify for an income tax deduction. James’ office said a professional appraisal at the time determined Seven Springs was worth $56.5 million prior to the donation and that the land being conserved in exchange for the tax deduction was worth $21.1 million, it said. Cohen said during his congressional testimony that when Trump was trying to buy the NFL’s Buffalo Bills in 2014, he provided financial statements to Deutsche Bank saying Seven Springs was worth $291 million as of 2012. The attorney general’s office is also looking at a conservation easement donated over part of the Trump National Golf Club property near Los Angeles in exchange for a tax deduction in 2014, and the handling of tax issues related to more than $100 million of debt from the Trump International Hotel and Tower Chicago that was forgiven between 2010 and 2012. Investigators said they have not been able to confirm whether any of that forgiven debt was recognized as taxable income, according to the court filings. President Trump last year dismissed various probes into his pre-White House dealings, accusing James and New York’s Democratic Gov. Andrew Cuomo of “harassing all of my New York businesses in search of anything at all they can find to make me look as bad as possible.”"}]}