{"article": [{"url": "https://www.marketwatch.com/story/hpe-shares-jump-7-on-revenue-earnings-beat-2020-08-25", "published": 1598376140.0, "headline": "HPE shares jump 8% on revenue, earnings beat", "body": "Hewlett Packard Enterprise Co. shares surged 8% in after-hours trading Tuesday after the enterprise software and services provider reported fiscal third-quarter results that soundly beat Wall Street estimates. HPE HPE, -1.80% reported non-GAAP earnings of 32 cents a share, compared with non-GAAP earnings of 45 cents a share in the year-ago quarter. Revenue declined 5% to $6.82 billion from $7.2 billion a year ago. Analysts surveyed by FactSet had expected adjusted earnings of 23 cents a share on revenue of $6.06 billion. “We significantly improved operational and supply-chain execution and advanced our innovation agenda with the introduction of HPE GreenLake cloud-services solutions, our new HPE Ezmeral software portfolio, and our planned acquisition of SD-WAN leader Silver Peak,” HPE Chief Executive Antonio Neri said in a statement. “We were very pleased with the performance, especially in reducing our backlog $500 million,” HPE Chief Financial Officer Tarek Robbiati told MarketWatch in a phone interview after the results were announced. In a sign of the company’s confidence, it issued earnings guidance for its current fourth-quarter of non-GAAP EPS of between 32 cents and 36 cents a share — squarely above FactSet estimates of 31 cents a share. HPE expects to be “back operating in a much more stable position” the next few quarters, Robbiati added. He pointed to revenue for high-end computing systems, which improved 3% to $649 million. For the just completed third quarter, compute revenue was flat at $3.4 billion, while storage sales declined 10% to $1.1 billion as enterprise companies continued to keep a tight leash on big purchases during an economic downturn caused by the pandemic. “It’s always painful reorienting a company around services, but HPE so far is doing an admirable job,” Patrick Moorhead, principal analyst at Moor Insights & Strategy, said in an message. “Greenlake (services) is a bet the company play and it’s nice to see things coming together.” HPE shares are down 41% this year. The broader S&P 500 index SPX, +0.87% has improved 6.6% in 2020."}]}