{"article": [{"url": "https://www.marketwatch.com/story/president-trump-may-welcome-the-support-but-lindsey-graham-says-qanon-is-bats-t-crazy-11598557452", "published": 1598610500.0, "headline": "President Trump welcomes the support, but Lindsey Graham pronounces QAnon â\u0080\u0098batshâ\u0080\u0094 crazyâ\u0080\u0099", "body": "When President Trump was given the chance earlier this month to denounce QAnon, a festering far-right conspiracy theory, he instead Â suggested that he appreciates the movementâ\u0080\u0099s support and described believers as â\u0080\u009cpeople who love our country.â\u0080\u009d Sen. Lindsey Graham, the South Carolina Republican and fervent backer of the president, doesnâ\u0080\u0099t quite see it that way, however, and, in an an interview this week with Snapchatâ\u0080\u0099s SNAP, -0.18% Peter Hamby, he summed up QAnon in these two words: “ â\u0080\u0098Batshit crazyâ\u0080\u0099 ” For those fortunate enough not to have been exposed to QAnon, hereâ\u0080\u0099s the basic belief system: The â\u0080\u009cdeep stateâ\u0080\u009d is being run by a bunch of left-wing elites, who also happen to be murderous pedophiles working to tear down the Trump presidency. Thereâ\u0080\u0099s also cannibalism. â\u0080\u009cCrazy stuff. Inspiring people to violence,â\u0080\u009d Graham said. â\u0080\u009cI think it is a platform that plays off peopleâ\u0080\u0099s fears, that compels them to do things they normally wouldnâ\u0080\u0099t do. And itâ\u0080\u0099s very much a threat.â\u0080\u009d Yet QAnon remains popular in some of the more extreme corners of Trumpâ\u0080\u0099s base. Just take a look at what happened in Georgiaâ\u0080\u0099s 14th District earlier this month: Marjorie Taylor Greene, who has previously endorsed the theory, actually won a Republican primary and looks like a safe bet to win a seat in the House of Representatives in November. Watch the full Graham interview: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } |"}]}