{"article": [{"url": "https://www.marketwatch.com/story/im-not-going-anywhere-looters-nearly-destroyed-her-business-but-thats-just-the-latest-challenge-for-this-black-entrepreneur-2020-06-05", "published": 1592051660.0, "headline": "â\u0080\u0098Iâ\u0080\u0099m not going anywhere.â\u0080\u0099 Looters nearly destroyed her business, but thatâ\u0080\u0099s just the latest challenge for this black entrepreneur", "body": "The new storefront at 611 West Lake St. was supposed to be the place where Tiwanna Jackson took her business to the next level. The Minneapolis owner of Tweak The Glam Studio, a beauty boutique, was going to hire employees and start a mentorship program for newcomers to the beauty business. And she was going to put the casually racist remarks of one real estate broker behind her. Now, that same spot has been ransacked by looters who capitalized on protests over George Floydâ\u0080\u0099s May 25 death in police custody. “ â\u0080\u0098I try not to be easily defeated and I always have to fight for what I want.â\u0080\u0099 ” â\u0080\u0094 Tiwanna Jackson Six months into a seven-year lease, Jackson looks at her roughly 500-square-foot space now and feels â\u0080\u009ccrushed, gutted, literally sick. I felt defeated for a minute. I try not to be easily defeated and I always have to fight for what I want.â\u0080\u009d The looters smashed through Jacksonâ\u0080\u0099s glass window early Saturday morning and ran off with her laptop, her sound systems, an iPad AAPL, +1.74% Â that she used to process customer payments, and even a wine cart. â\u0080\u009cBingo!â\u0080\u009d one looter kept shouting, according to a neighborâ\u0080\u0099s smartphone video, which Jackson shared on her businessâ\u0080\u0099s Instagram FB, +0.26% Â account. â\u0080\u009cThis small business is BLACK OWNED & we also support GEORGE FLOYD!,â\u0080\u009d Jackson wrote in the post. Addressing the â\u0080\u009cignorant group of material thirsty bandits,â\u0080\u009d she wrote, â\u0080\u009cIf your going to protest then protest. But donâ\u0080\u0099t use George Floyd as a reason to ROB hard working people for what you want and donâ\u0080\u0099t want to work for!!!!!!!â\u0080\u009d Floyd, 46, died during an arrest that was videotaped by passers-by. Police were responding to a report that Floyd had used a fake $20 bill. Derek Chauvin, one of the arresting officers, kneeled on Floyd, pressing his knee into Floydâ\u0080\u0099s neck for almost nine minutes while Floyd was facedown on the ground, prosecutors allege. Chauvin is facing second- and third-degree murder charges and second-degree manslaughter charges. Three fellow officers were charged with aiding and abetting second-degree murder and second-degree manslaughter. Floydâ\u0080\u0099s death â\u0080\u0094 and those of so many other unarmed black men who have died in police custody â\u0080\u0094 is a brutal example of the uneven ways law enforcement treats black and white communities, reform advocates say. Jacksonâ\u0080\u0099s path to her Lake Street shop provides another look at inequity â\u0080\u0094 this time, on the steep hill for black entrepreneurs, which is getting steeper. “ 58% of black-owned firms were either â\u0080\u0098distressedâ\u0080\u0099 or â\u0080\u0098at riskâ\u0080\u0099 before the coronavirus pandemic while 27% of white-owned firms were in the same condition, according to Federal Reserve data. ” More than half â\u0080\u0094 58% â\u0080\u0094 of black-owned firms were either â\u0080\u009cdistressedâ\u0080\u009d or â\u0080\u009cat riskâ\u0080\u009d before the coronavirus pandemic, according to Federal Reserveâ\u0080\u0099s 2019 Small Business Credit Survey. About one-third â\u0080\u0094 27% â\u0080\u0094 of white-owned firms were in the same condition, the survey showed. Now, 35% and 40% of black-owned businesses will ultimately fold between the pandemic, the lack of federal stimulus money and fallout from the looting, according to one estimate from the U.S. Black Chambers, Inc. â\u0080\u009cI just feels like racism happens in so many scenarios,â\u0080\u009d Jackson, 42, told MarketWatch. â\u0080\u009cDonâ\u0080\u0099t quit, donâ\u0080\u0099t give up, go through adversity,â\u0080\u009d sheâ\u0080\u0099s told herself over the years. â\u0080\u009cNow Iâ\u0080\u0099m at another roadblock.â\u0080\u009d â\u0080\u0098Itâ\u0080\u0099s going to be kind of expensive but we do need more minorities in the areaâ\u0080\u0099 Jackson calls herself â\u0080\u009ca visual person,â\u0080\u009d and sheâ\u0080\u0099s always loved beauty and fashion. â\u0080\u009cAnything that makes you feel like somebody, Iâ\u0080\u0099m drawn to it.â\u0080\u009d Tweak the Glam offers eyelash extensions, which add oomph to someoneâ\u0080\u0099s eyes for $35 to $250, as well as other beauty services like waxing. Before breaking into the industry, Jackson worked in the banking sector. For years, she worked in compliance for Ameriprise Financial AMP, +0.60%. She was laid off during the Great Recession in 2009 and decided to take a chance and find a way into the beauty world. She went to beauty school, learned how to do eyelash extensions and built her clientele. Jackson started Tweak The Glam Studio in 2014 at an office suite. Within a year and a half, Jackson had gross earnings in the six figures. “ Jackson had six-figure gross earnings less than two years after starting her business. ” But she had overhead and other costs too, like the roughly $10,000 she spent to learn microblading, which is a form of tattooing that enhances eyebrows. Jackson needed a storefront to grow her business, she decided. She started looking around for places and cold-called one real estate broker about one space. â\u0080\u009cItâ\u0080\u0099s going to be kind of expensive but we do need more minorities in the area,â\u0080\u009d Jackson recalled the woman telling her over the phone. â\u0080\u009cShe didnâ\u0080\u0099t even know me and knew I was already black.â\u0080\u009d The broker made a snap judgment about someoneâ\u0080\u0099s voice and their earning power that researchers have found elsewhere. Black and white listeners can assume people speaking so-called â\u0080\u009cAfrican American Vernacular Englishâ\u0080\u009d might earn less, studies show. Back in Minneapolis, Jackson kept looking for a space. On at least three different occasions, she got far in the process â\u0080\u0094 only to have the deal fall through and the space go to white-owned beauty businesses. One of those disappointments involved the same broker she had initially talked to. Jackson said she â\u0080\u009cswallowed her prideâ\u0080\u009d and talked to the woman about a space she loved. â\u0080\u009cI tried that approach and I got stabbed in the back,â\u0080\u009d she said, noting a franchise took the spot instead. “ â\u0080\u0098It wasnâ\u0080\u0099t the space I wanted, but I took it anyway because I always feel thereâ\u0080\u0099s a reason for everything.â\u0080\u0099 ” â\u0080\u0094 Tiwanna Jackson Finally, Jackson found the Lake Street location and went for it. â\u0080\u009cIt wasnâ\u0080\u0099t the space I wanted, but I took it anyway because I always feel thereâ\u0080\u0099s a reason for everything.â\u0080\u009d All throughout, Jackson was relying on her personal savings and credit cards â\u0080\u0094 something female business owners are more likely to do than men â\u0080\u0094 for business capital. Her business loan applications were unsuccessful, while the hard pulls on her credit score and the revolving credit card balances harmed her score. The big picture for black-owned businesses Tweak The Glam Studio is one of the 2.6 million-black owned businesses facing a common set of challenges, according to Ron Busby, president and CEO of the U.S. Black Chambers, a business group with 232,000 members. “ â\u0080\u0098There is no doubt racism plays a huge role in the challenges black-owned businesses face day to day.â\u0080\u0099 ” â\u0080\u0094 Ron Busby, president and CEO of the U.S. Black Chambers â\u0080\u009cThere is no doubt racism plays a huge role in the challenges black-owned businesses face day to day,â\u0080\u009d he said. Busby doesnâ\u0080\u0099t buy it when skeptics say a business rises or falls on the quality of its product, not the person selling it. â\u0080\u009cThatâ\u0080\u0099s like saying I wonâ\u0080\u0099t get killed for getting out of my car for spending a $20 bill,â\u0080\u009d Busby said, referring to the Floyd case. â\u0080\u009cAnyone that does not understand the challenges black business owners have is not facing reality.â\u0080\u009d Donâ\u0080\u0099t miss: The driving force behind the startling racial wealth divide: â\u0080\u0098Centuries worth of negative compoundingâ\u0080\u0099 Twenty-eight percent of black and Asian-American small business owners use their own money to fund their operations, while 29% of Hispanic owners do the same, according to Federal Reserve Bank of Atlanta. Sixteen percent of white owners use their money as the primary funding source. When black- and Hispanic-owned applicants get business loans, the central bankâ\u0080\u0099s data said, theyâ\u0080\u0099re typically getting less than they asked for, compared to white-owned small business applicants. Itâ\u0080\u0099s not just dollars and cents differences. Businesses in predominantly black neighborhoods typically have lower Yelp YELP, -1.66% Â reviews, according to Brookings Institution findings in February. That perception is important because businesses with more stars have higher growth rates, they said. The $2.2 trillion dollar stimulus billâ\u0080\u0099s Paycheck Protection Program (PPP) highlight the struggles for black business people, Busby said. The program offers potentially forgivable loans to small businesses faltering because of the coronavirus pandemic. But 2.5 million of the 2.6 million black-owned businesses have no employees, Busby noted. In other words, thereâ\u0080\u0099s no payroll to protect. Furthermore, many banks administering the programs asked for information about an applicantâ\u0080\u0099s lending relationships. But many black-owned businesses donâ\u0080\u0099t have those relationships, Busby said. Damage to Tweak The Glam after looting. Courtesy Tiwanna Jackson The U.S. Black Chambers polled members about PPP and 96% either didnâ\u0080\u0099t get any money or got less than 60% of their sought-after loan, Busby said. Jackson is still waiting to hear about her PPP application. She would have reopened on June 1, but the looting changed all that. Now sheâ\u0080\u0099s making a list for her insurance adjuster and working with a contractor whoâ\u0080\u0099s putting in new shelving free of charge. Sheâ\u0080\u0099s still got plans for her business. â\u0080\u009cIâ\u0080\u0099m not going under,â\u0080\u009d Jackson said. â\u0080\u009cIâ\u0080\u0099m not leaving. Iâ\u0080\u0099m not going anywhere.â\u0080\u009d"}]}