{"article": [{"url": "https://www.marketwatch.com/story/a-major-part-of-the-economy-grew-again-in-august-ism-finds-but-jobs-are-only-slowly-coming-back-2020-09-03", "published": 1599131540.0, "headline": "A major part of the U.S. economy grew again in August, ISM finds, but jobs are only slowly coming back", "body": "The numbers: The part of the economy that employs the vast majority of Americans expanded again in August, but companies still haven’t brought most of their workers back amid persistent anxiety over the coronavirus. A closely followed index of non-manufacturing companies — retailers, banks, airlines, health-care providers and the like — slipped to 56.9% last month from 58.1% in July, the Institute for Supply Management said Thursday. That was in line with the MarketWatch forecast. Any number above 50% means more companies are expanding. The last two ISM readings of the “service” economy were actually quite high by historical standards, but not because the U.S. is doing so much better. The ISM survey of senior executives basically asks if business is better or worse compared to the prior month. It doesn’t reveal how much better. By most measures, the economy is still considerably weaker now than it was before the pandemic. Millions of Americans remain out of work, Congress is deadlocked over another financial-aid package and many industries such as travel, tourism and entertainment are just a shell of their former selves. Read:Economy softened in August as some temporary layoffs turn permanent What happened: New orders and production both grew more slowly in August, but they still showed a marked improvement from several months ago. The index of new orders dropped to 56.8% from 67.7%. And gauge for production slipped to 62.4% from 67.2%. Employment levels, meanwhile, continued to stabilize after a huge cascade of layoffs and furloughs earlier in the year. The ISM’s employment gauge rose to 47.9% from 42.1%, marking the highest level since the pandemic began in March. Still, there are plenty of warning signs that could signal more trouble ahead. A slew of companies such as American Airlines AAL, +0.34%, United UAL, +0.32% and MGM Resorts MGM, -2.59% , for instance, have announced new furloughs and layoffs with their businesses still in a deep slump. They warn many of the job losses could become permanent without more government help or a faster rebound in the economy, an outcome that seems unlikely given the persistence of the coronavirus. A similar employment measure in the ISM’s manufacturing survey released earlier this week also indicated companies aren’t in a rush to add more workers. Read: ADP says private sector added a less-than-expected 428,000 new jobs in August Big picture: Roughly 80% of all Americans work in a service job, meaning they provide a service to other people instead of making a product. The service side of the economy has struggled more than manufacturing to recoup all the ground lost during the pandemic and it’s unlikely the pain will go away anytime soon. Tens of millions of Americans are still working from home and largely shunning brick-and-mortar retail stores, indoor dining, public transportation, airplane travel, hotel stays and even elective medical procedures. Until most Americans feel safe again, these industries are going to tread water. And so will the U.S. economy. Whatever progress that takes place is likely to be slow. Read: Brainard says Fed should shift to more aggressive strategy to boost the economy What they are saying? “Respondents remain concerned about the pandemic,” said Anthony Nieves, chairman of the survey. “However, they are mostly optimistic about business conditions and the economy as businesses continue to reopen.” Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 index SPX, +0.87% fell in Thursday trades."}]}