{"article": [{"url": "https://www.marketwatch.com/story/some-wealthy-americans-are-prepping-their-finances-for-a-possible-joe-biden-presidency-this-is-all-going-up-and-you-may-never-see-it-as-good-as-it-is-now-2020-09-16", "published": 1601266520.0, "headline": "Some wealthy Americans are already prepping their finances for a Joe Biden presidency - here's how", "body": "San Francisco accountant Scott Hoppe had a client who was planning to stretch the sale of founder shares in a tech-sector company over a three-year period. Instead, the client compressed the installment sale into a one-shot transaction this month. What accelerated the deal? The 2020 presidential race. \"Assuming all else was equal, that was the driver of the choice,\" said Hoppe, principal of the accounting firm Why Blu. Right now, Hoppe's client, worth between $10 million and $20 million, will be taxed on capital gains at a rate of 23.8%. If Democratic candidate Joe Biden beats President Donald Trump - and Democrats retain the House of Representatives and flip the Senate - that client could have potentially been staring at a 39.6% tax rate in two out of the installment sale's three years. The compressed transaction, then, could have saved the client approximately $320,000 in taxes on the $6 million sale. \"The seller, for sure, was motivated, and the buyer had the wherewithal\" to pay the full price upfront, said Hoppe. Biden's tax plan would put the marginal rate for top earners back at the Obama-era 39.6% rate, up from the current 37% rate. That 39.6% rate would apply to the capital gains of people who earn more than $1 million. It's one aspect of a tax proposal where the top 1% of earners would pay for almost 80% of an increase in taxes, according to a budget model from the University of Pennsylvania's Wharton School of Business. Don't miss:Possible payroll-tax cuts and lowering rates on long-term capital gains - what a win for Donald Trump could mean for your taxes Election Day is eight weeks away, and the mass of expected mail-in ballots could prolong the wait for a final result, with many states not beginning to count absentee votes till the polls close. Though polling averages in swing states currently give Biden an edge over President Donald Trump, and he's held a steady lead in national polls for most of the year, polls indicated right up till Election Day in November 2016 that Hillary Clinton would best Trump. Either way, though, many of America's affluent households, and the experts who advise them, aren't waiting. Hoppe finishes every client conversation with a discussion about what a Biden administration could mean for portfolios vs. a second Trump term. One Illinois financial-planning firm has carried out approximately 50 Roth IRA conversions this year with an eye on the election. “ One adviser's left-leaning clients don't think a Biden win will negatively affect their finances, but the adviser's right-leaning ones think a Biden win could send their portfolio to 'hell in a hand basket.' ” In Houston, Scott Bishop, executive vice president at STA Wealth Management, has fielded election-related calls and emails from half his clients in the past two months. Bishop's liberal-leaning clients want to hear about potential opportunities and tend to downplay the idea of new tax rules upending their finances. As for Bishop's conservative-leaning clients, \"they think this is going to hell in a hand basket\" and want to get ready to quickly lock in rates and minimize tax exposure if Biden wins. Bishop - who recalls talking down one client who wanted to \"sell everything\" when Trump won in 2016 - counsels everyone to think things through. \"I try to get them to not act on their biases,\" he told MarketWatch. See also:Higher rates for upper-income folks and a bigger child tax credit - what Joe Biden's tax plan could mean for you The flurry in planning comes at a time when income inequality is more dramatic than at any time in the past 50 years - and the coronavirus pandemic, it is feared, could further deepen the gulf between the rich and poor. Biden says his tax plan would make sure corporations and wealthy Americans pay their \"fair share.\" “ 'We are working in the boundaries that are given to us.' ” - Scott Hoppe, Why Blu Is it unfair that wealthier Americans are availing themselves of tax rules that work to their advantage? \"We are working in the boundaries that are given to us,\" Hoppe said, echoing a point numerous sources made to MarketWatch. Tax rules are written to discourage or encourage all sorts of activity, he said - like a lower capital-gains rate to promote financial investments. When lawmakers \"want to change our behavior, the code evolves.\" The Biden campaign couldn't be reached for comment. Below, a description of three ways affluent Americans are taking the tax-planning bull by the horns weeks ahead of the election. Estate planning Americans will inherit $765 billion this year in gifts and bequests, and that sum will generate $16 billion in taxes, according to New York University Law School professor Lily Batchelder, who says that's barely a 2% effective tax rate. The Republicans' tax overhaul of late 2017 elevated the threshold at which the 40% federal gift and estate exemption phases out. Starting in 2018, the exemption level went from $5.45 million to $11.4 million for individuals ($22.8 million for married couples), and it's indexed for inflation. The provision ends in 2025, but observers say Biden wants to end it a lot sooner and bring the estate tax back to its \"historical norm.\" Biden also wants to end the so-called step-up in basis. This tax rule states that if an heir sells an inherited asset (like 7,000 shares of Apple AAPL, +1.74% ) capital-gains taxation on any future sale is pegged to an asset's value at the time of inheritance, not the date of the original purchase. If an asset appreciates greatly over time, the step-up in basis saves an heir plenty in capital gains. Michael Whitty, a partner specializing in estate law at Freeborn & Peters in Chicago, is telling his clients to schedule one-hour calls with him now to game out election contingency plans. How much to give away and what to give away are some of the topics, he said. Whitty wants to have the talks sooner rather than later - especially in light of the fact that lawmakers in the past have been known to make new estate-tax rates retroactive. “ 'The client who waits until after Election Day, and some will wait until towards Thanksgiving, well, we're going to be really behind the eight ball to put together a well-prepared, well-documented transfer.' ” - Michael Whitty, Freeborn & Peters \"The client who waits until after Election Day - and some will wait until towards Thanksgiving - well, we're going to be really behind the eight ball to put together a well-prepared, well-documented transfer,\" Whitty said. At Playfair Planning in Brooklyn, CEO Kim Bourne is advising clients more than ever to file estate-tax returns even when they don't have to. This gets asset valuations on paper - a move that will ease cost-basis determinations later on, she said. Bourne's clients aren't speeding up gifts right now, but she is recommending they think about loans among family members. A loan doesn't eat into the gift and estate exemption, and it can always be converted to a \"gift\" later on, once planners know the legal landscape. \"Intrafamily loans are a simple way to navigate the uncertainty and take advantage of the low-interest environment,\" she said. The election is influencing other long-term financial planning. Encore:Biden's 401(k) plan: Changing tax incentive for retirement is a great idea Opinion: Will Biden's 401(k) plan help you or hurt you? The coming election \"was a very critical component, but it wasn't everything that was discussed,\" when Randy Bruns's Naperville, Ill.-based financial advisory firm, Model Wealth, carried out approximately 50 conversions this year from IRAs to Roth IRAs. Investors pay tax on IRA distributions once they start tapping the account. With a Roth IRA, they pay taxes during the contribution, and the money comes out tax-free at distribution - so the reasoning for a Roth account is to avoid a higher tax rate in the future. “ 'This is all going up and you may never see it as good as it is now.' ” - Randy Bruns, Model Wealth When Bruns explains the election implications to clients, he's not taking a political stance on the merits of potential tax hikes, he notes. Focusing on rates, he tells his clients, \"This is all going up, and you may never see it as good as it is now.\" Capital gains and ordinary income Unlike vanquished rivals for the Democratic presidential nomination Bernie Sanders and Elizabeth Warren, Biden is not proposing a \"wealth tax\" on the highest earners. But he does want to reset the top income-tax bracket at 39.6%. He also wants the rich to pay more into Social Security. Employers and employees currently pay a combined 12.4% in payroll taxes on the first $137,700 an employee earns. Biden's proposal would restart payroll taxation, still at 12.4%, at the 400,001st dollar a person makes. Under the circumstances, Stacy Francis, CEO of Francis Financial in Manhattan, says she's telling clients expecting a bonus or other special end-of-year compensation to see if they can arrange for the money to arrive by the end of this year and not at the start of next year. Capital-gains rates are another consideration. Biden would raise the capital-gains rate to 39.6% for people making at least $1 million. That would go up from 23.8% (which is the 20% rate, plus the 3.8% net investment income tax). That's \"nearly doubling the tax bite for higher earners,\" Francis pointed out - and it could have repercussions for people with large transactions coming up. For example, if a family needs to sell off a brokerage account because of an upcoming college tuition bill or a house purchase, Francis said \"it makes sense to do that sooner than later.\" “ 'It's only if you know that you're going to have to sell investments in the next year or so that we recommend you do that now versus later.' ” - Stacy Francis, Francis Financial Francis is not advising investors with long-term positions and goals to contemplate selloffs now. Election Day 2020 is uncertain, but the uncertainty only increases from that point forward. \"Ten years from now, the tax landscape is so uncharted,\" Francis said. \"It's only if you know that you're going to have to sell investments in the next year or so that we recommend you do that now versus later.\" 'We can only protect what we know about' Broader tax rules are one way to generate more revenue. Another is making sure taxpayers are paying all their taxes to begin with. The 2020 presidential campaign comes with an increasingly short-staffed Internal Revenue Service auditing fewer returns. The agency data show the IRS audited 1.73 million returns (almost 1% of all returns) in fiscal year 2010. The IRS audited just over 770,000 returns in fiscal 2019, which is fewer than 0.5%. Figures like former Treasury Secretary Lawrence Summers - a Biden campaign adviser - say the IRS could reap an extra $535 billion if it brought audit rates back to their level of 10 years ago and trained its focus on the super-rich. This summer, the IRS announced it would be launching hundreds of new audits of high-net-worth individuals. Around the same time, Biden unveiled a plan for universal preschool and higher caregiver pay; the campaign says it's a $775 billion plan underwritten, in part, by increased \"tax compliance for high-income earners.\" Tax attorney Cameron Hess expects both parties to support increased high-net-worth audits. Political attitudes about the IRS's audit rates swing like a pendulum, said Hess, a partner at the California-based law firm Wagner Kirkman Blaine Klomparens & Youmans. At one point, starting around the 1990s, the IRS was seen as too aggressive. “ 'Perhaps there's more support by Democrats than Republicans, but there is a push to swing the pendulum back the other way.' ” - Cameron Hess Now it's a question of whether the IRS is doing enough. \"Perhaps there's more support by Democrats than Republicans,\" said Hess, \"but there is a push to swing the pendulum back the other way.\" Looking ahead to Election Day and beyond, Hess has been telling clients, and tax-business colleagues, how important it is for them to have access to permanent records related to the costs of their capital assets. That's something the IRS has become increasingly curious about, Hess said. When Hoppe talks to clients about the election, one thing he's doing is flagging the potential for an audit. Specifically, Hoppe is making sure he knows about all the offshore accounts a client may have, or if a client has any cryptocurrency holdings he might otherwise be unaware of. Hoppe says he's already meticulous in his documentation, but still, \"We can only protect what we know about.\""}]}