{"article": [{"url": "https://www.marketwatch.com/story/54-bullet-points-800-proposals-no-matter-trump-or-biden-implementing-the-winners-policies-is-going-to-be-expensive-11602062430", "published": 1602048500.0, "headline": "54 bullet points, 800 proposals: No matter Trump or Biden, implementing the winner's policies is going to be expensive", "body": "WASHINGTON, DC: Sheets of one dollar bills run through the printing press at the Bureau of Engraving and Printing in this file photo from March 24, 2015. (Photo by Mark Wilson/Getty Images) Published Credit: Mark Wilson/Getty Images Whether voters choose Joe Biden or President Donald Trump on Nov. 3, putting their policy promises into action will add trillions to the burgeoning national debt, one deficit hawk group says. Biden's plans, as outlined on his website and elsewhere, would likely result in a debt increase of $5.6 trillion over 10 years, the bipartisan Committee for a Responsible Federal Budget said in a report released Wednesday. That's more than the likely cost of Trump's plans, pegged at $4.95 trillion over 10 years, said the group after analyzing the president's 54-bullet point second term agenda document and other sources. \"Under our central estimate, neither major candidate for President of the United States in 2020 has put forward a plan that would address our unsustainable fiscal path,\" the group said. \"Instead, both President Donald Trump and former Vice President Joe Biden have promoted policy agendas that would likely significantly add to annual deficits and increase debt-to-GDP over the next decade.\" For comparison, the nonpartisan Congressional Budget Office projects that with no changes to current law the government will add another $13 trillion in debt over the next decade, much of it as a result of efforts to ease the economic pain caused by the COVID-19 lockdown. That debt would raise the debt in proportion to the size of the U.S. economy to 109% in 2030, up five percentage points from where it will be in 2021. Those projections are probably somewhat rosy, as they include the expiration of many of the individual tax cuts made in the Republican tax overhaul in 2017. If those cuts aren't allowed to expire as scheduled , federal revenue will likely be lower than assumed in the CBO baseline and deficits bigger. Biden's plan would increase that debt-to-GDP level to 128%, the group said, while Trump's would boost it to 125%. The CRFB projections are their central ones, though the group also calculated high and low cost estimates. While the central estimate for the Trump plan was lower than for the Biden plan, its low estimate, at 111% of debt to GDP, was still slightly above the baseline. The low cost estimate for the Biden plan was a hair below the CBO baseline, at 108% of GDP, meaning it could, if the costs of all the proposed policies ended up being in the lowest range of estimates, reduce projected debt compared with current law. The group noted the difficulty in estimating Trump's policies, using as its base the second term agenda document released by the campaign at this summer's Republican convention. \"Our analysis exclusively aims to estimate policies outlined in these bullet points, though they provide insufficient detail to score (for example, one policy reads 'Cut Taxes to Boost Take-Home Pay and Keep Jobs in America'). We therefore turn to the President's budget proposals, speeches, and other policy proposals to determine the possible meaning of the bullet points,\" the group said. With Biden, though, the problem was different. The group counted 48 different plans on the campaign website. \"We identified more than 800 distinct proposals,\" the group said. For Trump, the group estimated about $5.45 trillion in new spending and revenue losses from tax cuts, only partially offset by spending $750 billion in cuts and savings elsewhere. The most expensive policies would be extending the individual portions of the 2017 tax revamp, which CRFB projected at $1.25 trillion, and an infrastructure-building initiative, placed at $2 trillion. Limiting the U.S. military presence in Afghanistan and the Middle East would save about $500 billion, the group said, while capping Medicare drug prices and ending so-called surprise billing would save another $150 billion. For Biden, the scale of deficit-increasing policies and deficit-cutting ones was much larger, even if the final results were only moderately different. The CRFB said it estimated Biden policies to cost $11.10 trillion, only partially offset by $5.80 trillion in additional tax revenues and savings. The major big-ticket items on Biden's list included his \"green\" infrastructure and innovation plan, with a projected $3 trillion price tag, followed by an expansion of health care coverage, including lowering the Medicare eligibility age ($1.9 trillion) and increasing higher ed spending for tuition-free college and other training ($1.6 trillion). The biggest Biden pay-fors were all from the tax side of the ledger. Increases in corporate taxes would raise about $1.8 trillion, the group said, while boosts in taxes aimed at people making over $400,000 annually would net another $1.4 trillion. Finally, another $900 billion would be gotten by applying the Social Security payroll tax to incomes above $400,000. All of the CRFB estimates don't include the impact of additional spending or tax breaks as economic stimulus to offset the hit the economy took for coronavirus. Prospects for a package dimmed sharply Tuesday after Trump said he was pulling out of talks."}]}