{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-slip-again-as-us-dollar-firms-despite-rise-covid-19-cases-2020-06-25", "published": 1593095000.0, "headline": "Gold end lower for a second session, but hold onto a week-to-date gain", "body": "Gold futures tallied a second loss in a row on Thursday, as some strength in the U.S. dollar put pressure on dollar-denominated prices for the metal, but a rise in new cases of COVID-19 in the U.S. and other countries, and the potential for another round of business shutdowns to avoid the spread, kept gold prices higher for the week so far. The U.S. dollar was up 0.3% as gauged by the ICE U.S. Dollar Index DXY, -0.58% Thursday, while the Dow Jones Industrial Average and the S&P 500 index edged higher after the worst selloff since June 11, partly sparked by an acceleration in the rate of daily new cases of coronavirus. A sharp rise in cases in several U.S. states in particular created uncertainty about restarting businesses and the shape of the economic recovery from the downturn induced by measures to curtail the spread of the contagion. Prices for haven gold, however, have declined despite that uncertainty. “One of the only major asset classes with a positive YTD performance...and after reaching a 7-year high, gold prices likely suffered from the effects of a stronger U.S. dollar and from profit-taking or selling pressure from investors with cash needs arising from margin calls,” said Jeff Klearman, portfolio manager at GraniteShares, which offers the GraniteShares Gold Trust BAR, +1.88%. Still, “with the ‘opportunity cost’ of gold zero or even positive, real rates significantly below zero, unprecedented monetary stimulus globally, spreading uncertainty about U.S. and global economic growth as well as U.S. election-year concerns, gold prices seem to be strongly supported with very little reason to see gold prices move lower in the near future,” he told MarketWatch in emailed comments. August gold US:GCQ20 fell $4.50, or nearly 0.3%, to settle at $1,770.60 an ounce, after declining 0.4% on Wednesday. Prices on Tuesday settled at the highest for a most-active contract since Oct. 4, 2012. July silver US:SIN20, meanwhile, added 22 cents, or 1.3%, at $17.895 an ounce, after tumbling 2.2% on Wednesday. For the week, gold futures are looking at a 1% weekly gain thus far, and silver prices trade around a nickel higher over the period. The dollar index has slipped 0.2% over the week. Naeem Aslam, chief market analyst at AvaTrade, in a Thursday research report said that there are “five key factors [that] are likely to push gold prices higher in the coming days.” They include worries about an emerging second wave of the disease, trade tensions between China and the U.S., possible on European imports to the U.S., rising U.S. unemployment, and weak coming corporate earnings. He said a resolution in some of those issues and a coronavirus vaccine could deflate prices for the gold bulls. Against that backdrop, July copper US:HGN20 rose 0.5% to $2.663 a pound. July US:PLN20 lost 0.2% to $802.70 an ounce and September palladium US:PAU20 fell 2.3% to $1,845.10 an ounce."}]}