{"article": [{"url": "https://www.marketwatch.com/story/retiring-during-covid-19-how-to-cope-2020-07-16", "published": 1594897940.0, "headline": "Retiring during COVID-19? How to cope", "body": "David Ekerdt planned some fun events for the spring of 2020. The newly retired college professor booked a trip to Europe and expected to attend the Indy 500 along with pre-race festivities over Memorial Day weekend. But due to the pandemic, his trip abroad was rescheduled for May 2021 and he didn’t travel to Indiana for the race. He also canceled a family reunion that he planned to host at his home in Kansas City, Mo. “We planned all these high points in our lives,” he said. “Now they’re all scratched.” Like many older Americans, Ekerdt, 70, realizes that his retirement has turned into something less dreamy and more disappointing. The challenge is coping with squashed expectations. Suddenly stuck at home, retirees who spent decades envisioning how they’d embrace their well-earned freedom are experiencing a mix of emotions. On the positive side, they’re grateful for their health and whatever small joys they can claim. Yet the negatives are stacking up—from alarm at watching the months tick away without travel or embracing the grandkids to anxiety about all the money spent on luxuries that are no longer accessible (good luck finding a flight to that vacation home). “Retirees are entitled to gripe about all the assets they bought,” Ekerdt said. “They thought they’d be liberated in retirement. But now they’re confined.” For perspective, Ekerdt considers his former colleagues and the stresses they continue to face in the workplace. And he reminds himself that many retirees are experiencing varying degrees of hardship and sacrifice. “If it had been just me, then I’d be furious it was taken away from me,” he said. “But I’m not the sole loser.” Read: What to do when you inherit your parents’ stuff — and you don’t want it He suggests two ways to salvage the situation: reconnect with old friends and engage in satisfying domestic activities (from gardening to reading long-neglected books). Your attitude shapes how you respond to an upended retirement. Idleness and stewing resentment fuel a kind of mental meltdown, leaving more time to regret what you don’t have and lash out. Phyllis Diamond, a New York City-based retirement coach and psychotherapist, admires a 68-year-old friend for springing into action and applying herself in new ways. Read: What you need to know about COVID-19 health care rationing “She lives in a 55+ community where the pool and tennis are closed,” Diamond said. “She participates in [online] book and movie groups, but she’s a doer and she decided she wants to be leader. So she’s stepping up and taking charge of new initiatives to create, market and organize new programs to bring people together.” Diamond recommends that angry retirees revive old passions and restart old hobbies—or develop new ones. That’s better than allowing waves of grief to immobilize you. “Action is the antidote for anxiety and depression,” she said. “Doing is curative.” She cites her husband’s recent efforts to relearn the guitar, which he stopped playing 40 years ago. Before the pandemic, he’d pick it up once or twice a year for 15 minutes, she says. Now he practices daily and has calluses on his fingertips to prove it. Obsessed with retirement? Subscribe to Retirement Weekly Stay-at-home orders have left otherwise venturesome retirees retreating into a shell. Three months of a restrictive daily routine threaten to dull the senses and stoke negative emotions. “Instead of falling into a routine, look for ways to shake it up,” said Dave Hughes, author of “Design Your Dream Retirement.” He urges retirees to broaden their range of daily activities, from exploring new walking routes to picnicking in a park."}]}