{"article": [{"url": "https://www.marketwatch.com/story/group-of-9-drug-company-ceos-pledge-to-make-sure-covid-19-vaccine-follows-full-regulatory-path-2020-09-08", "published": 1599547940.0, "headline": "Group of 9 drug company CEOs pledge to make sure COVID-19 vaccine follows full regulatory path", "body": "A group of nine drug company chief executives said Tuesday they have signed a pledge to make the safety and well-being of vaccinated individuals the top priority in developing the first COVID-19 vaccine. The CEOs of AstraZeneca PLC AZN, +1.16% AZN, +0.63%, BioNTech SE BNTX, +1.23%, GlaxoSmithKline PLC GSK, +1.10% GSK, +1.52%, Johnson & Johnson JNJ, +1.39%, Merck & Co. Inc. MRK, -0.14%, Moderna Inc. MRNA, +0.09%, Novavax Inc. NVAX, +0.18%, Pfizer Inc. PFE, -0.27% and Sanofi SA SAN, +1.20% SNY, +0.89%, signed the pledge to demonstrate their unified commitment to upholding the integrity of the scientific process as they work to develop a vaccine that can win regulatory approval. \"We, the undersigned biopharmaceutical companies, want to make clear our on-going commitment to developing and testing potential vaccines for COVID-19 in accordance with high ethical standards and sound scientific principles,\" said the pledge. That means following all the steps that a regulator like the U.S. Food and Drug Administration deems essential in approving a vaccine, including large, high quality clinical trials that are randomized and observer-blinded and involve a diverse group of participants. The companies will only submit for approval a vaccine that has demonstrated safety and efficacy via a Phase 3 clinical study designed and conducted to meet all regulatory requirements, it said. \"We believe this pledge will help ensure public confidence in the rigorous scientific and regulatory process by which COVID-19 vaccines are evaluated and may ultimately be approved,\" the CEOs wrote. The pledge comes amid concern the Trump administration may try to rush out a vaccine ahead of the November election, after the CDC directed state governors to have vaccine distribution centers set up by Nov. 1. It also comes after Russia registered a vaccine before completing Phase 3 trials, that it plans to start administering to health care and other front line workers in October."}]}