{"article": [{"url": "https://www.marketwatch.com/story/tesla-stock-still-a-buy-as-uptrend-remains-intact-chart-watcher-says-11600888764", "published": 1600874840.0, "headline": "Tesla stock still a â\u0080\u0098buyâ\u0080\u0099 as uptrend remains intact, chart watcher says", "body": "Shares of Tesla Inc. took a big hit Wednesday after a Battery Day that investors deemed disappointing, and have suffered bear-market-like losses this month, but sellers beware, because this yearâ\u0080\u0099s uptrend still lives, an Oppenheimer analyst says. The electric vehicle industry leaderâ\u0080\u0099s stock TSLA, +1.89% sank 10.3% to $380.36, which is 23.7% below its Aug. 31 record close of $498.32. Meanwhile, the stock was still up 354.6% so far this year. â\u0080\u009cNotable about the recent gyrations in [Tesla] is that the stock is still above its 50-day [moving] average, meaning weakness has been in proportion to year-do-date strength â\u0080\u0094 i.e., the stockâ\u0080\u0099s uptrend is intact, in our view,â\u0080\u009d wrote Ari Wald, technical analyst at Oppenheimer. The 50-day moving average (50-DMA), which many chart watchers use to track the short- and intermediate-term trends, extended to $362.46 on Wednesday, according to FactSet. The 50-DMA has been rising everyday since May 7, although the pace of the daily increase has slowed to $1.54on Wednesday, from $2.50 on Tuesday and $2.81 on Monday. Read more about the 50-DMA, the level and the slope. The 50-DMA has provided support for the stock since it last closed below it on April 9. When the stock was plunging in early September after being snubbed by the S&P 500 index SPX, +0.87% committee, highlighted by the record one-day plunge on Sept. 8, the stock bottomed out at an intraday low of $329.88, and closing low of $330.21, but stayed above the 50-DMA at the time at $329.63. Wald expects the 50-DMA to continue as support for the stock. He said the stock, which is rated buy by Oppenheimerâ\u0080\u0099s fundamental analyst Colin Rusch, has a technical rating of â\u0080\u009cMO quintile = 1,â\u0080\u009d which generally indicates an established uptrend â\u0080\u009cthat should be bought on weakness.â\u0080\u009d Another downside level to watch would be the Sept. 8 close of $330.21. A close below that level, before the stock can close above its Sept. 15 rebound high of $449.76, would confirm a bearish â\u0080\u009cdouble-topâ\u0080\u009d technical reversal pattern, as well as launch a pattern of lower highs and lower lows, which many believe defines a downtrend. Read more about how the Dow Theory defines a downtrend. FactSet, MarketWatch But in the meantime, as long as the stock holds above a rising 50-DMA, as well as its previous closing low, the chartâ\u0080\u0099s outlook is still on the bullish side. â\u0080\u009cOverall, aside from additional time to consolidate over the near term, our work indicates the stock should resume higher over the long term,â\u0080\u009d Wald wrote."}]}