{"article": [{"url": "https://www.marketwatch.com/story/how-the-covid-19-pandemics-baby-bust-could-impact-stock-prices-for-the-next-30-years-2020-08-19", "published": 1597865900.0, "headline": "Why the COVID-19 â\u0080\u0098baby bustâ\u0080\u0099 could impact stock prices for the next 30 years", "body": "The stock market will be feeling the impact of COVID-19 for decades to come. Thatâ\u0080\u0099s because the pandemic is causing the U.S. birth rate to fall. A report from the Brookings Institution, predicts between 300,000 and 500,000 fewer births in 2021, calling it the â\u0080\u009cCovid Baby Bust.â\u0080\u009d You have plenty of time to plan for the long-term impact of this baby bust. Based on past research into demography and the stock market, the declining birth rate in 2020 and 2021 wonâ\u0080\u0099t affect the stock market until 2035 at the earliest. In fact, its impact from then until 2050 could be positive. The basis for these bold assertions is the demographic indicator that researchers have found to be best correlated with the stock marketâ\u0080\u0099s long-term return: The so-called Middle-Young (MY) Ratio, which is calculated by dividing the size of middle-aged cohort (ages 35-49) by the size of the young cohort (ages 20-34). (There is a complicated theory that explains why this ratio is correlated with the stock market, which is beyond the scope of this column to describe. Interested readers would do well to read one of the first academic studies on the subject: â\u0080\u009cDemography and the Long-Run Predictability of the Stock Market,â\u0080\u009d by John Geanakoplos of Yale University, Michael Magill of the University of Southern California, and Martine Quinzii of the University of California, Davis.) The chart below plots this MY Ratio along with the S&P 500â\u0080\u0099s SPX, +0.87% Â trailing 16Â¼ year annualized total return after inflation. I picked this time horizon because of a conversation I had in 2002 with Yaleâ\u0080\u0099s Geanakoplos. Based on the MY Ratio, he forecast that the stock marketâ\u0080\u0099s return from then until the late 2010s would be mediocre at best. He was largely right. As you can see, the stock marketâ\u0080\u0099s trailing 16Â¼-year return hit its low around that time and has since turned up. The chart also suggests that demographic winds will continue blowing in the stock market ahead until around 2035. This chart will need to be revised if the birth rate this year and next declines as much as the Brookings Institution is projecting, and especially if this condition persists beyond 2021. Thatâ\u0080\u0099s because this yearâ\u0080\u0099s births will start showing up in the â\u0080\u009cyoungâ\u0080\u009d cohort in 2040. And since that cohort is the denominator of the MY ratio, as it gets smaller the ratio as a whole becomes higher (other things being equal). This yearâ\u0080\u0099s births will be in the â\u0080\u009cyoungâ\u0080\u009d cohort until they are aged 34, which will be in 2054. At that point they will graduate into the â\u0080\u009cMiddle-Agedâ\u0080\u009d cohort and start exerting downward pressure on the MY ratio. To be sure, analyzing the net effect of myriad demographic factors is incredibly difficult. Alejandra Grindal, senior international economist at Ned Davis Research, explained some of these factors in an email: â\u0080\u009cThose people within the 35-49 age category from 2035-2045 are in large part children of Gen-Xers, which was a small population cohort to begin with. The people having children now are likely millennials, which is a very large cohort. This means that even if the fertility rate declines, the MY ratio could still increase (again, there are a lot of unknowns, such as immigration and the fertility rate of gen-Z, etc.). But lower fertility rates, which have been happening for some time, will nonetheless weigh on the ratioâ\u0080\u0099s upside potential.â\u0080\u009d The bottom line: It will take decades for the stock market to return to the pre-pandemic â\u0080\u009cnormal.â\u0080\u009d Rather than fantasizing that it will, we instead should focus on how to exploit the â\u0080\u009cnew normal.â\u0080\u009d And one way of doing that is focusing on demographyâ\u0080\u0099s long-term impact on the stock market. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com More:Why investors should sell stocks now to get ready for the big rally thatâ\u0080\u0099s coming Plus: The stock marketâ\u0080\u0099s comeuppance is coming, as bullishness gets extreme Â"}]}