{"article": [{"url": "https://www.marketwatch.com/story/postal-service-is-warning-46-states-about-mail-voting-delays-report-says-2020-08-14", "published": 1597426880.0, "headline": "Postal Service is warning 46 states about mail voting delays, report says", "body": "WASHINGTON (AP) — The U.S. Postal Service has warned 46 states and the District of Columbia it cannot guarantee all ballots cast by mail for the November election will arrive in time to be counted, the Washington Post reported Friday. Even as President Donald Trump rails against wide-scale voting by mail, the Postal Service is bracing for an unprecedented number of mail-in ballots as a result of the coronavirus pandemic. At the same time that the need for timely delivery of the mail is peaking, service has been curtailed amid cost-cutting and efficiency measures ordered by the Trump-appointed new postmaster general. Postmaster Louis DeJoy, a former supply-chain CEO and a major political donor to Trump and other Republicans, has implemented cost-cutting measures to eliminate overtime pay and hold mail until the next day if distribution centers are running late. See also: Dare Trump to sign a post office bill? Pelosi muses on an option The revelation that some voters could be disenfranchised comes amid a campaign by Trump to sow doubts about the election. Though Trump casts his own ballots by mail, he’s vigorously criticized efforts to allow more people to do so, which he argues without evidence will lead to increased voter fraud. The warning letters sent to states and obtained by the Post raise the possibility that tens of millions of Americans eligible for mail-in ballots this fall will not be able to use themt — even if they follow election rules. See also: Trump explicitly links mail-in voting and his opposition to post-office financial relief A spokesman for the Postal Service did not immediately respond to a request for comment. Officials in Michigan, Oregon, Virginia, Iowa, Ohio, Indiana, Pennsylvania, Utah and New York all confirmed to the Associated Press that they had received the Postal Service correspondence. “This is a deeply troubling development in what is becoming a clear pattern of attempted voter suppression by the Trump administration,” Virginia Gov. Ralph Northam said in a statement. “I am committed to making sure all Virginians have access to the ballot box, and will continue to work with state and federal lawmakers to ensure safe, secure and accessible elections this fall.” Kim Wyman, the Republican secretary of state in Washington state, where all voting is by mail, said sending fall ballot material to millions of voters there is a “routine operation of the U.S. Postal Service.” “Politicizing these administrative processes is dangerous and undermines public confidence in our elections,” she said in a statement. “This volume of work is by no means unusual, and is an operation I am confident the U.S. Postal Service is sufficiently prepared to fulfill.”"}]}