{"article": [{"url": "https://www.marketwatch.com/story/abe-to-step-down-as-japans-prime-minister-reports-say-01598594371", "published": 1598590520.0, "headline": "Abe says he will step down as Japanâ\u0080\u0099s prime minister", "body": "(FILES) In this file photo taken on April 17, 2020, Japan's Prime Minister Shinzo Abe pauses during a press conference at the prime minister's official residence in Tokyo. kiyoshi ota/Agence France-Presse/Getty Images TOKYO (AP) â\u0080\u0094 Shinzo Abe, Japanâ\u0080\u0099s longest-serving prime minister, says heâ\u0080\u0099s resigning because a chronic illness has resurfaced. Concerns about Abeâ\u0080\u0099s health began this summer and grew this month when he visited a Tokyo hospital two weeks in a row for unspecified health checkups. Abe has acknowledged having ulcerative colitis since he was a teenager and has said the condition was controlled with treatment. Concerns about Abeâ\u0080\u0099s chronic health issues, simmering since earlier this summer, intensified this month when he visited a Tokyo hospital two weeks in a row for unspecified health checkups. Abe, whose term ends in September 2021, is expected to stay on until a new party leader is elected and formally approved by the parliament. He had abruptly resigned from his first stint in office in 2007 due to his health, which was fueling concerns about his recent condition. Abe on Monday became Japanâ\u0080\u0099s longest serving prime minister by consecutive days in office, eclipsing the record of Eisaku Sato, his great-uncle, who served 2,798 days from 1964 to 1972. But his second hospital visit Monday eclipsed festivity for his record and has accelerated speculation and political maneuvering toward a post-Abe regime. Abe has acknowledged having ulcerative colitis since he was a teenager and has said the condition was controlled with treatment. He has not made clear if it is related to his recent health issues or hospital visits. After his recent hospital visits were reported, top officials from Abeâ\u0080\u0099s Cabinet and the ruling party said Abe was overworked and badly needed rest. His health concerns added to speculation that Abeâ\u0080\u0099s days in office are numbered, when his support ratings are already at their lowest levels due to his handling of the coronavirus pandemic and its severe impact on the economy, on top of a slew of political scandals. Shigeru Ishiba, a 63-year-old hawkish former defense minister and Abeâ\u0080\u0099s archrival, is a favorite next leader in media surveys, though he is less popular within the ruling party. A low-key former Foreign Minister Fumio Kishida, Defense Minister Taro Kono, Chief Cabinet Secretary Yoshihide Suga, and economic revitalization minister Yasutoshi Nishimura, who is in charge of coronavirus measures, are widely speculated in Japanese media as his potential successors. The end of his scandal-laden first stint as prime minister was the beginning of six years of annual leadership change, remembered as an era of â\u0080\u009crevolving doorâ\u0080\u009d politics that lacked stability and long-term policies. When he returned to office in 2012, Abe vowed to revitalize the nation and get its economy out of its deflationary doldrums with his â\u0080\u009cAbenomicsâ\u0080\u009d formula, which combines fiscal stimulus, monetary easing and structural reforms. The Nikkei 225 NIK, -0.11% closed 1.4% lower, and the dollar USDJPY, -0.38% fell sharply vs. the yen."}]}