{"article": [{"url": "https://www.marketwatch.com/story/affluent-parents-are-setting-up-their-own-schools-as-remote-learning-continues-its-the-failure-of-our-institutions-to-adequately-provide-for-our-students-11595450980", "published": 1595921600.0, "headline": "From nanny services to â\u0080\u0098private educators,â\u0080\u0099 wealthy parents are paying up to $100 an hour for â\u0080\u0098teaching podsâ\u0080\u0099 during the pandemic", "body": "A teacher addresses her pupils at a primary school in France in May 2020. In the U.S. many large school systems will continue to be partially or fully remote this fall, prompting parents who can afford it to come up with their own arrangements. (Photo by MEHDI FEDOUACH / AFP) With major school districts across the country offering limited in-person instruction this fall, parents who can afford it are scrambling to find ways to avoid another semester of balancing Zoom lessons with conference calls.Â An entire industry is mobilizing to help them.Â From nanny agencies, to tutoring companies to teacher placement services, a variety of businesses are hiring extra staff and launching new websites and program offerings to meet the demand from parents.Â In some cases, families are seeking a teacher who can provide in-person instruction to supplement what their children are learning virtually from their schools. In other cases, parents are hoping that these businesses will help them replace school entirely.Â The desire for these services is easy to understand. For many students and parents, the remote learning that schools cobbled together quickly in the spring was inadequate and hard to manage. In addition, by learning on Zoom and other platforms, students are missing out the interactions with friends and teachers that can be key to their socialization and development. And finally, for many parents, having their children in the house when they would normally be at school has made it nearly impossible to focus on work.Â Are you a family trying to prepare for school this fall? We want to hear from you. Email: jberman@marketwatch.com But these are challenges that parents across the country share and, given the funds and space required for these arrangements, only relatively well-off families can make a very private in-home school work. That dynamic has implications for educational equity at a time when educators and experts were already concerned that the gap between students with access to various devices, high speed internet, and parents who are at home to supervise â\u0080\u0094 and those without those advantages.Â A service providing â\u0080\u0098private educatorsâ\u0080\u0099 went from a handful of requests a year to 30 per day â\u0080\u009cItâ\u0080\u0099s a big investment,â\u0080\u009d Katie Provinziano, the managing director of Westside Nannies, said of hiring an in-home teacher, or private educator, as theyâ\u0080\u0099re known. Beverly Hills-based Westside places nannies, newborn care specialists and private educators with families.Â “ â\u0080\u0098Itâ\u0080\u0099s a big investment. â\u0080\u0098 ” â\u0080\u0094 Katie Provinziano, the managing director of Westside Nannies Provinzianoâ\u0080\u0099s company takes parents through the whole process of hiring an in-home teacher. They recruit, thoroughly vet and provide families with candidates and then coordinate interviews and help families through the process of actually hiring the educator.Â The families pay the educator they hire between $30 and $60 an hour, or roughly between $60,000 and $125,000 per year if the teacher were to work 40 hours per week, which is not always the case. The teacherâ\u0080\u0099s exact wages depend upon their level of experience and what families are asking of them. Parents also pay Westside a fee equivalent to 25% of the educatorâ\u0080\u0099s estimated annual pay. Demand for the service has been so high that the company hired two more recruiters to help meet it, Provinziano said.Â Â â\u0080\u009cBefore COVID, we would place private educators a handful of times a year,â\u0080\u009d Provinziano said. Usually it was for musicians going on a world tour or parents shooting a film on location who wanted to bring their kids and make sure they still received schooling. Now, on a recent day, the company had 30 phone consultations about placing teachers with families.Â â\u0080\u009cItâ\u0080\u0099s really honestly exploded, we are busier than we have ever been,â\u0080\u009d Provinziano said.Â The families calling her company are mainly interested in four buckets of services: Hiring a private educator to essentially home school their children â\u0080\u0094 â\u0080\u009cturning a guesthouse, basement or playroom into a classroom,â\u0080\u009d she said â\u0080\u0094 for the year; hiring an educator to travel with the family during this period when many arenâ\u0080\u0099t tied to the location of their office; about 40% of calls are asking about hiring an educator to teach a small pod of students; and then some want to hire a nanny who is interested in and passionate about education to help supervise the online instruction students are receiving from their schools.Â Â A private teacher can cost $80,000 to $120,000 a year â\u0080\u0094 plus a placement fee Claudia Kahn has had a business placing chefs, nannies and other domestic workers for more than thirty years, working in New York City, Los Angeles and San Francisco. This summer, she has placed educators for the first time. Since the pandemic ramped up in March, about 40 teachers â\u0080\u0094 more than typical â\u0080\u0094 have applied to her service as nanny candidates.Â Over the first few weeks of July, she received inquiries from six families asking for private educators and has placed three. â\u0080\u009cIâ\u0080\u0099m not an expert,â\u0080\u009d she said. â\u0080\u009cIâ\u0080\u0099m trying to learn as much as I can about what their needs are.â\u0080\u009dÂ Â Her clients are putting together pods and backyard school rooms. â\u0080\u009cOne put three families together from their private school and that family is setting up a school period,â\u0080\u009d she said. The teachers she places earn between $80,000 and $100,000 per year and Kahnâ\u0080\u0099s agency charges a fee of 20% of their contract.Â Â “ â\u0080\u0098One put three families together from their private school and that family is setting up a school period.â\u0080\u0099 ” â\u0080\u0094 Claudia Khan Outside Washington, D.C., Ann Dolin, the founder and president of Education Connections Tutoring, was originally only planning to offer virtual support to families this fall. She created three separate programs to supplement the hodge-podge arrangements that some local school systems had initially announced, like a choice between a couple of days per week of in-school instruction or four days per week of virtual schooling.Â Â They include: a virtual tutor for a pod at a cost of $45 to $75 per hour depending on the number of students; virtual one-on-one tutoring at a cost of $90 to $100 per student, depending on grade level; and a case manager to work with a parent or caregiver overseeing a studentâ\u0080\u0099s schooling at a cost of $100 per weekly session.Â Already, sheâ\u0080\u0099d had to hire another office staff person to help field calls from inquiring parents.Â But after Fairfax County Public Schools and Montgomery County Public Schools, two large local school systems, announced that theyâ\u0080\u0099d start virtually this fall, Dolin decided to offer an in-person option. It will be either one-on-one instruction or instruction for a household of siblings. Families will need to sign up for a minimum of six hours a week. Her inbox was flooded in the hours after the announcements, she said. Her company has already vetted 20 tutors and are ready to hire them in the event demand is beyond their current staffing, Dolin said. â\u0080\u009cWeâ\u0080\u0099re going to place ads for additional tutors, we see the demand as so significant that weâ\u0080\u0099re going to need a lot more help,â\u0080\u009d she said.â\u0080\u0098Iâ\u0080\u0099d rather us supplement school than substitute schoolâ\u0080\u0099 In New York City, Matthew Brown of Brownstone Tutors said heâ\u0080\u0099s been reaching out to more tutors as he prepares to help families with pod arrangements. Ideally, pods would come to the company already formed, but heâ\u0080\u0099s also willing to match people based on age and location. Over one week in July, he said he had spoken to five or six different parents about the pod idea.Â â\u0080\u009cUsual interest in a pod is zero,â\u0080\u009d he said.Â Brownâ\u0080\u0099s company will work with the families to match them with tutors and develop the schedule and structure of the program. â\u0080\u009cIt can be as full service as you want,â\u0080\u009d he said. â\u0080\u009cIâ\u0080\u0099d rather us supplement school than substitute school.â\u0080\u009d Swing Education, a company that connects substitute teachers with public school districts, launched a new service, called Bubbles, to meet familiesâ\u0080\u0099 demand for at-home teachers. The company put up the landing page for Bubbles on a Friday and by the following Monday it was receiving dozens of inquiries per day.Â Swing is matching educators with families in California, Arizona, Texas, New Jersey and D.C. “ â\u0080\u0098My co-founders have asked me point blank why we didnâ\u0080\u0099t come up with it sooner.â\u0080\u0099 ” â\u0080\u0094 Mike Teng, Swingâ\u0080\u0099s chief executive officer â\u0080\u009cMy co-founders have asked me point blank why we didnâ\u0080\u0099t come up with it sooner,â\u0080\u009d said Mike Teng, Swingâ\u0080\u0099s chief executive officer. Once the Los Angeles Unified School District and the San Diego Unified School District announced theyâ\u0080\u0099d be offering remote instruction in the fall, â\u0080\u009cI started seeing the writing on the wall,â\u0080\u009d Teng said: The majority of their business, which is in California, would be going virtual.Â Â â\u0080\u009cThen we immediately had parents reaching out within really a one or two day period,â\u0080\u009d he said.Â The typical request his company has received is from parents who have already found a family they plan to partner with and they want a teacher to help support the virtual instruction students are receiving in school. The cost of the services will likely range from $1,500 to $2,500 per month, Teng said. Some families have asked if they can hire a teacher to fully replace a childâ\u0080\u0099s schooling.Â Teng said heâ\u0080\u0099s trying to make sure that his company captures this demand safely and ethically. Theyâ\u0080\u0099re typically asking families to commit to at least 25 hours per week so that teachers donâ\u0080\u0099t need to go from bubble to bubble to make ends meet. In addition, they want to make sure theyâ\u0080\u0099re providing adequate support to teachers, who are in a dynamic where they might not have a ton of power â\u0080\u0094 entering a relatively affluent personâ\u0080\u0099s home.Â In these arrangements, the teachers are also employees of Swing, so that if public health guidance changes and they can no longer work with families in person, they can make rightful claims on unemployment benefits. Teng said Swing is also in discussions with companies about subsidizing the service for their employees and for teachers with children in grade school and high school.Â â\u0080\u009cMyself and most of Swing Educationâ\u0080\u0099s team came to this problem because we want to support equity in education and the current environment exacerbates, not helps,â\u0080\u009d he said.Â â\u0080\u0098This is not a failure of individual parentsâ\u0080\u0099 decision-makingâ\u0080\u0099 Some parents have been thinking about how government infrastructure could help prevent a privatized pod system from increasing already wide gulfs between haves and have-nots in education. Miriam Posner, an assistant professor at UCLAâ\u0080\u0099s Graduate School of Education and Information Science, drafted a letter to officials in her school district in Culver City, California, asking them to â\u0080\u009cinvestigate a creative solution for addressing the reality parents are faced with.â\u0080\u009d â\u0080\u009cThe key issue, to our minds, is that while school is fully online, the district must provide some solution for working parents who need childcare and instructional support, and that solution should not exacerbate inequalities or rely on private individuals to make private arrangements,â\u0080\u009d the letter reads. One possible solution she offered in the letter: The district could organize the pods and provide them with aides who could work with classroom teachers to keep students on-task. Posner, the parent of a seven-year-old, said she began hearing discussions of private pods in early July. They recently reached a â\u0080\u009cfever pitchâ\u0080\u009d where spreadsheets were circulating so that parents could affiliate with one another. The idea had been bothering her for a while, and after listening to an obituary for Georgia congressman and civil rights icon John Lewis, she thought: â\u0080\u009cIf I say I admire him and canâ\u0080\u0099t do this very one minor thing, then how can I look at myself in the mirror?â\u0080\u009d She drafted the letter. â\u0080\u009cThis is not a failure of individual parentsâ\u0080\u0099 decision-making, itâ\u0080\u0099s the failure of our institutions to adequately provide for our students,â\u0080\u009d she said. â\u0080\u009cThe energy and money that right now is being routed to these individual private solutions is much better spent being collectivized and distributed equally among the parents in the district.â\u0080\u009d Some tutoring services donâ\u0080\u0099t want to endanger their employees In some cases, that energy and money devoted to finding these services combined with the logistical and safety challenges surrounding them has put businesses in a tough spot. â\u0080\u009cThatâ\u0080\u0099s sort of the big question now,â\u0080\u009d said Amy Hayutin Contreras, a partner at tutoring services provider Hayutin & Associates, of whether to offer some kind of in-person instruction. â\u0080\u009cThereâ\u0080\u0099s a lot of pressure from families to offer that, yet we donâ\u0080\u0099t want to pressure our own employees to provide it.â\u0080\u009d Under typical circumstances, Santa Monica-based Hayutin provides a variety of tutoring services and also works with families to facilitate one-on-one schooling arrangements for their children. Hayutin is still offering its suite of services virtually.Â The company surveyed its staffers to get a sense of whether theyâ\u0080\u0099d be interested in providing in-person instruction if families hired them for a relatively significant number of hours. â\u0080\u009cSixty percent said absolutely not and 40% said Iâ\u0080\u0099d be willing to entertain that â\u0080\u0094 Iâ\u0080\u0099m open to the discussion,â\u0080\u009d said Matt Hayutin, the companyâ\u0080\u0099s founder. Even if the company were to offer in-person services in the fall, thereâ\u0080\u0099s not an insignificant chance that health guidelines could change, given the trajectory of the virus in the Los Angeles area, putting those arrangements at risk, they said. â\u0080\u009cWhat does that do to families if we even entertain this new model, this backyard model?â\u0080\u009d Hayutin said. â\u0080\u009cWhat happens if that gets shut down over and over? How does that work for the children? How does that work for our employees? And why even bother?â\u0080\u009d"}]}