{"article": [{"url": "https://www.marketwatch.com/story/fear-of-the-coronavirus-did-more-to-keep-people-at-home-than-lockdowns-study-says-2020-06-29", "published": 1593447560.0, "headline": "Fear of the coronavirus did more to keep people at home than lockdowns, study says", "body": "The fear of catching the coronavirus has evidently played a much bigger role in consumers staying at home and avoiding stores than government-ordered lockdowns, according to a new paper whose findings raise fresh questions about how quickly the economy will return to normal. Using cell-phone data on which stores millions of people visited, economists Austan Goolsebee and Chad Syverson of the University of Chicago found that traffic began to decline sharply before government restrictions were put in place, especially in counties with the most severe viral outbreaks. Read:U.S. likely regained 3 million jobs in June, but coronavirus flareups hamper recovery From March to May, Americans also shifted to smaller, less busy stores from larger ones that typically draw bigger crowds. “By many accounts, anxious individuals engaged in physical distancing on their own accord,” the authors wrote. “While overall consumer traffic fell by 60 percentage points, legal restrictions explain only 7 of that. Individual choices were far more important and seem tied to fears of infection.” The recent rash of new coronavirus cases in states such as Texas, Florida and Arizona appear to support the paper’s conclusions. Foot traffic and social mobility began to decline in those states even before they moved to reimpose new restrictions or delay further reopening of their economies. If the pattern holds, many Americans are unlikely to venture out much until the pandemic recedes again or treatments are developed. That could delay or slow an economic recovery and consign some companies in hard-hit industries such as retail, travel and dining out to failure — regardless of how much states reopen. “Repealing lockdowns may not a particularly powerful tool for restarting growth. If people are otherwise concerned about potential infection, lifting legal restrictions on their activity has limited effect,” Goolsbee and Syverson wrote. Goolsbee was a former top adviser to President Barack Obama. The paper was put out by the National Bureau of Economic Research."}]}