{"article": [{"url": "https://www.marketwatch.com/story/are-you-facing-early-retirement-heres-how-to-prepare-2020-07-27", "published": 1597510100.0, "headline": "Are you facing early retirement? Hereâ\u0080\u0099s how to prepare", "body": "This article is reprinted by permission from NextAvenue.org. The coronavirus pandemic is causing many older workers whoâ\u0080\u0099ve lost jobs or been offered early retirement severance packages to decide to pack it in. But takingÂ early retirementÂ can throw a monkey wrench into your future financial security. Thatâ\u0080\u0099s why itâ\u0080\u0099s vital to be cautious before doing it. Iâ\u0080\u0099ve talked to several sharp financial advisers for their tips on how best to prepare to retire earlier than you planned; youâ\u0080\u0099ll see their suggestions below. 80% of older Americans can't afford to retire - COVID-19 isn't helping â\u0080\u009cThe numbers suggest that while many older workers displaced by COVID-19 job loss are still seeking work, a large number have dropped out of the labor market entirely,â\u0080\u009d Jennifer Schramm, a senior strategic policy adviser at the AARP Public Policy Institute wrote in her blog: â\u0080\u009cDevastating Job Losses May Be Pushing Older Workers Into Retirement.â\u0080\u009d As a result, Schramm said, â\u0080\u009cjob losses associated with the pandemic may be leading to a substantial rise in earlier-than-planned retirement.â\u0080\u009d Frankly, as someone who writes about work and money for people over 50, Iâ\u0080\u0099m worried thatÂ frustration with the job searchÂ or eagerness to grab early-out offers are triggering people to retire early, with potential financial reverberations for the rest of their lives.The risk of claiming Social Security early Take Social Security â\u0080\u0094 or rather, maybe donâ\u0080\u0099t. Due to the heightened unemployment of the 2007-09 recession, â\u0080\u009cthe take-up of Social Security at age 62 jumped from 42.2% in 2007 to 46.9% in 2009,â\u0080\u009d Alicia H. Munnell, director of the Center for Retirement Research at Boston College, wrote on MarketWatch. And, she added, â\u0080\u009cI would expect this pattern to repeat itself in the wake of COVID-19.â\u0080\u009d Hereâ\u0080\u0099s why thatâ\u0080\u0099s a concern: Starting toÂ claim Social Security at 62Â because you arenâ\u0080\u0099t working will then lock you into a level of much smaller benefits than if youâ\u0080\u0099d waited until later.Â â\u0080\u009cBenefits claimed at 70 are 77% higher than those claimed at 62,â\u0080\u009d Munnell wrote. â\u0080\u009cIf you qualify for the maximum amount of Social Security and take your benefits at the youngest allowed age, you will receive $2,252 each month,â\u0080\u009d says Michelle Connell, a Chartered Financial Analyst and owner of Portia Capital Management in Dallas. â\u0080\u009cIf you wait until you are 70, you will receive $3,980 a month.â\u0080\u009dThose enticing early retirement offers Undoubtedly, it can be enticing when your employer dangles an early-retirement package compelling enough to grab it and not look back. A growing number of companies from airlines to media firms have been making these offers due to the pandemic. According to CNBC, nearly 4,000 Southwest Airlines LUV, +1.89% Â workers and 2,235 Delta DAL, +0.39% Â pilots signed up for buyouts. Delta offered partial pay for up to three years plus extended health insurance coverage. A spokesman for the Air Line Pilots Association told CNBC: â\u0080\u009cThe voluntary early-out program participation exceeded our expectations.â\u0080\u009d Such offers might not come around again anytime soon and there is no guarantee your job will be safe. Donâ\u0080\u0099t expect your company to follow it with another severance package for future rounds of layoffs, notes Connell. Itâ\u0080\u0099s logical to me that older workers, especially those in spitting distance of age 65, would decide to bid employment adieu. Medicare kicks in at 65 andÂ fullÂ Social Security benefit eligibility starts at 66 or 67. See: Take Social Security at 62? Hereâ\u0080\u0099s when it makes sense to do it Whatever the impetus, the decision to retire is often emotional and fraught with myriad calculations. Itâ\u0080\u0099s generally not a solo decision if you have a spouse or partner or minor children.Money advice for the early retirement decision Hereâ\u0080\u0099s how to help shape a financial framework if youâ\u0080\u0099re contemplating early retirement: Prepare a budget. Retiring early â\u0080\u009ccan be a difficult decision, since there are so many unknowns to consider,â\u0080\u009d says Charles Adi, a Certified Financial Planner at the advisory firm Blueprint 360 in Houston. â\u0080\u009cI encourage my clients to take some time and evaluate the three critical retirement planning areas: income, expenses and insurance.â\u0080\u009d First, determine your monthly income and spending needs in retirement. â\u0080\u009cBe careful not to underestimate your discretionary budget for travel, shopping, eating out and spoiling the grandkids,â\u0080\u009d Adi says. â\u0080\u009cYou will be surprised how quickly small purchases add up.â\u0080\u009d Ask yourself this key question: Will there be areas you can cut back expenditures, say, by moving to a smaller home or town where the cost of living is cheaper? See: There is more to picking a place to retire than low taxes â\u0080\u0094 avoid these 5 expensive mistakes Websites likeÂ Mint.comÂ andÂ YouNeedABudget.comÂ offer free software to track spending and set up budgets. If youâ\u0080\u0099re offered an early retirement package, really scrutinize it.Â Buyouts are often complicated and not cookie-cutter. Most are negotiable to some extent, too. You have to truly understand what the deal is thatâ\u0080\u0099s being offered, says Dennis Notchick, a Certified Financial Planner for Stratos Wealth Advisors in San Diego. That goes beyond how much money youâ\u0080\u0099ll receive, which is often related to your tenure with your employer. â\u0080\u009cIs it a lump sum? Is there anÂ annuityÂ option, lifetime income payments?â\u0080\u009d Notchick says. A lump-sum buyout can balloon your income for the year which can result in a significant tax bill. If you can take the payments in stages, that could lower your IRS bill. If you are married, youâ\u0080\u0099ll want to pay special attention to the payout rules. â\u0080\u009cSometimes a person will take a lifetime income payment, but if they die, their spouse gets nothing. Sometimes a survivorship benefit of fifty percent or two-thirds is an option,â\u0080\u009d says Notchick. To immunize yourself against future tax rate hikes due to federal deficit spending, Notchick says, you may want to use some of your early retirement money to open a tax-sheltered Roth IRA. Be sure to review any medical coverage, too. A typical offer includes one year of health coverage. Access to an employer health plan might be something you can negotiate for an extended period of coverage. When job-based plan coverage ends (and youâ\u0080\u0099re not yet eligible for Medicare), you can usually continue enrollment for up to 18 months â\u0080\u0094 sometimes longerÂ â\u0080\u0094 under a federal law known asÂ COBRA, which stands for the Consolidated Omnibus Budget Reconciliation Act. It requires firms with at least 20 employees to offer this option. Normally, you have up to 60 days to elect COBRA and another 45 days to pay the first premium (covering the period dating back to your coverage loss). But if youâ\u0080\u0099ve been laid off or furloughed due to the pandemic, aÂ recent federal rule gives you more time to decide about COBRA. The date to elect COBRA now begins March 1 (the end of the COVID-19 â\u0080\u009coutbreak periodâ\u0080\u009d) and will end 60 days after whenever the government ultimately declares the COVID-19 emergency over. So, according to NPR, if you were laid off in April and the COVID-19 emergency ends Aug. 31, youâ\u0080\u0099d have 60 days beginning Aug. 31 â\u0080\u0094 the end of October â\u0080\u0094 and then the regular 60-day COBRA election period after that. See: 5 things to know about health care in retirement So, people laid off because of the coronavirus outbreak have at least four months, maybe more, to decide whether they want to elect COBRA. The drawback: COBRA premiums are steep. Figure on something like $600 a month per person or more. â\u0080\u009cFinally,â\u0080\u009d Notchick says, â\u0080\u009cis long term care of concern? Are you currently covered by a long-term care policy at work? If so, can you keep it when you retire? And is it worth keeping?â\u0080\u009d Determine your retirement income sources.Â Carefully review your anticipated income (Social Security benefits, pensions, distributions from personal investments and savings) and expenses (weekly, monthly and yearly budgets). Many major mutual-fund companies have retirement calculators on their sites that can help you with this exercise. â\u0080\u009cFocus first on guaranteed sources, such as Social Security and pensions. Then calculate your monthly cash needs from investments,â\u0080\u009d Adi says. â\u0080\u009cIf you are fortunate to have a pension, evaluate your payout options and determine if your pension payment adjusts for inflation annually.â\u0080\u009d The Social Security Administration website can let you get anÂ estimate of your future Social Security benefitsÂ and a record of your lifetime earnings history. If youâ\u0080\u0099re married, youâ\u0080\u0099ll need to determine when itâ\u0080\u0099s best for each of you to start claiming Social Security. â\u0080\u009cDo you need to trigger both you and your spouseâ\u0080\u0099s Social Security policies when you retire?â\u0080\u009d Notchick asks. â\u0080\u009cCan you take one or both later and let it increase?â\u0080\u009d The AARP website has a usefulÂ Social Security benefits calculator. Plan your withdrawals from savings and investments. A conservative annual drawdown of retirement savings may be to take 3% the first year, and to adjust for inflation after that. If youâ\u0080\u0099ve been fortunate enough to have saved $1 million, for example, plan to withdraw $30,000 in the first year and to increase that amount by the rate of inflation in the second year and beyond. Some financial advisers stick with the 4% rule for retirement withdrawals. â\u0080\u009cEvaluate your annual expenses and multiply this by 25,â\u0080\u009d Connell says. â\u0080\u009cThis will give you the amount of money you must have order to qualify for standard 4% withdrawal rate and not run out of money.â\u0080\u009d If youâ\u0080\u0099re not taking an early retirement offer with health coverage and are thinking of retiring before 65, be sure to take health insurance into account. You wonâ\u0080\u0099t yet be eligible for Medicare, so health insurance will be a huge consideration. Also on MarketWatch: Where should I retire? If you have a spouse who is still working, you may be able to tap into health coverage via his or her employer. Otherwise, look into Affordable Care Act options throughÂ healthcare.govÂ or your stateâ\u0080\u0099s marketplace. At 59, I currently shell out around $800 a month for a health insurance plan that has a high annual deductible: $7,500. Talk to a financial adviser.Â An expert can help you work through your early retirement puzzle. I recommend working with a fee-only financial adviser, rather than one who charges commissions. And look for one who is a fiduciary â\u0080\u0094 which means this pro puts your interests first. Some databases to search for a certified financial planner: the nonprofit Certified Financial Planner Board of Standards, the National Association of Personal Financial Advisors, the Financial Planning Association and Wealthramp.com. Kerry Hannon is the author ofÂ â\u0080\u009cNever Too Old to Get Rich: The Entrepreneurâ\u0080\u0099s Guide to Starting a Business Mid-Life.â\u0080\u009d She has covered personal finance, retirement and careers for the New York Times, Forbes, Money, U.S. News & World Report and USA Today, among other publications. She is the author of a dozen books. Her website isÂ kerryhannon.com. Follow her on TwitterÂ @kerryhannon. This article is reprinted by permission from NextAvenue.org, Â© 2020 Twin Cities Public Television, Inc. All rights reserved."}]}