{"article": [{"url": "https://www.marketwatch.com/story/heres-where-joe-biden-has-moved-to-the-left-and-where-he-hasnt-2020-08-19", "published": 1597867100.0, "headline": "Here's where Joe Biden has moved to the left - and where he hasn't", "body": "President Donald Trump likes to paint Joe Biden as beholden to the progressive wing of the Democratic Party, a \"Trojan Horse\" for the left. Is that accurate? As Biden prepares to accept the presidential nomination on Thursday, give Trump partial credit for spotting a leftward tilt by the former vice president. But only partial. Biden has indeed moved to the left in some of his policy proposals. Yet on others, the 77-year-old veteran Democrat hasn't budged. Having fought a bitter primary-season battle with progressives Bernie Sanders and Elizabeth Warren, Biden wound up adopting some of those senators' ideas. For example, Biden added to his own agenda Sanders' proposal to make public college tuition-free for students whose families make less than $125,000. He backed Warren's plan to make it easier to file for bankruptcy. And Biden recently rolled out an environmental plan that was more aggressive than what he proposed during the campaign. See:Biden calls for $2 trillion in clean-energy spending and zero power-plant emissions by 2035. \"He's moved on some issues quite decidedly to the left,\" says Larry Jacobs, a political scientist at the University of Minnesota. But Biden hasn't gone as far as some policies in the Green New Deal, the climate-change-fighting plan of progressives such as Rep. Alexandria Ocasio-Cortez. While his running mate Sen. Kamala Harris said last year during a debate that there was \"no question\" she was in favor of banning fracking, Biden would do that only for oil and gas production from federal lands. And the former vice president hasn't signed on to Medicare for All, preferring instead to build on the Affordable Care Act that became law under President Barack Obama. Now read:Are Democrats wavering on oil subsidies? Biden-Harris climate platform remains fluid. Still, Trump's line of attack is to paint the longtime Democrat as an extremist. \"Joe Biden and Kamala Harris would DESTROY America,\" read a Trump campaign fundraising email on Monday, the day the Democrats' convention kicked off. \"Their Socialist Convention this week is only a preview of what's to come,\" the campaign said. Trump is spending the week lobbing such attacks in four battleground states, counterprogramming the convention. Watch:Joe Biden officially nominated by virtual roll call at DNC. Trump, facing unemployment of more than 10% as the coronavirus continues to wrack the U.S. economy, claims that Biden and Harris would sink stocks SPX, +0.87%  and even cause a depression via their economic policies, such as raising the corporate tax rate to 28% from 21% and imposing higher rates on individuals. Wall Street analysts offer a much more nuanced picture. At least one has said another Trump term has the potential to cause a double-dip recession if the coronavirus crisis is mishandled. And analysts say there are sector winners and losers under a potential Biden presidency, with utilities and health care poised to benefit, and energy and financials possibly suffering. Barron's:How a Biden win would affect different market sectors - and stock picks for both election outcomes. To be sure, Biden's ability to make sweeping policy changes in health care or tax policy would depend on the makeup of Congress. Republicans' continued hold on the Senate could stymie major ambitions - but the GOP's ceding the chamber to Democrats would open a path for Biden's plans, especially with a Democratic-controlled House. A tug of war over Biden's policies appears poised to continue if he gets elected. Speaking at the Democratic convention on Monday night, former Ohio Gov. John Kasich, a Republican, argued against those in his party and independents who worry that Biden \"may turn sharp left and leave them behind.\" \"I don't believe that,\" he said. \"No one pushes Joe around.\" Some activists, meanwhile, say they intend to try to do just that. Varshini Prakash, co-founder of the climate-advocacy group the Sunrise Movement, called Biden's proposal to stop fracking on federal lands \"a strong step,\" but said the former vice president can go much farther on issues affecting the environment. \"No matter what, we're got to push Joe Biden to increase and improve his ambition,\" Prakash, whose organization wants to \"make the Green New Deal the law of the land,\" told MarketWatch."}]}