{"article": [{"url": "https://www.marketwatch.com/story/gold-and-silver-prices-move-higher-on-bargain-hunting-2020-08-24", "published": 1598279660.0, "headline": "Gold ends at lowest in a month as potential COVID-19 treatment boosts the stock market", "body": "Gold futures fell Monday as global equity markets saw sharp gains fueled by optimism over a potential COVID-19 treatment, pushing prices for the metal to its lowest settlement in about a month. The move for gold came as the U.S. Food and Drug Administration on Sunday said it authorized use of convalescent plasma, the antibody-rich blood component taken from recovered COVID-19 patients, for the treatment of serious coronavirus cases, which was giving some life to risky assets like stocks. On Monday, the S&P 500 SPX, +0.87% and Nasdaq Composite COMP, +1.39% pushed further into record territory. That dulled demand for precious metals, which have been viewed as a hedge against the uncertainty fostered by the COVID-19 pandemic and the trillions that central banks and governments have spent to limit the debilitating impact to businesses globally. Medical experts said the treatment may provide benefits to those battling the disease, but that there isn’t conclusive evidence of its effectiveness, while questions remain about when it should be administered and dosage. December gold GCZ20, +2.17% GC00, +2.17% fell by $7.80, or 0.4%, to settle at $1,939.20 an ounce, That was the lowest finish for a most-active contract since July 27, according to FactSet data. Meanwhile, September silver US:SIU20 shed 12 cents, or 0.5%, to $26.607 an ounce, with the metal notching a weekly decline of 3% on Friday, based on the most active contract. Craig Erlam, senior market analyst at Oanda, pointed out that the dollar had pared earlier losses, leading to the move lower Monday for gold. “The rebound in the dollar has been impressive after breaking key support last week and today’s rebound is another example of that,” said Craig Erlam, senior market analyst at Oanda, in a market update. As gold futures settled Monday, the U.S. dollar was little changed against a half-dozen rivals, as measured by the ICE U.S. Dollar DXY, -0.58%. Earlier weakness in the dollar had provided some support for gold prices early Monday, with the metal climbing past $1,970 during the session. The dollar index has gone from “looking vulnerable” to eyeing 94, which is a key resistance level, said Erlam, in a market update. “That would be bad news for gold,” which is priced in dollars. Among other metals traded on Comex, September copper US:HGU20 rose 0.3% to $2.9265 a pound. October platinum PLV20, +3.99% edged down by 0.2% to $924.50 an ounce, while September palladium US:PAU20 settled at $2,165.50 an ounce, down 0.7%."}]}