{"article": [{"url": "https://www.marketwatch.com/story/heres-the-secret-sauce-to-handle-the-stock-markets-election-and-virus-fears-2020-06-22", "published": 1592931860.0, "headline": "Here's the secret sauce to handle the stock market's election and virus fears", "body": "Fear over a further spread of the deadly coronavirus and expectations of a Democratic victory in the presidential election are two events that will affect the stock market. First and foremost, I am politically agnostic. My sole job is to help investors. But President Trump's rally in Tulsa, Okla., was underwhelming, following polls that showed Joe Biden with double-digit leads in some cases. More than three years ago I wrote: \"Here's the case for Dow 30,000 in Trump's first term.\" The secret sauce to handle the stock market's election and coronavirus fears is risk management. Let's explore the issue with the help of a chart.Chart Please click here for an annotated chart of the Dow Jones Industrial Average ETF DIA, +0.57%, which tracks the Dow Jones Industrial Average. Note the following: â\u0080¢ The chart shows that the stock market is in the support/resistance zone. â\u0080¢ The chart shows that RSI (relative strength index) is on a buy signal but is flattening. â\u0080¢ The combination of the previous two items indicates that the risk in the stock market is much higher than widely believed. â\u0080¢ Wall Street loves Trump. Now there is a fear that Biden will be elected. In our analysis at The Arora Report, it is simply too early to call the election. â\u0080¢ If Biden gets elected, at a minimum, expect corporate income tax rate to go up from 21% to 28% and perhaps higher. â\u0080¢ Take a look at the chart on the left side of the \"mother of support zones.\" A part of the rise in the stock market is due to higher corporate earnings, in part, due to lower taxes and less regulation. â\u0080¢ If Biden gets elected, expect earnings to take a hit of about 10%, not only due to higher taxes but to more regulation. â\u0080¢ The chart shows that due to the coronavirus, the stock market fell to the top band of the mother of support zones and then rallied strongly. â\u0080¢ The chart shows that 65% of the first leg of the rally was short squeeze-related. In practical terms it means that there is a lot of air under the market instead of solid support. â\u0080¢ A strong counter balance to the election and coronavirus fears is the Federal Reserve policy. â\u0080¢ The chart walks you through the increase in the Federal Reserve balance sheet from $0.87 trillion before the financial crisis to over $7 trillion now and on its way to $10 trillion based on the programs that the Fed has announced. â\u0080¢ There is an important reversal pattern in the stock market that you should watch. In view of this pattern, it is important to review three sets of stocks. 1. The mega-cap tech stocks of Apple AAPL, +1.74%, Amazon AMZN, +3.01%, Facebook FB, +0.26%, Microsoft MSFT, +2.48% and Alphabet GOOG, +1.97%  GOOGL, +1.82%. 2. Battleground stocks that provide an important indication of sentiment such as including American Airlines AAL, +0.34%, Carnival CCL, +0.51%, Hertz HTZ, -1.78% and Nikola NKLA, -1.36%. 3. Semiconductor stocks including Intel INTC, -1.03%, AMD AMD, -3.94% and Applied Materials AMAT, +1.10%. â\u0080¢ Consider watching gold ETF GLD, +1.81%, silver ETF SLV, +5.54% and gold miner GDX, +4.64%. Gold is threatening to break out and may turn out to be a good hedge against money printing, which is driving up the stock market.Secret sauce Under these circumstances, the secret sauce to handle these risks is proper risk management. Proper risk management has the following elements that need to be orchestrated correctly: â\u0080¢ Holding a large amount of cash. â\u0080¢ Putting on hedges - or more cash for those who do not want or can't hedge. â\u0080¢ Putting on protection band(s). â\u0080¢ Owning good long-term positions based on fundamentals. â\u0080¢ Owning short- to medium-term tactical positions. â\u0080¢ Following proper diversification based on sectors, strategies, time frames, correlations and geography. â\u0080¢ Holding short positions for those who are sophisticated and experienced or in the alternate inverse ETFs. â\u0080¢ Employing judicious use of stop losses or changes in allocations. â\u0080¢ Learning how to differentiate between strategic and tactical actions. â\u0080¢ Booking some profits as signals are given. â\u0080¢ Following reliable sources of technical, fundamental and macro analysis. â\u0080¢ Staying nimble. Disclosure: Arora Report portfolios have positions in Apple, Amazon, Alphabet, Microsoft and Facebook. Nigam Arora is the founder of The Arora Report, which publishes four newsletters. He can be reached at Nigam@TheAroraReport.com."}]}