{"article": [{"url": "https://www.marketwatch.com/story/service-side-of-economy-roars-back-in-june-ism-shows-but-momentum-might-be-hard-to-sustain-2020-07-06", "published": 1594033940.0, "headline": "Service side of economy roars back in June, ISM shows, but momentum might be hard to sustain", "body": "The numbers: Restaurants, dentists and other service-style companies that dominate the U.S. economy saw a surge in growth in June as businesses were allowed to reopen, pointing to a gradual recovery after extended coronavirus lockdowns. The Institute for Supply Management’s index of nonmanufacturing companies jumped to 57.1% in June from 45.4% in May, marking the single biggest increase since the survey was created in 1997. It was also the highest reading since February and easily topped the 51% forecast of economists polled by MarketWatch. Any number above 50% indicates more companies are expanding, but the big increase in June overstates the improvement in the economy. Growth looked so strong because it occurred after a few months of extremely low activity. Business is no where close to precrisis levels. What’s more, a resurgence in coronavirus cases has already delivered another blow to restaurants and other businesses that rely on crowds of customers. That could dampen business in July. What happened: Production and new orders both soared in June, topping 60%. The employment gauge also rose to 43.1% from 31.8%, reflecting the return of more people to work. The government on Friday said the U.S. has regained 4.8 million jobs in June. Read:U.S. regains 4.8 million jobs in June, but rehiring poised to slow Still, that leaves at least 15 million people who were working before the pandemic without jobs. Fourteen of the 18 service industries tracked by ISM expanded in June. Even as the economy rebounded, business leaders urged caution. “Businesses are starting to reopen and the economy seems to be on the road to recovery, but let’s not get too complacent, [as] COVID-19 is still a pandemic and a vaccine has not been developed,” said an executive at a food-products manufacturer. “COVID-19 and the riots have disrupted the normal flow of business. There is no new normal yet,” said an executive at a real estate company. Big picture: The huge service side of the economy, which employs more than 80% of all American workers, began to rebound in May and gained strength in June. A related ISM survey last week also showed a similar rebound in manufacturing. Read:Manufacturers come back strong in June, but ‘it’s a slow recovery at this point’ What remains to be seen is how much a fresh spike in coronavirus cases slows the progress in the economic recovery. Some states have reimposed restrictions and others have paused the next step in reopening to prevent further outbreaks. What they are saying? “Businesses were reopening in June and most did more business than when they were closed. Still, It’s not enough to reabsorb the many millions pushed out of the workforce,” said chief economist Chris Low of FHN Financial. “The sharp increase in the headline needs to be treated with caution,” wrote senior economist Andrew Grantham of CIBC Economics in a note to clients. “Surveys such as these only measure the breadth of moves — i.e. the proportion of firms seeing activity rise/fall in a given month — and tell us nothing about the scale of the recovery relative to how deep the downturn was.” Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% extended their gains in Monday trading."}]}