{"article": [{"url": "https://www.marketwatch.com/story/my-dad-left-me-his-ira-when-he-died-is-there-a-way-to-share-it-with-my-siblings-2020-06-24", "published": 1593254540.0, "headline": "My dad left me his IRA when he died, is there a way to share it with my siblings?", "body": "Q: My father passed last year with an IRA valued at $90K with me as the sole beneficiary. I have a brother and a sister that should have been named. Is there a way to draw a legal document that would instruct the broker to split (roll?) the account into three separate inherited IRAs? I am in a much higher tax bracket than my siblings and don’t want to administer the RMDs. — Joe A.: Sorry about your dad, Joe. I appreciate you wanting to share the funds with your brother and sister, but as the sole named beneficiary, all of the IRA is legally yours. “The simplest way to get your siblings funds is for you to take distributions from the IRA and simply give the money to them after adjusting for the change in your income tax bill from adding the distributions to your income. There would be nothing to administer because you each would do as you please with the cash. Anytime one gives money to someone that is not their spouse, they should consider gift taxes. However, the amount of money involved here is low enough that avoiding a gift tax is possible. Read: Why your first five years of retirement are critical You could reduce the tax impact somewhat by paying the funds out over more than one tax year. If the extra income from paying them out would put you in an even higher bracket than you would face without the distribution, you could reduce the tax impact somewhat by paying the funds out over more than one tax year. Also, if you didn’t want to take your share soon, you could hold back your portion and take your distributions under the RMD rules since your dad passed before 2020. Read: If you want to live to 100, do this one thing Alternatively, you can try to petition the court to have the IRA split. The brokerage firm will not deviate from the designation without court order. You would likely need to show that not splitting three ways was a clear error and not what your dad wanted. This is typically done by pointing to the beneficiary designations on other accounts or what’s written in the will or a trust. The track record on these petitions does not favor the outcome you desire. By law, the beneficiary designation supersedes the will or a trust and is presumed to reflect the deceased’s wishes. Successful petitions typically involve nefarious reasons such as undue influence, fraud, forgery, etc. Petitioning is not a DIY undertaking. You’ll have a better chance if you engage a good lawyer so there is a cost and hassle factor that has to be considered versus you taking the money out, paying at your tax rate, gifting to your siblings, and being done. Remember, that if this were split like you wanted, your siblings would pay tax on their share at their rates. Therefore, if the petition even succeeds, the cost evaluation comes down to the anticipated legal expenses compared with the difference in taxes saved by splitting versus the taxes paid at your rate. Read: A traditional 401(k) is better than a Roth 401(k) — except in this surprising situation Your situation highlights the importance of beneficiary designations. If your two siblings had been also been named, you could easily split into three inherited IRAs and each of you would then make your own choices about taking funds out. In your case, each beneficiary could have chosen to take the funds out over many years, subject to the Required Minimum Distribution rules applicable to Inherited IRAs. If you have a question for Dan, please email him with ‘MarketWatch Q&A’ on the subject line. Dan Moisand is a financial planner with Moisand Fitzgerald Tamayo. His comments are for informational purposes only and are not a substitute for personalized advice. Consult your adviser about what is best for you. Some questions are edited for brevity."}]}