{"article": [{"url": "https://www.marketwatch.com/story/big-tech-painted-as-the-railroad-barons-of-the-digital-age-in-antitrust-hearing-2020-07-29", "published": 1596097760.0, "headline": "Big Tech painted as the railroad barons of the digital age in antitrust hearing", "body": "For the most part — if you could tune out the political grandstanding that had nothing to do with antitrust — Wednesday’s congressional hearing on Big Tech gave many pointed examples of how four of the biggest tech companies in the U.S. abuse their dominant power and thwart competition. The chief executives of Alphabet Inc. GOOG, +1.97% GOOGL, +1.82% , Amazon.com Inc. AMZN, +3.01% , Apple Inc. AAPL, +1.74% and Facebook Inc. FB, +0.26% spent 5½ hours giving remote video testimony in a hearing that looked at evidence compiled by the House Judicial Subcommittee on Antitrust into digital markets. Millions of documents and hundreds of hours of interviews were the basis for most of the questions that stayed on the topic of anti-competitive behavior by the four tech behemoths. Read the MarketWatch live blog recap of the hearing From an audio excerpt of a woman who believed her family’s textbook business had been pretty much destroyed by Amazon, to a text message from Instagram co-founder Kevin Systrom about his fears that Facebook CEO Mark Zuckerberg would “go into destroy mode” if he did not sell his company to him, there were many examples of how Big Tech abuses its monopoly power. (Zuckerberg said he disagreed with his characterization of those conversations). “It made clear that Google, Facebook, Apple, and Amazon are the modern equivalents of the railroads that used network monopolies to determine who gets to market and who doesn’t,” said Sally Hubbard, director of enforcement strategy at the Open Markets Institute, in a statement. “No longer can anyone dispute the fact that tech giants build and maintain their empires by breaking the antitrust laws.” Also see: Antitrust questions bruise but don’t break Big Tech CEOs in historic hearing The next step for the subcommittee will be issuing its report. A detailed report could further pressure the two government agencies — the Justice Department and the Federal Trade Commission — that have been investigating the four companies since last year into action. In May, the Wall Street Journal reported that the DOJ and a group of state attorneys general could file a lawsuit as soon as this summer against Alphabet’s Google, focusing on how it leverages its dominant internet search business to stifle competition. “I would expect that whatever this committee found in the course of its investigation’s hearing will be shared with the enforcement agencies,” said Rebecca Haw Allensworth, a professor at Vanderbilt University Law School, in an email. “But I think the more important role that a hearing like this plays is to send a message: These companies ought to be under serious scrutiny by the FTC and DOJ, and there is the political will to support that.” What happens next will be in the hands of those agencies. And while after Wednesday’s hearing it seems Alphabet may be most in jeopardy, the other companies should not relax. None of Big Tech made a very good showing Wednesday."}]}