{"article": [{"url": "https://www.marketwatch.com/story/boycott-starbucks-coffee-giant-slammed-for-banning-black-lives-matter-gear-2020-06-11", "published": 1592036600.0, "headline": "Boycott Starbucks? Coffee giant gets slammed for telling workers not to wear Black Lives Matter gear", "body": "Starbucks, like many other corporate giants across the world, last week entered the Black Lives Matter conversation on social media by proclaiming its support for the movement and laying out in a tweet some of the measures it would take to do its part: iframe.twitter-tweet { width: 100% !important; } At the same time, according to an internal memo obtained by BuzzFeed News, Starbucks SBUX, +0.53% prohibited its workers from wearing accessories or clothing mentioning BLM, citing its dress-code policy that targets anything to do with politics or religion. Despite backlash from employees, a spokesperson for Starbucks told BuzzFeed the rule will stay in place because it’s necessary “to create a safe and welcoming” environment. Update:Starbucks backtracks Friday on ban of Black Lives Matter attire in workplace Nevertheless, #BoycottStarbucks emerged as a top-trending Twitter topic on Thursday. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Meanwhile, BuzzFeed reported that nearly every employee interviewed for its story pointed out that Starbucks allowed workers to wear accessories supporting marriage equality and LGBTQ rights, and, in some cases, even handed out gay-pride shirts and pins. “I work in a store where I am one of five people of color out of 30, and it would be nice to be able to show some sort of unity with them,” one manager said. “I personally am having a rough time with this. ... Starbucks caters to a predominantly Caucasian customer base and ... expects us to uphold an amazing customer experience for these demographics, to ensure the money keeps coming in.”"}]}