{"article": [{"url": "https://www.marketwatch.com/story/house-not-taking-mnuchins-no-for-an-answer-as-it-seeks-details-on-recipients-of-federal-coronavirus-relief-funds-2020-06-15", "published": 1592234780.0, "headline": "House not taking Mnuchinâ\u0080\u0099s no for an answer as it seeks details on recipients of federal coronavirus relief funds", "body": "WASHINGTON (AP) â\u0080\u0094 A House subcommittee investigating billions of dollars in coronavirus aid is demanding that the Treasury Department, the Small Business Administration and several large banks turn over detailed information about which businesses applied for and received federal loans. The requests come after Treasury Secretary Stephen Mnuchin told Congress last week that the names of loan recipients and the amounts disbursed as part of the $600 billion-plus Paycheck Protection Program are â\u0080\u009cproprietary information.â\u0080\u009d Democrats say there is nothing proprietary or confidential about businesses receiving millions of taxpayer dollars, with Elizabeth Warren, a well-known consumer advocate before her election to the Senate, saying taxpayers deserve to know where their money is going and whom the administration is serving. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } The letters ask the banks and the department for a complete list of applicants for loans, whether they were approved and also details on the guidance Treasury has issued. The subcommittee is also asking for communications between the government and the banks. Democrats say they are not receiving enough information about the loan disbursements and fear the Treasury Department has favored large, well-funded companies over smaller businesses in underserved communities. In the letters, the Democrats on the House Select Subcommittee on the Coronavirus Crisis request that the banks â\u0080\u009ctake immediate steps to ensure that remaining PPP funds are allocated to those businesses truly in need.â\u0080\u009d In the letter to Mnuchin and Small Business Administrator Jovita Carranza, the Democrats urged more transparency â\u0080\u009cso American taxpayers can understand whether federal funds are helping vulnerable businesses and saving jobs, or are being diverted due to waste, fraud, and abuse.â\u0080\u009d The committee, which is headed by Rep. James Clyburn, D-S.C., sent the letters to executives of some of the largest lenders in the program, including J.P. Morgan Chase JPM, -0.57%, Santander Bank SAN, -1.48% Â SAN, -1.28%, U.S. Bancorp USB, -0.83%, Bank of America BAC, +0.47%, Truist Financial Corp. TFC, +0.34%, PNC PNC, -0.91% Â and Citigroup C, +0.47%. Now 10 weeks after the Paycheck Protection Program was launched, the SBA says it has processed 4.5 million loans worth $511 billion. But it has yet to reveal the recipients of taxpayer aid. The agency has only provided general information, such as the total amounts of loans awarded in a given time period. The loans can be forgiven if businesses use the money to keep employees on payroll or rehire workers who have been laid off. Read on:The U.S. â\u0080\u0098canâ\u0080\u0099t shut down the economy again,â\u0080\u0099 Treasury Secretary Mnuchin says"}]}