{"article": [{"url": "https://www.marketwatch.com/story/the-racial-wealth-gap-and-other-forms-of-inequality-limit-us-economic-strength-moodys-2020-07-16", "published": 1595060120.0, "headline": "The racial wealth gap and other forms of inequality limit U.S. economic strength: Moodyâ\u0080\u0099s", "body": "Income and wealth inequalities, including wide racial disparities, are keeping the U.S. economy from reaching its potential and pose ongoing â\u0080\u009csocial risk,â\u0080\u009d according to a report from Moodyâ\u0080\u0099s Investors Service. The report notes that the median net worth of the top 10% of income earners has jumped 200% since 1995 while the bottom 40% have seen a decline. Wealth and income disparities are both apparent and significant along racial lines, with white households experiencing a 43% increase in net worth between 1995 and 2016 while Black household net worth remained flat. This inequality is more pronounced in the U.S. compared with other countries, Moodyâ\u0080\u0099s said. â\u0080\u009cThe unequal position of the Black community in the U.S. is a salient and persistent feature of the inequality dynamic that exemplifies and exacerbates credit-relevant social risks,â\u0080\u009d Moodyâ\u0080\u0099s wrote. Read:Should Black and Latino people get priority access to a COVID-19 vaccine? These inequalities donâ\u0080\u0099t just hurt members of the Black community, but the U.S. as a whole. Moodyâ\u0080\u0099s cites McKinsey & Co. data that shows lowering the racial wealth gap could raise the GDP by 4%-to-6% by 2028 and lift GDP per capita by $4,300. â\u0080\u009cA disproportionate share of income vested in wealthier households with a lower marginal propensity to consume lowers aggregate demand,â\u0080\u009d the Moodyâ\u0080\u0099s report said. â\u0080\u009cA larger share of low-income households less able to accumulate physical and human capital, including through educational attainment, lowers economy-wide labor productivity.â\u0080\u009d This is exacerbated by the â\u0080\u009crelatively shallow social safety netâ\u0080\u009d that the U.S. has, the report says. See:Opinion: The racial wealth gap is at the heart of Americaâ\u0080\u0099s inequality High inequality is also driving a lack of good governance. American institutions have weakened in recent years because of increased polarization, Moodyâ\u0080\u0099s says. â\u0080\u009cAnd there is a rising tension within the U.S. credit profile arising from the growing need for policymakers to act to contain the ongoing erosion of the sovereignâ\u0080\u0099s fiscal strength, and the inertia with respect to that erosion stemming from increased political polarization,â\u0080\u009d the report says. Moodyâ\u0080\u0099s notes that the credit risk to the U.S. isnâ\u0080\u0099t immediate, but weâ\u0080\u0099ve seen the social risk in the form of the massive protests in response to the killing of George Floyd in May at the hands of the police. Though issues tied to policing were at the heart of the protests, analysts say other aspects of racial inequality that have been around for a long time were tied to the demonstrations as well. Also:Black homeownership has declined since 2012 -- hereâ\u0080\u0099s where Black households are most likely to be homeowners â\u0080\u009cWhile there are indeed many social and economic issues that have contributed to the U.S.â\u0080\u0099 increased political polarization in recent years, looking ahead, the combination of income and racial inequality is set to be a potent force for further potential polarization and inertia,â\u0080\u009d Moodyâ\u0080\u0099s wrote. The Dow Jones Industrial Average DJIA, +0.56% Â Â is down 6.5% for the year so far. And the S&P 500 index SPX, +0.87% Â is about breakeven."}]}