{"article": [{"url": "https://www.marketwatch.com/story/delta-air-stock-slips-after-wider-than-expected-loss-2020-07-14", "published": 1594712840.0, "headline": "Delta Air stock slips after wider-than-expected loss", "body": "Delta Air Lines Inc. DAL, +0.39% stock fell nearly 1% in Tuesday premarket trading after the airline reported second-quarter losses that were wider than expected. Delta's net loss was $5.72 billion, or $9.01 per share, after net income of $1.44 billion, or $2.21 per share, last year. Adjusted losses were $4.43 per share. The FactSet consensus was for a loss of $4.16. Revenue totaled $1.47 billion, down from $12.54 billion last year but ahead of the FactSet consensus for $1.39 billion. Passenger revenue for the quarter fell 94% to $678 million, and cargo revenue was down 42% to $108 million. \"Given the combined effects of the pandemic and associated financial impact on the global economy, we continue to believe that it will be more than two years before we see a sustainable recovery,\" said Delta Chief Executive Ed Bastian in a statement, emphasizing the \"staggering impact of the COVID-19 pandemic on our business.\" Delta ended the quarter with $15.7 billion in liquidity, and reduced its daily cash burn in June by 70% compared to late March, down to an average of $27 million. And the company has gotten $5.4 billion in grant funds and unsecured loans through the CARES Act, which will be paid in installments through July 2020. Maturities on $1.3 billion in borrowings on revolving credit facilities have been extended to 2022 from 2021. Delta has taken additional sanitation steps in the face of the coronavirus pandemic, has limited load factor at 60% and is blocking off middle seats. The company has provided more than $2.2 billion in cash refunds in 2020. Delta is positioning itself to be a smaller airline over the next couple of years, retiring MD-88 and other planes, and reducing headcount through early retirement and other programs. The company is also accelerating airport construction projects in New York's LaGuardia Airport, in Los Angeles and other cities. At the end of the quarter, the company had total debt and finance lease obligations of $24.6 billion. Delta took a write down of $1.1 billion on its investment in LATAM Airlines and a write down of $770 million on its investment in AeroMexico after those companies' losses and bankruptcy filings. The company took a $200 million write down in its investment in Virgin Atlantic, a $200 million charge. Delta stock has fallen 54.1% for the year to date while the Dow Jones Industrial Average is down 8.6% for the period."}]}