{"article": [{"url": "https://www.marketwatch.com/story/new-york-gyms-can-reopen-on-aug-24-at-33-capacity-with-mandatory-masks-2020-08-17", "published": 1597681520.0, "headline": "New York gyms can reopen on Aug. 24 at 33% capacity with mandatory masks", "body": "Gyms and fitness studios can reopen across New York state as early as Aug. 24 if they pass safety inspections and follow strict health guidelines, Gov. Andrew Cuomo announced in a news conference Monday morning. Capacity will be limited to 33%, and guests will be required to wear masks at all times. Exercise facilities will also be required to have sign-in sheets to facilitate contact tracing, and HVAC systems with Minimum Efficiency Reporting Value (MERV) ratings of at least 13 to improve air quality and minimize potential spread. Local authorities will be responsible for inspections in advance of reopenings, as well as determining whether gyms will be allowed to open for group fitness classes. “Gyms are one of the areas where you have to be very careful; that’s why we went slow on [reopening],” Cuomo said. The announcement comes less than a week after a group of more than 1,500 gym owners filed a class-action lawsuit against Cuomo, New York state, and the state attorney general in a bid to push for reopenings. Also on MarketWatch: New York City is ‘dead forever,’ according to this proud New Yorker In light of the reopening announcement, the class action lawsuit will be dismissed, but a $500 million damages claim against the state is moving forward, Charlie Cassara, founder of the New York Fitness Coalition, the group behind the lawsuit, told MarketWatch. “The $500 million takings claim, that’s for not letting us reopen. We were kicked out of Phase 4 [of reopening],” Cassara said. “That’s not going away.” (Both indoor dining and gyms were initially included in phase 4 reopening plans for New York City before being put on pause indefinitely as outbreaks worsened nationwide. While indoor dining has opened in other regions of New York, exercise facilities have remained closed across the state.) Cassara also expressed concern over details not yet outlined in the plan, including how local authorities will determine which ventilation systems are up to par, and what will constitute a group fitness class. Cuomo “didn’t address mixed martial arts, hot yoga, or boxing. There’s nothing up on the website, and the local municipalities have no plan whatsoever. There’s no one to help us answer these questions,” Cassara said. “I’m happy, but we’re still a little confused.” Read: Is it safe to go back to the gym if you’re over 50? The reopening plan requires local authorities to inspect gyms before or within two weeks of reopening. If local authorities choose, they can delay the reopening in their areas until Sept. 2, and conduct inspections within two weeks of that date. They may also push back the reopening of group fitness classes. (Mayor Bill de Blasio’s office did not immediately respond to requests for comment on inspection plans.) “We’re very proud of where the overall infection rate is, but the flip side of the scale is that you need to get the economy back up and get life moving forward,” Cuomo said. “That’s why we’re giving localities an extra week. They have to inspect the gyms. We just went through this with bars and restaurants.” In the restaurant industry, State Liquor Authority officials are still conducting frequent inspections. They issued 66 violations after inspecting 3,375 bars and restaurants over the weekend. Coronavirus update: U.S. death toll tops 170,000 as more states see new cases rise Addressing concerns over allowing gyms to reopen while indoor dining is still on hold in the city, Secretary to the Governor Melissa de Rosa said, “In gyms, we’re requiring masks at all times. Whereas indoor dining, by definition, [masks come off]. And the State Liquor Authority found that in bars, people were drinking, standing, co-mingling, letting their guard down.” Other New York developments: New York state’s infection rate was 0.71% on Sunday, the lowest it’s been since the start of the pandemic. The three-day-average daily death toll was six, compared with 763 at the virus’ apex. In New York City, murders are up 29% and shootings are up 79% year-to-date, and “over 90% of victims are Black and brown New Yorkers,” Cuomo said. Citing recent protests and demands for police reform, Cuomo is calling for “reimagined” police departments that address concerns over police conduct while effectively keeping crime rates low, and has sent a letter to 500 jurisdictions demanding urgent action. “I’m saying in the letter today that if you don’t have a plan that is a reimagined police department for next April, there will be no state funding for that jurisdiction,” Cuomo said. “I’m trying to force attention and focus and action on this issue.” Read next: New York said ‘action,’ but many film and TV cameras won’t get rolling until September or later"}]}