{"article": [{"url": "https://www.marketwatch.com/story/top-us-coronavirus-testing-official-says-fauci-is-not-100-percent-right-2020-07-12", "published": 1594585820.0, "headline": "Top U.S. coronavirus testing official says Fauci â\u0080\u0098is not 100 percent rightâ\u0080\u0099", "body": "The countryâ\u0080\u0099s top testing official said Dr. Anthony Fauci, who has suggested states should pause reopening where coronavirus cases are spiking, is â\u0080\u009cnot 100 percent right.â\u0080\u009d â\u0080\u009cI respect Dr. Fauci a lot, but Dr. Fauci is not 100 percent right, and he also doesnâ\u0080\u0099t necessarily, he admits that, have the whole national interest in mind,â\u0080\u009d Adm. Brett Giroir said Sunday on NBC Newsâ\u0080\u0099 â\u0080\u009cMeet the Press.â\u0080\u009d â\u0080\u009cHe looks at it from a very narrow public health point of view.â\u0080\u009d Host Chuck Todd asked Giroir, the testing coordinator at the Department of Health and Human Services, about a Washington Post report that said Fauci has argued states with spikes should shut down again. Giroir said he doesnâ\u0080\u0099t â\u0080\u009cthink we need to shut downâ\u0080\u009d again â\u0080\u0094 â\u0080\u009cat least in most places around the countryâ\u0080\u009d but suggested Americans â\u0080\u009cavoid barsâ\u0080\u009d and â\u0080\u009cwear a mask in public.â\u0080\u009d Trump last week said Fauci, the countryâ\u0080\u0099s top infectious disease expert, has â\u0080\u009cmade a lot of mistakes.â\u0080\u009d â\u0080\u009cDr. Fauci is a nice man, but heâ\u0080\u0099s made a lot of mistakes,â\u0080\u009d Trump told Fox Newsâ\u0080\u0099 Sean Hannity. â\u0080\u009cA lot of them said donâ\u0080\u0099t wear a mask, donâ\u0080\u0099t wear a mask. Now they are saying wear a mask. A lot of mistakes were made, a lot of mistakes.â\u0080\u009d Giroir also said the White House coronavirus task force openly discusses all options, batting back claims that members are being sidelined if they have opposing views. â\u0080\u009cI want to just put this to rest. There is complete, open, honest discussion within the task force. Task force meets three to four times a week,â\u0080\u009d he said, adding that Vice President Pence regularly calls him. â\u0080\u009cI feel absolutely free saying anything to the vice president within those rooms. The vice president, I know, briefs the president on a daily basis. So nobody feels like anything is held back. We all take this as a serious crisis. Itâ\u0080\u0099s got to be science driving the policy. And thatâ\u0080\u0099s the way it is,â\u0080\u009d Giroir said. This report originally appeared on NYPost.com."}]}