{"article": [{"url": "https://www.marketwatch.com/story/us-september-job-report-is-going-to-show-economy-entering-a-weaker-phase-2020-09-26", "published": 1601289920.0, "headline": "U.S. September job report is going to show economy entering a weaker phase", "body": "American households are used to television dramas where difficult problems are resolved in one hour, or perhaps eight one-hour episodes on Netflix. So it is with the economy, and there is a growing perception the U.S. economy has been suffering for long enough that the worst must be behind us. Gregory Daco, chief U.S. economist at Oxford Economics, said he routinely comes across people now who think the economy is out of the woods, given that the unemployment rate has dropped to 8.4% a peak of 15%. They don’t seem to realize that the unemployment rate is still higher than the peak unemployment rate of prior recessions, Daco said, in an interview. The fact is that even after what has been a fairly strong first phase of recovery, the economy has only recovered to reach levels close to the worst part of the 2008-2009 financial crisis, he added. The economy now is closer to the gnarly 2009 period than the slow but steady recovery of 2014-2016. “I think that is often times an eye opener for clients,” he said. Daco said the September jobs report from the U.S. Labor Department due this coming Friday will signal the economy is entering a critical phase, with less assistance from government and a number of uncertainties from the November elections, the coronavirus pandemic, and uncertain financial markets. “There are a number of risks and we are going into the fall without much insulation,” he said. Economists surveyed by MarketWatch expect the economy added 810,000 jobs in September, down from 1.37 million in the prior month. The unemployment rate is expected to drop to 8.2% from 8.4% in August. Daco is forecasting a sharper slowdown to a gain of 600,000 jobs. He sees the unemployment rate dipping to 8%, but due in part to workers giving up looking for work and dropping out of the labor force. While 600,000 jobs would be considered strong in an ordinary environment, it is not strong enough to put a dent in the 11 million Americans who have lost jobs during the pandemic and millions more who are underemployed, he said. “I continue to view the glass as half-empty. We’re still a long ways from where we were pre-Covid,” Daco said. Richard Moody, chief economist at Regions Financial Corp., thinks it may be hard to gauge the strength of the September report given the technical cross-currents in the data. September is usually the month that summer vacation resort employment declines as the season ends, and without those job losses this year, the reported gain might look stronger. In addition, there was also a decline in temporary census workers in the month that may skew the data to the downside. The job report will be released Friday at 8:30 a.m. Eastern on October 2. There will also be critical data during the week on the manufacturing sector for September from IHS Markit and ISM on Thursday, and on consumer spending and inflation for August."}]}