{"article": [{"url": "https://www.marketwatch.com/story/ann-taylor-parent-joins-other-retailers-that-have-recently-filed-for-bankruptcy-here-are-a-few-things-they-have-in-common-2020-07-23", "published": 1595607440.0, "headline": "Ann Taylor parent joins other retailers that have recently filed for bankruptcy. Here are a few things they have in common.", "body": "Ascena Retail Group Inc. is the latest retail company to join a growing list of those filing for bankruptcy during the COVID-19 pandemic. That list includes Brooks Brothers and J.Crew. Though the names may change, there are some factors that these companies have in common going into a chapter 11 filing. “Of the retailer bankruptcy filings so far, the common denominators have been lack of e-commerce scale and capability, largely mall-based locations, narrow breadth of assortments (e.g. apparel-only, home-only), and, in seven of the 19 filings, private-equity owned enterprises that were overly burdened with debt,” said Margaret Reid, senior portfolio manager at the private bank at Union Bank. Many of these factors pre-date the coronavirus pandemic which closed shops across the country. For example, the pandemic has accelerated the consumer shift to online shopping, which began even before the illness spread. And malls were struggling to attract foot traffic, especially as more retailers shuttered operations in the worst performing locations. Read:Macy’s, Kohl’s suffer as brands, competitors and e-commerce step in to replace department stores COVID-19 and related business lockdowns have only intensified the problems of ailing retailers, and the near future isn’t much brighter despite shops reopening in many states aid by government financial help. “With that stimulus running out, excess inventory across retail channels, a critical back-to-school shopping season likely at risk, and increased consumer adoption of e-commerce, it’s likely bankruptcy filings will only increase throughout 2020,” Reid said. The retailers and brands that survive, and even excel through the pandemic crisis, are those that provide the convenience that customers want, and have the means to adjust and progress through the rapidly changing environment. “The overall trend of the US consumer willing to spend for value and convenience prior to COVID has only accelerated by the crisis, therefore those companies that have been positioned to deliver value and convenience – Target, Walmart, Costco – are likely to be gaining market share coming out of this as the economy reopens,” said Reid. See: The back-to-school shopping season will be a ‘dud’ one analysts says, but the NRF is forecasting a record breaker Though Ascena US:ASNA still has notable names like Ann Taylor in its portfolio, it was also dragged down by a number of brands that had fallen out of favor with shoppers. “We have long held the view that although Ascena has a good track record of making various brand acquisitions work financially, its record on developing those brands has been far less impressive,” wrote Neil Saunders, managing director at GlobalData Retail, in a note. “The results of this have already been seen with the closure of once popular staples like Dressbarn and the sale of a majority stake in Maurices.” A significant number of the company’s Justice stores will close and certain Ann Taylor, LOFT, Lane Bryant and Lou & Grey stores will cease operation, including all of the locations in Puerto Rico, Canada and Mexico. All of the company’s plus-size Catherines stores will shutter. “Within the current portfolio there is exposure to weaker retail locations, so a pruning of the fleet makes sense from the perspective of getting rid of shops that are unlikely to deliver sales and profit growth,” Saunders said. “This is especially so as more sales migrate online.” Also:Brooks Brothers files for bankruptcy as its take on office gear falls out of step with more casual trends Ascena has $150 million in funding from existing lenders and expects that sum combined with cash flow generated by ongoing operations and cash on hand to be sufficient to meet its needs. “The company has some key strengths, among them the support of lenders and the ability to renegotiate commercial leases, but will have to close an enormous percentage of its stores and leave the international market aside, focusing entirely on domestic retail sales,” said Jon Pasternak, bankruptcy partner at Davidoff Hutcher & Citron LLP. “Ascena will most likely emerge as a smaller, leaner, and meaner brand conglomerate that will look very different from the massive multinational corporation that existed until now.” Surviving bankruptcy under tough coronavirus-affected conditions is only the beginning of Ascena’s journey back to stable financial ground. Don’t miss:These investors are sticking with retail despite the ‘apocalypse’ “The coronavirus pandemic exacerbated Ascena’s persistent execution problems and challenges as a mid-priced player in the highly competitive apparel retail sector, adding to the growing list of retail bankruptcies in 2020,” said Raya Sokolyanska, vice president at Moody’s Investors Service. “The elimination of a significant portion of interest payments and the new financing will provide liquidity, but significant challenges remain as Ascena contends with both near-term disruption and long-term pressures in the space.” Ascena stock plummeted 25.7% on Thursday following news of the bankruptcy filing. The SPDR S&P Retail ETF XRT, +0.05% has gained 0.5% for the year to date. The Amplify Online Retail ETF IBUY, +1.39% has rallied 48.3%. And the S&P 500 index SPX, +0.87% has edged down 0.5% Additional reporting by Ciara Linnane."}]}