{"article": [{"url": "https://www.marketwatch.com/story/why-social-security-and-medicare-recipients-could-fall-further-behind-in-2021-2020-10-07", "published": 1602162620.0, "headline": "The COLA increase for next year doesn't look good", "body": "For the 64 million Americans who get Social Security, it's one of the most anticipated announcements each year: How much their cost-of-living adjustment (COLA) will go up for the next year. For 2021, it's not likely to be much: Perhaps as little as 1.3%. That would lift the average monthly benefit, currently $1,503, to $1,522 and change. Meantime, disabled workers and their dependents would see a similar increase, raising their average monthly benefit to $1,274. Read: How rich is the middle class? The estimate comes from the The Senior Citizens League (TSCL), a Washington-based nonprofit group that tracks issues of concern to older Americans. \"The 1.3% estimate is based on the same methodology used by the Social Security Administration itself,\" says Mary Johnson, a Social Security and Medicare policy analyst for the TSCL. 80% of older Americans can't afford to retire - COVID-19 isn't helping \"We take the 12-month average rate of inflation,\" Johnson says, \"using data from September 2019 through August 2020 and dividing it by 12, and that's what we get.\" She's quick to add that it's a bit more complicated than that. Inflation in the third quarter (July through September) is also compared with third quarters in prior years-using something known as \"CPI-W\"-the Consumer Price Index for Urban Wage Earners and Clerical Workers. This is the same formula that the Social Security Administration itself uses, and that's how the 1.3% estimate is calculated. Read: Half of Americans over 55 may retire poor A bit complicated perhaps, and if you think it sounds chintzy-as many seniors do-you're probably right. One reason this is so is because CPI-W reflects prices paid by working adults under the age of 62 (before the minimum Social Security eligibility age) and places greater weight on things like gasoline and electronics and less weight on things like medical expenses. Read: The problem with 'aging in place' This generally doesn't reflect true spending habits of seniors. Older Americans, far more likely to be out of the workforce, drive less, for example. In terms of electronics, my guess is most aren't buying a lot of X-Boxes and big screen TVs, either. But medical expenses? This, obviously, is a sizable and growing chunk of senior spending. But when it comes time to calculate Social Security's cost-of-living increase each year, it's underrepresented. Consider just two huge expenses that seniors have to cope with: rising drug prices and Medicare Part B premiums. Pharmaceutical companies have jacked up drug prices on more than 800 occasions this year, according to GoodRx, which tracks prices that Americans pay. It says the average cost of 42 key medicines has already gone up 3.3% this year. Read: This 70-year-old supersaver has a new habit: spending like crazy As for Medicare Part B premiums (which helps cover medical expenses, such as doctor's services, outpatient services and other medical supplies), they rose nearly 7% in 2020, to $144.60 a month. Deductibles also rose about 7% this year to about $198. How much could these things go up in 2021? The Medicare trustees forecast back in April that the standard 2021 Part B premium could rise 6% next year to $153.30. Their report added, however, that the long-term impact of the coronavirus was unknown (it still is), which makes forecasting more difficult. But seniors can be sure of this: Both premiums and deductibles are going higher, and by the looks of things, these increases will be well beyond whatever increase they'll get from Social Security. The bottom line: Seniors, who lost ground to inflation in 2020, are likely to lose even more ground in 2021. This has hardly escaped their attention, says Johnson, who says her in-box is full of angry emails from seniors. \"People are getting angry,\" she says. \"These low COLAs aren't anywhere near what they need to be.\" I've mentioned in this space before that when this awful year began, some 15 million Americans aged 62 and over were living in poverty. This could explode some 67% over the next decade to nearly 25 million, according to a study by the Retirement Equity Lab (ReLab) at New York's The New School. At the time, ReLab economics professor Teresa Ghilarducci told me that \"We have to be honest about the likely reality: Millions of older Americans are going to have to accept austerity and a drop of living standards.\" That's an assessment that Johnson agrees with. Rising costs that are outstripping what tens of millions of seniors receive each month is having a \"deep and profound impact on them;\" she adds this negative trend will continue unless and until the government recalibrates the true cost of living for them. Have a comment or question about anything you've read here-or retirement in general? Please email me: RetireBetterMarketWatch@gmail.com."}]}