{"article": [{"url": "https://www.marketwatch.com/story/florida-man-charged-with-brandishing-assault-style-weapon-and-threatening-us-census-worker-2020-10-08", "published": 1602230120.0, "headline": "Florida man charged with brandishing assault-style weapon and threatening U.S. Census worker", "body": "BUNNELL, Fla. (AP) — A Florida man was arrested for using an assault-style weapon to threaten a census taker who had come to his house for the nationwide count of every U.S. resident. Michael Cooper, 32, was arrested Monday after threatening census taker Johnny Swinney, according to a police report. Neighbors told deputies that Swinney’s U.S. Census Bureau badge was clearly identifiable when he approached Cooper sitting on the porch of his home and the census taker identified himself as a federal worker, according to an incident report. Booking photo of Michael Cooper provided by the Flager County, Fla., sheriff's office. Associated Press Cooper yelled at Swinney to leave, went into his home and returned with an assault-style weapon. He loaded the chamber and Swinney returned to his vehicle, where his wife was. His wife, Nicole, told deputies that she saw Cooper pointing his weapon at her husband’s back as he walked away from the house. Once in the vehicle, they heard a shot fired in an unknown direction, according to the incident report. Cooper told deputies that Swinney was trespassing and that he didn’t see an identification badge. He said he shot a round into the ground because he didn’t want to leave it in the chamber. Cooper is facing a charge of aggravated assault with a deadly weapon without intent to kill. No lawyer was listed for him on an online court docket. Jail records showed Cooper being held on a $7,500 bond at the Flagler County Jail on Tuesday. In response to an email inquiry, the Census Bureau said it was checking on how many threats have been made against census takers during the 2020 count. Hundreds of thousands of census takers have been sent to homes that haven’t yet responded to the 2020 census either online, by mail or telephone. The head count, which determines how many congressional seats each state gets and how $1.5 trillion in federal funding is distributed annually, is set to end at the end of the month. Read on:Census Bureau says it’s complying with order to keep counting, but complaints continue to pile up from workers"}]}