{"article": [{"url": "https://www.marketwatch.com/story/debt-from-att-and-other-corporate-giants-saw-biggest-purchases-from-the-fed-2020-06-28", "published": 1593356540.0, "headline": "Debt from AT&T and other corporate giants saw biggest purchases from the Fed", "body": "The Federal Reserve unveiled on Sunday further details of an emergency lending program buying corporate debt, showing which U.S. businesses have benefited from its unprecedented measures to support the flow of credit in the economy. Through its lending facilities, the Fed is buying individual corporate bonds from the market in amounts in line with an index of its own construction, which would eventually see the central bank snap up a large cross-section of U.S. investment-grade and some sub-investment-grade debt. Bonds from these companies were the 10 biggest beneficiaries as of June 17. Issuer Purchase amount ($) AT&T 16,476,295.05 UnitedHealth Group 16,451,866.25 Comcast 13,315,346.67 Anthem 12,937,095.56 Walmart 8,758,531.52 Constellation Brands 8,465,435.00 Ford 8,051,573.33 CVS Health 7,762,008.33 Boeing 7,648,612.66 AbbVie 7,394,459.72 It’s early days, so the Fed’s biggest purchases don’t line up neatly with the biggest constituents of the bond-market index. The six biggest constituents of the Fed’s new debt index are Toyota, Volkswagen, Daimler, AT&T, Apple and Verizon Communications, yet only AT&T T, -1.01% made the top 10 list of purchases. These differences are expected to be ironed out over time as the central bank snaps up more debt. The Fed has purchased 119 bond issues in the two days of trading as of June 17, even as the index is made up of 794 issuers. The discrepancy between the Fed’s purchases and the index underpinning the central bank’s bond buying is also reflected in how the share of credit ratings of the bonds purchased differ with the proportion of ratings reflected by the Fed’s debt benchmark. For example, around 54.8% of the bonds included in the Fed’s broad market index carry a credit rating of triple-B, the biggest but lowest letter rating in the investment-grade bond market. But 48.3% of the bonds bought through the Fed’s secondary credit facility, however, sport a rating of triple-B. For the week, the Dow Jones Industrial Average DJIA, +0.56% lost 3.3%, the S&P 500 SPX, +0.87% notched a 2.9% decline, and the Nasdaq COMP, +1.39% fell 1.9% for the period."}]}