{"article": [{"url": "https://www.marketwatch.com/story/heated-congressional-hearing-raises-questions-about-coronavirus-testing-capacity-protests-trumps-messaging-2020-07-31", "published": 1596280160.0, "headline": "Heated congressional hearing raises questions about coronavirus testing capacity, protests, Trumpâ\u0080\u0099s messaging", "body": "Lawmakers on both sides of the aisle on Friday sparred with public health officials over the Trump administrationâ\u0080\u0099s response to the COVID-19 pandemic: the administrationâ\u0080\u0099s sometimes conflicting public-health messages for the public, lagging testing times, and the economic downturn were all in question. The House Select Subcomittee on the Coronavirus Hearing was intended to focus on the need for a national plan for the pandemic. However, much of the debate focused on comments made by President Donald Trump about the virus and an increasingly widening line between Republicans, who want to see schools and workplaces reopen, and Democrats who are concerned about the administrationâ\u0080\u0099s response to the public health crisis. Drs. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, Centers for Disease Control and Prevention (CDC) director Robert Redfield, and Health and Human Services assistant health secretary Brett Giroir testified. On testing: Giroir provided testimony that it is not currently possible to return COVID-19 diagnostic test results to Americans within 72 hours. â\u0080\u009cIt is not a possible benchmark we can achieve today, given the demand and supply,â\u0080\u009d he said. During the hearing, the National Institutes of Health said it would spend about $250 million to support development of new tests that the government agency says will help increase the â\u0080\u009cnumber, type, and availability of tests by millions a week.â\u0080\u009d The U.S. has conducted more than 54.6 million tests but there are still anecdotes about lagging wait times for test results. On business reopening: Fauci said multiple times that he believes the U.S. response was hampered by a reopening plan that happened earlier than it did in Europe. The European Union â\u0080\u009creally did it to the tune of about 95-plus percent...We really functionally shut down, only about 50%... We plateaued at about 20,000 cases, a day. So, we started off with a very difficult baseline of transmission that was going on at the time that we tried to open up the country.â\u0080\u009d On Trumpâ\u0080\u0099s comments about the coronavirus: Rep. Jamie Raskin (D-Md.) asked Fauci a number of pointed questions about the virus and treatments based on comments made by Trump, his son Eric Trump, and Rep. Louie Gohmert (R-Texas). Raskin: â\u0080\u009cAre children almost immune to the disease?â\u0080\u009d Fauci: â\u0080\u009cDo children get infected? Yes, they do.â\u0080\u009d Raskin: â\u0080\u009cIs COVID-19 going to magically disappear?â\u0080\u009d Fauci: â\u0080\u009cI do not believe it would disappear because itâ\u0080\u0099s such a highly transmissible virus.â\u0080\u009d Raskin: â\u0080\u009cDoes wearing a mask give people COVID-19? Fauci: â\u0080\u009cNo.â\u0080\u009d Raskin: â\u0080\u009cIs COVID-19 a hoax?â\u0080\u009d Fauci: â\u0080\u009cNo.â\u0080\u009d Raskin: â\u0080\u009cShould people take hydroxychloroquine as a cure for COVID-19?â\u0080\u009d Fauci: â\u0080\u009cThe overwhelming cumulative evidence of properly conducted randomized controlled trials indicates no therapeutic efficacy.â\u0080\u009d Raskin: â\u0080\u009cCan people cure themselves of COVID-19 by injecting themselves with disinfectant or bleach?â\u0080\u009d Fauci: â\u0080\u009cNo.â\u0080\u009d On whether the Black Lives Matter protests led COVID-19 infections: Rep. Jim Jordan (D-Ohio) sparred with Fauci over a question asking him if the protests had contributed to the increase of U.S. cases when they began in early June. Fauci declined to comment on whether people should protest, saying â\u0080\u009cIâ\u0080\u0099m not in a position to determine what the government can do in a forceful wayâ\u0080\u009d, but he noted that spending time in crowds of any kind, especially when not wearing a mask, is risky. A working paper by the National Bureau of Economic Research that was published in June found the protests did not lead to â\u0080\u009cCOVID-19 caseâ\u0080\u009d growth in the three weeks after the protests began. The paper was later entered into the record."}]}