{"article": [{"url": "https://www.marketwatch.com/story/biden-advantage-heres-what-market-analysts-are-saying-about-a-chaotic-presidential-debate-11601465869", "published": 1601471480.0, "headline": "Biden advantage? Here's what market analysts are saying about a chaotic presidential debate", "body": "Wall Street waits on the U.S. election bryan r. smith/Agence France-Presse/Getty Images The day after what many are calling a chaotic and contentious presidential debate, analysts are nose to the grindstone, trying to figure out what, if anything, it means for markets and the coming election. U.S. stock futures YM00, +0.82% ES00, +1.13% NQ00, +1.63% fell on Wednesday, with European stocks SXXP, +0.55% also dropping, as investors reeled from the back-and-forth arguing between incumbent President Donald Trump and Democratic contender Joe Biden, which never managed a proper debate on the key topics. Stocks may be playing into history's hands for Wednesday. On average, going back to 1960, the S&P 500 has tended to fall the day after an election. Returns have also been lower in the 5-day, 10-day, and one-month period. Here's a round up of what analysts on Wall Street and elsewhere are saying about that exchange: \"Perhaps the only point worth mentioning is that the debate may have increased expectations for a contested election result. International investors have been prepared to entertain some extreme views on this topic (just as they entertained extreme views on the future of the euro area in the past). Given the importance of international investors to U.S. markets, this may add volatility around the election.\" - Paul Donovan, chief economist at UBS Global Wealth Management. \"Trump's particularly aggressive style last night might play well with parts of his base, but his less committed 2016 voters, like independents and suburban women, might not be so keen on it. Initial post-debate polling has found Biden was seen as the marginal winner, but it will be interesting to get more extensive reaction broken down by demographic group.\" - Stephanie Kelly, senior political economist at Aberdeen Standard Investments. \"On the margin, Trump's more assertive stance, and Biden's measured responses, may have exacerbated some voter concerns over Biden's age. That said, we believe the debate probably did not shift enough voters to change the current base case of Biden winning in November.\" - Team of Nomura economists led by Lewis Alexander. \"The first presidential debate doesn't mean anything for markets. It only served to reinforce the hopes and aspirations and assumptions of the bases of each respective candidate. While it was not a good night for President Trump, the one encouraging thing for markets may be that Joe Biden seemed to want to slightly tilt away from his base, separating himself from the Bernie Sanders health care plan and the Green New Deal.\" - David Bahnsen, chief investment officer at The Bahnsen Group. \"If last night's Presidential debate was supposed to inform and educate, all it did was merely confirm the credibility deficit in U.S. politics, as President Trump, and Democrat nominee Joe Biden engaged in what can only be described as a fact-free name-calling contestâ\u0080¦ the fractious nature of last night's so-called debate raises questions as to the outcome of next month's election, as well as the prospect of an imminent stimulus deal.\" - Michael Hewson, chief market analyst at CMC Markets. \"In a raucous debate that was indeed full of shouting, it is unclear that either President Trump or Vice President Biden changed the trajectory of the election last nightâ\u0080¦There was very little substance in the debate and almost no new information proffered. The story of the debate will likely surround the president's consistent interruption, though Mr. Biden was not able to stay above the fray and traded insults at times with Mr. Trump. Acrimony ruled.\" - Deutsche Bank strategists Jim Reid, Craig Nicol and Henry Allen. \"Pollsters point toward a potential Biden gain in the polls following yesterday's debate with Donald Trump, with the president's erratic style likely helping Biden to shift the focus away from his often lackluster memory and debating abilities. With less than five weeks left until the election, we are seeing a president that increasingly speaks of voter fraud, which appears to show a candidate laying the groundwork for defeat.\" - Joshua Mahony, senior market analyst at IG. \"U.S. equity futures displayed considerable volatility during the presidential debates overnight, first spiking slightly higher before falling sharply later after the end of the debate, perhaps as Biden put in a sharper performance than expected in what was deemed a chaotic debate, making it less likely that his considerable lead in the polls will falter in the end run into the election.\" - John J. Hardy, head of FX strategy at Saxo Bank. \"This debate has had only a marginal impact on voters and failed to land a decisive blow on the lead of Joe Biden. The odds are that the same will happen in the next two but again Joe Biden's lead remains at risk.\" - Sebastien Galy, senior macro strategist at Nordea Asset Management."}]}