{"article": [{"url": "https://www.marketwatch.com/story/as-british-schools-set-to-reopen-boris-johnson-urges-parents-to-let-kids-return-to-classes-2020-08-23", "published": 1598210660.0, "headline": "As British schools set to reopen, Boris Johnson urges parents to let kids return to classes", "body": "LONDON — Britain’s prime minister is asking parents to set aside their fears and send their children back to school next month when schools in Britain fully reopen for the first time since the coronavirus pandemic shut then down more than five months ago. Prime Minister Boris Johnson said it was the government’s “moral duty” to reopen the schools as he stressed that authorities now know more about COVID-19 than they did when the country went into lockdown on March 23. Johnson’s comments came hours after Britain’s top public health officials issued a joint statement saying that children were more likely be harmed by staying away from school than from being exposed to COVID-19. “This is why it’s vitally important that we get our children back into the classroom to learn and to be with their friends,’’ Johnson said in a statement released late Sunday. “Nothing will have a greater effect on the life chances of our children than returning to school.” The statements come as parents and teachers have express concerns about reopening schools amid fears that social distancing measures won’t keep children safe. Unions have demanded that Johnson’s Conservative government make sure that social distancing measures and other protective procedures are in place to ensure the safety of students and staff. Schools across the U.K. closed in March as the government sought to control the spread of coronavirus. Some students were allowed to return in early June, but classes weren’t mandatory and only about 18% of students nationwide took part. The chief medical officers of England, Scotland, Northern Ireland and Wales said in their statement that children are less likely to catch COVID-19 than adults and they have “an exceptionally low risk’’ of dying from the disease. By contrast, they said studies show that not going to school limits children’s ability to succeed in life and may worsen physical and mental health problems. “Very few, if any, children or teenagers will come to long-term harm from COVID-19 due solely to attending school,’’ the medical officers said. “This has to be set against a certainty of long-term harm to many children and young people from not attending school.’’ Britain has the highest confirmed virus-related death toll in Europe, at 41,515 people, and Johnson’s government has been strongly criticized for not locking down sooner, not getting medical workers enough protective equipment and not properly protecting the elderly in care homes from the virus. Thousands of British travelers had to cut short vacations and rush home earlier this month after the government abruptly announced it was slapping 14-day quarantines on people returning from France."}]}