{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-up-nearly-350-points-as-vaccine-hopes-rise-and-investors-await-more-earnings-2020-07-15", "published": 1594831520.0, "headline": "Dow ends 228 points higher as vaccine optimism outshines rising coronavirus cases", "body": "U.S. stock indexes closed modestly higher on Wednesday, as investors focused on COVID-19 vaccine hopes and early signs of an upswing in business activity during the pandemic. Investors also bid equities higher as the first few corporate earnings reports for the second quarter have come in better than expected, even as the number of coronavirus cases rise in many U.S. states. What did major indexes fare? The Dow Jones Industrial Average DJIA, +0.56% advanced 227.44 points, or 0.9%, to end at 26,870.03, after briefly rising as high as 27,071.33 at the start of the session. The S&P 500 index SPX, +0.87% rose 29.04 points, or 0.9%, to close at 3,226.56, or 0.1% away from erasing its year-to-date losses. The Nasdaq Composite COMP, +1.39% finished 61.91 points higher, or 0.6%, at 10,550.49. The Dow on Tuesday gained 556.79 points, or 2.1%, to end at 26,642.59, while the S&P 500 advanced 42.30 points to finish at 3,197.52, a gain of 1.3%, as energy shares and materials shares rallied. The Nasdaq Composite index closed with a gain of 97.73 points, or 0.9%, to settle at 10,488.58. Year-to-date, the Dow is down 1668.34 points or 5.85%(rounded), while the S&P 500 is down 4.22 points or 0.13% but the Nasdaq Composite is up 1577.89 points or 17.59%.What drove the market U.S. stock indexes finished higher Wednesday, as investors focused on the race for a coronavirus vaccine and a modest upswing in business activity during the pandemic, rather than rising cases of the deadly virus. “It’s this big tug-of-war, basically between the recovery and reclosing,” Mike Bailey, director of research at FBB Capital Partners, told MarketWatch. “Today is a vaccine day for sure. And that’s a marginal win for the bulls, but a big pushback is valuations,” he said. “Investors are concerned that we are way too high, relative to the economy.” The Federal Reserve reported on Wednesday that economic activity increased in nearly all its districts from its prior report in May, but still was far below levels prior to the COVID-19 pandemic, according to the anecdotal account of business activity in the central bank’s regions, referred to as the Beige Book. Business owners also said they were concerned about how long the pandemic might last, and whether a new wave of layoffs might be necessary if the economy doesn’t improve sharply and fresh fiscal stimulus isn’t provided. Coronavirus update: COVID-19 is far from contained and could rival 1918 flu pandemic that killed 50 million, experts warn Helping to offset those worries was news from Moderna Inc. MRNA, +0.09%, which said its coronavirus vaccine candidate produced a “robust” immune-system response in a larger group of people and that the study would move to a clinical trial in July. Also U.K. television broadcaster ITV reported that positive news may come Thursday on initial trials of the Oxford Covid-19 vaccine that is backed by AstraZeneca AZN, +0.63% AZN, +1.16%. “As the race for a COVID-19 vaccine makes progress, this has allowed investors to look beyond the surge in cases in the hope that economic recovery will continue to endure,” said Michael Arone, chief investment strategist at State Street Global Advisors, in an interview with MarketWatch. Arone also sees “overly pessimistic” forecasts for the COVID-19 damage to corporate earnings. “I think companies can easily step over negative earnings expectations,” he said. “We could see some pleasant surprises in this earnings season, which could keep momentum for stocks going.” On Wednesday, Dow component Goldman Sachs Group Inc. GS, -0.21% GS, -0.21% delivered second-quarter results that beat expectations for earnings, with shares ending 1.4% higher. The bank also reported its second highest revenues in history. Related: Major banks are hauling in ‘big fees’ from debt and equity underwriting during the coronavirus crisis “The way bank earnings have been coming in has impressed me,” said Randall Eley, president and chief investment officer at Edgar Lomax Co in Alexandria, Virginia. “Overall, they just aren’t reporting the kind of negative numbers people feared.” Eley also expects that today’s higher bank reserves, or the cushion lenders keep to buffer against any potential credit losses, will end up being “well beyond what will be needed.” In other U.S. economic data Wednesday, the New York Reserve Bank’s regional Empire State Index for July posted its first positive reading since February. Industrial production in June jumped by 5.4%, on top of the 1.4% gain in May. Wall Street economists had forecast a 4.1% increase, according to a MarketWatch survey. Philadelphia Fed President Patrick Harker also on Wednesday said he would support a change in monetary policy where the central bank would let the economy run hot until inflation rises above the central bank’s 2% annual target before lifting interest rates.Which companies were in focus? Apple Inc. GS, -0.21% shares gained 0.7% after the iPhone maker won a court battle with the European Union in a dispute over a €13 billion ($15 billion) Irish tax bill. Dow component UnitedHealth Group Inc. UNH, +1.68% shares fell 1.4% after the health care company reported a second-quarter profit that rose well above expectations, but revenue that came up short, as premiums and services revenue missed Moderna MRNA, +0.09% shares surged 6.9% after the company’s positive vaccine announcement. Amazon.com Inc. AMZN, +3.01% said it would create 1,000 new full-time jobs as it plans to open a new fulfillment center in Pflugerville, Texas. The e-commerce giant’s shares fell 2.4%. Walmart Inc. WMT, +1.00% announced that face coverings will be required at all U.S. stores and Sam’s Club warehouses starting July 20. Its shares ended 0.01% lower. Relay Therapeutics Inc. RLAY, -1.93%, a clinical-stage oncology biotech, upsized and raised its expected price range for its initial public offering on Wednesday, with plans to offer 20 million shares priced at $18 to $19 each. J.C. Penney Co. Inc. JCP, -2.53% shares gained 2% after the retailer said it would cut about 1,000 jobs as it looks to closes 152 stores as part of its restructuring. Forescout Technologies Inc. US:FSCT rallied 15.4% Wednesday after the cybersecurity company said its deal to be taken private by Advent International was back on but at a lower price. How did other markets trade In Asia, the Shanghai Composite SHCOMP, +1.67% fell 1.6% to end at 3,361.30, while the CSI 300 Index 000300, +2.04% fell 1.3%. Japan’s Nikkei 225 Index NIK, -0.11% lost 1.6%, while the Hang Seng Index in Hong Kong HSI, -0.30% eked out a gain of 3.69 points to close at 25,481.58. In Europe, the pan-European SXXP, +0.55% Stoxx 600 Europe Index settled 1.8% higher, while London’s FTSE 100 UKX, +0.64% was up 1.8%. The yield on the benchmark 10-year Treasury note TMUBMUSD10Y, 0.777% rose 1.5 basis points to 0.629%. Yields and bond prices move in opposite directions. The ICE U.S. Dollar Index DXY, -0.58%, a measure of the currency against a basket of six major rivals, was off 0.2%. Oil futures rose, with the U.S. benchmark CL.1, -1.62% adding 91 cents, or 2.3%, to settle at $41.20 a barrel, on the New York Mercantile Exchange. Gold GC00, +2.17% futures added 40 cents, or 0.02%, to end at $1,813.80 an ounce. William Watts contributed reporting"}]}