{"article": [{"url": "https://www.marketwatch.com/story/what-stock-market-investors-will-be-watching-for-in-first-trump-biden-debate-11601121198", "published": 1601285000.0, "headline": "What stock-market investors will be watching for in first Trump-Biden debate", "body": "Nervous investors will be among what’s expected to be a record-breaking audience on Tuesday for the first debate between President Donald Trump and Democratic challenger Joe Biden. But how they react is more likely to be driven by which candidate is perceived to come out on top more than the substance of what they have to say on the issues. Read: Tuesday’s presidential debate: Biden must ‘aggressively’ push back against Trump to win, expert says “The debate may not see an immediate reaction per se, but where you might see a reaction is in the post-debate polling data,” if it shows Biden’s lead over Trump narrowing or widening, said Rebecca Felton, senior market strategist at Richmond, Va.-based RiverFront Investment Group, in an interview. That may take a few days. History shows markets don’t typically see outsize moves following first debates, which are typically the most watched. In the election years since 1960 that did feature presidential debates, the median move by the S&P 500 the following day was a fall of -0.14%, according to Dow Jones Market Data. As a general rule, analysts view the prospect of a second-term for Trump as a positive for stocks, while a win for Biden is seen as potential fodder for a retreat, particularly if Democrats wrest control of the Senate from Republicans while keeping control of the House. After all, a Trump win would keep the 2017 corporate tax cuts in place. The president would also be likely to maintain his confrontational stance with China and push for more infrastructure spending. Biden is also a proponent of infrastructure spending, but has called for an increase in taxes on corporations and high-income individuals. He’s also seen as more likely to press for increased regulations on certain sectors and industries, including banks, energy and health care, she noted. Read: How Trump and Biden tax policies could affect your paycheck, tax return, investment portfolio and nest egg Biden, however, is seen as less likely to use tariffs against China, Europe and other trading partners, which would be a positive for the global economic outlook, Felton said in a recent note. With the economic outlook turning almost exclusively around the path of the COVID-19 pandemic, party-specific policy prognostications are less clear, said Victoria Fernandez, chief market strategist at Houston-based Crossmark Global Investments, in an interview. “If we have a Democratic administration come in, typically we would say that’s not going to be as favorable for business…but I can’t imagine we’re going to see huge changes that we think would affect the economy when the economy is suffering so much from COVID,” she said. The RealClearPolitics average of nationwide polls showed Biden leading Trump by 6.7 percentage points, and has ranged between around 6 to 10 basis points since late July. Biden is also seen with a narrow lead in several top battleground states. The debate comes as investors are growing increasingly nervous about the prospect of a contested outcome, fears that were amplified as Trump and Republican senators planned to nominate and confirm a new justice to replace Ruth Bader Ginsburg, who died on Sept. 18 before Election Day. Trump in the past week refused to commit to a peaceful transfer of power following the election, arguing, without citing evidence, that mail-in ballots carry the risk of widespread fraud. Worries over the prospect of a contested election, potentially leaving the result in limbo for weeks, has been blamed in part for a pickup in market volatility this month as equities pulled back from record highs. A narrowing of the polls in the wake of the debate could add to expectations for a muddled outcome, analysts said. Stocks rallied Friday, ending a choppy week on an up note. But the Dow Jones Industrial Average DJIA, +0.56% still suffered a1.8%, weekly fall, while the S&P 500 SPX, +0.87% logged a 0.6% weekly loss. It was the fourth straight weekly decline for the two indexes, matching the longest losing streak since August 2019. The Nasdaq Composite COMP, +1.39% gained 1.1% for the week, ending a three-week stretch of declines. Read: Why investors are starting to freak out about the 2020 presidential electionCheck out: 2000 redux? Stock-market election fears have investors revisiting Bush-Gore battle Activity in the options market, as reflected by Cboe Volatility Index futures, shows that traders see the potential for elevated volatility in November, December and January. Related: Contrarian investors are betting against increased volatility around the election “Political discord and uncertainty have been one of the many things that have defined 2020, and this trading variable will only grow more relevant as the first presidential debate looms and the election approaches.,” wrote rates analysts Ian Lyngen and Jon Hill of BMO Capital Markets, in a Friday note. Some market watchers do expect traders to deliver something of an early judgment on the debate. “FX markets in Asia Wednesday morning may be the first litmus test of how the dollar will fare in the run-up to the election,” wrote analysts at ING, in a Friday note. “One school of thought is that a strong Trump performance is equity positive/dollar negative. We have the view, were Biden to win, the dollar could decline in 2021 on a benign world view — but let’s look out for the price action on Wednesday,” they said. While the polls may drive the immediate market reaction, analysts said there was plenty in the way of details to listen for in the debate. Investors will want to hear how Trump would plan to deal with China in a second term and will be eager for Biden to put more light on his approach to relations with Beijing, wrote Kristin Hooper and Andy Blocker of Invesco, in a note. And since tax policy may be the biggest source of concern among investors when it comes to a Biden presidency, investors will “want to hear which taxes in the Biden tax plan he is committed to implementing, and whether or not the state of the economy will impact his timing,” they wrote. So what should investors do? Crossmark’s Fernandez said investors should resist making knee-jerk reactions to headlines and changes in the polls. With the economic path dependent on how the pandemic plays out, even the election outcome itself might not be that much of a mover for the market, she said. Crossmark has advised clients to adopt a “barbell” strategy, moving about a month ago to maintain exposure to large-cap growth stocks but trimming positions that had become excessively overweight before the September pullback, while building positions in more staple-type stocks that have lagged behind in the 2020 rally. Following the debate, attention next week will be locked on the labor market as investors look to assess whether the economic rebound is losing steam amid the lack of another round of rescue spending from Washington."}]}