{"article": [{"url": "https://www.marketwatch.com/story/fresh-off-a-500-million-contract-patrick-mahomes-buys-ownership-stake-in-the-kansas-city-royals-2020-07-28", "published": 1595953040.0, "headline": "Fresh off a $500 million contract, Patrick Mahomes buys ownership stake in the Kansas City Royals", "body": "Kansas City Chiefs quarterback Patrick Mahomes just became one of the owners of Major League Baseball’s Kansas City Royals. Mahomes, who led the Chiefs to a Super Bowl win earlier this year, recently signed the most lucrative contract in the history of U.S. professional sports, an extension worth as much as $503 million. “We are very proud and excited to have Patrick as our partner in the ownership group of this franchise,” John Sherman, owner of the Royals, said in a statement. The former NFL MVP has a wide portfolio of endorsement deals including Adidas ADDYY, +2.03% , Coca-Cola KO, +0.69% , State Farm STFGX, +1.03% and Oakley EL, +0.33% iframe.twitter-tweet { width: 100% !important; } “I’m honored to become a part owner of the Kansas City Royals,” Mahomes said in a statement. “I love this city and the people of this great town. This opportunity allows me to deepen my roots in this community, which is something I’m excited to do.” Mahomes has ties to Major League Baseball too. The chiefs quarterback played two years of baseball in college, and was selected with a 37th-round draft in the 2014 MLB Draft. Mahomes decided to pursue football instead. See also: MLB pauses season of Miami Marlins as 18 players and coaches test positive for the coronavirus In addition, his father, Pat Mahomes Sr., played 11 years in the MLB with the Minnesota Twins, Boston Red Sox, New York Mets, Texas Rangers, Chicago Cubs and Pittsburgh Pirates. It’s not public how much equity in the Royals Patrick Mahomes bought, but John Sherman remains the controlling owner of the team. Forbes reports that the Royals are the 28th-most valuable franchise in baseball -- out of 30 teams -- with a total value of $1.025 billion."}]}