{"article": [{"url": "https://www.marketwatch.com/story/in-the-nyc-subways-no-fines-no-arrests-instead-mask-liaisons-in-blue-2020-09-18", "published": 1600439660.0, "headline": "In the NYC subways: No fines, no arrests. Instead, 'mask liaisons' in blue", "body": "\"Would you like a mask?\" police officer Michael Miceli asked incoming straphanger Thomas Suh. The officer was in the subway, standing near the booth on the uptown side of the 4/5 station at Wall Street. He was holding a small box of light-blue, disposable face masks, the pleated kind with a thin wire running across the top so the mask fits more snugly against the bridge of the nose. The cop was in full uniform, which these days includes a mask of his own along with a pair of thin, tightfitting surgical gloves. \"What?\" Suh answered through his own black cotton mask and over the rumble of an uptown 4 train, which was just then arriving on the platform. \"A mask,\" Miceli repeated. Talking through masks in a noisy subway is never easy. \"We have free masks.\" Everybody likes free, especially in New York City, where so few things are free. \"Sure,\" said Suh, who is 34 and was on his way to the going-out-of-business sale at the Century 21 designer-discount store, a couple of blocks away. \"Can I have two of them?\" The police officer shrugged and handed the man two masks. Welcome to the latest quiet battlefront in New York City's life-or-death war against the novel coronavirus, which has already infected 244,000 men, women and children in the city, killing 23,767 of them, according to the official count. Don't miss: I went to the Met, and here's what I saw The public-school kids will be back in classrooms by Oct. 1. The first of the indoor diners return Sept. 30. No one knows whether that will make the virus accelerate again. But the subway, the vital irrigation system that nourishes the city's economy and its cultural life, is struggling mightily to convince 5.5 million daily riders that they can safely pass through the turnstiles again. New York can't thrive without its subway. And universal mask wearing is at the heart of the revival plans. But the masks are totally useless unless people wear them and wear them properly. This being New York, not everyone is going to comply. Back on April 15, Gov. Andrew Cuomo mandated the use of face masks in public places across New York state. Last week, vowing \"to give riders comfort to re-engage the system,\" the governor turned up the heat underground, ordering $50 fines for anyone caught without a mask in the subway. The only problem? Mayor Bill de Blasio refused to board the train. Also on MarketWatch: Macy's Thanksgiving Day Parade to go virtual this year Barefaced riders should be invited to mask up, even urged to, the mayor said-but not summonsed or arrested for refusing. Such enforcement measures, as he put it months earlier, do not \"reflect our values.\" So what's a cop to do? Caught in the middle of this latest standoff between Albany and City Hall are the city's police, especially those assigned to the NYPD Transit Bureau's 12 districts, who are expected to - do what exactly? Well, somehow to navigate between two headstrong politicians who can't seem to agree on much of anything, even something as basic as mask enforcement. Good luck with that! Officer Thomas Saladino hands out masks at the Wall Street subway station. Ellis Henican/MarketWatch The bottom line: Despite the subway's need to reassure riders that everyone will be masked, city police have been told: no arrests, no fines and, most of all, no viral videos like the one that circulated in mid-May after Kaleemah Rozier, 22, entered the Atlantic Avenue/Barclays Center station in downtown Brooklyn with her 5-year-old son. She had a mask around her chin while she spoke on a cellphone. There isn't much dispute about what happened next since most of it was caught on video. Uniformed police officers asked her politely - at least three times - to cover her mouth and nose with the mask. She refused, and the encounter escalated. Rozier cursed at the officers, slapped one in the arm, threatened to \"cough on all of you\" and rushed off down a stairway. That's when she was grabbed and held on the ground, before being charged with misdemeanor disorderly conduct and resisting arrest and given a desk appearance ticket. Video of the tussle went viral and, after the mayor demanded a \"reset,\" Rozier hired attorney Sanford Rubenstein and announced a $10 million lawsuit against the city for her \"psychological injuries.\" \"Whatever else was happening in that moment, we should never have a situation when a mom with her child ends up under arrest for that kind of offense - it's just not right,\" de Blasio said. Also see: As yellow taxi drivers struggle, city to announce six-month pause on new licenses So here was Officer Miceli, 30, on duty in the Wall Street station with Officer Thomas Saladino, 32, performing as \"mask liaisons,\" Saladino's term. Even the cops, he said, have grown more supportive of masks. \"At the beginning,\" Saladino said, \"everyone in the district was like, 'Oh, it's no big deal. Just let it be.'\" But once dozens of his fellow officers began testing positive, feelings in the district began to change. \"It hit us hard,\" he said. \"But we started taking proper precautions. Gloves. Masks. A lot of Purell. Now everyone's doing that. We'll be OK.\" Ellis Henican is an author based in New York City. He was a former newspaper columnist."}]}