{"article": [{"url": "https://www.marketwatch.com/story/which-markets-are-closed-for-labor-day-on-monday-11599164870", "published": 1599461960.0, "headline": "Which markets are closed for Labor Day on Monday", "body": "School administrator Cecilia Martinez wears a face mask at Stamford High School, Conn. John Moore/Getty Images This Labor Day won’t feel like recent ones, with millions still out of work nearly six months since the coronavirus tore apart the fabric of daily American life. Schools and universities that typically recall students to class after the Labor Day holiday also continue to weigh whether its safe or not to open their doors across the nation. But on Monday, many U.S. office workers can count on getting a paid day off, including the legions of Wall Street’s white-collar workers expected to start trickling back into offices after working remote for months during the summer. Specifically, that means no trading on the Dow Jones Industrial Average DJIA, +0.56%, S&P 500 index SPX, +0.87% or Nasdaq Composite Index COMP, +1.39%, or in U.S. Treasurys TMUBMUSD10Y, 0.777%. Dramatic gains by technology stocks and other stocks that benefited from working-from-home plans recently helped restore major U.S. equity indexes to all-time highs — in record time. Until Thursday’s slump led by Apple Inc. AAPL, +1.74% and other tech powerhouses led a sharp stock-market drop. Here’s a list of markets that will be closed on Monday, Sept. 7, 2020 for the U.S. Labor Day holiday. New York Stock Exchange Nasdaq U.S. Treasury and other U.S., U.K. and Japanese bond markets There also will be no early closes on Friday, September 4, as is the case with some federal U.S. holidays. Internationally, the London Stock Exchange and Asian stock markets will remain open Monday for business. In commodities, there will be no regular trading or settlement price Monday for West Texas Intermediate crude futures CLV0 on the New York Mercantile Exchange. Although, Brent futures, the international benchmark, traded on the ICE Futures exchange will operate on Monday, but with an early close. Precious metals, including trading and settlements of gold futures GCZ20, +2.17% on Comex, will be halted Monday. And for those still organizing backyard BBQs over the long holiday weekend, top infectious disease expert Dr. Anthony Fauci hopes all gatherings will abide by social-distancing protocols to help prevent further spread of the still “unacceptably high” rates of Covid-19. Fauci this week called for vigilance over Labor Day, noting that it’s a “safe bet” to assume that by November or December it will be known if there’s a safe and effective vaccine for the virus, which has infected 26 million globally. New York City has been able to keep new Covid-19 infections low in recent months, despite reopening more aspects of daily life. The city also was on the forefront of workplace reforms, celebrated its first Labor Day in 1882, a dozen years before the U.S. to sign a federal law designating the first Monday in September of each year as a national holiday."}]}