{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-tread-water-as-wall-street-digests-bank-stress-test-and-record-rise-in-coronavirus-cases-2020-06-26", "published": 1593264260.0, "headline": "Dow closes 730 points lower after spike in coronavirus cases forces Texas and Florida to close bars again, while bank stocks sink on stress tests", "body": "U.S. stock indexes closed at their lowest levels in about two weeks Friday, after Texas and Florida were forced to backtrack on reopening their economies as coronavirus cases rose further and a record number of new cases were reported nationwide. Meanwhile, investors were also parsing the results of the Federal Reserve’s bank stress tests which resulted in a cap on dividends and stock buybacks. How did benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% closed 730.05 points, or 2.8%, lower at 25,015.55; and the S&P 500 index SPX, +0.87% retreated 74.71 points, or 2.4%, to close at 3,009.05, with the S&P’s financial sector SP500.40, +0.06% sinking 4.3%, and the energy sector SP500.10, -1.59% 3.5% lower. All 11 sectors of the S&P 500 closed deep into negative territory on Friday. Meanwhile, the tech-heavy Nasdaq Composite Index COMP, +1.39% lost 259.78 points to reach 9,757.22, a fall of 2.6%. For the week, the Dow lost 3.3%, the S&P 500 notched a 2.9% decline, and the Nasdaq fell 1.9% for the period.What drove the stock market? Investors have wrestled with rising daily rates of new U.S. coronavirus cases all week and that again cast a pall over the stock market on Friday. U.S. states saw a single-day record rise of 37,000 in infections on Thursday, led by Florida, Texas, California and Arizona, surpassing the 36,188 level from April 24, according to analysis of data from Bloomberg. That case count “blew out any of the previous records,” said Will Geisdorf, senior research analyst with Sarasota, Fl-based Allegiant Private Advisors. “I think the markets are looking at that and starting to discount the potential for a V-shaped recovery.” As evidence mounts that consumers are losing confidence, there will be pressure on policymakers to deliver another round of fiscal stimulus, Geisdorf said in an interview. “That’s what markets need to get out of this period of consolidation and volatility and continue higher. We’ve had the best 50-day period in market history. Some sort of correction was needed to relieve excessive optimism.” Governors in Texas and Florida ordered all bars to close again on Friday, making the states the first to reverse some reopening measures after months of lockdowns. Texas reported 6,426 new coronavirus cases Thursday, according to Johns Hopkins University data, and Florida reported over 8,900. Overall, total cases in the U.S. have topped 2.4 million and that increase, notably in southern and western states in the U.S., has also resulted in business reopening plans being halted in North Carolina, Louisiana and Kansas. However, governors in New York, New Jersey and Connecticut are proceeding with reopening efforts but imposing a 14-day quarantine for visitors from some hard-hit states. “The market has been threatened by anything that jeopardizes the economic recovery,” Quincy Krosby, chief market strategist at Prudential Financial, told MarketWatch. “What you are seeing is the market react to the headlines,” she said. The key for some investors is determining the degree by which the rise in cases results in hospitalizations and deaths, Krosby said. “It will give us a sense of whether the therapeutic treatments are working,” she said. Investors are also digesting the results of the Federal Reserve’s annual bank stress tests which requires banks to preserve capital by suspending share repurchases and cap dividend payments in the third quarter based on average net income over the past four quarters. Read: Opinion: The Federal Reserve’s bank stress tests put dividend payments at risk However, financial institutions got a boost on Thursday after the Federal Deposit Insurance Commission and Office of the Comptroller of the Currency said they are planning to loosen the restrictions imposed by the Volcker rule and allow banks to more easily make large investments into venture capital and similar funds, among other rule rollbacks. Check out: MarketWatch’s Need to Know column:Why one strategist is actually encouraged by the latest coronavirus data showing a spike in new cases In U.S. economic data, consumer spending climbed in May to a record 8.2% after tumbling in April, as consumers used government stimulus checks to help Americans deal with job losses during the pandemic. However, personal incomes sank 4.2% last month, reflecting the mass unemployment. “Consumer demand will probably look good in June as well, supported by the reopening in the Northeast and a still-elevated savings rate,” wrote Jefferies analysts Aneta Markowska and Thomas Simons. “However, stimulus payments are now shrinking and dragging down overall income growth,” the wrote. In other economic reports, the final results of the consumer-sentiment survey in June slipped to 78.1 from an initial 78.9, the University of Michigan said Friday.Which stocks were in focus? Nike Inc. NKE, +0.97% swung to a fourth-quarter loss and total sales dropped 38% despite a jump in online sales. The quarter’s online sales rose 75% with “strong double-digit increases” across geographies and made up about a third of total revenue for the quarter. Shares were down 7.6%. Amazon.com Inc. AMZN, +3.01% announced that it was purchasing self-driving car company Zoox for more than $1 billion, according to reports. The company’s stock fell about 2.2%. Shares of Gap Inc. GPS, -0.10% surged about 19% after the retailer reported that it was teaming up with hip-hop star Kanye West. Vaxart Inc. VXRT, +0.97% said Friday its oral COVID-19 vaccine has been selected to take part in a nonhuman primate challenge study funded by the U.S. government’s ‘Operation Warp Speed’ program, that aims to accelerate development of a vaccine. Shares were up more than 28%. Microsoft Corp. MSFT, +2.48% said Friday it will close all of its physical store locations, as part of the software and cloud giant’s new approach to retail. Its stock was down 2%. Shares of Inovio Pharmaceuticals Inc. INO, -1.36% lost 4% Friday, after a downgrade from Stifel Nicolaus on valuation concerns. Facebook Inc. FB, +0.26% Shares of media giants and Twitter Inc. TWTR, -0.23% tumbled more than 7% after Unilever N.V. UN, +2.49% said it would join in halting advertising on the platforms until hate speech concerns were addressed. Albertsons Companies Inc. ACI, +1.71% shares were trading lower on Friday after it priced its initial public offering. How did other assets perform? West Texas Intermediate U.S. crude US:CLQ20 for August delivery fell 23 cents, or 0.6%, to settle at $38.49 a barrel on the New York Mercantile Exchange. In precious metals, gold futures US:GCM20 edged $9.70, or 0.6%, higher, to settle at $1,780.30 an ounce. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell about 4 basis points to 0.647% amid inflows into safe-haven assets. Bond prices move inversely to yields. The greenback was virtually unchanged against a basket of its major rivals, based on trading in the ICE U.S. Dollar Index. DXY, -0.58% In global equities, the Stoxx Europe 600 index SXXP, +0.55% fell 0.4% to close at 358.32 and London’s FTSE 100 UKX, +0.64% closed up 0.2% at 6,159.30. In Asian markets, the Japanese Nikkei NIK, -0.11% gained 1.1%, Hong Kong’s Hang Seng HSI, -0.30% lost 0.9%, while South Korea’s Kospi advanced 1.1%. Markets in China were closed for a holiday."}]}