{"article": [{"url": "https://www.marketwatch.com/story/pompeo-to-give-china-speech-as-tensions-with-us-flare-2020-07-23", "published": 1595526740.0, "headline": "'Distrust and verify': Pompeo urges 'every nation' to join U.S. in confronting China", "body": "Secretary of State Mike Pompeo on Thursday called on governments around the world to join the U.S. in confronting China's Communist Party leaders, saying in a fiery election-year speech that engagement with Beijing has failed. Speaking at the Richard Nixon Presidential Library in Yorba Linda, Calif., Pompeo said the bond with China that the 37th president famously sought had failed to materialize. \"The kind of engagement we have been pursuing has not brought the kind of change inside of China that President Nixon had hoped to induce,\" Pompeo said. The secretary's speech came as tensions are flaring between Beijing and Washington in the wake of the U.S. ordering the closure of the Chinese consulate in Houston. The State Department said the move was made to protect U.S. intellectual property and private information. Read:China says its consulate in Houston has been ordered shut. China has vowed retaliation if the order isn't reversed, and the U.S. is reportedly preparing for Beijing to close one or more American consulates in China. Invoking President Ronald Reagan's \"trust but verify\" approach to the Soviet Union, Pompeo said: \"When it comes to the [Chinese Communist Party], I say, we must 'distrust and verify.'\" Pompeo stressed that the U.S. would keep talking with China. But he called on \"every leader of every nation\" to \"insist on reciprocity, to insist on transparency and accountability from the Chinese Communist Party.\" He also said the U.S. should \"empower\" the Chinese people, who he sought to differentiate from the party. Pompeo's speech was the fourth in a series of addresses on China by top Trump administration officials. It comes in the thick of the U.S. presidential election campaign, in which President Donald Trump is lagging behind presumptive Democratic nominee Joe Biden in polls of key battleground states. Also see:Barr blasts Apple and Google as 'all too willing' to cooperate with China. Trump has ramped up criticism of China over its handling of the coronavirus outbreak, a criticism Pompeo repeated Thursday. The initial cases of the virus occurred in Wuhan, China, in December 2019, and Trump as recently as Tuesday has called it the \"China virus.\" The Houston-consulate order came after two Chinese hackers were accused on Tuesday by the Justice Department of stealing trade secrets and trying to pilfer research on coronavirus vaccine candidates. Trump has accused Biden of being soft on China. Meanwhile, a draft of the Democrats' 2020 party platform calls China's trade practices unfair and says Democrats will work closely with European allies to push back on the Chinese government, the Wall Street Journal reported. U.S. stocks ended Thursday sharply lower, with declines by technology giants Apple AAPL, +1.74%  and Microsoft MSFT, +2.48%  accounting for more than half of the Dow Jones Industrial Average's DJIA, +0.56%  losses. Investors also parsed weak data on employment and growing concerns that another congressional financial aid package for businesses and pandemic-stricken households may be held up by political wrangling. Read:Senate GOP closing in on COVID aid bill deal with White House."}]}