{"article": [{"url": "https://www.marketwatch.com/story/one-of-the-worlds-most-livable-cities-just-went-into-full-lockdown-mode-as-coronavirus-cases-spike-2020-08-02", "published": 1596470000.0, "headline": "One of the worldâ\u0080\u0099s â\u0080\u0098most livableâ\u0080\u0099 cities just went into full lockdown mode as coronavirus cases spike", "body": "Melbourne, which had been named the â\u0080\u009cworldâ\u0080\u0099s most livable cityâ\u0080\u009d for seven straight years before being beaten out by Vienna in 2018, wonâ\u0080\u0099t be feeling quite so livable for the next six weeks. Australiaâ\u0080\u0099s second biggest city faces strict lockdown measures as the state of Victoria saw another record spike in coronavirus cases â\u0080\u0094 671 in a single day, CNN reported. How strict? Starting Sunday evening, a curfew between 8 p.m. and 5 a.m. will be enforced, with the premier of Victoria ordering the region into a â\u0080\u009cstate of disaster.â\u0080\u009d Hear more from Premier Daniel Andrews: iframe.twitter-tweet { width: 100% !important; } â\u0080\u009cWe have to do more,â\u0080\u009d he pleaded, â\u0080\u009cand we have to do more right now,â\u0080\u009d telling people that, â\u0080\u009cWhere you slept last night is where youâ\u0080\u0099ll need to stay for the next six weeks.â\u0080\u009d Furthermore, only one person per household in Melbourne, which spent most of July under these restrictions, will be allowed to leave their homes once a day outside the curfew restrictions. And thatâ\u0080\u0099s only to pick up essential goods within a five-kilometer radius of their home. As for exercise, only an hour a day is allowed within that same radius. State opposition leader Michael Oâ\u0080\u0099Brien reportedly took exception to the decision, saying Victorians â\u0080\u009cdonâ\u0080\u0099t deserve thisâ\u0080\u009d and that, â\u0080\u009cIn declaring a state of disaster, Andrews has conceded that his government has lost control of COVID-19 in this state.â\u0080\u009d Meanwhile, in the U.S., where lockdown measures are nowhere near as strict, some 4.6 million have been infected, and more than 154,000 have died from the disease, according to the latest from Johns Hopkins University. The death toll is projected to reach 173,000 within three weeks, according to a new composite forecast from the Centers for Disease Control and Prevention cited by CNN. Thatâ\u0080\u0099s an average of almost 1,000 deaths every day. Read on (from the archives: December 2018):Chicago, Porto and Melbourne â\u0080\u0098have it all,â\u0080\u0099 says Time Out â\u0080\u0094 Chicago, especially"}]}