{"article": [{"url": "https://www.marketwatch.com/story/stocks-are-heading-toward-a-bearish-pattern-this-move-could-turn-it-around-2020-06-22", "published": 1592842400.0, "headline": "Stocks are heading toward a bearish pattern - this move could turn it around", "body": "The S&P 500 Index is carving out a pattern with massive bearish potential. Here is the setup and what could invalidate it. The June 8 high is below the Feb. 19 high, and the June 16 high is below the June 8 high. The chart below shows this setup for the S&P 500 SPX, +0.87%, but the same pattern exists for the Dow Jones Industrial Average DJIA, +0.56%  and Russell 2000 RUT, +0.55%. Note: The Nasdaq Composite COMP, +1.39%  and Nasdaq-100 NDX, +1.51%  exceeded their February highs and are not subject to this setup. Chartists call this a pattern of lower highs. Elliott Wave theorists call this a potential \"1-2\" setup. Elliott Wave theory is a study of crowd psychology-based recurring wave patterns with wave 3 being the strongest of a 3- or 5-wave sequence. (An explanation of Elliott Wave Theory is available here.) The pattern of lower highs could be viewed as waves 1 (down) and 2 (up) with a strong wave 3 (down) soon to develop. You may be skeptical of Elliott Wave theory, and you should be. Elliott Wave theory is subject to interpretation and the interpreter's bias. But when used responsibly, in conjunction with other indicators (discussed below), Elliott Wave theory can offer insights that no other tool can. Validation, invalidation zones A move above the June 8 high (3,233.13 points) would invalidate the immediately bearish \"1, 2\" setup, and may allow the S&P 500 to test the horizontal resistance level and potentially close the open chart gaps (dashed purple lines). Based on conventional technical analysis, the spike above the 2008 trend line (red oval) could be considered a bearish island reversal. If that's the case, the S&P 500 should not close above this line (around 3,180). A move below the upper green support line would start to validate the \"1, 2\" setup. The general downside target for this kind of move is 2,500-2,600.Pattern confirmation The charts of Apple AAPL, +1.74% and Amazon AMZN, +3.01%, the biggest components of the SPDR S&P 500 Trust SPY, +0.89% and Invesco QQQ Trust QQQ, +1.52%, allow for a pullback. The odds of a broader stock market pullback increase if: 1. Apple fails to move above resistance around 360; and: 2. Amazon falls below support around 2,620. On June 10, the 20-day simple moving average (SMA) of the CBOE Equity Put/Call Ratio fell below 0.50. This means that option traders bought more calls (bullish strategy) than puts (bearish strategy) for 20 days. This rarely happens. If we relax the parameters, we find seven other periods when the ratio dropped below 0.51. The various graphs below show the forward performance for the S&P 500 (starting when the ratio dropped below 0.51 for the first time). The performance tracker at the bottom shows that the average return for the S&P 500 was negative for the next three months with the odds of a positive return two months later at only 43% (keep in mind that most signals triggered during a strong bull market). This is just one of over 300 studies I analyzed over the past six months. Many of the more recent studies suggest short-term weakness. (Additional studies along with the Risk/Reward Heat Map are available here.) In summary: As long as the S&P 500 stays below 3,235 and 3,180, the bearish \"1, 2\" pattern should not be ignored. Simon Maierhofer is the founder of iSPYETF and publisher of the Profit Radar Report."}]}