{"article": [{"url": "https://www.marketwatch.com/story/asian-markets-fall-after-grim-us-gdp-data-2020-07-31", "published": 1596155420.0, "headline": "Asian markets fall after grim U.S. GDP data", "body": "Asian shares tumbled Friday as reports showed layoffs of American workers are persisting at high levels after the U.S. economy contracted at a nearly 33% annual pace in the spring, the worst quarter on record. Earnings reports, a gauge of how well businesses are managing the fallout from the coronavirus pandemic, added to the gloom. Some technology companies have bucked the trend and are showing positive results. But many companies are hurting. Japan’s Nikkei 225 NIK, -0.11% tumbled 2.3% while Hong Kong’s Hang Seng index HSI, -0.30% rose 0.2%. The Shanghai Composite SHCOMP, +1.67% was about flat while the smaller-cap Shenzhen Composite 399106, +3.09% gained 0.3%. South Korea’s Kospi 180721, +0.21% slipped 0.2%, Taiwan’s Taiex Y9999, +1.10% declined 0.3%, and Australia’s S&P/ASX 200 XJO, +0.00% fell 1.6%. Markets in Singapore, Malaysia and Indonesia were closed for holidays. August tends to be a lousy month for stocks, noted Stephen Innes of AxiTrader Corp. “Stock markets are looking extraordinarily corrective to the extent that we could be entering a pullback phase as we head into August, most commonly referred to as the summer swoon,” Innes said in a commentary. In one positive signal, China reported its manufacturing activity edged up in July and export orders strengthened despite weak U.S. and European demand. The monthly survey released Friday was another sign the world’s second-largest economy is gradually recovering from the coronavirus pandemic. Central bank meetings for various countries are on the agenda for the coming week. “Second-quarter GDP for Indonesia and the Philippines will also draw scrutiny, highlighting the impact of the pandemic,” said Bernard Aw, principal economist for IHS Markit in Singapore. The Japanese government said late Thursday the nation’s economy was likely to sink 4.5% for the fiscal year ending in March 2021. It forecasts a return to growth in the following fiscal year. Among the Japanese companies reporting earnings next week are Sony Corp. 6758, +0.38% , Honda Motor Co. 7267, -0.73% , Toyota Motor Corp. 7203, -0.95% and Nintendo Co. 7203, -0.95%. Some companies are holding up better than others. Japanese media reports said Toyota was on course to become the No. 1 automaker in the world again, overtaking Volkswagen, now the top manufacturer in global vehicle sales. Toyota’s sales were already recovering in markets like China, which is recovering from its early outbreaks of COVID-19, according to the company. Overnight, the U.S. reported the economy contracted at a record-shattering 32.9% annual rate in April-June as pandemic shutdowns expanded. News of the deep, steep collapse came as a resurgence of outbreaks has pushed businesses in many areas to close for a second time. The government’s estimate of the second-quarter fall in the gross domestic product has no comparison since records began in 1947. The previous worst quarterly contraction — at 10%, less than a third of what was reported Thursday — occurred in 1958 during the Eisenhower administration. The bad news was no big surprise, and on Wall Street, the S&P 500 SPX, +0.87% dropped 0.4% to 3,246.22. Nearly three out of four stocks in the index declined. Among the hardest-hit were oil producers, banks and other companies that most need the economy to escape recession. The Dow Jones Industrial Average DJIA, +0.56% lost 0.9% to 26,313.65. Stocks seemed set for a much steeper fall earlier in the day but stronger-than-expected profits reported by UPS and other companies helped the market trim its losses. So did steadying prices for Amazon and other big tech-oriented stocks, which reported their own results after the day’s trading ended. Anticipation of their reports, which proved to be even better than Wall Street expected, helped the Nasdaq composite COMP, +1.39% completely erase its early loss and climb 0.4% to 10,587.81. But overall, earnings reports have been far below year-ago levels, before the pandemic struck. The big companies in the S&P 500 are on track to report a nearly 38% drop for the second quarter from a year earlier, according to FactSet. Shortly after trading ended for the day, Amazon AMZN, +3.01% , Apple AAPL, +1.74% , Facebook FB, +0.26% and Google’s parent company Alphabet GOOGL, +1.82% GOOG, +1.97% all reported bigger profits for the latest quarter than Wall Street had forecast. Investors have continued to flock to them expecting they will thrive as the pandemic accelerates a shift toward online commerce. Benchmark U.S. crude US:CLU20 gained 14 cents to $40.06 a barrel in electronic trading on the New York Mercantile Exchange. Brent crude UK:BRNU20 , the international standard, rose 37 cents to $43.31 a barrel. The dollar USDJPY, -0.38% slipped to 104.22 Japanese yen from 104.73 yen."}]}