{"article": [{"url": "https://www.marketwatch.com/story/employers-start-to-suspend-their-401k-match-2020-04-21", "published": 1596713840.0, "headline": "Employers start to suspend their 401(k) match", "body": "The employer match of employee contributions is an important characteristic of 401(k) plans. The match was designed to encourage participation and contributions — particularly by lower-paid employees. However, at a growing number of companies, the employer match has become a casualty of the COVID-19 crisis and ensuing economic collapse. Read: More cuts to 401(k) matches are coming Although employers have adopted a variety of match rates, the typical employer match consists of a 50% match on 6% of the employee’s salary. Taken together, the typical employer match is thus 3% of employee earnings. Most employers permit their workers to continue contributing on an unmatched basis past the 6% match level. Read: New blow to workers: Some companies are cutting their 401(k) contributions Studies consistently find that the employer match is an important determinant of 401(k) participation and contribution decisions. On the participation side, the relationship is straightforward. The presence of an employer match produces a large initial return on the employee’s contribution that supplements the benefits of tax deferral and encourages participation. Read: 6 ways to keep health care costs from eating up your retirement savings On the contribution side, the relationship between the employer match and employee contributions is unclear. On the one hand, introducing a match reduces the amount that individuals need to contribute to reach some target level of saving. On the other hand, introducing a match might encourage others, who are contributing less than 6%, to increase their contributions because they receive an extra 50 cents for each dollar they contribute. Even though the theoretical outcome is ambiguous, studies that examine the relationship between the average match rate and employee contributions generally find a positive relationship. The propensity for employers to decrease or suspend their 401(k) match in times of economic hardship became evident in the wake of the 2001 recession, when several large companies (General Motors GM, -0.15%, Ford F, -1.36%, DaimlerChrysler, Textron, Goodyear Tire & Rubber, and Charles Schwab SCHW, +1.29%, among others) announced their decision. As the economy recovered, most of these firms restored their original matches. But the phenomenon returned following the 2008 financial collapse and ensuing recession. News accounts suggest that 218 companies suspended their 401(k) match between January 2008 and November 2009, affecting about 5% of all 401(k) participants. Again, as the economy recovered, three quarters of employers reinstated the match. Since the collapse of the economy in 2020, 16 large companies have suspended their match so far, including Tenet Health THC, +0.74% (119,660 active 401(k) participants), Marriott Vacations Worldwide MAR, -0.96% (9,715 active participants), and Amtrak (18,780 active participants). (Active participant data are for 2018 from the Labor Department’s Form 5500.) The question is how quickly employers will resume their 401(k) match. An analysis of the 2008-09 suspensions showed the main motivator was liquidity constraints in the face of a recession and a banking crisis. The picture is quite different this time around. Yes, liquidity is a problem, since hotels, providers of travel, and retailers cannot sell their products. But this time, the collapse is of greater severity, so more employers may end up taking the more drastic step of furloughing employees (which suspends all retirement contributions by definition). Nevertheless, if the economy rebounds quickly and employers compete for employees by resuming the 401(k) match, the impact on individuals — of at least this one provision — will be modest. Alternatively, if the recession drags on and these suspensions lead to a permanent decline of the 401(k) employer match, significantly fewer people will participate in 401(k) plans — especially among the lower paid — and many of those affected will end up with an inadequate retirement income."}]}