{"article": [{"url": "https://www.marketwatch.com/story/buffetts-berkshire-hathaway-has-lost-more-market-value-in-2020-than-all-but-4-publicly-traded-us-companies-2020-07-20", "published": 1595676980.0, "headline": "Buffett's Berkshire Hathaway has lost more market value in 2020 than all but 4 publicly traded U.S. companies", "body": "Clearly, it's good to be in tech this year. Banks, not so much. The proof is in this tweet from Roundhill Investments CEO and co-founder Will Hershey, who laid out the biggest market-cap winners and losers in the stock market so far this year. iframe.twitter-tweet { width: 100% !important; } As you can see, JPMorgan Chase JPM, -0.57%, Wells Fargo WFC, , Bank of America BAC, +0.47% and Exxon Mobil XOM, -1.47% are the only companies hit harder than Warren Buffett's Berkshire Hathaway BRK.A, +0.06% this year in the public market. On the flip side, perhaps unsurprisingly, Amazon AMZN, +3.01%, Apple AAPL, +1.74%, Microsoft MSFT, +2.48%, Tesla TSLA, +1.89%, and Google parent Alphabet GOOG, +1.97% led the way in terms of top performers among U.S. stocks. It doesn't help, of course, that Buffett is invested in the aforementioned banks, though his sizable stake in Apple has certainly buffered Berkshire somewhat through this difficult stretch. Still, Berkshire shares are down more than 16% so far this year, while Tesla, at the top, has rallied almost 300%. Here's how Berkshire's share performance stacks up vs. the tech giants: Buffett's been feeling the heat from critics who have called out the value-investing maestro for dumping his airline positions and missing the rebound while sitting on some $137 billion in cash. He did recently put some of that in cash in play, having closed a $10 billion deal for Dominion Energy's D, -0.34% natural-gas assets. Read: Why Buffett is 'willing to look like an idiot in the short term' There are signs to suggest that the trend of tech dominance could be shifting. Last week, the megacap tech names underperformed the old guard, with the Dow beating the Nasdaq Composite by more than 3 percentage points - the biggest weekly outperformance by the blue chips against the tech-heavy benchmark since June 5, according to Dow Jones Market Data. Read:Is the 'great rotation' in the stock market under way as coronavirus cases surge? Or is it a false dawn? Here's what experts think"}]}