{"article": [{"url": "https://www.marketwatch.com/story/wayfair-served-almost-5-million-new-customers-in-the-second-quarter-but-analysts-question-whether-theyll-return-2020-08-06", "published": 1596784400.0, "headline": "Wayfair served almost 5 million new customers in the second quarter but analysts question whether they'll return", "body": "The number of new shoppers to Wayfair Inc. skyrocketed during the second quarter, with the home furnishings retailer seeing five million new customers on its site. \"What was, even before COVID, an inextricable shift to e-commerce then became supercharged over the last several months, and we believe much of this step change in online penetration will prove to be sticky,\" said Niraj Shah, Wayfair's W, -2.59%  chief executive, on the earnings call, according to FactSet. \"Just to put things into perspective, in the quarter we activated nearly 5 million, more than the last four quarters combined. In the U.S., we also reengaged more than one million past customers who had been absent from the platform for longer than 12 months.\" Wayfair reported second-quarter adjusted earnings per share of $3.13 after a loss of $1.35 last year. Revenue jumped nearly 84% to $4.3 billion. And orders delivered was up 106.2% to 18.9 million. Wayfair stock has more than tripled for the year to date, up 246%. The Amplify Online Retail ETF IBUY, +1.39%  is up 78.3%. And the S&P 500 index SPX, +0.87%  has gained 3.7% for the period. As COVID-19 spread, lockdowns have forced people to spend more time at home, driving sales at those retailers and brands that specialize in home goods. Work-from-home and homeschooling has given sales of office items, computers and other related items a boost as well. See: Versace parent Capri Holdings and Ralph Lauren slump as luxury sales takes a hit during the pandemic Wayfair is confident that these new customers didn't just shop during the pandemic, but will spend money long after. \"Our observations tell us that this new cohort of customers is reengaging with our platform at higher than usual rates after their initial purchase and that this engagement is translating into higher-than-average repeat order rates,\" Shah said. Neil Saunders, managing director of GlobalData Retail, isn't as confident. He attributes much of the sales boost to the fact that many stores were closed during the pandemic, and questions whether the soaring sales are sustainable. \"From our data, consumers have already started to return to physical stores and online penetration levels in furniture and home furnishings have dropped from their peak in April,\" he wrote. \"While we believe online sales will remain elevated in home related categories - which will be helpful to Wayfair - the trends of this quarter will not be repeated indefinitely.\" Also:The back-to-school shopping season will be a 'dud' one analyst says, but the NRF is forecasting a record breaker There are also concerns about the competition. \"A lot of retailers are now investing more in digital and this inevitably means that online competition in home will rise over the next few years,\" Saunders said. \"This will place even more pressure on Wayfair to maintain market share which possibly means higher spending on advertising and customer acquisition: the very thing that it cannot afford.\" UBS analysts led by Michael Lasser are more confident. \"We believe Wayfair could see a long tail of wallet share gains,\" UBS said. \"Travel spend is unlikely to return to pre-pandemic levels any time soon. Meanwhile, consumers are likely to allocate more dollars to home furnishings and use e-commerce as the preferred channel.\" UBS rates Wayfair stock neutral with a $325 price target up sharply from the previous price target of $170. Canaccord Genuity analysts led by Maria Ripps agree. In addition, the company made logistical improvements to keep up with the surge in demand. Wayfair added 1,000 customer service workers, enlisted new suppliers and took other steps to keep challenges to a minimum. Watch:Work from home is here to stay. Here's what it means for retail \"Wayfair's model is exhibiting signs of strong scale and leverage as the platform remains well-positioned to take advantage of this heightened demand,\" Canaccord said. Canaccord rates Wayfair stock buy with a $340 price target, up from $300. CFRA upgraded Wayfair to buy from hold and moved its price target to $350 from $170."}]}