{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-fall-for-a-second-session-as-the-dollar-extends-firming-trend-2020-08-20", "published": 1597934720.0, "headline": "Gold ends sharply lower for a second session as U.S. dollar extends firming trend", "body": "Gold prices finished lower Thursday, with downward momentum for the precious metal coming amid a Federal Reserve that hinted at a less-accommodative posture than hoped and a dollar that has gained some altitude off two-year lows in the past two sessions. In their discussions, reflected in the minutes from the central bank’s meeting on July 28-19 published a half-hour after Comex metals settled on Wednesday, Fed officials said there had been an increase in uncertainty about the economic outlook since their prior meeting in mid-June. “We are at a very vulnerable spot, and I don’t know what the next shoe to drop will be,” said Richmond Fed President Thomas Barkin, in comments on Wednesday after the release of minutes. However, the decision to hold off on implementing so-called yield-curve control, has been interpreted by some as not as dovish a message from the Fed as had been hoped, which nudged the dollar higher and weighed on bullion. A measure of the U.S. dollar, the ICE U.S. Dollar Index DXY, -0.58%, has been trading on either side of unchanged on Thursday after a roughly 0.5% gain on Wednesday for the gauge against a half-dozen currencies. The dollar had hit its lowest print since 2018 last week. A firmer dollar can undercut the appeal of buying gold for overseas buyers. “The rebound in the US dollar has also sparked a fresh bout of weakness in gold prices which sold off sharply and are now testing support at the $1,920 an ounce, and the renewed uncertainty over the pace of further monetary stimulus from the Federal Reserve,” wrote Michael Hewson, chief market analyst at CMC Markets UK. On Thursday, December gold GCZ20, +2.17% GC00, +2.17% settled $23.80, or 1.2%, at $1,946.50, after declining 2.1% on Wednesday. Meanwhile, September silver prices US:SIU20 shed 19.3 cents, or less than 0.7%, to end at $27.147 an ounce, after gold’s sister commodity declined 2.6% in the previous session. Gold and silver initially added to their declines after U.S. economic reports came in worse than expected. A weekly jobless benefit-claims report and a reading of manufacturing activity in the Philadelphia area, the Philly Fed index, pointed to signs of a weakening recovery in employment and growth in the COVID-19 era. Elsewhere on Comex, September copper US:HGU20 lost 4.85 cents, or 1.6%, to settle at $2.9745 a pound, a day after the industrial metal finished at a two-year high. Meanwhile, October platinum PLV20, +3.99% declined $29.40, or 3.1%, to close at $926.90 an ounce, while September US:PAU20 picked up $7.80, or 0.4%, to settle at $2,186.90 an ounce."}]}