{"article": [{"url": "https://www.marketwatch.com/story/the-obamas-aoc-and-bidens-running-mate-heres-whos-speaking-to-the-democratic-convention-and-when-2020-08-11", "published": 1597681220.0, "headline": "Hereâ\u0080\u0099s how to watch the Democratic convention â\u0080\u0094 plus whoâ\u0080\u0099s speaking, and when", "body": "Coming to a computer screen or TV set near you: the 2020 Democratic National Convention. Coronavirus fears have made the Monday-Thursday event almost entirely virtual, with Joe Biden preparing to accept the partyâ\u0080\u0099s presidential nomination on Thursday from his home state of Delaware instead of in-person in Milwaukee. Biden and running mate Sen. Kamala Harris will speak from the Chase Center in Wilmington. Now read:Democrats to open convention like no other as Bidenâ\u0080\u0099s big party goes virtual. And since the convention this year is largely a visual event, Democrats say there will be plenty of ways to watch it. Speeches are scheduled to run from 9 p.m. to 11 p.m. Eastern each night. Democratsâ\u0080\u0099 own web site will carry the addresses live, and the party says the proceedings will be available on platforms like YouTube GOOGL, +1.82% Â GOOG, +1.97% Â and Facebook FB, +0.26%. Networks like ABC and NBC reportedly plan to carry an hour of live coverage each night, while cable-news outlets like CNN will have coverage before, during and after the regular hours, reports the Milwaukee Journal Sentinel. In addition to Biden and Harris, the speakersâ\u0080\u0099 list contains familiar, party-stalwart names like Bill Clinton and Andrew Cuomo, and also reflects an effort by Biden to join progressives and establishment Democrats. Also see:Hereâ\u0080\u0099s how a Biden presidency could hurt financial stocks. To that end, Sen. Bernie Sanders, the democratic socialist who fought Biden for the nomination, has been given a speaking spot on Monday night, before former first lady Michelle Obama. Rep. Alexandria Ocasio-Cortez, another progressive standard-bearer, will speak Tuesday night. President Donald Trumpâ\u0080\u0099s campaign, eager to paint Biden as beholden to the far left of his party, seized on the New York congresswomanâ\u0080\u0099s inclusion on the roster: iframe.twitter-tweet { width: 100% !important; } Read:Biden leads Trump, 50% to 41%, new poll finds. Former President Barack Obama is scheduled to speak on Wednesday, as is Harris. Biden announced his pick of the California senator as his running mate on Aug. 11, choosing her over other candidates that included former national-security adviser Susan Rice and Rep. Karen Bass. Sen. Elizabeth Warren, who had been another possible pick, is also slated to speak Wednesday. Read on:Hereâ\u0080\u0099s the stock sector you want to be in if the Democrats sweep the November elections. Below is a selection of speakers for each night. Monday, Aug. 17: Sen. Bernie Sanders of Vermont, an independent Gov. Andrew Cuomo of New York Former Gov. John Kasich of Ohio, a Republican Former first lady Michelle Obama Tuesday, Aug. 18: Former acting U.S. Attorney General Sally Yates Rep. Alexandria Ocasio-Cortez of New York Former President Bill Clinton Former second lady Jill Biden Wednesday, Aug. 19: Former Secretary of State Hillary Clinton Sen. Elizabeth Warren of Massachusetts Sen. Kamala Harris of California Former President Barack Obama Thursday, Aug. 20: Sen. Cory Booker of New Jersey Sen. Tammy Duckworth of Illinois Sen. Chris Coons of Delaware Joe Biden Also see: Hereâ\u0080\u0099s how Goldman says the S&P 500 would react to more U.S.-China tariffs and why Novemberâ\u0080\u0099s election result is key"}]}