{"article": [{"url": "https://www.marketwatch.com/story/fly-lands-on-mike-pences-head-and-threatens-to-become-vice-presidential-debates-breakout-star-2020-10-08", "published": 1602117140.0, "headline": "Fly lands on Mike Pence's head and threatens to become vice-presidential debate's breakout star", "body": "WASHINGTON (AP) - The vice-presidential debate featured plexiglass barriers to prevent the spread of the coronavirus. They were no match for the night's most talked-about intruder - a fly that briefly buzzed around the stage before landing and settling in on Mike Pence's head. The incident went unmentioned onstage, with the Republican vice president and Democratic Sen. Kamala Harris continuing to focus on the discussion of systemic racism in the justice system. The Margin:Why Sen. Kamala Harris's telling Vice President Mike Pence, 'I am speaking,' is resonating with so many women But as the insect took up residence on Pence's white hair, the social-media firestorm was creating more, well, buzz than nearly anything else that occurred. \"That's not on your TV. It's on his head,\" tweeted MSNBC's Rachel Maddow. \"The fly knows,\" tweeted author Stephen King. Others joked about the creature perhaps getting stuck in hair spray - or possibly now being a prime candidate for coronavirus testing. Democratic presidential nominee Joe Biden immediately got in on the act, tweeting a photo of himself clutching an orange fly swatter under the heading \"Pitch in $5 to help this campaign fly.\" Moments later, he tweeted again, this time highlighting \"Flywillvote.com,\" which took users to a website set up for his campaign to help supporters make plans to vote. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Pence had spent much of the night shaking his head in response to Harris's answers. But the vice president didn't appear to notice the fly's arrival. Despite his talking and normal body movements, the hot stage lights and those virus-fighting barriers, the fly was unperturbed. It finally flew away on its own. Wednesday night's visitor wasn't the first fly to take center stage at a presidential debate. In 2016, one briefly landed between Democratic nominee Hillary Clinton's eyes during a town-hall-style debate with Donald Trump. Clinton didn't flinch. President Barack Obama, in contrast, took action when confronted with an airborne distraction during the taping of a television interview in 2009. Obama stopped speaking to swat at a buzzing fly and tell it to \"get out of here.\" As interviewer John Harwood quipped, \"That's the most persistent fly I've ever seen,\" Obama concentrated on its path and caught it in midair. Read on:Debate turns green: Pence refuses to say whether climate change is a threat, while vice-presidential rival Harris evades on Green New Deal"}]}