{"article": [{"url": "https://www.marketwatch.com/story/federal-reserve-leaders-see-bumpier-recovery-slower-decline-in-unemployment-2020-07-07", "published": 1594138760.0, "headline": "Federal Reserve leaders see â\u0080\u0098bumpierâ\u0080\u0099 recovery, slower decline in unemployment", "body": "Senior Federal Reserve leaders say high unemployment is all but certain to persist despite a surge in rehiring in May and June, and that the central bank might have to do more to help the labor market. San Francisco Federal Reserve President Mary Daly noted Tuesday that the coronavirus pandemic has decimated important parts of the economy such as travel, tourism, hotels, restaurants and retail. Those industries lost millions of jobs in the early stages of the pandemic and will have to reimagine how they do business in a era of social distancing in order to survive. Read:U.S. entered recession in February after end of longest expansion in history Although they are slowly bringing jobs back, she said, many companies wonâ\u0080\u0099t rehire all their employees because demand has suffered such a large decline. â\u0080\u009cWe donâ\u0080\u0099t know how long it will fully take to put the virus behind us,â\u0080\u009d she said in a virtual chat held by the National Association of Business Economists. â\u0080\u009cI am assuming [unemployment] will level off at someplace we donâ\u0080\u0099t want to be.â\u0080\u009d Thomas Barkin, president of the Richmond Federal Reserve, concurred. â\u0080\u009cI donâ\u0080\u0099t believe my favorite restaurant will be back to full staff. I donâ\u0080\u0099t think my favorite retailer will be back to full staff.â\u0080\u009d Asked if the Fed will have to do even more to help the economy, Barkin said: â\u0080\u009cUnemployment is 11%, so yes.â\u0080\u009d The official jobless rate fell to 11.1% in June from 13.3% in May, though the actual level of unemployment is probably at least several points higher, economists contend. Daly said the unemployment rate alone is not enough to understand â\u0080\u009call the pain and dislocationâ\u0080\u009d caused by massive job losses. The economy shed more than 22 million jobs in March and April and has only recovered about one-third of them. Read:U.S. regains 4.8 million jobs in June. Is rehiring poised to slow? What worries Fed officials especially now is the recent flareup in coronavirus cases and the potential damage to a fragile U.S. economic recovery. â\u0080\u009câ\u0080\u009cThere are a couple of things that we are seeing and some of them are troubling and might suggest that the trajectory of this recovery is going to be a bit bumpier than it might otherwise,â\u0080\u009d Atlanta Fed President Raphael Bostic said in an interview published Tuesday in the Financial Times. Daly said sheâ\u0080\u0099s paying close attention to banks to make sure another tripwire isnâ\u0080\u0099t triggered. If unemployed people canâ\u0080\u0099t pay the rent, for example, that would prevent landlords from paying back bank loans and ultimately put more stress on the financial system, she noted. Read:U.S. recoups 6.5 million jobs in May, but hiring to slow on coronavirus flareups Both Daly and Barkin also said states and local governments are sure to get hit hard in the coming months, adding to the economyâ\u0080\u0099s woes. Tax revenues have tumbled even as financial demands on government increases. â\u0080\u009cThey are going to have to make hard choices,â\u0080\u009d said Daly over which taxes to increase and what spending to cut. One thing Fed officials are not worried about right now is inflation. Barkin said a global slump in demand means it will be hard for most companies to try to raise prices. â\u0080\u009cItâ\u0080\u0099s a low-inflation world,â\u0080\u009d he said, and will probably remain that way for the foreseeable future."}]}