{"article": [{"url": "https://www.marketwatch.com/story/pathological-behavior-by-pension-fund-trustees-blows-billions-on-real-estate-11602003432", "published": 1601990840.0, "headline": "â\u0080\u0098Pathologicalâ\u0080\u0099 behavior by pension fund trustees leads to billions blown on real estate", "body": "Jack Nicholson as That Crazy Pension Fund Manager Warner Bros/Courtesy Everett Collection Ouch. Finance professor Timothy Riddiough says some of the people running Americaâ\u0080\u0099s 6,000 state and local public pension plans are exhibiting â\u0080\u009cpathological investment behaviors.â\u0080\u009d No, really. Pathological. (At least, he says, from the perspective of classical financial economics perspective.) These pension fund managers invest in the same assets, then hope to beat the market, he says. They take foolish bets to try to get out of their funding crisis, like gamblers hoping to win backÂ theirÂ losses. They engage in â\u0080\u009cdelusional benchmarking, giving themselves Aâ\u0080\u0099s and Bâ\u0080\u0099s for C and D work.â\u0080\u009d Oh, and they are pouring somewhere nearing 10% of their membersâ\u0080\u0099 money into private real estate ventures that have a dismal track record and which they wonâ\u0080\u0099t be able to exit easily if they need to. Like I said: Ouch. Riddiough is a finance professor at the University of Wisconsin and an expert in real-estate investment trusts. He holds the department chair in urban land and real estate economics. And his comments matter not only for his expertise but because they come in an extraordinary and detailed takedown of public pension funds, especially their fondness for â\u0080\u009cprivate equity real estateâ\u0080\u009d funds. The National Association of State Retirement Administrators, the organization that represents the managers, disagreed. â\u0080\u009cPublic pension funds are long-term investors and invest in diversified portfolios that are intended to maximize investment returns within an acceptable level of risk,â\u0080\u009d the organization said in a statement. â\u0080\u009cAs a group, public pension funds invest around 7% of their assets in real estate. As part of their required due diligence, public pension funds continually review their asset allocations and risk profiles to ensure they are optimizing risk and investment return.â\u0080\u009d It added: â\u0080\u009cAlthough the report author accuses public pension fund managers of a â\u0080\u0098herd mentality,â\u0080\u0099 in fact, many public pension funds do not invest in real estate at all, and among those that do, there is a wide range in the percentage of their portfolio that is invested in real estate. Moreover, the authorâ\u0080\u0099s attempts to link growing pension underfunding to increased allocations to real estate are purely speculative: public pension funds have been diversifying their portfolios for many years after investing predominantly in just two asset classes: public equities and bonds. Such diversification is prudent and part of a sound investment and risk management strategy.â\u0080\u009d In a nutshell, Riddiough cites detailed industry data showing that these private funds have underperformed publicly traded real-estate investment trusts, the kind anybody can buy on the stock market or through a money manager like Vanguard, by a country mile. He also cites data showing there is no evidence any individual managers have any particular, persistent skill worth paying for. Since reliable records began back in the late 1970s, these private REITs overall have trailed the ones available through the stock market by an average of more than 5 percentage points a year, according to industry data. Someone who had put their money in public REITs back then would today â\u0080\u009cbe nearly 7-times better offâ\u0080\u009d than someone who backed the private funds, he says. Seven times better off. Yet public pension funds keep buying them, year after year. State and local pension funds may now account for about half of all the money in these private equity real-estate funds. Weâ\u0080\u0099re talking tens, even hundreds, of billions of dollars. These comments come just as Boston Collegeâ\u0080\u0099s Center for Retirement Research warns that public pension funds have just booked an absolutely terrible fiscal year (which is typically measured fromÂ July 1Â to June 30). That, it adds, is even despite the massive stock market rebound in the spring, and the soaring prices for bonds. Average returns during the fiscal year: 1.75%, or barely a quarter of targets. Erâ\u0080¦they could have made more than four times as much, or 8.1%, in Vanguardâ\u0080\u0099s Balanced Index Fund VBINX, +0.52% over the same time. They managed to underperform the basic, ACWI global stock index, which gained more than 2% and which they could have owned through a single exchange-traded fund, like this ACWI, +0.85%. And they were way, way behind things like long-term U.S. Treasury bonds VUSTX, -0.06% and TIPS VIPSX, -0.07%, which earned you better than 20%. The pension fundsâ\u0080\u0099 target returns for the year averaged about 7.2%, Boston College calculates. Oops. Pew Charitable Trust recently estimated that the total funding shortfall just for the 50 plans run at state level came to $1.3 trillion, meaning thatâ\u0080\u0099s how much more they owe in payouts than they have in assets. Oh, and that was in 2018, so weâ\u0080\u0099re out of date. The good news? Any Joe or Joanna Public can invest in real estate easily, without having to have any access to exclusive, overpriced, illiquid private equity real-estate funds. Iâ\u0080\u0099m not trying to bang any drum for Vanguard, but their Real Estate Index Fund VNQ, -0.39% and International Real Estate Index Fund VNQI, +0.18% are among the easy options you can buy and forget about. Oh, and overall public REITs have been an excellent long-term investment."}]}