{"article": [{"url": "https://www.marketwatch.com/story/heres-how-the-us-could-save-45000-people-from-dying-of-covid-19-by-november-2020-07-07", "published": 1594159220.0, "headline": "Here's how the U.S. could save 45,000 people from dying of COVID-19 by November", "body": "A new model by the University of Washington is projecting more than 200,000 U.S. coronavirus deaths by November, though it says it's not too late to take a simple step that could save tens of thousands of lives. The latest projection by the university's Institute for Health Metrics and Evaluation shows the U.S. death toll hitting at least 208,255 by Nov. 1, if current conditions hold up. However, that total drops to 162,808 if 95% of the population wears a face mask, researchers said. \"As we all have come to recognize, wearing masks can substantially reduce transmission of the virus,\" IHME Director Dr. Christopher Murray said in a statement. \"Mask mandates delay the need for re-imposing closures of businesses and have huge economic benefits. Moreover, those who refuse masks are putting their lives, their families, their friends, and their communities at risk.\" To date, the U.S. has logged about 132,000 deaths, according to data compiled by Johns Hopkins University. Without new national mask requirements, the IHME found coronavirus deaths are likely to significantly increase starting in mid- to late September, as seasonal flu season begins. University of Washington Institute for Health Metrics and Evaluation \"We can now see the projected trajectory of the epidemic into the fall, and many states are expected to experience significant increases in cases and deaths in September and October,\" Murray said. \"The U.S. didn't experience a true end to the first wave of the pandemic. This will not spare us from a second surge in the fall, which will hit particularly hard in states currently seeing high levels of infections.\" The projection takes into account three possible scenarios: one if no additional action is taken, one if strong social-distancing mandates are reimposed in the hardest-hit areas, and one if strong social-distancing mandates are combined with 95% of the population wearing masks when in public. The institute said the projection could be even worse if infections spread to more at-risk populations, since the data currently includes a recent spike in infections in younger people, who have a lower risk of dying from COVID-19."}]}