{"article": [{"url": "https://www.marketwatch.com/story/ipo-market-is-headed-for-busiest-third-quarter-since-the-dotcom-years-and-theres-lots-more-to-come-2020-09-28", "published": 1601385920.0, "headline": "IPO market is headed for busiest third quarter since the dot-com years", "body": "The U.S. initial public offering market is expected to see 11 deals and two direct listings this week, adding fuel to what will be the biggest third quarter since the dot.com era. Data-mining-software company Palantir Technologies PLTR, -0.50% and workplace collaboration and planning software provider Asana ASAN, -3.12% are expected to go public on Wednesday via the first direct listings of 2020, according to media reports. Palantir is expected to list with a market value of nearly $20 billion, the Wall Street Journal reported. In a direct listing, a company floats existing shares on an exchange and lets the market decide the price. Palantir’s bankers have told investors the shares could start trading around $10 a pop, the paper reported. Asana is expected to list with a market value of more than $5 billion, according to Renaissance Capital, an operator of IPO exchange-traded funds and provider of institutional research. “Recent software IPOs have outperformed, although direct listings historically haven’t seen the same enthusiasm: last year’s sole direct listing, Slack Technologies WORK, +3.36%, last closed up 5% from its reference price, while 2018 direct listing Spotify SPOT, +0.08% saw little action until soaring more than 100% in the 2Q as usage spiked during the pandemic,” Renaissance Capital co-Founder and Chief Executive Bill Smith said in commentary. See:Palantir plans to go public as it moves away from reliance on government work The IPO market is ending the busiest third quarter for deals since 2000, with 81 IPOs expected to raise $28.5 billion, according to Smith. The high volume of deals and some very big ones have made it the biggest quarter measured by proceeds since the third quarter of 2014, when Alibaba Group Holding Inc. BABA, -0.26% went public, raising $25 billion in what was the biggest deal ever. That deal is expected to be eclipsed by the flotation of Ant Group, the payments company that was set up to serve Alibaba in 2004 and was spun off in 2011. Read: Ant Group IPO: Five things to know about the Alibaba affiliate aiming for the largest offering in history IPOs have performed strongly, too, despite the pressures of the coronavirus pandemic, with an average first-day gain of 39%. The Renaissance IPO ETF IPO, +1.98% gained 27% in the quarter, compared with the S&P 500’s SPX, +0.87% roughly 6% gain. Health care deals accounted for about half of the deal total and the sector expanded beyond small biotechs to include some bigger health services companies, including names like Outset Medical OM, -4.47%, GoHealth GOCO, -1.84% , Oak Street Health OSH, -0.79% and American Well Corp. AMWL, -8.90% Read: A new breed of tech IPOs may give the stock market reason to party like it’s 1999 The quarter also saw a flurry of big tech deals, led by Snowflake Inc. SNOW, -0.91%, which marked the biggest ever software IPO when it raised $3.36 billion. Other standouts included Rocket Cos. RKT, +1.01%, parent of mortgage lender Quicken Loans, Unity Software U, +8.43% and telehealth company GoodRx Holdings GDRX, -2.40%. Don’t miss:Snowflake IPO surge makes it the priciest tech stock by a mile See:Quicken Loans is going public: 5 things to know about the mortgage lender “The 10 largest IPOs raised a combined $14.7 billion, or 52% of the quarter’s proceeds, and included seven billion-dollar deals, the most ever in a quarter,” said Smith. The blank-check trend continued at a fierce pace, he said. So-called special purpose acquisition corporations, or SPACs, raised $28 billion in the quarter in 75 deals, a record that was more than triple the previous record quarter. Average SPAC size was boosted by Pershing Square Tontine PSTH, +1.11%, a SPAC led by billionaire investor Bill Ackman, that raised a record $4 billion with the aim of acquiring “mature unicorns.” SPACs have no business when they go public, but seek to acquire one or more as soon as they have raised funds. At quarter end, there were 42 public SPACs with pending deals, 142 still seeking deals and another 63 on file to go public, according to Renaissance. Read also:The CEO who made one of Silicon Valley’s worst acquisitions wants a $400 million blank check “By many measures, SPACs have gone mainstream, featuring famed business leaders, bulge bracket investment banks, white shoe law firms, institutional investors, and billion-dollar acquisition targets. For investors, new SPACs offer potential upside from warrants and a favorable merger announcement, with the ability to redeem shares at cost,” said Smith. “That said, SPACs have historically underperformed post-acquisition, a trend that will need to improve in order for SPAC mania to continue.” For more, see: 2020 is the year of the SPAC — yet traditional IPOs offer better returns, report finds Outside of the SPAC arena, the IPO market is looking strong heading into the fourth quarter with 99 new filings in the third quarter, up 68% from the same period a year ago. This week’s biggest IPO is expected to be that of Chinese data center operator Chindata Group Holdings, which is aiming to raise $500 million at a $4.5 billion market cap. The company operates hyperscale data centers in China, and one in Malaysia, and is expanding in China and India. U.S. retailer Academy Sports and Outdoors ASO, +0.15% is aiming to raises $250 million, bringing another sporting goods and outdoor activities retailer to public markets. Avocado supplier Mission Produce is aiming to raise $150 million in a deal that could value the company at $1.18 billion. See: 5 things to know about avocado producer Mission Produce before it goes public Rounding out the list: Oncology biotech C4 Therapeutics CCCC, -5.00% is aiming to raise $150 million to finance preclinical programs; Yalla Group YALA, -4.44%, a Dubai-based social network is aiming to raise $149 million; Pulmonx LUNG, -2.01%, a medical device company, is seeking to raise $100 million; Orphazume, a Danish rare disease biotech, is seeking to raise $100 million; cancer treatment biotech Oncorus ONCR, +1.68% is aiming to raise $87 million; Chinese pet-centered online platform Boqii Holding BQ, +8.78% is aiming to raise $77 million; oncology biotech IMNM, -1.79% s seeking to raise $30 million; and finally, Chinese education services provider Lixiang Education LXEH, is aiming to raise $33 million."}]}