{"article": [{"url": "https://www.marketwatch.com/story/trump-on-faucis-early-response-to-the-coronavirus-pandemic-he-was-wrong-fauci-disagrees-i-think-im-pretty-effective-2020-07-19", "published": 1595309960.0, "headline": "Trump vs. Fauci: The president says, â\u0080\u0098He was wrongâ\u0080\u0099; the doctor responds, â\u0080\u0098I donâ\u0080\u0099t regret anything I saidâ\u0080\u0099", "body": "The war of words between the Trump administration and Anthony Fauci, one of the leading experts on pandemics in the U.S. for the last four decades, continues. Appearing on Fox News with Chris Wallace, President Trump said there was no campaign to discredit Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases for three decades. Wallace asked Trump about a Facebook FB, +0.26% Â post by Daniel Scavino, White House deputy chief of staff for communications, depicting Fauci as a faucet with the description: â\u0080\u009cSorry, Dr. Faucet! At least you know if Iâ\u0080\u0099m going to disagree with a colleague, such as yourself, itâ\u0080\u0099s done publicly â\u0080\u0094 and not cowardly, behind journalists with leaks.â\u0080\u009d Trump did not quite dismiss Scavinoâ\u0080\u0099s criticisms. “ â\u0080\u0098Well, I donâ\u0080\u0099t know that heâ\u0080\u0099s a leaker. Heâ\u0080\u0099s a little bit of an alarmist. Thatâ\u0080\u0099s OK. A little bit of an alarmist.â\u0080\u0099 ” â\u0080\u0094 President Donald Trump on Anthony Fauci The president suggested that the doctor mishandled the crisis: â\u0080\u009cDr. Fauci at the beginning said, â\u0080\u0098This will pass. Donâ\u0080\u0099t worry about it. This will pass.â\u0080\u0099 He was wrong.â\u0080\u009d Trump also said the doctor said, â\u0080\u009c â\u0080\u0098Donâ\u0080\u0099t ban China. Donâ\u0080\u0099t ban China.â\u0080\u0099 I did. He then admitted that I was right.â\u0080\u009d On April 13, when reporters questioned Fauci about possible tension between him and the White House, Fauci said he made recommendations to Trump to restrict travel. â\u0080\u009cAnd the answer was yes,â\u0080\u009d Fauci said. â\u0080\u009cAnd then another time was, â\u0080\u0098We should do it with Europe,â\u0080\u0099 and the answer was yes. And the next time, â\u0080\u0098We should do it with the U.K.,â\u0080\u0099 and the answer was yes.â\u0080\u009d Related:Fauci takes aim at Trump, state lawmakers and young Americans: â\u0080\u0098Youâ\u0080\u0099re propagating the pandemicâ\u0080\u0099 Fauci has taken a more defiant tone of late, telling InStyle magazine, â\u0080\u009cWith all due modesty, I think Iâ\u0080\u0099m pretty effective. I certainly am energetic. And I think everybody thinks Iâ\u0080\u0099m doing more than an outstanding job.â\u0080\u009d He said he evolved with the situation: â\u0080\u009cI donâ\u0080\u0099t regret anything I said then because in the context of the time in which I said it, it was correct.â\u0080\u009d He said, â\u0080\u009cWe were told in our task-force meetings that we have a serious problem with the lack of PPEs and masks for the health providers who are putting themselves in harmâ\u0080\u0099s way every day to take care of sick people,â\u0080\u009d adding, â\u0080\u009cWhen it became clear that the infection could be spread by asymptomatic carriers ... we had to strongly recommend masks.â\u0080\u009d “ Fauci has said that the U.S. government should promote social distancing and could do better with contact tracing. ” The doctor also said SARS-CoV-2, the novel coronavirus that causes the disease known as COVID-19, will continue to spread unless everyone steps up their game. Fauci said that many states have reopened too quickly, and, addressing people who donâ\u0080\u0099t advocate social distancing, he said, â\u0080\u009cYou're propagating the pandemic.â\u0080\u009d As of Tuesday, COVID-19 had infected 14.7 million people globally. It had killed over 610,149 people worldwide. COVID-19 has claimed 140,909 lives in the U.S. At least 3.8 million people were infected with the virus. New York, the epicenter of the virus in the U.S., has still had the most deaths of any state (32,506), followed by New Jersey (15,715) and Massachusetts (8,433). Fauci has repeatedly said that the U.S. government should promote social distancing and could do better with contact tracing, the process of tracking people who have been in contact with someone who has the virus, and instructing them to stay home for 14 days. â\u0080\u009cI donâ\u0080\u0099t think weâ\u0080\u0099re doing very well, for a number of reasons, and not all of which is the fault of the system.â\u0080\u009d Related:Defiant Fauci tells InStyle magazine: â\u0080\u0098With all due modesty, I think Iâ\u0080\u0099m pretty effectiveâ\u0080\u0099 The World Health Organization currently estimates that 16% of people with COVID-19 are asymptomatic and can transmit the coronavirus, while other data show that 40% of coronavirus transmission is due to carriers not displaying symptoms of the illness. As a result, public health officials have advised people to keep a distance of 6 feet from one another. A recent University of California, San Francisco, study found that thereâ\u0080\u0099s a high load of SARS-CoV-2 shedding in the upper respiratory tract, even among pre-symptomatic patients, â\u0080\u009cwhich distinguishes it from SARS-CoV-1, where replication occurs mainly in the lower respiratory tract.â\u0080\u009d Such a viral load makes symptom-based detection of infection less effective in the case of SARS CoV-2, it said. The markets appear torn between optimism on vaccine research and the economic impact of new surges in southern and southwestern states. The Dow Jones Industrial Index DJIA, +0.56% Â closed higher Monday, as investors looked toward the prospect of further fiscal stimulus. The S&P 500 SPX, +0.87% Â and Nasdaq Composite COMP, +1.39% Â also ended higher. How COVID-19 is transmitted"}]}