{"article": [{"url": "https://www.marketwatch.com/story/oil-futures-see-muted-trade-thursday-as-coronvirus-concerns-swirl-2020-07-09", "published": 1594308560.0, "headline": "Oil falls, with U.S. benchmark settling back under $40 as coronavirus concerns swirl", "body": "Oil futures fell on Thursday, with U.S. benchmark prices settling back below $40 a barrel, as commodity traders contended with rising cases of coronavirus in the U.S. and some other countries that may threaten to unsettle demand for crude. U.S. prices on Wednesday “remained resilient” to the surprise 5.7-million-barrel rise in domestic inventories last week, said Ipek Ozkardeskaya, senior analyst at Swissquote Bank, in a recent note. However, “the short-term direction is unclear, as investors hesitate whether it is a good idea to carry the rally further while the combination of lower demand prospects and higher supply tilts the balance to the opposite direction.” “Inability to extend gains above the $40 mark hints that a downside correction could be around the corner,” he said. August West Texas Intermediate crude US:CLQ20 fell by $1.28, or 3.1%, to settle at $39.62 a barrel on the New York Mercantile Exchange, after climbing 0.7% on Wednesday. Prices finished Thursday at the lowest since for a front-month contract June 30, according to Dow Jones Market Data. US:CLQ20 Global benchmark Brent oil for September UK:BRNU20 lost 94 cents, or 2.2%, at $42.35 a barrel on the ICE Futures Europe exchange. It settled at the lowest since July 1. Prices for both WTI and Brent on Wednesday marked their highest settlements since March 6. “Oil seems ripe for a pullback here and if the demand outlook shows further signs of faltering, WTI could settle back towards the mid-$30s,” said Edward Moya, senior market analyst at Oanda. Meanwhile, feeding expectations for a slowdown in economic recovery and weakness in energy demand, the U.S. reported more than 58,000 new coronavirus cases on Wednesday, according to data compiled by Johns Hopkins University. Infections have topped 3 million in the country, with world-wide cases exceeding 12 million. India reported 24,879 new cases, taking its total to 767,296, The Wall Street Journal reported, citing data from the country’s Ministry of Health and Family Welfare. Still, a weekly fall in U.S. gasoline supplies suggested an improvement in energy appetite. “Gasoline stocks have lots to do with sheltering the oil price as they declined by amounts that were not expected and showed that road fuel demand is becoming robust again,” wrote Louise Dickson, oil markets analyst at Rystad Energy, in a Thursday note. “Such news would normally lift the market, but under the current conditions they just help oil prices largely maintain their levels, instead of falling much by COVID-19-related negativity,” the analyst wrote. On Wednesday, the Energy Information Administration reported that U.S. crude inventories rose by 5.7 million barrels for the week ended July 3, but gasoline stockpiles decreased by 4.8 million barrels. On Thursday, August gasoline US:RBQ20 fell 3.1% to $1.2505 a gallon, on the heels of a nearly 1.3% gain a day earlier. August heating oil US:HOQ20 edged down by nearly 0.9% to $1.2239 a gallon. Natural-gas futures turned lower by the settlement on Thursday, following losses among their energy peers. The EIA reported Thursday that domestic supplies of natural gas rose by 56 billion cubic feet for the week ended July 3. That was generally in line the average increase of 55 billion forecast by analysts polled by S&P Global Platts. August natural gas US:NGQ20 finished at $1.779 per million British thermal units, down 2.5%."}]}