{"article": [{"url": "https://www.marketwatch.com/story/walgreens-to-cut-over-4000-jobs-at-boots-on-a-dark-day-for-uk-jobs-2020-07-09", "published": 1594387760.0, "headline": "Walgreens to cut over 4,000 jobs at Boots on a dark day for U.K. jobs", "body": "Walgreens Boots Alliance WBA, -1.96% is to cut 4,000 jobs at pharmacy chain Boots in a dark day for U.K. jobs as the impact of coronavirus lock downs takes it toll on workers. It joined department store John Lewis and fast-food chain Burger King announcing large scale cuts on Thursday as companies look to restructure themselves as lockdown measures are lifted. Meanwhile in the U.S., United Airlines UAL, +0.32% warned 36,000 employees on Wednesday that their jobs could be at risk and government figures on Thursday showed 33 million people claiming unemployment benefits. Walgreens announced a $2 billion impairment charge citing “ongoing uncertainty due to Covid-19” and its third quarter operating loss in Boots U.K. Read: Walgreens stock falls after reporting $2 billion impairment due to Covid-19 Footfall, a measure of how many people visit a shopping center, in Boots U.K. stores fell by 85% in April as shoppers were advised to only leave home for essential goods, leaving its beauty and fragrance counters practically empty. It said it would cut 7% of its workforce as part of a restructuring which will also include closing 48 Boots opticians. “We recognize that today’s proposals will be very difficult for the remarkable people who make up the heart of our business, and we will do everything in our power to provide the fullest support during this time,” said Boots managing director Sebastian James. Meanwhile John Lewis, a nationwide department store announced it was closing eight stores which could lead to 1,300 job losses. The chain said coronavirus had accelerated the shift to online shopping and it would reflect this in its investment. ”We believe closures are necessary to help us secure the sustainability of the Partnership — and continue to meet the needs of our customers however and wherever they want to shop,” John Lewis chairman Sharon White said. The job losses came after the boss of Burger King U.K. said it may have to close a 10th of its restaurants which could take a further 1,600 jobs. Read:Dark day for workers as thousands lose jobs including 15,000 at Boeing rival Airbus Alasdair Murdoch said during a BBC podcast: “We don’t want to lose any. We try very hard not to, but one’s got to assume somewhere between 5% and 10% of the restaurants might not be able to survive.” The U.K. government unveiled a £30 billion plan on Wednesday to prevent mass unemployment which will cut taxes on the hospitality industry and offer people state-subsidised meals out. “People need to know that although hardship lies ahead, no one will be left without hope. Our plan has a clear goal: to protect, support and create jobs,” finance minister Rishi Sunak told British lawmakers."}]}