{"article": [{"url": "https://www.marketwatch.com/story/facebook-shares-drop-7-as-unilever-halts-advertising-prompting-changes-at-social-networking-giant-2020-06-26", "published": 1593355760.0, "headline": "Facebook reverses policies as ad boycott sends stock down", "body": "Facebook Inc. Chief Executive Mark Zuckerberg implemented policy changes during a virtual town hall meeting Friday as more major advertisers joined a boycott of the platform and shares sank sharply. Facebook FB, +0.26% , which gleans nearly all of its revenue via advertising, saw its stock drop 8% in Friday trading after Unilever UL, +1.44% halted advertising on Facebook, Instagram and Twitter Inc. TWTR, -0.23% in the U.S. “through at least the end of the year.” Unilever’s brands include Dove and Ben & Jerry’s, and the London-based multinational spent more than $11.8 million in the U.S. this year on Facebook, according to marketing analytics firm Pathmatics. “Continuing to advertise on these platforms at this time would not add value to people and society. We will be monitoring ongoing and will revisit our current position if necessary,” Luis Di Como, Unilever’s executive vice president of global media, said in a statement, citing hate speech and divisive content on the platforms. On Sunday, Starbucks Corp. SBUX, +0.53% joined the Facebook ad boycott. Late Friday, it was Coca-Cola Co. KO, +0.69% . “Starting on July 1, The Coca-Cola Company will pause paid advertising on all social media platforms globally for at least 30 days,” Coca-Cola CEO James Quincey said in a statement on the company’s website. “We will take this time to reassess our advertising standards and policies to determine whether revisions are needed internally, and what more we should expect of our social media partners to rid the platforms of hate, violence and inappropriate content. We will let them know we expect greater accountability, action and transparency from them.” In a live town hall meeting broadcast on his Facebook profile page Friday, Zuckerberg announced several steps to eliminate hateful content in ads, tamp down on false claims leading to the 2020 elections, and make progress on racial justice. He added Facebook will hide or block content considered hateful or that could harm voting, with no exception for politicians, as Twitter has done to President Trump and others. Zuckerberg had previously spoken out against Twitter’s approach. “We invest billions of dollars each year to keep our community safe and continuously work with outside experts to review and update our policies,” a Facebook spokesperson said in a statement emailed to MarketWatch. “We’ve opened ourselves up to a civil rights audit, and we have banned 250 white supremacist organizations from Facebook and Instagram. The investments we have made in AI mean that we find nearly 90% of Hate Speech we action before users report it to us, while a recent EU report found Facebook assessed more hate speech reports in 24 hours than Twitter and YouTube. We know we have more work to do, and we’ll continue to work with civil rights groups, GARM, and other experts to develop even more tools, technology and policies to continue this fight.” Nick Clegg, Facebook’s vice president of global affairs and communications, conceded Sunday on CNN that “people want to put pressure on Facebook to do more. That’s why we made those additional announcements on Friday. That’s why we’ll continue to redouble our efforts, because, you know, we have a zero tolerance approach to hate speech.” Facebook has little choice. Unilever’s decision marked a significant escalation in Madison Avenue’s efforts to force changes by Facebook and others. More than 90 marketers — including Verizon Communications Inc. VZ, +0.23% , Recreational Equipment Inc., Honda Motor Co. HMC, -1.21% , Patagonia Inc., VF Corp., and The North Face — have announced their intention to pause advertising on Facebook since civil-rights groups including the Anti-Defamation League and NAACP called on brands to pull ad spending from Facebook for July. See also: Verizon is latest to pull ads from Facebook over hate speech, misinformation on platform Procter & Gamble Co. PG, +0.89% , which has been linked to joining the boycott, declined to comment. “We are not commenting further on individual networks, programs or platforms in reference to our plans,” a spokesperson told MarketWatch in a statement. “Our plan and path is broad and, as always, we work collaboratively and directly with our partners on our advertising decisions.” Facebook’s change in policy highlights the increased pressure it faces in a nation roiled by pandemic and protests. “The decision by Unilever to join the boycott of Facebook illustrates that the pressure is likely to increase,” said Paul Barrett, deputy director of the NYU Stern Center for Business and Human Rights."}]}