{"article": [{"url": "https://www.marketwatch.com/story/oil-up-over-5-as-traders-monitor-trumps-health-norway-output-curtailed-by-strike-11601908466", "published": 1601911220.0, "headline": "Oil settles over 5% higher with traders optimistic on Trump's health, Norway output curtailed by strike", "body": "Tom Little/Agence France-Presse/Getty Images Oil futures settled with a gain of more than 5% on Monday as optimism surrounding President Donald Trump's COVID-19 treatments fueled risk-on sentiment. Traders also weighed prospects for another round of stimulus in the U.S. and monitored a strike that is curtailing crude output in Norway. Oil's rise is \"tied into broader market strength,\" with prices up after posting a losses in the latter half of last week and U.S. equity benchmarks strengthening after selling off on Friday, said Robbie Fraser, senior commodity analyst at Schneider Electric. President Trump also said Monday afternoon that he will leave Walter Reed hospital this evening after a 3-day stay and course of experimental drug therapies for COVID-19. West Texas Intermediate crude for November delivery CLX20, -1.62% CL.1, -1.62% climbed $2.17, or 5.9%, to settle at $39.22 a barrel on the New York Mercantile Exchange, following losses in the past two sessions. December Brent crude BRNZ20, -0.07%, the global benchmark, advanced $2.02, or 5.1%, to $41.29 a barrel on ICE Futures Europe. That marked its first gain in five sessions. WTI oil futures dropped nearly 8% last week, while Brent fell more than 7%. Trump was diagnosed with COVID-19 late last week. Doctors and White House staff offered conflicting accounts of the president's condition over the weekend. Diminished fears of political turmoil around Trump's health and ideas that prospects for another round of aid spending out of Washington are improving were credited with improving overall market sentiment, analysts said. Meanwhile, Norwegian oil-and-gas major Equinor ASA said Monday that four fields in the North Sea have been shut down due to a strike. That brings the total number of fields affected by the strike to six, which, according to the Norwegian Oil and Gas Association could see as much as 330,000 barrels of oil equivalent lost per day. That's equal to around 8% of Norway's oil and gas production, according to Commerzbank. But Carsten Fritsch, commodity analyst at Commerzbank, said the strike in Norway on its own wouldn't justify a sustained rally in prices. \"During the last strike in June 2019, Norwegian oil production fell by a monthly average of around 200,000 barrels per day but recovered quickly afterwards,\" Fritsch wrote. \"In the current environment, every barrel of crude oil fewer that Norway produces could actually be welcome, even if it is only temporary.\" Fritsch noted that oil output in Libya is rising at the same time, hitting 270,000 barrels a day at the end of last week. Back on Nymex, prices for petroleum products settled up sharply, with November gasoline RBX20, -2.11% tacking on 6.3% to $1.1941 a gallon and November heating oil HOX20, -0.05% up nearly 4.5% at $1.1333 a gallon. November natural gas NGX20, +5.17% ended at $2.615 per million British thermal units, up 7.3%. Another storm threatened to disrupt energy production in the Gulf of Mexico, with Tropical Storm Delta expected to strengthen into a hurricane late Monday or Tuesday, according to the National Hurricane Center. It's forecast to move into the southeastern Gulf of Mexico Tuesday night or early Wednesday. Delta follows energy disruptions caused by Hurricane Sally last month."}]}