{"article": [{"url": "https://www.marketwatch.com/story/international-uproar-on-uk-bid-to-amend-its-signed-deal-with-eu-2020-09-10", "published": 1599738920.0, "headline": "After Britain tries to rewrite its â\u0080\u0098Brexitâ\u0080\u0099 from the EU treaty, can it ever strike trade deals with the U.S. and others?", "body": "The U.K. government on Wednesday submitted a bill reneging on significant parts of the withdrawal agreement signed last year with the European Union ahead of Brexit, notably relating to the circulation of goods between Northern Ireland and Great Britain. Critics saw this as an unprecedented attempt to modify unilaterally an international treaty. â\u0080¢ After the governmentâ\u0080\u0099s top lawyer resigned in opposition to the bill, cabinet minister Brandon Lewis admitted that the bill broke international law, albeit â\u0080\u009cin a very specific and limited way.â\u0080\u009d â\u0080¢ Talks on a future trade deal are continuing nonetheless, after David Frost and Michel Barnier, the “ â\u0080\u0098If we lose our reputation for honoring the promises we make, we will have lost something beyond price that may never be regained.â\u0080\u0099 ” â\u0080\u0094 John Major U.K. and EUâ\u0080\u0099s respective Brexit czars, met earlier this week for the latest round of negotiations. Officials from both sides separately held an emergency meeting to sort out the legal ramifications of the U.K.â\u0080\u0099s latest move. â\u0080¢ â\u0080\u009cFor generations ... our signature on any treaty or agreement has been sacrosanct,â\u0080\u009d John Major, the former Conservative prime minister, said on Wednesday. â\u0080\u009cIf we lose our reputation for honoring the promises we make, we will have lost something beyond price that may never be regained.â\u0080\u009d â\u0080¢ Reflecting fears that the U.K.â\u0080\u0099s decision would end up erecting a border between the two Irelands in violation of the Good Friday peace agreement, U.S. House Speaker Nancy Pelosi warned in a tweet that there would â\u0080\u009cbe absolutely no chance of a U.S.-U.K. trade agreement passing the Congressâ\u0080\u009d if that was the case. â\u0080¢ A U.K. government spokesman said on Wednesday that the bill was made necessary by the fact that last yearâ\u0080\u0099s withdrawal agreement â\u0080\u009cwas agreed at pace in the most challenging circumstances,â\u0080\u009d suggesting carelessness in London, even though Prime Minister Boris Johnson had campaigned for the December general election claiming that the deal was â\u0080\u009coven ready.â\u0080\u009d Read:COVID marshals and â\u0080\u0098moonshotâ\u0080\u0099 mass testing â\u0080\u0094 Johnson reveals plans to combat rapid rise in coronavirus cases The outlook: European and British officials still affect hope that a trade deal can be struck, but the attempt to rewrite a treaty signed only a few months ago has undermined trust between the two sides, as noted by European Commission President Ursula von der Leyen. And the international precedent it creates could compromise faith in the U.K. governmentâ\u0080\u0099s commitment to its own signature, which will in turn make it difficult for the country to sign the many bilateral trade deals it wants to sign with others once it has cut its ties with the European single market. Read:AstraZenecaâ\u0080\u0099s coronavirus vaccine setback shows why Big Pharma prefers to be safe than sorry. Which is good news"}]}