{"article": [{"url": "https://www.marketwatch.com/story/planning-to-retire-in-your-60s-heres-a-roadmap-2020-06-02", "published": 1592061620.0, "headline": "Planning to retire in your 60s? Here's a roadmap", "body": "Saving for retirement is a lifelong process. While each saver's journey will look different, there are important considerations to keep in mind for each stage of life. First and foremost, successfully financing your retirement requires a detailed budget that evolves as your income and expenses grow. The savings and investing vehicles you use to get there may change along the way as well. Let's take a look at the retirement savings journey by decade: Get started on the right foot in your 20s When entering the workforce after graduating college, many of us are introduced to health care and retirement benefits for the first time. Some savers are carrying student loan debt and gaining experience managing a complex budget. When you start receiving a consistent paycheck, closely examine what is being withdrawn from your pay. You will see predictable items on the statement such as your gross income, Social Security and Medicare taxes, federal income tax withholding, deductions for health care expenses, retirement savings and other miscellaneous items. After these elements are taken into account, what remains is your take-home pay. This is the number you will use for budgeting purposes. How these Americans save money in retirement: They live in Spain In most cases, you must opt into your company-sponsored plan to start saving for retirement. If you don't see retirement savings being withdrawn from your paycheck, immediately inquire about joining the company plan. There are various retirement savings options available to you. You most likely will have a choice between a 'traditional' contribution and a 'Roth' contribution. A Roth contribution may be more beneficial for individuals under 45 years old. While Roth plans do not offer immediate tax savings, they allow savings to grow tax-deferred. At retirement, those savings can be accessed tax-free, which can work out to be an advantage in retirement for some. When creating your budget, look at your take-home pay and carry it over into a worksheet. Document your regular weekly or monthly expenses such as rent, car payments, insurance, groceries and student loan payments. A mistake people often make is to make retirement savings the last item in a budget. Consider making retirement savings the first line item in your budget, so that any money leftover truly is spending money! While planning your retirement savings, also build an emergency fund equivalent to at least six months of your monthly expenses. Determine how much you can afford to save each month. On a monthly basis, put half of that amount into the emergency fund and half into your retirement savings. Continue doing so until you reach the goal for your emergency fund. At that point, focus on allocating the entire savings each month to retirement. It's critical to establish the habit of saving as early in your financial life as possible. The best way to do so is by adhering to a sensible budget. This will allow your savings and retirement accounts to grow while you learn how to pay bills and manage debt. Many young people tend to be fearful of investing. It is not necessary to have sophisticated investments at this age, as you should be focused on building your savings. Pick a low-cost, target-date fund in your retirement plan that matches your estimated retirement date. Make sure to also be conscious of the fees associated with these investments. Finance major life changes in your 30s By this stage of life, most people are comfortable with their jobs and better understand their budget and benefits packages. Individuals may be getting married and looking to purchase property. Evaluate how much you've been saving for retirement. Ideally, every year you should increase your contributions by several percentage points. Keep your savings rate proportionate to your earnings. Maximize your 401(k) plan contributions to take advantage of any available company match. For 2020, individuals are allowed to contribute a maximum of $19,500 to their 401(k) plan. If you haven't maxed out your 401(k) contributions, work to do so. If you have contributed the maximum to your 401(k), built a stable emergency fund and are not saving to buy a house, look to fund other retirement savings vehicles. Roth IRAs are an option if you will earn less than $124,000 in 2020. These vehicles serve as an additional savings bucket that allow your money to grow tax-deferred. When making large financial commitments, as many people do in their 30s, it may be tempting to borrow against your 401(k) plan. There are certain circumstances that allow you to access your funds before retirement, but there are traps associated with doing so. The first type of loan is for 'any purpose.' In this case, you can borrow up to $5,000 from your plan so long as you repay the loan within five years. Another option that individuals may consider is a loan for a primary residence. This provision essentially allows you to borrow money from yourself and repay it with interest to fund the purchase of real estate. You can borrow up to 50% of your account but not exceed $50,000. This loan can be repaid over 30 years, similar to a mortgage. One of the major problems with this strategy is that the outstanding loan becomes due almost immediately if you leave the employer sponsoring the plan. Regardless of whether the exit is voluntary or involuntary, you have to either repay the loan in its entirety or it will be counted as a distribution, meaning you will pay taxes and an early withdrawal penalty if you are younger than 59½. The early withdrawal penalty is 10% at the federal level, and many states institute additional fees. To secure a stable retirement, do not think of your retirement account as an ATM. Set your contribution rates and forget about the account until it comes time to review those contributions, either annually or due to significant changes in your income. Diversify investments in your 40s At this stage of life, your expenses will likely be higher, but so will your earnings. That being said, take inventory of your full financial picture, which should include a well-diversified portfolio. Carefully consider whether you are maxing out your retirement savings and taking advantage of tax benefits. You should grow your six-month emergency fund proportionately with your income. Check that the contributions to your retirement savings have been adjusted proportionately as well. The free cash flow at the bottom line of your budget is then discretionary. If you have discretionary income, consider making investments beyond your 401(k) and IRA accounts. You may want to invest in income-producing real estate. For example, you can purchase a condo for renovation and rental. As long as you are earning a positive rate of return that is higher than you could generate via other options, real estate is a smart investment capable of producing predictable cash flow. Income is a primary concern in retirement, and real estate can help support this need. Various accessible resources such as podcasts and books offer insight on how to make smart decisions in this area. Think about what kind of lifestyle you want to have in retirement, because that will determine your cash flow needs. Ideally, your retirement account will generate enough income for you to live on in your golden years, so you won't have to touch the principal. Many people fail to plan adequately for retirement and thus their accounts are often underfunded. It is important to diversify your assets and invest in income-producing, alternative investments before you reach retirement age. While it is OK to reward yourself sometimes too, avoid the common pitfall of seeing all this newly available discretionary income as fun money. Evaluate additional protective benefits in your 50s Now is the time to sock away as much money as possible while still enjoying life. As you approach retirement, start scaling back your exposure to equities. When evaluating your finances, the major unknown factor is how many years to plan for in retirement, which also makes it difficult to know how much you need to save. A deferred income annuity, purchased with a lump sum or annual premiums in exchange for guaranteed income at a certain age years down the road, is one possible solution. This insurance policy will allow you to plan your finances until the age that the deferred income annuity kicks in. As a purchaser in your 50s, you present a low risk to insurance companies because they likely do not have to begin making payments for 20 to 30 years. Therefore, the cost should be reasonably affordable, and you would gain some peace of mind by helping to secure your financial future. Research the options and get quotes to determine if a deferred income annuity makes sense for your situation and budget. Strategize end-of-life benefits in your 60s Understand the Social Security and Medicare benefits available to you. Taking into consideration your assets, various insurance policies and eligibility requirements, carefully strategize when you plan to start taking your federal benefits. Additionally, review your estate plan. Ensure that your beneficiaries are up to date and your will is inclusive of any new assets you may have acquired since its inception. At this stage, you should not be exposed to many equities. If you have long-term-care or life insurance, make sure those policies are active and updated as well. A healthy retirement savings strategy is robust and multifaceted. It evolves as your risk profile changes. An emergency fund that grows proportionately with your earnings will help prevent you from tapping into retirement savings should you need quick access to cash. Incorporate your full financial picture into the strategy and adjust your budget as finances change. Remember that saving for retirement is a marathon, not a sprint! Chad Parks is founder and chief executive of Ubiquity Retirement + Savings, a financial technology company providing online, flat-fee retirement plans for the small business market."}]}