{"article": [{"url": "https://www.marketwatch.com/story/u-s-tariffs-on-china-are-illegal-says-world-trade-organization-01600197030", "published": 1600183100.0, "headline": "U.S. tariffs on China are illegal, says World Trade Organization", "body": "The decision marks the first time that the WTO has ruled against a series of high-profile tariffs that President Donald Trump's administration has imposed on allies and rivals alike. Trump has repeatedly claimed that the WTO treats the U.S. unfairly. AP Photo/Manuel Balce Ceneta GENEVA (AP) — A World Trade Organization panel ruled Tuesday that Trump administration tariffs on $200 billion worth of Chinese goods are illegal, vindicating Beijing even if the United States has all but incapacitated the WTO’s ability to hand down a final, binding verdict. The decision marks the first time that the Geneva-based trade body has ruled against a series of high-profile tariffs that President Donald Trump’s government has imposed on a number of countries — allies and rivals alike. Trump has repeatedly claimed that the WTO treats the U.S. unfairly. In its decision, the WTO’s dispute settlement body ruled against the U.S. government’s argument that China has wrongly engaged in practices harmful to U.S. interests on issues including intellectual property theft and technology transfer. The ruling, in theory, would allow China to impose retaliatory tariffs on billions’ worth of U.S. goods. But it is unlikely to have much practical impact, at least in the short term, because the U.S. can appeal the decision and the WTO’s appeals court is currently no longer functioning — largely because of Washington’s single-handed refusal to accept new members for it. The appeals court issues final rulings in trade cases and stopped functioning last year when the terms of two of its last three judges expired with no replacements. That means the United States can appeal the decision “into the void,’’ said Timothy Keeler, a lawyer at Mayer Brown and former chief of staff for the U.S. Trade Representative. “This panel report confirms what the Trump administration has been saying for four years: The WTO is completely inadequate to stop China’s harmful technology practices,” said U.S. trade representative Robert Lighthizer in a statement. He said the U.S. had presented “extensive evidence” of China’s intellectual property theft and the WTO has offered no fixes for it. “The United States must be allowed to defend itself against unfair trade practices, and the Trump administration will not let China use the WTO to take advantage of American workers, businesses, farmers, and ranchers,” he added. The Chinese ministry of commerce said the ruling was “objective and fair” and called on the U.S. to respect it. The U.S. tariffs target two batches of Chinese products. Duties of 10% were imposed on some $200 billion worth of goods in September 2018, and were jacked up to 25% eight months later. An additional 25% duties were imposed in June 2018 against Chinese goods worth about $34 billion in annual trade. The Trump administration has justified the sanctions under Section 301 of the Trade Act of 1974, once a common tool used by the U.S. government to impose sanctions — and recently revived by Trump. The U.S. argued that China’s actions had amounted to “state-sanctioned theft” and “misappropriation” of U.S. technology, intellectual property and commercial secrets. The WTO panel ruled that the U.S. measures violated longstanding international trade rules because they only applied to products from China, and that Washington had not adequately substantiated its claim that the Chinese products hit with the extra duties had benefited from the allegedly unfair Chinese practices."}]}