{"article": [{"url": "https://www.marketwatch.com/story/feds-kashkari-says-warnings-of-uncontrollable-inflation-are-just-ghost-stories-2020-09-18", "published": 1600433300.0, "headline": "Fed's Kashkari says warnings of runaway inflation are just 'ghost stories'", "body": "Warnings that U.S. inflation is about to surge aren't supported by any evidence, and are tantamount to \"ghost stories,\" said Minneapolis Federal Reserve President Neel Kashkari on Friday. These has been talk since 2008 that once inflation started to climb, it would accelerate, forcing the Fed to slam on the brakes by raising its policy interest rate sharply, Kashkari said, in an essay posted on his regional bank's website. These theories are similar to ghost stories because there is no evidence that they are true yet they can't be ruled out, he said. iframe.twitter-tweet { width: 100% !important; } Some economists worry that the consumer-price index is signaling higher inflation. The CPI is up 6.3% annualized over past three months, the highest rate since 2008. Core CPI, which excludes food and energy prices is up 5.1%, the highest since 1991. Core commodities are up 8.1%, the highest since 1982. In a separate interview Friday, Atlanta Fed President Raphael Bostic said the COVID-19 pandemic has generated \"a lot of noise\" in the inflation data. \"Month-to-month and quarter-to-quarter, the elements of the CPI are showing wide swingsâ\u0080¦so its hard to know what signal we're seeing right now,\" Bostic said, in an interview on Bloomberg Television. Financial markets didn't react much to the Fed's pledge to allow inflation to overshoot its target, and analysts said this is due to price level being so quiet in recent years. St. Louis Fed President James Bullard said Friday that Wall Street complacency about inflation may be tested. \"I actually think you may see more inflation than we have during the pre-pandemic era. when inflation was very subdued,\" he said. In a discussion sponsored by the Boeing Center for Supply Chain Innovation at Washington University in St. Louis, Bullard said there were several factors that could push the price level higher: a more relaxed Fed, huge fiscal deficits and possible bottleneck pressures given the 30% annual growth rate expected in the June-September quarter. Kashkari said that, stepping back, higher inflation would be a \"high-class problem\" for the Fed. That's because the Fed knows how to handle higher inflation - the problem is the central bank has limited tools to combat low inflation. Persistent low inflation is posing challenges to advanced economies around the world, Kashkari noted. This week, the Fed announced the final pieces of its strategy to avoid falling into the quicksand of low inflation. Read:The Fed's last stand: the battle to stay potent The FOMC said it would keep interest rates close to zero until the labor market achieves maximum employment and inflation has risen to its 2% target \"and is on track to moderately exceed 2% for some time.\" Kashkari dissented from the Fed's new forward guidance at its policy meeting on Wednesday. He proposed simpler language that the FOMC \"expects to maintain the target range until core inflation has reached 2% on a sustained basis\" and he defined \"sustained basis\" in this environment as lasting roughly a year. Kashkari said his alternative forward guidance was stronger than the statement adopted. The Minneapolis Fed President said the FOMC didn't need to mention employment in its forward guidance and including it risks underestimating slack in the labor market. Under his proposal, \"we would only lift off once we had demonstrated that we really were at maximum employment because core inflation would have had to actually hit or exceed 2% on a sustained basis in order to lift off,\" he said."}]}