{"article": [{"url": "https://www.marketwatch.com/story/after-months-of-speculation-investors-get-excited-about-pfizer-biontechs-coronavirus-vaccine-candidate-2020-07-01", "published": 1593855200.0, "headline": "After months of speculation, investors get excited about Pfizer, BioNTech's coronavirus vaccine candidate", "body": "The path to a COVID-19 vaccine has started to come into view this week, following the stock-moving disclosures of early-stage clinical data for two vaccine candidates and a rigorous new regulatory road map from the Food and Drug Administration. On Tuesday, Inovio Pharmaceuticals Inc. INO, -1.36%  shared the first data from the Phase 1 clinical trial for its coronavirus vaccine candidate, and the FDA issued guidance telling developers that approval requires a vaccine to reduce the risk of COVID-19 by 50% when compared with placebo. A day later, BioNTech BNTX, +1.23%  and Pfizer Inc. PFE, -0.27%  jumped into the fray, sharing that their experimental vaccine had generated neutralizing antibodies at a higher level than what has been reported in people recovering from a COVID-19 infection. The news sent Inovio's stock down and pushed up shares of BioNTech and Pfizer. The rocky investor response once again showcases the complexity of developing a vaccine, as quickly as possible, for a virus that came to the world's attention seven months ago, when there are still questions about what kind of immunologic protection antibodies for this virus can provide. \"We would not expect the initial generation of vaccines to be silver bullets in terms of conferring nearly complete protection,\" Bernstein analysts wrote in an investor note on Wednesday, \"and questions on the ability to inhibit transmission or the durability of immunity remain to be addressed.\" Read: Race for a COVID-19 vaccine has drug makers scaling up manufacturing - before one is developed BioNTech and Pfizer have released the most detailed information so far among the vaccine candidates being tested in the U.S. They said that 24 participants in the Phase 1/2 clinical trial who received two doses of the lower-dose vaccines developed neutralizing antibodies, an indicator that the experimental vaccine can generate antibodies at the same level or higher than those seen in convalescent sera, which is collected from people who have recovered from COVID-19. The data sent shares in both companies up in trading on Wednesday; BioNTech, which had its stock halted briefly, by 8.7%, and Pfizer, by 4.8%. The Bernstein analysts called the data \"solid,\" saying the vaccine candidate is a \"credible\" player in the rapidly expanding coronavirus vaccine field. Mizuho Securities' Vamil Divan said the candidate showed a \"robust immune response.\" That said, none of the clinical research that has been shared so far about vaccines being developed in the U.S. from BioNTech and Pfizer, Inovio, and Moderna Inc. MRNA, +0.09%  has been peer reviewed. (Moderna released preliminary data from its Phase 1 trial in May and is expected to publish detailed findings from the Phase 1 trial in a medical journal, as is Inovio and BioNTech and Pfizer, which published their Phase 1 data as a preprint on Wednesday.) Inovio's disclosure of Phase 1 data for its vaccine candidate was somewhat limited. It said 94% of 36 trial participants showed \"overall immunological response rates based on preliminary data assessing humoral (binding and neutralizing) and T cell immune responses.\" Its stock hit a record high of $31.69 on Monday and has since tumbled, closing at $26.95 on Tuesday, when it announced the data. Shares were down 26.8% in trading on Wednesday. See also:Gilead's coronavirus drug will cost $2,340 - which sounds expensive, but here's why it's not Maxim Group's Jason McCarthy on Wednesday downgraded Inovio's stock to hold from buy, saying the COVID-19 opportunity was already baked into the company's valuation. However, he remains bullish on the probability of Inovio's vaccine moving forward in clinical testing. \"In truth, while we don't know what 'good' immunogenicity data should be, studies suggest that both T cell and antibody immune responses will be important for protection in both mild and serious infections,\" he wrote. \"The early data for INO-4800 appear to be promising.\" The FDA guidance calls for vaccines to prevent infection with the virus, and the regulator won't approve a vaccine \"on the basis of just immunogenicity as some investors, developers and commentators have suggested,\" SVB Leerink's Geoffrey Porges wrote in an investor note. What that means is that it may take longer to approve a vaccine than what government officials have promised the American public. The Department of Health and Human Services has said it would have 300 million doses of a vaccine by January as part of the government's Operation Warp Speed program. \"The guidelines do not suggest that a widely usable vaccine will be available at 'warp speed' in 2020,\" Porges wrote. \"The tone and clarity of the document suggests that regardless of political pressure, the FDA continues to apply sound regulatory judgment and expertise.\" Since the start of the year, the Health Care Select Sector SPDR Fund XLV, +0.90%  has declined 0.8%, while the S&P 500 SPX, +0.87%  is down 4.0%. See also:Coronavirus update: U.S. case tally climbs above 2.6 million, and top Republicans now call on Americans to wear face masks"}]}