{"article": [{"url": "https://www.marketwatch.com/story/hamilton-and-everything-else-coming-to-disney-in-july-2020-2020-06-24", "published": 1593803300.0, "headline": "â\u0080\u0098Hamiltonâ\u0080\u0099 and everything else coming to Disney+ in July 2020", "body": "â\u0080\u009cHamiltonâ\u0080\u009d is coming to Disney+ in July, and thatâ\u0080\u0099s really all you need to know. Sure, the Walt Disney Co. DIS, +1.53% Â streaming service is also adding a new Muppets series, â\u0080\u009cMuppets Nowâ\u0080\u009d (July 31), and movies like â\u0080\u009cSolo: A Star Wars Storyâ\u0080\u009d (July 10) and â\u0080\u009cThe Mighty Ducksâ\u0080\u009d (July 3), but the one true highlight will be the filmed version of the Broadway smash, starring Lin-Manuel Miranda and the rest of the original cast. â\u0080\u009cHamiltonâ\u0080\u009d was scheduled to be released in theaters in October 2021, but due to the pandemic, itâ\u0080\u0099ll drop instead on July 3, just in time for Fourth of July celebrations, which are likely to be more indoors this year. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Read more: Whatâ\u0080\u0099s streaming in July on Netflix | Amazon Prime | Hulu | HBO Max Hereâ\u0080\u0099s what else is on tap:Coming in July 2020 July 3 Animal ER (Seasons 1-2) Diary of a Wimpy Kid: Rodrick Rules Ice Age: Collision Course Ice Road Rescue (Seasons 1-4) Race to Witch Mountain (2009) The Big Green The Mighty Ducks Hamilton Pixar in Real Life, Episode 109, â\u0080\u009cUP: Balloon Cart Awayâ\u0080\u009d Disney Family Sundays, Episode 135, â\u0080\u009cPeter Pan: Shadow Box Theaterâ\u0080\u009d One Day at Disney, Episode 131, â\u0080\u009cZama Magudulela: The Lion King Madrid, Spainâ\u0080\u009d Itâ\u0080\u0099s a Dogâ\u0080\u0099s Life with Bill Farmer, Episode 108, â\u0080\u009cMovie Star Dogs & Hounds and Horsesâ\u0080\u009d July 10 Critter Fixers: Country Vets (Season 1) Gigantosaurus (Season 1) Secrets of the Zoo (Season 3) Solo: A Star Wars Story Disney Family Sundays, Episode 136, â\u0080\u009cLilo and Stitch: Family Treeâ\u0080\u009d One Day at Disney, Episode 132, â\u0080\u009cMarc Smith: Story Artistâ\u0080\u009d Itâ\u0080\u0099s a Dogâ\u0080\u0099s Life with Bill Farmer, Episode 109 July 17 A Pre-Opening Report from Disneyland Diary of a Wimpy Kid: The Long Haul Disney Junior Music Lullabies Lost City of Machu Picchu Super Robot Monkey Team Hyperforce Go! (Seasons 1-2) The Mousketeers at Walt Disney World Wild Chile (S1) Disney Family Sundays, Episode 137, â\u0080\u009cMoana: Tomato Photo Holderâ\u0080\u009d One Day at Disney, Episode 133, â\u0080\u009cMike Davie: Imagineering Project Managerâ\u0080\u009d Itâ\u0080\u0099s a Dogâ\u0080\u0099s Life with Bill Farmer, Episode 110, â\u0080\u009cSnake Search Dogs & Hawaiian Conservation Dogsâ\u0080\u009d July 24 Wild Congo (Season 1) Wild Sri Lanka (Season 1) Rogue Trip: All Episodes 101-108 Disney Family Sundays, Episode 138, â\u0080\u009cJungle Book: Finger Puppetâ\u0080\u009d One Day at Disney, Episode 134, â\u0080\u009cChris Christi: Helicopter Reporterâ\u0080\u009d July 31 Alaska Animal Rescue (Season 1) Animal Showdown (Season 1) Best Job Ever (Season 1) Big Cat Games Cradle of the Gods Destination World (Season 1) Dr. Oakley, Yukon Vet (Season 8) Fearless Adventures with Jack Randall (Season 1) Hidden Kingdoms of China Hunt for the Abominable Snowman Indiaâ\u0080\u0099s Wild Leopards Jungle Animal Rescue (Season 1) King Fishers (Season 1) Lost Temple of the Inca Marvel Funko (Seasons 1-2) Surviving the Mount St. Helens Disaster Weirdest, Bestest, Truest (Season 1) What Sam Sees (Season 1) Muppets Now, Episode 101, â\u0080\u009cDue Dateâ\u0080\u009d div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Disney Family Sundays, Episode 139, â\u0080\u009cMickey and Minnie: Pillowsâ\u0080\u009d One Day at Disney, Episode 135, Lauren Cabo, â\u0080\u009cImagineering Portfolio Creative Executiveâ\u0080\u009d"}]}