{"article": [{"url": "https://www.marketwatch.com/story/ending-the-extra-600-a-month-americans-are-getting-in-unemployment-benefits-could-cost-the-us-more-jobs-some-economists-say-2020-05-28", "published": 1592325440.0, "headline": "The extra $600 Americans receive in weekly unemployment benefits ends in July â\u0080\u0094 how that could cost the U.S. more jobs", "body": "Two-thirds of Americans are receiving more money from unemployment benefits than they did from their jobs, largely because of a supplemental $600 weekly benefit thatâ\u0080\u0099s part of the $2.2 trillion CARES Act. But decreasing those benefits could cost the country even more jobs on top of the historic 20 million jobs that have already been wiped away by the coronavirus pandemic, Heidi Shierholz, an economist at the Economic Policy Institute, a left-leaning think-tank based in Washington, D.C., said. “ If the extra $600 unemployment benefit expires, millions of Americans will have less money to spend in stores, and that could ultimately lead to more unemployment. ” â\u0080\u0094 Heidi Shierholz, an economist at the Economic Policy Institute The weekly supplemental $600 benefit is set to expire at the end of July if the U.S. Senate and President Donald Trump donâ\u0080\u0099t pass the $3 trillion HEROES Act stimulus package, which would extend the $600 weekly add-on unemployment benefit into January 2021. Donâ\u0080\u0099t miss: The extra $600 Americans get in weekly unemployment benefits ends next month â\u0080\u0094 hereâ\u0080\u0099s what lawmakers are proposing to replace it Republican lawmakers hold that the $600 weekly boost in unemployment insurance during the pandemic is a disincentive to return back to work, given that people could earn more from not working. Ohio Republican Senator Rob Portman has instead proposed using federal funds to distribute a $450 return to work bonus. White House economic advisor Larry Kudlow said Tuesday that â\u0080\u009citâ\u0080\u0099s something weâ\u0080\u0099re looking at very carefully.â\u0080\u009d However, job openings hit a three-year low in March but made a slight bounce back in April with 10 million job losses compared to 14.6 million in March, according to Bureau of Labor Statistics monthly Job Openings and Labor Turnover report. The number of people hired in April fell to the lowest level on record at 3.5 million. Before the pandemic, job openings were running well above 7 million and had hit a record high. Job openings are expected to continue to dwindle, suggesting that more Americans are unlikely to leave their stateâ\u0080\u0099s unemployment insurance program. If the extra $600 unemployment benefit expires, millions of Americans will have less money to spend in stores, and that could ultimately lead to more unemployment, Shierholz said. â\u0080\u009cItâ\u0080\u0099s not true that thereâ\u0080\u0099s a pool of jobs out there that people would fill if they werenâ\u0080\u0099t receiving unemployment benefits,â\u0080\u009d she said. “ For every dollar spent on unemployment insurance, thereâ\u0080\u0099s a multiplier effect leading to a 1.64 increase in GDP. ” For every dollar spent on unemployment insurance, thereâ\u0080\u0099s a multiplier effect leading to a 1.64 increase in GDP, according to a 2008 study published by Mark Zandi, chief economist at Moodyâ\u0080\u0099s Analytics MCO, +0.88%. Meanwhile, for every dollar spent on infrastructure projects, U.S. GDP could be expected to increase by a multiple of 1.59. Thatâ\u0080\u0099s evident in last monthâ\u0080\u0099s retail sales report which documented a record 17.7% jump in retail sales. The brightest spots in terms of purchases Americans made were cars, clothing, furniture, books, music and sporting goods. If people didnâ\u0080\u0099t have checks to make these purchases, the job losses would have been much greater, Shierholz said. That could also help explain Mayâ\u0080\u0099s surprise jobs report where nearly 2.7 million Americans who were temporarily laid off amid the coronavirus pandemic were rehired. Thatâ\u0080\u0099s why she considers it â\u0080\u009cincredibly efficient money to fight the recession.â\u0080\u009d Right now, â\u0080\u009cit is appropriate to have the additional $600,â\u0080\u009d Zandi told MarketWatch, given the countryâ\u0080\u0099s 13.3% unemployment rate. Speaking anecdotally, he added that it is â\u0080\u009chard to imagine people wouldnâ\u0080\u0099t take their jobs back for a couple of hundred bucks.â\u0080\u009d Meanwhile, for people who have no savings, â\u0080\u009cIf they donâ\u0080\u0099t get a check theyâ\u0080\u0099re going to be panicked and that makes for a very dark situation,â\u0080\u009d said Zandi, who advised the presidential campaign of the late U.S. Senator John McCain. But that doesnâ\u0080\u0099t mean that the extra $600 in unemployment should stay forever. â\u0080\u009cAt some point, lawmakers need to think about reducing it and winding down,â\u0080\u009d Zandi said. Once unemployment returns to â\u0080\u009csingle digits,â\u0080\u009d he said, lawmakers should consider halving unemployment benefits. Like Sen. Portman, Stan Veuger, an economist at the American Enterprise Institute, a right-leaning policy think-tank, believes the amount of money being distributed to Americans who are out of work is problematic. â\u0080\u009cItâ\u0080\u0099s reasonable to have an addition to what people would otherwise receive from their state unemployment program, but I donâ\u0080\u0099t think it should be as large,â\u0080\u009d he said. â\u0080\u009cWe want businesses to rehire, but replacement rates right now are just too high.â\u0080\u009d"}]}