{"article": [{"url": "https://www.marketwatch.com/story/covid-19-related-consumer-needs-are-turning-best-buy-into-an-essential-retailer-analysts-say-2020-08-25", "published": 1598425160.0, "headline": "COVID-19-related consumer needs are turning Best Buy into an essential retailer, analysts say", "body": "A previous version of this report included a typo in Best Buy CEO Corie Barry’s name. It has been corrected. Best Buy stores served customers by appointment for weeks during the second quarter, but comparable sales still beat expectations Getty Images Known as the place to get a new jumbo screen hi-tech TV before the Super Bowl, Best Buy Co. Inc. is also now a retailer of necessities for everyday life during COVID-19, like new computers and items to help with cooking at home. The consumer electronics retailer reported fiscal second-quarter earnings and revenue that beat expectations early Tuesday, with computing merchandise and appliances called out as big sellers for the quarter. Large appliances and home theater merchandise sales grew as stores opened and the quarter wore on, according to Best Buy BBY, +1.45% Chief Executive Corie Barry. Best Buy stores were open by appointment only for the first six weeks of the quarter due to COVID-19. As of June 22, nearly all of the company’s stores were open for shopping. For the first three weeks of the third quarter, sales are up about 20%, Barry said. Watch:Work from home is here to stay. Here’s what it means for retail. “Best Buy’s results demonstrated that there is a significant essential and non-discretionary component to its merchandise mix, as well as validated the quality of its execution ability, and we also note momentum is continuing as evidenced by revenues up around 20% thus far in Q3,” said Charlie O’Shea, Moody’s vice president. Essential retailers that remained open during lockdown periods of the pandemic include grocers like Walmart Inc. WMT, +1.00%, Costco Wholesale Corp. COST, +1.19% and Target Corp. TGT, +1.14% as well as home retailers like Home Depot Inc. HD, +0.49% and Lowe’s Cos. LOW, +1.38% Despite the results, Best Buy shares fell 4% in Tuesday trading after the retailer took a cautious tone for the future. “Overall, as we plan for the back half of the year, we continue to weigh many factors including potential future government stimulus actions, the current shift in personal consumption expenditures from areas like travel and dining out, the possible depth and duration of the pandemic, the risk of higher unemployment over time, and the availability of inventory to match customer demand,” said Best Buy’s Chief Financial Officer Matt Bilunas in a statement. Experts and other retailers have talked about the slow start to the back-to-school season and the impact that the ongoing pandemic will have on the shopping calendar heading into holiday shopping. Gross profit fell due to the costs associated with fulfilling a surge in online orders, said O’Shea. Online sales grew 242.2% in the second quarter. Read: Amazon Prime Day delay, back-to-school uncertainty is changing the shopping calendar Still, the results set Best Buy up for future stock gains, according to CFRA, which identified a few factors working in Best Buy’s favor, including the shift to remote learning, a delay to Amazon.com Inc.’s AMZN, +3.01% Prime Day shopping event, and an upcoming cycle of upgrades to 5G. “COVID-19 has fundamentally changed how consumers learn, work and interact, which should accelerate tech innovation and make Best Buy’s mission even more timely,” wrote CFRA’s Camilla Yanushevsky. Enterprise comparable sales rose 5.8% with domestic same-store sales were up 5.0%. FactSet forecast comparable sales growth of 2.3% with domestic comparable sales forecast to grow 2.9%. International comparable sales grew 15.1%, well ahead of the FactSet consensus for 8.8% growth. Even with a strong showing at its stores, the company’s online investments have proven valuable. “That so many came to Best Buy, rather than to other online rivals, underlines both the trust in the brand and the efficiency of an e-commerce operation which allowed most customers to very quickly collect from curbside once an order had been placed,” said Neil Saunders, managing director at GlobalData Retail. “This superior execution of using stores to fulfill online orders was in play long before the pandemic hit, but it has proved to be a major advantage in a time of disruption and has helped Best Buy retain market share and profitability,” Saunders said. Also:BJ’s is adding a ton of new members to its roster, and many are young and digitally-savvy Barry outlined a system that Best Buy will pilot starting next month that will use some locations as fulfillment hubs for the increased holiday orders and beyond. All stores will help with online orders, but 250 locations have been selected based on factors like their proximity to a shipping service or ability to handle next-day deliveries. Those locations will tackle more of the volume. Raymond James rates Best Buy stock strong buy based on the results. Analysts also credit the retailer’s “best-in-class fulfillment capabilities, high mix of essential items” and service offerings for putting it in a position to take market share during this period when COVID-19 is accelerating the demise of weaker retailers. “We believe Best Buy has navigated COVID in admirable fashion, with accelerating online growth, new customer gains, and a highly effective cost management approach,” wrote Wells Fargo analysts led by Zachary Fadem. “That said, we believe Q2 could’ve been even better, as high out-of-stocks likely limited Best Buy’s ability to capitalize on accelerating mid-June/July demand (+17%) once stores re-opened and lost share was recovered.” Don’t miss:Lowe’s targets professionals, and its main competitor Home Depot, with new services Wells Fargo rates Best Buy stock equal rate, but raised its price target to $112 from $92. Best Buy’s Barry addressed the inventory issue during the earnings call. “While we expected product constraints as we entered the quarter, the stronger-than-anticipated demand as we open our stores for shopping resulted in more constrained product availability than we expected,” she said, according to FactSet. Barry “feels strongly” that vendors are “doing everything they can to catch up.” Best Buy declared a quarterly cash dividend of 55 cents a share payable on October 6 to shareholders of record as of September 15. However the company did not give financial guidance due to uncertainty from the coronavirus pandemic. Best Buy shares have rallied 28.3% for the year to date while the S&P 500 index SPX, +0.87% has gained 6.6% for the period."}]}