{"article": [{"url": "https://www.marketwatch.com/story/ibm-stock-pops-higher-as-earnings-beat-expectations-but-sales-decline-yet-again-2020-07-20", "published": 1595313980.0, "headline": "IBM stock pops higher as earnings beat expectations but sales decline yet again", "body": "This article previously listed an inaccurate figure for IBM’s second-quarter earnings per share. It has been updated. This marks IBM’s first quarter under CEO Arvind Krishna MarketWatch photo illustration/Getty Images International Business Machines Corp. shares gained in after-hours trading Monday, after the tech giant reported another decline in revenue but produced more profit and sales than Wall Street expected amid the COVID-19 pandemic. IBM IBM, -2.81% reported second-quarter net income of $1.36 billion, or $1.52 a share, compared with $2.5 billion, or $2.81 a share, in the year-ago period. Adjusted earnings were $2.18 a share, compared with $3.17 a share a year ago. Revenue declined to $18.12 billion from $19.16 billion in the year-ago quarter. Analysts surveyed by FactSet had forecast adjusted earnings of $2.09 a share on revenue of $17.73 billion on average. IBM had reported a decline in revenue in April, returning Big Blue to a losing streak it briefly snapped when it managed to eke out a slight rise in sales in the fourth quarter. IBM’s sales have declined year-over-year in all but four of the past 32 quarters. Cloud and cognitive software sales, which includes IBM’s Red Hat business, came in at $5.75 billion, compared with $5.65 billion in the year-ago quarter, while analysts had forecast $5.74 billion. “Only 20% of the workloads have moved to the cloud,” said Arvind Krishna, IBM’s chief executive, on a conference call. “The other 80% are mission-critical workloads that are far more difficult to move. There is a massive opportunity in front of us to capture these workloads.” IBM shares jumped more than 5% in after-hours activity and were last up 4.3%, after gaining 1% to close the regular session at $126.37. For the year, IBM shares are down 5.7%, while the Dow Jones Industrial Average DJIA, +0.56% — which counts IBM as a component — is off 6.5%, the S&P 500 index SPX, +0.87% is up less than 1%, and the tech-heavy Nasdaq Composite Index COMP, +1.39% is up 20%. Systems revenue, which includes mainframes, was $1.85 billion versus the $1.68 billion Street view. Global technology services revenue came in at $6.32 billion while the Street expected $6.24 billion, and global business services revenue accounted for $3.89 billion in sales while the Street had forecast $3.87 billion. Back in April, IBM pulled its full-year guidance of “at least $13.35” a share, and said it would revisit whether it would provide guidance at the end of the second quarter. On Monday’s call, the company said it is still withholding guidance for the year. “It’s likely that we see that the economic recovery is looking to be longer and more protracted than we might have hoped for back in March,” Krishna said on the call. “We have a lot of uncertainty in the economic environment around the globe, and when we look at it by geography, by continent, or by industry, there is just so much variability that we can’t answer it,” Krishna said. Of the 18 analysts who cover IBM, three have overweight or buy ratings, 13 have hold ratings, and two have sell ratings, along with an average price target of $126.60."}]}