{"article": [{"url": "https://www.marketwatch.com/story/homebuilder-stocks-rise-in-london-after-mortgage-applications-soar-11602079099", "published": 1602065180.0, "headline": "Homebuilder stocks rise in London after mortgage applications soar", "body": "Rows of terraced houses and residential properties are pictured in south London on July 6, 2020, backdropped by the skyline of the City of London. daniel leal-olivas/Agence France-Presse/Getty Images The stocks of several London home builders were getting a boost on Wednesday after lender Halifax reported a 7.3% rise in annual house prices and a 12-year high for mortgage applications. A string of names were trading at higher prices — Taylor Wimpey jumped 3% and Barratt Development rose 0.6%, while among the smaller names, Crest Nicholson CRST, +1.90% gained 1.8%, Bellway BWY, +1.31% added 1.7% and Redrow RDW, +3.79% jumped 2%. Elsewhere though, Persimmon PSN, -1.33% and Land Securities Group LAND, +2.17% were both down by 1% or more. Russell Galley, managing director of Halifax, cautioned though that context was important, as a year ago the housing market was suffering from political uncertainty about the U.K. election and Brexit. House prices have also been getting a lift from more people working from home who need to buy more space, along with a stamp duty holiday. “The release of pent up demand and indeed the stamp duty holiday can only be temporary fillips and their impact will inevitably start to wane,” said Galley. Elsewhere on the London stock market, shares of grocer Tesco TSCO, +1.80% slipped into the red after results showed a rise in first-half profit, but higher COVID-19 related costs. The FTSE 100 index UKX, +0.64% was trading flat at 5,955.41, with the index up 0.9% for the week. Across smaller AIM-listed companies, shares of 4D Pharma DDDD, -5.88% tumbled 32%. The company reported positive results from a trial of its irritable bowel syndrome treatment that can treat both IBS with constipation or diarrhea. Shares shot higher at the open before selling off."}]}