{"article": [{"url": "https://www.marketwatch.com/story/paypal-ceo-says-corporate-activism-can-help-spur-the-tipping-point-that-brings-social-change-2020-06-29", "published": 1593444680.0, "headline": "PayPal CEO says corporate activism can help spur the â\u0080\u0098tipping pointâ\u0080\u0099 that brings social change", "body": "An earlier version of this story incorrectly stated PayPalâ\u0080\u0099s stock move for the year. The stock is up 55% on a year-to-date basis. PayPal Chief Executive Dan Schulman Patrick T. Fallon/Bloomberg PayPal Holdings Inc. Chief Executive Dan Schulman argues that corporations have a key role to play in reaching the â\u0080\u009ctipping pointâ\u0080\u009d that can bring about social change. The payment technology company announced earlier in June that it was committing $530 million toward helping minority-owned businesses. PayPalâ\u0080\u0099s PYPL, +2.18% Â commitment includes grants to and investments in Black-owned and minority-owned businesses. Schulman said that the grant money is crucial because Black businesses routinely face higher hurdles to traditional loan opportunities, according to a recent interview with CNET. â\u0080\u009cEven during good times, the amount of financing they can raise, whether it be equity financing or just loans, is much lower than the national average,â\u0080\u009d he said. â\u0080\u009cBut in this time, itâ\u0080\u0099s practically impossible for them to get a loan.â\u0080\u009d Schulman said that PayPal has already disbursed $10 million in grants, not loans, as part of the program. Read: Venmo and Squareâ\u0080\u0099s Cash App were going gangbusters before the pandemic â\u0080\u0094 now theyâ\u0080\u0099re doing even better While the company doesnâ\u0080\u0099t have an end date for when it plans to have disbursed its entire $530 million commitment, Schulman said that PayPal wants to â\u0080\u009cstart moving on it ASAPâ\u0080\u009d while at the same time making sure there are funds remaining over a longer span. â\u0080\u009cSome of it [is] more short term-oriented, but we also put in place a very substantial amount of money to help over the long term, because at some point, the marches start to fade away, but the problem still exists,â\u0080\u009d he said. PayPal is focused on â\u0080\u009cmultiyear commitmentsâ\u0080\u009d beyond one-time grants, according to Schulman. In Schulmanâ\u0080\u0099s view, the pandemic has given people more time to reflect on racial issues in the U.S., allowing them to â\u0080\u009c[tap] into the consciousness of the country,â\u0080\u009d though thereâ\u0080\u0099s more work to be done. â\u0080\u009cI think the key is to take advantage of this moment, whether it be nonprofits, organizations that fight for social justice, and the private sector to really step up, because I think things need to start tipping and then they hit a tipping point and then they keep moving,â\u0080\u009d he said. He stated that people need to â\u0080\u009cdo more than just condemn racism.â\u0080\u009d Instead, they need to be â\u0080\u009cantiracist,â\u0080\u009d which to him means that they â\u0080\u009chave to be a part of the fight.â\u0080\u009d PayPal had taken a stand on social issues in the past, banning social-network site Gab.com from using its services due to the presence of hateful speech on the Gab platform leading up to the 2018 shooting at a Pittsburgh synagogue. PayPalâ\u0080\u0099s Schulman has argued that the companyâ\u0080\u0099s broader mission has a social component as well since PayPalâ\u0080\u0099s digital financial tools can make money management easier for those without traditional bank accounts. PayPalâ\u0080\u0099s stock has gained 55% year to date, while the S&P 500 index SPX, +0.87% Â has slipped 5.8%."}]}