{"article": [{"url": "https://www.marketwatch.com/story/how-to-get-older-without-screwing-it-up-2020-09-08", "published": 1599575720.0, "headline": "How to get older without screwing it up", "body": "You would think an expert on aging would approach his own retirement with care. And you would be right. A psychologist and gerontologist, Ken Dychtwald has built a career around consulting and public speaking about the implications of a maturing society. He founded Age Wave in 1986 and continues to serve as its chief executive, and he’s co-author of the new book, “What Retirees Want.” Now 70, Dychtwald is applying what he’s learned to his own life. For starters, he has embraced wellness with gusto. Read: Boomers are doing retirement their own way “I’m mostly on a plant-based diet, a Pritikin/Ornish diet,” he says. “Little sugar. Little caffeine.” A longtime yoga practitioner, he also swims daily as part of his regular exercise routine. Despite all his efforts, however, he says he’s still “a little overweight” with high blood pressure. “I take my health very seriously,” he says. “But there are no guarantees. Look what happened to Jim Fixx,” an avid runner who died at 52 of a heart attack. As Dychtwald ages, he’s spending more time pondering his character. Inspired by journalist David Brooks’s “eulogy virtues,” the qualities that others would praise at your funeral, he has reflected on his attitudes and behaviors and sought to improve as a person. “From Brooks I learned that if you don’t like what people would say at your funeral, course-correct,” Dychtwald said. In 2009, for example, he was struck when he asked Huston Smith, then a 90-year-old religious scholar, to share a core lesson of his life. “Smith said ‘be a little kinder,’” Dychtwald recalled. “He didn’t know me well enough to direct that at me. But I’m self-indulgent, a go-getter who may be tough on people. Kindness was probably not one of my top qualities.” Dychtwald says he has tried to act with more kindness and authenticity, especially with friends and family. “Relationships are the nectar that give life its joys and connection,” he said. “I’ve made it a priority to hold very dear my close relationships.” Speaking of relationships, Dychtwald cites his 37-year marriage as a source of sustenance and ongoing fulfillment. Long-established rituals bring comfort as well as adventure to the couple. He hails the power of making and sticking to commitments as a way to inject freshness and discovery into life. Every year, for instance, he and his wife participate in marriage ceremonies in different places that follow different belief systems. “We’ve celebrated by doing Baptist in the Caribbean and Hopi in Sedona, Arizona,” he said. “One year when we didn’t have much money, we went to [Las] Vegas at [A] Chapel of Love, where we got remarried for $175.” Another key to successful aging involves finding ways to stay young. Seniors who are open to learning can expand their horizons, but that means resisting the temptation to reject new technology or trends. Dychtwald praises entrepreneur Chip Conley’s concept of “menterns,” a mash-up of mentors and interns. Sharing wisdom across generations—with young people educating their elders and vice versa—enriches everyone. “I see a lot of retirees complain that society pushes them to the margins,” Dychtwald said. “But I see that they push themselves to the margins. They don’t try to understand the world from the point of view of a younger person.” Practicing what he preaches, Dychtwald spent six months doing a deep dive into TikTok, the video-sharing service that started in China and gained global popularity. He’s fascinated that “millions of people watch other people film themselves dancing or miming in these short videos, figuring out the lighting and [downloading] the next day.” He urges older people to focus less on trying to retain their youthfulness and more on expanding their usefulness. “People say, ‘I’d like to be like her. She’s so youthful,’” he said. “Youthful is good. But I’d rather be useful. And to be useful, you have to be relevant to a 15-year-old and a 40-year-old. You have to meet people halfway.”"}]}