{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-cases-edge-toward-30-million-and-china-says-vaccine-may-be-ready-by-november-2020-09-15", "published": 1600239500.0, "headline": "Coronavirus update: Global cases edge toward 30 million, and China says vaccine may be ready by November", "body": "The number of confirmed cases of the coronavirus that causes COVID-19 edged closer to 30 million on Tuesday, as a Chinese health official said a vaccine may be available to the public as early as November. State news media reported that Dr. Wu Guizhen, head of biosafety at the Chinese Centers for Disease Control and Prevention, told broadcaster CCTV that ordinary Chinese people could be given the vaccine in November or December, the New York Times reported. China currently has five vaccine candidates in late-stage clinical trials, Wu said. China is the world’s biggest vaccine producer and has already granted emergency-use authorization to at least two experimental vaccines and started inoculating frontline workers, including Wu. Wu was given one of the experimental vaccines in April and said she is faring well and expects it to remain effective for up to three years, the paper reported. In the U.S., President Donald Trump took to Twitter to direct jeers at Pennsylvania Gov. Tom Wolf, after a federal judge ruled that lockdown measures implemented to stop the spread of the virus were unconstitutional. U.S. District Judge William Stickman IV, a Trump appointee, said state restrictions on gatherings and the order than nonessential businesses remain closed violate the First Amendment and due-process and equal-protection clauses of the 14th Amendment, the Washington Post reported. The governor’s office is planning to appeal. Read:Trump not letting coronavirus guidelines or local rules get in the way of his campaign rallies “The court believes that defendants undertook their actions in a well-intentioned effort to protect Pennsylvanians from the virus,” the ruling said. “However, good intentions toward a laudable end are not alone enough to uphold governmental action against a constitutional challenge.” Trump tweeted his hope that judges in Michigan and North Carolina would follow suit. The news comes as the U.S. tally of confirmed cases climbs above 6.57 million, and the death toll climbs to 195,047, according to data aggregated by Johns Hopkins University. The U.S. added almost 37,000 new cases on Monday, and about 447 new deaths. Case numbers have fallen from their July peaks above an average of 60,000 a day, but remain high across most of the country. Deaths averaged about 850 a day in September so far, according to a New York Times tracker, below peak spring levels but above July levels. North Dakota, Missouri, Oklahoma, Wisconsin, Arkansas, Nebraska, South Carolina, Tennessee and Utah have had a daily average of at least 15 new cases per 100,000 people in the past week, the tracker shows. A House subcommittee examining President Donald Trump’s response to the coronavirus pandemic is launching an investigation into reports that political appointees have meddled with routine government scientific data to better align with Trump’s public statements, the Associated Press reported. The Democrat-led subcommittee is requesting transcribed interviews with seven officials from the Centers for Disease Control and Prevention and the Department of Health and Human Services, including communications aide Michael Caputo. Caputo has publicly pushed back on CDC statements about the virus and said falsely in a Facebook Live FB, +0.26% video on Sunday that the CDC has a “resistance unit” to undermine the president. His page has been made private. “With nearly 200,000 Americans killed and hundreds more dying each day from the coronavirus pandemic, the public needs and deserves truthful scientific information so they can keep themselves and their families healthy,” the Democrats wrote in a letter to HHS Secretary Alex Azar and CDC head Robert Redfield. In other news: • Denmark’s coronavirus reproduction, or “R” rate, has climbed to 1.5, meaning that every 10 people who are infected are infecting another 15, the Guardian reported. Health Minister Magnus Heunicke said restaurants, bars and cafés must close at 10 p.m. in the capital, Copenhagen. Denmark had counted 334 new infections in the past 24 hours, he told reporters. • Global views of the state of the economy during the pandemic are more negative in some countries than they were during the Great Recession, according to surveys conducted by the Pew Research Center. The surveys carried out in 10 countries also found people more upbeat on a rebound than they were after the financial crisis a decade ago. A median of 80% of those surveyed in both 2020 and 2008 or 2009 say their country’s economy is faring badly, compared with a median of 72% in 2008 and 2009. In Australia, Spain, Italy and the United Kingdom, more people say their economy is bad now versus then. South Koreans and Americans, in contrast, are less downbeat now than they were then, while in Canada, Germany, Japan and France, the number of assign their economies low grades is about the same now as back in 2008-09. • U.S. states that have reopened bars have seen a doubling in the rate of new COVID-19 cases three weeks after they opened their doors, the Washington Post reported, based on an analysis of cellphone and coronavirus case data. The analysis found a statistically significant relationship between foot traffic to bars one week after reopening and a spike in cases three weeks later. • The organizers of the Tour de France bike race said all cyclists tested negative for COVID-19 in the final found of tests, Agence France-Presse reported. The world-famous race is scheduled to end on Sunday with the traditional parade at the Champs Elysees. Organizer ASO is expected to claim success in creating a blueprint for how to hold a major sports event during a pandemic. • The Irish government says Dublin pubs will remain closed when establishments outside the capital are allowed to reopen next week as it moves to crack down after a fresh spike in cases, according to local media. Dubliners are also being asked to limit travel and to only meet up with one other household when outside the county. “Rising rates of infection can be reversed by concerted public action and by all of us adhering to the guidance and taking personal responsibility,” Taoiseach Micheál Martin announced.Latest tallies There are now 29.4 million confirmed cases of COVID-19 worldwide, according to the Johns Hopkins data, and at least 930,311 people have died. At least 19.9 million have recovered. Brazil has the second highest death toll at 132,006 and third highest case toll at 4.3 million. India is third with 80,776 deaths and second by case number with 4.9 million. Mexico is fourth with 71,049 deaths and seventh with 671,716 cases. The U.K. has 41,753 deaths and 373,565 cases, the highest death toll in Europe and fifth highest in the world. China, where the illness was first reported late last year, now has 90,223 cases and 4,735 deaths, according to its official numbers. What’s the latest medical news? Regeneron Pharmaceutical’s Inc.’s REGN, +0.36% experimental drug is being added to the Recovery trial at the University of Oxford. The drug will be used on people hospitalized with the coronavirus, and will compare adding REGN-COV2 to the usual standard-of-care against the usual standard-of-care alone. It’s the first specifically designed COVID-19 therapy being tested by the Recovery trial. Regeneron announced in July that REGN-COV2 was entering late-stage, Phase 3 trials in the U.S. evaluating the drug’s effectiveness in preventing infection among uninfected people who have had close exposure to a COVID-19 patient. It is also in Phase 2/Phase 3 clinical trials for the treatment of COVID-19. Opko Health OPK, +1.09% is testing Rayaldee as a treatment for mild-to-moderate COVID-19 in a Phase 2, randomized, double-blind, placebo-controlled study. Rayaldee is a vitamin D–based drug that has been approved by the Food and Drug Administration as a treatment for certain forms of kidney disease. The trial’s 160 participants will primarily include people with stage 3 or 4 chronic kidney disease. Read also:There are seven coronavirus vaccine candidates being tested in the U.S. — here’s where they stand Research published Sept. 3 in the JAMA Network identified that “likely deficient vitamin D status was associated with increased COVID-19 risk.” Finally, U.S. trials of AstraZeneca PLC’s AZN, +1.16% AZN, +0.63% and Oxford University COVID-19 vaccine candidate will be on hold until at least midweek, pending a Food and Drug Administration investigation into the side effect that caused trials to be halted earlier this month, Reuters reported Monday, citing sources familiar with the matter. See:Here’s what you need to know about clinical trials as drug makers push forward with coronavirus vaccine studies AstraZeneca on Saturday said U.K. clinical trials had resumed. The vaccine candidate’s trials were halted after a reported serious side effect in a U.K. patient. Reuters said new-patient enrollment and other steps in the U.S. trial are being rescheduled until at least midweek and it was not clear how long federal regulators would take to complete its investigation.What are companies saying? • 3M Co. MMM, +0.94% the consumer, health care and industrial products company, provided an upbeat third-quarter sales outlook. The company reported August sales rose 2% from a year ago to $2.7 billion, following the company’s report last month that July sales rose 6% to $2.8 billion. Although there is still significant economic uncertainty as a result of the COVID-19 pandemic, the company estimates that third-quarter sales will be $8.2 billion to $8.3 billion, up from $8.0 billion a year ago and above the FactSet consensus of $8.08 billion. 3M will still report monthly sales to provide investors with updates amid ongoing uncertainties related to COVID-19. • Carnival Corp. CCL, +0.51% CCL, +1.26% will accelerate actions to become leaner, including an increased reduction in capacity, after sailings were halted during the pandemic. The company said it was accelerating the exit of 18 ships from its fleet, representing a reduction in capacity of 12%; in July, the company said it expected to dispose of 13 ships, representing a reduction in capacity of 9%. Carnival said it expects only two of the four ships originally scheduled to be delivered in 2020 will be delivered by the end of the year, and only expects five of nine ships originally scheduled for delivery in fiscal 2020 and 2021 are expected to be delivered by the end of 2021. Also Tuesday, Carnival said it expects a net third-quarter loss of $2.9 billion, including a $900 million cash impairment charge, and an adjusted net loss of $1.7 billion. • CVS Health Corp. CVS, -1.76% cut its guidance range for 2020 net earnings per share, citing losses on the early extinguishment of debt, but maintained its adjusted EPS outlook. The company now expects net EPS of $5.16 to $5.29, down from $5.59 to $5.72. Adjusted EPS is still expected to be $7.14 to $7.27, which surrounds the FactSet consensus of $7.23. CVS trounced second-quarter earnings estimates, even as the pandemic adversely affected revenue in the retail and pharmacy services segments, mostly due to fewer new therapy prescriptions due to lower provider visits. •Houston-based retailer Francesca’s Holdings Corp. FRAN, +2.49% is exploring its strategic options after the pandemic hurt its business, and said there is substantial doubt it can continue as a going concern. “During this review, we will continue to move forward operating the business while maintaining disciplined inventory and cost management,” Chief Executive Andrew Clarke said in a statement. “The COVID-19 pandemic has and continues to result in an overall disruption in the company’s operations and supply chain,” the company said in a statement. “As a result, the company’s revenues, results of operations and cash flows continue to be materially adversely impacted which raises substantial doubt about the company’s ability to continue as going concern.” • Sonic Automotive Inc. SAH, -1.02% expects third-quarter per-share earnings to range from $1.08 to $1.15, up 64% to 74% from the same period a year ago. The FactSet consensus is for EPS of $1.43. The car retailer’s new vehicle sales were down 9% in September to date, after falling 21% in August and 17% in July. Used vehicle sales were up 6% in September to date, after falling 9% in August and 5% in July. “We are very pleased with our operating performance in the third quarter to date, continuing our recovery from the challenges our industry faced earlier this year,” Chief Executive David Smith said in a statement. “Consumer demand for new and used vehicles and parts and service repair work has continued to improve steadily in recent weeks, particularly when factoring in the timing of this year’s Labor Day weekend sales compared to the prior year.” P • Southwest Airlines Co. LUV, +1.89% will redeem the $500 million in 2.650% notes due in 2020. The company said it will fund the redemption, which is expected to occur on Oct. 5, with cash on hand. Southwest said on Aug. 19 that it had $15.2 billion in cash and short-term investments, and said it expects it third-quarter cash burn to average about $20 million a day, as it continues to face reduced travel during the pandemic. • Square Inc. SQ, +2.06% says the share of transactions made in cash was 33.3% as of Aug. 1, down from 40.6% at the same time a year ago. Using 2019 as a baseline indicator, the payment processing company estimates the decline in the use of cash, as a result of the pandemic, would have taken three years without the pandemic. In February, before COVID-19 was declared a pandemic, 5.4% of Square sellers were cashless. That percentage increased to 23.2% by April, before declining and showing signs of stabilizing at 13.4% by August. “These new findings show a significant and stabilizing increase in cashless adoption rates compared to pre-pandemic, with business owners increasingly reliant upon contactless and online payments and consumers utilizing those alternatives,” Square economist Felipe Chacon said. “This signals that COVID-19 has already had what will likely be a lasting impact on consumer behavior.”"}]}