{"article": [{"url": "https://www.marketwatch.com/story/oil-edges-lower-as-worries-remain-over-rising-us-inventories-2020-07-23", "published": 1595517440.0, "headline": "Oil settles lower as worries remain over rising U.S. inventories and coronavirus cases", "body": "Oil futures settled lower Thursday, extending a decline seen the previous session after data showed an unexpected rise in U.S. crude inventories, as alarming growth in the number of U.S. cases of coronavirus point to the potential for further business shutdowns, dulling the prospects for energy demand. “Virtually all demand categories” showed a week-on-week decline in the report from the Energy Information Administration Wednesday, said Robbie Fraser, senior commodity analyst at Schneider Electric. The report showed a weekly fall of 98,000 barrels per day in implied demand for finished motor gasoline to 8.55 million barrels a day. Implied demand for distillate fuel oil fell 470,000 barrels per day to 3.22 million barrels a day. “That fall will tie into broader concerns around a rise in COVID cases in the U.S. and the potential economic headwinds that could bring moving forward,” Fraser said in a daily note. West Texas Intermediate crude for September delivery CL.1, -1.62% US:CLU20 on the New York Mercantile Exchange fell 83 cents, or 2%, to settle at $41.07 a barrel, while September Brent crude BRN.1, -0.07% UK:BRNU20 lost 98 cents, or 2.2%, at $43.31 a barrel on ICE Futures Europe. Crude prices finished slightly lower Wednesday, pulling back a day after settling at their highest since March, pressured by an unexpected weekly climb in U.S. crude stockpiles. The EIA reported Wednesday that U.S. crude inventories rose by 4.9 million barrels for the week ended July 17. That compared with an average forecast by analysts polled by S&P Global Platts for a decline of 1.9 million barrels. Also see:Gold shatters ‘summer doldrums’ as it climbs to record territory “Oil has shown resilience this week” with WTI prices just shy of multi-month highs thanks, in part, to “optimism that a COVID-19 vaccine will eventually help the global economy normalize,” said Tyler Richey, co-editor at Sevens Report Research. “Bottom line, if the latest outbreak in the coronavirus pandemic is not contained soon, then investor sentiment will take a hit and the outlook for the economic rebound will deteriorate and that is inherently bad for energy prices, as demand expectations will be revised lower,” he told MarketWatch. “Conversely, positive developments towards a vaccine will offer hope for economic normalization and could see the admittedly moderating uptrend in oil prices continue in the weeks ahead,” Richey said. Among the petroleum products Thursday, August gasoline US:RBQ20 fell by 1.9% to $1.2586 a gallon and August heating oil US:HOQ20 shed 1.3% to $1.2541 a gallon. Natural-gas futures, meanwhile, rallied as traders eyed storm activity in the Gulf of Mexico. “Aa tropical depression is building off the coast of Texas and may develop into Tropical Storm Hanna before reaching land” said Christin Redmond, commodity analyst at Schneider Electric, in a note. “The storm is likely to hit an area with offshore oil and gas production assets, which may temporarily reduce gas production in the near-term.” Meanwhile, the U.S. Energy Information Administration reported Thursday that domestic supplies of natural gas rose by 37 billion cubic feet for the week ended July 17. That was a bit larger than the average increase of 33 billion forecast by analysts polled by S&P Global Platts. August natural gas US:NGQ20 settled at $1.785 per million British thermal units, up 6.2%. That was the highest settlement since July 10, according to Dow Jones Market Data. “So far this summer, there has not been much of a general weather bid in natural gas as temperatures have not been hot enough to warrant above average energy demand for [air conditioning] needs,” said Richey. But “if forecasts begin to call for late summer heat waves, we could see nat gas make a run back above the $2.00 mark, which could market the beginning of a new uptrend.”"}]}