{"article": [{"url": "https://www.marketwatch.com/story/the-pandemic-made-everything-harder-financial-strategies-for-people-with-disabilities-and-special-needs-2020-07-09", "published": 1594296800.0, "headline": "The pandemic made everything harder: Financial strategies for people with disabilities and special needs", "body": "As COVID-19 has altered life as we once knew it, conversation regarding Americans’ health and financial security has dramatically increased. Amid all this chatter, however, there’s one group that’s often overlooked: people with disabilities and special needs. And, yet, the impact on this group has been exacerbated by the crisis and must be addressed. Higher risk of infection, social isolation and reduced access to services and medical supplies are just some of the disruptions faced by this community due to the pandemic. Adults with disabilities and special needs also experience higher rates of unemployment and underemployment — in 2019, roughly 19% of people with disabilities were employed, compared with 66% of the general population. What’s more, workers with disabilities are more likely to hold part-time roles: 32% of workers with a disability held part-time employment, compared with 17% of those with no disability. Couple these employment realities with the health and financial obstacles brought on by COVID-19, and challenges can abound. While it’s impossible to generalize the circumstances of a broad population, it’s important to recognize the unique factors the special needs community faces at this time, especially in light of the CARES Act.Stimulus checks and their impact on benefits Recently, millions of Americans received stimulus checks of up to $1,200, and many experts believe that a second round of economic impact payments may be forthcoming. But, how will these payments impact adults who are disabled and receive Supplemental Security Income (SSI) and Medicaid? SSI and Medicaid generally allocate financial resources to individuals who have less than $2,000 in assets. Most SSI recipients will automatically receive their stimulus payments. Stimulus payments received by SSI recipients will have a 12-month spend-down period, making it easier to sustain each state’s means-tested asset limit. Spend down typically must occur in the same calendar month in which the lump sum is received. To avoid any potential longer-term impact to means-tested benefit eligibility, stimulus dollars can be added to an Achieving a Better Life (ABLE) Account, where it will not be counted as assets for eligibility purposes. ABLE accounts and special needs trusts What is an ABLE account, and why can it be a valuable tool? In short, it’s a savings and investment account for people with disabilities that receives preferred federal tax treatment, and is generally not counted as an asset for means-tested government benefits. ABLE accounts are often viewed as an attractive short-term savings vehicle because they enable individuals with disabilities to budget, manage spending and save employment income or other funds to pay for qualifying disability-related expenses without jeopardizing their public assistance eligibility. Expenses that qualify include general expenses (such as food, housing and medical costs) and more specific disability-related expenses (such as assistive technology and employment training). Just like a 529 plan education account, ABLE account contributions are made with after-tax dollars and are generally exempt from federal taxation, though nonqualified distributions are subject to an additional tax on earnings. The accounts also typically have low to no startup costs. Maximum balances range from $300,000 to $500,000, depending on the state. Special needs trusts are often used in conjunction with an ABLE account as a legal structure that allows for supplemental assets to accumulate or be gifted without affecting government benefits. Individuals with disabilities or special needs can set up a first-party trust to hold their own assets, such as unexpected inheritances, child support and even structured-settlement money. Holding assets in a first-party special needs trust protects access to needs-based government benefits, without limits on the amount or type of assets. It’s important to note that when using this type of trust, the estate of individuals receiving Medicaid will be required to reimburse the money paid for care at the time of death. A caregiver or family member can also set up a third-party trust to hold assets provided to a person with a disability from another source, such as larger gifts or a life insurance policy death benefit. Third-party trusts are not subject to Medicaid pay back after the death of the trust beneficiary.Financial planning moving forward One out of every four people in the United States lives with a disability at some point in their lives. They, alongside all Americans, will need to adapt to the changes brought forth in this pandemic — including thinking through essential priorities that must be baked into a financial plan. Emergency savings, backup-care plans, supplemental protection policies and ABLE accounts may take on additional prominence in plans going forward, as families experiencing the disruptions of COVID-19 see the need for preparing for the next event that may come in the future. Limitations on visitors and other logistical challenges might highlight the need for legal documents to be crafted, prompting families and individuals to set up time with a well-qualified attorney for short-term and long-term legal planning. Even in the best of circumstances, financial planning can be a complicated process that the disabilities and special needs community often puts off to another day, given the unique challenges and opportunities this group can face. Add in a pandemic, and the importance of planning — especially for emergencies — becomes crystal clear. Matt Stagner is a special needs financial consultant with Voya Cares."}]}