{"article": [{"url": "https://www.marketwatch.com/story/gold-muted-as-traders-keep-eye-on-u-s-dollar-11601990051", "published": 1601993060.0, "headline": "Gold futures end lower, retreating from their highest levels in 2 weeks", "body": "Martin Abbugao/Agence France-Presse/Getty Images Gold futures finished lower on Tuesday, a day after settling at their highest in just over two weeks on the heels of a weaker U.S. dollar. Investors continued to keep an eye on the moves in the dollar, as well as prospects for additional stimulus from Washington. “Gold price consolidation continues,” said Will Cai, partner at Wilshire Phoenix. Prices have been “resilient with fundamental supporting factors still in place,” he said in emailed commentary. “Some of the underlying drivers are themselves in retracement/consolidation after overextension,” including real interest rates–thus affecting gold price. “General bullish macro conditions” are still in play for gold in medium to long term, such as economic uncertainty and inflation expectations, he said. Gold for December delivery GCZ20, +2.17% fell $11.30, or 0.6%, to settle at $1,908.80 an ounce on Comex. Prices had tacked on 0.7% Monday to settle at $1,920.10–the highest for a most-active contract since Sept. 18, according to FactSet data. December silver fell 64 cents, or 2.6%, to $23.921 an ounce, giving up more than the 2.2% climb from a day earlier. The dollar, as measured by the ICE U.S. Dollar Index DXY, -0.58%, fell Monday and was little changed in Tuesday dealings. A weaker dollar is seen as a positive for gold and other commodities priced in dollars, making them less expensive to users of other currencies. A rise in Treasury yields though on Tuesday was seen as a negative for gold. Falling yields have contributed to the metal’s gains this year, reducing the opportunity cost of holding nonyielding assets like commodities. It would likely take a big rebound for the dollar and a slide in government bond prices, or a sustained rise in yields, to spark a sharp gold selloff, said Fawad Razaqzada, market analyst at ThinkMarkets, in a note — a scenario he sees as unlikely. “Well, for yields to rise sharply, the Fed and other major central banks will have to drop their dovish views and start tightening their belts. So, it all boils down to the economy,” he said. “But right now, or in the foreseeable future, the global economy is not in a state that requires tighter monetary – and indeed fiscal – conditions.” On Tuesday, Federal Reserve Chairman Jerome Powell reiterated his belief that the U.S. economy needs more fiscal support, even as the recovery from pandemic has been strong thus far. “The recovery will be stronger and move faster if monetary policy and fiscal policy continue to work side by side to provide support to the economy until it is clearly out of the woods,” he said in a speech to the National Association for Business Economics. In other Comex metals trading, December copper HGZ20, +1.38% barely budged, up 0.02% to $2.9635 a pound. January platinum PLF21, +3.84% shed 3.8% to $870.30 an ounce, but December palladium PAZ20, +2.31% settled at $2,391.20 an ounce, up 0.5%."}]}