{"article": [{"url": "https://www.marketwatch.com/story/the-biggest-risk-to-social-security-is-inaction-for-4-more-years-on-the-looming-funding-crisis-11602187211", "published": 1602246380.0, "headline": "The biggest risk to Social Security is inaction for 4 more years on the looming funding crisis", "body": "Social Security is arguably the most important program of the federal government. And yet, the long-term stability of the fabled system is once again barely a blip on the radar in the presidential campaign. At this point, the media coverage focuses on proposals that no one has formally made (like abolishing the payroll tax and funding the program through general tax revenue), proposals that no Congress would pass and legislation that no president would sign. The simple truth is we need to stop worrying about the possibility that someone might defund Social Security and focus more on the probability that whoever is elected will do nothing. Right now, neither candidate offer anything more than vague promises to protect Social Security, without any detail of how. In 12 debates for candidates for the presidency (both in the primaries and in the general election), the moderators have asked zero questions about the program’s finances. As Captain Obvious might say, politicians aren’t going to provide answers until we ask questions. Millions of people depend upon this system. It is time for Washington to have a plan. In its latest report, the Social Security trustees announced that they believe the system could pay full benefits for another 15 years, or roughly the life expectancy of someone turning 72 today. In other words, about half of these people are apt to turn 87 in 2035 when the system as defined by current law delivers benefit cuts to all beneficiaries. These are the retirees over whom so many hands have been wrung over the last 40 years. In another 15 years, more people in this group will have exhausted savings, and fewer able to return to work. In fact, the percentage of these people who get 90% of their income from Social Security is apt to nearly double by 2035. It isn’t just that the program is on a path to crisis. The concern today should be that the path converges with rising importance of benefits meeting a dwindling supply of cash. Promoting the long-term stability of Social Security now is more important than ever because it may be another four years before this opportunity presents itself again. The last time that the nation had this chance, voters nominated for president the two people who said the least about the program, and subsequently elected the guy who promised to do nothing. He has kept his word to frightening effect: since Trump arrived in Washington, the program has created nearly $5 trillion dollars in promises that no one expects it to keep. This is the cost of doing nothing. The driver of this metric is the passage of time. In 2019, the program generated more $500 billion in empty promises solely because the program’s trustees changed the valuation date of their report. In 2020, it will cost at least as much, and more in 2021 as a result of how math works. Since 1983, roughly two-thirds of the gap in the system’s finances comes from the ticking of the clock. In contrast, the demographic changes that we have experienced over the last 40 years actually made the program more solvent. In other words, the experts at that time knew that we were living longer but they failed to imagine nearly 40 years of Congressional inaction on Social Security. Let’s be honest. It isn’t inaction. It is the callous neglect of a program on which millions depend. Politicians on the other hand tend to discount these concerns suggesting that we have been here before. This is a dangerous misconception. In 1983, the program faced a brief period of shallow solvency, a modest challenge that could be addressed without materially affecting current voters. When policy managers talk about insolvency today, it is deep and grows forever. Understand, Social Security is a contentious subject that is largely polarized by hyperbolic sound bites. As a result, Americans share little agreement on the basic facts of the program’s future. In any discussion, someone has a fact that is someone else’s myth. There is really only one fact on which all experts agree: the longer we wait the tougher it gets. It isn’t going to be easier in 2024. Now read: Where Biden and Trump stand on Social Security Brenton Smith writes about Social Security."}]}