{"article": [{"url": "https://www.marketwatch.com/story/v-shaped-u-shaped-or-l-shaped-why-the-look-of-the-economys-recovery-doesnt-really-matter-2020-06-16", "published": 1592644340.0, "headline": "V, U, W or L â\u0080\u0094 hereâ\u0080\u0099s what really matters about the shape of the economyâ\u0080\u0099s recovery", "body": "Thereâ\u0080\u0099s been endless speculation about what kind of rebound the U.S. economy will have. Will it be a quick V-shaped recovery, or a long period between the decline and subsequent recovery (a U-shape)? Other possible recovery shapes have been likened to the letters â\u0080\u009cWâ\u0080\u009d and â\u0080\u009cL.â\u0080\u009d In truth, this alphabet soup â\u0080\u009cultimately matters very little,â\u0080\u009d according to Vincent Deluard, head of global macro strategy at investment firm INTL FCStone. In an email, he said that investors should not be discouraged by this, because, he notes, â\u0080\u009ceconomic forecasting, a perilous exercise at the best of times, is even more futile today: we have no idea whether there will be a second wave of infections or not, inflation or deflation, a balance sheet recession or a debt jubilee etc.â\u0080\u009d Therefore, knowing that forecasts donâ\u0080\u0099t make much a different to our investment strategies should be reassuring. Read: The coronavirus recession may already be over, but itâ\u0080\u0099s a long uphill climb to â\u0080\u0098normalâ\u0080\u0099 Deluard reached his counterintuitive findings upon calculating the performance of a hypothetical investor who was able to predict what the final GDP number would be four quarters in advance. That implies an incredible level of clairvoyance, of course, since itâ\u0080\u0099s well after a given quarter has ended that the government arrives at that quarterâ\u0080\u0099s final GDP number. Yet Deluard found that this hypothetical investor, despite possessing amazing clairvoyance, would have barely beaten a simple buy-and-hold strategy over the past seven decades. Specially, he assumed that this investor would be 100% invested if GDP growth four quarters hence was faster than in the current quarter; otherwise he would invest in cash. Since the late 1940s, this investor would have beaten the S&P 500 SPX, +0.87% Â by less than an annualized percentage point. That is an awfully small reward for being a perfect forecaster, especially since the odds are overwhelming that our forecasts will fall far, far short of being perfect. Consider what Deluardâ\u0080\u0099s findings mean for our current uncertain situation, in which we donâ\u0080\u0099t really know how fast the economy is growing. But weâ\u0080\u0099d have very little leg up on our fellow investors even if we knew now that economic growth would be accelerating in the second quarter of 2021. Why does knowledge of the economyâ\u0080\u0099s future growth rate matter so little? Deluard argues that itâ\u0080\u0099s because profit margins and P/E ratios matter a lot more. The economy can be growing at a fast clip, after all, but if profit margins are shrinking that growth wonâ\u0080\u0099t translate into earnings growth. And fast-growing earnings canâ\u0080\u0099t always overcome a shrinking P/E ratio. This outsized role that the P/E ratio plays relates to the discount rate that investors use â\u0080\u0094 either explicitly or implicitly â\u0080\u0094 when valuing companiesâ\u0080\u0099 future earnings. With a high discount rate, future yearsâ\u0080\u0099 earnings mean relatively little to a companyâ\u0080\u0099s current valuation. With a low discount rate, they matter a lot more. Indeed, Deluard recently showed that, depending on the discount rate used, the S&P 500 now is fairly valued anywhere between 1,851 and 3,386. No wonder, as Deluard put it, knowing in advance the GDPâ\u0080\u0099s growth rate is â\u0080\u009cremarkably useless.â\u0080\u009d None of this is to say that the economy doesnâ\u0080\u0099t matter. It very much does, of course. But its impact is greatest when focusing on the stock market over the long term. Over shorter periods, the economy plays a lesser role than profit margins and valuation-linked discount rates. This discussion also puts into perspective the recent debate about the apparent disconnect between the stock market and the economy. What Deluardâ\u0080\u0099s research shows is that this disconnect is neither new nor particularly larger now than in years past. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com More: Donâ\u0080\u0099t give up on low-volatility stock strategies just yet, despite their poor recent performance Also read: The stock market is tracing an important reversal pattern that you should watch"}]}