{"article": [{"url": "https://www.marketwatch.com/story/dont-ever-ever-underestimate-the-potential-of-the-pandemic-5-reasons-scientists-say-you-should-be-afraid-of-covid-19-2020-10-06", "published": 1602038060.0, "headline": "'Don't ever, ever underestimate the potential of the pandemic': 5 reasons scientists say you should be afraid of COVID-19", "body": "Panicking about COVID-19 won't help you get through the pandemic, health professionals say. And neither will treating the novel coronavirus, a highly unpredictable disease for which there is no 100% successful therapeutic treatment, with anything less than extreme caution. In short, it affects everyone differently. President Trump was released from Walter Reed National Military Medical Center on Monday and, upon his release, told the nation, \"Don't be afraid of it.\" Many \"long haulers,\" meanwhile, pointed out on Twitter that they had suffered coronavirus-related health problems for months after their diagnosis. Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases for the last three decades, told CNN on Monday night that Trump \"looked like he was in pretty good shape\" after leaving the hospital, but noted the potential for a \"reversal\" in his condition in coming days. (Fauci said he has not been involved in Trump's care.) \"The issue is that he's still early enough in the disease that it's no secret that if you look at the clinical course of people, sometimes when you're five to eight days in, you could have a reversal,\" Fauci said. \"It's unlikely that it will happen, but they need to be heads-up for it. He knows it, the physicians know it. So they're going keep an eye out on it; they're going to try and do that within the confines of the White House as opposed to in the hospital.\" “ 'COVID is a complete threat to the American population.' ” - Dr. David Nace, University of Pittsburgh Medical Center The world still has a lot to learn about the novel coronavirus - and that alone, experts say, should be enough to motivate communities to work together to slow its progress. Scientists don't advise mass hysteria, but they also don't believe that going about business as usual is a wise move. \"COVID is a complete threat to the American population,\" Dr. David Nace of the University of Pittsburgh Medical Center told the Associated Press. \"Most of the people aren't so lucky as the president,\" he said, citing Trump's extensive medical team and unique access to trial treatments. Governments around the world are struggling to stop the spread of the pandemic. The so-called Spanish flu of 1918 and 1919 and Black Death from 1347 to 1351 were two of the most extreme global pandemics - an epidemic, in contrast, affects regions or a community - ever recorded. COVID-19 had killed at least 210,909 people in the U.S. as of Wednesday, according to data aggregated by Johns Hopkins University, and there were 7,501,612 confirmed cases. Worldwide, there were 35,806,345 confirmed cases of the virus and 1,049,754 deaths. In his address to the nation posted on Twitter TWTR, -0.23%  on Monday evening, Trump said, \"Maybe I'm immune.\" Immunity to a disease typically involves displaying no symptoms of the disease and, in the case of COVID-19, would involve not requiring oxygen and hospitalization. Here are five reasons that people should remain vigilant, according to doctors and scientists: President Trump waves from the back of a car in a motorcade outside Walter Reed Medical Center in Bethesda, Md., on Sunday night. He returned to the White House on Monday. 1. There is no vaccine There is no vaccine for COVID-19. If and/or when there is one available, it's unlikely to be distributed to the general public until early to mid-2021, according to multiple estimates. Frontline workers, people with pre-existing conditions and older people will likely be first in line. What's more, humans have not built up an immunity over multiple generations. The first vaccine could be 40% effective, and be distributed while the world awaits a more successful vaccine. The measles vaccine is among the most effective, providing 97% immunity. However, Fauci said the best-case scenario for a COVID-19 vaccine, based on other vaccines for various diseases, would be 70% to 75% effective. To put that in perspective: Reviews of past studies have found that, on average, the flu vaccine is about 50% to 60% effective for healthy adults between 18 and 64 years old, according to a review of studies by the Mayo Clinic. AstraZeneca AZN, +1.16% ; BioNTech SE BNTX, +1.23% and Pfizer PFE, -0.27% ; GlaxoSmithKline GSK, +1.10% ; Johnson & Johnson JNJ, +1.39% ; Merck MERK, +1.59% ; Moderna MRNA, +0.09% and Sanofi SAN, -1.48%  are all working on vaccines. The first known person was reported to have contracted the virus on Dec. 1 in China, according to an article in The Lancet, and turned into a pandemic in a few short months. Getty Images 2. COVID-19 is highly contagious COVID-19 is highly contagious through invisible droplets in the air, spread through talking, breathing and coughing. Community spread - as the White House Rose Garden ceremony at which Amy Coney Barrett was introduced as Trump's pick to replace Ruth Bader Ginsburg on the Supreme Court is believed by many to attest - can even happen outdoors. Public health experts advise people to be mindful and alert. News Pulse:White House is not tracing contacts of guests and staff at Rose Garden event 10 days ago: New York Times This is all the more necessary as more children return to school. A recent study published in JAMA Pediatrics suggests that even children can spread SARS-CoV-2, the coronavirus that causes COVID-19, even if they never develop symptoms or long after symptoms have cleared. A separate systematic review estimated that 16% of children with a SARS-CoV-2 infection are asymptomatic, but evidence suggests that as many as 45% of pediatric infections are asymptomatic, according to the Centers for Disease Control and Prevention. A maskless jogger can leave a 30-foot \"droplet slipstream\" in his or her wake, according to Gregory Poland, who studies the immunogenetics of vaccine response in adults and children at the Mayo Clinic. \"The virus can't measure,\" he said. Children appear to respond to the virus in a different way than adults, and the risk for people of serious illness or deaths worsens as they get older. Damien Meyer/AFP via Getty Images 3. The virus acts in peculiar ways Genes in the body that appear to be a major factor giving SARS-CoV-2 access to the heart cells become more active with age, according to research published in August in the Journal of Molecular and Cellular Cardiology. What's more, \"inflammation in older people can be more intense, causing organ damage,\" Johns Hopkins University reported. \"Lung tissue becomes less elastic over time, making respiratory diseases like COVID-19 a particular concern for older people.\" Adult patients can respond to COVID-19 with an overvigorous adaptive immune response that may promote the inflammation associated with acute respiratory distress syndrome, a type of serious lung damage now associated with severe COVID-19 cases, health professionals say. Doctors today attribute that phenomenon to the \"cytokine storm\" or hypercytokinemia, a process where the immune system in healthy people reacts so strongly that a surge of immune cells and their activating compounds (cytokines) effectively turn the body against itself. Some figures show that 40% of coronavirus transmission is due to carriers not displaying symptoms of the illness. MarketWatch photo illustration/Getty Images, iStockphoto 4. Untold numbers of people are asymptomatic Fauci said in July that in his 40 years of dealing with viral outbreaks, he had never seen anything like COVID-19, particularly in a singular way that helped lead to one of the biggest public health crises in a generation. \"I've never seen a single virus - that is, one pathogen - have a range where 20% to 40% of the people have no symptoms,\" Fauci said during a House Committee on Energy and Commerce hearing on the Trump administration's response to the pandemic. The World Health Organization currently estimates that 16% of people with COVID-19 are asymptomatic and can transmit the coronavirus, while other data show that 40% of coronavirus transmission is via carriers not displaying symptoms of the illness. A recent University of California, San Francisco, study found that there's a high load of SARS-CoV-2 shedding in the upper respiratory tract, even among presymptomatic patients, \"which distinguishes it from SARS-CoV-1, where replication occurs mainly in the lower respiratory tract.\" A recent European Respiratory Journal study said the virus may attack an enzyme in the nose as a gateway to enter the body, which is why some people with COVID-19 lose their sense of smell. It's also one way the coronavirus differs from the flu. Getty Images/MarketWatch photomontage 5. Flu season is approaching As more people move indoors in the winter, flu season is approaching and doctors are understandably concerned about a \"twindemic.\" Both influenza and COVID-19 are untreatable with antibiotics and have almost identical symptoms: fever, coughing, night sweats and tiredness. Luis Ostrosky, a member of the Infectious Diseases Society of America, \"herd immunity\" to flu strains can accrue as a tipping-point percentage of people contract the virus or are immunized against it by a vaccine. \"When there are enough people in the community who are immune, it protects people who are not immune,\" he said. That is not at present the case with COVID-19. COVID-19 and the flu can result in fever, but the former has a dry cough and can also result in the loss of a sense of smell and taste, as well as chronic fatigue. Flu symptoms are typically characterized by the onset of a runny nose, sore throat, coughing, aches and pains, and chills. In July, Fauci told MarketWatch that people should think twice before eating inside a restaurant. \"Indoors is much worse than outdoors,\" he said. And Ryan Malosh, an epidemiologist at the University of Michigan School of Public Health, said, \"There's nothing magic about 6 feet.\" \"We need to hunker down and get through this fall and winter, because it's not going to be easy,\" Fauci, the nation's leading infectious-disease expert who also worked on the front lines of the AIDS pandemic, said during a panel discussion with Harvard Medical School last month. AIDS, he reminded people, infected up to 76 million people worldwide, and 33 million people have died from that virus. \"We've been through this before,\" Fauci added. \"Don't ever, ever underestimate the potential of the pandemic. And don't try and look at the rosy side of things.\""}]}