{"article": [{"url": "https://www.marketwatch.com/story/the-cost-of-bidens-economic-plan-to-the-stock-market-is-more-than-you-might-think-2020-07-10", "published": 1594456400.0, "headline": "The cost of Biden's economic plan to the stock market is more than you might think", "body": "While momentum investors are increasingly focused on ever-higher stock prices, prudent investors should start focusing on the presidential election. Democratic front-runner Joe Biden released his \"Buy American\" economic plan to challenge President Trump. Still, investors need to ask how Biden would pay for the plan. He could take away Trump's tax cuts for corporations and the rich. But Biden and Trump might also share a strategy: Borrow more and influence the Federal Reserve to print more money. Readers know that I am politically agnostic. My sole job is to help investors. Let's explore the issue by reviewing the Dow Jones Industrial Average ETF DIA, +0.57%, which tracks the Dow Jones Industrial Average DJIA, +0.56%. Note the following: â\u0080¢ Based on Biden's tax policies, the stock market in theory could drop, and it could find support at a buy zone. That would be 20% lower than where it is today. â\u0080¢ Prudent investors should protect themselves. â\u0080¢ From 2012 to today, the majority of the rise in the stock market is attributable to the Federal Reserve's enlarged balance sheet and lower interest rates. Please see \"Here's the case for Dow 30,000 in Trump's first term.\" â\u0080¢ The big money is hiding in the five large-cap tech stocks of Apple AAPL, +1.74%, Amazon AMZN, +3.01%, Microsoft MSFT, +2.48%, Alphabet GOOG, +1.97%  GOOGL, +1.82%  and Facebook FB, +0.26%. Those five stocks are experiencing a significant \"pile-on\" effect - buying for reasons that have nothing to do with fundamentals. â\u0080¢ Keep an eye on stocks that would benefit from the Biden plan. Examples include Tesla TSLA, +1.89%, Canopy Growth CGC, +2.49%  and Centene CNC, -0.74%. Five contributors to a stock market drop Here is a simple calculus of what, in theory, should happen with Biden's tax policy. â\u0080¢ Biden would be likely to increase the capital gains tax, perhaps as high as 39% for upper-income individuals. That could lead to selling before such a law were passed. â\u0080¢ Due to higher corporate tax rates, S&P 500 SPX, +0.87%  earnings would take about a 7% hit. â\u0080¢ Due to more regulation, S&P 500 earnings would take a 2%-3% hit. â\u0080¢ Potential restrictions on buybacks and also less free cash flow due to higher corporate taxes would be a negative for the stock market. â\u0080¢ With wealthy individuals paying more taxes, they would have less money to buy stocks. All in all, the foregoing calculates to about 20% hit to the stock market.New stock market highs None of it may matter, and the stock market may hit new highs, if the following two factors take hold: â\u0080¢ If Biden starts surging in the polls along with the possibility of a \"blue sweep,\" expect market professionals and hedge funds to build up short positions. Short positions act as fuel for a rally if subsequently a short squeeze takes hold. Some 65% of the first leg of the rally from the March 23 coronavirus low was short-squeeze-related. The second leg of the rally was 35% short-squeeze-related. If a short squeeze takes hold again, it could easily take the stock market to new highs. â\u0080¢ An up move due to a short squeeze these days goes a lot farther due to the momentum crowd jumping on. The momentum crowd has already formed a habit of buying stocks aggressively on the news of more government borrowing and more money printing. With more borrowing under the Biden administration, the prevailing wisdom among the momentum crowd that more borrowing and more money printing is good may lead to new stock market highs. What does it all mean? Prudent investors need to stay extra alert and nimble as well as have protective measures in place while positioned to take advantage of potential new stock market highs. Protective measures should be dynamically adjusted. Of course, if you are part of the momentum crowd, it is real easy - celebrate borrowing and money printing with more buying in the stock market. Please read \"Here's the secret sauce to handle the stock market's election and virus fears.\" Disclosure: Arora Report portfolios have positions in Apple, Amazon, Alphabet, Microsoft and Facebook. Nigam Arora is the founder of The Arora Report, which publishes four newsletters. He can be reached at Nigam@TheAroraReport.com."}]}