{"article": [{"url": "https://www.marketwatch.com/story/beyond-meat-offers-discounts-during-covid-19-to-take-advantage-of-higher-beef-prices-2020-08-05", "published": 1596716600.0, "headline": "Beyond Meat offers discounts during COVID-19 to take advantage of higher beef prices", "body": "Beyond Meat Inc. has been offering discounts during the coronavirus pandemic to encourage consumers to try its plant-based burgers and other products as beef prices rose. The tactic was part of a broader strategy to grow the business and put more protein alternatives on people’s plates, even as the company’s foodservice business wilted due to COVID-19. “[W]e developed value packs for retailers, offered promotional and reduced pricing at retail to encourage greater consumer trial during a period of higher beef prices, switched food service production lines over to retail products, repacked food service inventory for retail sale, supported our QSR [quick-service restaurant] and food service partners with incremental programs and continued to invest in what our brand stands for by providing free product to first responders and those in need,” said Beyond Meat BYND, +0.80% Chief Executive Ethan Brown on the late Tuesday earnings call, according to FactSet. “Many of these efforts, like the COVID-19 crisis itself, continue. And I’m proud to report that early indications suggest each have been highly effective.” Beyond Meat reported second-quarter revenue of $113.3 million, up 69% from 2019. The company said the rise was driven by an increase in volume sold, though it was partially offset by promotional programs. Read:Beyond Meat shares dive 8% following widening loss Beyond Meat stock slumped 6.7% in Wednesday trading, though it has rallied 76.7% for the year to date. The S&P 500 index SPX, +0.87% has gained 3% for 2020 so far. Besides price, Beyond Meat is showing up at more meals because it launched a new product, Cookout Classic, which was introduced at the end of the quarter and contributed 16 points to year-over-year volume growth, according to Brown. That product is available at Walmart Inc. WMT, +1.00% and Target Corp. TGT, +1.14% Beyond Meat also recently expanded to warehouse club chains Sam’s Club, which is part of Walmart, and BJ’s Wholesale Club Holdings Inc. BJ, +1.19% And Beyond Meat has been added to a number of restaurant and convenience store menus, including Yum Brands Inc.’s YUM, +0.08% KFC chain, where Beyond Fried Chicken was made available in the areas around Los Angeles and San Diego. Beyond Meat’s breakfast sausage was also recently made available at 650 Wawa convenience store locations, with the remaining 220 coming next week. “The quarter was not without its messiness but demonstrated the company was able to quickly pivot its supply, distribution and marketing efforts to the retail channel in the face of market challenges,” wrote BTIG analysts led by Peter Saleh. “While foodservice will likely remain a headwind for several more quarters, we view the retail sales growth as a testament to demand for the product and believe ample opportunity remains as distribution and product offerings expand.” BTIG rates Beyond Meat stock buy with a $173 price target. Don’t miss:Coca-Cola launching Topo Chico Hard Seltzer as brands from Sam Adams parent and Molson Coors soar CFRA upgraded Beyond Meat to hold from sell and raised its price target to $130 from $95. UBS analysts led by Erika Jackson are more downbeat about Beyond Meat’s prospects due to the recessionary environment, increased competition and continued weakness in the foodservice business. UBS rates Beyond Meat shares sell, but raised its price target $5 to $110. Competitors are forging partnerships of their own, with Impossible Foods beginning the rollout of its product at nearly 2,100 Walmart Supercenters and Neighborhood Markets. Other companies in the plant-based protein market include Dr. Praeger’s, which launched a Farm Stand Cauliflower Burger on Wednesday. That company is known for its California Veggie Burger, sold in Amazon.com Inc.’s AMZN, +3.01% Whole Foods grocery chain. And outside of plant-based meat, there was the launch last month of new plant-based seafood items like New England-style plant-based crab cakes and plant-based fish burgers from Good Catch, which is backed by celebrities including Woody Harrelson and Paris Hilton. Plant-based eggs from Just Egg, which will be going to Walmart and Whole Foods in Canada in the fall, can be found on breakfast sandwiches at chains like Gregorys Coffee. Meanwhile, Tyson Foods Inc. TSN, -1.71% , which originally held a 5% stake in Beyond Meat, reported fiscal third-quarter earnings on Monday, has lowered beef prices during the pandemic after the cost to consumers rose. Tyson’s beef sales fell to $3.65 billion from $4.16 billion last year, though the average price for beef rose 11.6%. “We saw large supplies of market-ready livestock during the quarter but continued to experience production inefficiencies and lower throughput due to our decisions to temporarily idle some facilities in an effort to protect our team members,” said Samuel Dean Banks, president of Tyson Foods, on the earnings call, according to a FactSet transcript. Banks has been named the chief executive of Tyson Foods, effective October 3. Tyson announced on July 30 that it has created a new role, chief medical officer, and has added nurses to the staff as part of a new COVID-19 monitoring program. See: We have plenty of food, so why are grocery store shelves so empty?"}]}