{"article": [{"url": "https://www.marketwatch.com/story/millions-of-people-of-color-in-the-us-do-not-have-access-to-running-water-affordable-health-care-and-quality-education-2020-06-02", "published": 1592745920.0, "headline": "After Juneteenth, a reminder that millions of African Americans have NO access to affordable health care or quality education", "body": "The country has been rocked, and also inspired, by protests over the death of George Floyd. Floyd, who was black, died on May 25 after a white Minneapolis policeman kneeled on his neck with the full weight of his body for nearly nine minutes. This month, prosecutors added a second-degree murder charge in addition to the third-degree charge already filed against former officer, Derek Chauvin. “ The causes of the unrest go much deeper than the most recent police brutality. Income inequality has grown to its highest level in 50 years. ” But the causes of the unrest obviously go much deeper than the most recent police brutality that was caught on a smartphone camera by passersby. Income inequality has grown to its highest level in 50 years. Indeed, research suggests that racial inequality runs through education, health care, and a major report released last year further concluded that race and poverty are key determinants of who even has access to clean water and sanitation. Poor, dense neighborhoods in New York’s outer boroughs have highest rate of COVID-19 deaths, ZIP Code data shows. Canarsie-Flatlands in Brooklyn, home to four New York City Housing Authority developments, and Far Rockaway in Queens, both areas with disproportionate amounts of public housing, have been hit hardest by the virus. The worst-hit ZIP Code in Canarsie-Flatlands has had 612 deaths per 100,000 residents — more than triple the city average and the highest rate in the city. The number of confirmed COVID-19 cases continues to rise. As of Sunday, less than six months after the first reports of the novel coronavirus, the COVID-19 pandemic, there were 2,264,168 confirmed cases of COVID-19 in the U.S. and 119,796 deaths, including 31,083 deaths in New York, the most of any state in the country. Worldwide, there were 8,835,095 confirmed cases and 465,284 deaths as of Sunday, according to Johns Hopkins University. Also see: George Floyds and Christian Coopers are all around you — they are your neighbor, teacher, co-worker and friendBlack Americans face lower life expectancies African-American COVID-19 patients have 2.7 times the odds of being admitted to the hospital compared to non-Hispanic white patients after controlling for sex, age, income and co-morbid health conditions, according to a separate study in the latest edition of the peer-reviewed journal Health Affairs conducted by researchers affiliated with Sutter Health, a nonprofit health system in northern California. Black and Latino people in New York City are more likely to die than Caucasians, data released last month by the City of New York showed. Hispanic residents were dying at a rate of 21.3 per 100,000, black and African-American people were dying at a rate of 23.1 per 100,000, other non-Hispanic/Latino, non-white races were dying at a rate of 40.2 per 100,000. Meanwhile, white people were dying at a rate of 15.7 per 100,000 and Asians at a rate of 9.1 per 100,000. Hispanic residents were dying at a rate of 21.3 per 100,000, black and African-American people were dying at a rate of 23.1 per 100,000, other non-Hispanic/Latino, non-white races were dying at a rate of 40.2 per 100,000, it added. Meanwhile, white people were dying at a rate of 15.7 per 100,000 and Asians at a rate of 9.1 per 100,000. “This virus is not hitting New Yorkers equitably,” Health Commissioner Dr. Oxiris Barbot said. Overall, black Americans face lower life expectancies than their white counterparts and remain at greater risk for stroke, heart disease, HIV, cancer, mental illness and diabetes. Racial minorities have not received the same quality of care as their white counterparts, government research shows. Also see: ‘No matter how well you speak, or how educated you are, my blackness will always define me.’ Black graduates on racism in America Allyson Schwartz, president and CEO of the Better Medicare Alliance, and Daniel Dawes, an attorney, scholar and educator serving as the Morehouse School of Medicine’s Director of the Satcher Health Leadership Institute, said people of color may have been less reluctant to seek help. “Last year, we assembled key health equity leaders — including the National Minority Quality Forum, members of the Congressional Black Caucus, the NAACP, and the National Black Nurses Association — for a convening led by the Better Medicare Alliance to discuss these systemic challenges and to find a way forward,” they wrote in a recent op-ed for MarketWatch. “Throughout the gathering, we heard common refrains: people of color often feel disconnected from their primarily white health-care providers and there is woeful under-representation of minority providers in health care,” they added. The Affordable Care Act, however, created new health coverage options that helped to narrow racial disparities in health-care coverage. Still, “most groups of color remained more likely to be uninsured compared to whites,” according to the nonprofit Kaiser Family Foundation. “Moreover, despite the larger coverage increases for groups of color, the relative risk of being uninsured compared to whites did not improve for some groups. For example, blacks remained 1.5 times more likely to be uninsured than whites from 2010 to 2018, and the Hispanic uninsured rate remained over 2.5 times higher than the rate for whites.” Also see:Stimulus checks are a mere Band-Aid for Americans — amid fears of an even bigger economic crisis than the Great Recession‘Closing the water access gap’ More than 2 million people in the U.S. lack running water and basic indoor plumbing, according to this report by the human-rights nonprofit DigDeep and the nonprofit U.S. Water Alliance. This is all the more concerning during a pandemic. “A hundred years ago, water-borne illnesses such as cholera were a leading cause of death in the United States. Recognizing the threat to public health, our government invested in modern systems that extended safe and reliable drinking and wastewater services to nearly every American,” the report said. “Today, however, federal funding for water infrastructure is a small percentage of what it once was, and communities that did not benefit from past investments have a harder time catching up. Some communities even report that they are losing access to services they once had, suggesting that fewer people tomorrow will have a working tap or toilet than do today,” it added. Read also:‘The housing emergency most harms people of color:’ Black Americans face an unequal housing market — and coronavirus could make it worse “Closing the water access gap in the United States is difficult because no one entity — whether a federal agency or research institution — collects comprehensive data on the scope of the problem. Though many other countries track their progress towards universal water and sanitation access, data sets in the United States are incomplete, and official data-collection efforts under-count vulnerable populations like communities of color and lower-income people.” Native Americans are 19 times more likely to lack indoor plumbing than their white counterparts, putting them in the worst spot of any group, and African-American and Latinx households lack indoor plumbing at almost twice the rate of white households, the report found. Higher educational attainment and income in African-American and Latinx households, for example, was positively associated with complete plumbing access. (Complete plumbing refers to running water, shower or bath, tap and flush toilet, though the Census Bureau eliminated the toilet question in the 2016 ACS.) Whole communities — often clustered in specific areas — experience lack of access to complete plumbing, they added.Less educated workers hardest hit by COVID-19 Gallup data released Monday data add more support to previous research that less-educated workers in low-wage, blue-collar roles have been hardest hit by COVID-19, and suggests the pandemic is exacerbating the income inequality that existed before its arrival.” Some 95% of workers in low-income households — making less than $36,000 per year — have either been laid off as a result of the coronavirus (37%) or have experienced a loss in income (58%). The lack of access to education for people of color in the U.S. ties back to America’s history of systemic racial discrimination, experts suggest. “Black students are three times more likely to be suspended or expelled than white students, according to the Education Department’s Office for Civil Rights, and research in Texas found students who have been suspended are more likely to be held back a grade and drop out of school entirely,” the Justice Policy Institute reported. “While black children made up 16% of all enrolled children in 2011-2012, according to federal data, they accounted for 31% of all in-school arrests. The disparity begins in preschool: 48% of preschool children suspended more than once are black. And students with disabilities are also suspended more frequently than students without disabilities,” the Justice Policy Institute, a research group dedicated to reducing incarceration and promoting policy reforms in criminal justice, added. That history has also limited the resources black families have to pay for college, made it more likely that black students will attend colleges with limited resources and be targeted by predatory colleges, while still facing barriers to entering wealthy, elite higher education institutions. They’re also more likely to struggle to repay the debt after they leave school. In fact, 12 years after entering college, white men have paid off 44% of their student-loan balance on average, according to an analysis released last year by Demos, a left-leaning think tank. For white women, that share drops to 28%. For black borrowers, the picture is even bleaker. Black women see their loan balances actually grow 13% on average, 12 years after leaving school, while black men see their balances grow 11%. (Meera Jagannathan, Mike Murphy and Jillian Berman contributed to this story.)"}]}