{"article": [{"url": "https://www.marketwatch.com/story/buses-are-packed-as-are-shops-and-markets-indias-rising-covid-19-infections-are-rapidly-catching-up-with-the-us-2020-09-23", "published": 1601100440.0, "headline": "'Buses are packed, as are shops and markets': India's rising COVID-19 infections are rapidly catching up with the U.S.", "body": "CHENNAI, India - \"Will India be No.1 by Dussehra, or Diwali?\" Atul Thakur, referring to major Hindu festivals occurring in October and November, poses that question in the Times of India. He is not talking about primacy in economic growth. Rather, he refers to the number of COVID-19 infections and the pace of their increase, which are likely to catapult India ahead of the U.S. by mid-September, conferring the dubious distinction of being the worst-affected nation on the planet. With Unlock 4 having commenced and most institutions and services back in full-fledged operation, infections too are going through the roof, having increased by 1.5 million in the first 17 days of September. While permitting the reopening of transport, temples, gyms, businesses, industries, malls and wine shops, the government has run the gamut from total lockdown to near-normalcy. “ While permitting the reopening of transport, temples, gyms, businesses, and malls, the government has run the gamut from lockdown to near-normalcy. ” Of course, government relaxation notifications stipulate \"subject to SOP\" (use of masks, social distancing, etc.), thereby absolving it of any blame for the rising death toll and knowing full well that adherence cannot be ensured or enforced. Predictably, buses are packed, as are shops and wholesale vegetable and fish markets, with people shopping as if there is no tomorrow, which is a very real possibility. Many do not wear a mask and the less said about social distancing, the better. The police have mopped up a tidy sum by way of fines for mask-wearing noncompliance, though social distancing is not being enforced. By now, the coronavirus has become a stark reality, with many people losing one of their family members, neighbors, friends or acquaintances to the infection. Last week, the block of flats both to the left and right of my own bore banners from the Pallavaram Municipality, cautioning of homes under quarantine due to COVID-19. Yet the realization of \"It could be me tomorrow\" doesn't seem to have dawned on most. One wonders whether this is the innate arrogance of man, who considers himself invincible enough to triumph over nature and disease, or just ignorance, plain and simple. India has reported more than 5.8 million cases, compared to nearly 7 million confirmed cases in the U.S. as of Friday, and more than 92,200 deaths, still less than half the 202,800-plus COVID-related deaths in the U.S. While malls, gyms and shops are crowded, temples - especially the smaller ones - still find visitors few and far between. \"Hardly anyone drops in, though the temple is now open for several hours,\" says Sri Jagannatha Bhattachariar, a priest of one of the smaller shrines in Chrompet, Chennai. It makes you wonder whether people have at last found God within themselves, rather than search for Him in shrines. Rural and indigent pupils find it difficult not only to afford the devices required for online classes, but also to comprehend them fully, and some have died by suicide. And while the lockdown did provide people the opportunity to spend quality time with their families, cases of domestic violence have also been on the rise. Sadagopa Iyengar: 'The rich and powerful continue to be as influential in death as in life, and their bodies appear to develop a halo of immunity - unlike those of their less-endowed peers, which are considered highly infectious.' (Photo: Sadagopa Iyengar.) Crime, which had fallen dramatically during the lockdown, is on the rise in some areas, making the restoration of normalcy uniform across the board. Apparently, the pandemic hasn't stifled innovation, at least among the criminal classes. Taking advantage of the government's preoccupation with pandemic issues, fraudsters in Tamil Nadu have perpetrated a huge scam relating to doles to farmers by enrolling thousands of ineligible beneficiaries and siphoning off an estimated Rs. 110 Crore, the equivalent of $14.6 million. \"Your money or your life!\" This is not some mugger's threat in an unlit alley in Vyasarpadi, a crime-prone Chennai suburb, but what COVID-19 appears to be telling many people. “ Coronavirus treatment in private hospitals could wipe away a substantial portion of a person's life savings in exchange for staying alive. ” On the one hand, coronavirus treatment in private hospitals could wipe away a substantial portion of a person's life savings in exchange for staying alive. On the other hand, staying at home - which appears to be the only way to avoid the virus - means denying oneself the means of livelihood and earnings. The unending debate as to which are to be protected - lives or livelihoods - rages on, though the government and the citizenry have obviously plumped for the latter, with predictable outcomes. In my previous dispatch from Chennai, I had suggested COVID-19 was a great leveler, an egalitarian affliction. Alas, I spoke too soon: Ordinary citizens who die from the virus are just disposed of by the authorities, many times unceremoniously, without even their near and dear present, and with no religious rites. This is what happened to my longtime friend, a 79-year-old erstwhile auto-industry executive. However, the body of a politician of renown, also a victim of COVID-19, was taken in a procession with the participation of thousands of \"admirers,\" throwing all pandemic-related caution to the wind. Apparently, the rich and powerful continue to be as influential in death as in life, and their bodies appear to develop a halo of immunity - unlike those of their less-endowed peers, which are considered highly infectious. This essay is part of a MarketWatch series, Dispatches from a pandemic Despite the widespread havoc it has wreaked, COVID-19 has proved a generous benefactor to some sectors, like those manufacturing immunity potions. Other incidental beneficiaries include the manufacturers of currency-counting machines: Cashiers are now wary of moistening their fingers with saliva - an unhygienic habit even in normal times - and the use of machines for counting cash has picked up handsomely. Meanwhile, the uncertainty and looming danger have driven people in search of solace to astrologers and soothsayers. Testing here has so far revealed only the tip of a huge iceberg, with a serological survey by the Greater Chennai Corporation recently revealing 21.5% of Chennai's population of 8 million had developed IgG antibodies to the virus as of late July. This calls into question the efficacy of contract tracing and quarantining of visitors from other states and countries, as practically anyone - your paperboy, vegetable vendor, florist or barber, or yourself for that matter - could be a silent and asymptomatic spreader of the deadly virus. There has thus been no pandemic more difficult to control than the current one, pipping all measures to prevent, control, minimize or eradicate it. Lakshmi, a domestic servant, laments the cruel blow that high inflation has dealt the middle and lower-middle-class households, which are already affected by shrunken incomes. She finds herself shelling out more for vegetables, groceries and practically everything else. Indeed, up to 73% of households are now getting less value for spending the same amount of money or more compared to pre-pandemic times, a recent survey conducted by LocalCircles found. A rise in the price of vegetables is especially worrisome, as many people have lost jobs and many others have suffered a cut in earnings. Some 21 million jobs were lost between April and August, according to the latest data from the Centre for Monitoring Indian Economy (CMIE). In fact, India's GDP experienced one of the largest declines in the world in the April-June quarter - a staggering 24% - amid the imposition of one of the most stringent nationwide lockdowns, with all demand components except government consumption falling massively in the quarter. The Economic Times points out that negative GDP growth has occurred for the first time in 40 years. Fitch Ratings sees multiple challenges hampering a short- and medium-term recovery. The government's chief economic adviser, however, says the GDP figures are \"on expected lines.\" And so it goes on: Life alternates between slender hope and looming despair, with people uncertain of being alive tomorrow, yet thronging fish markets bereft of mask and distancing. Is it a show of incurable optimism - or inanity at its worst? Sadagopa Iyengar is a writer and editor of the spiritual journal Sri Nrisimhapriya, a retired banker, and the author of eight books on Vaishnavite philosophy. He also teaches Hindu scripture."}]}