{"article": [{"url": "https://www.marketwatch.com/story/home-insurance-usually-covers-damage-from-a-volcano-or-wildfire-but-not-a-flood-2018-09-19", "published": 1598625980.0, "headline": "As Louisiana recovers from Hurricane Laura, hereâ\u0080\u0099s what homeowners should know about the fine print in their insurance policies", "body": "As residents of Louisiana begin to assess the damage wrought by Hurricane Laura, some homeowners may be disappointed to learn that their insurance wonâ\u0080\u0099t cover all of their losses. An early estimate from property data firm CoreLogic CLGX, +0.86% Â suggests that Hurricane Laura caused between $8 billion and $12 billion in insured losses for residential and commercial properties in Louisiana and Texas. Hurricane Laura made landfall in Louisiana on Thursday as a Category 4 storm â\u0080\u0094 the 10th strongest tropical storm to ever hit the United States. While the magnitude of the damage is stunning, itâ\u0080\u0099s far less than other storms that have battered those states, including Hurricanes Katrina and Harvey. And luckily for many residents, forecastersâ\u0080\u0099 fears of an â\u0080\u009cunsurvivableâ\u0080\u009d storm surge didnâ\u0080\u0099t fully come to fruition. Only $500 million of the estimated insured losses was due to storm surge, according to CoreLogic. But as homeowners will soon discover, how much money they get back from their insurance company to rebuild will depend on what coverage they had and the specifics of their policy. See more:Footage from Florida Panhandle shows the incredible force of Hurricane Michael During a tornado, for instance, if high winds cause roof damage that leads to significant water accumulation within the house, most insurance policies will cover it. But if a nearby river crests because of the stormâ\u0080\u0099s heavy rainfall and then causes flooding, the damage to homes will only be covered if the owners have flood insurance. Damage caused by flooding isnâ\u0080\u0099t covered by standard home insurance policies. Only homeowners who bought separate flood insurance for their homes were covered if storm surge destroyed their homes in coastal Louisiana. Meanwhile, if a home was damaged by the strong winds that came with Hurricane Laura, standard insurance policies will cover the damage, but homeowners will first need to pay out a deductible â\u0080\u0094 a set amount of money a policyholder must pay before coverage kicks in. “ In volcanic eruptions, damage caused by lava flows or resulting fires is covered by a standard homeownerâ\u0080\u0099s policy. ” Louisiana is one of the 19 states, plus the District of Columbia, where insurers can impose a hurricane deductible. Windstorm and hurricane deductibles vary from policy to policy, but are usually assessed as a percentage of the homeâ\u0080\u0099s overall value. In many cases, the deductible for a named storm will be more than the standard deductible. Buying additional insurance policies for disasters like floods and earthquakes might seem like a no-brainer, but itâ\u0080\u0099s an expensive proposition. â\u0080\u009cThey have to do a cost benefit analysis,â\u0080\u009d said Michael Crowe, co-founder and CEO of Clearsurance, a site where consumers can review and compare insurance companies. The average annual premium for a policy through the National Flood Insurance Program was $699. But flood insurance premiums can easily cost thousands of dollars in regions that are determined to be at the highest risk of flooding. Coverage for other disasters operates similarly to hurricanes. In volcanic eruptions, damage caused by lava flows or resulting fires is covered by a standard homeownerâ\u0080\u0099s policy, but if the eruption causes seismic activity, homeowners will not be reimbursed unless they have purchased a separate earthquake policy.What is covered under a standard homeownerâ\u0080\u0099s insurance policy Some natural disasters are almost always covered by homeownerâ\u0080\u0099s insurance, including wildfires and hail storms. But other natural disasters are never or rarely covered under a standard homeownerâ\u0080\u0099s insurance policy. They generally fall into two categories: floods and â\u0080\u009cearth movements.â\u0080\u009d The first category comprises disasters caused by rising water, which includes everything from floods caused by extensive rainfall and hurricane-induced storm surges to dam failures and tsunamis. â\u0080\u009cEarth movementsâ\u0080\u009d include disasters such as earthquakes, landslides and sinkholes. Donâ\u0080\u0099t miss:How to find a contractor after a hurricane Unfortunately, many Americans are unaware that these disasters are not covered by a standard homeownerâ\u0080\u0099s policy, according to the Insurance Information Institute. Certain natural disaster typically arenâ\u0080\u0099t covered because of the level of the destruction they create, said Lynne McChristian, a spokeswoman for the Insurance Information Institute and executive director of the Center for Risk Management Education and Research at Florida State University. With these disasters, â\u0080\u009cthe damage is usually so widespread, and itâ\u0080\u0099s typically a total loss,â\u0080\u009d McChristian said. â\u0080\u009cInsurance companies canâ\u0080\u0099t price it appropriately to make it a viable line of business for them.â\u0080\u009d Are you covered with a standard homeowner's insurance policy? Typically covered Sometimes or partially covered Rarely covered Tornado Hurricane Flooding (including storm surge and tsunamis) Wildfire Volcano Earthquakes Hail storm Sinkhole Mud- and landslides Blizzard or ice storm Sewer backup How to get to the front of the line when you need help Regardless of whether or not a homeowner has insurance coverage for a specific natural disaster, getting their property assessed is critical in beginning the rebuilding process. Following a natural disaster, a consumerâ\u0080\u0099s first step should be to contact their insurance agent or company immediately. That is critical because insurance claims are handled on a triage basis, McChristian said. â\u0080\u009cThose with the most damage get to the front of the line because those people have the most need for recovery assistance,â\u0080\u009d McChristian said. By clarifying how to file a claim and conveying the state of their property, homeowners can improve the chances of having their case handled more quickly by their insurer. Homeowners should also learn the ins and outs of how to file their claim, including what information is needed and how long they have to file. Now is also the time to determine what their policyâ\u0080\u0099s deductible is. Also see:What to do about your home and mortgage if youâ\u0080\u0099re hit by a disasterMake a head-start on assessing damage The insurance company will send its own adjuster free of charge to inspect the property and assess the total cost of the damage. Homeowners can take steps to prepare for this by documenting what was damaged or destroyed by the natural disaster, getting bids from contractors and keeping track of receipts for any expenses they incur following the storm. Homeowners shouldnâ\u0080\u0099t hesitate to make temporary repairs to protect their property from further damage. “ Homeowners shouldnâ\u0080\u0099t hesitate to make temporary repairs to protect their property from further damage. ” A pricier option: Hire a third-party insurance adjuster to assess their property. Given the backlog insurers will experience following widespread disasters, it can take a while to receive a payout. To expedite this process, a homeowner can choose to hire an independent or public adjuster to assess their property. Studies have shown that hiring public adjusters leads to higher insurance settlements. But these professionals donâ\u0080\u0099t come cheap â\u0080\u0094 they generally charge a fee thatâ\u0080\u0099s anywhere from 10% to 20% of the insurance settlement. And itâ\u0080\u0099s critical to hire a reputable professional. (Check the websites of the National Association of Independent Insurance Adjusters and the National Association of Public Insurance Adjusters.)Always have someone look at damaged property And even if homeowners arenâ\u0080\u0099t covered for flood insurance, they should still have their insurance company assess their property and whatever damage occurred. Crowe has experienced this firsthand. In 2006, an extended period of rainfall in Newburyport, Mass., where Crowe and his family lived, caused their newly remodeled basement to flood. However, their insurance policy did not include flood coverage. He thought he would have to pay for all the damage. But when insurance adjusters inspected the property, they noted that the basementâ\u0080\u0099s sump pump â\u0080\u0094 designed to prevent water accumulation â\u0080\u0094 had failed. In other words, he got lucky. The insurance company categorized the damage as the result of a mechanical failure rather than a flood, so the company covered the damage. â\u0080\u009cI thought to myself, â\u0080\u0098Iâ\u0080\u0099m really fortunate to have insider knowledge,â\u0080\u0099â\u0080\u009d Crowe said.The government provides flood insurance In the case of insurance for flooding, the federal government has stepped in. The National Flood Insurance Program was created in 1968 after insurance companies struggled to pay off claims following a slew of floods in the 1950s. Homeowners have the option to buy flood insurance through this program or to get a private insurance policy. In certain cases, homeowners may be required to purchase flood insurance by their mortgage lender if their home is located within a flood zone. Private flood insurance now accounts for roughly 15% of all flood premiums nationwide, according to the Insurance Journal. And for many homeowners, a policy from a private insurer rather than through the federal insurance program could be cheaper. One briefing from Milliman found that private flood policies would have lower premiums for 77% of all single-family homes in Florida, 69% in Louisiana and 92% in Texas. Read more:Congress just dodged hard decisions about flood insurance againEarthquakes Similarly, homeowners will need to purchase a separate policy or a rider to their standard home insurance policy from a private insurer to be covered for an earthquake. California residents also have the option to purchase coverage through the California Earthquake Authority. That said, if an earthquake causes a house fire, some damage might be covered by the standard policy alone.Sinkholes As for sinkholes, coverage options vary from state to state. A standard home insurance policy may cover minor damage caused by a sinkhole â\u0080\u0094 but catastrophic damage (generally defined as damage to more than half of the structure) is excluded. People can either get sinkhole insurance in the form of a stand-alone policy or an endorsement (also called a rider) to the standard insurance policy, depending on where they live. Tennessee and Florida require insurers to offer optional sinkhole coverage. Insurers in Florida are also required to provide insurance for â\u0080\u009ccatastrophic ground cover collapseâ\u0080\u009d through their standard policies. Read more:Your easy step-by-step guide to paying off all kinds of debtDid the homeowner take care of the property? The propertyâ\u0080\u0099s upkeep can also play a role in whether or not damage caused by a storm or other natural disaster is covered. For instance, if winter storms cause an ice dam to form on the roof of the home and the owner is not proactive about removing it, the insurer may choose to deny coverage for water damage.You have some options if you skip insurance If homeowners donâ\u0080\u0099t buy specialized insurance coverage and then get hit by some sort of disaster, they do have some options to offset their losses. They can get a grant from the Federal Emergency Management Agency or a loan from the Small Business Administration. â\u0080\u009cThose are not designed to bring you back to a pre-disaster condition â\u0080\u0094 theyâ\u0080\u0099re designed just to get you back on your feet,â\u0080\u009d McChristian said. â\u0080\u009cInsurance is designed to get you back to where you were before the disaster occurred.â\u0080\u009dHow to decide whether you need coverage “ Earthquakes have caused damaged in all 50 states at some point since 1900, according to the Insurance Information Institute. ” For starters, homeowners need to consider whether or not they are at risk. They should check government flood zone maps. They are generally available from county governments, or you can search by address on the FEMA website. But they arenâ\u0080\u0099t foolproof because they are only periodically updated. Other factors to consider include the propertyâ\u0080\u0099s elevation (if itâ\u0080\u0099s at or just a few feet above sea level itâ\u0080\u0099s more prone to flooding) and whether there has been a lot of construction in the area. This could displace vegetation that would soak up rainfall and prevent flooding. As for earthquakes, homeowners shouldnâ\u0080\u0099t assume theyâ\u0080\u0099re not at risk just because they donâ\u0080\u0099t live on the West Coast. Earthquakes have caused damaged in all 50 states at some point since 1900, according to the Insurance Information Institute (a trade group that of course has a vested interest in people getting insurance). And fracking for oil and natural gas has led to seismic activity in parts of the country that had never before experienced it. This story was updated on Aug. 28, 2020."}]}