{"article": [{"url": "https://www.marketwatch.com/story/there-will-be-no-v-shaped-recovery-for-consumer-sentiment-datatrek-says-2020-08-18", "published": 1597937480.0, "headline": "There will be no V-shaped recovery for consumer sentiment, DataTrek says", "body": "Consumer sentiment has held up better through the coronavirus crisis than in previous downturns, but it may take much longer for sentiment to recover than many analysts may realize, not least because the economy has lost a crucial tailwind, according to an analysis published Tuesday. Sentiment remained near a pandemic-era low in early August, the University of Michigan said last Friday. Its closely watched index was at 72.8, barely any higher than the low of 72.5 touched in July. “Bad economic times are anticipated to persist not only during the year ahead, but the majority of consumers expect no return to a period of uninterrupted growth over the next five years,” said Richard Curtin, the survey’s chief economist. And Nicholas Colas, co-founder of DataTrek Research, on Tuesday added “Once consumer sentiment ‘breaks’ it remains fragile for a year or longer.” Colas called out several earlier episodes of extreme downturns in sentiment: • The period from 1990 to 1993, when the Iraqi invasion of Kuwait created an oil shock. “Even after Gulf War I concluded successfully, sentiment was choppy until early 1994,” Colas wrote. • From 2001 to 2003, the collapse of the dot com bubble, the 9/11 attacks, and the wars in Iraq and Afghanistan broke down Americans’ confidence from late 1990’s levels which were the best on record. • The period from 2008 to 2012, when the financial crisis, Great Recession and the European debt crisis “dampened sentiment for years, even after the stock market bottomed in March 2009.” It’s important to note, as Colas does, that while recent readings for the Michigan survey are depressed compared to the past few years, they are not as low as the trough for the most recent of the episodes described above which occurred in the aftermath of the 2008 financial crisis. The declines this spring were just a bit less dramatic, than they were in that period: down roughly 27% compared to a year ago, versus a 30% annual drop a decade ago. See:Fool me twice? For businesses and consumers, coronavirus is the financial crisis all over again It’s the aggressive government fiscal and central bank monetary stimulus that’s keeping sentiment from sinking as low as it has in the past, Colas thinks. Still, the stalemate in Washington over whether to restore the recently expired $600 federal benefit for the unemployed and other measures to help the economy has forced households to save more and left them increasingly uncertain about what lies ahead, Michigan University’s Curtin said last week. Colas has focused on labor force participation (LFP) in his research in recent weeks, and on Tuesday noted that the all-time high for the consumer-sentiment reading happens to coincide — precisely — with the peak in the participation rate, in January 2000. In fact, the latest reading for the participation rate is 61.4%, the lowest since 1976, when the decades-long march of women into the workforce still had a long way to run. In earlier research, Colas wrote, commenting on the big drop in participation from February to April, “there is no precedent for that sort of drop in LFP back to 1948. It grinded its way higher due to rising female LFP (1970s to 1990s). It ground its way lower as the population aged (2000 to 2015). It picked up a little as the US economy hit its last late-stage expansion (2015 to 2020). But it has never, ever, just collapsed.” Participation in the work force resonates through all kinds of other economic metrics, including the consumer-sentiment print, he said on Tuesday. “It seems to set a cap on just how confident the American consumer can be long after a recession has passed,” Colas concluded. “We don’t expect to see much good news on American consumer confidence for the remainder of 2020 because history says it takes time to improve after a shock; this does not, however, mean that the equity market is wrong in predicting its eventual recovery.” Read next: ‘The stock market no longer thinks it needs the economy if it has the Fed,’ David Rosenberg says"}]}