{"article": [{"url": "https://www.marketwatch.com/story/us-trade-deficit-in-goods-falls-61-in-june-as-exports-rebound-but-outlook-still-weak-2020-07-29", "published": 1596016280.0, "headline": "U.S. trade deficit in goods falls 6% in June as exports rebound, but the big picture is still ugly", "body": "The numbers: The U.S. trade deficit in goods showed a 6.1% decline in June as exports grew faster than imports, but the level of trade is still well below year-ago levels because of the massive strain on commerce caused by the coronavirus pandemic. The advanced trade deficit in goods dropped to $70.6 billion in June from $75.3 in the prior month, the U.S. Census Bureau said Wednesday. The decline was larger than expected. Economists polled by MarketWatch had forecast the gap to shrink just slightly to $74.9 billion. A smaller deficit adds to gross domestic product, the official scorecard for the U.S. economy. The government is expected to report on Thursday that GDP fell a record 35% in the second quarter. An advanced look at wholesale inventories, meanwhile, showed a 2% decrease increase in June. And an early look at retail inventories reflected a 2.6% decline. These declines are likely to offset any benefit to GDP from a lower trade deficit. What happened: U.S. exports of goods climbed almost 14% to $102.6 billion in June. Higher auto exports accounted for the bulk of the increase. Most exports increased, suggesting a solid rebound for American manufacturers. The only category to show a decline was food and feeds. Imports rose a smaller 4.8%. More foreign-produced autos as well as consumer goods such as cell phones and electronics made their way through U.S. ports, but a large decline in industrial imports partly offset those increases. The U.S. probably imported less foreign oil because Americans are driving and flying less. The advanced report only includes goods. Services such as travel and tourism aren’t included until the full report that gets released next week. The big picture: Global trade partially collapsed early in the coronavirus pandemic and the level of overall activity is still depressed despite a recent rebound. U.S. exports are 24% lower compared to one year ago while imports are off 17%. Trade is unlikely to return to pre-crisis levels for a while, adding to the U.S. economy’s slow recovery. Millions of people around the world have lost their jobs or suffered a big drop in income, limiting demand for an array of goods and services. What they are saying?: “Trade activity turned a corner in June, but still lags behind the rest of the economy,” James Watson and Gregory Daco of Oxford Economics wrote to clients in a note. “With global and US demand facing a long and risky path towards recovery, trade is set to be one of the hardest-hit sectors.”Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 index SPX, +0.87% were set to open modestly higher in Wednesday trades. Stocks have traded in a narrow range for the past few weeks."}]}