{"article": [{"url": "https://www.marketwatch.com/story/watch-out-this-is-the-age-where-you-should-definitely-stop-trading-stocks-2020-06-03", "published": 1592048720.0, "headline": "Watch out: This is the age where you should definitely stop trading stocks", "body": "OK, so the idea of buying individual stocks is about as out of fashion these days as shoulder pads and big hair. For more investors, low cost index funds, especially exchange-traded index funds, are the way to go. You can see why. They’re cheap, easy, and diversified. How annuities could protect your retirement income And, as any fan of Vanguard’s late guru Jack Bogle will tell you, low cost index funds are almost certainly going to beat most investors. The percentage of fund managers who beat the stock market after fees, for example, may be less than 10%. But let’s say that hasn’t deterred you. Let’s say you’ve read the contrary data. Maybe you saw the study which found that 10% of retail investors beat the market indexes over time. Maybe you read the academic paper which found that when smart investors just stuck to their few, conviction picks they could actually do pretty well. Maybe you’ve read up on investors like Warren Buffett (and even the young Allen Mecham), who seem to beat the market by keeping their heads and investing in sound, high-quality companies. (Oh, and maybe you’ve noticed that most of the studies that say “investors can’t beat the market” tend to focus on “the average investor.” Obviously “the average investor” can’t beat the market after fees, because the average investor is the market. But the “average” tennis player doesn’t win a match either, because the losers counterbalance the winners. That’s no reason not to work on your backhand.) Let’s say you’ve also realized that while the S&P 500 index SPX, +0.87% has tripled your money this millennium, when you count dividends, a long list of perfectly ordinary well known, well run, household-name blue-chip stocks have beaten it into a cocked hat. You didn’t have to be a Wall Street insider to buy and hold stocks like Microsoft MSFT, +2.48%, Procter & Gamble PG, +0.89%, PepsiCo PEP, +0.42%, Starbucks SBUX, +0.53%, Johnson & Johnson JNJ, +1.39%, Lockheed Martin LMT, -0.68% and Nike NKE, +0.97%, all of which have crushed the S&P over 20 years, in many cases several times over. And that’s even without mentioning popular big winners like Apple AAPL, +1.74% and Amazon AMZN, +3.01%. (Oh and if you’d bought stock 20 years ago in Sherwin-Williams SHW, +1.47%, hardly a high risk, little known venture, you’d have made 38 times your money. No, really.) If you are doing it yourself, the best of luck. Just one thing. You probably want to hang it up around the age of 70, if not before. That’s not only because, by that age, you are aiming to conserve what you’ve got more than you are aiming to make more, so you’re probably moving more money into bonds, or an immediate lifetime annuity. But it’s also because, frankly, after 70 our financial awareness and skill starts going into decline. And, alas, one thing that doesn’t decline is our confidence in our financial abilities. Uh-oh. So, at least report finance professors Michael Finke and Sandra Huston of the American College of Financial Services and Texas Tech University respectively. Combining data from the continuing University of Michigan Health and Retirement Study with survey data from Consumer Finance Monthly, they find that “financial literacy” declines pretty steadily, along with many cognitive skills, from your late 60s onward. But financial confidence…carries on about the same till age 90 or so. It’s not a good combination. And it’s why so many financial swindlers move to parts of the country where there are lots of retirees. “Investors who reach an advanced age of 75 and above experience much lower returns than younger investors,” they note. From a review of the academic literature, they conclude: “returns are lower among younger investors, peak at age 42, and decline sharply after the age of 70.” Older investors pick worse stocks and are worse at market “timing,” they find. Research into individual brokerage accounts, they report, find that older investors are even more likely to jump on the market bandwagon than everyone else after it’s risen a long way, and more likely to bail when it tanks. “Older investors appear to struggle with the selection of higher quality investments,” they write. “Investors older than 75 on average experience investment returns that are 3% lower than middle-age investors, and this return disparity rises to 5% among older investors with greater wealth.” The study is the latest on a longline that finds our financial dexterity declines with age, whether we like to admit it or not. (Possibly related fact: Warren Buffett’s Berkshire Hathaway BRK.A, +0.06% BRK.B, +0.24%, which crushed the market for decades, hasn’t consistently outperformed the SPDR S&P 500 Trust SPY, +0.89% since around 2002, when the great man entered his early 70s.) It’s an uncomfortable and unpleasant truth that as we get older we get less mentally quick and less adept. This process may even begin as early as our 20s and 30s. The good news is that for most of our lives we seem to gain much more from wisdom, experience and maturity than we lose to things like short-term memory. Which may, in turn, give us the wisdom, experience and maturity to kick back when we’re older, park our money in low cost index funds, immediate annuities and straightforward bonds, and stop worrying about the market."}]}