{"article": [{"url": "https://www.marketwatch.com/story/us-likely-regained-3-million-jobs-in-june-but-coronavirus-flareups-hamper-recovery-2020-06-27", "published": 1593288140.0, "headline": "U.S. likely regained 3 million jobs in June, but coronavirus flareups hamper recovery", "body": "Investors already got fooled once after several million people returned to work in May. They might get fooled again in June, but they worry the next surprise won’t be so pleasant. Wall Street DJIA, +0.56% predicts the U.S. regained an additional 3 million jobs in June, with forecasts going as high as 8 million. The U.S. regained 2.5 milion jobs in May, confounding expectations for another big decline, though the Bureau of Labor Statistics also said every state began to reopen their economies to some degree last month and 2.7 million people who had temporarily lost jobs amid the pandemic returned to work. The unemployment rate, meanwhile, is seen falling again to 12% from 13.3% when the Labor Department reports the monthly data next Thursday, a day earlier than usual because of the July Fourth celebrated on Friday this year. The veneer of optimism about the June forecast, however, is unable to hide festering doubts. Read:Consumer confidence in U.S. economic policies slumps to Trump-era low For one thing, the number of new applications for unemployment compensation has yet to drop below 2 million a week since the pandemic began in March. Some 30 million people were still collecting benefits at the beginning of the month. And a rise in coronvirus cases beginning in early June has spurred individuals, companies and governments to become more cautious again. Any employment increase significantly less than 3 million would be viewed as a bad sign, reinforcing the widely held view that the recovery that began in May is likely to be quite choppy. The U.S. lost a record 22 million jobs in the first two months of the pandemic and the economy can’t return to anything close to normal until most of those people go back to work. See: Marketwatch’s Coronavirus Economic Recovery Tracker Even if job growth meets or exceeds Wall Street’s target, however, the anxiety is not going to fade until the recent explosion in coronavirus cases does. Fresh outbreaks in the states that were among the earliest to reopen such as Florida and Texas have raised alarms again and caused governors to hit the pause button on allowing businesses to re-open. “Reopening the economy will not be a linear, week-to-week process. There will be setbacks,” said chief economist Chris Low of FHN Financial. “Each city and state will have to feel its way back to normal.” The employment report highlights a busy day before the July 4 holiday in the United States. At the same time, the government will release the latest tally of initial jobless claims. Read:Consumer spending jumps record 8.2% as economy reopens, unemployment benefits surge Jobless claims have not fallen as quickly as expected, raising questions not just about the strength of the recovery, but also the quality of the data. Some economists say the report is rife with over-counting because of repeat filings by the same individuals and the inability of overworked state unemployment offices to handle the crush of applications. See: MarketWatch Economic Calendar Earlier in the week, Wall Street will keep a close eye on consumer confidence data, auto sales and an ISM purchasing managers report on the manufacturing sector. Investors will also sift through the Federal Reserve’s minutes of its June meeting for clues on whether the central bank plans to step up efforts to support the economy."}]}