{"article": [{"url": "https://www.marketwatch.com/story/buyer-beware-sec-warns-investors-to-beware-of-fraud-and-pandemic-profiteering-2020-06-23", "published": 1593154280.0, "headline": "Buyer beware: SEC warns investors to avoid coronavirus-related frauds and scams", "body": "The U.S. Securities and Exchange Commission is urging investors to beware of scams linked to the coronavirus pandemic, and to carefully consider claims relating to treatments, therapies and equipment that promise big investor returns. The virus that has sickened more than 2.3 million Americans has also attracted bad actors seeking to profit from the worst public health crisis since 1918’s deadly flu outbreak. “We’ve seen in other periods of crisis that people try to take advantage,” Steven Peikin, co-director of the SEC’s Division of Enforcement, told MarketWatch in an interview. “We saw it with SARS, with Ebola, with Hurricane Katrina and after 9/11. A lot of individuals want to take advantage of investor concern and interest, and we’ve seen that in spades in connection with this crisis.” The proliferation of news releases and social-media postings from individuals and companies claiming to have cures, home testing kits or products that guarantee immunity, has already led the agency to temporarily halt trading in the shares of more than 30 companies in an effort to protect investors. “ ‘We’ve seen in other periods of crisis that people try to take advantage. We saw it with SARS, with Ebola, with Hurricane Katrina and after 9/11.’ ” — Stephen Peikin, SEC Division of Enforcement In May, the SEC filed charges against Florida-based Praxsyn Corp. PXYN, +100.00% and its chief executive for falsely claiming they were negotiating the sale of millions of N95 masks. Those masks are much in demand among health-care workers and people at high risk, as they can prevent the virus’s spread via the droplets that are released when people cough or speak. That same month, the agency filed a complaint against Applied Biosciences Corp. APPB, in federal court for the Southern District of New York over a press release published on March 31 that said it had started offering and shipping supposed finger-prick COVID-19 tests to the general public. The tests could be used for “homes, schools, hospitals, law enforcement, military, public servants or anyone wanting immediate and private results,” said the release, and could produce results in under 15 minutes. The complaint alleged that the tests were not intended for home use and could be used only with the help of medical professionals. It further alleged that the company had not shipped any such tests as of March 31. For more, see: SEC files charges against 2 more companies for false claims about COVID-19 The problem is so widespread that the SEC created a coronavirus steering committee in March led by Peikin and his fellow co-director of enforcement, Stephanie Avakian. The committee is tasked with proactively identifying fraud and coordinating the SEC’s response to ensure it’s consistent across the agency’s operations of more than 1,400 people in 12 offices. “Steering committees are rare,” said Avakian. “But it’s not just about the pandemic. It was clear by mid-March that we were not just in the midst of a health crisis but also dealing with markets that were highly disrupted and volatile, and for both pieces we have historical precedent to look to.” When the stock market was experiencing wild swings, with the Dow Jones Industrial Average DJIA, +0.56% moving by thousands of points in a single day at the peak of the turbulence in March and repeatedly triggering circuit breakers, the agency could look back at things that happened during the 2008 financial crisis. Redemption requests, for example, can be a red flag, if investors are unable to get money out of investments. That was how one famous swindler, Bernie Madoff, was uncovered during the 2008–09 financial crisis. Madoff’s massive Ponzi scheme came to light when he was unable to keep up with investors seeking to withdraw their money. Don’t miss:Hertz pulls potentially worthless share offering “Those market-correction dynamic scenarios can reveal past misconduct,” said Peikin. “It also creates opportunities for people to engage in mischief.” Some of that mischief likely comes from players drawn out by the recent surge in interest in stocks from less experienced investors. Brian Reynolds, chief market strategist at Reynolds Strategy LLC, said market data over the past couple months have revealed that investor flows are “disproportionately” coming from retail investors. “[R]etail investors ... are pushing up the price of stocks that are under-owned by institutions and also getting involved in insane schemes,” Reynolds wrote in a recent note to clients. “This behavior cannot go on forever, but it can go on for a while.” See: Investing legend Burton Malkiel on day-trading millennials, the end of the 60/40 portfolio and more So how does the SEC manage to track all of the false information that could lead investors to lose money? “We take a holistic approach and look at all kinds of sources, starting with news,” said Peikin. The agency monitors trading activity, particularly in securities that are volatile, and tracks whether stock moves appear to be driven by news or are unexplained and look suspicious. The agency relies heavily on referrals from FINRA, the self-regulator for the brokerage industry. It also hears from the Justice Department, the Federal Bureau of Investigations and from the investing public. See:FTC warns company to stop claiming that listening to certain musical frequencies will ‘weaken’ the coronavirus In a typical year, the SEC receives between 17,000 and 20,000 such letters of complaint from investors, but the numbers soared by 45% in the period from March 15 to June 15, said Avakian. The regulator also gets information from short sellers, which it evaluates on a case-by-case basis. “We get a lot of information from market participants,” said Avakian. “We always have to evaluate whether the information provider has an economic interest, on the long or short side, but that doesn’t necessarily invalidate their claim.” So how should small investors approach investing during the pandemic? As with any investment, investors should do their homework, said Avakian. Start by going to Investor.gov on the SEC’s website and read the guidance on avoiding fraud. In addition to tools and calculators to help understand investing, the site offers plenty of advice on avoiding being swindled by fraudsters targeting retirement savings or even charitable-investment scams. Investors should always do their own research on any potential investment and use common sense. “If it sounds too good to be true, it probably is,” she said. Why 'Frankenstein' fraud costs U.S. companies over $6 billion a year Investors should always ask questions. They should beware of unsolicited offers that come out of the blue, as that is often a red flag. Any promise that is presented as a “sure thing” should be taken with a grain of salt. “No doubt some companies will come up with a vaccine or treatment, but we don’t know which ones yet, so it’s important to do your research,” she said. Read: Supreme Court rules SEC can recover ill-gotten gains in fraud cases In a sign the steering committee’s work is helping, the number of suspensions of stock trading has started to tail off. Still, Avakian and Peikin signaled they expect further charges will be filed, and concede that there are numerous pending investigations. A typical SEC investigation of fraud takes about two years to complete. The Praxsyn case took just 61 days. “It suggests the message has been heard by those who would engage in this conduct,” said Peikin. “But we don’t pretend to have them all. There’s more work to be done.” Read on: SEC’s regulatory work could be hamstrung by leadership change with Clayton set to exit, analyst says"}]}