{"article": [{"url": "https://www.marketwatch.com/story/the-truth-about-medical-bills-sent-to-collections-2020-07-09", "published": 1594377560.0, "headline": "The truth about medical bills sent to collections", "body": "If you think you’re immune to damage from a collection account on your credit report because you pay your bills on time, think again. Medical bills that you don’t know about could be hurting your credit—and the odds are not in your favor. In fact, the Consumer Financial Protection Bureau reports that around 31.6% of adults in the U.S. have collections accounts on their credit reports. That’s almost one in three Americans. Medical bills account for over half of all collections with an identifiable creditor. Chances are good that you, too, have a medical bill in collections. Many times, medical bills hit collections because you didn’t even realize you owed anything. Here are four common medical bill myths that can cost you dearly and the truth you need to manage your credit and medical expenses more proactively.Your insurance won’t cover everything It’s a consumer’s obligation to know what they’re responsible for paying. A lot of people are under the impression that their insurance will cover all medical costs, so they don’t owe anything. Due to how a visit or procedure is billed with insurance, this isn’t always the case. It’s always best to be prepared for the worst to prevent anything from being sent to collections. Insurance companies usually send out an Explanation of Benefits (EOB) before you receive a bill from the provider. Be sure to go through these important documents carefully to ensure you understand what your estimated out-of-pocket costs are. If you have questions about why something wasn’t covered, reach out to the provider and your insurance company.Your medical bills can be sent to collections, even if you’re paying Making payments on a medical bill doesn’t necessarily keep it out of collections. If you’re making small payments—or if you make your payment a few days late when you’re under a payment arrangement—you might discover the provider has turned the bill over to collections. Protections under the Affordable Care Act give patients at nonprofit hospitals time to apply for financial assistance before any “extraordinary collection measures” are taken. But for the most part, any unpaid balance is fair game. Read: This woman was charged $143,396.66 for a breast biopsy — here are the people working to improve medical billing transparency To prevent medical bills from going to collections while you’re making payments, set up a payment arrangement with the provider and get it in writing. If you make an arrangement to pay off a debt in six months and the provider agrees to it, they shouldn’t send you to collections as long as you make payments as agreed.Medical collection accounts are treated differently This one is good news for you. Medical bills are treated differently than other bills sent to collections—at least as far as your credit report is concerned. Medical debts are given less weight: Newer scoring models such as FICO 9 and VantageScore 4.0 weight medical collections less than other types of collections so that they don’t impact a score as much. However, not all creditors use these new scoring models, so medical collections could still hurt your ability to get credit in the future. Medical debts are given a grace period: The three credit bureaus now wait 180 days before listing medical debt on your credit reports. This grace period gives you time to figure out payment options before the debt affects your credit scores. Medical debts are removed once paid: While most collections remain on your credit report for seven years, medical debt is removed once it has been paid or is being paid by insurance. Unpaid medical debt in collections will still remain on your credit report for seven years from the original delinquency date.Tips for dealing with medical bills Any time you are contacted by a collection agency, you have the right to written confirmation of the debt as well as the right to dispute it. That’s your right under the federal Fair Debt Collection Practices Act. If you know your rights, you’re in a better position to stand up for them. Also see: Breaking down this ‘miracle’ COVID-19 survivor’s $1.1 million hospital bill Under the federal Fair Credit Reporting Act, you also have the right to dispute inaccurate information on your credit reports. But you have to know how to properly dispute an item on your credit report to get results. Some best practices to consider when dealing with medical debt include: Never assume that you won’t owe. Ask your provider for details about costs, and follow up with your insurance company and provider even if you don’t get a bill. Always ask for proof of what you owe. If a medical provider or its billing entity sends you a statement, it’s probably not going to contain a detailed breakdown of all the charges. You have a right to receive that information, though. Request it in writing, and then review all the charges to ensure that they reflect the services you received. Compare bills to insurance EOBs. Your insurance explanation of benefits breaks down each charge. Typically, an EOB should tell you how much the provider charged, how much the insurance disallowed, how much the insurance paid and how much you owe. Make sure what you’re billed for doesn’t exceed what the insurance said you owe. Make payment arrangements as soon as possible. It’s never too early to talk to your provider’s billing department. Even if they aren’t sure exactly how much you owe, start asking about payment arrangements. Many providers have processes in place to create payment schedules or discount portions of your bill if you pay in advance. Ask to make monthly payments on medical bills. You may be able to make monthly payments, but you will need documented proof that the provider or collector has agreed to this. That way, if they report a negative item on your credit report, you can dispute it showing they agreed to the payments you’re making. Dealing with medical bills in emergency times The only certainties in life are death and taxes—and the COVID-19 pandemic has shown us that not even taxes are certain. During emergency times, rules and regulations around medical bills might change. Government interventions and hospital policies right now are making it easier for many people to seek much-needed health care during this time if they have COVID-19. At a time when your personal finances might also be strained by loss of income or other factors, facing medical bills might seem daunting. But even during a crisis, you shouldn’t ignore this aspect of your health care. Instead, discuss options as early as possible with your provider, and let them know if you don’t think you’ll be able to pay. If you speak up proactively, medical providers can act early to help you access any assistance that might be available. Also read: How to be safe, with or without a face mask Any time you’re facing financial pressure because of medical bills, you might consider a personal loan. Personal loans let you spread out a large expense over time, and they might be a good option if you can’t get a medical collector to agree to a payment plan.Medical debt and your credit score If you’re concerned about how your medical debt could be impacting your credit, you can typically check your three credit reports free once a year, but currently under the accommodations for COVID-19, you can check weekly until the end of April 2021. This article originally appeared on Credit.com."}]}