{"article": [{"url": "https://www.marketwatch.com/story/snap-is-executing-better-than-its-social-media-peers-as-it-heads-into-second-half-of-2020-2020-07-22", "published": 1595421440.0, "headline": "Snap is â\u0080\u0098executing better than its social media peersâ\u0080\u0099 as it heads into second half of 2020", "body": "After shares of Snap Inc. initially sunk on news of its second-quarter results on Tuesday, they promptly rebounded once analysts read the fine print and dug into the numbers. Quarterly losses were up, but so was revenue and daily active users â\u0080\u0094 with strong hints that the current quarter is shaping up as a good one in the age of COVID-19. In summary, Snap said it lost $326 million, or 23 cents a share. Sales improved 17% to $454 million, above FactSet estimates. Daily active users increased 17% to 238 million. Chief Financial Officer Derek Andersen estimated year-over-year Q3 revenue growth of 32% through July 19. The snap back of Snapâ\u0080\u0099s SNAP, -0.18% Â stock offers valuable insight into the fortunes of the social-media industry, and a harbinger for other quarterly results to come from Twitter Inc. TWTR, -0.23% Â , Facebook Inc. FB, +0.26% Â , Google parent Alphabet Inc. GOOGL, +1.82% Â GOOG, +1.97% Â and Pinterest Inc. PINS, -0.50% Â . Snap shares are down 7% in early-afternoon trading on Wednesday. Yet a handful of Wall Street analysts view an upside for Snap in the rest of the year as advertising returns to digital platforms. Snap should also benefit from a July boycott by advertisers against Facebook over hate speech on its platforms. â\u0080\u009cWe view SNAPâ\u0080\u0099s expectation of 20% y/y rev growth for Q3 as conservative given the 32% growth through July 19, the return of brand spend, and the rev recovery in Rest of World,â\u0080\u009d wrote Jefferies analyst Brent Thill, who maintains a buy rating and price target of $30. â\u0080\u009cQ2 should be the low point for SNAPâ\u0080\u0099s rev growth and believe there are ample product catalysts to drive numbers (and the stock) higher.â\u0080\u009d â\u0080\u009cWe think Snap is executing better than its social media peers over the past couple of months with its exposure to direct response advertisers, accelerating innovation, and greater commitments from TV advertisers for 2020 Upfronts,â\u0080\u009d MKM Partners analyst Rohit Kulkarni said in a note, reiterating a buy rating and price target of $29. â\u0080\u009cWhen the world returns to a â\u0080\u0098new normal,â\u0080\u0099 we believe Snap will be positioned stronger with diverse advertiser demand, a well developed self service ad platform, and a larger and engaged audience.â\u0080\u009d AB Bernsteinâ\u0080\u0099s Mark Shmulik invoked yoga to give his blessing to Snap as a long-term investment. â\u0080\u009cYin is a type of yoga that is generally done at a slower pace and famous for holding each position for a very long time,â\u0080\u009d he said in a note maintaining an outperform rating with a price target of $28. â\u0080\u009cFor those on the fence, itâ\u0080\u0099s time to become SNAP Yin bulls.â\u0080\u009d â\u0080\u009cCompared to our Snap estimates before COVID-19, we now anticipate slightly higher 2022 revenues (+3%) driven by stronger long-term growth due to the shift in ad spending towards digital platforms from the COVID-19 pandemic,â\u0080\u009d Moffett Nathanson analyst Michael Nathanson said in a note, maintaining a neutral rating and price target of $22 on Snapâ\u0080\u0099s stock. Read more: Snap stock drops in late trading as losses grow, but sales and users continue to increase Barclays analyst Ross Sandler struck a more even-handed tone, characterizing the results as â\u0080\u009csolidâ\u0080\u009d but â\u0080\u009ca tad shy of buy-side expectations.â\u0080\u009d He remains bullish on Snapâ\u0080\u0099s long-term view but concerned short-term about volatility of shares based on the overall recovery of digital advertising. He maintained an overweight rating but shaved his price target to $29 from $30. A lack of specifics about revenue and earnings guidance for the current third quarter from management during a conference call with analysts late Tuesday weighed on opinions of several analysts. The â\u0080\u009ctepid outlookâ\u0080\u009d led to Wedbush Securities analyst Michael Pachter retaining a neutral rating and price target of $18. The cautious tone of the call, coupled with soft international sales, prompted Guggenheim analyst Michael Morris to lower his rating on Snap shares to neutral from buy though he did raise his price target to $22 from $18. SunTrust Robinson Humphrey analyst Youssef Squali, while â\u0080\u009cincrementally positiveâ\u0080\u009d about Snapâ\u0080\u0099s product road map and competitive standing, is concerned about volatility around ad budgets in the U.S. and â\u0080\u009cwobblyâ\u0080\u009d macro environment. He maintained a hold rating and nudged his price target to $25 from $24."}]}