{"article": [{"url": "https://www.marketwatch.com/story/an-extreme-august-on-the-stock-market-might-be-telling-us-something-about-the-november-election-2020-08-31", "published": 1598932040.0, "headline": "An 'extreme' August on the stock market might be telling us something about the November election", "body": "August marked the best month for the S&P 500 SPX, +0.87%  since 1986 and for the Nasdaq Composite COMP, +1.39% since 2000. But it's a new month and autumn and winter are coming, with a U.S. election race starting to heat up and the COVID-19 battle and all that comes with it. That brings us to our call of the day, from BTIG's chief equity and derivatives strategist Julian Emanuel, who says an extremely strong August for stocks - the S&P 500 is up 7.2% through Aug. 28 - could be telling us something about who wins the White House in November. \"At first glance, August strength plays well into Donald Trump's re-election - in the three months prior to November elections, positive S&P 500 returns have accompanied incumbent party presidential victories 85.7% of the time,\" Emanuel tells clients in a note. But going back to 1928, when stocks rose 5% or more in August, and the June to August return was top 25%, the market often struggled in September and October. \"And when the S&P 500 is down from the end of August through the Election, the incumbent party has lost the White House on all six occasions,\" he notes. Raising the stakes further, is notes political, social, public health and economic uncertainty against \"a Nasdaq-100 arguably in the midst of a potentially a \"blowoff\" top move\" - a fast and high climb followed by a sharp drop. But he says it is hard to tell if we're at the start, middle or end of that. That is laid out by his chart of the Nasdaq-100 NDX, +1.51% and the Cboe NASDAQ-100 Volatility Index (VXN), a key measure of market expectations of implied swings in the tech-heavy gauge. \"The last time both NDX and VXN rose together to this degree was January 2018, prior to the period known as 'Volmageddon,' which was when Wall Street's so-called fear gauge - the Cboe Volatility Index VIX, -5.15%  surged to a level not seen in 20 years. His advice: own calls - a bullish bet on an asset that gives an investors the right but not obligation to buy the underlying asset a certain price by a specific date - on the Invesco QQQ QQQ, +1.52%  exchange-traded fund that tracks the Nasdaq-100 Index. He also suggests owning puts - a bearish bet that works the opposite of calls - on the iShares Russell 2000 ETF IWM, +0.51%  The chart Goldman Sachs says year-to-date, 43% of female-managed funds have outperformed their benchmarks versus just 41% of those with no female managers. A team led by Goldman's chief U.S. equity strategist David Kostin explains: \"Men may be from Mars and women from Venus, but female-managed funds tilt toward info tech while non-female managed funds prefer financials.\" Read more hereRandom reads A chilling moment in history remembered as Berlin protesters tried to storm the Reichstag. Massive pool party lands University of South Carolina students in hot water. Redditers dish on best industry secrets. Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. Be sure to check the Need to Know item. The emailed version will be sent out at about 7:30 a.m. Eastern. Follow MarketWatch on Twitter, Instagram, Facebook."}]}