{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-look-past-stock-market-surge-ahead-of-us-data-2020-09-03", "published": 1599151100.0, "headline": "10-year Treasury yield slips to more than 3 week low as equity weakness bolsters bonds", "body": "U.S. Treasury yields slipped Thursday as a stock-market selloff spurred inflows into haven assets such as government paper ahead of the official jobs report for August on Friday.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% declined 2.9 basis points to 0.621%, leaving it lower for its fifth straight trading session, while the 30-year bond yield TMUBMUSD30Y, 1.576% fell 3.4 basis points to 1.341%. Both longer-dated maturities fell to their lowest levels since Aug. 10. The 2-year note rate TMUBMUSD02Y, 0.156% was down a basis point to 0.125%. What’s driving Treasurys? Haven investments rallied as a vicious selloff swept across Wall Street stocks only a day after the S&P SPX, +0.87% and Nasdaq Composite COMP, +1.39% closed at records. The tech-heavy Nasdaq finished around 5% lower on Thursday, while the blue-chip Dow Jones Industrial DJIA, +0.56% tumbled 2.8%. The U.S. Labor Department reported weekly jobless claims fell to a seasonally adjusted 881,000 in the last week of August, lower than the consensus estimate of 940,000. But this lower number reflects changes made by the Bureau of Labor Statistics to account for seasonal swings in employment. That was expected to lead to a sharp decline in new claims this week, but does not necessarily mean fewer Americans are losing their jobs. In other data, the trade deficit widened by $63.6 billion in August. Second-quarter productivity was revised up to 10.1%, while labor costs rose by 9% over the same stretch. The Institute for Supply Management’s purchasing manager survey for the services sector showed its August index fell to 56.9% in August from 58.1% in July. Within the report, the employment measure showed job losses were on their way to .stabilizing. What did market participants’ say? The jobs report “will reveal the degree to which firms have been able to weather the hit to spending. The capitulation of businesses that have attempted to endure the pandemic is high on the list of risk factors facing the economy and the Treasury market as 2021 comes into focus,” said Ben Jeffery, a rates strategist at BMO Capital Markets."}]}