{"article": [{"url": "https://www.marketwatch.com/story/brazilian-doctors-fume-as-president-bolsonaro-gets-rap-for-eating-hot-dogs-while-covid-19-cases-are-on-track-to-pass-us-2020-06-20", "published": 1594125500.0, "headline": "Brazilian doctors fume as President Bolsonaro hid COVID-19 data and now has tested positive himself", "body": "(Editor’s note: This article was originally published on June 20. It has been updated to reflect the positive COVID-19 diagnosis for President Bolsonaro on July 7 and includes the latest coronavirus confirmed case and death data for Brazil.) Brazilian doctors are fuming, joining growing ranks of furious compatriots, about President Jair Bolsonaro’s widely criticized mishandling of the country’s coronavirus crisis and suppression of case data as businesses have reopened despite rising deaths. “Yes, it’s Bolsonaro’s fault,” said Thais Couto, a 32-year-old lung surgeon in Sao Paulo, who like many doctors around the nation is exhausted and overwhelmed as Brazil sees roughly 1,200 deaths per day or one a minute. “From the beginning, he hasn’t taken this seriously, laughing about the disease and saying it’s just a flu and not a big deal.” Bolsonaro confirmed on Tuesday that he has tested positive for COVID-19. He told reporters in the capital Brasilia that he is already taking hydroxychloroquine — an anti-malarial unproven by several studies to effectively treat COVID-19, the Associated Press said. In June, a Brazilian supreme court judge ordered Bolsonaro’s administration to resume publishing complete COVID-19 statistics after leadership purged the health ministry website of historical data relating to the pandemic and announced it would stop publishing the cumulative death toll or number of infections. The death toll in Latin America’s largest economy stands at 65,487 through July 7, according to the Johns Hopkins University & Medicine dashboard. Total infections have reached just more than 1.6 million reported cases. Brazil is on track to surpass the U.S. as the country with the world’s deadliest outbreak, probably by late July, according to the University of Washington’s Institution for Health Metrics and Evaluation. By comparison, the U.S. has reported 130,430 deaths and 2.9 million infections. Globally, the pandemic has killed 539,058. Read: Coronavirus update: U.S. COVID-19 cases climb above 2.9 million; ‘We’re still knee-deep in the first wave,” Dr. Fauci warns Couto said belief among her colleagues is that Bolsonaro has managed the crisis worse than the U.S. has managed the pandemic, exacerbated as Brazil, with much higher poverty rates, does not have the same resources to fight the illness as the world’s richest country. Dr. Thais Couto, in green, shown with nursing colleagues, believes the statistics that put Brazil on track to surpass the U.S. in COVID-19 deaths. Thais Couto “If you think Trump is stupid, you don’t know Bolsonaro,” said Couto, who had to cancel her first U.S. trip to Orlando after the U.S. president banned Brazilians from entering the country. Couto, who works in four facilities including state-run Hospital de Brasilândia and private facility Alvorada, said she believes that the right-wing populist Bolsonaro’s virus dismissal has split Brazilians into two camps: those that support his view and value businesses reopening for economic growth and those appalled by his cavalier attitude (recent videos showed him eating a hot dog in public in Brasilia, despite angry protesters calling him an “assassin” and “bum”) and worried that major cities are not ready to return to normal, potentially triggering a second wave of illnesses that could spin out of control. iframe.twitter-tweet { width: 100% !important; } June polls, before his diagnosis, suggested Bolsonaro still enjoys the backing of a third of Brazilians. “The problem in Brazil is that COVID-19 has become a highly politicized public emergency,” said Adele Benzaken, a doctor and public health expert in Manaus, the country’s virus epicenter and home to disturbing mass-grave images shocking the world. “Everyone is blaming the population because they don’t care for themselves or use masks or do this or that. But the message from the federal government, the president, ministers and municipalities is always very contradictory [with Bolsonaro clashing with governors over the extent of the lockdowns to protect the economy, for instance]. So people ask, who do I follow, the government or the president or the mayor?” Don’t miss:100 days of the COVID-19 pandemic: 5 critical mistakes that created the biggest public health crisis in a generation “ ‘In the Amazon and in Manaus we have cultural barriers because our indigenous cultures have a lot of difficulties to understand a new disease and the preventions for it.’ ” — Dr. Adele Benzaken Those clashing messages made things particularly hard in the Amazonian city of Manaus, where cases involving vulnerable indigenous communities quadrupled from May 3 to May 30 reaching 33,200 just before they began to decline, as many people failed to follow social distancing measures. “In the Amazon and in Manaus we have cultural barriers because our indigenous cultures have a lot of difficulties to understand a new disease and the preventions for it,” said Benzaken. Bolsonaro and Manaus Mayor Arthur Virgilio Neto’s bitter dispute over how the city of 2 million should contain the pandemic, coupled with similar skirmishes around the country, has not helped provide a clear message to help people survive COVID-19, she added. Benzaken, who leads efforts to fight HIV in Brazil, said Brasilia’s response was inadequate and came too late to stave off a major crisis. “We did not have a lockdown and the population is suffering because of that, because of a president that does not believe the disease is serious and is always against the lockdowns,” she said. “Every weekend, he goes out and eats hot dogs on the street and leads demonstrations to tell people they don’t have to stay home.” Compared to Europe or the U.S., Brazil did not impose national curfews or strict quarantines. Instead, Brasilia let states and local governments decide how to handle the pandemic. This resulted in partial quarantines that were too relaxed, critics claim, urging citizens to follow social distancing recommendations that were not fully enforced. Non-essential businesses such as retailers and restaurants were forced to shutter for three months, however. In mid-June, Sao Paulo and Rio began to reopen, with stores and malls hoping to recover from three months of losses, just as Brazil celebrated Valentine’s Day or Dia dos Namorados on June 12. Couto said the move was a bad idea and could boost infections amid Sao Paulo’s overwhelmed hospitals. “Things are going to get worse,” she said, adding that the city’s ICUs will have a hard time coping with a spike in cases amid a critical shortage of doctors who often treat many more patients than they can handle. Couto agreed with a University of Washington Institute for Health Metrics and Evaluation (IHME)’s survey that said Brazil could surpass U.S. deaths by July 29 when it’s on track to record 137,500 against the U.S.’s 137,000, based on current infection trends. “ ‘People are not taking this seriously. They think that it’s going to be solved by the Universe. Of course, we have people who are taking care of themselves but others don’t believe in this thing. They think it’s political, that the virus doesn’t exist.’ ” — Dr. Thais Couto Given Brazilians’ relaxed attitude to life — and the fact that many refuse to wear masks (despite now being now mandatory in most cities) — it would not surprise her if that forecast came true. “People are crazy here in Brazil,” Couto said, adding that many Paulistas (as Sao Paulo natives are called) have ignored social distancing recommendations, going to parties or barber shops. “People are not taking this seriously. They think that it’s going to be solved by the Universe. Of course, we have people who are taking care of themselves but others don’t believe in this thing. They think it’s political, that the virus doesn’t exist.” Mariana Gimaraes, who works as a fashion PR executive in Sao Paulo, said the reopening is necessary to avert an economic meltdown after retailers and restaurants were shuttered for nearly three months. “People need to make money so they have to reopen businesses,” she said. “Also, in the city of Sao Paulo, the cases are more stable, unlike Rio where Mayor Marcelo Crivella has said stores will remain closed until cases come down.” Gimaraes doesn’t think Brazil’s pandemic will become as severe as America’s. “I don’t think it’s going to be like the U.S. In Sao Paulo state, the state is pursuing very strong policies to ensure everything goes well,” she noted, adding that cities are becoming very strict to ensure businesses follow WHO regulations. “ ‘People need to make money so they have to reopen businesses. Also, in the city of Sao Paulo, the cases are more stable.’ ” — Mariana Gimaraes, fashion PR executive Meanwhile in the Amazon Jungle, cases are soaring along the Amazon River, with indigenous advocacy groups pleading for the government to send more personal protective equipment (PPE) for doctors to treat patients in isolated communities where the sickest must be flown to Manaus for treatment. “We are hoping the help will be more robust,” Benzaken said. “You have 63 municipalities in the Amazon and 60 don’t have PPEs or ICUs.”"}]}