{"article": [{"url": "https://www.marketwatch.com/story/us-job-openings-rose-again-in-july-but-hiring-lagged-as-economic-recovery-slowed-2020-09-09", "published": 1599648020.0, "headline": "U.S. job openings rose again in July, but hiring lagged as economic recovery slowed", "body": "The numbers: Companies hired fewer people in July during a fresh wave of coronavirus cases even as they listed more open jobs, reflecting a high level of uncertainty about how rapidly the labor market and broader economy are improving. Businesses, governments and other organizations hired 5.8 million people in July, according to a Labor Department survey of the labor market that’s released with a one-month delay. But that marks a sizable decline from almost 7 million in June. Job openings, on the other hand, rose by 617,000 to 6.6 million in July. The number of jobs available was running around 7 million a month before the pandemic. The number of separations — layoffs, firings, people quitting — barely changed in July at 5 million. At the peak of the pandemic in March and April, the U.S. lost more than 24 million jobs. So far it’s only recovered about half of them back. What happened: Hotels, restaurants and health-care providers cut back on hiring in July. All three sectors of the economy regained lots of jobs in May and June, but employment is still well below precrisis levels. Job openings increased the most in July in retail, health care and construction. Retailers have ramped up online operations and taken other steps to lure customers back to brick-and-mortar stores. Construction companies, for their part, have been one of the surprise beneficiaries of the crisis. Demand for new or previously owned homes has surged as some people take advantage of record-low mortgage rates or those couped up in cities leave in search of more space. The share of people who left jobs on their own, known as the quits rate, rose to 2.4% from 2.1% among private-sector employees. That’s still well below the most recent peak of 3.2% last year, however. Fewer people are willing quit a more secure job during a pandemic. The big picture: The slowdown in hiring was not surprise given sharp deceleration in employment growth shown in the government’s more timely U.S. jobs report that came out a month ago. The goods news is that hiring in August appeared to stabilize as the summer spike in coronavirus cases receded, suggesting the economic recovery is more resilient than it appeared. The big worry is that a second wave of layoffs could take place, however, without more federal aid. Some industries badly damaged by the coronavirus, such as airlines and hotels, have said they plan to turn temporary furloughs into permanent job losses because business remains extremely weak. What they are saying? “Another increase in job openings is a heartening sign for workers who have permanently lost their jobs,” said Nick Bunker, director of research at Indeed Hiring Lab. “Still, this situation could deteriorate significantly if the economic damage from the coronavirus lasts.” Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% rose sharply in Wednesday trades, bouncing back from a big decline the day before."}]}