{"article": [{"url": "https://www.marketwatch.com/story/tech-bloodbath-aside-ride-these-two-giants-for-the-second-half-of-the-recovery-veteran-analyst-says-2020-09-04", "published": 1599209600.0, "headline": "Tech bloodbath aside, ride these two giants for the second half of the recovery, veteran analyst says", "body": "On no obvious catalyst, the winners of 2020 were absolutely hammered on Thursday — a sea of red for the likes of Apple, Microsoft, Tesla TSLA, +1.89% and Zoom Video Communications ZM, +2.89%. And the selling wasn’t limited to technology stocks — small-caps RUT, +0.55% and value stocks VLUE, -0.50% also fell. Only a few hard-hit travel stocks actually rose. “Stock markets got a well overdue thumping with big tech leading the way south. The technical expression is a downward correction in overbought stocks after an intense period of one-way price action higher,” says Jeffrey Halley, senior market analyst, Asia Pacific, at Oanda. “For the rest of us, the market was long and wrong, and now some of their P&L [profit and loss] is gone.” A chart from Bespoke Investment Group neatly encapsulates the fact that the winners were sold. Eddy Elfenbein of the Crossing Wall Street blog says these sorts of days aren’t unusual in the middle of rallies. “Contra-trend rallies are typical within larger rallies, but we can’t say that this spells the end of the superstar stock rally. Clearly, there are nervous investors out there, and the bears have shown they’re willing to push back,” he says. Dan Ives, the veteran tech sector analyst at Wedbush Securities, isn’t shaken. “While [Thursday’s] massive sell off will cause some white knuckles on the Street as fears of a tech bubble and stretched valuations become the talk of the town, we continue to believe the secular growth themes around the tech sector are unprecedented with the COVID backdrop accelerating growth stories by 1-2 years in some cases,” Ives says. “While much good news has been baked into these names, we view pullbacks like today as opportunities to own the secular growth stories in cloud, cybersecurity, and tech stalwart FAANG names,” he says, with FAANG representing Facebook FB, +0.26%, Amazon AMZN, +3.01%, Apple, Netflix NFLX, +1.43% and Google owner Alphabet GOOG, +1.97%. Ives says the second phase of the economic rebound, during the second half of this year and into 2021, will “supercharge” the fundamentals and growth trajectories of well positioned tech stocks. “We view this next phase resulting in Street numbers moving higher and a further rerating of tech stocks as the ‘risk on’ trade and hunt for secular growth stories will be the focus for tech investors looking out as we head into the fall, despite volatility and general nervousness around U.S./China trade tensions and the November elections,” says Ives. He says investors should focus on Apple AAPL, +1.74% and Microsoft MSFT, +2.48%. “For Apple, while the services business has been a Rock of Gibraltar for [Chief Executive Tim] Cook & Co., now the drumroll shifts to a massive pent-up demand for smartphone upgrades heading into its iPhone 12 5G supercycle slated to kick off in the early October time-frame,” Ives says. As for Microsoft, “this cloud shift and [work-from-home] dynamic looks here to stay, and the company stands to be a major beneficiary of this trend on its flagship Azure/Office 365 franchise over the coming years,” he says. The buzz The U.S. economy added 1.37 million jobs in August, a bit faster than the 1.2 million forecast by economists, as the unemployment rate fell sharply to 8.4%. The jobs growth figure was helped by 238,000 temporary 2020 Census workers. “The broadly positive reading will provide welcome relief to jittery markets as it serves as further evidence of an economic recovery, with the fall in the unemployment rate being the highlight,” said Sam Cooper, vice president of market risk solutions at Silicon Valley Bank. Among the unemployed, the number of persons on temporary layoff decreased by 3.1 million in August to 6.2 million, but the number of permanent job losers increased by 534,000 to 3.4 million. Outside of payrolls, Broadcom AVGO, +0.90% late on Thursday reported stronger-than-forecast earnings, as demand from cloud and telecom customers helped the semiconductor and industrial software maker. The markets The S&P 500 ES00, +1.13% contract was outperforming the Nasdaq-100 NQ00, +1.63% a day after the big selloff. Asian ADOW, +0.18% stocks fell, while European stocks SXXP, +0.55% edged higher. The yield on the 10-year Treasury TMUBMUSD10Y, 0.777% edged up 0.67% after the jobs report. Random reads Trees might be able to help locate decaying humans nearby. Mergers aren’t just for Wall Street — two black holes have apparently tied the knot. The synergies were impressive. Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. The emailed version will be sent out at about 7:30 a.m. Eastern."}]}