{"article": [{"url": "https://www.marketwatch.com/story/us-economys-historic-slump-in-the-second-quarter-lowered-to-a-317-annual-pace-gdp-shows-2020-08-27", "published": 1598525240.0, "headline": "U.S. economyâ\u0080\u0099s historic slump in the second quarter lowered to a 31.7% annual decline, GDP shows", "body": "The numbers: The historic plunge in gross domestic product in the second quarter was revised down slightly to show a 31.7% annual decline, underscoring the devastation to the economy spawned by the coronavirus pandemic. Economists polled by MarketWatch had forecast GDP to be rejiggered to slow a 32.5% drop. The government last month initially put the decline at a record 32.9%. GDP is the official scorecard of the U.S. economy, measuring consumer spending, business investment, government outlays and other contributors to growth. The U.S. is on track for a sizable rebound in the third quarter despite a summer surge in the coronavirus. Growth began to recover in May and itâ\u0080\u0099s continued through August, though at a slower pace. GDP is forecast to expand at a 20% annual clip in the third quarter, according to the latest MarketWatch forecast. Even a gain of that size, however, would leave the economy in a shrunken state compared to pre- crisis levels. Read: Did the expired $600 federal jobless benefit keep people from going back to work? What happened: Consumer spending, the main engine of the economy, contracted by a slightly revised 34.1% annual clip in the spring. Hotels, restaurants and airlines were particularly hard hit. The decline in business investment in structures and equipment also shattered previous records. Both fell by a more than 30% rate in the second quarter. The level of inventories declined by a $205.5 billion annual rate in the second quarter, compared to the initial $234.6 billion estimate. Federal spending soared by 17.4% as the government spent trillions to help households and businesses survive financially during a nationwide economic lockdown. Yet states and localities which face balanced budget constraints pared back spending after tax revenues sank. Read: â\u0080\u0098A massive welfare economyâ\u0080\u0099 - federal aid prevents even steeper GDP collapse International trade, meanwhile, has been devastated by the pandemic. U.S. exports fell a revised 64.1% in the second quarter while imports tumbled 53.4%. Both were little changed from the early estimate. The rate of inflation fell at a 1.9% pace in the second quarter. Many companies had to cut prices after demand sank and sales dried up. Previously GDP had never shrunk by more than 10% on an annualized basis in any quarter since the government began keeping track shortly after World War Two. Read:U.S. initial jobless claims fall to 1 million in late August and resume downward trend Big picture: The economy is expanding again and third-quarter GDP is likely to show record growth, but GDP is still markedly lower than it was before the crisis. Reduced federal aid the still-spreading coronavirus could weigh on the economy in the months ahead. The economy has also shown surprising resilience this summer, however, as evidenced by strong retail spending, surging home sales and construction, robust demand for new cars and trucks and rising industrial production. Read: U.S. durable-goods orders leap 11.2% in July on strong demand for cars and trucks Which way the economy goes will depend on whether more businesses can reopen, bring back jobs and restore some sense of normalcy. Another federal aid package could be pivotal, but Democrats and Republicans are divided over what to do next. What they are saying? â\u0080\u009cWhile the economy has already made some headway toward recovery, the [GDP] figure is an important testament to the sharp economic pain inflicted by the coronavirus pandemic and should motivate policymakers to get their act together to preserve the nascent recovery, wrote senior economist Lydia Boussour of Oxford Economics in a note to clients. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 index SPX, +0.87% Â rose in early Thursday trades. The Federal Reserve said it would adopt a new strategy on inflation targeting that gives the central bank more leeway to keep interest rates low. Low rates benefit stocks."}]}