{"article": [{"url": "https://www.marketwatch.com/story/ipo-market-gears-up-for-busiest-week-since-may-of-2019-ubers-ipo-week-with-12-deals-on-tap-2020-09-14", "published": 1600168580.0, "headline": "IPO market gears up for busiest week since May 2019 â\u0080\u0094 when Uber went public â\u0080\u0094 with 12 deals on tap", "body": "The U.S. initial-public-offering market is gearing up for its busiest week since May of 2019, when Uber Technologies Inc. went public, with 12 deals expected to raise $6.8 billion. The list includes Snowflake, a cloud company that raised its proposed price range by a wide margin early Monday, to $100 to $110 from a prior $75 to $85. The company is planning to offer 28 million shares to raise up to $3.08 billion at a valuation of up to $30.5 billion. That would make it the biggest deal of the year. â\u0080\u009cMore impressive, itâ\u0080\u0099s the largest software IPO of all time,â\u0080\u009d according to Bill Smith, chief executive and co-founder of Renaissance Capital, a provider of IPO exchange-traded funds and institutional research. The deal is more than twice as large as the second biggest software IPO, that of VMware VMW, +0.81% in 2007, said Smith. â\u0080\u009cAs Zoom ZM, +2.89% Â and [Amazonâ\u0080\u0099s] AWS AMZN, +3.01% Â have shown, this seismic shift in the tech sector comes down to market and margins,â\u0080\u009d Smith wrote in commentary. San Mateo, Calif.â\u0080\u0093based Snowflake has applied to list on the New York Exchange under the ticker symbol â\u0080\u009cSNOW.â\u0080\u009d There are 23 banks underwriting the deal, led by Goldman Sachs and Morgan Stanley. Proceeds are to be used for general corporate purposes, including potential acquisitions. See also: 2020 is the year of the SPAC â\u0080\u0094 yet traditional IPOs offer better returns, report finds â\u0080\u009cWe believe in a data connected world where organizations have seamless access to explore, share, and unlock the value of data. To realize this vision, we are pioneering the Data Cloud, an ecosystem where Snowflake customers, partners, and data providers can break down data silos and derive value from rapidly growing data sets in secure, governed, and compliant ways,â\u0080\u009d the company says in its prospectus. Snowflake booked a net loss of $171.3 million in the first six months of fiscal 2020 to July 31, after a loss of $177.2 million in the same period a year earlier. But revenue rose to $241.9 million from $104 million. Read: Fisker is going public: Five things to know about the electric-car maker ahead of its IPO Snowflake is joined on the IPO calendar by Unity Software Inc., a maker of software for 3-D videogames, that is a direct rival of Epic Games, the creator of â\u0080\u009cFortnite,â\u0080\u009d which is currently in a dispute with Apple Inc. AAPL, +1.74% Â and Google parent Alphabet Inc. GOOG, +1.97% Â GOOGL, +1.82%. Unity is planning to sell 25 million shares priced at $34 to $42 each, according to its filing with the Securities and Exchange Commission. If underwriters exercise the option for another 3.8 million shares to cover overallotments, Unity would raise up to $1.21 billion. There are 11 banks underwriting the deal, led by Goldman Sachs and Credit Suisse. See also:Unity Software IPO: 5 things to know about the videogame-engine company Unity will have up to 267.2 million shares outstanding after the offering, including the overallotments, potentially giving Unity a valuation of $11.06 billion at the high end of its pricing range, which would nearly double the companyâ\u0080\u0099s valuation from July 2019 of about $6 billion. The company will have a single class of common stock, but the board reserves the right to issue up to 100 million shares of stock to fight off a hostile takeover. Read now:A new breed of tech IPOs may give the stock market reason to party like itâ\u0080\u0099s 1999 Unity has applied to list on the New York Stock Exchange, under the ticker symbol â\u0080\u009cU.â\u0080\u009d Unity brought in $541.8 million in revenue and a $163.2 million loss in 2019, compared with $380.8 million in revenue for a $131.6 million loss in 2018. Epicâ\u0080\u0099s annual revenue in 2019 was estimated at $4.2 billion, according to Forrester. Packaging company Pactiv Evergreen PTVE, +4.74% Â is expected to be the weekâ\u0080\u0099s third biggest deal, with plans to offer 41.03 million shares priced at $18 to $21 each. The biggest maker of fresh food and beverage packaging is expected to raise $861 million at a valuation of about $3.4 billion. The company has applied to list on Nasdaq under the symbol â\u0080\u009cPTVE.â\u0080\u009d There are 14 banks underwriting the deal, led by Credit Suisse and Citigroup. Proceeds are slated to be used to repay debt and for general corporate purposes. Broadstone Net Lease, a Rochester, N.Y., single-tenant commercial net lease real-estate investment trust with 633 properties, is aiming to raise $636.5 million by selling 33.5 million shares priced at $17 to $19 each. The company plans to list on the NYSE under the symbol â\u0080\u009cBNL.â\u0080\u009d There are 10 banks underwriting the deal, led by J.P. Morgan, Goldman Sachs, BMO Capital Markets and Morgan Stanley. â\u0080\u009cWe are an internally managed REIT that acquires, owns and manages primarily single-tenant commercial real estate properties that are net leased on a long-term basis to a diversified group of tenants,â\u0080\u009d the company says in its prospectus. Donâ\u0080\u0099t miss:Just $5 and an iPhone can open the door to investing in the worldâ\u0080\u0099s rarest fine wines The company had pro forma loss of $2.9 million in the six months ended June 30, after a loss of $2.29 million in the year-earlier period. Revenue came to $158.6 million, up from $137.5 million. Amwell AMWL, -8.90%, which offers insurers and patients a telehealth platform, is expected to offer 35 million shares priced at $14 to $16 each, to raise about $560 million, at a valuation of about 3.6 billion. Amwell has applied to list on the NYSE under the ticker â\u0080\u009cAMWL.â\u0080\u009d There are seven banks underwriting the deal, led by Morgan Stanley, Goldman Sachs and Piper Sandler. Proceeds will be used to develop the companyâ\u0080\u0099s platform, to invest in AI and automation, to expand the companyâ\u0080\u0099s sales force and for potential acquisitions. The company is loss-making but is going public at a time when telehealth is gaining in popularity during the coronavirus pandemic. Amwell had a net loss of $113.4 million in the first six months of 2020, wider than the $41.6 million loss posted in the year-earlier period. Revenue rose to $122.3 million from $69.1 million. Rounding out the list: â\u0080¢ Israeli software company JFrog raised the proposed price range for its IPO early Monday to $39 to $41 from a prior $33 to $37. The company FROG, +0.85% is planning to offer 11.6 million shares to raise up to $475.6 million. The company has applied to list on Nasdaq under the ticker symbol â\u0080\u009cFROG.â\u0080\u009d There are nine banks underwriting the deal, led by Morgan Stanley, J.P. Morgan and BofA Securities. Proceeds are to be used for general corporate purposes. â\u0080\u009cWe provide an end-to-end, hybrid, universal DevOps Platform to achieve Continuous Software Release Management, or CSRM,â\u0080\u009d the company says in its prospectus. â\u0080¢ Sumo Logic, another cloud company, plans to offer 14.8 million shares, priced at $17 to $21 each. The company has applied to list on Nasdaq under the ticker symbol â\u0080\u009cSUMO.â\u0080\u009d There are eight banks underwriting the deal, led by Morgan Stanley. Proceeds are to be used for general corporate purposes. â\u0080\u009cSumo Logic is the pioneer of Continuous Intelligence, a new category of software, which enables organizations of all sizes to address the challenges and opportunities presented by digital transformation, modern applications, and cloud computing,â\u0080\u009d says the companyâ\u0080\u0099s prospectus. â\u0080¢ Investment company StepStone Group plans to offer 17.5 million shares, priced at $15 to $17 each. The company has applied to list on Nasdaq under the symbol â\u0080\u009cSTEP.â\u0080\u009d J.P. Morgan, Goldman Sachs, Morgan Stanley, Barclays and UBS are underwriting the deal. Proceeds are slated to be used to purchase Class B units from its Partnershipâ\u0080\u0099s unit holders, and to repay debt. â\u0080\u009cWe are a global private markets investment firm focused on providing customized investment solutions and advisory and data services to our clients,â\u0080\u009d says the companyâ\u0080\u0099s prospectus. â\u0080¢ Vitru Ltd. VTRU, +3.46%, a Brazilian digital education company, plans to offer 11.23 million shares priced at $22 to $24 each. The company has applied to list on Nasdaq under the ticker symbol â\u0080\u009cVTRU.â\u0080\u009d Selling shareholders are selling another 5.2 million shares. There are nine banks underwriting the deal, led by Goldman Sachs. Proceeds will be used to fund growth through the expansion of the companyâ\u0080\u0099s hybrid platform, for acquisitions and other general corporate purposes. â\u0080\u009cOur mission is to democratize access to education in Brazil through a digital ecosystem and empower every student to create their own success story,â\u0080\u009d the company says in its prospectus. â\u0080¢ Dyne Therapeutics, a developer of therapies for muscle diseases, plans to offer 10.3 million shares, priced at $16 to $18 each. The company has applied to list on Nasdaq, under the ticker symbol â\u0080\u009cDYN.â\u0080\u009d J.P. Morgan, Jefferies, Piper Sandler and Stifel are underwriting the deal. Proceeds will be used to finance R&D, to develop the companyâ\u0080\u0099s proprietary FORCE platform and for general corporate purposes. â\u0080\u009cWe are building a leading muscle disease company focused on advancing innovative life-transforming therapeutics for patients with genetically driven diseases,â\u0080\u009d the company says in its prospectus. â\u0080\u009cWe are utilizing our proprietary FORCE platform to overcome the current limitations of muscle tissue delivery and advance modern oligonucleotide therapeutics for muscle diseases.â\u0080\u009d â\u0080¢ Outset Medical Inc. OM, -4.47%, a medical tech company, plans to offer 7.6 million shares, priced at $22 to $24 each. The company would raise $182.4 million at the top of that range and has applied to list on Nasdaq, under the ticker symbol â\u0080\u009cOM.â\u0080\u009d Proceeds of the deal will be used to expand sales and support staff, for R&D and for working capital. There are five banks underwriting the deal, led by BofA Securities, Morgan Stanley and Goldman Sachs. â\u0080\u009cOutset is a rapidly growing medical technology company pioneering a first-of-its-kind technology to reduce the cost and complexity of dialysis,â\u0080\u009d the company says in its prospectus. â\u0080¢ Metacrine Inc., a clinical-stage biotech focused on therapies for patients with liver and gastrointestinal diseases, is planning to offer 6.54 million shares priced at $12 to $14 each. The company would raise about $92 million. Jefferies, Evercore ISI, RBC and Canaccord are underwriting the deal. Proceeds are to be used to fund clinical trials, for working capital and other general corporate purposes. The company has applied to list on Nasdaq under the ticker symbol â\u0080\u009cMTCR.â\u0080\u009d In the last week, nine SPACs, or special purpose acquisition corporations â\u0080\u0094 commonly known as blank-check companies â\u0080\u0094 went public to raise $3.1 billion. The list included one SPAC led by former White House adviser and Goldman Sachs banker Gary Cohn, which raised $720 million. â\u0080\u009cLast year that would be worthy of an entire newsletter, but not anymore,â\u0080\u009d wrote Smith from Renaissance. â\u0080\u009cWeâ\u0080\u0099ll see the full effects of this historic trend in 2021-22 when they start buying companies. â\u0080\u009cBased on recent filings, the flood of IPOs will continue. Itâ\u0080\u0099s likely weâ\u0080\u0099ll see the busiest September by deal count since 1999. The difference of course, is that these are real businesses,â\u0080\u009d he wrote. The Renaissance IPO ETF IPO, +1.98% Â has gained 56% in 2020, easily outperforming the S&P 500â\u0080\u0099s SPX, +0.87% 5% gain and the Dow Jones Industrial Averageâ\u0080\u0099s DJIA, +0.56% Â 1.7% decline."}]}