{"article": [{"url": "https://www.marketwatch.com/story/only-one-country-in-this-survey-scores-worse-than-the-united-states-when-it-comes-to-raising-a-family-2020-07-29", "published": 1596040400.0, "headline": "The U.S. is the second-worst country for raising a family, survey shows", "body": "Gracias, Mexico! If it weren’t for our neighbors to the south, the U.S. would have the dubious distinction of being the worst country to raise a family, according to a recent Asher & Lyric survey of the 35 nations that are part of the Organization for Economic Co-operation and Development. The travel website took into account six categories — safety, happiness, cost, health, education and time — and a total of 30 factors identifying favorable conditions for raising a family. The U.S. lagged across the board, failing in three categories. “The first time I looked at the data I was in disbelief. I thought there must be a mistake,” said Lyric Fergusson, who runs the site with her husband Asher. “I know Americans are struggling, but how could the United States rank as the 34th best country to raise a family in 2020?” One area of concern in the survey is safety, where the U.S. scored an F. Cost also received a failing grade while happiness was a bit better at C+. The Fergussons attributed the U.S. happiness dip to record “income disparities,” mental health issues each year and a surging suicide rate. “So many Americans fail to look outside of the U.S. for reference. And so, we are left with ingrained idealism that doesn’t line up with our actual experience,” Fergusson wrote. “The U.S. has a remarkable way of burying its failings. It wields wealth and military power with almost Hollywood glossiness to cover up the deep corrosive behavior that is eating away at our culture.” On the flip side, countries that tend to do well on these kinds of surveys again top the list, with Iceland gaining top marks, followed by Norway, Sweden, Finland and Luxembourg: “Iceland achieved top-10 rankings in all categories and was number one in safety,” Fergusson said, adding that Iceland is also a world leader in human rights. “No matter the origins of a child or who they turn out to be, Iceland’s constitution ensures they will be treated unequivocally as an equal.” Click here for the huge infographic summary."}]}