{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-tumble-on-sluggish-chinese-data-and-u-k-s-france-quarantine-move-11597397232", "published": 1597405580.0, "headline": "European stocks tumble on sluggish Chinese data and U.K.â\u0080\u0099s France quarantine move", "body": "Airline stocks were hit hard on Friday by the U.K. decision to add France and the Netherlands to its quarantine list. anthony devlin/Agence France-Presse/Getty Images European stocks fell sharply on Friday, as the U.K.â\u0080\u0099s move to add France to its quarantine list hammered travel stocks and Chinese economic data disappointed. Continued delays and concerns over a fresh round of U.S. stimulus also weighed on sentiment, and investors were looking ahead to a meeting of U.S. and Chinese officials to discuss their trade deal on Saturday. The pan-European Stoxx 600 SXXP, +0.55% index fell 1.3%, while the French CAC PX1, +0.71% slid 1.5%, and the German DAX DAX, +0.06% was 0.8% lower. The U.K.â\u0080\u0099s FTSE 100 UKX, +0.64% slipped 1.5%, led lower by airline and hotel stocks. The U.K.â\u0080\u0099s decision to add France and the Netherlands to its quarantine list amid rising coronavirus cases hit travel and leisure stocks. From Saturday, travelers arriving in the U.K. from those countries will be required to self-isolate for 14 days. The latest blow to the travel sector saw airlines suffer heavy losses early on Friday, with easyJet EZJ, -4.22%, British Airways owner IAG IAG, -3.72%, Deutsche Lufthansa LHA, -2.00% and Ryanair RYA, -2.60% all tumbling. Travel operator Tui TUI, -0.92% was set for a second day of substantial losses after disappointing earnings on Thursday. It wasnâ\u0080\u0099t just airlines feeling the effects of a decision that will likely lead to canceled flights and postponed holidays, as hotel chains Whitbread WTB, +2.25% and Intercontinental Hotels IHG, +1.35%, and aircraft engine maker Rolls-Royce RR, +14.25% were also among the sharpest fallers. Chinese retail sales unexpectedly fell 1.1% in July, improving on Juneâ\u0080\u0099s 1.8% dip but marking a seventh consecutive monthly decline. Economists had estimated sales would edge 0.1% higher but the surprise fall raised fears over Chinaâ\u0080\u0099s economic recovery. Industrial production continued to grow, however, rising 4.8% in July compared with the year-ago period, matching the 4.8% jump in June, but missing the FactSet consensus of a 5.1% rise. â\u0080\u009cChina was first into the coronavirus crisis and arguably one of the first to come out of its first phase, so the fragile nature of its recovery offers an uncomfortable view of the future for other countries,â\u0080\u009d said AJ Bell investment director Russ Mould.Stocks in focusÂ Daimler DAI, -1.31% shares fell, after the Mercedes-Benz owner said it had agreed a $2.2 billion settlement to settle civil investigations by U.S. authorities and class action lawsuits relating to diesel emissions issues."}]}