{"article": [{"url": "https://www.marketwatch.com/story/vaccinating-children-against-the-flu-is-more-important-than-ever-this-year-pediatricians-2020-09-08", "published": 1601289440.0, "headline": "1 in 3 parents won't vaccinate their children against the flu, even though pediatricians say it's 'more important than ever'", "body": "There's one way parents can arm their families against getting sick this fall - but many moms and dads don't want to do it. Vaccinating children against the flu is \"more important than ever\" this year, according to the new American Academy of Pediatrics (AAP) recommendations for preventing influenza during the 2020-21 flu season. But one in three American parents plan to skip getting flu shots for their kids during the pandemic, according to the National Poll on Children's Health released Monday. What's more, two-thirds of the surveyed parents (66%) said they did not believe that getting their kids vaccinated against the flu was more important this year due to the coronavirus pandemic. That runs counter to what many pediatricians have been saying. Public officials are concerned about a \"twindemic\" of both the novel coronavirus causing COVID-19 and the seasonal flu overwhelming hospital beds and emergency services this fall and winter. More than 189,215 Americans have died from COVID-19, according to the latest data from Johns Hopkins University. And the flu is responsible for between 12,000 and 61,000 deaths a year. So pediatricians advise parents to vaccinate all kids ages 6 months and up before the end of October, when flu season begins. CDC director Robert Redfield also recently warned that America is bracing for \"the worst fall, from a public health perspective, we've ever had.\" \"We're going to have COVID in the fall, and we're going to have flu in the fall. And either one of those by themselves can stress certain hospital systems,\" Redfield said Read more:CDC director warns America is in for the 'worst fall â\u0080¦ we've ever had' Problem is, less than half of the country (47%) got a flu shot last year. The CDC normally recommends that 60% to 70% of the country get the influenza inoculation to keep the virus under control, and it's pushing for 65% compliance this year. The vaccine lowers your risk of complications or dying from the flu, even if you do get sick. And fears of catching COVID-19 at the doctor's office has been keeping many parents from bringing their kids in for regular wellness visits, including inoculations. Two-thirds of parents in a recent Orlando Health report said that they are \"still nervous\" about taking their kids to the pediatrician because of the pandemic. The World Health Organization and UNICEF have also warned of \"an alarming decline\" in the number of children getting lifesaving vaccinations around the world as the coronavirus has spread. This hesitation was seen in the new National Poll on Children's Health survey, as well, with one in seven parents saying that they are keeping their child away from health care sites due to concerns about COVID-19. And less than half of surveyed parents (44%) said their child's regular health care provider strongly recommends the flu vaccination this year, so mixed messaging may be giving some parents reason to pause, as well - especially since common flu virus myths are the main culprits keeping most of these moms and dads from vaccinating their kids. Four in 10 parents (42%) who weren't planning to get their kids flu shots this year expressed concerns about side effects from the vaccine. Another 40% believe that the flu vaccine is not necessary, and 32% don't believe it is effective. Last flu season, 188 children and teens under 19 died of complications from influenza, according to the CDC. About 80% of children who die are not vaccinated. Opinion:This claim about the flu shot is all wrong \"As a pediatrician, I am very concerned about the health of children and their families this fall if these two potentially deadly viruses [COVID-19 and the flu] are circulating in the community at the same time,\" Dr. Flor Munoz, the lead author of the AAP recommendations, said in a statement. \"Children play a pivotal role in the transmission of influenza to others in their household. They can also get seriously ill from influenza without a vaccination.\" If you're uninsured, the shots generally run between $40 and $60 at drugstores like CVS CVS, -1.76%  , Walmart WMT, +1.00%  and Target TGT, +1.14%  . You can also find health centers near you, or look up your state's free and discounted vaccine offerings, at Vaccines.gov. Related:Fight the flu with these 10 proven treatments Here are the AAP's 2020-21 Recommendations on Preventing Influenza: Everyone age 6 months and older, including healthy persons and those with high-risk conditions, should get vaccinated for the flu this year. Children should receive the flu vaccine as soon as it is available in their community, as it takes two weeks for the vaccine to work. Vaccinations should ideally be done by the end of October, when flu season begins. The flu season peaks between December and February. Both the flu shot and nasal spray vaccines are fine; there's no preference given to one or the other. This year, all influenza vaccines for children will be quadrivalent vaccines, including two A and two B flu virus strains, to protect against the four strains of the influenza virus expected to circulate this season. The number of recommended flu vaccine doses depends on a child's age at the time of their first administered dose, and on their vaccine history. Children ages 6 months to 8 years should receive two doses if this is the first time they are being vaccinated against the flu, or if they have only received one dose of flu vaccine ever before July 1st, 2020. But only one flu vaccine dose is necessary for children 9 years and older, regardless of whether they have been vaccinated before, and for children up to 8 years old who have received at least two doses of flu vaccine before July 1st, 2020, even if not given during the same season. All children with an egg allergy of any severity can get the flu vaccine without any additional precautions beyond those recommended for any vaccine. Pregnant women may receive the flu vaccine (the inactivated influenza vaccine only) at any time during pregnancy. Maternal vaccination can protect infants in the first few months of life, which is important because there are no vaccines available for infants 0 to 6 months of age. All health care personnel should receive an annual seasonal influenza vaccine to prevent influenza and reduce health care-associated influenza infections. And follow MarketWatch's coronavirus coverage here. This article was originally published on Sept. 8, 2020, and has been updated with the National Poll on Children's Health report."}]}