{"article": [{"url": "https://www.marketwatch.com/story/feds-barkin-says-best-stimulus-plan-would-be-common-standards-so-consumers-feel-safe-to-shop-2020-06-12", "published": 1591977440.0, "headline": "Fedâ\u0080\u0099s Barkin says best stimulus plan would be common standards so consumers feel safe to shop", "body": "The best way to help the U.S. economy recover would be for business and government to develop â\u0080\u009caggressive and consistentâ\u0080\u009d workplace standards, so consumers and workers feel safe to leave home, said Richmond Fed President Thomas Barkin on Friday. â\u0080\u009cDefining these standards, and ensuring they are broadly followed, is actually the most critical stimulus program we can do,â\u0080\u009d Barkin said during a town hall sponsored by Chamber RVA, a Richmond business group. â\u0080\u009cIt will require strong public/private coordination,â\u0080\u009d Barkin said. He added as an aside that he was pleased with the way the Chamber RVA helped Richmond reopen. Barkinâ\u0080\u0099s comments reflect some unease at the Fed about how the economy is reopening with little coordination and rules being set in some instances county-by-county. A second wave of the coronavirus â\u0080\u009cwould not be a positive development,â\u0080\u009d Fed Chairman Jerome Powell said on Wednesday. Even a series of local spikes could damage the economy because it would undermine peopleâ\u0080\u0099s confidence, he said. But the decision about when to reopen the economy is one for elected officials at the state and local level, Powell stressed. Barkin, the Richmond Fed president, was not impressed by the May jobs report, saying the underlying data is worse than the headline 13.3% unemployment rate. The â\u0080\u009cunemployment realityâ\u0080\u009d is in the â\u0080\u009chigh teensâ\u0080\u009d and the job losses have fallen disproportionately on people of color, he said. Second-quarter gross domestic product could come down in the range of about a 40% annual rate, Barkin said. Still, assuming there is no significant resurgence in COVID-19, the economy should improve going forward, Barkin said. â\u0080\u009cWhile hardly robust, you can see positive signals in the real-time information,â\u0080\u009d Barkin said. Consumer sentiment has increased, credit-card spending is not down as much as earlier in the crisis, and auto dealers say demand is rebounding, he said. Real disposable income could actually be positive in the April-June quarter, he said. But the pace of growth will be slow. He said the economy still needs stimulus â\u0080\u009cbeyond what the Fed can deliver.â\u0080\u009d Barkin said some large firms are telling him that they are planning layoffs because they are assuming the economy wonâ\u0080\u0099t recovery fully. The debt burden might also slow the economy going forward, he said. The Dow Jones Industrial Average DJIA, +0.56% Â lost most of its early gains Friday and was up 63 points in early afternoon trading. Stocks had tumbled on Thursday after Powell said a day earlier that the economy faced a â\u0080\u009clong roadâ\u0080\u009d to full recovery. Powell will get a chance to expand on his remarks in testimony to Congressional committees next Tuesday and Wednesday."}]}