{"article": [{"url": "https://www.marketwatch.com/story/nvidia-deal-for-arm-could-be-transformational-but-many-roadblocks-lie-ahead-11600104116", "published": 1600090160.0, "headline": "Nvidia deal for Arm could be 'transformational,' but many roadblocks lie ahead", "body": "Nvidia plans to acquire Arm from Softbank in a deal valued at $40 billion. Getty Images Nvidia Corp. shares were up more than 5% on Monday after the company announced it would be acquiring Arm Ltd. from Softbank Group Corp. in a deal, valued at $40 billion in cash and stock, that one analyst said could be \"transformational.\" The acquisition of a microprocessor-design company would put Nvidia NVDA, -0.54% into direct competition with Intel Corp. INTC, -1.03% and Advanced Micro Devices Inc. AMD, -3.94% in developing brain chips that make up the heart of servers and personal computers. The hope is that Nvidia will become an even stronger power in the data center by combining its graphics processor with Arm's central processing unit (CPU) designs. Analysts seemed excited about potential for the combination while raising some big questions about how the merger will play out.  Nvidia Chief Exexutive Jensen Huang \"is probably in for the battle of his life,\" in the view of Bernstein analyst Stacy Rasgon. The company will have to obtain approvals from \"virtually everywhere given the ubiquity of Arm licensees world-wide,\" he wrote. This includes the U.S., the U.K., the EU, and China. It's unclear whether the U.K. or the EU will be as warm to the deal as the U.S. may be, and the company will likely have to make a continued commitment to spending in the U.K., just as Softbank 9984, -1.24% did when it acquired Arm in 2016. Arm's expense growth vastly exceeded its revenue growth after that, Rasgon said, \"though this investment strategy was of course deliberate (and partially required as a condition of the British government allowing the original sale to Softbank).\" Opinion: The pandemic has brought the personal computer back to life, with help from Zoom Nvidia might also face pushback from Arm's current customer base. \"Already we believe that interest in other alternatives (such as RISC-V) has been increasing as Arm's fate has become nebulous, and there would seem to be risk that independent ownership (by Nvidia or any other semi company) could potentially impair the current value of the asset,\" he wrote. \"We have to admit that we have found the idea of NVDA, or any individual semiconductor company, buying ARM to be a bit of a head-scratcher, as the current value proposition of ARM stems from their independence.\" Rasgon wasn't totally pessimistic on the combination, writing that if the company \"can pull it off\" then Nvidia's \"dominance will be extended into virtually every important compute domain.\" He also wrote that he was \"inclined to grant the benefit of the doubt\" while granting some praise for \"the boldness of the action\" and reiterating his outperform rating and $545 price target. Evercore ISI analyst C.J. Muse took a similar view, arguing that the two companies together would make for \"a powerful combination\" though deal approval could be tricky. \"There will likely be many players who complain about this deal,\" he wrote prior to the official deal announcement, including China, the U.K., and existing Arm licensees like Qualcomm Inc. QCOM, +2.06%, Broadcom Inc. AVGO, +0.90%, and Apple Inc. AAPL, +1.74% \"We would think a time to close, at a minimum, would be 18 months.\" He maintained an overweight rating and $600 price target on the shares. Jefferies analyst Mark Lipacis was more upbeat, writing that the deal could be \"transformative\" and raising his price target on the stock to $680 from $570. The new target is the highest listed on FactSet. The merger puts Nvidia in a position \"not just to capture 80% of the ecosystem value in the data center, but also unify the compute ecosystem between the edge and data center,\" he wrote. He estimates that the company has five-year earnings-per-share power of $50 and reiterated a buy rating on the stock.  Nvidia shares have risen 43% over the past three months as the S&P 500 SPX, +0.87% has gained 12%."}]}