{"article": [{"url": "https://www.marketwatch.com/story/as-trump-prepares-to-leave-walter-reed-after-coronavirus-treatment-heres-what-we-know-about-his-health-2020-10-05", "published": 1601972840.0, "headline": "Trump leaves Walter Reed after coronavirus treatment â\u0080\u0094 hereâ\u0080\u0099s what we know about his health so far", "body": "President Trump is back home at the White House. The commander-in-chief tweeted on Monday afternoon that he was leaving Walter Reed Medical Center, just days after he moved into the Bethesda, Md. hospital for â\u0080\u009cfurther evaluationâ\u0080\u009d and out of â\u0080\u009can abundance of cautionâ\u0080\u009d after revealing he had tested positive for COVID-19. â\u0080\u009cI feel better than I did 20 years ago!â\u0080\u009d he added, urging his followers not to fear the coronavirus or â\u0080\u009clet it dominate your life.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } Upon his return to 1600 Pennsylvania Ave., he promptly ignited controversy by taking off his mask, even though his physician Dr. Sean Conley said earlier in the day that the president is still contagious and â\u0080\u009cmay not entirely be out of the woods yet.â\u0080\u009d Still, his clinical status supported a â\u0080\u009csafeâ\u0080\u009d return home, Trumpâ\u0080\u0099s medical team said. Hereâ\u0080\u0099s what we know so far about his prognosis and treatment, as well as how theyâ\u0080\u0099re impacting the federal government and the election. The presidentâ\u0080\u0099s medical treatment The president relocated from the White House to Walter Reed on Friday, the same day that he and first lady Melania Trump revealed they had tested positive for COVID-19. He was being treated with Regeneron Pharmaceuticals Inc.â\u0080\u0099sÂ experimental neutralizing antibody cocktail, Gilead Sciences Inc.â\u0080\u0099sÂ remdesivir, and the steroid dexamethasone. The latter is often used to treat severely ill COVID-19 patients. Trump was also given supplemental oxygen at least once, his physician Dr. Sean Conley confirmed on Sunday. And the president is taking zinc, vitamin D, an acid reducer, melatonin and aspirin. Read:President Trump is prescribed a third drug to combat his COVID-19 infection The president has been reassuring the public about his prognosis Trump told the American people that â\u0080\u009cI feel much better nowâ\u0080\u009d in a video statement from Walter Reed late Saturday, and that the first lady was doing well, too. Read:â\u0080\u0098I wasnâ\u0080\u0099t feeling so well. I feel much better nowâ\u0080\u0099: Full transcript of Trumpâ\u0080\u0099s video address from Walter Reed The president also briefly left Walter Reed on Sunday night to take a motorcade ride past his supporters, who had been lining up outside since he was admitted. Some doctors expressed alarm over the move, including an attending physician from Walter Reed, James Phillips, who called it â\u0080\u009cinsanityâ\u0080\u009d and â\u0080\u009cpolitical theater.â\u0080\u009d Phillips tweeted, â\u0080\u009cEvery single person in the vehicle during that completely unnecessary Presidential â\u0080\u0098drive-byâ\u0080\u0099 just now has to be quarantined for 14 days.â\u0080\u009d Read: Hereâ\u0080\u0099s what doctors are saying about Trumpâ\u0080\u0099s motorcade outside Walter Reed to wave at supporters His medical team told reporters on Monday afternoon that Trump had not recorded a fever in more than 72 hours, and his oxygen levels were normal. And once the president returns to the White House, Conley added that Trump will be â\u0080\u009csurrounded by world-class medical care 24/7.â\u0080\u009d Indeed Dr. Daniel McQuillen, senior staff physician at Lahey Hospital & Medical Center in Burlington, Mass., told MarketWatch that the president is â\u0080\u009cnot really going home from a medical perspective.â\u0080\u009d Thatâ\u0080\u0099s why his Walter Reed residency has been a relatively quicker trip in and out of the hospital compared to other coronavirus patients. Whatâ\u0080\u0099s more, the president tweeted â\u0080\u009cDonâ\u0080\u0099t be afraid of Covid. Donâ\u0080\u0099t let it dominate your life,â\u0080\u009d on Monday, sparking heated Twitter exchanges. Read:â\u0080\u0098Donâ\u0080\u0099t ever, ever underestimate the potential of the pandemicâ\u0080\u0099: 5 reasons scientists say you should be afraid of COVID-19 There have been conflicting reports about the presidentâ\u0080\u0099s health Questions remain about the presidentâ\u0080\u0099s medical condition, as well as the date of his last negative COVID-19 test and when he first began treatment for the virus after his personal physician made some statements that have conflicted with what White House chief of staff Mark Meadows told reporters. This has led Dr. Ashish Jha, the dean of theÂ Brown University School of Public Health,Â to call for â\u0080\u009cradical transparencyâ\u0080\u009d on Trumpâ\u0080\u0099s illness. â\u0080\u009cAs the president undergoes treatment for his emerging symptoms, the public must receive daily, honest updates about the presidentâ\u0080\u0099s condition, not from White House staff but from his medical team,â\u0080\u009d Jha said in a statement. A recent Rose Garden event is being eyed as a possible super-spreader scenario Dr. Jha also tweeted that it is a reasonable assumption that the president was infected sometime between Saturday, Sept. 26 â\u0080\u0094 when he announced Amy Coney Barrett as his Supreme Court candidate in the Rose Garden â\u0080\u0094 and the following Monday, and that he could have been infectious as early as Tuesday, when he faced former Vice President Joe Biden in the first presidential debate. Biden has so far tested negative for the virus. Trumpâ\u0080\u0099s chief of staff also warned on Friday morning that all White House staff had been tested for COVID-19, and he expects thatÂ â\u0080\u009cas this virus continues to go on, other people in the White House will certainly have a positive test result.â\u0080\u009d Read:Hereâ\u0080\u0099s a reverse timeline of where Trump has been That Rose Garden event is being eyed as a potential â\u0080\u009csuper-spreaderâ\u0080\u009d event, as several attendees including the president and first lady, Trumpâ\u0080\u0099s senior adviser Hope Hicks, former White House adviser Kellyanne Conway, Trumpâ\u0080\u0099s campaign manager Bill Stephen and former New Jersey Gov. Chris Christie have all tested positive for COVID-19. Attorney General William Barr, who was also at the Rose Garden event, will quarantine out of caution despite testing negative for the virus so far. White House press secretary Kayleigh McEnany tested positive on Monday morning. Read:Potential Washington COVID-19 super-spreader events have everyone asking again: How does contact tracing work? Whatâ\u0080\u0099s more, U.S. Senate Majority Leader Mitch McConnellÂ canceled Senate votes for the next two weeks after three Republican Senators tested positive for the virus. The confirmation hearings for Trumpâ\u0080\u0099s Supreme Court Justice nominee Amy Coney Barrett were set to continue, however. What if Trump becomes too sick to serve as president? Under the Constitution, Vice President Mike Pence would take the reins in the event that Trump was unable to perform his duties for health reasons, and he would likely pick another Republican to serve as his own vice president. If something happened where Pence was unable to step in as commander-in-chief, Democratic House Speaker Nancy Pelosi would be next in line.Â Hereâ\u0080\u0099s a detailed look at the presidential line of succession. What this means for the election Thereâ\u0080\u0099s a lot still up in the air, such as whether the remaining two presidential debates, on Oct. 15 and Oct. 22, will be canceled. They will most likely be impacted in some way. There is some speculation that they may not be in-person events. â\u0080\u009cSaturday Night Liveâ\u0080\u0099sâ\u0080\u009d parody of the first debate suggested that it may end up being the only presidential debate of this election. The vice presidential debate between Mike Pence and Sen. Kamala Harris was still on track to take place on Wednesday, Oct. 7. The president will put in-person campaigning on pause while he quarantines, with his campaign manager Bill Stepien announcing last Friday that these are being moved to virtual events or are being temporarily postponed. Trump tweeted a series of campaign-style slogans on Monday morning that called upon his supporters to vote, including: â\u0080\u009cBIGGEST TAX CUT EVER, AND ANOTHER ONE COMING. VOTE!â\u0080\u009d and â\u0080\u009cSTOCK MARKET HIGHS. VOTE!â\u0080\u009d His â\u0080\u009c401(K). VOTE!â\u0080\u009d tweet drummed up a lot of Twitter chatter, as some users expressed dissatisfaction with the state of their 401(k) plans in recent months. Biden has continued campaigning, although his team pulled down their attack ads as the president was moved to Walter Reed on Friday. (The Trump campaign did not reciprocate.) Bidenâ\u0080\u0099s schedule still saw him traveling to Florida on Monday for campaign events including a town hall. Read:Hereâ\u0080\u0099s how Trumpâ\u0080\u0099s positive coronavirus test has shaken up the campaign â\u0080\u0093 plus what could happen next How financial markets have reacted While Trumpâ\u0080\u0099s diagnosis rattled the markets last Friday, by midday Monday, the U.S. benchmark stock indexes were higher as investors watched the presidentâ\u0080\u0099s response to treatments and reinvigorated stimulus talks in Washington. Read:Â Trumpâ\u0080\u0099s coronavirus recovery, stimulus hope, election clarity: Whatâ\u0080\u0099s really driving the market? By Monday afternoon, there were 7.4 million COVID-19 cases in the U.S., the highest in the world, and a death toll of 209,938 and counting, per the latest update/Johns Hopkins. This is a breaking news story that will continue to be updated."}]}