{"article": [{"url": "https://www.marketwatch.com/story/uk-eu-trade-talks-resume-in-last-ditch-push-to-clinch-agreement-amid-signs-london-is-now-eager-to-avoid-a-hard-brexit-2020-09-28", "published": 1601361860.0, "headline": "U.K.-EU trade talks resume in last-ditch push to clinch agreement, amid signs London is now eager to avoid a 'hard Brexit'", "body": "U.K. and European Union top negotiators David Frost and Michel Barnier and their respective teams will meet again in Brussels on Tuesday, to try to come up with a compromise amid signs that the U.K. government is getting cold feet at the prospect of a 'no-deal' Brexit on December 31. - The key stumbling blocks remain the question of fishing rights in British waters, and the ability of the U.K. to diverge from EU regulations on state aid to business. Since the U.K. left the EU formally on January 31, months of talks have failed to produce any compromise on those issues. - Brussels has warned it would legally challenge a U.K. law submitted to Parliament reneging on last year's withdrawal agreement relating to Ireland, if London didn't climb down by the end of September. - U.K. media reported over the weekend that Chancellor of the Exchequer Rishi Sunak - who just unveiled last week his 'winter economy plan' to help the economy deal with the second spike of the coronavirus pandemic - has warned Prime Minister Boris Johnson against the adverse consequences of no trade deal. - EU leaders are scheduled to meet on October 15 to assess the state of the negotiations, with only two weeks left by then to conclude a deal that could be ratified by both sides before the end of the year. Read: From lockdowns to Brexit, the U.K. economy is heading toward a rough winter The outlook: The mood in the Frost and Barnier teams is cautiously optimistic and a compromise may be found on fisheries. But a comprehensive agreement can hardly be reached without a U.K. climbdown on state aid, and Johnson might have trouble selling it to the hard-Brexiteer wing of his Conservative Party. The PM may still decide that he can't be expected to tackle the two major economic shocks of the coronavirus pandemic and Brexit at the same time. But his management of both crises will remain contested within his own party's ranks, and not only by the Labour Party opposition elsewhere. Opinion: The world's poorest countries may get another freeze on their debt payments. What they really need is debt forgiveness"}]}