{"article": [{"url": "https://www.marketwatch.com/story/pentagon-blindsided-by-trumps-new-afghanistan-troop-withdrawal-assertion-2020-10-08", "published": 1602230060.0, "headline": "Pentagon blindsided by Trumpâ\u0080\u0099s new Afghanistan troop withdrawal assertion", "body": "WASHINGTON (AP) â\u0080\u0094 The U.S. military was blindsided Thursday by President Donald Trumpâ\u0080\u0099s assertion that all U.S. troops will be out of Afghanistan by the end of the year, with U.S. officials saying they are not aware of such a plan and have gotten no actual order to accelerate the more gradual pullout theyâ\u0080\u0099ve been executing. Trumpâ\u0080\u0099s comments, laid out in a confusing progression of comments and a tweet, alarmed Pentagon and State officials who fear that putting a definitive date on troop withdrawal could undercut negotiations to finalize a peace deal between the Taliban and the Afghan government. They also fear a hasty withdrawal could force the U.S. to leave behind sensitive military equipment. And they continue to stress that the Taliban has still not met requirements to reduce violence against the Afghans, a key element of the U.S. withdrawal plan. See:Marine Corps assistant commandant tests positive for coronavirus after Pentagon meeting Also:Joint Chiefs chairman and other military brass to quarantine after Coast Guard officialâ\u0080\u0099s positive coronavirus test The Taliban welcomed Trumpâ\u0080\u0099s announcements, which started with a tweet Wednesday saying â\u0080\u009cwe should have the small remaining number of our BRAVE Men and Women serving in Afghanistan home by Christmas.â\u0080\u009d He reinforced early withdrawal plans Thursday morning, in a Fox Business Channel interview that understated the number of troops currently in Afghanistan. â\u0080\u009cWeâ\u0080\u0099re down to 4,000 troops in Afghanistan. Iâ\u0080\u0099ll have them home by the end of the year. Theyâ\u0080\u0099re coming home, you know, as we speak. Nineteen years is enough. Theyâ\u0080\u0099re acting as policemen, OK? Theyâ\u0080\u0099re not acting as troops,â\u0080\u009d Trump said. Multiple U.S. officials, speaking on condition of anonymity to discuss sensitive troop details, said they know of no plan for either new deadline. Instead, they pointed to comments Wednesday by national-security adviser Robert Oâ\u0080\u0099Brien, who told an audience in Las Vegas that â\u0080\u009cas of today, there are under 5,000 and that will go to 2,500 by early next year.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } U.S. officials said troop numbers have not yet been reduced to 4,500, but will hit that goal in November as planned. The military has also consistently said that counterterrorism troops would remain in Afghanistan for some time to deal with al-Qaida and Islamic State threats. A senior Trump administration official said Trump, with his tweet, laid down a marker Wednesday on U.S. troop withdrawals from Afghanistan, and, since he is the commander in chief, the rest of the administration will follow his lead. The official also spoke on condition of anonymity because of the sensitivity of troop withdrawals. This is not the first time, however, that Trump has upended military policies or troop withdrawal plans with an abrupt tweet, only to be persuaded to adjust his thinking or give the military more time to execute a more deliberate approach. Trumpâ\u0080\u0099s demand to pull all troops out of Syria, for example, was eventually changed, and there are still less than 1,000 forces there. Even before Trumpâ\u0080\u0099s latest pronouncement, the White House has refused to allow U.S. negotiators to base troop withdrawals on the signing of a peace deal between the Afghan government and the Taliban. Instead, American diplomats and military officials were able to say only that withdrawals would be based on conditions on the ground, meaning a measurable reduction in Taliban attacks, rather than any resolution to the countryâ\u0080\u0099s long-running internal conflicts. â\u0080\u009cWhat we need to see is that theyâ\u0080\u0099re not going to allow al-Qaida to base there,â\u0080\u009d said Gen. Frank McKenzie, head of U.S. Central Command, in a September interview with NBC News. â\u0080\u009cAnd that has just not yet been demonstrated to my satisfaction.â\u0080\u009d McKenzie and other military officials have also said that the drawdown must be done responsibly, and that moving faster will make it more difficult to get sensitive and critical American military equipment out of Afghanistan. â\u0080\u009cWeâ\u0080\u0099re not going to leave anything behind that somebody could use against us in another time and another place. So thatâ\u0080\u0099s actually a huge logistics effort and it is continuing now,â\u0080\u009d McKenzie said last month. NATO Secretary-General Jens Stoltenberg, asked about Trumpâ\u0080\u0099s comments Thursday, did not say whether he had been alerted to the new deadlines. Instead, he said NATO and all allies will coordinate their efforts and â\u0080\u009cmake decisions based on the conditions on the ground, because we think it is extremely important to continue to be committed to the future of Afghanistan.â\u0080\u009d Americaâ\u0080\u0099s exit from Afghanistan after 19 years was laid out in a February agreement Washington reached with the Taliban. That agreement said U.S. troops would be out of Afghanistan in 18 months, provided the Taliban honored a commitment to fight terrorist groups, with most attention seemingly focused on the Islamic State groupâ\u0080\u0099s affiliate in the country. Taliban spokesman Zabihullah Mujahed welcomed Trumpâ\u0080\u0099s tweet as a positive step for the implementation of the U.S.-Taliban agreement. The Taliban, he said, are â\u0080\u009ccommitted to the contents of the agreement and hope for good and positive relations with all countries, including the U.S., in the future.â\u0080\u009d The Taliban and the Afghan government-appointed negotiating team are holding peace talks in Doha, Qatar, but progress has been painfully slow. Washingtonâ\u0080\u0099s peace envoy Zalmay Khalilzad met Thursday in Pakistan with Gen. Austin Miller, commander of U.S. forces in Afghanistan, and Pakistanâ\u0080\u0099s Army Chief of Staff Gen. Qamar Jaaved Bajwa. Pakistan has helped shepherd the Taliban to the negotiating table and its role is seen as critical for lasting peace in Afghanistan. Khalilzad has been keen to get both sides â\u0080\u0094 particularly the Taliban â\u0080\u0094 to sign on to a reduction in violence at least while the Qatar negotiations are underway and until a permanent cease-fire can be negotiated. Itâ\u0080\u0099s likely Miller and Khalilzad were seeking the help of Pakistanâ\u0080\u0099s powerful military to press the Taliban, who have insisted on fighting Afghan security forces even as talks are taking place. The insurgents have kept a promise from February not to attack U.S. and NATO troops."}]}