{"article": [{"url": "https://www.marketwatch.com/story/it-will-be-painful-for-colleges-and-also-painful-for-students-plans-to-bring-back-students-get-derailed-by-covid-19-surge-11596032585", "published": 1596137300.0, "headline": "â\u0080\u0098It will be painful for colleges and also painful for studentsâ\u0080\u0099: Plans to bring back students get derailed by COVID-19 surge", "body": "A view of Harvard Yard on the campus of Harvard University. Harvard is one of a slew of colleges planning for a largely online remote semester this fall. (Photo by Maddie Meyer/Getty Images) Maddie Meyer/Getty Images Like many higher education officials, Melissa Taverner, the provost at Lyon College, was hoping students could return to the schoolâ\u0080\u0099s Batesville, Ark. campus this fall.Â After transitioning to remote classes in March, officials at the school, a liberal-arts college with less than 1,000 students, began coming up with testing and other protocols to bring students back to campus safely when classes resumed in the fall.Â Over the next few months, they watched cases rise around the country, across the state and in their town â\u0080\u0094 putting the local health-care system at risk. They saw similar-sized colleges in the south announce plans to resume classes remotely and read about much larger schools quarantining athletes they brought back to campus who had become infected.Â As August loomed, â\u0080\u009cthe question became one of ethics,â\u0080\u009d Taverner said. â\u0080\u009cCan we legitimately bring our students back and guarantee within reason that we could ensure their safety, and the safety of our faculty, and the safety of our staff, and the safety of the community in which we live?â\u0080\u009dÂ The answer, they decided, is no. Lyon announced Friday that it would resume classes remotely this fall. â\u0080\u009cThe plans that we were putting in place,â\u0080\u009d during the spring and early summer â\u0080\u009cacknowledged that most likely this pandemic would not be finished when we got to August, but that it would be more in control,â\u0080\u009d Taverner said. â\u0080\u009cThat was not the reality.â\u0080\u009dÂ Lyon is among the roughly 14% of colleges â\u0080\u0094 or more â\u0080\u0094 planning for a remote semester this fall, according to the Chronicle of Higher Education. In the late spring, about 68% of colleges that had announced their plans for the fall said they would offer in-person instruction, according to the Chronicleâ\u0080\u0099s tracker at the time. Now, just 48% say they will be fully in person.Â Elite colleges like Harvard University and state public systems like Rutgers University have said theyâ\u0080\u0099ll offer classes almost completely online. Some schools that made announcements earlier in the year indicating theyâ\u0080\u0099d bring students back have changed their plans.Â After initially saying they would offer classes in-person in early July, a group of Historically Black Colleges and Universities in Atlanta â\u0080\u0094 Spelman College, Morehouse College and Clark-Atlanta University â\u0080\u0094 decided it wasnâ\u0080\u0099t safe to bring students back to campus. A few weeks later, they announced that the fall semester would be remote.Â At the beginning of the pandemic, colleges and universities were trying to come up with pandemic-appropriate plans that fulfilled their mission of providing a higher education, including the trappings beyond academics, like frequent interaction with peers and professors, said Shweta Bansal, an associate professor of biology at Georgetown University. But with cases rising, that now seems difficult.Â â\u0080\u009cThe situation is deteriorating, which is certainly cause to change plans,â\u0080\u009d said Bansal, who is also an infectious-disease researcher.Â Colleges assumed case numbers would go down, but they rose At Whitman College, a liberal arts school with about 1,450 students in Walla Walla, Wash., thatâ\u0080\u0099s what happened. In April, officials had initially announced they were planning for a return to campus in the fall. They invested resources in figuring out how to do that safely â\u0080\u009cwith the assumption that we would see the bending back of the curve and that we would see the case numbers go down,â\u0080\u009d said Josh Jensen, the schoolâ\u0080\u0099s vice president for enrollment and communications and the chair of its coronavirus task force.Â Â But a few weeks ago they started to realize that â\u0080\u009cthese numbers arenâ\u0080\u0099t getting better theyâ\u0080\u0099re getting worse,â\u0080\u009d Jensen said. That meant they no longer felt they could bring students back to campus and protect them and the wider Walla Walla community, he said. On Friday, they announced instruction would be primarily remote.Â Colleges can be a particularly challenging environment in which to manage the virus because theyâ\u0080\u0099re socially connected and designed for interaction, Bansal said. One analysis of transcript data at Cornell University by sociologists there found that by the time an undergraduate or graduate student at the school has run through their schedule at least once theyâ\u0080\u0099ve had the potential to share a classroom with 529 students.Â A simulation created by a mathematics professor at the University of Pennsylvania and an economics professor at Swarthmore College modeled the impact of collegesâ\u0080\u0099 interventions on the spread of the virus.Â Assuming that a university pursues what the researchers describe as the â\u0080\u009cstandard interventionâ\u0080\u009d â\u0080\u0094 daily randomized testing of 3% of the university population, quarantining and contact tracing infected individuals, requiring everyone to wear masks and moving classes of 30 people or more online â\u0080\u0094 fewer than 66 people out of 22,500 get infected in 95% of simulations run by the pair.Â Both of these analyses are focused on the academic environment. â\u0080\u009cEven if you cut down all those classroom contacts, which of course are particularly risky, youâ\u0080\u0099re still leaving a lot of the social interactions in place that provide transmission pathways,â\u0080\u009d Bansal said.â\u0080\u0098How do you control what happens outside the classroom?â\u0080\u0099 At Harrisburg University of Science and Technology, officials realized there was little they could do to ensure those social interactions would be safe. â\u0080\u009cWe felt really pretty good about being able to social distance in the classroom and provide separation between students and separation between faculty and students,â\u0080\u009d said Eric Darr, the president of the school. â\u0080\u009cOur big concern was 80% of the time students and faculty will be outside of the classroom. How do you control what happens outside the classroom? Thereâ\u0080\u0099s just no way to do that.â\u0080\u009d Officials at Paul Quinn College, a historically black college in Dallas, Texas, came to a similar conclusion. â\u0080\u009cI just donâ\u0080\u0099t know very many people who have success managing the hourly activities and engagement of 18- to 22-year olds,â\u0080\u009d said Michael Sorrell, the collegeâ\u0080\u0099s president. Sorrell has expressed concerns since May about bringing students back to college campuses.Â â\u0080\u009cWe didnâ\u0080\u0099t think weâ\u0080\u0099d be able to do that, which is what you needed to do to be able to succeed with inviting students back to campus.â\u0080\u009dÂ Even directives that seem simple, like universal mask-wearing, can have unforeseen complications. â\u0080\u009cFor them to really do their job they need to be worn correctly, which most people donâ\u0080\u0099t have the training for,â\u0080\u009d Bansal said. â\u0080\u009cAnd you need to have perfect adherence and you need to wear them all the time everywhere you go.â\u0080\u009d She also worries that at least some universities planning to resume in-person classes donâ\u0080\u0099t have testing protocols that are robust enough to actually prevent an outbreak on campus, instead of just monitor one. Because COVID-19 can be transmitted before infected individuals show symptoms and because tests can be false-negative, universities would need to test every single person on campus every three days to prevent an outbreak, she said.Â â\u0080\u009cUniversities are preparing for some level of acceptable losses,â\u0080\u009d she said. â\u0080\u009cIf theyâ\u0080\u0099re not aiming to prevent transmission and get ahead of the outbreak then thereâ\u0080\u0099s no other way around the idea that there will be an outbreak and that there will be severe outcomes in that population.â\u0080\u009dÂ Financial concerns loom Colleges may be feeling pressure to open because of financial concerns. Collegesâ\u0080\u0099 business models â\u0080\u0094 particularly smaller schools without a robust research arm attachedÂ â\u0080\u0094 were already squeezed before the pandemic. But sending students home in the spring, and in some cases, refunding the money they paid to live on campus put their finances in even greater jeopardy.Â An online fall is likely to exacerbate that dynamic, said Robert Kelchen, a professor of higher education finance at Seton Hall University in South Orange, N.J. â\u0080\u009cIt will be painful for colleges and also painful for students and employees,â\u0080\u009d he said. â\u0080\u009cMany colleges get a sizable part of their revenue from having students in-person.â\u0080\u009dÂ Â Whitman is one of those schools. â\u0080\u009cWhitman, like many colleges, is tuition dependent for revenue,â\u0080\u009d Jensen said. The choice to go remote and whether it pushes some students not to enroll this fall â\u0080\u009cwill impact the collegeâ\u0080\u0099s finances, no doubt about it.â\u0080\u009d At this point, itâ\u0080\u0099s unclear by how much, Jensen said.Â â\u0080\u009cHow fortunate we feel that we had the ability to say to our students weâ\u0080\u0099re going to go remote and weâ\u0080\u0099re going to manage and weather the financial challenges that come with that and Whitman will be financially strong,â\u0080\u009d he said. â\u0080\u009cI donâ\u0080\u0099t know that every college is able to say that quite as confidently.â\u0080\u009d At Lyon the decision, â\u0080\u009cdoes have pretty serious financial implications,â\u0080\u009d Taverner said. â\u0080\u009cWe know that the financial hit that every college is going to take is not trivial but then you have to weigh that,â\u0080\u009d against first of all the safety of the campus community and the reputational and long-term financial costs of an outbreak, she said.Â As Sorrell put it: â\u0080\u009cIf Iâ\u0080\u0099m going to be wrong Iâ\u0080\u0099d rather be wrong and have the ability and go find extra money then to be wrong and cause my staff and students to be sick and maybe die.â\u0080\u009dÂ Â Bringing students back to school does come with risks of virus transmission, Bansal said.Â â\u0080\u009cWe can say without a doubt that there are going to be outbreaks on university campuses if there are students present in person,â\u0080\u009d Bansal said. And once students return, the damage has already been done, she said.Â â\u0080\u009cBringing students to campus and then returning them home in the event of an outbreak is essentially a recipe for disseminating the virus in communities around the country,â\u0080\u009d she said.Â"}]}