{"article": [{"url": "https://www.marketwatch.com/story/warren-buffett-may-have-found-a-stock-he-likes-his-own-2020-07-17", "published": 1595059760.0, "headline": "Warren Buffett may have found a stock he likes â\u0080\u0094 his own", "body": "Something unusual has happened in markets over the last week. The highflying tech stocks that investors have sought out for refuge have dropped, but so have the COVID-19 recovery plays in the travel and leisure sector. Instead, it isnâ\u0080\u0099t just financials that have gained ground as the big banks have reported results, but also energy, industrials and materials sectors â\u0080\u0094 all where the value stocks lie. The S&P 500 value index SP500V, +0.19% Â has climbed 5% over the last week, outperforming the broader SPX, +0.87% Â . Which brings us to what some would now consider a deep value stock â\u0080\u0094 Berkshire Hathaway. Warren Buffettâ\u0080\u0099s company has been quiet during the pandemic, only recently agreeing to spend $10 billion of his $137 billion in available cash on a natural-gas transmission and storage business. He has also found something else â\u0080\u0094 his own company, according to the Rational Walk blog. The blog says, based on a Securities and Exchange Commission filing made in early July, that it is likely there was a buyback on the order of $5 billion to $5.5 billion of Berkshire Hathaway BRK.A, +0.06% Â BRK.B, +0.24% Â shares. (It involves math deriving from Buffettâ\u0080\u0099s 15.54% ownership of the company that was reported in the filing, and comparing it to the shares outstanding of Berkshire Hathaway reported in a form on March 31.) It wonâ\u0080\u0099t be clear until August, when the company releases its second-quarter results, whether the company will reveal the extent, or not, of its stock buyback activity. So if there were stock buybacks, the question would be why. â\u0080\u009cIt seems likely that Buffettâ\u0080\u0099s views of the range of possible economic outcomes related to COVID have narrowed somewhat, and that he might view the very worst outcomes as less likely than he did when he spoke at the annual meeting on May 2,â\u0080\u009d the blog says. While it is true that some of the publicly traded companies Buffett owns â\u0080\u0094 notably Apple AAPL, +1.74% Â â\u0080\u0094 have rallied during the second quarter and into July, he could have a view as the companies Berkshire Hathaway directly operates, such as Geico Auto Insurance and Duracell. â\u0080\u009cHis own assessment of the intrinsic value of the portfolio, as well as the intrinsic value of Berkshireâ\u0080\u0099s operating companies, is what will inform his thinking when it comes to calculating Berkshireâ\u0080\u0099s intrinsic value,â\u0080\u009d the blog says. Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. Be sure to check the Need to Know item. The emailed version will be sent out at about 7:30 a.m. Eastern."}]}