{"article": [{"url": "https://www.marketwatch.com/story/norwegian-cruise-investors-can-blame-the-cdc-for-extended-cruise-suspensions-analyst-says-2020-06-17", "published": 1592468540.0, "headline": "Norwegian Cruise investors can blame the CDC for extended cruise suspensions, analyst says", "body": "Shares of Norwegian Cruise Line Holdings Ltd. and other cruise operators tumbled Wednesday, after Norwegian extended the suspensions of ship departures by at least two months, but Instinet analyst Harry Curtis said investors should blame it on government bias, not the company. Norwegian said late Tuesday that it was halting cruise voyages through Sept. 30, and is also canceling some departures through October, which is a change from previously announced suspensions through July. Norwegian said it would continue to work with the U.S. Centers for Disease Control and Prevention (CDC), the federal government and public health authorities to ensure safety of employees and guests. Curtis said that’s the problem. “This issue is NOT that the industry has been passive in developing health protocols. Quite the contrary,” Curtis wrote in a note to clients. “In our view, the hurdle lies with the CDC’s unwillingness to discuss, debate and mutually implement the highest standards of passenger and crew health care.” He said Norwegian has for many weeks, submitted suggestions for new protocols, but the CDC has shown “limited interest” in holding discussions about resuming cruises. Yet the company has little recourse but to wait for approval, as Curtis said the CDC has the power to impound or quarantine ships. “ “In our view, there is something unjust about such unilateral treatment.” ” — Instinet analyst Harry Curtis. Norwegian’s stock slumped 8.4% in active midday trading, on volume of 66.7 million shares, but pared earlier losses of as much as 10%. The news of the extended suspensions weighed on the stocks of other cruise operators, with Carnival Corp.’s CCL, +0.51% falling 6.5% and Royal Caribbean Cruises Ltd.’s RCL, +2.59% dropping 7.2%. Curtis said the CDC seems to be telling cruise operators to not even think about resuming operations, even as many businesses have started reopening, including resorts and casinos. And airlines have let many flights take off at near capacity “with not a peep” from the CDC. “It would seem that the cruise industry, its passengers and employees have been viewed by the CDC in the same vein as meat packing plants, nursing homes and prisons,” Curtis wrote. “In our view, there is something unjust about such unilateral treatment.” He’s worried that at the current pace, it could take the CDC three to six months to respond to expert panel recommendations, which by then the 2020 cruise season would be over. Norwegian’s stock has more doubled (up 147.1%) over the past three months, but was still down 67.1% year to date, while shares of Carnival have lost 62.4% this year and Royal Caribbean have declined 56.5%. In comparison, Marriott International Inc. shares MAR, -0.96% have declined 39.8% year to date, Las Vegas Sands Corp.’s stock LVS, -0.84% has lost 29.2%, the U.S. Global Jets exchange-traded fund JETS, +0.16% has shed 42.5% and the S&P 500 index SPX, +0.87% has slipped 3.6%."}]}