{"article": [{"url": "https://www.marketwatch.com/story/stock-index-futures-lose-ground-ahead-of-retail-sales-data-2020-08-14", "published": 1597423340.0, "headline": "Dow finishes with small gain after weaker-than-expected rise in retail sales", "body": "Stocks posted a mixed finished Friday, spending much of the session near unchanged after a weaker-than-expected rise in retail sales underlined lingering questions about the economy’s resilience following its pandemic-induced collapse in the spring.What did major indexes do? The Dow Jones Industrial Average DJIA, +0.56% closed up 34.30 points, 0.1%, at 27,931.02, after flipping positive in the last moments of trade. The S&P 500 SPX, +0.87% fel 0.58 point, or less than 0.1%, to finish at 3,372.85. The Nasdaq Composite COMP, +1.39% shed 23.20 points, or 0.2%, to close at 11,019.30. The benchmarks scored weekly gains, with the Dow up 1.8% and the S&P 500 rising 0.6%. Friday’s gain turned the Nasdaq barely positive for the week, up 0.1%. The S&P 500 briefly traded above its Feb. 19 closing high of 3,386.15 on Wednesday and Thursday, but was unable to hang on for a record.What drove the market? Stocks were mixed in the morning after the government reported that retail sales rose 1.2% in July, the third straight monthly increase but weaker than the 2% rise forecast by economists surveyed by MarketWatch. Excluding autos and gasoline, sales rose 1.5%, beating expectations for a 1.1% increase. June sales were revised higher. Meanwhile, analysts said the continued deadlock between congressional Democrats and the White House over a coronavirus aid package could be limiting upside for the market. Negotiations to extend measures, including $600 a week in additional unemployment benefits, that expired at the end of July have remained stalled since the end of last week. President Donald Trump last weekend signed executive orders that would partially extend some measures, but those face questions about their legality and logistics. “We have had recent good news on the jobs front and retail sales in July are up from a year ago. But in the risk category is consumer confidence, which has been deteriorating in recent weeks with fear that a much needed fiscal support package may not happen,” said David Donabedian, chief investment officer of CIBC Private Wealth Management. “Income support from the government has been critical and there is a big risk to the economy and the stock market if it does not continue,” he said. Economists warned that the retail data indicated consumer spending had lost some steam, underlining fears of a further slowdown. The data “underscores that wary consumers have turned more cautious amid a virus resurgence and fading stimulus support,” said Lydia Boussour, senior economist at Oxford Economics. She said the data also matches up with a stall in the firm’s own recovery tracker, confirming that “consumers are likely to keep a tight rein on their spending until a medical solution to the pandemic is found.” But stocks edged to session lows after news reports that virtual talks between Chinese and American officials scheduled for the weekend had been postponed indefinitely. In other data, second-quarter productivity rose by 7.3%, while unit labor costs jumped 12.2%. Economists were looking for a 1.4% productivity rise and an 8.7% rise in costs. July industrial production saw a 3% rise, topping forecasts for an increase of 2.7%, though the index remains far below pre-pandemic levels. Capacity utilization last month rose to 70.6% from 68.5% in June, versus expectations for a reading of 70.5%. An initial reading on the University of Michigan's August consumer sentiment index came in at 72.8 compared with expectations for 72. “Consumers may be showing a degree of patience here, assuming that Congress will eventually come to an agreement on their differences and forge a deal on stimulus,” wrote Jefferies economists Thomas Simons and Aneta Markowska, in a note out after the report. “However, we doubt that most consumers were expecting to see the headlines that were out this week that suggested both sides were still hopelessly deadlocked, and that more negotiations were unlikely to occur before Sept. 8. We are skeptical that consumers will be patient for that long if they are dependent on unemployment benefits or desperately awaiting another $1,200 stimulus check.”Which companies were in focus? Epic Games, the maker of “Fortnite,” launched a legal battle with Apple Inc. AAPL, +1.74% and Google parent Alphabet Inc. GOOG, +1.97% GOOGL, +1.82%, accusing the tech giants of illegally exploiting a monopoly on app and in-app purchases. Shares of Applied Materials Inc. AMAT, +1.10% rose nearly 4% after the chip maker supplier late Thursday reported results and an outlook that topped Wall Street forecasts. DraftKings Inc. DKNG, -4.51% shares were off more than 6% after the company reported a wider-than-expected loss, though revenues topped Wall Street expectations. Pressure was also attributed to a Bloomberg report that the Internal Revenue Service will require fantasy sports companies to pay federal excise taxes on their entry fees. Shares of Hilton Worldwide Holdings Inc. HLT, -1.26% and Marriott International Inc. MAR, -0.96% rallied Friday, after a Jefferies analyst upgraded and raised his price target on both stocks. Charles Schwab Corp. SCHW, +1.29% said it had added 206,000 new brokerage accounts in July, bringing its total 14% higher than a year ago. Shares rose nearly 2%. How did other markets trade? In Asia Friday, China’s CSI 300 index 000300, +2.04% closed 1.5% higher, while Hong Kong’s Hang Seng Index HSI, -0.30% slipped 0.2% and Japan’s Nikkei 225 NIK, -0.11% gained 0.2%. In Europe, the Stoxx 600 Europe Index SXXP, +0.55% closed at 368.07, down 1.2%. The FTSE 100 UKX, +0.64% lost 1.6%, after a similar tumble in the previous session, to close at 6,090.04. The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% was off a little more than 1 basis point at 0.696% one day after hitting an eight-week high. Bond prices move inversely to yields. Gold prices GC00, +2.17% notched their first weekly decline in 10 weeks with gold for December delivery GCZ20, +2.17% down nearly 1.1%, to settle at $1,949.80 an ounce. Crude-oil prices US:CLU20 settled 0.5% lower in quiet trade, pressured by concerns over the outlook for demand, at $42.01 a barrel. The greenback continued its slide, with the ICE U.S. Dollar Index, DXY, -0.58% a gauge of the buck against a half-dozen major rivals, down 0.3% to 93.02."}]}