{"article": [{"url": "https://www.marketwatch.com/story/a-plug-in-hybrid-jeep-is-coming-check-out-the-wrangler-4xe-2020-09-14", "published": 1600060400.0, "headline": "A plug-in hybrid Jeep is coming. Check out the Wrangler 4xe", "body": "A plug-in hybrid (PHEV) Jeep?! Wait’ll you see the numbers. By our calculations, the most powerful production Wrangler ever 25 miles of pure electric range on a full charge PHEV is still 100% Wrangler We expect (and hope for) an under-$40,000 starting price Arrives in the U.S. in early 2021 As Jeep commits to questing toward a smarter and greener world, it makes perfect sense that a plug-in hybrid (PHEV) version of its midsize Wrangler SUV would come along. What’s more interesting, however, is learning that the 2021 Jeep Wrangler 4xe gasoline-electric hybrid has been on the books essentially since Day One. The initial planning for the current Wrangler (all-new as a 2018 model) included a PHEV version. In fact, Jeep says it plans to release “electrified” versions of all its vehicles in the next few years. The lead card in this new hand for Jeep is the Wrangler 4xe PHEV. The 4xe combines the near silence of plug-in-electric vehicle travel with the never-leave-you-stranded-as-long-as-you-can-get-to-a-gas-station confidence that a gasoline engine provides. Working together, this hybrid combination results in good power, strong fuel economy, and significantly fewer trips to the gas station if you can plug in to charge at home and/or work. As with all hybrids, other factors help keep the 4xe charged too, like the regenerative braking system, which captures the energy created as the Wrangler slows down and sends it to the battery pack.What is the 2021 Jeep Wrangler 4xe? Arriving early next year, the 5-passenger Wrangler 4xe is built on the 4-door Wrangler platform with space provided for a turbocharged 4-cylinder gasoline engine and 8-speed TorqueFlite automatic transmission, front and rear electric motors, and a massive battery pack to power the motors. The result is a Wrangler like no other, able to run in 2-wheel drive, 4-wheel-drive (4WD) high, 4WD low, and even 4WD Auto, and putting out a total of 375 horsepower at 5,250 rpm and 470 lb-ft of torque at 3,000 rpm. Learn more: Everything you need to know about plug-in hybrids The 2021 Jeep Wrangler 4xe comes in three trim levels — the basic Wrangler 4xe, the better-than-basic Wrangler Sahara, and the all-out off-road-ready Rubicon. All three share the same 4xe PHEV drivetrain, but different suspension setups. Also, the base 4xe and Sahara trims get 20-inch wheels, while the Rubicon uses 17-inchers, higher-profile tires, and a more robust 4×4 setup.How does the Wrangler 4xe work? If you’re looking for performance in your SUV, the new Wrangler 4xe will seduce both your practical commuter side and your enthusiast side before you even get it off-road. The Wrangler 4xe’s driver-selectable E Selec choices each contribute. E Selec’s default mode is “Hybrid.” This brings the 4xe’s gasoline engine and the electric motors into play. Set to Hybrid mode, Jeep says the Wrangler 4xe can sprint (not a term often heard when describing acceleration from a 5,000-pound SUV) to 60 mph in 6.0 seconds. You’ll also enjoy a 400-mile driving range with a full tank of gas and a full charge. On electric power alone — with E Selec in “Electric” mode — the 4xe boasts a range of 25 miles before the 2.0-liter engine kicks in to help. That’s excellent range for a plug-in SUV. Check out: A first look at Toyota’s new RAV4 plug-in hybrid E Selec’s third mode, “eSave,” relies mainly on the engine to keep the Wrangler 4xe moving and saves the battery charge for later use. More significant, however, is the “Battery Charge” choice on eSave mode’s menu. This feature allows an empty battery pack to become fully charged by the engine in about 2½ hours while traveling at about 55 mph.Is the Wrangler 4xe just as off-road awesome as the non-PHEV Jeep Wrangler? Without a doubt, the new Jeep Wrangler 4xe is still an all-pro Wrangler, it’s just got an electric charge port as well as a gas tank. It’s also got all of its Trail Rated SUV chops, generous approach and departure angles, rugged skidplates, and a 30-inch water-fording depth. Selec-Speed Control with Hill-Ascent and -Descent Control comes standard. Plus, there’s an added advantage to the linear, right-now response of an electric car, both on-road and off. You might like: Which is better, the Ford Bronco or the Land Rover Defender? Maximum towing capacity is 3,500 pounds. The 400-volt, 17-kWh lithium-ion battery pack nests cleanly under the second row with no compromise in the generous ground clearance, although some cargo capacity is lost. But there are still plenty of Easter eggs to be found.Why should you consider the Jeep Wrangler 4xe? If you’re shopping for a Jeep Wrangler, you owe it to yourself to look at a Wrangler 4xe. Not just because of the iconic Wrangler stance or the Electric Blue exterior accents (including the front and rear tow hooks) and Electric Blue 4xe graphics. That exclusive Electric Blue interior stitching looks great too, along with the Uconnect touch screen that displays infotainment as well as dedicated Wrangler 4xe screens to monitor power flow, regen braking, and scheduling of charge times. What you owe yourself is the consideration of owning the most powerful production Wrangler that Jeep has ever built, while simultaneously enjoying the plug-in hybrid electric advantages of the 4xe.How much is the Wrangler 4xe? We expect 2021 Jeep Wrangler 4xe pricing to start at just under $40,000. Also see: These 3 EVs are the lowest cost to own over 5 years This story originally ran on Autotrader.com."}]}