{"article": [{"url": "https://www.marketwatch.com/story/why-gold-has-become-a-weapon-of-choice-for-investors-2020-07-08", "published": 1594486580.0, "headline": "Why gold has become a â\u0080\u0098weapon of choiceâ\u0080\u0099 for investors", "body": "Gold prices have climbed to their highest levels in nearly nine years, with the precious metal seen as a â\u0080\u0098weapon of choiceâ\u0080\u0099 for gold investors dealing with pandemic-related uncertainty in the stock market, clearing the path to a fresh record in the second half of the year. In Wednesday trading, the most-active August gold futures contract US:GCQ20 Â was up $13.20, or 0.7%, at $1,823.10 an ounce after tapping a high of $1,829.80. Futures prices havenâ\u0080\u0099t traded or settled at levels this high since September 2011. The settlement record for most-active gold futures stands at $1,891.90 from Aug. 22, 2011, based on records going back to November 1984, according to Dow Jones Market Data. The record intraday level was seen at $1,923.70 an ounce on Sept. 6, 2011. Gold breezed through the $1,800 level and â\u0080\u009cseems to have recovered its mojo,â\u0080\u009d said Ross Norman, chief executive officer of precious metals news and information provider Metals Daily. Bulls will also be â\u0080\u009cmuch encouraged that silver is performing at last.â\u0080\u009d September silver US:SIU20 Â was up 44.1 cents, or 2.4%, at $19.14 an ounce in Wednesday dealings. Itâ\u0080\u0099s poised for the highest most-active contract settlement since September 2019. Norman told MarketWatch that gold is â\u0080\u009cneither responding to either the U.S. dollar nor the virus, but the second quarter economic impact,â\u0080\u009d with massive M2 money [supply] growth leading to concerns about future inflation, debt and negative real yield on U.S. Treasurys. M2 is a key measure for U.S. money supply. “ â\u0080\u0098The weapon of choice has clearly been the gold ETF and purchases year to date have exceeded anything seen in any previous full year.â\u0080\u0099 ” â\u0080\u0094 Ross Norman, Metals Daily To gain exposure to gold, â\u0080\u009cthe weapon of choice has clearly been the gold ETF and purchases year to date have exceeded anything seen in any previous full year,â\u0080\u009d said Norman. The World Gold Council said that global net inflows for gold-backed exchange-traded funds reached $39.5 billion, topping the previous annual inflow record of $23 billion from 2016, according to a report issued Tuesday. North American funds accounted for 80% of the global net inflows in June, adding $4.6 billion in assets under management. â\u0080\u009cGold ETF investment demand shattered numerous records this year as investors sought safety from the economic turmoil created by COVID-19,â\u0080\u009d Juan Carlos Artigas, head of research at the World Gold Council, said in a statement. Gold ETF investment demand is likely to continue its â\u0080\u009cstrong momentumâ\u0080\u009d in the second half of the year as concerns over the economic impact of COVID-19 and infection rates of the virus linger, he added. Year to date, most-active gold futures trade higher by nearly 19%. Ed Moy, who was director of the U.S. Mint from 2006 to 2011, during the financial crisis, said that many of the same factors that lifted gold from around $600 in 2006 to $1,900 in 2011 are leading the current rise in gold prices. Thereâ\u0080\u0099s a â\u0080\u009chuge amount of monetary and fiscal stimulus without a clear path to unwind and an uncertain and choppy path to recovery from an unprecedented economic crisis,â\u0080\u009d Moy, who is currently chief strategist at gold retailer Valaurum, told MarketWatch. â\u0080\u009cThis has caused a flight to safety and fear of inflation, which has benefitted gold.â\u0080\u009d Still, there are some differences between today and the 2006 to 2011 period of the Great Recession. Among those, â\u0080\u009cthe amount of both monetary and fiscal stimulus is, and will be, greater in magnitude and done in a shorter time period,â\u0080\u009d said Moy. â\u0080\u009cDomestic protests, riots and unrest, and the upcoming presidential election cast uncertainty over the traditional view of the U.S. being an island of stability during an economic storm.â\u0080\u009d The pandemic, meanwhile, has â\u0080\u009ccaused government mints who produce precious metal bullion coins to partially or fully shut down production on a periodic basis due to COVID infections in their manufacturing plants,â\u0080\u009d disrupting normal supply chains to the mints, he said. Gold prices may still see some downward pressure from profit takers, warned Moy, but fundamentals indicate that higher gold prices ahead. â\u0080\u009cWe have a long uncertain road ahead to recovery and that will be gold for gold prices.â\u0080\u009d As for how high prices may go, Norman said his forecast issued to the London Bullion Market Association in December 2019 still stands, calling for a 2020 high of $2,080 an ounce for gold."}]}