{"article": [{"url": "https://www.marketwatch.com/story/gold-rises-toward-fresh-record-high-knocks-on-the-door-of-2100-2020-08-05", "published": 1596638480.0, "headline": "Gold logs fresh record high near $2,050", "body": "Gold prices ended sharply higher Wednesday, extending a record run for the precious metal that has helped it log gains for four straight days and eclipse a historical milestone above $2,000. The yellow metal has soared over 34% in 2020, surpassing the year-to-date 22.5% rally in the Nasdaq Composite Index COMP, +1.39%, composed of highflying technology stocks that has led to the overall equity market rally. Gains for gold Wednesday helped it notch its seventh record close in eight sessions, representing the most record closes over such a span since April of 2011, according to Dow Jones Market Data. Bullion’s buoyancy has been supported by central-bank monetary easing during the COVID-19 pandemic that has led to superlow interest rates in the U.S. and subzero rates in parts of the developed world that have helped to stoke appetite for gold which doesn’t offer a coupon. A drop in yields for the U.S. Treasury 10-year note TMUBMUSD10Y, 0.777% and recent weakness in the U.S. dollar DXY, -0.58% also has buoyed the commodity, which is priced in the currency. A softer dollar makes gold comparatively less expensive to overseas buyers. A weaker-than-expected reading in private-sector payrolls from Automatic Data Processing Inc. ADP, +1.93% didn’t deflate the rally for gold. ADP said only 167,000 private sector jobs were created in July, far short of the consensus estimate for a gain of 1.88 million jobs, according to Econoday. The report comes ahead of the more closely followed Friday jobs number. “US July private ADP jobs numbers suggest continuation of bullish sentiment till Friday’s US nonfarm payrolls. US dollar index continues to sink,” wrote Chintan Karnani, chief market analyst at Insignia Consultants. On Wednesday December gold GCZ20, +2.17% GC00, +2.17% rose $34.70, or 1.4%, at $2,049.30 an ounce, after a similar surge on Tuesday. Gold prices have gained already about 3.3% so far this week. “The consensus remains that gold prices are likely to continue to move higher, with new record highs likely to be set on an ongoing basis against the US dollar over the coming weeks,” wrote Michael Hewson, chief market analyst at CMC Markets, in a Wednesday research note. September silver US:SIU20, meanwhile, gained 86.2 cents, or 3.3%, at $26.890 an ounce after the commodity rose 6.6% a day ago. In other Comex metals, September copper US:HGU20 picked up 2.25 cents, or 0.8%, higher at $2.917 a pound. October platinum PLV20, +3.99% traded $33.90, or 3.5%, higher to settle at $989.10 an ounce, while September palladium US:PAU20 gained $44.90, or 2.1%, to end at $2,215.50 an ounce."}]}