{"article": [{"url": "https://www.marketwatch.com/story/biden-lays-a-trap-for-trump-in-picking-harris-2020-08-11", "published": 1597250300.0, "headline": "Biden lays a trap for Trump by picking Harris", "body": "After months of speculation, Kamala Harris, the 55-year-old junior senator from California, is Joe Biden’s pick for vice president. She’s the first black woman to be on the ticket of a major U.S. political party, and if current polls — notably in key swing states — hold up, she will early next year become the 49th vice president of the United States. “ in the 2018 midterms, women voted for Democratic congressional candidates by a stunning margin of 59% to 40%. ” This is the moment the Trump campaign has been waiting for. In recent months, it has compiled dossiers on everyone Biden was considering. Now get ready for a ton of opposition research — “oppo” — to be dropped onto the media in an effort to undermine Harris. Which, in turn, is exactly what the Biden camp has not only been expecting, but hoping for. You know why? Because most American women detest Donald Trump, and most women of color really, really detest him. The more Trump and his minions unload on a woman, and a black one at that, the more it plays into Biden’s hands. In fact, it took only an hour for Trump to do just that, calling Harris “nasty” and “dishonest” during a White House briefing. Read:Why Biden’s pick of Harris for vice president won’t make or break the 2020 election In the Nov. 9, 1992, issue of New York magazine, Trump described his views toward women. “You have to treat ’em like shit,” he was quoted as having said. A lifetime of sleazy, condescending behavior proves it. Why do you think Biden said early on that he would be selecting a woman to be his running mate? The data behind his thinking are mesmerizing. Going back to 1980, men have tended to gravitate toward Republicans, and women toward Democrats. But there are two key differences: First, there are a lot more women in America. They are 54% of the electorate, an eight-point advantage. Second, in proportional terms, a bigger percentage of that 54% turns out to vote than of the smaller 46% of men. So in both absolute and relative terms, this is a double advantage for Democrats. In 1994, notes Pew Research, more women identified with Democrats than Republicans by a six-point margin (48% to 42%). By 2017, that margin had tripled: 56% to 37%. Those advantages help explain why Democrats won the popular vote in six of the past seven presidential elections — 1992, 1996, 2000, 2008, 2012 and 2016 — while Republicans won just once, in 2004. And even then, the winner, George W. Bush, got 50.7%, not exactly an overwhelming margin. Much to the detriment of Republicans, this gap is accelerating. Women preferred Barack Obama over Mitt Romney by 11 percentage points (55% to 44%) in 2012. In 2016, Hillary Clinton beat Donald Trump by 13 points (54% to 41%), and, in the 2018 midterms, women backed Democratic congressional candidates by a stunning 19 percentage points (59% to 40%). That’s why Nancy Pelosi, and not California Republican Kevin McCarthy, is speaker of the house, and it’s why Trump was impeached earlier this year. Trump’s name wasn’t on the ballot in the midterms, but they were clearly a referendum on him. Now that his name will be on the ballot, things look even worse. With three months to go, just 38% of registered female voters say (in a Hill-HarrisX survey) that they are likely to support Trump in November. Meanwhile, Trump’s base — which generally skews older, white, male, rural and lesser educated — continues to shrink. Simply put: There probably aren’t enough older white men with only high-school diplomas living in rural America to make up for the flood of women who can’t wait to reject the president. See:‘This is what these institutions were really built for’: Kamala Harris graduated from a historically black college Harris has been in the Senate only three years. Before that, she was California’s attorney general and the district attorney for San Francisco. That’s a 16-year track record, and it’s fair game for Trump and Republicans to pick over. But knowing the president, he’ll find some way to cross the line and go too far. That’s what he does. Either a dumb tweet, or some off-the-cuff remark, either from him or someone else. Something that will drive even more women away. Biden, hardly immune to gaffes himself, is counting on this. Finally, there is this. Being No. 2 on the ticket is not the ultimate glass ceiling that Hillary Clinton was sure — too sure — that she would shatter four years ago. But as the cliché goes, it’s a heartbeat away. This is all the more important given that Biden, if victorious, would become president at age 78, the oldest first-term president in American history. If you believe, as I do, that he would serve just one term in office, the ascension of Kamala Harris puts her in a prime position to be elected the first female president in American history four years from now. Read on:Kamala Harris is Biden’s running mate — here’s what she means (and doesn’t mean) for financial markets Plus:Kamala Harris is a friend, not a foe, of Big Tech"}]}