{"article": [{"url": "https://www.marketwatch.com/story/us-stocks-set-to-struggle-for-altitude-after-biggest-loss-in-2-weeks-amid-a-jam-packed-day-of-economic-reports-and-bank-stress-tests-2020-06-25", "published": 1593103400.0, "headline": "Dow logs a 300-point gain as banks rally ahead of stress-test results, but rise in coronavirus cases remains a worry", "body": "U.S. stocks closed solidly higher Thursday, recovering a chunk of Wednesday’s ugly loss, ahead of a key update of the banking sector from the Federal Reserve. Investors have been struggling to balance the reality of the rise in the daily rate of new coronavirus cases against a marginal improvement in economic data and a rollback of red tape by U.S. financial regulators. How are the benchmarks performing? The Dow Jones Industrial Average DJIA, +0.56% advanced 299.66 points, 1.2%, to close at 25,745.60, in turbulent trading, while the S&P 500 index SPX, +0.87% closed 33.43 points, or 1.1%, higher at 3,083,76. The Nasdaq Composite Index COMP, +1.39% was 107.84 points, or 1.1%, at 10,017. What’s driving the market? The stock market struggled to find its footing Thursday, after the biggest sell off in two weeks on Wednesday, but ultimately gained ground in the final half-hour of trade helped by financial sector stocks which have lagged in the rebound from the market lows seen in late March. Combined with a late-session resurgence in technology names, ten of the S&P 500’s 11 sectors finished higher, with the exception of the utility sector, which closed down 1.2%. Markets got a boost after the Federal Deposit Insurance Commission and Office of the Comptroller of the Currency said they are planning to loosen the restrictions imposed by the Volcker rule and allow banks to more easily make large investments into venture capital and similar funds. They will also be able avoid setting aside cash for derivatives trades between different affiliates of the same firm, potentially freeing up billions of dollars in capital for the industry, according to the Wall Street Journal. Shares of major banks, including JPMorgan Chase & Co. JPM, -0.57%, Citigroup C, +0.47% Goldman Sachs GS, -0.21% and Morgan Stanley MS, -0.34%, all finished sharply higher after the reports. The regulator update came ahead of the results of the Federal Reserve’s annual “stress test” of the banking system is expected to be released after Thursday’s close. The Federal Reserve earlier said banks entered the coronavirus crisis in a strong position, but analysts believe that the length of the pandemic could erode the balance sheets of some institutions as credit losses mount. The Fed will release the results of its bank stress tests later Thursday but has asked banks to refrain from disclosing the results publicly until after the market closes on June 29. Investors spent much of the day parsing slowly improving economic data against news of surging numbers of COVID-19 cases in some U.S. states. In the week ended June 20, Americans filed 1.48 million new jobless claims, fewer than in the previous week and continuing claims, a measure that tracks the overall pool of benefit recipients, declined by more than forecast to 19.5 million in the week ended June 13. In the third and final reading of first-quarter U.S. gross domestic product, the official scorecard of the health of the U.S. economy, the government confirmed that the economy contracted at an annualized pace of 5%. And a report on orders for long-lasting, or durable, goods, showed they rose 15.8% in May. On Wednesday stocks sold off sharply when the U.S. recorded a one-day total of 34,700 newly confirmed COVID-19 cases, the highest level since late April, the Associated Press reported, using data compiled by Johns Hopkins University. And on Thursday Texas announced that it was freezing its plan to allow businesses to reopen as more than 20 million people in the U.S. may have been infected, according to the Centers for Disease Control and Prevention. Apple AAPL, +1.74% also announced it was closing more stores after announcing the temporary closure of seven stores in Houston pon Wednesday. In a virtual panel Thursday, Dallas Fed President Robert Kaplan said the economic recovery will depend on Americans wearing masks. Kaplan is a voting members of the Federal Open Market Committee this year. “We’re throwing trillions of dollars at getting the economy supported and restarted,” said Chris O’Keefe, managing director at Newtown Square, Pa-based Logan Capital Management. “But that can’t solve the health issue. It always comes back to that, and the psyche out there is very much concerned about it.” In an interview Thursday, O’Keefe told MarketWatch, “I do think the market got ahead of itself, for sure.” In particular, O’Keefe says he’s watching “some of the growthy names like Amazon AMZN, +3.01% and Facebook FB, +0.26%, ” that may be attracting some bubblelike speculation on the belief that they are pandemic-proof. Meanwhile, in news that could impact Sino-American trade tensions, the Senate on Thursday passed a bill that would sanction Chinese officials and businesses that violate Hong Kong’s independence. The bipartisan bill now goes to the House of Representatives, where a companion bill has been introduced. See: Here’s why stock-market distress over spiking coronavirus cases is intensifyingWhich stocks are in focus? Darden Restaurants DRI, -1.34% the operator of Olive Garden and LongHorn Steakhouse, said Q1 sales were 70% of year-ago sales, just missing analyst expectations, but also said that 91% of its restaurants were open with some capacity as of June 22. Q1 sales of $1.27 billion just edged analyst expectations of $1.26 billion. Shares jumped 5.3% in early trade. Shares of Macy’s Inc. M, -0.95% closed down 4.1% after the retailer said it would cut 3,900 managerial positions and take a $180 million restructuring charge. Rite Aid Corp. RAD, -2.04% reported a narrower-than expected first-quarter loss ahead of the bell, and shares shot up by nearly 27%. Shares of Moderna Inc. MRNA, +0.09% lost 4.4% lower after it said it had set up a manufacturing deal for a hoped-for coronavirus vaccine. Nike Inc. NKE, +0.97% is set to report results after the close of trade Thursday. Its stock closed up 1.3%. Walt Disney Co. shares DIS, +1.53% fell 0.6% after the entertainment and theme park giant said it was delaying the reopening of its California theme parks, including Disneyland, which had been scheduled to start reopening July 17. Shares of Ekso Bionics Holdings Inc. EKSO, +0.79% soared 135% Thursday, after the company said it has received 501 clearance from the U.S. Food and Drug Administration to market its EksoNR robotic exoskeleton for use in patients with acquired brain injury. How are other assets performing? West Texas Intermediate U.S. crude US:CLQ20 reversed early losses to gain 71 cents, or 1.9%, to settle at $38.72 a barrel on the New York Mercantile Exchange despite demand concerns. In precious metals, gold futures settled lower, with the August contact US:GCM20 fell $4.50, or nearly 0.3%, to end at $1,770.60 an ounce. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 0.9 basis point to 0.674%, near its lowest in two weeks, as inflows into safe-haven assets continue. Bond prices move inversely to yields. The greenback was up 0.2% against a basket of its major rivals to 97.40, based on trading in the ICE U.S. Dollar Index DXY, -0.58% In global equities, the Stoxx Europe 600 index SXXP, +0.55% closed 0.7% higher, while the FTSE 100 Index UKX, +0.64% finished up 0.4%. In Asian markets, the Japanese Nikkei NIK, -0.11% closed down 1.2%, and Hong Kong’s Hang Seng HSI, -0.30% lost 0.5%. Related:The ‘work-from-home’ ETF is here. Get ready for some surprises."}]}