{"article": [{"url": "https://www.marketwatch.com/story/gold-climbs-for-the-day-and-week-as-us-dollar-slips-2020-06-19", "published": 1592576360.0, "headline": "Gold ends higher to tally a second straight weekly gain", "body": "Gold futures ended higher on Friday, building a gain for the week, with haven demand for the precious metal getting a boost as investors grew wary of the rise in COVID-19 cases in China and the U.S., even as stock benchmarks gain for the week. Gold concluded the week on a positive note as “rising coronavirus cases in China and the United States accelerate the flight to safety,” said Lukman Otunuga, senior research analyst at FXTM. “There is a thick smog of caution in the air with investors on high alert amid the COVID-19 developments [and] global sentiment still fragile despite equity markets edging higher,” he told MarketWatch. “Expect gold to shine through the smog and smoke over the coming weeks if risk aversion becomes a dominant market theme.” Still, “an unyielding U.S. dollar” may serve to cap gains for gold, said Otunuga. A stronger dollar can draw investors away from the metals, which is priced in dollars. In Friday dealings, the benchmark ICE U.S. Dollar Index DXY, -0.58% was up 0.2%, poised for a weekly rise of 0.3%. On Comex, August gold US:GCQ20 gained $21.90, or 1.3%, to settle at $1,753 an ounce, the highest finish for a most-active contract since mid-May, according to FactSet data. Prices ended around 0.9% higher for the week. July silver US:SIN20 also ended higher, up 34 cents, or 1.9%, at $17.847 an ounce, with prices posting a weekly rise of roughly 2.1%. In a research note dated Friday, Goldman Sachs raised its 12-month gold forecast by 11% to $2,000 an ounce citing low real interest rates and concerns over currency debasement. Peter Spina, president and chief executive officer at GoldSeek.com, referred to the forecast as a “strong promotion from Goldman Sachs,” following sideways trading for gold in the last couple of months. The metal is “looking to make a resolution to this consolidation soon,” priming for its next run higher and $1,900 to $2,000 becomes the next upside target,” Spina told MarketWatch. “The global central banks all have tool boxes of monetary debasement which is making gold increasingly more and more interesting as a low-risk store of value. Gold is returning to its historical role of preserving wealth.” The move for precious metals come even as stocks, which tend to move in the opposite direction of gold, moved up for the week. The Dow Jones Industrial Average DJIA, +0.56% and the S&P 500 index SPX, +0.87% were down in Friday dealings as gold futures settled, but stayed on track for weekly gains. Rounding out action among Comex metals, July copper US:HGN20 gained 0.9%, at $2.611 a pound—ending 0.4% higher for the week. July platinum US:PLN20 rose 1.9% to $827.30 an ounce, contributing to a weekly rise of 1%. September palladium US:PAU20 settled at $1,908.40 an ounce, down 20 cents for the session—to lose about 1.6% for the week."}]}