{"article": [{"url": "https://www.marketwatch.com/story/cooped-up-millennial-traders-have-sparked-a-new-pandemic-it-wont-end-well-warns-princeton-economist-2020-06-17", "published": 1592655920.0, "headline": "â\u0080\u0098Cooped-upâ\u0080\u0099 millennial traders have sparked a new pandemic â\u0080\u0094 it wonâ\u0080\u0099t end well, warns Princeton economist", "body": "“ â\u0080\u0098Donâ\u0080\u0099t confuse day traders with serious investors. Serious investing involves broad diversification, rebalancing, active tax management, avoiding market timing, staying the course, and the use of investment instruments such as ETFs with very low fees... Donâ\u0080\u0099t be misled with false claims of easy profits from day trading.â\u0080\u0099 ” Thatâ\u0080\u0099s Burton G. Malkiel, Princeton economist and Wealthfrontâ\u0080\u0099s Chief Investment Officer, sharing his thoughts Wednesday on what he describes as â\u0080\u009cthe day-trading pandemic.â\u0080\u009d Malkiel, who wrote the widely read investment book, â\u0080\u009cA Random Walk Down Wall Street,â\u0080\u009d blamed a sudden surge of inexperienced traders on the new reality facing the younger generation. â\u0080\u009cThe coronavirus has wrought devastating harm to the health of our nation and to the vibrancy of our economy,â\u0080\u009d he wrote. â\u0080\u009cWith respect to financial markets, it has also given rise to a full-blown mania. Individuals, cooped up at home, working remotely on flexible schedules, with no social activities and no live sports to watch and bet on, have increasingly turned to day trading in the stock market.â\u0080\u009d Malkiel explained that millennials and members of Gen Z, lured in by low-cost fintech firms like Robinhood, have led to the extreme volatility in stock prices. He cited two of the most popular stocks on Robinhoodâ\u0080\u0099s trading platform as examples of the kind of risk that these traders are fine with taking: FANGDD Network Group DUO, Â , a Chinese online real-estate company, and Hertz HTZ, -1.78% Â , the bankrupt rental-car giant. Both have been all over the map. Billionaire Leon Cooperman agrees with Malkielâ\u0080\u0099s stance. The â\u0080\u009cRobinhood markets are going to end in tears,â\u0080\u009d he said during CNBCâ\u0080\u0099s show â\u0080\u009cHalftime Reportâ\u0080\u009d on Monday. Lately, mom-and-pop investors have outperformed pros like Cooperman and mutual funds, according to a research report from Goldman Sachs GS, -0.21% Â . But how long can that last? Malkiel cited several longer-range studies that show how poorly these active traders tend to do in the stock market. One from the University of California showed that individual traders on the Charles Schwab trading platform substantially underperformed the market over a six-year period. In fact, the more they traded during the period, the more they lagged the index funds. A more recent study out of Brazil showed that only 3% of day traders actually managed to turn a profit, and less than 1% made more than the Brazilian minimum wage. Read: Trader commits suicide after racking up more than $700,000 in debt â\u0080\u009cI have no argument with those who like to gamble,â\u0080\u009d Malkiel wrote. â\u0080\u009cBut legions of new day traders have poured new money into stocks without a care for the risks involved, clearly unaware of Buffettâ\u0080\u0099s maxim that â\u0080\u0098Itâ\u0080\u0099s only when the tide goes out that you learn whoâ\u0080\u0099s been swimming naked.â\u0080\u0099â\u0080\u009d At last check in Thursdayâ\u0080\u0099s trading session, stocks were struggling for direction, with the Dow Jones Industrial Average DJIA, +0.56% Â , S&P 500 SPX, +0.87% and tech-heavy Nasdaq Composite COMP, +1.39% all inching just slight higher."}]}