{"article": [{"url": "https://www.marketwatch.com/story/big-ten-to-cancel-2020-college-football-season-will-sec-acc-pac-12-and-big-12-be-next-2020-08-10", "published": 1597236080.0, "headline": "Big 12 conference says it will play 2020 college football season", "body": "The Big 12 will attempt to play fall sports in 2020, the conference announced on Wednesday. The Big Ten and Pac-12 conferences have voted to postpone their 2020 fall seasons, which include football. The conferences announced the decision on Tuesday that all fall sports in 2020 will be postponed amid the coronavirus pandemic. Both conferences will attempt to play football in the spring. iframe.twitter-tweet { width: 100% !important; } “The virus continues to evolve and medical professionals are learning more with each passing week,” said Big 12 Commissioner Bob Bowlsby. “Opinions vary regarding the best path forward, as we’ve seen throughout higher education and our society overall, but we are comfortable in our institutions’ ability to provide a structured training environment, rigorous testing and surveillance, hospital quality sanitation and mitigation practices that optimize the health and safety of our student-athletes.” iframe.twitter-tweet { width: 100% !important; } “Our primary responsibility is to make the best possible decisions in the interest of our students, faculty and staff,” said Morton Schapiro, Chair of the Big Ten Council of Presidents and Northwestern University President. “The mental and physical health and welfare of our student-athletes has been at the center of every decision we have made regarding the ability to proceed forward,” said Big Ten Commissioner Kevin Warren. “As time progressed and after hours of discussion with our Big Ten Task Force for Emerging Infectious Diseases and the Big Ten Sports Medicine Committee, it became abundantly clear that there was too much uncertainty regarding potential medical risks to allow our student-athletes to compete this fall. NBC’s Dan Patrick said on his radio show that the Big Ten universities voted 12-2 to cancel the upcoming football season. Iowa and Nebraska voted against canceling the season. The remaining power-five conferences in the NCAA — the SEC, and ACC — have not made any announcements on the status of their 2020 football season. iframe.twitter-tweet { width: 100% !important; } Many college football players have voiced their opinions on wanting to play the 2020 season, with many of them tweeting using the #WeWantToPlay hashtag on Twitter TWTR, -0.23%. President Donald Trump has urged for college football to play its season as well. University of Michigan head football coach Jim Harbaugh released a statement in the aftermath of the reports saying he thinks the conference should play the 2020 season. Michigan is part of the Big Ten conference. iframe.twitter-tweet { width: 100% !important; } The news comes after the cancellation of fall 2020 championships for both Division II and Division III. The NCAA Board of Governors on Wednesday directed each division of the NCAA to decide independently by Aug. 21 whether it will be able to conduct championship events safely in fall sports such as soccer, volleyball and lower levels of football during the pandemic. See also: Dwayne ‘The Rock’ Johnson buys XFL for $15 million If more college football conferences decide to cancel the 2020 season, gaming stocks could take a hit. Football, which includes both college and professional football, is by far the most bet on sport in the U.S., according to a 2017 Statista survey. Sports-gambling stocks like Draftkings Inc. DKNG, -4.51%, Penn National Gaming Inc. PENN, -1.50% and William Hill PLC WIMHY, -0.62% fell during Monday’s trading, but have rebounded on Tuesday."}]}