{"article": [{"url": "https://www.marketwatch.com/story/consumer-confidence-jumps-to-3-month-high-but-still-well-below-precrisis-levels-2020-06-30", "published": 1593528200.0, "headline": "Consumer confidence jumps to 3-month high, but still well below precrisis levels", "body": "The numbers: Consumer confidence rose in June to a three-month high as a reopening economy buoyed the spirits of Americans, but a recent spike in coronavirus cases could dampen any optimism unless it’s brought under control soon. The index of consumer confidence rose to 98.1 this month from a revised 85.9 in May, the Conference Board said Tuesday. Economists polled by MarketWatch expected a reading of 90.8 in June. One potentially big caveat: The cutoff date for the survey was June 18, shortly before states such as Texas and Arizona reimposed new restrictions after a fresh outbreak of COVID-19 cases. The level of confidence is also well below precrisis levels after steep declines in March and April. The index had stood near a 20-year high at 132.6 in February before the pandemic shut down swaths of the economy. It fell to as low as 85.7 in April. Read:Fear of the coronavirus did more to keep people at home than lockdowns, study says What happened: An index that gauges how consumers feel about the economy right now rose to 86.2 from 68.4 in May. Another gauge that assesses how Americans view the next six months — the so-called future expectations index —climbed to 106 from 97.6, just slightly below where it was before the virus spread. The increase suggests consumers believe the virus will be less of a problem by the end of the year. The share of Americans who said jobs were plentiful climbed to 20.8% from 16.5%. The percentage who said jobs were hard to find dropped to 23.8% from 29.2%. Big picture: The rebound in consumer confidence signals that a rebound is under way after what might turn out to be the shortest but deepest recession in American history. Yet the persistence of the virus points to a choppy recovery and a prolonged period of high unemployment. What they are saying? “Consumer confidence partially rebounded in June but remains well below pre-pandemic levels,” said Lynn Franco, senior director of economic indicators at the board. “Faced with an uncertain and uneven path to recovery, and a potential COVID-19 resurgence, it’s too soon to say that consumers have turned the corner and are ready to begin spending at pre-pandemic levels.” “Consumer confidence improved more than expected in June, but the survey may not have picked up much of the impact from rising Covid-19 case counts on sentiment in the latter half of the month,” said economist Andrew Grantham of CIBC Economics. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% fell in early Tuesday trades while the S&P 500 index SPX, +0.87% and Nasdaq NASD, +1.20% advanced. Stocks were little changed after the report."}]}