{"article": [{"url": "https://www.marketwatch.com/story/new-home-sales-surge-in-june-and-are-now-above-previous-cycle-high-hit-at-start-of-2020-2020-07-24", "published": 1595588720.0, "headline": "New U.S. home sales surge in June to strongest rate in 13 years", "body": "The numbers: Sales of new single-family homes rose sharply for the second straight month in June, pushing the sales rate to its highest level in 13 years, according to data released Friday. The annual sales pace for U.S. new-home sales rose 13.8% last month to 776,000, the Commerce Department said Friday. That’s above the prior cycle high of 774,000 hit in January and is the strongest since July 2007, according to the Mortgage Bankers Association. Economists polled by MarketWatch had expected a June sales rate of 710,000, compared with an original May estimate of 676,000. On Friday, the government revised May’s rate to 682,000. That pushed the May rise in new home sales to 19.4% What happened: Sales rose in all four regions, with the largest gain of 89.7% coming in the Northeast. June’s sales pace is 6.9% above a year earlier. The median price of new homes was $329,200 in June. That is 5.6% above the price one year ago. There were 307,000 new homes estimated to be up for sale, which equates to a tight 4.7-month supply. A 6-month supply of homes is generally considered to be indicative of a balanced market. Big picture: Only last month, one economist said it might take two years for new home sales to rise above January’s level. Housing is leading the recovery fueled by low mortgage interest rates. Some analysts also see an boost from workers deciding to move to the suburbs now that they can work from home. Mortgage applications for home purchases hit 11-year highs earlier this month. Still, the spread of the coronavirus in July adds some downside risk to the sector. What are they saying? “The impact of falling mortgage rates - down 80 basis points this year - is more than offsetting the wave of Covid-induced job losses, which seem to be hitting younger renters rather than would-be homebuyers; the median buyer is 47 years of age, while the median restaurant employee is 29,” said Ian Shepherdson, chief economist at Pantheon Macroeconomics. Market reaction: Stocks opened lower Friday on renewed tension between the Trump administration and China. The Dow Jones Industrial Average DJIA, +0.56% was down about 60 points in early trading, off earlier lows."}]}