{"article": [{"url": "https://www.marketwatch.com/story/the-back-to-school-shopping-season-will-be-a-dud-one-analyst-says-but-the-nrf-is-forecasting-a-record-breaker-2020-07-15", "published": 1595060660.0, "headline": "The back-to-school shopping season will be a â\u0080\u0098dudâ\u0080\u0099 one analyst says, but the NRF is forecasting a record breaker", "body": "One analyst is forecasting a back-to-school bust this year, as uncertainty around whether COVID-19 will prevent students from going to class suppresses sales during the second largest shopping season of the year. Colleges and school districts are slowly announcing their plans for the new semester, with some offering classes in person, and others offering e-learning from home or some combination of the two. Parents, unsure about what exactly the situation will be, are likely to hold off on the usual back-to-school shopping spree, experts and analysts say. â\u0080\u009cI am not sure what will ultimately happen, but Los Angeles and San Diego schools are virtual-only for the fall, and I suspect that many blue-state districts (in high population areas) will do the same, so back-to-school should be a dud,â\u0080\u009d said Michael Pachter, managing director at Wedbush. Read:Harvard and other elite schools say classes will be mostly remote this fall On the flip side, the National Retail Federation says back-to-school could be a blockbuster. Parents of children in elementary and high school plan to spend an average of $789.49 per family and college students and their families expect to spend $1,059.20, according to the groupâ\u0080\u0099s latest data. Both are record amounts. Total spending is expected to reach $101.6 billion, breaking the $100 billion mark for the first time. NRF attributes the record-breaking spending to purchasing computers and laptops. Nearly two-thirds (63%) of families with children in grades K-12 say they will buy a computer and 60% of college shoppers say theyâ\u0080\u0099ll buy one. The NRF annual survey also found that consumers had only completed 17% of their back-to-school shopping by early July. More than half (54%) said itâ\u0080\u0099s because they donâ\u0080\u0099t know what theyâ\u0080\u0099ll need. Wedbushâ\u0080\u0099s Pachter disagrees with the forecast. â\u0080\u009cWhile I agree that more kids are going to need PCs to continue with remote learning, I think it is likely that the uptick in demand from those households who donâ\u0080\u0099t have a PC will be offset by those households with one or more parents laid off or unemployed because of the pandemic, and I think the latter households will try to let the kids use existing equipment rather than buying new equipment,â\u0080\u009d he said. See:Colleges balance student safety with falling revenues during coronavirus â\u0080\u0093 hereâ\u0080\u0099s how universities will be transformed in the fall Moreover, he notes the spike in computer sales at the beginning of the pandemic as more people began working from home, â\u0080\u009cso there are a lot of households with brand new equipment.â\u0080\u009d Deloitte forecasts that back-to-spending will be flat year-over-year, with parents of children in grades K-12 spending about $529 per student, or a total of $28.1 billion. College shoppers are expected to spend about $1,345 per student, or a total of $25.4 billion for the category. Electronics spending, which has been trending upward over past years, is expected to grow 28% for K-12 kids. Rod Sides, the U.S. leader of the retail and distribution practice at Deloitte, notes that sales will not just be for gadgets and devices, but also any supplemental items and services, like videoconferencing, that will enhance the e-learning experience. Thereâ\u0080\u0099s also anxiety among parents that kids are falling behind in their studies and would suffer from a lack of interaction with peers and teachers in a distance learning situation. Thatâ\u0080\u0099s coupled with fears about sending kids back to school during a pandemic. Moreover, he echoed the concerns that shoppers likely have about their financial well-being. â\u0080\u009cThe most valuable things in most peopleâ\u0080\u0099s lives is family,â\u0080\u009d he said. More direction from those in authority could quell some of these fears, Sides said, with many asking themselves, â\u0080\u009cHow do I make sure Iâ\u0080\u0099m prepared in the absence of information?â\u0080\u009d With shoppers still deciding how best to spend their back-to-school budgets, experts are making predictions. Sides thinks big-box retailers like Walmart Inc. WMT, +1.00% Â and Target Corp. TGT, +1.14% Â , which heavily focus on the back-to-school season, could see a hiccup if sales of items like dorm room decorations slow. And:Shoppers will pay more for the same item online versus in stores under new COVID-19 conditions, experts say Brian Yarbrough, consumer discretionary analyst at Edward Jones, thinks any slowdown in back-to-school sales at Walmart and Target will be offset because theyâ\u0080\u0099re essential retailers. However, between the two, Target might be more vulnerable because the retailer relies less on food. â\u0080\u009cTheyâ\u0080\u0099re the only game open in town if there are more lockdowns,â\u0080\u009d he said. On the other hand, he says apparel retailers could be disappointed by a season where parents and college students are buying far less new clothing. There have already been a number of bankruptcies in the apparel retail space, including Brooks Brothers and J.Crew. And department stores like Macyâ\u0080\u0099s Inc. M, -0.95% Â and J.C. Penney Co. Inc. JCPNQ, -3.42% Â , which has also filed for bankruptcy and just announced 152 store closures, are restructuring to weather the pandemic. Also:Brooks Brothers files for bankruptcy as its take on office gear falls out of step with more casual trends Joel Rampoldt, managing director in the retail practice at AlixPartners, thinks impulse purchases of all stripes will suffer as shopping moves online and away from brick-and-mortar stores. â\u0080\u009cItâ\u0080\u0099s an impulse-heavy season,â\u0080\u009d he said. â\u0080\u009cThereâ\u0080\u0099s an awful lot of stuff that people didnâ\u0080\u0099t intend to buy that usually ends up in the basket.â\u0080\u009d Rampoldt suggests retailers focus locally, determining what the need is for the area around a store and meeting the demand. That may be more tech products, services or something else entirely. â\u0080\u009cEveryone wants to get their kids off on the best foot,â\u0080\u009d he said. â\u0080\u009cThatâ\u0080\u0099s why people spend money to get kids everything they need. That will collide with families under economic pressure.â\u0080\u009d On the bright side, if schools open later than usual, there could be an opportunity for retailers to sell all of the unsold back-to-school items further down the line. â\u0080\u009cUnlike apparel inventory, back-to-school products are not really subject to the whims of fashions or trends,â\u0080\u009d said Howard Meitener, managing director at Carl Marks Advisors, a middle-market investment bank and advisory firm. â\u0080\u009cStores that donâ\u0080\u0099t sell all their product this year can simply hold on to it until next year, or the new year if schools open back up in January. If that happens, it could help January sales which is a traditionally slow month.â\u0080\u009d And if computer sales increase, Wedbushâ\u0080\u0099s Pachter thinks there will be some sellers that benefit. â\u0080\u009c[T]o the extent that PC demand is up, I would expect to see online retailers capture more share than normal, so Amazon AMZN, +3.01% Â , Walmart.com and Dell DELL, -0.39% Â should see more growth than Best Buy BBY, +1.45% Â ,â\u0080\u009d he said. The SPDR S&P Retail ETF XRT, +0.05% Â has slipped 0.7% for the year to date while the S&P 500 index SPX, +0.87% Â is down 0.5% and the Dow Jones Industrial Average DJIA, +0.56% Â has fallen 6.3%."}]}