{"article": [{"url": "https://www.marketwatch.com/story/should-you-volunteer-for-a-covid-19-vaccine-trial-who-qualifies-and-what-are-the-side-effects-2020-08-03", "published": 1596892760.0, "headline": "Should you volunteer for a COVID-19 vaccine trial? Who qualifies, and what are the side effects?", "body": "This article is reprinted by permission from NextAvenue.org. When Karen Tibbals of Washington, N.J. heard that more than 100,000 volunteers would be needed for late-stage clinical trials of four COVID-19 vaccines, she wanted to roll up her sleeves and get one of the experimental shots. Tibbals is 65 and has the autoimmune disease rheumatoid arthritis, raising her risk of suffering severe complications of COVID-19. But she also brings a unique perspective to the race to develop a vaccine: Tibbals is a retired pharmaceutical marketing executive who saw the clinical trial process up close during stints at Novartis NVS, +0.97% and Merck. MRK, -0.14% Some of the coronavirus vaccines entail delivering bits of genetic material from the virus to prompt the body to launch an immune response — emerging technology that hasn’t been widely deployed before. But that doesn’t scare Tibbals. 80% of older Americans can't afford to retire - COVID-19 isn't helping ‘I have a chance of helping other people’ “This is really cool new technology; I trust it. I have a chance of helping other people,” Tibbals said, adding that she’s confident the companies will follow procedures for safe clinical trials. She has volunteered for the trials on the site for the COVID-19 Prevention Network (COVPN), an initiative of the National Institutes of Health’s National Institute of Allergy and Infectious Diseases. COVPN is managing the recruitment of volunteers for clinical trials of vaccines being developed by AstraZeneca AZN, +1.16% , Novavax NVAX, +0.18% , Moderna MRNA, +0.09% and the Johnson & Johnson JNJ, +1.39% unit Janssen. The Moderna trial began in July, with the other three trials starting between August and December. Maybe you’re interested in participating in a COVID-19 clinical trial, too. Here’s what you need to know: Each company will need about 30,000 volunteers for its trials, and more COVID-19 vaccine developers could be added if their products advance to late-stage clinical trials, said Michele Andrasik, a scientist in the vaccine and infectious disease unit at the Fred Hutchinson Cancer Research Center and one of the managers of community outreach for COVPN.Who the vaccine developers want COVID vaccine developers are particularly interested in recruiting clinical trial participants who are considered to be most vulnerable to COVID-19, Andrasik said. “People with pre-existing conditions are a priority population, as are adults over age 65,” she noted. African-Americans, Native Americans and Latinos also have a high chance of being admitted to a vaccine trial. So do people who are most likely to contract the disease because they work at health care facilities or in open workspaces, such as meatpacking plants. Some people, however, might not qualify for the vaccine trials because of medications they’re taking to treat chronic diseases or other factors. But because of the sheer number of participants who’ll be needed, Andrasik said, anyone who’s interested should volunteer. “Even if someone is not eligible, for example, for the Moderna trial, they may be eligible for a future trial,” she said. Before signing up, though, you’ll want to understand what being in a COVID-19 vaccine trial will entail.The chance of getting a placebo First and foremost, don’t assume you’ll be able to throw away your mask and stop social distancing after you get the shot. These trials will be placebo-controlled. That means every participant will have a 50-50 chance of getting a sham shot rather than an actual vaccine. In fact, the vaccine developers are counting on some trial participants to actually get sick with COVID-19, said Dr. Richard Novak, professor of medicine and chief of the infectious disease unit at the University of Illinois and one of the clinical trial investigators for Moderna. All participants will be warned that they could get the coronavirus. “We’re not exposing people to COVID-19 or giving it to them, but we do have to find people who have a high risk of getting it,” Novak said. That’s how the companies will be able to compare infection rates among people who received the vaccine and those who didn’t. The protocol for each study will differ slightly depending on the company and vaccine being tested. But all volunteers selected for a trial will be expected to complete the enrollment process in person at one of the more than 80 sites running the trials. Don’t miss: Owners warned stop kissing pets as U.K. latest to sound the alert over cat infected with coronavirus Clinical trial volunteers will be asked to sign “informed consent” documents saying they understand they may get a placebo and that if they get the vaccine, they could suffer side effects.Possible side effects for COVID-19 vaccine trial participants What kind of side effect? Sore arm, low fever and muscle aches — the typical side effects for all vaccines. Moderna said that chills, headache and fatigue were reported in its 45-person trial of the vaccine, too. Patients in the trials will likely receive some compensation to cover their time and basic expenses. That will vary based on the location and trial sponsor. Participants will be followed with phone calls and further visits to the study sites. The Moderna trial, for example, will likely require about seven follow-up visits, weekly phone conversations and electronic diaries that participants will be expected to complete, Novak said. “If they develop symptoms consistent with COVID-19, we’ll bring them in or go to their home for an interim visit, collect samples, then keep tabs on them to see how they do,” he added. (Moderna did not respond to requests for details about the study protocols.) Also read: Bye, boomer: the coming cull of workers over 50 Although Moderna’s entire process will last two years, Novak estimated, the frequency of face-to-face contact between participants will go way down over time, to once a month or potentially less.Safety first Despite the urgent demand for COVID vaccines that work, trial volunteers shouldn’t worry that corners are being cut on safety, said Dr. William Schaffner, professor of infectious diseases at Vanderbilt University. That’s because clinical trials always have data safety monitoring boards, panels of independent experts with access to information about how the people who receive the actual vaccines are doing compared to those who get placebos. “If adverse reactions of a certain seriousness start to occur in the vaccinated group, but not the [placebo] group, the trial can be stopped,” said Schaffner, who is not involved in the COVID-19 trials. Also on MarketWatch: Dr. Osterholm: Americans will be living with the coronavirus for decades Or if the monitoring board looks at the interim data and determines there’s little chance the vaccine is effectively preventing the disease, it can end the trial, “because there’s no need to recruit additional volunteers and expose them to a vaccine that’s not working,” Schaffner said. As of late July, more than 154,000 people had already volunteered to participate in the COVID-19 vaccine trials through the COVPN website. People who are interested in volunteering for trials that aren’t listed there can also find opportunities by visiting Clinicaltrials.gov and searching the keyword COVID-19. Tom Smith, a 62-year-old technology research analyst in Raleigh, N.C., is eager to enroll in a COVID-19 vaccine trial, even though he knows it will be a source of anxiety for some of his family members — especially his 87-year-old dad. “They would be very wary of me doing this,” Smith said. “But you’ve got to have people who are willing to test the different technologies. Anything I can do to help, I want to do.” Arlene Weintraub is a science journalist and author who has contributed to Forbes.com, the New York Times, U.S. News & World Report, Cure, Fierce Markets and other media outlets. She was previously a senior writer based out of the New York City headquarters of Businessweek, where she wrote hundreds of articles that explored the science and business of health. She is the author of “Heal: The Vital Role of Dogs in the Search for Cancer Cures and Selling the Fountain of Youth.” This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}