{"article": [{"url": "https://www.marketwatch.com/story/feds-bullard-says-there-could-be-sharp-drop-in-unemployment-if-we-play-our-cards-right-2020-07-14", "published": 1594748840.0, "headline": "Fed's Bullard says stock market's optimism has been proven right, so far", "body": "U.S. investors who been running up equity market values, have been right, at least so far, said St. Louis Fed President James Bullard on Tuesday. \"Equity markets are something we don't usually talk about at the Fed. I think they have been optimistic and they have been right, I think, up to now anyway,\" Bullard told reporters during a speech that was web cast by the Economic Club of New York. \"They were optimistic in the May-June time frame and indeed the data came in and validated the market thinking,\" Bullard added. In addition, a big part of market value is tech firms and pandemic has been a \"boon\" to this industry. Overall, Bullard was upbeat about the outlook, saying he thought there was a chance the economy would be able to get back to normal over the next six months. There is a chance that the unemployment rate could decline sharply in the next six months, he said. During the webcast, Bullard noted that many Americans still report to the government that they are on temporary layoff and assume they are going to be recalled. If these workers are recalled the unemployment rate would decline to 4.5%. If the level declines to a more normal level of about one million workers, the unemployment rate would still decline to 5.1%. \"So this suggests that there's a lot of room, if we play our cards right, to get the unemployment rate way down,\" Bullard said. Asked later who he was referring to, Bullard said he meant the public \"adjusting to the reality of COVID-19,\" such as ubiquitous use of masks. Because of the coronavirus crisis, things can go wrong and the unemployment rate won't move in a straight line, Bullard said. The St. Louis Fed president was more upbeat on the outlook than his colleague, Fed Governor Lael Brainard. In a speech earlier Tuesday, Brainard warned about a weak economic outlook and said the central bank may have to resort to new policy tools to bolster growth. While surveys using new data suggest job growth has slowed in June, the economy is still adding jobs although not as fast as in May and June, Bullard said. He said the progress in managing the health crisis has been substantial but COVID-19 has been persistent. \"We're certainly past the initial phase of the crisis but the crisis is persistent,\" Bullard said. The St. Louis Fed president that the base case scenario in which the economy \"continues to build\" from May and June is \"reasonable,\" he said. \"We need better execution of a granular risk-based health policy, that will be critical to keep the economy out of depression,\" he said. \"My base case is that we will be able to accomplish this in next six months and come back to a more normal looking U.S. economy,\" he said. The downside risks \"remain substantial,\" he added. The Dow Jones Industrial Average DJIA, +0.56% closed up 557 points and the S&P 500 SPX, +0.87%  finished 1.3% higher, on Tuesday."}]}