{"article": [{"url": "https://www.marketwatch.com/story/imf-slashes-world-growth-outlook-for-2020-and-sees-sluggish-turnaround-next-year-2020-06-24", "published": 1592996240.0, "headline": "IMF slashes world growth outlook for 2020 and sees sluggish turnaround next year", "body": "The International Monetary Fund again cut its global economic forecast for 2020 on Wednesday, saying that the coronavirus pandemic has caused an unprecedented decline in global activity. The IMF sees a global economic contraction of 4.9%, almost two percentage points lower than three months ago. If realized, that would be the worst downturn since the Great Depression of the 1930s, far worse than the financial crisis of 2008-2010. In January, before COVID-19 had spread, the IMF had projected 3.3% global economic growth this year. “We are definitely not out of the woods. We have not escaped the great lockdown,” said Gita Gopinath, the IMF’s chief economist, at a press briefing. Read:Coronavirus tally: Global cases of COVID-19 at 9.3 million, 477,807 deaths “The COVID-19 pandemic has had a more negative impact on activity in the first half of 2020 than anticipated and the recovery is projected to be more gradual than previously forecast,” the IMF said. In 2021, global growth is expected to rebound to a 5.4% growth rate, down 0.4 percentage points from the April forecast. The recovery is expected to be “sluggish” with the level of gross domestic product still about 6.5 percentage points lower than the pre-COVID-19 projections of January. The downturn is expected to hit bottom in the April-June quarter this year and then start to recover gradually. The IMF’s projected recovery looks like the Nike swoosh. This pandemic has led to a demand shock as businesses and households cut back spending. Globally, business lockdowns were at their most intense through mid-May but activity remains low compared to pre-coronavirus pandemic levels. For the U.S., the IMF cut its forecast for 2020 to negative 8%, which is 2.1% lower than in April. Growth is expected to rise to 4.5% in 2021. China is the only major economy still expected to experience economic growth this year. The IMF cut growth forecasts for all regions and types of economies in 2020. Area 2020 growth projection (%) Difference from April WEO (%) 2021 growth projection (%) Difference from April WEO (%) World output -4.9 -1.9 5.4 -0.4 U.S. -8 -2.1 4.5 -0.2 Euro Area -10.2 -2.7 6 1.3 China 1 -0.2 8.2 -1 U.K. -10.2 -3.7 6.3 2.3 Japan -5.8 -0.6 2.4 -0.6 Canada -8.4 -2.2 4.9 0.7 Germany -7.8 -0.8 5.4 0.2 Brazil -9.1 -3.8 3.6 0.7 Russia -6.6 -1.1 4.1 0.6 India -4.5 -6.4 6 -1.4 The IMF said uncertainty is high and there are several important downside risks. It called for global efforts to help countries facing a health crisis and external funding shortfalls. Read:Brazilian doctors fume as President Bolsonaro gets rap for eating hot dogs while COVID-19 cases are on track to pass U.S. Global trade will contract by 11.9% this year, the agency said. Inflation pressures remains muted. Progress on poverty reduction is expected to be reversed. Of the 2 billion informally employed workers worldwide, the International Labour Organization estimates that close to 80% have been affected. Full-time workers also suffered steep job losses — roughly 130 million full-time jobs were lost in the first quarter worldwide and 300 million in the second quarter, the ILO said. There is a risk that financial conditions might tighten more than assumed as “the extent of the recent rebound in financial-market sentiment appears disconnected from shifts in underlying economic prospects,” the IMF said. The IMF said that $10.7 trillion in fiscal measures have been announced worldwide to fight the pandemic. “More will be needed. And many countries are doing a lot already,” Gopinath said. As a result, global public debt is expected to reach an all-time high, exceeding 101% of GDP in 2020-21. That’s 19 percentage points above a year ago. Gopinath said it was wrong to think governments have no constraints on debt. “We are in this world because of very strong monetary policy frameworks and fiscal frameworks that have helped countries be able to borrow at very low rates but if we give up on that, we can certainly move to a different state of the world where borrowing costs can go up quite dramatically for countries,” she said. The IMF urged nations to avoid a repeat of this “catastrophe” by building global stockpiles of health supplies and protective equipment."}]}