{"article": [{"url": "https://www.marketwatch.com/story/long-standing-wealth-gap-between-blacks-and-whites-remains-substantial-new-fed-data-for-2019-show-2020-09-28", "published": 1601368640.0, "headline": "Long-standing wealth gap between Black and white Americans remains substantial, Fed data for 2019 show", "body": "The wealth gap between whites and Blacks in the United States stayed stubbornly wide over the three years that ended in 2019, according to data from the Federal Reserve released Monday. The typical white family has eight times the wealth of the typical Black family and five times the wealth of the typical Hispanic family, the Fed said, in its comprehensive report on consumer finances. The median wealth of white families was $188,200 at the end of 2019, while the median wealth of Black families was $24,100. Hispanic families’ median wealth was $36,100. The mean is substantially higher as there are more white families in the top of the wealth distribution, the Fed noted. The mean wealth of white families was $983,400, compared with $142,500 for Black families and $165,500 among Hispanics. The Fed survey reflected that the wealth growth rate for Black families was at a faster pace over the past three years than it among white families. That said, in absolute dollar terms, the faster pace of growth for Blacks is off a smaller baseline figure, and as a result the span between whites and Blacks actually widened slightly. Indeed, the median wealth between whites and Blacks grew to $164,100 in 2019 from $163,700 in the prior survey. Both Black and white families have yet to recover their pre–Great Recession levels of wealth, the Fed said. Read: Three ways the tax code amplifies the Black and white wealth gap The survey found that the typical Black or Hispanic family has $2,000 or less in liquid savings, while the typical white family has more than four times that amount. Several Black economists told MarketWatch that the only way to solve the race problem in America is to narrow the wealth gap, which they said has its roots in slavery and was exacerbated by government policies like red-lining that kept Blacks from growing their wealth through ownership of homes as they appreciate in value. Read:Black economists response to racial unrest following the death of George Floyd According to the Fed study, about 46% of white families own their home, compared with just 17% of Black families. This gap may reflect parental wealth, as Black families are far less likely to receive, for example, down-payment assistance from their parents. In a speech on income inequality Monday, Cleveland Fed President Loretta Mester said the U.S. most create a more inclusive economy. “Unless actions are taken to promote an inclusive economy — one in which people have the chance to move themselves and their families out of poverty, one in which systemic racism does not limit opportunities, and one in which all people can fully participate — the U.S. economy will not be able to live up to its full potential and the economy will suffer,” Mester said. She laid out an agenda to allow more Americans to fully participate in the economy: investing in poor neighborhoods, closing the digital divide, increasing access to high-quality education and eliminating systemic inequities in access to credit. “This,” Mester said, “will help ensure the American Dream is not a pipe dream.”"}]}