{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-add-to-rise-on-supply-disruptions-hurricane-fears-11601986935", "published": 1601998520.0, "headline": "Oil prices notch back-to-back gains on supply disruptions, hurricane fears", "body": "Apu Gomes/Agence France-Presse/Getty Images Oil futures notched back-to-back gains Tuesday, building on the previous session’s sharp climb as investors focused on a strike that’s curtailed Norwegian output and Hurricane Delta, which has led to production disruptions in the Gulf of Mexico. Delta is “rapidly intensifying as it enters the Gulf and oil companies are already beginning offshore evacuations in the region that accounts for 17% of U.S. crude oil production,” said Craig Erlam, senior market analyst at Oanda, in a market update. West Texas Intermediate crude for November delivery CLX20, -1.62% CL.1, -1.62% rose $1.45, or3.7%, to settle at $40.67 a barrel on the New York Mercantile Exchange, following a climb of 5.9% on Monday. December Brent crude BRNZ20, -0.07% BRN00, -0.07% gained $1.36, or 3.3%, at $42.65 a barrel on ICE Futures Europe.Hurricane Delta strengthened into a “extremely dangerous” Category 4 storm Tuesday afternoon as it took aim on the northeastern coast of the Yucatan peninsula. It’s expected to make landfall on the Gulf Coast later this week. In preparation for Delta, the Bureau of Safety and Environmental Enforcement estimated that 29.2% of Gulf oil production and nearly 8.6% of natural-gas output was shut in as of Tuesday afternoon. Aside from oil output, the region’s offshore production accounts for 5% of domestic dry natural-gas production, according to the Energy Information Administration. The Gulf Coast is home to more than 45% of total domestic refining capacity and 51% of the nation’s natural-gas processing plant capacity. The EIA on Tuesday reduced its 2020 forecasts for U.S. and global benchmark oil prices, but raised its U.S. crude production outlook for this year, according to the agency’s Short-Term Energy Outlook report. In its Winter Fuels Outlook report also released Tuesday, the EIA said it expects U.S. households that use natural gas as their primary space heating fuel will spend $572 this winter, up 6% from what they spend last winter, with a 2% decrease in residential natural-gas prices only partly offsetting an 8% rise in residential consumption. The government agency said it expects higher demand for the fuel this winter because of expectations for colder temperatures and more people spending time at home. On Tuesday, November natural gas NGX20, +5.17% settled at $2.52 per million British thermal units, down 3.6%. That followed a jump of more than 7% Monday. Earlier, optimism over prospects for another round of fiscal stimulus out of Washington was credited with boosting WTI by nearly 6% and Brent by 5.1% on Monday, alongside concerns over a strike that has idled output in six Norwegian oil fields responsible for around 330,000 barrels a day of oil-equivalent production. But by Tuesday afternoon, U.S. stock indexes and other risk assets were selling off, after President Donald Trump said he would end negotiations on a new fiscal stimulus package, dampening hopes that Washington lawmakers could strike a deal soon. Oil prices are “suffering from following the bouncing stimulus ball syndrome, which temporarily papers over the real tragedy unfolding in the oil patch, specifically a lengthy beatdown and tenuous recovery from this nasty epidemic,” said Stephen Innes, chief global market strategist at Axi, in a note. The American Petroleum Institute, an industry trade group, will provide its weekly look at U.S. crude and product inventories late Tuesday. The EIA’s more closely watched inventory figures are set for release on Wednesday morning. Analysts surveyed by S&P Global Platts, on average, forecast crude stocks to have fallen by 2 million barrels last week, while gasoline inventories are seen down 800,000 barrels and distillate stocks are expected to drop 2.9 million barrels. On Nymex, November gasoline RBX20, -2.11% tacked on 3.4% to $1.2351 a gallon and November heating oil HOX20, -0.05% rose 4.9% to $1.1886 a gallon."}]}