{"article": [{"url": "https://www.marketwatch.com/story/us-to-hit-japan-like-levels-of-government-debt-by-2050-budget-group-says-2020-06-24", "published": 1593011120.0, "headline": "U.S. to hit Japan-like levels of government debt by 2050, budget group says", "body": "The level of U.S. government red ink is set to explode to more than twice the size of the entire economy in three decades, according to a prominent anti-deficit group. The Committee for a Responsible Federal Budget, a bipartisan group that focuses on fiscal matters, issued its estimate in a report Wednesday that attempts to update the 10-year projections usually made by the Congressional Budget Office and the White House’s Office of Management and Budget. The CBO has already estimated the deficit for 2020 will rise to a record, in dollar terms, of $3.7 trillion, with public debt rising to 101% of gross domestic product. The nonpartisan budget scorekeeper for Congress is expected to update its 10-year projections in September. The CRFB’s estimates hint that update could be grim. While the CBO in March, before the pandemic began to affect the economy deeply, estimated a cumulative shortfall of $14.164 trillion from 2020 through 2030, the group’s estimate projects the deficit to be $19.899 trillion over that period, an increase of $5.735 trillion. “Though short-term borrowing is necessary to fight the current crisis, deficits are far from costless,” the group said. “When the economy does recover, this elevated level of debt, if not ultimately brought under control, threatens to slow income growth, increase interest payments, place upward pressure on interest rates, reduce the fiscal space available to respond to future needs or emergencies, place an undue burden on future generations, and heighten the risk of a fiscal crisis.” From the archives:How the recent tax cuts and budget deal jack up the national debt — in one chart And see:Here’s a lesson from Japan about the threat of a U.S. debt crisis The group projected debt to rise to 118% of GDP in 2030, well above the CBO’s pre-crisis forecast of 91.7%. In 2040, it would rise to 159% and in 2050 hit 220%. That last figure would rival Japan’s recent debt levels, which, according to the Organization for Economic Cooperation and Development, were around 237% in 2015. The CRFB projections also see the various federal trust funds being unable to make full payments sooner than the CBO has estimated. The Highway Trust Fund, which the CBO projects to be exhausted in 2022, would instead see that date moved up to 2021. A similar one-year advance in the exhaustion date, to 2031, would hit Social Security, the group estimated."}]}