{"article": [{"url": "https://www.marketwatch.com/story/pelosi-mnuchin-set-to-talk-again-as-pelosi-balks-on-tax-provision-11601572374", "published": 1601587880.0, "headline": "House Democrats approve $2.2 trillion stimulus bill as talks drag on", "body": "Speaker of the House Nancy Pelosi, D-Calif., arrives for her weekly news conference at the U.S. Capitol on Thursday. (Getty Images) Democrats pushed through the House on Thursday night a $2.2 trillion economic stimulus plan, putting down a marker as their leader, House Speaker Nancy Pelosi, continues to talk with Treasury Secretary Steven Mnuchin on an coronavirus aid deal. While the bill will not be considered in the Senate, where Majority Leader Mitch McConnell has said it’s too expensive, it may wind up serving as the House Democrats’ final bid before heading home for the remaining few weeks of the fall election campaign. But instead of unifying the Democratic caucus behind Pelosi in her talks with Mnuchin, the bill showed some cracks in party resolve. It passed on a narrower-than-expected 214-207 tally, with a handful of moderate Democrats defecting to join all House Republicans in opposition. “We’re going back and forth. We’ve got our paper and conversations,” Pelosi said of her and Mnuchin, whom she spoke with for about 50 minutes earlier in the day. Prior to the vote, she said she did not expect talks to be resolved before Friday. With lawmakers eager to leave Washington, time is running out for a deal to be reached, and the sides at least publicly appeared to be relatively far apart. The last White House offer was reportedly about $1.6 trillion, well below House Democrats’ $2.2 trillion ask. But Pelosi said on some issues, like support for expanded coronavirus testing, the issue was not dollars and cents. “It’s the language. It’s not just the money,” she said. The vote is a blow to the Pelosi-Mnuchin talks though, as it put most Democrats on the record for a bigger bill than what the Pelosi-Mnuchin talks could eventually yield and will allow Democrats to leave Washington claiming to have tried to get a package enacted. But one House Democratic leadership aide said the vote does not necessarily mean the talks are over. “That’s been a false narrative. Negotiations of this size are always protracted,” the aide said. Rep. Hakeem Jeffries, a New York Democrat, said members had been told to expect to remain in Washington through Friday. This week is the last week the House is scheduled to be in session before the Nov. 3 elections, meaning lawmakers are eager to hit the road and ramp up their campaigns back home. Pelosi early Thursday said she remained “hopeful” on the talks, but also said there were several issues where the two sides remained far apart. At the White House, press secretary Kayleigh McEnany said the House Democrats’ bill was “not a serious offer.” Read more: White House spokeswoman says Pelosi ‘not being serious’ in talks on coronavirus aid Earlier Thursday, Pelosi focused on a tax issue where the sides remain far apart, saying the administration disagreed with a provision in the Democrats’ bill to pare back the treatment of business net operating losses that had been liberalized in the March CARES Act. “They still want to keep a $150 billion tax break for the wealthiest in our country and have zero in terms of a refundable child tax credit, earned income tax credit that addresses the poorest of the poor,” she said at her weekly press conference. Recipients of refundable tax credits get money back for the amount of the credit, even if it is more than the amount of tax liability owed. Time is running short to reach a deal, and even if Mnuchin and Pelosi were to come to an agreement, lawmakers would still need a few days to get legislative text written and voted on. But with much of the economic kick from the CARES Act exhausted and airlines threatening to furlough tens of thousands of workers in the coming days, lawmakers also feel pressure to get something done. Read more: American Airlines and United to furlough 32,000 workers as aid program set to expire Pelosi said Democrats were already looking ahead to the post-election lame-duck legislative session in preparing their offer, noting some priorities could be given additional money in a deal to extend government appropriations past Dec. 11. “We have come down very far in the negotiations, not abandoning any priorities, but shortening the timetable and putting some things off to the appropriations,” she said. Deal prospects did get an unexpected boost from the Senate on Thursday. Rather than taking a break until the elections or a Supreme Court nomination vote later in the month, the Senate will be back in session next week, which could keep up pressure to reach a deal. Still, McConnell was not optimistic in an interview with Fox News. “I think what’s happened here is, as we’ve gotten closer to the election, the spirit of bipartisanship that we had on the coronavirus in March and April has largely disappeared,” he said. McConnell said the package he had put on the Senate floor early in September, which garnered 52 of 53 GOP votes but was blocked by Democrats, totaled about $500 billion. “The principle negotiation is between the president and the speaker of the House. If they can reach an agreement, I’ll take a look at it and see whether I can sell that to Senate Republicans,” McConnell said."}]}