{"article": [{"url": "https://www.marketwatch.com/story/data-will-determine-where-schools-can-open-in-new-york-in-september-gov-cuomo-says-2020-07-13", "published": 1594655420.0, "headline": "Data will determine where schools can open in New York in September, Gov. Cuomo says", "body": "Gov. Andrew Cuomo on Monday outlined the metrics that will determine whether schools can welcome students back to the classroom in September, although the final decision will not be made until next month. He also issued new orders for out-of-state travelers as coronavirus cases continue to surge nationwide. The state’s plan to get students back in class includes both a formula for regions to determine if it is safe to consider reopening, plus guidelines for how that school will do so. A final decision about which schools will get a green light to open will be made the first week of August, according to Cuomo. “Everybody wants to reopen the schools,” he said. “It’s not, do we reopen or not? You reopen when it is safe to reopen...we’re not going to put our children in a place where their health is endangered.” The statewide formula is driven by data, Cuomo explained. Schools will reopen if that region is in Phase 4 (all regions are currently in Phase 4 except for New York City) and the daily infection rate remains at 5% as of the first week of August or lower over a 14-day average. The current statewide infection rate is below 2% in most of New York, according to state data. However, should a spike occur between the announcement and the start of school, the state does have a “safety valve.” “Schools will close if the regional infection rate is above 9% on a seven-day average,” Cuomo said. “It’s purely on the numbers.” The New York State Department of Education also issued guidelines for reopening on Monday. These include testing and screening, social distancing mandates, a framework for in-person and remote learning and other education guidelines. However, Mayor Bill de Blasio announced last week that New York City schools will reopen in a limited way in September. Cuomo’s office published a statement calling the mayor’s “premature.” See: While politicians squabble, New York schools make their own plans Numbers in all New York regions across the state “are good,” Cuomo added, noting that around 51,000 people were tested on Sunday and the amount of positive tests hovering was just over 1%. There were 792 new hospitalizations, the lowest since March 18, according to Cuomo. Ten people died on Sunday of the virus. More than 400,000 cases have been reported in the state, and close to 25,000 fatalities. On Saturday, New York City reported no deaths for the first time since March. But concerns remain about travelers from states that have seen recent peaks in positive COVID-19 patients—such as Florida, Arizona and Texas—spreading the virus in New York. The state has already instituted a mandatory 14-day quarantine for these travelers, but non-compliance has led to outbreaks, the governor said. He pointed to rising cases in upstate Rensselaer County, where someone visited from Georgia. About 2.5% of tests there came back positive for the virus as of Sunday, according to New York state data. To combat a resurgence, Cuomo announced an emergency health order mandating that everyone flying into New York must provide information to airport officials about where they are coming from and where they are staying. Location forms will be available on the airplane or electronically. “If you leave the airport without providing the information, you will receive a summons immediately with a $2,000 fine,” Cuomo said. “You can then be brought to a hearing in order to complete mandatory quarantine.” The mandate will be carried out at all New York state airports. No other details on the mandatory quarantine were provided at the news conference. Read next: Online food prices jump as food companies struggle to meet demand Travelers’ compliance to the quarantine is crucial to keeping the virus under control in New York, Cuomo noted. “It came in through the airports,” he said. “It will come in through the airports once again.”"}]}