{"article": [{"url": "https://www.marketwatch.com/story/former-israeli-coronavirus-task-force-chairman-it-seemed-safe-to-reopen-schools-but-then-came-the-outbreaks-2020-09-01", "published": 1599191780.0, "headline": "It seemed safe to reopen Israel's schools, but then came COVID-19 outbreaks - what can we all learn from those mistakes?", "body": "After Prime Minister Benjamin Netanyahu implemented a strict lockdown in Israel in February, by early May, roughly a dozen daily new cases of coronavirus down from more than 750 per day were being reported among the country's population of roughly 9 million people. By last month, Israel had hit 2,300 new cases in one day. But three months ago, the cost of reopening schools with so few cases of coronavirus did not seem to come close to the benefits that were believed to be gained from holding in-person classes - or so the Israeli government thought. However, a heat wave that made it difficult for students to wear masks, full classrooms that made social distancing near-impossible and, perhaps, the illusion that the virus had been vanquished all contributed to a false sense of security. Within days of reopening schools on May 17, one of the largest coronavirus outbreaks in the country occurred, prompting many schools to revert to online instruction. The hardest-hit school was Gymnasia Rehavia, a middle school and high school in the county's capital, Jerusalem, where some 153 students and 25 staff members tested positive for coronavirus. As Rebecca Nussbaum, a teacher, told The World radio program of the first attempt to reopen schools in Israel: \"We did not feel like we had any adequate time to prepare for that, in order to make sure the school was appropriately equipped for that many students coming back in one go.\" \"To everybody's surprise in the school, the Thursday night before we were going back on the Sunday, we were in a staff meeting about how capsules would work; it was 9 o'clock at night and a news report came out saying that schools were opening as normal,\" she added. Now the country has become a cautionary tale for what NOT to do when reopening schools. To date, Israel has reported 118,538 cases of coronavirus and 957. That translates to 10.8 deaths per 100,000 of the population or a 0.8% fatality rate. To put that in comparison, the U.S. has reported 56.4 deaths per 100,000 people and a fatality rate of 3%. The Israeli government now has a staggered system of return under its \"Safe Learning\" program. The country's education ministry said approximately 2.4 million children and 205,000 education workers have resumed their school year. There will be smaller capsules for older students, and a mixture of online and in-person classes. MarketWatch spoke with Eli Waxman, a professor at the Weizmann Institute of Science and former chairman of the team advising Israel's National Security Council on the pandemic, to understand what went wrong and what the U.S. and other countries can learn. Waxman left his position at the NSC in May after the recommendations his team made were ignored by the Israeli government, the Times of Israel reported. Eli Waxman, pictured, is a professor at the Weizmann Institute of Science and former chairman of the team advising Israel's National Security Council on the pandemic. Weizmann Institute of Science MarketWatch: What was the thought process back in May when schools reopened? What was lacking from Israel's initial school reopening plan? Eli Waxman: The contact tracing infrastructure was not built. Due to hurdles and objections within the health ministry, and due to the lack of the decision by the political level. And so we reopened physically without having this infrastructure, so there was no way to control new outbreaks. “ 'The contact tracing infrastructure was not built. Due to hurdles and objections within the health ministry, and due to the lack of the decision by the political level.' ” We proposed the gradual relief of social distancing measures starting with activities that are less dangerous such as construction and only later opening commerce and schools very gradually. Due to the political pressures, this program was not implemented, far from it, and all the restrictions were relieved, almost at the same time, and without proper regulations prepared for conduct in public places. So the combination of these factors led to the new uncontrolled outbreak that we've seen in June and July. MW: So was there really no plan for how to deal with outbreaks of the virus that occur in classrooms and spread across schools and, ultimately, people's homes? EW: There was no plan. The health ministry was totally unprepared and, in parallel, they also removed restrictions. The original plan was to first resume activity at the lower grades up to third-grade and with reduced numbers of students per class, with masks and alcogels [disinfectants] and, after monitoring the situation for a couple of weeks, considering the resumption of activity for higher grades. We started with the lower grades and, in three days, all the grades were back to school and all the restrictions were removed. It was no surprise that we had these outbreaks. There were no capabilities to trace contacts and to isolate them and there was no way to stop the spread. “ 'It was no surprise that we had these outbreaks. There were no capabilities to trace contacts and to isolate them and there was no way to stop the spread.' ” MW: What has changed since May? EW: There are several steps that have been taken. One major development was the realization by the government and by the health ministry that an efficient and strong contact-tracing capability should be used. It was also accepted that the health ministry is not capable of doing this, and the responsibility for the construction [of this system] was moved to the army. This is something that we were recommending for months and it didn't happen. This has happened now, and the army is building this capability. It is not set yet it is not ready but it will be ready I hope within a couple of weeks. There still debates about how school activity would resume. An Israeli pupil heads to his classroom upon return to school after the COVID-19 lockdown, at Hashalom elementary in Mevaseret Zion, in the suburbs of Jerusalem, last May. (Photo: AFP via Getty Images.) Some argue that the plan should be gradual, as I just described. Starting with lower grades and reducing the number of students per class, and walking in capsules, and requiring safety measures like masks and alcogels. I hope this will be implemented but it's not at all clear to me because there are pressures to resume all activity of all grades at the same time. I'm worried that if this happens due to the pressures then we will face again serious danger of uncontrollable outbreaks. “ 'If we repeat the same thing that we did last time we are going to face serious problems.' ” MW: A lot of countries are looking at Israel now as an example of what NOT to do. But is there anything your country has done well that you feel is not getting enough recognition? EW: The response to the first outbreak. The sooner you act, the faster you suppress the outbreak and the faster you can resume activity. The decision to close down flights and also to close school activity, and then to apply more restrictions on general activity - I think this was done in the right way early on. It allowed us to get very low numbers in April 'and May. However, the steps that should have been taken during the time between early March and mid-May - the construction of the contact-tracing capability and setting up rules for a gradual resumption of activity - did not happen. These steps are crucial for safe resumption of activity in the presence of the virus. MW: If schools were to reopen again in Israel for in-person learning, are you confident that the country would have things under control? EW: I'm not confident because of the pressures for reopening not gradually and without precaution measures. So it really depends on how it will be done this time. If we repeat the same thing that we did last time we are going to face serious problems. I hope that we will not do it again. (The interview was edited for style and space.) Before schools reopened in Israel, coronavirus appeared to be under control. Once schools reopened that was no longer the case. (Photo: AFP via Getty Images.)"}]}