{"article": [{"url": "https://www.marketwatch.com/story/asian-stocks-track-wall-street-gains-seen-hinging-on-stimulus-hopes-2020-10-09", "published": 1602204620.0, "headline": "Asian stocks track Wall Street gains seen hinging on stimulus hopes", "body": "Asian stock markets followed Wall Street higher on Friday on hopes Washington will provide more aid to the struggling U.S. economy. Benchmarks in Shanghai SHCOMP, +1.67% , Hong Kong HSI, +2.28% , South Korea 180721, +0.21% and Australia advanced. Tokyo was off 0.1%. Wall Street gained Thursday after President Donald Trump suggested he might be reversing his decision to halt talks on economic aid. Separately, a report indicated the near-record pace of U.S. job losses might be slowing. Stock prices have been volatile since mid-September as investors swing between optimism about possible development of a coronavirus vaccine and unease that markets recovered too fast and are too expensive. “The on-and-off nature of the fiscal stimulus discussion in the U.S. hardly inspires lasting confidence,” said Mizuho Bank in a report. “Uncertainty around the presidential election on 3 November will likely persist not only through to polling day but possibly after.” The Shanghai Composite Index, resuming trading after a weeklong holiday, rose 1.6% to 3,271.08. The Nikkei 225NIK NIK, -0.11% in Tokyo shed 0.1% to 23,613.20 while the Hang Seng in Hong Kong gained less than 0.1% to 24,194.68. Sydney’s S&P-ASX 200 XJO, +0.00% gained 0.1% to 6,108.50. New Zealand, Singapore and Indonesia advanced. Trump said in a TV interview that “very productive” talks had begun on more stimulus after supplemental unemployment benefits that supported consumer spending, the engine of the U.S. economy, expired. That helped to fuel optimism that Republicans and Democrats will deliver another aid package after weeks of uncertainty. Wall Street’s benchmark S&P 500 index SPX, +0.87% rose 0.8% to 3,446.83. The Dow Jones Industrial Average DJIA, +0.56% gained 0.4% to 28,425.51. The Nasdaq composite COMP, +1.39% picked up 0.5% to 11,420.98. Banks, technology and communication companies accounted for much of the gains. Energy stocks rose as the price of U.S. crude oil climbed more than 3%. Occidental Petroleum climbed 8.8%, the biggest gainer in the S&P 500. A government report showed that 840,000 workers applied for unemployment benefits last week. That’s down slightly from 849,000 the prior week. Several areas of the economy have been slowing recently. That has investors focused on whether Congress can deliver more aid. On Tuesday, Trump said he told his representatives to halt negotiations until after the November election because he said House Speaker Nancy Pelosi was negotiating in bad faith. That caused stocks to fall 1.4%. Trump said later he would be open to aid for the airline industry and $1,200 in payments to Americans. Stock rose Wednesday in response to that. Pelosi spoke with Treasury Secretary Steven Mnuchin on Wednesday about a measure to aid airlines but said Thursday that had to be part of a more expansive bill. On Thursday, Trump said he shut down talks “because they weren’t working out. Now, they are starting to work out.” Some investors also see rising poll numbers for Joe Biden in the upcoming presidential election as an indication more stimulus may be on the way, regardless of what Trump says. If Democrats sweep the White House, Senate and House of Representatives, they say a big rescue package becomes more likely. And that could offset higher taxes and tighter regulations that a Democratic-controlled government could also create. Stocks still look expensive relative to corporate profits to critics. U.S.-Chinese tensions over trade and technology are simmering. France reported a record number of infections on Wednesday. Germany is seeing a jump in new coronavirus infections, raising fears the pandemic is gaining in a country that so far has coped better than many of its European neighbors. Britain is considering new controls amid evidence measures already in effect have failed to contain the virus. In energy markets, benchmark U.S. crude CL00, -1.62% lost 9 cents to $41.10 per barrel in electronic trading on the New York Mercantile Exchange. The contract rose $1.24 to $41.19 on Thursday. Brent crude BRN00, -0.07% , used to price international oils, shed 8 cents to $43.26 per barrel in London. It rose $1.35 the previous session to $43.34 a barrel. The dollar USDJPY, -0.38% declined to 105.82 yen from Thursday’s 106.02 yen. The euro USDEUR, -0.60% rose to $1.1780 from $1.1758."}]}