{"article": [{"url": "https://www.marketwatch.com/story/new-york-metropolitan-area-lost-nearly-15-million-jobs-in-june-the-most-of-any-us-city-2020-07-29", "published": 1596043880.0, "headline": "New York metropolitan area lost nearly 1.5 million jobs in June, the most of any U.S. city", "body": "The New York City area lost more than 1.5 million jobs in June compared to a year ago, the most of any U.S. metro region. The area, which includes the five boroughs as well as Newark and Jersey City, N.J., saw its unemployment rate rise to 17%, up from 15.3% in May and significantly higher than the national rate of 11.2% in June, as the former epicenter of the pandemic continued to shed jobs, according to data from the U.S. Labor Department on Wednesday. New York City may have finally entered Phase 4 of its reopening, but with museums and Broadway theaters closed, bars and restaurants only open for limited outdoor seating, and travel restrictions placed on incoming visitors from the vast majority of U.S. states, the city’s economy is still a shell of its usual self. Employment numbers have plunged accordingly. The Los Angeles metro area followed New York in the volume of jobless, with nonfarm employment down 650,400 in June compared to a year ago. Chicago came in third, shedding 466,000 jobs in June. All three densely populated metros have seen high rates of coronavirus. Don’t miss: Republicans want to replace extra $600 unemployment benefit with 70% replacement wages — here’s why that could take months to implement The sheer number of jobs lost in the New York area was the largest of the 307 cities studied, but other cities had proportionally higher unemployment rates in June. Atlantic City, N.J., had the highest in the nation, at 34.3%, while the Los Angeles and Las Vegas areas recorded 18.1% and 18% unemployment, respectively. Logan, Utah, had the lowest unemployment rate of any metro area studied, at 3.5%. See: New York culture creaks back to life, COVID-style Cities with strong tourism industries appear to be among the hardest hit nationwide, and the largest percentage losses in employment occurred in Atlantic City, with a 29.2% decrease; Ocean City, N.J., with a 28.7% decrease; and Kahului-Wailuku-Lahaina, Hawaii, with a 26.5% decrease. By comparison, the New York Metro area saw a 15.4% decrease in employment. New York state’s COVID-19 numbers continue to look encouraging, Gov. Andrew Cuomo said during a briefing Wednesday, with 1.1% of more than 62,000 tests given yesterday coming back positive. Meanwhile, 619 people were hospitalized statewide on Tuesday, the lowest number since March 18, and 76 people were intubated, the lowest number since March 15. Five New Yorkers died statewide. “All the news on our numbers and our status is all very good,” Cuomo said. “The whole goal now is to protect our progress. We’re doing very well and want to make sure we continue to do well even though the sea around us is roiled.” With the virus under control, Cuomo said, “We’re in the position of saying to people, ‘come back.’” He expressed concern over low revenues across the state and the number of residents who have relocated during the pandemic. The hospitality industry also remains in flux, with indoor dining on hold indefinitely, and shifting regulations resulting in the State Liquor Authority issuing 29 violations to city bars and restaurants on Tuesday alone. Don’t miss: Southampton concert featuring Chainsmokers, Goldman Sachs chief could result in fines, criminal penalties The governor warned that New York state faces a $14 billion deficit this fiscal year and a $16 billion deficit in the next fiscal year, saying that federal legislation thus far “has been politically motivated and shorted the state of New York.” Cuomo also balked at proposals to increase tax rates for the state’s wealthiest residents, saying, “With New York City, on top of COVID you put the crime issues and the homelessness issues we’re now having, and the civil disruption, you don’t want to add on top of that that it’s going to be more expensive than it was before. I think this is all a very dangerous combination.”"}]}