{"article": [{"url": "https://www.marketwatch.com/story/trump-tests-positive-for-coronavirus-the-implications-are-wide-ranging-2020-10-02", "published": 1601718140.0, "headline": "Trump tests positive for coronavirus. At stake: the campaign, the operation of the federal government and the makeup of the Supreme Court", "body": "The news that President Trump has tested positive for the coronavirus is nothing less than stunning. It raises questions about everything from the operation of the federal government to national security to confirmation hearings for Supreme Court nominee Amy Coney Barrett. It has also added further uncertainty to the presidential campaign itself, which is now in its final month and already the source of considerable anxiety and uncertainty amid allegations of fraud, unproven, leveled by Trump himself. It was feared that Trump might have been exposed after news broke Thursday night that Hope Hicks, a top White House aide, had tested positive for the virus. Hicks, as close to Trump as anyone in the West Wing, had traveled with the president to a campaign rally in Minnesota on Wednesday. After the news broke that Hicks was infected, the president called into Sean Hannity’s Fox News show to say he and the first lady were being tested. Hours later came a 12:54 a.m. tweet with the diagnosis: iframe.twitter-tweet { width: 100% !important; } Health Read:Trump is at higher risk of more severe illness from COVID-19 How is the president’s health? We don’t know why he made an unscheduled trip to Walter Reed, the military hospital, on Nov. 16, 2019. But in Bob Woodward’s new book “Rage,” it was reported that Vice President Mike Pence was alerted that he should be on standby if Trump had to undergo an emergency medical procedure. Trump was only there for two hours and sixteen minutes and had “a quick exam and labs,” his then-press secretary Stephanie Grisham told us, but little else is known about his visit. What is known, however, is that the coronavirus primarily afflicts the elderly, particularly those with pre-existing medical conditions. Does Trump have some sort of pre-existing condition? Other than being overweight and having a highly stressful life, nothing verifiable has emerged. There have been questions — based on videos of him walking, awkwardly raising a bottle of water to his mouth and occasional slurring of speech — as to whether his health has faded. Trump explained that he was being extra careful on the ramp so he wouldn’t fall and be laughed at. As for the water, he said he was intending only to wet his lips. Campaign Meantime, what about the presidential campaign? Trump, who clearly trails Joe Biden both nationally and in most swing states, was supposed to appear at a campaign rally in swing state Florida tonight. That’s off — at least traveling there and putting in a personal appearance is. The president feeds off his rallies — they are his oxygen — and their potential absence for at least the next two weeks will hurt. In the three Rust Belt states that powered him to victory four years ago, Trump trails Biden in all three when taking into account aggregate margin of error: Biden is +5.2 in Michigan, +5.5 in Wisconsin and +5.7 in Pennsylvania. Biden also is +3.3 in Ohio. Other states are much closer, including Florida, Georgia, North Carolina and Arizona. But Trump can’t go anywhere for at least two weeks. What will Biden do to take advantage?Debates What happens to the next debate? It’s supposed to be in Miami on Oct. 15, within the 14-day quarantine period. After Tuesday’s ugly brawl — Trump got the bulk of criticism for his relentless and interrupting and talking over Biden — the Commission on Presidential Debates said it was exploring its options. Here’s an idea: Let’s scrap them. Supreme Court nominee What about Supreme Court nominee Amy Coney Barrett? She was in close contact with Trump over the weekend, when the president nominated her. She has since met Senate Majority Leader Mitch McConnell, who hopes to win swift confirmation of the 48-year-old judge. Will these people be tested? What could happen to McConnell’s already tight timetable if anyone tests positive and goes into quarantine? Trump, with all his (unproven) talk of voter fraud, has said the election could wind up in the high court, which could include Barrett. Read:What happens when a world leader tests positive for COVID-19? Following Brazil’s Jair Bolsonaro and Britain’s Boris Johnson, Donald Trump is the third known major world leader to contract Covid-19. Johnson actually had a close brush with death, spending several days in intensive care; he said he survived because he was given “litres and litres of oxygen” to keep him alive. Bolsonaro, who previously mocked the virus as a “little flu,” also survived. Federal government And what of the continued functioning of the federal government? After all, the president is head of the executive branch — one of its three branches. I suspect the federal bureaucracy will continue to operate largely on its own. The president’s illness should not have much of an impact on the ability of these experienced men and women to do their jobs. I’ve seen lots of hateful comments on social media about Trump and how some folks are glad he’s ill and that he deserves it. To them, I can only say that coronavirus is a horrible, horrible thing. If you knew anyone who has gone through it, you wouldn’t wish it on anyone — no matter how much you detest them. Yes, Trump downplayed it. He mocked people for wearing masks. He has denigrated scientists. And more. My advice: Take your anger and energy and do something constructive, like helping someone register to vote."}]}