{"article": [{"url": "https://www.marketwatch.com/story/online-shopping-is-booming-and-thats-making-warehouses-hot-property-11601973825", "published": 1601994260.0, "headline": "Warehouses are hot property as online shopping booms", "body": "Demand for warehouse space from online retailers, including The Hut Group, is booming. PICTURE SUPPLIED BY COMPANY The commercial property market has been a big victim of the coronavirus pandemic, but demand for warehouses — where goods can be stored and processed — is booming, as the pandemic has led to a surge in people buying essentials online. Demand for logistics and distribution space across the U.K. rose to a record in the third quarter, as online retailers expanded their supply chains to address consumer needs during the coronavirus pandemic. Warehouse owners leased out 13.3 million square feet in the three months through September, 111% higher than the same period in 2019, according to global real estate adviser CBRE. Online retailers accounted for a third of demand, reflecting the shift in shopping trends. “The extraordinary level of takeup seen in Q2 has now been exceeded in Q3. To put the numbers into context, the past six months takeup exceeds the annual total for eight of the past 10 years,” Jonathan Crompton, senior director in the industrial and logistics team at CBRE, said in a statement on Oct. 2. Read: Demand for Big-Box Warehouses Soars Under E-Commerce Surge, Report Says Notable deals included British pet supplies company Pets at Home PETS, -1.38% entering into a pre-letting of 670,000 sq ft at Stafford, and online health and beauty company The Hut Group THG, -0.69%, which floated on the stock market in September, taking 459,000 at Airport City, Manchester. Others included food retailer Gousto taking the existing Chillbox unit at Thurrock that extends to 196,000 sq ft, and clothing retailer Next NXT, +2.44%, which secured planning consent on 852,000 sq ft at South Elmshall, near Doncaster. The Association of Investment companies spoke to top fund managers of investment companies in the U.K. and European commercial and property sectors with holdings in warehouse properties, to gauge their views on the future of online retail and find out which regions and sectors have been the winners and losers of the pandemic. Here is what some of them had to say. The shift to online Richard Moffitt, chief executive of Urban Logistics REIT SHED, : January saw 19% of all retail sales conducted online. By March this was more than 30% in comparison to research that predicted it would reach 25% by the end of 2022, Moffitt said. “The progression is here to stay, but perhaps at a more modest level. Groceries at 10-12% online have a long way to go, but it is hard for retailers to maintain margin.” Colin Godfrey, chief executive of fund management at Tritax Big Box BBOX, +2.28% : U.K. online penetration peaked at 33.5% in May, reflecting the shift in consumer behavior as nonessential physical stores were closed. From June to August, this online penetration level has moderated and now stands at 28.1%. “This change is a reflection of consumers starting to regain confidence and returning to shopping in physical stores, rather than a sharp slowdown in online sales,” Godfrey said, adding that online spending continues to be robust with year-over-year online sales growth remaining above 50%, despite more people shopping at physical locations. Opportunities in the pandemic Evert Castelein, fund manager of Aberdeen Standard European Logistics Income ASLI, +0.94% : European logistics, as a sector, has outperformed most other European real-estate sectors, benefiting from the shift to working from home and the social distancing rules, Castelein said, adding that the logistics warehouse space is increasingly becoming a favored asset class among investors. Andrew Bird, managing director of Tilstone Partners, the manager of Warehouse REIT WHR, : Bird said that Amazon’s covenant is becoming increasingly valuable, not only in the U.K. but across Europe, with yields below 4% being paid and becoming the norm. “This is a trend we would expect to continue,” he said, adding that there is also strong investment demand from both domestic and overseas investors. Winners and losers Colin Godfrey, chief executive of fund management at Tritax Big Box: The real winners, Godfrey said, have been the beauty sector, which saw a rise of nearly 140% in the first week of April, while electricals rose 90%, and home and garden rose 70%. “In contrast, clothing saw online sales drop 20% year on year and it has been a challenging time for car manufacturers. Amazon AMZN, +3.01% has also delivered record sales this year.” Read: Amazon looks to open 1,500 small warehouses in U.S. suburbs Godfrey added that the alcohol category saw a significant rise in online demand following the coronavirus lockdown, with retailer Naked Wines WINE, +6.02% one of the brands benefiting. The company has forecast a £200 million rise in revenue for 2020, and is expected to invest between £20 million and £25 million on new customer recruitment. Richard Moffitt, chief executive of Urban Logistics REIT: “We saw 62 of our 64 buildings operational during the first two to three weeks of lockdown and then all 64 operated normally,” Moffit said, noting that rather than regional variations, it is tenant covenants, unit sizes and user types that are more important. Andrew Bird, managing director of Tilstone Partners, the manager of Warehouse REIT: Occupier demand for warehouse space has remained robust across all submarkets and unit sizes, Bird said, noting that all online-focused businesses have been the winners, as have those logistics companies that serve the sector, increasing demand for big-box space as well as mid-box. “The annual takeup statistics for 2020 are anticipated to exceed those of last year, albeit Amazon has again become a materially significant contributor.” Laura Elkin, portfolio manager of AEW UK REIT AEWU, : Elkin said that the AEW UK REIT portfolio, which is focused on secondary industrial properties — most of which are unsheltered by the long leases typical of newer, prime logistics property — has been able to create significant value in this part of its portfolio by increasing rents and lengthening income streams."}]}