{"article": [{"url": "https://www.marketwatch.com/story/trump-himself-asks-why-woodward-didnt-immediately-report-the-presidents-comments-about-playing-down-the-coronavirus-2020-09-10", "published": 1599737240.0, "headline": "Trump himself asks why Woodward didn't immediately report the president's comments about playing down the coronavirus", "body": "The reactions keep coming after excerpts from famed journalist Bob Woodward's new book said that President Donald Trump knew early on that the coronavirus was \"deadly stuff\" but wanted to \"play it down.\" Woodward himself has drawn considerable criticism for not reporting Trump's comments sooner - and the president has seized on the #BobWoodwardKnew issue. Trump said the following in a tweet on Thursday morning: “ 'Bob Woodward had my quotes for many months. If he thought they were so bad or dangerous, why didn't he immediately report them in an effort to save lives? Didn't he have an obligation to do so? No, because he knew they were good and proper answers. Calm, no panic!' ” - President Donald Trump Woodward, for his part, told the Associated Press on Wednesday that he needed time to be sure that Trump's private comments from a half-year ago were accurate. \"He tells me this, and I'm thinking, 'Wow, that's interesting, but is it true?' Trump says things that don't check out, right?\" Woodward said in an interview with the AP. Using a phrase from the Watergate era, the reporter and bestselling author added that his mission was to determine \"What did he know and when did he know it?\" Related:Trump responds to Woodward book saying he played down coronavirus: 'We had to show calm' And see:Trump knew the coronavirus was 'deadly stuff' but wanted to 'play it down,' according to Woodward book But Woodward's critics accused him of being mostly interested in sales of his new book, titled \"Rage.\" \"Bob Woodward's nonfeasance in the face of this disaster should stand with Walter Duranty's covering for Stalin in the matter of the Ukrainian famine as eternal embarrassments to journalism and to simple humanity,\" wrote Charles P. Pierce in an Esquire column. Pierce is among the commentators suggesting that Woodward's behavior has been as bad as Trump's, while many others have said Trump deserves more blame."}]}