{"article": [{"url": "https://www.marketwatch.com/story/billionaire-investor-ray-dalio-warns-us-china-conflict-could-become-a-capital-war-that-hits-the-dollar-2020-07-27", "published": 1595932340.0, "headline": "Billionaire investor Ray Dalio fears for the dollar and the â\u0080\u0098soundness of our money,â\u0080\u0099 and hereâ\u0080\u0099s why", "body": "Billionaire investor Ray Dalio has warned the conflict between the U.S. and China could develop into a â\u0080\u009ccapital warâ\u0080\u009d which would hit the dollar. The dollar DXY, -0.58% Â slipped to its lowest level in two years on Monday as it lost more ground to major rivals. â\u0080\u009cThereâ\u0080\u0099s a trade war, thereâ\u0080\u0099s a technology war, thereâ\u0080\u0099s a geopolitical war and there could be a capital war â\u0080\u0094 thatâ\u0080\u0099s the reality,â\u0080\u009d Dalio said on Foxâ\u0080\u0099s â\u0080\u009cSunday Morning Futures.â\u0080\u009d â\u0080\u009cIf you say by law, donâ\u0080\u0099t invest in China or even possibly withholding the payment of bonds that the United States owes payment on in China, these things are possibilities and they have big implications, such as for the value of the dollar because premarket investors are not used to having those things dictated by the government,â\u0080\u009d he said. The Bridgewater Associates founder added that these difficult questions had to be â\u0080\u009cwell-addressedâ\u0080\u009d and it was a challenge for the government to get the policy right. The hedge fund firm laid off several dozen employees across the company this month. The U.S. dollar has slipped in recent months â\u0080\u0094 the ICE U.S. Dollar Index, which measures the currency against a basket of six rivals, reached a 22-month low on Friday and fell lower again on Monday to two-year lows. On March 22, the index hit a more-than-three year intraday high. When asked whether he was worried about the dollar, Dalio warned the U.S. was its â\u0080\u009cown worst enemyâ\u0080\u009d and that he was concerned about the â\u0080\u009csoundness of our money.â\u0080\u009d â\u0080\u009cYou canâ\u0080\u0099t continue to run deficits, sell debt or print money rather than be productive and sustain that over a period of time. â\u0080\u009cIf we donâ\u0080\u0099t work together to do the sound things, to be productive, to earn more than we spend, to build the stability of our currency and build a good balance sheet, we are going to decline,â\u0080\u009d he added. Dalioâ\u0080\u0099s hedge-fund firm laid off several dozen employees across the company this month."}]}