{"article": [{"url": "https://www.marketwatch.com/story/trump-visits-north-carolina-as-latest-polls-give-him-an-edge-in-that-swing-state-11599063604", "published": 1599062240.0, "headline": "Trump visits North Carolina as latest polls give him an edge in that swing state", "body": "President Donald Trump speaks at the Battleship North Carolina in Wilmington, N.C., on Wednesday, the 75th anniversary of the end of WWII. AFP via Getty Images President Donald Trump on Wednesday made another visit to North Carolina, as the latest polling in that swing state shows him regaining a slight edge over Democratic challenger Joe Biden in the wake of last month’s party conventions. Trump delivered a speech in Wilmington, N.C., about its designation as the first American World War II Heritage City. The port city is known in part for being home to a major shipyard during World War II, as well as for currently being home to the Battleship North Carolina, which served as a backdrop during the president’s remarks. “With this designation, we proudly declare that in America, we don’t tear down the past. We celebrate our heroes. We cherish our heritage,” Trump said, in a reference to how statues around the world are being removed amid a re-examination of racial injustices. The president praised World War II veterans who attended his speech, such as 97-year-old Medal of Honor recipient Hershel “Woody” Williams. “He’s 100% sharp. I know a 78-year-old that’s not so sharp, but he’s 97 and he’s 100%,” Trump said, in a reference to Biden, who is 77 and will turn 78 in November. Both Trump, who is 74, and Biden have been criticized as being too old to serve as president. Opinion: As Trump and Biden trade age insults, older workers suffer Ahead of Trump’s trip on Wednesday, the Biden campaign issued a statement from the former vice president criticizing the Republican incumbent. “President Trump likes to call himself a wartime president, but the reality is that North Carolinians are still suffering because he surrendered to COVID-19 long ago,” Biden said in the statement. “Instead of providing North Carolina the roadmap and resources needed to protect small businesses, schools, and families, he has criticized local leaders and threatened educators for listening to public health experts.” Biden also gave a speech Wednesday in which he attacked Trump’s push for schools to reopen quickly amid the coronavirus pandemic. Trump’s Wednesday trip follows his in-person appearance at a Republican National Convention event in Charlotte last week, when he said he “felt an obligation” to be in North Carolina, a state “that’s been very good to me.” He also criticized Biden for not going in person to his convention in Wisconsin, another battleground state. Trump is slated to campaign on Thursday in Pennsylvania, a swing state that Biden visited on Monday. Related: Trump lays blames with Democrats as he surveys ‘destruction’ in Kenosha, Wis. And see: Biden plans Kenosha, Wis., visit on Thursday In a RealClearPolitics moving average of North Carolina polls as of Wednesday, Trump is leading Biden by 1 percentage point, after being down by 5 points a month ago. In swing states overall ahead of the Nov. 3 election, Biden still has a 2.5-point advantage over Trump, but that’s down from a 6-point edge a month ago, according to a RCP average. Betting markets give Biden just a 50.2% chance of winning vs. 61% a month ago. The main U.S. stock gauges DJIA, +0.56% SPX, +0.87% COMP, +1.39% were recently trading higher on Wednesday, after the S&P 500 and Nasdaq notched fresh record closes on Tuesday."}]}