{"article": [{"url": "https://www.marketwatch.com/story/oil-loses-ground-as-uncertainty-lingers-over-demand-2020-08-17", "published": 1597679240.0, "headline": "Oil ends higher, buoyed by OPEC+ compliance with cuts", "body": "Oil futures shook off early weakness Monday, with its resilience attributed in part to reports China would boost U.S. crude imports and that OPEC+ members largely complied with production cuts last month. West Texas Intermediate crude for September delivery US:CLV20 on the New York Mercantile Exchange rose 88 cents, or 2.1% to finish at $42.89 a barrel. The global benchmark, October Brent crude UK:BRNV20, gained 57 cents, or 1.3% to settle at $45.37a barrel on ICE Futures Europe. Reuters late Friday reported that Chinese state-owned oil companies had tentatively booked tankers to carry at least 20 million barrels of U.S. crude in August and September. This has implied that Sino-American tensions aren’t as bad as first feared and that demand for oil is gradually increasing as countries begin to open up their borders and return to normality,” said Mihir Kapadia, chief executive of Sun Global Investments, in emailed comments. Meanwhile, compliance with OPEC+ production cuts was around 95% to 97% — a historically high level — in July, Reuters reported Monday, citing a draft report. But analysts said uncertainty over the global demand outlook following a resurgence in cases in parts of Europe and elsewhere could continue to limit upside. October Brent’s discount to the November deepened Monday and stands at more than 50 cents for the first time since late May, observed Warren Patterson, head of commodities strategy at ING, in a note.The contango, in which deferred contracts trade at a premium to nearby contracts, raises questions about how quickly the market is drawing down stocks, he said. “Clearly the market is not tightening as quickly as initially anticipated. Demand is taking longer than expected to get back to normal levels,” he said, noting last week’s monthly reports from the Organization of the Petroleum Exporting Countries, or OPEC, and the International Energy Agency both cut forecasts for demand growth. On the supply front, investors will be watching a meeting this week of the Joint Ministerial Monitoring Committee, the panel set up by OPEC and its allies, a group known as OPEC+, to monitor production. OPEC+ this month relaxed earlier output curbs, reducing output by 7.7 million barrels a day versus the reduction of 9.7 million barrels a day put in place in May. Read:OPEC+ committee expected to take ‘wait-and-see’ approach on output as oil prices reflect ‘new normal’ September gasoline futures US:RBU20 rose 2.54 cents, or 2%, ending at to $1.27 a gallon, while September heating oil US:HOU20 gained 0.24 cent, or 0.2%, to close at $1.2391 a gallon. September natural gas US:NGU20 fell 1.70 cents, or 0.7%, to end at $2.339 per million British thermal units."}]}