{"article": [{"url": "https://www.marketwatch.com/story/what-can-zoom-do-for-a-sequel-to-one-of-the-most-astounding-earnings-blowouts-of-all-time-11598724433", "published": 1598883440.0, "headline": "What can Zoom do for a sequel to one of the most astounding earnings blowouts of all time?", "body": "Zoom Video Communications Inc. enjoyed one of the biggest blowout earnings reports in history in early June, as the COVID-19 pandemic made the company’s name synonymous with videoconferencing and attracted millions of new users to its service. Zoom’s ZM, +2.89% profit roared more than ten times higher, revenue exploded with 169% growth, and the company doubled its expectations for full-year sales. An analyst on Zoom’s conference call called the quarter perhaps the greatest in enterprise-software history, and Zoom shares — which many believed had run too far heading into that report — have gained more than 80% in the three months since. For more: Zoom’s astounding quarter shows it expects to be a force even after workers go back to the office There is only one problem with that type of performance: How do you follow it up ? On Wall Street, an outstanding performance only increases expectations for it to repeat when Zoom reports second-quarter earnings Monday afternoon. Morgan Stanley analysts reported last week that the “buy-side” expects Zoom to beat consensus estimates by about 30%, even after the company’s forecast for about a half-billion dollars in revenue for the quarter sent analysts’ estimates soaring. And even Morgan Stanley analysts, who are not as bullish on Zoom as other banks with an equal-weight rating on the stock, believe Zoom will meet those expectations — at least for now. “In general, we think that buy-side expectations for FQ2 (~30% beat) can be achieved and that the company will have flexibility to guide down slightly or flat sequentially, creating little risk heading into the quarter,” the analysts wrote in an Aug. 20 note in which they increased their price target on Zoom to $240 from $190. “However, with buy-side expectations calling for significant continuation of growth trajectory into FY22 and FY23, we are aware that there could be some valuation contraction as sequential growth slows in the back half.” Analysts cited strong growth in app downloads and users as reasons for yet another strong performance, as well as users signing up for paid plans after getting their feet wet with a free account earlier in the pandemic. “App downloads [and monthly active users] remain strong and we show a path to F2Q21 revenue well ahead of consensus expectations (and likely buy side expectations as well) serving as a near-term catalyst for additional share appreciation,” RBC Capital Markets analysts wrote in an Aug. 17 note titled “All I Wanna Do is Zoom-A-Zoom-Zoom,” a reference to the early-90s rap hit “Rump Shaker.” The analysts, who maintained at outperform rating and raised their price target to $300 from $250, said that data from SensorTower shows metrics are seeing “moderation from April peaks yet remain significantly above pre-COVID levels.” Zoom has also been pushing new initiatives, expanding its Zoom Phone cloud-telephony service to new countries and introducing a hardware-as-a-service offering as well as a Zoom for Home device. While that may not make a material difference immediately, it is additive for the long term and helps Zoom compete against legacy offerings like Cisco Systems Inc.’s CSCO, +0.15% WebEx. “We also continue to view Zoom Phone as an interesting component of the company’s market opportunity,” William Blair analysts said in a Wednesday note that maintained an overweight rating. “Our industry conversations suggest that continued development around this product, as well as persistent expansion of native international support, is driving competitive wins against legacy solutions as well as modern UCaaS providers.” While continuing to try to nab customers from competitors, Zoom may already have the largest share of the videoconferencing market. JP Morgan analysts reported on July 31 that Zoom has now captured roughly half of the videoconferencing market just more than a year after its initial public offering. “Zoom has captured the biggest portion of market share, increasing from ~34% of total MAU’s back in March, to over 48% as of July 24th,” the analysts wrote while maintaining an overweight rating. ” Google GOOGL, +1.82% GOOG, +1.97% also seems to have captured market share, but their offering is free leveraging what we think to be education customers and smaller businesses that are not where we see the biggest long-term opportunity for Zoom.” What to expect Earnings: Analysts on average expect adjusted earnings of 45 cents a share, according to FactSet, up from 8 cents a share a year ago, after Zoom guided for adjusted earnings of 44 cents to 46 cents a share. Analysts were predicting 11 cents a share in adjusted earnings ahead of the last earnings report from Zoom. Estimize, a software platform that crowdsources estimates from hedge-fund executives, brokerages, buy-side analysts and others, reports an average projection of 50 cents a share in adjusted earnings. Revenue: Analysts on average expect revenue of $500 million, according to FactSet, up from $146 million a year before, after Zoom projected sales of $495 million to $500 million. Analysts were expecting less than $225 million on average before Zoom increased its forecast in early June. Contributors to Estimize expect revenue of $531.9 million on average. Stock movement: Zoom stock has increased the day after the company released earnings in three of five instances since the company went public, including both events so far in 2020, when shares increased 7% and 7.6% respectively. The stock overall has more than quadrupled this year, gaining 361.7% as the S&P 500 index SPX, +0.87% has gained 8.6%."}]}