{"article": [{"url": "https://www.marketwatch.com/story/wayfair-is-on-sps-most-vulnerable-list-despite-soaring-stock-new-customer-numbers-2020-08-17", "published": 1597753580.0, "headline": "Wayfair is on S&Pâ\u0080\u0099s â\u0080\u0098most vulnerableâ\u0080\u0099 list despite soaring stock, new customer numbers", "body": "Wayfair Inc. has made it to S&P Global Market Intelligenceâ\u0080\u0099s list of â\u0080\u009cMost Vulnerable Public American Retailersâ\u0080\u009d despite recently reporting that it served millions of new customers and saw sales skyrocket in the most recent quarter. As of August 14, S&P puts Wayfairâ\u0080\u0099s W, -2.59% Â one-year probability of default at 18.6%, and two-year probability of default at 24%. Earlier this month, Wayfair reported an 84% rise in second-quarter revenue, and adjusted earnings per share of $3.13 after a loss of $1.35 last year. The e-commerce home goods retailer said it served five million new customers in the quarter. Read:Wayfair served almost 5 million new customers in the second quarter but analysts question whether theyâ\u0080\u0099ll return S&P Global Market Intelligence The home goods and furnishings category has been strong during the COVID-19 pandemic as shoppers spend more time at home and look to finish do-it-yourself projects. As an online retailer, Wayfair has also benefited from the accelerated shift to e-commerce. â\u0080\u009cIn the near term, we see the reallocation of consumer discretionary spending from travel and entertainment likely continuing to drive stronger expenditures on home goods, while longer term the pandemic could be a catalyst for accelerating e-commerce adoption of the category,â\u0080\u009d wrote Canaccord Genuity analysts led by Maria Ripps. â\u0080\u009cIn the meantime, Wayfairâ\u0080\u0099s model is exhibiting signs of strong scale and leverage, as the platform remains well-positioned to take advantage of this heightened demand.â\u0080\u009d Canaccord rates Wayfair stock buy with a $340 price target. Wayfair stock has soared 247.4% for the year to date while the S&P 500 index SPX, +0.87% Â is up 4.8% for the period. The SPDR S&P Retail ETF XRT, +0.05% Â is up 13.5% for 2020 so far and the Amplify Online Retail ETF IBUY, +1.39% Â is up 79.4%. However, some analysts expect the soaring growth to come to an end. Also:Stein Mart files for bankruptcy as analysts forecast pressure on usually robust off-price retail â\u0080\u009cFrom our data, consumers have already started to return to physical stores and online penetration levels in furniture and home furnishings have dropped from their peak in April,â\u0080\u009d wrote Neil Saunders, managing director of GlobalData Retail. â\u0080\u009cWhile we believe online sales will remain elevated in home related categories â\u0080\u0094 which will be helpful to Wayfair â\u0080\u0094 the trends of this quarter will not be repeated indefinitely.â\u0080\u009d The S&P list comes as the latest government data indicates slowing retail spending. For the month of July, retail sales grew 1.2%, down from an 8.4% increase in June. Read:Retail sales climb 1.2% in July and return to precrisis levels, but growth slows as stimulus fades Also on S&Pâ\u0080\u0099s list of most vulnerable retailers are Blue Apron Holdings Inc. APRN, +1.60% Â , which has also made gains during the pandemic, and a new addition, womenâ\u0080\u0099s apparel retailer J.Jill Inc. JILL, +6.45% â\u0080\u009cJ.Jill has extended a forbearance period multiple times in recent months,â\u0080\u009d S&P Global says. â\u0080\u009cIts current extension, announced Aug. 13, will last until Aug. 27 and prevents creditors from taking action against the chain.â\u0080\u009d There have been 44 U.S. retail bankruptcies in 2020 so far, with six chapter 11 filings between late-July and mid-August. There were 32 U.S. retail bankruptcy filings in all of 2019. Stein Mart Inc. US:SMRT Â announced its bankruptcy filing last week, with other recent filings including Ann Taylor parent Ascena Retail Group Inc. ASNAQ, -6.83% Â and Menâ\u0080\u0099s Wearhouse parent Tailored Brands Inc. TLRDQ, -1.69% Â"}]}