{"article": [{"url": "https://www.marketwatch.com/story/feds-kashkari-expects-continued-economic-recovery-but-only-in-a-grinding-fashion-11601483863", "published": 1601469920.0, "headline": "Fedâ\u0080\u0099s Kashkari expects continued economic recovery but only in a â\u0080\u0098grindingâ\u0080\u0099 fashion", "body": "Minneapolis Fed President Neel Kashkari said he has not been back inside a restaurant for a sit-down meal since March. Getty Images The U.S. economic recovery is likely to proceed but it is going to feel like a car that might need a new transmission, said Minneapolis Fed President Neel Kashkari on Wednesday. â\u0080\u009cUnless something dramatic changes or we have a breakthrough sooner than we expect on vaccines, or there is some dramatic change in policy, I think we are in for a grinding recovery from here,â\u0080\u009d Kashkari said in a talk to a trade group of Wisconsin manufacturers. To date, the pace of the economic recovery has been faster than expected, but this is a â\u0080\u009cdouble-edged sword,â\u0080\u009d he said. Part of the reason for the unexpectedly quick bounce back in the last few months from the slump earlier this year, caused by the coronavirus pandemic, is that states allowed businesses to re-open more quickly than health experts said was advisable, and this has led to predictable flare ups of coronavirus cases, first in the U.S. South and now in Wisconsin and Minnesota. As a result, consumers and businesses are getting nervous about spending and investing. It all comes back to the virus, the Minneapolis Fed president said. â\u0080\u009cUntil we really get control of the virus and until all of us have confidence thatâ\u0080¦it is safe to go back to normal with our families, weâ\u0080\u0099re going to see a muted economic recovery,â\u0080\u009d he added. Kashkari said it was important that Congress pass another round of federal relief for small businesses and workers who have lost jobs. â\u0080\u009cI hope Congress is going to do more,â\u0080\u009d he said. There are already many bankruptcies of many businesses and if this trend continues it will be very costly for the economy and workers risk not being able to pay mortgages. â\u0080\u009cThe longer this goes on, the more these losses will multiply and then roll into the banking sector, which could put pressure on our financial system,â\u0080\u009d he said. One positive note is that experts are more optimistic there will be a vaccine for COVID-19 than they were six months ago. Initially, experts doubted whether a vaccine would be found, noting that there still has yet to be a vaccine for HIV."}]}