{"article": [{"url": "https://www.marketwatch.com/story/charting-a-bullish-summer-start-nasdaq-takes-flight-to-record-territory-2020-06-23-121034033", "published": 1592917340.0, "headline": "Charting a bullish summer start, Nasdaq takes flight to record territory", "body": "Editor’s Note: This is a free edition of The Technical Indicator, a daily MarketWatch subscriber newsletter. To get this column each market day, click here. Technically speaking, the U.S. benchmarks’ bigger-picture backdrop remains bullish, on balance, despite increasingly uneven market price action. On a headline basis, the Nasdaq Composite has taken flight — reaching record highs, atop the 10,000 mark — while the S&P 500 remains range-bound, digesting a sharp reversal from the June low. Before detailing the U.S. markets’ wider view, the S&P 500’s US:SPX hourly chart highlights the past two weeks. As illustrated, the S&P has asserted a one-week range, digesting the bullish reversal from the June low. The range top closely matches the November peak (3,154). The S&P has registered tandem session highs within one point of resistance. Similarly, the Dow Jones Industrial Average US:DJIA remains range-bound. In its case, the 200-day moving average, currently 26,306, has marked a recent sticking point. The latest retest from underneath is underway Tuesday. Conversely, the prevailing range bottom has matched major support (25,758), an area also detailed on the daily chart. True to recent form, the Nasdaq Composite US:COMP remains the strongest major benchmark. In fact, Monday’s close (10,056) marked the Nasdaq’s best close on record. The index has followed through to uncharted territory early Tuesday. The prevailing upturn punctuates a successful test of first support (9,868). Widening the view to six months adds perspective. On this wider view, the Nasdaq has sustained the late-June rally atop its former breakout point (9,838). The prevailing one-week range signals muted selling pressure near record highs, laying the groundwork for Tuesday’s early follow-through. An intermediate-term target projects to the 10,610 area. Looking elsewhere, the Dow Jones Industrial Average remains the weakest major benchmark. Recall that the 200-day moving average defined the recent bearish island reversal. The Dow is vying to snap a stretch of eight straight closes under the 200-day. Conversely, familiar support matches the May peak (25,758) and the February gap (25,752), an area also detailed on the hourly chart. Delving deeper, major support matches the June 2019 low (24,680) and February 2020 low (24,681). Also recall the ascending 50-day moving average, currently 24,822, a level that underpinned the May low. The Dow’s recovery attempt is intact barring a violation. Meanwhile, the S&P 500 is digesting a bullish reversal from major support (2,954). To reiterate, the prevailing upturn has effectively nailed the November peak (3,154). Tandem session highs last week registered within one point. The bigger picture As detailed above, the major benchmarks remain in divergence mode — each index is doing different things — though the bigger-picture backdrop is constructive. Broadly speaking, each benchmark’s intermediate-term bias remains bullish. Moving to the small-caps, the iShares Russell 2000 ETF remains capped by its 200-day moving average, currently 147.00. Conversely, trendline support tracks the 50-day moving average, currently 133.20, and is rising toward the breakout point (136.20). The prevailing recovery attempt is intact barring a violation. Similarly, the SPDR S&P MidCap 400 ETF has stalled near its 200-day moving average, currently 336.72. Here again, the 50-day moving average is rising toward the breakout point. Looking elsewhere, the SPDR Trust S&P 500 has maintained its 200-day moving average (301.50), outpacing the small- and mid-caps, as well as the Dow industrials. Conversely, familiar gap resistance — spanning from 312.15 to 313.00 — remains a sticking point. This area has capped the SPY on a closing basis across eight straight sessions. Placing a finer point on the S&P 500, its backdrop remains relatively straightforward. To start, the index has asserted a well-defined range capped by resistance closely matching the November peak (3,154). Also recall the sharp gap lower, eight-sessions ago, punctuating a bearish island reversal fueled by aggressive 9-to-1 negative breadth. (Declining volume surpassed advancing volume by a 9-to-1 margin.) In a textbook world, two 9-to-1 down days, across about a seven-session window, reliably signals a major trend shift. Today marks Day 9 in the prevailing sequence, and downside follow-through has yet to surface. So based on the current backdrop, the initial downturn marks a one-day wonder, registering immediately after the Federal Reserve’s latest policy statement. (Fed statement-fueled market moves are frequently fleeting, and lack lasting technical significance.) More immediately, market bulls will point to the five-session range, a bullish continuation pattern hinged to last Monday’s sharp rally from the June low, a greater than 8-to-1 up day. Eventual follow-through to fill the gap would neutralize the bearish island reversal. More broadly, the S&P’s 50-day moving average, currently 2,966, has risen to surpass major support (2,954). (Also see the June 12 review.) This area also closely matches the June low (2,965) established last week. The S&P 500’s intermediate- to longer-term bias remains bullish barring a violation. Also see: Charting a successful technical test, S&P 500 maintains major support.Tuesday’s Watch List The charts below detail names that are technically well positioned. These are radar screen names — sectors or stocks poised to move in the near term. For the original comments on the stocks below, see The Technical Indicator Library. Drilling down further, the SPDR Gold Shares ETF US:GLD is acting well technically. As illustrated, the shares have rallied to the range top, tagging a seven-year high, the best level since December 2012. The upturn punctuates an orderly 10-week range — a continuation pattern — and has been fueled by increased volume, improving the chances of a more decisive breakout. An intermediate-term target projects to the 172 area on follow-through. More broadly, the shares are well positioned on the 15-year chart, building on the steep late-2019 breakout. Profiled last week, the SPDR S&P Biotech ETF has knifed to all-time highs. The upturn punctuates a tight six-week range, a continuation pattern hinged to the V-shaped reversal from the March low. To reiterate, an intermediate-term target projects to the 117 area. Conversely, the breakout point (108.00) is followed by the ascending 50-day moving average. The 50-day has marked a bull-bear inflection point, and the prevailing rally attempt is intact barring a violation. Initially profiled March 27, Apple, Inc. US:AAPL has returned 38.9% and remains well positioned. Earlier this month, the shares knifed to record territory, clearing resistance matching the February peak. The upturn marked a bullish two standard deviation breakout, encompassing four straight closes atop the 20-day volatility bands. Apple has subsequently sustained the breakout, asserting a tight one-week range, a flag-like pattern, pinned to the decisive early-month spike. A near-term target projects to the 375 area on follow-through. Tactically, the prevailing range bottom (344.70) is followed by the post-breakout low (332.60). A sustained posture higher signals a firmly-bullish bias. Splunk, Inc. US:SPLK is a large-cap software vendor positioned to rise. The shares initially spiked four weeks ago, gapping to record territory after the company’s first-quarter results. By comparison, the subsequent pullback has been orderly, underpinned by the top of the gap and trendline support. More immediately, the prevailing upturn has been fueled by a volume uptick, positioning the shares to build on the initial May spike. A near-term target projects to the 205 area on follow-through. Finally, Hologic, Inc. US:HOLX is a large-cap manufacturer of medical imaging systems and diagnostic products. As illustrated, the shares have rallied to the range top, rising to challenge record territory. The upturn punctuates a seven-week range — and has been fueled by increased volume — laying the groundwork for potentially decisive follow-through An intermediate-term target projects to the 59 area. More broadly, the shares are well positioned on the three-year chart, rising from a bullish V-shaped reversal. Editor’s Note: This is a free edition of The Technical Indicator, a daily MarketWatch subscriber newsletter. To get this column each market day, click here.Still well positioned The table below includes names recently profiled in The Technical Indicator that remain well positioned. For the original comments, see The Technical Indicator Library. Company Symbol* (Click symbol for chart.) Date Profiled First Solar, Inc. FSLR June 22 Momenta Pharmaceuticals, Inc. MNTA June 22 SPDR S&P Biotech ETF XBI June 19 Lowe’s Companies LOW June 19 Fiverr International, Ltd. FVRR June 19 Chegg, Inc. CHGG June 18 Fastly, Inc. FSLY June 18 Arena Pharmaceuticals, Inc. ARNA June 18 Dollar Tree, Inc. DLTR June 17 Etsy, Inc. ETSY June 17 Skyworks Solutions, Inc. SWKS June 16 Lululemon Athletica, Inc. LULU June 16 Carvana Co. CVNA June 10 McDonald’s Corp. MCD June 9 Williams-Sonoma, Inc. WSM June 9 HubSpot, Inc. HUBS June 8 Square, Inc. SQ June 8 Energy Select Sector SPDR XLE June 8 SPDR S&P Oil & Gas Exploration & Production ETF XOP June 5 United Parcel Service, Inc. UPS June 5 Micron Technology, Inc. MU June 5 Xilinx, Inc. XLNX June 4 KLA Corp. KLAC June 4 VMware, Inc. VMW June 3 FedEx Corp. FDX June 3 SPDR S&P Retail ETF XRT June 3 ASML Holding N.V. ASML June 1 Datadog, Inc. DDOG June 1 iShares MSCI Japan ETF EWJ May 29 SolarEdge Technologies, Inc. SEDG May 29 Splunk, Inc. SPLK May 28 Financial Select Sector SPDR XLF May 28 Microchip Technology, Inc. MCHP May 27 Synopsis, Inc. SNPS May 27 SSR Mining, Inc. SSRM May 27 Twilio, Inc. TWLO May 26 Take-Two Interactive Software, Inc. TTWO May 26 Lam Research Corp. LRCX May 26 Marvell Technology Group, Ltd. MRVL May 26 Cisco Systems, Inc. CSCO May 21 Beyond Meat, Inc. BYND May 21 SPDR S&P Metals and Mining ETF XME May 20 Agios Pharmaceuticals, Inc. AGIO May 20 General Mills, Inc. GIS May 20 Cree, Inc. CREE May 20 Applied Materials, Inc. AMAT May 19 Fortinet, Inc. FTNT May 18 II-VI, Inc. IIVI May 18 Alteryx, Inc. AYX May 18 iShares Silver Trust SLV May 15 Agnico Eagle Mines, Ltd. AEM May 15 Agilent Technologies, Inc. A May 15 Halozyme Therapeutics, Inc. HALO May 15 Wix.com, Ltd. WIX May 13 Extreme Networks, Inc. EXTR May 13 Qualcomm, Inc. QCOM May 12 Zynga, Inc. ZNGA May 12 Kinross Gold Corp. KGC May 11 Avalara, Inc. AVLR May 8 Salesforce.com, Inc. CRM May 8 Facebook, Inc. FB May 7 Spotify Technology S.A. SPOT May 5 CrowdStrike Holdings, Inc. CRWD May 4 iRobot Corp. IRBT May 4 F5 Networks, Inc. FFIV May 1 Cummins, Inc. CMI Apr. 30 AudioCodes, Ltd. AUDC Apr. 30 Inphi Corp. IPHI Apr. 29 Qorvo, Inc. QRVO Apr. 29 Old Dominion Freight Line, Inc. ODFL Apr. 29 Dollar General Corp. DG Apr. 28 AngloGold Ashanti Ltd. AU Apr. 28 Cadence Design Systems, Inc. CDNS Apr. 27 ServiceNow, Inc. NOW Apr. 27 Snap, Inc. SNAP Apr. 27 Abbott Laboratories ABT Apr. 24 Five9, Inc. FIVN Apr. 24 Chewy, Inc. CHWY Apr. 24 Tesla, Inc. TSLA Apr. 23 Shopify, Inc. SHOP Apr. 23 iShares Nasdaq Biotechnology ETF IBB Apr. 21 Teradyne, Inc. TER Apr. 20 Electronic Arts, Inc. EA Apr. 20 VanEck Vectors Semiconductor ETF SMH Apr. 17 Health Care Select Sector SPDR XLV Apr. 17 Coupa Software, Inc. COUP Apr. 17 Veeva Systems, Inc. VEEV Apr. 17 American Tower Corp. AMT Apr. 17 Okta, Inc. OKTA Apr. 16 Target Corp. TGT Apr. 16 Intel Corp. INTC Apr. 14 Netflix, Inc. NFLX Apr. 14 VanEck Vectors Gold Miners ETF GDX Apr. 14 Invesco QQQ Trust QQQ Apr. 14 SBA Communications Corp. SBAC Apr. 13 Akamai Technologies, Inc. AKAM Apr. 13 Ciena Corp. CIEN Apr. 6 Seattle Genetics, Inc. SGEN Apr. 6 DocuSign, Inc. DOCU Apr. 3 Zscaler, Inc. ZS Apr. 3 Moderna, Inc. MRNA Apr. 3 RingCentral, Inc. RNG Mar. 30 Activision Blizzard, Inc. ATVI Mar. 30 Regeneron Pharmaceuticals, Inc. REGN Mar. 30 Apple, Inc. AAPL Mar. 27 Nvidia Corp. NVDA Mar. 27 Dexcom, Inc. DXCM Mar. 27 Amazon.com, Inc. AMZN Mar. 26 Stamps.com, Inc. STMP Mar. 26 Quidel Corp. QDEL Mar. 26 Domino’s Pizza, Inc. DPZ Mar. 20 Kroger Co. KR Mar. 19 Zoom Video Communications, Inc. ZM Mar. 19 iShares MSCI Emerging Markets ETF EEM Mar. 19 Newmont Corp. NEM Jan. 13 Atlassian Corp. TEAM Jan. 7 SPDR Gold Shares ETF GLD Jan. 2 Advanced Micro Devices, Inc. AMD Nov. 7 Teledoc Health, Inc. TDOC Nov. 1 Costco Wholesale Corp. COST Mar. 6 Microsoft Corp. MSFT Feb. 22 * Click each symbol for current chart."}]}