{"article": [{"url": "https://www.marketwatch.com/story/the-us-cant-shut-down-the-economy-again-treasury-secretary-mnuchin-says-2020-06-11", "published": 1591876640.0, "headline": "The U.S. 'can't shut down the economy again,' Treasury Secretary Mnuchin says", "body": "The U.S. Treasury secretary on Thursday said the U.S. \"can't shut down the economy again,\" amid growing worries about a rise in coronvirus cases in states such as Texas and Arizona that were among the first to reopen after a two-month nationwide lockdown. Steven Mnuchin, in an interview with CNBC, said shutting down the economy a second time is not a realistic course of action. The harm to the economy and spillover effects is too great, he said. \"I think we've learned that if you shut down the economy, you're going to create more damage,\" Mnuchin said. \"\"And not just economic damage, but there are other areas and we've talked about this: medical problems and everything else that get put on hold.\" Read:U.S. entered recession in February after end of longest expansion in history Some states that reopened before others have seen a surge in coronavirus cases. There's also a risk that widespread nationwide protests over the killing of George Floyd could trigger another spike in cases in the next week or so. Fresh worries another potential wave of infections contributed to a sharp decline in U.S. stocks in Thursday trading as did a gloomy economic outlook from the Federal Reserve on Wednesday. The Dow Jones Industrial Average DJIA, +0.56%  fell by more than 1,000 points at its Thursday nadir. Coronavirus update:U.S. cases pass 2 million mark and 21 states still seeing rising infections The Trump administration, however, can't do very much if states decide to tighten restrictions again. Governors have lots of leeway to craft their own rules and guidelines regardless of what the federal government recommends. Read: Revisiting that funky drop in unemployment to 13.3%: Nobody really believes it Yet state officials face also pressure from their own residents and it's unclear if a majority of Americans would comply with another lockdown. Millions of people have lost their jobs and many are eager to get back to work lest their job be lost permanently, though they also worry about their safety. Read:Jobless claims rise slower 1.54 million in early June, but layoffs still extremely high Against that backdrop the 2020 presidential election looms large. The Trump White House is worried that the president will lose reelection in November unless the economy starts to improve. The president has encouraged states to reopen and plans to resume public campaign rallies soon."}]}