{"article": [{"url": "https://www.marketwatch.com/story/georgia-governors-order-explicitly-voids-mask-requirements-in-15-municipalities-2020-07-16", "published": 1594931780.0, "headline": "Georgia governor sues to block Atlanta from enforcing face-mask requirement", "body": "ATLANTA — Georgia Gov. Brian Kemp is suing Atlanta’s mayor and city council to block the city from enforcing its mandate to wear a mask in public and other rules related to the COVID-19 pandemic. Kemp and Georgia Attorney General Chris Carr, in a suit filed in state court late Thursday in Atlanta, argue that Atlanta Mayor Keisha Lance Bottoms has overstepped her authority and must obey Kemp’s executive orders under state law. “Governor Kemp must be allowed, as the chief executive of this state, to manage the public health emergency without Mayor Bottoms issuing void and unenforceable orders which only serve to confuse the public,” the lawsuit states. Kemp on Wednesday clarified his executive orders to expressly block Atlanta and at least 14 other local governments across the state from requiring people to wear face coverings. Kemp’s order was met with defiance Thursday by Bottoms and some other mayors, who said they would continue enforcing the order. The lawsuit forces that showdown, resolving an ambiguous situation with Kemp denying local governments could order masks, but local governments arguing it was within their power. Bottoms said Thursday during a video news conference that the city’s order is still in effect. “As of today, 3,104 Georgians have died and I and my family are amongst the 106,000 who have tested positive for COVID-19,” Bottoms said in a statement after the lawsuit was filed. “A better use of taxpayer money would be to expand testing and contact tracing. If being sued by the state is what it takes to save lives in Atlanta, then we will see them in court.” The state asks a judge to overturn Bottoms’ orders that are more restrictive than Kemp’s, block her from issuing any more such orders, instruct the City Council not to ratify Bottoms’ actions or adopt any ordinances inconsistent with Kemp, to force Bottoms not to make any public statements claiming she has authority that exceeds Kemp’s, and to require city officials to enforce “all provisions” of Kemp’s existing orders. In filing the lawsuit, Kemp combined a previous dispute with Bottoms over policing in the city with coronavirus control. He said he was suing to protect business owners and employees in the same way he called out the National Guard last week to protect state office buildings and the governor’s mansion after an 8-year-old girl was fatally shot July 4 by armed men at a site where a white Atlanta police officer shot and killed a Black man who had grabbed a stun gun and ran. The shooting of Rayshard Brooks prompted unrest, including the burning of the fast food restaurant at the site, and complaints that armed people were blocking traffic with no police intervention. The city struggled at times to provide officers after many called in sick when a prosecutor, over Bottoms’ objection, criminally charged the officers involved. Kemp also alleged in his lawsuit that Bottoms has forbidden police from enforcing Kemp’s earlier orders against gatherings of more than 50 people. Officials in at least 15 Georgia cities and counties had ordered masks during the coronavirus pandemic, and many were angry at Kemp for swatting down their efforts. “How can we take care of our local needs when our state ties our hands behind our back and then says ‘Ignore the advice of experts?’” Savannah Mayor Van Johnson asked in a news conference. Bottoms last week made statements that people had to return to sheltering at home and forcing restaurants to return to only offering takeout and delivery. Kemp quickly swatted those claims down, and Bottoms on Thursday described them as guidelines. But Kemp’s lawsuit says the court should set Bottoms straight on those statements as well, and forbid her from making more claims about her power to reporters. Kemp says he strongly supports mask-wearing to combat the spread of COVID-19 infections. He traveled the state this month to encourage face coverings. But he has maintained for weeks that cities and counties can’t require masks in public places, saying local actions can’t be more or less restrictive than his statewide orders. Wednesday, in an otherwise routine renewal of rules governing business operations and ordering medically vulnerably people to stay home, Kemp made that prohibition explicit. He also said local governments could not order masks on their own property, which would include Atlanta’s massive airport. Although national health officials have called on people to use masks, President Donald Trump’s administration has not issued any nationwide guidance. Twenty-six states and the District of Columbia now require masks. Kemp’s stance — not only shying away from a statewide order but trying to bar local governments from instituting their own — leaves him standing virtually alone. In the South, Republican governors in Tennessee, South Carolina and Florida have resisted statewide mandates but allow local jurisdictions to implement them. Republican governors in Alabama, Arkansas and Texas and Democrats in Kentucky, Louisiana and North Carolina have issued statewide mask requirements. Thursday’s numbers showed more than 2,800 people hospitalized statewide with the COVID-19 respiratory illness, the highest on record. The state reported that 84% of hospitals’ critical beds were filled. Georgia overall had more than 131,000 confirmed infections and more than 3,100 deaths overall as of Thursday. Some business groups are supporting Kemp. Georgia Restaurant Association Executive Director Kelly Bremer said Thursday that a statewide mandate isn’t appropriate considering Georgia’s size and diversity. But she also said local rules would be confusing and businesses should make their own decisions about requiring customers to wear masks. “For businesses to grapple with 535 different municipal ordinances and 159 different county ordinances is madness,” Bremer said. “Having one set of guidelines is very important.”"}]}