{"article": [{"url": "https://www.marketwatch.com/story/car-sales-fall-in-q2-despite-discounts-and-deals-2020-07-01", "published": 1593625640.0, "headline": "Car sales fall in Q2 despite discounts and deals", "body": "Major auto makers reported sharp drops in second-quarter U.S. vehicle sales, as sweet discounts and financing deals weren't enough to offset factory and dealership closures from the Covid-19 pandemic. General Motors Co. reported a 34% drop in second-quarter sales compared with a year earlier, with demand picking up in May and June. Toyota Motor Corp.'s sales fell by about one-third, while Fiat Chrysler Automobiles NV reported a 39% decline. Overall, second-quarter U.S. vehicle sales are projected to have fallen by about one-third, analysts estimate, after car plants and some dealerships closed for extended periods this spring. Most major car companies reported second-quarter sales results Wednesday. Still, the drop wasn't as steep as feared, and sales have improved steadily since late March. Heavy sales promotions and federal stimulus checks that went out to millions of Americans this spring spurred car demand despite spiking unemployment and stay-home orders across many states, dealers and analysts say. Now, the industry's sales rebound faces a tough summer test, as auto makers reign in discounts and the effect of the federal stimulus fades. \"I'm not sure what the next six months is going to be,\" said Mike Maroone, a former president of AutoNation Inc. who owns dealerships in Colorado and Florida. Auto makers earlier in the spring rushed to offer recession-era discounts and financing deals, which bolstered sales of profit-rich pickup trucks and sped a rebound in retail sales as dealers got better at selling cars online. In recent weeks, retail sales, or sales to individual buyers, have tracked just 4% to 6% below pre-Covid-19 forecasts, according to research firm J.D. Power. \"The market and the retail consumer continue to recover beyond anyone's expectations,\" Bob Carter, Toyota's sales chief for North America, said recently. But now many dealerships are running low on inventory as auto makers ramp up output after several weeks of factory downtime. Deals are drying up as car companies spend less on cash-back offers and pull back on attractive seven-year financing deals that brought customers to dealer lots during the pandemic. Since hitting record highs in early May, company-sponsored discounts have fallen nearly 13%, according to J.D. Power. Promotional loans stretching out seven years accounted for a smaller portion of the market in June, representing 9.4% of transactions last month, compared with 12% in May. Ward's Intelligence estimates U.S. car dealers in June had 32% fewer vehicles on their lots compared with a year earlier. Pickup-truck supply was down 50%, as demand for trucks outpaced the rest of the market. \"The marketplace is growing less inviting,\" said Jessica Caldwell, an analyst for car-shopping website Edmunds.com. \"Current sales paint an optimistic picture given the circumstances, but between Covid-19 and today's politically charged climate, the industry needs to prepare for uncertainties ahead.\" GM said its fleet business -- deliveries to businesses, government buyers and rental companies -- suffered, but retail sales fared better, down 24%. The company blamed thin supply after factories closed for nearly two months. Fiat Chrysler cited a drop in fleet sales. Fiat Chrysler's shares were down 3.7% on Wednesday afternoon, at $9.87. GM's shares were off about 1%, at $25.03. Nissan Motor Co.'s second-quarter U.S. sales fell by nearly half, also hurt by a drop in fleet sales. Honda Motor Co.'s second-quarter sales fell 28%. Hyundai Motor America said sales in June fell 22% after demand from rental-car companies evaporated, but sales to individual retail buyers rose 6%. U.S. sales chief Randy Parker cited extra customer touches for attracting buyers during the pandemic, such as free drop-off of new-vehicle purchases, and a previous promotion that promises to cover six months of payments if buyers lose their jobs related to Covid-19. \"We're adapting to the new norm,\" Mr. Parker said. The U.S. auto industry began 2020 with expectations that vehicle sales, while slowing from a peak of 17.6 million in 2016, would remain healthy. After two straight quarters of sales declines, analysts are now predicting sales could fall below 14 million in 2020. Despite the bounceback in retail business since early April, fleet sales, which account for roughly 15% of the U.S. car market, are expected to remain depressed, according to analysts and executives. Industry forecaster ALG Inc. estimates fleet sales fell 68% last month, compared with June 2019. Long the auto industry's most reliable customers, the rental-car companies have been slow to return to the market as their businesses remain buffeted by the pandemic's economic fallout. --Ben Foldy contributed to this article."}]}