{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-retreat-amid-fresh-coronavirus-lockdown-fears-11601556523", "published": 1601565260.0, "headline": "Oil settles at lowest price in more than 2 weeks", "body": "Oil futures were sharply lower Thursday, with prices logging their lowest settlement since mid-September, as worries about rising cases of COVID-19 worldwide fed expectations for a slowdown in energy demand. “The oil market can’t shake its demand fear funk even though U.S. oil supply continues to tighten,” said Phil Flynn, senior market analyst at The Price Futures Group. The Energy Information Administration on Wednesday reported an unexpected decline of 2 million barrels in U.S. crude supply. That marked three weekly declines in a row. “Lingering demand concerns makes the market less concerned about the trend of tightening supply,” said Flynn, in a daily report. Crude oil investors have closely followed the spread of the disease because it can have a detrimental impact on appetite for oil as economies stall. Europe was implementing or planning to reinstitute new social-distance restrictions as COVID-19 cases climb. New rules in Spain mean that a majority of the country’s regions will limit public service and retail to 50% capacity, while France may introduce new restrictions on Thursday night. Per person, Spain, France and the Netherlands have the highest rate of new cases over the last seven days of the world’s largest countries, according to data tabulated by Deutsche Bank. See: Coronavirus update: Global case tally above 34 million with U.S. accounting for a fifth On top of those possible drags in oil sentiment, supplies are percolating higher. A recent survey by Reuters pointed to increased oil supply from the Organization of the Petroleum Exporting Countries, with output in September up 160,000 barrels per day from August. “As the OPEC+ production cuts enters their 6th month, producers are getting eager to increase their production,” said Manish Raj, chief financial officer at Velandera Energy. That raises a question over “how long oil producing nations will restrict their production; and any sign of growing non-compliance is highly negative for oil markets.” West Texas Intermediate crude for November delivery CLX20, -1.62% CL.1, -1.62% dropped $1.50, or 3.7%, to settle at $38.72 a barrel on the New York Mercantile Exchange, following a 2.4% gain on Wednesday. Prices for the U.S. benchmark, based on the front-month contracts, saw monthly fall of 5.6%, but ended 2.4% higher for the quarter, according to Dow Jones Market Data. Oil prices in September suffered their first monthly decline since April. December Brent crude BRNZ20, -0.07% shed $1.37, or 3.2%, at $40.93 a barrel after trading as low as $39.92 on the ICE Future Europe exchange. Prices for both WTI and Brent marked the lowest front-month settlements since Sept. 15. Among the petroleum products traded on Nymex, November gasoline RBX20, -2.11% lost 2.5% to $1.1524 a gallon and November heating oil HOX20, -0.05% declined by 2.4% to $1.125 a gallon. Investors also watched developments between U.S. lawmakers over a possible new round of coronavirus stimulus, which could also provide a potential lift to the energy sector, providing funding to out-of-work Americans and troubled businesses. Expectations for more oil from Libya, however, have continued to weigh on the market following news last month that Libya military commander Khalifa Haftar would lift an eight-month blockade on crude exports. The United Nations has reported “a successful meeting among warring factions in Libya, which promises to restore 1 million daily barrels in an already oversupplied market,” Raj told MarketWatch. “Historically, Libya has surprised the market as to the speed at which it is able to restore production, therefore uptick of production in Libya raises additional supply concern among the times of weak demand.” Natural-gas futures, meanwhile, finished unchanged after the U.S. Energy Information Administration reported Thursday that domestic supplies of natural gas rose by 76 billion cubic feet for the week ended Sept. 25. On average, analysts polled by S&P Global Platts forecast an increase of 78 billion cubic feet. November natural gas NGX20 ended flat at $2.527 per million British thermal units. Read: Natural gas, lumber among best performers as commodities post a second straight quarterly gain"}]}