{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-higher-but-remain-on-track-for-weekly-losses-as-jitters-grow-over-demand-2020-09-04", "published": 1599233000.0, "headline": "U.S. oil benchmark ends below $40 a barrel, down over 7% for the week", "body": "Oil futures declined on Friday, with the U.S. benchmark ending below $40 a barrel for the first time since early July, contributing to a loss for the week as concerns over prospects for demand, losses in the stock market, and strength in the U.S. dollar pushed prices to their lowest since July. Oil was pressured by a strengthening U.S. dollar, as it also got “swept up in the wave of risk-off sentiment and selling in broader markets,” Matt Smith, director of commodity research, at ClipperData, told MarketWatch. Read:Dow skids nearly 600 points and Nasdaq falls over 3% extending stock rout The dollar was trading 0.4% higher for the week, as gauged by the ICE U.S. Dollar Index DXY, -0.58%, a measure of the buck’s strength against a half-dozen currencies. The greenback got a boost Friday, in part, from better-than-expected monthly U.S. employment data, which revealed a drop to 8.4% in the August unemployment rate, from 10.2%. Oil demand also continues to be a key concern. “Crude demand in the U.S. is being reined in, driven by weaker crack spreads as a result of stymied product demand and elevated inventories—particularly relating to middle distillates,” said Smith. Crack spreads refer to the price difference between crude oil and the products refined from it and middle distillates include heating oil and diesel. West Texas Intermediate crude for October delivery CL.1, -1.62% US:CLV20 fell $1.60, or 3.9%, to settle at $39.77 a barrel on the New York Mercantile Exchange. November Brent BRN00, -0.07%, the global benchmark, lost $1.41, or 3.2%, at $42.66 a barrel on ICE Futures Europe. Both crude benchmarks settled at their lowest since July 9, based on the front-month contracts, according to Dow Jones Market Data. WTI crude logged a nearly 7.5% weekly fall, on the heels of four consecutive weeks of gains, while Brent marked a 6.9% weekly decline. For oil, Wednesday stood out as “the biggest mover of the week with prices shedding more than 2%” for the session, said Robbie Fraser, senior commodity analyst at Schneider Electric, in a note. “Those losses came amid continued concerns around demand weakness,” despite strong weekly declines in U.S. crude inventories and production reported by the Energy Information Administration. Data Friday from Baker Hughes BKR, -1.34%, meanwhile, showed that the number of active U.S. rigs drilling for oil rose by 1 to 181 this week, following a decline of 3 rigs last week. Among the petroleum products, U.S. gasoline demand has bounced back faster than demand for distillates. “Refiners cannot produce gasoline without making other products like diesel, commonly known as distillates,” said Phil Flynn, market analyst at Price Futures Group, in a note. “The coronavirus pandemic slashed demand by one-third world-wide, and so far, the gasoline use has rebounded faster than that of distillates. Refiners still have big stockpiles of diesel and other fuels and do not want to make more of those products due to poor margins.” Meanwhile, a fall in gasoline inventories also belies weak margins, analysts said. Two months ago, gasoline supplies were 24 million barrels above seasonally normal levels. They‘ve since fallen at a “manic pace” five times faster than the July through August seasonal average of 5.3 million barrels, noted Michael Tran, analyst at RBC Capital, in a note, to stand at 7.4 million barrels higher than normal. But U.S. mobility indicators suggest U.S. driving patterns have largely plateaued over the last six to eight weeks, he said, which means refinery cuts have been the main factor in the inventory decline. “In other words, it is a supply push rather than a demand pull. This is why gasoline refining margins are abysmal and weakening,” he said. Tran argued that soft margins are likely to cap further crude rallies and that further cuts in refinery runs were likely to balance product stocks. On Nymex, October gasoline US:RBV20 fell 2.3% at $1.1772 a gallon, down around 5.6% for the week, while October heating oil US:HOV20 declined by 1.4% to $1.1515 a gallon, with prices posting a weekly loss of 7.2%. On Friday, the EIA and the Oil Price Information Service separately forecast the lowest Labor Day holiday weekend prices for gasoline since 2004. Read:Drivers set to pay lowest Labor Day weekend gasoline prices in 16 years Meanwhile, October natural gas US:NGV20 added 4.1% to $2.588 per million British thermal units, with prices suffering a weekly loss of around 2.6%. Read:Natural-gas futures gain nearly 50% in August, but rally may be ‘short-lived’"}]}