{"article": [{"url": "https://www.marketwatch.com/story/trump-campaign-manager-stepien-ex-aide-conway-are-latest-in-presidents-orbit-to-test-positive-for-coronavirus-2020-10-03", "published": 1601724020.0, "headline": "Trump campaign manager Stepien, ex-aide Conway are latest in presidentâ\u0080\u0099s orbit to test positive for coronavirus", "body": "President Donald Trumpâ\u0080\u0099s campaign manager Bill Stepien and former White House aide Kellyanne Conway are the latest people in Trumpâ\u0080\u0099s orbit to test positive for COVID-19, as the president himself remained hospitalized. News of Stepienâ\u0080\u0099s diagnosis broke Friday night. The 42-year-old, who took over as campaign manager in July, was experiencing â\u0080\u009cmild flu-like symptoms,â\u0080\u009d one senior campaign official told Politico. He is planning to work remotely, though advisers stressed he would maintain control of the campaign, the report said. Read:Hereâ\u0080\u0099s what President Trumpâ\u0080\u0099s coronavirus diagnosis means for stock-market volatility â\u0080\u0094 so far. Conway, who stepped down from her White House role in August, announced Friday that she had tested positive. Conway recently attended a Rose Garden ceremony for Supreme Court nominee Amy Coney Barrett. Several others who attended the event have also tested positive, including Sens. Mike Lee and Thom Tillis. Conway disclosed the news in a tweet, in which she said her symptoms were mild and that she felt fine. â\u0080\u009cI have begun a quarantine process in consultation with physicians,â\u0080\u009d she wrote. Trump announced early Friday that he and first lady Melania Trump had tested positive. U.S. stocks DJIA, +0.56% Â SPX, +0.87% Â COMP, +1.39% Â ended lower Friday in choppy trade as investors reacted to the Trump news and a weaker-than-expected September jobs report. The president is now staying at Walter Reed hospital in Bethesda, Md., just outside Washington. He tweeted late Friday, â\u0080\u009cGoing well, I think!â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } Now read:Trump has been treated with Remdesivir, his second coronavirus therapy, which is authorized to treat severely ill COVID-19 patients. Trumpâ\u0080\u0099s diagnosis immediately scrambled the White House campaign, with about a month remaining until Election Day. The president scrapped a Florida rally, and Stepien announced that in-person campaigning would be paused or moved to virtual events. Trumpâ\u0080\u0099s Democratic rival Joe Biden, meanwhile, will hold a virtual town hall on Saturday with the Amalgamated Transit Union. The Associated Press reported that Bidenâ\u0080\u0099s campaign would take down its attack ads in the wake of Trumpâ\u0080\u0099s coronavirus infection. The Trump re-election campaign said it would not reciprocate and pause advertisements attacking Biden, CNN reported. See:Biden campaign pulls down attack ads as Trump departs White House for hospital. Ciara Linnane contributed to this article."}]}