{"article": [{"url": "https://www.marketwatch.com/story/why-it-might-be-time-to-meld-your-investing-strategy-with-your-disaster-preparedness-plan-11602038243", "published": 1602069200.0, "headline": "Why it might be time to meld your investing strategy with your disaster preparedness plan", "body": "Burned vehicles in the Glass Fire in Calistoga, Napa Valley, Calif. Samuel Corum/Agence France-Presse/Getty Images Calls from clients usually start pouring in whenever stocks take a surprise tumble. But lately, financial advisers have been getting more calls from worried clients about devastating West Coast wildfires, which this year come amid the worst public-health crisis in a century. “We always get a lot of calls after a bear market hits,” said Deron McCoy, chief investment officer at Signature Estate & Investment Advisors, in Los Angeles. “Clients always ask what they should do.” His advice? Plan ahead before calamity strikes, particularly if you live in spots vulnerable to climate change, which now threatens to make California’s wildfires even worse. “You need to fix your roof when it’s sunny,” he said. Well over 4 million acres have burned in California since the beginning of the year, more than double the land burned in any prior year, according to the California Department of Forestry and Fire Protection. For McCoy, that means urging clients not to get caught in a position where they become forced sellers when anything bad happens — a tall order this year. “Don’t have your living expenses in stocks,” he said. “Don’t have December’s rent in Tesla TSLA, +1.89%. ” More broadly, Silicon Valley workers should probably diversify from a portfolio construction standpoint. “They love their tech, but their homes also are tied to tech bonuses,” McCoy said. Some aspects of preparing for a disaster can be counter intuitive. For example, booming stay-at-home technology stocks, including Apple, Inc. AAPL, +1.74%, Google parent Alphabet GOOG, +1.97% and Facebook, Inc. FB, +0.26%, have been clear benefactors during the pandemic. But this year also saw idyllic Bay Area tech campuses shrouded in thick smoke and ash from Northern California’s raging wildfires. Smoke from wild Bay Area hit by near Justin Sullivan/Getty Images “If you live in harm’s way, you might not want to have all your investments there,” McCoy said. Bay Area homes fetched record prices in August even with the coronavirus and wildfires, with existing single-family homes selling for a median price of nearly $1.07 million, almost a 19% annual price increase, according to a report from the California Association of Realtors. That compares with a gain for Facebook shares of 26% year to date Tuesday, while Alphabet’s were 8.7% higher and Apple’s surged 54.1% over the same stretch, according to FactSet data. Related: Big Tech shares drop amid reports House subcommittee wants to split them up Major U.S. stock indexes closed lower Tuesday, after President Trump called for a pause on stimulus talks with Democrats until after the Nov. 3 election. But despite a tumultuous September, the S&P 500 index SPX, +0.87% still ended trade Tuesday 6.1% off its record close from a month ago, which marked its quickest recover in history from bear-market territory in March.Bracing for the ‘Big One’ The other major concern is that California remains overdue for the “big one,” or a catastrophic earthquake of a 7.8 magnitude or higher that’s anticipated to hit along the southern San Andreas fault. “Are Californian’s prepared? Absolutely not,” said Luis Strohmeier, a partner and wealth adviser at Octavia Wealth Management. “It isn’t like Japan where they do drills monthly.” To better prepare, Strohmeier recommends that his client call their home’s original builder or architect to pinpoint the strongest part of a house. “Every house has an area that likely would withstand the worst of an earthquake,” he said. “Understanding that is important.” But in terms of risk coverage, he also said earthquake insurance policies can help, but they often are expensive and come with high deductibles, meaning that only a fraction of homes currently are covered. There’s also the risk of earthquake-related fires. To that end, Strohmeier also likes to see his clients upload all of their deeds, legal documents and estate planning materials in an electronic vault and their valuables, including cash and jewelry, to be stored in a fireproof safe.Role of companies While the pandemic has required many companies to keep their employees working remote, that doesn’t mean businesses have any less responsibility to their employees, or investors, during a disaster. “The biggest thing is to protect vital assets and to have a business continuity plan in place,” said Dr. Louis Gritzo, manager of research at FM Global, a business property insurance company. He said the warming trend of the climate also means many corporations will need to beef up their existing disaster plans and communicate them better to employees. FM Global survey in 2012 found that 75% of U.S. workers felt their employer was not well prepared for a natural disaster. “Generally, people don’t have a a lot of confidence that they’re going to have a job after a crisis occurs, whether that’s an earthquake, wildfire or flood,” Gritzo said. “They’re not quite sure their company’s going to be there. And that plan needs to be communicated.” Related: Evacuating due to hurricanes or wildfires? Put these items in your ‘financial go-bag"}]}