{"article": [{"url": "https://www.marketwatch.com/story/why-shanghai-oil-futures-wont-become-a-global-crude-benchmark-anytime-soon-2020-07-17", "published": 1594992260.0, "headline": "Why Shanghai oil futures won't become a global crude benchmark anytime soon", "body": "More than two years after China's launch of yuan-denominated crude-oil futures, global interest in the contracts has seen a notable increase, but analysts don't expect the contracts to become widely used anytime soon, citing challenges linked to currency and availability to international traders. The contracts still have a \"long way to go before being considered a global benchmark,\" says Phil Flynn, senior market analyst at The Price Futures Group. \"One would think with the amount of demand in Chinaâ\u0080¦the contract would have been red hot, but it has been slow to take off.\" “ 'One would think with the amount of demand in Chinaâ\u0080¦the contract would have been red hot, but it has been slow to take off.' ” - Phil Flynn, The Price Futures Group China, which is the world's biggest importer of crude oil, has a history of \"changing the rules of the game as it is being played,\" which makes it difficult for traders to \"feel totally comfortable trading in that contract for the long run,\" he says. Also, \"Chinese currency manipulation and its previous peg to the dollar will make it hard for pure price discovery over the long run,\" says Flynn. Even so, there will be times when that market will provide \"attractive opportunities for sophisticated traders.\" That should allow the market to \"keep some liquidity, but there will have to be a big change in the regulatory structure in China to keep the contract viable.\" Oil futures contracts on the Shanghai International Energy Exchange, or INE, have seen open interest about double over the past year. On July 15, the main Shanghai crude-oil contract closed at 307.9 yuan per barrel, up 2.4 yuan or 0.8%, with open interest for the contract at 45,567. Open interest for all Shanghai crude-oil contracts was at 120,874, compared with open interest of 64,168 at the same time a year ago. Trading in Chinese oil futures, however, remains well off the millions of contracts in open interest traded daily in global benchmarks Brent BRN.1, -0.07% and West Texas Intermediate CL.1, -1.62% crude futures markets. \"WTI and Brent's contracts are followed more closely than Chinese contracts, generally, since oil is a monopoly in China,\" says Stan Bharti, CEO of Forbes & Manhattan. \"It's all domestic.\" The Covid-19 pandemic, meanwhile, has shown that \"as time goes on, there will be two markets for oil-one for domestic oil and local producers that won't be impacted by much of the global market, and one for the international market that will service countries\" that aren't big oil or energy producers, said Bharti. While Chinese oil futures track WTI and Brent, they are \"very local-focused contracts,\" and China \"doesn't produce enough oil on a global stage to alter the price in major industries.\" Still, Michael Corley, president of Mercatus Energy Advisors, estimates that oil futures on the INE have seen their global market share volume, versus Brent, WTI, Dubai, and Oman oil futures, increase to roughly 10%-\"pretty strong for only a little over two years\" since their launch. Corley believes that Chinese oil futures will continue to attract interest, but are \"unlikely to develop into a dominant global benchmark with volume and open interest similar to Brent and WTI.\" The contracts are not widely accessible to non-Chinese traders and with the pricing in yuan amid concerns among foreign firms regarding capital controls, he says, referring to the ability to freely move funds in and out of the country. That ability is especially important given the amount of capital required to trade oil at the institutional level, he says. When it comes to these contracts, however, \"major traders and brokers are activeâ\u0080¦and will become more active if they think that the opportunities are greater than the risks, and that trading the contract will ultimately be beneficial to their bottom line,\" says Corley."}]}