{"article": [{"url": "https://www.marketwatch.com/story/the-rise-of-a-mom-and-pop-investors-in-the-stock-market-will-end-in-tears-warns-billionaire-cooperman-2020-06-15", "published": 1592655500.0, "headline": "The rise of mom-and-pop investors in the stock market will â\u0080\u0098end in tears,â\u0080\u0099 warns billionaire Cooperman", "body": "Billionaire Leon Cooperman on Monday said that the emergence of individual investors eagerly scooping up stocks that have been rocked amid the coronavirus-induced downturn will ultimately not end well for those individual investors. The â\u0080\u0098Robinhood markets are going to end in tears,â\u0080\u009d said Cooperman during CNBCâ\u0080\u0099s show â\u0080\u009cHalftime Reportâ\u0080\u009d on Monday, referring to the popular online trading platform. “ â\u0080\u0098They are just doing stupid things, and in my opinion, this will end in tears,â\u0080\u0099 ” â\u0080\u0094 Leon Cooperman Cooperman referred to a Barronâ\u0080\u0099s article that noted that free trading app Robinhood has added more than three million accounts this year, and now has over 13 million, with a median age of 31. A number of recent reports attribute the marketâ\u0080\u0099s rally since its March 23 low, and its subsequent choppy trading, to an era of zero-commission discount brokerage trades, ushered in by Charles Schwab SCHW, +1.29%, and platforms like Robinhood that cater to younger investors. Critics like Cooperman say that a dearth of diversions due to COVID-19 lockdowns and unemployment have created a perfect environment for newly minted day traders to wreak havoc on Wall Street. On Monday, Cooperman pointed to purchases of bankrupt car-rental company Hertz Global Holdings Inc. HTZ, -1.78%, which has drawn feverish buying interest from bargain-hunting investors, even though the companyâ\u0080\u0099s bankruptcy means that there is little if any equity value in the enterprise. Thus far, mom-and-pop investors have outperformed pros like Cooperman and mutual funds, according to a research report from Goldman Sachs. Itâ\u0080\u0099s unclear, however, how long that outperformance will last and to the degree by which individual investors are piling into risky investments with reckless abandonment. Meanwhile, the Dow Jones Industrial Average DJIA, +0.56%, the S&P 500 index SPX, +0.87% and the Nasdaq Composite Index COMP, +1.39% were resuming a rally on Monday after opening sharply lower on the day. Read: Itâ\u0080\u0099s like the Wild West with â\u0080\u0098get-rich-quick crowdâ\u0080\u0099 vs. Wall Street pros, but itâ\u0080\u0099s too easy to blame individual investors for â\u0080\u0098rampant speculationâ\u0080\u0099 â\u0080\u009cThe gambling casinos are closed and the [Federal Reserve] is promising you free money for the next two years, so let them speculate,â\u0080\u009d Cooperman said, referring to the central bankâ\u0080\u0099s balance sheet which has ballooned to $7.2 trillion from about $4 trillion at the beginning of March, as it rolls out stimulus measures to limit the damage from the pandemic. The Fed also has held interest rates at a range between 0% and 0.25% and is expected to keep rates around those superlow levels until at least 2022. â\u0080\u009cLet them buy and trade. From my experience, this kind of stuff will end in tears,â\u0080\u009d Cooperman told CNBC. Check out the CNBC video below:"}]}