{"article": [{"url": "https://www.marketwatch.com/story/he-traded-15000-into-1-million-from-there-he-lost-almost-everything-2020-07-09", "published": 1597501100.0, "headline": "â\u0080\u0098Itâ\u0080\u0099s like trying to beat the casinoâ\u0080\u0099 â\u0080\u0094 Rookie trader turns $15,000 into $1 million, then loses almost everything", "body": "“ â\u0080\u0098They make it so easy for people that donâ\u0080\u0099t know anything about stocks. Then you go there and you start to lose money.â\u0080\u0099 ” Thatâ\u0080\u0099s Richard Dobatse, talking with the New York Times about his painful experience trading stocks â\u0080\u0094 and ultimately losing a fortune â\u0080\u0094 on the Robinhood app. Dobatse explained in the interview that heâ\u0080\u0099d been drawn into the appâ\u0080\u0099s bells and whistles, which made flipping stocks and dabbling in more complex investments feel like a game. He started out by funding his account with $15,000 in credit card advances and then took out another two $30,000 home-equity loans as he continued to lose money early. His luck changed this year, and his account value skyrocketed about $1 million in a matter of months. Then it all fell apart â\u0080\u0094 his account value this week: $6,956. â\u0080\u009cWhen he is doing his trading, he wonâ\u0080\u0099t want to eat,â\u0080\u009d Tashika Dobatse, his wife and mother of his three children, told the New York Times NYT, -3.79% Â . â\u0080\u009cHe would have nightmares.â\u0080\u009d Dobatseâ\u0080\u0099s story follows closely on the heels of the tragic death of Alex Kearns, a 20-year-old rookie trader who killed himself after seeing a negative balance of more than $700,000 in his Robinhood account. â\u0080\u009cHow was a 20 year old with no income able to get assigned almost a million dollars worth of leverage?â\u0080\u009d Kearns wrote in his suicide note. Inexperienced traders have likely been drawn into the brutal game in part by the likes of Dave Portnoy â\u0080\u0094 itâ\u0080\u0099s â\u0080\u009cthe easiest gameâ\u0080\u009d there is â\u0080\u0094 as well as other lesser-know types crowing about their successes, like youâ\u0080\u0099ll see anytime you visit Redditâ\u0080\u0099s â\u0080\u009cWallStreetBetsâ\u0080\u009d group. Read:He had $35,000 in savings in March â\u0080\u0094 350 trades later and heâ\u0080\u0099s sitting on $1 million But the big winners are the exception, not the rule, when it comes to daytrading, according to Scott Smith, who tracks brokerage firms at the financial consulting firm Cerulli. â\u0080\u009cThey encourage people to go from training wheels to driving motorcycles,â\u0080\u009d he told the Times, referring to Robinhood. â\u0080\u009cOver the long term, itâ\u0080\u0099s like trying to beat the casino.â\u0080\u009d Vlad Tenev, a founder and co-chief executive of Robinhood, said that there are bigger risks for millennials than investing in the market. Not participating â\u0080\u009cultimately contributed to the sort of the massive inequalities that weâ\u0080\u0099re seeing in society,â\u0080\u009d he told the Times."}]}