{"article": [{"url": "https://www.marketwatch.com/story/gold-rises-to-nearly-9-year-high-on-fiscal-stimulus-moves-2020-07-21", "published": 1595340740.0, "headline": "Gold settles at a nearly 9-year high and silver scores highest finish since 2014 on fiscal stimulus moves", "body": "Gold futures climbed Tuesday to settle at a nearly nine-year high and silver rallied to prices not seen since 2014, with the precious metals lifted by an agreement on a fiscal rescue plan by European leaders and expectations for additional spending by the U.S. government. European Union leaders ended a grueling four-day summit with an agreement on a €1.8 trillion ($2.1 trillion) budget and rescue-fund package aimed at shoring up the worst-hit economies in the wake of the COVID-19 pandemic. See:EU nations agree to $2.1 trillion budget and coronavirus relief plan after marathon summit The EU deal also lent support to equities, with U.S. benchmark stock indexes headed higher on Wall Street. However, gold, a traditional haven asset, was also boosted on expectations fiscal stimulus efforts could stoke inflation and lead to a weaker U.S. dollar. A weaker dollar can be a positive for commodities priced in the currency, making them cheaper to users of other currencies. In Tuesday dealings, the ICE U.S. Dollar Index DXY, -0.58% traded down nearly 0.8% at 95.10, the lowest level since March. “Clearly, the passage of the EU recovery fund combined with the beginning of negotiations on another U.S. stimulus package provides a solid backdrop for the bull camp,” analysts a Zaner Metals wrote in a daily note, adding that the dollar, overnight, broke down to the lowest level since March 10. “Currency forces should be poised to add to the bull track.” Gold for August delivery GC00, +2.17% on Comex rose $26.50, or 1.5%, to settle at $1,843.90 an ounce, after touching a high of $1,844.80. Prices based on the most-active contracts, haven’t traded or settled at levels this high since September 2011, according to Dow Jones Market Data. Silver also surged, with the September contract US:SIU20 up $1.37, or 6.8%, to end at $21.557 an ounce after a high at $21.63. Most-active silver futures marked their highest settlement since March 2014. Read:Silver logs highest finish since 2014 and is up more than 80% from 2020’s low “Silver spot prices have outperformed gold so far this month, an interesting reversal of the norm,” said Cailin Birch, global economist at The Economist Intelligence Unit. “We believe that this reflects growing market optimism around the outlook for global industry, given silver’s many industrial uses.” “Several factors are probably contributing to this recent optimism, including the approval of a broad stimulus package by the EU commission and steadily improving economic and industrial activity in China, the main source of demand growth of industrial metals,” she said in emailed commentary. Silver prices had settled early last week, and again on Monday, at the highest since September 2016. Read:Why silver is trading at a nearly 4-year high Also see:Why gold have become a ‘weapon of choice’ for investors “In the early stages of the precious metals bull market, gold leads the way with silver being pulled up slowly by the rising gold price,” said Peter Spina, who is president of GoldSeek.com and SilverSeek.com, providers of news and analysis for the precious metals. “At a certain point, the relative value of silver versus gold gets more noticed and investors start to accumulate the ‘poor man’s gold’.” “Now we are entering into the next phase of the bull market where silver is getting recognized for its deep discount as a precious, monetary metal,” Spina told MarketWatch. But it’s “all relative,” he said. “Investors are looking for safety in gold and silver’s ability to also provide a low-risk store of value,” and that “builds stronger investment inflows,” feeding the price climb. Meanwhile, Europe’s fiscal package “comes on the back of vast monetary support from the European Central Bank, as well as other major central banks around the world. In the U.S., talks are about to kick off on the next virus relief plan, which could see at least an additional $1 trillion added to the previous stimulus measures – especially as some of the existing measures are about to expire,” said Fawad Razaqzada, analyst with ThinkMarkets, in a note. Other metals climbed as well, with platinum and palladium moving up sharply. October platinum PLV20, +3.99% rose 7.1% to $918.90 an ounce and September palladium US:PAU20 added 3.7% to $2,188.20 an ounce, for the highest settlement since late March. September copper US:HGU20 rose 1.5% to $2.958 a pound. “The platinum and palladium markets have begun to show very positive sensitivity in sync with gains in gold and silver prices,” said analysts at Zaner Metals."}]}