{"article": [{"url": "https://www.marketwatch.com/story/investors-face-a-scary-out-of-whack-scenario-just-look-at-this-chart-2020-07-12", "published": 1595066300.0, "headline": "Investors face 'a scary, out-of-whack' scenario - just look at this chart", "body": "If it weren't for the \"Giant 5,\" your money would have been better off sitting in cash than the stock market over the past few years, according to Wolf Richter of the Wolf Street blog. Yes, investment gains since early 2017 have been completely dominated by Apple AAPL, +1.74%  , Microsoft MSFT, +2.48%  , Amazon AMZN, +3.01%  , Alphabet GOOG, +1.97%  and Facebook FB, +0.26% to the point where the broader market, despite some wild fluctuations, has delivered virtually nothing without the upward push of those stocks. For some perspective on how this has played out, here's what the Wilshire 5000, a market-capitalization-weighted gauge of all U.S. stocks, has done since January 2017, minus the Giant 5: That's right... nothing. \"A miserable savings account would have outperformed the overall stock market without the Giant 5,\" Richter said, \"and would have done so without all the horrendous volatility of the two sell-offs.\" Read:He hates shorting, but this 'terrible, gut-wrenching scenario' has him doing it In contrast, he said the Giant 5 Index has exploded for a gain of 184% over the same time frame, which has led to \"breathtaking\" market capitalizations and dominance. But, as Richter explained, this can cut both ways. \"That's a scary thought - that this entire market has become totally dependent on just five giant stocks with an immense concentration of power that have now come under regulatory scrutiny,\" he wrote. \"And just as these stocks pulled up the entire market, they can pull down the entire market by their sheer weight.\" The stock market certainly wasn't pulled down in Friday's upbeat trading session, with the Dow Jones Industrial Average DJIA, +0.56% surging 369 points to end at 26,075 and the S&P 500 Index SPX, +0.87% adding 33 points to 3,185. The tech-heavy Nasdaq Composite COMP, +1.39% banged out a third consecutive record close."}]}