{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-case-tally-surging-with-more-than-half-the-states-trending-up-as-death-toll-tops-120000-2020-06-23", "published": 1592923580.0, "headline": "Coronavirus update: U.S. case tally surging with more than half the states trending up as death toll tops 120,000", "body": "New coronavirus cases are showing an alarming increase in the U.S., with more than half the states reporting numbers that are trending higher as the death toll topped 120,000, while President Donald Trump doubled down on his logic that the increases are just a result of more testing. Although some states have acknowledged the dire case data, reopenings of businesses remained on course and Wall Street continued to focus on recent data suggesting the worst of the pandemic’s effects on the economy are in the past. The Dow Jones Industrial Average DJIA, +0.56% was up 248 points, or 1.0%, in afternoon trading Tuesday and the Nasdaq Composite Index COMP, +1.39% climbed 1.4% toward a second-straight record close. See Market Snapshot. A key test of the states’ efforts to stop the spike in new cases will occur in Phoenix later Tuesday, when Trump attends a “Students for Trump” event. On Saturday, the Phoenix City Council said face coverings will be required for all residents and visitors, 6 years old or older. The order did not exclude people speaking at a public event. Phoenix Mayor Kate Gallego said on Monday that everyone attending the event, particularly any elected official, should set an example by wearing a mask. “That includes the president,” Gallego said, according to an Associated Press report. Don’t miss: Focus falls to Trump’s rally in Phoenix Tuesday, after low Tusla turnout. Arizona has seen cases spike higher in recent weeks, with Phoenix’s Maricopa county currently ninth on the list of all U.S. counties, with a case tally of 31,650, according to data aggregated by Johns Hopkins University. Trump has been playing down the rise in case number, and caused a stir over the weekend at a campaign rally in Tulsa, Oklahoma, when he said he wanted to slow down testing to keep COVID-19 case totals from rising. White House officials said he was obviously joking, but Trump dispelled that defense by tweeting Tuesday morning that “smaller” testing would change the trend. iframe.twitter-tweet { width: 100% !important; } In a research note on Monday, Raymond James analyst Chris Meekins said that with a number of states seeing a rise in the percentage of tests returning a positive reading, the increases in cases “are definitely NOT a result of more testing.” Read more: Infectious-disease expert says we’re thinking too much about a second wave of COVID-19 when it’s really more like a forest fire. Outside of the U.S., the tennis world was shaken after the No. 1 ranked player, Novak Djokovic, tested positive for the COVID-19 virus, after he participated in an exhibition series, which he organized, in Serbia and Croatia. Djokovic had been criticized for organizing the tournament, in which social distancing wasn’t observed.Latest tallies The global COVID-19 case tally increased to 9.15 million on Tuesday, while the death toll rose to 473,650, the Johns Hopkins data show. About 4.56 million people have recovered. The U.S.’s case and death tolls lead the world by a large margin, with COVID-19 cases growing to 2.33 million and the number of deaths rising to 120,771. About 640,000 people have recovered. There are 28 U.S. states that are showing increasing trends in cases this past week. Of that total, 8 states showed declining trends the previous week and two states were flat. California led the pack in new daily cases with 6,219 on Monday, followed by Texas at 4,846 and Florida at 2,926. California’s COVID-19 cases surge to a fresh peak Johns Hopkins University of Medicine Arizona had 2,008 new cases on Monday. Also read: Surging U.S. coronavirus cases raise fear that progress is slipping away. Another state seeing a surge in cases is South Carolina, which continues with its phased reopening even as the case tally doubled in nine days to a fresh peak. South Carolina cases spike as beaches reopen Johns Hopkins University of Medicine Outside the U.S., Brazil remained the new global hot spot, with cases climbing to 1.11 million and deaths rising to 51,271. See related: Brazilian doctors fume as President Bolsonaro gets rap for eating hot dogs while COVID-19 cases are on track to pas U.S. Russia has the highest case tally in Europe at 598,878, while the U.K. leads the region in fatalities with 43,001. The U.K. has 307,682 cases and Russia had 8,349 deaths. Early hot spot Spain was eighth in the world in cases with 246,752 and sixth in deaths with 28,325, while Italy has 238,833 cases and 34,675 deaths. France has 197,381 cases and 29,666 deaths, while Germany has 192,480 cases and 8,914 deaths. Elsewhere, India was fourth in cases with 440,215 and eighth in deaths at 14,011, Peru has 257,447 cases and 8,223 deaths, Canada has 103,614 cases and 8,502 deaths and Mexico has 185,122 cases and 22,584. China, where the illness was first reported last year, has seen a cluster of new cases, with the tally at 84,640 and deaths at 4,640.Latest medical news Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases and the U.S. government’s top pandemic expert, said he is cautiously optimistic there will be a COVID-19 vaccine by the end of this year, or by early next year. Still, he cautioned that the next few weeks will be critical in cooling off coronavirus hot spots. Fauci said he has not been asked to slow down testing, and stressed that more tests will be administered. Sanofi SA SNY, +0.89% SAN, +1.20% said Tuesday it will boost its investment in U.S.-based Translate Bio Inc. TBIO, +2.43% to develop new mRNA vaccines for infectious diseases. The companies are evaluating a number of coronavirus vaccine candidates, with the goal of beginning a first-in-human trial in the fourth quarter of 2020. Inovio Pharmaceuticals Inc. INO, -1.36% said it received $71 million in funding from the U.S. Department of Defense to make a handheld device that delivers its experimental COVID-19 vaccine. As part of the agreement, the DoD plans to buy an undisclosed number of the devices. The vaccine candidate is currently being tested in a Phase 1 clinical trial. Interim results from that study are expected to be released this month. Researchers published on Monday preprint research that led to the U.K.’s decision to approve the steroid dexamethasone as a treatment for some severely ill COVID-19 patients. The study has not been peer-reviewed. The U.K.’s randomized study assessed the use of dexamethasone in 2,104 patients. An additional 4,321 patients received standard care. About 21.6% of the patients who received the steroid died, compared with 24.6% of the patients who had the standard care. Of the patients who received the steroid who were on mechanical ventilators, 29.0% died, compared with 40.7% of patients on ventilators receiving the standard care. And among patients receiving oxygen and dexamethasone, 21.5% died, as compared with 25.0% of patients who received oxygen and the standard care. The drug did not benefit COVID-19 patients who weren’t receiving oxygen or ventilation in the study Elsewhere, an article published in the American Thoracic Society’s American Journal of Respiratory and Critical Care Medicine describes the various types of droplets from sneezes and coughs that contain viruses, and how some medical procedures and devices may actually spread these droplets. And a separate study published in the peer-reviewed Proceedings of the National Academy of Sciences found that speech droplets from asymptomatic carriers of the novel coronavirus are increasingly considered the likely mode of disease transmission.What the economy is saying U.S. economic data continued to show substantial weakness but also significant improvements from more recent periods. See Economic Reports. New home sales in May surged 16.6% on the month to a seasonally adjusted annual rate of 676,000, government data showed. That was above the average estimate of those polled by MarketWatch for a rate of 650,000. Meanwhile, April’s figure was adjusted down to an annual pace of 580,000 from previously reported 623,000. Also Tuesday, data from IHS Markit showed that the U.S. services and manufacturing sectors continued to contract in June, but at the slowest pace in four months, as businesses began reopening on a larger scales. That followed IHS Markit reports showing economic activity in Europe was also recovering in June. “The flash PMI data showed the U.S. economic downturn abating markedly in June,” said Chris Williamson, chief business economist at IHS Markit. “The improvement will fuel hopes the economy can return to growth in the third quarter.” Also read: U.S. economic downturn losing steam, flash PMI data show. J.P. Morgan said that while the COVID-19 recession that officially began in March was “exceptionally deep,” it was also “exceptionally short.” “It is now evident that a recovery took hold in May and that its initial phase will be led by a bounce in consumer demand as mobility restrictions are relaxed,” J.P. Morgan research note to clients said. “This week’s data flow should reinforce the dramatic momentum shift now underway.”What companies are saying U.S. Physical Therapy Inc. USPH, -1.83% said about 300 furloughed employees have returned to work, as 10 of the clinics have reopened and are now operating at about 70% of normal volumes. As the effects of the COVID-19 pandemic on business was at the worst in April, the operator of physical therapy clinics had closed about 70 clinics, or 12% of the total, and furloughed about 2,150 employees, or 40% of its workforce. In May, the company said patient volume was about 65% of normal, and it was able to generate an operating profit. Kansas City Southern KSU, +1.40% said at an investor presentation that while the second quarter has been “challenging” as a result of the COVID-19 pandemic, traffic volumes have been “improving.” The railroad operator said carloads have improved by 31% since bottoming in early May, but they remain 8% below pre-COVID-19 levels. For the second quarter to date, volume has declined 23% from a year ago and revenue has been down 24%, with revenue “pacing” to about $550 million for the quarter, compared with the current FactSet consensus of $584 million, implying an 18% decline. The company said it was targeting free cash flow of more than $550 million in 2020, compared with the FactSet consensus of $530 million. American Airlines Inc. AAL, +0.34% priced an offering of 74.1 million shares at $13.50 a share on Tuesday, moving to raise cash and bolster its liquidity position during the coronavirus pandemic. The airline also priced an offering of $1 billion of convertible bonds that mature in 2025 at 6.50%. The company upsized the deal from an original plan to offer $750 million of the notes. The roughly $2 billion in proceeds from the two transactions will be used for general corporate purposes and to boost liquidity. Palatin Technologies Inc. PTN, +0.08% said it would test one of its investigational drugs as a treatment for COVID-19. The drugmaker plans to submit an investigational new drug application in the third quarter of the year and initiate a Phase 2 randomized, controlled clinical trial for hospitalized adult COVID-19 patients with hypoxemic respiratory failure in the fourth quarter. The experimental therapy had previously gone through a Phase 1 clinical trial as a treatment for inflammatory bowel diseases, including ulcerative colitis. IHS Markit Ltd. INFO, +0.56% reported a fiscal second-quarter profit that topped expectations but revenue that fell a bit shy, amid “challenging” conditions brought on by the COVID-19 pandemic. The information and analytics company said net income for the quarter to May 31 fell to $71.7 million, or 18 cents a share, from $149.8 million, or 37 cents a share, in the year-ago period. Excluding nonrecurring items, adjusted earnings per share slipped to 69 cents from 71 cents, but was above the FactSet consensus of 67 cents. Revenue declined 10% to $1.03 billion, just below the FactSet consensus of $1.05 billion, as the company’s resources business topped expectations but its financial service, transportation and consolidated markets and solutions businesses missed. Coronavirus Update: TikTok Users Target Tulsa Rally, China Halts Tyson Imports"}]}