{"article": [{"url": "https://www.marketwatch.com/story/presidential-debate-commission-says-it-will-make-changes-to-format-after-chaotic-night-01601507839", "published": 1601493920.0, "headline": "Presidential debate commission says it will make changes to format after chaotic night", "body": "President Donald Trump and Joe Biden exchange arguments as moderator and Fox News anchor Chris Wallace raises his hands to stop them on Tuesday night. AFP/Getty Images NEW YORK — The presidential debate commission says it will soon adopt changes to its format to avoid a repeat of the disjointed first meeting between President Donald Trump and Democrat Joe Biden. The commission said Wednesday the debate “made clear that additional structure should be added to the format of the remaining debates to ensure a more orderly discussion of the issues.” One possibility being discussed is to give the moderator the ability to cut off the microphone of one of the debate participants while his opponent is talking, according to a person familiar with the deliberations who was not authorized to discuss the matter publicly and spoke on condition of anonymity. The next presidential debate is a town hall format scheduled for Oct. 15 in Miami. Meanwhile, the Nielsen company said that 73.1 million people watched the debate on television, where it was shown on 16 networks. That’s more than any other television event since the Super Bowl, even if it fell short of the 84 million who watched the first debate between Trump and Hillary Clinton in 2016. That was the most-watched presidential debate ever. Moderator Chris Wallace struggled to gain control of Tuesday’s debate in Cleveland because of frequent interruptions, primarily by Trump. The candidates interrupted Wallace or their opponent 90 times in the 90-minute debate, 71 of them by Trump, according to an analysis by The Washington Post. Wallace, of Fox News, pleaded for a more orderly debate, at one point looking at Trump and saying, “the country would be better served if we allowed both people to speak with fewer interruptions. I’m appealing to you, sir, to do that.” “Ask him, too,” Trump said. “Well, frankly, you’ve been doing more interrupting than he has,” Wallace said. Biden on Wednesday called the debate “a national embarrassment.” But despite some suggestions that the final two presidential encounters be canceled, both campaigns said they expected their candidate to attend. Trump campaign communications director Tim Murtaugh said the commission was “only doing this because their guy got pummeled last night. President Trump was the dominant force and now Joe Biden is trying to work the refs.” ABC News’ Martha Raddatz, who moderated one of the three Trump-Clinton debates in 2016, said Wallace was put in nearly an impossible situation. Faced with the same behavior, she said she might have called a full stop to the debate for a moment to recalibrate. She never had the option, technically, to cut off the microphone of a candidate four years ago, she said. It also wasn’t in the rules that were agreed to in advance by the candidates and commission. “To say, ‘He’s not going to follow the rules so we aren’t, either,’ It’s an unprecedented situation,” Raddatz said. “That was so out of control.” Twitter was ablaze with criticism for Wallace early in the debate for losing control of the proceedings. That was illustrated by MSNBC’s Joe Scarborough, who tweeted “What is Chris Wallace doing? He has no control over the debate. He asks a question and let’s Trump continue yelling. This is a disgrace.” By the time he was on “Morning Joe” the next morning, Scarborough had cooled off. He called on the debate commission to act. “While it was extraordinarily frustrating, I think all of us need to walk a mile in his shoes before saying the morning after, ‘He could have done this, he could have done that,’” Scarborough said. Some of the president’s supporters felt that Wallace was too hard on their candidate. Trump himself suggested he was also debating Wallace, “but that’s no surprise.” Wallace even got some criticism from opinion personalities on his own network. “Trump is debating the moderator and Biden,” prime-time host Laura Ingraham tweeted during the debate. Another Fox colleague, Geraldo Rivera, expressed more sympathy. “The guy signed up to moderate a debate and he ended up trying to referee a knife fight,” he said. Wallace, host of “Fox News Sunday,” was not immediately made available for comment by Fox. There is some skepticism about what the commission can do that is really meaningful. “I’m not sure that there’s a format change that can solve that problem,” said Sen. Pat Toomey, Republican, of battleground state Pennsylvania. Wallace is the only presidential debate moderator this cycle with prior experience, after receiving praise for handling the final Clinton-Trump debate in 2016. The other two moderators are Steve Scully of C-SPAN and Kristen Welker of NBC News. Scully moderates the Miami debate, a town hall format where citizens get to ask questions, which may make interruptions more difficult. “Having prepared for these, the town hall is a completely different event in the debate Olympics,” tweeted David Plouffe, an adviser to former President Barack Obama. “If Trump brings the same nastiness to Florida, it will be doubly painful to watch but it will be doubly painful for him politically.”"}]}