{"article": [{"url": "https://www.marketwatch.com/story/unilever-to-halt-ads-on-facebook-twitter-2020-06-26", "published": 1593174440.0, "headline": "Unilever to halt ads on Facebook, Twitter", "body": "Consumer goods giant Unilever PLC said it will halt U.S. advertising on Facebook Inc. and Twitter Inc. for at least the remainder of the year, citing hate speech and divisive content on the platforms, a significant escalation in Madison Avenue's efforts to force changes by the tech companies. Unilever, whose many household brands include Dove soap, Hellmann's mayonnaise and Lipton tea, joins a growing list of companies that are boycotting Facebook for varying lengths of time, including Verizon Communications Inc., Patagonia Inc., VF Corp., North Face, Eddie Bauer and Recreational Equipment Inc. \"Based on the current polarization and the election that we are having in the U.S., there needs to be much more enforcement in the area of hate speech,\" said Luis Di Como, Unilever's executive vice president of global media, in an interview. \"Continuing to advertise on these platforms at this time would not add value to people and society,\" the company said in a statement. Its Facebook ban also will cover Instagram. The Facebook advertising boycott came after civil-rights groups including the Anti-Defamation League and NAACP called on brands to pull ad spending from Facebook for July. The groups said the social-media giant hadn't made enough progress enforcing its policies on hate speech and misinformation. Twitter was not a target of the civil-rights group's boycott call, but it has also come under scrutiny on Madison Avenue. Representatives from Facebook and Twitter were unavailable for immediate comment Facebook has taken some steps in recent years to better police its platforms, adding workers and developing new technology. That has resulted in the removal of hate speech and other objectionable content. \"We acknowledge the efforts of our partners, but there is much more to be done, especially in the areas of divisiveness and hate speech during this polarized election period in the U.S.,\" Unilever said in the statement. \"The complexities of the current cultural landscape have placed a renewed responsibility on brands to learn, respond and act to drive a trusted and safe digital ecosystem.\" Mr. Di Como said Unilever would like to see a reduction in the level of hate speech on the platforms and wants independent companies to measure and confirm that progress has been made. Write to Suzanne Vranica at suzanne.vranica@wsj.com"}]}