{"article": [{"url": "https://www.marketwatch.com/story/trumps-vital-signs-stable-and-in-normal-range-presidents-doctor-says-11602092236", "published": 1602085820.0, "headline": "Trumpâ\u0080\u0099s vital signs â\u0080\u0098stable and in normal range,â\u0080\u0099 presidentâ\u0080\u0099s doctor says", "body": "President Donald Trump walks to Marine One on October 5, 2020, at Walter Reed Medical Center in Bethesda, Maryland. President Donald Trumpâ\u0080\u0099s vital signs all remain â\u0080\u009cstable and in a normal range,â\u0080\u009d Dr. Sean Conley said Wednesday. In a brief summary released by the White House, Conley, Trumpâ\u0080\u0099s physician said the president has been fever-free for more than 4 days, symptom free for over 24 hours and hasnâ\u0080\u0099t needed any supplemental oxygen since he was in the hospital. Conley said Wednesday that Trump had developed IgG antibodies that he did not have last Thursday. According to the Centers for Disease Control and Prevention, people who have been infected with COVID-19 usually develop IgG and then IgM antibodies, and the detection of antibodies can occur within a week of symptoms in some people. Though antibodies are thought to convey protection against future infections with the coronavirus, it is not yet clear whether that is true or how long protection may last. Medical experts raised questions about whether Trumpâ\u0080\u0099s IgG antibodies are naturally occurring or if they are a result of the experimental antibody-based treatment he received last week. A spokesperson for Regeneron Pharmaceuticals Inc., which provided the therapy on a compassionate use basis, said in a statement that â\u0080\u009cgiven the volume of IgG antibodies delivered in our therapy, and the timing of these tests, it is likely that the second test is detecting REGN-COV2 antibodies.â\u0080\u009d Trump remains out of sight at the White House, limiting himself to communicating via Twitter. Trump said he tested positive for COVID-19 last Thursday. White House officials have not said when the president last tested negative. That makes it hard to determine when it might be safe for him to return to the election campaign. His Democratic opponent, Joe Biden, has said there shouldnâ\u0080\u0099t be a second debate if Trump still has Covid-19. The next presidential election debate is set for Oct. 15 in Miami."}]}