{"article": [{"url": "https://www.marketwatch.com/story/irs-says-more-americans-now-eligible-for-covid-related-distributions-from-retirement-accounts-2020-06-19", "published": 1592640140.0, "headline": "IRS says more Americans now eligible for COVID-related distributions from retirement accounts", "body": "The Internal Revenue Service announced on Friday more Americans will be able to withdraw money from their retirement accounts if they were affected by the coronavirus, either financially or physically. As part of the response to the coronavirus crisis, which has burdened the economy and taken millions of Americans out of work, the government said in April retirement savers could take qualified distributions of up to $100,000 in retirement assets, including 401(k) plans and individual retirement accounts. In normal circumstances, individuals could distribute a maximum of $50,000. Investors could also take up to $100,000 as a loan from a 401(k), up from the usual $50,000 limit. To be eligible for the distribution or loan, Americans had to be impacted by the crisis. Examples include becoming ill with COVID-19 or getting laid off from work. Under the expansion, the IRS said people who had a job offer rescinded or a delayed start date are now eligible as well. The new rules also allow spouses or household members to take these distributions if someone in the home was affected. Employers can choose to implement these coronavirus-related distributions and loans or not, though individuals can claim the tax benefits regardless, the IRS stated. See: Here comes the retirement crisis, coronavirus-style Financial advisers caution Americans to think carefully before taking a distribution or loan from a retirement account, as doing so could have adverse effects on future retirement security. Distributions still have tax consequences, and must be paid within three years. Loans must be repaid, with interest going toward the individual’s account, but could become complicated if someone is separated from their employer before the repayment is done. Less money in these accounts results in lower potential returns in the future, so they should be treated as a last resort, advisers told MarketWatch. The full impact of the coronavirus on retirement savings and security is still unknown, but nearly half of workers say they expect to withdraw from their assets because of it, a Principal Financial Group survey found. Around 15% of people said they’ll tap into their emergency savings, 13% said they’d take the money from their employer-based retirement plans, 4% said they’ll raid their IRAs and another 4% said they’ll use their Health Savings Accounts."}]}