{"article": [{"url": "https://www.marketwatch.com/story/this-is-the-biggest-mistake-people-make-while-wearing-a-face-mask-2020-07-24", "published": 1595663120.0, "headline": "This is the biggest mistake people make while wearing a face mask", "body": "Cover your nose. Perhaps the biggest mistake that many folks are making with face masks — besides not wearing them in public at all — is pulling the facial coverings down so that the nose is exposed. Amid the ongoing debate over when and where people should wear masks, and the mixed messaging behind that, what’s perhaps been lost in the din is the correct way to put on a mask to actually help prevent the spread of COVID-19 in the first place. The CDC guidelines call for wearing a mask that covers both your nose and your mouth, with the mask secured under your chin. It should fit snugly against your face. There should not be large openings or gaps around your nose, mouth and the sides of your face. iframe.twitter-tweet { width: 100% !important; } But as summer temperatures have scorched the U.S. — and, let’s face it, some social distancing fatigue has set in as the pandemic continues — health officials have had to remind people that pulling their masks down below their noses or their chins renders the mask basically useless. That’s because you can still inhale the virus through your nose, or exhale viral particles and spread them to other people through your nose — even if you don’t feel sick. In fact, a recent study from the University of North Carolina at Chapel Hill found that the SARS-CoV-2 — the coronavirus that causes COVID-19 — infects the cells in your nose much more easily than the cells in your throat or your lungs. Once the virus has established itself in your nose, it can then be aspirated into your lungs and cause more serious problems. What’s more, the study suggests that people are probably releasing a higher concentration of the COVID-19 virus when breathing out of their noses, rather than exhaling out of their mouths. “If the nose is the dominant initial site from which lung infections are seeded, then the widespread use of masks to protect the nasal passages, as well as any therapeutic strategies that reduce virus in the nose, such as nasal irrigation or antiviral nasal sprays, could be beneficial,” said study co-senior author Dr. Richard Boucher in a statement. Wearing masks “really is a two-fer,” he further explained to the News & Observer. “You’re protecting yourself, and you’re protecting somebody else from you transmitting something in an asymptomatic phase.” But you have to wear the mask properly. New York Gov. Andrew Cuomo recently took sloppy mask behavior to task while warning protesters and police alike to wear the coverings properly last month. “This is a mask,” he said, pulling one up to cover his nose, mouth and chin. Then he pulled it down below his chin. “This is a chin guard,” he said, noting that wearing a mask this way “accomplishes nothing.” “Nobody told you to wear a chin guard. Wear a mask,” he said. More than 4 million Americans have tested positive for COVID-19, and 143,967 have died as of Friday morning. Dr. Anthony Fauci says, “I certainly don’t think we’re near the end of this” in a new interview with MarketWatch. President Donald Trump has at times also struck a more somber tone over the pandemic that has infected more than 15.3 million globally — and even begun calling on Americans to wear masks this week. “ “Nobody told you to wear a chin guard. Wear a mask.” ” — Gov. Andrew Cuomo But individuals can make a major impact in the battle against this global crisis by taking three simple steps: washing their hands regularly, keeping their distance from other people — and wearing masks. That’s according to a study out of the Netherlands that was published on Tuesday. “A large epidemic can be prevented if the efficacy of these measures exceeds 50%,” the researchers wrote. In other words, “SARS-CoV-2 will not cause a large outbreak in a country where 90% of the population adopts handwashing and social distancing that are 25% efficacious (i.e., reduce susceptibility and contact rate by 25%, respectively).” Indeed, at least 230,000 cases of the coronavirus may have been prevented due to government orders requiring face masks in 15 states and the District of Columbia between April and mid-May, according to a recent study by two University of Iowa professors. Another study suggests that nearly 45,000 U.S. deaths from coronavirus could be prevented by November if 95% of the population wore masks. Read more:As coronavirus cases surge, California is the latest state to require face masks — why other states may want to follow its lead But gender, political affiliation, race, income and geography all appear to play a role when it comes to whether individuals choose to wear a mask or not. There are also many myths and misconceptions surrounding masks, such as that people only need to wear one if they’re showing symptoms, or that wearing a mask will reduce your oxygen level. Neither of these is true. Read more:Here are the 5 biggest mask myths Apart from making sure that your mask covers your nose and mouth, make sure it consists of two or three layers, which is best in preventing viral droplets spreading from your nose and mouth. An observational study published in the medical journal Thorax on Thursday found that a two-layer facial covering reduced the number of droplets spreading from coughing and sneezing better than a single layer of fabric. A three-ply surgical mask was the most effective. Still, even one layer is better than nothing. Related:After watching surgeon general’s Twitter video on face masks, doctor sent him research on the best materials to use And while you’re staying vigilant about washing your hands, don’t forget to wash your reusable face masks every day. You should also store them in a paper bag or re-sealable plastic bag to prevent them from becoming contaminated, rather than tossing them on your dresser or in your car. Here’s the best way to clean your face mask. Follow more of MarketWatch’s coronavirus coverage here."}]}