{"article": [{"url": "https://www.marketwatch.com/story/should-schools-reopen-amid-the-coronavirus-outbreak-the-downside-of-keeping-kids-home-is-pretty-severe-goldman-says-11596476258", "published": 1596462320.0, "headline": "Should schools reopen amid the coronavirus outbreak? The downside of keeping kids home is pretty severe, Goldman says", "body": "In a more normal time, this would be the time of year for back-to-school shopping, signing up for teams and clubs and choruses, and scheduling parent-teacher conferences. But this is no normal time, and with only days left before the scheduled start of the school year in some areas, there’s still no clear consensus on how to manage heading back to school for millions of children will look like during a pandemic. In a research note published Sunday, Goldman Sachs economists present the pros and cons of staying closed and of re-opening. While the risks of sending children back to the classroom are real, “the costs to the economy and students of keeping schools closed are also substantial,” including, notably, lost education jobs, write the economists, David Choi and Joseph Briggs. The researchers estimate that 1.2 million of the 22.2 million jobs lost in March and April were education-related. That figure includes support staff like lunch workers and custodians, too. While teacher employment is now back to pre-pandemic levels, the other, lower-skilled, jobs haven’t recovered. “School closures may also have a large impact on other parts of the economy closely tied to the education sector, such as food providers for meal programs and businesses in college towns,” Choi and Briggs write. Perhaps just as crucial as the impact on those working formally in the education sector is the effect on parents, who now find themselves having to fill those roles informally while continuing their own jobs. Parents – particularly woman – may have to drop out of the labor force or make only partial returns to work because they’re also having to serve as fulltime caregivers and educators, the economists wrote. Data collected through the pandemic suggests it has “significantly disrupted labor supply.” Since May, roughly 7 million Americans haven’t worked each week, according to the Census department. Among workers absent from work, a historically high percent cite a lack of child care as the reason. Choi and Briggs analyze the effect of three impacts on the workforce. Single parents, those with younger children, and those with less ability to work from home are the most affected, and thus the most likely to be absent from work or to stop working altogether. About 30% of the pre-virus labor force has children at home, and a remarkable 15% of the labor force, or 24 million workers, fall into one of those three “higher-risk” categories. This analysis doesn’t take into account longer-term costs, which the Goldman analysts say include “negative effects from lower quality education, the lack of social and emotional skill development, increased rates of depression and anxiety, food insecurity, worsening income inequality if lower income households are less able to work from home, and worsening educational inequality if poorer households have less access to remote learning.” “While many of these costs are not immediate in nature, they may have very important and long-lasting societal consequences,” the analysts said. Related: The coronavirus crisis is costing states and locals hundreds of billions, analysis finds For all the aforementioned reasons that seem to argue in favor of re-opening schools, a parent’s worst nightmare may be sending a child into a dangerous situation, the economists recognize. “However, growing evidence suggests that children may be less likely to become infected than adults, and it is now clear that children are much less likely to show serious symptoms from the coronavirus, with a fatality rate close to zero for school-age children,” the analysts write. “This suggests that the reopening of schools may not pose a very high level of risk for schoolchildren themselves.” Yet there is competing evidence, including one widespread COVID-19 outbreak among younger children at a summer camp in Georgia, they acknowledge. And perhaps most significantly, the successful re-opening of schools in other countries depends on their having much lower infection levels – a more than 10 times lower level of daily new infections than in the U.S., Choi and Briggs write. “As with many other areas of economic activity, the trajectory of school re-openings will depend crucially on whether the virus spread among the broader population is first managed,” they conclude. But time is growing short for everyone involved – parents, teachers, support staff, administrators, local government, and more – to evaluate whether that management is actually taking place. Read next: Mass shootings also take a significant economic toll, new research finds"}]}