{"article": [{"url": "https://www.marketwatch.com/story/bull-trend-intact-sp-500-nasdaq-rally-from-major-support-2020-09-15-121034232", "published": 1600174220.0, "headline": "Bull trend intact:  S&P 500, Nasdaq rally from major support", "body": "Editor’s Note: This is a free edition of The Technical Indicator, a daily MarketWatch subscriber newsletter. To get this column each market day, click here. Technically speaking, the major U.S. benchmarks are back on offense, rising in the wake of an aggressive September downdraft. Against this backdrop, the S&P 500 and Nasdaq Composite have narrowly maintained major support — S&P 3,328 and Nasdaq 10,840 — rising from key tests to preserve a bullish intermediate-term bias. Before detailing the U.S. markets’ wider view, the S&P 500’s US:SPX hourly chart highlights the past two weeks. As illustrated, the S&P has narrowly maintained major support. The specific area matches the early-2020 breakout point (3,328) and the 50-day moving average, currently 3,331. The prevailing upturn punctuates a successful retest, preserving a bullish intermediate-term bias. Meanwhile, the Dow Jones Industrial Average US:DJIA has maintained its range bottom. The index registered consecutive session lows last week within one point of support (27,447). Slightly more broadly, the Dow has weathered a shaky test of its breakout point (27.580), an area better illustrated on the daily chart. Against this backdrop, the Nasdaq Composite US:COMP is digesting an 11% plunge from record highs. Two inflection points stand out: The 50-day moving average, currently 10,970. Major support matching the former breakout point (10,840). Last week’s close (10,853) registered slightly atop support, and the index has reclaimed its 50-day moving average with this week’s strong start. Widening the view to six months adds perspective. On this wider view, the Nasdaq is digesting its fastest-ever 10%+ pullback from record territory. The September downturn has been underpinned by major support (10,840), detailed repeatedly. Consider that the September closing low (10,847) — established last Tuesday — and last week’s close (10,853) registered nominally atop major support. The shaky, but successful, retest preserves a bullish intermediate-term bias. Looking elsewhere, the Dow Jones Industrial Average has survived an extended test of its breakout point (27,580). Recall that the Dow is adjusting to three new components, and Apple’s recent stock split, events that have affected its technical levels on the margin. Delving deeper, the 50-day moving average, currently 27,356, remains an inflection point. The 50-day effectively defined the May, June and late-July lows. Meanwhile, the S&P 500 has pulled in as much as 7.7% from its record high. Consider that last week’s closing low (3,331) — established last Tuesday — registered slightly atop next support (3,328). The index has maintained this area on a closing basis. Separately, the S&P has briefly tagged its 50-day moving average, currently 3,331, for the first time since April. The bigger picture Collectively, the S&P 500 and Nasdaq Composite have survived key technical tests even amid an aggressive September downturn. More directly, the S&P 500 has narrowly maintained major support (3,328) while the Nasdaq Composite has weathered an extended test of its breakout point (10,840). (See the Sept. 8 review.) Last week’s closing lows — S&P 3,331 and Nasdaq 10,847, both established last Tuesday — registered nominally atop support to initiate a full-week test. The prevailing rallies from support punctuate successful retests, preserving a bullish intermediate-term bias. Moving to the small-caps, the iShares Russell 2000 ETF has rallied from an extended test of the 50-day moving average. The upturn places its breakdown point (153.39) in play. Monday’s session high (153.43) matched resistance, and a retest remains underway. Similarly, the SPDR S&P MidCap 400 ETF has weathered an extended September test of the 50-day moving average. So combined, the small- and mid-caps — as well as the S&P 500 and Nasdaq Composite — have at least tagged the 50-day moving average, if not hammered it. The Dow industrials have maintained a posture atop the 50-day. Looking elsewhere, the SPDR Trust S&P 500 has rallied from its 50-day moving average, currently 332.64. To reiterate, overhead inflection points match the former breakout point (338.35) and the 20-day moving average, currently 342.78. Follow-through atop these areas would signal waning selling pressure. Monday’s close (338.46) matched resistance, and the SPY has followed through higher early Tuesday. Placing a finer point on the S&P 500, the index has maintained major support (3,328). To reiterate, last Tuesday’s session low (3,329.25) and Thursday’s low (3,329.27) effectively matched the inflection point. The index briefly undercut support Friday before notching a weekly close (3,341) atop support. Conversely, last week’s high (3,425) closely matches the 20-day moving average, currently 3,429. Follow-through atop this area would strengthen the near-term backdrop, potentially signaling an end to the consolidation phase. More broadly, th S&P has narrowly maintained the 50-day moving average, currently 3,331, a level matching major support (3,328). The index briefly tagged the 50-day moving average Friday — on an intraday basis — for the first time since April. Both levels mark headline inflection points — detailed previously — and the successful retest preserves a bullish intermediate-term bias. Beyond technical levels, the markets’ response to the Federal Reserve’s mid-week policy statement may add color. Also see: Charting a market downdraft, S&P 500 sells off to major support.Tuesday’s Watch List The charts below detail names that are technically well positioned. These are radar screen names — sectors or stocks poised to move in the near term. For the original comments on the stocks below, see The Technical Indicator Library. Drilling down further, the Materials Select Sector SPDR US:XLB is acting well technically. (Yield = 2.1%.) As illustrated, the group has rallied to challenge its record peak (66.33), established Sept. 2. A near-term target projects to the 69.00 area on follow-through. Conversely, the prevailing upturn originates from trendline support and the breakout point (63.10). Slightly more broadly, the ascending 50-day moving average previously defined the trend. The group’s intermediate-term bias remains bullish barring a violation. Looking elsewhere, the VanEck Vectors Gold Miners ETF US:GDX is showing signs of life ahead of the Federal Reserve’s policy statement. Technically, the group has edged atop trendline resistance, rising from support matching the breakout point. The upturn opens the path to a potential retest of seven-year highs at the August peak. Conversely, the trendline pivots to support. Delving slightly deeper, the 50-day moving average, currently 41.20, is followed by the September low (39.30). More broadly, the group is well positioned on the five-year chart, asserting a bullish continuation pattern hinged to the massive early-2020 rally. Moving to specific names, American Express Co. US:AXP is a Dow 30 component coming to life. (Yield = 1.6%.) As illustrated, the shares have reclaimed the 200-day moving average, rising from a tight September range. The upturn punctuates consecutive August tests of trendline support. Tactically, the breakout point (104.80) closely matches the 200-day moving average (104.54) and is followed by the former range bottom (102.00). The rally attempt is intact barring a violation. Initially profiled July 13, SunPower Corp. US:SPWR has returned 81.6% and remains well positioned. Late last month, the shares gapped to four-year highs, rising as the company spun off Maxeon Solar Technologies. The subsequent pullback has been flat, fueled by decreased volume, placing the shares 13.6% under the September peak. Tactically, the top of the gap (10.50) is followed by the post-breakout low (9.95). A sustained posture higher signals a firmly-bullish bias. Finally, Agnico Eagle Mines, Ltd. US:AEM is a large-cap Toronto-based gold miner. Technically, the shares have reached nine-year highs, clearing well-defined resistance amid a volume spike. The upturn punctuates an orderly five-week range. A near-term target projects to the 92.00 area. Conversely, the breakout point pivots to support (84.50) and is followed by a near-term floor matching the August gap (81.50). The prevailing uptrend is firmly intact barring a violation. Editor’s Note: This is a free edition of The Technical Indicator, a daily MarketWatch subscriber newsletter. To get this column each market day, click here.Still well positioned The table below includes names recently profiled in The Technical Indicator that remain well positioned. For the original comments, see The Technical Indicator Library. Company Symbol* (Click symbol for chart.) Date Profiled V.F. Corp. VFC Sept. 14 Crocs, Inc. CROX Sept. 14 Toyota Motor Co. TM Sept. 14 Five Below, Inc. FIVE Sept. 10 Dow Inc. DOW Sept. 10 Eastman Chemical Co. EMN Sept. 10 CrowdStrike Holdings, Inc. CRWD Sept. 9 Workhorse Group, Inc. WKHS Sept. 9 International Paper Co. IP Sept. 3 Anaplan, Inc. PLAN Sept. 2 Beyond Meat, Inc. BYND Sept. 1 Elastic N.V. ESTC Sept. 1 iShares U.S. Real Estate ETF IYR Sept. 1 Yum Brands, Inc. YUM Aug. 31 Medtronic MDT Aug. 28 Celanese Corp. CE Aug. 26 Hilton Worldwide Holdings, Inc. HLT Aug. 26 Norfolk Southern Corp. NSC Aug. 25 Westlake Chemical Corp. WLK Aug. 25 Deere & Co. DE Aug. 24 PulteGroup, Inc. PHM Aug. 24 Expedia Group, Inc. EXPE Aug. 24 Visa, Inc. V Aug. 21 Johnson Controls International JCI Aug. 21 DuPont de Nemours, Inc. DD Aug. 21 Adobe, Inc. ADBE Aug. 20 Canadian Solar, Inc. CSIQ Aug. 20 General Motors Co. GM Aug. 20 Starbucks Corp. SBUX Aug. 18 Emerson Electric Co. EMR Aug. 18 Builders FirstSource, Inc. BLDR Aug. 18 Steel Dynamics, Inc. STLD Aug. 17 Elanco Animal Health, Inc. ELAN Aug. 17 Eaton Corp. ETN Aug. 14 Brinker International, Inc. EAT Aug. 13 Enphase Energy, Inc. ENPH Aug. 13 Avis Budget Group, Inc. CAR Aug. 12 U.S. Global Jets ETF JETS Aug. 11 Nike, Inc. NKE Aug. 11 Nucor Corp. NUE Aug. 11 Financial Select Sector SPDR XLF Aug. 10 Freeport McMoRan, Inc. FCX Aug. 10 Natera, Inc. NTRA Aug. 10 Lennar Corp. LEN Aug. 7 McDonald’s Corp. MCD Aug. 7 Mastercard, Inc. MA Aug. 6 United Health Group, Inc. UNH Aug. 6 Kansas City Southern KSU Aug. 6 Industrial Select Sector SPDR XLI Aug. 6 Verizon Communications, Inc. VZ Aug. 5 Sunrun, Inc. RUN Aug. 5 Coeur Mining, Inc. CDE Aug. 5 Southern Copper Corp. SCCO Aug. 3 Agco Corp. AGCO July 31 Penn National Gaming, Inc. PENN July 30 Procter & Gamble Co. PG July 29 SPDR S&P Metals & Mining ETF XME July 28 iShares MSCI South Korea ETF EWY July 28 HCA Healthcare, Inc. HCA July 28 Toll Brothers, Inc. TOL July 27 HP, Inc. HPQ July 24 Advanced Micro Devices, Inc. AMD July 23 Best Buy Co., Inc. BBY July 22 iShares Europe ETF IEV July 21 Materials Select Sector SPDR XLB July 20 Caterpillar, Inc. CAT July 20 Monster Beverage Corp. MNST July 20 iShares U.S. Home Construction ETF ITB July 17 Progressive Corp. PGR July 17 Livongo Health, Inc. LVGO July 17 Roku, Inc. ROKU July 16 Catalent, Inc. CTLT July 16 Cognizant Technology Solutions, Inc. CTSH July 16 Health Care Select Sector SPDR XLV July 16 Consumer Staples Select Sector SPDR XLP July 15 Home Depot, Inc. HD July 15 Costco Wholesale Corp. COST July 15 Kirkland Lake Gold, Ltd. KL July 15 Air Products & Chemicals, Inc. APD July 14 Consumer Discretionary Select Sector SPDR XLY July 13 Alphabet, Inc. GOOGL July 13 Sony Corp. SNE July 13 SunPower Corp. SPWR July 13 D.R.Horton, Inc. DHI July 9 Taylor Morrison Home Corp. TMHC July 9 LGI Homes, Inc. LGIH July 8 Walmart, Inc. WMT July 8 J.B. Hunt Transport Services, Inc. JBHT July 8 Big Lots, Inc. BIG July 1 Tandem Diabetes Care, Inc. TNDM July 1 Dell Technologies, Inc. DELL June 30 Yeti Holdings, Inc. YETI June 25 Danaher Corp. DHR June 24 RH RH June 24 First Solar, Inc. FSLR June 22 Lowe’s Companies LOW June 19 Fiverr International, Ltd. FVRR June 19 Etsy, Inc. ETSY June 17 Williams-Sonoma, Inc. WSM June 9 HubSpot, Inc. HUBS June 8 Square, Inc. SQ June 8 United Parcel Service, Inc. UPS June 5 FedEx Corp. FDX June 3 SPDR S&P Retail ETF XRT June 3 iShares MSCI Japan ETF EWJ May 29 SolarEdge Technologies, Inc. SEDG May 29 Synopsis, Inc. SNPS May 27 iShares Silver Trust SLV May 15 Agnico Eagle Mines, Ltd. AEM May 15 Agilent Technologies, Inc. A May 15 Halozyme Therapeutics, Inc. HALO May 15 Qualcomm, Inc. QCOM May 12 Kinross Gold Corp. KGC May 11 Salesforce.com, Inc. CRM May 8 Facebook, Inc. FB May 7 Spotify Technology S.A. SPOT May 5 Old Dominion Freight Line, Inc. ODFL Apr. 29 Dollar General Corp. DG Apr. 28 ServiceNow, Inc. NOW Apr. 27 Five9, Inc. FIVN Apr. 24 Chewy, Inc. CHWY Apr. 24 Tesla, Inc. TSLA Apr. 23 Shopify, Inc. SHOP Apr. 23 VanEck Vectors Semiconductor ETF SMH Apr. 17 Veeva Systems, Inc. VEEV Apr. 17 Okta, Inc. OKTA Apr. 16 Target Corp. TGT Apr. 16 Netflix, Inc. NFLX Apr. 14 VanEck Vectors Gold Miners ETF GDX Apr. 14 Invesco QQQ Trust QQQ Apr. 14 DocuSign, Inc. DOCU Apr. 3 Zscaler, Inc. ZS Apr. 3 Apple, Inc. AAPL Mar. 27 Nvidia Corp. NVDA Mar. 27 Amazon.com, Inc. AMZN Mar. 26 Zoom Video Communications, Inc. ZM Mar. 19 iShares MSCI Emerging Markets ETF EEM Mar. 19 Newmont Corp. NEM Jan. 13 SPDR Gold Shares ETF GLD Jan. 2 Microsoft Corp. MSFT Feb. 22 * Click each symbol for current chart."}]}