{"article": [{"url": "https://www.marketwatch.com/story/ok-boomers-millennials-and-younger-americans-now-constitute-a-majority-of-the-us-population-2020-08-04", "published": 1596544460.0, "headline": "OK, boomers? Millennials and younger Americans now constitute a majority of the U.S. population", "body": "ORLANDO, Fla. (AP) — Sorry, boomers. Millennials and their younger siblings and children now make up a majority of the U.S. population. Don’t miss:Census Bureau set to close 2020 data-collection window a month early A new analysis by the Brookings Institution shows that 50.7% of U.S. residents were under age 40, as of July 2019. The Brookings analysis of population estimates released this summer by the U.S. Census Bureau shows that the combined millennial, Generation Z and younger generations numbered 166 million people. The combined Generation X, baby boomer, and older cohorts represented 162 million U.S. residents. “To many Americans — especially baby boomers themselves — this news may come as a shock. For them, the term “millennial” has been associated with a youthful, often negative, vibe in terms of habits, ideology, and politics,” William Frey, a senior fellow at Brookings’ Metropolitan Policy Program, wrote in the analysis. “Now, the oldest millennial is 39, and with their numbers exceeding those of baby boomers, the millennial generation is poised to take over influential roles in business and government.” Those under age 40 are more diverse than the older cohorts, with almost half identifying as being part of a racial or ethnic minority. Past surveys show that the younger generations split from the older generations on issues such as immigration reform, criminal justice reform and environmental protection, and the pandemic and recent racial justice protests are likely to galvanize the younger groups to promote an array of progressive causes, Frey wrote. Buck Newsome, a baby boomer from Ohio, poses during a June lunch beside his son, Chris, a member of the millennial generation. Associated Press Millennials typically are defined as being born between 1981 and 1996. Baby boomers, long considered a primary driver of demographic and social change in the U.S. because of their large numbers, were born between the end of World War II and the arrival of the Beatles in the U.S. in 1964. Squeezed between the boomers and millennials, Generation X-ers were born in the late 1960s and 1970s. Members of Generation Z were born after 1996."}]}