{"article": [{"url": "https://www.marketwatch.com/story/kamala-harris-blasts-trumps-coronavirus-response-he-was-fixated-on-the-stock-market-over-fixing-the-problem-2020-08-27", "published": 1598545820.0, "headline": "Kamala Harris blasts Trumpâ\u0080\u0099s coronavirus response: â\u0080\u0098He was fixated on the stock market over fixing the problemâ\u0080\u0099", "body": "“ â\u0080\u009cHereâ\u0080\u0099s why Trump has been so unwilling and unable to deal with this crisis. First, he was fixated on the stock market over fixing the problem.â\u0080\u009d ” â\u0080\u0094 Kamala Harris The line above came Thursday from Kamala Harris, Democratic presidential nominee Joe Bidenâ\u0080\u0099s running mate, as she delivered a speech in which she attacked President Donald Trumpâ\u0080\u0099s handling of the coronavirus crisis. Harris went on to say that Trump tweeted about the market â\u0080\u009cconsistently during this period. He was convinced that if his administration focused on this virus, it would hurt the market and hurt his chances of being re-elected.â\u0080\u009d â\u0080\u009cSecond, right at the moment we needed Donald Trump to be tough on the Chinese government, he caved,â\u0080\u009d she added, noting that Trump praised Beijingâ\u0080\u0099s response to COVID-19 in January. Related:Trump says his executive actions on coronavirus aid led to stock marketâ\u0080\u0099s gain In her roughly 20-minute speech from Washington, D.C., the Democratic vice presidential nominee also said a pandemic is â\u0080\u009crelentless â\u0080\u0094 you canâ\u0080\u0099t stop it with a tweet.â\u0080\u009d In addition, she criticized this weekâ\u0080\u0099s Republican National Convention, a four-day event that ends tonight with a speech from Trump. â\u0080\u009cThe Republican convention is designed for one purpose â\u0080\u0094 to soothe Donald Trumpâ\u0080\u0099s ego, to make him feel good,â\u0080\u009d Harris said. â\u0080\u009cBut hereâ\u0080\u0099s the thing. Heâ\u0080\u0099s the president of the United States, and itâ\u0080\u0099s not supposed to be about him. Itâ\u0080\u0099s supposed to be about the health and the safety and the well-being of the American people. And on that measure, Donald Trump has failed.â\u0080\u009d See: Trump to attack Biden tonight as a â\u0080\u0098weak candidate with a poor recordâ\u0080\u0099 Harris also addressed the recent shooting by police in Kenosha, Wis., of a Black man, Jacob Blake, saying it was â\u0080\u009csickeningâ\u0080\u009d and she supported those protesting peacefully. She said the country must have criminal-justice reform and address systemic racism. The main U.S. stock gauges DJIA, +0.56% Â mostly finished with gains on Thursday, with the S&P 500 SPX, +0.87% notching a fresh record close while the Nasdaq Composite COMP, +1.39% pulled back."}]}