{"article": [{"url": "https://www.marketwatch.com/story/boris-johnson-defends-plan-to-rewrite-brexit-deal-says-eu-unreasonable-2020-09-14", "published": 1600107320.0, "headline": "Boris Johnson defends plan to rewrite Brexit deal, says EU â\u0080\u0098unreasonableâ\u0080\u0099", "body": "LONDON â\u0080\u0094 British Prime Minister Boris Johnson on Monday defended his plan to unilaterally rewrite Britainâ\u0080\u0099s divorce deal with the European Union as an insurance policy against the blocâ\u0080\u0099s unreasonable behavior â\u0080\u0094 even as his former attorney general joined the ranks of once-loyal lawmakers condemning the contentious move. Johnson said a planned law designed to override portions of the Brexit withdrawal agreement was needed because the EU might â\u0080\u009cgo to extreme and unreasonable lengthsâ\u0080\u009d in its treatment of former member Britain. â\u0080\u009cI have absolutely no desire to use these measures,â\u0080\u009d Johnson told lawmakers as he introduced the Internal Market Bill in the House of Commons. â\u0080\u009cThey are an insurance policy.â\u0080\u009d Johnsonâ\u0080\u0099s Conservative government has acknowledged that the bill breaches the legally binding withdrawal treaty that Britain and the EU have both ratified. The legislation threatens to sink the already-foundering negotiations between Britain and the EU on a post-Brexit trade deal. The U.K. formally left the bloc on Jan. 31, but existing trade rules remain in effect until the end of this year under a transition designed to provide time to negotiate a long-term trade agreement. Ed Milliband, business spokesman for the opposition Labour Party, accused Johnson of â\u0080\u009ctrashing the reputation of this country and trashing the reputation of his office.â\u0080\u009d With an 80-seat majority in the House of Commons, Johnson is expected to have enough votes to push his legislation through Parliament despite opposition anger. The bill easily cleared its first House of Commons vote by 340 to 263 on Monday. It will now face attempts to amend or overturn it during several days of detailed scrutiny by lawmakers before another vote. There is wide unease within Johnsonâ\u0080\u0099s party about the law-breaking move. Geoffrey Cox, who was the governmentâ\u0080\u0099s top legal officer when Johnson negotiated the Brexit withdrawal agreement less than a year ago, said reneging on the deal would be an â\u0080\u009cunconscionableâ\u0080\u009d breach of international law. â\u0080\u009cI simply cannot approve or endorse a situation in which we go back on our word, given solemnly,â\u0080\u009d Cox, previously a strong supporter of Johnson on Brexit, told Times Radio. â\u0080\u009cThe breaking of the law ultimately leads to very long-term and permanent damage to this countryâ\u0080\u0099s reputation.â\u0080\u009d Sajid Javid, a former Treasury chief in Johnsonâ\u0080\u0099s government, also said he would not vote for the bill, because â\u0080\u009cI cannot support the U.K. pre-emptively renegingâ\u0080\u009d on the withdrawal agreement. As part of the Brexit divorce deal, Britain and the EU agreed to keep Northern Ireland â\u0080\u0094 the only part of the U.K. to share a border with the bloc â\u0080\u0094 bound to some EU rules on trade, to avoid the need for border checks on goods moving between Northern Ireland and the Republic of Ireland. Both sides accepted the compromise to protect the open border, which helps underpin the peace process in Northern Ireland. The Internal Market Bill would give the British government the power to override the EUâ\u0080\u0099s agreed role in oversight of trade between Northern Ireland and the rest of the U.K. Johnson claims the EU has threatened to use â\u0080\u009can extreme interpretationâ\u0080\u009d of the withdrawal agreement to â\u0080\u009cblockadeâ\u0080\u009d food shipments from the rest of the U.K. to Northern Ireland unless Britain agrees to accept EU regulations. The EU denies threatening a blockade and says it merely wants Britain to live up to the terms of the agreement. EU leaders are outraged at the prime ministerâ\u0080\u0099s proposal and have threatened the U.K. with legal action if it does not drop the proposal by the end of the month. Two former Conservative U.K. prime ministers, John Major and Theresa May, have condemned the legislation. On Monday a third, David Cameron, said he had â\u0080\u009cmisgivings.â\u0080\u009d Conservative lawmaker Rehman Chishti quite as the prime ministerâ\u0080\u0099s special envoy on freedom of religion in protest over the bill. He tweeted Monday that as a former lawyer, â\u0080\u009cvalues of respecting rule of law & honouring oneâ\u0080\u0099s word are dear to me.â\u0080\u009d What mystifies some observers is that Johnson is repudiating a treaty that he himself negotiated and hailed as an â\u0080\u009coven-readyâ\u0080\u009d deal that would â\u0080\u009cget Brexit done.â\u0080\u009d That declaration of victory was key to Johnsonâ\u0080\u0099s successful December 2019 election campaign. â\u0080\u009cThere was a political imperative on the government to get an agreement and then to go to the electorate with the claim that they had, to coin a phrase, got Brexit done,â\u0080\u009d said Tim Bale, professor of politics at Queen Mary University of London. â\u0080\u009cI think it possibly was the case in some senses that it was â\u0080\u0098make the agreement in haste and then repent at leisure.â\u0080\u0099 And what weâ\u0080\u0099re seeing now is the repentance.â\u0080\u009d Johnsonâ\u0080\u0099s move has dynamited the dwindling trust between Britain and the EU as they try to negotiate a new trading relationship. Talks are due to continue this week in Brussels despite the chill in relations. Both sides say any deal must be agreed by next month so there is time for it to be ratified by Dec. 31. If there is no deal, tariffs and other impediments to trade will be imposed by both sides at the start of 2021. That would mean huge economic disruption for the U.K., which does half its trade with the bloc. A no-deal exit on Jan. 1 would also hit some EU nations, including Ireland, France, Belgium and the Netherlands, especially hard."}]}