{"article": [{"url": "https://www.marketwatch.com/story/existing-home-sales-soar-at-a-record-pace-in-july-as-americans-look-to-make-up-for-lost-time-2020-08-21", "published": 1598087780.0, "headline": "Existing-home sales soar at a record pace in July as Americans make up for lost time â\u0080\u0094 but two big caveats remain", "body": "The numbers: Sales of previously-owned homes in the U.S. rose 24.7% between June and July to a seasonally-adjusted annual rate of 5.86 million, the National Association of Realtors reported Friday. It was the second consecutive month in which the monthly increase was the largest on record, according to the trade group. Compared with a year ago, sales were up 8.7% in July. â\u0080\u009cThe housing market is well past the recovery phase and is now booming with higher home sales compared to the pre-pandemic days,â\u0080\u009d Lawrence Yun, NARâ\u0080\u0099s chief economist, said in the report. â\u0080\u009cWith the sizable shift in remote work, current homeowners are looking for larger homes and this will lead to a secondary level of demand even into 2021.â\u0080\u009d Economists polled by MarketWatch had expected existing-home sales to come in at a rate of 5.5 million in July. What theyâ\u0080\u0099re saying: Economists, however, say two big caveats remain: the job market and the supply of available homes for sale. â\u0080\u009cContinued healing in the housing market is a positive for the overall economy, but elevated jobless claims raise concerns about how sustainable this housing demand is, especially in the face of rising prices,â\u0080\u009d Realtor.com chief economist Danielle Hale said. â\u0080\u009cBolstered by record low mortgage rates and demand stemming from millennials aging into their household formation years, the potential for existing-home sales will likely continue to rise,â\u0080\u009d First American Financial FAF, +0.97% Â chief economist Mark Fleming wrote in a report Thursday. However, he added, â\u0080\u009cYou canâ\u0080\u0099t buy whatâ\u0080\u0099s not for sale. The limited supply of existing homes for sale will continue to be an issue, and it will take builders years at a faster pace to build enough new supply to make up for the imbalance between supply and demand.â\u0080\u009d What happened: Sales of single-family homes were up 23.9% in July from a month earlier, while sales of existing condominiums and co-ops were up 31.8%. Regionally, the Northeast experienced the biggest monthly increase in sales with a 30.6% jump, closely followed by the Westâ\u0080\u0099s 30.5% rise. All four regions nationally reported increases. The median price for existing homes was $304,100 in July, up 8.5% from a year ago. Itâ\u0080\u0099s the first time that the national median home price surpassed the $300,000 threshold. Unsold inventory was at a 3.1-month supply, down from 3.9 months in June and 4.2 months a year ago. Generally, a 6-month supply of homes is considered indicative of a balanced market. The big picture: A number of factors suggested that existing-home sales were going to be high for July. This report measures when deals are closed â\u0080\u0094 and the pending home-sales report measures when contracts are signed for existing homes. Pending home sales in June were up compared with the previous year â\u0080\u0094 a massive turnaround from earlier in the COVID-19 crisis when contract signings were down sharply. That makes sense given that by June most parts of the country had emerged from their coronavirus-related business shutdowns, which made consumers more willing to go out and make big purchases. And other factors suggest a continued rise in existing-home sales. For instance, home-improvement retailers Home Depot HD, +0.49% Â and Loweâ\u0080\u0099s LOW, +1.38% Â both reported a strong increase in sales for the second quarter. â\u0080\u009cUsually, home-improvement activity is closely correlated with existing home sales,â\u0080\u009d Christophe Barraud, chief economist and strategist at Market Securities, wrote on his personal blog. However, there may be a limit to how much more sales can grow. Before the start of 2020, economists worried about the low inventory of existing homes for sale and suggested it would curtail sales activity. Since the pandemic began, thereâ\u0080\u0099s evidence some sellers have held off on listing their properties or pulled them from the market. Plus, the low supply has pushed prices higher in the face of out-sized demand. Eventually, some buyers will be priced out of the market. And that could put a ceiling on existing-home sales in the near future. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% Â and S&P 500 SPX, +0.87% Â were both up slightly in Friday trades."}]}