{"article": [{"url": "https://www.marketwatch.com/story/heres-what-the-rest-of-the-year-may-hold-for-the-stock-market-according-to-the-analysts-who-got-the-pandemic-call-right-2020-07-06", "published": 1594198700.0, "headline": "Hereâ\u0080\u0099s what the rest of the year may hold for the stock market, according to the analysts who got the pandemic call right", "body": "Thereâ\u0080\u0099s a lot of uncertainty in financial markets right now â\u0080\u0094 and a lot of vacillating, which can sometimes feel like the same thing. Many analysts believe markets will bounce back and forth for some time, driven by headlines, not fundamentals, until some big issues â\u0080\u0094 the U.S. presidential election, a COVID-19 treatment, just to name a few â\u0080\u0094 are resolved. The third-quarter outlook from BCA Research is a bit more resolute, however. The firm, led by its chief global strategist, Peter Berezin, acknowledges the â\u0080\u009cnervousâ\u0080\u009d tenor of trading patterns right now, but adds: â\u0080\u009cNevertheless, we would â\u0080\u0098buy the dipâ\u0080\u0099 if global equities were to fall 5% to 10% from current levels. While the pace of reopening will slow, there is little appetite for the sort of extreme lockdown measures that were implemented in March. The U.S. Congress will ultimately extend fiscal support for households and firms. Around the world, both fiscal and monetary policy will remain highly accommodative, which should provide a supportive backdrop for stocks.â\u0080\u009d Itâ\u0080\u0099s worth noting that the BCA team has gotten at least one big call right recently. In February, right as stocks SPX, +0.87% Â struck an all-time high, BCA cautioned that investors were likely being too complacent about the possibility of a global pandemic. Hereâ\u0080\u0099s a bit more of what BCA is thinking for the third quarter and beyond. â\u0080¢ Coronavirus will continue to take a toll, sometimes tragic, on the world, but â\u0080\u009cwe are unlikely to see the sort of broad-based economic dislocations experienced in Marchâ\u0080\u009d as mask-wearing and other preventative measures are adopted and because the medical community is better equipped to handle flareups, they say. â\u0080¢ The U.S. Congress will extend emergency benefits, despite some of the current heavy breathing about reining in government spending and the illogic of letting people earn more from unemployment than they did on the job. â\u0080\u009cPolitically, stimulus remains very popular,â\u0080\u009d the analysts wrote. â\u0080\u009cUnlike during the housing bust, there has been little moral handwringing about bailing out households and firms that â\u0080\u0098donâ\u0080\u0099t deserve it.â\u0080\u0099â\u0080\u009d â\u0080¢ Despite an overall bullish landscape for riskier assets, there will be â\u0080\u009cconsiderable near-term dislocations, particularly for airlines, hotels, commercial real estate operators and developers, and associated lenders to these sectorsâ\u0080\u009d as the world stays hunkered down and considers permanent changes to old ways of doing things, like business travel and working in offices. â\u0080¢ For all that, global stocks will be higher 12 months from now, for many reasons: monetary stimulus, trillions of dollars of â\u0080\u009ccash on the sidelines,â\u0080\u009d and perhaps more bad news priced into markets than many investors would believe, Berezinâ\u0080\u0099s team wrote. Related:Sustainable-investing flows have smashed records in 2020. Whatâ\u0080\u0099s going on? How can those ideas be put into action? Remain overweight stocks DJIA, +0.56% Â versus bonds TMUBMUSD10Y, 0.777% Â over the coming 12 months, the BCA analysts suggest, with a weighting toward cyclical sectors over defensives and non-U.S. stocks over domestic selections. The dollar DXY, -0.58% Â will continue to weaken, which will boost commodity prices. Also, look for both WTI CL00, -1.62% Â and brent crude BRN00, -0.07% Â prices to rise much more than futures markets currently suggest: BCAâ\u0080\u0099s own forecast is for a price between $60 and $80 for both benchmarks into 2021. Read next:Forget earnings season. Whatâ\u0080\u0099s the rest of 2020 going to look like?"}]}