{"article": [{"url": "https://www.marketwatch.com/story/new-york-state-reports-just-two-deaths-in-one-dayits-lowest-total-since-march-2020-07-21", "published": 1595352080.0, "headline": "New York state reports just two deaths in one dayâ\u0080\u0094its lowest total since March", "body": "Two people in New York state died of COVID-19 on Monday, the fewest since the coronavirus crisis began in March, Gov. Andrew Cuomo announced in a media conference call on Tuesday.Â â\u0080\u009cObviously thatâ\u0080\u0099s two too many,â\u0080\u009d he said. â\u0080\u009cBut remember a time when we had over 800 deaths in a single day back [on] April 14.â\u0080\u009dÂ Other states that have reported low numbers of fatalities in the last few days include Maine and North Dakota, both losing one resident as of Tuesday, and Massachusetts, who reported one death on Monday.Â The state also conducted around 66,000 tests for the virus, with a positivity rate of about 1.2%, Cuomo reported. There are currently 724 New Yorkers hospitalized. The total number of fatalities in New York stands at more than 25,000, with 408,181 testing positive for the virus.Â See: Get ready for another round of stimulus checks The governor also expanded the quarantine list to include 10 more states. Travelers from those states are required to self-quarantine for 14 days after traveling to New York. The newly added states are Alaska, Delaware, Indiana, Maryland, Missouri, Montana, North Dakota, Nebraska, Virginia and Washington. Minnesota was removed. â\u0080\u009cCOVID is increasing in 41 states and 31 are on the quarantine list,â\u0080\u009d said Cuomo, who spent Monday with government officials in Savannah, Ga., to talk about ways to keep the virus at bay in that state.Â Cuomo explained that he has offered assistance to other cities and states as a thank you for their help during the pandemic, but also to help mitigate risk for New Yorkers.Â â\u0080\u009cIf the other parts of this country donâ\u0080\u0099t get the infection rate under control, itâ\u0080\u0099s going to come back to New York,â\u0080\u009d he said.Â Florida is one of the states struggling to keep COVID contained. There were 134 deaths there on Monday, as well as 9,373 new cases of the virus, according to state statistics. In total, there have been more than 5,200 fatalities and 369,834 positive cases.Â Meanwhile, New York continues to crack down on â\u0080\u009coutdoor drinkingâ\u0080\u009d in bars.Â The New York State Liquor Authority suspended liquor licenses for four bars, three in Queens and one on Long Island, the governor announced. There have been a total of 27 licenses suspended, and 410 other drinking establishments have been charged with violations.Â Donâ\u0080\u0099t miss: Pandemic on track to crush NYC economy, says influential business group â\u0080\u009cThe bad operators will make it worse for themselves and for the good operators,â\u0080\u009d Cuomo said. â\u0080\u009cItâ\u0080\u0099s unfortunate that the good get penalized for the actions of the bad. On Monday, the governor threatened to shut down bars and restaurants all together if people continue to congregate in such large numbers.Â Â â\u0080\u009cDonâ\u0080\u0099t be stupid,â\u0080\u009d he said at a Monday morning briefing. â\u0080\u009cWhat [partygoers are] doing is stupid and reckless for themselves and for other people, and it has to stop.â\u0080\u009d"}]}