{"article": [{"url": "https://www.marketwatch.com/story/joe-bidens-economy-would-be-too-much-like-europes-11600043984", "published": 1600063700.0, "headline": "Joe Bidenâ\u0080\u0099s economy would be too much like Europeâ\u0080\u0099s", "body": "Joe Biden talks with members of the United Steelworkers union in a supporter's back yard in Detroit, Mich., Getty Image President Donald Trump trails Joe Biden byÂ a substantial margin,Â according to recent polls. Trump has come up short onÂ strategies to address COVID-19Â and the crisis of confidence in our national institutions to offer all Americans a fair chance at succeeding. On Inauguration Day, we will likely have a vaccine in hand or in sight, but a hangover and the endemic economic problems will remain. The economy will be substantial smaller in January than had the pandemic not occurred, millions will still be seeking work, andÂ inequality will likely be worse than before. Related: The numbers tell us the economy is better, but millions of Americans arenâ\u0080\u0099t feeling it Joe BidenÂ would spend trillions on health care, higher education, green initiatives and other programs. Across those initiatives, he would impose aggressive preferences forÂ women,Â minorities,Â andÂ small businessesâ\u0080\u0094the kind that history has shown to be not adequately effective at radically reducing income inequality. He promises federal funding for pre-K education andÂ preferences for unionsâ\u0080\u0094including â\u0080\u009ccard check,â\u0080\u009d which would free unions of the terrible inconvenience of winning democratic representation elections. Some of these issues need attentionâ\u0080\u0094health care and higher education are terribly expensive and leave too many shortchangedâ\u0080\u0094but it is not clear that Bidenâ\u0080\u0099s program would get to the roots of those problems. Opinion: Trump and Biden â\u0080\u0098Made in Americaâ\u0080\u0099 tax plans ignore the real problem He wouldÂ build on ObamacareÂ to insure more Americans by expanding Medicaidâ\u0080\u009414 states still donâ\u0080\u0099t fully participateâ\u0080\u0094and raising income caps for who may qualify for subsidies when purchasing insurance on government exchanges. Biden would create a public optionâ\u0080\u0094federal and state-run insurance plans to compete with private carriers. He wouldÂ require drug companies to charge Americans for prescriptions no more than they charge in other high-income countries. That would impose price controls and effectively outsource the price setting to regulators in Germany and other advanced industrialized countries. The United States spendsÂ 18% of GDPÂ on health care and nearlyÂ 90 percent more than other high-income nations, becauseÂ we pay moreÂ for virtually everythingâ\u0080\u0094doctor visits, hospital services and drugs. Prescription drugs only account for about 10% of health costs. For other services, by further subsidizing insurance, his program would drive up demand and costs, and make the U.S. system even more expensive and an even greater burden on U.S. businesses competing in international markets. Thatâ\u0080\u0099s a jobs killer. We sendÂ too many young people to college, where many donâ\u0080\u0099t acquire theÂ critical thinkingÂ abilitiesÂ necessary for professional work or few other job specific skills. Biden proposesÂ to build out vocational programs in community colleges, offer more university tuition assistance and partially forgive student loans for those stuck in low-paying jobs Trumpâ\u0080\u0099sÂ Labor Department certified private-sector apprenticeshipsÂ allow young people to earn while they learn. Graduates usually land jobs that pay more than the average starting salary of a college graduate and donâ\u0080\u0099t amass college debt. Bidenâ\u0080\u0099s tuition subsidies and student loan forgiveness would increase university enrollment but do little to improve the quality of curricula and reduce college graduate underemployment. Biden wants toÂ accelerate the transitionÂ to carbon-free cars, buildings, electricity and the like by spendingÂ $2 trillion over four years.Â Those goals are laudable but much of the technology is not here yet. He admits this by proposing generous allocations to uncoverÂ breakthrough technologies in energyÂ and other R & D. He needs something that is not possible with his antagonists in the Democratic Partyâ\u0080\u0094the Green New Dealersâ\u0080\u0094a reasonable discussion of what is possible and how quickly. More from MarketWatch: The West burns, coastlines are threatened, and Trump and Biden are too quiet on climate change, say analysts As we learned with the development of a COVID-19 vaccine andÂ President Barack Obamaâ\u0080\u0099s Solyndra follies, more money alone cannot accelerate the pace of scientific progress. Bidenâ\u0080\u0099s program would subsidize early adoption of inadequate technologies and 10 years from now leave the country with more green energy infrastructure that is terribly outdated and internationally uncompetitive. A more expensive fleet of vehicles, buildings and electrical gridâ\u0080\u0094more jobs killers. Biden, like European Social Democrats, makes few bows to the mandates of the marketplace, because he presides over a political party that views free markets with some considerable suspicion. It increasingly embraces theÂ 1619 Projectâ\u0080\u0099s false narrative of slave-conceived capitalismÂ and racial/gender prejudices to explain our economic systemâ\u0080\u0099s failures and has boundless faith in the ability of government to deliver. Bidenâ\u0080\u0099s program would leave America too much like Europeâ\u0080\u0094unable to grow and riddled with massive unemployment and underemployment. PeterÂ MoriciÂ is an economist and emeritus business professor at the University of Maryland, and a national columnist."}]}