{"article": [{"url": "https://www.marketwatch.com/story/the-market-isnt-pricing-in-an-all-clear-on-the-economy-say-bofa-analysts-who-say-the-sp-500-will-end-the-year-at-2900-2020-07-08", "published": 1594455260.0, "headline": "Stock-market risks for remainder of 2020  â\u0080\u0098are completely to the downside,â\u0080\u0099 says BofA analyst", "body": "Many analysts have spent the past few weeks advising investors to buy the dips and pointing to unprecedented levels of fiscal and monetary stimulus, among other things, as reasons to be bullish on stocks. Not BofA head of equity research Savita Subramanian. On a midyear outlook briefing conducted this week via webinar, Subramanian explained that her year-end target for the S&P 500 SPX, +0.87% Â is 2,900, implying an 8% decline from current levels. She offered one bull case for stocks â\u0080\u0094 that theyâ\u0080\u0099ve rarely been so attractive, relative to bonds â\u0080\u0094 but also noted a litany of headwinds. “ â\u0080\u0098I wouldnâ\u0080\u0099t paint myself as a bear, but the risks between here and year-end are completely to the downside.â\u0080\u0099 ” â\u0080\u0094 Savita Subramanian, BofA She added, referring to the effort to resuscitate the economy from its pandemic doldrums: â\u0080\u009cWeâ\u0080\u0099ve had a reopening frenzy, and now weâ\u0080\u0099re seeing payback.â\u0080\u009d Coronavirus daily update:Global cases of COVID-19 top 12 million, and WHO warns pandemic is â\u0080\u0098not under controlâ\u0080\u0099 So what are the headwinds? Millennials, who got socked with the financial crisis and Great Recession of 2008 just as they were about to start their working lives, now, with many finally having started to find some financial footing, face another economic calamity. That means consumer spending wonâ\u0080\u0099t be anything like it was in the past, Subramanian said. Consumers, she said, may adopt a â\u0080\u009crecession- or even depression-likeâ\u0080\u009d spending mentality. By nearly any metric â\u0080\u0094 see the table below â\u0080\u0094 stocks are extremely expensive. Stocks are expensive, no matter how you slice it. Source: BofA And yet, over the past two decades, margin expansion has been largely driven by globalization, falling interest rates and tax cuts â\u0080\u0094 all of which stand a big risk of reversing. Subramanian called herself â\u0080\u009creally worriedâ\u0080\u009d that a lot of growth has been pulled forward, in the form of fiscal and monetary stimulus, into todayâ\u0080\u0099s economy to plug the hole created by COVID. A Democratic victory in November, in Subramanianâ\u0080\u0099s view, is likely to have the effect of reversing some market-friendly policies. Key Words:Trump says your â\u0080\u0098401(k)s will drop down to nothingâ\u0080\u0099 under a different president, but JPMorgan and Citigroup are sanguine about stocks under Biden Finally, in response to an often-asked question about why markets seem to be so disconnected from the real economy, Subramanian said she doesnâ\u0080\u0099t think the stock market is pricing in that â\u0080\u009ceverything is great.â\u0080\u009d Investors have continued to favor stocks that benefit from coronavirus-induced lockdowns, such as technology leaders and online retailers, while her own view is that investors should overweight consumer staples, industrials, technology and financials, in that order. In effect, sheâ\u0080\u0099s saying that investors who think everything is hunky-dory wouldnâ\u0080\u0099t still be rewarding work-from-home stocks. â\u0080\u009cThe market isnâ\u0080\u0099t pricing in an all-clear on the economy,â\u0080\u009d Subramanian said. See:Wall Streetâ\u0080\u0099s road warriors have spent the past three months grounded. Howâ\u0080\u0099s that working out?"}]}