{"article": [{"url": "https://www.marketwatch.com/story/social-security-is-squandering-money-through-a-hidden-weakness-in-how-it-invests-its-funds-2020-08-18", "published": 1597755140.0, "headline": "Social Security is squandering billions of dollars through a hidden weakness in how it invests its funds", "body": "The COVID-19 pandemic underscores the importance of Social Security in the lives of Americans. Even in the toughest of times, the program delivers checks on time and in full. At the same time, the economic conditions created by the virus have exposed hidden weaknesses that could cost the program tens of billions of dollars in solvency in the next trustees’ report due in the spring of 2021 — a loss that is entirely avoidable. In a nutshell, the pandemic has both pushed interest rates to the lowest levels in program history and sharply reduced payroll tax revenue. Either one of these events would be bad news to those who worry about the system’s long-term stability. Unfortunately, this combination of conditions triggers a technical weakness in the system, one that generates an unfavorable trade of higher-yielding bonds for securities that do not pay as much. At this point, this cash management policy costs the program money every year — COVID simply magnifies the consequences. The exchange cost the program nearly $1 billion in 2019, and that cost is apt to increase sharply because of pandemic will force the program to draw upon the trust fund to pay the bills. Given the precarious state of the system’s finances, it is more important than ever to watch every dollar — or billion dollars, as is the case here. Since the onset of the pandemic, policy experts have tended to focus on the drop in payroll tax revenue connected to economic shutdown because it represents the bulk of the program’s financial resources. In 2019, the program collected nearly 90% of its income from payroll taxes. While interest contributes less than 8%, those earnings are vital because they don’t generate a liability in the form of future benefits. According to the latest trustees report, Social Security collected roughly $81 billion in free cash flow in 2019 from its trust funds. Compared to payroll tax revenue, this revenue approximates the contribution of 15 million workers who will never collect benefits. Unfortunately, these earnings are falling. This year, the program will collect far less than the projected $77.8 billion and next year’s figure may drop to $70 billion. But the drop isn’t just because yields on Treasury debt are falling. Part of the gap comes from the unusual way that Social Security collects and invests money. In today’s environment, we are simply giving away money that the program can’t afford to lose.The way Social Security collects money Most Americans understand that Social Security collects revenue from payroll taxes, but virtually everyone misses an important intervening step. Initially, the system draws revenue from the Treasury Department based on an estimate of payroll tax revenue. Over time, the Treasury and the Social Security Administration compare notes to settle the differences between the estimate and actual dollars collected. Despite millions of people going to the unemployment office since mid-March, the program has reported record levels of payroll tax revenue, feeding into record-breaking balances for the program’s trust fund. Essentially Social Security is acting as if the economy is growing and jobs are booming. This means the program had a lot of free cash to invest this year, most of which will be returned to the Treasury Department after the bookkeepers compare notes. Where Social Security throws away money — billions of dollars over the years — is in how it handles its investments.The way Social Security invests money Again, most Americans understand that Social Security invests its money in the most secure investments in the world — U.S. government debt. Few understand that the program has lost billions of dollars of interest earnings in the process. The trouble is that the program has swept free cash into long-term debt at low interest rates at the exact point in the year where the seasonal cash flow turns negative. From that point on, the program has to redeem (or sell) bonds with shorter maturities at par — not market prices — to fill in the gaps between incoming money and outgoing checks. Unfortunately, the direction of interest rates makes this a costly policy. When interest rates fall over an extended period, the process will liquidate some of the best bonds in the portfolio — those with the fattest coupons. Unlike marketable Treasury obligations where higher-coupons are valued above face value, these bonds are paid off at face value plus accrued interest. The Social Security Administration has known about this problem for more than 20 years. In 1999, the agency produced an actuarial note on the Investment Policies and Practices of the Social Security Trust Funds in which the author specifically noted that the bond redemption practices of the program would be “disadvantageous” in periods of declining interest rates. In an email exchange with the agency, a senior official confirmed the selection process and defended the costs. “This selection process means that the most immediate redemptions are those bonds issued to the Trust funds after the prior June 30 (certificates of indebtedness), all of which have maturity of the next June 30, and in the current time have low interest rates,” the official said in an email. Even in times when the program is generally making money, the gaps between when the money arrives and when the money is spent requires bonds to be redeemed. In December of 2019, for example, the program needed to liquidate bonds paying 4.125% so that checks could be cashed by seniors. In the same month, the program invested idle cash in bonds that paid 1.75%, and finished with $60 billion on hand. Bond transactions in December 2019 Month Transaction Amount Interest rate Maturity Lost interest (in millions of dollars) (in millions of dollars) December Redeem $20,834 4.125 June 30, 2020 254 December Acquired $60,192 1.875 June 30, 2020 Source: Social Security Administration Social Security this year and next Transactions like these will happen again in 2020. Already, on June 30, the program bought roughly $200 billion of government securities that pay 0.75% annually for 15 years. The sale of those older, higher-yielding bonds will happen in the coming months. As a result, Social Security’s income from interest payments will likely fall short by nearly $2 billion in 2020, by my calculations. It will be $5 billion below estimates in 2021 as the effective yield of the Trust Fund falls below 2.5%. Using history as a guide, the Social Security Administration is apt to use nearly $80 billion of reserves to pay benefits between July 1 and Dec. 31, as monthly receipts drop as more people hit the limit on income subject to Social Security taxes. In the process, the premature redemption of bonds would cost the program more than $1 billion in interest earnings over the remaining life of the bonds. Beyond that amount, the Social Security Administration expects that the program will have to raise $100 billion to repay the Treasury Department for overpayments of payroll tax revenue. All of this money is apt to come from bonds with coupons as high as 5 1/8% unless Social Security changes the way it manages its cash and investments. Given the uncertainty around employment and wages because of COVID-19, this of all years is when the program should be building liquidity into the reserve, rather than locking it up in bonds dues as far out as 2035 and exposing the program’s best assets to fire-sale pricing over the coming year. While the issue is easy to fix, the possibility of such a grand loss tell us a lot about the Social Security debate. Supporters argue that the money in the Social Security Trust Fund is invested in the safest investment in the world. Yet neither supporters nor critics have looked at how the money is invested or the billions of dollars lost by buying bonds on the wrong date, at the wrong price, over the wrong duration. Voters tend to worry about Congress stealing the money in Social Security. They should be much more concerned about the willingness to casually throw it away. Brenton Smith writes about Social Security."}]}