{"article": [{"url": "https://www.marketwatch.com/story/defiant-fauci-tells-instyle-i-dont-regret-anything-i-said-and-talks-about-being-persona-non-grata-in-trumps-white-house-2020-07-17", "published": 1595233280.0, "headline": "Defiant Fauci tells InStyle magazine: â\u0080\u0098With all due modesty, I think Iâ\u0080\u0099m pretty effectiveâ\u0080\u0099", "body": "Anthony Fauci is on a mission to get more Americans to take COVID-19 seriously. In an interview with InStyle magazine, in which he posed wearing sunglasses and stars-and-stripes socks, Fauci said this of his original advice to not wear face masks: â\u0080\u009cI donâ\u0080\u0099t regret anything I said then because in the context of the time in which I said it, it was correct. We were told in our task-force meetings that we have a serious problem with the lack of PPEs and masks for the health providers who are putting themselves in harmâ\u0080\u0099s way every day to take care of sick people.â\u0080\u009d “ â\u0080\u0098By the beginning of the year we should have the first tens of millions and then hundreds of millions of doses.â\u0080\u0099 ” â\u0080\u0094 Anthony Fauci speaking about his hopes for a vaccine in early 2021 â\u0080\u009cWhen it became clear that the infection could be spread by asymptomatic carriers who donâ\u0080\u0099t know theyâ\u0080\u0099re infected, that made it very clear that we had to strongly recommend masks. And also, it soon became clear that we had enough protective equipment and that cloth masks and homemade masks were as good as masks that you would buy from surgical supply stores,â\u0080\u009d he told interviewer Norah Oâ\u0080\u0099Donnell, the managing editor of CBS VIAC, -2.34% Â Evening News. â\u0080\u009cBut our knowledge changed and our realization of the state of the outbreak changed.â\u0080\u009d The director of the National Institute of Allergy and Infectious Diseases for three decades continues to take a polar opposite approach to the coronavirus pandemic than that taken by the Trump administration â\u0080\u0094 which has called for schools to reopen â\u0080\u0094 and state lawmakers, who have enacted a patchwork of policies, including opening up their economies and refusing to introduce mandates to wear face masks, despite a surge in new cases in their states. The Trump administration is trying to block $25 billion for states to conduct testing and contact tracing in the next coronavirus relief bill, people involved in the talks told the Washington Post on Saturday. Wait times vary from a matter of hours to up to 26 days in some extreme cases. Quest Diagnostics Inc. DGX, +0.33% Â one of the largest labs in the U.S. performing coronavirus tests, said that the average turnaround time for non-priority patients is â\u0080\u009cseven or more days.â\u0080\u009d Fauci is optimistic about a vaccine. â\u0080\u009cIf all goes well and there arenâ\u0080\u0099t any unanticipated bumps in the road, hopefully, we should know whether the vaccine is safe and effective by the end of this calendar year, or the beginning of 2021,â\u0080\u009d he said. â\u0080\u009cBy the beginning of the year we should have the first tens of millions and then hundreds of millions of doses.â\u0080\u009d On his role at the NIAID, he said, â\u0080\u009cI donâ\u0080\u0099t see any termination within the near future because I judge [my career] by my energy and my effectiveness.â\u0080\u009d Oâ\u0080\u0099Donnell asked Fauci about media restrictions and being â\u0080\u009cpersona non grataâ\u0080\u009d in the White House. â\u0080\u009cSometimes they donâ\u0080\u0099t allow you out regardless of what administration youâ\u0080\u0099re in,â\u0080\u009d he replied. On the chilly reception from the White House, he said, â\u0080\u009cWell, you know, that really changes week to week and month to month. Sometimes you say things that are not widely accepted in the White House, and thatâ\u0080\u0099s just a fact of life.â\u0080\u009d The Daily Beast described Fauciâ\u0080\u0099s confident pose thus: â\u0080\u009cItâ\u0080\u0099s as if Fauci is playing Daniel Craig playing Roger Stone in an inevitable biopic. Heâ\u0080\u0099s sitting on a foldout chair placed upon a pool deck; this is how an elevated everyman spends his summer in the suburbs.â\u0080\u009d Fauci, 79, talked about his relationships with his wife of 35 years, bioethicist Christine Grady, and with the president: â\u0080\u009cI donâ\u0080\u0099t see him much anymore.â\u0080\u009d Anthony Fauci posing for a special digital cover of InStyle magazine. Trump recently upped the ante in the White Houseâ\u0080\u0099s war of words with Fauci, taking aim at the doctorâ\u0080\u0099s early response to the pandemic. â\u0080\u009cDr. Fauciâ\u0080\u0099s a nice man, but heâ\u0080\u0099s made a lot of mistakes,â\u0080\u009d the president said on Sean Hannityâ\u0080\u0099s Fox News show. â\u0080\u009cLike you donâ\u0080\u0099t have to ban them coming in from very infected China. I did it anyway and we saved hundreds of thousands of lives. I banned Europe from coming in when Italy and France and Spain were having all the problems.â\u0080\u009d “ â\u0080\u0098I certainly am energetic. And I think everybody thinks Iâ\u0080\u0099m doing more than an outstanding job. ” â\u0080\u0094 Anthony Fauci on his effectiveness as the nationâ\u0080\u0099s top infectious-disease doctor â\u0080\u009cTheyâ\u0080\u0099ve been wrong about a lot things, including face masks,â\u0080\u009d Trump added. â\u0080\u009cMaybe theyâ\u0080\u0099re wrong, maybe not, but a lot of them said donâ\u0080\u0099t wear a mask, donâ\u0080\u0099t wear a mask. Now they are saying wear a mask. So a lot of mistakes were made â\u0080\u0094 a lot of mistakes.â\u0080\u009d Trump has rarely worn a mask in public and has not said Americans should wear masks. In a break with his tradition of eschewing any face covering, he wore one last weekend while visiting Walter Reed National Military Medical Center. Trump recently held a rally in Tulsa, Okla., where most people did not wear any face covering. On April 3, the administration and the Centers for Disease Control and Prevention reversed their policies on masks, and said everyone â\u0080\u0094 not just medical workers â\u0080\u0094 should wear face coverings. Trump cited â\u0080\u009crecent studiesâ\u0080\u009d of asymptomatic transmission, but still remained sanguine on the issue: â\u0080\u009cYou donâ\u0080\u0099t have to do it. Iâ\u0080\u0099m choosing not to do it.â\u0080\u009d Fauci recently said that the U.S. government had not been doing well with contact tracing, the process of tracing people who have been in contact with someone identified to have the virus, instructing them to stay home, and connecting them with the resources they need to do so. â\u0080\u009cI donâ\u0080\u0099t think weâ\u0080\u0099re doing very well, for a number of reasons, and not all of which is the fault of the system,â\u0080\u009d he said in an interview last month with CNN T, -1.01%. As of Monday, COVID-19, the disease caused by the virus SARS-CoV-2, had infected at least 14.5 million people globally and 3.8 million in the U.S. It had killed over 606,206 people worldwide and at least 140,534 in the U.S., according to Johns Hopkins University. Florida reported 12,478 new cases on Sunday. Texas reported over 10,000 new cases for the fifth consecutive day. The day before, the U.S. recorded over 70,000 new cases, exceeding previous records for the second consecutive day. The Dow Jones Industrial Index DJIA, +0.56% Â closed lower Friday though stocks post modest weekly gains, as investors tracked round two of the potential fiscal stimulus. The S&P 500 SPX, +0.87% Â and Nasdaq Composite COMP, +1.39% Â ended the week up slightly. Last week, Trump took aim at Fauci. â\u0080\u009cDr. Fauciâ\u0080\u0099s a nice man, but heâ\u0080\u0099s made a lot of mistakes,â\u0080\u009d Trump said on Sean Hannityâ\u0080\u0099s Fox News show. â\u0080\u009cLike you donâ\u0080\u0099t have to ban them coming in from very infected China. I did it anyway and we saved hundreds of thousands of lives.â\u0080\u009d Fauci, for his part, took a defiant tone with InStyle, â\u0080\u009cWith all due modesty, I think Iâ\u0080\u0099m pretty effective. I certainly am energetic. And I think everybody thinks Iâ\u0080\u0099m doing more than an outstanding job.â\u0080\u009d Related: Hereâ\u0080\u0099s one â\u0080\u0098remarkableâ\u0080\u0099 difference between COVID-19 and the 1918 Spanish flu How COVID-19 is transmitted"}]}