{"article": [{"url": "https://www.marketwatch.com/story/wine-country-goes-back-to-basics-and-online-as-pandemic-upends-business-11597368965", "published": 1597481060.0, "headline": "How the pandemic is upending business in wine country", "body": "MarketWatch photo illustration Would you like to see a wine list? Selecting a bottle of wine to share over dinner was easy enough before the pandemic. Anyone might worry about paying too much or sounding silly when ording a fancy-sounding choice, but the ritual of picking a bottle to share, or glass to sip, had a way of making any meal out feel special. That was until about five months ago. Now the idea of ordering wine, dining out or engaging in routine social gatherings, like birthday parties or anniversaries, involves weighing the potential risk of a run-in with the novel coronavirus, which the U.S. still struggles to tamp down. The crisis has led U.S. households to rein in spending, hobbled entire industries and threatened the ruin of jobs. In other words, it’s the kind of public-health and economic shock that’s one for the history books. It might even be driving Americans to drink more. The problem is they’re drinking more at home. And that’s had a sobering effect on much of the U.S. wine industry, which after a near quarter-century of growth, saw domestic wine sales drop 5% over the past 12 months to about $48 billion in June, according to data from industry research firm bw166. Experts singled out March 20 as the day everything changed, when California, Illinois, New York and other states issued stay-at-home orders that came thundering down across the nation, forcing bars, restaurants and wine-tasting rooms and other nonessential businesses to shutter as authorities raced to control a wave of COVID-19 infections. “When you add both the shutdowns of tasting rooms and closures of restaurants, 44% of sales fell out from underneath the wineries in one night,” Rob McMillan, an executive vice president and founder of Silicon Valley Bank’s wine division, told MarketWatch. “It was a bad day to wake up.” Like many other industries, wineries remain in the midst of an upheaval sparked by a global pandemic that’s been brutal on lower-income workers, but sparing Wall Street, where U.S. stock benchmarks, including the S&P 500 index, SPX, +0.87%, trade near record territory. It’s not that consumers stopped drinking wine. Rather, diners who might in better times split a bottle at a restaurant, suddenly were rushing their carts through big-box stores and grocery aisles to fill up on necessities, including wine. “Nationwide, retail sales blew up,” said Gary Obligacion, the general manager at the Post Ranch Inn, a luxury resort in Big Sur, Calif., that overlooks the Pacific Ocean, of the shift to at-home wine drinking at the onset of the pandemic. “People were in panic mode,” he said. Post Ranch and its Sierra Mar restaurant recently reopened after a nearly three-month shutdown. For now, that still means only serving guests staying at the resort, who can order meals in their rooms or book at the Sierra Mar’s outdoor deck. But the restaurant’s thick, multipage wine book has been replaced by iPads that, like any wine bottles purchased for a table, are sanitized within view of diners. “It’s all being done in a format for peace of mind around health and safety,” said Mark Buzan, Sierra Mar’s wine director, of the new protocols that make “any romantic notion about bringing a dusty, old bottle up from the cellar to present to a guest” a thing of the past. Two U.S. wine industries The puzzle for smaller, premium winemakers to solve has been how to reach customers when retail sales have been booming, but mostly benefiting the nation’s wine Goliaths. “There’s two wine industries,” McMillan said. “Roughly 75% comes through the largest 13 wineries,” he said, pointing to top sellers that include the E&J Gallo Winery, The Wine Group and Constellation Brands STZ. “They make wine, sell it to wholesalers, restaurants or grocery stores, and then it goes to the consumer,” he said. “The smaller wineries don’t get much wholesale attention.” What has been working, for some smaller producers, has been efforts to reach customers directly to spur sales, including online through their own websites, instead of relying on restaurants and others to create a buzz. That’s meant repurpurposing staff and going back to the basics, including hitting the phones to drive sales. “It’s not like small wineries figured out overnight how to do outreach for online retail,” McMillan said. “For some, the only thing on their website was a shopping cart icon.” This chart breaks down how sales have shifted at many U.S. wineries after shelter-in-place orders took hold, as producers ramped up business through wine clubs, online and over the phone. Wine buying shift in 2020 SVB Further into summer, as more restaurants reopened under new social-distancing rules, off-premise alcohol sales remained robust. Spirits have led the charge higher, with sales jumping 29.3% for the week ended July 18, versus a year prior, while wine sales rose 19.7%, according to the latest data from Nielsen. “A lot about wine is the story,” said Russ Colombo, a senior vice president at Baker Boyer, a lender in Walla Walla, Wash., focused on financing smaller wineries in the region. “The first bottle you sell or place at a restaurant is difficult enough,” he said, but after that “it’s all about momentum.” For winemakers able to drum up their own support and sell directly to customers, a bonus is that they don’t have to pay a middleman, which can mean about twice as much profit for a producer when compared with wholesale transactions, Colombo said. On the other hand, Colombo also called wineries “one of the toughest things to finance,” not only because of the fierce competition, but also because winemaking takes talent, a long view and probably luck. “Winemakers are good at agriculture,” he said. “But for higher-end red wine, even before it hits the market, it could be two years. And in those two years, the world changes a lot.”Wine Facts One boon for smaller producers during the national tug of war over reopening, face masks and social-distancing restrictions has been visitors flocking to nearby wineries and vineyards for a bit of respite. “Most high-end wineries that have tasting rooms are going to the reservations system,” Colombo said, adding that catering to fewer customers due to health-and-safety rules has been a positive for sales. “Winemakers, they find they can spend more time with their customers, tell their story and establish a personal relationship.” And yet, there’s plenty of uncertainty. The earliest part of the 2020 harvest has kicked off in California’s wine country, while the state on Thursday reached the grim milestone of becoming the first state to report 600,000 COVID-19 cases since the pandemic was first detected in the U.S. earlier this year. “What I can tell you is that it’s been an excellent growing season. The crop loads look average to high and you have to find homes for all of that fruit,” said Jennifer Putnam, chief executive at Napa Valley Grapegrowers. “But it’s a pretty intricate dance we do. You have to have a healthy workforce, good weather and people supporting Napa Valley agriculture and wines.”"}]}