{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-on-track-for-weekly-fall-on-worries-over-covid-19-impact-on-crude-demand-2020-09-25", "published": 1601048720.0, "headline": "Oil prices post a weekly fall on worries over COVID-19 impact on crude demand", "body": "Oil futures edged lower on Friday, with both major benchmarks posting their third weekly decline in four weeks as worries about the demand outlook have grown in response to rising COVID-19 cases. “Investors have become more cautious this week in general…as recent increases in coronavirus cases has increased questions over what a second wave could mean for the world economy and resource demand,” Colin Cieszynski, chief market strategist at SIA Wealth Management, told MarketWatch. A rebound in the U.S. dollar this week has also weighed on dollar-denominated oil prices, he said. The ICE U.S. Dollar Index DXY, -0.58% was up around 1.8% for the week. West Texas Intermediate crude for November delivery CL.1, -1.62% CLX20, -1.62% fell 6 cents, or nearly 0.2%, to settle at $40.25 a barrel on the New York Mercantile Exchange, off the day’s low of $39.71. Front-month November Brent UK:BRNX20 fell 2 cents, or 0.05%, to $41.92 a barrel on ICE Futures Europe. December Brent BRNZ20, -0.07%, the most actively traded contract, lost 5 cents, or 0.1%, at $42.41 a barrel. Based on the front-month contracts, WTI, the U.S. benchmark, declined 2.6% for the week, and global benchmark Brent crude marked a weekly loss of nearly 2.9%, according to Dow Jones Market Data. A rising number of COVID-19 cases have prompted the resumption of some lockdown restrictions in European countries, while stoking concerns about the U.S. economic outlook. A lack of additional stimulus from Washington has added to worries the U.S. economic rebound will lose steam heading into year-end. House Democrats on Thursday were preparing a $2.4 trillion aid package that includes a number of items seen having bipartisan support, including direct payments to households, the Paycheck Protection Program, a revival of a federal add-on to state unemployment benefits, as well as a renewal of aid to airlines and money to help restaurants stay open. But analysts warned that the path to an agreement remained unclear. Next week marks “the turn of the quarter and as we move into October, economic and corporate news flow may start to pick up again, but this could be offset by U.S. political uncertainty as the November election approaches,” said Cieszysnki. “For crude oil to really rebound, investors would likely need to see signs that the risk of serious setbacks to the current reopening recovery are fading, and that demand continues to improve,” he said. “Maintaining or increasing supply controls could help as well but more in terms of shoring up support.” Meanwhile, concerns about demand have been underlined by pressure on refining margins. “We have repeatedly cited that crude prices will have difficulty rallying, on a structural basis, unless refining margins lead the path higher. And while U.S. gasoline stocks have reverted, in remarkable fashion, to seasonal norms, distillate inventories remain the acute issue overhanging the oil complex,” said Michael Tran, analyst at RBC Capital Markets, in a Thursday note. He noted that the spot Nymex distillate crack spread—a crack spread is the difference in price between a barrel of oil and the products refined from it—is down by nearly half since mid-July, despite refiners cutting runs by an estimated 3.7 million barrels a day through the summer and domestic refiners shifting yields away from jet fuel at the fastest pace since the Energy Information Administration began tracking the data. “In short, refiners are pulling all the possible levers to minimize jet production, yet distillate stocks remain stubbornly high. Based on our global mobility tracker, we estimate that 43% of U.S. flights remain sidelined, which models to 820,000 barrels a day of U.S. jet fuel demand destroyed daily,” Tran said. Supply-related worries have also hung over the market this week, with Libyan output set to pick up after a military commander moved to lift a blockade of ports that has virtually strangled production for the past eight months. In related data Friday, Baker Hughes BKR, -1.34% reported that the number of active U.S. rigs drilling for oil rose by 4 to 183 this week. That was the first weekly rise since the week ended Sept. 4. Back on Nymex, October gasoline US:RBV20 settled at $1.2142 a gallon, up nearly 1.6% for the session, but down 1.8% for the week. October heating oil US:HOV20 added almost 0.9% to $1.1262 a gallon, paring its weekly loss to 2.8%. Natural-gas futures, meanwhile, eased back after Thursday’s 5.8% climb. The October contract US:NGV20, which expires at the end of Monday’s session, settled at $2.139 per million British thermal unit, down about 4.9%. For the week, front-month prices were up 4.4%. Read:Why we need water futures"}]}