{"article": [{"url": "https://www.marketwatch.com/story/how-to-invest-in-health-care-stocks-without-worrying-about-who-wins-the-election-2020-06-25", "published": 1593417320.0, "headline": "These 6 health-care stocks are â\u0080\u0098buysâ\u0080\u0099 because they can thrive under either Trump or Biden", "body": "Thereâ\u0080\u0099s plenty of uncertainty for the health-care industry and its investors. Half of U.S. states are now reporting rising coronavirus infections. And Joe Biden is beating President Trump in election polls, with the potential for Democrats taking both chambers of Congress. But even if the Democrats once again transform the U.S. health-care system, companies that develop new treatments and improved medical technology will continue to be rewarded. Ashtyn Evans, a senior health-care analyst at Edward Jones, named six players she expects to perform well over the next three to five years. With that longer-term focus, Edward Jones doesnâ\u0080\u0099t set price targets for buy-rated stocks. â\u0080\u009cA Democratic sweep can be a big risk for health care. But if you think about where we can position for the long term, the companies that focus on innovation and not just on cost-cutting and M&A [mergers and acquisitions], are where we would point investors to,â\u0080\u009d she said in an interview. Evans said Biden â\u0080\u009cis not advocating a single-payer system,â\u0080\u009d meaning fully socialized medicine, which would be â\u0080\u009cthe biggest riskâ\u0080\u009d to the health-care sectorâ\u0080\u0099s companies and profits. A Biden victory probably pushes that threat back at least four years. But there may be â\u0080\u009cother pressures on the edge of big pharma, including pricing pressure,â\u0080\u009d she said. Ashtyn Evans, a senior analyst at Edward Jones. Edward Jones She recommends investors focus on innovation in medical products and services, as well as companies with geographically diverse businesses. Here are the six stocks Evans named as â\u0080\u009cbuys,â\u0080\u009d followed by her comments about each company. Company Ticker Share of sales in U.S. Share of sales outside U.S. Est. sales growth - next fiscal year Est. sales growth - fiscal year +2 Eli Lilly and Co. LLY, +2.20% 57.0% 43.0% 7.7% 4.7% Merck & Co. MRK, -0.14% 43.6% 56.4% 7.3% 5.1% Novartis AG ADR NVS, +0.97% 34.2% 65.8% 5.8% 4.3% Medtronic PLC MDT, +0.81% 51.6% 48.4% 13.6% 8.3% Abbott Laboratories ABT, +1.02% 35.7% 64.3% 12.2% 8.1% Thermo Fisher Scientific Inc. TMO, +2.46% 48.4% 51.6% 8.3% 6.1% Data source: FactSet The table includes percentages of sales for the most recently completed full fiscal years within and outside the U.S. and estimated total sales growth figures for the next two fiscal years, based on consensus estimates among analysts polled by FactSet. Scroll the table to see all the data.Eli Lilly Shares of Eli Lilly & Co. LLY, +2.20% Â have returned 22% this year through June 23. (All total returns in this article include reinvested dividends.) The dividend yield on the shares is 1.86%. Evans expects the companyâ\u0080\u0099s earnings to increase at an annualized rate of 15% over the next five years, on the strength of its drug pipeline. â\u0080\u009cThey have gotten smaller over time by spinning off non-pharma, non-innovative businesses,â\u0080\u009d she said. On June 16, Elli Lilly announced that a Phase 3 study showed its Verzenio medication had â\u0080\u009csignificantly reducedâ\u0080\u009d the risk of recurrence of certain early-stage breast cancers. Evans expects 60% of the companyâ\u0080\u0099s sales in 2022 to come from newly launched medications, as it continues to be a leader in diabetes treatment.Merck Merck & Co.â\u0080\u0099s MRK, -0.14% Â shares are down 14% this year and have a dividend yield of 3.16%. During 2019, sales of Merckâ\u0080\u0099s Keytruda immuno-oncology medication totaled $11.08 billion, or 24% of Merckâ\u0080\u0099s total sales. Immuno-oncology drugs use the bodyâ\u0080\u0099s immune system to fight cancer. Sales of Keytruda increased 55% last year. â\u0080\u009cThis could be a $20 billion annual product by the mid-2020s,â\u0080\u009d Evans said. Novartis Novartis AG NVS, +0.97% Â is headquartered in Basel, Switzerland. The companyâ\u0080\u0099s American depositary receipts are down 2% this year and have a dividend yield of 2.22%. The company has a widely diversified portfolio of medications, according to Evans, â\u0080\u009cwith a lot of innovation in cancer development as well, in different areas from Merck: Gene therapy to transfer genetic material into a patient for a cure.â\u0080\u009d She describes these as â\u0080\u009chigh-price, highly innovative, patient-specific treatments.â\u0080\u009dMedtronic Medtronic PLC MDT, +0.81% Â is based in Dublin, but its shares are listed on the New York Stock Exchange. The stock is down 17% this year and has a dividend yield of 2.48% Evans called Medtronic â\u0080\u009cone of the most diversifiedâ\u0080\u009d medical-technology companies, including cardiac devices, diabetes pumps, pacemakers and robotic surgery equipment. She likes its geographical diversification and its tax advantage from being domiciled in Ireland. Abbott Laboratories Shares of Abbott Laboratories ABT, +1.02% Â are up 6% this year and have a dividend yield of 1.58%. Abbott manufactures generic drugs, diagnostic systems, nutritional products and medical devices. Evans sees a strong growth path for the company because of its exposure to emerging markets with increasing access to health care. She also sees a short-term benefit from the companyâ\u0080\u0099s coronavirus testing systems.Thermo Fischer Scientific Thermo Fischer Scientific Inc. TMO, +2.46% Â is up 10% in 2020. The company pays a small dividend for a yield of 0.25%. The company provides equipment and systems used for pharmacological research. â\u0080\u009cThey benefit from increased funding in the biotech space to develop new drugs,â\u0080\u009d Evans said. Donâ\u0080\u0099t miss:Bank stocks may â\u0080\u0098rally powerfullyâ\u0080\u0099 once investors realize their concerns are overblown"}]}