{"article": [{"url": "https://www.marketwatch.com/story/pandemic-startups-these-ny-entrepreneurs-did-the-unthinkable-during-covid-19-2020-09-23", "published": 1600860800.0, "headline": "Pandemic startups: These N.Y. entrepreneurs did the unthinkable during COVID-19", "body": "Opening a small business in New York City, where rents and risks can rise as high as a skyscraper, is no mean feat even under ideal circumstances. COVID-19 exacerbates everything. Ask Shweta Khare, Jackie Casiano and Myriam Simpierre, entrepreneurs behind an Upper West Side cafe, West Village hair salon and Bedford-Stuyvesant grocery, respectively, which all opened their doors during the pandemic. They’re making space for guarded optimism as well as setbacks, and recognizing that a key to survival is being able to pivot to a Plan B or C. “The most important lesson of COVID-19 is learning to adapt,” Simpierre said. “Distribution channels go awry. Prices change. A pandemic happens. Anything can happen. You have to be adaptable.” Myriam Simpierre opened Buy Better Foods in Bedford-Stuyvesant, Brooklyn in April. Hers was deemed an essential business. Aimee Simpierre Other New Yorkers have learned the same lesson. Partnership for New York City, a business-industry trade group, reviewed public government data and found that 495 new appearance-enhancement businesses — the category covers cosmetology, esthetics, nail specialty, natural hair styling and waxing services — and barber shop licenses were issued in the city in 2020 between March 15 and Sept. 10. That figure is down 45% from 2019 for the same period. There isn’t enough useful or current public data on new grocers or cafes to see figures on those categories, according to Partnership communications director Natasha Avanessians. But amid a rising toll of closures — Partnership for New York has estimated that a third of the city’s 230,000 small businesses may not reopen due to the virus — newcomers are rays of hope amid the ruins and rubble of the COVID-scorched business landscape. See: As months of closure wear on, New York City yoga studios move online—or shut their doors permanently Sept. 15 marked the one-month anniversary for Gertrude, a snug cafe at 204 W. 96th St., where Khare, 36, an ex-business consultant born in India and raised in Australia, serves coffees and house-baked goods like Anzac biscuits, a popular Aussie treat. The 400-square-foot shop is named for a street in Melbourne lined with small shops. She has one full-time employee and three part-timers. “The city can feel lonely, especially now,” said Khare, who came to New York from London in 2014 and earned a master’s degree in Organizational Psychology at Columbia University. “People crave a sense of connection. It sounds cliché, but being a place that provides connection is very satisfying. It was my dream to create a space with a sense of community.” Khare, who lives in the neighborhood with her husband, an economist, and their 17-month-old daughter, spent 2018 looking for a suitable location for her business. She finalized negotiations on a 10-year lease in January. Two months later, as she prepared to open, the virus hit. Khare considered walking away from the enterprise, concerned about being able to run it responsibly and safely. “As the weeks and months progressed,” she said, “I could see in some ways that the city was learning to live with the virus.” Also see: Powell says it’s tough for Fed to boost lending to smaller businesses She’s learned the value of a landlord willing to negotiate. Hers, Schreiber Properties, which owns three adjacent buildings on West 96th Street in Manhattan, was such a landlord. “There was some negotiating, including a 10% reduction and free months,” Sam Schreiber says. Khare anticipates breaking even for the first month, but she’s not paying herself a salary. “Business is steady,” she says, adding that overhearing a customer say she walked 20 blocks just for her coffee, hit home. “That feels like a success.” Couture Cutz, a hair salon at 242 W. 10th St. in Manhattan’s West Village, marks Jackie Casiano’s first business venture in New York City. “Thirty years ago I had a restaurant in Pennsylvania,” said Casiano, 57, who signed a five-year lease on a shop on a leafy stretch that’s also home to Housing Works and a police station. While driving around the city in May, Casiano saw a For Rent sign in the shop window. Rent negotiations took a month and a half. “Finally, he said, ‘Tell me what is comfortable for you,’” Casiano recalls. “My son, Edwin, cuts and colors hair,” she said. “He has a talent in his hands.” The eldest of her five kids, he brings a clientele from years of cutting and styling at Astor Place, she adds. Digging into savings, Casiano spent about $4,000 to construct the space for two stylists and two barbers. Opening day was July 15. “The first three weeks were ‘oh my God’ busy,” she says. “People were so ready to have their hair professionally done.” Like a rapidly receding hairline, traffic thinned dramatically in August, a time when New Yorkers always flee the heat. “I didn’t see the walk-ins. It was scary.” Business has picked up in September. Casiano, who’s not drawing a salary yet, says she is there seven days a week. She sweeps the sidewalk and puts out bowls of water for neighborhood dogs. “I talk to everybody,” she said. “The neighborhood has embraced us. I hope and pray it works out.” Simpierre, 46, who was born in Haiti and grew up in the U.S., spent five years planning for her small business. “My goal has always been to open a market to cater to the needs of the community and to show that healthy food is accessible,” she said. Also see: It ain’t over! It’s New York! Buy Better Foods, her market for organic groceries, bulk foods and herbs, and supplements at 372 Kosciuszko St. in Bedford-Stuyvesant, Brooklyn, opened in April — about nine months after signing a 10-year-lease. “I was supposed to open in March, but I delayed it a month.” She was deemed an essential business. Between July 2019 to March 2020, Simpierre, whose studies at Baruch College included entrepreneurship, created her 900-square-foot space. “Stores tend to be cluttered,” she said. “This is an open space where you can see clearly.” An SBA loan helped her realize her vision. Her rent, one of the two biggest expenses along with inventory, “is decent. Everything is about negotiations,” she said. Early on it was difficult for her to get products that went to larger stores first. “I felt the severity quickly,” she said. “Because I was new and unknown there were delays. Having good relationships with distributors and local vendors is invaluable.” Also see: Trump’s trade policy failed the workers he promised to help Simpierre, who has two part-time staffers, sped up plans to introduce third-party shopping. “I had to introduce online ordering for Mercato.com,” she said. It was not in the plan in the beginning. I had to do that quickly to increase business.” Five months after opening, Simpierre has been able to draw salary. “I’m married. I have a wife and two children,” she said, adding that every entrepreneur’s situation is unique. On Sept. 10, a store window was broken and the shop was burglarized. A GoFundMe campaign launched then to raise $3,500 to replace the glass and install security gates has exceeded its goal. “We plan to recover quickly and come back stronger,” Simpierre notes at the fund site. “It’s week by week,” she says. “I’m optimistic because of the support.”"}]}