{"article": [{"url": "https://www.marketwatch.com/story/fda-releases-guidelines-for-cannabis-related-research-but-cbd-will-have-to-wait-2020-07-21", "published": 1595487020.0, "headline": "FDA releases guidelines for cannabis-related research, but CBD will have to wait", "body": "The U.S. Food and Drug Administration released preliminary guidance on Tuesday on cannabis-related clinical research, outlining how companies seeking approval of drugs that contain cannabis or its derivatives must follow the traditional drug review and approval process involving clinical trials. The agency is still working on rules for products that contain the cannabis ingredient CBD, which is widely held to have wellness properties but lacks research to support that view. Many companies are keen to market food, drinks and dietary supplements containing CBD, a non-psychoactive ingredient in the hemp plant, that they say can help with ailments such as anxiety. Ever since the passage of the 2018 Farm Bill, CBD has existed in a sort of regulatory limbo. While the bill legalized hemp, it did not legalize CBD, but rather moved enforcement of the substance away from the Drug Enforcement Administration and over to the FDA. Because the FDA has approved a drug that contains the ingredient — GW Pharmaceuticals PLC’s GWPH, -2.46% Epidiolex, a treatment for severe forms of childhood epilepsy — it has told companies that they cannot not add it to food or drink or make health claims for its use in topicals. The regulator is working to create a framework to allow companies that were hoping to launch CBD-based products bring those to market, but has cautioned that given its status as a drug, it might require clinical trials. In November, it warned that CBD could cause liver injury and other damage to the human body. The agency has cracked down on some companies, mostly for making unsubstantiated health claims. “We recognize that there is substantial public interest in marketing and accessing CBD for a variety of products,” an FDA spokesperson said in emailed comments. “We are working toward a goal of providing additional guidance, and have made substantial progress. There are many questions to explore regarding the science, safety, effectiveness and quality of products containing CBD, and we need to do our due diligence.” See: ‘CBD has the potential to harm you,’ FDA warns consumers Tuesday’s guidelines lay out how to conduct federally approved research for drug development, outlining steps such as where researchers are allowed to obtain cannabis and emphasizing the need to ensure consistency. “A range of stakeholders have expressed interest in development of drugs that contain cannabis and compounds found in cannabis,” said FDA Principal Deputy Commissioner Amy Abernethy M.D., Ph.D. in a statement. ‘Recent legislative changes have also opened new opportunities for cannabis clinical research. As that body of research progresses and grows, the FDA is working to support drug development in this area.” See also:Attorney General Barr ordered antitrust probes of 10 cannabis mergers, because he dislikes the industry, prosecutor says The main change was the 2018 Farm Bill which legalized the hemp plant as long as it contains less than 0.3% THC, the ingredient in the plant that produces the “high” associated with cannabis. Researchers can now access hemp products from other manufacturers that meet that definition, rather than relying on the only federally authorized cannabis supply at the University of Mississippi. “This change gives sponsors and 93 investigators of clinical studies new options that do not involve the NIDA DSP,” said the guidelines. See now: Aurora Cannabis rolls up its shares in a reverse stock split — here’s what you need to know The FDA is also advising researchers that a too-high concentration of THC could put them in breach of DEa rules and recommends that they consult with the agency on the requirements. “Sponsors and investigators may find it useful to calculate the level of delta-9 THC in their proposed investigational drug product early in the development process to gain insight into the potential control status of their product,” said the guidelines. Researchers submitting investigational new drug application for a cannabis-based drug will need to provide quantitative data on the percentage of THC in their product, along with detailed descriptions of testing methods. The FDA is opening a 60-day public comment period for stakeholders to weigh on the guidelines. A separate comment period is still open for CBD. The FDA recently submitted to Congress a report on testing of CBD products, that found many products do not contain the amount of CBD claimed on the labeling, and in some cases did not contain any at all. The Cannabis ETF THCX, +3.21% has fallen 18% in the year to date, while the S&P 500 SPX, +0.87% has gained 1.3%."}]}