{"article": [{"url": "https://www.marketwatch.com/story/the-us-will-suffer-a-generational-loss-of-talent-and-expertise-if-it-sends-foreign-students-home-2020-07-14", "published": 1594725920.0, "headline": "The U.S. will suffer a generational loss of talent and expertise if it sends foreign students home", "body": "What if Sundar Pichai had been deported while studying at Stanford University: Would he still have become the CEO of Alphabet? Today, if there are any future Sundar Pichais at Stanford or elsewhere, they are likely packing their bags after the U.S. federal government passed a draconian rule mandating that all foreign students unable to attend classes in person must leave the United States. Eight years ago, we wrote a book about how the U.S.’s backward immigration policies were harming the country and stifling innovation. In “The Immigrant Exodus: Why America Is Losing the Global Race to Capture Entrepreneurial Talent,” we presented copious data detailing how immigrants had made outsized contributions to the U.S. economy in general and to the entrepreneurial and innovation economy in particular. We canvassed dozens of entrepreneurs who were either contemplating leaving the United States or had already left due to visa issues and other challenges caused by an immigration system that had become byzantine, capricious and myopic. To our minds, it could not possibly get worse. But we were wrong. First, the U.S. moved to freeze and possibly end the H-1B worker-visa program. We agree that the program’s limitations caused many problems; but millions of productive U.S. citizens came in via the H-1B, including many from the subcontinent. Then, on July 6, the U.S. Immigration and Customs Enforcement announced that foreign students at U.S. universities must take classes in person for the coming school year or leave the country. Inflicting such a policy on those who would attend classes in person they could safely do so and who have been doing their utmost to advance their education in accordance with current health guidelines not only is unreasonable, wasteful and tyrannical. But, more than this, it is also economically damaging to the United States, and to the rest of the world. If allowed to go through, it could cause lasting damage to global innovation.Virtuous circle Since World War II, the United States has become the world’s foremost innovation engine. Much of this innovation was driven by the academic powerhouses that foster verdant greenhouses of enquiry and creative research across all scientific disciplines. As the academic start of the U.S. rose, the university system became a magnet for global intellectual talent. In recent decades, foreign students have made up an increasing percentage of graduate students in the hard-science and mathematical disciplines most closely related to patents and innovation. As long ago as 2003, more than half of doctoral students at U.S. universities in computer science, engineering and mathematics were foreign students, according to the U.S. National Bureau of Economic Research. At first, this dynamic drew criticism from some in countries such as India and China. These critics feared that these developing countries were losing their best and brightest to America. Many would remain in the United States to pursue opportunities not available to them in their native lands. In the past decade, though, the brain drain has become more like a brain recirculation. Native Indians who went to graduate school in the U.S. not only continue to launch companies in higher percentages than native-born Americans but also are more likely to provide direct benefits to the Indian economy as they hire software engineers, partner with Indian research universities and set up R&D centers in India. Technology and ideas developed in U.S. institutions are often moved to India for R&D and production due to the expense and bureaucratic hurdles of the United States.The U.S. benefits the world A classic example of this dynamic is HealthCube. (Disclosure: Vivek Wadhwa is an adviser and shareholder in the company.) Founded by academic researchers of Indian descent in the U.S., HealthCube makes a cutting-edge diagnostic-suite-in-a-box that requires virtually no medical expertise to operate. The company is presently testing a breakthrough solution to the COVID-19 pandemic that could get India and the world back to work. Rather than fight through a thicket of regulations from legacy testing providers in the United States, HealthCube elected to go to market first in India, where it could provide critical laboratory testing for dozens of common diseases at a massive scale and at a fraction of the cost of U.S. testing. The company is jointly headquartered in the United States and India, with product development teams in India. The company’s founder and CEO, Ramanan Laxminarayan, is a renowned global health expert of Indian descent who received master’s and doctoral degrees in economics from the University of Washington. This type of virtuous circle and fluid exchange of ideas and innovation is an inevitable consequence of the tangled two-way free-flowing communication webs that lock the United States and India in a mutually beneficial embrace. The millions of Indian students in the United States are the wellspring of this symbiosis. China has similarly benefitted from students educated in the United States who return home to start companies or advise and support companies in the Chinese market. The United States, obviously, gains from the immigrant students who flock to its shores. For its part, U.S. academic institutions benefit from what is essentially low-cost talent to staff its doctoral and master’s programs and ultimately populate the growing ranks of foreign-born U.S. Nobel Laureates. According to research by The New America foundation, 76% of patents at the top 10 patent-producing universities had at least one immigrant discoverer. And let’s not forget that foreign-born individuals, many of them coming to the United States as students, could be counted among the founders of 51% of “unicorns” in America. Some notable examples include Elon Musk, founder of SpaceX and co-founder of Tesla TSLA, +1.89% and PayPal PYPL, +2.18%, who was born in South Africa, and came to the U.S. via Canada to study at the University of Pennsylvania; and the Collison brothers, co-founders of payments company Stripe, who arrived from Ireland to study at MIT and Harvard.Breaking the chain of innovation Now comes COVID-19, which has already put many U.S. universities on life support. Many foreign students want to stay in the United States even if they are attending school virtually. The fluidity of school-reopening schedules — all subject to infection rates in the United States — mean that the students do not know even when classes will start. With U.S. immigration and entry far more unpredictable and risky than in recent memory, students rightly fear that if they leave they will not be able to re-enter. The net effect of pushing these students out will most likely be an exodus of academic talent to schools in Europe and elsewhere. With such an exodus, the U.S. will suffer a generational loss of talent and expertise: an intellectual catastrophe of historic proportions with long-term economic ramifications. Tesla, Stripe and dozens of other unicorns will be founded elsewhere due to this rule. Nobel Prizes will go to institutions in other countries. This will certainly be bad for the United States; but it will also be bad for the world. Replicating the conditions that created Silicon Valley and the other great research-driven startup meccas of the United States is challenging, and the world as a whole will suffer if this innovation wellspring is plugged. Aside from critical economic damages to the U.S. economy and global innovation, the ruling, if sustained, could mortally wound already wounded academic institutions in the United States. As the country continues to struggle to control the pandemic, even famous academic institutions are facing fiscal catastrophe. Ironically, foreign students are epic cash cows: Paying the full list price for their schooling, they subsidize the cost of U.S. students’ education. Losing even a quarter of foreign students could put severe economic pressure on U.S. universities and force them to raise prices or cut financial aid to U.S. students. Most of the large research universities are unlikely to shutter, but their fiscal recovery could take decades. In that regard, the U.S. government’s ruling to evict their greatest income sources could result not only in those students’ switching to institutions in other countries but also in robbing the coffers of American schools precisely when their need for the money they contribute is greatest. Perhaps the most compelling argument of all, though, is that every deportee is a human being. These people came to the United States dreaming of studying at some of the best schools in the world, and they can legitimately expect the country to honor its commitments to them. For the most part, Americans treat foreign students kindly. Almost all of the hundreds of foreign students we have ever spoken with wax fondly over their time spent at university in the United States. These students all become cultural ambassadors for the United States and bridges to the rest of the world via academic collaboration. When America chooses to send such eager scholars back to their home countries, it not only destroys invaluable relationships; it says to the world: “You are no longer welcome in this country.” It’s a message that benefits nobody and that will most hurt the United States. Vivek Wadhwa is a distinguished fellow at Harvard Law School. Alex Salkever is a consultant on product marketing. Together they wrote “Your Happiness Was Hacked: Why Tech Is Winning the Battle to Control Your Brain — and How to Fight Back.”"}]}