{"article": [{"url": "https://www.marketwatch.com/story/top-economists-say-next-coronavirus-relief-bill-should-be-15-trillion-at-minimum-and-hopefully-larger-2020-07-09", "published": 1594471280.0, "headline": "Top economists say next coronavirus relief bill should be $1.5 trillion at minimum and hopefully larger", "body": "Two prominent economists on Thursday pressed Congress to draft another coronavirus relief measure that is sizable and with benefits that don’t end until the economy is on solid ground. Mark Zandi, chief economist at Moody’s Analytics, said a $1.5 trillion package was the minimum size needed for the next round of fiscal stimulus, but later said he would make the measure significantly larger if he were “king for the day.” Zandi said the economic recovery from the pandemic has gone sideways in the past month, after getting a sizable boost in April and May. Raj Chetty, an economics professor at Harvard University, said he broadly agreed with Zandi’s assessment. He said it was vitally important for Congress to pass unemployment benefits without setting any expiration date. This will give laid off workers much needed confidence that benefits will not terminate and could boost consumer activity. The goal of this next package, Zandi said, is to avoid a downward economic spiral, where unemployment leads to a cutback in demand and consumer spending and that, in turn, leads to even more job losses. The end result would be double-digit unemployment for a long time and another economic “depression,” Zandi said. “We have to avoid that,” he added. Treasury Secretary Steven Mnuchin indicated earlier Thursday that the Trump administration hopes to get another package negotiated and passed in the latter part of July. The looming presidential election in November is also a factor in making this package large. Any further economic stimulus measure isn’t likely to be completed until the end of the first quarter in 2021 given the political schedule in Washington. Zandi said he might be reticent about going “really big” if there was a worry about higher interest rates, but that isn’t a concern now. Fears the size of a new package may be growing to politically unsustainable levels have already led to some calls for limiting its size. A senior aide to Vice President Mike Pence told Bloomberg News he wants to see the price tag for a new bill come in below $1 trillion. But House Speaker Nancy Pelosi appeared Thursday to suggest a minimum amount of $2 trillion for another bill, if it were to include aid to cash-strapped state and local governments, meatier jobless benefits and a second round of checks paid to most Americans. “We need a trillion dollars for state and local. We need another trillion dollars for unemployment insurance and direct payments,” she said at a press conference at the U.S. Capitol. The nonnpartisan Congressional Budget Office has estimated the cost of the first four major coronavirus-related bills at $2.204 trillion between 2020 and 2030. U.S. equity indexes were mixed on Thursday. The Dow Jones Industrial Average DJIA, +0.56% and the S&P 500 index SPX, +0.87% were down while the Nasdaq Composite Index COMP, +1.39% was up slightly."}]}