{"article": [{"url": "https://www.marketwatch.com/story/i-asked-my-family-to-boycott-chic-fil-a-over-its-support-of-anti-lgbtq-causes-but-they-suggested-going-there-to-eat-instead-2020-07-08", "published": 1596294080.0, "headline": "I told my family I boycott Chick-fil-A over its support of anti-LGBTQ causes â\u0080\u0094 now they â\u0080\u0098likeâ\u0080\u0099 it on Facebook and go there for lunch", "body": "Dear Moneyist, Iâ\u0080\u0099m a gay man from a family of 10 siblings, and the only gay member of my extended family of cousins, to my knowledge. I have been dismayed for several years now that some members of my immediate family support Chick-fil-A, the fast-food corporation controversial for its positions placing religious freedom over LGBTQ rights. At best, the companyâ\u0080\u0099s stance is irrelevant to these particular siblings. At worst, these positions are a key reason for their support. Some of them have even gone so far as to post Chick-fil-A on their Facebook page for several years now, even though I have brought to their attention how much that hurts me. In contrast to the aforementioned siblings, a couple of my other, supportive siblings, as well as several of my cousins, refuse to patronize Chick-fil-A as a show of solidarity with me and the LGBTQ movement. Also see: Yes, America needs to brace itself for a second wave of coronavirus It has led me to the painful realization that the most homophobic members of the entire extended family are those with the gay brother. When several siblings are together, these same perpetrators donâ\u0080\u0099t hesitate to suggest that we all go out to eat at Chick-fil-A. The disrespect has caused a rift between me and these siblings. Itâ\u0080\u0099s made me uncomfortable to be around them. I was definitely not looking forward to our annual July 4 gathering. This situation has bothered me for at least five years now, and I am unsure how to handle it. Bill Dear Bill, I donâ\u0080\u0099t know whatâ\u0080\u0099s worse: being slapped in the face with a wet fish, or being slapped in the face with a lightly battered fried cod fillet served on a warm, buttered bun from Chick-fil-A. Theyâ\u0080\u0099re both equally bad, I suppose. I feel your pain. Unfortunately, people often need to see the world from another personâ\u0080\u0099s perspective to understand how their behavior and/or comments affect others, and â\u0080\u0094 even when that is pointed out to them â\u0080\u0094 they would rather pull masks off a rack at a big-box retailer or shout at staff who are courageous enough to work during a pandemic and, in your familyâ\u0080\u0099s case, post about their trips to Chick-fil-A even though they are aware that it alienates you. “ If the last year has taught us anything, itâ\u0080\u0099s that consumers are more powerful than anytime in history. With social media, Americans have a voice and many companies have chosen to listen. ” â\u0080\u0094 The Moneyist If the last year has taught us anything, itâ\u0080\u0099s that consumers are more powerful than any time in history. With social media, Americans have a voice and many companies have chosen to listen. For instance, I don't believe the Black Lives Matter movement would have spurred a reckoning that reached the C-suites of corporate America had companies not had one eye on the social-justice movement, and the inequalities of race in America, and the other eye on their bottom lines. Whatever it takes. Perhaps this time, the momentum to take action will sustain itself and continue to gain steam as Americans question their own white privilege, much like the #MeToo movement has done, with heads rolling and policies changing in industries across the land. But your immediate concern lies with another fight for equality that, arguably, also upholds the ideals of Lady Liberty and the principles of freedom that this country was reportedly founded upon. This last decade has been a period of significant progress for the LGBTQ community in America. Last month, the U.S. Supreme Court ruled that LGBTQ workers are protected from job discrimination. The court decided by a 6-3 vote that a key provision of the Civil Rights Act of 1964 known as Title VII that bars job discrimination because of sex, among other reasons, encompasses bias against LGBT workers. Five years earlier, in May 2015, marriage equality became legal in the U.S., one month before my home country of Ireland made the same decision by popular vote. Also see:George Floyd, white supremacy â\u0080\u0094 and the â\u0080\u0098otherizationâ\u0080\u0099 of African-American men But where does that leave you and your family as they walk past Chick-fil-A, and contemplate a chicken sandwich and fries? America is a country divided, and many dinner tables over the Fourth of July weekend were split, too. Even without that perplexing and polarizing political panorama, siblings like to push each otherâ\u0080\u0099s buttons. The more effective the button, the more likely it is to get pushed. You basically put a big red sign on your forehead with a Chick-fil-A logo, and Iâ\u0080\u0099m sorry you have to endure that. They clearly donâ\u0080\u0099t like being told where they can and canâ\u0080\u0099t eat, and they are determined to make you know that. They are giving you a dollop of indignation with a side order of passive aggression. Bill, I get it. That is enough to give anyone indigestion. Iâ\u0080\u0099m not saying that what theyâ\u0080\u0099re doing is right or compassionate. It would be kinder and easier to eat there when youâ\u0080\u0099re not around, and avoid checking in on Facebook FB, +0.26% Â when they are there. More importantly, it would be more brotherly and sisterly, too. You regard their support for Chick-fil-A as a thoughtless swipe at your freedom to be who you are and live with the same legal protections and social acceptance as anyone else. They, I imagine, see being told where to spend their money as an infringement on their freedom to order a Chick-fil-A Deluxe Chicken Sandwich with 500 calories and 1640 milligrams of sodium. That, they might argue, is their right as Americans. Let them knock themselves out and free yourself from this. If itâ\u0080\u0099s not Chick-fil-A, it would likely be something else. “ It would be kinder and easier to eat there when youâ\u0080\u0099re not around, and avoid checking in on Facebook when they are there. More importantly, it would be more brotherly and sisterly, too. ” â\u0080\u0094 The Moneyist People are what they eat. And if they want to eat Chick-fil-A, thatâ\u0080\u0099s their prerogative. If, say, they want to patronize Amazon AMZN, +3.01% Â instead of independent bookstores, theyâ\u0080\u0099re entitled to do that too. You have every right to tell them that it would mean a lot to you if they would not buy food at this joint, thank you very much. Thatâ\u0080\u0099s the easy part. The hard part is waiting for their reply, and being prepared for a response that you may not like. You have stated your case. If you donâ\u0080\u0099t get the reaction you had hoped for, you must let it go. Otherwise, you will drive yourself crazy obsessing over this. Today, itâ\u0080\u0099s Chick-fil-A. Tomorrow, your difference of opinions could be over the Paul Taylor Dance Company at Lincoln Center named after David H. Koch, the late billionaire who donated money to many conservative causes. I admire you for standing by your beliefs, and your willingness to speak up. You put your heart on the line. That takes guts. Whatâ\u0080\u0099s more, it puts you in a vulnerable position. That doesnâ\u0080\u0099t always feel good, but there is strength in being able to do that. However, you are playing God if you think you have the power or the right to control where they choose to spend their money. The way they see it: Itâ\u0080\u0099s their breakfast party, and theyâ\u0080\u0099ll enjoy their carbohydrates, if they want to. The restaurant has made some efforts to address these issues, most likely because they see the winds of social change, and they want to expand and reach more customers. For many LGBTQ people, it may ring hollow and be too little, too late. I understand that too. Such changes are hardly, if ever, entirely altruistic. Also see: Can you alter your 2019 taxes in order to qualify for the stimulus check? Last November the Georgia-based chicken-sandwich chain said it would cease making multiyear donations to two religious organizations that reportedly made and/or supported controversial statements about homosexuality and same-sex marriage. The company said it would â\u0080\u009cdeepen its giving to a smaller number of organizations working exclusively in the areas of education, homelessness and hunger,â\u0080\u009d and has committed $9 million to organizations such as the Junior Achievement USA, which fosters work-readiness and financial literary skills for students through 12th grade, as well as Covenant House International, which provides outreach to 70,000 homeless, runaway and trafficked young people each year. “ Focus on the people in your life who support you and make you feel good about yourself, and take some comfort in the fact that you are living your life according to your principles. ” â\u0080\u0094 The Moneyist A spokeswoman for Chick-fil-A told MarketWatch: â\u0080\u009cChick-fil-A is a restaurant company focused on food, service and hospitality with no social or political agenda. We want our restaurants to serve as a welcoming environment for all guests.â\u0080\u009d Rather than praising Chick-fil-A for being more inclusive, however, many people on Twitter TWTR, -0.23% Â â\u0080\u0094 including some identifying as Christian and conservative â\u0080\u0094 slammed the chain for chickening out in the face of a â\u0080\u009cleft-wing mob.â\u0080\u009d You canâ\u0080\u0099t please everyone. They too wanted Chick-fil-A to do what they wanted. How dare Chick-fil-A try to walk that line thin red line between two Americas? Will those customers also boycott Chick-fil-A now that the company has stopped supporting those organizations? Maybe they will. Maybe they wonâ\u0080\u0099t. If they do, itâ\u0080\u0099s not our business if they go to Popeyes, Bojangles or KFC YUM, +0.08%, instead. Whatâ\u0080\u0099s important here is what you do. Donâ\u0080\u0099t react to your siblings. Hide their Facebook feeds, if it helps. We all have a family of origin, and a chosen family of beloved friends. Focus on the people in your life who support you and make you feel good about yourself, and take some comfort in the fact that you are living your life according to your principles. Ultimately, we only ever have to live with ourselves. When you look in the mirror in the morning, know that you are who are you because of what you are: a man who believes that companies should be held to account for their actions. You can use your pocketbook to make a small change. As weâ\u0080\u0099ve seen, it appears to work. Not everyone will agree, and thatâ\u0080\u0099s OK. Keep being you, and the rest will take care of itself. If you canâ\u0080\u0099t stop thinking about it, stop going to family events. If you are tempted to take a peek at your other siblingsâ\u0080\u0099 Facebook feeds to get riled up about their offensive posts, press â\u0080\u009cblock.â\u0080\u009d You can email The Moneyist with any financial and ethical questions related to coronavirus at qfottrell@marketwatch.com Want to read more?Follow Quentin Fottrell on Twitterand read more of his columns here Would you like to sign up to an email alert when a new Moneyist column has been published? If so, click on this link. Hello there, MarketWatchers. Check out the Moneyist private Facebook FB, +0.26% Â group where we look for answers to lifeâ\u0080\u0099s thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}