{"article": [{"url": "https://www.marketwatch.com/story/did-you-start-a-side-gig-during-the-covid-19-pandemic-think-carefully-before-answering-these-irs-questions-2020-07-30", "published": 1596614000.0, "headline": "Did you start a side gig during the COVID-19 pandemic? Think carefully before answering these IRS questions", "body": "Say you have an unincorporated activity that you think of as a business, consider these three things: 1. It could be a brand-new endeavor that you started after the COVID-19 crisis separated you from your regular job. 2. You may have started in response to new opportunities opened up by the COVID-19 crisis — like making designer masks to sell on the internet. 3. Or maybe it was a sideline activity that was up and running before anybody had ever heard of COVID-19. The federal income tax issue is the same. I will explain. Hobby or business? Why it matters If your expenses from the sideline activity exceed the revenues, you have a net loss. You may think you can deduct that loss on your Form 1040 with no questions asked. Not so fast. The IRS likes to claim that money-losing sidelines are hobbies rather than businesses — because the federal income tax rules for hobbies are not in your favor. Thanks to an unhelpful change included in the Tax Cuts and Jobs Act (TCJA), the rules are even worse for 2018-2025. But don’t give up hope. If you can show a profit motive for your activity, you can deduct the losses. And history shows that the IRS bites the dust in about as many court cases on this issue as it wins. Here’s what you need to know about the unfavorable TCJA change for expenses that are properly classified as hobby-related, and what to do about it if you have a money-losing sideline activity in the COVID-19 era. Let’s start with a little history lesson to put thing in perspective. The rules for hobbies were already bad before the Tax Cuts and Jobs Act (TCJA) Before the TCJA, if an activity was deemed to be a not-for-profit hobby, you had to report all the revenue on your Form 1040. You could deduct hobby-related expenses that could be written off in any event, such as itemized deductions for allocable home mortgage interest and property taxes. Your other hobby-related expenses — up to the amount of revenue from the hobby — could potentially be written off. You had to treat those other outlays as miscellaneous itemized expenses, that could only be deducted to the extent they exceeded 2% of your adjusted gross income (AGI). So, you basically could not have a net tax loss from a hobby even if you lost your shirt. Furthermore, you could not write off any of those other expenses unless you itemized. Even if you did itemize, your write-off was cut back by the 2%-of-AGI deduction threshold. So, if you had a healthy AGI, your deduction for hobby expenses might have been little or nothing. Finally, if you were a victim of the dreaded alternative minimum tax (AMT), miscellaneous itemized deductions for hobby expenses were completely disallowed for AMT purposes. Pretty bad, right? Well, it’s worse now. TCJA made tax rules for hobbies even worse For 2018–2025, the TCJA suspends write-offs for miscellaneous itemized deduction items that under prior law were subject to the 2%-of-AGI deduction threshold. That change wipes all deductions for hobby-related expenses, except for expenses that you can write off in any event (such as itemized deductions for allocable mortgage interest and property taxes). So, under current law, you simply cannot deduct hobby-related expenses for federal income tax purposes. As under prior law, you still must report 100% of hobby-related revenue on your Form 1040. So, you’ll be taxed on all the revenue even if the activity is an overall money-loser. So, the federal income tax rules for hobbies have gone from bad to worse. Takeaway: Under current law, it’s more important than ever to establish that a money-losing activity is actually a for-profit business venture that has simply not yet become profitable. This is especially important for an activity that’s clearly a sideline. Deciding if your activity is business or hobby Now that you understand why hobby status is bad for your tax situation and for-profit business status is good, the next step is determining if your money-losing activity is a hobby or a business. Here’s the scoop on that calculation. Safe-harbor rules Helpfully enough, our beloved Internal Revenue Code has two safe-harbor rules for determining if you have a for-profit business. Source: Internal Revenue Code Section 183(d). * An activity is presumed to be a for-profit business if it produces positive taxable income (revenues in excess of deductions) in at least three years during the five-year period ending with the year in question. Losses from the other years can be deducted because they are considered to be business losses as opposed to hobby losses. * A horse racing, breeding, training, or showing activity is presumed to be a for-profit business if it produces positive taxable income in at least two years during the seven-year period ending with the tax year in question. Takeaway: Those who can plan ahead to qualify for these safe-harbor rules earn the right to deduct their losses in unprofitable years. Intent to make a profit is the key to better tax results Even if you can’t qualify for one of the aforementioned safe-harbor rules, you may still be able to treat your money-losing activity as a for-profit business and rightfully deduct the losses on Form 1040. Basically, you must demonstrate an honest intent to make a profit. Source: IRS Regulation 1.183-2(b). Factors that can prove (or disprove) such intent include: * Conducting the activity in a business-like manner by keeping good records and searching for profit-making strategies. * Having expertise in the activity or hiring advisers who do. * Spending enough time to justify the notion that the activity is a business and not just something to avoid boredom. * Expectation of asset appreciation. This is why the IRS will almost never claim that owning rental real estate is a hobby even when tax losses are incurred year after year. * Success in other ventures, which indicates business acumen. * The history and magnitude of income and losses from the activity. Occasional large profits hold more weight than more-frequent small profits. Losses caused by unusual events or bad luck are more justifiable than ongoing losses that only a hobbyist would be willing to accept. * Your financial status. “Rich” folks can afford to absorb ongoing losses (which may indicate a hobby) while ordinary folks are usually trying to make a buck (which indicates a business). * Elements of personal pleasure. Training race horses is more fun than emptying septic tanks, so the IRS is far more likely to claim the former is a hobby if losses start showing up on your tax returns. What if my sideline activity makes money? I hope it does. If so, welcome to the wonderful world of capitalism. And taxes. You must include the net profit from your activity in calculating your taxable income. So, your federal income tax bill may go up, and you may owe more state income tax too. What about the dreaded federal self-employment tax, you ask? Good question. See my earlier column on when self-employment tax is owed on income from a random (ephemeral) profitable activity. The bottom line Business status is good is for deducting losses. Hobby status is bad, especially after the TCJA. On the bright side, the Tax Court has over the years concluded that a number of pleasurable activities could be classified as for-profit business ventures rather than tax-disfavored hobbies--based on evaluating factors listed in this column. So there is often reason for hope. That said, the hobby loss issue has historically been a hot one for the IRS, and the unfavorable TCJA change makes it hotter. So, it’s important to be on the right side of as many of the aforementioned factors as possible. Your tax pro can help you create documentation to prove that that you are, in fact, on the right side."}]}