{"article": [{"url": "https://www.marketwatch.com/story/white-house-rejects-house-bill-for-emergency-postal-service-aid-2020-08-23", "published": 1598208140.0, "headline": "White House rejects House bill for emergency Postal Service aid", "body": "WASHINGTON — Help for the U.S. Postal Service landed in stalemate Sunday as the White House dismissed an emergency funding bill aimed at shoring up the agency before the November elections as “going nowhere” and House Speaker Nancy Pelosi urged senators to act quickly. “The public is demanding action on this now,” Pelosi said. “I can’t see how the Senate can avoid it unless they do so to their peril.” White House chief of staff Mark Meadows rejected the legislation the House passed late Saturday to provide $25 billion and block operational changes by Postmaster General Louis DeJoy. Meadows called it a “political statement,” stressing that President Donald Trump would consider additional money only as part of a broader coronavirus relief package. “That bill was not a serious bill,” Meadows said. “And my conversations with a lot of the Democrats on Capitol Hill yesterday is, if you want to be serious about it, this president is willing to put forth money and reforms.” Meadows said he planned to speak with Pelosi later Sunday. The legislation heads to the Senate, where Majority Leader Mitch McConnell, R-Ky., has been eyeing a $10 billion postal rescue as part of the next COVID-19 relief package. “Hopefully what will happen is the Republican senators will take this bill when it comes across, they’ll amend it and actually address many of the things that are hurting America right now in terms of this pandemic response and be able to get it to the president’s desk,” Meadows said. Pelosi, however, called Meadows’ proposals “bare leaves,” saying they don’t address children facing food insecurity, people grappling with evictions, coronavirus testing and treatment or money for state and local governments. “What they want to do is not the right path,” she said Sunday. “All the president wants is this one thing: He wants his name on the letter to go out with a check in it, and he doesn’t care about the rest of it.” With heated debate over mail delays, the House approved the legislation in a rare Saturday session. More than two dozen House Republicans broke with the president in backing the bill, which passed 257-150. Trump had urged a no vote, railing against mail-in ballots expected to surge in the COVID-19 crisis, and the White House said he would veto it if it reached his desk. Millions of people are expected to opt for mail-in ballots to avoid polling places during the pandemic. But McConnell criticized the legislation as part of a postal “conspiracy theory,” echoing similar sentiments during a lively House floor debate. “The USPS is equipped to handle this election, and if a real need arises, Congress will meet it,” he said Saturday in a statement. Senate Minority Leader Chuck Schumer, D-N.Y., said Sunday he had secured agreement with the Postal Service’s Board of Governors’ new election committee to issue a report in two weeks on the service’s plans to address a surge of mail-in ballots during the November elections. Under the agreement with the committee’s Democratic chairman, Lee Moak, the committee would also provide weekly briefings for top Senate Democrats. The six-member Board of Governors, all of whom are Trump appointees, announced the bipartisan committee Friday to oversee mail voting. “Congress will use that report to ensure that the Postal Service has every resource it needs to protect and deliver election mail and hold DeJoy and the board accountable,” Schumer said. Facing a backlash over operational changes, DeJoy testified Friday in the Senate that his “No. 1 priority” is to ensure election mail arrives on time. Still, the new postal leader, a Trump ally, said he would not restore the cuts to mailboxes and sorting equipment that have already been made. He could not provide senators with a plan for handling the ballot crush for the election. DeJoy is set to return Monday to testify before the House Oversight Committee. “The American people don’t want anyone messing with the post office,” said Rep. Carolyn Maloney, D-N.Y., the chair of the Oversight Committee and author of the bill. “They just want their mail.” Maloney’s committee on Saturday released internal Postal Service documents warning about steep declines and delays in a range of mail services since early July, shortly after DeJoy took the helm. He acknowledged at the Senate hearing there has been a “dip” in service, but disputed reports of widespread problems. The House bill would reverse the cuts by prohibiting any changes made after January, and provide funds to the agency. The Postal Service has been struggling financially under a decline in mail volume, COVID-19-related costs and a rare and cumbersome congressional requirement to fund in advance its retiree health care benefits. For many, the Postal Service provides a lifeline, delivering not just cards and letters but also prescription drugs, financial statements and other items that are especially needed by mail during the pandemic. Meadows spoke on “Fox News Sunday” and ABC’s “This Week,” and Pelosi appeared on CNN’s “State of the Union.”"}]}