{"article": [{"url": "https://www.marketwatch.com/story/my-uncle-left-his-kids-3-million-and-left-me-15000-im-73-and-not-in-good-health-is-it-wrong-to-ask-my-cousin-for-another-5000-2020-09-09", "published": 1600081760.0, "headline": "My uncle left his kids $3 million and left me $15,000. Iâ\u0080\u0099m 73 and not in good health. Is it wrong to ask my cousin for another $5,000?", "body": "Dear Moneyist, Iâ\u0080\u0099m 73, I live in Texas, and my only remaining relative recently passed away. When my uncle died, he left his two kids everything, including $3 million and so much more. He left me $15,000. There was a private trust that my late cousinâ\u0080\u0099s wife oversaw. My uncle left nothing to my brother, so both of my cousins chipped in $5,000 each to give to my brother. He thinks the money came from my uncle. One of my cousins died, so whatever my uncle left got split between my cousinâ\u0080\u0099s wife and his sister. I was quite hurt that he left nothing to me. Iâ\u0080\u0099m quite ill and do not have anything left of my own $15,000 inheritance. I asked my remaining cousin if I could get $5,000 from her as sheâ\u0080\u0099s very wealthy. She said no. Do you think asking for the same money they gave my brother is wrong? My cousin said some hurtful things. I know things that my uncle had said about her too, but I would never hurt her by repeating them. This is close to breaking up a 60-year relationship. I would not ask for money if I didnâ\u0080\u0099t need it. Niece Left Out in the Cold Dear Niece, Your uncle left you $15,000. Your cousin chipped in money to help out your brother, who was left nothing by your uncle. You asked for money from your cousin, and she refused. Itâ\u0080\u0099s not a question of right or wrong â\u0080\u0094 you did what you felt you needed to do at the time, and you got your answer. I donâ\u0080\u0099t know your relationship with this cousin, the state of your finances or your physical health, nor do I know what you spent the $15,000 inheritance on. I will say this: Always be prepared for a no in situations like these, and expect the request to damage the relationship. The Moneyist: I filed a joint tax return with my estranged wife because she is a gambler and her finances are a mess. But I got NO stimulus check â\u0080\u0094 what can I do? Ask yourself what decisions you made that led you to where you are today and, more importantly, figure out how you can plan for your remaining years. You can enroll in Medicare, if you have not done so already. The AARP can help seniors find state and federal financial assistance, and can point you to other organizations that can help with your financial, physical and social needs. The Area Agency on Aging can direct you to local support in your state, and the Administration on Aging can help with housing, long-term care, and legal and financial advice. Currently, the answer to your financial problems appears to lie with these cousins and this $3 million inheritance. You are not a direct family member. They received money from their father. You are entering into a co-dependent relationship with these family members by linking your fortunes to their sudden wealth. They have nothing to do with why you are in the position you are in, which may or may not be through no fault of your own. However, in most cases such as this, all roads of responsibility lead back to our own front door, and not to the door of other family members. The Moneyist: I didnâ\u0080\u0099t get my stimulus check because I owe back child support. Itâ\u0080\u0099s not fair. My stepchildren rely on me â\u0080\u0094 what can I do? You look at what they have and you look at what you have, and perhaps you believe that it couldnâ\u0080\u0099t hurt if they passed a little goodwill or $5,000 your way. The $15,000 you received from your uncle arguably came out of their inheritance. It was a modest sum, but that doesnâ\u0080\u0099t mean you deserve more. Youâ\u0080\u0099re not only staring a gift horse in the mouth, youâ\u0080\u0099re examining it for loose gold fillings. Few people like to ask a friend or family member for money, and even fewer like to be asked for money. It commercializes a relationship, and it erodes trust. I wish you the best of everything in finding the help that you need, and I hope you stay safe and healthy, especially in these uncertain times. You can email The Moneyist with any financial and ethical questions related to coronavirus at qfottrell@marketwatch.com. Want to read more?Follow Quentin Fottrell on Twitterand read more of his columns here. Donâ\u0080\u0099t miss:â\u0080\u0098We will not have a vaccine by next winter.â\u0080\u0099 Like the 1918 Spanish flu, CDC says second wave of coronavirus could be worse. So what happens now? Hello there, MarketWatchers. Check out the Moneyist private Facebook FB, +0.26% Â group where we look for answers to lifeâ\u0080\u0099s thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}