{"article": [{"url": "https://www.marketwatch.com/story/big-techs-big-test-arrives-in-the-busiest-week-of-earnings-season-2020-07-26", "published": 1595847680.0, "headline": "Big Techâ\u0080\u0099s big test arrives in the busiest week of earnings season", "body": "The coming week was already going to be a big test for Big Tech, the biggest names on Wall Street in the busiest week of earnings reporting season. To complicate matters, chief executives of the four marque names are scheduled to face questioning on Capitol Hill over their business practices on Wednesday. A day later, Google parent Alphabet Inc. GOOGL, +1.82% Â GOOG, +1.97% Â , Amazon.com Inc. AMZN, +3.01% Â , Apple Inc. AAPL, +1.74% Â and Facebook Inc. FB, +0.26% Â will all report calendar second-quarter earnings after the closing bell. That is only part of the busiest week of this earnings season, as another 180 companies in the S&P 500 index SPX, +0.87% Â are also scheduled to reveal how the COVID-19 pandemic has affected their finances. Read more: Congress has a million-plus documents from Big Tech antitrust investigation, and are ready to grill big-name CEOs The four Big Tech names combine for more than $5 trillion in market value, as investors have dumped money into their stocks in search of some type of safety during the pandemic. While Americans sheltered in place have relied on their services to remain connected during the pandemic, there are still concerns about how they will weather the economic symptoms of the coronavirus. On Thursday afternoon, Alphabet will give a read on the online-advertising market with its report, which will focus on search advertising. Microsoft Corp. MSFT, +2.48% Â reported a big decline in its search-advertising business that suggests Google could have hit a rough patch, though YouTube and the Google Cloud business could mask some negative effects. Amazon and Apple are also expected to report Thursday, putting their trillion dollar-plus valuations to the test. Appleâ\u0080\u0099s forecast could give hints about the release of the next iPhone and detail how store closures could change iPhone purchasing habits, while Amazon expects to see a big bump in revenue but spend any profit as fast as it can collect it on continued workforce growth and logistics improvements. Facebook joins the Thursday crew after pushing its report back a day due to a â\u0080\u009cscheduling conflictâ\u0080\u009d with the hearing. The company faces investors amid a broad advertiser boycott and questions about the health of the overall online-ad market. Twitter Inc. TWTR, -0.23% Â and Snap Inc. SNAP, -0.18% Â revealed worrisome trends in social-advertising purchases already this earnings reporting season, and Facebook faces more complications than those two. Even if those tech companies manage to exceed expectations, the overall picture remains bleak. The S&P 500 is on track to post its worst quarter of earnings growth since the fourth quarter of 2008. The 130 members of the index that have thus far reported earnings have seen a 42.8% decline in aggregate profits, and analysts surveyed by FactSet expect a 42.4% drop in earnings once all reports are in. Despite the profit carnage, companies have been overwhelmingly exceeding expectations, though those beats arenâ\u0080\u0099t driving big stock movements, likely because of how far estimates had come down due to the pandemic. More than 80% of those companies that reported thus far have topped earnings per share expectations, according to J.P. Morgan. At the same time, companies beating expectations on both revenue and earnings have only outperformed the market by 1.2% on average, according to Credit Suisse Chief U.S. Equity Strategist Jonathan Golub. The historical average is 1.6%, he said. Those that fell short of estimates on both metrics have lagged the market by an average of 0.7%, while a 3.1% underperformance is the historical average. Shopping cart Besides Amazon, numerous other companies will shed light on the state of e-commerce amid the pandemic. EBay Inc. EBAY, +6.47% Â reports Tuesday afternoon and Wedbush analyst Ygal Arounian are hopeful that the company can capitalize on the broader wave of e-commerce adoption in order to drive â\u0080\u009csustainable buyer growthâ\u0080\u009d on the platform. Read: EBay says its will â\u0080\u0098move pretty quicklyâ\u0080\u0099 on payments transition as PayPal agreement expires Another Tuesday read on e-commerce comes from Visa Inc. V, +1.80%, which will be balancing strong online-volume trends against a weak backdrop for travel spending and continued restrictions on in-person businesses. Mastercard Inc. MA, +2.09% Â offers a similar story Thursday morning, while PayPal Holdings Inc. PYPL, +2.18% Â provides an purer read on the e-commerce landscape Wednesday afternoon. Still grounded Boeing Co. BA, -0.39% Â is in for another tough quarter as the COVID-19 crisis pressures the aerospace landscape. The company reported only 20 commercial deliveries in the June quarter, below RBC Capital Markets analyst Michael Eisenâ\u0080\u0099s estimate of 36, but he said the numbers seemed to be an â\u0080\u009cindication that the worst of the production headwinds associated with the MAX grounding and COVID-19 are likely behind us.â\u0080\u009d Executives will seek to reassure investors about the long-term plan Wednesday morning, but that will require looking past what J.P. Morganâ\u0080\u0099s Seth Seifman estimates could be $6 billion of cash burn for the June quarter. Carpool Tesla Inc. TSLA, +1.89% Â posted a surprise GAAP profit last week, but analysts expect heavy losses for fellow car makers General Motors Co. GM, -0.15% Â and Ford Motor Co. F, -1.36% Â Goldman Sachs analyst Mark Delaney is still encouraged by â\u0080\u009cimproving data pointsâ\u0080\u009d for the Detroit auto companies and he thinks that both companies could benefit from a greater mix of pickups and sport utility vehicles, which he said have margins that are above the corporate average. â\u0080\u009cWe believe that the recent acceleration [in the shift toward pickups and SUVs] is due to factors including consumer preference for towing capabilities (including RVs) and also the relationship between pickup truck sales with housing starts,â\u0080\u009d he wrote ahead of GMâ\u0080\u0099s Wednesday morning report and Fordâ\u0080\u0099s Thursday afternoon one. Vital signs Pfizer Inc. PFE, -0.27% Â and Gilead Sciences Inc. GILD, +0.82% Â are among the biggest health names scheduled to report in the week ahead as investors look for more information on companies working on COVID-19 treatments and vaccines. Pfizer is developing a vaccine with BioNTech and the companies recently announced an agreement that would have the U.S. government pay $1.95 billion for 100 million doses of the vaccine. That works out to $19.50 a dose, though Mizuhoâ\u0080\u0099s Vamil Divan said it remains unclear how pricing will evolve in the future based on demand and the competitive landscape. â\u0080\u009cWe expect significant attention on the call on the continued progress they are making with the vaccine, although given the recent run in the stock we will also be looking for additional color on their so-called â\u0080\u0098Trailblazerâ\u0080\u0099 pipeline assets that may currently be underappreciated by the Street,â\u0080\u009d he wrote ahead of the companyâ\u0080\u0099s Tuesday morning report. With Gilead, look for clues about the companyâ\u0080\u0099s remdesivir drug and how it will impact financials now that the government has issued an emergency use authorization for the drug to be used in the treatment of some seriously ill COVID-19 patients. Barclays analyst Carter Gould said that margins for the drug arenâ\u0080\u0099t likely to match overall company margins, but investors will probably have to do their own math based on the companyâ\u0080\u0099s more general financial disclosures to deduce how remdesivir fits in. Gould said heâ\u0080\u0099d be â\u0080\u009cvery surprised if the company details specific projected remdesivir gross marginsâ\u0080\u009d on the Thursday afternoon call. Read: Gilead says coronavirus drug remdesivir can reduce risk of death, but analysts need more proof12 Dow components A packed week for the Dow Jones Industrial Average includes five Tuesday reports: 3M Co. MMM, +0.94%, Pfizer, Raytheon Technologies Corp. RTX, -1.46%, and McDonaldâ\u0080\u0099s Corp. MCD, -0.43% Â in the morning, and Visa after the closing bell. Boeing is the lone name scheduled for Wednesday, while Procter & Gamble Co. PG, +0.89% Â and Apple bookend the Thursday slate. Chevron Corp. CVX, -1.62%, Exxon Mobil Corp. XOM, -1.47%, Caterpillar Inc. CAT, +1.45% Â and Merck & Co. Inc. MRK, -0.14% Â round out the week on a busy Friday morning. Contributing: Jon Swartz"}]}