{"article": [{"url": "https://www.marketwatch.com/story/mortgage-rates-keeping-falling-so-will-they-finally-drop-to-0-2020-08-13", "published": 1597560320.0, "headline": "Mortgage rates keep falling â\u0080\u0094 will they finally drop to 0%?", "body": "Mortgage rates have dropped to record lows on eight separate occasions in 2020 so far, as the coronavirus pandemic has roiled the global economy. But could they eventually drop to 0%? Well, if past precedent is any indication, thereâ\u0080\u0099s indeed a chance. Freddie Mac FMCC, +0.52% Â deputy chief economist Len Kiefer posted to Twitter TWTR, -0.23% Â a chart showing the movements in the average rate of the 30-year fixed-rate mortgage following the Great Recession. As he pointed out, interest rates on home loans dropped in four of the five years following the 2008 financial crisis, falling roughly three percentage points. This week, mortgage rates moved up a bit. The 30-year fixed-rate mortgage averaged 2.96% for the week ending Aug. 13, rising eight basis points from the week prior, Freddie Mac reported Thursday. The 15-year fixed-rate mortgage averaged 2.46%, while the 5-year Treasury-indexed hybrid adjustable-rate mortgage stood at 2.9%. The week prior mortgage rates had fallen to a record low for the eighth time this year. iframe.twitter-tweet { width: 100% !important; } So were we to see a repeat of what happened after the Great Recession, then rates indeed would drop to 0% â\u0080\u0094 or even into negative territory. Predicting whether that will happen isnâ\u0080\u0099t so simple. â\u0080\u009cInterest rates are super hard to forecast,â\u0080\u009d Kiefer told MarketWatch. â\u0080\u009cEconomists, myself included, have not had a great track record of predicting where rates would go. For many years, folks were saying rates were headed higher, and they ended up continuing to head lower.â\u0080\u009d A 0% mortgage isnâ\u0080\u0099t a fantasy â\u0080\u0094 in fact, itâ\u0080\u0099s the reality across the pond. In Denmark, Jyske Bank JYSK, +0.29% Â began offering a 10-year fixed-rate mortgage at negative 0.5% last year, and Finland-based Nordea Bank announced around the same time that it was offering a 20-year fixed-rate mortgage in Denmark that charges no interest. “ â\u0080\u0098For many years, folks, were saying rates were headed higher, and they ended up continuing to head lower.â\u0080\u0099 ” â\u0080\u0094 Len Kiefer, deputy chief economist at Freddie Mac But economists say there are many reasons to believe that mortgage rates wonâ\u0080\u0099t drop to 0% or lower any time soon in the U.S. For instance, Freddie Macâ\u0080\u0099s most recent forecast estimated that the 30-year mortgage would average 3.2% in 2021, not too far from where it stands now. Thatâ\u0080\u0099s in large part because the Federal Reserve wouldnâ\u0080\u0099t likely let it happen. The Fed doesnâ\u0080\u0099t directly control mortgage rates. Instead, mortgage rates roughly followed the direction of long-term bond yields, particularly the 10-year Treasury note TMUBMUSD10Y, 0.777%. However, expectations regarding the Fedâ\u0080\u0099s interest-rate policy are cooked into the yields for those bonds and mortgage rates. When the pandemic became a major concern, the Federal Reserve did move to cut the short-term federal funds rate to zero â\u0080\u0094 and sure enough, since then both the 10-year Treasury yield and the 30-year mortgage rate have dropped to record lows. In order for 0% mortgages to become a reality, â\u0080\u009cWeâ\u0080\u0099d probably have to see negative Fed funds rates,â\u0080\u009d said Danielle Hale, chief economist at Realtor.com. â\u0080\u009cThe central bank rates in Denmark had been negative for five years or so before mortgage rates got to zero,â\u0080\u009d Hale added. â\u0080\u009cThe Fed has been clear that itâ\u0080\u0099s not their preferred course of action.â\u0080\u009d A lot would need to happen for the Fed to take rates negative, including perhaps a major demographic shift. â\u0080\u009cThe U.S. population is a lot younger than Europe or Japan,â\u0080\u009d Kiefer said. â\u0080\u009cPerhaps in 10 years, depending on immigration and other things, we may look more like them. If that is one of the driving factors of inflation â\u0080\u0094 we donâ\u0080\u0099t know that for sure, but thatâ\u0080\u0099s a theory â\u0080\u0094 then that could be what we would perhaps look at.â\u0080\u009d “ â\u0080\u0098The central bank rates in Denmark had been negative for five years or so before mortgage rates got to zero.â\u0080\u0099 ” â\u0080\u0094 Danielle Hale, chief economist at Realtor.com In other words, the aging populations in Western Europe and Japan could explain the slower economic growth those regions have seen. And it would take a serious, prolonged downturn in GDP or labor market growth in the U.S. for the Fed to feel comfortable moving rates into the negative territory. Yet, even if that happens, rates could still stay above 0% â\u0080\u0094 and thatâ\u0080\u0099s because of the role investors in mortgage-backed securities play. â\u0080\u009cMortgage rates are determined by investor demand for mortgage bonds,â\u0080\u009d said Matthew Speakman, an economist at Zillow ZG, -0.42%. â\u0080\u009cA precipitous drop in rates would likely prompt a surge in refinancing demand, and loans that only generate a few payments before being refinanced arenâ\u0080\u0099t profitable for investors,â\u0080\u009d Speakman added. â\u0080\u009cThis dynamic would weaken investor demand and result in higher rates.â\u0080\u009d Plus, mortgages carry some risk, since homeowners could miss payments and go into default. That risk comes with a premium that translates into a higher interest rate compared with the yield on the 10-year Treasury and other investments, Speakman said. However unlikely it is that mortgage rates fall to 0% on average, that isnâ\u0080\u0099t to say one or two lenders might not flirt with the idea. United Wholesale Mortgage, for instance, has begun advertising a 30-year fixed-rate mortgage at only 1.99% â\u0080\u0094 though the low interest rate comes with steep fees. â\u0080\u009cWhen we survey lenders we see a variety of interest rates,â\u0080\u009d Kiefer said. â\u0080\u009cIt may be very beneficial for them to shop around because they may get very different quotes, depending on who they talk to.â\u0080\u009d"}]}