{"article": [{"url": "https://www.marketwatch.com/story/new-york-city-is-dead-forever-according-to-one-lifelong-new-yorker-2020-08-16", "published": 1597659740.0, "headline": "New York City is â\u0080\u0098dead forever,â\u0080\u0099 according to this proud New Yorker", "body": "Will the city that never sleeps ever wake up? Not according to James Altucher, a best-selling author and former hedge-fund manager (and a former MarketWatch columnist), who says that New York City is â\u0080\u009cdead foreverâ\u0080\u009d as its residents come to grips with the reality of the coronavirus pandemic and what it means for the fate of the Big Apple. â\u0080\u009cI love NYC. When I first moved to NYC, it was a dream come true. Every corner was like a theater production happening right in front of me. So much personality, so many stories,â\u0080\u009d he wrote in a blog post explaining why his temporary relocation might become more permanent. “ â\u0080\u0098I donâ\u0080\u0099t benefit from saying any of this. I love NYC. I was born there. Iâ\u0080\u0099ve lived there forever. I STILL live there. I love everything about NYC. I want 2019 back. But this time is different.â\u0080\u0099 ” Altucher isnâ\u0080\u0099t alone, of course. The New York Times back in June asked the â\u0080\u009cagonizingâ\u0080\u009d question: â\u0080\u009cIs New York City worth it anymore?â\u0080\u009d amid a mass exodus of an estimated 420,000 residents between March and May, when the coronavirus was really blowing up. In July, there were a record 13,117 vacant apartments across Manhattan, according to a report by Douglas Elliman and Miller Samuel Real Estate Appraisers & Consultants. A year ago, that number was a 5,912. Also, new lease signings fell by about 23%, resulting in a drop in rental prices. Howard Gold:New York City has come back from every crippling blow â\u0080\u0094 but coronavirus could land a knockout punch CityWatch:With most New York City offices closed, companies consider downsizing â\u0080\u0094 or heading for the suburbs To be fair, New York may be feeling the most profound impact, but several cities have been hit hard. Check out the staggering stats on San Francisco, for example: iframe.twitter-tweet { width: 100% !important; } As for the Times story, along with the gloom, there was also a message of hope from diehards believing that New Yorkâ\u0080\u0099s history of â\u0080\u009cflight and resurgenceâ\u0080\u009d will repeat itself. â\u0080\u009cThese times of crisis, when things get tough in the city, itâ\u0080\u0099s where I want to be, itâ\u0080\u0099s where my neighbors are,â\u0080\u009d one local photographer told the paper. â\u0080\u009cIâ\u0080\u0099ve been walking around and exploring, and the city is becoming even more fascinating during a time like this.â\u0080\u009d But Altucher doesnâ\u0080\u0099t see it that way. Will the city bounce back? â\u0080\u009cNo. Not this time.â\u0080\u009d Will it remain the center of the financial universe? â\u0080\u009cNot this time.â\u0080\u009d New York has experienced worse? â\u0080\u009cNo it hasnâ\u0080\u0099t.â\u0080\u009d He pointed to several reasons that, this time, itâ\u0080\u0099s different. First, the center of the city is empty. Even though people are allowed to go back to work, theyâ\u0080\u0099re not going, he said, characterizing the Time-Life Building in Midtown Manhattan as almost a complete ghost town. â\u0080\u009cBusinesses have realized that they donâ\u0080\u0099t need their employees at the office,â\u0080\u009d said Altucher, who is currently in South Florida. â\u0080\u009cTheyâ\u0080\u0099ve realized they are even more productive with everyone at home.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } Then thereâ\u0080\u0099s the culture, or lack thereof these days. He specifically mentioned Broadway and its plans to open some version of itself next year at the earliest. â\u0080\u009cBut is that true? We simply donâ\u0080\u0099t know. And what does that mean? And will it have to be only 25% capacity?â\u0080\u009d Altucher said. â\u0080\u009cBroadway shows canâ\u0080\u0099t survive with that! And will performers, writers, producers, investors, lenders, stagehands, landlords, etc. wait a year?â\u0080\u009d What about the foodie scene? â\u0080\u009cMy favorite restaurant is closed for good. OK, letâ\u0080\u0099s go to my second favorite. Closed for good. Third favorite, closed for good,â\u0080\u009d he wrote. â\u0080\u009cI thought the PPP was supposed to help. No? What about emergency relief? No. Stimulus checks? Unemployment? No and no. OK, my fourth favorite, or what about that place I always ordered delivery from? No and no.â\u0080\u009d The data support him. According to Yelp, 60% of restaurants around the U.S. have closed for good. Altucher puts the percentage much higher in New York City. â\u0080\u009cWhat happens to all the employees who work at these restaurants? They are gone. They left New York City. Where did they go?â\u0080\u009d he wrote in his blog post. â\u0080\u009cI know a lot of people who went to Maine, Vermont, Tennessee, upstate, Indiana, etc. Back to live with their parents or live with friends or live cheaper. They are gone, and gone for good.â\u0080\u009d He then went into the death of the commercial real-estate market and how online learning could keep college students out of the city as two other contributing factors to the cityâ\u0080\u0099s prospective demise. â\u0080\u009cThis time is different. Youâ\u0080\u0099re never supposed to say that but this time itâ\u0080\u0099s true. If you believe this time is no different, that NYC is resilient, I hope youâ\u0080\u0099re right,â\u0080\u009d he said. â\u0080\u009cI donâ\u0080\u0099t benefit from saying any of this. I love NYC. I was born there. Iâ\u0080\u0099ve lived there forever. I STILL live there. I love everything about NYC. I want 2019 back. But this time is different.â\u0080\u009d Read on:Check out these 8 smaller towns with big-city perks Plus:Relocating? Ask these 6 questions to find the place thatâ\u0080\u0099s right for you"}]}