{"article": [{"url": "https://www.marketwatch.com/story/trump-to-announce-emergency-authorization-of-plasma-treatment-for-covid-19-2020-08-23", "published": 1598220800.0, "headline": "Trump announces emergency authorization of plasma treatment for COVID-19", "body": "WASHINGTON — President Donald Trump on Sunday announced emergency authorization to treat COVID-19 patients with convalescent plasma — a move he called “a breakthrough,” one of his top health officials called “promising” and other health experts said needs more study before it’s celebrated. The announcement came after White House officials complained there were politically motivated delays by the Food and Drug Administration in approving a vaccine and therapeutics for the disease that has upended Trump’s reelection chances. On the eve of the Republican National Convention, Trump put himself at the center of the FDA’s announcement of the authorization at a news conference Sunday evening. The authorization makes it easier for some patients to obtain the treatment but is not the same as full FDA approval. The blood plasma, taken from patients who have recovered from the coronavirus and rich in antibodies, may provide benefits to those battling the disease. But the evidence so far has not been conclusive about whether it works, when to administer it and what dose is needed. In a letter describing the emergency authorization, the chief scientist for the FDA, Denise Hinton, said: “COVID-19 convalescent plasma should not be considered a new standard of care for the treatment of patients with COVID-19. Additional data will be forthcoming from other analyses and ongoing, well-controlled clinical trials in the coming months.” But Trump had made clear to aides that he was eager to showcase good news in the battle against the virus, and the timing allowed him to head into his convention with momentum. He and aides billed it as a “major” development and used the White House briefing room to make the announcement. Trump also displayed some rare discipline in the evening news conference, sticking to his talking points, deferring to the head of the FDA, Stephen Hahn, and only taking three questions from reporters. The White House had grown agitated with the pace of the plasma approval. The accusations of an FDA slowdown, which were presented without evidence, were just the latest assault from Trump’s team on what he refers to as the “deep state” bureaucracy. White House chief of staff Mark Meadows did not deal in specifics, but said that “we’ve looked at a number of people that are not being as diligent as they should be in terms of getting to the bottom of it.” “This president is about cutting red tape,” Meadows said in an interview Sunday on “This Week” on ABC. “He had to make sure that they felt the heat. If they don’t see the light, they need to feel the heat because the American people are suffering.” During Sunday’s 18-minute press conference, Trump said he thought there had been a “logjam” at the FDA over granting the emergency authorization. He alleged there are people at the FDA “that can see things being held up ... and that’s for political reasons.” Dr. Joshua Sharfstein said the statement, and Hahn’s silence while Trump said it, “was disgraceful.” “The FDA commissioner basically allowed the president to mischaracterize the decision and attack the integrity of FDA employees. I was horrified,” said Sharfstein, a vice dean at John Hopkins University’s school of public health who was a top FDA official during the Obama administration. “This is a promising therapy that has not been fully established,” he said The push on Sunday came a day after Trump tweeted sharp criticism on the process to treat the virus, which has killed more than 175,000 Americans and imperiled his reelection chances. The White House has sunk vast resources into an expedited process to develop a vaccine, and Trump aides have been banking on it being an “October surprise” that could help the president make up ground in the polls. “The deep state, or whoever, over at the FDA is making it very difficult for drug companies to get people in order to test the vaccines and therapeutics,” Trump tweeted. “Obviously, they are hoping to delay the answer until after November 3rd. Must focus on speed, and saving lives!” Earlier this month, Mayo Clinic researchers reported a strong hint that blood plasma from COVID-19 survivors helps other infected patients recover. But it wasn’t considered proof. More than 70,000 patients in the U.S. have been given convalescent plasma, a century-old approach to fend off flu and measles before vaccines. It’s a go-to tactic when new diseases come along, and history suggests it works against some, but not all, infections. The Mayo Clinic reported preliminary data from 35,000 coronavirus patients treated with plasma, and said there were fewer deaths among people given plasma within three days of diagnosis, and also among those given plasma containing the highest levels of virus-fighting antibodies. But it wasn’t a formal study. The patients were treated in different ways in hospitals around the country as part of an FDA program designed to speed access to the experimental therapy. That “expanded access” program tracks what happens to the recipients, but it cannot prove the plasma — and not other care they received — was the real reason for improvement. Administration officials, in a call with reporters Sunday, discussed a benefit for patients who were within three days of admission to a hospital and were not on a respirator, and were given ‘high-titer’ convalescent plasma containing higher concentrations of antibodies. They were then compared to similar patients who were given lower-titer plasma. The findings suggest deaths were 35% lower in the high-titer group. There’s been little data on how effective it is or whether it must be administered fairly early in an illness to make a significant difference, said Dr. William Schaffner, an infectious diseases expert at Vanderbilt University. Aiming to ward off a possible a run on convalescent plasma after the announcement, government officials have been working to obtain plasma and to team with corporate partners and nonprofit organizations to generate interest among previously infected patients to donate. Hahn, who called the development “promising,” said Trump did not speak to him about the timing of the announcement. He said “this has been in the works for several weeks.” But some health experts were skeptical. Benjamin Corb, of the American Society for Biochemistry and Molecular Biology, called it “conspicuous timing.” “President Trump is once again putting his political goals ahead of the health and well-being of the American public,” Corb said. Rigorous studies are under way around the country, comparing similar patients randomly assigned to get plasma or a dummy infusion in addition to regular care. But those studies have been difficult to finish as the virus waxes and wanes in different cities. Also, some patients have requested plasma rather than agreeing to a study that might give them a placebo instead. Former FDA commissioner Dr. Scott Gottlieb dismissed the suggestion of a slowdown. “I firmly reject the idea they would slow-walk anything or accelerate anything based on any political consideration or any consideration other than what is best for the public health and a real sense of mission to patients,” Gottlieb told CBS’s “Face the Nation.” Trump, in news conferences, “has made all kinds of therapeutic suggestions” that have not proven to be supported by science — and are even dangerous, Schaffner said. That includes statements about the possible value of treating COVID-19 patients with ultraviolet light and disinfectant. Trump reportedly also recently became enthusiastic about oleandrin, a plant extract derived from a toxic shrub that scientists immediately warned against. But the president is perhaps best known for his early and ardent embrace of the malaria drugs hydroxychloroquine and chloroquine. Earlier this month, Hahn emphasized that routine evaluation procedures will remain in place to evaluate COVID vaccine candidates. “I think this administration has put more pressure on the Food and Drug Administration than I can remember” ever happening in the past, Schaffner said. “Everybody is just a little bit nervous,” he said."}]}