{"article": [{"url": "https://www.marketwatch.com/story/clover-health-to-go-public-as-spac-merger-values-medicare-advantage-insurer-at-nearly-4-billion-11601998780", "published": 1601984840.0, "headline": "Clover Health to go public as SPAC merger values Medicare Advantage insurer at nearly $4 billion", "body": "Clover Health Investments Corp. announced Tuesday a merger with a “blank-check” company that will take the Medicare Advantage insurer public, while valuing the San Francisco-based company at close to $4 billion. Clover is being acquired by Social Capital Hedosophia Holdings Copr. III IPOC, -0.28%, a special purpose acquisition company (SPAC, or blank check company) which started trading on the New York Stock Exchange in June. Don’t miss: 2020 is the year of the SPAC — yet traditional IPOs offer better returns, report finds. The deal, which implies an enterprise value of $3.7 billion, is expected to provide Clover with up to $1.2 billion in cash proceeds, including a fully committed PIPE (private investment in public equity) of $400 million and up to $828 million of cash held in a trust account of Social Capital. Clover, which was founded in 2013, has more than 57,000 members across seven states. The company said it is the fastest-growing Medicare Advantage insurer in the U.S., among insurers with more than 50,000 members. The company partners with primary care physicians using its software platform, the Clover Assistant, to deliver personalized insights at the point of care. Last week, Clover Health announced a new partnership with Walmart Inc. WMT, +1.00% to make joint Clover-Walmart plans available to half-a-million Medicare eligibles in Georgia. “I launched Clover eight years ago to fix fundamental flaws in our health care system, including unequal access, abysmal customer service and wasteful spending ,” said Clover co-Founder and Chief Executive Vivek Garipalli. ” Our philosophy is that everyone should be able to afford great health care. The Clover team empowers physicians to deliver the best possible outcomes for our members, and the Clover Assistant does just that by delivering vital clinical insights to physicians at the point of care .” The deal is expected to close in the first quarter of 2021. The companies did not provide a proposed ticker symbol that combined company will trade under. Last year, The Wall Street Journal reported that Clover was backed by investors including Sequoia Capital and Greenoaks Capital, and the company is also reportedly backed by Alphabet Inc. GOOGL, +1.82%"}]}