{"article": [{"url": "https://www.marketwatch.com/story/astrazeneca-stock-falls-as-drugmaker-pauses-vaccine-trial-after-volunteers-unexplained-illness-2020-09-09", "published": 1599643280.0, "headline": "AstraZeneca stock falls as drugmaker pauses vaccine trial after volunteer's 'unexplained illness'", "body": "Shares in AstraZeneca fell on Wednesday, after the drugmaker said it has paused late-stage trials of its coronavirus vaccine candidate following an unexplained illness in one of the trials' volunteers. AstraZeneca AZN, +0.63% said it was a \"routine action\" and that unexplained illnesses can happen \"by chance\" in large trial and must be independently reviewed. In an emailed statement, AstraZeneca said: \"As part of the ongoing randomized, controlled global trials of the Oxford coronavirus vaccine, our standard review process was triggered and we voluntarily paused vaccination to allow review of safety data by an independent committee.\" It added that it is working to expedite the review of the single event to minimize any potential impact on the trial timeline. \"We are committed to the safety of our participants and the highest standards of conduct in our trials.\" A report in the New York Times said that the volunteer in the U.K. trial received a diagnosis of transverse myelitis, an inflammatory syndrome that affects the spinal cord. \"However, the timing of this diagnosis, and whether it was directly linked to AstraZeneca's vaccine, is still unknown,\" the NY Times said. AstraZeneca declined to comment on the reported adverse event. Shares in AstraZeneca AZN, +1.16%, which fell 6% in New York in after-hours trading on Tuesday after STAT first reported that the trial had to be stopped, were down 1% in early European trading. Analysts at Citigroup said the risk of a serious adverse event (SAE), potentially vaccine-related, was always \"a high probability event\" in one of the multiple large COVID-19 trials. \"We have limited information on the single SAE aside from it occurred in the UK. trial and the patient is expected to recover albeit almost certainty currently hospitalized,\" the analysts wrote in a research note on Wednesday. \"[Tuesday's] development may negatively impact timelines for other COVID-19 vaccine sponsors. While AZN's current share price is discounting little economic value from COVID-19, we expect an initial negative stock and broader market reaction today in response to the news,\" the analysts added. But they cautioned that they are \"hesitant\" to draw any conclusions in the absence of further information. Analysts at Jefferies said they envisage a short-term stock correction \"which may prove misplaced.\" On Tuesday the chief executives of nine companies, including AstraZeneca, BioNTech BNTX, +1.23%, Johnson & Johnson JNJ, +1.39%, Moderna MRNA, +0.09%  and Novovax NVAX, +0.18%  made a joint pledge to \"stand with science\" on coronavirus vaccines, making clear that they would not move forward with such products before demonstrating their safety and efficacy. AstraZeneca's halt covers studies in the U.S. and other countries, and could derail the plans of President Donald Trump, who reportedly hopes to accelerate approval of the vaccine in a bid to make it available to Americans before November's election. The news comes just two days after U.K. health secretary Matt Hancock said the vaccine, which is being developed in collaboration with the University of Oxford, would \"most likely\" be available in the first few months of 2021. Read:AstraZeneca vaccine 'most likely' to roll out in the U.K. early next year On Wednesday, U.K. Prime Minister Boris Johnson is set to announce new measures aimed at curbing the spread of the virus after a sharp rise in daily coronavirus cases in the country. Since Sunday, there have been 8,396 new cases reported-with 2,460 reported on Tuesday alone, according to government data. There were also 32 deaths reported, though these won't relate to the most recent rise in cases. The new rules will include banning social gatherings of more than six people in England from Sept. 14. The new rule applies to private homes, indoors and outdoors, and places such as bars and cafes, but won't apply to schools and workplaces. Michael Hewson, chief market analyst at CMC Markets U.K., said it was only a matter of time before a setback like this were to happen, given the complexities of trying to get a vaccine to a virus that is still very new. \"We already know from the number of flu vaccines that an immunization program is not a magic bullet, and with the U.K. looking to re-tighten social gathering restrictions from the beginning of next week, investors will have to come to terms with the idea that the path out of the current crisis is likely to be choppy and much more prolonged than previously thought,\" Hewson said. Read:U.K. signs deals with BioNTech, Pfizer, and Valneva for COVID-19 vaccines The U.K. has placed orders for six experimental vaccines, taking its potential stockpile to 340 million doses. In August, the government announced in August that it will buy 90 million doses of potential COVID-19 vaccines from Johnson & Johnson and U.S. drug developer Novavax."}]}