{"article": [{"url": "https://www.marketwatch.com/story/facebook-twitter-are-bracing-for-misinformation-campaigns-after-the-nov-3-vote-2020-08-25", "published": 1598438120.0, "headline": "Facebook and Twitter are concerned about what is going to happen after Election Day", "body": "Securing democracy on social media may be hardest after Americans vote in the presidential election. In what is shaping up as a newfangled nightmare in their efforts to stop election interference, Facebook Inc. FB, +0.26% , Twitter Inc. TWTR, -0.23% and others are as concerned about misinformation and other issues in days after the U.S. election as they are in the months preceding it, including Election Day. “How do we ensure that voters have accurate information?” as election results are counted in the days following the Nov. 3 presidential election, Nathaniel Gleicher, Facebook’s head of security policy, asked during a Tuesday webinar on protecting the upcoming elections. He did not elaborate, but hinted there could be attempts by politically motivated groups to question the legitimacy of votes, including mail-in ballots. President Donald Trump has endlessly claimed without evidence that voting by mail — expected to increase dramatically because of the pandemic — is susceptible to large-scale fraud. (Nearly one in four voters cast 2016 presidential ballots that way.) The specter of a weeks-long debate over the presidential winner in 2020 is drawing some parallels to the 2000 contest that ended up being determined by the U.S. Supreme Court. Yoel Roth, head of site integrity at Twitter, echoed Gleicher’s concerns, but he added that social-media companies are better positioned this time around than four years ago. He said the micro-blogging service is promoting “credible, authoritative information” during political-party conventions, presidential and vice-presidential debates, and election results in November. Gleicher added that Facebook is detecting more “bad actors” than in elections in 2018 and 2016, through a greater understanding of the risk, and through coordination with academia, media, and state and local officials. Their fears come amid concerted efforts by Facebook, Twitter and others to tap the brakes on misinformation concerning the U.S. elections. Facebook, which has repeatedly acknowledged its part in being exploited by foreign and domestic adversaries during the 2016 presidential election with fake news and misinformation, this month launched a Voting Information Center to help users with accurate, easy-to-find information about voting wherever they live. Read more: Facebook hardens digital defense for misinformation ahead of elections The addendum will link to a new voter information hub similar to one about COVID-19 that Facebook says has been seen by billions of people globally. The labels will read, “Visit the Voting Information Center for election resources and official updates.” Facebook expects the voter hub to reach at least 160 million people in the U.S. In July, the company began adding similar links to misleading posts by politicians, including Trump, about voting. Twitter, meanwhile, has said it will roll out measures on new tools, policies and voting resources, as well as expand its “civic integrity policies” to address misrepresentations about mail-in voting. In January, the company created a feature that lets users report voter suppression and misinformation. Among other companies, Snap Inc. SNAP, -0.18% has unveiled a “Voter Registration Mini” tool so users can register to vote directly in Snapchat. It also posted a “Voter Guide” with information about topics such as voting by mail and voter registration. At the same time, states such as California are offering registered voters the chance to follow the status of their ballot until it is counted over online services."}]}