{"article": [{"url": "https://www.marketwatch.com/story/heres-why-a-democratic-clean-sweep-in-novembers-elections-is-rattling-a-sleepy-u-s-bond-market-11602087917", "published": 1602149840.0, "headline": "Hereâ\u0080\u0099s why the prospect of a Democratic clean sweep in Novemberâ\u0080\u0099s elections is rattling a sleepy U.S. bond market", "body": "Volunteers in support of US Democratic presidential candidate Joe Biden and his vice presidential running mate, US Senator Kamala Harris work at the Lackawanna County Democratic Committee headquarters on September 30, 2020 in Peckville, Pennsylvania. (Photo by ANGELA WEISS/AFP via Getty Images) Investors are bracing for a Democratic party clean sweep of the White House and both houses of Congress in Novemberâ\u0080\u0099s elections and thatâ\u0080\u0099s bad news for the U.S. bond market. If Democrats win the presidency, the Senate, and the House it could open the way to a more aggressive fiscal stimulus package not only next year, but more deficit spending also throughout Joe Bidenâ\u0080\u0099s term. Even with interest rates staying near-zero, new bond issuance and more government spending would deliver a one-two punch for a once-sleepy U.S. Treasurys market forced into submission by the Federal Reserveâ\u0080\u0099s loose monetary policy and regular bond-buying. â\u0080\u009cIf you just have one party, it makes it more easy to get something throughâ\u0080\u009d on a fiscal package, said Frank Rybinski, global macro strategist for Aegon Asset Management, in an interview. Once seen as a far-fetched possibility, traders have started to price in a Democratic clean sweep as betting odds and recent polls display a growing lead by Biden over President Donald Trump. A recent CNN poll showed a 14-point gap, and several other polls show Biden leading in key battleground states that Trump had won back in the 2016 election. U.S. Treasurys have stayed on the backfoot this week on such concerns. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% is at 0.77%, around its highest level in four months. The bond-market selloff has largely been driven by higher inflation prospects, reflecting the prospect of government spending is expected over the next few years, not just 2021. The 10-year breakeven inflation rate was back at 1.70%, up from 1.58% on Sept. 28. â\u0080\u009cThe specter of a more forceful fiscal stimulus would imply a couple of things. A much larger budget deficit and higher inflation. When you take all those factors together, you get a forceful reaction in rates,â\u0080\u009d Steven Oh, global head of credit and fixed-income at PineBridge Investments, told MarketWatch. To be sure, deficits have also widened significantly during Trumpâ\u0080\u0099s time in the presidency, a period over which long-term rates fell overall. The budget gap in the fiscal years between 2017 to 2019 amounted to more than $2.4 billion. Another way the risk of a Democratic sweep has manifested in Treasurys trading is the steepening yield curve, or a widening spread between short-term and longer-term bond yields. The gap between the 5-year TMUBMUSD05Y, 0.338% and 30-year bond TMUBMUSD30Y, 1.576% rose to 1.26 percentage points on Tuesday, the largest since December 2016, a month after President Donald Trumpâ\u0080\u0099s election sent long-term bond yields spiraling higher. Even as the economy has continued to recover from business lockdowns earlier this year to combat the coronavirus pandemic, additional fiscal stimulus is needed to forestall permanent job losses and an accelerated pace of bankruptcies, according to Federal Reserve Chairman Jerome Powell. Some argue a stimulus package next year may therefore be too late, but investors say the higher equity prices and rising bond yields inspired by the scenario of a landslide Democratic victory in next monthâ\u0080\u0099s elections may also be related to the reduced likelihood for market volatility following the election. Previously analysts had said the pandemic would cause voters afraid of catching COVID-19 to vote by mail more, creating a risk that the presidential election results would not be immediately known on election day. â\u0080\u009cI think investors care about an outcome in short order. If thereâ\u0080\u0099s a massive blue sweep, what it would do is that we would get the results as early as the night of the election,â\u0080\u009d Max Gokhman, head of asset allocation at Pacific Life Fund Advisors, told MarketWatch. This article was originally published on Oct. 7"}]}