{"article": [{"url": "https://www.marketwatch.com/story/astrazeneca-stock-climbs-on-reports-trump-could-fast-track-covid-19-vaccine-11598264862", "published": 1598270180.0, "headline": "AstraZeneca stock climbs on reports Trump considering fast-tracking COVID-19 vaccine", "body": "AstraZeneca is developing a potential coronavirus vaccine in partnership with the University of Oxford. stringer/Reuters AstraZeneca AZN, +0.63% stock rose more than 2% on Monday, following reports President Donald Trump is considering fast-tracking the drugmaker’s coronavirus vaccine candidate, in a bid to make it available to Americans before the November election. One option being looked at by the Trump administration would see the U.S. Food and Drug Administration award the potential vaccine “emergency use authorization” (EUA) in October, the Financial Times reported. It comes after the regulator issued an EUA on Sunday for convalescent plasma to treat hospitalized coronavirus patients. White House officials had previously complained that politically motivated delays by the FDA in approving a vaccine and treatments were threatening Trump’s re-election chances. AstraZeneca’s potential vaccine is being developed in partnership with the University of Oxford, whose scientists began human trials in April. The team of scientists reported the vaccine produced a “strong immune response” in Phase I/II trial results in July. The vaccine is now in large-scale Phase II/III trials, which includes a trial of 30,000 people in the U.S., a pediatric study and trials in low-to-middle income countries, such as Brazil and South Africa. The company said it did not expect efficacy results until later this year. The U.S. struck a deal with the drug manufacturer in May that would make 300 million doses of the vaccine available to Americans, with the first being delivered in October. The U.S. Biomedical Research and Development Authority gave the project more than $1 billion in funding as part of the deal. A spokesperson for the London-listed pharma giant said: “AstraZeneca has not discussed emergency use authorization with the U.S. government and it would be premature to speculate on that possibility.” CMC Markets analyst David Madden said Trump was “keen to get a grip on the health crisis.” “The drug in question still has a long way to go in terms of development, but the bulls have jumped on the story,” he added. The stock closed 2.1% higher on Monday."}]}