{"article": [{"url": "https://www.marketwatch.com/story/box-shares-jump-14-on-better-than-expected-results-strong-guidance-2020-08-26", "published": 1598516720.0, "headline": "Box shares surge on better-than-expected results, strong guidance", "body": "Box Inc. on Wednesday became the latest tech company to benefit from a digital transformation accelerated by the pandemic. Shares of the enterprise-software company shares surged in after-hours trading following fiscal second-quarter results that topped Wall Street estimates and strong sales guidance. After initially jumping more than 14% in extended trading, Box shares were last up 7.6%. Box BOX, +1.01% reported a loss of $7.65 million, or 5 cents a share, compared with a loss of $36.2 million, or 25 cents a share, in the year-ago quarter. Adjusted earnings were 18 cents a share, compared with 0 cents a share in the year-ago quarter. Revenue improved 11% to $192.3 million from $172.5 million a year ago. “We are obviously super happy with a dramatic improvement in profitability and operating profits, given a very dynamic and complicated [financial and health] climate,” Box Chief Executive Aaron Levie told MarketWatch in a phone call after the results were announced. “But we need to remain laser-focused on the second half of the year, especially with our enterprise suites.” Analysts surveyed by FactSet forecast net income of 12 cents a share on sales of $189.6 million. The company, which provides cloud-based solutions, expects to continue to benefit from a surge in work-from-home users: It raised full-year revenue guidance to a range between $767 million and $770 million, from $760 million to $768 million. Reflecting demand was a 9% increase in second-quarter billings to $188.8 million. Box shares are up 15% this year. The broader S&P 500 index SPX, +0.87% is up 7.7% in 2020. Box’s results come a day after Salesforce.com Inc. CR, +0.17% reported record quarterly results of $5 billion as more businesses connect with customers digitally during the pandemic. Earlier Wednesday, Box shares closed up 7% in regular trading in a big day for tech stocks. Read more: Salesforce stock surges more than 25% for best day ever on ‘blow-out’ quarter"}]}