{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-and-dow-futures-rise-after-trump-push-on-coronavirus-treatments-11598255954", "published": 1598246960.0, "headline": "European stocks and Dow futures rise after Trumpâ\u0080\u0099s push on coronavirus treatments", "body": "FDA Commissioner Stephen Hahn looks on as President Donald Trump announces that the Food and Drug Administration is issuing an emergency authorization for blood plasma as a coronavirus treatment, during a press conference at the White House on August 23, 2020, in Washington, D.C. Pete Marovich/Getty Images European stocks rose on Monday, as drug stocks climbed after President Donald Trump signaled an aggressive stance to push COVID-19 medical treatments to return the economy closer to normalcy. After slipping 0.8% last week, the Stoxx Europe 600 SXXP, +0.55% jumped 1.4%. The French CAC 40 PX1, +0.71% rose 2.2%, the German DAX DAX, +0.06% topped 13,000, and the U.K. FTSE 100 UKX, +0.64% also gained ground. Futures on the Dow Jones Industrial Average YM00, +0.82% rose 216 points. After Trump accused the Food and Drug Administration of trying to sabotage his re-election efforts, the FDA gave emergency approval for the use of blood plasma from recovered coronavirus patients, which hasnâ\u0080\u0099t been proved by scientific trials. The Financial Times said Trump may order the FDA to grant approval to the University of Oxford vaccine to be distributed by AstraZeneca by the same manner. AstraZeneca AZN, +0.63% AZN, +1.16% shares rose 2.9%. â\u0080\u009cThe drug in question still has a long way to go in terms of development, but the bulls have jumped on the story. Keep in mind that stocks were coming from a low base as markets fell on Friday on the back of the largely disappointing manufacturing and services data from France and Germany,â\u0080\u009d said David Madden, market analyst at CMC Markets U.K. While there is no major economic report due for release on Monday, attention is building to the annual Jackson Hole conference, where Federal Reserve Chairman Jerome Powell is expected to outline the central bankâ\u0080\u0099s new inflation strategy. Bank of England Governor Andrew Bailey also will address that conference. Shares of BT Group BT.A, +0.51% climbed 5%, after Sky News reported the telecoms giant has asked Goldman Sachs to update its defense strategy from possible suitors. BT shares have been hurt after slashing its dividend. BT hasnâ\u0080\u0099t yet received any takeover approaches, the report said. Shares of Bunzl BNZL, -0.64% rose nearly 4%, as the distribution and outsourcing company reinstated dividends and announced two acquisitions."}]}