{"article": [{"url": "https://www.marketwatch.com/story/this-season-has-been-relentless-for-the-6th-time-this-year-louisiana-is-bracing-for-another-hurricane-01602098843", "published": 1602084920.0, "headline": "â\u0080\u0098This season has been relentlessâ\u0080\u0099 â\u0080\u0094 for the 6th time this year, Louisiana is bracing for another hurricane", "body": "Stephanie Verrett and Jodie Jones fill sandbags to protect their home in anticipation of Hurricane Delta, expected to arrive along the Gulf Coast later this week, in Houma, La., Wednesday, Oct. 7, 2020. AP Photo/Gerald Herbert MORGAN CITY, La. (AP) â\u0080\u0094 For the sixth time in the Atlantic hurricane season, people in Louisiana are once more fleeing the stateâ\u0080\u0099s barrier islands and sailing boats to safe harbor while emergency officials ramp up command centers and consider ordering evacuations. The storm being watched Wednesday was Hurricane Delta, the 25th named storm of the Atlanticâ\u0080\u0099s unprecedented hurricane season. Forecasts placed most of the state within Deltaâ\u0080\u0099s path. â\u0080\u009cThis season has been relentless,â\u0080\u009d Louisiana Gov. John Bel Edwards said, dusting off what has become his common refrain in 2020 â\u0080\u0093 â\u0080\u009cPrepare for the worst. Pray for the best.â\u0080\u009d So far, Louisiana has seen both major strikes and near misses. The southwest area of the state around Lake Charles, which forecasts show is on Deltaâ\u0080\u0099s current trajectory, is still recovering from Category 4 Hurricane Laura which made landfall on Aug. 27. Nearly six weeks later, some 5,600 people remain in New Orleans hotels because their homes are too damaged to occupy. Trees, roofs and other debris left in Lauraâ\u0080\u0099s wake still sit by roadsides in the Lake Charles area waiting for pickup even as forecasters warned that Delta could be a larger than average storm. New Orleans spent a few days last month bracing for Hurricane Sally before it skirted off to the east, making landfall in Alabama on Sept. 16. Delta is predicted to strengthen back into a Category 3 storm after hitting the Mexican Yucatan Peninsula on Wednesday. The latest National Hurricane Center forecast anticipated landfall in Louisiana on Friday, with the sparsely populated area between Cameron and Vermilion Bay the first place to get hit. Plywood, batteries and rope were flying off the shelves at the Tiger Island hardware store in Morgan City, which would be close to the center of the stormâ\u0080\u0099s path. â\u0080\u009cThe other ones didnâ\u0080\u0099t bother me, but this one seems like weâ\u0080\u0099re the target,â\u0080\u009d customer Terry Guarisco said as a store employee helped him load his truck with the plywood he planned to use to board up his home for the first time of the hurricane season. In Sulphur, just across the Calcasieu River from Lake Charles, Ben Reynolds was deciding whether to leave or not because of Delta. He had to use a generator for power for a week after Hurricane Laura. â\u0080\u009cItâ\u0080\u0099s depressing,â\u0080\u009d Reynolds said. â\u0080\u009cItâ\u0080\u0099s scary as hell.â\u0080\u009d By sundown Wednesday, Acy Cooper planned to have his three shrimp boats locked down and tucked into a southern Louisiana bayou for the third time this season. â\u0080\u009cWeâ\u0080\u0099re not making any money,â\u0080\u009d Cooper said. â\u0080\u009cEvery time one comes we end up losing a week or two.â\u0080\u009d Lynn Nguyen, who works at the TLC Seafood Market in Abbeville, said each storm threat forces fisherman to spend days pulling hundreds of crab traps from the water or risk losing them. â\u0080\u009cItâ\u0080\u0099s been a rough year. The minute you get your traps out and get fishing, its time to pull them out again because something is brewing out there,â\u0080\u009d Nguyen said. Elsewhere in Abbeville, Wednesday brought another round of boarding up and planning, Vermilion Chamber of Commerce Executive Director Lynn Guillory said. â\u0080\u009cI think that the stress is not just the stress of the storm this year, itâ\u0080\u0099s everything â\u0080\u0093 one thing after another. Somebody just told me, â\u0080\u0098You know, weâ\u0080\u0099ve really had enough,â\u0080\u0099â\u0080\u009d Guillory said, On Grand Isle, the Starfish restaurant plans to stay open until it runs out of food Wednesday. Restaurant employee Nicole Fantiny then intends to join the rush of people leaving the barrier island, where the COVID-19 pandemic already devastated the tourism industry. â\u0080\u009cThe epidemic, the coronavirus, put a lot of people out of work. Now, having to leave once a month for these storms â\u0080\u0094 itâ\u0080\u0099s been taking a lot,â\u0080\u009d said Fantiny, who tried to quit smoking two weeks ago but gave in and bought a pack of cigarettes Tuesday as Delta rapidly strengthened. While New Orleans has been mostly spared by the weather and found itself outside Deltaâ\u0080\u0099s cone Wednesday, constant vigilance and months as a COVID-19 hot spot have strained the vulnerable city, which has a long hurricane memory due to the scars from 2005â\u0080\u0099s Hurricane Katrina. The shift in Deltaâ\u0080\u0099s forecast track likely meant no need for a major evacuation, but the cityâ\u0080\u0099s emergency officials were on alert. â\u0080\u009cWeâ\u0080\u0099ve had five near misses. We need to watch this one very, very closely,â\u0080\u009d New Orleans Emergency Director Collin Arnold said. Along with getting hit by Hurricane Laura and escaping Hurricane Sally, Louisiana saw heavy flooding on June 7 from Tropical Storm Cristobal. Tropical Storm Beta prompted tropical storm warnings in mid-September as it slowly crawled up the northeast Texas coast. Tropical Storm Marco looked like it might deliver the first half of a hurricane double-blow with Laura, but nearly dissipated before hitting the state near the mouth of the Mississippi River on Aug. 24. And there are nearly eight weeks of hurricane season left to go, although forecasters at the National Weather Service office in New Orleans noted in a discussion Tuesday of this weekâ\u0080\u0099s forecast that outside of Delta, the skies above the Gulf of Mexico look calm. â\u0080\u009cNot seeing any signs of any additional tropical weather in the extended which is OK with us because we are SO DONE with Hurricane Season 2020,â\u0080\u009d they wrote."}]}