{"article": [{"url": "https://www.marketwatch.com/story/how-china-figured-into-the-harris-pence-debate-11602179945", "published": 1602166040.0, "headline": "How China figured into the Harris-Pence debate", "body": "Moments from the vice-presidential debate Wednesday between Mike Pence and Kamala Harris at Kingsbury Hall at the University of Utah. Robyn Beck/Agence France-Presse/Getty Images BEIJING — While Wednesday night’s vice-presidential debate was universally called “civil” — with many saying the most riveting moment was when a fly perched on Vice President Mike Pence’s head — China emerged as the source of several of the evening’s more heated exchanges. China has been a dominant theme in the campaign for months, with the presidential candidates releasing ads or declarations avowing their hardline stance against the rising economic rival. See: Bolton book adds urgency to Trump bid to depict himself as a China hawk and to paint Biden as a Beijing apologist Capitol Report: Trump asked China’s Xi to buy U.S. farm products to help him win re-election, Bolton book says The country was mentioned two dozen times during the event, with referenced topics ranging from the trade war to the coronavirus to the loss of manufacturing jobs. “On the issue of jobs,” Sen. Kamala Harris said halfway into the debate, “the vice president earlier referred to what he thinks of as an accomplishment — the president’s trade war with China. You lost that trade war,” she said, staring at Pence. “You lost it.” “Lost the trade war with China?” Pence responded moments later. “Joe Biden never fought it. Biden’s been a cheerleader for Communist China over the last several decades.” Moderator Susan Page of USA Today later brought up China as an entire segment of the debate, asking Pence, “How would you describe our fundamental relationship with China? Competitors? Adversaries? Enemies?” As Page was posing her question, the CNN feed of the debate inside China was cut off — as often happens when foreign channels delve into topics that Chinese leaders deem sensitive. This left viewers here in the dark about Pence’s response. Curiously, however, the feed resumed when it was Harris’s turn to respond. It’s unknown why. The country’s vast team of censors closely monitor all forms of media that citizens might see, so it was unlikely an accident. Harris has made stern comments regarding China in the past, and raised the ire of state media after she accepted her nomination, and is not seen as a China dove. “U.S. Democratic presidential candidate Joe Biden’s choice of Senator Kamala Harris as his running mate, who Donald Trump dubbed as the ‘meanest’ U.S. senator, is expected to add points to Biden’s campaign as Harris is a female African American, but her harsh stance on China will likely escalate the ‘who-is-the-toughest-on-China competition’ between the ‘donkey and elephant’ in the 2020 U.S. presidential race,” state-run Global Times wrote just after her nomination, citing “Chinese observers.” Chinese social media barely registered the debate. More popular U.S.-related topics included a hashtag claiming President Trump had promised free medical care for those with coronavirus, based on a statement the president made Wednesday. Capitol Report: Trump calls contracting coronavirus ‘blessing from God’ in latest video, claims Regeneron antibody ‘cocktail’ could be made available to all, for free Another heated exchange came when Harris was asked about the U.S.- China relationship. “The Trump administration’s perspective and approach to China has resulted in the loss of American lives, American jobs and America’s standing,” Harris said as Pence shook his head. “Let’s talk about standing,” Harris continued. “Pew, a reputable research firm, has done an analysis that shows that leaders of all of our formerly allied countries have now decided that they hold in greater esteem and respect Xi Jinping, the head of the Chinese Communist Party, than they do Donald Trump, the president of the United States. This is where we are today, because of a failure of leadership by this administration.” The Pew survey, published Tuesday, found abysmal approval ratings for both Trump and Xi, but indeed found that Western Europeans favored the Chinese leader 19% versus 17% for Trump. Also see: Trump, Xi and Putin are least trusted leaders during pandemic, Pew Research finds; Merkel is most trusted Civil or not, the debate seemed a nonevent for the average Chinese. MarketWatch struggled to find anyone at a busy shopping complex in central Beijing who could name either vice-presidential candidate. One respondent, who gave his name as Kevin and said he reads U.S.-related news on WeChat, said, “All I know is one of them is a woman.” Tanner Brown covers China for MarketWatch and Barron’s."}]}