{"article": [{"url": "https://www.marketwatch.com/story/postmaster-general-louis-dejoy-says-election-mail-will-not-be-slowed-down-2020-08-07", "published": 1596810920.0, "headline": "Postmaster General Louis DeJoy says election mail will not be slowed down", "body": "WASHINGTON (AP) — The U.S. Postal Service says it lost $2.2 billion in the three months that ended in June as the beleaguered agency — hit hard by the coronavirus pandemic — piles up financial losses that officials warn could top $20 billion over two years. But the new postmaster general, Louis DeJoy, disputed reports that his agency is slowing down election mail or any other mail and said it has “ample capacity to deliver all election mail securely and on time” for the November presidential contest, when a significant increase in mail-in ballots is expected. Still, DeJoy offered a gloomy picture of the 630,00-employee agency Friday in his first public remarks since taking the top job in June. “Our financial position is dire, stemming from substantial declines in mail volume, a broken business model and a management strategy that has not adequately addressed these issues,’’ DeJoy told the postal board of governors at a meeting Friday. “Without dramatic change, there is no end in sight,’’ DeJoy said. While package deliveries to homebound Americans were up more than 50%, that was offset by continued declines in first-class and business mail, even as costs increased significantly to pay for personal protective equipment and replace workers who got sick or chose to stay home in fear of the virus, DeJoy said. Without an intervention from Congress, the agency faces an impending cash flow crisis, he said. The Postal Service is seeking an infusion of at least $10 billion to cover operating losses as well as regulatory changes that would undo a congressional requirement that the agency pre-fund billions of dollars in retiree health benefits. The agency is doing its part, said DeJoy, a Republican fundraiser and former supply chain executive who took command of the agency June 15. DeJoy, 63, of North Carolina, is a major donor to President Donald Trump and the Republican Party. He is the first postmaster general in nearly two decades who is not a career postal employee. In his first month on the job, DeJoy said, he directed the agency to vigorously “focus on the ingrained inefficiencies in our operations,’’ including by applying strict limits on overtime. “By running our operations on time and on schedule, and by not incurring unnecessary overtime or other costs, we will enhance our ability to be sustainable and ... continue to provide high-quality, affordable service,’’ DeJoy said. While not acknowledging widespread complaints by members of Congress about delivery delays nationwide, DeJoy said the agency will “aggressively monitor and quickly address service issues.’’ DeJoy’s remarks came as lawmakers from both parties called on the Postal Service to immediately reverse operational changes that are causing delays in deliveries across the country just as big volume increases are expected for mail-in election voting. Democratic House Speaker Nancy Pelosi and Senate Democratic Leader Chuck Schumer said Thursday that changes imposed by DeJoy “threaten the timely delivery of mail — including medicines for seniors, paychecks for workers and absentee ballots for voters — that is essential to millions of Americans.’’ In his remarks to the postal board of governors, DeJoy called election mail handling “a robust and proven process.” While there will “likely be an unprecedented increase in election mail volume due to the pandemic, the Postal Service has ample capacity to deliver all election mail securely and on time in accordance with our delivery standards, and we will do so,” DeJoy said. “However ... we cannot correct the errors of (state and local) election boards if they fail to deploy processes that take our normal processing and delivery standards into account.” DeJoy met with Schumer and Pelosi on Wednesday in a closed-door session that Schumer called “a heated discussion.” Democrats told DeJoy that “elections are sacred” and urged him not to impose cutbacks “at a time when all ballots count,” Schumer said. In separate letters, two Montana Republicans, Sen. Steve Daines and Rep. Greg Gianforte, also urged the Postal Service to reverse the July directive, which eliminates overtime for hundreds of thousands of postal workers and mandates that mail be kept until the next day if distribution centers are running late. And 84 House members — including four Republicans — signed yet another letter blasting the changes and urging an immediate reversal. “Delaying mail service is unacceptable,” Gianforte wrote Thursday to DeJoy. “Do not continue down this road.” In their letter, the 84 House members said it is “vital that the Postal Service does not reduce mail delivery hours, which could harm rural communities, seniors, small businesses and millions of Americans who rely on the mail for critical letters and packages.’’ The letter was led by Rep. Carolyn Maloney, D-N.Y., chairwoman of the House Oversight Committee, who has called DeJoy to testify at a hearing next month. The flurry of letters came as the top Democrat on a Senate panel that oversees the Postal Service launched an investigation into the operational changes. Michigan Sen. Gary Peters, the top Democrat on the Homeland Security and Governmental Affairs Committee, said DeJoy has failed to provide answers about the service delays, despite repeated requests. Democrats have pushed for $10 billion for the Postal Service in talks with Republicans on a huge COVID-19 response bill. The figure is down from a $25 billion plan in a House-passed coronavirus measure. Key Republicans whose rural constituents are especially reliant on the post office support the idea. Trump, a vocal critic of the Postal Service, contended Wednesday that “the Post Office doesn’t have enough time” to handle a significant increase in mail-in ballots. “I mean you’re talking about millions of votes. .. It’s a catastrophe waiting to happen.”"}]}