{"article": [{"url": "https://www.marketwatch.com/story/tech-stocks-and-the-rest-of-the-market-are-both-very-expensive-for-2-completely-different-reasons-11599149071", "published": 1599135740.0, "headline": "Tech stocks and the rest of the market are both very expensive - for 2 'completely different reasons'", "body": "Lionel Bonaventure/Agence France-Presse/Getty Images Everyone talks about the breathtaking run-up in share prices, and of course the valuations of a select handful of high-profile U.S. companies, as the stock market brushes off the economic carnage of the pandemic to scale new records - but the rest of the market is also quite expensive, albeit for a different reason. And that \"bifurcation\" raises a very important question for investors, argued Dan Suzuki, deputy chief investment officer at Richard Bernstein Advisors, in a Thursday note. He observed that since the market's pre-pandemic peak in February, the price-to-earnings multiples of what he dubbed the \"FANMAG\" stocks - Facebook Inc. FB, +0.26%, Amazon.com Inc. AMZN, +3.01%, Netflix Inc. NFLX, +1.43%, Microsoft Corp. MSFT, +2.48%, Apple Inc. AAPL, +1.74% and Google parent Alphabet Inc. GOOG, +1.97% GOOGL, +1.82% have expanded by roughly 20%. Over the same period, the valuations of the rest of the S&P 500 SPX, +0.87% have expanded by a still respectable 15%-plus. \"But these two groups of stocks have gotten more expensive for completely different reasons,\" he noted. \"FANMAG's P/E has risen because their 'P' (prices) has gone up faster than their 'E' (earnings), while the P/E for the rest of the S&P 500 has expanded because 'E' has gone down much more than 'P.'\" (see table below). Suzuki emphasized that valuation metrics are terrible market-timing indicators, but noted that client questions have been on the rise as some valuation measures approach double their historic average. Suzuki said there was \"no doubt\" that high-growth tech stocks had justified their outperformance over the past decade and this year based on their superior profit growth. But investors should now be asking themselves one important question, he said: \"Are the earnings of FANMAG so much more likely to beat the raised expectations (up 10% since February) than the slashed earnings expectations of the rest of the index (down 16%), such that their 100% valuation premium is warranted?\" If the recovery is sustainable, that would require FANMAG's improving secular growth to outweigh the rest of the market's operating leverage, he said, which \"seems like a very pessimistic bet against the recovery. \" Meanwhile, those highflying shares were giving back a chunk of their recent gains in a sharp selloff on Thursday, a day after the tech-heavy Nasdaq Composite COMP, +1.39% and the S&P 500 logged another round of record finishes. The Nasdaq was down over 500 points, or 4%, while the S&P 500 dropped nearly 3%. The Dow Jones Industrial Average DJIA, +0.56% was also dragged down, off around 640 points, or 2.2%."}]}