{"article": [{"url": "https://www.marketwatch.com/story/teen-charged-in-kenosha-shootings-that-killed-2-could-face-life-sentence-2020-08-27", "published": 1598571500.0, "headline": "Teen charged in Kenosha shootings that killed 2; could face life sentence", "body": "KENOSHA, Wis. — Prosecutors on Thursday charged a 17-year-old from Illinois in the fatal shooting of two protesters and the wounding of a third in Kenosha, Wisconsin, during a night of unrest following the weekend police shooting of Jacob Blake. Kyle Rittenhouse faces charges of first-degree intentional homicide, one count of first-degree reckless homicide, one count of attempted first-degree intentional homicide and two counts of first-degree reckless endangerment. He would face a mandatory life sentence if convicted of first-degree intentional homicide, the most serious crime in Wisconsin. The shootings late Tuesday — largely caught on cellphone video and posted online — and the shooting by police Sunday of Blake, a 29-year-old Black father of six who was left paralyzed from the waist down, made Kenosha the latest focal point in the fight against racial injustice that has gripped the country since the May 25 death of George Floyd in Minneapolis police custody. The two men killed were Joseph Rosenbaum, 36, of Kenosha, and Anthony Huber, 26, of Silver Lake, about 15 miles west of the city. A third man was injured. Gaige Grosskreutz, 26, of West Allis, about 30 miles northwest of Kenosha is recovering after surgery, said Bethany Crevensten, another activist. She said Grosskreutz was volunteering as a medic when he was shot and called him “a hero.” Rosenbaum was shot and killed first, after following Rittenhouse into a used car lot, where he threw a plastic bag at the gunman and attempted to take the weapon from him, according to a criminal complaint released by prosecutors Thursday. The medical examiner found that Rosenbaum was shot in the groin and back — which fractured his pelvis and perforated his right lung and liver — and his left hand. He also suffered a superficial wound to his left thigh and a graze wound to his forehead. Rittenouse then ran down the street and was chased by several people shouting that he just shot someone before he tripped and fell, according to the complaint and cellphone footage. Huber, who was carrying a skateboard, was shot in the chest after apparently trying to wrest the gun from Rittenhouse, the complaint said. Grosskreutz, who appeared to be holding a gun, then was shot in the left arm after approaching Rittenhouse, the complaint said. Rittenhouse’s attorney, Lin Wood, said the teenager was acting in self-defense. “From my standpoint, it’s important that the message be clear to other Americans who are attacked that there will be legal resources available in the event false charges are brought against them,” he said. “Americans should never be deterred from exercising their right of self-defense.” Kenosha police faced questions about their interactions with the gunman on Tuesday night. According to witness accounts and video footage, police apparently let the gunman walk past them and leave the scene with a rifle over his shoulder and his hands in the air, as members of the crowd yelled for him to be arrested because he had shot people. Kenosha County Sheriff David Beth explained that the gunman likely slipped away because the scene was chaotic, with lots of radio traffic and people screaming, chanting and running — conditions he said can cause “tunnel vision” among law officers. Video taken before the shooting shows police tossing bottled water from an armored vehicle and thanking civilians armed with long guns walking the streets. One of them appears to be the gunman. Wisconsin Lt. Gov. Mandela Barnes on Thursday decried how Rittenhouse, whom he described as a vigilante accountable to nobody, could walk away while police talked about finding a knife inside Blake’s vehicle after he was shot in the back. He said the fact that Rittenhouse and others came to Kenosha to take matters into their own hands “was completely horrifying.” Rittenhouse, of Antioch, Illinois, about 15 miles (24 kilometers) from Kenosha, was taken into custody Wednesday in Illinois. He was assigned a public defender in Illinois for a hearing Friday on his transfer to Wisconsin. Under Wisconsin law, anyone 17 or older is treated as an adult in the criminal justice system. Kenosha’s streets were calm Thursday following a night of peaceful protests and no widespread unrest for the first time since Blake’s shooting. During demonstrations the previous two nights, dozens of fires were set and businesses were ransacked and destroyed. Kenosha police arrested nine people for disorderly conduct on Wednesday evening after they filled gas cans at a city gas station, the department said Thursday. Riot Kitchen, a Seattle-based nonprofit that serves food at demonstrations, said its members were filling up gas cans for their vehicles and to power a generator for their food truck, and posted a bystander’s video on Twitter that it said showed the arrests. In the video, black SUVs converge on a minivan at an intersection near a gas station. Several officers in heavy vests get out pointing guns at the van. Moments later an officer shatters the passenger side window with a baton, unlocks the van and pulls out a person who does not appear to offer any resistance. Police said they received a tip about “suspicious vehicles” with out-of-state license plates, and arrested the group on the suspicion that they were “preparing for criminal activity.” Police said they found fireworks, gas masks, helmets, heavy vests and “suspected controlled substances” in the vehicles. Blake was shot in the back seven times Sunday as he leaned into his SUV, in which three of his children were seated. State authorities have identified the officer who shot Blake as Rusten Sheskey, a seven-year veteran of the Kenosha Police Department. Authorities said Sheskey was among officers who responded to a domestic dispute, though they have not said whether Blake was part of the dispute. Sheskey shot Blake while holding onto his shirt after officers unsuccessfully used a Taser on him, the Wisconsin Justice Department said. State agents later recovered a knife from the floor on the driver’s side of the vehicle, the department said. State authorities did not say Blake threatened anyone with a knife. Ben Crump, the lawyer for Blake’s family, said Tuesday that it would “take a miracle” for Blake to walk again. He called for the arrest of Sheskey and for the others involved to lose their jobs. State officials have announced no charges. Blake’s father told the Chicago Sun-Times on Thursday that he was upset to learn his son was handcuffed to the hospital bed. “He can’t go anywhere. Why do you have him cuffed to the bed?” said his father, also named Jacob Blake. Online court records indicate Kenosha County prosecutors charged Blake on July 6 with sexual assault, trespassing and disorderly conduct in connection with domestic abuse. An arrest warrant was issued the following day. The Milwaukee County Sheriff’s Office said in a statement that all hospitalized patients in police custody are restrained unless undergoing medical procedures, and that it was working “to ensure a safe and humane environment for Mr. Blake.” At a news conference, Wisconsin Gov. Tony Evers replied “hell yes,” when asked if he was concerned about Blake being handcuffed. “He paid a horrific price already,” the governor said. The governor has authorized the deployment of 500 members of the National Guard to Kenosha, doubling the number of troops in the city of 100,000. Guard troops from Arizona, Michigan and Alabama were coming to Wisconsin to assist, Evers said Thursday. He did not say how many. In Washington, the Justice Department said it was sending in more than 200 federal agents from the FBI, U.S. Marshals Service and the Bureau of Alcohol, Tobacco, Firearms and Explosives. The White House said up to 2,000 National Guard troops would be made available. The Justice Department also announced that the U.S. attorney’s office and FBI would conduct a civil rights investigation into the shooting of Blake, in cooperation with Wisconsin state law enforcement agencies."}]}