{"article": [{"url": "https://www.marketwatch.com/story/new-blow-to-workers-some-companies-are-cutting-401k-contributions-2020-04-02", "published": 1596713480.0, "headline": "New blow to workers: Some companies are cutting 401(k) contributions", "body": "As if a savage market hasn’t inflicted enough damage on retirement accounts held by millions of American workers, many are suffering from an additional body blow: companies hammered by the coronavirus are cutting contributions to employees’ 401(k) plans in a desperate bid to save cash. Read MarketWatch’s coronavirus coverage Hotel giant Marriott MAR, -0.96%, which began the year with some 174,000 workers, started delaying matching contributions earlier this year, saying it would put off payments until September. Now, other companies are announcing similar moves. The Wall Street Journal reports that Amtrak, travel tech firm Sabre Corp. SABR, -1.84% and at least two national retailers—La-Z-Boy LZB, -0.35% and Mattress Firm Inc.—have also announced plans to suspend or cut contributions to employees. They are the first ripple in what could be a tsunami of firms trying to shore up balance sheets, as the economic downturn rapidly worsens. Earlier this week, oil giant ExxonMobil XOM, -1.47% confirmed to Reuters that it would be suspending its contributions to the retirement plans to its U.S. workers starting in October. The move was seen as a way for the company to preserve its dividend. Read: Exxon and Chevron are ‘dividend aristocrats, but for how long? “I think it’s going to be widespread,” says Joy Napier-Joyce, head of the employee benefits practice at the law firm Jackson Lewis. ‘It’s not easy for companies to do this, but they’re looking at their business six to 12 months out and doing what they think is necessary.” She tells MarketWatch that In some cases, companies have had to make painful decisions between maintaining retirement contributions or the company health plan. “They’ve prioritized health care, and retirement plans have been put on the back burner,” she says. Read: More cuts to 401(k) matches are coming Of course, companies aren’t required to make 401(k) contributions at all, but most do, says Pennsylvania-based investment giant Vanguard Group, which works with some 1,900 firms. And those contributions make up a sizable portion of what workers salt away. Rob Austin, director of research at record-keeper Alight Solutions, which manages more than two million 401(k) plans nationwide, tells the Journal that the average account contribution last year was $10,092. Employers contributed 35% of that, or $3,587. From an investment standpoint, cutting back on 401(k) contributions couldn’t come at a worse time. With stock indexes SPX, +0.87% down about a quarter from February highs, employees will have less money to buy low and enjoy greater gains in a potential rebound. Read: Employers start to suspend their 401(k) match And it’s not like most workers have huge 401(k) balances to begin with. For all the talk about the number of Americans whose 401(k) plans crossed into millionaire territory during the now-departed bull market, the big picture is much less cheerful. Another asset management giant, Boston-based Fidelity Investments, said last year that Americans aged 50 to 59—perhaps on the cusp of retirement—had, on average, $179,100 in their 401(k). But the median amount was a far more grim: just $62,700. Median means that half have more than that—but half have less. The picture isn’t much better for the 60 to 69 crowd: the average balance was $198,600, but the median balance was only $300 more: $63,000. These numbers came before 2019’s market surge. It suggests that older workers hoping to scale back or retire outright may have to rethink their plans."}]}