{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-rise-as-investors-juggle-tech-optimism-and-economic-gloom-2020-07-31", "published": 1596194420.0, "headline": "European stocks turn lower as investors juggle tech optimism and economic gloom", "body": "European stocks slipped on the final trading day of the month, as better-than-expected earnings results failed to quell concerns over the global economy. The Stoxx Europe 600 index SXXP, +0.55% fell 0.3% to 358.47 after posting the worst one-day losses in four weeks, a drop of 2.2%. The index is looking at a 0.5% drop in July. Elsewhere, the German DAX DAX, +0.06% was flat, the French CAC 40 index PX1, +0.71% dropped 0.6% and the FTSE 100 index UKX, +0.64% fell 1%. Fresh data from China revealed encouraging factory data, but that was on the heels of troubling U.S. data showing persistently high worker layoffs and a record-breaking 32.9% drop in gross domestic product on an annualized basis in the second quarter. Fresh coronavirus outbreaks in some U.S. states and other countries have forced some businesses to close again. U.S. stocks were trading lower in early action, apart from technology stocks. Data showed a drop in U.S. consumer sentiment for July against a backdrop of rising coronavirus cases rose and expiring federal aid relief programs. “What is probably more worrying for investors appears to be the realization that the negative headlines with respect to a possible second wave will only make it that much more difficult to achieve any sort of prospect of a V-shaped recovery, particularly since the U.S. labor market rebound appears to have come to a halt,” said Michael Hewson, chief market analyst at CMC Markets, in a note to clients. Meanwhile, lockdown fallout pushed French gross domestic product to a record 13.8% drop in the second quarter and Spanish GDP slumped 18.5%. Eurozone GDP fell 12.1%. Read:Spain’s the real sore spot as Europe’s terrible GDP numbers are released Fears of a second wave of the pandemic were rising in the U.K. after the government imposed fresh lockdown restrictions in northern swaths of the country late Thursday. A surge of coronavirus cases due to people not adhering to social distancing rules were to blame for new restrictions, said health secretary Matt Hancock. Spain and Belgium are also battling new outbreaks. Europe’s technology stocks were on the rise Friday, after iPhone maker Apple AAPL, +1.74% and e-commerce group Amazon.com AMZN, +3.01% posted earnings Thursday afternoon that blew out analysts’ expectations. Apart from reporting more than $11 billion in profit, Apple also announced a four-to-one stock split. Social-media giant Facebook FB, +0.26% and Google parent Alphabet GOOGL, +1.82% posted solid, if less jaw-dropping, results. Shares of semiconductor companies ASM International NV ASM, +3.15% and Dialog Semiconductor PLC DLG, +0.66% gained over 3% and 2% each. Nokia Oyj NOK, +2.02% NOKIA, +3.72% shares led the gainers on the Stoxx Europe 600, surging 15% after the Finnish telecoms and tech group lifted full-year guidance on stronger profitability and cash generation. Nokia said sales took a hit of 300 million euros in the second quarter due to the pandemic. British American Tobacco PLC BATS, -0.73% reported a first-half profit rise despite a fall in volume. The cigarette maker’s Kentucky BioProcessing division has applied and is awaiting U.S. Food and Drug Administration approval to start a trial of its Covid-19 vaccine, Kingsley Wheaton, the company’s chief marketing officer, told MarketWatch in an interview. Those shares fell 3%. On the downside, shares of International Consolidated Airlines Group IAG, -3.72% slid 7% after the owner of British Airways and other airlines, swung to a loss of €4.21 billion and announced plans to raise €2.75 billion in a capital raise to boost the struggling company’s balance sheet. IAG also said it was discussing a potential restructuring of the Air Europa acquisition with Globalia to take into account the effect of the pandemic. Shares of Air France-KLM SA AF, -2.79% fell 2.2%. The airline announced it would cut 1,500 additional jobs. Also weighing on the main index were energy shares, with Royal Dutch Shell PLC RDS.A, +0.83% RDS.B, +0.51% dropping 1.6% and BP PLC BP, -0.74% BP, +0.56% down 2.8%."}]}