{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-tumble-1-thursday-as-traders-react-to-fed-policy-2020-09-17", "published": 1600351340.0, "headline": "Gold prices lose 1% as traders react to Fed policy", "body": "Gold futures finished with a loss of 1% Thursday as commodity investors reacted to the monetary policy statement from the Federal Reserve which indicated it intends to keep key interest rates near zero through 2023. Although that scenario may prove bullish for gold over the long term, some experts said that investors may be selling gold because the moves by the Fed weren’t more demonstrably dovish by offering fresh policy measures, deflating some of the enthusiasm for owning bullion over the near term. “The yellow metal rallied into the Fed meeting and those positions quickly unwound as it became clear that the bazooka wasn’t making an appearance,” wrote Craig Erlam, senior market analyst at Oanda. “The Fed probably lived up to the lower end of expectations but all that gets you is a healthy dose of profit taking,” he wrote. On Wednesday, the U.S. central bank signaled it plans to keep a key U.S. short-term interest rate near zero at least through the end of 2023 to help the economy recover from the coronavirus. The Fed’s forecasts for 2023, released for the first time, also show the rate staying near zero from now until at least 2024. Read:The Fed is ‘fighting the last battle,’ and here are the risks to its new strategy On Thursday, December gold GCZ20, +2.17% GC00, +2.17% lost $20.60, or nearly 1.1%, at $1,949.90 an ounce. The precious metal climbed in electronic trade late Wednesday in the immediate aftermath of the Fed decision before retreating. Gold on Wednesday settled with a gain of 0.2%, ending at their highest level since Sept. 1, according to FactSet data. Even so, “with gold failing to overcome $2,000 once again, it may be looking a little bleak in the near term, with the path of least resistance possibly below,” said Erlam. December silver SIZ20, +5.96% SI00, +5.96% declined 38 cents, or 1.4%, at $27.10 an ounce, after gaining less than 0.1% on Wednesday. Over the longer-term investors, a number of experts remain optimistic about gold’s value. Safe-haven gold and silver prices saw selling pressure in Thursday dealings, “despite degraded trader/investor risk appetite” and weaker global stock markets, wrote Jim Wyckoff, analyst at Kitco. “This seemingly conflicting scenario has played out often the past few months, confounding the precious metals market bulls,” he wrote in a Thursday research note. “Still, such situations have also invited metals bulls to step in and buy the dips to keep the overall price uptrends alive in gold and silver,” he said. Beyond the Fed, the Bank of Japan and Bank of England on Thursday kept their benchmark interest rates steady, as expected, but the low level of interest-rates prevailing through much of the developed world should provide support for precious metals moving forward, commodity strategists say. Meanwhile, gold saw a mixed reaction in the aftermath of Thursday morning’s U.S. economic data—moving up, then tapping lows under $1,940 before edging up again. Initial jobless claims filed traditionally through state employment offices fell to 860,000 in the week of Sept. 6 to Sept. 11, from 893,000, the Labor Department said Thursday. The Philadelphia Fed said its gauge of business activity in its region dipped in September, with the regional Fed bank’s index falling to 15 from 17.2 in August. This is the fourth straight positive reading. Among other metals traded on Comex, December copper HGZ20, +1.38% tacked on 0.3% to $3.071 a pound. October platinum PLV20, +3.99% fell 4.4% to $930.90 an ounce and December palladium PAZ20, +2.31% lost 3.4% to $2,335.30 an ounce."}]}