{"article": [{"url": "https://www.marketwatch.com/story/lemonade-logs-best-ipo-debut-of-2020-with-more-than-140-gain-2020-07-02", "published": 1593715700.0, "headline": "Lemonade logs best U.S. IPO debut of 2020 with more than 140% gain", "body": "Lemonade Inc. snagged 2020’s strongest initial public offering debut of a U.S. company as shares of the mobile-based insurance startup became the latest to more than double on their first day of trading. Lemonade LMND, +12.82% shares, which skyrocketed as much as 144% to hit an intraday high of $70.80, finished up 139% at $69.41 on Thursday, following an IPO pricing of $29 a share late Wednesday. That pricing was above an already increased IPO pricing to range of $26 to $28 a share, which topped a previous range of $23 to $26 apiece. That’s the best debut for a U.S.-based company since shares of Inari Medical Inc. NARI, -0.11% closed at $42.51 on May 22, above its pricing of $19 for a 124% gain. American Depositary Receipts of Shanghai-based video-interaction company Agora Inc. did slightly better than Lemonade, jumping 152% on their first day to close at $50.50. Most recently, shares of online used-car seller Vroom Inc. VRM, -0.26% closed at $47.90 on June 9 a day after pricing its IPO at $22, for a 117% gain, and ZoomInfo Technologies Inc. ZI, -2.31% shares closed at $34 on June 4, its first day of trading, after hitting an intraday high of $42 after pricing at $21. Lemonade sold 11 million shares, with up to 1.7 million available to underwriters to cover overallotments. Taking into account those additional shares, Thursday’s close values the company at $3.93 billion. Before the IPO, the company had already raised $480 million through several funding rounds, according to Crunchbase, with a $300 million round in April 2019 led by SoftBank Group Corp. 9984, -1.24% bestowing a “pre-money” valuation of $1.7 billion. Read: Lemonade IPO: 5 things to know about the online insurer While investors piled into the IPO, the offering is not without its skeptics. Hugh Tallents, senior partner at consultancy firm cg42, said the stock is not a long-term play. “The company has well-designed materials that are attracting initial investors and capturing inexperienced Robinhood traders who don’t know to look beyond Lemonade’s positioning as a tech company and subscription business,” Tallents said in emailed comments. “Today’s surge will likely be followed by an equally substantial thunk.” While Lemonade notes it competes against the likes of Allstate Corp. ALL, -0.76% and Travelers Cos. TRV, +0.18%, Tallents said it’s easier for the big companies to reproduce Lemonade’s approach than for Lemonade to scale up to their level. “Ultimately, Lemonade is just another AI-backed, unprofitable fintech company with no real product or value proposition advantage,” Tallents said. For the year, the Renaissance IPO ETF IPO, +1.98% is up 33%, while the S&P 500 index SPX, +0.87% is down 3% and the tech-heavy Nasdaq Composite Index COMP, +1.39% is up 14%."}]}