{"article": [{"url": "https://www.marketwatch.com/story/us-china-trade-envoys-hold-meeting-to-discuss-coordinating-economic-policies-2020-08-24", "published": 1598312180.0, "headline": "U.S., China trade envoys hold meeting to discuss coordinating economic policies", "body": "BEIJING — U.S. and Chinese trade envoys discussed strengthening coordination of their countries’ economic policies during a phone meeting Tuesday, the Ministry of Commerce announced. The announcement gave no details of the meeting held as part of the “Phase 1” truce aimed at ending a tariff war between the two biggest global economies that has disrupted worldwide trade. President Xi Jinping’s government has lobbied Washington since at least 2016 to coordinate macroeconomic policies. Beijing has given no details, but such policies can include economic growth, employment, inflation and trade. Tuesday’s meeting included Vice Premier Liu He, U.S. Trade Representative Robert Lighthizer and Treasury Secretary Steven Mnuchin, the ministry said. “The two sides had a constructive dialogue on strengthening the coordination of the macroeconomic policies of the two countries and the implementation of the ‘Phase 1’ agreement,” a ministry statement said. Under the “Phase 1” agreement signed in January, both governments agreed to suspend additional penalties on each other’s goods in a fight launched by President Donald Trump in 2018 over Beijing’s technology ambitions and trade surplus. That deal has stayed in place despite a growing array of irritants in U.S.-Chinese relations including the status of Hong Kong, the handling of the coronavirus pandemic and accusations of human rights violations in China’s Muslim northwestern territory of Xinjiang. Beijing promised as part of the “Phase 1” agreement to narrow its trade surplus with the United States by purchasing more American farm goods. Trump’s economic adviser, Larry Kudlow, told reporters last week the White House is satisfied with Beijing’s purchases so far. The truce called for talks to be held after six months, but those were delayed due to the coronavirus pandemic. A meeting scheduled for last week was to be held online but was postponed. The two governments have yet to announce plans for face-to-face talks in the next stage of negotiations. The two governments have rolled back some penalties but most of the punitive tariffs imposed on hundreds of billions of dollars of each other’s goods remain in place."}]}