{"article": [{"url": "https://www.marketwatch.com/story/silver-copper-provide-hints-for-the-global-economic-outlook-11601656429", "published": 1601642480.0, "headline": "Silver, copper provide hints for the global economic outlook", "body": "Silver futures posted a third-quarter gain of 26%. patrick hertzog/Agence France-Presse/Getty Images Industrial metals posted gains in the third quarter, with silver up sharply and copper touching its highest prices in over two years, suggesting that the worst of the coronavirus hit to the economy may be over. The third quarter economic backdrop was “very supportive of the overall commodity complex,” including industrial metals, says John Caruso , senior asset manager at RJO Futures. “The ‘reflation’ trade, assisted by the reopening of the economy and record [Federal Reserve] and government stimulus, helped the metals complex gain plenty of fervor” following the second quarter Covid-19-related shutdown and economic collapse. On Sept. 30, silver futures SIZ20, +5.96% posted a 26% climb for the third quarter and copper futures HGZ20, +1.38% finished about 11% higher. “Optimism around the reopening of the global economy, a continued rally in risk-on assets, improving global economic data, and the hopes of additional stimulus helped propel the upward movement in industrial metals,” says Ed Egilinsky, managing director, head of alternatives at Direxion. The recent moves in the metals “certainly support a narrative that the worst of the economic slowdown exacerbated by Covid-19 might be behind us.” At the same time, however, news of President Donald Trump’s Covid-19 diagnosis on Oct. 2 also “adds to the narrative of the ongoing global susceptibility to this virus,” he says. There has already been a reemergence of cases in parts of the world that can “lead to a global slowdown and a ‘risk off’ sentiment,” adversely impacting industrial metals. Silver’s quarterly performance was impressive, especially when compared to a more modest 5.3% rise in gold futures for the same period. Silver “benefitted from both the industrial and investment side of its demand equation” during the quarter, says Maria Smirnova, senior portfolio manager at Sprott Asset Management. Demand for the metal has been rebounding along with the world economy and its appeal as an investment has also climbed, reacting just like gold to declining real interest rates and the U.S. dollar index. Copper, meanwhile, known as a leading indicator of economic health because of its broad use in a range of industrial applications, posted a gain for a second straight quarter. Futures prices settled as high as $3.116 a pound on Sept. 18, the highest since June 2018. “Global growth has seen a sharp recovery off the March lows” on the heels of the “massive monetary and fiscal policies that were put in place by many central banks in early spring to help stabilize the economic slowdown caused by the pandemic,” says Stephanie Link, chief investment strategist and portfolio manager at Hightower Advisors. In the U.S., momentum has been “significant,” especially in housing, auto and manufacturing, she says. “If copper prices go up, that is a signal of better economic health and if it goes down, it indicates the opposite,” she says, adding that the “massive stimulus globally” will lead to better economic growth and “should keep a bid on industrial metals, including copper.” Looking ahead to the fourth quarter, however, Caruso warned of “additional challenges” for the U.S. and global economic growth outlook, including a rise in Covid-19 cases, a “very pivotal” U.S. election, and lack of additional plans for stimulus. “We’re not nearly as bullish on the commodity complex for Q4 as we once were back in June,” and the quarter is likely to be “less friendly” to industrial metals than the quarter just ended, Caruso says. Gold may hold up the best in a “risk-off” scenario in global markets, but industrial metals “may begin to underperform.” Still, “there’s a high probability of a major infrastructure deal pending in Washington,” and that coupled with a “favorable outlook” for the U.S. and Chinese economies should keep demand strong for the industrial metals well into 2021, he says."}]}