{"article": [{"url": "https://www.marketwatch.com/story/pandemic-fears-grip-ma-as-deal-making-slumps-to-23-year-low-in-europe-2020-06-30", "published": 1593509120.0, "headline": "Pandemic fears grip M&A as deal making slumps to 23-year low in Europe", "body": "The number of European deals crashed to the lowest level in 23 years during the second quarter, as the full impact of the pandemic pushed chief executives to preserve their cash levels and refrain from making acquisitions amid fears of a global recession. There was just one deal in Europe over $10 billion in the three months from April to June, when Spain’s Telefónica TEF, -0.51% and U.S. tycoon John Malone’s cable group Liberty Global merged their U.K. operations in a $12.8 billion deal to create a new television and mobile company with a combined value of almost £28 billion ($35bn). In total across Europe, there were just 1,958 mergers and acquisitions deals unveiled in Europe during the second quarter, according to data from Refinitiv, as the continent was forced into lockdown and executives focused on ensuring their companies’ survival during the fallout from the pandemic. This marked the lowest number of deals since the first quarter of 1997. Read:Cash Is King — and M&A Goes MIA The value of deals, $182.9bn, was the lowest second quarter total since 2016. However, this was skewed by one transaction — Unilever’s ULVR, +0.70% move in June to abandon its dual Anglo-Dutch corporate structure and become a single holding company based in the U.K. Refinitiv counted this as a $106.9bn deal. Excluding the Unilever deal, the value of European M&A in the second quarter declined by 62% in 2020 compared with the same period last year. The slump in Europe came amid a broader collapse in global deal making, the value of which plunged by 55% compared with the same period last year. “Before the crisis hit, there were a large number of deals that were due to come to market that were put on hold, so not surprisingly there has been a meaningful slowdown in M&A activity,” said Alison Harding-Jones, head of M&A for Europe, the Middle East and Africa at Citigroup C, +0.47%. Read:Terminating Takeovers: Governments Should Think Twice Before Pulling up the Hatches Globally, deal making fell to an 11-year low during the second quarter, with the total value of deals tumbling to $485.3bn. In the U.S. — the biggest market for M&A deals in the world — the value of deals slipped to a 17-year low to $103.5bn, an 85% decline on the same period last year. That included European food delivery service Just Eat Takeaway’s TKWY, +1.00% $7.4bn takeover of US-based app Grubhub GRUB, +0.83% to create the world’s largest food delivery service outside China. So far this year, the value of deals worldwide dropped 41% after several big-ticket acquisitions were struck in the first quarter just before the pandemic went global. These included insurer Aon’s AON, +0.53% $30.1bn purchase of rival Willis Towers Watson WLTW, +0.17% in March and Morgan Stanley’s MS, -0.34% $13.1bn acquisition of online brokerage E*Trade US:ETFC in February. Conversations in boardrooms have gradually restarted in recent weeks, as companies gain more clarity on the outlook for revenues for the rest of the year. “After the volatility of March and April, clients have got a handle on liquidity and have a clearer view of what the rest of the year is likely to hold. Boards are thinking strategically about what this means for them and our engagement with clients has rarely been higher,” Cathal Deasy, head of Emea M&A at Credit Suisse CS, -0.94%, said. “There have been clear winners from the crisis, either in particular industries or players who are stronger. This confidence has been recognized in the boardroom and people are looking to move forward to capitalize on that strength,” he added. The reemergence of shareholder activists, who had initially retreated from agitating for change to give companies breathing space, could also kick-start M&A. In response to activist threats, companies whose stock-market valuations have fallen in recent weeks have rushed to shore up their takeover defenses and fend off hostile bids by adopting poison pills. These shareholder-rights plans allow existing shareholders to buy preferred shares at a substantial discount, thereby diluting the stake of a bidder and making a takeover more expensive. Read:Companies race to swallow poison pills to thwart hostile bids as stock prices plunge “There has been a huge swing back to activism in the past two weeks, with activists returning to increase the pressure on management. It has been a big driver of M&A activity over the past two years and we expect that to continue to be a theme,” said Dirk Albersmeier, co-head of M&A at J.P. Morgan JPM, -0.57% Megadeals have been scarce since the crisis began. There were just 13 transactions over $10bn so far this year — down by 60% globally. Senior bankers expect this to return as the crisis shakes out sectors. “Looking back to the last financial crisis, there were over a dozen, big transformative deals in the aftermath and we expect the same to happen over the next 12 to 18 months,” J.P. Morgan’s Albersmeier said. “It’s inevitable that we will see some large transactions over the next year,” added Citi’s Harding-Jones. “Companies will need to reposition themselves after COVID-19 when it will perhaps not be entirely clear where growth will come from. Boards will need to respond to that and M&A will be at the forefront.” Private equity could also help boost deal making as they look to deploy the $1.5 trillion of dry powder — or uninvested capital — they have amassed, according to data from capital market company Preqin. Read:Private equity returns are rising. That may not last. “In the initial phase of the crisis, the key focus of private-equity firms was understandably on securing the health and liquidity of their portfolio companies,” said Ina De, co-head of the strategic investors group in Emea at JPMorgan. “But now, it’s clear the focus has rapidly moved to deploying their dry powder. Helping look for opportunities to invest is a top priority and we are spending a great deal of our time identifying appealing assets for our clients to buy.” In the advisory league tables, Citi has gained the most during the first half of the year, leapfrogging rival JPMorgan to sit in third place, up from fifth at the same point last year. It advised on $202.6bn worth of deals, while Goldman Sachs GS, -0.21% maintained its top spot in the first half of 2020, advising on $258.1bn of transactions."}]}