{"article": [{"url": "https://www.marketwatch.com/story/im-the-republican-secretary-of-state-in-washington-and-i-believe-voting-by-mail-works-2020-09-22", "published": 1601457200.0, "headline": "I'm the Republican secretary of state in Washington - and I believe voting by mail works", "body": "There are several reasons why the 2020 general election will go down in history. A global pandemic, continued social unrest and a projected high turnout are just a few. Yet this ongoing debate over in-person vs. mail-in voting shouldn't be one of them. Rather, let's discuss how we can make our elections as accessible as possible, especially now that health concerns have called into question the safety of in-person voting. As an elected secretary of state with decades of experience administering elections, I believe mail-in voting works, and Washington state - which signed vote-by-mail into law in 2011 - is proof that it works. Plus, it's safe and secure. In Washington, vote-by-mail has helped lead to greater voter participation and convenience. Today Washingtonians have unparalleled access to the ballot, and Washington is one of only five states that mails ballots to all voters for all elections. Ballots include a prepaid-postage envelope, and can be returned via U.S. mail or placed into a ballot drop box. There's been much ado about the recent changes at the U.S. Postal Service (USPS) and its ability to deliver election mail on time this fall. Despite the concerns across the country, and the troubling rhetoric from the White House and others in Washington, D.C., we've assured voters in Washington state that election mail will continue to receive priority. The USPS is no stranger to Washington's vote-by-mail system, and has provided outstanding services to voters for more than two decades. We have no reason to believe this commitment to service will cease. In fact, the USPS helped Washington's county election officials successfully conduct a near record-breaking turnout in the Aug. 4 primary. Make no mistake - for mail-in voting to be effective, we must have a fully functioning and adequately funded U.S. Postal Service. I have joined my fellow secretaries of state and countless others on both sides of the aisle in calling on election officials to ensure the Postal Service has the resources it needs in time for the general election. We believe this much-needed funding will enable the Postal Service to continue providing the service and staff necessary to ensure ballots are delivered and returned on time, which in turn will help states promptly certify election results. Read:Federal judge blocks Postal Service changes blamed for slowdown in mail delivery Ballot drop boxes can help alleviate some of these concerns, yet even they have been the subject of question - mostly around location and security. Our experience in Washington, however, proves that drop boxes are secure, convenient and a great way to ensure ballots are submitted on time. For example, Washington voters can visit our secure voter portal, VoteWA.gov, to locate any of the nearly 500 drop boxes statewide. They are available 24 hours a day during election season (from about 20 days prior to the election to 8 p.m. on election night), and they are serviced daily by trained county elections staff that takes the ballots to each respective county facility for processing. Read:Ballot drop boxes are safe, secure and have been used by Republicans and Democrats for decades - so why is Trump bashing them? To ensure security, whether ballots are delivered via drop box or U.S. mail, we always have at least two people handling them at all times. We use tamper-proof seals and logs so that ballots aren't compromised, and we verify the seals to make sure they match the logs. Then staff removes the ballots and places them on a sorter that takes pictures of the voters' signatures and reads the bar codes that include the voters' ID numbers. Since March - back when COVID-19 took hold - I've spoken to secretaries of state and other elections officials across the country about ways to make our elections safer and more accessible, and how we can enhance voter participation in this era of social distancing. Certainly mail-in voting is one of those solutions, yet the question I hear most often is, \"Is voting by mail secure?\" “ Restricting or hindering voter access is inexcusable, and falling short of our commitment to ensuring our elections are safe, secure and accurate is irresponsible. ” Yes. In Washington, we have numerous safeguards. We check ballot signatures against voter-registration records; cross-reference databases nationwide to avoid duplicate registrations; prosecute those who tamper with or mishandle ballots; and more. Also, we conduct rigorous post-election processes such as auditing voting machines and voting precincts. We established a Security Operation Center and two-factor vote authentication, and enhanced security training. Unfortunately, the time is short for states to build the kinds of safeguards and processes Washington and others have made over the years. However, we can use this opportunity to guide states' efforts to ramp up their own systems so that in the future - maybe as soon as 2024 - we won't have these debates that end up distracting and confusing voters. In this day and age, restricting or hindering voter access is inexcusable, and falling short of our commitment to ensuring our elections are safe, secure and accurate is irresponsible. Voters must have options this fall, and they deserve to feel confident about the integrity of our elections. One of those options is voting by mail. A national election - especially one that the whole world is watching, and particularly during a pandemic - is not the time to trumpet conspiracy theories and tweet our way into a frenzy. We cannot sit by and let political posturing undermine how we conduct our elections. It weakens the credibility of our election results. Worse, it erodes people's faith in our democracy. The integrity of our elections mustn't hang in the balance like a dangling chad. The American people are demanding real solutions, not hype and hyperbole. To paraphrase the late Wilford Brimley: \"Mail-in voting - it's the right thing to do.\" Plus, it's safe and secure. Kim Wyman is the secretary of state of Washington. A Republican, she was first elected to the job in 2012 and is now serving her second term. Now read: Indiana's alternative to vote by mail: 28 days of early in-person voting"}]}