{"article": [{"url": "https://www.marketwatch.com/story/wearing-a-mask-to-halt-the-spread-of-coronavirus-has-a-big-impact-on-us-economic-growthand-goldman-has-done-the-math-2020-06-30", "published": 1594028060.0, "headline": "Goldman Sachs has done the math and a national mask mandate to halt the spread of coronavirus would have a big impact on the U.S. economy", "body": "Wearing a mask has become a uniquely hot-button issue in the U.S., which finds itself in the throes of a coronavirus crisis that appears to be drifting out of control by the day. Check out:Watch out for these 3 new coronavirus symptoms However a recent report from Goldman Sachs projects that a lack of a national policy mandating the use of facial coverings throughout the U.S. is delivering an unnecessary hit to the domestic economy. A team of economists lead by Jan Hatzius, chief economist at Goldman, makes the case that a national face-mask mandate could partially substitute for renewed lockdowns, as COVID-19 inflections flare up in a number of southern and western states in the U.S., that would “otherwise subtract 5% from gross domestic product.” (See attached chart): The Goldman crew attempted to explore the link between mask usage to protect against the transmission of droplets that pass on the COVID-19 infection, with the team looking at three key elements: A US regional panel in which we relate the growth rate of infections and fatalities to the introduction of state face mask mandate A large country-level cross section in which we relate cumulative infections and fatalities to the lag between the onset of spread and the introduction of a face mask mandate A smaller country-level panel in which we relate the growth rate of infections and fatalities to lagged mask usage. “We start by showing that a national mandate would likely increase face mask usage meaningfully, especially in states such as Florida and Texas where masks remain largely voluntary to date,” the Goldman researchers write in their 11-page report. Read:Why do so many Americans refuse to wear face masks? Politics is part of it — but only part Their data showed that countries that fail to reach widespread masking usage see both infections and deaths increased: The Goldman report comes as Florida, Texas, California and Arizona—the states that have accounted for much of the recent rise in U.S. cases—imposed new restrictions and rolled back their reopening plans. There are now 10.4 million confirmed cases of COVID-19 world-wide and at least 509,706 people have died, according to data aggregated by Johns Hopkins University. The U.S. continues to lead the world, with a case tally of 2.68 million and death toll of 129,545. On Monday, Tedros Adhanom Ghebreyesus, the head of the World Health Organization, said that pandemic is “not even close to being over.” Read: Barron’s: Everyone Should Wear a Mask. 3 Stocks That Can Benefit. Still, mask wearing in the U.S. has been lax and not uniform. Hugo’s Tacos, a Los Angeles Mexican restaurant, temporarily closed its doors, claiming that its workers were being bullied for enforcing mask-wearing protocols in their restaurants. LA, particularly, has seen an explosion of COVID-19 cases, with about 100,000 cases and more than 3,300 deaths. The Centers for Disease Control and Prevention has expanded its mask guidance to say Americans should wear them in all “public settings when around people outside of their household.” It had previously recommended wearing a mask when at places like grocery stores and pharmacies, when social distancing is difficult to maintain. On Monday, New York Gov. Andrew Cuomo said that President Donald Trump, who had been staunchly opposed to mask wearing, despite the public-health recommendations, should “put a mask on it,” at a news briefing on Monday. “We know it works. We’ve proven that it works in the state of New York,” Cuomo said, calling for the president to issue an executive order that would require people to wear face coverings in public. On Tuesday, presumptive Democratic presidential nominee Joe Biden in a speech in Wilmington, Del., said that the “very top” of the U.S. government should signal decisively that wearing a mask can help to slow the spread of the coronavirus. The president’s view on mask usage is seen undercutting efforts by public-health officials to encourage the use of facial coverings and other personal protective equipment, or PPE, to halt the resurgence of the infection. White House press secretary Kaleigh McEnany on Monday during a news conference said that the president “encourages people to make whatever decision is best for their safety, but he did say to me he has no problem with masks, and to do whatever your local jurisdiction requests of you.” “It’s his choice to wear a mask. It’s the personal choice of any individual as to whether to wear a mask or not,” she said. Concerns about a resurgence of the disease also has created turbulence in the equity markets after the Dow Jones Industrial Average DJIA, +0.56%, the S&P 500 index SPX, +0.87% and the Nasdaq Composite Index COMP, +1.39% all surged from the late-March lows on the back of hope that America had gotten a handle of the outbreak, which bullish investors surmised could help to stoke a so-called V-shaped, or sharp, economic recovery."}]}