{"article": [{"url": "https://www.marketwatch.com/story/eu-set-to-name-countries-from-which-tourists-will-be-welcomed-next-month-and-us-didnt-make-the-cut-2020-06-26", "published": 1593202280.0, "headline": "EU set to name countries from which tourists will be welcomed next month, and U.S. didnâ\u0080\u0099t make the cut", "body": "European Union member states have drawn up a list of 15 countries whose citizens may be allowed to travel again to the bloc starting July 1 that excludes the U.S. but includes Canada, Japan and possibly China, diplomats said. A final decision is yet to be taken on the list, but diplomats said they were reasonably confident it would be approved unchanged. Member states have been asked to approve it by Saturday evening. Market Pulse:EU may bar Americans from visiting because COVID-19 pandemic is not contained in the U.S.: New York Times Also see:Dow closes 730 points lower after spike in coronavirus cases forces Texas and Florida to close bars again, while bank stocks sink on stress tests “ Canada, New Zealand, Australia, South Korea, Japan, Georgia, Uruguay, Morroco, Tunisia, Algeria, Serbia, Montenegro, Rwanda and Thailand are on the list, as is China based on travel reciprocity. Russia joins the U.S. among countries currently deemed too great a risk to European public health. ” The EU has had a broad travel ban in place since mid-March when the bloc closed its external borders to all nonessential travel to contain the spread of the new coronavirus, which has caused tens of thousands of deaths in the region and led to the shutdown of many economies. Coronavirus update:U.S. sets record for new COVID-19 cases in a single day, as Texas becomes first state to reimpose restrictions Two weeks ago, with the health situation much improved, most member states agreed to open their borders to each other by June 15, and the European Commission proposed allowing travelers from outside the region to start coming to the bloc starting July 1. The move was intended in part to boost hard-hit economies by allowing people to come to Europe for the summer tourist season. An expanded version of this report appears at WSJ.com. Trending at WSJ.com: Berlin left cold as Trump threatens to drawn down U.S. troops stationed in Germany Free speech under siege as TV show comes to an end in Hong Kong Read on:Pentagonâ\u0080\u0099s Esper seeks to reassure NATO allies amid Trump threat to reduce troops in Germany"}]}