{"article": [{"url": "https://www.marketwatch.com/story/my-mothers-will-says-her-boyfriend-can-live-in-her-home-after-she-dies-can-i-still-kick-him-out-if-the-deed-is-transferred-to-me-2020-08-12", "published": 1597560260.0, "headline": "My motherâ\u0080\u0099s will says her boyfriend can live in her home after she dies. Can I still kick him out if the deed is transferred to me?", "body": "Dear Moneyist, My mother currently owns a beautiful home in Virginia Beach that is paid for; she inherited a very sizable number of assets from her late husband. In her will, she would like to leave the house to me, but has stipulated that her boyfriend can remain in the house indefinitely, although he will have to pay utilities. The will also stipulates that he cannot have another woman living in the house. This puts me in a sticky spot, as I have no emotional or legal ties to this man. She has known him for less than four years, and they met out of loneliness. Bottom line: I would like to keep this home in the family, but I do not want to deal with removing her boyfriend from the home. Would I have the right to remove him from the home if the deed is transferred to me? Unhappy Daughter Dear Daughter, Before I answer your question: People often meet out of loneliness. Romance is a better reason to fall in love than, say, finance. Isnâ\u0080\u0099t it a nice thing that your mother has found happiness with this man? If they enjoy each otherâ\u0080\u0099s company, make each other laugh, luxuriate in the companionship their partnership affords them, travel the world, or just snuggle up at home, whatâ\u0080\u0099s not to like? Here are your options: You can take your chances that she manages her estate properly and you eventually inherit the house. There are three outcomes to that: 1. Her boyfriend lives out his life there, and you inherit her home after that. 2. She inadvertently leaves him the house by putting him on the deed, and you inherit nothing. Or 3. She messes up her will, and you kick him out. The Moneyist: I filed a joint tax return with my estranged wife because she is a gambler and her finances are a mess. But I got NO stimulus check â\u0080\u0094 what can I do? Alternatively, you could recommend a good estate attorney, tell her you are happy that she is happy, and assure her that you will do your best to ensure she need not worry about what will happen to her boyfriend after sheâ\u0080\u0099s gone. Assuming she then managers her estate according to her wishes, there is one outcome: Her boyfriend lives there, and you inherit her home after he dies or moves out. For that last option, she would likely set up a life estate deed, putting her house in a trust to avoid probate, and make stipulations in the will that you receive it after her boyfriend decides to leave or he dies, whichever comes first. There may be unexpected gift taxes if your motherâ\u0080\u0099s boyfriend terminated the life estate prior to his death and/or financial problems could arise if he failed to maintain the home. The Moneyist: I didnâ\u0080\u0099t get my stimulus check because I owe back child support. Itâ\u0080\u0099s not fair. My stepchildren rely on me â\u0080\u0094 what can I do? Four years together is better than four months or four weeks or four days. Your mother knows this man well enough, and holds him in high enough esteem to ensure he has somewhere to live should she predecease him. You donâ\u0080\u0099t have to like him or be his best friend, or invite him over for supper if he does outlive your mother. But it would be nice if you did decide to respect her wishes."}]}