{"article": [{"url": "https://www.marketwatch.com/story/sonys-new-playstation-5-goes-on-sale-nov-12-for-500-11600295137", "published": 1600281200.0, "headline": "Sonyâ\u0080\u0099s new PlayStation 5 goes on sale Nov. 12 for $500", "body": "The Sony Playstation logo is seen dring the Tokyo Game Show in 2019. AFP via Getty Images Sonyâ\u0080\u0099s upcoming PlayStation 5 videogame console will cost $500 and launch Nov. 12, the company said Wednesday, setting up a holiday battle with Microsoftâ\u0080\u0099s Xbox Series X over whose new console will turn up under more trees this year. Videogame fans have been champing at the bit for the new consoles, and not just because theyâ\u0080\u0099ve been stuck inside since March. The roughly 7-year life cycle of a video game console has been nearing an end. Both predecessor consoles, the Xbox One and the PlayStation 4, launched in 2013. The new consoles promise faster load times, souped up graphics and new games. Sonyâ\u0080\u0099s console is also more expensive this time around; the PS4 launched for $400 in 2013. Sonyâ\u0080\u0099s SNE, +0.56% 6758, +0.38% PS5 will come in two different models â\u0080\u0094 a standard version with an Ultra HD Blu-ray disc drive for $500, and a digital-oriented version with no disk drive that costs $400. While you can still buy games on optical disks, itâ\u0080\u0099s increasingly common for gamers to download them in digital form instead. The U.S., Japan, Mexico, Australia, New Zealand and South Korea will see the console on Nov. 12; everywhere else will get it a week later. In a presentation Wednesday, Sony previewed games including â\u0080\u009cSpider-Man: Miles Morales,â\u0080\u009d which will be available at launch, and a Harry Potter game, â\u0080\u009cHogwarts Legacy,â\u0080\u009d which will be out in 2021. It gave a sneak peak of â\u0080\u009cFinal Fantasy XVI,â\u0080\u009d which will be exclusive to PlayStation, but did not specify when that game will launch. Last week, Microsoft MSFT, +2.48% Â saidÂ its Xbox Series X will cost $500 and debut Nov. 10, just ahead of the holidays. A stripped down version, Xbox Series S, will cost $300 and be available at the same time. Pre-orders begin Sept. 22. New video games at launch include â\u0080\u009cAssassinâ\u0080\u0099s Creed Valhalla,â\u0080\u009d â\u0080\u009cGears Tactics,â\u0080\u009d â\u0080\u009cDirt 5,â\u0080\u009d and â\u0080\u009cWatch Dogs Legion.â\u0080\u009d Nintendo , which makes another popular console, the Nintendo Switch, wonâ\u0080\u0099t have a new model out until next year. But Facebook FB, +0.26% could offer Microsoft and Sony some holiday competition. It said on Wednesday a new version of its wire-free virtual reality headset, the Oculus Quest 2, will start shipping October 13, just in time for the holidays."}]}