{"article": [{"url": "https://www.marketwatch.com/story/trump-says-he-wants-more-stimulus-checks-i-support-actually-larger-numbers-than-the-democrats-2020-07-01", "published": 1593619700.0, "headline": "Trump says he wants more stimulus checks: â\u0080\u0098I support actually larger numbers than the Democratsâ\u0080\u0099", "body": "President Donald Trump on Wednesday said heâ\u0080\u0099s in favor of providing another round of stimulus checks to Americans, as he discussed what could go in another coronavirus aid package that Washington is expected to deliver around the end of this month. â\u0080\u009cI support it, but it has to be done properly,â\u0080\u009d Trump said when asked whether he wanted more direct payments to individuals. â\u0080\u009cI support actually larger numbers than the Democrats, but itâ\u0080\u0099s got to be done properly. We had something where it gave you a disincentive to work last time.â\u0080\u009d The president's remarks came during an interview with Fox Business Network that aired Wednesday. They echo June 10 comments from Treasury Secretary Steven Mnuchin, who said the Trump administration would \"seriously look at whether we want to do more direct money to stimulate the economy.\" The Democratic-run House passed a $3 trillion coronavirus relief bill in May that would provide a second round of direct payments, at $1,200 per family member with a limit of $6,000 per household. The sweeping House measure championed by Speaker Nancy Pelosi was widely viewed as an opening offer in talks about another package with the Republican-controlled Senate and the Trump administration. Related:Next coronavirus aid package to pass Congress by late July, analysts say And see:Pressure builds on Senate Republicans to move in direction of $3 trillion coronavirus relief measure favored by Democrat In the interview with Fox Business, Trump also criticized presumptive Democratic presidential nominee Joe Biden's plans to increase taxes on the wealthy and raise the corporate tax rate to 28% from 21%. â\u0080\u009cIf you do that, youâ\u0080\u0099re going to crash the market,â\u0080\u009d he said. The president spoke as well about wearing face masks during the coronavirus pandemic, after Biden criticized Trumpâ\u0080\u0099s reluctance to wear personal protective equipment. â\u0080\u009cIâ\u0080\u0099m all for masks. I think masks are good,â\u0080\u009d he said. â\u0080\u009cI had a mask on. I sort of liked the way I looked. I thought it was OK. It was a dark, black mask, and I thought it looked OK â\u0080\u0094 looked like the Lone Ranger.â\u0080\u009d See:Biden says â\u0080\u0098very topâ\u0080\u0099 of government should call for mask wearing, in jab at Trump He also reiterated in the interview his often-stated view that, one day, the virus will simply disappear, answering the Fox Business reporterâ\u0080\u0099s question of whether he still believed that: â\u0080\u009cI do.â\u0080\u009d He added, â\u0080\u009cI hope.â\u0080\u009d Fox Business Networkâ\u0080\u0099s parent company, Fox Corp. FOX, -1.45% FOXA, -1.25%, and MarketWatchâ\u0080\u0099s parent, News Corp NWS, -1.29% NWSA, -1.35%, share common ownership. U.S. stocks SPX, +0.87% Â DJIA, +0.56% Â were on track to close mostly higher Wednesday amid improving data on employment and manufacturing, as well as positive developments in a trial for a coronavirus vaccine candidate."}]}