{"article": [{"url": "https://www.marketwatch.com/story/which-is-better-the-tesla-model-s-and-model-3-compared-2020-08-28", "published": 1598591540.0, "headline": "Which is better? The Tesla Model S and Model 3 compared", "body": "Tesla Model S sedan is the car that put Tesla TSLA, +1.89% on the map, and the Model 3 is the vehicle designed to put the company onto the shopping lists of mainstream car buyers. So, we’re going to look at how these two EVs compare when pitted directly against each other. Is the larger and pricier Model S still the standard-bearer for the Tesla brand? Or does the smaller and less-expensive Model 3 make a bigger and better first impression for potential electric car owners? Let’s break things down into five simple categories: Price This should be an easy win for the Model 3, since the compact sedan has a starting price that’s considerably lower than the larger Model S. Check Tesla’s official website and you’ll see the Model 3 starts at $37,990, while the Model S costs a whopping $74,990 for the least expensive variant. Choose the Model S in Performance trim with the optional $8,000 Autopilot package and you’re looking at a starting price that breaks the $100,000 barrier. The Tesla Model 3. iStock The problem for Tesla was when it came to starting production of the entry-level Model 3. For many months, priority was initially given to building the more expensive versions, fitted with a bigger battery pack and all-wheel drive. Start loading options onto a Model 3 and, surprise, the price gap between it and its bigger brother, the Model S, narrows considerably. Also read: Companies are weighing stock splits after Tesla and Apple’s announcement, expert says A range-topping Model 3 with the dual-motor and all-wheel drive setup in Performance trim starts at $54,990. Add AutoPilot and you’re looking at a Model 3 that’s close to $62,990. But credit to Tesla, the standard Model 3 is finally online, according to the Tesla website, if you ordered a Standard version now, delivery would take between 6-8 weeks. As a bonus, no matter which Tesla you choose, you have seven days or 1,000 miles to return the car for a full refund. Considering the entire Model 3 line is finally available, the (belated but deserved) win here goes to Tesla’s entry-level sedan. Winner: Model 3Power If you think electric cars have anything to do with golf-carts, then get behind the wheel of a Tesla. These sedans are fast, no matter if you’re going for a Model 3 or Model S. You’ve probably read about the optional Ludicrous mode that’s available in the Model S, which gives it supercar-like acceleration. Punch the gas pedal and the sprint from 0-60 mph takes only 2.4 seconds, according to Tesla. That’s crazy fast and about equal to the acceleration provided in the multimillion-dollar Bugatti Chiron. A Model 3 in Performance trim is no slouch, however. The same 0-60 run is accomplished in 3.2 seconds and, ironically, it’s the Model 3 that has a slightly higher top speed (162 mph, versus 155 mph in the Model S). But if you’re a speed freak and want the ultimate in near-silent and scary-fast acceleration, the obvious winner is the Model S. Winner: Model S You might like: What it’s like to drive a Tesla Model YRange For many people considering an electric car, this is the single most important factor. What good is an EV if it can’t get you where you need to go, and then back again. When it comes to range, Model 3 offers a wider overall spread. The standard model goes 250 miles, while the Performance clocks in at 299 miles’ range. The Long Range model boasts 322 miles between charges. The Model S Performance boasts a range of 348 miles and the Long Range variant can go 402 miles. Winner: Model SSpace The bigger car is going to provide more interior room, right? You’ll be surprised to learn the Model 3 offers cabin room that’s almost identical to what you get in the larger Model S. In fact, the Model 3 offers slightly more front and rear headroom than the longer and sleeker Model 3. When it comes to front and rear legroom, the two are as close as you can get. Each delivers 42.7 inches of front legroom, with the Model S holding the slightest advantage in rear legroom at 35.4, versus 35.2 in the Model 3. It’s only in hip room and shoulder room where the Model S begins to, ahem, stretch out from its smaller sibling. Also see: These 3 EVs are the lowest cost to own over 5 years In terms of cargo space, the Model S streaks ahead with more than 26 cubic feet of trunk space, opposed to about 15 cubic feet in the Model 3. Credit the larger sedan’s convenient rear hatchback, which opens wide and makes cargo-toting a painless process. There is also the option of two rear-facing jump seats available in the Model S, though these are only suitable for small (and brave) young children. Cabin space is close, but cargo room is a clear win for the bigger car. Winner: Model SNew vs. used: Let’s stir up a little drama by adding a wild card option, a used Model S compared with a brand-new Model 3. We looked at what an average price would be for a 2012 Model S, the sedan’s first year of production. Basing our search in South California and assuming the car has about 55,000 miles, a Fair Market Range according to KBB.com would place the Model S price between $29,000 to $33,000. That’s at least several thousand dollars less than the least expensive Model 3 though admittedly, you have an 8-year-old EV and not a brand-new edition. Still, it’s food for thought if you love the idea of going electric with plenty of power and luxury along for the ride. Read: How to test drive a used car Even though it comes up a bit short on range, Model 3’s similar cabin space to the Model S along with performance that’s still jaw-dropping fast are factors that cannot be overlooked. In the end, with the price being a huge factor for most shoppers, it’s the less expensive Model 3 that’s the better EV. Overall winner: Model 3 Read next:These are your best bets for used hybrids under $10k This story originally ran on KBB.com."}]}