{"article": [{"url": "https://www.marketwatch.com/story/trump-aide-hope-hicks-tests-positive-for-coronavirus-01601599967", "published": 1601593460.0, "headline": "Trump begins â\u0080\u0098quarantine processâ\u0080\u0099 after aide Hope Hicks tests positive for coronavirus", "body": "Counselor to the president Hope Hicks walks from Marine One to accompany President Donald Trump aboard Air Force One as he departs Wednesday at Andrews Air Force Base, Md. Associated Press WASHINGTON â\u0080\u0094 President Donald Trump said Thursday that he and first lady Melania Trump are beginning a â\u0080\u009cquarantine processâ\u0080\u009d as they await coronavirus test results after a top aide he spent substantial time with this week tested positive for COVID-19. Trumpâ\u0080\u0099s comments came after he confirmed that Hope Hicks, one his closest aides, had tested positive for the virus Thursday. Hicks began feeling mild symptoms during the plane ride home from a rally in Minnesota on Wednesday evening, according to an administration official, who spoke on condition of anonymity to disclose private information. She was quarantined away from others on the plane and her diagnosis was confirmed Thursday, the person said. Trump tweeted late Thursday: â\u0080\u009cThe First Lady and I are waiting for our test results. In the meantime, we will begin our quarantine process.â\u0080\u009d Earlier, during a call-in interview with Fox News Channelâ\u0080\u0099s Sean Hannity, Trump said: â\u0080\u009cWhether we quarantine or whether we have it, I donâ\u0080\u0099t know. I just went for a test and weâ\u0080\u0099ll see what happens.â\u0080\u009d It can take days for an infection to be detectable by a test, and it was unclear what Trumpâ\u0080\u0099s quarantine entailed. Minutes before his tweet, the White House distributed a schedule for Friday that showed he planned to go forward with a fundraiser at his Washington, D.C., hotel and a political rally in Sanford, Florida. Hicks, who serves as counselor to Trump, also traveled with Trump to the first presidential debate in Cleveland on Tuesday. She is the closest White House official to Trump to test positive for the virus so far. The positive test is yet another reminder that the coronavirus continues to spread, even as Trump has tried desperately to suggest it no longer poses a danger. Since it emerged earlier this year, Trump, the White House and his campaign have played down the threat and refused to abide by basic public health guidelines â\u0080\u0094 including those issued by his own administration â\u0080\u0094 such as wearing masks in public and practicing social distancing. Instead, Trump has continued to hold campaign rallies that draw thousands of supporters. The virus has killed more than 200,000 Americans and infected more than 7 million nationwide. The White House had not responded earlier to multiple questions about the last time Trump was tested and whether he and other staffers who spent time with Hicks in recent days will be asked to quarantine. Trump traveled to New Jersey on Thursday for a fundraiser despite concerns about Hicksâ\u0080\u0099 health. Trump is 74 years old, putting him at higher risk of serious complications from the virus. He said he expected to have the results back either Thursday night or Friday morning. In a statement, White House spokesman Judd Deere said the president â\u0080\u009ctakes the health and safety of himself and everyone who works in support of him and the American people very seriously.â\u0080\u009d â\u0080\u009cWhite House Operations collaborates with the Physician to the President and the White House Military Office to ensure all plans and procedures incorporate current CDC guidance and best practices for limiting COVID-19 exposure to the greatest extent possible both on complex and when the President is traveling,â\u0080\u009d Deere said. Hicks traveled with the president multiple times this week, including aboard Marine One, the presidential helicopter, and on Air Force One to a rally in Minnesota Wednesday, and aboard Air Force One to Tuesday nightâ\u0080\u0099s first presidential debate in Cleveland. Hicks is one of the presidentâ\u0080\u0099s most trusted and longest-serving aides, having worked as spokesperson for his 2016 campaign. She originally served as White House as communications director, and re-joined the administration this year as an adviser ahead of the election. Her positive test was first reported by Bloomberg News on Thursday evening. She did not respond to a request for comment. Multiple White House staffers have tested positive for the virus, including Katie Miller, Vice President Mike Penceâ\u0080\u0099s press secretary, national security adviser Robert Oâ\u0080\u0099Brien, and one of the presidentâ\u0080\u0099s personal valets. Kimberly Guilfoyle, who is dating Trumpâ\u0080\u0099s oldest son, Donald Trump Jr., tested positive in South Dakota before an Independence Day fireworks show at Mount Rushmore. Still, Trump has consistently played down concerns about being personally vulnerable to contracting COVID-19. â\u0080\u009cI felt no vulnerability whatsoever,â\u0080\u009d he told reporters back in May. After earlier positive cases close to the president, the White House instituted a daily testing regimen for the presidentâ\u0080\u0099s senior aides. Anyone who will be in close proximity to the president or vice president is also tested every day, including reporters. While theÂ Centers for Disease Control and PreventionÂ recommends that people who have been in close contact with someone with COVID-19 quarantine for 14 days, White House staffers are considered essential workers. CDCâ\u0080\u0099s guidelines for exposed essential workers allows them to return to work if they take precautions, including taking their temperature before going into work, wearing a mask at all times and practicing social distancing. Typically, according to the CDC, a person develops symptoms five days after being infected, but symptoms can appear as early as two days after infection or as late as 14 days after infection, and the time range can vary."}]}