{"article": [{"url": "https://www.marketwatch.com/story/trump-reportedly-paid-no-federal-tax-in-10-of-the-last-15-years-75-million-of-americans-pay-no-federal-income-tax-heres-why-2020-09-28", "published": 1601400920.0, "headline": "Trump reportedly paid no federal income tax in 10 of the 15 years before his election. Why 75 million U.S. households pay no federal income tax", "body": "President Donald Trump talks to reporters before leaving the White House October 15, 2018 in Washington, DC. Getty Images President Donald Trump paid just $750 in federal taxes in both 2016 and 2017, and no federal income tax in 10 of the previous 15 years due to massive business losses, the New York Times reported Sunday. The paper said it had acquired more than two decades’ worth of tax-return data from Trump and his business organization, though it does not include his personal tax returns for 2018 and 2019. The Times said more findings from his taxes would be published in the coming weeks. It added that Ivanka Trump “reported receiving payments from a consulting company she co-owned, totaling $747,622, that exactly matched consulting fees claimed as tax deductions by the Trump Organization for hotel projects in Vancouver and Hawaii.” Even while declaring losses, Trump took tax deductions on expenses “including residences, aircraft and $70,000 in hairstyling for television,” the Times reported. On Sunday, Trump tweeted TWTR, -0.23% : “FAKE NEWS!” But what about the rest of Americans? Who pays no federal tax? Approximately 75.5 million or 43.3% of tax-filing households don’t pay any federal income tax, according to estimates from the Tax Policy Center, a nonprofit joint venture by the Urban Institute and Brookings Institution, which are Washington, D.C.-based think tanks. That’s below the 50% peak during the Great Recession. An important caveat: Those people obviously still pay sales tax, property taxes and other taxes. They take personal exemptions, the standard deduction, zero bracket amounts, and more recently, tax credits. But for the most part, they don’t earn enough money, and many people who work and who don’t owe any federal income taxes still give money to Uncle Sam, because money comes out of their paychecks for Social Security and Medicare. “The large percentage of people who don’t owe federal income tax is a feature, not a bug, of the revenue code,” according to the Tax Policy Center. “ Many low- and below-average-income families pay more in payroll taxes than they pay in federal income taxes. ” Many low- and below-average-income families pay more in payroll taxes every year than they pay in federal income taxes, according to Gary Burtless, a senior fellow at the Brookings Institution, a centrist research group founded in 1916. For the most part, he said, the U.S. individual income tax is progressive, with much heavier tax liabilities as you move up the income distribution, and very low or negative income tax liabilities at the bottom of the income distribution. Don Fullerton, a professor of finance at the University of Illinois at Urbana-Champaign, analyzed the Tax Policy Center figures more closely. “Older individuals are much more likely than younger individuals to pay no tax or to receive transfers,” he said. “In fact, they receive the bulk of transfers because of their receipt of Social Security benefits.” He found that 11% of people aged 25 to 55 pay no federal income tax, compared to 48% of those above 55, and 80% of those 75 or older. “Younger individuals are more likely to receive transfers other than Social Security, largely because of unemployment insurance benefits that accrue only to working-age individuals,” Fullerton added. Non-Social Security transfers are received by 11% of those under 60, and 6% of those 60 or older. Those under 60 who receive transfers receive an average of $4,734, while those 60 and older receive average annual benefits of $9,977. “Social Security benefits account for the bulk of the difference,” he said. “The progressive rate structure of the federal income tax system compresses the after-tax income distribution, so it effectively makes the income tax work like insurance,” Fullerton wrote. “We pay a premium — owing more tax in good years — to retain a higher fraction of our income in bad years. How we value this insurance aspect of the income tax system can depend on how often we find ourselves not owing federal income tax.” “ Older individuals are much more likely than younger individuals to pay no tax or to receive transfers. ” “Although substantial shares of the U.S. population do not owe tax or do receive transfers in a given year, only a small subset of those individuals remain in those states,” he added. “Nearly half of individuals not owing tax will pay taxes within two years, and roughly four-fifths have paid tax within 10 years. Of those who receive transfers other than Social Security, almost half do not receive those transfers the following year, and nearly 90% have stopped receiving the transfers six years later.” How do voters feel about this? All but the top 20% of families pay more in payroll taxes than in federal income taxes, according to Treasury Department data cited by the Pew Research Center, a nonpartisan think tank in Washington, D.C. Some 64% of Republicans and Republican-leaning independents say the current U.S. tax system is “very or moderately fair,” while just half as many Democrats and Democratic leaners (32%) view the tax system as fair, the 2019 survey found. Only about a third of Americans approve of Trump’s 2017 tax revamp. “While increasing shares of Democrats say they are bothered ‘a lot’ by the feeling that some corporations and wealthy people do not pay their fair share in taxes (79% of Democrats say this), Republicans’ concerns over these issues have lessened,” Pew said. “Today, 42% of Republicans say they are bothered a lot by the feeling that some corporations do not pay their fair share of taxes (down from 55% in 2015).” Higher-income taxpayers reaped the largest tax savings from the 2017 Tax Cuts and Jobs Act. Their individual tax rates were significantly reduced. But it spelled bad news for those who live in a high-tax state and have a high amount of home-mortgage debt: The tax revamp imposed new limitations on itemized deductions for state and local taxes and home-mortgage interest expense; 32% of those earning less than $30,000 got a tax cut, versus 89.5% of those earning $100,000."}]}