{"article": [{"url": "https://www.marketwatch.com/story/fed-sees-some-pickup-in-economy-but-maintains-dovish-policy-stance-2020-07-29", "published": 1596044840.0, "headline": "Fedâ\u0080\u0099s Powell sees U.S. economy flattening as coronavirus cases rise", "body": "Federal Reserve Chairman Jerome Powell said Wednesday that the sharp acceleration in COVID-19 infections since mid-June is restraining the ability of the economy to recover from the historic contraction in economic activity in the second quarter, when all non-essential businesses shut down. â\u0080\u009cOn balance, it looks like the data are pointing to a slowing in the pace of the recovery. But I want to stress it is too early to say both how large that is and how sustained that will be,â\u0080\u009d Powell said at a press conference.. The path of the U.S. economy is going to â\u0080\u009cdepend significantly on the course of the virus,â\u0080\u009d the Fed said in its policy statement. The measures taken to keep it in check are critical, Powell said. Economists say U.S. GDP likely sank a record 35% in the second quarter after the coronavirus ravaged the economy. â\u0080\u009cThis pandemic and its fallout really represents the biggest shock to the U.S. economy in living memory,â\u0080\u009d the Fed chairman said. Job gains in May and June have reversed about a third of the job losses, and consumer spending has reversed about half of its decline, he said. But reports that companies are cutting wages shows how far the labor market has to go to recover, he added. Powell said that it is likely the economy will need more assistance from the Fed and from Congress. He praised lawmakers for their earlier relief packages. The Fed â\u0080\u009cis committed to using our full range of tools to support the economy and help assure that the recovery from this difficult period will be as robust as possible,â\u0080\u009d Powell said. Drew Matus, chief market strategist for MetLife Investment Management, said Powell had no choice but to be dovish. â\u0080\u009cHis only choice was the reassure the markets that the Fed will do whatever it takes to keep the economy on an even keel. Anything besides that was going to end up backfiring,â\u0080\u009d Matus said in an interview. â\u0080\u009cThe Fed is acting as a firefighter. The fire is already happening. The best thing then can do is to try to limit the damage,â\u0080\u009d he added. Economists are also worried because the latest unofficial data suggests the U.S. economy is sagging again as coronavirus cases increase, mainly in the South and West. In a unanimous decision, the Fed voted to keep its federal funds rates close to zero and again said it would keep interest rates near zero until employment recovers and inflation picks up . The central bank also kept the pace of its asset purchases steady at $120 billion per month. The Fed is buying $80 billion of Treasurys and $40 billion of asset-backed mortgage securities to keep financial markets operating smoothly. Earlier this week, the Fed extended seven emergency lending facilities designed to help markets for three months until the end of the year. Some of these programs crossed a previous red line for the Fed in buying corporate and municipal bonds and lending to medium-sized businesses. Powell said these programs would continue until the Fed was confident the economy was â\u0080\u009csolidly on the road to recovery.â\u0080\u009d Despite a rise in food prices, Powell argued the pandemic is pushing down prices and overall inflation is running well below the Fedâ\u0080\u0099s 2% target. Economists are wondering what the Fed will do if the economy falters again. The â\u0080\u009cbazookaâ\u0080\u009d in the Fedâ\u0080\u0099s tool kit would be to peg longer-term Treasury yields, a policy known as â\u0080\u009cyield-curve controlâ\u0080\u009d that has been used in Japan and Australia. Economists think the Fed could move to adopt incremental policy moves at its next meeting in September, tying any future interest-rate increase to higher inflation. The central bank is also expected to say it will not consider raising short-term interest rates until inflation is seen rising above its 2% target, and might also add a specific period of time to the pledge. The Fed may also change its asset purchases to buy more longer-term securities. These policy steps are seen as incremental by many economists. Markets already expect the Fed to keep interest rates â\u0080\u009clow for longer.â\u0080\u009d Futures markets are pricing in only one 25-basis-point rate hike over the next three years. Powell told reporters the Fed would finish an internal review of its long-term policy goals and strategy â\u0080\u009cin the near future.â\u0080\u009d This review was started in November 2018, but the results have been delayed by the pandemic. The Fed is close to formally adopting a new policy to let inflation run hotter after a period when the rate of inflation remains below the 2% target. This is called setting an â\u0080\u009caverageâ\u0080\u009d inflation target. In the past, the Fed has always â\u0080\u009clet bygones be bygonesâ\u0080\u009d if inflation was low. Economists think the Fed has already informally adopted this approach, but it has not been formally announced. U.S. stocks were slightly higher Wednesday afternoon after the Fed statement and Powellâ\u0080\u0099s remarks. The Dow Jones Industrial Average DJIA, +0.56% Â closed up 160 points."}]}