{"article": [{"url": "https://www.marketwatch.com/story/white-nationalists-find-members-and-support-within-the-u-s-military-11602189955", "published": 1602226520.0, "headline": "White nationalists find members and support within the U.S. military", "body": "Getty Images White nationalist groups, who make up some of the most serious terror threats in the country, find new members and support in the U.S. military. These groups believe that white people are under attack in America. In their effort to create an all-white country where nonwhites do not have civil rights protections, these groups often instigate violent confrontations that target racial and religious minorities. Since 2018, white supremacists have conducted more lethal attacks in the United States than any other domestic extremist movement. The Proud Boys group, for example, whom President Donald Trump addressed in the first presidential debate of 2020, includes veterans and active-duty service members. The group’s members, who are required to engage in physical violence before joining, celebrated Trump’s statement to “stand back and stand by,” considering his call an endorsement of their extremist ideology. While many Americans were appalled at the president’s statement, our research shows that most Americans remain unaware of the connections these groups have to the military. “ More than one-third of service members said white nationalism is a significant threat to the country. ” The links between the U.S. military and white nationalists date back to the 1990s, with many believers seeing military service as an opportunity to hone their fighting skills and recruit others. Our research has found that most Americans don’t know much about the level of white nationalism in the military — though when they find out, they’re worried about it.White nationalists active in the military Researchers do not have reliable data on how many active-duty or veteran service members belong to white nationalist groups. But current military members are increasingly aware of the influence of far-right groups in the ranks. In the most recent poll by Military Times, an independent media organization covering the military, about one-fifth of service members have reported seeing signs of white nationalism or racist ideology in the military community. Those include the casual use of racial slurs and anti-Semitic language, and even explosives deliberately arranged in the shape of a swastika. More than one-third of service members surveyed in 2018 said white nationalism is a significant threat to the country — which is more than were seriously concerned about threats from Syria, Afghanistan or immigration. White nationalists with military experience have committed acts of violence, usually after leaving the service — like the 1994 Oklahoma City bombing and the 2012 mass shooting at a Wisconsin Sikh temple. But active-duty personnel have also been involved in white nationalist activity. In July 2018, a white nationalist was dismissed from the Marine Corps for his involvement in hate groups, including attending the 2017 “Unite the Right” protest in Charlottesville, Virginia. In February 2019, a Coast Guard officer stationed at the agency’s headquarters was arrested and accused of stockpiling weapons as part of a plan to start a race war. In April 2019, a Huffington Post investigation revealed that at least 11 members of various military branches were under investigation for involvement in a white nationalist group. In September 2019, an Army soldier who had expressed support for right-wing extremism was arrested after sharing bomb-making instructions with undercover agents. That same month, an Air Force master sergeant who had been involved with a white supremacist group was demoted but allowed to continue serving. In June 2020, an Army private was charged with terrorism offenses after he leaked sensitive information about his unit to two white supremacist groups, including one that promotes rape and murder as part of its quest for a race war.Congressional concern Lawmakers have been paying attention to the problem. In 2019, the House of Representatives approved a requirement to screen potential military enlistees for signs of white nationalism, as part of the Pentagon’s annual budget allocation. But the Senate removed that provision before sending the bill to the White House for the president’s signature. Military and academic experts agree that violent ideologies in the ranks make it harder for soldiers to form the bonds of trustwith one another that they rely on in combat. If Congress did ban white nationalists from serving in the military, members of white nationalist groups would have a harder time receiving military training. They would also be cut off from an important recruitment network. CHARTAmerican views of white nationalism We wanted to find out how much the public knew about white nationalism in the military, and what they think about it. So in early May 2019, we conducted a demographically representative survey of 1,702 American adults. First, we asked respondents how prevalent they thought white nationalism was in the military. Most — 70% — said there were “some” white nationalists on active duty. Another 20% said there were “many.” Just 10% thought there were none. Then we sought to find out whether people thought it was a problem. To answer that question, we split our respondents into two groups. We asked one half of them whether “white nationalism in the military” is “not a problem,” a “somewhat serious problem” or a “serious problem.” Only 30% of them thought it was a “serious” problem; 47% percent thought it was “somewhat serious” and 23% thought it was “not a problem.” The other half of the respondents got the same question — but before we asked, we gave them the results of a 2018 Military Times poll finding that “22% of service members … have seen evidence of white nationalism or racist ideology within the armed forces.” Having learned that information, 35% of this group said the problem is “serious” — a statistically significant increase of five percentage points. After that, we returned to the first group, and gave them the information from the Military Times poll — and found that 39% of them considered the problem “serious.” This nine-point increase was also statistically significant. We did see an initial political divide among our respondents. People who identified as strong conservatives were less concerned about white nationalism in the military than were strong liberals. But respondents across the political spectrum were willing to update their views, and considered white nationalism a serious problem, once we gave them additional, factual information.The military is a trusted institution The American public is deferential to the military, and trusts it as an institution. White nationalist groups and ideologies get a boost of credibility and legitimacy through their links to the U.S. military. Civilians often take cues from the statements and actions of those who served. Our work suggests that informing the public about service members’ worries about white nationalism in the military could increase concern among both liberals and conservatives about the growing power of these groups. Increased public concern could create an incentive for policymakers to try to combat white nationalist groups, in the military and in society at large. Now read: Michigan ‘Wolverine Watchmen’ militia group plotted to kidnap Gov. Gretchen Whitmer Jennifer Spindel is an assistant professor of political science at the University of New Hampshire in Durham, N.H. Matt Motta is an assistant professor of political science at Oklahoma State University in Stillwater, Okla. Robert Ralston is a postdoctoral fellow in political science at th University of Minnesota in Minneapolis. This was first published by The Conversation — “Americans aren’t worried about white nationalism in the military – because they don’t know it’s there“ .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; margin-bottom: 5px; } .at16units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body.at12units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body .header .wsj-interactive.generic-iframe-embed[name=\"\"], body.at8units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body.at4units .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .header .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; }"}]}