{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-slip-after-seeing-5-month-highs-as-hurricane-churns-in-gulf-of-mexico-2020-08-26", "published": 1598455700.0, "headline": "U.S. oil prices hold ground at highest since March as Hurricane Laura curtails Gulf output", "body": "Oil futures settled on a mixed note Wednesday, with U.S. prices holding ground at their highest finish since early March but global benchmark prices slightly lower, as the U.S. Gulf Coast braced for Hurricane Laura and potential damage to the region’s energy infrastructure. Prices failed to find much support from a fifth straight week decline in U.S. crude inventories amid the uncertainty surrounding the actual impact of the storm on energy supply and demand. There is concern that the oil market “may reverse some of the gains we have seen in demand because of the storm track,” with the potential for power outages and a decline in the number of people driving, Phil Flynn, senior market analyst at The Price Futures Group, told MarketWatch. “Overall the data suggests that demand will bounce back after the storm passes, but right now the trade is taking an abundance of caution,” he said. The Bureau of Safety and Environmental Enforcement on Wednesday estimated that 84.3% of the current oil production in the Gulf of Mexico has been shut in, along with around 60.9% of natural-gas output, unchanged from Tuesday’s estimates. Over 45% of total U.S. petroleum refining capacity is located along the Gulf Coast, according to the Energy Information Administration. Reuters reported Tuesday that refiners that produce gasoline and diesel fuel planned to halt nine facilities that process almost 2.9 million barrels a day of oil, or 14.6% of U.S. total capacity. Laura is now a catastrophic Category 4 hurricane, the National Hurricane Center said Wednesday afternoon. It is forecast to produce an “unsurvivable storm surge,” extreme winds and flash floods over Eastern Texas and Louisiana later on Wednesday. iframe.twitter-tweet { width: 100% !important; } Against that backdrop, “we haven’t seen as big a surge in oil prices as we may have otherwise seen but this isn’t exactly an undersupplied market,” said Craig Erlam, senior market analyst at Oanda, in a note. West Texas Intermediate crude for October delivery CL.1, -1.62% US:CLV20 inched up by 4 cents, or 0.1%, to settle at $43.39 a barrel on the New York Mercantile Exchange. October Brent crude UK:BRNV20, the global benchmark, meanwhile, lost 22 cents, or 0.5%, to $45.64 a barrel on ICE Futures Europe. The big question is will Laura “do lasting damage to refineries or pipelines” and that’s too early to tell, “yet beyond the storm, the U.S. crude picture continues to tighten,” said Flynn. The Energy Information Administration reported Wednesday that U.S. crude inventories fell by 4.7 million barrels for the week ended Aug. 21, marking a fifth weekly decline in a row. Still, at 507.8 million barrels, crude supplies are still about 15% above the first year average for this time of year, the EIA said. The latest weekly change compared with an average forecast by analysts polled by S&P Global Platts for a decline of 4.3 million barrels. The American Petroleum Institute on Tuesday reported a decrease of 4.5 million barrels, according to sources. The EIA data also showed crude stocks at the Cushing, Okla., storage hub edged down by about 300,000 barrels for the week. Gasoline supplies, meanwhile, fell by 4.6 million barrels, while distillate stockpiles rose by 1.4 million barrels. The S&P Global Platts survey had shown expectations for supply declines of 2.7 million barrels for gasoline and 700,000 barrels for distillates. Among the products traded on Nymex, front-month September gasoline US:RBU20 fell 2.5% to $1.3606 a gallon, though it already trades more than 5% higher for the week, while September heating oil US:HOU20 declined 1.2% to $1.2447 a gallon. For the petroleum products, “the most interesting dynamic to watch in the next 48 hours involves power,” said Tom Kloza, global head of energy analysis for the Oil Price Information Service. “Refineries can’t run without electricity, but even more importantly, the Colonial Pipeline might lose pumping stations to power outages.” September natural gas US:NGU20 fell 1.1% to $2.461 per million British thermal units ahead of the contract’s expiration at Thursday’s settlement. The EIA’s weekly update is due out Thursday. On average, analysts expect the data to show a weekly increase of 45 billion cubic feet in natural-gas stocks in storage."}]}