{"article": [{"url": "https://www.marketwatch.com/story/charting-a-solid-august-start-sp-500-nasdaq-stage-latest-summer-breakouts-2020-08-04-121033852", "published": 1596545180.0, "headline": "Charting a solid August start: S&P 500, Nasdaq stage latest summer breakouts", "body": "Editor’s Note: This is a free edition of The Technical Indicator, a daily MarketWatch subscriber newsletter. To get this column each market day, click here. Technically speaking, the U.S. benchmarks’ bigger-picture backdrop remains bullish amid a solid August start. On a headline basis, the Nasdaq Composite has rallied to record highs — reaching previously uncharted territory — while the S&P 500 has tagged five-month highs, breaking from a jagged July range. Before detailing the U.S. markets’ wider view, the S&P 500’s US:SPX hourly chart highlights the past two weeks. As illustrated, the S&P has started August with a breakout, reaching five-month highs. The breakout point (3,280) pivots to support. Slightly more broadly, the prevailing upturn punctuates a successful late-July test of the range bottom (3,200). Constructive price action amid last week’s jagged backdrop. Meanwhile, the Dow Jones Industrial Average US:DJIA remains the weakest major benchmark. In fact, the index briefly ventured under its 50- and 200-day moving averages across consecutive sessions to conclude July. Shaky price action. The strong August start places the Dow on firmer technical ground atop former resistance (26,600). This area pivots to first support. Against this backdrop, the Nasdaq Composite US:COMP is off to a strong August start. In the process, the index has reached all-time highs, gapping atop the July peak. Tactically, the breakout point (10,840) roughly matches the top of the gap (10,831), an area that pivots to support. Widening the view to six months adds perspective. On this wider view, the Nasdaq has gapped to previously uncharted territory at all-time highs. The breakout punctuates a jagged July range, and confirms the prevailing uptrend. On further strength, a near- to intermediate-term target projects to the 11,460 area. Conversely, a notable floor matches the breakout point (10,840) and the top of the gap. Looking elsewhere, the Dow Jones Industrial Average remains weaker, though it has survived a test of two headline inflection points: The 200-day moving average, currently 26,225. The 50-day moving average, currently 26,172. Consider that the 50-day moving average (in blue) has underpinned the Dow’s recovery attempt, effectively defining the May, June and July lows. The prevailing upturn preserves a bullish intermediate-term bias. On further strength, significant resistance spans from 27,071 to 27,102, levels matching the July and March peaks. Also recall that a golden cross — or bullish 50-day/200-day moving average crossover — will likely signal mid-week. As always, the crossover is frequently a lagging indicator. Meanwhile, the S&P 500 has extended its uptrend, reaching five-month highs. The prevailing upturn punctuates a jagged late-July range. Tactically, the breakout point (3,280) pivots to near-term support. The bigger picture Collectively, the major U.S. benchmarks remain in divergence mode — each index is doing different things — though the summer price action has been constructive, on balance. Each benchmark’s intermediate-term bias remains bullish. Moving to the small-caps, the iShares Russell 2000 ETF US:IWM has flatlined, asserting a tight range atop the 200-day moving average. To reiterate, resistance matches the July peaks, an area spanning from 149.35 to 150.20. A retest is underway early Tuesday. Follow-through atop resistance would confirm the prevailing uptrend, positioning the small-cap benchmark to build on its decisive mid-July breakout. Similarly, the SPDR S&P MidCap 400 ETF has asserted a tight range atop the 200-day moving average. Recall that a golden cross — or bullish 50-day/200-day moving average crossover — will likely signal next week. Separately, the 50-day moving average has underpinned the recovery attempt. Looking elsewhere, the SPDR Trust S&P 500 US:SPY has extended to five-month highs. This week’s modest follow-through resolves a recent bull-bear stalemate at resistance matching the June peak. Placing a finer point on the S&P 500, the index has started August with a break to five-month highs. Tactically, the breakout point (3,280) pivots to near-term support. Delving deeper, the S&P has registered consecutive weekly lows closely matching the range bottom (3,200). Constructive price action. More broadly, the early-August upturn punctuates a “higher high” versus the July peak, extending the prevailing uptrend. Tactically, more distant overhead matches the top of the February gap (3,328). On further strength, an intermediate-term target projects from the former range to the 3,360 area. Beyond technical levels, the S&P 500’s intermediate-term bias remains comfortably bullish. All trends point higher, based on today’s backdrop, pending signs of a bearish pulse. Also see: Charting a (bullish) holding pattern, S&P 500 digests break to 5-month highs.Tuesday’s Watch List The charts below detail names that are technically well positioned. These are radar screen names — sectors or stocks poised to move in the near term. For the original comments on the stocks below, see The Technical Indicator Library. Drilling down further, the iShares Transportation Average US:IYT is acting well technically. The group initially spiked three weeks ago, rising atop the 200-day moving average on increased volume. More immediately, the early-August upturn — fueled by a volume spike — places five-month highs within striking distance. Follow-through atop the June peak (179.88) would mark a “higher high” confirming the group’s uptrend. Tactically, trendline support closely tracks the 50-day moving average, and is rising toward the 200-day moving average, currently 171.25. A breakout attempt is in play barring a violation. Initially profiled July 15, Costco Wholesale Corp. US:COST has effectively flatlined, but remains well positioned. The shares started July with a breakout, knifing atop trendline resistance to all-time highs. The subsequent tight range is a continuation pattern, positioning the shares to build on the early-July spike. Tactically, the prevailing range bottom (322.00) is closely followed by gap support (319.70). A sustained posture higher signals a firmly-bullish bias. More broadly, the shares are well positioned on the three-year chart, rising from an extended test of the 50-week moving average. Note that the company will report its July sales Wednesday. FireEye, Inc. US:FEYE is a mid-cap security software vendor coming to life. Late last month, the shares knifed to five-month highs, rising after the company’s second-quarter results. The subsequent pullback has been orderly, placing the shares near the top of the gap (14.74) and 8.4% under the July peak. Delving deeper, the breakout point closely matches the 200-day moving average, currently 13.90. The prevailing rally attempt is intact barring a violation. Initially profiled April 20, Teradyne, Inc. US:TER has returned 41.4% and remains well positioned. As illustrated, the shares have rallied to the range top, rising to challenge 20-year highs, the best levels since July 2000. An intermediate-term target projects to the 96.00 area on follow-through. Conversely, the 50-day moving average has marked an inflection point, and is rising toward the range bottom (82.70). The prevailing uptrend is intact barring a violation. Finally, Amkor Technology, Inc. US:AMKR is a well positioned mid-cap chip equipment name. Late last month, the shares knifed to 13-year highs, rising after the company’s strong quarterly results. The ensuing pullback has been fueled by decreased volume, placing the shares 14.8% under the July peak. Tactically, the breakout point (13.00) pivots to well-defined support. A sustained posture higher signals a firmly-bullish bias. Editor’s Note: This is a free edition of The Technical Indicator, a daily MarketWatch subscriber newsletter. To get this column each market day, click here.Still well positioned The table below includes names recently profiled in The Technical Indicator that remain well positioned. For the original comments, see The Technical Indicator Library. Company Symbol* (Click symbol for chart.) Date Profiled Utilities Select Sector SPDR XLU Aug. 3 Jabil, Inc. JBL Aug. 3 Southern Copper Corp. SCCO Aug. 3 CyberArk Software, Ltd. CYBR July 31 AMAG Pharmaceuticals, Inc. AMAG July 31 Agco Corp. AGCO July 31 Boston Scientific Corp. BSX July 30 Penn National Gaming, Inc. PENN July 30 At Home Group, Inc. HOME July 30 Procter & Gamble Co. PG July 29 SPDR S&P Metals & Mining ETF XME July 28 iShares MSCI South Korea ETF EWY July 28 HCA Healthcare, Inc. HCA July 28 Toll Brothers, Inc. TOL July 27 Landstar System, Inc. LSTR July 27 HP, Inc. HPQ July 24 Advanced Micro Devices, Inc. AMD July 23 AstraZeneca AZN July 23 Best Buy Co., Inc. BBY July 22 iShares Europe ETF IEV July 21 Sonos, Inc. SONO July 21 Fastenal Co. FAST July 21 Materials Select Sector SPDR XLB July 20 Caterpillar, Inc. CAT July 20 Monster Beverage Corp. MNST July 20 Palo Alto Networks, Inc. PANW July 20 iShares U.S. Home Construction ETF ITB July 17 Progressive Corp. PGR July 17 Livongo Health, Inc. LVGO July 17 Roku, Inc. ROKU July 16 Catalent, Inc. CTLT July 16 Cognizant Technology Solutions, Inc. CTSH July 16 Health Care Select Sector SPDR XLV July 16 Consumer Staples Select Sector SPDR XLP July 15 Home Depot, Inc. HD July 15 Costco Wholesale Corp. COST July 15 Kirkland Lake Gold, Ltd. KL July 15 MaxLinear, Inc. MXL July 14 Air Products & Chemicals, Inc. APD July 14 Consumer Discretionary Select Sector SPDR XLY July 13 Alphabet, Inc. GOOGL July 13 Sony Corp. SNE July 13 Eldorado Gold Corp. EGO July 13 SunPower Corp. SPWR July 13 Ceridian HCM Holding, Inc. CDAY July 10 Neurocrine Biosciences, Inc. NBIX July 10 Amgen, Inc. AMGN July 9 Zendesk, Inc. ZEN July 9 D.R.Horton, Inc. DHI July 9 Taylor Morrison Home Corp. TMHC July 9 LGI Homes, Inc. LGIH July 8 Walmart, Inc. WMT July 8 J.B. Hunt Transport Services, Inc. JBHT July 8 Akamai Technologies, Inc. AKAM July 6 Verisk Analytics, Inc. VRSK July 6 Big Lots, Inc. BIG July 1 Tandem Diabetes Care, Inc. TNDM July 1 Dell Technologies, Inc. DELL June 30 Zebra Technologies Corp. ZBRA June 30 Yeti Holdings, Inc. YETI June 25 Arrowhead Pharmaceuticals, Inc. ARWR June 25 Danaher Corp. DHR June 24 RH RH June 24 Hologic, Inc. HOLX June 23 First Solar, Inc. FSLR June 22 SPDR S&P Biotech ETF XBI June 19 Lowe’s Companies LOW June 19 Fiverr International, Ltd. FVRR June 19 Chegg, Inc. CHGG June 18 Fastly, Inc. FSLY June 18 Etsy, Inc. ETSY June 17 Skyworks Solutions, Inc. SWKS June 16 Lululemon Athletica, Inc. LULU June 16 Carvana Co. CVNA June 10 Williams-Sonoma, Inc. WSM June 9 HubSpot, Inc. HUBS June 8 Square, Inc. SQ June 8 United Parcel Service, Inc. UPS June 5 Micron Technology, Inc. MU June 5 Xilinx, Inc. XLNX June 4 KLA Corp. KLAC June 4 FedEx Corp. FDX June 3 SPDR S&P Retail ETF XRT June 3 Datadog, Inc. DDOG June 1 iShares MSCI Japan ETF EWJ May 29 SolarEdge Technologies, Inc. SEDG May 29 Splunk, Inc. SPLK May 28 Microchip Technology, Inc. MCHP May 27 Synopsis, Inc. SNPS May 27 SSR Mining, Inc. SSRM May 27 Twilio, Inc. TWLO May 26 Take-Two Interactive Software, Inc. TTWO May 26 Lam Research Corp. LRCX May 26 Marvell Technology Group, Ltd. MRVL May 26 Cisco Systems, Inc. CSCO May 21 Cree, Inc. CREE May 20 Applied Materials, Inc. AMAT May 19 Alteryx, Inc. AYX May 18 iShares Silver Trust SLV May 15 Agnico Eagle Mines, Ltd. AEM May 15 Agilent Technologies, Inc. A May 15 Halozyme Therapeutics, Inc. HALO May 15 Wix.com, Ltd. WIX May 13 Extreme Networks, Inc. EXTR May 13 Qualcomm, Inc. QCOM May 12 Zynga, Inc. ZNGA May 12 Kinross Gold Corp. KGC May 11 Avalara, Inc. AVLR May 8 Salesforce.com, Inc. CRM May 8 Facebook, Inc. FB May 7 Spotify Technology S.A. SPOT May 5 CrowdStrike Holdings, Inc. CRWD May 4 Inphi Corp. IPHI Apr. 29 Qorvo, Inc. QRVO Apr. 29 Old Dominion Freight Line, Inc. ODFL Apr. 29 Dollar General Corp. DG Apr. 28 AngloGold Ashanti Ltd. AU Apr. 28 Cadence Design Systems, Inc. CDNS Apr. 27 ServiceNow, Inc. NOW Apr. 27 Five9, Inc. FIVN Apr. 24 Chewy, Inc. CHWY Apr. 24 Tesla, Inc. TSLA Apr. 23 Shopify, Inc. SHOP Apr. 23 iShares Nasdaq Biotechnology ETF IBB Apr. 21 Teradyne, Inc. TER Apr. 20 Electronic Arts, Inc. EA Apr. 20 VanEck Vectors Semiconductor ETF SMH Apr. 17 Coupa Software, Inc. COUP Apr. 17 Veeva Systems, Inc. VEEV Apr. 17 American Tower Corp. AMT Apr. 17 Okta, Inc. OKTA Apr. 16 Target Corp. TGT Apr. 16 Netflix, Inc. NFLX Apr. 14 VanEck Vectors Gold Miners ETF GDX Apr. 14 Invesco QQQ Trust QQQ Apr. 14 Ciena Corp. CIEN Apr. 6 Seattle Genetics, Inc. SGEN Apr. 6 DocuSign, Inc. DOCU Apr. 3 Zscaler, Inc. ZS Apr. 3 RingCentral, Inc. RNG Mar. 30 Activision Blizzard, Inc. ATVI Mar. 30 Regeneron Pharmaceuticals, Inc. REGN Mar. 30 Apple, Inc. AAPL Mar. 27 Nvidia Corp. NVDA Mar. 27 Dexcom, Inc. DXCM Mar. 27 Amazon.com, Inc. AMZN Mar. 26 Stamps.com, Inc. STMP Mar. 26 Quidel Corp. QDEL Mar. 26 Domino’s Pizza, Inc. DPZ Mar. 20 Kroger Co. KR Mar. 19 Zoom Video Communications, Inc. ZM Mar. 19 iShares MSCI Emerging Markets ETF EEM Mar. 19 Newmont Corp. NEM Jan. 13 Atlassian Corp. TEAM Jan. 7 SPDR Gold Shares ETF GLD Jan. 2 Teledoc Health, Inc. TDOC Nov. 1 Microsoft Corp. MSFT Feb. 22 * Click each symbol for current chart."}]}