{"article": [{"url": "https://www.marketwatch.com/story/here-is-walmarts-list-of-the-hottest-toys-for-the-holidays-2020-09-03", "published": 1599146660.0, "headline": "Here is Walmartâ\u0080\u0099s list of the hottest toys for the holidays", "body": "Talk about Christmas creep. Walmart Inc. is trying to get a jump on holiday shopping, as it unveiled Thursday its list of what it believes will be the â\u0080\u009chottest toysâ\u0080\u009d this year. The unveiling comes as industry experts have suggested consumers may spend less during the holidays this year, but are also likely to get started a lot earlier, given uncertainties over how the COVID-19 pandemic will play out in the coming months. Also read: Target talks Christmas in July with holiday shopping announcement. With families spending more time at home amid the pandemic, this yearâ\u0080\u0099s list reflects a focus on trends including educational toys and those that help kids burn energy outside. â\u0080\u009cMore than any year before, weâ\u0080\u0099re seeing strong interest across toys that stem from digital platforms, like kid influencer-created toys, interactive and educational toys, screen-free indoor entertainment and toys for active outdoor play,â\u0080\u009d said Steve Ronchetto, the retail giantâ\u0080\u0099s vice president of toys. Walmartâ\u0080\u0099s stock WMT, +1.00% Â , which fell 2.3% in afternoon trading Thursday, has rallied 21% so far this year, while the SPDR S&P Retail exchange-traded fund XRT, +0.05% Â has advanced 12% and the Dow Jones Industrial Average DJIA, +0.56% Â has slipped 1.2%. Walmart also announced Thursday the launch of Walmart Wonder Lab, which allows consumers to virtually â\u0080\u009cunbox,â\u0080\u009d test and play with toys. The list of 36 toys, of which 13 will be sold exclusively at Walmart stores, was compiled by what the retailer said are the â\u0080\u009creal experts, kids.â\u0080\u009d They are ranked within six different categories: From the TV to the toy room Toy Price Frozen 2 - Magic in Motion Elsa Doll $59.00 Blueâ\u0080\u0099s Clues & You Peek-A-Boo $24.84 Paw Patrol Dino Patroller $59.00 The Child Bop It* $14.88 LEGO Death Star Final Duel* $89.00 Star Wars Dark Saber $29.84 Walmart (*Walmart exclusive) High-tech gadgets Toy Price Sensory FX ASMR Mega Bar* $19.88 VTech KidiZoom Creator Cam $59.00 Instax Mini 7S Seafoam Green* $59.00 onn. 8â\u0080\u009d Tablet Pro* $99.00 Walmart (*Walmart exclusive) Interactive Play Toy Price Disney Princess Vanity $49.88 Gotta Go Flamingo $28.82 FurReal Mama Josie Kangaroo Pet $67.00 Squeakee $58.00 My Life As Hello Kitty Dolls* $35.00 Barbie Farm Barn Playset* $74.00 L.O.L Surprise OMG Remix Dolls $34.88 (available mid-September) Walmart (*Walmart exclusive) Surprise Toys Toy Price The Animal $34.88 (available Oct. 1) Treasure X - Sharks Treasure $19.87 Hatchimals Crystal Flyers $29.77 Na! Na! Na! Ultimate Surprise $69.00 L.O.L. Surprise Clubhouse Playset $49.88 Ryanâ\u0080\u0099s World Vending Machine* $39.82 Walmart (*Walmart exclusive) Energy-burning outdoor toys Toy Price Jetson Mars Light Up Kick Scooter* $39.94 Semi-Truck and Trailer Ride On* $249.00 Jetson Plasma Light Up Hoverboard* $148.00 Razor Black Label E100 Electric Scooter* $128.00 Nerf Fortnite DG* $29.97 Walmart (*Walmart exclusive) Screen-free indoor entertainment Toy Price Tic Tac Tony* $9.97 Kinetic Sand Sandwhirlz $19.82 Spark Puppy Piano* $19.82 Little People Launch & Loop Raceway $49.44 VTech Helping Heroes Fire Station $39.82 Hot Wheels Sky Crash Tower $44.68 Beyblade Burst Rise Hypersphere Set $49.67 Megalodon Storm RC $43.88 Walmart (*Walmart exclusive)"}]}