{"article": [{"url": "https://www.marketwatch.com/story/impossible-foods-gets-200-million-in-funding-2020-08-13", "published": 1597490840.0, "headline": "Impossible Foods gets $200 million in funding", "body": "Impossible Foods Inc. on Thursday said it has landed $200 million in funding — the latest parry in its battle with Beyond Meat Inc. The company’s previous investment round of $500 million in mid-March was one of the largest investment rounds for a food tech startup. The maker of plant-based meat products has now raised about $1.5 billion since its founding in 2011. It said it intends to use the funds to expand research and development programs, accelerate manufacturing, increase its retail presence, and develop next-generation, plant-based products. “Overall, the theme here is about unprecedented demand for our products,” Impossible Chief Financial Officer David Lee told MarketWatch in a phone call Thursday. “There are great signs that our product is being accepted by meat eaters, who are voting with their stomachs.” (Impossible says nine out of 10 customers are meat eaters.) Lee declined to discuss timing about a possible initial public offering but added, “We believe in the need for every option to fund this global operation.” The company has been in serious ramp-up mode to get its products in front of consumers. Since March, its presence at grocery outlets has soared 60 times to 9,000 stores that include Kroger Co. KR, +0.46% and Walmart Inc. WMT, +1.00% Additionally, Impossible products are sold through Starbucks Corp.’s SBUX, +0.53% 15,000 stores. In June, Impossible launched a direct-to-consumer e-commerce site with free delivery for orders over $75 in the continental United States. Beyond BYND, +0.80% , too, has raised the profile of its Beyond Burgers, which are sold at Walmart’s warehouse chain Sam’s Club, and at BJ’s Wholesale Club Holdings Inc. BJ, +1.19% . Last summer, Beyond Meat began selling at Costco Wholesale Corp. COST, +1.19% ."}]}