{"article": [{"url": "https://www.marketwatch.com/story/new-bull-market-in-stocks-could-last-three-years-and-rise-another-30-veteran-strategist-says-2020-08-31", "published": 1598861000.0, "headline": "New bull market in stocks could last three years and may produce another 30% in gains, veteran strategist says", "body": "Federal Reserve Chairman Jerome Powell on Aug. 27 gave stock investors the green light to throw more money at the market. In a virtual speech to the annual Jackson Hole monetary policy conclave, Powell declared that the central bank would allow inflation to rise above 2% if that followed a period of persistently low inflation, essentially abandoning its longtime target. Powell only codified what the Fed has been doing since COVID-19 sent the U.S. economy into the deepest recession since the Great Depression: Cutting interest rates to zero and engaging in trillions of dollars’ worth of securities purchases to shore up shaky markets, and stimulate the economy and job creation. That speech and continued hopes for a vaccine and an economic recovery pushed the S&P 500 Index SPX, +0.87% and Dow Jones Industrial Average DJIA, +0.56% higher that day and again Friday. One leading market guru thinks we’re just getting started. Sam Stovall, chief investment strategist for CFRA in New York, says that, based on history, the new bull market that emerged from the February-March COVID bear market could last three years. By one model, he says, that could take the S&P 500 30% higher, which would put it around 4,500 points in 2023. (Stovall has not published an official projection for 2023.) Stovall, who’s been a market analyst and strategist for over three decades, bases his projection, in part, on sunny forecasts from his firm’s economists, who see a V-shaped economic recovery on the horizon. (He says they called the 32.9% second-quarter GDP decline almost to the percentage point.) Speaking to me last week before Powell’s remarks, Stovall explained how rock-bottom interest rates shape his forecast. “Because of the intrinsic value model, using very low interest rates to forecast share prices, the lower the interest rates, the higher the projected price is,” he told me. “So, S&P 500 earnings divided by the Moody’s investment grade bond yield is basically pointing to a near 30% appreciation from here.” In fact, CFRA looks for a 30% earnings increase for S&P 500 companies, while mid-cap earnings should rise 45% and small-caps’ earnings more than double in 2021. That’s why, despite the worst unemployment since the Great Depression, the stock market is soaring. “The stock market is looking across the valley, which is looking at the second half of this year, all of 2021,” Stovall said. Still, Americans can be forgiven if they can’t fathom why there’s such a huge gap between the real world in which they live and Planet Wall Street. So, what’s good to own now? The table below shows S&P 500 growth stocks outpacing value by an astonishing 24 percentage points from the March lows through Friday, Aug. 21. S&P 500 sector Percent change - Feb. 19 through March 23, 2020 Percent change - March 23 through Aug. 21, 2020 Consumer Discretionary -31.9% 70.1% Information Technology -31.2% 67.1% S&P 500 Growth -31.4% 62.2% Materials -36.4% 61.0% Industrials -41.8% 56.4% S&P 500 -33.9% 51.8% Energy -56.0% 48.8% Communication Services -28.6% 45.4% Health Care -28.1% 42.7% Real Estate -38.0% 40.1% S&P 500 Value -37.0% 38.1% Financials -43.0% 37.3% Utilities -35.9% 31.9% Consumer Staples -24.3% 31.4% Source: S&P Dow Jones Indices, CFRA Research “Going back to 1980, in the six months before declines of 10% or more, and six months after declines of 10% or more, growth beat value 80% of the time.” Growth looks expensive and value cheap, Stovall says. “If you’d simply plotted the percentage point differential between S&P Growth minus S&P Value, you are now more than two standard deviations above the mean,” he told me. “Last time we were there was just before the tech bubble burst.” “So, you’ve got to say to yourself, I know all about that ‘trend is your friend’ stuff, but it can’t be my friend forever,” he continued. People, including me, have been calling for value stocks’ comeback forever, too. But as the table below shows, the FAANMG stocks — Facebook, Amazon, Apple, Netflix, Microsoft and Alphabet (parent of Google) — haven’t been the only games in town. S&P 500 sub-industry Percent change - Feb. 19 through March 23 Percent change - March 23 through Aug. 21 Household Appliances -56.4% 181.5% Copper -55.5% 166.4% Homebuilding -54.3% 147.6% Computer & Electronics Retail -44.3% 124.9% Technology Hardware, Storage & Peripherals -31.4% 115.4% Distributors -53.5% 99.1% Home Improvement Retail -36.4% 89.0% Diversified Support Services -46.3% 88.4% Diversified Chemicals -47.5% 84.4% Trading Companies & Distributors -34.7% 84.1% Auto Parts & Equipment -46.5% 83.4% Automotive Retail -38.2% 83.1% Sources: S&P Dow Jones Indices, CFRA Research Housing-related sub-industries have far and away performed best in the new bull market, as appliances, copper and homebuilding have shown the biggest rebounds. Computer and electronics retail, led by Best Buy, and home-improvement retail, dominated by Home Depot, also have nearly doubled already. The work-at-home, stay-at-home economy has clearly been the big winner, but Stovall says the easy money has been made in those early cycle recovery stocks. What’s next? “Those groups that are improving in terms of relative performance, that had been underperformers for a while, are materials and industrials, which would be consistent with the expectation that the economy is likely to be improving over the coming year,” he said. “They also would benefit because they have pretty negative correlations with the dollar, because they’re so international in nature.” He also thinks developed market international stocks and emerging markets (which I’ve hated forever and still do) are attractively valued, with relative price-to-earnings ratios one standard deviation below the mean. In the short term, Stovall is looking for a pullback, possibly around Election Day, and such declines have averaged 8% in the past. That, he says, would represent a buying opportunity, because he thinks this bull market will be around for quite a while. Howard R. Gold is a columnist for MarketWatch. His newsletter is called “Sheer Heresy.” Follow him on Twitter @howardrgold."}]}