{"article": [{"url": "https://www.marketwatch.com/story/feds-beige-book-sees-increase-in-economic-activity-but-nothing-near-pre-pandemic-levels-2020-07-15", "published": 1594826900.0, "headline": "Fed's Beige Book sees increase in economic activity but nothing near pre-pandemic levels", "body": "The outlook: Economic activity increased in almost all districts, but remained well below where it was prior to the COVID-19 pandemic, according to the Federal Reserve's Beige Book report released Wednesday. Business contacts remain highly uncertain about the outlook for the U.S. economy, as it was unclear how long the crisis would last. What happened: While employment increased, there was also talk about new layoffs across the U.S. And firms that had retained workers with the help of the government's Paycheck Protection Program said the strength of the economy would determine whether they can avoid layoffs. Consumer spending was led by a rebound in vehicle sales and home improvement. Manufacturing moved up but from a very low level. Demand for services was very weak. Big picture: The Beige Book was more positive than the prior report in May but there was no sense that the economy is out of the woods. Signs of strain: â\u0080¢ Announcements of permanent and temporary mass layoffs rose in Minnesota and Wisconsin. Energy firms in North Dakota were not going to \"save\" employees as they had during the downturn five years ago. â\u0080¢ There were scattered reports of wage cuts and pay freezes across the country. â\u0080¢ The farm economy remained weak across the country. Government aid programs could provide a moderate degree of support to farm credit conditions. In California, farmers reported strong crop yields and subdued demand, hitting profit margins. â\u0080¢ Most contacts in Dallas don't expect U.S. crude oil production to return to pre-COVID levels until at least mid-2021. â\u0080¢ In Los Angeles, restaurants had started hiring but were anticipating new furloughs due to a resurgence in the coronavirus. Unemployment in film and television production remained at historic highs. What are they saying? \"Although the early days of the \"reopening\" were quite strong and quite encouraging, that pace of activity is not sustainable. Getting back to any sense of a normal pace of economic activity is going to take a long time, and there is an enormous amount of slack that the economy needs to absorb before any sort of policy response is warranted,\" said Tom Simons, economist at Jefferies. Market reaction: U.S. stocks were broadly higher on Wednesday with the S&P 500 index SPX, +0.87%  up 29 points or almost 1% in afternoon trading."}]}