{"article": [{"url": "https://www.marketwatch.com/story/private-sector-adds-428000-jobs-in-august-adp-says-but-gain-below-forecast-2020-09-02", "published": 1599036980.0, "headline": "ADP says private sector added 428,000 new jobs in August", "body": "The numbers: Private-sector companies added or regained 428,000 jobs in August, ADP said Wednesday, but the modest gain won’t dispel worries about a slowdown in hiring over the summer as the U.S. recovers from the coronavirus. Wall Street economists had forecast an increase of 1 million private-sector jobs, according to Econoday. See ADP report The increase in hiring last month topped a revised 212,000 increase in July, the giant payroll processor said. Initially ADP had reported that just 167,000 new jobs were created in that month. The economy has recouped fewer than half of the 20 million-plus jobs lost in the early stages of the coronavirus pandemic. What’s worse, a number of companies such as American Airlines AAL, +0.34% and MGM MGM, -2.59% have recently announced new layoffs with their businesses still struggling months after the pandemic began. Read:Fed’s Clarida says new inflation-fighting strategy has roots in failure of old approach And: Brainard says Fed should shift to more aggressive strategy to boost the economy What happened: Large companies boosted payrolls by 298,000, midsized companies by 79,000 and small companies by 52,000. Hiring rose the fastest in hotels, restaurants, retail, education, health care and professional businesses. The only segment of the economy to lose jobs again was information — media, public relations and the like. See: MarketWatch Economic Calendar Big picture: The ADP report suggests the economic recovery ran into stiffer resistance for the second month in a row, but it’s not always a reliable bellwether. The report, for instance, has shown fewer new jobs created in each of the past four months than the government’s initial estimate. The Labor Department on Friday is likely to report the U.S. created 1.2 million new jobs in August, according to economists polled by MarketWatch. Yet what does seem clear from ADP and other employment barometers is that companies are bringing workers back more slowly compared to earlier in the summer. Or not at all. Read:Manufacturers grow fourth straight, ISM finds, but they aren’t bringing every job back Some hard-hit industries such as travel and accommodation are even laying off employees again with federal aid drying up and most customers staying away. That will make it even harder for the economy to return to normal. See:MarketWatch Coronavirus Recovery Tracker What they are saying?”The U.S. labor market recovery continued at a fairly sluggish pace in August,” said senior economist Andrew Grantham of CIBC Economics. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% were set to open higher in Wednesday trades."}]}