{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-under-pressure-as-u-s-fiscal-stimulus-disarray-boosts-dollar-11602074878", "published": 1602081740.0, "headline": "Gold ends at a more than one-week low", "body": "David Gray/Agence France-Presse/Getty Images Gold futures ended Wednesday at their lowest in just over a week, stretching losses seen a day earlier. President Donald Trump announced that he had halted talks with congressional Democrats over another fiscal stimulus package Tuesday afternoon, prompting gold prices to extend losses in electronic trading from their settlement level. Trump then later called for action on a number of individual aid measures. “The abrupt breakdown of the stimulus package talks shifted the bias downward” for gold and silver on Tuesday, and that bias remains down, analysts at Zaner Metals wrote in a daily report. For now, “expect moderate volatility as the White House battles with Congress toward what is now likely to be a ‘smallish’ stimulus’,” they said. The markets have been “anticipating a stimulus deal for many weeks and a smallish agreement could leave the markets flat-footed.” “We suggest that aggressive/short term traders be prepared to sell a rally generated by an agreement,” the Zaner analysts said, with those type of traders possibly becoming “sellers of December gold on a rally back above the downtrend resistance line from the August high at $1,923.10.” On Wednesday, December gold GCZ20, +2.17% GOLD, +2.86% dropped $18, or 0.9%, to settle at $1,890.80 an ounce. That was the lowest most-active contract settlement since Sept. 28, according to FactSet data. Gold prices saw little reaction Wednesday afternoon in electronic trading, holding at around $1,889.80 shortly after the release of minutes from the Federal Reserve’s September meeting at which policymakers worried about what would happen if fiscal aid would decrease or disappear. December silver SIZ20, +5.96%, meanwhile, ended the regular session down 2 cents, or 0.1%, to $23.896 an ounce. Gold futures settled lower on Tuesday and then extended losses in electronic trading after Trump accused Democrats of negotiating in bad faith and said he would halt talks on a stimulus package until after the November election, sparking a sharp selloff in stocks. A few hours later, Trump said he would be willing to sign piecemeal aid measures, including $1,200 stimulus checks to households and relief for airlines and small businesses. Analysts said that despite the change in course, prospects for any sort of fiscal relief ahead of the election appeared unlikely, adding to deflationary pressures. And while gold is often viewed as a haven during periods of uncertainty, a rise by the U.S. dollar squelched demand for the yellow metal. “At first glance, the fact that no new measures to stimulate the economy will be implemented in the near future should really have been good news for gold,” said Daniel Briesemann, commodity analyst at Commerzbank, in a note. “However, the price slide in late trading is due to the appreciating U.S. dollar, which apparently was in demand as a safe haven — despite everything — directly after Trump’s comments.” A stronger dollar can be a drag on gold an other commodities priced in the unit, making them more expensive to users of other currencies. The ICE U.S. Dollar Index DXY, -0.58% was little changed Wednesday after rising as much as 0.4% in the previous session. The index, a measure of the dollar against a basket of six major rivals, is down 0.2% for the week. Among other Comex metals, December copper HGZ20, +1.38% tacked on nearly 2.4% to $3.033 a pound. January platinum PLF21, +3.84% settled at $866.80 an ounce, down 0.4%, and December palladium PAZ20, +2.31% shed 0.4% to $2,382.10 an ounce."}]}