{"article": [{"url": "https://www.marketwatch.com/story/kraft-heinz-stock-upgraded-twice-with-analysts-upbeat-about-ongoing-business-transformation-11600286425", "published": 1600356260.0, "headline": "Kraft Heinz stock upgraded twice with analysts upbeat about ongoing business transformation", "body": "Kraft Heinz is undergoing a business transformation that includes a changes to the product lineup. Getty Images Kraft Heinz Co. was upgraded twice, at CFRA and at Guggenheim, after the food company’s investor day, which laid out a go-forward strategy focused on customer eating habits, partnerships and efficiencies. CFRA raised Kraft Heinz’s rating to buy from hold, and moved its 12-month target to $37 from $35. “We left the meeting with a clearer picture and more confidence that Kraft Heinz can once again return to sustainable earnings growth,” wrote Arun Sundaram, analyst at CFRA Research. Kraft Heinz KHC, -0.35% said it expects to cut $2 billion in costs over the next five years, which will help generate 4% to 6% adjusted earnings per share growth. See: Starbucks’ Pumpkin Spice Latte still drives traffic and could be a source of holiday season inspiration for retailers The food giant also announced that it would sell some of its cheese business to France-based Groupe Lactalis for $3.2 billion. Brands like Kraft Singles, Velveeta, Philadelphia and the company’s iconic macaroni and cheese will remain part of the Kraft Heinz lineup. Guggenheim upgraded Kraft Heinz to neutral from sell and raised its price target to $34 from $30. Analysts say they are optimistic about the future of the company under Chief Executive Miguel Patricio, who took on the role in July 2019. “Moving from a short-term, cost-cutting centric company to a consumer-focused, longer-term growth mandate, it’s clear that much work has been done in the past few months – all while coping with the increased demands associated with the COVID-19 pandemic,” analysts led by Laurent Grandet wrote. Guggenheim said it couldn’t be “more constructive” because of the risks of executing a new plan and the need to off-load additional businesses that are underperforming, like coffee in the U.S. and baby formula in Europe. Kraft Heinz’s coffee brands in the U.S. include Gevalia and Maxwell House. Also: Pepsi to launch sleep-aid drink Driftwell as beverage companies expand into new health and wellness categories Among the changes at Kraft Heinz are the move from 55 product categories to six platforms, including “taste elevation,” which includes condiments, and “easy meals made better,” which includes Kraft Mac & Cheese. The company is also taking a close look at its supply chain, reducing SKUs (stock-keeping units) to streamline the business, and creating more partnerships while moving away from “transactional relationships,” according to Carlos Abrams-Rivera, U.S. zone president at Kraft Heinz, who spoke with MarketWatch on Wednesday. “For each generation, what are the new needs?” Abrams-Rivera asked. This question was at the heart of the company’s platform transformation. “Families are adopting food behaviors based on food moments in their lives. A whole generation is defined by the experience during the pandemic.” Abrams-Rivera said having kids at home during COVID-19 had a tremendous impact on a lot of customers. The company is also taking the shift to e-commerce into account as many shoppers turn to online grocery during the pandemic. Don’t miss: Kroger downgraded at Bank of America as competition with Walmart and Target heats up “Our share, as strong as it is in bricks-and-mortar, is higher in e-commerce,” he said. During the investor conference, CEO Patricio said e-commerce is a $1 billion-plus business for Kraft Heinz and is growing by more than 100%. “We have 97% penetration,” said CEO Patricio during the investor conference, according to FactSet. “That means that 97% of the households in America have Kraft Heinz products in them.” Engaging with customers is part of the company’s strategy, Abrams-Rivera told MarketWatch. “Companies that do well will have an understanding and foresight about how consumers are going to evolve,” he said. Kraft Heinz reported second-quarter adjusted profit and revenue that beat expectations in July. However, it recorded $2.9 billion in goodwill impairment charges and asset impairment charges. “We find a company with a new strategy for its business that is already in motion, roughly nine months, and therefore perhaps further along and more developed than investors might realize,” wrote Stifel analysts. The pandemic has accelerated the company’s transformation, Stifel said. “In addition, with such strong cash flow, we are seeing a faster reduction in its debt load, while preserving its dividend, which could reduce its risk profile,” the note reads. And: McDonald’s September sales get a boost from rapper Travis Scott Stifel rates Kraft Heinz stock hold with a $36 price target. JPMorgan rates Kraft Heinz shares overweight with a $39 price target. Among the reasons for the stock rating are the focus on international growth and the potential for stock buybacks in 2021, which should be bolstered by the Lactalis deal. Kraft Heinz stock has fallen 5% for the year to date while the S&P 500 index SPX, +0.87% has gained 3.5% for the period."}]}