{"article": [{"url": "https://www.marketwatch.com/story/theres-a-one-in-three-chance-of-a-massive-disaster-that-could-be-worse-than-covid-19-says-deutsche-bank-2020-06-17", "published": 1592383940.0, "headline": "There's a one-in-three chance of a 'massive' disaster that could be worse than COVID-19, says Deutsche Bank", "body": "After Tuesday's rally on better-than-expected retail sales figures and an encouraging study of a drug to treat coronavirus patients, the S&P 500 SPX, +0.87%  has rallied 40% from its closing low and is down just 8% from its February peak. Clearly, disasters aren't necessarily devastating to financial markets. That's worth bearing in mind when considering a new report from Deutsche Bank that looked at the next massive tail risk for markets. Analysts, led by Henry Allen, say there is at least a one-in-three chance that at least one of four major tail risks will occur within the next decade: a major influenza pandemic killing more than two million people; a globally catastrophic volcanic eruption; a major solar flare; or a global war. (The current COVID-19 pandemic has killed 443,765 globally already.) If the time frame is two decades, then there is a 56% chance of one of these disasters occurring, the analysts say, based on various studies and risk assessments. Earthquakes were omitted from the numbers on the grounds that they are more local events. The solar flare possibility is one rarely discussed, perhaps because the last severe one was in 1859, but the Deutsche Bank team finds that to be more likely than a major global war. \"There could be major power outages as electrical power grids are disrupted, which in turn would have knock-on effects throughout the economy as critical infrastructure is unable to be run properly. Lives could be lost if it impacted hospitals and medical care. Communications would be disrupted, many payment systems would be dysfunctional, and GPS [Global Positioning System] satellites would face extensive interference, to the detriment of all the individuals and industries that rely on accurate location services, not least aircraft,\" says the cheery report. Citing one study that assessed the odds of a major solar flare happening are 12% in a decade, that means there is a 40% chance it will take place in the next 40 years. Might want to keep a few spare batteries around. Another point made is that these major events tend to have ripple effects as well, just as the current COVID-19 crisis has led to fraying ties between the U.S. and China. The analysts didn't suggest an investment strategy around their findings. Judging by the current environment, perhaps buying stocks would be the best response. The buzz Federal Reserve Chairman Jerome Powell faces lawmakers on the House Financial Services Committee, a day after encountering senators and colorfully stating the central bank wasn't like an elephant running through the corporate bond market. Summing up the comments made by Powell, as well as Vice Chair Richard Clarida and Dallas Fed President Robert Kaplan, \"all three indicated that the economy will probably show strong numbers for a couple of months as it reopens. The worry is that when activity flattens out, the economy will still be far from full employment,\" according to Steven Englander, head of North America macro strategy at Standard Chartered. Beijing canceled more than 60% of commercial flights and raised the alert level amid a new coronavirus outbreak. Vice President Mike Pence said in an opinion piece that there isn't a coronavirus second wave. HSBC Holdings HSBC, -0.93%  said it is going to resume plans to cut 35,000 jobs that it had temporarily shelved. Facebook FB, +0.26%  said it would let users block political ads on its social media platform. The Justice Department is set to announce a legislative proposal that would limit some of the legal protections for Facebook and Twitter TWTR, -0.23%  , according to The Wall Street Journal. Norwegian Cruise Line NCLH, +2.91%  late on Tuesday extended voyage cancellations through October, news that weighed on rival cruise operators, including Carnival CCL, +0.51%  and Royal Caribbean Cruises RCL, +2.59%,  in premarket trade. U.S. housing starts rose a smaller-than-forecast 4.3% in May, while permits spiked 14.3%. The markets U.S. stock futures ES00, +1.13%  YM00, +0.82%  pointed higher. Crude-oil futures CL.1, -1.62%  slipped, as did gold GC00, +2.17%. The dollar rose against the euro EURUSD, +0.60%  and the pound GBPUSD, +0.83%. The chart BP's annual statistical review of energy has fascinating nuggets, even if the numbers represent the world before the pandemic ravaged the global economy. Energy consumption per person is still overwhelmingly larger in the U.S. than anywhere else, even though it has been falling for the last two decades. Last year, average global energy consumption inched up 0.2% on Middle Eastern and Asian-Pacific demand, BP said. Random reads The Financial Times features one writer's \"awkward lessons of my luxury lockdown.\" Double chai, as the Hebrew expression goes - the Milky Way could be host to 36 alien civilizations. Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. Be sure to check the Need to Know item. The emailed version will be sent out at about 7:30 a.m. Eastern."}]}