{"article": [{"url": "https://www.marketwatch.com/story/death-of-rayshard-brooks-in-atlanta-and-two-recent-deaths-of-black-men-by-hanging-in-california-lead-to-new-protest-wave-2020-06-14", "published": 1592161700.0, "headline": "Atlanta shooting of Rayshard Brooks sparks new protests; polarizing statues become focus in other cities", "body": "Atlanta police on Sunday quickly released body-camera and other footage that captured the shooting death of a black man by a white officer who was swiftly fired — moves that policing experts said could help defuse anti-racism protests that were reignited by the shooting. Atlanta police announced that an officer, Garrett Rolfe, had been fired after he fatally shot Rayshard Brooks, 27, on Friday night, and another officer, Devin Brosnan, had been placed on administrative duty. On Saturday, Mayor Keisha Lance Bottoms had called for the immediate firing of the officer who opened fire on Brooks and announced that she had accepted the resignation of Police Chief Erika Shields. “I do not believe that this was a justified use of deadly force,” Bottoms said. Roughly 150 protesters marched Saturday night around the Wendy’s restaurant outside where Brooks was shot, reigniting demonstrations that had largely simmered in the Georgia capital nearly three weeks after George Floyd, another black man, died after a white Minneapolis police officer pressed a knee to his neck. Both Rolfe and Brosnan are white. The firing of Rolfe and the quick release of the video to the public could go a long way toward easing tensions in the city, said Andy Harvey, a veteran law enforcement officer who is now a police chief in Ennis, Texas, and the author of books and training curriculum on community policing. “Transparency today is a whole different ball game. It’s what the community expects,” Harvey said. “We have to always be open about the good, the bad and the ugly. Not just the good. I think it actually builds trust and confidence when we’re open about the ugly as well.” The Georgia Bureau of Investigation said that Brooks, who was seen on body camera video sleeping in a car blocking the Wendy’s drive thru, failed a sobriety test and was shot in a struggle over a police Taser. Cedric Alexander, the former public safety director of Dekalb County, Georgia, who now works as a police consultant, said the shooting will undoubtedly lead to questions about how officers might have defused the situation. “Here’s a man who took it upon himself to pull off the road to take a nap,” Alexander said. “Could they have given him a ride home, could they have called him an Uber, and let him sleep it off later, as opposed to arresting him? Now that does not in any kind of way excuse Mr. Brooks for resisting arrest. But the question is: Are there other protocols that police could have taken?” “And people will ask the question, had he been white and pulled onto the side of the road to take a nap and sleep it off, would they have given him a ride home?” The Wendy’s was set aflame at one point Saturday night, although the fire was out before midnight. Atlanta police said Sunday that 36 people had been arrested in connection with the protests, but gave no further details. A makeshift memorial had been erected outside the restaurant Sunday morning. In Washington, D.C., meanwhile, a group of interfaith leaders held a prayer vigil Sunday outside St. John’s Church near the White House, where President Donald Trump held a June 1 appearance that sparked criticism after protesters were forcibly cleared from the area. The faith leaders, representing multiple Christian denominations as well as Jewish, Muslim, Hindu and Sikh faiths, addressed a crowd of several dozen at the edge of the recently named Black Lives Matter Plaza with a message of racial justice. The rapidly unfolding movement to take down Confederate statues and other polarizing monuments in the U.S. also grew over the weekend. Protesters in New Orleans tore down a bust of a slave owner Saturday who left part of his fortune to New Orleans’ schools and then took the remains to the Mississippi River and rolled it down the banks into the water. And in Tahlequah, Okla., the Cherokee Nation’s principal chief watched as two Confederate monuments were removed that were placed in its tribal headquarters nearly a century ago by the Daughters of the Confederacy. In Philadelphia, a group of about 100 people, some carrying guns and baseball bats, gathered around a statue of Christopher Columbus in Philadelphia on Saturday, saying they intended to protect it from vandals amid recent protests. “It would be over my dead body before they got to this statue,” Anthony Ruggiero, 41, told The Philadelphia Inquirer. “This is a part of history.” Mayor Jim Kenney condemned the “groups of armed individuals ‘protecting’” the statue in a Twitter post on Sunday. Meanwhile, three people were charged in the vandalism of a Christopher Columbus statue in Providence, R.I. European protesters also sought to show solidarity with their American counterparts and to confront bias in their own countries on Sunday. The demonstrations also posed a challenge to policies intended to limit crowds to prevent the spread of the coronavirus. In Milan, Italy, protesters scrawled ‘’rapist’’ and ‘’racist’’ in Italian on the statue of a late Italian journalist who had acknowledged having had a 12-year-old Eritrean bride while stationed in the Italian colony on the horn of Africa in the 1930s. The statue of Indro Montanelli, inside a Milan park that bears his name, has been a flashpoint in Italy’s Black Lives Matter protests. In Germany, protesters in Berlin on Sunday formed 5½-mile chain in a message against racism, among a range of other causes. Demonstrators were linked by colored ribbons, forming what organizers called a “ribbon of solidarity” that stretched southeast from the Brandenburg Gate to the Neukoelln neighborhood."}]}