{"article": [{"url": "https://www.marketwatch.com/story/moderna-stock-surges-17-on-coronavirus-vaccine-trial-news-2020-07-14", "published": 1594794140.0, "headline": "Moderna stock surges 17% on coronavirus vaccine trial news", "body": "Moderna Inc. stock skyrocketed in premarket trade Wednesday, after the biotech company said its coronavirus vaccine candidate produced a “robust” immune-system response in a larger group of people and the study will move to a decisive clinical trial in July. Results published in The New England Journal of Medicine showed that a two-dose vaccination schedule induced the desired immune response in all 45 people evaluated, a larger group than in the preliminary data Moderna MRNA, +0.09% released in May, and was generally safe and well-tolerated, the company said. Shares of Moderna already rallied after-hours Tuesday. The company is a front-runner among several developing experimental COVID-19 vaccines. The results “reaffirm the positive interim data” released back in May, Moderna said. The trial vaccine “induced rapid and strong immune responses against SARS-CoV-2,” the coronavirus that causes COVID-19. No serious adverse effects were reported, but some that did occur, such as headaches and fatigue, were “generally transient and mild to moderate in severity,” the company said. Moderna is evaluating whether the participants’ immune responses are lasting, with participants followed for one year. A Phase 3 study will start this month “to demonstrate our vaccine’s ability to significantly reduce the risk of COVID-19 disease,” Moderna said. It added that it remained on track “to be able to deliver approximately 500 million doses per year, and possibly up to 1 billion doses per year” beginning in 2021. Moderna last week said it had signed another manufacturing deal for the investigational vaccine, this time with Spain’s Laboratorios Farmacéuticos Rovi. As part of the race for a coronavirus vaccine, drugmakers have scaled up their vaccine candidates’ production to hasten the time that it would take to distribute a working vaccine. The new details about Moderna’s vaccine candidate emerged as Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said he was “cautiously optimistic” about a coronavirus vaccine relatively soon. “We are in a pretty good place when it comes to a vaccine,” Fauci said at an event late Tuesday. “If things work out the way we hope they do,” a safe and effective vaccine would be ready for distribution by late 2020, beginning of 2021, he said. “I’m cautiously optimistic about that.” Assuming that timetable is correct, the companies racing to develop a vaccine have promised that many doses will be available right away, Fauci said. Shares of Moderna have nearly quadrupled this year, contrasting with losses around 1% and 7% for the S&P 500 index SPX, +0.87% and the Dow Jones Industrial Average DJIA, +0.56% in the same period."}]}