{"article": [{"url": "https://www.marketwatch.com/story/when-will-i-receive-my-stimulus-check-im-one-of-the-35-million-people-waiting-how-long-will-my-2019-tax-return-take-2020-06-10", "published": 1595163440.0, "headline": "â\u0080\u0098Iâ\u0080\u0099m astounded that I have NOT received my paymentâ\u0080\u0099: When will I receive my stimulus check?", "body": "Dear Moneyist, I am one of the many Americans waiting on a stimulus check. Iâ\u0080\u0099m astounded that I have not received my payment, especially as I qualified, according to all IRS requirements. I just found out that my parents claimed me as a dependent. As soon as I found this out, I filed my 2019 tax return. However, I fear itâ\u0080\u0099s too late for me to receive my $1,200 stimulus check. Is it too late? The tax return deadline for 2019 was extended to July 15, so I assume there are many people like me who donâ\u0080\u0099t qualify based on their 2018 return, but do qualify on the 2019 return. When will I receive my stimulus check? Confused son Dispatches from a pandemic: Letter from New York: â\u0080\u0098New Yorkers wear colorful homemade masks, while nurses wear garbage bagsâ\u0080\u0099 Dear Son, Your stimulus payment is an advance on a 2020 tax credit, so you will receive the $1,200. However, it likely wonâ\u0080\u0099t arrive until next year or later this year, at the very earliest. By then, we may or may not be in the midst of a second wave of the pandemic. More than 160 million stimulus checks have been sent. Hereâ\u0080\u0099s a breakdown, per the House Committee on Ways and Means: â\u0080¢ 13 to 18 million taxpayers who file returns below the $2.2 trillion CARES Act income thresholds. â\u0080¢ 7.5 million Social Security and Railroad Retirement beneficiaries who do not file tax returns. â\u0080¢ 10.7 million taxpayers who donâ\u0080\u0099t file tax returns and donâ\u0080\u0099t receive federal government benefits. â\u0080¢ Millions of Social Security Insurance-only or Veteran Affairs recipients who do not file tax returns. â\u0080\u009cThe IRS also has an estimated 10 million pieces of mail to open and process, including 4.7 million tax returns. Some of these returns may be from first-time filers who would qualify for economic impact payments,â\u0080\u009d according to the House Committee report. â\u0080\u009cTreasury and the IRS initially estimated that there would be 171 million economic impact payments under the CARES Act, which seems low given the following populations.â\u0080\u009d Donâ\u0080\u0099t miss:â\u0080\u0098We will not have a vaccine by next winter.â\u0080\u0099 Like the 1918 Spanish flu, CDC says second wave of coronavirus could be worse. So what happens now? Having your bank details on file will help speed the plow for a payment next year. If the IRS does not have your bank-account information on file, it will likely take longer. Approximately 14 million Americans, or 6.5% of U.S. households, donâ\u0080\u0099t have bank accounts. You can submit your bank-account and address information through the IRS tracking tool, â\u0080\u009cGet My Payment.â\u0080\u009d It should also tell you if the IRS needs more bank-account information. The Moneyist: My son is staying with me, yet my financially irresponsible ex-husband received his $500 stimulus check. Is my ex right to keep it? You can email The Moneyist with any financial and ethical questions related to coronavirus at qfottrell@marketwatch.com. Want to read more?Follow Quentin Fottrell on Twitterand read more of his columns here Would you like to sign up to an email alert when a new Moneyist column has been published? If so, click on this link. Hello there, MarketWatchers. Check out the Moneyist private Facebook FB, +0.26% Â group where we look for answers to lifeâ\u0080\u0099s thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}