{"article": [{"url": "https://www.marketwatch.com/story/pence-homeland-security-adviser-says-trump-never-took-on-the-pandemic-because-he-cares-only-about-himself-and-re-election-2020-09-17", "published": 1600368380.0, "headline": "Pence homeland-security adviser says Trump never took on the pandemic because he cares only about himself and re-election", "body": "WASHINGTON (AP) — A former adviser to Vice President Mike Pence who also served on the White House coronavirus task force says President Donald Trump once suggested that COVID-19 might be a good thing because it would stop him from having to shake hands with “disgusting people.” Olivia Troye is the latest former member of the Trump administration to speak out against him and urge voters to deny him a second term. She joins a growing list that includes Miles Taylor, former chief of staff at the Department of Homeland Security, and former White House communications director Anthony Scaramucci. Troye, Pence’s former homeland-security adviser, says in a new video released Thursday by the group Republican Voters Against Trump that working for Trump was “terrifying” and that he was more concerned about his re-election chances than about protecting the nation from the virus. Coronavirus daily update:Global cases near 30 million; Trump contradicts CDC head on vaccine timetable and again derides face masks “The truth is he doesn’t actually care about anyone else but himself,” she says. iframe.twitter-tweet { width: 100% !important; } Troye alleges that, during one task force meeting that she attended, the president told the room that, “ ‘Maybe this COVID thing is a good thing. I don’t like shaking hands with people. I don’t have to shake hands with these disgusting people.’ ” Vice President Mike Pence, here speaking at an April coronavirus briefing in the James Brady Press Briefing Room of the White House, characterized former homeland-security aide Olivia Troye as “one more disgruntled employee that has decided to play politics.” Associated Press “Those disgusting people are the same people that he claims to care about. These are the people still going to his rallies today who have complete faith in who he is,” she says. “If the president had taken this virus seriously, or if he had actually made an effort to tell how serious it was, he would have slowed the virus spread, he would have saved lives.” Troye, a lifelong Republican, said she plans to vote for Trump’s Democratic challenger, Joe Biden, in November. The White House denied the exchange had happened, with White House spokesperson Judd Deere saying “her assertions have no basis in reality and are flat-out inaccurate.” He further dismissed Troye as “disgruntled” and said she generally watched task-force meetings from an overflow staff room and was never in private meetings with the president. “Ms. Troye is a former detailee and a career Department of Homeland Security staff member, who is disgruntled that her detail was cut short because she was no longer capable of keeping up with her day-to-day duties,” added Keith Kellogg, Pence’s national-security adviser, who said Troye reported to him and never once expressed concern about the administration’s response. Pence also pushed back at the White House, saying he hadn’t read her comments, “but it reads to me like one more disgruntled employee that has decided to play politics during election year.” “I couldn’t be more proud of the work we’ve done,” he added. Trump himself told journalist Bob Woodward in recorded interviews that he intentionally downplayed the virus in public comments even though he was fully aware of the danger it posed. He is also a self-described germaphobe and denounced the practice of shaking hands before he ran for office. Republican Voters Against Trump is one of several groups trying to convince Republicans and others who once supported the president that they should vote for Biden. “Never before have so many high-ranking staffers of an incumbent president opposed his reelection and endorsed his opponent,” said Sarah Longwell, the strategic director of Republican Voters Against Trump, in a statement. Read on:Biden blasts Trump’s ‘close to criminal’ COVID response at Pennsylvania town hall"}]}