{"article": [{"url": "https://www.marketwatch.com/story/intel-in-the-age-of-covid-19-after-sales-surge-to-deal-with-the-new-normal-all-bets-are-off-2020-04-09", "published": 1595519600.0, "headline": "Intel has weathered coronavirus because of data center and PC sales, but only one of those is expected to grow", "body": "Intel Corp. is expected to see strong sales growth in their data center business for the rest of the year as companies continue their migration of assets to the cloud but PC sales may reach a saturation point. Intel INTC, -1.03% reports quarterly earnings after the market close Thursday. Intel started off 2020 with a reversal from a difficult year, reporting that it broke the $20 billion quarterly sales mark for the first time as its fastest-growing segment, data-center chips, surged 19% to $7.2 billion. That time — when China was reporting 830 cases of COVID-19 with 26 deaths and the U.S. had just confirmed its second coronavirus case — seems a world away now after the coronavirus spread across the globe and sent most Americans into their homes to avoid contracting the virus. Now, with the U.S. leading the world in COVID-19 cases and deaths, millions of employees who still have jobs in the U.S. have been working from home for four months while millions of students will likely keep taking take lessons online when classes resume in the fall. That’s kept companies like Zoom Video Technologies Inc. ZM, +2.89% wildly popular while stretching the limits of older hardware. Much of that traffic is passing through cloud data centers like those maintained by Amazon.com Inc. AMZN, +3.01% , Microsoft Corp. MSFT, +2.48% and Alphabet Inc.’s GOOG, +1.97% GOOGL, +1.82% Google, which will need new chips to expand capacity. Business in the age of COVID-19: Read profiles of how other large companies will be affected by the coronavirus At the same time, businesses keep moving assets to the cloud, further fueling data center growth. With PC, server and data-center sales representing the majority of Intel’s business, there’s little question that the chip giant could benefit from a sales surge thanks to all those dynamics. In its previous earnings report, Intel tempered those expectations. When it reports the first three-month period during the shelter-in-place orders in many U.S. states on Thursday afternoon, Intel is expected to show gains from PC shipments seeing a big uptick, based on data from industry tracking firms Gartner and IDC. That may not last long, however, as experts expect PC demand to soften later in the year. Data-center growth, though, is expected to be “unrelenting,” Maribel Lopez, principal analyst at Lopez Research, told MarketWatch in an interview. “What we’re seeing is that people are still moving workloads to the cloud like crazy,” Lopez said. “I expect the data-center business for Intel to be healthy through the year.” Which chip company wins the most cloud business is still a question. Nvidia Corp. NVDA, -0.54% has made a huge push into the data center space with its GPUs , and has been fighting it out with Intel lately over which company is the largest U.S. chip maker by market capitalization. “The AI landscape is largely being played out in the data center now, which was why [Nvidia] spent all that money on Mellanox,” Lopez said, referencing Nvidia’s acquisition of Mellanox Technologies Ltd. for nearly $7 billion. “I would be worried about Nvidia every day if I were Intel,” Lopez said. But does that mean we’ll see Intel losing considerable market share to Nvidia this year? “Here’s where it gets tricky,” Lopez said. “I see them losing share to Nvidia but because growth in data center is strong, its a little difficult to figure out how much share they may or may not be losing.” Then there’s Advanced Micro Devices Inc. AMD, -3.94% muscling in on Intel’s turf in the CPU arena with its 7-nanometer products when Intel struggles to break out its 10-nanometer products. In chip parlance, nanometers, or nm, refers to the size of the transistors that go on a computer chip, with the general rule being that smaller transistors are faster and more efficient in using power. On Wednesday, AMD saw its shares rise to their highest level since COVID-19 was declared a pandemic after the company announced release of its Ryzen 4000 series of 7-nm desktop chips aimed at the PC market.What the numbers are saying Revenue: Back in late April, Intel projected revenue of about $18.5 billion for the second quarter. Analysts surveyed by FactSet initially set their second-quarter mark at $17.79 billion, but expectations rose to $18.54 billion by mid-July. Earnings: Intel forecast adjusted earnings of $1.10 a share for the second quarter. Analysts project adjusted earnings of $1.11 a share, down from an average forecast of $1.20 a share in late April. Stock movement: Intel shares are up nearly 2% on the year, while the Dow Jones Industrial Average DJIA, +0.56%, which counts Intel as a component, is down about 6%.What the company is saying May 1: Intel said it planned to continue its work-from-home policy “for some time to come,” a few days after releasing a “return to work” plan. April 23: Intel pulls its full-year forecast and said it sees strong data-center demand in the first half of the year, but expects weak enterprise and government demand in the second half of the year. March 25: Intel issued $8 billion in debt a day after it suspended its stock repurchases given “uncertainty regarding the length and severity of the pandemic.” March 19: Intel Chief Executive Bob Swan said in a letter to customers that Intel was using AI and high-performance computing along with Lenovo and BGI Genomics to accelerate the analysis of genomic characteristics of COVID-19. March 13: Intel said it was implementing work-from-home and social distancing policies along with other protective measures to deal with the pandemic. March 2: At a Morgan Stanley investor conference, Intel Chief Financial Officer George Davis said the company was operating “on a relatively normal basis,” and that its 24/7 pandemic team had been mindful of the virus from the start. Back then, Intel was focused on China, and its NAND manufacturing plant in Dalian, its test and packaging facility in Chengdu and design centers in Shanghai and Beijing.What analysts are saying Of the 40 analysts who cover Intel, 15 have buy or overweight ratings on the stock, while 19 have hold ratings and six have sell or underweight ratings as of July 16, with an average share-price target of $64.82, according to FactSet data. • “2Q20 continues to benefit from strong WFH trends. Gartner/IDC PC estimates and our ODM notebook checks suggest room for upside in CCG. DC checks also constructive.” — Susquehanna Financial analyst Christopher Rolland, who has a neutral rating and a $58 price target on Intel. • “With the global pandemic driving a surge in work-from home activity, anecdotal PC end-demand remains strong and production should accelerate at least through Q2 to match that. The key question moving forward is what will happen in the 2H and in 2021 once presumable work-from-home pull-ins and commercial upgrade tailwinds from windows 10 refresh (which was ~2/3 complete heading into 2020) abate,” — B of A Securities analyst Vivek Arya, who has a buy rating and a $70 price target. • “We believe Intel has improved its execution around product development considerably since a year ago when we initiated on the stock. However, we also believe a revenue trough tied to a combination of share loss and softer end market conditions has yet to manifest due to recent cloud spending strength and an elongated PC cycle given the need to support [working from home].” — Wedbush analyst Matt Bryson, who has an underperform rating on Intel and a $51 price target. This article is part of a series tracking the effects of the COVID-19 pandemic on major businesses, and will be updated. It was originally published on April 9."}]}