{"article": [{"url": "https://www.marketwatch.com/story/google-searches-on-how-to-file-for-unemployment-points-to-further-drop-in-weekly-jobless-claims-2020-08-19", "published": 1597926980.0, "headline": "Jobless claims crystal ball? Google searches on filing for unemployment give a big clue", "body": "Google Trends appears to have forecast weekly U.S. jobless benefit claims right on the mark again. The search engine signaled a small increase in the number of people who applied for unemployment benefits last week. And that’s what happened in data published early Thursday. Initial jobless claims climbed by 135,000 to 1.11 million in the seven days ended Aug. 15, the Labor Department said Thursday. They had fallen below the 1 million mark earlier in the month for the first time since the coronavirus epidemic began in early March. Read:Jobless claims climb back above 1 million as recovery in labor market slows The number of Google searches on how “to file for unemployment” has closely tracked the unprecedented rise and fall of initial jobless claims during the coronavirus pandemic. As the accompanying chart shows, searches seem to have risen slightly in the middle of August to coincide with the increase reported Thursday. If Google is right again, though, it looks like claims will start heading back down again next week. The search engine is better at predicting broad trends than week-to-week movements, however. Real-time economic information Google has become a repository of useful and real-time information for Wall Street DJIA, +0.56% on how the economy is recovering. Read: Americans worry the economy will suffer for a long time even as they keep spending When new claims soared to a record 6.9 million at the end of March, searches on Google GOOG, +1.97% also reached a peak. Since then the number of Google searches has foreshadowed a gradual decline in initial jobless claims to the most recent total of 1.11 million. Perhaps not surprisingly, new searches on how to file for unemployment seem to peak on Mondays, suggesting most laid-off or furloughed employees finish out their last work week on a Friday and wait until after the weekend is over to apply. Most recently Google searches on how to file for unemployment predicted the surprising — at least to Wall Street — 33% drop in jobless claims from the last week of July through the first week of August. They fell by almost 500,000 in the two-week span to a low for the pandemic era of 971,000. The decline was sandwiched around the expiration of a temporary extra $600 federal unemployment stipend. Some economists wonder if the end of the federal benefit made people think they were no long eligible. Other analysts believe the loss of the extra $600 induced more people to return to work if they were able to, or to look for jobs again. By the same token, the new claims may have risen last week after President Trump temporarily restored $300 in extra federal benefits for the unemployed after a Congress failed to extend the payment. Read: Did the expired $600 federal jobless benefit keep people from going back to work? Read: Jobless claims fall below 1 million for first time since start of coronavirus pandemic Whatever the case, new claims are still almost five times higher than they were before the pandemic began earlier this year. Before the crisis new claims were in the low 200,000s and running near a 50-year low. Among the states, searches for new claims are the highest in Michigan. The Wolverine state has the sixth highest unemployment rate at 14.8% as of June. The fewest searches occur in Utah, a state with the second lowest unemployment rate at 5.1%."}]}