{"article": [{"url": "https://www.marketwatch.com/story/jobless-claims-fall-below-1-million-for-first-time-since-start-of-coronavirus-pandemic-2020-08-13", "published": 1597311800.0, "headline": "Jobless claims fall below 1 million for first time since start of coronavirus pandemic", "body": "The numbers: Initial jobless claims fell below 1 million in August for the first time since the coronavirus pandemic began almost five months ago, signaling a steady if slow revival in a battered U.S. labor market. New applications for unemployment benefits, a rough gauge of layoffs, declined to 963,000 last week from 1.19 million at the end of July, the Labor Department said Thursday. It was the second straight large decline, raising questions about whether the end of a temporary $600 federal unemployment stipend prompted more people to return to work or start looking for jobs again. New claims have tumbled by almost 500,000 in the past two weeks. Economists polled by MarketWatch had forecast 1.08 million new claims in the seven days ended Aug. 8. These seasonally adjusted figures reflect applications filed the traditional way through state unemployment offices. Millions of unemployed Americans might struggle to pay the rent after a $600 federal stipend expired at the end of July. Getty Images The number of people receiving traditional jobless benefits through the states dropped by a seasonally adjusted 604,000 to a new post-pandemic low of 15.49 million. These so-called continuing claims are reported with a one-week lag. Read: The economy took another body blow from COVID-19. Just how bad was it? Read:Soaring U.S. budget deficit takes a breather in July — but not for long What happened: The sharp decline in claims over the past two weeks has surprised economists. Some wonder if the expiration of a temporary $600 federal stipend on July 31 led some people to believe they were no longer eligible to apply. A big drop in the number of people seeking benefits through the federal government’s so-called Pandemic Unemployment Compensation fund suggests that that might be the case. The program made self-employed eligible for the very first time. Applications through the PUA slid to 488,622 last week from 655,999 and 908,800 in the prior two weeks. While these workers can still apply for benefits, they and other Americans can no longer get $600 extra a week that the federal government was offering. President Trump has since ordered reduced federal payments of $300 after a divided Congress failed to extend the benefit. “It’s not clear if this is driven by a genuine improvement in the labor market or the expiration of Pandemic Unemployment Compensation,” economists at Jefferies LLC wrote to clients. Another possibility is that state governments have mostly worked through a backlog of claims that they struggled to process earlier in the pandemic. If new state and federal jobless claims are combined, they totaled an unadjusted 1.32 million last week, down from 1.64 million in the prior week. They had hit an all-time high of more than 6.2 million in early April. Altogether, 28.26 million people were still receiving benefits through eight state and federal assistance programs as of July 25, the latest data available. That’s down from unadjusted 31.3 million in the prior week. MarketWatch is reporting select jobless claims data using actual or unadjusted figures to give a clearer picture of unemployment. The seasonally adjusted estimates typically expected by Wall Street have become less accurate during the pandemic. Read:Fed’s Barkin says economy could suffer relapse without more Washington stimulus Big picture: The economy’s rapid recovery from pandemic-related shutdowns tapered off by midsummer after another surge in coronavirus cases. What comes next is unclear. While recent evidence suggests growth might be speeding up again, the economy probably faces a tougher slog in the months ahead. Unemployment is still extremely high, many businesses are struggling, most states still have restrictions in place and a range of organizations from sports to schools don’t plan to fully reopen soon. What they are saying? “The drop in claims reflects economic reopening, but it also suggests the expiration of federal supplemental unemployment benefits may have convinced some people to stop collecting and find work,” said chief economist Chris Low of FHN FInancial. “Alternatively, people could be falling off rolls because they no longer qualify for assistance in the absence of the emergency expansion of eligibility.” Market reaction:The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% opened lower."}]}