{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-covid-19-case-tally-tops-10-million-and-florida-south-carolina-and-nevada-set-daily-records-2020-06-29", "published": 1593498020.0, "headline": "Coronavirus update: Global COVID-19 case tally tops 10 million and Florida, South Carolina and Nevada set daily records", "body": "The number of confirmed cases of the coronavirus illness COVID-19 topped 10 million around the world and the death toll surpassed a half million over the weekend, and Florida, South Carolina and Nevada all recorded their highest number of new infections in a single day. Florida counted 9,585 new cases on Saturday, followed by 8,530 on Sunday, the New York Times reported. Gov. Ron DeSantis said young people ignoring social-distancing rules were the main culprits in spreading the virus. In Texas, Vice President Mike Pence urged people to wear face masks and wore one himself, just days after a press briefing of the White House Task Force at which he was the only member to fail to wear a mask. However, Pence also attended a rally at which a choir of more than 100 people was filmed singing while unmasked. See also: As cases surge in U.S., rural areas seeing increases as well Public-health experts said Pence’s inconsistent behavior is unhelpful. “Policies are only as good as their implementation,” Dr. Jeremy Faust, instructor at Harvard Medical School and emergency room physician at Brigham and Women’s Hospital in Boston told MarketWatch. “Our leaders need to send a consistent message that every action we take—whether it is staying home when possible, not gathering in crowded spaces, practicing great hygiene, or wearing masks—matters. We can turn the tide of this virus and the economy will follow. I hope we have learned that downplaying things will not help the economy. Beating this virus will.” Dr. Anthony Fauci, head of the National Institute for Allergies and Infectious Diseases, told CNN that the U.S. is unlikely to develop herd immunity to the illness, because of the expected combination of a vaccine being only partially effective and the large number of Americans who are unlikely to be vaccinated. Speaking Sunday night to CNN’s Elizabeth Cohen as part of the Aspen Ideas Festival, Fauci said he would “settle” for a coronavirus vaccine that is 70% to 75% effective. By comparison, a measles vaccine is 97% to 98% effective. However, “there is a general anti-science, anti-authority, anti-vaccine feeling among some people in this country — an alarmingly large percentage of people, relatively speaking.” “We have a lot of work to do” on educating the public about a potential vaccine, Fauci said. “It’s not going to be easy.” Read now:Letter from Arizona: Hospitals grapple with a surge in coronavirus cases, while life outside continues as normal Scott Gottlieb, former commissioner of the U.S. Food and Drug Administration, told CNBC that the picture is worsening and that those parts of the country currently seeing community spread will probably see death rates and hospitalizations steadily rise. While younger people are increasingly falling victim to the virus, “eventually, it will start to seep into older people, more vulnerable people, and you’ll start to see the total number of deaths go up even if the death rate has come down,” he said. “We’ll probably get above 1,000 deaths a day on average as the infection starts to widen out.” The record increase in cases in some states has led New Jersey Gov. Phil Murphy to slow the state’s reopening schedule by postponing the resumption of indoor dining at restaurants, even though New Jersey is one of the states showing a decline in cases. He said he made his decision after seeing how looser restrictions led to spikes in COVID-19 cases in other states. Indoor dining was scheduled to resume in New Jersey on Thursday, but Murphy said that would be postponed “indefinitely.” iframe.twitter-tweet { width: 100% !important; } New York Gov. Andrew Cuomo said he would decided on Wednesday whether New York will also postpone resuming indoor dining.Latest tallies There are now 10.2 million confirmed cases of COVID-19 world-wide and at least 502,947 people have died, according to data aggregated by Johns Hopkins University. At least 5.2 million people have recovered. The U.S. continues to lead the world, with a case tally of 2.56 million and death toll of 125,928, more than double the 1.34 million cases and 57,622 deaths recorded in the next highest center, Brazil. Don’t miss:Tokyo sees infections spike from nightlife districts Russia is third measured by cases at 640,246, followed by India with 548,318 and the U.K. with 313,467. The U.K. has 43,659 fatalities, the highest in Europe and third highest in the world. China, where the illness was first reported late last year, has 84,757 cases and 4,641 fatalities. Iran recorded its highest one-day death toll since the start of the outbreak as 162 patients died, the Guardian reported. Iran suffered its first cases of COVID-19 in February and has the deadliest outbreak in the Middle East with 225,205 confirmed cases and 10,670 confirmed deaths. In Melbourne, Australia, a surge of new cases has health officials scrambling to identify the source. What’s the latest medical news? Gilead Sciences Inc. GILD, +0.82% disclosed that remdesivir, its experimental COVID-19 treatment, will cost $2,340 for a course of treatment, as MarketWatch’s Jaimy Lee reported. The drug hasn’t been approved by the Food and Drug Administration but received an emergency-use authorization from the regulator in May. The price, however, is slightly higher for the privately insured population in the U.S., at $3,120 per course of treatment. “There is no playbook for how to price a new medicine in a pandemic,” Gilead CEO Daniel O’Day said in a statement. The price of $2,340 applies to all developed countries, a decision aimed at removing “the need for country by country negotiations on price,” O’Day said. See: Gilead’s coronavirus drug will cost $2,340 — which sounds expensive, but here’s why it’s not Remdesivir has since been approved in Japan and has been recommended for approval in the European Union. The Institute for Clinical and Economic Review, an organization that studies cost-effectiveness in medicine, last week updated its price recommendation for remdesivir, to $2,520 to $2,800 for a course of treatment, if patients are also prescribed dexamethasone. U.K. researchers recently discovered that the commonly used steroid can reduce mortality in some severely ill COVID-19 patients. Studies have found that remdesivir can reduce the amount of time that patients are in the hospital, but no mortality benefit has been found in clinical research at this time. Health officials will receive 500,000 treatment courses of remdesivir through September that can then be purchased by U.S. hospitals. The Centers for Disease Control and Prevention cautioned that congestion or runny nose, nausea or vomiting and diarrhea could be symptoms of COVID-19, adding to the list that includes fever, cough and shortness of breath, chills, a sore throat and loss of taste or smell, among others. This expanded list of warning signs is significant because some testing sites may require a patient to show symptoms before they can be tested. The CDC stressed that this list is not all-inclusive, as there is still so much that is unknown about the coronavirus. For example, there are reports of coronavirus patients in Italy exhibiting skin rashes, while some children and teens in Spain developed pseudo-frosbite lesions (called pernio, or chilblains) on their toes, which is being called “COVID toes.” What are companies saying? Fracking pioneer Chesapeake Energy Corp. US:CHK became the latest company to be pushed into bankruptcy during the pandemic as an oil-and-gas-price rout proved the final blow for the debt-laden company, as The Wall Street Journal reported. Chesapeake filed for bankruptcy protection late Sunday, a move that was widely expected. The company, which was co-founded in 1989 by the late Aubrey McClendon, was one of the first to recognize that horizontal drilling and hydraulic fracturing could unlock vast troves of natural gas, a trend that led to a rebirth of American fossil-fuel output and eventually made the U.S. the top oil producer in the world. The stock has been volatile during the pandemic as it attempted to reach a restructuring agreement with creditors. The company said in its bankruptcy petition that it has $16.2 billion in assets and $11.8 billion in debt. “We are fundamentally resetting Chesapeake’s capital structure and business to address our legacy financial weaknesses and capitalize on our substantial operational strengths,” Chief Executive Doug Lawler said in a statement. Chesapeake joins a slate of companies that have filed for bankruptcy since the start of the health crisis, a list that includes car-rental giant Hertz Global Holdings Inc. HTZ, -1.78%, retailers J.C. Penney & Co. JCP, -2.53% and Neiman Marcus, and Chuck E. Cheese parent CEC Entertainment. Elsewhere, companies offered updates on bonuses and other benefits for front-line workers during the pandemic. Here are the latest news reports about companies and COVID-19: • Amazon.com Inc. AMZN, +3.01% is paying bonuses to all of its employees and delivery partners on the front lines in June during the pandemic, for a total cost of over $500 million. The e-commerce and cloud giant said it would give $500 to each full-time Amazon and Whole Foods Market employee, and delivery service partner driver, and $250 to part-time employees. The company will pay $1,000 to all front-line Amazon and Whole Foods Market leaders, and pay $3,000 to delivery service partner owners. For Amazon Flex drivers, Amazon will pay $150 for those who have more than 10 hours in June. Separately, Monness Crespi Hardt analyst Brian White raised his price target enough to make him the most bullish on the Street on Amazon. White reiterated his buy rating while boosting his price target to $3,500 from $2,800, which implies a 30% gain from Friday’s closing price of $2,692.87. That propels his target to be the highest of the 49 analysts surveyed by FactSet, passing the previous high of $3,409 of Elazar Advisors analyst Chaim Siegel. White doubts the recent spike in COVID-19 cases will be the last surprise from the pandemic, and believes Amazon “holds the key capabilities, vast global infrastructure and financial strength necessary” to support global commerce and position itself as “major beneficiary” of the resulting accelerated digital transformation. • AMC Entertainment Holdings Inc. AMC, -2.17% said it was delaying the reopening of its U.S. theaters by about two weeks, to take into the account the delays in the release of Warner Bros.’s “Tenet” and Disney’s”Mulan” movies. The movie theater operator now expects to reopen about 450 U.S. movie theaters on July 30, with the remaining 150 theaters reopening about a week later. During AMC’s earnings call on June 9, the company said it expected 97% to 98% of its theaters reopened in time for the previous expected release dates for “Tenet” of July 17 and for “Mulan” of July 24. “Tenet” is now expected to be released on Aug. 12 and “Mulan” is expected to drop on Aug. 21. • GrubHub Inc. GRUB, +0.83% got a stock boost, after the web-based food delivery company announced a partnership with Chipotle Mexican Grill Inc. CMG, +0.01%, as the casual dining restaurant chain looks to expand its delivery footprint, more important than ever during the pandemic. The companies said Chipotle is available on GrubHub starting Monday. “We’re happy to utilize Grubhub’s expansive network to reach more Chipotle fans across the country,” said Chipotle’s Chief Marketing Officer Chris Brandt. • Lowe’s Cos. LOW, +1.38% is increasing its spending on workers and communities during the coronavirus pandemic to $450 million, including $100 million to be paid in bonuses to front line workers. The home-improvement retailer said all active hourly workers in its U.S. stores, distribution centers and store support centers will be paid the bonuses in mid-July. Full-time workers will get $300 and part-time and seasonal workers will be paid $150, matching the sums paid in March and May. Lowe’s has also increased pay for full-time, part-time and seasonal associates by $2 per hour for the month of April. In June, it announced profit-sharing bonuses and is still offering telemedicine to all workers, even those who are not enrolled in its medical plans. How the Coronavirus Pandemic Is Changing the Way We Commute"}]}