{"article": [{"url": "https://www.marketwatch.com/story/that-100-degree-day-in-the-arctic-underscores-how-this-region-is-now-warming-twice-as-fast-as-earth-2020-06-26", "published": 1593166220.0, "headline": "That 100-degree day in the Arctic underscores how this region is now warming twice as fast as Earth", "body": "The Arctic heat wave that sent Siberian temperatures soaring to around 100 degrees Fahrenheit on the first day of summer put an exclamation point on an astonishing transformation of the Arctic environment that’s been underway for about 30 years. As long ago as the 1890s, scientists predicted that increasing levels of carbon dioxide in the atmosphere would lead to a warming planet, particularly in the Arctic, where the loss of reflective snow and sea ice would further warm the region. Climate models have consistently pointed to “Arctic amplification” emerging as greenhouse gas concentrations increase. Well, Arctic amplification is now here in a big way. The Arctic is warming at roughly twice the rate of the globe as a whole. When extreme heat waves like this one strike, it stands out to everyone. Scientists are generally reluctant to say “We told you so,” but the record shows that we did. As director of the National Snow and Ice Data Center and an Arctic climate scientist who first set foot in the far North in 1982, I’ve had a front-row seat to watch the transformation.Arctic heat waves are happening more often Arctic heat waves now arrive on top of an already warmer planet, so they’re more frequent than they used to be. Western Siberia recorded its hottest spring on record this year, according the EU’s Copernicus Earth Observation Program, and that unusual heat isn’t expected to end soon. The Arctic Climate Forum has forecast above-average temperatures across the majority of the Arctic through at least August. Arctic temperatures have been rising faster than the global average. This map shows the average change in degrees Celsius from 1960 to 2019. NASA-GISS How heat waves get stuck Why is this heat wave sticking around? No one has a full answer yet, but we can look at the weather patterns around it. As a rule, heat waves are related to unusual jet stream patterns, and the Siberian heat wave is no different. A persistent northward swing of the jet stream has placed the area under what meteorologists call a “ridge.” When the jet stream swings northward like this, it allows warmer air into the region, raising the surface temperature. Some scientists expect rising global temperatures to influence the jet stream. The jet stream is driven by temperature contrasts. As the Arctic warms more quickly, these contrasts shrink, and the jet stream can slow. Is that what we’re seeing right now? We don’t yet know. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Swiss cheese sea ice and feedback loops We do know that we’re seeing significant effects from this heat wave, particularly in the early loss of sea ice. The ice along the shores of Siberia has the appearance of Swiss cheese right now in satellite images, with big areas of open water that would normally still be covered. The sea ice extent in the Laptev Sea, north of Russia, is the lowest recorded for this time of year since satellite observations began. The loss of sea ice also affects the temperature, creating a feedback loop. Earth’s ice and snow cover reflect the Sun’s incoming energy, helping to keep the region cool. When that reflective cover is gone, the dark ocean and land absorb the heat, further raising the surface temperature. Sea surface temperatures are already unusually high along parts of the Siberian Coast, and the warm ocean waters will lead to more melting. iframe.twitter-tweet { width: 100% !important; } The risks of thawing permafrost On land, a big concern is warming permafrost — the perennially frozen ground that underlies most Arctic terrain. When permafrost thaws under homes and bridges, infrastructure can sink, tilt and collapse. Alaskans have been contending with this for several years. Near Norilsk, Russia, thawing permafrost was blamed for an oil tank collapse this year that spilled thousands of tons of oil into a river. In a study published last year, researchers found that permafrost test sites around the world had warmed by nearly half a degree Fahrenheit on average over the decade from 2007 to 2016. The greatest increase was in Siberia, where some areas had warmed by 1.6 degrees. The current Siberian heat wave, especially if it continues, will regionally exacerbate that permafrost warming and thawing.Wildfires are back again The extreme warmth also raises the risk of wildfires, which radically change the landscape in other ways. Drier forests are more prone to fires, often from lightning strikes. When forests burn, the dark, exposed soil left behind can absorb more heat and hasten warming. We’ve seen a few years now of extreme forest fires across the Arctic. This year, some scientists have speculated that some of the Siberian fires that broke out last year may have continued to burn through the winter in peat bogs and reemerged. A satellite images shows thinning sea ice in parts of the East Siberian and Laptev Seas and wildfire smoke pouring across Russia. The town of Verkhoyansk, normally known for being one of the coldest inhabited places on Earth, reported hitting 100 degrees on June 20. Joshua Stevens/NASA Earth Observatory A disturbing pattern The Siberian heat wave and its impacts will doubtless be widely studied. There will certainly be those eager to dismiss the event as just the result of an unusual persistent weather pattern. Caution must always be exercised about reading too much into a single event — heat waves happen. But this is part of a disturbing pattern. What is happening in the Arctic is very real and should serve as a warning to everyone who cares about the future of the planet as we know it. Also read:Siberian heat wave alarms scientists: ‘the Arctic is figuratively and literally on fire’ Mark Serreze is a research professor of geography and director of the National Snow and Ice Data Center at the University of Colorado Boulder. This was first published by The Conversation — “Triple-digit heat in Siberia? 5 ways the extreme Arctic heat wave fits a disturbing pattern.”"}]}