{"article": [{"url": "https://www.marketwatch.com/story/warren-buffett-knows-these-are-the-best-investors-to-follow-with-your-own-money-2020-09-30", "published": 1601715980.0, "headline": "Warren Buffett knows these are the best investors to follow with your own money", "body": "An elite corps of patient, concentrated shareholders quietly underpins corporate America. This group, which Warren Buffett dubbed “high-quality shareholders” back in 1978, contrasts with today’s dominant index funds, which hold for long periods but do not concentrate, and momentum traders or many activists, who often concentrate heavily, but rarely hold for long. Every investor, adviser and manager would benefit from familiarity with these high-quality shareholders. Quality shareholders (QS) are pedigreed, spanning from the economist John Maynard Keynes and Buffett’s mentor Benjamin Graham, to stalwarts such as John Neff of Wellington Management and Thomas Rowe Price, founder of T. Rowe Price Group Inc. TROW, +0.98% Their styles vary — in scope of research, perceptions of value, and policies on selling — but patience and focus set them apart. While a few QSs are behemoths — including Capital Research & Management (American Funds); Fidelity Management & Research; and Harris Associates (Oakmark Funds) — many manage less than $100 billion in assets — such as Gardner Russo Gardner; Ruane Cunniff; and Southeastern Asset Management, for example. QSs also share a philosophical outlook. They reject the prevailing fashion of comparing their annual return with some benchmark index. QSs shun reference to the relative volatility of the indexes. They object to the common habit of distinguishing between passive index funds on one hand and all others, tagged “active,” on the other. And they invest for, and measure performance over, many years — not annually as is the obsession of many commentators. QSs have large parts of their portfolios invested in sizable stakes of outstanding major companies, which they’ve held for many years, such as Capital Research in Abbott Laboratories ABT, +1.02%, Fidelity in Salesforce CRM, +2.21% and Harris in Tenet Healthcare THC, +0.74% . Other examples are the positions of Franklin Resources BEN, +1.21% in Roper Technologies ROP, +2.65% , Massachusetts Financial in Accenture ACN, +1.76% , State Farm in Air Products & Chemicals APD, +0.31% ; and Wellington in Marsh & McLennan MMC, +1.26% and PNC Financial Services Group PNC, -0.91% . Today’s conventional wisdom, and much research, suggests that “active” funds underperform the market after fees on average. Top fund performance doesn’t persist and while some investment managers are skilled, few deliver on that value for customers after fees. But the QS group, both patient and focused, proves an exception, as this group’s members do tend to persistently outperform after fees. Each shareholder segment adds unique value: activists promote management accountability; index funds enable millions to enjoy market returns at low cost; and traders offer liquidity. With such advantages, however, come downsides: activists get overzealous; indexers lack resources to understand company details and traders induce a short-term focus. When QSs balance a company’s shareholder base, they counteract these drawbacks. As to curbing overzealous activism, QSs can be so-called white squires — a term dating to the 1980s designating a bloc of shareholders prepared, for tactical reasons, to support management. When a board perceives activist excess, it helps to have a few large long-term owners to consult. As a united front, the company’s hand is strengthened, resisting excess while addressing legitimate concerns an activist may have. QSs study company specifics in a way that indexers, stretched thin, cannot. Indexers may be good at analyzing dynamic issues as they arise, but rarely develop deep knowledge that QSs command. Indexers invest most of their limited resources to develop views about what is good generally in corporate life, not what is best for particular companies. QSs also differ from both activists and indexers regarding director elections. While activists often nominate directors whom fellow board members resist, and indexers almost never nominate directors at all, QSs offer a supply of sage directors (often themselves). Being long-term, QSs offset the short-term preferences of transient shareholders. A high density of QSs, with their characteristic patience, helps managers operate strategically, with a long-term outlook. Such effects can percolate throughout a company. If less pressure comes from shareholders to produce short-term results, then directors, officers, employees, suppliers, partners and others can operate in the same way. “ Quality shareholders are not sycophants or cheerleaders. They are integral supporters, patient guides and savvy mentors. ” To be clear, quality shareholders are not sycophants or cheerleaders. They are integral supporters, patient guides and savvy mentors. They are invested in a high-conviction, long-term marriage of equals. Management would do well to attract, respect and empower them. Performance boost Company performance benefits, anecdotal and empirical evidence both affirm. From a ranking of QS density in a sampling of 2,070 large widely-followed companies for a recent five-year period (2014-2018), compare a portfolio of the top-25 and bottom-25 companies. The high QS density portfolio outperformed the low QS density portfolio in each of those five years. For a wider lens, consider the relative performance of the top 69 in QS density in that ranking. Those with higher QS density tend to outperform those with lower, even over longer periods. Consider also the performance distribution of QS attractors over the period from 2010 through mid-2020. For comparison, during that decade, the cumulative return of the S&P 500 SPX, +0.87% was 181.9% and of the Russell 3000 180.73%. In the following chart, such performance places both indices in the 100–200% performance band (red bar). Of the top 69 QS attractors, 28 underperformed both indexes while 41 outperformed. The hypothetical portfolio outperformed the S&P 500 by around 200%. In future articles written exclusively for MarketWatch, I will identify scores of companies that attract QSs in high density. As a sampling, here are some leading QS attractors: Amerco (U-Haul) UHAL, -0.54% ; Churchill Downs CHDN, -3.00% ; MasterCard MA, +2.09% ; O’Reilly Automotive ORLY, -0.87% , and Sherwin-Williams SHW, +1.47% . An enterprising investor could profitably use the QS ranking as a filter to identify potentially outstanding investments; the less bold could simply use the QS-25+ names I will share to construct a model portfolio. How to attract quality shareholders What unites these and other companies that attract QSs in high numbers? Examining a wide variety of practices of companies that attract QS in high-density, a few themes emerge. First, companies cultivate this cohort through corporate communications such as mission statements, shareholder letters, and annual meetings. Such staples of corporate life are ignored by virtually all indexers, most transients, and some activists. But astute managers appreciate them as fruitful vehicles to engage QSs. Second, companies attract QS and repel transient shareholders by avoiding quarterly earnings guidance and conference calls in favor of a longer-term focus. They adopt, publish, and discuss honest long-term performance metrics, such as economic profit and return on invested capital, in lieu of popular fixations such as earning per share. Above all, companies commit to what QS value most: effective capital allocation. This refers to a simple but elusive idea that treats every corporate dollar as an investment put to its best use, whether organic or acquired growth, debt reduction, dividends or share buybacks. QSs are quiet pillars of American corporate finance and unsung champions of corporate America. While not everyone can or should be a QS, the U.S. economy would be better off with more of this patient focused cohort. Here’s a tip to all investors hunting for outstanding investments: search out those companies that attract a high density of high-quality shareholders. Lawrence A. Cunningham is a professor and director of the Quality Shareholders Initiative at George Washington University. He owns shares of Berkshire Hathaway. Cunningham has written dozens of books including the forthcoming Quality Shareholders: How the Best Managers Attract and Keep Them (Columbia Business School Publishing, 2020). Cunningham also has authored scores of research papers, including Empowering Quality Shareholders and Cultivating Quality Shareholders. Subscribe here for updates. Read:This mutual fund may have cracked the ‘Buffett Code’ — Berkshire Hathaway’s secret sauce Plus: How Warren Buffett is fighting to ‘keep the wolves away’ from Berkshire Hathaway — and winning"}]}