{"article": [{"url": "https://www.marketwatch.com/story/michael-cohens-book-on-trump-to-be-published-sept-8-11597366163", "published": 1597400780.0, "headline": "Michael Cohenâ\u0080\u0099s book on Trump to be published Sept. 8", "body": "Michael Cohen, President Donald Trump's former personal attorney and \"fixer,\" walks in Manhattan in May. AFP via Getty Images NEW YORK â\u0080\u0094 Michael Cohenâ\u0080\u0099s memoir about President Donald Trump will be released Sept. 8 by Skyhorse Publishing, which confirmed the news Thursday to The Associated Press. The book is called â\u0080\u009cDisloyal: The True Story of the Former Personal Attorney to President Donald J. Trump.â\u0080\u009d â\u0080\u009câ\u0080\u0098Disloyalâ\u0080\u0099 is the most devastating business and political horror story of the century,â\u0080\u009d according to a Skyhorse statement shared with the AP. â\u0080\u009cIt is a story that you havenâ\u0080\u0099t read in newspapers, or on social media, or watched on television. These are accounts that only someone who worked for Trump around the clock for a decade â\u0080\u0094 not a few months or even a couple of years â\u0080\u0094 could know.â\u0080\u009d Earlier in the day, Cohen had released the bookâ\u0080\u0099s foreword, writing of his estranged former boss, â\u0080\u009cHe wouldnâ\u0080\u0099t mind if I was dead.â\u0080\u009d As of midday Thursday, it was not listed on Amazon.com AMZN, +3.01% or the Barnes & Noble website. Cohen is completing the last two years of a three-year prison sentence at home after pleading guilty to campaign-finance charges and lying to Congress. He was released from prison in May amid coronavirus fears, only to be returned in July after making it known that he planned to publish â\u0080\u009cDisloyal.â\u0080\u009d The U.S. government dropped its effort to silence Cohen late last month after an agreement was reached between government lawyers and Cohen attorney Danya Perry that lifted a ban on Cohen speaking publicly. Cohenâ\u0080\u0099s charges stemmed from his efforts to arrange payouts during the 2016 presidential race to keep the porn actress Stormy Daniels and model Karen McDougal from speaking out about their alleged extramarital affairs with Trump, who has denied the affairs. He has said that Trump directed him to make the payments. Skyhorse has a history of taking on books by controversial public figures, including a memoir this spring by Woody Allen that had been dropped by Hachette Book Group."}]}