{"article": [{"url": "https://www.marketwatch.com/story/the-fed-might-never-hike-rates-again-here-are-growth-stocks-for-the-long-run-according-to-one-strategist-2020-08-28", "published": 1598604680.0, "headline": "The Fed might never hike rates again. Here are growth stocks for the long run, according to one strategist", "body": "So just how significant was Federal Reserve Chairman Jerome Powell’s speech on inflation? In the speech that markets were eagerly awaiting, Powell announced the Fed would target inflation to average 2% over time, and that the central bank won’t feel obliged to raise interest rates if it believes the economy is running at full employment. The S&P 500 SPX, +0.87% on Thursday edged up to a new record, while the Nasdaq COMP, +1.39% slipped, though to its second-highest perch ever. U.S. Treasury yields rose, particularly at the long end TMUBMUSD30Y, 1.576%, which isn’t the direction you would expect from an ostensibly dovish move. Perhaps, as University of Oregon professor Tim Duy wrote, the market perceived there was no “meat on the bones of this policy” because the central bank left implementation fuzzy. But that is the short-term view. Joachim Klement, investment strategist at U.K. brokerage Liberum Capital, said the Fed’s change of policy goals makes it almost inevitable that the next five years will be dominated by a Japan-like environment of low nominal and real, or inflation-adjusted, interest rates. In a note entitled, “Low rates forever? — Possibly,” Klement points out that had the Fed abided by its new inflation strategy, it would have left interest rates unchanged for a decade after the 2008 financial crisis. “Given the historic experience and current Fed and market implied forecasts, we find it safe to argue that the Fed will not hike interest rates not just for three years, but for the next five years if not longer,” he says. The long-run trend on interest rates is clear. Quantitative easing will continue because the Fed will need to keep nominal rates low across the yield curve, he says. For 10-year Treasurys TMUBMUSD10Y, 0.777%, this means a level of 2% to 2.5% to keep it in the range over the last decade — which would imply a big upward move from current depressed levels “but not enough to impede the cost of borrowing.” The Bank of England and European Central Bank will also have to keep interest rates low, just to avoid having their currencies appreciate versus the dollar DXY, -0.58%, though the difficult economic situation Europe and the U.K. are facing would make any tightening unlikely anyway. He concedes, over the next 12 months, growth stocks are priced for perfection, and value may outperform. “However, low nominal and real rates mean that discount factors for future cash flows will decline and with it, stock market valuations are likely to increase. Stocks with a larger portion of cash flows further in the future (in other words growth stocks) experience a stronger rerating than high dividend stocks and stocks with less growth,” he said. He highlighted companies with strong sales and earnings growth but low leverage, which have the space to further boost their growth through borrowing. For MarketWatch, he produced a screen of S&P 500 companies with strong sales and earnings growth but low levels of financial leverage. Companies P/E Debt/equity 5-yr average EBIT growth (%) 5-year average sales growth (%) Paycom Software PAYC, +1.80% 96.4 11.6 70.5 30.7 Facebook FB, +0.26% 35.8 10.7 36.9 36.9 IHS Markit INFO, +0.56% 57.8 60.8 32.4 36.7 Arista Networks ANET, +2.30% 26.9 3.4 45 24.5 Adobe ADBE, +2.30% 67.4 39.3 51.3 22 Nvidia NVDA, -0.54% 82.2 21.7 30.3 30.5 Abiomed ABMD, +0.87% 82.9 1.1 54.1 19.9 Fortinet FTNT, +3.73% 54.9 3.5 42.1 20.8 Intuit INTU, +2.03% 49.8 70.3 24.1 24.1 Cigna CI, -0.82% 12.2 83.8 18.8 51.9 Prologis PLD, +0.06% 66.8 47.5 25.4 22.7 Lennar LEN, +0.07% 11.4 48.5 21.8 19.6 Cincinnati Financial CINF, -1.17% 22.4 9 26.7 16.5 SVB Financial SIVB, +0.52% 14.6 8.8 19.5 19.8 Bristol-Myers Squibb BMY, +0.32% 26.4 92 17.9 21 Alexion Pharmaceuticals ALXN, +1.12% 10.6 24.5 19.5 17.9 Align Technology ALGN, +0.32% 114.3 4.4 22.9 15.9 Progressive PGR, +1.95% 10.6 33.2 21.5 15.8 Regeneron Pharmaceuticals REGN, +0.36% 24.8 6.7 21.8 14.8 Micron Technology MU, -0.02% 21.4 15.9 19 16.5 The buzz Japanese Prime Minister Shinzo Abe said he will resign over health issues — triggering losses for Japanese stocks NIK, -0.11% and a rise in the Japanese yen USDJPY, -0.38%. U.S. President Donald Trump accepted the Republican nomination for president, while saying former Vice President Joe Biden would be a “destroyer” of American jobs. Since February, 12.88 million jobs have been lost, according to the Labor Department. There was a huge shift in odds in Trump’s favor on the Betfair exchange, with Biden now just narrowly the front-runner. Friday’s session of the Jackson Hole symposium includes an address from Bank of England Governor Andrew Bailey, and academic takes on policy uncertainty, expectations in monetary policy and post-pandemic monetary policy. Personal income rose 0.4% in July, while consumer spending improved 1.9%, the Commerce Department said Friday. The PCE price index — the Fed’s preferred inflation gauge — edged up to 1% year-over-year. The trade deficit in goods jumped 11.7%. There were a number of earnings reports released after markets closed on Thursday, with HP HPQ, -0.15% and Dell Technologies DELL, -0.39% each reporting strong demand for personal computers, due to the coronavirus pandemic keeping workers at home. Workday WDAY, +0.75% stock may rally, after the human-resources software company reported better-than-forecast earnings and boosted its guidance for subscription revenue. Identity-management services company Okta OKTA, -0.47% also topped Wall Street estimates on its quarter and outlook. Clothing retailer Gap GPS, -0.10% reported a smaller loss than forecast, thanks to strong online sales. Coca-Cola KO, +0.69% announced it will offer voluntary separation packages to 4,000 workers. The markets U.S. stock futures ES00, +1.13% YM00, +0.82% NQ00, +1.63% rose. Gold GC00, +2.17% rallied, and oil futures CL.1, -1.62% wavered between gains and losses. Random reads This masterpiece painting has been stolen — for a third time. An unhatched dinosaur egg revealed a surprising face. Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. The emailed version will be sent out at about 7:30 a.m. Eastern."}]}