{"article": [{"url": "https://www.marketwatch.com/story/kodaks-stock-triples-as-company-announces-pandemic-plan-to-start-making-pharmaceutical-ingredients-2020-07-28", "published": 1596011840.0, "headline": "Kodak's stock triples as company announces pandemic plan to start making pharmaceutical ingredients", "body": "The Trump administration's $765 million loan to the Eastman Kodak Co. for its launch of a business making pharmaceutical ingredients sent shares of the iconic camera company soaring. Kodak's stock KODK, +12.98%  rallied more than 200% on Tuesday after the news was announced by the Trump administration. The company emerged from a 2011 bankruptcy in 2013, and its shares tumbled from a 10-year high of $37.20 on Jan. 9, 2014, to a low of $1.55 on March 23 of this year. \"Never again do we want to rely on shipments from China or elsewhere in order to get lifesaving medical supplies,\" New York Gov. Andrew Cuomo said in a statement. Kodak, which is based in Rochester, N.Y., and has a long history of manufacturing chemicals used in photographic film, now plans to support \"America's self-sufficiency in producing the key pharmaceutical ingredients we need to keep our citizens safe,\" Kodak's executive chairman, Jim Continenza, said in a statement. See also:U.S. case tally climbs above 4.3 million as Texas becomes fourth state with more than 400,000 cases The Trump administration said the Kodak deal is the first of its kind and uses powers afforded by the Defense Production Act. The administration previously used these powers to demand that Ford Motor Co. F, -1.36%  begin manufacturing respirators and masks and that General Motors Co. GM, -0.15%  make ventilators. It also awarded $354 million to Phlow Corp. in May to start producing active pharmaceutical ingredients, or API, among other chemical ingredients, used in certain essential medications. A spokesperson for Phlow said the company can't disclose the list of drugs, but it includes treatments for pain and blood pressure that can be used by hospitalized COVID-19 patients. The total contract is worth up to $812 million. Phlow cites a shift toward producing API in China and India as the rationale behind its business model. But one Wall Street analyst is questioning why these contracts were not awarded to companies like Amneal Pharmaceuticals Inc. AMRX, +4.85%, Mylan MYL, -0.50%, and Teva Pharmaceutical Industries Ltd. TEVA, -1.10%, all of whom have generic-drug manufacturing know-how. \"We find it puzzling why generic pharmaceutical companies who have the capabilities and know-how for this have not yet been awarded such contracts,\" SVB Leerink's Ami Fadia told investors on Wednesday. \"Bringing pharma manufacturing back to the U.S. is no easy feat and (we) continue to believe that leading generic manufacturers will eventually be part of the solution.\" Drug makers largely do not manufacture API in the U.S., and many have instead turned to lower-cost countries like China and India to source some or all of their API. Before the COVID-19 pandemic, there had been growing concern in the U.S. about where API were manufactured, driven in large part by generic-drug shortages and questions about the integrity and stability of the Chinese and Indian supply chains, especially as tensions with China have accelerated during a U.S. election year. Don't miss: Race for a COVID-19 vaccine has drug makers scaling up manufacturing - before one is developed Only 28% of the manufacturing facilities making ingredients used in drugs sold in the U.S. were produced domestically, as of August 2019, according to the Food and Drug Administration. Most of the remaining facilities producing ingredients for American pharmaceuticals are in China (13%), the European Union (26%) and India (18%). However, when it comes to ingredients used in U.S. medicines deemed \"essential\" by the World Health Organization, U.S.-based facilities produce only 21% of those ingredients, while China produces 15%. \"The number of Chinese facilities producing APIs for the U.S. market has increased over the past decade, as part of a massive movement of pharmaceutical production offshore,\" FDA official Dr. Janet Woodcock testified before a House committee hearing last year. \"This movement is being driven by the pharmaceutical industry's desire for cost savings and less stringent environmental regulations.\" Sandoz, the generic-drugs business of the Swiss drug company Novartis NVS, +0.97%, recently promoted the fact that less than 2% of its products have API that are single-sourced from China and India, a decision that \"highlighted the strength of its supply chain,\" Fadia told investors in April. The company also signed a deal Monday with the Austrian government to manufacture API there, including ingredients to supply penicillin to Europe for the next decade, \"despite fierce global price competition, particularly from China,\" it said. But then came the pandemic. The coronavirus swept through China and other parts of Asia, shutting down factories and clinical trials and creating worry for drug makers and investors who are well aware of America's reliance on Chinese API producers. The outbreaks of the virus in China presented \"primary near-term business risks in the pharmaceutical sector, particularly with respect to the sourcing of active pharmaceutical ingredients and associated intermediates from countries at the epicenter of the crisis, mainly China,\" Raymond James analysts told investors in mid-March. Read:Soaring demand for ventilators creates political tension, promises to ramp up manufacturing Premier Inc. PINC, -0.18%, which provides group purchasing and other health-care data services, has advocated for stronger domestic manufacturing of API for more than 15 years. It applauded the Kodak news - \"announcements of this nature are a step in the right direction\" - but also noted the challenges in building out an API manufacturing process from scratch. \"Premier is hopeful that the U.S. also looks at how it can leverage existing API manufacturing capacity in the country to help create global diversification and stabilize the drug supply chain in a more expedited and cost effective manner,\" Soumi Saha, Premier's senior director of advocacy, said in a statement. After Tuesday's 205% surge, Kodak's stock is up 72% for the year. The S&P 500 SPX, +0.87%  is down 0.4% in 2020."}]}