{"article": [{"url": "https://www.marketwatch.com/story/kodak-shareholders-were-not-the-only-beneficiaries-of-the-sudden-stock-surge-holders-of-convertible-bonds-also-saw-tidy-gains-2020-08-04", "published": 1596694880.0, "headline": "Kodak shareholders were not the only beneficiaries of the sudden stock surge - holders of convertible bonds also saw tidy gains", "body": "The sharp rally in Eastman Kodak Co.'s share price after news last week of a $765 million government loan to help it make drug ingredients at U.S. factories has offered shareholders and executives with stock options a tidy windfall. (function(){ var isStaging = (document.domain.indexOf('s.dev') > -1 || document.domain.indexOf('local') > -1); var htmlElement = document.documentElement; var site = htmlElement.getAttribute('data-site'); var michelangeloBaseUrl; var michelangeloFrameUrl, michelangeloTemplateUrl; if (site === 'marketwatch') { return; } if (isStaging) { michelangeloBaseUrl = \"https://api-staging-secure.wsj.net\"; } else { michelangeloBaseUrl = \"https://api-secure.wsj.net\"; } michelangeloFrameUrl = michelangeloBaseUrl + '/ui/michelangelo/Scripts/dist/michelangelo-frame/michelangelo-frame.min'; michelangeloTemplateUrl = michelangeloBaseUrl + '/api/s3/djcs-marketdata/michelangelo/templates/wsj/article.min'; if (site === 'barrons') { michelangeloBaseUrl = 'https://www.barrons.com/asset'; michelangeloFrameUrl = 'https://api.barrons.com' + '/ui/michelangelo/Scripts/dist/michelangelo-frame/michelangelo-frame.min'; michelangeloTemplateUrl = michelangeloBaseUrl + '/barrons/static_files/michaelangelo-barrons-template.min'; } requirejs.config({ paths: { \"michelangelo-frame\": michelangeloFrameUrl, \"wsjInset\": michelangeloTemplateUrl, \"jquery\": \"https://ajax.googleapis.com/ajax/libs/jquery/1.11.1/jquery.min\", \"lodash\":\"https://cdnjs.cloudflare.com/ajax/libs/lodash.js/2.4.1/lodash\" } }); require(['jquery','lodash'], function () { require(['michelangelo-frame','wsjInset'], function (Michelangelo, WSJChartInsetExtras) { var michelangeloMux; if (isStaging) { michelangeloMux = \"MuxStagingSecure\"; } else { michelangeloMux = \"MuxPublicSecure\"; } Michelangelo.ambience(michelangeloMux, '57494d5ed7ad44af85bc59a51dd87c90'); var id = \"d0f1237057184e1d8631f8d2b38156f9\"; if (id) { $(\"#chart_\" + id) .framedPresentation({}) .style(WSJChartInsetExtras.style) .cssFile('https://www.wsj.com/fonts/retina.css') .cssText(WSJChartInsetExtras.cssText) .callbacks(WSJChartInsetExtras.callbacks) .size({ width: 'fill', height: 'auto' }) .chartId(id) .defOverride({ includeCurrentQuotes: true }) .render(); } }); }); })(); But they're not the only ones to reap a reward from the increasing value of their holdings. On Monday, Kodak KODK, +12.98%  disclosed that the holders of its 5.00% convertible notes due in 2021, which were issued in May 2019, had converted notes valued at a total of $95 million into 29.9 million shares of Kodak common stock on July 29. Those notes were issued with a strike price of $3.175 per converted share. The stock closed at $33.20 on July 29, meaning the notes were worth just under $900 million. The stock has fallen 60% since then. The notes were originally sold to funds managed by Southeastern Asset Management Inc., an employee-owned investment firm based in Memphis, Tenn. That company is Kodak's biggest shareholder, with an 11.3% stake, equal to 4.96 million shares, according to FactSet data. The notes were held by Southeastern's Longleaf Partners Small-Cap Fund; C2W Partners Master Fund Limited, which is operated by Additive Advisory and Capital LLC; and Deseret Mutual Pension Trust, according to a regulatory filing. See:Kodak's stock triples as company announces pandemic plan to start making pharmaceutical ingredients Southeastern Asset Management and Kodak did not respond to requests for information on the bonds. The SEC declined to comment on the movement in Kodak's share price. But the SEC has launched an investigation of the trading in Kodak's shares before and after the news of the loan broke, the Wall Street Journal reported Tuesday, citing people familiar with the matter. The loan news caused Kodak's shares to climb to as high as $60 at their peak last week, before falling back to $15 on Monday, in massive trading volume that far exceeded the stock's longer-term average daily turnover. See also: Kodak's stock surge turned executive options into huge potential payday The stock had already moved 25% the day before the news was officially disclosed. Executives with stock options, including some awarded just a day before the loan became public, were sitting on big paper gains. Kodak had shared information on the loan with a few media outlets before the public announcement, according to media reports. Some had published that information before they were asked to delete it and respect an agreed-upon news embargo. Kodak's shares had mostly languished since the pioneering photography company emerged from bankruptcy in 2012. The company, a member of the blue-chip Dow Jones Industrial Average as recently as 2004, has made several efforts to reinvent itself and enjoyed a brief stock rally in 2018 after announcing plans to get in on the blockchain and cryptocurrency craze. News of the SEC probe came after Sen. Elizabeth Warren, a Democrat from Massachusetts, wrote an open letter to SEC Chairman Jay Clayton urging his agency to investigate \"potential incidents of insider trading prior to the July 28, 2020, public announcement of the Trump administration's $765 million loan to Eastman Kodak Co. (Kodak) to support the production of generic drug ingredients in response to the coronavirus disease 2019 (COVID-19) pandemic.\" Kodak shares fell nearly 4% on Tuesday but are up nearly 210% in 2020, while the S&P SPX, +0.87%  has gained 2.3% in the year to date. The Dow industrials DJIA, +0.56%  are down 6% this year as of Tuesday's closing bell."}]}