{"article": [{"url": "https://www.marketwatch.com/story/trumps-convention-breaks-norms-and-possibly-the-hatch-act-2020-08-25", "published": 1598399300.0, "headline": "Trump's convention breaks norms - and possibly the Hatch Act", "body": "WASHINGTON - Plenty of presidents have walked right up to the line separating official business from politics - or even stepped over it. President Donald Trump has blown past it with a bulldozer, and his planned Republican convention speech from the White House lawn this week might be the latest and most blatant example yet. Down in the polls and facing the headwinds of a coronavirus-battered economy, Trump made the case that the White House is the easiest location for the Secret Service and law enforcement to secure for his acceptance speech after Republicans were forced to scale back their convention because of the pandemic. Left unsaid was that the Executive Mansion offers Trump a grand setting as he attempts to make his case that voters should stick with him in the midst of a health catastrophe that has touched nearly every aspect of American life. \"What makes this particularly galling is that the president owns a hotel four blocks away from the White House that he's shown no qualms about profiting from over the course of his presidency,\" said Donald Sherman, deputy director of the nonprofit government watchdog group Citizens for Responsibility and Ethics in Washington. \"Now he feels compelled to use the White House grounds to deliver this political speech?\" That's not the only mixing of government and politics this week: Secretary of State Mike Pompeo is among the Trump Cabinet officials who will address the convention, in his case a recorded address from Jerusalem while on a taxpayer-funded trip to the region. Agriculture Secretary Sonny Perdue talked up Trump's reelection during an \"official\" visit Monday to a North Carolina farm with the president. And Trump himself appeared Tuesday night in two videos produced in part by the White House as he blended official acts and campaigning. A video featuring Trump signing a pardon for Jon Ponder, an ex-convict who now runs an acclaimed prisoner reentry program, aired minutes into Tuesday night's program. Later, ruffles and flourishes rang out ahead of \"Hail to the Chief\" as military aides opened the doors to the White House Cross Hall for Trump to preside over a naturalization ceremony for new Americans. Both events were taped in recent days as Trump and his re-election campaign looked to find ways to present a softer image to the American people. Under a federal law known as the Hatch Act, civilian employees in the executive branch cannot use their titles when doing political work. They are also prohibited from taking part in any partisan activity while on the clock. The president and the vice president are exempt from the rules. Democratic nominee Joe Biden's campaign criticized Pompeo's speech, which is to air Tuesday evening. \"Secretary Pompeo's decision to address the Republican convention from Jerusalem isn't just an abuse of taxpayer dollars, it undermines the critical work being done by the State Department,\" said Kate Bedingfield, Biden's deputy campaign manager. The independent Office of Special Counsel advised lawmakers earlier this month that White House advisers would not be in violation of Hatch Act rules by taking part in the convention if the event was held on the lawn or in the residence and they attended while off-duty. But if the event were held in the West Wing or in another area of the White House that is regarded as a federal room, White House officials would be prohibited from attending even while off-duty. In addition to Pompeo, Housing and Urban Development Secretary Ben Carson as well as White House senior advisers Kellyanne Conway, Ivanka Trump and Ja'Ron Smith are all slated to address the convention. The administration officials are expected to not use their titles to avoid violations, and all - with the exception of Ivanka Trump - are slated to deliver their remarks live or pre-recorded from a location outside the White House complex. Traditionally, the big four Cabinet members - the secretaries of state, defense, treasury and attorney general - have not attended the convention. Multiple officials involved in the planning process insisted that teams of lawyers from the White House, the Trump campaign and the Republican National Committee reviewed convention plans to avoid any Hatch Act violations. The officials said the events on the White House grounds were consistent with previous presidents using the White House residence for political videos. It's only the second time that a president will deliver his acceptance speech at the White House. In 1940, President Franklin D. Roosevelt delivered his acceptance speech from the White House via radio to the Democratic convention that nominated him for an unprecedented third term. \"Any government employees who may participate will do so in compliance with the Hatch Act,\" White House spokesman Judd Deere said in a statement. Ivanka Trump, who in addition to her White House role is the president's daughter, is scheduled to introduce her father before his acceptance speech on Thursday. Her office said in a statement that she will be participating outside of normal working hours and will be speaking in her personal capacity as the president's daughter. Neil Eggleston, who served as White House counsel in the President Barack Obama administration, however, said that while Ivanka Trump and others can take part in the convention while staying on the right side of the law, \"it's completely contrary to the norms.\" \"People talk about the White House as the People's House,\" Eggleston said. \"Political parties come and go, but it doesn't belong to one political party or the other.\" The Trump administration is hardly the first to mix business with politics. Obama, for instance, allowed five members of his Cabinet to address the party's 2012 convention in Charlotte, North Carolina, as he sought reelection. Four years later, as his former secretary of state, Hillary Clinton, sought the White House, Obama decided to prohibit Cabinet members from taking part. In 2012, Kathleen Sebelius, Obama's health and human services secretary, was cited for violating federal law prohibiting Cabinet members from engaging in politics on the clock when she called for the president's reelection and touted the candidacy of another Democrat at an event she was attending in her official capacity. In 2011, a report by Office of Special Counsel found that during the George W. Bush administration, senior staff members at the Office of Political Affairs violated the Hatch Act by organizing dozens of political briefings from 2001 to 2007 for Republican appointees at top federal agencies in an effort to enlist them to help elect Republicans to Congress. The Trump administration has repeatedly stepped over the line, ethics experts said. Perdue stepped into politics on Monday during a visit with the president to Mills River, North Carolina, to spotlight a federal food distribution program to assist workers impacted by the virus. Perdue noted appreciatively the many Trump supporters who lined the motorcade route en route to the event. \"Those were part of those forgotten people that voted for you for 2016,\" Perdue said. \"And I've got better news for you: They and many others are going to vote for you for four more years in 2020.\" In November 2018, the Office of Special Counsel found six White House officials in violation for tweeting or retweeting the president's 2016 campaign slogan \"Make America Great Again\" from their official Twitter accounts. Most notably, the office recommended in June 2019 that White House counselor Kellyanne Conway be fired. Trump refused to take action against Conway, suggesting that the office was trying to take away her right to free speech. Conway, who announced this week she will be leaving the White House for personal reasons by the end of the month, is scheduled to deliver remarks to the convention on Wednesday. Democrats have also pointed to other alleged abuses of power by Trump that had a political slant. In July, Attorney General William Barr deployed National Guard troops to clear the area outside the White House of demonstrators protesting police brutality minutes before Trump decided to stroll to a nearby historic church for a photo op. The president acknowledged earlier this month - before altering his public position - that he's starving the U.S. Postal Service of money to make it harder to process an expected surge of mail-in ballots, which he worries could cost him the election. Richard Painter, who served as the White House chief ethics lawyer during the George W. Bush administration, said it's unlikely that Trump's use of the White House backdrop to help his reelection effort will make a difference to the outcome of the election. But the deliberate thumbing of his nose at ethics rules and historic norms points to a \"great danger.\" \"It goes to the core problem that the government - including the State Department and Department of Justice - are being used as extensions of the Donald Trump campaign,\" Painter said. \"This is about a lot more than Kellyanne Conway or Ivanka Trump or someone else in the administration showing up to give a campaign speech on the White House lawn.\""}]}