{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-climb-following-stock-markets-cue-on-vaccine-optimism-2020-07-15", "published": 1594829540.0, "headline": "Treasury yields rise, following stock-marketâ\u0080\u0099s cue on vaccine optimism", "body": "U.S. Treasury yields rose Wednesday as equities markets rallied on reports of progress on a coronvirus vaccine from two pharmaceutical companies that raise the chances of an economic recovery from the pandemic. What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% Â rose 1.5 basis points to 0.629%, while the 2-year note rate TMUBMUSD02Y, 0.156% Â was flat at 0.153%. The 30-year bond yield TMUBMUSD30Y, 1.576% Â climbed 2.8 basis points to 1.330%, marking its biggest daily jump in three weeks.Whatâ\u0080\u0099s driving Treasurys? The bond market followed the stock marketâ\u0080\u0099s tune as the S&P 500 SPX, +0.87% Â index and Dow Jones Industrial Average DJIA, +0.56% Â rose, weighing on demand for government debt. Global equities were buoyed after Moderna Inc. MRNA, +0.09% Â said its coronavirus vaccine candidate produced a â\u0080\u009crobustâ\u0080\u009d immune-system response in a larger group of people and that the study would move to a decisive clinical trial in July. Also U.K. television broadcaster ITV reported on speculation around potentially positive developments for an Oxford vaccine candidate backed by AstraZeneca PLC AZN, +0.63% Â AZN, +1.16%. On Tuesday, Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said he was â\u0080\u009ccautiously optimisticâ\u0080\u009d about the development of a coronavirus vaccine. However, tensions between U.S. and China continued to heat up. Meanwhile, President Donald Trump late Tuesday said he signed a bipartisan bill sanctioning China for its security crackdown on Hong Kong as well as an executive order to hold China accountable for â\u0080\u009coppressive actionsâ\u0080\u009d against the former British colonyâ\u0080\u0099s people. Trump also said he had signed an order ending U.S. preferential treatment for Hong Kong. China said it would impose retaliatory sanctions against U.S. individuals and entities, news reports said. In U.S. economic data, business activity in New York State increased in July for the first time since the pandemic began in March, according to the New York Fedâ\u0080\u0099s Empire State Manufacturing Survey released Wednesday. The Empire State business conditions index rose to 17.2 in July from negative 0.2 in the prior month. A reading above to zero indicates improving conditions. In other data, U.S. industrial production surged by 5.4% in June, the second straight gain after a steep drop in March and April. Meanwhile, the Federal Reserveâ\u0080\u0099s Beige Book reported economic activity increased in almost all 12 districts, but remained well below where it was prior to the COVID-19 pandemic.What did market participantsâ\u0080\u0099 say? â\u0080\u009dThe mirrored trading of stocks and bonds is a testament to the crucial role that sentiment continues to play in determining the intraday moves in financial markets,â\u0080\u009d said Jon Hill, an interest-rate strategist at BMO Capital Markets, in a note."}]}