{"article": [{"url": "https://www.marketwatch.com/story/we-want-to-leave-colder-midwest-states-for-warmer-and-drier-climes-and-good-affordable-health-care-on-44000-a-year-so-where-should-we-retire-2020-09-24", "published": 1601722160.0, "headline": "We want to leave cold Midwest states for 'warmer and drier climes' and affordable health care on $44,000 a year - so where should we retire?", "body": "Dear MarketWatch, My wife and I will be retiring in five years. We have lived in colder northern Midwest states for most of our lives and are ready to live in warmer and drier climes! We will have an annual combined income of $44,000 from Social Security. We will also have approximately $600,000 total in my 403(b) and traditional IRAs. In addition to a warmer, drier climate, we would like good options for outdoor activities, especially hiking. We'll be selling our home in Michigan, which should net about $200,000. We hope to buy with, at most, a very small mortgage. So we plan to keep the total housing expense below $1,000 a month. We lived in Arizona for a time while in the military and wonder if that is a good state to retire. Although we would like to be somewhat close to a larger metro area for cultural offerings, we prefer to live in a smaller city or suburban area. We have been torn between retiring close to children in Omaha, Neb. and Tucson, Ariz. (my preference). We would like to be closer to good, affordable health care, which increases the attractiveness of Omaha. A nice-to-have would be a more multicultural location, with various cultural offerings, which is what I think of in Tucson. But perhaps Lincoln, Neb.? So I'm not willing to make climate and average temperature a make-or-break issue, I think we are more interested in a lower overall housing cost, health care, and recreation opportunities. And if we can find that in a multicultural area we would be elated. John Dear John, You're on the right track. I'm thinking a college town could give you much of what you want. The other question is how close you want to be to your adult children, or perhaps more accurately, the grandchildren. Do you want to be available for last-minute babysitting and chauffeuring, or do you prefer to be a bit of a drive away? And what do your kids want? Will they let you help? And let you spoil the grandchildren? Or do they have firm ideas about what you can and can't do, down to what snacks you can offer? Finally, if you move to their part of the country, are they likely to stay there as you age? If not, perhaps you want to make this move for you and a subsequent move to be closer to them when you need their help. To find your spot, I asked MarketWatch's retirement tool for help. My \"must haves\": a metro area of 100,000 to 250,000, a college town (defined here as home to top research universities), a five-star-rated Medicare hospital, a top-rated cancer hospital and median home prices below $250,000. My \"nice to haves\": a below-average cost of living, a national forest and a national wildlife refuge (for recreational opportunities beyond the standard state and local parks), an airport and public transit. I left out any temperature requirements. At first I narrowed it down to the regions where your children are but later opened it up to anywhere in the U.S. I ruled out any place much further north than Omaha because of weather (sorry, Sioux City, Iowa). No metro delivered 100%, but both Lincoln (capital of Nebraska, home to the main campus of the University of Nebraska and 290,000 people) and Tucson (550,000 people) rank well for what you want. Obviously they are very different in weather. Read:5 things to know about health care in retirement Also: Health care will cost this much in retirement - but probably even more I encourage you to see what results you get using other criteria, such as weather or a different metro size. You can sort by either population or cost of living. Data can only tell you so much, of course. And be sure to visit in the least-pleasant weather so you have a true picture of what you're getting. Not that you can't spend some time in Tucson during the winter or Omaha during the summer. Here are three suggestions beyond Lincoln and Tucson. Kayakers enjoy the Terry Trueblood Recreation Area in Iowa City. Justin Torner/courtesy Think Iowa City Instead of Lincoln, Nebraskaâ\u0080¦. Iowa City, Iowa The Iowa City metro area, with just over 170,000 people, including nearly 80,000 in Iowa City and more than 21,000 in the suburb of Coralville, came out on top for the criteria I entered, even when I looked at the entire U.S. It met 90% of the wish list. All that's missing is an airport - but the Eastern Iowa Airport in Cedar Rapids is 30 minutes away - and a national wildlife refuge (though there is a state wildlife management area nearby). Iowa City is home to the University of Iowa (more than 32,000 students, so bigger than the University of Nebraska) and the renowned Iowa Writers Workshop. You'll find some big-city entertainment offerings at the university's Hancher Auditorium, and of course there is plenty of Big Ten sports action if that's your thing. And if you care a lot about politics, you can revel in the attention of the presidential caucuses every four years. While all three of my suggestions have an above-average number of primary-care physicians per 100,000 people, according to data from the University of Wisconsin Population Health Institute. County Health Rankings & Roadmaps 2020, Iowa City fares best. (Lincoln, by the way, falls below the U.S. average.) Yes, Iowa is pretty flat. But you can still find some good hiking. Nearby Lake Macbride State Park is one place to start. A surprise: The Herbert Hoover Presidential Library is just east of Iowa City. Or you can explore the 375-million-year-old fossilized Devonian ocean floor at Coralville Lake. Iowa City is less diverse than the U.S. as a whole, but more diverse than Lincoln. The presence of a major university, however, should provide some of the multicultural feeling you are seeking. The website Livability loves this city - it ranked Iowa City second in 2017 and fourth in both 2018 and 2019 among its best places to live. There's no sugarcoating this: you will still have winter. Average highs in January are just below freezing, so perhaps that's not much of an improvement over Michigan. Lincoln is only a few degrees warmer. Time to visit the grandchildren in Tucson? Humidity for the metro area during July, measured by dew point, just crosses the line into what could be considered high humidity, according to data from Prism Climate Group, part of Oregon State University. A disadvantage to Iowa City could be the distance to Omaha and family. It's nearly a four-hour drive, rather than 1 hour from Lincoln. Sperling's Best Places says housing in Iowa City is more expensive than Lincoln, though both are well below the national average. Here's what kind of house your money will buy you in Iowa City, using listings on Realtor.com (which, like MarketWatch, is owned by News Corp.), as well as those in Lincoln. The Albuquerque International Balloon Fiesta is in the skies above both Albuquerque and Rio Rancho. The Rio Grande helps separate the two cities. Getty Images Instead of Tucsonâ\u0080¦Rio Rancho, New Mexico You say you prefer suburbs to the city. Rio Rancho, just north of Albuquerque, gives you that. The main city in sprawling Sandoval County, Rio Rancho has 100,000 residents and is growing quickly. The local Chamber of Commerce boasts that the city has the lowest crime rate in the state and low property taxes. It's popular with retirees; over-55 communities are scattered throughout. You're practically next door to Albuquerque, which with 560,000 residents is similar to Tucson, or you can catch the Rail Runner train 10 minutes away in neighboring Bernalillo and be in Santa Fe in 30 minutes. The cost of living is comparable to Tucson, according to Sperling's Best Places (though the Chamber of Commerce says you'll find more in your price point in Rio Rancho). Where Rio Rancho has an edge is with its milder summer climate -- average July highs are 91 degrees, compared with 100 degrees in Tucson. The area gets four seasons, none extreme; locals say that if it snows, don't bother shoveling because it will probably be gone by noon. Your desire for quality health care is fulfilled with two local hospitals -- UNM Sandoval Regional Medical Center (which is now the center for all orthopedic surgery within the UNM medical system) and Presbyterian Rust Medical Center. Hiking? Try the foothills of the Sandia Mountains on the eastern side of Albuquerque or the Valles Caldera National Preserve (part of the National Park Service) northwest of Santa Fe. Both are a bit of a drive. New Mexico has a distinctive culture. Within Sandoval County are nine Native American pueblos on top of the Gathering of Nations, the largest pow-wow in North America, in Albuquerque, located in Bernalillo County. There's also a large Hispanic population. And if you don't know about green vs red chilesâ\u0080¦ With Albuquerque less than a half-hour away from Rio Rancho, you'd have easy access to the city's (and university's) cultural events as well as the airport. Read more about Albuquerque here and here. But you don't always have to go to Albuquerque for events. The 7,000-seat Rio Rancho Events Center has attracted some big-name acts, and the city is building a new amphitheater as another cultural venue. At the moment, there are no nonstop flights to Tucson. The drive is 6½ hours. Here's what the housing market looks like in Rio Rancho today, using listings on Realtor.com. You can contrast that with Tucson. Upper Table Rock and Lower Table Rock are about 15 miles north of Medford, Ore. courtesy Visit Medford Wild card: Oregon's Rogue Valley For another \"warmer and drier\" option, I looked in the Pacific Northwest. This is pricier than both Midwest college towns and the Southwest, so I bumped up below-average cost of living to a must-have, and I left out the size of the metro area. I got Walla Walla, but I feared that at 33,000 residents it was too small for the amenities you want, given the cities you were considering. Spokane? Too much snow. I settled on Orgeon's Rogue Valley, an area that has low summer humidity even as average highs reach into the upper 80s, modest rainfall and little snow. The cost of living is below the national average, according to government data, but housing is on the pricier side. The center is Ashland, home of Southern Oregon University and the renowned Oregon Shakespeare Festival. It's also the most expensive part of the metro area, so start by looking at Medford, 15 miles away and home to 83,000 people. Here's what's on the market there now, according to Realtor.com listings. A word of warning: This part of Oregon usually isn't hit by wildfires. That changed this year, and you will have to decide whether 2020 was a one-off or a harbinger of a new future. Medford is surrounded by forests and mountains, which in better times means plenty of the hiking opportunities you want. You can also drive 65 miles to Crater Lake National Park, created by the collapse of a volcano and where the Rogue River starts its journey to the Pacific Ocean. Or you can explore the state's southernmost wine region; the Rogue Valley has three valleys with distinct climates and 88 vineyards, many around Medford and Ashland. The airport in town will get you to other western destinations, but not Tucson. Medford is popular with retirees; the Census Bureau says 17% of the population is 65 or older. However, it's no more diverse than Lincoln or Iowa City. Readers, where should John and his wife retire? Leave your suggestions in the comments section."}]}