{"article": [{"url": "https://www.marketwatch.com/story/fact-checking-the-republican-claim-that-biden-plans-to-defund-the-police-and-bidens-claim-that-trump-put-brake-on-coronavirus-tests-2020-07-11", "published": 1594431680.0, "headline": "Fact checking the Republican claim that Biden plans to defund the police, and Bidenâ\u0080\u0099s claim that Trump put brake on coronavirus tests", "body": "WASHINGTON (AP) â\u0080\u0094 President Donald Trumpâ\u0080\u0099s campaign team is misrepresenting Democratic rival Joe Bidenâ\u0080\u0099s stance on improving police practices following George Floydâ\u0080\u0099s death. In ads and emails this week, the Trump campaign and the Republican National Committee assert that Biden would â\u0080\u009cdefund the police.â\u0080\u009d Thatâ\u0080\u0099s not Bidenâ\u0080\u0099s position. The former vice president has repeatedly made clear he would boost money for social services and condition federal dollars on police adhering to standards. Meanwhile, Biden left out some context when he asserted that Trump had ordered the government to slow down coronavirus testing. A look at some of the claims from the campaign: â\u0080¢ In a Trump campaign ad, playing out a scenario where a person needing help calls the police during a Biden presidency and gets a voice recording: â\u0080\u009cYou have reached the 911 police emergency line. Due to defunding of the police department, weâ\u0080\u0099re sorry but no one is here to take your call.â\u0080\u009d The ad closes with the message: â\u0080\u009cYou wonâ\u0080\u0099t be safe in Joe Bidenâ\u0080\u0099s America.â\u0080\u009d Vice President Joe Biden speaks at the seventh Democratic 2020 presidential debate at Drake University in Des Moines on Jan. 14. Reuters Biden has not joined the call of protesters for whom â\u0080\u009cdefund the policeâ\u0080\u009d became a rallying cry after Floydâ\u0080\u0099s killing in Minneapolis. Biden has proposed more money for police, conditioned on improvements in their practices. â\u0080\u009cI donâ\u0080\u0099t support defunding the police,â\u0080\u009d Biden said last month in a CBS interview. But he said he would support tying federal aid to police based on whether â\u0080\u009cthey meet certain basic standards of decency, honorableness and, in fact, are able to demonstrate they can protect the community, everybody in the community.â\u0080\u009d Biden added in remarks Wednesday to reporters: â\u0080\u009cWe donâ\u0080\u0099t have to defund the police departments; we have to make sure they meet minimum basic standards of decency.â\u0080\u009d Bidenâ\u0080\u0099s criminal-justice agenda, released long before he became the Democratsâ\u0080\u0099 presumptive presidential nominee, proposes more federal money for â\u0080\u009ctraining that is needed to avert tragic, unjustifiable deathsâ\u0080\u009d and hiring more officers to ensure that departments are racially and ethnically reflective of the populations they serve. Specifically, he calls for a $300 million infusion into federal community-policing grant programs. That adds up to more money for police, not defunding law enforcement. Biden also wants the federal government to spend more on education, social services and struggling areas of cities and in rural America, to address the root causes of crime. Democrats, meanwhile, have pointed to Trumpâ\u0080\u0099s repeated proposals in the administrationâ\u0080\u0099s budget to cut community policing and mediation programs at the Justice Department. Congressional Republicans say the program can be effectively merged with other divisions, but Democrats have repeatedly blocked the effort. The program has been used to help provide federal oversight of local police departments. Despite proposed cuts, Attorney General William Barr last month said the department would use the COPS program funding to hire over 2,700 police officers at nearly 600 departments across the country. â\u0080¢ In a Republican National Committee email Wednesday from Steve Guest, RNCâ\u0080\u0099s rapid response director, itâ\u0080\u0099s stated that, â\u0080\u009cIn the wake of rioting, looting, and tragic murders ripping apart communities across the country, Joe Biden said â\u0080\u0098Yes, absolutelyâ\u0080\u0099 he wants to defund the police.â\u0080\u009d Thatâ\u0080\u0099s misleading, and includes a selective use of Bidenâ\u0080\u0099s words on the subject. The email links to an excerpted video of Bidenâ\u0080\u0099s conversation with activist Ady Barkan, who endorsed Biden on Wednesday after supporting Sens. Elizabeth Warren of Massachusetts and Bernie Sanders of Vermont during the Democratic primaries. A full recording of that conversation provided by the Biden campaign to the Associated Press shows he once again declined to support defunding police. Barkan raises the issue of police reform and asks whether Biden would funnel money into social services, mental-health counseling and affordable housing to help reduce civilian interactions with police. Biden responds that he is calling for more money for mental-health providers but â\u0080\u009cthatâ\u0080\u0099s not the same as getting rid of or defunding all the policeâ\u0080\u009d and that both approaches are needed, including additional dollars for community police. Asked again by Barkan, â\u0080\u009cSo we agree that we can redirect some of the funding?â\u0080\u009d Biden then answers, â\u0080\u009cAbsolutely, yes.â\u0080\u009d Biden then gives the caveat that he means â\u0080\u009cnot just redirectâ\u0080\u009d federal money potentially but â\u0080\u009cconditionâ\u0080\u009d it on police improvements. â\u0080\u009cIf they donâ\u0080\u0099t eliminate chokeholds, they donâ\u0080\u0099t get [federal] grants; if they donâ\u0080\u0099t do the following, they donâ\u0080\u0099t get any help,â\u0080\u009d Biden replied. â\u0080\u009cThe vast majority of all police departments are funded by the locality, funded by the municipality, funded by the state,â\u0080\u009d he added. â\u0080\u009cItâ\u0080\u0099s only the federal government comes in on top of that, and so it says you want help, you have to do the following reforms.â\u0080\u009d â\u0080¢ Biden, speaking Wednesday of the rise in U.S. coronavirus infections to more than 3 million, said, â\u0080\u009cPresident Trump claimed to the American people that he was a wartime leader, but instead of taking responsibility, Trump has waved a white flag, revealing that he ordered the slowing of testing and having his administration tell Americans that they simply need to â\u0080\u0098live with it.â\u0080\u0099 â\u0080\u0099â\u0080\u0099 There is no evidence that the government did slow testing on the orders of the president. Trump told a Tulsa, Okla., rally on June 20 that he said â\u0080\u009cto my people, â\u0080\u0098Slow the testing down, pleaseâ\u0080\u0099 â\u0080\u009d because â\u0080\u009cthey test and they test.â\u0080\u009d Trade adviser Peter Navarro and White House press secretary, among other Trump aides and allies, quickly mounted the defense that Trump had been speaking in a tongue-in-cheek manner at the Tulsa rally. But Trump went on to contradict that line of defense, saying, â\u0080\u009cI donâ\u0080\u0099t kid.â\u0080\u009d In any event, a succession of his public health officials testified to Congress that the president never asked them to slow testing and that they were doing all they could to increase it. But testing remains markedly insufficient. Coronavirus daily update:Health officials clamor for U.S. states to pause reopenings amid spikes in COVID-19 infections"}]}