{"article": [{"url": "https://www.marketwatch.com/story/the-father-of-jacob-blake-the-black-man-who-was-shot-by-police-in-wisconsin-says-his-son-is-paralyzed-from-the-waist-down-2020-08-25", "published": 1598350580.0, "headline": "The father of Jacob Blake, the Black man who was shot by police in Wisconsin, says his son is paralyzed from the waist down", "body": "KENOSHA, Wis. (AP) — The father of Jacob Blake, a Black man who was shot by police in Kenosha, Wis., says his son was left paralyzed from the waist down. Blake’s father told the Chicago Sun-Times that he was told his son was shot eight times during the Sunday evening confrontation with police, which was captured on cellphone video and led to two nights of unrest in the city abutting Lake Michigan roughly equidistant from Milwaukee and Chicago. See also: ‘We are scared as Black people in America’: LeBron James and other athletes express anger over Jacob Blake shooting The father, who is also named Jacob Blake and who was driving from Charlotte, N.C., to Kenosha to be with his son, told the newspaper that he learned Sunday night that officers had shot his son eight times and that he saw the now-viral video of it online a few minutes later that appears to show police shoot his son in the back. He said his son now has “eight holes” in his body and is paralyzed from the waist down, though doctors don’t know if the paralysis will be permanent. Anger over the shooting spilled into the streets of Kenosha for a second night Monday, with police again firing tear gas at hundreds of protesters who defied a curfew, threw bottles and shot fireworks at law enforcement guarding the courthouse. The southeastern Wisconsin city became the nation’s latest flashpoint in a summer of racial unrest after cellphone footage of police shooting Blake as he leaned into his SUV — apparently while three of his children were sitting in the vehicle — circulated widely on social media. The 29-year-old was hospitalized in serious condition. The shooting drew condemnation from Democratic Gov. Tony Evers, who also called out 125 members of the National Guard on Monday after protesters set cars on fire, smashed windows and clashed with officers in riot gear the previous night. Police first fired tear gas Monday about 30 minutes after the 8 p.m. curfew took effect to disperse protesters who chanted, “No justice, no peace” as they confronted a line of officers who wore protective gear and stood shoulder-to-shoulder in front of the courthouse entrance. But hundreds of people stuck around, screaming at police and lighting fires, including to a garbage truck near the courthouse. Tensions had flared anew earlier Monday after a news conference with Kenosha Mayor John Antarmian, originally to be held in a park, was moved inside the city’s public safety building. Hundreds of protesters rushed to the building and a door was snapped off its hinges before police in riot gear pepper-sprayed the crowd, which included a photographer from the Associated Press. Police in the former auto manufacturing center of 100,000 people midway between Milwaukee and Chicago said they were responding to a call about a domestic dispute when they encountered Blake on Sunday. They did not say whether Blake was armed or why police opened fire, they released no details on the dispute, and they did not immediately disclose the race of the three officers at the scene. The man who said he made the cellphone video, 22-year-old Raysean White, said he saw Blake scuffling with three officers and heard them yell, “Drop the knife! Drop the knife!” before the gunfire erupted. He said he didn’t see a knife in Blake’s hands. The governor said he had seen no information to suggest Blake had a knife or other weapon, but that the case is still being investigated by the state Justice Department. The officers were placed on administrative leave, which is standard practice in a shooting by police. Authorities released no details about the officers and did not immediately respond to requests for their service records. Evers was quick to condemn the bloodshed, saying that while not all details were known, “what we know for certain is that he is not the first Black man or person to have been shot or injured or mercilessly killed at the hands of individuals in law enforcement in our state or our country.” Democratic presidential nominee Joe Biden said the officers “must be held accountable.” “This morning, the nation wakes up yet again with grief and outrage that yet another Black American is a victim of excessive force,” he said, just over two months before Election Day in a country already roiled by the recent deaths of George Floyd in Minneapolis, Rayshard Brooks in Atlanta and Breonna Taylor in Louisville, Ky. “Those shots pierce the soul of our nation.” Republicans and the police union accused the politicians of rushing to judgment, reflecting the deep partisan divide in Wisconsin, a key presidential battleground state. Wisconsin GOP members also decried the violent protests, echoing the law-and-order theme that President Donald Trump has been using in his re-election campaign. “As always, the video currently circulating does not capture all the intricacies of a highly dynamic incident,” Pete Deates, president of the Kenosha police union, said in a statement. He called the governor’s statement “wholly irresponsible.” The shooting happened around 5 p.m. Sunday and was captured from across the street on the video posted online. Kenosha police do not have body cameras but do have body microphones. In the footage, Blake walks from the sidewalk around the front of his SUV to his driver-side door as officers follow him with their guns pointed and shout at him. As Blake opens the door and leans into the SUV, an officer grabs his shirt from behind and opens fire while Blake has his back turned. Seven shots can be heard, though it isn’t clear how many struck Blake or how many officers fired. White, who said he made the video, said that before the gunfire, he looked out his window and saw six or seven women shouting at each other on the sidewalk. A few moments later, Blake drove up in his SUV and told his son, who was standing nearby, to get in the vehicle, according to White. White said Blake did not say anything to the women. White said he left the window for a few minutes, and when he came back, saw three officers wrestling with Blake. One punched Blake in the ribs, and another used a stun gun on him, White said. He said Blake got free and started walking away as officers yelled about a knife. Civil-rights attorney Ben Crump, representing Blake’s family, said Blake was “simply trying to do the right thing by intervening in a domestic incident.” Police did not immediately confirm either man’s account. Blake’s partner, Laquisha Booker, told NBC’s Milwaukee affiliate, WTMJ-TV, that the couple’s three children were in the back seat of the SUV when police shot him. “That man just literally grabbed him by his shirt and looked the other way and was just shooting him. With the kids in the back screaming. Screaming,” Booker said. Blake’s father told the Sun-Times that his son also has three other kids. Blake’s grandfather, Jacob Blake Sr., was a prominent minister and civil-rights leader in the Chicago area who helped organize a march and spoke in support of a comprehensive housing law in Evanston, Ill., days after the 1968 slaying of the Rev. Martin Luther King Jr. Rachel Noerdlinger, publicist for the National Action Network, told the Associated Press that the Rev. Al Sharpton spoke Monday to Blake’s father, who called the civil rights leader for his support. Blake’s father will speak at Sharpton’s March on Washington commemoration on Friday, Noerdlinger said. Karissa Lewis, national field director of Movement for Black Lives, a coalition of more than 150 Black-led organizations that make up the broader Black Lives Matter movement, said the shooting was yet another example of why activists have called for defunding police departments. “There’s no amount of training or reform that can teach a police officer that it’s wrong to shoot a Black man in the back seven times while his children watch,” Lewis said in a statement first shared with the AP. Online court records indicate Kenosha County prosecutors charged Blake on July 6 with sexual assault, trespassing and disorderly conduct in connection with domestic abuse. An arrest warrant was issued the following day. The records contain no further details and do not list an attorney for Blake. It was unclear whether that case had anything to do with the shooting. A protester stands near a burning garbage truck outside the Kenosha County Courthouse late Monday. Associated Press Crump, who has also represented the Floyd and Taylor families, said Blake’s family has asked that demonstrations in response to his shooting remain peaceful. “They don’t believe violence to be the solution,” he said. For more than 100 years, Kenosha was an auto manufacturing center, but it has now largely been transformed into a bedroom community for Milwaukee and Chicago. The city is about 67% white, 11.5% Black and 17.6% Hispanic, according to 2019 Census data. Both the mayor and police chief are white. About 17% of the population lives in poverty."}]}