{"article": [{"url": "https://www.marketwatch.com/story/with-a-potential-selloff-looming-investors-need-to-rethink-their-approach-when-it-comes-to-big-tech-barclays-strategist-warns-11602096956", "published": 1602083660.0, "headline": "With a potential selloff looming, investors need to rethink their approach to Big Tech, Barclays strategist warns", "body": "MarketWatch photo illustration/Getty Images “ ‘History is littered with examples of changes in the regime, be it political changes and the sociopolitical backdrop, macroeconomics or indeed regulatory, and so the message to investors really is to make sure that you don’t let your portfolio, or your batch of investments, get sucked into that ever smaller, more concentrated batch of recent winners.’ ” That’s Barclays Wealth Chief Investment Officer, Will Hobbs, warning in an interview on CNBC published on Wednesday of a potential selloff in big technology company stocks such as Amazon AMZN, +3.01%, Apple AAPL, +1.74%, Alphabet GOOG, +1.97%, Netflix NFLX, +1.43%, Tesla TSLA, +1.89%, Microsoft MSFT, +2.48% etc., in the face of rising interest rates. “One of the theories around the current context for markets is that a lot of it is quite dependent on ever-lower real interest rates, because if you think about the valuation of some of these tech titans, think about the shape of their cash flows, they’re sort of like long-duration bonds,” Hobbs said. He explained that these big tech winners have been the beneficiary of falling interest rates for years now, but he warned that it won’t last forever, particularly in light of the world’s unprecedented policy environment. “The industry has long been obsessed, and investors are understandably obsessed with the idea that you can protect downside and capture equity upside,” Hobbs said. “That is like the Holy Grail of investing.” He added that a shake-up is in order for investors leaning too heavily on the tech companies driving the bull market. “You have to own some losers as well, because you have to plan for a future that isn’t just a continuation of the recent past, as so often isn’t the case,” Hobbs said. His comments were published in the wake of a U.S. House subcommittee report, which concluded this week that Big Tech dominance poses a grave threat to market that might require breaking up top U.S. tech companies. “To put it simply, companies that once were scrappy, underdog startups that challenged the status quo have become the kinds of monopolies we last saw in the era of oil barons and railroad tycoons,” Rep. David Cicilline, D-R.I., chairman of the House Judiciary Antitrust, Commercial and Administrative Law Subcommittee, said in a statement. As for Wednesday’s bounceback trading session, no signs of a selloff just yet, with the Dow Jones Industrial Average DJIA, +0.56%, tech-heavy Nasdaq Composite COMP, +1.39% and S&P 500 SPX, +0.87% all logging strong gains."}]}