{"article": [{"url": "https://www.marketwatch.com/story/trump-says-he-expects-to-be-discharged-from-the-hospital-monday-night-how-long-his-stay-compares-to-other-hospitalized-coronavirus-patients-2020-10-05", "published": 1601990300.0, "headline": "Trump was discharged from hospital after three days â\u0080\u0094 how that compares to the average COVID-19 hospitalization", "body": "President Donald Trump was discharged from Walter Reed medical center on Monday evening, three nights after he was admitted Friday to the military hospital for coronavirus treatment. â\u0080\u009cFeeling really good! Donâ\u0080\u0099t be afraid of Covid. Donâ\u0080\u0099t let it dominate your life,â\u0080\u009d he wrote on TWTR, -0.23% Â Monday afternoon, telling the world about his scheduled 6:30 p.m. discharge. The discharge followed a White House estimation that the presidentâ\u0080\u0099s hospital stay would be a matter of â\u0080\u009ca few days.â\u0080\u009d Trump is â\u0080\u009cnot out of the woodsâ\u0080\u009d yet, but heâ\u0080\u0099ll have â\u0080\u009cworld class medical care 24/7â\u0080\u009d at the White House, the presidentâ\u0080\u0099s physician, Dr. Sean Conley, said Monday afternoon. Trumpâ\u0080\u0099s stay at Walter Reed National Military Medical Center is a relatively quicker trip in and out of the hospital compared to other coronavirus patients, research and medical experts say. But then, one infectious disease expert said, other patients arenâ\u0080\u0099t the President of the United States receiving top-of-the-line hospital care and then returning to the White House, which has a medical unit inside of it. COVID-19 had infected 7.5 million Americans and resulted in 210,195 deaths as of Tuesday, according to an ongoing tally from Johns Hopkins University. â\u0080\u009cIf his doctors say heâ\u0080\u0099s safe to go, itâ\u0080\u0099s hard for me to argue,â\u0080\u009d Dr. Daniel McQuillen, senior staff physician at Lahey Hospital & Medical Center in Burlington, Mass., told MarketWatch. â\u0080\u009cBut who knows which way that relationship tilts.â\u0080\u009d McQuillen, who is also vice president of the Infectious Diseases Society of America, a professional association of infectious disease doctors, said many of his own hospitalized COVID-19 patients stay for a range around six to eight days. It skews closer to the eight-day mark or longer for an overweight, older man, McQuillen added. When Trump announced early Friday that he and his wife, Melania, had tested positive, observers noted Trump, a 74-year-old man weighing 243 pounds at his last physical, was at a higher risk for a severe case. If McQuillen had a COVID-19 patient with that same profile, he would at least keep the person hospitalized for another day or two to keep close tabs before they went home, he said. That way, McQuillen said, if there were any concerning developments, they would happen inside a hospital instead of at home. Trump is â\u0080\u009cnot really going home from a medical perspective,â\u0080\u009d McQuillen said. Other studies have clocked coronavirus hospital stays, and many typically last longer than three nights. The median length of stay was five days for patients living outside China and 14 days for patients in China, according to an analysis of 52 studies published last month in BMC Medicine. The discrepancy between the hospitalization stays for patients in China and patients elsewhere may have to do with differing admission and discharge criteria, the researchers at the London School of Hygiene and Tropical Medicine. Another study looked at the typical hospital stays for patients in New Orleans, La. between March and April. The median stay was seven days for 319 white patients, and six days for 1,063 Black patients, according to the findings published in May by the New England Journal of Medicine. Whatâ\u0080\u0099s next for the president? The Centers for Disease Control and Prevention recommends that people with a mild or moderate case of COVID-19 isolate and take other precautions for 10 days after the onset of symptoms. People with immunocompromising co-morbidities should self-isolate for up to 20 days, the CDC added. Some factors, including advanced age, may compromise the immune system, the CDC notes. Donâ\u0080\u0099t miss: As Trump prepares to leave Walter Reed after coronavirus treatment, hereâ\u0080\u0099s what we know about his health The question is whether Trump will follow the guidelines, McQuillen said. On Tuesday, Trump tweeted that he is planning to debate Democratic nominee Joe Biden, as originally scheduled, on Oct. 15 in Miami. While Trump was hospitalized, he waved to well-wishers on Sunday in a motorcade outside the Bethesda, Md.-based medical center. He sat in the back seat, masked and giving the thumbs up. Some doctors criticized the scene and one, who is an attending physician at Walter Reed, called it â\u0080\u009cinsanity.â\u0080\u009d Earlier Sunday, Conley said Trump was being treated with dexamethasone, a steroid thatâ\u0080\u0099s primarily for severely ill hospitalized COVID-19 patients, in addition to his other treatments. â\u0080\u009cWe [were] really trying to maximize everything that we could do for him,â\u0080\u009d Conley said. â\u0080\u009cWe debated whether we even started the dexamethasone. And we decided, in this case, the potential benefits early on [in] the course probably outweighed any risks at this time.â\u0080\u009d"}]}