{"article": [{"url": "https://www.marketwatch.com/story/feds-rosengren-expects-economic-rebound-this-year-to-be-less-than-was-hoped-for-2020-06-19", "published": 1592562200.0, "headline": "Fedâ\u0080\u0099s Rosengren expects economic rebound  this year â\u0080\u0098to be less than was hoped forâ\u0080\u0099", "body": "The U.S. economy is not likely to have a fast recovery and more support will likely be needed from the Federal Reserve and Congress, a top U.S. central banker said Friday. â\u0080\u009cUnemployment remains very high, and because of the continued community spread of the disease and the acceleration of new cases in many states, I expect the economic rebound in the second half of the year to be less than was hoped for at the outset of the pandemic,â\u0080\u009d said Boston Fed President Eric Rosengren, in remarks to the Providence Chamber of Commerce made virtually. Despite important policy actions taken so far, â\u0080\u009cI believe more support is likely to be needed from both monetary and fiscal policy,â\u0080\u009d he added. Underneath the surprisingly good May jobs report is a â\u0080\u009cbadly disruptedâ\u0080\u009d U.S. labor market, he said. The median forecast from Fed officials, released last week, projected a 6.5% decline in real gross domestic product this year and an unemployment rate of 9.3%. â\u0080\u009cUnfortunately, I believe even this dire outlook may be too optimistic,â\u0080\u009d he said. Rosengren said he expected the unemployment rate to still be in the double-digits at the end of the year. The Boston Fed president is clearly troubled by the recent spike of coronavirus cases in the South and Southwest. â\u0080\u009cSo far, in the United States, efforts to contain the virus have bot been particularly successful,â\u0080\u009d he noted. Many Fed officials share this concern. Dallas Fed President Robert Kaplan called efforts to battle the coronavirus â\u0080\u009cuneven.â\u0080\u009d Read: Dallas Fed Kaplan worries economy could be slowed by uneven response to virus This lack of containment could lead to the need for longer shut-downs, resulting in higher unemployment. â\u0080\u009cIf there are significant flare-ups in states that have aggressively reopened, the reduction in social distancing that contributes to stronger economic performance in such states now may translate to more depressed economic activity and increased public health issues in those states in the future,â\u0080\u009d he said. â\u0080\u009cI see a substantial risk in reopening too fast and relaxing social distancing too much,â\u0080\u009d he said. But even if it turns out the response to the pandemic has been calibrated appropriately, additional highly stimulative monetary policy will be needed, he said U.S. stocks opened higher on Friday with the S&P 500 index SPX, +0.87% Â and the Dow Jones Industrial Average DJIA, +0.56% Â both rising over 1%."}]}