{"article": [{"url": "https://www.marketwatch.com/story/bp-to-take-up-to-175-billion-in-charges-as-it-lowers-oil-price-assumption-2020-06-15", "published": 1592215280.0, "headline": "BP to take up to $17.5 billion in charges as it lowers oil-price assumption", "body": "Oil major BP on Monday said it was taking up to $17.5 billion in charges as it lowers its assumptions for the fossil fuels it sells. BP BP, +0.56% BP, -0.74% said a charge will range from $13 billion to $17.5 billion in the second quarter, citing both its review of assumptions as it seeks to become net-zero on carbon emissions by 2050 as well as the impact of COVID-19 on the global economy. “We have reset our price outlook to reflect that impact and the likelihood of greater efforts to ‘build back better’ towards a Paris-consistent world. We are also reviewing our development plans,” said CEO Bernard Looney in a statement. BP said the pandemic is having an enduring impact on the global economy, with the potential for weaker demand for energy for a sustained period. BP said it’s now forecasting a Brent oil price BRN00, -0.07% for the long term of $55, which is down from its previous estimate of $70. BP’s estimate for crude is still well above August futures, which traded at $37.40 on Monday morning. It’s forecasting a natural gas price NG00, +5.17% of $2.90 per mmBtu for Henry Hub gas, down from $4. BP said those prices are “broadly in line with a range of transition paths consistent with the Paris climate goals.” BP said it currently estimates that non-cash, pre-tax impairment charges against property, plant & equipment in the range of $8 billion to $11 billion, and write-offs of exploration intangibles in the range of $8 billion to $10 billion. At the end of the first quarter, BP’s property, plant & equipment was valued at $88.6 billion in the oil and gas properties and intangible assets were $14.2 billion in the exploration business. BP shares traded 3% lower in London. Analysts said the move could precede a dividend cut, which rival Royal Dutch Shell RDSA, +2.08% already has done. “This morning’s announcement may be the management’s way of softening the blow and leading us to expect a cut in the dividend when they publish the second quarter results in early August,” said Helal Miah, investment research analyst at The Share Centre. The market is pricing in a 65% dividend reduction if BP is trading at the same level of Shell, according to Jefferies analyst Jason Gammel."}]}