{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-fall-below-1900-as-rise-in-stocks-and-us-dollars-deflates-bullion-demand-2020-09-23", "published": 1600871840.0, "headline": "Gold prices end at 2-month low as rise in U.S. dollar deflates bullion demand", "body": "Gold prices on Wednesday fell below $1,900 an ounce, a psychologically important round number, to mark their lowest finish in two months as a strengthening dollar continued to undercut appetite for bullion, risking a further break in a bullish trend line in the precious commodity. “A rallying U.S. dollar index recently and a rebound in global stock markets at midweek are bearish elements for the precious metals markets,” wrote Jim Wyckoff, senior analyst at Kitco.com. Read:A rebounding U.S. dollar is crushing gold -- how far can it rise? “Silver has seen its near-term price uptrend…negated this week and gold is in serious danger of seeing its near-term uptrend ending,” the Kitco analyst wrote. December gold GCZ20, +2.17% GC00, +2.17% fell $39.20, or nearly 2.1%, to settle at $1,868.40, deepening its march to its late-July lows after posting losses in the previous two sessions. That was the lowest finish for a most-active contract since July 22, according to FactSet data. December silver SIZ20, +5.96% SI00, +5.96% tumbled $1.42, or 5.8%, to end at $23.105 an ounce, which was also the lowest settlement since late July. Precious-metal prices have been under selling pressure since the start of the week as rising cases of COVID-19 in Europe and in the U.S., helped to fuel an unwind of profitable bets on gold and silver, and into dollars—a shift that further weighed on gold buying. The U.S. dollar was up 0.2% on Wednesday, looking at a weekly gain of 1.3%, based on the ICE U.S. Dollar Index DXY, -0.58%, a measure of the buck against a half-dozen currencies. “The stronger dollar is pressuring gold, as is the lack of any stimulus package coming out of Washington, but we think the complex is oversold both fundamentally and technically and we would not go short here,” Edward Meir, analyst at ED&F Man Capital Markets, wrote in a note Wednesday. Chicago Federal Reserve President Charles Evans on Tuesday implied in the a speech that the Fed could lift benchmark interest rates, which currently stand at a range between 0% and 0.25%, sooner than the market expects. Higher rates may boost the dollar and make gold less competitive against interest-bearing investments. “We could start raising rates before we start averaging 2%, we need to discuss that,” said Evans, during a discussion sponsored by OMFIF, an international forum for economic policy. Analysts said that seemed at odds with what other Fed officials have said following the central bank’s lost policy statement. But Evans on Wednesday said he felt the remarks were in line with the September policy statement and that market participants should understand that a 2.5% inflation rate for some period “is likely in the cards” if the central bank is doing its job right. Fed Vice Chairman Richard Clarida, in an interview on Bloomberg Television Wednesday, said that even when inflation hits the 2% target, the central bank won’t automatically raise rates. Some comments from central bank officials were contradictory. Boston Fed President Eric Rosengren said Wednesday that he is less optimistic about the economic outlook than many of his colleagues, despite encouraging economic data over the summer. Fed Vice Chairman Randal Quarles, meanwhile, was optimistic about the U.S. economic outlook. Fed Chairman Jerome Powell was testifying Wednesday before the House Select Subcommittee on the Coronavirus Crisis after providing congressional testimony a day earlier. Gold prices Wednesday fell further following the release of the latest U.S. economic data Wednesday. The IHS Markit flash services PMI slipped to 54.6 in September from 55 the prior month, while the IHS Markit flash U.S. manufacturing PMI climbed to 53.5 in September from 53.1 in August. Meanwhile, global stocks moved mostly higher on Wednesday but equities have been choppy, with the S&P SPX, +0.87% on Monday narrowly avoiding a close in correction territory—defined as a retreat of 10% from a recent high. U.S. benchmark stock indexes fell Wednesday. “Gold and silver bulls are confounded this week,” Wyckoff said. “Their markets sold off, along with the global stock markets, on Monday, but then also see selling pressure at midweek when the world stock indexes are rebounding.” “It appears the safe-haven metals need a new fundamental spark to jump-start upside price action. Don’t be surprised if such occurs sooner rather than later,” the analyst said. Among other metals traded on Comex, December copper HGZ20, +1.38% fell 2.2% to $2.993 a pound. October platinum PLV20, +3.99% lost 1.7% to $843 an ounce, but December PAZ20, +2.31% tacked on 1.3% to $2,258.30 an ounce."}]}