{"article": [{"url": "https://www.marketwatch.com/story/do-your-family-a-favor-and-make-your-wishes-clear-with-an-advance-medical-directive-2020-06-18", "published": 1592457020.0, "headline": "Do your family a favor and make your wishes clear with an advance medical directive", "body": "This article is reprinted by permission from NerdWallet. If you get COVID-19 and struggle to breathe, would you want to be put on a ventilator? Whatever your answer, ask yourself another question: Who would make your wishes clear if you couldn’t speak for yourself? Advance directives — an umbrella term that includes living wills and health care proxies or powers of attorney — are legal documents that all of us need but that many of us don’t have. A living will allows you to tell your loved ones and medical providers what kinds of medical care you want at the end of your life. Health care proxies or powers of attorney allow you to designate someone to make medical decisions for you if you can’t communicate. You need both, since not all medical situations will trigger a living will, says Carolyn McClanahan, a physician and certified financial planner in Jacksonville, Florida. “A living will only really kicks in if you have an end stage process, a persistent vegetative state or a terminal illness,” McClanahan says. “Oftentimes people run into a situation where they have a health event, but it’s not something that’s going to kill them.” When her father suffered a massive stroke at age 78, Desiree Fisher of New York used the health care power of attorney he’d created two years earlier to push for interventions and therapy to help him recover. Seven years later, he’s doing well, she says. Also see: A doctor vents: Why advanced care planning is so important now “If I didn’t have those documents, it would have been harder for me to advocate for him,” says Fisher, a former real estate finance underwriter studying to be a certified financial planner.Make it easier on yourself Attorneys typically draw up advance directives when they’re creating someone’s estate plan, but you don’t need to go to an attorney to get this done, McClanahan says. Many sites, including AARP and Everplans, offer links to free forms for each state. Five Wishes offers an interactive version for $5. McClanahan likes the free advance directive forms at Prepare for Your Care, a site founded by Rebecca Sudore, a geriatrician and professor at the University of California, San Francisco. The Prepare for Your Care site focuses on the quality of life you want — what you value about your life and what would make you want to go on living, or not. “The problem that too many advance directives get into is they’re asking people about medical procedures that they don’t quite understand,” McClanahan says. People also worry that their choices are set in stone, which isn’t true, says CFP Linda Rogers of San Diego. “If you want to change something tomorrow, you can change it. But put something down on paper, otherwise the courts or the hospital could decide for you,” Rogers says.Pick your advocate and a backup When choosing the person who will make decisions for you, consider who would be most capable of advocating for what you want, rather than what they, other family members or a medical provider might want. Also read: The harsh realities of being on a ventilator—Would you want this? “Sometimes the spouse, or an adult child, is not the right person. Because they love you so much, they may not follow your wishes,” McClanahan says. Choose at least one backup person in case your first choice can’t serve and make sure these advocates understand your wishes, says Susan M. Mitcheltree, a CFP in Timonium, Maryland. Give copies of the documents to them and talk about what you want. “You will never cover every situation,” she says. “However, the more information you can give your health care agent, the better they will be able to best honor your wishes.”Share your plans Follow your state’s rules, included with the forms, about how to make these documents valid, such as having witnesses sign or getting the paperwork notarized. Once you’ve done that, store the originals in a secure place at home, along with your will, and tell your family where to find them. Your doctor and attorney should have copies as well. Ask your doctor to include the forms in your electronic health record, so other medical providers can access it in an emergency. Also carry a card in your wallet that has your health care agent’s name and contact information, along with where you keep the originals and copies. If your choices could cause discord in your family, consider including a note explaining your thinking, Mitcheltree says. “Even if they disagree with your decisions, it is more comforting to hear it directly from you as opposed to the person you have appointed on your behalf,” she says.More from NerdWallet: SmartMoney Podcast: ‘Is Identity Theft Protection Worth It?’ Money Mistakes Happen. Don’t Beat Yourself Up Why Good Credit Matters — Even if You Don’t Plan to Borrow Liz Weston is a writer at NerdWallet. Email: lweston@nerdwallet.com. Twitter: @lizweston."}]}