{"article": [{"url": "https://www.marketwatch.com/story/how-black-doctors-are-answering-the-call-to-reform-medical-education-and-bringing-covid-19-vaccine-trials-to-communities-of-color-2020-09-09", "published": 1599667880.0, "headline": "How Black doctors are answering the call to reform medical education â\u0080\u0094 and bringing COVID-19 vaccine trials to communities of color", "body": "As LaShyra Nolen sat in a lecture hall last fall for her microbiology class, the images displayed on the projector screen revealed a homogeneity that has persisted in the culture of medicine in America for decades. â\u0080\u009cI noticed that the main representation that was always being used in anatomy were white-male bodies and white skin,â\u0080\u009d said Nolen. A hallmark of stage 1 Lyme disease is a bullâ\u0080\u0099s-eye rash, which typically appears 3 days after infection, Nolen recalls the professor explaining, which was followed by a fellow classmateâ\u0080\u0099s question about how to detect the infection in darker-skinned patients. â\u0080\u009cHe said that you would have to work a little bit harder to make a diagnosis on Black patients, which, in my opinion, was an inadequate answer.â\u0080\u009d Christle Nwora, a first year resident at Johns Hopkins Hospital vividly remembers an ethics lecture early on in medical school when the professor asked students who knew about the Tuskegee Syphilis Study. â\u0080\u009cAll students of color raised their hands, but what was more shocking to me is that many of my classmates didnâ\u0080\u0099t know about one of the biggest medical ethics failures in history,â\u0080\u009d said Nwora. â\u0080\u009cThey were probably exposed to this history, but for whatever reason, it wasnâ\u0080\u0099t memorable. But these were experiences that were memorable to me and my other Black classmates.â\u0080\u009d For 25-year-old Nolen, who is now a second-year medical student at Harvard University and the first Black female student to serve as class president, the problem is that â\u0080\u009cstudents and doctors are missing the â\u0080\u009cbull's-eyeâ\u0080\u009d when caring for Black people and that lack of awareness has real life implications for people of color.â\u0080\u009d Christle Nwora Christle Nwora The conversation around health inequities has been reignited by the emergence of COVID-19 and has taken on a new dynamic that has emboldened medical professionals and students to speak out about subpar care for some of the nationâ\u0080\u0099s most vulnerable communities, in addition to calling for the restructuring of medical curricula. The COVID-19 death rate for people of color under 65 years old is twice as high as it is for white Americans, and other chronic conditions like heart disease, diabetes and cancer continue to take a toll on Black and Latino Americans. Some experts believe medical schools have fallen short on tackling the complexities of race in medicine with regard to certain illnesses being inextricably linked to disproportionately affecting minority communities. Also problematic are the perpetual prejudices embedded in hospitals and other medical institutions. The COVID-19 pandemic â\u0080\u0094 and the virusâ\u0080\u0099s disproportionate impact on communities of color â\u0080\u0094 and the rise of the Black Lives Matter movement this summer have pushed medical schools like Yale University and Weill Cornell Medicine, as well as historically black medical school including Meharry Medical College to rethink medical curricula and how to train tomorrowâ\u0080\u0099s doctors to better care for all patients of color in the U.S. One of the reasons there are so few Black doctors â\u0080\u009cStudies have shown that white doctors think Black people, and Black women especially, can endure more pain,â\u0080\u009d said Marybeth Gasman, Endowed Chair in education and distinguished professor at Rutgers University. â\u0080\u009cPart of that ideology comes from the way that we look at certain races as patients and deciding on the kind of medical care they should receive.â\u0080\u009d Dr. James Hildreth Dr. James Hildreth Gasman has occasionally been invited to medical schools as a guest speaker to give talks on diversity in the medical profession. She says sheâ\u0080\u0099s seen firsthand and has even raised red flags about the lack of diversity of medical faculty as well as minority groups being represented in education materials. â\u0080\u009cIâ\u0080\u0099m white, but because Iâ\u0080\u0099ve been doing this research for so long, I notice things when I visit these schools,â\u0080\u009d said Gasman. â\u0080\u009cWhether itâ\u0080\u0099s white mannequins that students are constantly being trained to operate on, or having a person of color as a guest lecturer in your lab. All of these things make a difference when teaching students how to interact with diverse populations.â\u0080\u009d Black medical colleges in the U.S. have long prided themselves on serving minority communities and being proponents of integrating culturally competent values in curricula when dealing with patients. â\u0080\u009cWeâ\u0080\u0099re not always able to have the latest and greatest technologies and tools, but we continue to emphasize the social determinants of health to our students,â\u0080\u009d said Dr. James Hildreth, President and CEO of Meharry Medical College. â\u0080\u009cItâ\u0080\u0099s part of our legacy and part of that legacy has always been challenged to make do with limited resources and to do what medicine has always been about â\u0080\u0094 and thatâ\u0080\u0099s being able to connect with the person in front of you.â\u0080\u009d Leaders at Black medical schools have been proactive in supplementing textbooks, which often leave out African-Americans and other people of color. The use of life-like mannequins that are more representative of diverse communities has been a pillar, whereas, in most medical schools clinical mannequins are white. Meharry Medical College Meharry Medical College Next month, Meharry Medical College will be conducting trials for two COVID-19 vaccines for Novavax NVAX, +0.18% Â , a biotech company headquartered in Gaithersburg, Md. The company, among other pharmaceutical manufacturers, was selected by Operation Warp Speed, an effort put forth by the Trump administration to accelerate the development of 300 million doses of a safe, effective vaccine for COVID-19 by January 2021. Faculty and students at Meharry are actively asking communities of color to participate. Realizing the egregious acts of Western medicine a century ago, Dr. Hildreth knows those horrors still linger for many African-Americans. â\u0080\u009cThereâ\u0080\u0099s a lack of trust that African-Americans feel about medical research because they donâ\u0080\u0099t feel that they can relate to the people wearing those white coats,â\u0080\u009d said Hildreth, who is going to be the first volunteer to take the vaccine. â\u0080\u009cItâ\u0080\u0099s created a huge challenge for us but we have to find a way to get past that if we are going to save lives.â\u0080\u009d Meharry Medical College is located in Nashville, Tenn., and is one of the two historically black medical schools still around that was part of a study known as The Flexner Report over a century ago that led to the closing of 75% of U.S. medical schools â\u0080\u0094 cutting the countryâ\u0080\u0099s then 155 medical schools down to 66 and shuttering five of the nationâ\u0080\u0099s seven Black medical colleges. The report, done by educational specialist Abraham Flexner, laid the framework for criteria to standardize and improve medical schools. To this day, some experts believe the report was a catalyst for unequal access to health care in urban communities and is partially responsible for the fact that only 5% of Black physicians currently make up the medical workforce in the U.S. Flexnerâ\u0080\u0099s perspective of emerging African-American physicians was that they were â\u0080\u009cin no position to make any contribution of valueâ\u0080\u009d and should primarily serve as â\u0080\u009csanitarians,â\u0080\u009d whose purpose was â\u0080\u009cprotecting whites.â\u0080\u009d Ultimately, the report established biomedical models as the gold standard in medical learning â\u0080\u0094 excluding any social or environmental factors which has thwarted medical academia and skewed the quality of care for people of color. What medical schools are doing to reduce inequality in the way doctors treat patients Medical students who identified as African-American or Black rose from 5.6 percent in 1980 to 7.7 percent in 2016, according to the Association of American Medical Colleges. For the first time in history in 2017, women made up the majority of medical school students and that increase has remained steady. Despite initiatives to increase enrollment numbers in medical schools, African-Americans still lag behind other racial groups. The number is even lower for Black men. As of July 2019, among active physicians in the U.S., 56% identified as White, 17% as Asian, nearly 6 percent identified as Hispanic, and 5% identified as Black or African-American. Male physicians continue to outpace female physicians in the workforce â\u0080\u0094 nearly 64 percent compared with 36 percent. Dereck Paul Dereck Paul Venturing into the medical field was somewhat serendipitous for Dereck Paul after he volunteered as an EMT at his local fire department one summer. â\u0080\u009cWhat drove me towards a career in medicine is when I would go on these calls, I would see the living conditions of people and why they were sick just because of their social circumstances,â\u0080\u009d said the fourth year medical student at the University of California, San Francisco. Paul has been a fierce advocate for social justice in medicine since the White Coats For Black Lives organization was pioneered by medical students in late 2014. Born out of the Black Lives Matter movement, its mission was to start a dialogue within the medical community about violence against people of color and address structural racism in health care. The reawakening that medical schools have had in light of the COVID-19 pandemic and protests against structural racism and police brutality has prompted schools to take action for the sake of public health. In June, the Dean at Cornell Weill Medicine announced that the school would take immediate action to combat the current manifestations of racism in medicine by introducing additional educational content related to racism, social injustice, and social determinants of health. â\u0080\u009cAs future physicians, our medical students must have the knowledge and skills to produce optimal health outcomes for all patients and to address disparities,â\u0080\u009d Dr. Augustine M.K. Choi, said in a statement. â\u0080\u009cMedical students have really been the driving force behind curriculum changes,â\u0080\u009d said Dr. Beverely Sheares. In response to medical student activism regarding concerns about the learning environment in 2015, the Yale School of Medicine formed a committee to address health inequities in learning materials. Dr. Sheares took on the role of overseeing the committee in January and has led efforts to integrate health equity into the current curriculum. â\u0080\u009cBefore, students could opt out of elective classes that were geared towards addressing issues around race and health care. This yearâ\u0080\u0099s cohort of medical students will be the first to get the health equity thread in courses that are mandatory.â\u0080\u009d Progress has undoubtedly been made in dismantling the race-based biology that has permeated mainstream medicine for decades. However, students and physicians agree that thereâ\u0080\u0099s still a long way to go. â\u0080\u009cMedical professionals speaking out on these issues is still controversial in some circles,â\u0080\u0099â\u0080\u0099 said Paul. â\u0080\u009cTo me, that is the completely wrong way of looking at it. Social advocacy should be the standard of care.â\u0080\u009d"}]}