{"article": [{"url": "https://www.marketwatch.com/story/stock-index-futures-rise-as-big-banks-kick-off-earnings-season-2020-07-14", "published": 1594745780.0, "headline": "Dow ends up 550 points, stocks jolt higher after Fedâ\u0080\u0099s Brainard calls for â\u0080\u0098sustainedâ\u0080\u0099 large-scale asset purchases", "body": "U.S. stock indexes closed near session highs Tuesday, after Federal Reserve Gov. Lael Brainard called for sustained large-scale asset purchases by the U.S. central bank to help the economy rebound amid a â\u0080\u009cthick fog of uncertaintyâ\u0080\u009d brought on by COVID-19. Investors also monitored fresh corporate earnings, efforts by some U.S. states to close down businesses again with coronavirus cases rising, and deteriorating U.S.-China relations. How did major indexes fare? The Dow Jones Industrial Average DJIA, +0.56% gained 556.79 points, or 2.1%, to end at 26,642.59, while the S&P 500 SPX, +0.87% tacked on 42.30 points to finish at 3,197.52, a gain of 1.3%, as energy shares and materials shares rallied. The Nasdaq Composite Index COMP, +1.39% Â advanced 97.73 points, or 0.9%, to settle at 10,488.58, after trading negative earlier in the session. What drove the market? Stocks marched steadily higher on Tuesday after Brainard said the U.S. central bank should use large-scale asset purchases for a â\u0080\u009csustainedâ\u0080\u009d period to help the economy rebound amid a â\u0080\u009cthick fog of uncertaintyâ\u0080\u009d brought on by COVID-19. Brainard also warned that the U.S. economic recovery likely â\u0080\u009cwill face headwinds for some time,â\u0080\u009d and require further accommodation, while speaking during a virtual event hosted by the National Association for Business Economics. St. Louis Fed president James Bullard on Tuesday struck a more upbeat tone on the economic outlook, saying that the unemployment rate could drop sharply in the next six months, if â\u0080\u009cwe play our cards rightâ\u0080\u009d and if many workers subject to temporary layoffs end up being recalled. Bullard also said that optimism around stocks, so far, has proven right. â\u0080\u009cEquity markets are something we donâ\u0080\u0099t usually talk about at the Fed,â\u0080\u009d he said. â\u0080\u009cI think they have been optimistic and they have been right, I think, up to now anyway.â\u0080\u009d Expectations for continued Fed support, including through ultra-low rates that can weigh on bank earnings, through the pandemic has been a key focus among investors willing to buy U.S. stocks are higher prices. Some of the nationâ\u0080\u0099s largest banks on Tuesday also reported results, offering more insights into the outlook for the domestic economy that has been ravaged by the coronavirus pandemic. Banking giant JPMorgan Chase & Co. JPM, -0.57%, saw earnings fall sharply, even if they topped expectations. Wells Fargo & Co. WFC, , saw its shares punished after reporting a deeper-than-expected loss, and Citigroup Inc. C, +0.47% shares also lost ground even as its earnings topped expectations. Deep Dive:What to expect as banks report earnings: More loan pain but plenty of fee income Bank earnings reports come amid concerns that stocks may have rallied too far off the March lows, particularly as parts of the world clamp back down on business activities and social gatherings. California Gov. Gavin Newsom on Monday ordered a rollback of indoor operations of restaurants, as well as bars, zoos, wineries, museums, and movie theaters, igniting fresh worries that the COVID-19 pandemic recovery may take longer than the rebound in equities imply. Steven Ricchiuto, U.S. chief economist at Mizuho Securities, said his team expects â\u0080\u009cthe recovery to take a full year, not six months,â\u0080\u009d in a note Tuesday afternoon. â\u0080\u009cThis consideration is an important driver behind our call that the equity markets will track sideways within recent ranges through the summer months instead of climbing higher.â\u0080\u009d Any recent selloffs, such as Mondayâ\u0080\u0099s late downside reversal, have been short lived, said Sahak Manuelian, a managing director of equity trading at Wedbush Securities in Los Angeles. â\u0080\u009cA lot of people think markets are ahead of themselves, ahead of the economy, but it just doesnâ\u0080\u0099t seem to matter so long as we have so much fiscal and monetary stimulus,â\u0080\u009d he told MarketWatch. The U.S. death toll stands at 135,615 and is rising again after it had started to flatten in mid-to-late April. There are now 41 U.S. states and regions showing increasing cases over a 14-day period, according to a New York Times tracker. Also, France and the U.K. on Tuesday extended rules requiring face coverings in public, while Hong Kong and India reimposed restrictions on movement to help contain outbreaks. On the U.S. data front, the National Federation of Independent Business said its Small Business Optimism Index rose to 100.6 in June, a 6.2 point increase from Mayâ\u0080\u0099s reading. The June consumer-price index rose 0.6%, while the core reading, which strips out volatile food and energy prices, was up 0.2%. Economists surveyed by MarketWatch had forecast a 0.5% rise in the overall figure, while the core reading matched expectations. Meanwhile, U.S. - China relations are deteriorating again, impacting technology stocks. The Trump administration rejected Chinaâ\u0080\u0099s claims in the South China Sea, while China announced it was imposing sanctions on Lockheed Martin Corp. LMT, -0.68% Â after the U.S. approved a deal for the supply of missile parts to Taiwan, and the U.K. reversed its policy by banning Chinese telecoms company Huawei.Which stocks were in focus? Shares of JPMorgan Chase JPM, -0.57% gained 0.6% Tuesday after delivering results. Citigroup C, +0.47% Â shares fell 3.9%, while shares of Wells Fargo & Co. WFC, tumbled 4.6%, enough to pace the large-capitalization banking sectorâ\u0080\u0099s decliners, after the bank reported second-quarter results that missed expectations. Shares of Delta Air Lines Inc. DAL, +0.39% fell 2.7% after reporting a larger-than-expected second-quarter loss. Amazon.com Inc. AMZN, +3.01% said Tuesday it was collaborating with primary care services provider Crossover Health to establish health centers near Amazon fulfillment centers and operations facilities around the country. Shares fell 0.6%. Shares of Spotify Technology S.A. SPOT, +0.08% Â gained 0.6%, ending the previous sessionâ\u0080\u0099s pullback, even after UBS analyst Eric Sheridan swung to bearish from bullish on the music streaming platform, saying future opportunities are â\u0080\u009cmore than priced in.â\u0080\u009d Shares of Tesla Inc. TSLA, +1.89% climbed 1.3% after Piper Sandler analyst Alexander Potter raised his price target on the stock to $2322 from $939, writing of â\u0080\u009cfaster-than-expected share gainsâ\u0080\u009d and big opportunities in software. Shares of Harley-Davidson Inc. HOG, -3.31% rallied 5.6% Tuesday, after BMO Capitalâ\u0080\u0099s Gerrick Johnson became the most bullish analyst covering the motorcycle maker following an upgrade and price target boost. Beyond Meat Inc. BYND, +0.80% products will be sold at select Metro China locations in Shanghai starting July 15, Metro China announced Tuesday. Shares advanced 1.4%. Shares of 3M Co. MMM, +0.94% were 2.4% higher on Tuesday after the company said it is developing a rapid diagnostic test for COVID-19 that would be used at the point of care. Shares of Bed Bath & Beyond Inc BBBY, -1.37% rose 8.6% Tuesday, after the home-accessories retailer said June same-store sales were â\u0080\u009cpositiveâ\u0080\u009d for reopened stores and digital channels. Netflix Inc. NFLX, +1.43% Â stock fell 0.1% Tuesday after an analyst at UBS downgraded the company to neutral from buy, writing that the company looks poised to report a strong June quarter during COVID-19 lockdowns, that investors seem to have already priced in these benefits to Netflixâ\u0080\u0099s shares. How did other markets trade? In Asia, the Shanghai Composite SHCOMP, +1.67% Â fell 0.8%, while the CSI 300 Index 000300, +2.04% Â declined 1%. Japanâ\u0080\u0099s Nikkei 225 Index NIK, -0.11% Â retreated 0.9%, while the Hang Seng Index in Hong Kong HSI, -0.30% Â closed 1.1% lower. In Europe, the pan-European SXXP, +0.55% Â Stoxx 600 Europe Index closed 0.8% lower, while Londonâ\u0080\u0099s FTSE 100 UKX, +0.64% Â gained 0.1%. The yield on the benchmark 10-year Treasury note TMUBMUSD10Y, 0.777% Â was off 2.4 basis points at 0.614%. Yields and bond prices move in opposite directions. The ICE U.S. Dollar Index DXY, -0.58%, a measure of the currency against a basket of six major rivals, was off 0.2%. Oil futures closed higher, with the U.S. benchmark CL.1, -1.62% up 0.5%, or 19 cents, to end at $40.29 a barrel. Gold GC00, +2.17% Â futures declined 0.04%, or 70 cents, settling at $1,813.40 an ounce. Â"}]}