{"article": [{"url": "https://www.marketwatch.com/story/global-unemployment-fears-as-a-third-of-uk-firms-prepare-for-a-wave-of-layoffs-2020-08-10", "published": 1597053800.0, "headline": "Global unemployment fears rise as a third of U.K. firms prepare for a wave of layoffs", "body": "One in three U.K. businesses is preparing to make job cuts this year, according to a new survey of 2,000 companies, increasing pressure on the U.K.’s finance chief to extend the government’s furlough program beyond October. The Chartered Institute of Personnel and Development (CIPD) and Swiss staffing company the Adecco Group found that the number of organizations expecting to make job cuts has risen to 33% for the three months to the end of September, compared with 22% during the last quarter. The latest quarterly Labour Market Outlook’s net employment balance — which measures the difference between the proportion of employers who expect to increase staff levels and those who expect to decrease staff levels — has fallen from minus 4 to minus 8 over the last three months. That marks the lowest level since the survey was conducted using its current methods in February 2013. “This is the weakest set of data we’ve seen for several years. Until now, redundancies have been low — no doubt due to the Job Retention Scheme — but we expect to see more redundancies come through this autumn, especially in the private sector once the scheme closes,” said Gerwyn Davies, senior labor market adviser at the CIPD, the professional body for human resources and people development. Read:U.K. GDP edges up in May, leaving economy nearly a fifth below prelockdown levels Davies added that while hiring confidence is rising tentatively, this probably won’t be enough to offset the rise in redundancies and the number of new graduates and school leavers entering the labor market over the next few months. “As a result, this looks set to be a somber autumn for jobs,” Davies warned. The report comes as Chancellor of the Exchequer Rishi Sunak is under intense pressure to extend the government’s job retention program beyond October, as fears mount of a second spike in coronavirus cases, which will further damage the economy. Under the program, designed to prevent mass redundancies during the pandemic, furloughed workers have been able to receive 80% of their pay, up to a maximum of £2,500 a month. However, since Aug. 1, employers have had to pay National Insurance and pension contributions for their workers. As of Aug. 2, 9.6 million jobs have been furloughed during the pandemic, at a cost of £33.8 billion to the Treasury, according to government data. Read:U.K. government to keep paying wages of furloughed workers until end of October as jobs program extended Sectors including hospitality, transport and storage, and retail, which have been among the hardest hit by social distancing measures, recorded the steepest fall in employment, the CIPD report found. By contrast, health care and public administration registered the highest confidence. The survey found that twice as many private sector employers (38%) expect to make redundancies compared with the public sector (16%). Employers across all sectors also intend to keep a tight rein on pay increases over the next 12 months. Those who plan pay reviews expect basic pay to increase by 1%, much lower than the 2% median increase expected this time last year. “While we see a modest rise in median basic pay expectations in the private sector, overall improvement is hindered by a relatively large proportion of employers able to predict the outcome of a pay decision over the next 12 months that plan to introduce wage freezes in the 12 months to June 2021 (40%),” the report noted."}]}