{"article": [{"url": "https://www.marketwatch.com/story/money-advice-for-men-this-fathers-day-copy-how-the-women-in-your-life-invest-2020-06-18", "published": 1592753300.0, "headline": "Money advice for men this Father's Day: Copy how the women in your life invest", "body": "\"What is a mutual fund?\" asked my client Phil. I was stunned, as we had been meeting for six months and all this time he'd talked a good game about his investments doing well. The surprising thing? Phil's retirement money had been in mutual funds for 10 years. When he came to me for advice, he said his retirement funds were fine, but his wife wanted a professional's opinion on both their retirement plan and her own 401(k).  My mind flashed back to a conversation a few years ago with a friend's father who was a stockbroker. \"Men don't like to ask questions, especially to other men,\" he told me. \"They don't want to appear stupid.\"  Indeed, most men are bigger risk takers when it comes to lifestyle and money. Riskier jobs result in higher injuries and require more expensive disability insurance. Men typically are faster drivers and pursue more life-threatening hobbies, which means more expensive life insurance expenses. These costs add up. Moreover, men's penchant for do-it-yourself investing often leads to more of a sporting mentality: watching, cheering and reacting to the stock market. In contrast, women tend to be more \"set it and forget it\" investors. Even women money managers switch their investments less often than their male peers - and do just fine in terms of portfolio return. “ Men might want to act more like women - at least around personal finances. ” With that in mind, men might want to act more like women - at least around personal finances. Some reasons: â\u0080¢â\u0080\u0089 Women are less afraid to ask questions - 64% of men invest without seeking professional advice whereas 33% of women do so. Men consider investing a subject they understand without guidance or help. â\u0080¢â\u0080\u0089Women do just as well with investing as men, though typically they feel less confident about it. Women investors actually fared better than their male peers during the Great Recession in 2008. â\u0080¢â\u0080\u0089Men mistake action for progress. Men take on more credit cards, trade frequently and shoulder more debt. Many men have a goal of making money quickly, but they often are reluctant to sell what they insist is a \"sure thing.\" Though women's financial actions and savings vary with marital status and age, they tend to be well-rounded and quiet when spending. Additionally, women give more to charity, make smaller purchases and prioritize a family's long-term goals. Men tend to spend money to impress, but these grand gestures lead to greater expenses and more debt. When it comes to impulse buys, men and women are equally susceptible, though women spend less per purchase. Read: How to plan for the unique financial challenges women face If men are to be more like women around money, here are some good places to start: 1. Seek expert investment advice. 2. Take less risk. 3. Reduce impulse purchases and overall spending. As for Phil, I explained what a mutual fund is and what types of funds he and his wife Mary owned. Mary asked if these investments were risky and how well she and Phil were prepared for retirement. Looking at their combined portfolio, it became clear that while Phil was taking on more risk, Mary was much more conservative. Together their investments were in balance, which only shows that when it comes to money, men and women can learn from each other. More:  Here's the real difference between women and men when it comes to stock-market investing"}]}