{"article": [{"url": "https://www.marketwatch.com/story/is-covid-19-considered-a-disability-are-you-entitled-to-take-time-off-without-losing-your-job-heres-what-you-should-know-11596012961", "published": 1595999000.0, "headline": "Is COVID-19 considered a disability? Are you entitled to take time off without losing your job? Hereâ\u0080\u0099s what you should know", "body": "Can COVID-19 be considered a disability under the Americans with Disabilities Act? The answer will depend on the facts of any individual case, legal experts say. Joe Raedle/Getty Images Whether you suffer severe COVID-19 complications, experience lingering symptoms, or fear contracting the disease due to an underlying condition, you could be entitled to workplace accommodations under U.S. disability law.Â A recent Centers for Disease Control and Prevention report concluded that COVID-19, the disease caused by the new coronavirus, â\u0080\u009ccan result in prolonged illness, even among young adults without underlying chronic medical conditions.â\u0080\u009d And an increasing number of reports show that a subset of COVID-19 survivors â\u0080\u0094 dubbed â\u0080\u009clong-haulersâ\u0080\u009d â\u0080\u0094 endure symptoms such as fatigue and decreased lung function for months after contracting the disease, even in some cases that were considered â\u0080\u009cmild.â\u0080\u009d Still others are hospitalized with the illness and face a long recovery. Meanwhile, people with preexisting conditions such as type 2 diabetes or asthma, wary of returning to a physical workspace due to their increased risk for severe COVID-19 illness, might want to work from home or seek additional on-the-job protection. So can COVID-19 be considered a disability under the Americans with Disabilities Act? The answer will depend on the facts of any individual case, legal experts say, but there are a few things to know about requesting accommodations or leave from your workplace.Â Thereâ\u0080\u0099s no â\u0080\u0098black-and-white answerâ\u0080\u0099 The ADA defines a disability as â\u0080\u009ca physical or mental impairment that substantially limits one or more major life activities of such individual; a record of such an impairment; or being regarded as having such an impairment.â\u0080\u009d Major life activities can include â\u0080\u009ccaring for oneself, performing manual tasks, seeing, hearing, eating, sleeping, walking, standing, lifting, bending, speaking, breathing, learning, reading, concentrating, thinking, communicating, and working.â\u0080\u009d “ â\u0080\u0098Coronavirus alone may not be considered a disability under the ADA, due to the illness being transitory and having limited impact on major life activities in ordinary circumstances.â\u0080\u0099 ” â\u0080\u0094 Job Accommodations Network The Equal Employment Opportunity Commission said in a late-March outreach webinar that it was â\u0080\u009cunclearâ\u0080\u009d at that time whether COVID-19 was or could be a disability under the ADA, which turned 30 last weekend, citing the novelty and unknown factors surrounding the disease. â\u0080\u009cCoronavirus alone may not be considered a disability under the ADA, due to the illness being transitory and having limited impact on major life activities in ordinary circumstances,â\u0080\u009d reads a blog post from the Job Accommodation Network (JAN), which is funded by a Labor Department contract and provides technical assistance on the ADA and job accommodations. Most state laws havenâ\u0080\u0099t addressed this issue, added Sarah Wieselthier, an associate at the law firm Fisher Phillips who represents employers in labor and employment issues and has written about COVID-19 and discrimination law. But New York City says it protects â\u0080\u009cactual or perceivedâ\u0080\u009d COVID-19 infection as a disability under its human-rights law â\u0080\u0094 meaning employers canâ\u0080\u0099t harass or discriminate against employees on that basis, and have a duty to accommodate employees with COVID-19-related disabilities â\u0080\u009cunless doing so poses an undue hardship or where the disability presents a direct threat that cannot be adequately mitigated by a reasonable accommodation.â\u0080\u009d â\u0080\u009cThis obligation extends to all disabilities, including both those directly related to COVID-19 and underlying conditions for which exposure to COVID-19 may pose a particular risk of complication,â\u0080\u009d the cityâ\u0080\u0099s guidance says. Very mild, short-term COVID-19 cases that donâ\u0080\u0099t rise beyond the level of a regular cold or flu likely wouldnâ\u0080\u0099t be considered a disability for the purposes of anti-disability discrimination under the ADA, said Rachael Langston, a senior staff attorney for the San Francisco-based Legal Aid at Work. On the other hand, experiencing serious COVID-19 complications like pneumonia might constitute a disability, since those would be a more severe limitation of a personâ\u0080\u0099s ability to â\u0080\u009cperform major life activities,â\u0080\u009d she said. With that said, each case would be evaluated on an individual basis with respect to how the illness affected the person and what it restricted them from doing, Langston told MarketWatch. â\u0080\u009cThereâ\u0080\u0099s no 100% black-and-white answer,â\u0080\u009d she said.Â “ â\u0080\u0098Whether something is caused by COVID or has some other root cause, it might still be the same type of health concern or resulting health issue that would be considered a disability.â\u0080\u0099 ” â\u0080\u0094 Sarah Wieselthier, an associate at the employer law firm Fisher Phillips As for people who experience long-term COVID-19 symptoms months into the future, that lasting impact â\u0080\u009cwould arguably constitute a disabilityâ\u0080\u009d in many cases, Langston said. â\u0080\u009cRegardless of whether it was caused by COVID or not caused by COVID, the person is experiencing a health issue â\u0080\u0094 and thatâ\u0080\u0099s whatâ\u0080\u0099s important in terms of whether or not this person is entitled to an accommodation; whether or not they have any job protections based on their disability,â\u0080\u009d Wieselthier said. Langston said her organization was hearing most often from individuals worried that their preexisting conditions could put them at higher risk for COVID-19 complications. While many people with a heart condition or diabetes might have been able to go to work with no problem pre-pandemic, coming in close proximity to other people could now put their health at severe risk, she said. â\u0080\u009cArguably in many, many cases, someone with an underlying condition would be equated to someone who has a disability â\u0080\u0094 and because of that, they are entitled to ask their employer for a reasonable accommodation for their disability as it relates to the pandemic,â\u0080\u009d Langston said. Possible accommodations might be telework or social-distancing measures in the workplace, she said. Langston has also heard from workers with mental-health disabilities like anxiety, which the pandemic â\u0080\u0094 along with the prospect of going to work around other peopleÂ â\u0080\u0094 has exacerbated. â\u0080\u009cThatâ\u0080\u0099s another reason for which you could request a reasonable accommodation,â\u0080\u009d she said. â\u0080\u009cItâ\u0080\u0099s a reality for a lot of people.â\u0080\u009d An employer canâ\u0080\u0099t issue a broad policy that says all employees who fall into a certain category, such as being pregnant or older than 65, must stay home because they may be at high risk, Wieselthier said â\u0080\u0094 even if such an action is well-intentioned. â\u0080\u009cWeâ\u0080\u0099re never having blanket policies that say, â\u0080\u0098All employees with disability X automatically get accommodation Y,â\u0080\u0099â\u0080\u009d she said. â\u0080\u009cEverything has to be looked at on an individual basis.â\u0080\u009d As for workers without disabilities who live with someone who is at elevated risk for severe COVID-19 illness, the ADA doesnâ\u0080\u0099t mandate that employers provide them with accommodations based on their family memberâ\u0080\u0099s underlying condition, though theyâ\u0080\u0099re free to provide that flexibility if they like. â\u0080\u009cAlthough the ADA prohibits discrimination based on association with an individual with a disability, that protection is limited to disparate treatment or harassment,â\u0080\u009d the EEOC says. If you have COVID-19, are experiencing long-term symptoms from the disease, or have a preexisting condition that has you uneasy about returning to work, hereâ\u0080\u0099s what you need to know about your rights:If youâ\u0080\u0099re experiencing COVID-19 symptoms or complicationsâ\u0080¦ There are state and federal protections, including the Families First Coronavirus Response Act (FFCRA), that entitle you to sick leave if you are eligible, Langston said. â\u0080\u009cRegardless of whether your COVID rises to the level of disability, you do have that leave as long as you qualify under the FFCRA,â\u0080\u009d she said.Â You may also have rights under the Family and Medical Leave Act (FMLA). If youâ\u0080\u0099ve already used up all your time and donâ\u0080\u0099t qualify for the FMLA or FFCRA, you can request leave or extended leave as a disability accommodation under the ADA, Langston said.See if your employer will accept alternative medical documentation The ADA requires that employers provide â\u0080\u009creasonable accommodationsâ\u0080\u009d to workers with disabilities, provided they wouldnâ\u0080\u0099t result in â\u0080\u009cundue hardshipâ\u0080\u009d such as significant expense or difficulty. A reasonable accommodation, the EEOC says, â\u0080\u009cis any change in the work environment (or in the way things are usually done) to help a person with a disability apply for a job, perform the duties of a job, or enjoy the benefits and privileges of employment.â\u0080\u009d “ â\u0080\u0098Donâ\u0080\u0099t be caught flat-footed â\u0080\u0094 learn as much as you can about the virus, what conditions youâ\u0080\u0099re going through, what the long-term effects could be.â\u0080\u0099 ” â\u0080\u0094 Edgar Ndjatou, the executive director of Workplace Fairness Langston recommended consulting JAN for more COVID-19-specific information; possible accommodations could include telecommuting, additional personal protective equipment, a modified work environment to facilitate social distancing or temporary work reassignment, she said. Once you figure out what you might need, ask your employer, supervisor or human-resources representative for the accommodation, Langston said; while these requests donâ\u0080\u0099t need to be in writing, she advises following up in writing to put yours on the record. To support your request, an employer is allowed to ask for medical documentation that establishes you have a covered disability, describes the major life activities your disability limits, and describes the accommodation that would help, if you know what that is. At that point, your employer should engage you in the so-called interactive process to work toward figuring out accommodations. While theyâ\u0080\u0099re not required to do so, employers â\u0080\u009cshould strongly considerâ\u0080\u009d accepting alternative forms of medical documentation given the pandemicâ\u0080\u0099s limitations on in-person doctor visits, Langston said.Be your own advocate Edgar Ndjatou, the executive director of the nonprofit employee-rights organization Workplace Fairness, said itâ\u0080\u0099s best to be as transparent as possible with your employer so that you can get the assistance you need. That doesnâ\u0080\u0099t mean you have to offer up your entire medical file with unrelated information, he said â\u0080\u0094 but it can help to be forthcoming about the changes in your lifestyle. â\u0080\u009cIt serves no purpose to not be as descriptive as possible about whatâ\u0080\u0099s going on,â\u0080\u009d he said. And when it comes to requesting an accommodation for a disability, COVID-19-related or otherwise, itâ\u0080\u0099s important to keep the conversation going with your employer, Langston said. â\u0080\u009cIf the employee ends the conversation or doesnâ\u0080\u0099t respond, then the employer can also have a defense there for not accommodating, because the employee didnâ\u0080\u0099t continue the conversation,â\u0080\u009d she said. Advocate for yourself as much as you can, Ndjatou added. â\u0080\u009cDonâ\u0080\u0099t be caught flat-footed â\u0080\u0094 learn as much as you can about the virus, what conditions youâ\u0080\u0099re going through, what the long-term effects could be,â\u0080\u009d he said.Â After all, he said, â\u0080\u009cyou need to know this stuff so you can make decisions about the ability to earn income.â\u0080\u009d â\u0080\u009cMaybe youâ\u0080\u0099ll decide that, â\u0080\u0098I need to change careers, because I need to be in a career that will allow me to work from home or has more flexibility,â\u0080\u0099â\u0080\u009d he said. While employers are obligated by law to provide reasonable accommodations absent undue hardship, he added, â\u0080\u009citâ\u0080\u0099s also good for employees to be prepared for all possible scenarios.â\u0080\u009d"}]}