{"article": [{"url": "https://www.marketwatch.com/story/10-year-treasury-yield-retreats-toward-060-as-economic-data-sets-off-worries-over-european-recovery-2020-08-21", "published": 1598001800.0, "headline": "10-year Treasury yield rebounds after U.S. economic data weighs on haven assets", "body": "U.S. Treasury yields trimmed their earlier drop on Friday after stronger-than-expected U.S. economic data outweighed the bullish impact of disappointing European data.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% was down marginally by 0.5 basis point to 0.639%, off an intraday low of 0.623%. It remains down 6.9 basis points this week, its largest such decline since June 12. The 2-year note rate TMUBMUSD02Y, 0.156% edged 0.6 basis point up to 0.145%, leaving it nearly unchanged for the week. Meanwhile, the 30-year bond yield TMUBMUSD30Y, 1.576% slid 2.3 basis points to 1.353%, adding to a weekly drop of 8.9 basis points. Bond prices move inversely to yields. What’s driving Treasurys? U.S. economic data helped to ease demand for government paper later, erasing an earlier overnight rally. Sales of previously-owned homes in the U.S. surged 24.7% between June and July to a seasonally-adjusted annual rate of 5.86 million, the National Association of Realtors reported Friday. The Markit purchasing managers’ indexes for the U.S. services sector for August rose to a one and a half year high of 54.7 this month from 50.3 in July. In Europe, the overall eurozone composite PMI fell to a two-month low of 51.6 in August from 54.9 in July. Any number above 50 represents an expansion of economic activity, nonetheless the latest numbers point to the flagging momentum of the European rebound. Previously, Europe’s efforts to control the COVID-19 pandemic have been seen as a success, drawing capital into the continent. But infections have risen again as social measures instituted to restrict the coronavirus spread were gradually removed. Investors will now turn their attention to next week’s Jackson Hole Symposium where the Federal Reserve Chairman Jerome Powell will speak about its policy framework after conducting a review of its goals. Read: Powell to speak next Thursday on Fed’s new inflation-friendly strategyWhat did market participants’ say? “The virus remains the biggest driver and news has been mixed this week, as the U.S. seems to be improving but Europe is going through some flare-ups,” said Tom di Galoma, managing director of Treasurys trading at Seaport Global Securities."}]}