{"article": [{"url": "https://www.marketwatch.com/story/trump-scraps-jacksonville-portion-of-republican-national-convention-calls-for-vigilance-in-battling-coronavirus-outbreak-2020-07-23", "published": 1595537420.0, "headline": "Trump scraps Jacksonville portion of Republican National Convention, calls for vigilance in battling coronavirus outbreak", "body": "An earlier version of this article misidentified the maker of remdesivir, a potential treatment for COVID-19. The pharmaceutical is manufactured by Gilead Sciences Inc. President Donald Trump in the briefing room. Associated Press President Donald Trump said Thursday that he was scrapping the Jacksonville, Fla., component of the Republican National Convention that was scheduled for late next month, underscoring an apparent reversal of tone and approach to the viral pandemic that has crippled much of the country for months. The president said he would still deliver a speech accepting his party’s nomination for re-election in a “different form.” “I looked at my team and I said the timing for this event is not right. It’s just not right,” Trump said at his third White House briefing this week to discuss developments related to the COVID-19 pandemic, after a months-long hiatus from those briefings. “To have a big convention, it’s not the right time,” the president said. Trump’s announcement comes as Ronna Romney McDaniel, the chairwoman of the Republican National Committee, informed members recently of a decision to scale back the event due to the rise in coronavirus infections in the region. Now it is being eliminated entirely, and the president suggested that aspects of the event would be held via webcasts or otherwise online. Florida and California reported single-day records in fatalities with 173 and 157 deaths, respectively, on Thursday. A day earlier, Texas had reported a record 197 deaths. Trump touted apparent progress toward a coronavirus vaccine, pointing to candidates being tested by Pfizer PFE, -0.27% and remedies that have exhibited signs of success, including Gilead Sciences Inc.’s GILD, +0.82% remdesivir treatment. The president painted a relatively upbeat picture of the state of the country in its battle against the pathogen, pointing to country’s northeastern states as “very clean.” “The country is in really good shape,” Trump said, excluding southern and western parts of the country, where infections have been spiking, even as New York state, once an epicenter of the pandemic, appears to be under control. The president urged schools to reopen and maintained a newly adopted tone toward the importance of wearing masks, also urging young people to stop going to bars and other crowded places. In the past, Trump has been laissez-faire at best on the matter of mask wearing, appearing to belittle presumptive Democratic presidential nominee Joe Biden and White House correspondents for having heeded public health guidance on face coverings months ago. On the reopening of schools in the fall, the president said this: “We’re ... talking about schools and we’re saying open … we have to be vigilant.” Trump’s coronavirus briefing comes as total cases of COVID-19 in the U.S. surpassed 4 million, a little over two weeks after reaching 3 million. The nation’s overall death toll neared 144,000, and new cases climbed Thursday by more than 72,000, the sharpest daily rise since July 16, according to data compiled by Johns Hopkins University. The return of briefings also comes as Trump trails Biden in the polls, both nationally and in a host of expected battleground states. The former vice president has picked up steam in recent months, against a backdrop of polling reflecting disapproval of Trump’s behavior during the pandemic."}]}