{"article": [{"url": "https://www.marketwatch.com/story/how-the-pandemic-is-changing-the-way-americans-commemorate-9-11-01599833728", "published": 1599819800.0, "headline": "How the pandemic is changing the way Americans commemorate 9/11", "body": "A woman wearing a flag mask joins others in prayer at the Tunnel to Towers ceremony, Sept. 11, 2020, in New York. AP Photo/Mark Lennihan NEW YORK (AP) — Americans commemorated 9/11 Friday as a new national crisis — the coronavirus pandemic — reconfigured and divided anniversary ceremonies and a presidential campaign carved a path through the observances. In New York, victims’ relatives gathered Friday morning for split-screen remembrances, one at the Sept. 11 memorial plaza at the World Trade Center and another on a nearby corner, set up by a separate 9/11-related organization. The Stephen Siller Tunnel to Towers Foundation objected to the memorial’s decision to forgo a longstanding tradition of having relatives read the names of the dead, often adding poignant tributes. Memorial leaders said the change for the 19th anniversary of the attacks was a coronavirus-safety precaution. Kathy Swift arrived early at the alternative ceremony, wearing a T-shirt honoring her slain brother, Thomas Swift, who worked in finance. “We still have to remember,” said Swift, 61. “The whole country’s going downhill. It’s one thing after another, and now with the COVID. I’m glad they’re still having this, though.” President Donald Trump and Democratic challenger Joe Biden both planned to go — at different times — to the Flight 93 National Memorial near Shanksville, Pennsylvania. Trump is speaking at the morning ceremony, the White House said. Biden planned to pay respects there in the afternoon after attending the observance at the 9/11 memorial in New York, where he and Vice President Mike Pence greeted each other at ground zero before the ceremony began with the usual tolling of a bell. Pence was due later at the Tunnel to Towers Foundation ceremony, where he and his wife, Karen, were to read Bible passages. In short, the anniversary of 9/11 is a complicated occasion in a maelstrom of a year, as the U.S. grapples with a health crisis, searches its soul over racial injustice and prepares to choose a leader to chart a path forward. Still, 9/11 families say it’s important for the nation to pause and remember the hijacked-plane attacks that killed nearly 3,000 people at the trade center, at the Pentagon in Washington and near Shanksville on Sept. 11, 2001, shaping American policy, perceptions of safety and daily life in places from airports to office buildings. Friday will mark Trump’s second time observing the 9/11 anniversary at the Flight 93 memorial, where he made remarks in 2018. Biden spoke at the memorial’s dedication in 2011, when he was vice president. The ground zero ceremony in New York has a longstanding custom of not allowing politicians to speak, though they can attend. Biden did so as vice president in 2010, and Trump as a candidate in 2016. Although the candidates will be focused on the commemorations, the political significance of their focus on Shanksville is hard to ignore: Pennsylvania is a must-win state for both. Trump won it by less than a percentage point in 2016. Around the country, some communities have canceled 9/11 commemorations because of the pandemic, while others are going ahead, sometimes with modifications. The Pentagon’s observance will be so restricted that not even victims’ families can attend, though small groups can visit the memorial there later in the day. At the New York memorial, thousands of family members are still invited. But they’ll hear a recording of the names from speakers spread around the vast plaza, a plan that memorial leaders felt would avoid close contact at a stage but still allow families to remember their loved ones at the place where they died. But some victims’ relatives felt the change robbed the observance of its emotional impact. The Tunnel to Towers Foundation arranged its own, simultaneous ceremony a few blocks away, saying there was no reason that people couldn’t recite names while keeping a safe distance. The readers stood alone at podiums that were wiped down between each person. The two organizations also tussled over the Tribute in Light, a pair of powerful beams that shine into the night sky near the trade center and evoke its fallen twin towers. The 9/11 memorial initially canceled the display, citing virus-safety concerns for the installation crew. After the Tunnel to Towers Foundation vowed to put up the lights instead, the memorial changed course with help from its chairman, former Mayor Mike Bloomberg, and Gov. Andrew Cuomo. Tunnel to Towers, meanwhile, arranged to display single beams for the first time at the Shanksville memorial and the Pentagon. Over the years, the anniversary also has become a day for volunteering. Because of the pandemic, the 9/11 National Day of Service and Remembrance organization is encouraging people this year to make donations or take other actions that can be accomplished at home."}]}