{"article": [{"url": "https://www.marketwatch.com/story/they-are-still-citizens-so-they-should-be-able-to-access-that-money-inside-the-quest-to-claim-stimulus-checks-before-the-deadline-2020-07-21", "published": 1595655980.0, "headline": "â\u0080\u0098They are still citizens, so they should be able to access that moneyâ\u0080\u0099: Inside the quest to claim stimulus checks before the deadline", "body": "Birmingham, Ala.â\u0080\u0099s weather is sweltering these days, so Erica Robbins has three important questions for the homeless people she meets at her hydration station: Do they need water? Do they have food? And have they applied for their stimulus check? “ â\u0080\u0098They are citizens just like everybody else and deserve to have access to this fund.â\u0080\u0099 ” â\u0080\u0094 Erica â\u0080\u0098Starâ\u0080\u0099 Robbins, executive director and founder of Be a Blessing Birmingham â\u0080\u009cThey are citizens just like everybody else and deserve to have access to this fund,â\u0080\u009d said Robbins, the executive director and founder of Be a Blessing Birmingham whoâ\u0080\u0099s helped approximately 150 people get their $1,200 economic impact payment using the Internal Revenue Serviceâ\u0080\u0099s website. Robbins started by helping homeless Birmingham residents she knows from meal-distribution routes. Word spread and her work incorporates senior citizens who arenâ\u0080\u0099t tech savvy, but watch the evening news and want to know about their payment. While Americans waiting to hear whether a second round of stimulus checks will be included in another coronavirus relief package, Robbins and others are trying to ensure people on the margins get their first installment â\u0080\u0094 and they have to do it before an Oct. 15 application deadline. In Broward County, Fla., Richard Campillo, a retired Nestle NSRGY, +1.16% Â executive, started his own single-person operation to connect homeless county residents with their checks. Using the address and work space of a non-profit combatting homelessness, HOPE South Florida, Campillo has processed approximately 50 stimulus check applications. He does the work on Fridays, from 10 a.m. to noon and is looking for volunteers to assist him. The line starts forming by 8 a.m. Some people use the money for a fresh start, like a man who paid off speeding and parking tickets so he could make money driving again, said Campillo, a board member for Broward Partnership, a Fort Lauderdale-based housing and social-service organization. In Snohomish County, Wash., Penelope Protheroe, founder and president of the Angel Resource Connection, and volunteers have been doing the stimulus-check application outreach long enough to see a change in the people served. They started with people who were already homeless when the pandemic first struck. As double-digit jobless rates continued, Protheroe said some people became homeless, had bank accounts and emails, but didnâ\u0080\u0099t make enough money meet income-tax filing requirements, she explained. “ â\u0080\u0098These are the people closest to the edge that got out first. They were just a breath away from being blown into this homelessness.â\u0080\u0099 ” â\u0080\u0094 Penelope Protheroe, founder and president of the Angel Resource Connection These are the people closest to the edge. They were just a breath away from being blown into this homelessness,â\u0080\u009d she said. The organization is located approximately 45 minutes north of Seattle and has processed around 400 stimulus-check applications. Volunteers still get about 20 to 30 people lining up for help when they go on food-distribution runs on Monday and Wednesday. Some have spent the money on used cars, which Protheroe said they can drive and sleep in. One man used it buy landscaping equipment so he could get work. Others are saving it for when the weather turns cold, she said. â\u0080\u0098We canâ\u0080\u0099t issue payments to people we canâ\u0080\u0099t identifyâ\u0080\u0099 The IRS has distributed approximately 160 million economic impact payments, totaling $270 billion, Charles Rettig the agencyâ\u0080\u0099s commissioner, recently told senators. The IRS determines who qualifies and where to send the money by looking at tax returns and whoâ\u0080\u0099s receiving benefits through Social Security, Veterans Affairs and the Railroad Retirement Board. Thatâ\u0080\u0099s a wide swath, but it doesnâ\u0080\u0099t cover everyone. Someone whoâ\u0080\u0099s under 65 and makes less than $12,200 a year has no income-tax fling requirement. A married couple must make at least $24,400 before they have to file a return. Penelope Protheroe, founder and president of the Angel Resource Connection, helping connect someone with their stimulus check. Courtesy Penelope Protheroe, Photo by Tom Kirkendall Up to 12 million people could be missing out on stimulus payments because they arenâ\u0080\u0099t on any of the government records needed to trigger a check, according to the Center on Budget and Policy Priorities. The projection consists of an estimated 9 million people who didnâ\u0080\u0099t file 2018 taxes but had food stamp and/or Medicaid assistance, and another three million didnâ\u0080\u0099t file taxes or get any public benefits. Many poor people are getting their stimulus checks later, an Urban Institute study suggests. Almost 70% of all people in an approximate 4,300-person survey said they got their payment by late May, but 58.6% of adults at or below the poverty line received it by that time, researchers said. “ â\u0080\u0098We canâ\u0080\u0099t count people who we canâ\u0080\u0099t identify and we canâ\u0080\u0099t issue payments to people we canâ\u0080\u0099t identify.â\u0080\u0099 ” â\u0080\u0094 IRS Commissioner Charles Rettig The 12 million-person estimate is â\u0080\u009csignificantly overstated,â\u0080\u009d Rettig told senators at a Finance Committee hearing in late June. â\u0080\u009cIâ\u0080\u0099m probably not at liberty to give a number, but I would say itâ\u0080\u0099s overstated multiple times. But part of the difficulty here is we canâ\u0080\u0099t count people who we canâ\u0080\u0099t identify and we canâ\u0080\u0099t issue payments to people we canâ\u0080\u0099t identify,â\u0080\u009d he said. The commissioner said heâ\u0080\u0099s reached out to various organizations that help people claim their checks. But the IRS can only do so much. Itâ\u0080\u0099s trying to emerge from a tax-return backlog after having to temporarily close most offices during the outbreak. Obstacles big and small People who donâ\u0080\u0099t file taxes and arenâ\u0080\u0099t claimed as someone elseâ\u0080\u0099s dependent can get the $1,200 payment by completing the IRSâ\u0080\u0099 online non-filer tool. For someone living on societyâ\u0080\u0099s fringes, thatâ\u0080\u0099s not an easy task, advocates told MarketWatch. Many libraries â\u0080\u0094 places with free internet access â\u0080\u0094 remain closed. Ninety-nine percent of libraries had limited building access, according to an American Library Association survey of more than 3,800 school and public libraries in May. Then thereâ\u0080\u0099s email and mailing addresses. The non-filer tool needs both, but many homeless people may not have them. Campillo said some of the people he helps canâ\u0080\u0099t remember their email password, because the libraryâ\u0080\u0099s browser would put it in the autofill. If non-filers have to establish a new email address, Protheroe said thereâ\u0080\u0099s often a two-step authentication process where a code is sent to a phone number. One problem: Many of the people she helps donâ\u0080\u0099t have a phone number where the code can be sent. As a result, volunteers use their phone number to confirm the process. “ Two out of 50 organizations agreed to be the mailing address for stimulus checks for Angel Resource Connection ” Thereâ\u0080\u0099s also a question of where the payment should be sent. Protheroe called 50 organizations asking to use their mailing address. Two agreed. These non-filers have to figure out where to deposit, access and hold onto stimulus cash. They are part of the 14.1 million â\u0080\u009cunbankedâ\u0080\u009d adults in the country. Instead of check cashiers who charge $50, $60 fees, Campillo steers them to Walmart WMT, +1.00%, where all cashed checks worth more than $1,000 have an $8 fee. Campillo helped one man who later told Campillo muggers took his stimulus cash. â\u0080\u009cHeâ\u0080\u0099s just a gregarious kind of individual who told the wrong people,â\u0080\u009d Campillo said. Though IRS has started issuing debit cards, it sent paper checks to the people helped by Campillo. See also:Donâ\u0080\u0099t toss that junk mail in the recycling bin just yet â\u0080\u0094 it might contain your stimulus check in the form of a prepaid debit card Someone who misses the Oct. 15 non-filer application deadline doesnâ\u0080\u0099t miss the stimulus check. Theyâ\u0080\u0099ll need to file a tax return next year to get the money. But that might be too long of a wait for many. There was a time when Robbinsâ\u0080\u0099 cell phone would start ringing at 7 a.m. with calls seeking stimulus-check help. The call frequency has lessened, but that too could change. Robbins is not talking up the possibility of another stimulus-check with clients. She doesnâ\u0080\u0099t want to raise expectations if more direct payments donâ\u0080\u0099t materialize. But sheâ\u0080\u0099s keeping an eye on Capitol Hill. â\u0080\u009cWeâ\u0080\u0099re on go, and weâ\u0080\u0099re ready.â\u0080\u009d"}]}