{"article": [{"url": "https://www.marketwatch.com/story/ke-holdings-shares-are-off-to-a-flying-start-in-ipo-debut-that-raises-212-billion-2020-08-13", "published": 1597344800.0, "headline": "A Chinese IPO just raised more than $2 billion amid tensions between U.S., China", "body": "Shares of KE Holdings Inc., a Chinese online property platform, soared 87% in a blockbuster public debut Thursday that raised more than $2 billion despite the imminent threat of a hostile U.S. government. The public debut of KE Holdings BEKE, +2.48% , also known as Beike Zhaofang and backed by SoftBank Group Corp. 9984, -1.24% and Tencent Holdings Ltd. 700, +0.84% , underscored vigorous demand for the offering — the largest float by a Chinese company in the U.S. since iQiyi Inc. IQ, +0.84% raised $2.4 billion in March 2018. “These are very good results and affirmation of our company’s culture of transparency and collaboration,” company Chief Financial Officer Tao Xu told MarketWatch in a phone interview early Thursday. KE Holdings reported a net profit of $227.5 million in the first half of 2020 on revenue of $1.77 billion. The company combines a traditional real-estate brokerage that has existed for nearly 20 years with a real-estate services business that mostly exists online. In American terms, it is similar to a combination of Re/Max Holdings Inc. RMAX, -0.35% and Zillow Inc. Z, -0.74% . The company’s revenue grew more than 60% in 2019 to $6.5 billion, KE reported in filings with the Securities and Exchange Commission, while losses more than quadrupled to $308.6 million. The Beijing-based company priced its initial public offering early Thursday at $20 per American Depositary Share, above its proposed price range of $17 to $19. It sold 106 million ADS to raise $2.12 billion. Goldman Sachs led nine underwriters on the deal. KE Holdings’ IPO comes fraught with peril, starting with the White House. President Donald Trump and Treasury Secretary Steven Mnuchin have said the administration is considering delisting Chinese companies trading on U.S. public markets, among other penalties. Opinion: Luckin Coffee shows how risky Chinese IPOs can be, but investors are just not listening Xu declined to speculate on the U.S. government’s relation with China, reciting the benchmarks of the company’s plan to “transform the housing transactions and services industry in China.” Proceeds from the IPO, he said, will be used for research and development to expand home transaction services, diversify its service offering, and for general corporate purposes. KE Holdings enters a volatile political and economic landscape. Investors have dumped billions into Chinese companies in recent years, even as shareholder advocates such as the Council of Institutional Investors warn of risks associated with low-visibility stocks far, far away. Case in point: In May, Luckin Coffee Inc. LKNCY, -12.24% said it terminated CEO Jenny Zhiya Qian and Chief Operating Officer Jian Liu amid an investigation into financial misconduct that involved fabricated transactions totaling about $310 million. At the time, Luckin Coffee said it placed six other employees on leave or suspension. The Chinese IPO that KE Holdings was trying to unseat for largest of recent vintage — iQiyi, commonly referred to as the Chinese Netflix Inc. NFLX, +1.43% — showed how tenuous these companies can be just hours after KE debuted. In an earnings report Thursday afternoon, the streaming company announced that the SEC is investigating allegations made by a short seller against iQiyi in April, sending shares down almost 18% in after-hours trading. Despite attention from U.S. lawmakers and high-profile misfires, Wall Street continues to accept offerings from high-flying Chinese companies. Dealogic reported Thursday that there have been 22 U.S. IPOs from China so far this year including KE, approaching the 25 that went public all of last year. They have raised $6.12 billion, easily surpassing last year’s total of $3.52 billion. Renaissance Capital, a provider of IPO-focused ETFs, said that it had tracked 18 Chinese IPOs in the U.S. this year for a total of $5.5 billion; Renaissance does not include SPACs in its calculations. That is on par with 2018’s total of $5.6 billion at this time of the year, which came from 16 issuers including iQiyi."}]}