{"article": [{"url": "https://www.marketwatch.com/story/ftse-100-suffers-as-u-k-government-mulls-second-coronavirus-lockdown-11600442568", "published": 1600428620.0, "headline": "FTSE 100 suffers as U.K. government mulls second coronavirus lockdown", "body": "Another national lockdown would aim to prevent a second spike in the virus, but could be devastating for the U.K. economy. Oli Scarff/Agence France-Presse/Getty Images Stocks in London ended the week on a pessimistic note, after reports the U.K. government is considering a second nationwide lockdown to control the spread of the coronavirus pandemic, with airline and travel stocks leading the charge into the red. The FTSE 100 UKX, +0.64%, the index of London’s top 100 stocks by market capitalization, fell 0.5% and was filled with more losers than gainers as the trading week came to a close, with 57 of its constituents falling. The U.K. government’s top scientific advisers have reportedly proposed a second national lockdown in October, as coronavirus cases across the country rise. “The Government wants to avoid economic disruption, but clearly a return to tighter lockdown measures next month would disrupt businesses and put further pressure on jobs,” AJ Bell investment director Russ Mould said. There are already a number of regions in the U.K. under local lockdowns, with new restrictions placed on the city of Newcastle and other cities in the northeast of England on Thursday. “Talk of new localized and targeted lockdowns, as well as curfews and quarantines appear to be becoming more commonplace, raising concerns about the resilience of the recovery we have seen thus far across Europe,” said Michael Hewson, an analyst at CMC Markets. News of the lockdown hit airlines hard, making British Airways owner IAG IAG, -3.72% the biggest loser on the FTSE 100 as it dropped 12%. Embattled airline easyJet EZJ, -4.22% fell as much as 7.5% and InterContinental Hotels IHG, +1.35% fell 4%. Sainsbury’s SBRY, +1.80% was a big gainer on the FTSE 100, rising as much as 3.6% after news broke that Czech billionaire Daniel Křetínský became its fourth-largest shareholder by taking a more than 3% stake in the grocer. U.K. retail sales data showed that sales volumes increased by 0.8% in August compared with July, up 4% from pre-pandemic levels in February. As a proportion of that, online sales fell by 2.5% compared with the last month, but are still 47% higher than in February. “The pandemic has brought about a revolutionary shift in the way we shop as consumers have switched to online stores and opt for click-and-collect services from the high street,” said Susannah Streeter, an analyst at Hargreaves Lansdown. “As the sector has reopened, rather than switch back to old habits, consumers seem to have embraced it as a longer-term change,” Streeter said, noting that it remains very difficult for many bricks and mortar fashion retailers."}]}