{"article": [{"url": "https://www.marketwatch.com/story/retail-sales-surge-a-record-177-in-may-but-coronavirus-wounds-still-visible-2020-06-16", "published": 1592327420.0, "headline": "Retail sales surge a record 17.7% in May, but coronavirus wounds still visible", "body": "The numbers: Sales at U.S. retailers roared back in May as the economy started to reopen and claw its way out of what’s likely to have been the shortest and deepest recession in American history. Retail sales jumped a record 17.7% last month, the government said Tuesday. Economists polled by MarketWatch had forecast an 8.5% increase. Sales had tumbled by a record 14.7% in April and 8.2% in March, revised statistics show. The rebound in sales largely reflects the loosening of restrictions on business activity after two months of stay-at-home orders to combat the coronavirus pandemic. Along with pentup consumer demand, federal tax payments to families and more generous unemployment benefits also helped stoke higher sales. Yet even after the rebound in May, sales were still 6% lower compared to the same month in 2019, showing the lingering damage caused by the lockdown of the economy. What happened: Sales leaped 44% at auto dealers to give a bright gloss to the retail report. The auto sector typically generates about one-fifth of all retail spending. Sales excluding autos rose 12.4%, also a record. Sales leaped 188% at clothing stores, 90% at home-furnishing stores and 88% at stores that sell books, music, sporting goods and other hobby items. All three groups were hit hard in April and March. Sales also increased nearly 13% at gas stations, showing that Americans got back on the road and visited their favorite stores. Receipts also increased 29% at bars and restaurants that bore the brunt of the coronvirus lockdowns in March and April. Still, food-service sales in May were down 40% compared to a year earlier, pointing to an ongoing struggle by hundreds of thousands of restaurants to survive the current crisis. Many have had to cope with a smaller number of customers due to social distancing requirements, reducing their profits and forcing them to permanently cut staff. Internet retailers, one of the few industry bright spots during the pandemic, posted a 9% gain in sales. Grocery sales recorded a much smaller 1.3% increase in sales after a record 14.4% spike in April. The only sector that fared relatively poorly was health and personal care — pharmacies, salons, barbers and so forth. Sales rose a scant 0.4%. Read: Consumer sentiment climbs again in June as reopening U.S. economy eases worries See: MarketWatch Economic Calendar What they are saying? ”The strength of retail sales is testimony to the power of reopening the economy, even partially. It is also a testimony to how big the decline in activity was in the three months through April,” said chief economist Chris Low of FHN Financial. “How much of the spending was from pent-up demand and how much was fueled by government checks is what’s now up for debate,” said Robert Frick, corporate economist at Navy Federal Credit Union. “To continue this strong spending, we’ll need more strong job growth, and, for the time being, continued government help.” Big picture: The damage from the pandemic has been so broad that it could take awhile for the U.S. economy to return to normal. Further outbreaks of the coronavirus, new safety rules and widespread social distancing requirements will change how Americans live and work for the immediate future. The pace of the recovery ultimately could depend on how quickly a cure or treatment for the virus is found. Read: U.S. entered recession in February after end of longest expansion in history Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% surged in Tuesday trades on news the Trump administration is considering another trillion-dollar bill to aid the economy during the coronavirus crisis."}]}