{"article": [{"url": "https://www.marketwatch.com/story/abbott-jj-results-buoyed-by-surprising-june-uptick-in-medical-procedures-even-as-coronavirus-cases-rise-2020-07-20", "published": 1595232560.0, "headline": "Abbott, J&J results buoyed by surprising June uptick in medical procedures even as coronavirus cases rise", "body": "Abbott Laboratories and Johnson & Johnson separately reported earlier-than-expected recoveries of elective procedures in American hospitals in the second quarter, even as the nation struggles with a worsening COVID-19 pandemic. Shares of Abbott ABT, +1.02% closed at a year-to-date high of $99.25, the day after it reported its second-quarter results that beat expectations for profit and revenue. Johnson & Johnson’s JNJ, +1.39% stock closed at $149.29 on Thursday, the day it reported that its second-quarter profit and sales beat expectations. The company also raised its full-year outlook. Both companies market a mix of medical products, including devices, drugs and tests for Abbott and pharmaceuticals, devices and consumer brands like Band-Aids for J&J. As the coronavirus swept through parts of Asia, Europe, and the U.S., the largest geographic markets for these companies, many hospitals canceled or postponed elective appointments and procedures that often use medical devices and diagnostic testing. This was done to keep patients out of high-risk health care facilities and to free up personal protective equipment like masks, gloves and gowns as well as the workers themselves for COVID-19 patients. Read: Rule change for how hospitals report coronavirus data to government comes under fire Many of the initial spikes in coronavirus cases in the U.S. took place during the second quarter of the calendar year, which began in April and ended in June It came as somewhat of a surprise then that companies like Abbott and J&J saw unexpected recoveries in procedure volume at the tail end of the second quarter. Abbott president and CEO Robert Ford said Thursday that “procedure volumes had rebounded to approximately 90% of pre-COVID levels on average in the U.S.” by the end of June, according to a FactSet transcript of a call with investors. Its diagnostic testing business, which does not include the diagnostic and serologic tests it sells for COVID-19, also bounced back, to a similar 90% threshold when compared to pre-pandemic levels, according to Ford’s comments. That said, Abbott’s global device sales still fell 21.2% on a reported basis to $2.4 billion in the second quarter of 2020, as did U.S. sales of devices, down 29.0% to $966 million. Diagnostic sales gained 7.1% to $1.9 billion in the second quarter of the year; in the U.S. market, they soared 23.2% to $857 million. J&J’s medical devices business reported a 33.9% decline in sales on a reported basis to $4.3 billion in the second quarter of 2020, down from $6.5 billion in the same quarter a year ago. U.S. sales of medical devices tumbled 39.6% to $1.8 billion in the second quarter of the year, compared with $3.1 billion in the same quarter in 2019. J&J CFO Joseph Wolk told investors on Thursday that company executives still expect the second quarter to be the most negatively impacted quarter this year for device sales. “We are encouraged by the improvement we saw in each month in Q2, with the month of June being down the least at approximately 25% vs. our original expectations,” he said during an investor call. “We experienced a faster recovery than anticipated and thus the backlog of patients we originally predicted in Q4 as a result of pent-up demand is now presumed to occur earlier in the year.” J&J’s reported rebound in elective surgeries “bodes well” for manufacturers like Stryker Corp. SYK, +1.75% and Zimmer Biomet Holdings Inc. ZBH, +0.90%, both of which solely sell medical devices, according to Raymond James analysts. Stryker reports earnings July 30; Zimmer reports the following week. But recent surges in cases in the U.S. may also become a barrier to growth in the second half of the year, they said. “Ultimately some of the resurgence in COVID-19 concerns likely means there could be a slower progression from here,” the analysts wrote July 16. A few months back, the expectation was that the U.S. would fare similarly to other hard-hit regions, like Italy, Spain, and China. Following a peak in cases, the U.S. would be on the other side of the curve, with some breathing room before a potential “second wave” would occur. However, that has not been the case in the U.S.. Coronavirus cases are surging in California, Florida, and Texas, among other states. According to the Kaiser Family Foundation, more than half of U.S. states are considered “hot spots” for the virus, as of July 19. See also:Breaking down this ‘miracle’ COVID-19 survivor’s $1.1 million hospital bill There are a few new potential scenarios for how the recent uptick in cases affects the health care industry’s traditional sales of products and services unrelated to COVID-19. Many U.S. hospitals, which now have a better understanding of how the virus is transmitted (and how to prevent transmission within a health care setting) and also how shutting down elective procedures can affect their bottom lines, may move forward with some procedures even as they care for a rising number of COVID-19 patients. Hospitals “as much as possible want to try to continue ensuring that patients can get access to those procedures even while managing the pandemic,” J&J CEO Alex Gorsky said on the same investor call. “But, again, depending on where they are, there have been some areas where they shut down elective procedures, and they’re managing it based upon the case loads they’re seeing.” “There is less uncertainty about the intermediate-term outlook for procedures over the next 12 months, but the shape of the recovery curve in [the second half of 2020] is a bit unclear,” SVB Leerink device analysts wrote in a July 17 note. “Overall, hospitals will likely be better prepared to deal with regionalized COVID surges as compared to preparedness in March/April — so impacts to elective procedures, if/when second waves hit, should be more manageable than the first go-around.” Abbott’s stock is up 14.2% and shares of J&J are up 2.4% since the start of the year. The S&P 500 SPX, +0.87% is down 0.2% for the year."}]}