{"article": [{"url": "https://www.marketwatch.com/story/meet-the-man-whos-been-behind-nearly-every-evolution-of-the-fund-industry-for-two-decades-2020-07-15", "published": 1594887080.0, "headline": "Meet the man who's been behind nearly every evolution of the fund industry for two decades", "body": "To call him financial services' Forrest Gump might be a stretch, but Carlos Diez has been behind the scenes of just about every big fund-industry pivot for the past two decades. At the height of the dot-com boom, he saw the business opportunity of a growing consumer class interested in investing, then, a few years later, anticipated the future in indexing. He's had some crummy timing, though: It took so long to get his firm, MarketGrader, off the ground that the dot-com bubble popped and the U.S. entered a bear market. Several years later, an asset manager launched a suite of funds based on MarketGrader indexes. That was in October 2007 - just as the cracks were starting to form in the global financial system, and at the very peak of that market cycle. Diez says he's learned from the downs as well as the ups, and he's humble about it: The funds were closed in March 2009, just as the longest bull market in history was starting up. In the following decade, those indexes outperformed their benchmarks, returning 374%, compared to 318% for the S&P 500 SPX, +0.87%  . MarketWatch spoke with Diez about his career starting new things, and then starting again, as well as what he's thinking about now. The interview that follows has been edited for clarity. MarketWatch: Could you share your biography? Carlos Diez: I actually started the company right out of college. I went to college in California and graduated in 1999, so I went through all the dot-com experiences as a student. A lot of buddies of mine in college were, quote-unquote, investing in the stock market. I remember teammates on my soccer team would come and say, \"I bought this or that,\" and I would say \"what do they do?\" They would say \"I have no idea, but they're up 30%.\" I thought I could build a tool that would help investors understand what they're buying. That was the genesis of MarketGrader. It took a little bit longer than I thought to get all the pieces together. And there was a big bear market that affected our launch plans. When we launched, in 2003, we started research for some institutions, some sell-side, some investment banks, and in parallel to that we started building our indexes. It was accidental, if you will. We were putting out ratings on companies in the U.S. and Canada and only 15% of companies were a \"buy,\" and people said, what's going on here? So we said, let's build a model portfolio of the best companies in MarketGrader. We didn't want to overweight the largest companies because we saw what happened in the late 1990s and early 2000s. So it was the 40 best companies in MarketGrader, equally weighted, and we rebalanced every six months. Dumb luck had it that that happened to be a banner year for stocks, so we did very well. This was well before smart beta and things that are so hot today. We had built a good relationship with (asset manager) London & Capital and plowed head-on into the ETF space. I had always thought ETFs were going to be the next big thing in the space. We launched our first ETFs in October 2007 at the very top of the market. We rode the 2008-2009 market down and eventually the company (closed the funds). That was a big hit to our business. Concurrently, we were developing a relationship with Dow Jones. We met the editors of Barron's in 2004. At the time, Barron's online was a novel product. Barron's wanted to find a tool that rated stocks like we did to complement their writers' analysis. We built a tool called StockGrader to go alongside the new Barrons.com that launched in 2005. And because we were having success in the index business, we met with Dow Jones Indexes in 2007 and created the Barron's 400. (MarketWatch note: an ETF based on the index, the Barron's 400 ETF BFOR, +0.73%  , launched in 2013.) About six years ago, we really started focusing on building out our company globally. We were particularly focused on Asia, specifically China. I started visiting China in 2004-'05, and we built a family of A-share indexes there. CSI (China Securities Index Co.) is owned by the two stock exchanges which are, by extension, owned by the state. We co-created two indexes that they started publishing and eventually we licensed one to VanEck in Australia, which has been doing really well. That was the beginning of our global expansion. VanEck in New York converted two of their ETFs to use MarketGrader benchmarks, one on China and one on India. Related:The man behind Case-Shiller on why the housing index has no Houston and why that's no problem MarketWatch: Can we go back to the October 2007 launch, and could you just talk a little about your feelings about being at the mercy of timing? Diez: A few years ago, that was a big source of frustration for me personally and professionally. I felt like we were on our way and things happened that we couldn't control, not just a huge market event, but the fact that our client decided to exit the business. It was very frustrating. But now in hindsight, it was actually a good experience. I know that might sound masochistic, but we learned a lot. We learned about how to get involved and when not to get involved in the development of products, and how important it is, if someone goes out to offer an investment product to a client, it's as important for the provider of that fund to know there's a match between the two as it is for the seller of the fund. If you sell someone a long-term capital appreciation strategy but the client is maybe focused on making money in the next couple of weeks or jumping on a bandwagon that might be doing well, it's bound to wind up disappointing the client. We learned a lot about that process. We're not a product provider but we've try to work very closely with them - London & Capital, VanEck and ALPS (the distributor of the Barron's 400 ETF.) From a company-specific perspective, to be honest, in those early years we were doing fairly well and growing organically and thought that could continue, so we never sought a bigger partnership or more capital from a larger institution, we thought we could do it alone. In hindsight that was a mistake. It's important to have the capital and the right partners. We were flying on our own. MarketWatch: Has that changed? Diez: We have taken on more capital from our existing investors, not from a larger institution. But that's something that might happen at some point. In China specifically, we are making a concerted effort to find a partner, because for us to have success in China, although we're fairly well-known, for us to go it alone in China is very difficult, almost impossibleâ\u0080¦ All the negative things you hear about, in terms of access for foreign firms, those are all very real. MarketWatch: You didn't mention this much, but I've heard from other people that you were pretty early to the idea of smart beta, even though some other companies, like Research Affiliates, have gotten a lot more attention for their work on it. Diez: It was partly accidental, but we did feel that it was important to offer investors something different than what was out there, meaning purely market-cap-weighted stocks in indexes. At the time, people thought stock selection in passive strategies was anathema. They'd say, \"oh, it goes against our creed.\" But I thought our process was transparent and it worked well, and you could call it an index because it was not one person selecting stocks. It was just an index that behaved differently. We had latched on to London & Capital and we were a small company, growing, and they were opening up opportunities for us. Why not ride that opportunity while it lasted? So obviously things played out differently and that's why people don't know about us being in it early. Rafi has a very strong product. Very shrewdly and very smartly, rather than becoming a product company, they said, we're going to license this and you can brand them your own thing, whether Pimco or Schwab or whatever. I think that was genius. I attribute a lot of their success as much to that as much as to the methodology. MarketWatch: One of the biggest issues in the ETF ecosphere has to do with intellectual property. How do you think about that? Diez: Long and hard. (Laughs.) I think about that often and I think, more than someone taking your idea and replicating it, there's also the risk, especially nowadays, of someone taking your message and taking ownership of it, even if the underlying exposure isn't as good as yours. In the early days of an ETF launch, the perception is just as important as reality. A lot of companies have the resources to go out and blast out a message that maybe might not be as much a part of their DNA as it is yours. At the end of the day, what matters is the perception from investors. That's the biggest challenge for us, the ability to communicate is what allows people to try you out and test what you're offering. I spend a lot of my time helping my clients. VanEck is the perfect example. They're a very good client to work with, and there's a lot of overlap between our views and theirs, especially on emerging markets and on China. They see the value that MarketGrader brings to the table but they're big enough that they have the resources to do things their way. But they don't want to have another me-too product out there. They'd rather have something that they think is unique, and I'd like to think that's what they see in us. MarketWatch: We talked a lot about your interest in China, but what's the next-next thing? Diez: From a country-regional perspective, I think what's happening in China will continue to be front and center for some time. We've made a strong case for investors having a good exposure to China, being there for a long time. It would be a mistake not to, in our opinion. But separate from that, based on what's happened geopolitically, there's been a clear separation of economies and markets which will continue. I don't think there is going to be a full disengagement between the U.S. and China, but we're starting to see some countries pushing back on some of the things China has done. India (which just banned dozens of Chinese mobile apps), for example. The U.K. announced Huawei (will be excluded from its 5G wireless network). That will have repercussions for investors. I think there will be an opportunity to build exposures around those themes. I feel strongly about growth in some Asian countries besides China, and I think investors may choose to invest in those. I think the indexes and products out there still leave room for companies like us to build products that are differentiated. Read next:Coronavirus was the perfect storm for tech innovation, and this fund manager made out"}]}