{"article": [{"url": "https://www.marketwatch.com/story/another-coronavirus-aid-package-is-probably-not-happening-after-august-jobs-report-and-deal-to-avoid-government-shutdown-analyst-says-2020-09-04", "published": 1599294740.0, "headline": "Another coronavirus aid package is probably 'not happening' after August jobs report and deal to avoid government shutdown, analyst says", "body": "Friday's jobs report makes it more likely that Washington won't deliver another big coronavirus aid package before the November election, according to some analysts. The better-than-expected report showed the U.S. economy regained 1.4 million jobs in August as unemployment fell to 8.4% from 10.2%. See:U.S. regains 1.4 million jobs in August, unemployment falls to 8.4% And read:'What's concerning is that the pace of jobs growth is slowing down' - economists react to August jobs report \"For those who, after having voted to explode the budget deficit, have suddenly remembered that they don't like government welfare payments, this report could strengthen their resolve to deny another package gets passed, since the need is not nearly as great as it had been,\" said Joel Naroff, president and chief economist at Naroff Economics, in a note. The report on nonfarm payrolls \"also undercuts the arguments of those who support additional massive government stimulus, that the economy is a disaster,\" Naroff added. \"It is, when looked at on an absolute basis, but relatively speaking, it is not as big a disaster as it had been.\" Related:U.S. budget deficit to hit record $3.3 trillion this year, CBO says Also:Coronavirus update - U.S. official sees very low chance of vaccine by late October Henrietta Treyz, director of economic policy research at Veda Partners, told clients in a note that they should \"assume\" another aid package is \"not happening.\" She said she's downbeat on the chances for more fiscal stimulus both because of Friday's jobs report and because of the news late Thursday that House Speaker Nancy Pelosi and Treasury Secretary Steven Mnuchin have agreed to try to avoid a federal government shutdown. Pelosi, a California Democrat, and Mnuchin, one of the Trump administration's negotiators, are aiming to avoid a shutdown when current funding expires on Sept. 30 by working on a \"clean\" continuing resolution rather than allowing the issue to be linked to pandemic aid talks. See:Shutdown prospects dim, but so do fiscal-stimulus odds as Pelosi, Mnuchin eye separate tracks ahead of September free-for-all If the Pelosi-Mnuchin deal holds and a continuing resolution funding the government passes, \"there is no other must-pass legislation for another stimulus bill to hitch a ride on before Congress recesses for the election,\" Treyz wrote. In addition, \"Republicans in the U.S. Senate are already very uncomfortable with the record high deficit spending Congress has agreed to this year, and a sub 10% unemployment rate gives them more reason to reject further deficit spending from here,\" she said. \"We are formally dropping our odds of another $1.5T+ stimulus package this morning from their previous 60-75% rate to 20-30%,\" Treyz said. She added that her firm believes \"it is prudent for investors to position their portfolios with the assumption that no more federal stimulus will be delivered from Congress until after the November 3 election, at the earliest.\" Eight to 12 Republicans in the Senate, where the GOP has a 53-to-47 majority, will \"not vote for any further stimulus, even if the overall spending was as low as $500B,\" she also said. Senate Republicans have been working on a \"targeted\" or \"skinny\" aid bill with a possible price tag of $500 billion. The next relief package is an \"all or nothing proposition,\" so if there is no major deal on fiscal stimulus, there won't be an extension for the Paycheck Protection Program and no additional aid for airlines, restaurants, cruise operators and hotels, according to the Veda Partners analyst. U.S. stocks SPX, +0.87%  DJIA, +0.56%  COMP, +1.39%  were recently trading sharply lower Friday in the wake of the August jobs report."}]}