{"article": [{"url": "https://www.marketwatch.com/story/is-americas-masked-city-losing-its-grip-on-safety-2020-06-16", "published": 1592306840.0, "headline": "Is America's masked city losing its grip on safety?", "body": "\"Don't make me come down there â\u0080¦\" For the past three days, those six words have set the tone in New York. They came in a Twitter TWTR, -0.23%  post on Saturday from Gov. Andrew Cuomo, and the whole world immediately grasped what Michaela, Mariah and Cara Cuomo must have confronted on the rare occasions when one of them was still out with friends after her curfew. As far as anyone knows, none of the governor's three grown daughters was in the carefree crowd of open-air drinkers in the 45-second video that accompanied their father's tweet. The video could have been shot in any of two dozen city neighborhoods. But it happened to be on St. Mark's Place, a legendary bastion of laissez-faire in Manhattan's East Village. The partyers were elbow-to-elbow. A jazz band played. And maybe - maybe - one in 10 of the faces was covered with a mask. When I say covered, I mean both major airways, nose and mouth. There were some chin-strap masks on the sidewalk and in the street. Some elbow-guard masks. Some masks around people's necks and peeking out of people's pockets, where they are absolutely guaranteed to do no good. What was hard to spot were people actually wearing their masks as intended, providing a measure of safety in a city where the coronavirus has killed more people than any other on earth. Also on MarketWatch: How many are unemployed? What's the confidence in the economy? See the Coronavirus Recovery Tracker When the history of COVID-19 is finally written, that phrase will stand alongside a small handful of others in capturing the defining moments in this dicey, deadly journey of ours. President Donald Trump's \"15 people, and the 15 within a couple of days is going to be down to close to zero.\" And economic adviser Larry Kudlow's \"containedâ\u0080¦pretty close to airtight.\" And now there's \"Don't make me come down there â\u0080¦,\" a father's last-ditch warning just before things potentially go south. The truth is that New York has a lot to be proud of right now, thanks to the widespread mask wearing, social distancing and other public-health measures that people embraced all spring. Who knew eight million headstrong New Yorkers would hunker down in their apartments for 3½ months and hardly come outside at all? Well, they did that. And as a result, deaths are down. Hospitalizations are down. New cases are down. Way, way down. The state with the highest infection rate in America now has the lowest. But there's another question, and that question is: Are people starting to drop their guard? The sidewalk drinking scenes say, Maybe so. Three and a half months is a very long time to do anything difficult, and New Yorkers are not famous for their patience. Is all this social responsibility a one-time deal? See: Why do so many Americans refuse to wear face masks? It may have nothing to do with politics Unlike in some parts of the country, it isn't a matter of culture-war bravado in New York. By leaving their masks in their pockets, New Yorkers aren't making a statement about their right to infect others and themselves. It's more elemental than that. They miss their friends, and they're tired of being inside. They certainly have enough role models for what not to do. Alabama, Arkansas, California, Florida, Nevada, North Carolina, Oklahoma, South Carolina, Tennessee and Texas all hit new highs for hospitalized patients over the weekend. Public-health officials in all those states have been offering exactly the same advice New Yorkers have been getting. Wear masks. Stay distant. As much as possible, try to remain inside. \"We have 22 states where the virus is increasing,\" Gov. Cuomo said on Monday, warning that he will do whatever's necessary to keep the New York case count down. \"It's a dramatic national turnaround. We don't want the same plight of these other states.\" Cuomo has some tools to work with here, as does New York City Mayor Bill de Blasio. The governor can direct the New York State Liquor Authority to suspend or revoke liquor licenses, a death sentence for any bar. De Blasio can have the police crack down on public drinking and other risky gatherings. On Monday, Cuomo doubled-down on a threat he's been making in recent days, to delay any further reopening in offending parts of the state. In the battle between New York caution and New York liberty, it's still an open question which side will prevail. But this much is becoming clearer by the hour: Papa Andrew is stirring in Albany. And if he has to \"come down there,\" kids, you'd better watch out! Ellis Henican is an author based in New York City and a former newspaper columnist."}]}