{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-testing-in-the-us-is-dropping-even-as-deaths-mount-2020-08-05", "published": 1596641720.0, "headline": "Coronavirus testing in the U.S. is dropping, even as deaths mount", "body": "U.S. testing for the coronavirus is dropping even as infections remain high and the death toll rises by more than 1,000 a day, a worrisome trend that officials attribute largely to Americans getting discouraged over having to wait hours to get a test and days or weeks to find out the results. An Associated Press analysis found that the number of tests per day slid 3.6% over the past two weeks to 750,000, with the count falling in 22 states. That includes places like Alabama, Mississippi, Missouri and Iowa where the percentage of positive tests is high and continuing to climb, an indicator that the virus is still spreading uncontrolled. Amid the crisis, some health officials are calling for the introduction of a different type of test that would yield results in a matter of minutes and would be cheap and simple enough for millions of Americans to test themselves — but would also be less accurate. “There’s a sense of desperation that we need to do something else,” said Dr. Ashish Jha, director of Harvard’s Global Health Institute. Widespread testing is considered essential to containing the outbreak as the U.S. approaches a mammoth 5 million confirmed infections and more than 157,000 deaths out of over 700,000 worldwide. Testing demand is expected to surge again this fall, when schools reopen and flu season hits, most likely outstripping supplies and leading to new delays and bottlenecks. Some of the decline in testing over the past few weeks was expected after backlogged commercial labs urged doctors to concentrate on their highest-risk patients. But some health and government officials are seeing growing public frustration and waning demand. In Iowa, state officials are reporting less interest in testing, despite ample supplies. The state’s daily testing rate peaked in mid-July but has declined 40% in the last two weeks. “We have the capacity. Iowans just need to test,” Gov. Kim Reynolds said last week. Jessica Moore of rural Newberry, South Carolina, said that after a private lab lost her COVID-19 test results in mid-July, she had to get re-tested at a pop-up site organized by the state. Moore and her husband arrived early on a Saturday morning at the site, a community center, where they waited for two hours for her test. Moore watched in the rear-view mirror as people drove up, saw the long line of cars, and then turned around and left. “If people have something to do on a Saturday and they want to get tested, they’re not going to wait for two hours in the South Carolina heat for a test, especially if they’re not symptomatic,” Moore said. Before traveling from Florida to Delaware last month, Laura DuBose Schumacher signed up to go to a drive-up testing site in Orlando with her husband. They were given a one-hour window in which to arrive. They got there at the start of the window, but after 50 minutes it looked as if the wait would be another hour. Others who had gone through the line told them that they wouldn’t get their results until five days later, a Monday, at the earliest. They were planning to travel the next day, so they gave up. “Monday would have been pointless, so we left the line,” Schumacher said. The number of confirmed infections in the U.S. has topped 4.7 million, with new cases running at nearly 60,000 a day on average, down from more than 70,000 in the second half of July. U.S. testing is built primarily on highly sensitive molecular tests that detect the genetic code of the coronavirus. Although the test is considered the gold standard for accuracy, experts increasingly say the country’s overburdened lab system is incapable of keeping pace with the outbreak and producing results within two or three days, the time frame crucial to isolating patients and containing the virus. “They’re doing as good a job as they possibly can do, but the current system will not allow them to keep up with the demand,” said Mara Aspinall of Arizona State University’s College of Health Solutions. Testing delays have led researchers at Harvard and elsewhere to propose a new approach using so-called antigen tests — rapid technology already used to screen for flu, strep throat and other common infections. Instead of detecting the virus itself, such tests look for viral proteins, or antigens, which are generally considered a less accurate measure of infection. A number of companies are studying COVID-19 antigen tests in which you spit on a specially coated strip of paper, and if you are infected, it changes color. Experts say the speed and widespread availability of such tests would more than make up for their lower precision. While no such tests for the coronavirus are on the U.S. market, experts say the technology is simple and the hurdles are more regulatory than technical. The Harvard researchers say production could quickly be scaled into the millions. A proposal from the Harvard researchers calls for the federal government to distribute $1 saliva-based antigen tests to all Americans so that they can test themselves regularly, perhaps even daily. Even with accuracy as low as 50%, researchers estimate the paper strip tests would uncover five times more COVID-19 cases than the current laboratory-based approach, which federal officials estimate catches just 1 in 10 infections. But the approach faces resistance in Washington, where federal regulators have required at least 80% accuracy for new COVID-19 tests. To date, the Food and Drug Administration has allowed only two COVID-19 antigen tests to enter the market. Those tests require a nasal swab supervised by a health professional and can only be run on specialized machines found at hospitals, doctor’s offices and clinics. Also, because of the risk of false negatives, doctors may need to confirm a negative result with a genetic test when patients have possible symptoms of COVID-19. On Tuesday, the governors of Maryland, Virginia, Louisiana and three other states announced an agreement with the Rockefeller Foundation to purchase more than 3 million of the FDA-cleared antigen tests, underscoring the growing interest in the technology. When asked about introducing cheaper, paper-based tests, the government’s “testing czar,” Adm. Brett Giroir, warned that their accuracy could fall as low as 20% to 30%. “I don’t think that would do a service to the American public of having something that is wrong seven out of 10 times,” Giroir said last week. “I think that could be catastrophic.” ___ Associated Press writers Brian Witte in Annapolis, Md., David Pitt in Des Moines, Iowa, and Mike Schneider in Orlando, Fla., contributed to this story. Liu reported from Columbia, S.C., and Forster from New York."}]}