{"article": [{"url": "https://www.marketwatch.com/story/heres-the-shocking-truth-about-robinhood-investors-vs-wall-street-stock-pros-2020-09-29", "published": 1601398100.0, "headline": "Hereâ\u0080\u0099s the shocking truth about Robinhood investors vs. Wall Street stock pros", "body": "Call it the revenge of the small investor. For months now, small retail investors have been ridiculed by Wall Street professionals for being hyperactive traders â\u0080\u0094 addicted to risk and hopelessly irrational. But just released academic research finds that, as a group, theyâ\u0080\u0099ve outperformed the market. Yes, you read that right. The research, conducted by Ivo Welch, a finance professor at UCLAâ\u0080\u0099s Anderson Graduate School of Management, is entitled Retail Raw: Wisdom of the Robinhood Crowd and the Covid Crisis. The National Bureau of Economic Research recently began circulating it in academic circles. For the study, Welch obtained data reflecting all trades over the three-year period from mid-2018 to August 2020 at Robinhood, the online retail brokerage firm. Though he did not have data on the actual composition of each individualâ\u0080\u0099s portfolio at the firm, Welch was able to see the number of individual accounts that owned each individual stock. (The data was collected, with Robinhoodâ\u0080\u0099s tacit blessing, by the website Robintrack.com.) Armed with this data, Welch constructed a hypothetical portfolio that weighted each stock according to the number of Robinhood accounts that owned it. That is, if stock ABC was owned in twice as many Robinhood accounts as stock XYZ, then this hypothetical portfolio invested twice as much in ABC than in XYZ. Over the three years studied, this hypothetical portfolio beat the market (as represented by benchmarks such as the S&P 500 SPX, +0.87% Â ), both in raw unadjusted terms as well as after risk adjustment. To put these small retail investorsâ\u0080\u0099 achievement in perspective, consider the data compiled by S&P Dow Jones Indices on the performance of actively-managed mutual funds. For the most recent three-year period (through the end of 2019), 71.9% of domestic equity funds underperformed their benchmarks. You might wonder if the three-year performance of Welchâ\u0080\u0099s hypothetical Robinhood portfolio is not as impressive as it otherwise appears â\u0080\u0094 a one-time fluke. To test for that possibility, Welch told me in an interview, he constructed an algorithm that was able to do a decent job replicating the actual composition of his Robinhood portfolio between 2018 and 2020. The algorithm keys off stocksâ\u0080\u0099 trading volume, since Robinhood investors tend to favor stocks with lots of trading volume. In backtesting back to 1980, Welch found that the portfolio constructed by this algorithm held its own against the overall market, and actually came out ahead according to some performance evaluation tests.The wisdom of crowds Itâ\u0080\u0099s hard to square Welchâ\u0080\u0099s results with the narrative that the small retail investors on the Robinhood site are a pure expression of irrational exuberance. That isnâ\u0080\u0099t to say that there arenâ\u0080\u0099t individual examples of such exuberance. For example, Welch found that, at one point in January 2019, stock of Aurora Cannabis ACB, -1.37% Â was held in more Robinhood portfolios than was Apple AAPL, +1.74% Â , even though Apple at the time had a market cap that was more than 100 times larger. Since the beginning of 2019, Appleâ\u0080\u0099s stock has gained more than 190% while Aurora Cannabisâ\u0080\u0099 stock has lost more than 90% (according to FactSet data). Welchâ\u0080\u0099s findings are an illustration that, while not every investor is rational, the collective wisdom of the crowd is often superior. Keep that in mind the next time you hear a Wall Street guru insist that small investors who frequent platforms such as Robinhood donâ\u0080\u0099t know what theyâ\u0080\u0099re talking about. Thereâ\u0080\u0099s a distinct possibility that, as a group, those small investors are doing better than the guru. I note in this regard that Welchâ\u0080\u0099s findings are consistent with those from another study this summer, which used a different methodology to analyze the behavior of investors at the Robinhood site. That author of that earlier study found that â\u0080\u009cRobinhood investors have been buying riskier stocks, but have also been performing slightly better than the market.â\u0080\u009d I note that Robinhood in August stopped making updated data available that would enable the kind of research that was conducted by Welch. A spokesperson for Robinhood explained in an email that the firm did so because â\u0080\u009cthe trend data could be reported by third parties in a way that could be misconstrued or misunderstood.â\u0080\u009d News stories at the time suggested that Robinhood felt that third parties were making it appear that the company was â\u0080\u009cpandering to day traders.â\u0080\u009d Yet Welchâ\u0080\u0099s research suggests that Robinhood investors, as a group, are not the irrational thrill-seeking traders that some of these narratives would have us believe. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com Plus: How to get your stock trades through when Robinhood, Vanguard and other brokerages go down, as they did this week More: How the little guy Is fueling the stock marketâ\u0080\u0099s wild ride"}]}