{"article": [{"url": "https://www.marketwatch.com/story/hurricane-delta-on-course-to-hammer-southeastern-mexico-could-grow-to-a-category-4-on-approach-to-the-u-s-gulf-coast-01601992913", "published": 1601995880.0, "headline": "Hurricane Delta now Category 4 on course to hammer southeastern Mexico, U.S. Gulf Coast", "body": "A dock is closed to the public before Hurricane Delta arrives near Playa del Carmen, Mexico, early Tuesday, Oct. 6, 2020. AP Photo/Tomas Stargardter CANCUN, Mexico (AP) — Delta rapidly intensified into a Category 4 hurricane with 140 mph winds Tuesday on a course to hammer southeastern Mexico and then continue on to the U.S. Gulf Coast this week. The worst of the immediate impact was expected along the resort-studded northeastern tip of Mexico’s Yucatan Peninsula, where hurricane conditions were expected Tuesday night and landfall early Wednesday. From Tulum to Cancun, tourism-dependent communities still soaked by the remnants of Tropical Storm Gamma could bear the brunt of the storm. In Cancun Tuesday, long lines stretched at supermarkets, lumber yards and gas stations as residents scrambled for provisions under mostly sunny skies. Officials warned that residents should have several days of water and food on hand. Boat owners lined up at public ramps to pull their boats out of the water. Mexico began evacuating tourists and residents from coastal areas along its Riviera Maya Tuesday. Quintana Roo Gov. Carlos Joaquin said that buses were already carrying people off Holbox Island and hotels in Cancun and Puerto Morelos were busing their guests inland to government shelters. Some hotels that had exemptions because their structures were rated for major hurricanes were preparing to shelter their guests in place and testing their emergency systems. When the alarm blared at the Fiesta Americana Condesa hotel, Lizeth Elena Garza Hernandez, 35, rushed out of her room carrying in her arms her 10-month-old daughter, Hannah Cienfuegos. She had arrived Sunday from Reynosa, Tamaulipas with her husband, 4-year-old daughter and her parents-in-law. “I’m scared because we don’t know how it could impact here, because we’ve never been in a situation like it,” she said. Joseph Potts, a deputy sheriff from Denver, Colorado, took care of his 3-year-old son near a kiddie pool while his wife attended an emergency information session about the hurricane. The hotel offered to shelter guests at a ballroom inside the hotel, but a short time later after the storm intensified the hotel told them they would all be moved to a university in Cancun. “The hurricane kind of popped up overnight and we just want to get it over with and go back to the beach,” Potts said. Cancun Mayor Mara Lezama Espinosa said that the city had opened more shelters than usual to give people more space in recognition of the COVID-19 pandemic. State Tourism Minister Marisol Vanegas said there were currently 40,900 tourists in all of Quintana Roo. That number is a fraction of what it would normally be due to the COVID-19 pandemic. The area’s economy was devastated by months of pandemic-caused lockdown. At the Moon Palace resort just south of Cancun, hundreds of guests from Moon Palace hotels on Cozumel, Isla Mujeres and beachfront rooms were being moved into a hurricane shelter at the resort’s large exposition center. Bedding, food and entertainment were being provided at the expo center for guests until the hurricane passes, said Cessie Cerrato, the public relations manager for Palace Resorts. “It’s massive,” Cerrato said of the convention hall. “It’s super safe and further away from the water.” Given the coronavirus pandemic, the hall will allow safe distancing, and face masks will be required for guests. The state ordered all non-essential businesses to close by 1 p.m. and banned the sale of alcohol. Hurricane-strength winds were expected by Tuesday evening and landfall to occur near Puerto Morelos just south of Cancun between 1 a.m. and 2 a.m. Wednesday. Just south of Puerto Morelos in Playa del Carmen, tourist Zena Koudsi of Charlotte, North Carolina was taking a final walk along the beach before Delta hit. “Never been to a hurricane area,” Koudsi said. “Never been to Mexico. I was expecting maybe more sun, less waves, but, you know, we’re trying to make the best of it.” Mexican President Andrés Manuel López Obrador said Tuesday that 5,000 federal troops and emergency personnel were being made available in Quintana Roo to aid in storm efforts. The state’s airports remained open Tuesday morning, but beaches were closed. “I honestly don’t see much that will stop it until it reaches Yucatan, due to low vertical wind shear, high deep-layer moisture, and the very warm and deep waters of the northwestern Caribbean,” National Hurricane Center forecaster Eric Blake said. Cuba’s westernmost province and the Cayman Islands were under tropical storm warnings on Tuesday as Delta shifted west. It’s expected to arrive with an extremely dangerous storm surge raising water levels by as much as 7 to 11 feet in the Yucatan, accompanied by large and dangerous waves, and flash flooding inland. Delta’s center Tuesday was about 260 miles east-southeast of Cozumel, Mexico, moving west-northwest at 16 mph. Once it moves on from Mexico, it’s expected to regain Category 4 status over the Gulf as it approaches the U.S. coast, where landfall around Friday would be followed by heavy rainfall across the southeastern United States. “While there is large uncertainty in the track and intensity forecasts, there is a significant risk of dangerous storm surge, wind, and rainfall hazards along the coast from Louisiana to the western Florida Panhandle beginning Thursday night or Friday. Residents in these areas should ensure they have their hurricane plan in place and monitor updates to the forecast of Delta,” the Hurricane Center said. Alabama Gov. Kay Ivey on Tuesday signed a state of emergency that she said would let officials seek federal aid more quickly if needed later. Beach communities on the Alabama coast are still clearing away the damage from Hurricane Sally, which made landfall at Gulf Shores on Sept. 16, as they warn people to be ready for Hurricane Delta. Back in Cancun, Mexican tourists Stephanie Vazquez, 30, and her husband Fernando Castillo, 38, took one last dip in the pool at the Fiesta Americana hotel in Cancún Tuesday with their 2-year-old Leonardo Castillo Vazquez. Vazquez said she was feeling “nervous, worried,” about Delta, “because it is the first time I’ve come here with my son.” “I feel there is a certain safety that the hotel has provided up to now, I know that we will be well protected, but you never can be 100% sure, because it is nature, and you don’t know what will happen,” she said."}]}