{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-and-dow-futures-climb-as-optimism-returns-to-financial-markets-11602143033", "published": 1602136700.0, "headline": "European stocks and Dow futures climb as optimism returns to financial markets", "body": "Democratic vice-presidential nominee Sen. Kamala Harris (L) and U.S. Vice President Mike Pence participate in the vice-presidential debate at the University of Utah on October 7, 2020 in Salt Lake City, Utah. Pool/Getty Images European stocks rose on Thursday, as optimism returned to financial markets on signs there might be some stimulus after all for the world’s largest economy. The Stoxx Europe 600 SXXP, +0.55% rose 0.5%, with gainers including Swiss drugmaker Novartis NOVN, +0.77%, and German chemicals company BASF BAS, -3.77%. The German DAX DAX, +0.06% rose 0.4%, the French CAC 40 PX1, +0.71% gained 0.3%, and the U.K. FTSE 100 UKX, +0.64% edged up 0.1%. U.S. stocks closed higher on Wednesday, with the Dow industrials DJIA, +0.56% up 530 points, after both President Donald Trump and House Speaker Nancy Pelosi indicated support for smaller relief bills, even after Trump the previous day pulled the plug on talks over a larger stimulus plan. U.S. stock futures ES00, +1.13% pointed to further gains on Thursday. “With coronavirus cases that keep rising at a fast pace, and the U.S. elections getting closer, we are reluctant to call for a long-lasting recovery. For now, hopes for partial, stand-alone, stimulative bills in the U.S. may keep investor morale supported for a while more,” said Charalambos Pissouros, senior market analyst at JFD Group. The debate between Vice President Mike Pence and Democratic vice-presidential nominee Kamala Harris on Wednesday night was a more traditional clash than the first presidential debate, and widely perceived as not having changed the dynamic of the election, in which former Vice President Joe Biden has a commanding lead in polls. Of stocks on the move, GVC Holdings GVC, +3.85% rose 3% after the sports-betting company lifted its profit guidance, helped by a better-than-forecast performance from its BetMGM joint venture with MGM Resorts MGM, -2.59%. GVC reported a net gaming revenue rise of 12% in the third quarter. Rival Flutter Entertainment FLTR, +2.03% rose 2%. Shares in TalkTalk TALK, +1.53% jumped 16% to 97 pence, after saying Toscafund Asset Management has made a nonbinding offer of 97 pence per share to buy the U.K. telecommunications firm. The proposal contains a number of preconditions, including that TalkTalk’s top shareholder, executive chairman Charles Dunstone, support it. Hargreaves Lansdown HL, +1.68% slipped 5% after the asset manager reported flat net new business in the September-ending quarter."}]}