{"article": [{"url": "https://www.marketwatch.com/story/the-media-landscape-is-far-more-friendly-to-trump-than-he-likes-to-admit-2020-06-10", "published": 1591866800.0, "headline": "The media landscape is far more friendly to Trump than he likes to admit", "body": "President Donald Trump loves to talk about the “failing New York Times” and predicts it’ll soon be out of business. Guess what: You’re laughing all the way to the bank if you own the stock NYT, -3.79%. If you’d bought it the day Trump was elected in 2016, you’d be up 244% though Friday, including dividends. The S&P 500 SPX, +0.87% ? Up 47% over that span. That’s right: The Times has outperformed the broad market by a factor of five. If that’s “failure,” sign me up. Digital subscriptions for the Times and the other paper Trump is most prone to bash, the Washington Post — owned by Amazon AMZN, +3.01% founder Jeff Bezos — have surged since 2016, as Americans clamor for the kind of comprehensive, in-your-face coverage that only those two papers — plus the more Trump-friendly Wall Street Journal (which, like MarketWatch, is published by Dow Jones, a division of News Corp NWS, -1.29% ) — seem capable of providing. “ While Trump regularly calls the New York Times and CNN ‘fake news,’ other parts of the U.S. media landscape eagerly swallow whatever Trump is serving up. ” But as these papers’ coverage of Trump — robust, fierce and unrelenting — continues, there’s another angle to the newspaper industry that has been far more beneficial to Trump, first as a candidate and now as a president: namely, that there are hardly any papers left around the country to challenge him. More on this in a second. First, some data: Since 2004, says a study by the University of North Carolina, some 1,800 newspapers — one in every five — has shut down. Citing a report by none other than the federal government, the UNC study says that “local newspapers are the best medium to provide the sort of public-service journalism that shines a light on the major issues confronting communities and gives residents the information they need to solve their problems.” When a local newspaper dies, who’s going to hold politicians accountable? Who will talk to the mayor? Who will cover boring but vital meetings at City Hall? Who will dig through municipal records, report on potholes, the town budget, crime, real estate and other important issues? And who will do a nice write-up on the county fair? So when a local paper dies, creating an information vacuum, a community is the poorer for it. The 1,800 papers gone since 2004? That’s 1,800 tears in the fabric of our republic. Here’s where Trump comes in. When that information vacuum exists (the UNC study calls it a “news desert”), it’s easier for a politician to fill it with the kind of unchallenged demagoguery, distortions and — sorry — outright lies that are the tricks of Trump’s trade. Trump was smart in 2016. He went from town to town, rally to rally, and kept hammering away on the key themes that made his base stick to him like glue. They were victims, he said, of a rapidly evolving economy. Demographic, cultural changes and more were leaving them behind, ignored, disrespected and unwanted. There weren’t many local voices to counter him, to provide the citizenry with any other information. This is one reason Trump hates the Times, the Post and cable outlets like CNN T, -1.01% ; they have the resources to employ armies of reporters and fact checkers to dig into everything, pore over every word he says and tell you what he’s really up to. This infuriates him. Thus these outlets are “fake news,” “corrupt” and the “enemy of the American people.” Translated: “I’m angry that these journalists are checking things out on their own, instead of just accepting whatever I say at face value.” It drives him nuts. Of course, other parts of the U.S. media landscape eagerly swallow whatever Trump is serving up. The nation’s two top radio talkers — Rush Limbaugh and Sean Hannity — are reliable cheerleaders, happy to spread the president’s message to their millions of listeners. There are left-wingers on the radio, too, of course, but none comes close to the vast audiences that Limbaugh, Hannity and other right-wing personalities command each day. Trump also has a powerful ally — perhaps one you’ve never heard of, dependent on where you live — in Sinclair Broadcast Group SBGI, -2.01%, which owns 191 TV stations on 607 channels in 89 markets nationwide, including concentrations of stations in key swing states that will be pivotal in November, as they were four years ago: Ohio, Michigan, Pennsylvania, Wisconsin and Florida, among others. You might think that the void left by the demise of so many local newspapers might be filled by robust local TV reporting. But you know what Sinclair did? In 2017, it hired one of Trump’s early White House aides, the Russian-born Boris Epshteyn, and for two years required its stations to carry his pro-Trump editorials (the editorials, and thus the requirement to air them, were done away with in December). This right-wing tilt is reflected in campaign contributions by Sinclair and its employees, who have traditionally given far more to Republicans: 61%, 98%, 98% and 97% in the last four presidential election years, respectively. Curiously, however, such donations in 2020 have thus far been evenly split. You’ve never heard Trump call outlets that love him “fake.” Only the ones that try to fact check him, and that now includes Twitter TWTR, -0.23%, which isn’t censoring the president, as he claims; it’s providing other customers with additional information and context. Between hundreds of local newspapers dying off, and his radio and TV allies, including Fox — with which he airs the occasional grievance, including on Wednesday, when he took issue with the channel’s cutting away from a congressional hearing — and the groveling One America News Network, the media is far more favorable to the president than he’d have you believe. Fox News FOX, -1.45% is by far the most dominant cable news channel. Limbaugh and Hannity blow away the radio competition. I haven’t even mentioned Facebook FB, +0.26%, whose CEO, Mark Zuckerberg, has done Trump a yuge favor by saying he doesn’t think social networks should fact check what politicians post. It’s fair to ask: Doesn’t all of this balance out — if not outweigh — the likes of the Times, the Post and MSNBC? Trump’s claim that the media are dominated by lefties who are out to get him — I’m not sure that passes the fact-check test."}]}