{"article": [{"url": "https://www.marketwatch.com/story/wells-fargo-to-cut-dividends-while-bofa-citi-jpmorgan-goldman-seen-holding-shareholder-payouts-steady-after-stress-tests-2020-06-29", "published": 1593453020.0, "headline": "Wells Fargo to cut dividends while BofA, Citi, JPMorgan, Goldman seen holding shareholder payouts steady after stress tests", "body": "Wells Fargo on Monday said it is expected to reduce its dividends by an unspecified amount after an annual stress test of the health of the banking sector by the Federal Reserve, representing the only one of the top banks so far to have to cut shareholder distributions after the examination of the financial wherewithal of the nation's largest financial firms. Wells Fargo's dividend currently stands at 51 cents, according to FactSet data. Only Wells Fargo paid cash dividends during the first quarter that exceeded its estimated four-quarter average of net income through the second quarter, according to an analysis of the bank's payouts by MarketWatch's Phil Van Doorn. Almost all of the nearly three dozen financial institutions on Monday said they were maintaining their cash payouts, including Citigroup C, +0.47%, JPMorgan Chase & Co. JPM, -0.57%, Goldman Sachs Group Inc. GS, -0.21%, Morgan Stanley MS, -0.34% and Bank of America BAC, +0.47%. Last week, the Federal Reserve said a prolonged economic downturn could saddle the nation's banks with up to $700 billion in losses on soured loans and ordered them to cap dividends and suspend share buybacks to conserve funds. The vast majority of the banks agreed to suspend buybacks back in March as the COVID-19 pandemic took root. The Fed last Thursday said it would require banks to reassess their capital needs and resubmit capital plans later this year. The regulator deemed all of the banks to be well-capitalized in the stress tests that has been conducted every year since the 2009 financial crisis to determine the financial industry's resilience against major shocks to the economy. Since the Fed's \"severely adverse scenario\" for the tests was designed in February, before the coronavirus pandemic caused a recession, the regulator also conducted \"sensitivity analyses\" to reflect the harsher economic reality."}]}