{"article": [{"url": "https://www.marketwatch.com/story/tom-brady-again-fails-to-shake-nick-foless-hand-after-a-loss-after-appearing-to-have-lost-track-of-downs-on-final-drive-in-chicago-2020-10-09", "published": 1602240080.0, "headline": "Tom Brady again fails to shake Nick Foles's hand after a loss - having appeared to lose track of downs on final drive in Chicago", "body": "Tom Brady couldn't seem to keep his numbers straight. Brady's Tampa Bay Buccaneers lost 20-19 to the Nick Foles-quarterbacked Bears in Chicago on Thursday night. For the signal callers, it was a rematch of Super Bowl 52, when Foles's Philadelphia Eagles beat Brady's New England Patriots. This year's meeting came with a bizarre ending as Brady appeared to lose track of the downs on the Buccaneers' final offensive play. \"He knew,\" Buccaneers coach Bruce Arians told reporters when asked if Brady was aware it was fourth down. See:Amazon expands its NFL 'Thursday Night Football' programming - will the e-commerce giant buy more NFL rights? After his fourth-down pass to Cameron Brate over the middle was broken up with 38 seconds left, Brady lingered on the field, signaling to a nearby official that he believed Tampa Bay still had a down to play - putting up four fingers. \"Yeah, you're up against the clock and you're up against the - I knew we had to gain a chunk, so I should have been thinking more first down instead of chunk in that situation,\" Brady said when asked about his odd reaction. \"I knew we needed a chunk and I was thinking about more yardage. It was just bad execution. We had a great opportunity there so â\u0080¦ just didn't execute when we needed to.\" After he returned to the Buccaneers' bench, Brady was shown on camera flinging a tablet in disgust after, it appeared, he recognized his mistake. The cameras then caught Brady running off the field when the game was over, leaving a confused Foles looking around as he tried to find the six-time Super Bowl champion to shake hands. Brady also did not shake Foles's hand after the Super Bowl loss. \"I didn't get a chance to say anything to him,\" Foles said during his on-field interview after the game. \"I'm sure sometime we'll catch up, but we're trying to keep our distance.\" Frank Schwab of Yahoo Sports observed that Brady was doing \"what the NFL wants him to do\" in heading for the locker room without postgame handshakes, in accordance with coronavirus guidelines. \"Really, it's no big deal,\" Schwab wrote. \"But it's Brady, so people will take their shots regardless.\" Foles, 31, was 30 for 42 for 243 yards with a touchdown and an interception for his first win as the Bears starter. Cairo Santos kicked a 38-yard field with 1:17 left to give Chicago the lead for good. Few believed the Buccaneers' claims Brady had not forgotten the down. \"He definitely did [lose track of downs],\" Terry Bradshaw said on Fox's postgame show. The 43-year-old Brady went 25-for-41 passing for 253 yards and a touchdown as Tampa Bay fell to 3-2. Chicago moved to 4-1. Read on:Another positive virus test for the NFL's Titans raises total to 23 cases, games now in jeopardy A version of this report previously appeared at NYPost.com."}]}