{"article": [{"url": "https://www.marketwatch.com/story/kamala-harris-on-student-loan-forgiveness-medicare-universal-basic-income-credit-scores-and-a-tax-on-trading-stocks-2020-08-12", "published": 1597609700.0, "headline": "Kamala Harris on student-loan forgiveness, Medicare, universal basic income, credit scores - and a tax on trading stocks", "body": "Now that she's been named as Joe Biden's running mate for the 2020 presidential election, Sen. Kamala Harris' stances on a wide range of issues are being scrutinized once again. Presumptive Democratic presidential nominee Joe Biden announced Tuesday that he has selected Harris, who hails from California, as his vice-presidential pick in the race against President Donald Trump and Vice President Mike Pence. The selection of Harris, 55, is historic. She is the first Black woman and the first person of Asian descent ever named to a presidential ticket by a major political party. She's only the third woman to be tapped as a vice-presidential nominee by the Democratic or Republican parties, following in the steps of Geraldine Ferraro and Sarah Palin. Also see:Joe Biden picks Kamala Harris for VP: Here's how Trump and other politicians are reacting Harris herself staged a short-lived but notable campaign for the Democratic nomination. She attracted much attention after criticizing Biden for his record on race during the first Democratic debates, but she ended her campaign in December before the first primaries were held. During her campaign, Harris put forth a wide range of proposals regarding her vision for the country. Here's what her stance has been on issues ranging from universal basic income to Medicare For All:Student-loan debt and higher education During her short-lived presidential campaign, Harris joined her competitors Bernie Sanders and Elizabeth Warren in releasing a plan aiming to address the $1.5 trillion student-debt problem. The proposal was part of her broader plan to close the black-white gap with regard to jobs in high-paying fields like technology and engineering and entrepreneurship. Under the Harris proposal, borrowers who received a Pell Grant, the money the government provides to low-income students to attend college, will have up to $20,000 of their student debt forgiven if they start a business and operate it for at least three years in a disadvantaged community. In addition, qualifying borrowers would have their loans deferred interest-free for an up to three-year business formation period. The plan faced swift backlash on Twitter TWTR, -0.23%, where people argued that accessing forgiveness would be an onerous task. Harris even acknowledged the reaction tweeting, \"I want to thank everyone for your feedback and clarify some confusion.\" Harris also proposed making community college free and four-year public colleges debt-free. She said that she would allow borrowers to refinance their loans at lower interest rates and expand the income-driven repayment program, which allows borrowers to repay their loans as a percentage of their income. For-profit colleges have had a formidable adversary in Harris. She has said that the U.S. should get rid of them, and as California attorney general her office was a $1 billion-plus judgment against the now-defunct Corinthian Colleges after uncovering fraud at the college chain.Affordable housing Last July, Harris' presidential campaign released an extensive plan aimed at increasing the homeownership rate in black communities. The plan called for earmarking $100 billion for federal grants that would help with down payments or closing costs for families who rent or live in historically redlined communities Harris also called for the strengthening of anti-discrimination laws to prevent discrimination in home sales, rentals and mortgage lending. Harris' legislative record also points to her stance with regard to the high cost of housing nationwide. Together with Rep. Maxine Waters, a Democrat from California, she authored the Housing Is Infrastructure Act. The bill would set aside $100 billion for affordable housing - the bulk of which ($70 billion) would be used to pay for needed repairs and upgrades to the nation's stock of federally subsidized housing, including flood mitigation projects. “ Harris introduced the Rent Relief Act, which would create a refundable tax credit for households who make less than $100,000 a year. ” Harris also introduced the Rent Relief Act, which would create a refundable tax credit for households who make less than $100,000 a year (or $125,000 in pricier areas) and spend at least 30% of their income on housing costs. Harris faced criticism over her handling of foreclosure-related issues during her time as California attorney general. Some have argued that she should have sued OneWest Bank, which was at the time run by now-Treasury Secretary Steve Mnuchin, for foreclosing against thousands of homeowners in California. Harris told the San Francisco Chronicle her office didn't have the legal ability to do this \"because of the way the rules were written in favor of the banks in terms of our subpoena powers as the state attorney general.\"Medicare For All (or more people) Last July, Harris released a plan to provide \"comprehensive health insurance that covers every American.\" The way she planned to achieve that? By expanding Medicare. Unlike Bernie Sanders, though, Harris did not envision achieving this goal by taxing families making under $100,000. Instead, she planned to pay for \"Medicare For All\" by taxing Wall Street. Her plan called for a 0.2% tax on stock trades, a 0.1% tax on bond trades and a 0.002% tax on derivative transactions. She claimed these taxes would raise more than $2 trillion over the course of a decade. Critics of the plan argued that taxing financial transactions in this way could make it harder for Americans to build retirement savings.Credit scores As part of her broader plan to improve the black homeownership rate, Harris proposed an amendment to the Fair Credit Reporting Act. The amendment would require credit-reporting agencies to include payments of rent, cellphone bills and utilities when calculating credit scores. The proposal was meant to expand the realm of people who can get credit scores. Data from the Consumer Financial Protection Bureau suggest that an estimated 26 million people are \"credit invisible\" and another 19 million are said to have \"unscorable\" files. When the proposal was released, FICO FICO, +0.70%  noted that credit scores have always been designed to consider telecommunications and utilities payments since they were first released in 1989. The issue, according to Joanne Gaskin, vice president of scores and analytics at FICO, is one of data collection. FICO relies on consumer data pulled by the major credit reporting agencies - Experian EXPN, +1.09%, Equifax EFX, +1.53%  and TransUnion TRU, +0.76%. Until now, the agencies have struggled to collect \"alternative\" data for most consumers, Gaskin told MarketWatch last year. Universal basic income Entrepreneur Andrew Yang made a universal basic income policy his cause celebre on the campaign trail during the race for the Democratic nomination. Harris didn't necessarily propose her own version of universal basic income, but she did put forth the LIFT the Middle Class Act. The legislation would give large refundable tax credits of up to $500 a month or $6,000 a year to families earning less than $100,000 annually. Single filers who earn below $50,000 annually could get up to $3,000 a year. Andrea Riquier contributed to this story."}]}