{"article": [{"url": "https://www.marketwatch.com/story/can-the-fed-tame-an-avalanche-of-corporate-distress-bond-investors-are-betting-on-it-2020-07-24", "published": 1595851280.0, "headline": "Can the Fed tame an avalanche of corporate distress? Bond investors are betting on it", "body": "The Federal Reserve has proven it knows how to keep credit flowing during a crisis. Look at the record debt already issued this year by highly rated and speculative-grade U.S. corporations during the pandemic. But bond investors now also expect the Fed’s unprecedented stimulus sloshing around financial markets to turn the tide on the credit cycle, namely by preventing more companies from going belly up than was expected only a few months ago. “It’s a key axiom that businesses don’t default because they are losing money,” said Steven Oh, global head of credit and fixed-income leverage at PineBridge Investments in Los Angeles, in an interview with MarketWatch. “Businesses default because their access to liquidity dries up.” Hertz Global Holding Inc. HTZ, -1.78% J.C. Penney Co. Inc. JCP, -2.53% and Frontier Communications Corp. FTRCQ, -2.59% are among the deluge of U.S. companies that already defaulted on a combined $52.6 billion of high-yield debt this year, according to B. of A. Global. To help keep credit from freezing during the earliest rounds of shutdowns imposed on cities and businesses during the pandemic, the Federal Reserve, for the first time in history, started buying U.S. corporate debt, initially in May via exchange-traded funds and a month later through the outright purchase of individual bonds. The Fed promised not to run “like an elephant” through the corporate bond market, and its latest tally shows it holds about $44 billion out of $750 billion in funding earmarked for the sector. Even so, the knock-on effects of its stimulus efforts have been dramatic. The rebound has flowed through both equity and debt markets, despite new and alarming rates of coronavirus infections in parts of the U.S. including California, Florida and Texas. U.S. stock indexes were clinging to gains on Monday as investors awaited progress in Washington from policy makers wrangling over the next pandemic stimulus package, but the S&P 500 index SPX, +0.87% still traded 0.1% away from recouping all its losses on the year to date, while the Dow Jones Industrial Average DJIA, +0.56% was about 7% from a similar recovery. The iShares iBoxx $ Investment Grade Corporate Bond ETF LQD, +0.23% the biggest of its kind, traded off less than 0.1% Monday, but up 7.9% on the year to date. The rest of the debt markets have rallied too, underscored by dwindling credit spreads, or the level of compensation investors get paid on a bond, above a risk-free benchmark like Treasurys TMUBMUSD10Y, 0.777%. What’s more, this week high-yield bond spreads touched a fresh post-COVID low of 528 basis points over U.S. Treasurys, according to B. of A. Global data, despite the year’s flood of $228 billion of new issuance. Similarly, investment-grade spreads dipped this week to an all-time low of 243 basis points over the same benchmark, per JPMorgan data, even with record $1.3 trillion issuance. That means investors are getting paid far less to buy corporate bonds than they were only a few months ago, even though U.S. businesses have been borrowing at a record clip and while the pace of the U.S. economic recovery from the pandemic remains uncertain. Meanwhile, the central bank’s balance sheet now sits just under $7 trillion from about $4.2 trillion in March, mainly due to its unlimited bond buying program of U.S. government-backed debt during the pandemic. “The point being, the Fed backstopped risk appetite,” said Jack Janasiewicz, portfolio manager at Natixis Advisors, in a webinar Thursday, where he estimated that only about 10% of the Fed’s total capacity has been tapped so far. “Money came right back into the credit markets. Mission accomplished by the Fed,” he said. Read: Why the Fed owes a debt to Tom Sawyer Importantly, the potion of high-yield bonds now trading at distressed levels also has shrunk to about 18% from 41% during the worst of the pandemic selloff in March, according to JPMorgan data. Conventionally, high-yield, or “junk” bonds are considered distressed, and more likely to default, once they trade at spreads of more than 1,000 basis points over a risk-free benchmark, such as U.S. Treasurys. Furthermore, analysts at B. of A. Global looking at a set of credit stress indicators for high-yield now see about half implying the peak default phase of this cycle already might be over. “The body of evidence is growing that this cycle may be unique not only in a way it started but also in a way it ended,” the team led by Oleg Melentyev wrote in a client note Friday. Credit-rating firm Moody’s Investors Service also this week said it expects the current 7.3% default rate for U.S. speculative-grade companies to reach 10.5% over the next year, which is below the 13% forecast from Goldman Sachs for this year. “Whether you think it’s the right thing or the wrong thing, the technical conditions spearheaded by the Fed—not just due to direct buying of corporate debt, but also its liquidity support to Treasury markets and other markets overall—it is going to result in investor demand shifting toward riskier asset classes,” Oh said. “We will see reasonably high default rates for this year,” he added. “But our expectations for defaults from two months ago are substantially lower today.”"}]}