{"article": [{"url": "https://www.marketwatch.com/story/nasdaq-composites-record-rally-takes-it-toward-fastest-1000-point-milestone-in-20-years-2020-08-03", "published": 1596733040.0, "headline": "Nasdaq Compositeâ\u0080\u0099s record rally takes it to fastest 1,000-point milestone in 20 years", "body": "The Nasdaq Composite Index on Thursday marked its fastest 1,000-point rally to a new round-number milestone in 20 years. It has been 40 trading days since the Nasdaq Composite COMP, +1.39% registered its most recent 1,000-point move on June 10 and with its close above11,000 representing the quickest such ascent since the 38-day sessions it took to climb from 3,000 to 4,000 achieved in 1999 (see attached table) To be sure, that period of powerful gains for the Nasdaq came during the dot-com boom and bust 20 years ago, where valuations of tech-centric companies were arguably more divorced from their earnings than they are now. And point moves become less impressive as the index rises. A rise from 10,000 to 11,000 marks a 10% rise, while the 1999 move from 3,000 to 4,000 was a rise of 33%. â\u0080\u009cAlthough 11,000 by itself doesnâ\u0080\u0099t mean much, these big round numbers are a nice reminder of just how strong this rally has been since the March lows,â\u0080\u009d Ryan Detrick, chief investment strategist at LPL Financial, wrote via email. Some investors have expressed concern that the Nasdaq, led by the giants of the tech sector, have is now well ahead of rational ways of measuring its value, including price to earnings, or P/Es. The Nasdaq Composite has soared more than 60% since hitting a March 23 low, while the S&P 500 index SPX, +0.87% has climbed 50% and the Dow Jones Industrial Average DJIA, +0.56%, which has a lower concentration of tech-related companies, has climbed over 47% over the same period. The Nasdaq on Thursday was trading in record territory, powered by megacap companies, including Microsoft Corp. MSFT, +2.48% and Tesla Inc. TSLA, +1.89% as well as notable so-called FAANG names, Facebook Inc., Apple Inc. AAPL, +1.74%, Amazon.com Inc. AMZN, +3.01%, Netflix Inc. NFLX, +1.43%, and Google parent Alphabet Inc. GOOG, +1.97% GOOGL, +1.82%. Those handful of companies have been considered by investors more resilient to the uncertain outlook created by the COVID-19 pandemic that has driven the U.S. economy into a recession. â\u0080\u009cYes, technology is probably extended in the near-term, but when you look at how strong earnings and guidance have been from the group, you realize thereâ\u0080\u0099s a reason the Nasdaq is at 11,000 and why eventual continued strength is quite likely,â\u0080\u009d Detrick said."}]}