{"article": [{"url": "https://www.marketwatch.com/story/im-63-my-husband-is-70-well-have-90000-a-year-in-retirement-how-can-we-claim-our-social-security-benefits-2020-10-09", "published": 1602243680.0, "headline": "Iâ\u0080\u0099m 63, my husband is 70, weâ\u0080\u0099ll have $90,000 a year in retirement â\u0080\u0094 how can we claim our Social Security benefits?", "body": "Dear MarketWatch, My husband is 70 and I am 63. We both want to retire as soon as our son finishes college, if not before. He is currently a sophomore. We will have approximately $90,000 per year to live on (not including expenses for health insurance supplemental plans). Right now, weâ\u0080\u0099re in excellent health and have been working to pay off debt and our sonâ\u0080\u0099s education, which we pay as we go. I have even thought about taking the Social Security survivorâ\u0080\u0099s benefit and working part time until Iâ\u0080\u0099m 67. Is that a good option? Also, whereâ\u0080\u0099s the best place to retire to live comfortably and to afford to travel? Thank you! L.B. See:Iâ\u0080\u0099m 60, my spouse is 45 â\u0080\u0094 can I retire if our expenses are $12,000 a month? Dear L.B., Congratulations on your near retirement! It will certainly be something to celebrate, and that youâ\u0080\u0099ve already figured out what your retirement income will be is a great start. I want to focus my answer to your question around the Social Security component. Social Security is such a major factor in Americansâ\u0080\u0099 retirement plans, but it can be challenging to know how exactly it works and when is the right time to claim benefits. For example, in your question, you mentioned the survivor benefit, but thatâ\u0080\u0099s not available to everyone. It may have been a typo, where you meant to say spousal, or it may be that you do qualify. Americans qualify for survivor benefits in a few scenarios, including if they are a widow or widower age 60 or older; a divorced spouse from a marriage that lasted 10 years and who did not remarry before age 60; or a widow or widower at any age caring for the deceasedâ\u0080\u0099s child under age 16. Either way, I just want to clarify that there are various forms of benefits associated with Social Security â\u0080\u0094 including survivor and spousal â\u0080\u0094 and by knowing the difference and which are applicable to your situation, you can find strategies that maximize what you receive. Spousal benefits can be very confusing, said Kate Gregory, a financial planner and president of Gregory Advisors Inc. As a spouse, youâ\u0080\u0099re entitled to 50% of your husbandâ\u0080\u0099s primary insurance benefit that heâ\u0080\u0099d receive at his Full Retirement Age (FRA, which in his case is 66 years old), but he has to have filed for his benefits before you can do so. Heâ\u0080\u0099s 70, which means he probably already has, since thatâ\u0080\u0099s the latest a person can claim retirement benefits â\u0080\u0094 and weâ\u0080\u0099ll get to that in a moment. Now hereâ\u0080\u0099s where it gets tricky: if your own retirement benefit is higher than 50% of your husbandâ\u0080\u0099s, youâ\u0080\u0099ll get your own benefit â\u0080\u0094 not the spousal benefit. You donâ\u0080\u0099t get both. Youâ\u0080\u0099ll have to file for retirement benefits and then the Social Security Administration will calculate the benefit for you, analyzing your own versus half of your husbandâ\u0080\u0099s. Youâ\u0080\u0099ll either get the equivalent of his half or, if yours is more, your own. Hereâ\u0080\u0099s an example, provided by Diane Wilson, founding partner of My Social Security Analyst. If his benefit at Full Retirement Age is $2,000 and your FRA benefit is $800, youâ\u0080\u0099d get half of his ($1,000). Youâ\u0080\u0099d technically receive a spousal benefit of $200, so that youâ\u0080\u0099re getting your benefit plus an additional amount of money to bring you to half of his. â\u0080\u009cThe rules are complicated and not easy to understand,â\u0080\u009d she said. But wait, there are more rules! If you claim Social Security earlier than your Full Retirement Age (in your case, 66 and a few months), you will get less than your full retirement benefit â\u0080\u0094 this applies even with the spousal benefit, Gregory said. And if you take the spousal benefit at your FRA and your husband took his benefit after his FRA, which would increase his benefits, youâ\u0080\u0099ll still only get 50% of what heâ\u0080\u0099d get at 66, not whatever heâ\u0080\u0099s getting every month now. A beneficiary gets roughly 8% more in her retirement benefit checks for each year she delays claiming Social Security after her FRA, but that figure would not be factored into a spousal benefit. Comparatively, for each year before FRA, the benefit is reduced. There are caveats, of course, such as if you havenâ\u0080\u0099t earned enough credits to qualify for the Social Security retirement benefit, in which case, youâ\u0080\u0099d only qualify for the spousal. People born before 1954 have the option to file for their spousal benefits and then switch to their own benefit later to take advantage of the 8% delayed credit, but that wouldnâ\u0080\u0099t apply to you â\u0080\u0094 that could apply to your husband, though. Also see: You can still claim Social Security spousal benefits â\u0080\u0094 even if your spouse is gone And even after making these decisions, double check that your benefits are correct, said Avani Ramnani, director of wealth management and financial planning at Francis Financial. She once had new clients where the wife was receiving only 30% of her husbandâ\u0080\u0099s benefit, because she was a few years older than him and had elected her benefit before he had elected his. You mentioned claiming benefits and working part time. Thatâ\u0080\u0099s definitely doable, but be aware you may be subjected to the earnings test, said Mike Miller, managing director of Integra Shield Financial Group. For every $2 you earn over $18,2450 in 2020, your benefit is reduced by $1. The earnings test is inflation-adjusted every year, and applies for the years before the one in which you reach your FRA. Your benefit will also be adjusted to account for those â\u0080\u009clostâ\u0080\u009d benefits at full retirement age. â\u0080\u009cDoes it make sense to work part-time and collect Social Security early? I would say no unless you need the income due to all the potential reductions in benefits,â\u0080\u009d Gregory said. â\u0080\u009cIf you arenâ\u0080\u0099t going to work, it makes more sense to collect while her husband is alive, especially if her own benefit is less than her spousal.â\u0080\u009d You also asked about where the best place is to retire and honestly, that depends on a variety of personal factors, including proximity to family and health facilities, taxes, cost of living, weather and entertainment. MarketWatch created a tool that helps readers pick desired qualities in a dream retirement spot â\u0080\u0094 maybe it will help you too! Also check out our Where Should I Retire? column that helps people answer this question. Have a question about your own retirement savings? Email us at HelpMeRetire@marketwatch.com"}]}