{"article": [{"url": "https://www.marketwatch.com/story/another-cruel-irony-of-new-yorks-post-covid-comeback-2020-07-24", "published": 1595603000.0, "headline": "Another cruel irony of New York's post-COVID comeback", "body": "Nothing says New York quite like a crowded subway. Now be careful what you wish for. They are finally coming back. Crowded, of course, is a relative concept. In the pre-COVID-19 days, rush-hour subway cars could be ranked according to a four-tier hierarchy: Crowded. Violating-My-Personal-Space Crowded. Actually-Causing-Me-Physical-Pain Crowded. And: I-Don't-Think-I-Can-Squeeze-onto-This-Train-But-I-Really-Need-to-Get-to-Work-So-I'm-Gonna-Try Crowded. And there was one bonus category that all New Yorkers got to know. The car was inexplicably empty. Then, the doors popped open and a horrible stench wafted out. Suddenly, riders who'd thought they'd hit the jackpot were frantically scrambling onto another car. None of that is back yet. But one-third to one-half of the seats were taken on an uptown No. 2 train pulling into 14th Street in Manhattan on Friday morning, which is a whole lot more than you could have said a month ago. A few stragglers were even standing by the doors. But those are not the measures that matter most to New York subway riders. Their calculations are always more personal. \"I have one question when I get on the train,\" said Karen Kramer, a graphic artist who lives in Crown Heights, Brooklyn. \"Will someone I don't know be in the seat next to me?\" It's the exact same question that air-travel passengers are asking their airlines. No, say Delta DAL, +0.39%  and JetBlue. JBLU, -0.07%  Maybe, say American AAL, +0.34%  and United. UAL, +0.32%  Kramer was doing what she could for safety, keeping her arms folded, not touching anything and covering her face with a black-cloth mask. Mask wearing isn't at 100% in the subway these days, but it's awfully close. And the cars are still looking spiffy from the overnight shutdowns and the extra attention of New York City Transit's cleaning crews. In Kramer's car, number 7119, no one appeared to be homeless, and only one panhandler - holding a paper coffee cup, saying nothing - had come through on her 25-minute ride from President Street, she said. All these developments are signs that, as the U.S. logs its 4 millionth coronavirus infection and other states are spiking to record highs, New York is ever so gradually coming back to life. Also see: New York sees increase in virus infections among 20-somethings \"Funny thing is,\" Kramer said, \"the fear that's kept people off the subway is also what's made the subway nice. Since all this started, it's been like having your own private subway car.\" Please don't get used to it. It's not economically viable, as state, local and transit officials keep reminding everyone. No transit system the size of New York's can operate for long without millions and millions of daily riders. Since COVID-19 came around, the $17 billion Metropolitan Transportation Authority budget has lost so much in fares, tolls, subsidies, real estate taxes and other revenues, no one has any idea how such a deep budget hole will ever be filled. But a revived economy means a revived transit system, and that's at least a start. How else are all those Midtown and Downtown office buildings supposed to get filled? According to Mayor Bill de Blasio, subway ridership is up 75% from the COVID low. Bus ridership is up 57%. Traffic is up 23% on the East River bridges and 17% on the Harlem River bridges. Those numbers do sound promising, though in some cases the city's stay-at-home policies had cut human movement as much as 90%. \"For the first time in a while,\" the mayor noted, \"we see subway ridership passing bus ridership over all. Which means more and more people are feeling confident they can go into the subway and feel safe.\" And the case count seems to be saying, Press ahead. \"I'm proud to say that our rates of new cases of the coronavirus through all our phases of reopening have not had an uptick whatsoever,\" Dr. Ted Long, who heads the city's Test and Trace Corps, said in a Manhattan briefing on Thursday. \"They've been completely stable.\" And don't forget the city buses. In some ways, they tell the yay-boo story even more clearly than the subways do. The bottom line: More riders, slower trips. In April, daily bus ridership hit a low of 430,000. In the past couple of weeks, it's been in the 1.2-million range. Those numbers are still half of the pre-pandemic peaks. But they're another indication of a city reawakening. Just don't expect to get there comfortably or fast. Also read: New York culture creaks back to life, COVID-style Craig Cipriano, the acting senior vice president of NYC Transit's Department of Buses, was crowing to the MTA's Transit and Bus Committee about rising ridership. But even he quickly added: \"Our buses continue to navigate through multiple new obstacles to the normal flow of traffic.\" Congratulations, New York. You're coming back to life again. Please enjoy the returning discomfort and delays. Ellis Henican is an author based in New York City and a former newspaper columnist."}]}