{"article": [{"url": "https://www.marketwatch.com/story/zuckerberg-on-facebook-ad-boycott-all-these-advertisers-will-be-back-soon-enough-2020-07-01", "published": 1593855020.0, "headline": "Zuckerberg said to say of Facebook ad boycott: â\u0080\u0098All these advertisers will be backâ\u0080\u0099 soon enough", "body": "Hundreds of companies around the world have joined a temporary ad boycott against Facebook Inc., but Chief Executive Mark Zuckerberg says heâ\u0080\u0099s not worried and has no intention of changing its policies, according to a new report. “ â\u0080\u009cMy guess is that all these advertisers will be back on the platform soon enough.â\u0080\u009d ” â\u0080\u0094 Mark Zuckerberg Zuckerberg said the boycott is more of a PR issue than one that will hurt the social-media giantâ\u0080\u0099s bottom line, according to a report Wednesday by The Information, which cited a transcript of remarks Zuckerberg gave at an employees-only virtual town hall Friday. â\u0080\u009cWeâ\u0080\u0099re not gonna change our policies or approach on anything because of a threat to a small percent of our revenue, or to any percent of our revenue,â\u0080\u009d he said, according to The Information. While generating headlines, the boycott involves only a tiny fraction of Facebookâ\u0080\u0099s roughly 8 million advertisers. The company generates almost all of its revenue from ads. Read: Here are the major brands that have pulled ads from Facebook The #StopHateForProfit campaign was started by civil rights groups last month, calling for major companies to stop their Facebook ad spending for July to protest the companyâ\u0080\u0099s inability to rein in hate speech, threats of violence and misinformation on its platform. A portion of Fridayâ\u0080\u0099s virtual town hall was streamed to the public from Zuckerbergâ\u0080\u0099s Facebook page, where he announced some policy changes to crack down on hateful content and voting misinformation. But he was reportedly more blunt in private remarks to employees, saying Facebook would not cave to pressure. â\u0080\u009cYou know, we donâ\u0080\u0099t technically set our policies because of any pressure that people apply to us,â\u0080\u009d he said, according to The Information. â\u0080\u009cAnd, in fact, usually I tend to think that if someone goes out there and threatens you to do something, that actually kind of puts you in a box where in some ways itâ\u0080\u0099s even harder to do what they want because now it looks like youâ\u0080\u0099re capitulating, and that sets up bad long-term incentives for others to do that [to you] as well.â\u0080\u009d Experts told MarketWatch on Wednesday that companies joining the boycott may see a bigger boost to their brands than Facebook ads would have generated in the first place. â\u0080\u009cBy pulling ads, they save money and make a low-risk statement that results in positive publicity and marketing for their brands among constituents,â\u0080\u009d Gerard Francis Corbett, a communications strategy consultant based in Silicon Valley, told MarketWatch. â\u0080\u009cThe Facebook boycott is a lower-risk way for CEOs to make a [political] statement.â\u0080\u009d Earlier this week, Rohit Kulkarni, executive director at MKM Partners, wrote in a note to clients that the ad boycott would affect less than 5% of Facebookâ\u0080\u0099s revenue. Facebook shares FB, +0.26% Â surged nearly 5% on Wednesday, and are up about 16% year to date, compared to the S&P 500â\u0080\u0099s SPX, +0.87% Â 3.5% decline."}]}