{"article": [{"url": "https://www.marketwatch.com/story/duke-energy-dominion-scrap-plans-for-atlantic-coast-pipeline-after-years-of-delays-2020-07-05", "published": 1593969500.0, "headline": "Duke Energy, Dominion scrap plans for Atlantic Coast Pipeline after years of delays", "body": "The builders of the Atlantic Coast Pipeline are pulling the plug on the project as companies continue to meet mounting environmental opposition to new fossil fuel conduits in the U.S. Duke Energy Corp. DUK, +0.16% and Dominion Energy Inc. D, -0.34% said Sunday that they were abandoning the proposed $8 billion pipeline — which aimed to carry natural gas 600 miles through West Virginia, Virginia and North Carolina and underneath the Appalachian Trail — citing continued regulatory delays and uncertainty, even after a favorable Supreme Court ruling last month. Dominion meanwhile said it was selling the rest of its natural gas transmission and storage network to Warren Buffett’s Berkshire Hathaway Inc. BRK.B, +0.24% for $9.7 billion including debt. The deal includes a 25% stake in the Cove Point liquefied natural gas export facility in Maryland, which will remain majority owned by Dominion. “This announcement reflects the increasing legal uncertainty that overhangs large-scale energy and industrial infrastructure development in the United States,” the companies said in a joint statement. “Until these issues are resolved, the ability to satisfy the country’s energy needs will be significantly challenged.” Utilities and pipeline companies have been trying to expand U.S. pipeline networks for more than a decade to take advantage of the bounty of oil and gas unlocked by the fracking boom. But many of the projects have encountered intense opposition from landowners, Native American groups and environmental activists concerned about climate change who want to keep fossil fuels in the ground. An expanded version of this report appears on WSJ.com. Also popular on WSJ.com: A North Korean defector’s tale shows rotting military. After reopenings stall, can restaurants survive a second coronavirus blow?"}]}