{"article": [{"url": "https://www.marketwatch.com/story/this-commodity-escaped-first-half-of-2020-drop-in-the-energy-sector-2020-07-01", "published": 1593602540.0, "headline": "This commodity escaped the first half of 2020 drop in the energy sector", "body": "A benchmark commodities index lost about 20% in the first half of 2020, with the energy sector leading the decline as the coronavirus pandemic ravaged demand for petroleum. Uranium, though, stands out as a resilient performer that’s likely to continue to do well in the second half of the year. “Commodities were hit by a perfect storm related to the Covid-19 outbreak,” says Jeroen Blokland, multiasset portfolio manager at Robeco. “The economic sudden stop meant global commodity demand plummeted while supply has no time to adjust,” and commodities are “exactly defined by these two factors.” The Bloomberg Commodity Index BCOM, +1.51%, which tracks 23 commodities, was down by roughly 20% year to date to June 30. Among its components, ultralow sulfur diesel (ULSD) US:HOQ20 lost 42% so far this year. Brent oil UK:BRNU20 has lost around 38%, and West Texas Intermediate crude US:CLQ20 was down around 36%, while gasoline futures US:RBQ20 fell 29%. In turn, the Bloomberg Energy Subindex BBGCIENG, has fallen about 47% this year. Petroleum producers have been dealing with “higher stocks and substantially lower consumption,” says James Williams, energy economist at WTRG Economics. The most extreme case is distillates, of which over 90% is ultralow sulfur diesel, he says. Over the four-week period ended June 19, U.S. distillate demand was down by 17% from the same period a year ago, but distillate supply stood at 28% above the five year average for that time of year, U.S. government data show. With four-week jet fuel consumption down over 62% year over year as the pandemic curtailed air travel, refiners shifted away from jet fuel to diesel, says Williams. That led to the drop in ULSD futures. But the most unexpected move of the year came from U.S. benchmark West Texas Intermediate crude futures, which made a historic daily drop of 306% on April 20 to settle at a negative $37.63 a barrel, the lowest on record. The oil market was dealing with a price war between Saudi Arabia and Russia even before the seriousness of the pandemic set in. Russia refused to support deeper crude production cuts in early March, leading both countries to boost output instead, until they reached a deal on output reductions that began in May. “The jacked-up oil supply,” combined with the outbreak and quarantine resulted in a world awash in oil, says Adam Koos, president of Libertas Wealth Management Group. That is “not something that fares well for any energy-related commodity or investment.” Still, the biggest gainer among major commodities may come as a surprise as it is also related to the energy sector. Uranium, which is used as fuel for nuclear reactors, has seen futures prices climb about 30% this year. Read:Why uranium has rallied, defying a drop in the energy sector “Demand for nuclear power hasn’t dropped dramatically due to COVID-19 as most reactors operate as baseload power suppliers and are usually the last to be taken off the grid,” says Jonathan Hinze, president of nuclear-fuel consultancy UxC. “Other power generating fuels, especially coal and natural gas, have been much more negatively affected,” so nuclear utilities have “not really seen a reduction in their near-term needs for nuclear fuel.” Hinze expects uranium demand to be “relatively robust” over the next six to 12 months. For commodities as a whole, “short-term events have not been favorable for the demand side, but the long-term supply and demand fundamentals would suggest high prices in the future for many commodities,” says Alissa Corcoran, director of research at Kopernik Global Investors. “Eventually, the world will require more barrels of oil, pounds of uranium and ounces of gold” and prices will need to be high enough to encourage new supply, she says."}]}