{"article": [{"url": "https://www.marketwatch.com/story/uber-ceo-we-will-go-dark-in-california-if-we-have-to-classify-drivers-as-employees-11597247737", "published": 1597251920.0, "headline": "Uber and Lyft say they may shut down in California if forced to classify drivers as employees", "body": "Uber CEO Dara Khosrowshahi, shown here in 2019, said Wednesday that Uber may have to shut down its app in California for at least a couple of months if it loses an appeal and has to classify its drivers as employees. AFP via Getty Images Uber Technologies Inc. and Lyft Inc. warned Wednesday of plans to potentially shut down their operations in California if they are forced to recognize drivers as employees in the state. The two companies are appealing a judge’s ruling requiring drivers to be classified as employees instead of contractors. The judge gave Uber and Lyft 10 days to file an appeal before his order goes into effect. Uber UBER CEO Dara Khosrowshahi warned Wednesday in an interview on MSNBC that the company’s ride-hailing service could shut down in California until November as a result. Khosrowshahi said that it would be “unfortunate,” but what the injunction granted Monday would require would be tough for Uber to pull off quickly. “If the court doesn’t reconsider, then in California, it’s hard to believe we’ll be able to switch our model to full-time employment quickly,” he said. “We can’t go out and hire tens of thousands of people directly overnight.” After announcing earnings Wednesday afternoon, Lyft President John Zimmer said in a conference call that losing an appeal would “force us to suspend operations in California.” Key to the appeal of this week’s ruling is whether the injunction granted by the judge is mandatory, as the company contends, or prohibitory. If it’s the former, an appeal would automatically trigger a stay; if it’s the latter, they can continue its appeal but would have to comply with the injunction order in the meantime. Tom White, an analyst at D.A. Davidson, said in an interview Wednesday that “investors need to prepare for the likelihood that both companies are going to shut down in California.” California makes up 16% of Lyft’s ride-hailing business and 9% of Uber’s rides and delivery gross bookings. Uber’s CEO pointed out that the company doesn’t think it’s likely that it will lose the appeal. If it did, he said Uber would have to go dark until November. That’s when California voters are set to consider Proposition 22, which would exempt Uber, Lyft Inc. LYFT, +2.16% and other gig-economy companies from Assembly Bill 5, a California law that would require them to classify their drivers and delivery workers as employees but promises them some concessions. AB 5, passed in May 2019, is based on a California Supreme Court ruling made more than two years ago that changed the standards for employee classification in the state. The companies are challenging AB 5, which went into effect at the beginning this year, but it could be several months before the U.S. Court of Appeals for the Ninth Circuit in San Francisco takes up the appeal. Pending that, California Attorney General Xavier Becerra and the city attorneys of San Francisco, Los Angeles and San Diego sought an immediate injunction to force Uber and Lyft to comply with AB 5, which San Francisco Superior Court Judge Ethan Schulman granted Monday. When reached for comment Wednesday, an Uber spokesman said Khosrowshahi’s comments are in line with a motion for a stay the company filed in court Tuesday, in which it said that a shutdown “would irreparably harm Uber and all who rely on its Rides app to generate income for them and their families — particularly in the midst of a pandemic.” Mostafa Maklad, an Uber driver in San Francisco and a Gig Worker Rising leader, on Wednesday called Khosrowshahi’s words a threat “that won’t work.” “It will be their loss because San Francisco and Los Angeles are their biggest markets,” he said in an interview. A possible shutdown “won’t be an easy transition for workers, but we will make it through together,” he added. In an email Wednesday, Khosrowshahi urged drivers to vote for Prop. 22, which Erica Mighetto, an organizer with Rideshare Drivers United, said is “making an ask of drivers that will irreparably harm them.” Uber said in its filing that “it would take millions of dollars and months of effort to restructure the Uber Rides business model,” and outlined the steps required, including transforming the Rides app from a platform that “drivers can choose to use or turn off at their leisure” to “a taxi-like employment system” and building an HR system to onboard employees and track drivers’ hours and wages. Opinion: Uber and Lyft’s ‘day of reckoning’ is finally here During the injunction hearing last week, Matthew Goldberg, deputy city attorney for the San Francisco City Attorney’s office, argued that Uber and Lyft already have large white-collar workforces and human resources departments. “Defendants have dramatically overstated what would be required” to switch their drivers to employee status, he said. “These businesses already do many of the things that lawful employers do.” Uber shares fell 1.2% Wednesday, while Lyft shares declined 0.4%. Lyft shares initially moved higher in after-hours trading Wednesday after the company reported smaller quarterly losses than expected, but turned to a decline during the conference call. In a note to clients Monday after the judge’s decision, Deutsche Bank analysts said they did not think a possible short-term shutdown in California would be a big hit financially to Uber because demand continues to be low in the state during the COVID-19 pandemic. Still, they said “it’s obviously not the company’s ideal outcome.”"}]}