{"article": [{"url": "https://www.marketwatch.com/story/of-all-the-major-changes-to-the-dow-on-monday-this-may-be-the-most-important-11598845767", "published": 1598885540.0, "headline": "Of all the major changes to the Dow on Monday, this may be the most important", "body": "The Dow Jones Industrial Average will see a handful of important changes take effect Monday morning, but it is, perhaps, the change to how it is calculated that will be the most important for Wall Street over the near term. Starting at Monday’s open, the so-called divisor — the figure used to determine the influence of any of the 30 components that make up the price-weighted Dow industrials DJIA, +0.56% — will be changed for the first time since April 2019. The move is at least partly precipitated by Apple Inc.’s AAPL, +1.74% fifth stock split in its 40 years as a publicly traded company. Apple’s 4-for-1 stock split set off a cascade of changes by the owners of the blue-chip benchmark, S&P Dow Jones Indices, which added Salesforce.com Inc. CRM, +2.21%, Amgen Inc. AMGN, -1.41% and Honeywell International Inc. HON, +0.34% to the index, replacing iconic Exxon Mobil Corp. XOM, -1.47%, Pfizer Inc. PFE, -0.27% and Raytheon Technologies Corp. RTX, -1.46% Read: 3 things to know about Apple’s stock split Because the value of the Dow is determined by calculating the sum of the prices of its components using a divisor that also factors when a company splits its shares, S&P Dow Jones Indices felt compelled to adjust the makeup of the benchmark. Stock splits can swing the balance of influence for any one blue-chip component. The new divisor is 0.152 from around 0.147, Howard Silverblatt, senior index analyst at S&P Dow Jones Indices, told MarketWatch. In other words, a $1 price move in any Dow component translates to a swing of 6.579 points, from around 6.8 points. Apple’s stock split also may have provided an opportunity for the Dow’s managers to readjust the 124-year equity gauge to better reflect the rapid rise of technology in the broader market in the face of the COVID-19 pandemic. Apple’s split shrinks the weighting of formerly the most important Dow member, to 3% from around 12%, and the overall technology representation in the index to around 20% from 27%. (The addition of Salesforce to the Dow will bring the share of tech in the index to about 23%). Information technology is by far the largest sector in terms of weighting in the S&P 500 index SPX, +0.87%, at 27.5%, as of July 31, for example. DJIA components as of 8/31/20 $Price Rank 1 UnitedHealth Group 314.37 2 Home Depot Inc. 286.29 3 Salesforce.com 271.10 4 Amgen Inc. 253.12 5 Microsoft Inc. 228.91 6 Visa Inc. 215.71 7 McDonald’s Corp. 214.91 8 Goldman Sachs 207.71 9 Boeing Co. 175.80 10 Honeywell International 168.38 11 3M Co. 165.66 12 Johnson & Johnson 153.64 13 Caterpillar Inc. 143.63 14 Walmart Inc. 140.30 15 Procter & Gamble Co. 138.77 16 Walt Disney Co. 135.54 17 IBM 125.07 18 Apple Inc. 124.80 (split-adjusted) 19 Travelers Cos. 115.89 20 Nike Inc. 112.29 21 JPMorgan Chase & Co. 102.77 22 American Express 102.54 23 Merck & Co. 85.65 24 Chevron Corp. 85.63 25 Verizon Communications 59.26 26 Intel Corp. 50.43 27 Coca-Cola Co. 49.83 28 Dow Inc. 46.05 29 Cisco Systems 42.20 30 Walgreens Boots Alliance Inc. 38.76 Source: FactSet New entrants in bold S&P Dow Indices explained the overall thinking of altering the divisor as significant in “the index’s ability to provide a continuous measure of market valuation when faced with changes to the stocks included in the index.” Apple will be ranked 18th in price on the Dow on a split-adjusted basis, while the new entrants in the Dow will all be within the top 10, led by Salesforce.com at No. 3. All the interest in moves within the Dow industrials may be surprising to some on Wall Street. More than $11 trillion is indexed to the S&P 500, while around $32 billion was indexed to the Dow as of the end of 2019, according to S&P Dow Jones Indices. That said, the Dow is by far the most well-known, easily understood index in the world."}]}