{"article": [{"url": "https://www.marketwatch.com/story/indianas-alternative-to-vote-by-mail-28-days-of-early-in-person-voting-2020-09-05", "published": 1601457380.0, "headline": "Indianaâ\u0080\u0099s alternative to vote by mail: 28 days of early in-person voting", "body": "In Indiana, we keep it simple. Our state makes it easy to vote and hard to cheat. This year, weâ\u0080\u0099ve been hearing a lot about vote-by-mail states. I want to highlight our stateâ\u0080\u0099s alternative process of early, in-person voting because in Indiana, we donâ\u0080\u0099t just do Election Day, we have an election month. Itâ\u0080\u0099s not surprising that there has been a significant focus on mail-in ballots this year as many of us have reduced our outings to help flatten the COVID-19 curve. And while voting by mail is a safe process, early voting is a popular alternative. Indiana voters have access to 28 days of early, in-person voting prior to Election Day, one of the longest early voting periods in the nation. Every county election office is required to offer early, in-person voting, including weekend hours, and many counties opt for additional early voting locations. The process is simple, and in the last presidential election, almost a third of Indiana voters voted early, in person. Voting early and in person provides the satisfaction of voting at the ballot box, but avoids the lines that can occur on Election Day. Because many counties have multiple early voting options, voters are usually able to cast their ballot in a matter of minutes. Voters also have the confidence that their ballot was received and logged by the election office, rather than sending their ballot through the postal service where they may have to wait several days before receiving confirmation. I encourage Indiana voters to vote early and in person if possible. Election offices have been equipped with personal protective equipment and because of the short lines during early voting, social distancing is easy. How voting stays honest I often get asked if people vote early, how do you ensure they only cast one ballot? Rest assured, we have safeguards and procedures in place to ensure the integrity of our election. Many counties use electronic poll books that update in real time, allowing election workers to see who has requested to vote by mail and who has already voted in person. In addition, we track this information in our statewide voter registration system. Each county tracks early voting closely, so fraudsters canâ\u0080\u0099t vote more than once. I realize that everyone canâ\u0080\u0099t go to the polls and they may be uncomfortable with mailing their ballot. Indiana voters who are ill or confined may request to vote by traveling board. In these cases, one Republican and one Democrat go to the voter and allow them to cast a ballot. This option is often favored by those who are less mobile or live in a retirement community. Indianaâ\u0080\u0099s 92 county clerks and their staff do a tremendous job of safeguarding our votes and providing alternative in-person voting options. Through their tireless efforts, we are again approaching Election Day with confidence, knowing that our carefully constructed systems are operating as designed. I encourage other states to look at the Indiana model as an efficient and effective way to provide an alternative to in-person, Election Day voting. The pandemic has forced Americans to review many processes and procedures, and voting is no different. I hope that early, in-person voting is an option that we can all look to embrace. Also read:Oregonâ\u0080\u0099s key lessons on voting by mail â\u0080\u0094 after 2 decades of only voting that way And:Iâ\u0080\u0099m the Republican secretary of state in Washington â\u0080\u0094 and I believe voting by mail works Connie Lawson is Indianaâ\u0080\u0099s secretary of state."}]}