{"article": [{"url": "https://www.marketwatch.com/story/raging-wildfires-in-california-force-power-outages-01599545915", "published": 1599531980.0, "headline": "Raging wildfires in California force power outages", "body": "Smoke from the Grizzly Creek Fire blankets Glenwood Canyon and Interstate 70 on August 26, 2020 in Glenwood Springs, Colorado. Alex Edelman/Getty Images New wildfires ravaged bone-dry California during a scorching Labor Day weekend that saw a dramatic airlift of more than 200 people trapped by flames and ended with the state’s largest utility turning off power to 172,000 customers to try to prevent its power lines and other equipment from sparking more fires. California is heading into what traditionally is the teeth of the wildfire season, and already it has set a record with 2 million acres burned this year. The previous record was set just two years ago and included the deadliest wildfire in state history — the Camp Fire that swept through the community of Paradise and killed 85 people. That fire was started by Pacific Gas & Electric PCG, +1.79% power lines. Liability from billions of dollars in claims from that and other fires forced the utility to seek bankruptcy protection. To guard against new wildfires and new liability, PG&E last year began preemptive power shutoffs when conditions are exceptionally dangerous. That’s the situation now in Northern California, where high and dry winds are expected until Wednesday. PG&E received criticism for its handling of planned outages last year. The utility said it has learned from past problems, “and this year will be making events smaller in size, shorter in length and smarter for customers.” Two of the three largest fires in state history are burning in the San Francisco Bay Area. More than 14,000 firefighters are battling those fires and about two dozen others around California. The fire danger also is high in Southern California, where new fires were burning in Los Angeles, San Bernardino and San Diego counties. The U.S. Forest Service on Monday decided to close all eight national forests in the region and to shutter campgrounds statewide. “The wildfire situation throughout California is dangerous and must be taken seriously.” said Randy Moore, regional forester for the Forest Service’s Pacific Southwest Region that covers California. “Existing fires are displaying extreme fire behavior, new fire starts are likely, weather conditions are worsening, and we simply do not have enough resources to fully fight and contain every fire.” Lynne Tolmachoff, spokeswoman for the California Department of Forestry and Fire Protection, or Cal Fire, said it’s “unnerving” to have reached a record for acreage burned when September and October usually are the worst months for fires because vegetation has dried out and high winds are more common. While the two mammoth Bay Area fires were largely contained after burning for three weeks, firefighters struggled to corral several other major blazes ahead of the expected winds. Evacuation orders were expanded to more mountain communities Monday as the largest blaze, the Creek Fire, churned through the Sierra National Forest in Central California. It was one of many recent major fires that has displayed terrifyingly swift movement. The fire moved 15 miles (24 kilometers) in a single day during the weekend and burned 56 square miles (145.04 square kilometers). Since starting Friday from an unknown cause. it has burned 212 square miles (549 square kilometers). Debra Rios wasn’t home Monday when the order came to evacuate her hometown of Auberry, just northeast of Fresno. Sheriff’s deputies went to her ranch property to pick up her 92-year-old mother, Shirley MacLean. They reunited at an evacuation center. “I hope like heck the fire doesn’t reach my little ranch,” Rios said. “It’s not looking good right now. It’s an awfully big fire.” Mountain roads saw a steady stream of cars and trucks leaving the community of about 2,300 on Monday afternoon. Firefighters working in steep terrain saved the tiny town of Shaver Lake from flames that roared down hillsides toward a marina. About 30 houses were destroyed in the remote hamlet of Big Creek, resident Toby Wait said. “About half the private homes in town burned down,” he said. “Words cannot even begin to describe the devastation of this community.” A school, church, library, historic general store and a major hydroelectric plant were spared in the community of about 200 residents, Wait told the Fresno Bee. Sheriff’s deputies went door to door to make sure residents were complying with orders to leave. Officials hoped to keep the fire from pushing west toward Yosemite National Park. On Saturday, National Guard rescuers in two military helicopters airlifted 214 people to safety after flames trapped them in a wooded camping area near Mammoth Pool Reservoir. Two people were seriously injured and were among 12 hospitalized. On Monday night, a military helicopter tried but failed to land near Lake Edison to rescue people trapped by the fire, the Fresno Fire Department said on Twitter. The department tweeted that “military pilots tried valiantly to land but heavy smoke conditions prevented a safe approach, another effort will be made shortly to evacuate the trapped people in Lake Edison and China Peak using night vision.” Chief Warrant Officer Joseph Rosamond, the pilot of a Chinook helicopter, said visibility was poor and winds increasingly strong during the three flights he made into the fire zone during the operation that started late Saturday and stretched into Sunday. His crew relied on night-vision goggles to search for a landing spot near a boat launch where flames came within 50 feet (15.24 meters) of the aircraft. The injured, along with women and children, took priority on the first airlift, which filled both helicopters to capacity, he said. “We started getting information about how many people were out there, how many people to expect, and that number kept growing. So we knew that it was a dire situation,” Rosamond said. In Southern California, crews scrambled to douse several fires that roared to life in searing temperatures, including one that closed mountain roads in Angeles National Forest and forced the evacuation of the historic Mount Wilson Observatory. Late Monday night, the Los Angeles County Fire Department told residents of Duarte, Bradbury and Monrovia near the forest to get ready for a possible evacuation. Cal Fire said a blaze in San Bernardino County called the El Dorado Fire started Saturday morning and was caused by a smoke-generating pyrotechnic device used by a couple to reveal their baby’s gender. In eastern San Diego County, a fire destroyed at least 10 structures after burning 16 square miles (41.44 square kilometers) and prompting evacuations near the remote community of Alpine in the Cleveland National Forest. California has seen 900 wildfires since Aug. 15, many of them started by an intense series of thousands of lightning strikes in mid-August. There have been eight fire deaths and more than 3,300 structures destroyed."}]}