{"article": [{"url": "https://www.marketwatch.com/story/draftkings-shares-jump-after-adding-michael-jordan-as-investor-and-adviser-11599049880", "published": 1599046520.0, "headline": "DraftKings jumps after addition of NBA legend Michael Jordan as investor and adviser", "body": "Michael Jordan was awarded the Presidential Medal of Freedom in November 2016. Chip Somodevilla/Getty Images Shares of DraftKings rallied Wednesday after the company added basketball legend Michael Jordan as an adviser to the company. DraftKings shares DKNG, -4.51% rose as much as 12%, before settling into a 4% gain, as it said Jordan, who won six titles with the Chicago Bulls and is the chairman of Charlotte Hornets owner Hornets Sports & Entertainment, will take an equity interest in exchange for providing guidance and strategic advice to the board. Jordan’s input to the board of directors will be in the areas of company strategy, product development, diversity, equity and belonging, marketing and other initiatives, said the Boston-headquartered sports gambling operator and fantasy sports site. DraftKings shares have soared since going public via a merger with a blank-check company. DraftKings shares have jumped 256% in 2020. Jordan is known for being an avid gambler, a topic he discussed in this year’s hit documentary “The Last Dance,” a co-production of ESPN DIS, +1.53% and Netflix NFLX, +1.43%. Forbes put Jordan’s net worth at $2.1 billion in May, calling him the world’s richest former athlete, who uniquely still has endorsement deals with companies including Nike NKE, +0.97% while serving as majority owner of the Hornets franchise. DraftKings didn’t disclose the magnitude of Jordan’s equity stake. According to FactSet, its top shareholder is Shalom Meckenzie, whose SBTech merged with DraftKings as part of the deal bringing the company to the public market, and ESPN owner Walt Disney holds a 6% stake. A number of sports-franchise owners also hold stakes in the company, including Dallas Cowboys owner Jerry Jones and New England Patriots owner Robert Kraft."}]}