{"article": [{"url": "https://www.marketwatch.com/story/10-suvs-that-are-really-fun-to-drive-2020-08-31", "published": 1598850680.0, "headline": "10 SUVs that are really fun to drive", "body": "The real fun of an SUV is supposed to be the “U” in the abbreviation – packing in hiking gear, stowing ski equipment, and taking the “road” less traveled. Isn’t “utility” the main reason we buy these large wagon-like vehicles? For some, that’s changing. Blending the performance of a sport sedan with the utility of an SUV seems counterintuitive but the unholy combination nets some fairly interesting vehicles. The most impressive versions of SUVs that are actually fun to drive are usually from luxury brands. Many of these are fairly expensive since they combine high-horsepower engines with beefy brakes and suspension to effectively manage the weight and size of a useful SUV. If you want a functional SUV that’s also a blast to drive, here’s a list of the top dogs:1. 2021 Mercedes-AMG GLE 63 S The 2021 Mercedes-AMG GLE 63 S Mercedes-Benz There’s no way around it, the new AMG GLE 63 is the king of performance/luxury SUVs. The sound of the biturbo V8, and it’s 603 hp, is impressive. The 0 – 60 time (stated by Mercedes) of 3.7 seconds is equally smile-inducing. Also, the state of the art EQ Boost feature adds up to 21 additional horsepower in short bursts resulting in that roller-coaster feeling in your gut each time you stomp the accelerator. But it isn’t just that – the GLE 63 combines world-class performance with a level of luxury and everyday usefulness that’s almost unbelievable – excellent sound system, easy to use controls, super comfy seats and a very intuitive interface for access to all the bells and whistles you paid for. Also, it looks amazing – be prepared for a heavy dose of thumbs-up every time you drive it. 2. 2020 Land Rover Range Rover Sport SVR The Land Rover Range Rover Sport Land Rover USA With 575 hp of supercharged V8 performance, this Range Rover Sport is quick. 0 – 60 comes up in 4.3 seconds, just a hair quicker than the Dodge Durango SRT. In Land Rover (and Jaguar) terminology, SVR stands for Special Vehicle Operations, usually a pumped-up version of an otherwise normal car or SUV. The SVR treatment also gets you a healthy dose of interior and exterior enhancements like a black roof, cooler looking exhaust outlets, SVR sport seats, a sport steering-wheel and, SVR tuned air suspension. You can also opt for many special exterior colors, some add $4,000 or more to the price. Then again, the “Pimento” and black interior is a no-cost option (It’s really just black and red). The SVR version of the Range Rover Sport is $115,000. 3. 2020 BMW X6 M The BMW X6 M BMW USA If you’re looking for maximum performance and just a little less SUV, the curvy-roofed X6 M is your thing. The Competition version is a truly awe-inspiring vehicle that places raw power, excellent handling, and a unique look above just about every other consideration in a car. 0 – 60 comes up in 3.8 seconds. Opt for the Competition version and you get an additional 17 hp for a total of 617. It’s quick. It looks aggressive, feels quick, and it sounds amazing. The X6 M is roughly $110,600 before options and $118,600 for the Competition version. Don’t miss: The 15 best midsize SUVs of 20204. 2020 Porsche Macan Turbo The Porsche Macan Porsche Refreshed for the 2019 model year, the Macan continues to be a very quick, very fun small SUV. To keep up with the rest of the crowd on this high-powered list, we’re considering the Turbo. The Macan Turbo has a 2.9-liter twin-turbo V6. This one is slightly more powerful than the Macan GTS. While the GTS delivers 375 hp, the Macan Turbo delivers 434 hp and 405 lb-ft of torque. That means a 0-60 mph time down to 4.3 seconds. However, there are various performance levels of Macan to choose from. The base version is about $52,000 and is powered by a 2.0-liter turbo-four making 248 hp. The Macan Turbo is an $85,000 car. 5. 2020 Dodge Durango SRT The Dodge Durango. Dodge You need 475 hp and three rows of family-friendly features. Well, no one really “needs” that but it sure is fun. Like every SUV on this list, the Dodge Durango SRT isn’t cheap. However, at $63,000 it’s one of the most affordable considering all that power and a third-row seat. The BMW X6 M Competition is about double that price. Sure, the BMW is quicker from 0 – 60 but how often will you be using any of these power wagons to their fullest potential? For the Durango SRT, that 0 – 60 time is 4.4 seconds. 6. 2020 Jeep Grand Cherokee Trackhawk 707 horsepower makes the 2020 Jeep Grand Cherokee Trackhawk the most powerful SUV on this year’s list, and it’s 7,200-pound towing capacity makes it the most capable hauler. It’s just as luxurious as the standard Grand Cherokee, but this one goes from 0 to 60 in just 3.5 seconds. At $87,000, it’s right in line with many of the other powerful SUVs on this list. 7. 2020 Jaguar F-Pace The Jaguar F-Pace Jaguar It isn’t easy to make a vehicle with tall ride height and room for cargo that can also drive like a sports car. Yet the Jaguar F-Pace achieves that, and behind the wheel, it feels true to the Jaguar name. With the sleek, curvy F-Pace, you can choose the amount of fire you want, from the base 247-horsepower model to the 550-horsepower SVR. Whatever engine you choose, though, the F-Pace remains a well-composed, nicely balanced SUV. With the SVR, 0 – 60 comes up in 4.1 seconds, right in line with the Porsche Macan depending on the version you get. The Macan Turbo is quicker but the Jag feels a little more comfortable in everyday life. The F-Pace SVR is a little over $80,000. Also see: 8 new luxury SUVs for under $50,0008. 2020 Lincoln Aviator Grand Touring (PHEV) The Lincoln Aviator Lincoln Lincoln’s new Aviator is the surprise hit of the luxury SUV world. It’s stylish, has three-rows of seating, and is more luxurious than many European brand SUVs. But for some serious fun, check out the Grand Touring version. It’s a plug-in electric hybrid (PHEV) with 494 hp. No, really. 0 – 60 comes up in 5 seconds. The Aviator GT’s price is parked right at the doorstep of $70,000. Because it’s a PHEV, you can drive about 20 miles on electricity only. If you get the Mercedes GLE or the Jag F-Pace instead, we can’t fault you. But Lincoln’s new crop of SUV are worth a look. At least test drive the Aviator before you make your final decision. See: Everything you need to know about plug-in hybrids9. 2020 Tesla Model Y The Tesla Model Y. Tesla We have the Tesla TSLA, +1.89% Model Y on our list of “Best Cars for Dog Owners” but it’s here for a totally different reason. It’s easy to see why you would categorize an SUV with up to 580 horsepower, quick steering, and near-instant response as being a fun SUV. We also like Smart Summon, a feature that allows the Model Y to drive itself from a parking spot to where you’re standing. It’s similar to Hyundai’s HYMTF, -0.02% Smart Park but more sophisticated. See: What it’s like to drive a Tesla Model Y10. 2020 FIAT 500X The Fiat 500X Fiat It doesn’t look like much on paper, and definitely can’t keep up with the other SUVs on this list. However, the FIAT 500X is a reasonably priced, fun SUV that has its own personality. With 177 hp, and a $25,000 price tag plus an adorably small footprint, it’s an SUV in the loosest sense of the word. Still, the 500X is really fun. Thanks to three driver-selectable driving modes and standard all-wheel drive, the 500X does its best work darting in and out of the behemoths found in the urban jungle but has a little grit left over to handle weekend ski trips, beachy sand, muddy trails and those fire roads that help you get to that “certain place” no one else knows about. We suggest the Trekking version finished in “Blu Venezia.” We think that’s, like, Italian for Metallic Blue. Read next: The 15 best compact SUVs—and they’re priced right, too This story originally ran on Autotrader.com."}]}