{"article": [{"url": "https://www.marketwatch.com/story/republicans-want-to-replace-extra-600-unemployment-benefit-with-70-replacement-wages-heres-why-that-could-take-months-to-implement-2020-07-28", "published": 1596294260.0, "headline": "Republicans want to replace extra $600 unemployment with 70% replacement wages - but that could take months", "body": "What's next for Americans who may have received their last unemployment-insurance checks that included the extra $600 a week from the CARES Act? Well, that depends on how well-equipped their states' employment offices are. On Monday, Senate Republicans unveiled a new stimulus package, dubbed the Health, Economic Assistance, Liability Protection and Schools Act, or HEALS Act, that calls for implementing supplemental weekly unemployment benefits equal to 70% of a workers' prior wages with a $500 cap. But implementing that would take a minimum of eight to 20 weeks for state labor departments, according to a memo to members of Congress written by the National Association of State Workforce Agencies, a nonprofit and nonpartisan trade group. “ The Republicans' HEALS Act would allocate some $2 billion for state workforce agencies to upgrade their computer processing systems. ” Until states can implement that, the Republican plan calls for two months where unemployment beneficiaries would receive a flat $200 a week on top of what they would otherwise receive at the state level. Labor Secretary Eugene Scalia said, \"the great majority [of states] indicated they can get this done within eight weeks.\" States can apply for a waiver from the Department of Labor \"if they're not able to achieve it\" within eight weeks, he said in a CNBC interview on Tuesday. Opinion: Killing the $600 unemployment benefit is a boneheaded move The HEALS Act would allocate some $2 billion for state workforce agencies to upgrade their computer processing systems. Scalia said that one proposal put forth by Senate Minority Leader Chuck Schumer and Senator Ron Wyden, a Democrat from Oregon, which ties unemployment benefits to state unemployment rates, would have \"required more changes by states.\" The time lag to switch over to the 70% wage-replacement payout formula is related to the fact that so many people receiving unemployment benefits are self-employed or are gig workers, said Wayne Vroman, an economist at the Urban Institute, a left-leaning policy think tank. Under the $2 trillion stimulus package, known as the CARES Act, these types of workers became eligible for unemployment benefits. Without the CARES Act, they would have been ineligible. Unlike traditional salaried workers, self-employed and gig workers often have volatile incomes that are not automatically reported to state workforce agencies.Therefore, state workforce agencies \"would have to request that information from an applicant from their 1099 tax form,\" Vroman said. (A 1099 tax form is often used in place of a W2 form to report earnings to the government for a person who is not an employee, according to the Internal Revenue Service.) \"Those forms would serve as a source of income but they are much more difficult to get a hold of,\" he said, and would likely require state workforce personnel to speak individually with unemployment beneficiaries. “ 'The Republican proposal on unemployment benefits, simply put, is unworkable. It will delay benefits for weeks if not months as we slide into a greater degree of recession.' ” - Senate Minority Leader Chuck Schumer If unemployment benefits are distributed based on claimants' prior wages, \"new capacity would need to be created to receive and analyze earnings data for self-employed workers,\" the National Association of State Workforce Agencies said. But many states like Florida are already struggling with processing jobless claims in a timely manner. As a result, more than 55,000 Floridians who were eligible missed out on the $600 a week boost in unemployment benefits, CNBC reported. The Department of Economic Opportunity, which administers unemployment benefits in Florida, recently cut nearly 1,000 contracted call center workers. The agency told MarketWatch it is \"actively monitoring the discussions being made by Congress to possibly extend Federal unemployment benefits and will work diligently with the U.S. Department of Labor to serve Floridians.\" Vromen suspects that states which supplement their workforce agencies with more funding on the state level as opposed to relying on federal funds would adjust more easily to the 70% wage replacement formula if the Republican proposal is signed into law. Also see: Republicans and Democrats both want another round of stimulus checks - but here's where they disagree House and Senate Democrats hold that the Republican proposal for unemployment benefits unfairly penalizes Americans who are unemployed due to the pandemic. \"If you've lost your job through no fault of your own Republicans want you to take a 30% pay cut,\" Chuck Schumer, a New York Democrat, said Monday. \"The Republican proposal on unemployment benefits, simply put, is unworkable. It will delay benefits for weeks if not months as we slide into a greater degree of recession,\" he said on the Senate floor. Schumer and House Speaker Nancy Pelosi, as well as many other Democratic lawmakers, have been urging Republicans to consider the HEROES Act, a $3 trillion stimulus package House Democrats passed in May. That proposal, among other things, would extend the extra $600 federal unemployment benefit to January 2021. The Congressional Budget Office found that if these benefits were extended through January 2021, an estimated five of every six recipients would receive more in benefits than they would from working those six months. Republicans say that would act as a disincentive for beneficiaries to return to work. Democrats however hold that there aren't enough jobs out there for unemployed people to fill."}]}