{"article": [{"url": "https://www.marketwatch.com/story/trump-kicks-off-trips-to-4-battleground-states-as-democrats-open-convention-2020-08-17", "published": 1597675280.0, "headline": "Trump kicks off trips to 4 battleground states as Democrats open convention", "body": "President Donald Trump on Monday kicked off a series of visits to swing states on the same day that Democrats opened their 2020 convention, as the Republican sought to provide counterprogramming to the celebration of former Vice President Joe Biden and his running mate Kamala Harris. The president is visiting Mankato, Minn., and Oshkosh, Wis., on Monday — as Democrats are anchoring their convention in Milwaukee. The convention is almost entirely virtual this year due to the coronavirus pandemic, but the proceedings are being gaveled in and out from Milwaukee, and members of Wisconsin’s congressional delegation will speak from the city. See:Democrats to open convention like no other as Biden’s big party goes virtual. On Tuesday, the president goes to Yuma, Ariz., and on Thursday — the day Biden accepts the Democratic nomination — Trump will be in Biden’s hometown of Scranton, Pa. Trump is trailing Biden in polls of all four states’ voters, according to RealClearPolitics. Arriving in Minneapolis, Trump took aim at Biden and at Michelle Obama. The former first lady is among the featured speakers on Monday night’s program. “What is this they’re taping their speeches?” Trump asked about Mrs. Obama. “When you hear a speech is taped it is like there’s nothing very exciting about it right?” he said, according to a White House pool report. The former first lady slammed Trump in her 2018 book “Becoming,” saying the campaign he championed that falsely claimed Barack Obama wasn’t a U.S. citizen was “deliberately meant to stir up the wing nuts and kooks.” Also read:Here’s how to watch the Democratic convention — plus who’s speaking, and when. Trump has charged that the Biden-Harris ticket could sink stock markets DJIA, +0.56% and the economy — though at least one analyst has said that it is a Democratic sweep of the White House and Congress that would be best for the economy in the long run. Sign up for Trump Today and more MarketWatch newsletters."}]}