{"article": [{"url": "https://www.marketwatch.com/story/california-is-trying-to-legally-require-more-diversity-on-corporate-boards-11598985823", "published": 1598972600.0, "headline": "California is trying to legally require more diversity on corporate boards", "body": "A bill that would mandate ethnic, racial or LGBT diversity on corporate boards in California is awaiting the governor's signature. David Paul Morris/Getty Images California, the first state in the nation to mandate that women sit on corporate boards of publicly held corporations, may soon require that companies have at least one director from an underrepresented minority community on their boards by the end of next year. Assembly Bill 979, which state lawmakers passed Sunday, is now awaiting Gov. Gavin Newsom’s signature. The bill would require companies based in California to add at least one board member from underrepresented groups — people who identify as Black or African-American, Hispanic, Latino, Asian, Pacific Islander, Native American, Native Hawaiian or Alaska Native, or gay, lesbian, bisexual or transgender — by the end of 2021. By the end of 2022, companies with at least nine board members would be required to have at least three such directors, and those with four to eight board members would be required to have at least two directors from those groups. Newsom has until Sept. 30 to sign the bill. His office has not returned a request for comment about whether he plans to do so. The bill could be just as controversial or more so than SB 826, which was signed into law by then-Gov. Jerry Brown in 2018 and has since sparked at least a couple of lawsuits seeking to invalidate it. At the time that bill was passed, many of Silicon Valley’s biggest tech companies had at least one woman on their boards. For more: California vs. the U.S. has a new battleground: Tech regulation It appears not all companies have complied with that law amid legal challenges. According to a report released by Secretary of State Alex Padilla’s office in March, as of the end of 2019, only 330 of the 625 affected companies in the state had filed a corporate disclosure statement as required. Of those 330 companies, 48 — which the secretary of state did not name — did not have a woman on their board as they were required to have by the end of last year. The office of California’s secretary of state is responsible for tracking compliance with SB 826 and can issue fines of $100,000 for the first violation and $300,000 for subsequent violations, a structure that is also in place for AB 979. Padilla has not taken enforcement action against any company in connection with SB 826, his press secretary, Sam Mahood, said Monday. California laws often precede those in other states. In the case of the gender-diversity mandate for corporate boards, similar proposals are being or have been considered in Hawaii, Illinois, Massachusetts, New Jersey and Washington state. On the federal level, the U.S. House of Representatives in November sent legislation to the Senate requiring companies to disclose the racial, ethnic and gender makeup of their executives and board of directors. Other efforts to diversify boards have come from the financial industry, including from Goldman Sachs Group Inc. GS, -0.21%, which said this summer that it won’t help companies go public unless they have at least one board member from an underrepresented group. The current board diversity bill in California is supported by companies such as HP Inc. HPQ ; the Silicon Valley Leadership Group, which represents more than 350 tech and other companies; and various other advocacy groups and chambers of commerce. But even its supporters realize that it could face more serious pushback than California’s effort to get more women on corporate boards. See: The tech industry has a ‘moral imperative’ to take action on inequity, new Silicon Valley leader says “There’s no question this bill pushes the envelope,” state Assemblyman Chris Holden, D-Pasadena, author of the bill, said in an emailed statement Monday. “Legislation that shakes up the status quo, especially when it comes to dismantling systemic racism, will always face challenges.” Rosalind Chow, an associate business professor at Carnegie Mellon University who does diversity research, said she thinks this bill will be “significantly more controversial” because it relates to ethnic diversity. “The claim about there not being enough qualified individuals will probably become even stronger in regards to [underrepresented minority] candidates,” Chow told MarketWatch. She also mentioned that the sexual- orientation aspect of the bill will limit potential candidates to those who are willing to self-identify as LGBT. Holden’s office cites a 2015 McKinsey & Co. report that found better financial performance for companies with diversity in their top management and board of directors. Companies in the top quartile for ethnic or racial diversity were 35% more likely to have financial returns above their respective national industry medians. For companies that were in the top quartile for gender diversity, that number was 15%. “We recognize that the most innovative solutions come from assembling teams with diverse viewpoints and backgrounds,” Kim Rivera, president of Strategy & Business Management and chief legal officer for HP, testified before a California Senate committee earlier this month. An individual attorney testified against the bill before a state assembly committee, saying the bill violates the equal protection clauses of the state and federal constitutions and the commerce clause of the U.S. Constitution. “The bill will arbitrarily privilege females from underrepresented communities over males from those same communities,” Keith Paul Bishop wrote in a blog post on his law firm’s website. Anastasia Boden, senior attorney for the libertarian Pacific Legal Foundation, which has sued over SB 826, said in an emailed comment Monday, “Like California’s ‘Woman Quota,’ AB 979 mistakes equal numbers for equal opportunity and elevates quotas over addressing actual instances or causes of discrimination.”"}]}