{"article": [{"url": "https://www.marketwatch.com/story/when-does-the-stock-market-close-for-july-4th-heres-everything-investors-need-to-know-about-friday-trading-hours-and-closures-2020-07-01", "published": 1593789260.0, "headline": "Is the stock market closed today? For 4th of July, hereâ\u0080\u0099s everything investors need to know about trading hours and closures", "body": "Independence Day falls on Saturday this year, meaning that U.S. financial markets will be closed on Friday. The New York Stock Exchange and Nasdaq will be shuttered at the conclusion of regular trade Thursday, while the bond market will close an hour early, at 2 p.m. Eastern on Thursday, and will remain closed over the Fourth of July holiday, per the recommendation of the Securities Industry and Financial Markets Association, a brokerage-industry trade group that sets procedures for trading in bonds like the 10-year Treasury note TMUBMUSD10Y, 0.777%. Trading for U.S. oil CL.1, -1.62% Â on the New York Mercantile Exchange and GC.1, +2.04% Â on Comex also will be closed for settlements on Friday. The holiday this year may carry a unique significance to markets and an economy that have been rocked by a pandemic that has claimed the lives of more than a half-million people worldwide and infected 10.5 million thus far. The deadly coronavirus outbreak has provided the backdrop for the eruption of civil unrest in the U.S. following the killing of George Floyd on May 25 by a Minneapolis police officer. Calls for social justice ensued for Floyd and others, and this Independence Day may, for some, provide a time of somber reflection if not celebration. On July 2, 1776, the Continental Congress voted in favor of independence against Britain, and two days later delegates from the 13 colonies finalized the Declaration of Independence. The Fourth of July was enshrined as a federal holiday by Congress on June 28, 1870. However, independence for many Americans, whose efforts under bondage would eventually make the nation a superpower, wasnâ\u0080\u0099t achieved until the Emancipation Proclamation in 1863, marking the end of slavery. Even then, it wasnâ\u0080\u0099t until June 19, 1865 that most American slaves learned of the proclamation; and then a century later before other hard-fought liberties were obtained by Black Americans. Read: Macyâ\u0080\u0099s launches â\u0080\u0098unannouncedâ\u0080\u0099 July 4th fireworks this week â\u0080\u0094 but whoâ\u0080\u0099s behind the surprise fireworks boom across the country? Back in 1776, the euphoria for freedom and change from under the tyranny of Britain compelled civilians in lower Manhattan to tear down a statue of King George III. Similarly, in scenes repeated across the U.S., citizens protesting racial injustice have been leveling statues with ties to racism and white supremacy. Last month, protesters tore down a bust of Ulysses Grant and â\u0080\u009cStar-Spangled Bannerâ\u0080\u009d writer Francis Scott Key, because they owned slaves at points during their lives. Protesters have also, at times, targeted Founding Fathers such as Thomas Jefferson, one of the key signatories of the Declaration of Independence, who owned slaves. So far, the business community has seen an outpouring of support for social justice from a number of corporations, but it is unclear how this groundswell, along with the effects of the virus, will shape the future. For its part, the stock market has been trying to power through the numerous issues that have cropped up in an unusually turbulent period in history. The Dow Jones Industrial Average DJIA, +0.56% and the S&P 500 index SPX, +0.87% have gained nearly 40% since touching a late-March low as the COVID-19 pandemic roiled investor confidence, and the Nasdaq Composite COMP, +1.39% Â has gained nearly 50% over the same period. Early efforts to restart business activity have been uneven and been met by reversals of social-distancing restrictions in a number of Southern and Western U.S. states, including Florida, Texas and California. The U.S. to a single-day record of more than 52,000 new coronavirus cases on Thursday, according to data compiled by Johns Hopkins University. That rise in cases, with a record tally of 10,000 in Florida alone, is complicating Fourth of July celebrations, with many called off due to the outbreaks, raising worries that the epidemic will deliver a deeper hit to the economy. Still, trillions of dollars in aid from the Federal Reserve and the U.S. government have helped to embolden buyers of assets considered risky on Wall Street."}]}