{"article": [{"url": "https://www.marketwatch.com/story/taking-the-new-york-city-streets-back-before-the-cars-return-2020-07-28", "published": 1595941640.0, "headline": "Taking the New York City streets back before the cars return", "body": "She’s the patron saint of pedestrians in New York City. Bike riders too. And she’s seeing an opportunity like she’s never seen before. “A once-in-a-generation chance to reimagine our streets and what’s actually possible,” Janette Sadik-Khan said. As city transportation commissioner for six years under Mayor Mike Bloomberg, Sadik-Khan rerouted more traffic, cleared more bike paths, laid more bus lanes and reorganized more public plazas than anyone in the history of American urban life. She created what became Citi Bike and fundamentally shifted the human and vehicular flow through Times Square and Herald Square. There will be a New York City when this pandemic is finally over. What? You thought a global health crisis would stop her from insisting on more? “When we used to take a parking spot or two,” she recalled, “it was like we were taking someone’s firstborn child. Now, almost overnight, there are 9,100 outdoor-dining permits in New York City” — tables, chairs, umbrellas and diners, many of them where cars once parked. “It’s not quite Italy. But when you ride your bike or walk around, it’s so exciting to see that new life. People don’t want to come back to a city that’s worse than when they left it.” Sadik-Khan talks about streets the way real-estate developers talk about prime parcels, as raw canvases just begging for alternate use, which almost always means loosening the monopoly that cars have held. And now’s the time to act, Sadik-Khan said, before all the traffic comes back to choke us and never lets go. “Our cities are not going to recover if we add a traffic crisis to the ongoing health crisis and economic crisis,” she said, as the national COVID-19 death count closed in on 150,000. When Sadik-Khan left City Hall, she wrote a book called “Streetfight: Handbook for an Urban Revolution,” co-authored with her Bloomberg Administration colleague Seth Solomonow. Now, they work together at Bloomberg Associates, the ex-mayor’s consulting firm, advising officials in cities around the world on their transportation needs. Also read: Fed extends emergency loan programs for three months until end of 2020 “We can’t have 8.3 million people driving everywhere,” she said. “There’s never going to be enough parking or concrete. There’s just not enough city for everyone to drive. That’s not an economically sustainable or climate-sustainable future. You can’t engineer your way out of traffic congestion. You’re just renegotiating the terms of your surrender.” You have to think differently, she said. “And streets are the most valuable assets that cities have. So how else can we use them?” The options, she said, include more pedestrian-only thoroughfares, more protected bike lanes, more dedicated bus routes and a whole lot more urban acreage turned into plazas and parks. Most of these moves aren’t even all that expensive. They just require saying no to some cars. “No, you can’t park here. Can’t you see I’m having dinner?” “No, you can’t drive so fast. You’ll kill someone.” Pedestrians walk along a street closed to vehicle traffic in May as the city expanded areas for safe distancing. Getty Images Most of the Bloomberg-era transportation reforms have been maintained since Bill de Blasio became mayor, though further expansion has slowed to a crawl. The current mayor did launch Vision Zero, a citywide traffic-safety initiative. But a long-discussed congestion-pricing plan is now stalled indefinitely, and prior to the pandemic, getting around the city was less of a signature issue at City Hall. But what about now? Given the current infection concerns, it could be a while before bus and subway ridership returns to normal. But that doesn’t mean New Yorkers have to hide in their cars or cower at home. “People can walk and socially distance at the same time,” she said. Outside is built for that. Don’t miss: Florida man uses coronavirus aid money to buy a $318,000 Lamborghini A big part of all this, according to Sadik-Khan, is not dismissing fresh possibilities because they’ve never been achieved before. In fact, many of them have — just not in America. “Look at what’s happening right now in London or Paris or Mexico City or Milan,” she said. “The streets are the first places to reopen. People are really hungry to come back to normal, a new normal at least. And that means being outside.” “There is so much more we can do to repurpose the 6,000 miles of streets in New York City to make them work better, even if it takes a long time before people feel safe getting around the way they used to,” she said. “Cities have recovered from all kinds of adversity. London after World War II, New York City after 9/11. Cities come back better than ever. People are still scared now, but cities have always been more resilient than a lot of people expect.” The coronavirus is just the latest challenge. “The real issue is not bringing cities back,” she said. “It’s learning a new language of the possible and being resilient enough to deal with the next crisis when it comes.” Ellis Henican is an author based in New York City and a former newspaper columnist."}]}