{"article": [{"url": "https://www.marketwatch.com/story/economy-needs-more-certainty-which-can-only-come-from-washington-says-the-best-forecaster-of-the-month-11599848870", "published": 1600073420.0, "headline": "Economy needs more certainty, which can only come from Washington, says the best forecaster of the month", "body": "Much of the economic growth we're experiencing is merely picking the low-hanging fruit. The big challenges remain. AFP via Getty Images The U.S. economy is doing “as good or better than expected” in the third quarter, but risks are building for a setback in the fourth quarter if the government doesn’t provide more stimulus and certainty, says Spencer Staples, chief economist for EconAlpha and the winner of the Forecaster of the Month contest for August. “The pandemic, as tragic as it is, has been an eye-opener,” he says. “It isn’t a structural problem; it is a health issue.” If the Congress and the White House can’t provide more certainty about the pandemic and the economy, he could see economic growth struggling again by the end of the year and beyond. The recovery so far has mostly been a matter of picking the “low-hanging fruit,” he says. “There is still a lot of dislocation here.” The economy faces a massive output gap that will take years to close, he says. Meanwhile, society confronts what he calls “national imperatives” to address simultaneous challenges of the demographic time bomb, urgent environmental problems, and a widening gap between the haves and the have-nots. More on the winner: If you trade on economic data, listen to Spencer Staples Staples says his small independent research firm generally avoids politics, but he believes this is one of those times when the free market can’t create the self-sustaining economy we need. “There are times we need targeted government programs,” he says. “We’ve come to that point.” He thinks a “centrist administration” could restore bipartisan confidence for businesses and households. Staples has won our monthly contest seven times, and was the winner of the Forecaster of the Year contest in 2010, the last person not named Jim O’Sullivan to win that honor. In this year’s standings, Staples is in fourth place. Staples judges his forecasts on whether he’s closer than the consensus of his peers. In August, he was closer to the Bloomberg consensus on seven of the 10 indicators we track. Two of his forecasts—housing starts and durable goods orders—were the most accurate in our contest. The runners up in the August contest were Jim O’Sullivan of TD Securities, Christophe Barraud of Market Securities, Daniel Ahn’s team at BNP Paribas, and Michael Feroli of JP Morgan. The MarketWatch median consensus published in our Economic Calendar includes the predictions of the 15 forecasters who have earned the most points in our contest over the past 12 months, plus the forecast of the most recent winner of the monthly contest. The economists participating in our consensus forecast: Jim O’Sullivan of TD Securities, Christophe Barraud of Market Securities, Seth Carpenter’s team at UBS, Andrew Hollenhorst’s team at Citigroup, Ryan Sweet of Moody’s Analytics, Stephen Gallagher at Société Générale, Spencer Staples of EconAlpha, Jan Hatzius’s team at Goldman Sachs, Michelle Meyer’s team at Bank of America, Jay Bryson’s team at Wells Fargo, Brian Wesbury and Bob Stein at First Trust Advisors, Lou Crandall of Wrightson ICAP, James Sweeney’s team at Credit Suisse, Robert Brusca of Fact and Opinion Economics, and Ian Shepherdson of Pantheon Macroeconomics."}]}