{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-inch-higher-as-wall-street-investors-search-for-fresh-stock-market-spark-2020-08-17", "published": 1597683680.0, "headline": "Nasdaq books record close, Dow ends lower as Wall Street investors await fresh spark", "body": "U.S. stock benchmarks finished mostly higher Monday, with the S&P 500 index ending near record territory, despite a congressional stalemate over fresh stimulus to help Americans and businesses hurt by the coronavirus pandemic. How did major indexes fare? The Dow Jones Industrial Average DJIA, +0.56% fell 86.11 points, or 0.3%, to end at 27,844.91, or 5.8% away from its all-time record close. The S&P 500 index SPX, +0.87% rose 9.14 points, or 0.3%, closing at 3,381.99, only 0.1% away from its record closing peak at 3,386.15. The Nasdaq Composite Index COMP, +1.39% added 110.42 points, or 1%, finishing at 11,129.73, while booking its 33rd record close of the year. Read:If history repeats, the stock market will set a new high by the end of August On Friday, the Dow gained 1.8% for the week, the S&P 500 booked a weekly advance of 0.6%. Friday’s gain turned the Nasdaq barely positive for the week, up 0.1%. What drove the market? The tech-heavy Nasdaq set a fresh record close Monday, even as strategists say a broader market rally outside of high-flying technology stocks likely will be needed for the S&P 500 to make a sustained push above its prior record. “Today we’re still looking at this headwind around another fiscal package being passed, and some skepticism about that getting done,” said Joe Quinlan, head of chief investment office market strategy at Merrill and Bank of America Private Bank, in an interview. “But the key is breadth,” he said. “We want to see that improve.” Moves for the equity market come against the backdrop of failed negotiations between Democrats and Republicans centered on advancing a new package of aid to help laborers affected by the COVID-19 pandemic after $600 a week in unemployment assistance were halted at the end of last month. “While aid for state and local governments and enhanced unemployment aid remain the most contentious issues, funding for the USPS ahead of mail-in voting has emerged as a new issue,” Mark Hackett, chief of investment research at Nationwide, wrote in a note. With the U.S. Postal Service now in the spotlight, House Democrats on Monday said they would vote Saturday on a bill to bar operational changes at the agency that could slow mail service ahead of the Nov. 3 election, while injecting it with $25 billion in additional funding. Despite tensions in Washington, some on Wall Street remain hopeful that a V-shaped, or quick and powerful, recovery still can be achieved, particularly if the coronavirus can be contained across the U.S. “There’s enough fiscal stimulus in the pipeline that we think the economy continues to heal in the third and fourth quarters,” Quinlan said. The U.S. reported just over 42,000 new COVID-19 cases for Sunday, down from a one-week average of 51,523 daily cases, according to New York Times data. The nation’s total number of cases surpassed 5.4 million, about a quarter of the worldwide total. Elsewhere on Monday, New Zealand, where the outbreak has been under control for much of the pandemic, delayed its elections by about a month after an outbreak in Auckland put a third of voters into lockdown. Much of Wall Street also plans to tune into the Democratic National Convention, which begins Monday mostly as a virtual event, for more clues about what policy initiatives could be in play for markets if a Biden administration were to prevail and take over the White House. “The market is telling you it’s expecting the current administration to stay in place,” Jason Ader, chief executive officer at SpringOwl Asset Management, told MarketWatch. But he also thinks that if the probability of a Democratic administration gains momentum, “the lower the stock market will go.” In economic reports, a reading on business conditions in the New York area, the Empire State index, fell 13.5 points to 3.7 in August, signaling a slower pace of growth, the regional Fed bank said Monday. Economists had expected a reading of 17, according to a survey by Econoday. The index had surged in July after being in negative territory since the pandemic began. Separately, a report on home-builder confidence was much stronger than expected. Builder confidence in the newly built, single-family home market jumped six points to 78 in August on the National Association of Home Builders/Wells Fargo Housing Market Index, with the reading hitting the highest level on record for the report. Builder sentiment plunged to 30 in April. A reading above 50 is considered upbeat. Which stocks were in focus? Tesla Inc.’s stock TSLA, +1.89% climbed 11.2% Monday, ending above $1,800 for the first time, after analyst Dan Ives at Wedbush raised his price target to $1,900 from $1,800, citing continued signs of accelerating demand in China. Shares of Nvidia Corp. NVDA, -0.54% rose 6.7%, pushing the company’s market cap above $300 billion for the first time ever, after Susquehanna analyst Christopher Rolland raised his price target to a Street high $540 from $450. Shares of JD.com Inc. JD, +2.09% rose 7.9% Monday, after the China-based e-commerce company reported a second-quarter profit and revenue that rose above expectations, as active customer accounts showed continued improvement. Domino’s Pizza Inc. DPZ, -2.50% said Monday that it would hire 20,000 new workers nationwide to fill positions including assistant managers, customer service representatives and pizza makers. Shares rose 2.6% on Monday. Apple stock AAPL, +1.74% fell 0.3% Monday, but its market value still neared $2 trillion, despite its dust-up with “Fornite” developer Epic Games. Rackspace Technology Inc. RXT, -1.99% shares rallied 10.3% Monday following a Reuters report that Amazon.com Inc. AMZN, +3.01% was in early talks to invest in the cloud-technology services company. Novavax NVAX, +0.18% shares gained 6.2% after the company said it’s beginning a Phase 2b clinical trial in South Africa to evaluate the efficacy of NVX-CoV2373, its COVID-19 vaccine candidate. The Bill & Melinda Gates Foundation is providing a $15 million grant toward trial. American Express Co. AXP, +0.26% shares slumped 2.9% after it announced its plans to acquire “substantially all” of Kabbage, a financial technology company that does small-business lending. Amex announced the deal for Kabbage, which includes everything but the company’s pre-existing loan portfolio. Airline stocks fell Monday, following their European counterparts lower, amid concerns around a global spike in COVID-19 cases that pulled shares of American Airlines Group Inc. AAL, +0.34% down 5.3%, United Airlines Holdings Inc. UAL, +0.32% lost 4.9%, Alaska Air Group Inc. ALK, +0.15% dipped 3.8%, Delta Air Lines Inc. DAL, +0.39% slumped 3.2%, while JetBlue Airways Corp. JBLU, -0.07% and Southwest Airlines Co LUV, +1.89% both shed 3.1%. How did other markets trade? In Asia on Monday, China’s CSI 300 index 000300, +2.04% closed 2.4% higher, while Hong Kong’s Hang Seng Index HSI, -0.30% advanced 0.7% and Japan’s Nikkei 225 NIK, -0.11% declined 0.8%. In Europe, the Stoxx 600 Europe Index SXXP, +0.55% wrapped up the session 0.3% higher, while the U.K.’s FTSE 100 UKX, +0.64% finished 0.6% higher. The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% was off 2.5 basis points at 0.683%. Bond prices move inversely to yields. Gold prices for December delivery GCZ20, +2.17% rose 2.5%, to settle at $1,998.70 an ounce. U.S. crude-oil prices US:CLU20 gained 2.1% to finish at $42.89 a barrel. The ICE U.S. Dollar Index DXY, -0.58% , a gauge of the buck against a half-dozen major rivals, was down 0.3% to 92.80."}]}