{"article": [{"url": "https://www.marketwatch.com/story/100-days-of-the-covid-19-pandemic-5-critical-mistakes-that-created-the-biggest-public-health-crisis-in-a-generation-2020-06-18", "published": 1593864320.0, "headline": "5 critical mistakes that created the biggest public-health crisis in a generation", "body": "It’s been more than 100 days since the World Health Organization declared the coronavirus outbreak a pandemic. Several red flags were missed, so what can we learn from those mistakes? The COVID-19 pandemic, which was first identified in Wuhan, China in December, had infected 11,124,651 people globally and 2,808,003 in the U.S. as of Saturday. It had claimed at least 526,003 lives worldwide, 129,476 of which were in the U.S., according to Johns Hopkins University’s Center for Systems Science and Engineering. “Imagine this scenario: It’s October,” said Gregory Poland, who studies the immunogenetics of vaccine response in adults and children at the Mayo Clinic in Rochester, Minn., and is an expert with the Infectious Diseases Society of America. “The seasonal influenza epidemic occurs. COVID-19 comes back. We’re fussing with China. There’s been a glitch with the Moderna MRNA, +0.09% vaccine trials. There’s another incident with police, and now the riots are inflamed because, after all these years, nothing appears to be fixed, and we’re in the middle of a political campaign ahead of the presidential election in November. This does not have good optics to me.” This is the first global pandemic since the AIDS crisis. So what key moments led to this point?1. Coronavirus? It’s not that bad, it’s just like the flu Earlier in the pandemic, there was confusion between influenza and the novel coronavirus. MarketWatch photo illustration/iStockphoto China did not appear to take early, preemptive actions. It was far more reluctant to tell its citizens about the suspected virus in those early days last December. The first known person was reported to have contracted the virus on Dec. 1 in China, according to an article in The Lancet. The early spread of the disease was likely helped by preparations for China’s Lunar New Year holiday, when people traveled to visit relatives. Wuhan mayor Zhou Xianwang said 5 million people had left the city before travel restrictions were imposed ahead of the Lunar New Year. “COVID-19 rapidly spread from a single city to the entire country in just 30 days,” a Feb. 24 paper on the fatality rates of the disease in the peer-reviewed medical journal JAMA found. “The sheer speed of both the geographical expansion and the sudden increase in numbers of cases surprised and quickly overwhelmed health and public-health services in China.” Critics have said that the Chinese government could have done more in those early days to alert authorities to both the existence of COVID-19, the disease caused by the coronavirus SARS-CoV-2, and confirm that human-to-human transmission was likely. Also see: ‘Hundreds of people fled south, storming the night trains’: Italians struggle to adjust to the New Normal amid coronavirus lockdown It may seem like a lifetime ago, given that the U.S. accounts for roughly a quarter of the worldwide fatalities from COVID-19, and there were delays in shutting down the economies of states across the country. But President Donald Trump wrote on Twitter TWTR, -0.23% on March 9, “Last year 37,000 Americans died” from the flu. “Nothing is shut down, life & the economy go on,” Trump added. Just 10 days later, the president made a U-turn on that statement: “Nothing would be worse than declaring victory before victory is won.” He said the virus will “go away” more than a dozen times. The federal government has been criticized for not rolling out testing nationwide sooner. New York Gov. Andrew Cuomo, while praised for preparing hospitals in the face of a lack of equipment, was also criticized for not taking action sooner to prevent the outbreak in New York City. The World Health Organization’s decision to declare COVID-19 a worldwide pandemic on March 11 only confirmed most infectious-disease doctors’ worst fears that this was now a matter of containment rather than prevention. 2. Don’t wear a mask! Everyone should wear masks! Health officials recommend keeping at least six feet between you and the next person in a public space. MarketWatch photo illustration/iStockphoto After two months of obfuscation over the efficacy of face masks and New York City becoming the epicenter of the pandemic in the U.S., the Trump administration, the Centers for Disease Control and Prevention, the WHO and Cuomo, a Democrat, finally agreed on one thing: All Americans should, after all, wear face coverings in public settings. That happened more than a month after the WHO declared the COVID-19 outbreak a pandemic. The public was confused, and some people were upset over the lack of clear messaging. “ After months of obfuscation over the efficacy of face masks, the Trump administration, the CDC, WHO and New York Gov. Andrew Cuomo advised the public to start wearing face masks. ” On Jan. 29, The New England Journal of Medicine said: “There’s evidence that human-to-human transmission has occurred among close contacts since the middle of December.” Yet authorities prevaricated on the efficacy of masks. “The virus is not spreading in the general community,” Nancy Messonnier, director of the National Center for Immunization and Respiratory Diseases, said on Jan. 30. “We don’t routinely recommend the use of face masks by the public to prevent respiratory illness. And we certainly are not recommending that at this time for this new virus.” Previous studies have concluded that face masks have helped reduce contagion by reducing droplets being sprayed into the air during flu season. It may be that they work in a small amount of cases and/or just wearing them helps to promote healthy behaviors. President Trump has resisted the recommendation by public-health officials to wear a mask when he is in public. “You don’t have to do it. I’m choosing not to do it, but some people may want to do it and that’s OK,” he said. The WHO currently estimates that 16% of people are asymptomatic and can transmit the coronavirus and, in a similar U-turn to the CDC, also now advises wearing masks. 3. This malaria drug hydroxychloroquine helps. Or does it? WHO currently estimates that 16% of people are asymptomatic and can transmit the novel coronavirus. Getty Images Since the earliest days of the pandemic in the U.S., Trump promoted hydroxychloroquine as a possible treatment for coronavirus. It was aligned to some degree with research that aims to understand if the controversial drug can prevent coronavirus infections in high-risk frontline workers. Hydroxychloroquine, which is approved by the Food and Drug Administration to treat malaria, lupus and rheumatoid arthritis, is not a proven treatment or prophylaxis for COVID-19, but it received emergency-use authorization (EUA) from the FDA in mid-March to be used in certain clinical settings for COVID-19. “ Since the earliest days of the pandemic, Trump promoted hydroxychloroquine. This week, the FDA withdrew the emergency-use authorization granted to the drug during the COVID-19 pandemic. ” Some health experts say that was an unnecessary distraction that wasted valuable time. On Monday, the FDA said that it had withdrawn the EUA granted to hydroxychloroquine and chloroquine during the COVID-19 pandemic. An EUA is not the same as a FDA approval but is a type of authorization that can be awarded during public health emergencies when there are no other available treatment options. The federal agency issued the EUA in March, allowing some patients with COVID-19 to be treated with the drugs when used from a federal stockpile. Since then, the drugs were increasingly politicized following promotion from Trump administration officials alongside questions about safety. In April, Trump floated the idea of using ultraviolet light inside the human body or disinfectant as treatments for coronavirus, a suggestion doctors called dangerous. “I see the disinfectant, where it knocks it out in a minute. One minute. And is there a way we can do something like that, by injection inside or almost a cleaning? Because you see it gets in the lungs, and it does a tremendous number on the lungs. So it would be interesting to check that,” he said. The suggestion was widely panned, and the next day, the president said he was speaking “sarcastically.” Trump announced a travel ban from hot spots around the world in February and subsequently acquiesced to pressure that states should effectively shut down their economies to prevent the spread of the disease. He repeatedly warned that efforts to stem the rapid spread of COVID-19 were spiraling the economy into another Great Recession. He said last month that it was possible people would die by reopening the economy. “Will some people be affected badly? Yes,” the president said. “But we have to get our country open and we have to get it open soon.” 4. It’s time to have fun and go to the beach, right? Wrong! Some analysts say that Florida could be the next epicenter of the virus as New York continues to flatten the curve of new cases. Getty Images Florida, Alabama, Arizona, California, Nevada, North Carolina, Oklahoma, Oregon, South Carolina and Texas have seen a surge in cases in recent weeks as businesses reopen and people relax their social-distancing policies, and don’t wear masks. “The potential for the virus to take off there is very, very nerve-racking and could have catastrophic consequences,” Jeanne Marrazzo, director of the division of infectious diseases at the University of Alabama at Birmingham, told the CNN. Mike Ryan, the executive director of the WHO’s Health Emergencies Program and a former epidemiologist specializing in infectious disease and public health, warned in May of complacency surrounding relaxation of social-distancing measures. Countries should “continue to put in place the public-health and social measures, the surveillance measures, the testing measures and a comprehensive strategy to ensure that we continue on a downwards trajectory, and we don’t have an immediate second peak,” he said. The Dow Jones Industrial Index DJIA, +0.56% and the S&P 500 SPX, +0.87% were up Friday, after better-than-expected unemployment numbers amid a surge of coronavirus in states that have loosened restrictions. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases for the last three decades, said he was hopeful that a coronavirus vaccine could be developed by early 2021, but said a more infectious strain may have come to the U.S. from Europe. In an interview with the Journal of the American Medical Association on Thursday, Fauci said, “We don’t have a connection between whether an individual does worse with this or not. It just seems that the virus replicates better and may be more transmissible. But this is still at the stage of trying to confirm that.”5. COVID-19 doesn’t care who you will vote for in November Gov. Andrew Cuomo (left), a Democrat from New York, invoked the words of Alexander Hamilton in his war of words with President Trump. Getty Images/MarketWatch Photomontage Wherever you lie on the political spectrum, you can count one thing: The virus does not discriminate. It doesn’t care if you’re an independent, Republican or Democrat. From the seeming unwillingness of China to be more transparent about the seriousness of the disease to the arguments over ventilators between states and the federal government, the response to the virus has been politicized, observers say. Trump said in April that he had “ultimate authority” on when to open the economy: “Tell the Democrat Governors that ‘Mutiny On The Bounty’ was one of my all time favorite movies.” Cuomo shot back, invoking the words of founding father Alexander Hamilton. “ Regardless of where your political stance, the virus does not discriminate. It doesn’t care if you’re Republican or Democrat or Independent. The pandemic has been politicized, observers say. ” The U.S. cannot afford to have a resurgence of the virus either now or in the fall, health professionals say. For one, it’s harder to get people to practice social distancing and stay home again, especially after they’ve already abided by stay-at-home orders for more than 11 weeks. Second, the effect on the economy could push the U.S. into a prolonged recession, even greater than the one already predicted by some economists. Third, the flu season will already be upon us in the winter and those symptoms are easily confused with those of COVID-19. Fourth, only 10% to 20% of the U.S. population at the very most will be immune to COVID-19 next time around, Poland said. But it’s not just politicians who have sparred. The American public has responded differently to the pandemic along political lines: 62% of Republicans and Republican leaners say the seriousness of COVID-19 is “generally exaggerated,” according to one survey, while just 31% of Democrats and Democrat leaners and 35% of independents say the same. “Democrats and Democratic-leaning independents are more likely than Republicans and Republican leaners to say that the coronavirus outbreak is a major threat to both their personal health and financial situation,” Bradley Jones, a research associate at Pew Research Center, wrote in a recent report. Poland recommends a nonpartisan task force, akin to the National Academies of Science, to prepare for any possible second wave. “This would be the kitchen cabinet who would recommend what kind of studies we need to do now,” he said. “I would not waste any of my time sniping politically at anybody else,” he added. “I would be a wartime king, focused on doing everything we can to protect our populace with best practices. I would fund and provide all of the nudges I can to encourage good behavior. I would advocate radical transparent honesty. It would be rocky in the beginning because the public is not used to that kind of transparency, but I think it would very quickly engender trust.” On Thursday, Trump said he was confident the virus was dying out, despite a spike in nearly a dozen states. “If you look, the numbers are very minuscule compared to what it was, it’s dying out,” he said. (Jaimy Lee and Meera Jagannathan contributed to this story.) How COVID-19 is transmitted"}]}