{"article": [{"url": "https://www.marketwatch.com/story/trumps-payroll-tax-order-will-mean-bigger-paychecks-this-year-but-2021-is-a-different-story-2020-09-01", "published": 1599038540.0, "headline": "Trumpâ\u0080\u0099s payroll-tax executive order could mean bigger paychecks this year â\u0080\u0094 but 2021 will be a different story", "body": "Weeks after President Donald Trump authorized a payroll-tax deferral to try to free up cash for Americans dealing with the coronavirus pandemic, the Internal Revenue Service now has specifics about what the order means for companies cutting paychecks and the workers receiving those checks. For a worker whose employer chooses to defer the tax obligation, the upshot is simple: slightly bigger paychecks now and slightly smaller paychecks next year, according to payroll-processing experts who have analyzed the IRS guidance. Workers donâ\u0080\u0099t have to worry about saving money for a lump sum of unpaid taxes, said Pete Isberg, vice president of government relations with the payroll-processing company ADP ADP, +1.93%. “ Employeesâ\u0080\u0099 â\u0080\u0098only obligation is to sort of understand that starting in January, their net pay is going to be a little bit less. So donâ\u0080\u0099t be surprised when that happens.â\u0080\u0099 ” â\u0080\u0094 Pete Isberg, ADP â\u0080\u009cTheir only obligation is to sort of understand that, starting in January, their net pay is going to be a little bit less. So donâ\u0080\u0099t be surprised when that happens.â\u0080\u009d Starting next year, â\u0080\u009cyour check very well will go down, if the tax isnâ\u0080\u0099t forgiven, which is a giant unknown,â\u0080\u009d said Laura Melville, who heads Wiss & Co.â\u0080\u0099s outsourced payroll services. Trumpâ\u0080\u0099s order instructs Treasury Secretary Steven Mnuchinâ\u0080\u0099s staff to consider crafting a bill that would forgive the payroll taxes deferred from September through December, with Trump up for re-election on Nov. 3 and trailing in national and battleground polls. In normal times â\u0080\u0094 when the economy isnâ\u0080\u0099t staggering under a public health crisis â\u0080\u0094 federal payroll taxes take a bit off the top of every paycheck. Specifically, 6.2% of an employeeâ\u0080\u0099s gross earnings go toward Social Security, and 1.45% goes to Medicare taxes. The employer pays the same rate, and that combines for a 12.4% Social Security tax and a 2.9% Medicare tax. (Under the CARES Act, employers donâ\u0080\u0099t have to pay their side of the Social Security tax through the end of the year. They can repay half by next year and the other half by 2022.) With federal lawmakers at loggerheads over another stimulus bill, Trump signed the executive order deferring the employeeâ\u0080\u0099s 6.2% tax obligation for pay between Sept. 1 and the end of the year. He also signed memos that, among other things, greenlighted $300 in supplemental unemployment benefits. When it came to payroll taxes, Trumpâ\u0080\u0099s order said, â\u0080\u009cThis modest, targeted action will put money directly in the pockets of American workers.â\u0080\u009d The tax deferral doesnâ\u0080\u0099t do anything for millions of unemployed who arenâ\u0080\u0099t on payrolls to begin with, according to critics. Others questioned how to put the order into effect. In addition, the negative short- and long-term impacts on the Social Security system of pausing payroll-tax collection have frequently been raised as objections, particularly with Trump on more than one occasion saying the suspension could be made permanent should he be re-elected. Donâ\u0080\u0099t miss:Trump plan to scrap payroll tax would reduce benefits by 2021, top Social Security actuary says Opinion:Trumpâ\u0080\u0099s election-year gamble: Messing with Social Security and Medicare The new IRS guidance isnâ\u0080\u0099t a rebuttal to the skeptics, but it sketches out the orderâ\u0080\u0099s implementation. Here are three key takeaways:Employers are on the hook to pay Itâ\u0080\u0099s up to employers whether theyâ\u0080\u0099ll participate in the tax deferral, Mnuchin has said. But until the guidance came out Friday, there was a question as to who would be responsible for getting the deferred taxes to the feds, Isberg said. Would it be workers reporting the deferral next tax season, or would it be companies doing the deferral? The guidance makes it clear thatâ\u0080\u0099s a job for employers, according to Isberg. â\u0080\u009cThey are going to hang on to the liability and the responsibility for repaying all those taxes,â\u0080\u009d he said. Of course, workers still have to pay their taxes, just later on. If a company is deferring payroll taxes, the paychecks from January 2021 to April 2021 are going to include two deductions: one for the postponed 6.2% payments and one for the payroll-tax payments that resume in January. Isberg didnâ\u0080\u0099t know how many ADP clients are going to suspend payroll tax collection; Melville said her companyâ\u0080\u0099s clients have been leaning away from the deferral. “ â\u0080\u0098In my opinion, to be more conservative, I say continue to hold and remit.â\u0080\u0099 ” â\u0080\u0094 Laura Melville, Wiss & Co. â\u0080\u009cIn my opinion, to be more conservative, I say continue to hold and remit,â\u0080\u009d said Melville, a manager at the accounting and consulting firm headquartered in Florham Park, N.J. â\u0080\u009cBy taking that conservative approach, itâ\u0080\u0099s less of a headache down the road, I think.â\u0080\u009d What are eligibility rules and when does the tax deferral start? Suppose your company decides to defer the tax. If you make less than $4,000 gross on a biweekly basis, youâ\u0080\u0099ll see a bump for now in your paycheck. On an annual basis, someone meets the deferral threshold if they make less than $104,000. There are nine more biweekly pay periods between now and the end of the year, Iseberg said. That comes to $36,000 in before-tax earnings for someone making $104,000. The 6.2% portion comes to $2,232. Commissions and year-end bonuses are also subject to the deferral, he noted. The deferral is forward-looking, Isberg said. For example, he confirmed, if a company pauses payroll-tax collection in October, it canâ\u0080\u0099t retroactively lump money from September tax payments. The IRS guidance is also noteworthy for what it doesnâ\u0080\u0099t say The guidance doesnâ\u0080\u0099t say one way or another what happens if a company decides to participate, but its employees donâ\u0080\u0099t want to, Isberg said. â\u0080\u009cEmployees are going to have an opinion, right? Thereâ\u0080\u0099s some that will want to do it and some who will absolutely not.â\u0080\u009d Companies going with the deferral are going to have to explain to staff how the arrangement will work, Isberg and Melville said. An IRS spokeswoman declined to comment beyond the guidance issued last week. Even though the IRS guidance is silent on the matter, companies should be able to explain to staff which course they are taking, Melville said. â\u0080\u009cThey should be ready to answer questions, because they are going to get them.â\u0080\u009d"}]}