{"article": [{"url": "https://www.marketwatch.com/story/this-is-the-height-of-irresponsibility-doctors-react-to-trumps-motorcade-outside-walter-reed-to-wave-at-supporters-2020-10-05", "published": 1601894480.0, "headline": "Hereâ\u0080\u0099s what doctors are saying about Trumpâ\u0080\u0099s motorcade outside Walter Reed to wave at supporters", "body": "President Donald Trump drove by cheering supporters in a motorcade Sunday evening, waving from the back seat while wearing a black mask and giving the crowd a thumbs-up â\u0080\u0094 but medical professionals, including an attending physician at Walter Reed medical center, were quick to criticize the move. â\u0080\u009cWeâ\u0080\u0099re getting great reports from the doctors,â\u0080\u009d Trump said in an earlier video on Twitter TWTR, -0.23% Â while standing and appearing upbeat. â\u0080\u009cThis is an incredible hospital, Walter Reed. The work they do is just absolutely amazing, and I want to thank them all.â\u0080\u009d Trump, 74, was moved from the White House to Walter Reed National Military Medical Center late Friday, the same day that he and First Lady Melania Trump announced they had tested positive for coronavirus. His medical regimen highlighted how the president is in a high-risk group for more serious illness from COVID-19. “ â\u0080\u0098Every single person in the vehicle during that completely unnecessary Presidential â\u0080\u009cdrive-byâ\u0080\u009d just now has to be quarantined for 14 days.â\u0080\u0099 ” â\u0080\u0094 James Phillips, a doctor of emergency medicine at George Washington University and attending physician at Walter Reed Fox News journalist Lou Dobbs tweeted his support for the president, if not for his decision to leave the hospital. â\u0080\u009cGotta love our President! A bad patient, but a great leader,â\u0080\u009d Dobbs wrote. James Clapper, a former director of national intelligence, speculated to CNN that Trump is likely concerned about optics, particularly given that heâ\u0080\u0099s in the middle of an election campaign. â\u0080\u009cLetâ\u0080\u0099s hope this comports with his rate of improvement,â\u0080\u009d he said. However, James Phillips, a doctor of emergency medicine at George Washington University who is also an attending physician at Walter Reed, tweeted his dismay at the president leaving his hospital room to greet supporters from his motorcade. â\u0080\u009cEvery single person in the vehicle during that completely unnecessary Presidential â\u0080\u0098drive-byâ\u0080\u0099 just now has to be quarantined for 14 days,â\u0080\u009d he said. â\u0080\u009cThey might get sick. They may die. For political theater. Commanded by Trump to put their lives at risk for theater. This is insanity.â\u0080\u009d Phillips added in a subsequent tweet: â\u0080\u009cThat Presidential SUV is not only bulletproof, but hermetically sealed against chemical attack. The risk of COVID19 transmission inside is as high as it gets outside of medical procedures. The irresponsibility is astounding. My thoughts are with the Secret Service forced to play.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } Jonathan Reiner, the director of the Cardiac Catheterization Laboratory at the George Washington University Hospital and a professor of medicine at GWU Medical Center, also expressed concern at the president leaving the hospital in light of his condition. â\u0080\u009cIn the hospital when we go into close contact with a Covid patient we dress in full PPE: Gown, gloves, N95, eye protection, hat. This is the height of irresponsibility,â\u0080\u009d he said. Trump was given a dose of Regeneron Pharmaceuticals Inc.â\u0080\u0099s REGN, +0.36% Â experimental neutralizing antibody cocktail, in addition to Gilead Sciences Inc.â\u0080\u0099s GILD, +0.82% Â remdesivir. The president also received supplemental oxygen at least once, and dexamethasone, Dr. Sean Conley, Trumpâ\u0080\u0099s physician, said Sunday. Dexamethasone is a common steroid that has demonstrated in clinical trials in the U.K. that it can reduce mortality in severely ill COVID-19 patients. “ â\u0080\u0098Gotta love our President! A bad patient, but a great leader.â\u0080\u0099 ” â\u0080\u0094 Fox News journalist Lou Dobbs Asked by a reporter at a news conference outside Walter Reed on Sunday why he appeared to underplay certain aspects of the presidentâ\u0080\u0099s condition, Conley replied, â\u0080\u009cThatâ\u0080\u0099s a good question. So I was trying to reflect the upbeat attitude that the team, the president, that his course of illness has had. I didnâ\u0080\u0099t want to give any information that might steer the course of illness in another direction and, in doing so, it came off that weâ\u0080\u0099re trying to hide something, which wasnâ\u0080\u0099t necessarily true.â\u0080\u009d He added, â\u0080\u009cThe fact of the matter is that heâ\u0080\u0099s doing really well. ... He is responding, and as the team said, if everything continues to go well, weâ\u0080\u0099re going to start discharge planning back to the White House.â\u0080\u009d Dexamethasone is a type of corticosteroid that has been considered a treatment only for severely ill COVID-19 patients. â\u0080\u009cCorticosteroids also appear to be associated with benefit among critically ill patients with COVID-19 whether they are receiving mechanical ventilation or oxygen without mechanical ventilation,â\u0080\u009d researchers wrote in September in a JAMA editorial. Still, Trump appeared upbeat in his Twitter video address Sunday evening. Observers said it could indeed be an indication of his improved condition, or a temporary boost of energy from steroids he has received. Health professionals caution of the perniciousness of COVID-19, which they say is unpredictable and can leave the patient feeling up one day, but much worse the next. See Trumpâ\u0080\u0099s motorcade outside Walter Reed: iframe.twitter-tweet { width: 100% !important; } For his part, the president said he wanted to show his gratitude to his supporters. â\u0080\u009cIâ\u0080\u0099ve also gotten to meet some of the soldiers and first responders, and what a group,â\u0080\u009d Trump said during his video statement Sunday. â\u0080\u009cI also think weâ\u0080\u0099re going to pay a little surprise to some of the great patriots we have on the street, and theyâ\u0080\u0099ve been out there for a long time.â\u0080\u009d â\u0080\u009cTheyâ\u0080\u0099ve got Trump flags and they love our country, and Iâ\u0080\u0099m not telling anybody but you, but Iâ\u0080\u0099m about to make a surprise visit so perhaps Iâ\u0080\u0099ll get there before you get to see me,â\u0080\u009d he added. Also Sunday, Trump said he was learning a lot about COVID-19 during his stay at Walter Reed. â\u0080\u009cItâ\u0080\u0099s been a very interesting journey. Iâ\u0080\u0099ve learned a lot about COVID. I learned it by really going to school,â\u0080\u009d he said. â\u0080\u009cThis is the real school. This isnâ\u0080\u0099t the â\u0080\u0098Letâ\u0080\u0099s read the bookâ\u0080\u0099 school, and I get it and I understand it, and itâ\u0080\u0099s a very interesting thing and Iâ\u0080\u0099m going to be letting you know about it.â\u0080\u009d Related: Hereâ\u0080\u0099s how Trumpâ\u0080\u0099s positive coronavirus test has shaken up the campaign â\u0080\u0094 plus what could happen next Dr. Sean Conley, physician to President Donald Trump, briefs reporters at Walter Reed National Military Medical Center in Bethesda, Md., Oct. 3. Trump was admitted to the hospital after contracting the coronavirus. (Photo: Susan Walsh/AP.) COVID-19 has now infected 35 million people worldwide As of Monday, COVID-19 had killed at least 1,037,122 people worldwide and 209,725 in the U.S., according to data aggregated by Johns Hopkins University. The U.S. still has the worldâ\u0080\u0099s highest number of COVID-19 cases (7,418,107), just ahead of India (6,623,815) and Brazil (4,915,289). Worldwide, there have been at least 35,163,114 confirmed cases, a figure that mostly does not account for asymptomatic cases. Several companies in the U.S. and overseas are working on a vaccine. AstraZeneca AZN, +1.16% Â , in combination with Oxford University; BioNTech SE BNTX, +1.23% Â and partner Pfizer PFE, -0.27% ; GlaxoSmithKline GSK, +1.10% ; Johnson & Johnson JNJ, +1.39% ; Merck & Co. MERK, +1.59% ; Moderna MRNA, +0.09% ; and Sanofi SAN, -1.48% Â are among those working to get a vaccine through trials, in the hope one will be ready in and/or by 2021. The Dow Jones Industrial Index DJIA, +0.56%, the S&P 500 SPX, +0.87% Â and the Nasdaq Composite COMP, +1.39% all rose at the start of Mondayâ\u0080\u0099s trade as investors tracked Trumpâ\u0080\u0099s response to COVID-19 treatment after his hospitalization and weighed prospects for agreement on another round of stimulus."}]}