{"article": [{"url": "https://www.marketwatch.com/story/how-apples-stock-split-will-change-the-pecking-order-in-the-124-year-old-dow-industrials-11596148180", "published": 1598285120.0, "headline": "Here's how Apple's stock split will change the pecking order in the 124-year old Dow industrials", "body": "Apple Inc. is planning a 4-for-1 stock split and it has important implications for the Dow Jones Industrial Average, of which it is a key component. The iPhone maker late last month announced that its board approved the stock split. The split, intended to make Apple \"more accessible to a broader base of investors,\" will impact owners of record as of Aug. 24 and Apple's shares AAPL, +1.74% will trade on a split-adjusted basis on Aug. 31. Apple was trading around $506 on Monday, which would mean it would trade at about $126.50 a share. Because the Dow DJIA, +0.56% is a price-weighted index, the scheduled split at the end of next month means that Apple will move from the most influential component of the 30-member blue-chip index to perhaps the middle of the pack among its components, depending on how the divisor is calculated. The Dow's price-weighting means the value of the stock gauge is determined by the price changes of its components, rather than percentage changes. The overall value of the index is computed by adding the price of the components and dividing by the so-called Dow divisor, which currently stands at 0.14744568353097. That means that every dollar move of a company translates to a 6.78-point swing in the 124-year-old benchmark. The divisor accounts for stock splits, so in that way Apple's 4-for-1 split will alter its own influence on the benchmark and the divisor by which the index is determined. The divisor is calculated by S&P Dow Jones Indices, which owns the Dow indexes. UnitedHealth Group Inc. UNH, +1.68%, which was trading at $309.07 on Monday, could become the most influential member of the Dow at the end of August. Home Depot Inc. HD, +0.49% is currently the third-priciest stock in the Dow, at $285.85. Apple has been the largest, and therefore the most influential, Dow component since April 29, according to Dow Jones Market Data. Other indexes, including the S&P 500 index SPX, +0.87% and the Nasdaq Composite Index COMP, +1.39%, are market-capitalization weighted, therefore they are impacted by the overall value of their components. Apple currently stands as the biggest company by market cap, boasting a value of more than $2.163 trillion, according to FactSet data. Microsoft MSFT, +2.48% ranks No. 2 at $1.615 trillion, while Amazon.com Inc AMZN, +3.01% is the third-most highly valued U.S. company at $1.658 trillion. It is for that reason that the large-capitalization components have had an outsize impact on returns for the broader market, excluding the Dow, since stocks hit their recent nadir in late March. For example, the price-weighted Dow has gained 52% since its March 23 low, while the S&P 500 has returned 53% and the Nasdaq has climbed 66% over the same period. Apple became a Dow member back in March 2015. Back then, AT&T T, -1.01% was taken out in exchange for the Cupertino, Calif.-based technology behemoth. Share splits in Dow components, and of other major companies, aren't unheard of but it has become less come over the past decades, as this Wall Street Journal notes. The last one was Nike Inc. NKE, +0.97%, who announced a 2-for-1 stock split back in December 2015. Apple last split its stock in June of 2014, when it completed a 7-for-1 stock split ahead of its inclusion in the Dow. Apple's stock-split announcement came after the company brushed off the COVID-19 crisis to report record results Thursday. The company posted fiscal third-quarter net income of $11.25 billion, or $2.58 a share, up from $10.04 billion, or $2.18 a share, in the year-prior quarter. Analysts surveyed by FactSet had been anticipating $2.05 a share."}]}