{"article": [{"url": "https://www.marketwatch.com/story/oregon-sues-trump-administration-as-unrest-and-clashes-continue-in-portland-2020-07-19", "published": 1595173700.0, "headline": "Oregon sues Trump administration as unrest and clashes continue in Portland", "body": "PORTLAND, Ore. (AP) — Oregon’s attorney general is seeking an order to stop federal agents from arresting people in Portland as the city continues to be convulsed by nightly protests that have gone on for seven weeks and have now pitted local officials against the Trump administration. Federal agents, some wearing camouflage and some wearing dark Homeland Security uniforms, used tear gas at least twice to break up crowds late Friday night, the Oregonian/OregonLive reported. Demonstrations against systemic racism and police brutality have happened every day in Oregon’s largest city since Minneapolis police killed George Floyd on May 25. At 10 p.m. Saturday, several hundred peaceful demonstrators against police brutality rallied in front of downtown’s Multnomah County Justice Center and the Edith Green-Wendell Wyatt Federal Building, which has a newly built fence around it. President Donald Trump has decried the disorder, and Homeland Security Secretary Chad Wolf blasted the protesters as “lawless anarchists” in a visit to the city. See:Mayor of Portland to Trump: Get your troops out of the city Before the aggressive language and action from federal officials, the unrest had frustrated Mayor Ted Wheeler and other local authorities, who had said a small cadre of violent activists were drowning out the message of peaceful protesters in the city. But Wheeler said the federal presence in the city is now exacerbating a tense situation and he has told them to depart. “Keep your troops in your own buildings, or have them leave our city,” Wheeler said Friday. Oregon Attorney General Ellen Rosenblum late Friday sued Homeland Security and the Marshals Service in federal court. The complaint says that unidentified federal agents have grabbed people off Portland’s streets “without warning or explanation, without a warrant, and without providing any way to determine who is directing this action.” Rosenblum said she was seeking a temporary restraining order to “immediately stop federal authorities from unlawfully detaining Oregonians.” “The current escalation of fear and violence in downtown Portland is being driven by federal law enforcement tactics that are entirely unnecessary,” Rosenblum said in a statement. The administration has enlisted federal agents, including the U.S. Marshals Special Operations Group and an elite U.S. Customs and Border Protection team based on the U.S.-Mexico border, to protect federal property. But Oregon Public Broadcasting reported this week that some agents had been driving around in unmarked vans and snatching protesters from streets not near federal property, without identifying themselves. Tensions also escalated after an officer with the Marshals Service fired a less-lethal round at a protester’s head on July 11, critically injuring him. House Speaker Nancy Pelosi and U.S. Rep. Earl Blumenauer, D-Oregon, issued a joint statement Saturday denouncing the Trump administration’s actions. “We live in a democracy, not a banana republic. We will not tolerate the use of Oregonians, Washingtonians –- or any other Americans -– as props in President Trump’s political games. The House is committed to moving swiftly to curb these egregious abuses of power immediately,” they said. On Friday night, hundreds of people gathered for a vigil outside the downtown Justice Center, which is sandwiched between two federal buildings, including a courthouse, The Oregonian/OregonLive reported. Across the street, dozens of other protesters entered two recently closed city parks after dismantling chain-link fencing that blocked access. Federal agents emerged from an office building next door and used impact munitions, stun grenades and tear gas to clear the area, the news organization reported. It said its journalists did not observe any incident that might have prompted the use of the weapons. Federal officers deployed tear gas again just before midnight after a few protesters placed dismantled fencing in front of plywood doors covering the entrance of the federal courthouse. Early Saturday, Portland police declared the gathering unlawful, saying protesters had piled fencing in front of the exits to the federal courthouse and the Multnomah County Justice Center and then shot off fireworks at the Justice Center. Federal officers and local police then advanced simultaneously on the demonstrators to clear the streets, making arrests as protesters threw bottles and pieces of metal fence at police, the Portland Police Bureau said. Portland Police Chief Chuck Lovell told reporters Friday that his officers are in contact with the federal agents, but that neither controls the others’ actions. The overnight action by Portland’s police was condemned by a prominent member of the City Council. On Saturday Jo Ann Hardesty said local police “joined in the aggressive clampdown of peaceful protest.” Hardesty, who said she was downtown speaking at the protest Friday night, slammed Wheeler, telling the mayor he needed to better control local law enforcement. Hardesty, who oversees the city’s fire department and other first-responder agencies, said in an open letter to Wheeler if “you can’t control the police, give me the Portland Police Bureau.” In a statement Saturday, Portland Police said as they responded to the overnight protests — which included people throwing projectiles at them — some federal agencies took action “under their own supervision and direction.” Portland Police said city officers arrested seven people, and one officer sustained a minor injury. The statement said the city’s police supports peaceful protests, and beginning Saturday night Department of Homeland Security police won’t work in the Portland Police incident command center."}]}