{"article": [{"url": "https://www.marketwatch.com/story/gaps-in-the-cdcs-eviction-ban-could-leave-some-renters-homeless-housing-advocates-say-2020-09-04", "published": 1599547220.0, "headline": "Gaps in the CDC's eviction ban could leave some renters homeless, housing advocates say", "body": "The U.S. Centers for Disease Control and Prevention has issued a historic nationwide ban on evictions, but ambiguous language in the order leaves open the possibility that renters could still be forced to leave their homes during a global pandemic, housing advocates say. The CDC's moratorium went into effect immediately when it was announced on Tuesday and will remain in place until Dec. 31. Altogether, Treasury Secretary Steven Mnuchin said, the moratorium should protect some 40 million renters nationwide. (For more information on how renters can access the protections provided by the CDC's eviction ban, click here.) The CDC's order specifically prohibits people from being evicted from rental units for nonpayment of their rent. However, there are still a range of scenarios where a tenant could be kicked out of their home. \"The overall spirit of the order is designed to protect public health and keep people from being evicted except for reasons of misconduct,\" said Eric Dunn, director of litigation at the National Housing Law Project. \"But the order's very ambiguous about how some of those situations would work.\" The moratorium carves out some exceptions for landlords: Tenants can still be evicted for engaging in criminal activity on the premises, threatening the health or safety of other residents, damaging the property or violating any other contractual obligation of the rent. Read more: California eviction moratorium is 'a real nightmare' for renters to understand - here's what you need to know But it's not clear what a landlord can do, for instance, if a renter's lease is set to expire, but the property's owner doesn't want to renew with them. If a tenant were to remain on the property past the period of their original lease, they would technically be violating the terms of the contract, Dunn said, which would mean the landlord could technically still have the right to evict them. \"It leads to an absurd result,\" Dunn said. \"You're in a Catch-22 where in order to comply with your lease to avoid being evicted you need to the leave the property.\" “ 'The overall spirit of the order is designed to protect public health and keep people from being evicted except for reasons of misconduct.' ” - Eric Dunn, director of litigation at the National Housing Law Project Also unclear is how the law applies for people without a formal lease agreement. This has become a concern in New York State in particular. The state currently has its own moratorium on eviction that covers people who have verbal agreements or month-to-month arrangements with landlords, protecting them from being evicted for not paying their rent in full. Many people nationwide may also be subtenants who are not on the original lease and don't have a direct relationship with the property's landlord, or a lease may only have one of multiple roommates officially listed. Additionally, the order explicitly exempts hotels and motels from abiding by its rules. Nationwide, though, many low-income individuals live in extended-stay hotels or motels as if they were apartments, Dunn said. \"A lot of people in different parts of the country don't have written leases,\" said Ellen Davidson, a staff attorney at the Legal Aid Society in New York. \"It's just not clear from the order whether those tenants would be protected.\" The CDC's order states that in cases where a state or municipality has its own eviction ban that provides as much or more protection as the national order, the nationwide moratorium will not apply. New York's moratorium is set to expire on Sept. 30 - as a result, Davidson said she and other advocates are pushing for the state to extend its own moratorium given that it offers more protection. Whether renters are safe to stay in their homes in these various scenarios not explicitly mentioned in the CDC's directive will come down to judges. The national moratorium does not explicitly prevent eviction filings from occurring - though landlords who evict tenants who were covered by the moratorium could face criminal penalties including jail time if those people become sick with COVID-19. \"There will be courts all across this country all making this determination,\" Davidson said. \"It's a big country out there with lots of different courts at every level. It would not surprise me that some places in this country would not want to follow a federal rule.\" Another concern is what might happen in a situation where landlords face foreclosure themselves. Many small landlords across the country are facing severe financial challenges as a result of tenants not being able to pay rent. Moratoria like the CDC's order could make matters worse, because the policy was not immediately accompanied with extra funding for emergency rental assistance. “ Many low-income Americans live in hotels and motels, but the CDC's order exempts those businesses from the temporary ban on evictions. ” During the housing crisis that preceded the Great Recession, many Americans suddenly faced eviction when their landlord went into foreclosure. Today, renters do have more protections. In 2018, President Trump signed into law a permanent extension of the Protecting Tenants at Foreclosure Act. This law allow renters to remain in homes for at least 90 days or the remaining term of the lease if the property goes into foreclosure. But after those 90 days, tenants could face significant challenges securing safe and affordable housing, particularly if they are unemployed or were unable to pay rent for many months because of the pandemic. Ultimately, the CDC's nationwide eviction ban is not a permanent solution, housing and legal experts said. \"It does not actually prevent evictions - it delays them,\" said Diane Yentel, CEO and president of the National Low Income Housing Coalition. \"It buys some time for the actual solution, which is emergency rental assistance.\""}]}