{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-death-tally-approaches-1-million-us-deaths-near-200000-2020-09-21", "published": 1600702220.0, "headline": "Coronavirus update: Global death tally approaches 1 million, U.S. deaths near 200,000", "body": "The number of deaths as a result of the coronavirus that causes COVID-19 rose closer to 1 million globally, and neared 200,000 in the United States on Monday, amid growing concerns that a new surge in cases is being masked by political rhetoric. The concerns come amid recent reports that the U.K. is considering a second nationwide lockdown, and as data aggregated by Johns Hopkins University showed that new coronavirus cases have increased in about two-thirds of the states in the U.S. Worries about the new surge in cases helped weigh on the stock market, as the Dow Jones Industrial Average DJIA, +0.56% sank 664 points, or 2.4%, in afternoon trading, and the S&P 500 index SPX, +0.87% slid 1.9%. See Market Snapshot. Meanwhile, President Donald Trump last week contradicted comments made by his administration’s health experts regarding the timing of when a vaccine might be available, and the Centers for Disease Control and Prevention had to reverse course on new testing guidelines after the New York Times reported that the new guidelines were actually written by the Trump administration and not CDC scientists. An ABC/News/Ipsos poll released Sunday showed that 69% of Americans surveyed don’t have confidence in the president’s claims regarding a virus, with 53% saying they have no confidence at all, and only 9% saying they have a great deal of confidence in Trump’s claims. Admiral Brett Giroir, the White House coronavirus testing czar, went on CNN’s “State of the Union” on Sunday to try to assure the public that the U.S. response to the coronavirus won’t be politicized, that when a vaccine is made available that it will be safe and to pound home the point the Americans should wear masks. “Biology is independent of politics,” Giroir told host Jake Tapper. “[A]ll of the docs, all the public health experts, all of us are really unanimous that it’s important to wear a mask when you cannot physically distance.” When pressed by Tapper about how effective that message might be, when the indoor political rallies held by President Trump don’t require people to wear masks, despite state mandates, Giroir said, “I just want to repeat what I said, we always encourage the wearing of a mask.” He said that wearing a mask was “critical” to preventing the spread of the coronavirus. “This needs to be echoed from the local, from the state, from the public, and certainly all of us on the task force want to make sure people understand that.” Regarding the contradictions in the timing of when a vaccine will be available, Giroir didn’t quite use the phase “alternative facts,” but he did say: “Everybody is right, but they’re talking about different aspects.” He said the availability of a vaccine depends only on the evidence and the science. And until the science says there is a vaccine that is safe and efficacious, the process of making it available can’t get started. “So right now, we do not have a safe and effective vaccine,” Giroir said. “I just want to assure the American people that when a vaccine is authorized by the [Food and Drug Administration], it will be based on science and data.” In other news: • The “Healthy Sail Panel” formed by Royal Caribbean Group and Norwegian Cruise Line Holdings Ltd. submitted its recommendations to the CDC, in response to a request for public comment that will be used to inform health guidance and preventive measures related to travel on cruise ships. The panel’s report, which is more than 65 pages, includes 74 detailed “best practices” to protect the health and safety of guests, crew and the communities where cruise ships sail. Recommendations include testing, the use of face coverings and enhanced sanitation procedures, on board the cruise ships and in the terminals “The Healthy Sail Panel spent the last four months studying how to better protect the health and safety of guests and crew aboard cruise ships,” said Dr. Scott Gottlieb, co-chair of the panel and former commissioner of the Food and Drug Administration. “Taken as a comprehensive approach, we believe the panel’s robust public health recommendations will help inform strategies for a safe resumption of sailing.” Meanwhile, on CBS’s “Face the Nation” on Sunday, Gottlieb said he thinks there will be “one more cycle” with the virus heading into the fall and winter. • Iowa’s largest school system faces crippling bills because of a dispute with Republican Governor Kim Reynolds, who issued an order requiring the state’s school districts to hold at least half their classes in-person rather than online, the Associated Press reported. That’s because the Des Moines school board voted again last week to violate the order. If the district is out of compliance, the state could require the district to keep students in classes until the end of June, nearly a month later than usual; a district official said each additional day would cost about $1.5 million, which would drain reserves within days. New York City schools reopen Monday for pre-K students and children with advanced disabilities. The rest of the students will start online, and have the option to return to classrooms over the next few weeks. Iowa is a state in which new cases are rising, with 606 new cases in a day at last count, JHU data show. In addition, Iowa has among the highest ratios of tests that have positive results at 14.9% this week, compared with the World Health Organization’s guidelines that positivity rates should stay below 5%. New York’s daily cases rose in the past week, with 862 in the past day, but the percent of positive tests was among the lowest at 0.9%. • There is some renewed hope that rheumatoid arthritis drugs, like Eli Lilly & Co.’s LLY, +2.20% and Incyte Corp.’s INCY, +3.19% Olumiant and Roche Holding AG’s ROG, +1.80% Actemra, can be possible COVID-19 treatments, after a series of clinical setbacks this summer had seemed to close the door on the possibility, as MarketWatch’s Jaimy Lee reports.Latest tallies There are now 31.17 million confirmed cases of COVID-19 globally, the Johns Hopkins data show, and 962,046 people have died. At least 21.29 million people have recovered. The U.S. has the highest tallies in the world with 6.83 million cases and 199,660 deaths, but only the third highest recoveries at 2.59 million. On Sunday, 36,401 new cases were reported in the U.S., while the daily average over the past week was 41,101 cases, up 1% from the average two weeks earlier, according to data from the New York Times. There have been 33 states that have recorded an increase in cases in the past week, up from 11 states the week before, according to JHU data. Brazil has the second highest death toll at 136,895 and third highest case tally at 4.54 million. India is third with 87,882 deaths and second with 5.49 million cases. Mexico is fourth with 73,493 deaths and seventh with 697,663 cases. The U.K. has 41,877 deaths and 396,754 cases, the highest death toll in Europe and fifth highest in the world. China, where the illness was first reported late last year, is 41st with 90,376 cases and 30th with 4,737 fatalities, according to its official numbers."}]}