{"article": [{"url": "https://www.marketwatch.com/story/is-the-great-rotation-in-the-stock-market-under-way-as-coronavirus-cases-surge-or-is-it-a-false-dawn-heres-what-experts-think-2020-07-18", "published": 1595239160.0, "headline": "Is the 'great rotation' in the stock market under way as coronavirus cases surge? Or is it a false dawn? Here's what experts think", "body": "The tyranny of the behemoth technology stocks, which has supported the overall U.S. equities market since March, took a pause this week. For months, the most highly valued, technology and e-commerce companies have marshaled a nearly unceasing rally during a public-health crisis that has exacted tremendous pain on the domestic and global economy. However, the conclusion of last week's trade on Friday highlighted some softness in the uptrend for megacapitalization tech names, raising questions about whether a rotation from out of those highflying leaders and into less-loved, economically sensitive sectors, like manufacturers, energy companies, financials and industrials, is afoot. Among the group considered at the vanguard of the tech-rally, Facebook FB, +0.26%, Amazon.com AMZN, +3.01%, Apple AAPL, +1.74%, Netflix NFLX, +1.43%, Google-parent Alphabet GOOG, +1.97% GOOGL, +1.82%  and Microsoft MSFT, +2.48%, only the iPhone maker finished the week in positive territory. Meanwhile, Netflix was the worst performer among that cohort, off 10.2%, notching its worst weekly skid in a year; and Amazon's 7.4% decline was its worst weekly drop since the period ended Dec. 28, according to FactSet data. As a result, the blue-chip Dow Jones Industrial Average DJIA, +0.56%, consisting of 30 companies with only four considered traditionally tech in nature, outperformed the Nasdaq by 3.36 percentage points last week, up 2.29% vs. the technology-laden Nasdaq Composite COMP, +1.39%  1.08% weekly decline. That marked the 124-year old benchmark's biggest weekly outperformance against the tech-heavy benchmark since June 5, according to Dow Jones Market Data. And the broader-market S&P 500 index SPX, +0.87%  produced a weekly gain of 1.25% that was 2.32 percentage points better than the Nasdaq, representing the S&P's largest outperformance since the week ended Feb. 5, 2016. On top of that, small-capitalization stocks, considered more sensitive to the health of the economy, reflected in the Russell 2000 index RUT, +0.55%, gained 3.6% for the week. Drilling deeper, value-style investing, which has underperformed growth for years is flirting with a comeback of sorts, with the Russell 2000 index's value index RUJ, -0.01%, which tracks small companies that are undervalued by some metric, gaining 4.3% for the week. Meanwhile its comparable growth index RUO, +1.07%, which follows the performance of companies that have a tendency to consistently grow earnings, rising a less-stellar 2.9%. Similarly, an exchange-traded fund tracking the S&P 500's value index, the SPDR Portfolio S&P 500 Value ETF SPYV, +0.19%, finished the week up 3.4%, versus a 0.2% decline for its comparable growth ETF, the SPDR Portfolio S&P 500 Growth ETF SPYG, +1.29%. Beaten-down financials registered a 2.1% advance for their best weekly rally since the week ended Jun 5, as measured by the Financial Select Sector SPDR ETF XLF, +0.11% ; while industrials XLI, +0.37%  soared 5.9% for the week, also marking their best weekly gains since early June. But was this a bona fide rotation into those categories and styles that many strategists view as necessary to propel the market to new heights? Or is it another head fake? Quincy Krosby, chief market strategist at Prudential, told MarketWatch in an interview that it isn't clear whether tech's setback over the past week was outright profit-taking in the wake of a long run of gains, or rotation in which investors sell tech and use the proceeds to buy assets in areas that they believe may have more room to run. This isn't the first time the markets have seen glimmers of rotation out of tech and growth names, only to be left disappointed. Bargain hunters back in late May scooped up battered stocks on the back of optimism around progress toward a coronavirus vaccine. But the moves since then have come in fits and starts, with the S&P 500 and Dow pinned around their most recent peaks in June, while the Nasdaq has notched 27 record closing highs in 2020. The market's rally up to this point has been supported by companies that have been considered more resilient to the uncertain, socially-distant, outlook that the COVID-19 public-health crisis poses. In that way, tech companies like videoconferencing company Zoom Video Communications ZM, +2.89%, which is up 262% so far this year, and the aforementioned tech behemoths are viewed as defensive plays. However, a sustainable rally is one that must include so-called cyclicals, experts say. Investors should be asking what the next theme in the market will be, said Gerald Sparrow, chief investment officer of the Sparrow Growth Fund SGNFX, +1.71%, which carries a four-star rating from fund-tracking service Morningstar. \"I think it's going to be a combination of cyclical stocks and e-commerce,\" Sparrow said in an interview. More broadly, further market gains are likely to be more balanced, \"with all sectors participating.\" Mark Arbeter, a prominent technical strategist, appears to agree with the notion that tech must continue to be a part of the next burst higher for stocks, if one is to be had, noting that the influence of the megacap tech companies also means they can drag the overall market lower too. \"How these highfliers act in the coming days as well as the Nasdaq could be a great tell as to whether the overall market will finally break higher and head to all time highs now, or if they break lower, pulling the overall market with them and squeeze some excesses out before we head to all time market highs,\" he wrote in a July 16 research note. The road ahead, however, will be a tough one as companies continue to face the economic perils of the coronavirus pandemic. The Wall Street Journal reported that the four biggest banks, JPMorgan Chase & Co. JPM, -0.57%, Wells Fargo WFC, , Citigroup C, +0.47% and Bank of America BAC, +0.47% set aside $33 billion to protect against soured loans in the second quarter, signaling that the worst of effects of the epidemic are far from over. Indeed, the U.S. recorded more than 71,000 new coronavirus cases on Friday, representing the second-highest daily of infections on record, with the U.S. looking at 3.6 million total confirmed cases, amid a resurgence in a number of states, data compiled by Johns Hopkins University show. The global case tally now exceeds 14 million, with nearly 600,000 lives claimed from the epidemic that started in December. The recent spike in cases in U.S. states, including California, Texas and Arizona, has thus far been ignored by the equity market but could eventually stymie the rebound if it translates to a slow and an unsteady economic recovery as some economists predict. \"Wall Street remains upbeat, but sentiment on Main Street is turning grim in response to the upsurge in Covid-19 cases that is prompting a renewal of lockdown restrictions,\" wrote Bob Schwartz, senior economist at Oxford Economics, in a Friday research report.Week ahead Markets will gain more perspective on the economy when a parade of corporations, nearly 500 companies, report quarterly results next week. A bevy of tech names will be featured, including Dow components International Business Machines Corp. IBM, -2.81%  on Monday, Microsoft on Wednesday, and Intel Corp. INTC, -1.03%  on Thursday. Elsewhere, earnings from electric-vehicle maker Tesla TSLA, +1.89% on Wednesday will be closely watched as will American Airlines AAL, +0.34% on Thursday. On the economic data front, major reports will be sparse with updates centered on mostly on the housing sector. On Tuesday, the Chicago Fed national activity index for June will be released at 8:30 a.m. Eastern, on Wednesday, a report on existing home sales for June will be released at 10 a.m., with Thursday seeing the usual update on weekly jobless claims at 8:30 a.m. and a report on leading economic indicators at 10 a.m. On Friday, market participants will watch for flash PMIs on manufacturing and services for July at 9:45 a.m. and report on new home sales for June at 10 a.m."}]}