{"article": [{"url": "https://www.marketwatch.com/story/houston-leaders-urge-return-to-lockdown-as-coronavirus-cases-surge-2020-07-12", "published": 1594577060.0, "headline": "Houston leaders urge return to lockdown as coronavirus cases surge", "body": "HOUSTON — Top officials in Houston are calling for the city to lock back down as area hospitals strain to accommodate the onslaught of patients sick with the new coronavirus. Houston Mayor Sylvester Turner and Harris County Judge Lina Hidalgo, both Democrats, said this weekend that a stay-at-home order is needed for America’s fourth largest city to cope with the surge of COVID-19 cases. “Not only do we need a stay home order now, but we need to stick with it this time until the hospitalization curve comes down, not just flattens,” Hidalgo said on Twitter Sunday. “Many communities that persevered in that way are reopening for the long haul. Let’s learn from that & not make the same mistake twice.” The call comes after a week in which Texas continued to break records for confirmed COVID-19 cases and deaths linked to the disease. State health officials reported 8,196 new cases Sunday, another 80 deaths and a total of 10,410 people hospitalized due to the virus. The true number of cases is likely far higher because many people have not been tested, and studies suggest people can be infected and not feel sick. The decision over a lockdown, however, rests with Republican Gov. Greg Abbott— who has resisted this step, saying it should be a last resort. Abbott led one of America’s swiftest reopenings following earlier closures in Texas. But in recent weeks, he reversed course amid swiftly climbing cases. Ahead of Independence Day, the governor ordered bars to close back down and, after undercutting local leaders’ power to do so, required people to wear face coverings in public in much of the state. On Friday, Abbott extended a statewide disaster order that warned Texans another shutdown might be needed if the virus’ spread isn’t contained. He announced Sunday that the federal government will continue to fund large testing centers in Dallas and Houston through the end of July. For most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death."}]}