{"article": [{"url": "https://www.marketwatch.com/story/biden-visits-florida-as-poll-shows-trump-leading-among-the-crucial-swing-states-latino-voters-11600196597", "published": 1600182680.0, "headline": "Biden visits Florida as poll shows Trump leading among the crucial swing state's Latino voters", "body": "Democratic presidential nominee Joe Biden speaks in Florida during a roundtable discussion with Tampa-area veterans and military families. AFP via Getty Images Democratic presidential nominee Joe Biden campaigned on Tuesday in Florida, as a recent poll focused on that swing state showed him trailing President Donald Trump among Latino voters. \"I will talk about how I am going to work like the devil to make sure I turn every Latino and Hispanic vote,\" Biden said Monday ahead of his trip to Florida, where 29 electoral votes are up for grabs, the most among top battleground states. An NBC News/Marist poll out last week on Florida voters found Trump getting 50% support among Latinos in Florida, ahead of the former vice president's 46% support, as Latinos of Cuban descent strongly backed the Republican incumbent. Among all Florida voters, the survey found the Democratic challenger and Republican incumbent tied at 48% support, while a RealClearPolitics moving average of polls put Biden at 48.7% in the Sunshine State vs. Trump's 47.1%. Democrats' concerns about the tight race in Florida are reflected in billionaire former Democratic presidential hopeful Mike Bloomberg's recent move to commit at least $100 million to help Biden in the state. Biden on Tuesday made remarks at a campaign event with military veterans in Tampa, and he was slated to attend a Hispanic Heritage Month event in Kissimmee in the evening. \"President Trump likes to say he passed the VA Choice. Just like everything else he seems to be saying, it's a figment of his imagination. It is a flat lie,\" said Biden at the event with veterans, referring to the Veterans Choice Act of 2014 that was signed into law by President Barack Obama while Biden was vice president. Biden's running mate, Sen. Kamala Harris of California, campaigned last week in Florida, promising that a Biden-Harris administration would make college tuition-free for lower-income students at public schools and private historically Black colleges and universities. Trump also campaigned in Florida last week, touting an order on offshore oil drilling XOP, -1.53% that looked to have been designed with the Nov. 3 election in mind. Latinos make up 20% of eligible voters in Florida, and the other top states for that diverse demographic group are New Mexico (43%), California (30%), Texas (30%) and Arizona (24%), according to Pew Research Center data. With 49 days to go before the election, Biden has an edge of 3.5 percentage points over Trump in a RealClearPolitics moving average of polls focused on the top battleground states that are likely to decide the White House race. Betting markets are giving Biden a 52.5% chance of winning vs. Trump's 46.7%."}]}