{"article": [{"url": "https://www.marketwatch.com/story/nvidias-40-billion-arm-takeover-could-be-blocked-heres-why-11601393588", "published": 1601467880.0, "headline": "Pressure grows for U.K. to intervene in Nvidiaâ\u0080\u0099s $40 billion Arm takeover", "body": "The U.K. government said on September 21 that it is assessing the impact of the sale of Arm to Nvidia, including commitments to maintain its headquarters and workers in Cambridge. Justin Sullivan/Getty Images The U.K. government is assessing the impact of Nvidiaâ\u0080\u0099s $40 billion takeover of Arm, as pressure for it to intervene and protect the Cambridge-based chip maker grows. It comes amid a growing backlash against the deal, as shareholders, politicians and industry experts raise concerns over national security, the loss of crucial homegrown technology, and key roles to a foreign buyer. The Santa Clara, California-based graphics chip giant announced a deal on Sept. 13 to buy Arm from its current owner, SoftBank 9984, -1.24% of Japan, in a move designed to transform the global semiconductor landscape.Â Armâ\u0080\u0099s chips are used worldwide to help power mobile device processors for companies including Apple AAPL, +1.74%, Amazon AMZN, +3.01%, Samsung and Qualcomm QCOM, +2.06%. Â Opinion: Nvidiaâ\u0080\u0099s deal with Arm paves the path to a trillion-dollar market value Critics of the deal have warned that Armâ\u0080\u0099s acquisition by Nvidia NVDA, -0.54%, which recently overtook Intel INTC, -1.03% to become the worldâ\u0080\u0099s most valuable chip maker, will place too much dominance in one companyâ\u0080\u0099s hands. The deal still needs to gain approval from regulators in a number of countries, including the U.S., the U.K., and China, and in the European Union. What has Nvidia promised? Nvidia has pledged to keep Armâ\u0080\u0099s headquarters in Cambridge and expand its research and development presence in the English city, including building an artificial intelligence and education center. It said it will not change Armâ\u0080\u0099s business model of licensing its designs to customers, and Nvidia has promised to add its own technology to the portfolio of intellectual property that Arm can license. When SoftBank acquired Arm in 2016, it made legally binding assurances that the headquarters would stay in Cambridge, and to double the companyâ\u0080\u0099s U.K workforce over five years. Read: Nvidiaâ\u0080\u0099s deal for Arm could mean a real challenge to Intel and AMD, but is likely to face opposition Arm employs around 6,500 people globally, of which 3,000 are in the U.K., with 2,500 in Cambridge.Â But SoftBankâ\u0080\u0099s agreements are due to expire in September 2021. That means that unless Nvidia makes new legally binding promises, its U.S. owner will be able to decide on Armâ\u0080\u0099s future in the U.K., unless the British government intervenes. National security concerns Ed Miliband, shadow business secretary of the opposition Labour Party, welcomed Nvidiaâ\u0080\u0099s plan to give legally binding assurances on Arm. But he said they need to be spelt out â\u0080\u009curgentlyâ\u0080\u009d and scrutinized by the government. iframe.twitter-tweet { width: 100% !important; } Tom Tugendhat, the Conservative chair of the foreign affairs select committee, has also warned that the sale of Arm â\u0080\u009craises questions of sovereignty.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } Some critics have raised concerns that if Arm becomes a subdivision of Nvidia, it will fall under regulations of Cfius (the Committee on Foreign Investment in the U.S.). That could expose Arm to escalating tensions between Washington and Beijing. Armâ\u0080\u0099s chief executive has played down the threat of export bans, telling the BBC: â\u0080\u009cThe majority of our products are designed in the U.K. or outside the U.S., and the majority of our products donâ\u0080\u0099t fall under much of the U.S. export control set of rules.â\u0080\u009d An editorial in Chinaâ\u0080\u0099s state-backed Global Times on Sept. 15 said the takeover was â\u0080\u009cdisturbing,â\u0080\u009d and called on global regulators to exercise caution as they considered whether to wave it through. In August, Hermann Hauser, the co-founder of Arm, described Arm as the â\u0080\u009cjewel in the crown of British techâ\u0080\u009d and claimed it would be disastrous for the company to be sold to Nvidia.Â â\u0080\u009cIt will become one of the Nvidia divisions, and all the decisions will be made in America, no longer in Cambridge,â\u0080\u009d Hauser told the BBC.Â â\u0080\u009cArm is the only remaining U.K. technology company, with a dominant position in mobile phone microprocessors. It has a market share of over 95%. The U.K. has suffered from American technology dominance by companies like Google GOOGL, +1.82%, Facebook FB, +0.26%, Amazon AMZN, +3.01%, Netflix NFLX, +1.43%, Apple AAPL, +1.74% and others,â\u0080\u009d Hauser wrote in an open letter to the Prime Minister.Â Can the U.K. government intervene in takeovers? The government said on Sept. 21 that it is assessing the impact of the sale of Arm to Nvidia, including commitments to maintain its headquarters and workers in Cambridge. A decision about whether to intervene in the deal would be taken by Oliver Dowden, the secretary of state for digital, culture, media and sport, after considering the relevant information. If Dowden proceeds, it is likely to be on national security grounds, as Arm is a major supplier to the defense industry. Also: Nvidia deal for Arm could be â\u0080\u0098transformational,â\u0080\u0099 but many roadblocks lie ahead Under the Enterprise Act 2002, the U.K. government has the power to intervene in mergers by issuing a Public Interest Intervention Notice, but only for a limited number of reasons, notably national security, media plurality, and stability in the financial system.Â In June 2020, a fourth category was added to this list â\u0080\u0094 the ability to combat and mitigate a public health emergency. The measure is designed to allow the intervention where liquidity issues caused by the coronavirus pandemic may have left companies active in, for example vaccine R&D, vulnerable to foreign takeovers. If the government asks for legally binding assurances from Nvidia, they would be enforced by the Takeover Panel, which governs mergers and acquisitions in the country. Several bankers say that Prime Minister Boris Johnson will not want to be seen to be blocking takeovers when the U.K. wants to be seen to be friendly to overseas bidders. Have we seen this before? U.K. government interventions are rare. However, there were two significant ones in 2019 â\u0080\u0094 read more."}]}