{"article": [{"url": "https://www.marketwatch.com/story/here-are-the-senate-races-to-watch-as-democrats-battle-to-take-control-from-republicans-2020-10-09", "published": 1602246080.0, "headline": "Here are the Senate races to watch, as Democrats battle to take control from Republicans", "body": "If Democrats take control of the U.S. Senate, that could lead to laws that shake up key sectors such as tech, health care, finance and energy — especially if the Nov. 3 election brings a “blue wave” that puts Joe Biden in the White House. So which Senate races are worth tracking, as 35 seats in that 100-member chamber are up for grabs in 2020? The nonpartisan Cook Political Report has rated 10 seats as solidly Republican and 10 as solidly Democratic as of Friday, meaning the independent newsletter’s analysts view 15 races as competitive, with ratings that range from “Toss up” to “Lean D” or “Likely R.” The table below lays out these 15 key races, and it includes Cook’s ratings and forecasts from FiveThirtyEight. Read:If the Democrats win the Senate, Big Tech better be ready for a bigger fight And see:Democrats’ chances of Senate takeover rise, and that could affect health care, energy and financial servicesKey Senate races in 2020 State Incumbent candidate Other candidate(s) FiveThirtyEight forecast Cook rating 1. Arizona Martha McSally (R) Mark Kelly (D) 78% chance for D win Lean D 2. Colorado Cory Gardner (R) John Hickenlooper (D) 76% chance for D win Lean D 3. Maine Susan Collins (R) Sara Gideon (D) 62% chance for D win Toss up 4. Alabama Doug Jones (D) Tommy Tuberville (R) 76% chance for R win Lean R 5. North Carolina Thom Tillis (R) Cal Cunningham (D) 65% chance for D win Toss up 6. Iowa Joni Ernst (R) Theresa Greenfield (D) 51% chance for D win Toss up 7. Montana Steve Daines (R) Steve Bullock (D) 70% chance for R win Toss up 8. Georgia (1) David Perdue (R) Jon Ossoff (D) 74% chance for R win Toss up 9. Georgia (2) Kelly Loeffler (R) Doug Collins (R), Raphael Warnock (D) 75% chance for R win Lean R 10. South Carolina Lindsey Graham (R) Jaime Harrison (D) 76% chance for R win Toss up 11. Kansas N/A, incumbent retiring (R) Roger Marshall (R), Barbara Bollier (D) 75% chance for R win Lean R 12. Alaska Dan Sullivan (R) Al Gross (D) 80% chance for R win Likely R 13. Michigan Gary Peters (D) John James (R) 81% chance for D win Lean D 14. Texas John Cornyn (R) MJ Hegar (D) 88% chance for R win Likely R 15. Kentucky Mitch McConnell (R) Amy McGrath (D) 96% chance for R win Likely R Sources: Cook Political Report and FiveThirtyEight data as of 10/9/20 Republicans are the incumbents in 13 out of the 15 competitive races. The GOP currently has 53 seats in the Senate, so Democrats need a net gain of four seats to take control of the chamber — or just three if Biden wins the presidential contest, because a Democratic vice president, Kamala Harris, would cast tie-breaking votes. Check out:Don’t buy health-care stocks if Democrats sweep the November elections, these contrarian analysts say And read:Trump raised 5 times as much money from America’s top CEOs as Biden Henrietta Treyz, director of economy policy at Veda Partners, said in a note on Friday that Democrats “now have a 55% chance of securing 50 seats in the Senate and upwards of 85% odds of winning the White House.” Meanwhile, FiveThirtyEight has given a 68% chance for a Democratic takeover of the Senate as of Friday, and Height Capital Markets analysts put it at 69%. Height’s team also has warned that it could take time to determine the winner of this year’s Senate contests. “Even as investors are beginning to discount the possibility of a period after the election in which presidential winner is not known for weeks, the chances of uncertainty about control of the Senate are rising,” the analysts said in a note on Thursday. Recent gains for U.S. stocks SPX, +0.87% have been pinned in part on investors becoming less concerned about a contested presidential election. Democrats took control of the House of Representatives in the 2018 midterm election and are widely expected to remain in charge there after this November’s voting. The party lost its grip on the Senate in 2014’s midterm election, when Republican candidates picked up seats in key battleground states. Now read:The prospect of a Democratic sweep is rattling a sleepy U.S. bond market"}]}