{"article": [{"url": "https://www.marketwatch.com/story/asymptomatic-transmission-of-coronavirus-may-be-worse-than-sars-or-influenza-2020-06-12", "published": 1596693860.0, "headline": "Asymptomatic coronavirus transmission appears worse than SARS or influenza â\u0080\u0094 a runner can leave a â\u0080\u0098slipstreamâ\u0080\u0099 of 30 feet", "body": "How worried should you be about asymptomatic transmission of COVID-19? “ â\u0080\u0098This virus has very peculiar immunological secrets wrapped up inside it.â\u0080\u0099 ” â\u0080\u0094 Gregory Poland, who studies the immunogenetics of vaccine response in adults and children at the Mayo Clinic The World Health Organization estimates that approximately 16% of people with COVID-19 are asymptomatic and can transmit the coronavirus, while other data show that 40% of coronavirus transmission is due to carriers not displaying symptoms of the illness. Public-health officials have advised people to keep a distance of six feet from one another. Face masks are designed to prevent the wearer, who may be infected with COVID-19 but have very mild or no symptoms, from spreading invisible droplets to another person and thereby infecting them too. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, says that in his 40 years of dealing with viral outbreaks, heâ\u0080\u0099s never seen anything like COVID-19. â\u0080\u009cIâ\u0080\u0099ve been dealing with viral outbreaks for the last 40 years. Iâ\u0080\u0099ve never seen a single virus â\u0080\u0094 that is, one pathogen â\u0080\u0094 have a range where 20% to 40% of the people have no symptoms,â\u0080\u009d he told a recent House Committee on Energy and Commerce hearing on the Trump administrationâ\u0080\u0099s response to the novel coronavirus pandemic.â\u0080\u009d But â\u0080\u009cthereâ\u0080\u0099s nothing magic about six feet,â\u0080\u009d said Gregory Poland, who studies the immunogenetics of vaccine response in adults and children at the Mayo Clinic in Rochester, Minn., and is an expert with the Infectious Diseases Society of America. â\u0080\u009cThe virus canâ\u0080\u0099t measure,â\u0080\u009d he told MarketWatch. â\u0080\u009cFor example, the viral cloud while speaking will extend 27 feet and linger in the air for about 30 minutes. This is more like influenza in the sense that people transmit the virus prior to experiencing any symptoms and some people, of course, will not get sick.â\u0080\u009d Letter from New York:â\u0080\u0098When I hear an ambulance, I wonder if thereâ\u0080\u0099s a coronavirus patient inside. Are there more 911 calls, or do I notice every distant siren?â\u0080\u0099 Asymptomatic transmission â\u0080\u009cis the Achillesâ\u0080\u0099 heel of COVID-19 pandemic control through the public-health strategies we have currently deployed,â\u0080\u009d according to a May 28 editorial in the New England Journal of Medicine. The editorial, by researchers Monica Gandhi, Deborah Yokoe and Diane Havlir at the University of California, San Francisco, referred to recent study of a coronavirus outbreak at a skilled nursing facility, which concluded that epidemiologic evaluations of COVID-19 outbreaks within skilled nursing facilities â\u0080\u009cstrongly demonstrate that our current approaches are inadequate.â\u0080\u009d “ Asymptomatic transmission â\u0080\u0098is the Achillesâ\u0080\u0099 heel of Covid-19 pandemic control.â\u0080\u0099 ” â\u0080\u0094 Monica Gandhi, Deborah Yokoe and Diane Havlir, scientists at the University of California, San Francisco Symptom-based case detection and subsequent testing to determine isolation and quarantine procedures were justified by the many similarities between SARS-CoV-1 (the virus that caused SARS) and SARS-CoV-2 (the virus that causes COVID-19), they wrote. Gandhi, Yokoe and Havlir said those symptoms include high genetic relatedness, transmission primarily through respiratory droplets, and the frequency of lower respiratory symptoms (fever, cough, and shortness of breath), with both infections developing a median of five days after exposure. â\u0080\u009cDespite the deployment of similar control interventions, the trajectories of the two epidemics have veered in dramatically different directions,â\u0080\u009d they added. â\u0080\u009cWithin 8 months, SARS was controlled after SARS-CoV-1 had infected approximately 8,100 persons in limited geographic areas.â\u0080\u009d As of Thursday, COVID-19, the disease caused by the virus SARS-CoV-2, had infected at least 18.8 million people globally and 4.8 million in the U.S. It had killed over 707,905 people worldwide and at least 158,256 in the U.S. The disease is experiencing a resurgence in southern and western states. Cases in California hit 530,606 and deaths reached 9,708 as it reported 3,624 new cases Wednesday and 100 new deaths. New York has the most fatalities (32,754) followed by New Jersey (15,842). The stock market has been on a wild ride in recent months. The Dow Jones Industrial Index DJIA, +0.56%, the S&P 500 SPX, +0.87% Â and Nasdaq Composite COMP, +1.39% closed higher Wednesday, as investors awaited round two of a fiscal stimulus. The American public has been confused about the number of asymptomatic people and how contagious they are. MarketWatch photo illustration/iStockphoto Here are five reasons to care about asymptomatic transmission:1. COVID-19 has high viral loads in the upper respiratory tract The University of California, San Francisco study said thereâ\u0080\u0099s a high viral load of SARS-CoV-2 shedding in the upper respiratory tract, even among pre-symptomatic patients, â\u0080\u009cwhich distinguishes it from SARS-CoV-1, where replication occurs mainly in the lower respiratory tract.â\u0080\u009d â\u0080\u009cViral loads with SARS-CoV-1, which are associated with symptom onset, peak a median of 5 days later than viral loads with SARS-CoV-2, which makes symptom-based detection of infection more effective in the case of SARS CoV-1,â\u0080\u009d the researchers wrote. With influenza, they added, â\u0080\u009cpersons with asymptomatic disease generally have lower quantitative viral loads in secretions from the upper respiratory tract than from the lower respiratory tract and a shorter duration of viral shedding than persons with symptoms.â\u0080\u009d2. Outdoor joggers could create a viral â\u0080\u0098slipstreamâ\u0080\u0099 of 30 feet The controversy over asymptomatic transmission wasnâ\u0080\u0099t the first time authorities left the public mystified about best practices. In April, after weeks of obfuscation over the efficacy of face masks, the Trump administration and Centers for Disease Control and Prevention said Americans should wear them. Some studies suggest transmission is more likely without a mask. “ The controversy over asymptomatic transmission isnâ\u0080\u0099t the first time authorities gave conflicting signals. ” â\u0080\u009cA runner who doesnâ\u0080\u0099t yet know heâ\u0080\u0099s sick running in front of you is likely to infect you with the slipstream behind him by around 30 feet,â\u0080\u009d Poland said. â\u0080\u009cAt six feet, the largest respiratory droplets have settled out onto the ground.â\u0080\u009d â\u0080\u009cWHO told us that mask wearing was unnecessary and then it was necessary,â\u0080\u009d he added. â\u0080\u009cIf youâ\u0080\u0099ve only had a few people sick in a hospital room, you can still culture the virus off doorknobs and light bulbs. It may also be that the risk of transmission is higher with people coughing and sneezing.â\u0080\u009d3. Some experts say masks are so-so in their effectiveness â\u0080\u009cUnless youâ\u0080\u0099re wearing a PAPR, a self-enclosed breathing unit, thereâ\u0080\u0099s no such thing as safe,â\u0080\u009d Poland said. â\u0080\u009cTheyâ\u0080\u0099re so-called space suits. The only thing you can be is safer. You canâ\u0080\u0099t be 100% safe with social distancing and face masks.â\u0080\u009d â\u0080\u009cAll of these things together form a web of interventions to protect you. You wouldnâ\u0080\u0099t get into a car without seat belts, brakes, tires, air bags. You would not be happy with any one of those things. So too with the so-called non-pharmaceutical interventions.â\u0080\u009d Poland added, â\u0080\u009cIâ\u0080\u0099m worried that people who have the antibodies or get the vaccine will have a get-out-of-jail free card. This virus has very peculiar immunological secrets wrapped up inside it. Weâ\u0080\u0099re still learning about influenza and weâ\u0080\u0099ve been working on that since the 1940s.â\u0080\u009d Dispatches from a pandemic:Letter from New York: â\u0080\u0098When I hear an ambulance, I wonder if thereâ\u0080\u0099s a coronavirus patient insideâ\u0080\u00994. A comprehensive system of contact tracing is critical â\u0080\u009cAsymptomatic transmission enhances the need to scale up the capacity for widespread testing and thorough contact tracing to detect asymptomatic infections, interrupt undetected transmission chains, and further bend the curve downward,â\u0080\u009d the CDC says in its guidelines. If the novel coronavirus pandemic is found to be driven by asymptomatic or mildly symptomatic SARS-CoV-2 infections, it added, â\u0080\u009cnew innovations in disease detection and prevention beyond exhaustive contact tracing, mass testing, and isolation of asymptomatic contacts may be needed.â\u0080\u009d The agency said more needs to be known, in particular whether full or partial immunity develops in these people, how long protective immunity lasts, and if it is possible to be immune from reinfection but still transmit COVID-19 to another person while remaining asymptomatic.5. Asymptomatic and pre-symptomatic are a bad combination Depending on the sample group, anywhere between 10% and 43% of people infected with COVID-19 had no symptoms, according to a body of research reviewed by William Petri, a professor of medicine and microbiology at the University of Virginia who specializes in infectious diseases. â\u0080\u009cAsymptomatic SARS-CoV-2 infection appears to be common, and will continue to complicate efforts to get the pandemic under control,â\u0080\u009d Petri wrote in The Conversation. To put those figures in context: Asymptomatic carriers also ranged anywhere from 5% to 25% for influenza. As many states open up again, Carlos de Rio, a professor of global health and epidemiology at Emory Universityâ\u0080\u0099s Rollins School of Public Health, told MarketWatch that itâ\u0080\u0099s best to avoid prolonged exposure to others for now. â\u0080\u009cWorking in an office with somebody is what concerns me,â\u0080\u009d he said. Also see:Yes, America needs to brace itself for a second wave of coronavirus"}]}