{"article": [{"url": "https://www.marketwatch.com/story/covid-19-may-be-why-your-social-security-benefits-drop-2020-07-30", "published": 1596282560.0, "headline": "COVID-19 may be why your Social Security benefits drop", "body": "The coronavirus crisis has shattered the financial security of many Americans — the latest victims may be future Social Security beneficiaries. Americans who become eligible for Social Security in 2022 will “likely” receive less in benefits over their lifetimes, according to a new analysis from the Center for American Progress. The reason? The current pandemic. 80% of older Americans can't afford to retire - COVID-19 isn't helping The crisis has shaken the economy. Millions have become unemployed or saw a reduction in wages. Some people are tapping into their retirement savings to make ends meet, while others didn’t have enough in retirement savings to fall back on. The Social Security Administration uses a few factors to calculate individuals’ benefits, including their wages, age and when they claim. The formula also takes into consideration the growth of average wages in the country since the year the earnings were received, which would diminish the benefits of those who claim in the next couple of years. See: Social Security recipients may be in for a rude awakening later this year More than 4 million Americans will be affected, the organization said in its report. Not only will retired workers be impacted, but so will their spouses and dependents eligible for survivor benefits. Beneficiaries who become eligible the year before 2022 will not be affected as there is a two-year lag, said Alan Cohen, a senior fellow at the Center for American Progress and author of the report. Individuals who become eligible in 2023 would not be impacted unless the economy did not recover next year. The average earner born in 1960 (who would be claiming benefits in 2022 at 62 years old) could see a loss of $1,428 a year in inflation-adjusted dollars for the rest of their lives, the Social Security Administration’s chief actuary, Stephen Goss, said in testimony in July. Of course, they could add some more money to their benefits if they delayed claiming their benefits until their Full Retirement Age — and get even more money if they were to avoid claiming until the maximum age of 70. Also see: The new Social Security trustee report shows signs of improvement — with one major caveat It’s still too early to know how the crisis will impact the trust funds that support Social Security benefits. The program’s revenue comes mostly from workers’ withheld taxes — some of whom are currently unemployed because of the pandemic. But there are also other determinants for the health and actuarial status of Social Security, including birth and mortality rates, the consumer-price index and wage increases. Not all Americans are confident Social Security will be there to help them when they get older, even though they paid into the system throughout their careers. Prior to the pandemic, two-thirds of baby boomers said they believed Social Security would run out of funding in their lifetime, as well as 81% of Generation X and 79% of millennials, according to a recent survey from Nationwide retirement Institute. One fifth of baby boomers said they had no source of retirement income outside of Social Security, and younger generations said they weren’t financially prepared for retirement before the crisis hit. As a result, 38% of survey respondents said they’ll have to retire later or not at all. Americans shouldn’t worry that they won’t get a benefit at all because of COVID-19 though — the program will still be sending checks out to beneficiaries throughout the crisis. But they should be proactive in ensuring they aren’t the victims of scams. The administration warned beneficiaries at the start of the pandemic to check their mySSA account to be sure all information is accurate and also to be wary of phone calls supposedly from the agency. The Social Security Administration will never call you and ask for your Social Security number or threaten to suspend your benefits."}]}