{"article": [{"url": "https://www.marketwatch.com/story/president-trump-tweets-that-hes-feeling-well-expected-to-stay-in-hospital-for-few-days-after-testing-positive-for-covid-19-2020-10-03", "published": 1601740040.0, "headline": "President Trump tweets that heâ\u0080\u0099s â\u0080\u009cfeeling wellâ\u0080\u009d, expected to stay in hospital for few days after testing positive for COVID-19", "body": "President Donald Trump says heâ\u0080\u0099s â\u0080\u009cfeeling wellâ\u0080\u009d and has voiced his appreciation for the medical professionals treating him for COVID-19 at a military hospital near Washington D.C. On Saturday, Trump tweeted, â\u0080\u009cDoctors, Nurses and ALL at the GREAT Walter Reed Medical Center, and others from likewise incredible institutions who have joined them, are AMAZING!!!â\u0080\u009d He also says, â\u0080\u009cWith their help, I am feeling well!â\u0080\u009d Trumpâ\u0080\u0099s tweet came after White House chief of staff Mark Meadows said Trump went through a â\u0080\u009cvery concerningâ\u0080\u009d period Friday and the next 48 hours will be critical in terms of his care. Trumpâ\u0080\u0099s doctors painted a rosy picture of the presidentâ\u0080\u0099s health in a press conference at Walter Reed National Military Medical Center near Washington D.C. But the briefing raised more questions than it answered. The White House says Trump is expected to stay at the hospital for â\u0080\u009ca few daysâ\u0080\u009d and would continue to work from the hospitalâ\u0080\u0099s presidential suite, which is equipped to allow him to keep up his official duties. A person familiar with President Donald Trumpâ\u0080\u0099s medical condition says the president had been administered supplemental oxygen at the White House on Friday before he was hospitalized. The person was not authorized to speak publicly and spoke to The Associated Press on condition of anonymity. The revelation follows a press conference by Trumpâ\u0080\u0099s doctors where they refused to confirm the president had been on oxygen following his COVID-19 diagnosis Thursday. The doctors would only say that Trump was not on oxygen at the hospital. First lady Melania Trump also has tested positive for COVID-19 and is recovering at home. White House doctors said President Donald Trump began exhibiting â\u0080\u009cclinical indicationsâ\u0080\u009d of COVID-19 on Thursday afternoon, earlier than previously known. Trump sent a tweet around 1 a.m. Friday confirming he had been diagnosed with coronavirus, along with first lady Melania Trump. On Thursday evening, Trump called into Fox News host Sean Hannityâ\u0080\u0099s show, where he discussed aide Hope Hicksâ\u0080\u0099 diagnosis and that he had been tested for the illness, but he did not say whether he had suffered symptoms. A statement from Trumpâ\u0080\u0099s doctors early Friday did not mention the president having symptoms. Presidential advisor and former New Jersey Gov. Chris Christie has tweeted that he has also tested positive for COVID-19. Christie said Saturday that he will be receiving medical attention and â\u0080\u009cwill keep the necessary folks apprised of my condition.â\u0080\u009d He did not say whether he had symptoms. Christie had said the last time he was with President Donald Trump was during preparations for the first debate with former Vice President Joe Biden in Cleveland. He was not at Trumpâ\u0080\u0099s Bedminster fundraiser in New Jersey on Thursday. Senate Republicans have canceled legislative work until Oct. 19 as the coronavirus sweeps through their ranks and lawmakers increasingly call for comprehensive testing on Capitol Hill. The Senate was to reconvene this week ahead of its confirmation proceedings for Barrett. McConnell has said those hearings, scheduled to begin Oct. 12, are â\u0080\u009cfull steam ahead.â\u0080\u009d One by one, President Donald Trump and a series of GOP lawmakers have fallen ill with the virus that has killed more than 208,000 Americans. Over the last week, many of the politicians who tested positive attended events at which few people wore masks and mingled in the halls and tunnels of the Capitol complex. Just since Friday morning, Trump, Sen. Thom Tillis of North Carolina, Mike Lee of Utah and Ron Johnson of Wisconsin announced that they have tested positive."}]}