{"article": [{"url": "https://www.marketwatch.com/story/did-you-move-even-temporarily-because-of-coronavirus-read-this-before-filing-your-taxes-2020-06-10", "published": 1592051660.0, "headline": "Did you move because of coronavirus? Read this before filing your taxes", "body": "The coronavirus outbreak has kept many families at home, but it’s caused some people to leave their home in search of more space and a change of scenery. If the “new normal” means a new address — even a temporary one — that can mean a new set of tax issues, experts say. That’s because states have different rules on how long it takes before a non-resident needs to start paying them income taxes. “ State tax auditors can look through cellphone records and bank statements if they want to show someone’s been in their borders. ” In almost half the country, it can take one day for the requirement to kick in. Elsewhere, the clock starts after two months. Meanwhile, 13 states said they wouldn’t be requiring income tax from people who temporarily stay in their borders during the pandemic. The mix of laws might confuse taxpayers, especially if they’ve decided on a change of scenery for longer than planned, said Eileen Sherr, the American Institute of CPAs’ senior manager for tax policy and advocacy. They should make a note of how long they were in each place and, if needed, work with their employer to change their withholdings, Sherr said. “People might not have been keeping track,” she added. Here’s some basics on state income taxes: Seven states — Alaska, Florida, Nevada, South Dakota, Texas, Washington, and Wyoming — don’t have an income tax. New Hampshire and Tennessee only tax investment income. Everywhere else, state tax authorities can collect tax from residents and non-residents who work there. Though states have different timetables on when a non-resident needs to start withholding money, Sherr said local authorities can look at cellphone records, credit-card statements and bank records to prove in an audit that they’re entitled to income-tax money from someone who has been residing within their borders. (There are a range of apps, like Monaeo and TaxBird, that help people track their days in a certain location.) In most places, the more state income tax you pay as a non-resident, the less you pay in your home state: 43 states will credit the non-resident tax owed against the income tax that’s owed, Sherr noted. Furthermore, there are 15 different “reciprocity” agreements where neighboring states say if a taxpayer works in one state and lives in the other, they’ll just owe resident income taxes. That’s a lot to remember, even if someone hasn’t pulled up stakes because of the pandemic. In fact, a federal bill, the Mobile Workforce State Income Tax Simplification Act, has been introduced for several years. If enacted, it would implement a 30-day standard before non-resident income taxes filing requirements start. Thirteen states are making it a little easier to file taxes in reaction to the COVID-19 outbreak. In these places, if a state resident used to work in another state but has been working remotely, Sherr said they won’t have to adjust their withholdings during the pandemic to show they’ve been working in-state. The 13 states are Alabama, Georgia, Illinois, Indiana, Massachusetts, Maryland, Minnesota, Mississippi, Nebraska, New Jersey, Pennsylvania, Rhode Island and South Carolina. There’s more you need to do to change residency In many jurisdictions, 183 is a magic number. If someone’s trying to establish residency, spending more than 183 days at one address is an important way to prove the point, according to Tim Speiss, partner and co-chairman of Eisner Amper’s personal wealth advisory practice. Lately, Speiss has spoken with a number of New York City clients who are thinking about moving out of the city for good because of the outbreak. “As the numbers began to ramp up, the people who had the adaptability to depart to less populated areas were doing so,” Speiss said. People need to prove they really left the city. It’s not enough for someone to simply tell the city’s tax authorities that they’ve moved. For example, Speiss recently gave advice to a client who lives in midtown Manhattan, but who has been staying in the Hamptons since March. If he makes that a permanent move, Speiss advised him to do things like change his driver’s license, change the location of his voting registration, remove precious family mementos and heirlooms, like pictures, jewelry and silver, from the Manhattan apartment, and make an effort to sell and/or rent his Manhattan apartment. They all help to show someone has really severed ties with one place, Speiss added. The feds also have rules on when visitors need to pay taxes If a foreign traveler is in the U.S. long enough, they have to pay tax on the income they generate within the country, explained Diane Nobile, a partner at Saul Ewing Arnstein & Lehr who does international tax planning at the law firm’s Miami office. “ The IRS has a ‘substantial presence’ test for international travelers in America ” Specifically, if someone has been on American soil for 183 days between the current year and the previous two, they have a “substantial presence” in the country and will be counted as a resident for tax purposes, the IRS says. In April, the IRS said it would give a break to any foreign traveler who’s in America and had their outbound plans waylaid by the pandemic. People caught in this predicament received a 60-day interlude that wouldn’t count towards the 183 days. Don’t miss:If airlines keep the middle seat empty due to fears of coronavirus transmission, will air travel become more expensive? The clock can start anywhere between Feb. 1 and April 1, Nobile noted. Currently, she and other tax attorneys are waiting to hear from the IRS on the rules for people who might still be stuck here after the 60-day period expires. Anyone who is trying to use the tax exception has to keep good records, Nobile said. “You have to provide evidence to the IRS it was your intention to leave.” That could be receipts for hotel stays and refunds on plane tickets. “Take screen shots of you trying to book a flight home and it saying cancelled, cancelled, cancelled.”"}]}