{"article": [{"url": "https://www.marketwatch.com/story/trump-orders-chinese-owner-of-tiktok-to-sell-us-assets-within-90-days-2020-08-15", "published": 1597483640.0, "headline": "Trump orders Chinese owner of TikTok to sell US assets within 90 days", "body": "President Donald Trump on Friday gave the Chinese company ByteDance 90 days to divest itself of any assets used to support the popular TikTok app in the United States. Trump’s executive order said there is “credible evidence that leads me to believe that ByteDance … might take action that threatens to impair the national security of the United States.” Trump last week ordered sweeping but vague bans on dealings with the Chinese owners of TikTok and the messaging app WeChat, saying they are a threat to U.S. national security, foreign policy and the economy. It remains unclear what the TikTok orders mean for the app’s 100 million U.S. users, many of them teenagers or young adults who use it to post and watch short-form videos. Trump on Friday also ordered ByteDance to divest itself of “any data obtained or derived” from TikTok users in the U.S. Microsoft MSFT, +2.48% is in talks to buy parts of TikTok. White House press secretary Kayleigh McEnany defended Trump’s earlier TikTok and WeChat orders Thursday, telling reporters he was exercising his emergency authority under a 1977 law enabling the president to regulate international commerce to address unusual threats. “The administration is committed to protecting the American people from all cyber threats and these apps collect significant amounts of private data on users,” said McEnany, adding that the Chinese government can access and use such data. TikTok said it spent nearly a year trying to engage in “good faith” with the U.S. government to address these concerns. “What we encountered instead was that the Administration paid no attention to facts, dictated terms of an agreement without going through standard legal processes, and tried to insert itself into negotiations between private businesses,” the company’s statement said."}]}