{"article": [{"url": "https://www.marketwatch.com/story/is-robinhood-making-money-off-those-day-trading-millennials-well-yes-thats-kind-of-the-point-2020-06-23", "published": 1594311920.0, "headline": "Is Robinhood making money off those day-trading millennials? Well, yes. Thatâ\u0080\u0099s kind of the point.", "body": "As the twin black swans of the coronavirus pandemic and the historic oil price collapse rocked financial markets early in 2020, opportunities emerged. So did media narratives. One of the most popular: that bored young people, stuck at home with no access to sports or bars or live entertainment, went day-trading instead, in many cases with an online brokerage that seems tailor-made for the Gen-Y set: Robinhood. iframe.twitter-tweet { width: 100% !important; } While thereâ\u0080\u0099s plenty of evidence that handfuls of millennials are day-trading, and in some cases losing a lot of money, with sad and shocking outcomes, their numbers and any impact they may be having on the market is less certain. Whatâ\u0080\u0099s more, for anyone whoâ\u0080\u0099s spent a career observing and helping fine-tune the infrastructure behind financial market trading, some of the discussion about whatâ\u0080\u0099s actually going on isnâ\u0080\u0099t informed, or helpful, according to one analyst. â\u0080\u009cThere is a narrative out there that somehow Robinhood was doing something nefarious to make money off their clients in a way that was illegal or unethical or outside the norm,â\u0080\u009d said Dave Nadig, a veteran of exchange-traded funds, an industry that depends on â\u0080\u0094 and has arguably helped bring to maturity â\u0080\u0094 the financial systemâ\u0080\u0099s pipes and plumbing. â\u0080\u009cActually, itâ\u0080\u0099s a tempest in a teapot.â\u0080\u009d Related:Retail investors are getting â\u0080\u0098hosedâ\u0080\u0099 with the biggest oil ETF down more than 30% this week The chatter about how Robinhood and other brokerages make money reveals a deep misunderstanding about how trading actually happens, Nadig told MarketWatch. Nadig blogged about order flow, in his capacity as chief investment officer and director of research at ETF Database, but also shared some thoughts in an attempt to set the record straight, and hopefully help the average investor understand whatâ\u0080\u0099s going on when he or she makes a trade. Read:Hereâ\u0080\u0099s the right way to trade ETFs Most investors think that when they try to sell a stock or an ETF, the brokerage platform they use will find another interested investor to buy it â\u0080\u0094 and vice versa. In fact, all brokerages work with companies called market makers, whose job it is to liaise between everyone who wants trades to happen: the buyer, the seller, and both partiesâ\u0080\u0099 brokers. The term â\u0080\u009cmarket makerâ\u0080\u009d and the various metaphors often used to describe them make their role sound very personal, almost bespoke, Nadig thinks. In reality, such firms operate massive algorithm-based programs that allow them to see huge swathes of financial markets at once: who wants to buy, and at what price, who wants to sell and the price they want to get, and, crucially, whether the market maker can make a few basis points on the difference. â\u0080\u009cWhat weâ\u0080\u0099re talking about is an extraordinarily thin margin business,â\u0080\u009d Nadig said. â\u0080\u009cIt happens millions of times per second.â\u0080\u009d Itâ\u0080\u0099s so high-volume, in fact, that market makers pay brokerages for the ability to be the middleman in the transactions. Thatâ\u0080\u0099s known as â\u0080\u009corder flow,â\u0080\u009d and itâ\u0080\u0099s the process thatâ\u0080\u0099s caught the attention of social media. â\u0080\u009cIf youâ\u0080\u0099re trading on Robinhood, just know your order flow data is sold to hedge funds so they can front run you,â\u0080\u009d one anonymous Twitter user wrote. Nadig thinks thatâ\u0080\u0099s misguided. Market makers should benefit a brokerâ\u0080\u0099s customers not just by facilitating the trade, but also by allowing them to realize better prices. Just as market makers use huge computer programs to figure out which trades to take, brokerages have their own, rules-based, programs, that route trades so they can happen most efficiently. Unfortunately, itâ\u0080\u0099s impossible to fact-check any brokerageâ\u0080\u0099s claims of what the industry calls â\u0080\u009cprice improvements,â\u0080\u009d Nadig notes. Itâ\u0080\u0099s worth pointing out that Robinhood was fined $1.25 million in 2019 to settle a complaint from a regulator that it did not ensure its customers received the best price for trades. Thatâ\u0080\u0099s even more incentive for the company to play by the rules now, Nadig thinks. There is some transparency into order flow, however: the Securities and Exchange Commission requires that broker-dealers file a quarterly â\u0080\u009crouting report.â\u0080\u009d Robinhoodâ\u0080\u0099s most recent one is here. Robinhood media relations department did not respond to specific MarketWatch requests for comment for this story, but referred readers to an online article about how it routes orders. Of the 2019 fine, a spokesperson said, by email, â\u0080\u009cThe facts on which the settlement is based do not reflect our practices or procedures today. The agreement relates to an historic issue during the 2016-2017 timeframe involving consideration of alternative markets for order routing, internal written procedures, and the need for additional review of certain order types. Over the last two years, we have significantly improved our execution monitoring tools and processes relating to best execution, and we have established relationships with additional market makers.â\u0080\u009d Perhaps more important than the specific logistics about order flow, Nadig thinks, is the underlying reality: millions of people trade with brokerages like Robinhood (and Schwab, Interactive Brokers, TD Ameritrade, and many more), for free. Brokerages have other sources of income, of course â\u0080\u0094 margin lending, advisory arms, and so on. But most of all, â\u0080\u009cEvery broker is in the business of getting transactions moving through the system. They just want volume,â\u0080\u009d Nadig said. Any lubrication that helps that movement is important, he said. Ultimately, â\u0080\u009cRobinhood is not there to teach you financial literacy or how to pay down your student loan. It is very good at getting you to make transactions. Itâ\u0080\u0099s Tinder but for money.â\u0080\u009d Related:A â\u0080\u0098Hippocratic oathâ\u0080\u0099 for financial advisers? The SECâ\u0080\u0099s new â\u0080\u0098Regulation Best Interestâ\u0080\u0099 gets mixed reviews."}]}