{"article": [{"url": "https://www.marketwatch.com/story/shes-ready-to-do-this-job-on-day-one-biden-harris-debut-as-running-mates-2020-08-12", "published": 1597254920.0, "headline": "'She's ready to do this job on Day One': Biden, Harris debut as running mates", "body": "Joe Biden and Kamala Harris came out swinging at Donald Trump in their first public appearance as running mates on Wednesday, pledging to bring back jobs and prop up the middle class as the U.S. recovers from the coronavirus pandemic and grapples with a racial reckoning. Invoking her work taking on big banks, oil companies and the \"gun lobby,\" Biden called Harris a champion of the middle class and a fighter who \"knows how to govern.\" The pair spoke in Wilmington, Del., a day after Biden, the former vice president, announced he'd chosen her. \"I'm ready to get to work,\" said Harris, who slammed Trump over his handling of the pandemic, saying the U.S. leads the world in coronavirus cases \"because of Trump's failure to take it seriously from the start.\" Biden called Harris \"ready to do this job on Day One,\" as the California senator sat nearby. Biden is scheduled to accept the Democrats' nomination next week, via a video speech from Delaware instead of in-person in Milwaukee. The party's convention is almost entirely virtual this year, as leaders urged participants to stay away over coronavirus fears. Now see:The Obamas, AOC and Kamala Harris: Here's who's speaking to the Democratic convention and when. Trailing Biden in the polls, Trump has accused Harris of pulling Biden to the left of his party and says it's he and the Republicans who can help bring the economy back. Also read:Kamala Harris is Biden's running mate-here's what she means (and doesn't mean) for financial markets. \"With Kamala Harris by his side, the leftist takeover of Joe Biden is complete,\" Trump's campaign said in a statement on Wednesday. \"Only President Trump and his administration can be trusted to rebuild our economy, defend our national security, and put America First,\" the statement said. Opinion:Biden lays a trap for Trump in picking Harris. Analysts have said health-care stocks XLV, +0.90%  could benefit from a Biden-Harris win, while financials XLF, +0.11%  would be negatively impacted. Harris, 55, is a daughter of Jamaican and Indian immigrants. The 77-year-old Biden's age has prompted questions about whether he would serve two terms as president and put extra focus on his choice for vice president. Biden in late April said he viewed himself \"as a transition candidate\" who would have young leaders in his administration."}]}