{"article": [{"url": "https://www.marketwatch.com/story/theres-growing-evidence-that-microsoft-will-overtake-salesforce-in-its-core-business-within-three-years-2020-07-23", "published": 1595682020.0, "headline": "Thereâ\u0080\u0099s growing evidence that Microsoft will overtake Salesforce in its core business within three years", "body": "Editorâ\u0080\u0099s note: Microsoft is one of dozens of companies for which Daniel Newmanâ\u0080\u0099s firm has provided research, advisory or consulting services in the past year. Newmanâ\u0080\u0099s author biography has been updated to reflect that fact. When Tom Siebel, the founder of Siebel Systems, needed to pick a customer relationship management software (CRM) for his next venture, C3.ai, he picked Microsoft Dynamics 365. Same goes for Coca-Cola, Walgreens Boots and BNY Mellon, all of which have hitched their wagons in the past few months to Microsoft, rather than Salesforce, a longtime giant in that business. For some, this may come as a surprise. For me, this is just the first domino of Microsoftâ\u0080\u0099s MSFT, +2.48% Â rise and Salesforceâ\u0080\u0099s CRM, +2.21% Â fall. Two years ago, I suggested that Microsoftâ\u0080\u0099s business applications were poised to give Salesforce competition it hadnâ\u0080\u0099t seen before. This is less of a knock on Salesforce and more of a tribute to the momentum of Microsoft. Today, I am doubling down on that opinion, making this just one more reason investors should be confident in Microsoftâ\u0080\u0099s future. The last two years have yielded strong sales performances from both Salesforce and Microsoft Dynamics 365 (D365), which competes directly with Salesforce. D365 has seen consistent growth, averaging 45% for the past eight quarters including Wednesdayâ\u0080\u0099s results, outpacing Salesforceâ\u0080\u0099s revenue growth, which sits around 28% during that time. Additionally, Microsoft has seen its stock-market value double from $800 billion to $1.6 trillion in this time. In the same two-year period, Salesforceâ\u0080\u0099s market cap saw a smaller percentage increase, moving from $109 billion to $172 billion during that timeâ\u0080\u0094even with the inclusion of its $15.7 billion acquisition of Tableau, a leading Business Intelligence vendor. Read:Salesforceâ\u0080\u0099s deal for Tableau smacks of desperation I believe Microsoft will be No. 1 by market share in this segment within three years. This will be driven by Microsoftâ\u0080\u0099s strengths in product and solution breadth and depth. The shift from Salesforce to Microsoft is being driven by the stark difference in ecosystem. Microsoft has over a billion enterprise users. This entails productivity, cloud and applications, but represents a massive numberâ\u0080\u0094essentially Microsoft can be found in nearly every enterprise on the planet. During the COVID-19 pandemic from just early March to April 30, Microsoftâ\u0080\u0099s Teams platform grew from around 11 million daily users to over 75 million. In the past, the relationship between something like Office and a companyâ\u0080\u0099s CRM had almost no overlap. That is completely different today. In the past few years, the enterprise has settled on a hybrid approach to IT: some things happen in the cloud and some things happen on premises. This has been driven by massive volumes of data and the need to be able to use all of that data to power the business. Further, users want systems that work together without complexity. This is where Microsoft is in a much better position than Salesforce to become the preferred partner. Microsoft is also seeing a wave of Salesforce users adopting its Power Platform, the companyâ\u0080\u0099s low- or no-code tool for developing business applications. It is seeing a similar pattern of Salesforce customers making use of its customer data platform, D365 Customer Insights. By itself, this could be considered insignificant, but given that these tools that are complimentary to CRM and business applications, itâ\u0080\u0099s another foot in the door for Microsoft to win those customers over from the competition. Microsoft has the full stack, including Infrastructure, Platform and Software as a Service (IaaS, PaaS and SaaS). It has public cloud and hybrid cloud offerings, all with a full complement of AI, Machine Learning, IoT and Edge Computing capabilities. All data sources and all apps are built to work together seamlessly. Couple this with Microsoftâ\u0080\u0099s massive existing enterprise footprint, and its tools enable collaboration, communication, productivity, business intelligence and even search and internet browsing. Microsoft estimates that 95% of its Dynamics 365 users are also users of Microsoftâ\u0080\u0099s Cloud service, Azure. This is not by chance. Salesforce, meanwhile, is still trying to integrate Tableau and/or build an enterprise path to hybrid IT. For enterprises trying to utilize all of their growing data sets, there are significant complexities when using Salesforce that are simplified when building on Microsoft. This was influential in Microsoftâ\u0080\u0099s above-mentioned wins with Coca-Cola and BNY Mellon. Sooner than later, it will also be influential in the shift in market share away from Salesforce. The simplicity that won Salesforce so much business early on is becoming a nuisance to its growth today. Todayâ\u0080\u0099s users want both simplicity and seamless integrationâ\u0080\u0094thatâ\u0080\u0099s what Microsoft delivers. In short, Salesforce hasnâ\u0080\u0099t been able to keep up with Microsoftâ\u0080\u0099s pace of innovation in a market where the convergence of technology is the ultimate catalyst for growth. It isnâ\u0080\u0099t any longer just CRM versus CRM or ERP versus ERP. Rather it is Cloud, Data Center, Artificial Intelligence, Collaboration, Flexible Work with a sprinkle of brand affinity that has touched Microsoft in a way that only perhaps Apple and Tesla enjoy. Salesforce should enjoy its last wave of market leadership because now that itâ\u0080\u0099s in the crosshairs of Microsoft, it can consider its days numbered. Also read:Microsoft reports record revenue to wrap up a record-breaking fiscal year Daniel Newman is the principal analyst at Futurum Research, which provides or has provided research, analysis, advising, and/or consulting to Microsoft and dozens of companies in the tech and digital industries. Neither he nor his firm holds any equity positions with any companies cited. Follow him on Twitter @danielnewmanUV."}]}