{"article": [{"url": "https://www.marketwatch.com/story/pompeo-says-the-us-is-setting-clear-expectations-for-china-as-houston-consulate-ordered-closed-2020-07-22", "published": 1595415920.0, "headline": "Pompeo says the U.S. is setting â\u0080\u0098clear expectationsâ\u0080\u0099 for China, as Houston consulate ordered closed", "body": "“ â\u0080\u009cWe are setting out clear expectations for how the Chinese Communist Party is going to behave.â\u0080\u009d ” â\u0080\u0094 Secretary of State Mike Pompeo Secretary of State Mike Pompeo on Wednesday said China is stealing U.S. intellectual property, as the Asian nationâ\u0080\u0099s Houston consulate was ordered to be shut down. A day before he is scheduled to give a policy speech on China, Pompeo told reporters in Copenhagen that the Trump administration is â\u0080\u009csetting out clear expectations for how the Chinese Communist Party is going to behave.â\u0080\u009d China said there would be retaliation if the move isnâ\u0080\u0099t reversed. It came after two Chinese hackers were accused on Tuesday by the Justice Department of stealing trade secrets and trying to pilfer research on coronavirus vaccine candidates. Pompeoâ\u0080\u0099s planned speech, reported by the Washington Times, is scheduled to be held at the Richard Nixon Presidential Library and Museum near Los Angeles. It is the fourth in a series of addresses by top Trump administration officials. â\u0080\u009cWe put together a series of remarks aimed at making sure the American people understood the ongoing, serious threat posed by the Chinese Communist Party to our fundamental way of life here in the United States of America,â\u0080\u009d Pompeo was quoted as saying by Washington Times. Chinese Foreign Ministry spokesman Wang Wenbin called the consulate closure â\u0080\u009ca political provocation unilaterally launched by the U.S.â\u0080\u009d Meanwhile, the stock market was bouncing around on Wednesday, with the the Dow Jones Industrial Average DJIA, +0.56% Â up slightly as the Nasdaq Composite Index turned lower in late-morning trade."}]}