{"article": [{"url": "https://www.marketwatch.com/story/target-to-increase-the-number-of-black-workers-across-the-company-by-20-over-the-next-three-years-2020-09-10", "published": 1599809180.0, "headline": "Target to increase the number of Black workers across the company by 20% over the next three years", "body": "Target Corp. has set a goal to increase the number of Black workers across the company by 20% over the next three years. The goal was set alongside the release of the company’s 2019 Workforce Diversity report, a breakdown of the racial and gender composition at the retailer. The report found that more than half of the company’s workforce is composed of people color, including 15% who are Black and 25% who are Latinx. Meanwhile, the company’s leadership team is 8% each Black, Latinx and Asian, with the remainder white. And 15% of Target’s board is Black, 31% is Latinx and 54% is white. “We know that having a diverse workforce and inclusive environment not only creates a stronger team, but also provides the perspectives we need to create the products, services, experiences and messages our guests expect,” said Melissa Kremer, Target’s TGT, +1.14% chief human resources officer, in a statement. Read:How Black doctors are answering the call to reform medical education — and bringing COVID-19 vaccine trials to communities of color The company has had diversity and inclusion goals for years. This latest report comes amid increased focus on diversity at companies and groups across a wide spectrum of industries. This week, the Academy of Motion Picture Arts and Sciences, the group that awards the Oscars, said best picture nominees will have to meet a standard for diversity both on screen and off to be eligible for the award. Target’s Workforce Diversity report also found that more than half of its staff, 58%, are women, while 42% of the company’s leadership team is composed of women. To achieve its latest diversity goal, Target will take steps including developing programs to hire and retain Black workers in areas where they are least represented, including technology and merchandising; increasing mentors and sponsorships for Black workers; and conducting anti-racist training. See:California is trying to legally require more diversity on corporate boards Over the summer, Target made a number of changes that impact staff including a permanent increase in its U.S. minimum wage to $15 an hour on July 5, and the institution of Juneteenth as a company holiday. Juneteenth is the commemoration of the end of slavery that takes place on June 19. Target stock has rallied nearly 14% for the year to date. The SPDR S&P Retail ETF XRT, +0.05% has gained 9.6%. And the S&P 500 index SPX, +0.87% is up 3.4%."}]}