{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-pandemic-could-get-much-much-worse-according-to-this-health-expert-2020-07-15", "published": 1595071340.0, "headline": "Coronavirus pandemic could get much, much worse, according to this health expert", "body": "The coronavirus pandemic that has infected more than 3.4 million Americans and killed more than 136,000 could get much, much worse, unless action is taken now to contain it, according to a leading public health expert. “ ‘Had we done it right the first time, we’d be operating at near 100 percent now, schools would be preparing for a nearly normal school year, football teams would be preparing to practice — and tens of thousands of Americans would not have died.’ ” John M. Barry, professor at the Tulane University School of Public Health and Tropical Medicine, and author of “The Great Influenza: The Story of the Deadliest Pandemic in History,” wrote in a New York Times op-ed Wednesday that the U.S. needs to follow the example of the dozens of countries that have managed to tame the spread and reopen their economies safely. “At this writing, Italy, once the poster child of coronavirus devastation and with a population twice that of Texas, has recently averaged about 200 new cases a day when Texas has had over 9,000,” Barry wrote. “Germany, with a population four times that of Florida, has had fewer than 400 new cases a day. On Sunday, Florida reported over 15,300, the highest single-day total of any state.” The crucial difference is that those countries all took the virus seriously from the get-go, acted swiftly and decisively and continue to do so. Australia just issued $18,000 of fines because too many people attended a birthday party in a home, he wrote. U.S. health experts were clear that to replicate Europe’s success, the U.S. would need to shut down for as long as needed to achieve a steep downward trend in cases. Equally, the government needed to get Americans on board with public health advice, such as frequent hand washing, social distancing and wearing face masks. See also: Coronavirus update: COVID-19 is far from contained and could rival 1918 flu pandemic that killed 50 million, experts warn Thirdly, it needed a robust testing, tracing and isolating system to keep track of who was infected and who they had been in contact with. “Nationally we came nowhere near any of those goals, although some states did and are now reopening carefully and safely. Other states fell far short but reopened anyway. We now see the results,” Barry wrote. Adding to the gloom, states are now reporting some of the shortages that dogged hospitals back in March, such as testing kits and personal protective equipment. Post-testing support — making sure those who test positive self-isolate and following up their contacts — has fallen short of the needed effort. “Many states now have so many cases that contact tracing has become impossible anyway,” Barry wrote. To reopen the economy safely, and to reopen schools safely, requires getting the case count down to manageable levels, mimicking those in Europe, which is now ready to bring children back into its schools. That will require limits on gatherings and temporary shutdowns of places where people tend to congregate in large numbers. That means not just bars, but also churches, which are a well-documented source of spread. In some instances, a full shutdown may be required, said Barry, as half measures will do little to stop hospital systems from being overwhelmed. See:Florida suffers record single-day COVID-19 death toll, but CDC’s Redfield won’t blame DeSantis’s brisk reopening of state “During the 1918 influenza pandemic, almost every city closed down much of its activity. Fear and caring for sick family members did the rest; absenteeism even in war industries exceeded 50 percent and eviscerated the economy. Many cities reopened too soon and had to close a second time — sometimes a third time — and faced intense resistance. But lives were saved,” said Barry. The U.S. has a second chance to attack the virus, but may not have a third, he concluded. “If we don’t get the growth of this pandemic under control now, in a few months, when the weather turns cold and forces people to spend more time indoors, we could face a disaster that dwarfs the situation today,” he said. See now: Group of former CDC heads say no president has ever politicized the leading U.S. health agency the way Trump has"}]}