{"article": [{"url": "https://www.marketwatch.com/story/how-the-2020-hurricane-season-could-end-up-rivaling-the-worst-on-record-11598544359", "published": 1598534180.0, "headline": "How the 2020 hurricane season could end up rivaling the worst on record", "body": "Hurricane Laura made landfall on the U.S. Gulf Coast as a Category 4 storm. Associated Press 2020 is shaping up as one of the worst Atlantic hurricane seasons in the last nearly 170 years, on track to produce the most named storms, or their equivalent, of any year other than 2005, forecasters have warned. How the year is stacking up is illustrated succinctly in the chart below from Jim Reid, economist at Deutsche Bank, in a Thursday note after Hurricane Laura made landfall near the Texas-Louisiana border as a Category 4 storm with sustained winds of around 150 miles per hour. Researchers at Colorado State University earlier this month forecast 24 named storms will form this hurricane season, up from their July prediction of 20. They expect 12 to reach hurricane status, which is the most the team has ever predicted in their August forecast. “Looking back at 170 years of data, this Atlantic hurricane season could end up rivaling the most severe on record — namely 2005 — which contained the infamous and tragic Hurricane Katrina (damages of 1.2% of 2005 GDP),” Reid wrote. “2005 saw 28 named storms with no other year exceeding 20. This was the only year the alphabet was exhausted and we moved to the Greek equivalent. We only need 21 for this as Q, U, X, Y and Z are not used.” NOAA’s Climate Prediction Center on Aug. 6 said it expected 19 to 25 named storms (winds of 39 mph or greater), of which 7 to 11 would become hurricanes (winds of 74 mph or greater), including 3-6 major hurricanes (winds of 111 mph or greater). “ ‘Looking back at 170 years of data, this Atlantic hurricane season could end up rivaling the most severe on record — namely 2005 — which contained the infamous and tragic Hurricane Katrina.’ ” — Deutsche Bank’s Jim Reid Laura subsequently weakened on Thursday but remained dangerous as it continued its way inland. It was expected to be downgraded to a tropical storm later in the day. Tropical Storm Marco hit the region earlier this week. Laura and Marco were the 12th and 13th named storms, respectively, so far this year. Reid noted that storms five through thirteen arrived at the earliest point of any year. Also, Laura was the seventh storm to hit the U.S. this year, which is also the most for this point in hurricane season, which runs from June 1 to Nov. 30. The high storm count, however, is in keeping with a trend that’s been in place over the last 25 years. Reid noted that while the 170-year average of named storms is just below 10 per season, there have only been three years since 1995 with fewer than 10. Since then, there’s been an annual average of 15 storms. Laura did significant damage to property and left hundreds of thousands of customers without power in Louisiana and Texas. Oil traders, however, largely shrugged off the storm, which shut down more than 80% of crude output in the Gulf of Mexico and forced the closure of a large chunk of the region’s refining capacity. Commodity Corner: Hurricane Laura to do little to disturb relative calm in gasoline markets The U.S. crude benchmark CL.1, -1.62% was down 1.8% near $42.60 a barrel on the New York Mercantile Exchange. The Dow Jones Industrial Average DJIA, +0.56% trimmed early gains to trade around 100 points, or 0.3%, higher, while the S&P 500 SPX, +0.87% and the Nasdaq Composite COMP, +1.39% turned negative. The S&P and Nasdaq earlier scored another round of all-time highs as equities took their cue from a dovish shift by the Federal Reserve in its monetary policy framework."}]}