{"article": [{"url": "https://www.marketwatch.com/story/american-airlines-will-fly-at-full-capacity-only-3-us-airlines-have-blocked-the-middle-seat-on-domestic-flights-2020-07-02", "published": 1593852260.0, "headline": "American Airlines will fly at full capacity â\u0080\u0094 only 3 U.S. airlines have blocked the middle seat on domestic flights", "body": "American Airlines AAL, +0.34% Â has come under scrutiny for its decision not to block the middle seats on flights in the name of preventing coronavirus transmission â\u0080\u0094 but many other airlines have taken this same stance. The carrier announced last week that starting Wed., July 1, it would resume booking flights to full capacity. Previously, the airline had said it would limit its flights to 85% capacity and block certain seats to ensure social distancing onboard its aircraft. Moving forward, passengers will be alerted if their flight is going to be crowded and be given the opportunity to switch flights free of charge. Aside from American, other airlines that arenâ\u0080\u0099t capping flight capacity or blocking seats include United UAL, +0.32%, Allegiant ALGT, +2.16%, Spirit SAVE, +1.35% Â and Sun Country. The move has drawn criticism from public-health experts. â\u0080\u009cWe donâ\u0080\u0099t think itâ\u0080\u0099s the right message,â\u0080\u009d Robert Redfield, the director of the Centers for Disease Control and Prevention, testified during a Senate committee hearing on Tuesday. â\u0080\u009cItâ\u0080\u0099s really important that individuals, whether [theyâ\u0080\u0099re in] a bus or a train or a plane, are social distancing to the degree thatâ\u0080\u0099s feasible.â\u0080\u009d Delta is one of only a few U.S. airlines to block middle seats on its flights to promote more social distancing onboard aircraft during the coronavirus pandemic. Getty Images During that same hearing, Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases, said the policy change at American â\u0080\u009cis something that is of concern.â\u0080\u009d Both Fauci and Redfield made the comments in response to a question from Sen. Bernie Sanders (I-Vt.), who asked why the government wasnâ\u0080\u0099t working to stop â\u0080\u009cthat type of activity.â\u0080\u009d An American Airlines spokesperson said the company was â\u0080\u009cunwaveringâ\u0080\u009d in its commitment to safety. â\u0080\u009cWe know our customers are placing their trust in us to make every aspect of their journey safe, and we are committed to doing just that,â\u0080\u009d the spokesperson said in an email. â\u0080\u009cWe have multiple layers of protection in place for those who fly with us, including required face coverings, enhanced cleaning procedures, and a pre-flight COVID-19 symptom checklist â\u0080\u0094 and weâ\u0080\u0099re providing additional flexibility for customers to change their travel plans, as well,â\u0080\u009d the spokesperson added. “ Three other airlines made moves to reduce capacity: Alaska Airlines, Frontier Airlines and Southwest. ” American Airlines is not alone in its stance. In fact, only three U.S.-based airlines â\u0080\u0094 Delta DAL, +0.39%, Hawaiian HA, +0.36% Â and JetBlue JBLU, -0.07% Â â\u0080\u0094 have blocked the middle seats completely on their domestic flights, reducing the capacity on their aircraft substantially. Three other airlines have made moves to reduce capacity. Alaska Airlines ALK, +0.15% Â blocks â\u0080\u009cselectâ\u0080\u009d seats. Frontier Airlines blocks 20 of its middle seats per flight to give customers the option to purchase a seat that will be more socially distanced. On one of the airlineâ\u0080\u0099s typical aircraft, one in five seats have a guaranteed empty middle seat next to them. â\u0080\u009cThis is a confirmed measure we take on every flight â\u0080\u0094 not a â\u0080\u0098weâ\u0080\u0099ll make a best effortâ\u0080\u0099 scenario,â\u0080\u009d Jennifer de la Cruz, Frontierâ\u0080\u0099s director of corporate communications, told MarketWatch in an email. Southwest Airlines LUV, +1.89% Â has committed that none of its flights will be booked more than two-thirds full through Sept. 30. Southwest does not assign seats, though, so middle seats remain open, but passengers are encouraged to socially distance as much as possible when they board. But experts have also questioned the efficacy of social distancing on planes as an approach to curb the transmission of the virus that causes COVID-19 on airplanes. To reduce the probability of exposure to a very low level, â\u0080\u009cyou would need to make the seating density so low that it would be impractical to operate an aircraft economically,â\u0080\u009d Byron Jones, an engineer and professor at Kansas State University, told lawmakers during a hearing last week before the House of Representatives Subcommittee on Space and Aeronautics."}]}