{"article": [{"url": "https://www.marketwatch.com/story/with-students-going-online-moving-to-private-schools-and-homeschooling-school-districts-fear-funding-shortfall-11601563450", "published": 1601712200.0, "headline": "With families turning to â\u0080\u0098pandemic podsâ\u0080\u0099 and homeschooling, a funding crisis looms for public schools", "body": "Students return to public school in New York City. Uncertainty surrounding this school year has pushed families to consider alternatives to public school, which could have consequences for districts' funding. (Photo by Spencer Platt/Getty Images) Spencer Platt/Getty Images Like many school districts across the country, Savannah-Chatham County Public Schools began classes remotely in August.Â The COVID-19 positivity rate in Georgia, where the district is located, has hovered around 8% over the past month, and officials suspected that parents would be hesitant to send their children to school in person in that environment. But when the school year started online, about 700 fewer students than officials expected showed up. That could amount to a loss of funding of between $1.5 million and $2 million for the district, said Larry Jackson, the public school systemâ\u0080\u0099s chief financial officer.Â Â Georgia, like many states, ties public school funding in part to how many students are enrolled in a given school. That enrollment figure is based on a weighted average of the number of students attending school on certain days of the year, known as â\u0080\u009ccount days.â\u0080\u009d The count day scheduled for mid-October carries a heavy weight in that formula, Jackson said.Â Nearly half of the 700 students who havenâ\u0080\u0099t enrolled so far should be in kindergarten, Jackson said. District officials suspect many of those families chose to continue with in-person daycare programs instead of signing up for remote public school. The district is launching hybrid programming for younger students on Oct. 5, earlier than theyâ\u0080\u0099d planned, in hopes of luring back those kindergarteners.Â â\u0080\u009cHopefully, we can capture some of those kids that are in those daycares out there and we can get our enrollment up,â\u0080\u009d Jackson said. â\u0080\u009cIf they show up in January after the first of the year, itâ\u0080\u0099s a little bit too late for us,â\u0080\u009d funding wise, he added.Â Officials had hoped case positivity rates would be lower when they started offering in-person classes, Jackson said, but given the funding challenges they could face and parent pressure, they couldnâ\u0080\u0099t wait. â\u0080\u009cOur back is against the wall,â\u0080\u009d he said.Â Â Parents struggle to balance their own work with studentsâ\u0080\u0099 online classes Jacksonâ\u0080\u0099s district is likely one of thousands across the country preparing for a loss in funding in the coming years. With so much uncertainty surrounding this school year, some parents who can afford to do so have been turning to alternatives to their local public school. Some have pulled their kids out of school and hired their own teachers to educate small groups of children in â\u0080\u009cpandemic pods;â\u0080\u009d others have hired tutors to homeschool their children in a basement or guesthouse. Those decisions could have consequences for their local school districts that linger even after those students re-enroll in public schools.Â Families with school-aged children are confronting a number of issues this year, including how best to manage synchronous, remote classes â\u0080\u0094 or those that require that all students sign on at the same time, similar to a traditional bell schedule â\u0080\u0094 with parentsâ\u0080\u0099 conference calls and Zoom ZM, +2.89% meetings, said Jessica Calarco, an associate professor of sociology at Indiana University. Theyâ\u0080\u0099re also coping with constantly evolving reopening plans from public-school systems.Â â\u0080\u009cThere are certainly parents who are saying â\u0080\u0098I could do this easier on my ownâ\u0080\u0099,â\u0080\u009d said Calarco, who has been interviewing parents during the pandemic as part of her research.Â Â “ For a lot of parents, the connection between public school funding and enrollment is â\u0080\u0098new and surprising.â\u0080\u0099 ” â\u0080\u0094 Jessica Calarco, an assistant professor of sociology at Indiana University Some parents are aware that pulling their children out of their public school could have financial repercussions for their district; Calarco said she has seen some parents ask on message boards whether they could make a donation or take other actions to mitigate a loss in funding. But for a lot of parents, the connection between enrollment and public-school funding â\u0080\u009cis new and surprising,â\u0080\u009d she said.Â The combination of parents choosing to pull their children out of school this year and the increase in students who will struggle to participate in classes because they canâ\u0080\u0099t access laptops or a strong Wi-Fi connection, will likely lead to â\u0080\u009ca pretty significant drop in public school enrollment,â\u0080\u009d Calerco said. â\u0080\u009cAnd that will have a significant impact on public-school budgets.â\u0080\u009dSchool districts were already squeezed following the Great Recession Many school districts were already coping with funding shortfalls following the Great Recession, which squeezed state budgets. In 17 states, legislators cut per-student funding by more than 10% in the years immediately following the downturn, according to the Center on Budget and Policy Priorities, a think tank focused on the impact of budget and tax issues on inequality and poverty. Even by 2017, seven states were still funding their public schools at per-student levels that were 10% lower than the funding they provided in 2008, CBPP found.Â The pandemic-induced downturn will likely only exacerbate those funding challenges. States depend on income and sales taxes for 70% of their tax revenue, said Michael Leachman, vice president for state fiscal policy at CBPP. Those two sources of funds have taken a hit during the pandemic with businesses shuttered and millions out of work, he said. That means the services they fund, including education, will be facing cuts too, Leachman said.Â “ â\u0080\u0098When the state is really struggling, it has a big effect on schoolsâ\u0080\u0099 ability to pay teachers.â\u0080\u0099 ” â\u0080\u0094 Michael Leachman, vice president for state fiscal policy at the Center on Budget and Policy Priorities â\u0080\u009cWhen the state is really struggling, it has a big effect on schoolsâ\u0080\u0099 ability to pay teachers and other staff and to buy textbooks and equipment and such,â\u0080\u009d he said. â\u0080\u009cSchools often have to cut back and it often affects the quality of the education.â\u0080\u009dÂ These kinds of cuts can have a particularly devastating impact on under-resourced schools that disproportionately serve Black and Hispanic students, Leachman said. These schools are already under-funded and they have less of an ability to raise funds through local taxes because property wealth in those districts is lower, he said.Â In Indianapolis, bracing for funding cuts In Indianapolis, Jeff Butts, the superintendent of the Metropolitan School District of Wayne Township, is bracing for state funding cuts.Â â\u0080\u009cWe look at the revenue forecast for the state of Indiana and we look at the cash reserves that have been spent down, we know that the General Assembly is going to be looking to areas to reduce their budget,â\u0080\u009d Butts said. â\u0080\u009cSchools are over 50% of Indianaâ\u0080\u0099s budget so obviously thatâ\u0080\u0099s a place that we believe theyâ\u0080\u0099re going to be looking at.â\u0080\u009d This year has been more expensive to operate than previous years, Butts said. His district is offering three modalities â\u0080\u0094 in-person, hybrid and fully remote â\u0080\u0094 which requires more teachers than typical and pandemic-specific staff, like a contact tracer. Despite the range of options, some students still arenâ\u0080\u0099t showing up.Â Over the past few years, the Wayne Township school district has grown by about 150 to 200 students. This year, officials estimate theyâ\u0080\u0099ve lost 400 students, Butts said. (The stateâ\u0080\u0099s count day already took place and school districts are currently in a dispute resolution period to sort out cases where two districts claimed the same child.) “ â\u0080\u0098We expected a little bit of a drop, we did not expect 400 children.â\u0080\u0099 ” â\u0080\u0094 Jeff Butts, superintendent of MSD Wayne Township in Indianapolis â\u0080\u009cWe expected a little bit of a drop, we did not expect 400 children,â\u0080\u009d Butts said. The enrollment decline will lead to a loss of about $3 million in funds, he said. â\u0080\u009cWe donâ\u0080\u0099t yet know where they all went,â\u0080\u009d Butts said of the students.Â Â But officials suspect some went to private schools, others enrolled in charter schools that have always operated exclusively online, and some are being homeschooled. In the past, Indiana lawmakers have considered providing public funding to children participating in homeschooling.Â â\u0080\u009cThatâ\u0080\u0099s obviously worrisome especially if those children are able to come back after count day,â\u0080\u009d Butts said. â\u0080\u009cThe public school has not received funding.â\u0080\u009dÂ Butts believes the legislature will revisit the topic again this year when it prepares its budget, which provides appropriations for the next two years. Butts said heâ\u0080\u0099s preparing to discuss the topic with state lawmakers if thatâ\u0080\u0099s the case. Heâ\u0080\u0099s also bracing for the impact of funding declines, which could lead to staff cuts.Â The school system will initially look to cut staffing in areas that donâ\u0080\u0099t impact the classroom, Butts said. Still, thatâ\u0080\u0099s no guarantee.Â Â â\u0080\u009cWeâ\u0080\u0099ll be negotiating a contract next fall based on student enrollment and funding,â\u0080\u009d Butts said. â\u0080\u009cThat could be quite a challenge if our funding is cut and weâ\u0080\u0099re at the negotiating table with our teachers.â\u0080\u009dÂ Urging lawmakers to reconsider how funding is allocated In Virginia, the state superintendent association is urging lawmakers to reconsider how itâ\u0080\u0099s allocating funding this year, given the pandemicâ\u0080\u0099s unprecedented impact on school enrollment, said Ben Kiser, executive director of the Virginia Association of School Superintendents. Across the state over 37,000 children have not officially registered or enrolled this school year, he said. That could result in a potential shortfall of $155 million to these districts if the students do not return to school.Â During a typical year, school divisions forecast how many students they expect to show up by using indicators like new home construction, change in workforce capacity, industry coming or leaving a region, fluctuation in an areaâ\u0080\u0099s immigrant population, and the stateâ\u0080\u0099s enrollment projections, Kiser said. Based on that projection, the divisions are allotted a certain amount of funding from the state, but if enrollment on the two count days â\u0080\u0094 one in September and one in March â\u0080\u0094 is significantly different from the projections, â\u0080\u009cthereâ\u0080\u0099s a scramble,â\u0080\u009d to cope with the funding shortfall, he said. Average enrollment on the two count days can also impact funding for future school years, Kiser said.Â Â â\u0080\u009cWe are lobbying legislators and the governorâ\u0080\u0099s office to consider the data, consider the impact of parents choosing not to send their children back and how that could affect not only this yearâ\u0080\u0099s funding for school divisions but even going into next year,â\u0080\u009d Kiser said. â\u0080\u009cLong-term decisions should not be based on short-term data.â\u0080\u009d"}]}