{"article": [{"url": "https://www.marketwatch.com/story/stock-market-investors-biggest-election-fear-a-contested-outcome-11597785560", "published": 1597829180.0, "headline": "Why stock-market investors are bracing for the â\u0080\u0098most litigatedâ\u0080\u0099 election in U.S. history", "body": "Florida 2000: The stuff of nightmares. Rhona Wise/Agence France-Presse/Getty Images Analysts will continue filling up research reports with guesses about what a Joe Biden presidency or a Donald Trump re-election victory would mean for the stock market. But nothing is likely to shake up financial markets come Nov. 4 â\u0080\u0094 the day after the election â\u0080\u0094 quite like an unclear outcome. For anyone whoâ\u0080\u0099s been paying attention to the bitter 2020 presidential race, itâ\u0080\u0099s a scenario that isnâ\u0080\u0099t easy to dismiss. This yearâ\u0080\u0099s election already looks likely to be â\u0080\u009cthe most litigated in history,â\u0080\u009d wrote Thomas McLoughlin, head of Americas fixed income at UBS , in a Tuesday note. Plaintiffs have filed 192 lawsuits in at least 41 states arising from changes to voting procedures in the wake of the COVID-19 pandemic, he said. Combined with other lawsuits that predate the coronavirus outbreak, the total number of challenges rises to more than 200. Read: Why the dollarâ\u0080\u0099s fall could turn into a rout if â\u0080\u0098political disarrayâ\u0080\u0099 continues Postmaster General Louis DeJoy on Tuesday sought to reassure voters over fears the U.S. Postal Service would be unable to handle a surge in mail-in voting, announcing the agency would suspend operational changes, including removing mailboxes and sorting machines, ahead of the November election. See: Postal service head pledges to handle â\u0080\u0098whatever volumeâ\u0080\u0099 of election mail received in November Such moves, which DeJoy had implemented in what the agency had said were efforts to cut costs, drew scrutiny from Democrats. They accused the administration of seeking to slow the delivery of ballots in response to President Trumpâ\u0080\u0099s opposition to universal mail-in voting. Trump, who trails Biden in national polls, has charged that mail-in voting carries the potential for widespread fraud, though studies have found no such evidence. A study by the conservative Heritage Foundation and reviewed by the liberal Brookings Institution found fewer than 50 instances of voter fraud in a sample of the five states that use mailed ballots exclusively, McLoughlin noted. But a delayed outcome, even with few added postal service hangups, remains a significant possibility given the potential crush of mail-in votes this year. After all, it took six weeks to certify results for two congressional primaries in New York this summer, while the outcome of Utahâ\u0080\u0099s close Republican gubernatorial primary was delayed for a few days as absentee ballots were counted, the analyst noted. Meanwhile, if the popular vote in battleground states is close, itâ\u0080\u0099s likely some states would be counting absentee ballots well into the evening of Nov. 3 and the following day, McLoughlin said, noting that a handful of battleground states, including North Carolina, Iowa, and Ohio, only require that the ballot be postmarked by Election Day and received shortly thereafter to be counted. So what happens if the outcome is unclear? Investors can look back to the 2000 presidential election, which wasnâ\u0080\u0099t decided until mid-December as lawyers and surrogates for Democrat Al Gore and Republican George W. Bush engaged in a battle over Florida recounts that saw terms like â\u0080\u009cbutterfly ballotâ\u0080\u009d and â\u0080\u009changing chadsâ\u0080\u009d enter everyday conversation. The S&P 500 SPX, +0.87% fell 8.4% between election day on Nov. 7 and Dec. 15, the day after Gore conceded in the wake of a Supreme Court ruling that ended the recount (see chart below). McLoughlin noted that the Dow Jones Industrial Average DJIA, +0.56% fell more than 5% in the two weeks following the election as litigation â\u0080\u009cthreatened to prolong the uncertainty,â\u0080\u009d while subsequent academic research indicated the most adverse market reaction occurs in the first four days after an unclear election outcome. Gold prices GOLD, +2.86% rose amid the uncertainty in 2000, but retraced their gains in the following weeks. Investors â\u0080\u009cshould be prepared for volatility in the event of an inconclusive result. Markets abhor uncertainty, so it is reasonable to expect safe havens such as gold and U.S. government securities to offer some refuge,â\u0080\u009d he said. But itâ\u0080\u0099s too early to make any portfolio adjustments, he said, while also emphasizing that any initial volatility â\u0080\u009cshould dissipate over time.â\u0080\u009d"}]}