{"article": [{"url": "https://www.marketwatch.com/story/new-research-underscores-benefits-of-steroids-in-severely-ill-covid-19-patients-2020-09-02", "published": 1599045560.0, "headline": "New research underscores benefits of steroids in severely ill COVID-19 patients", "body": "There is growing scientific consensus that steroids like dexamethasone should be the leading treatment option for severely ill COVID-19 patients, according to three new studies published Wednesday in JAMA. Researchers at the University of Oxford in the U.K. reported in mid-June that low doses of dexamethasone reduced deaths in hospitalized COVID-19 patients on ventilators by one-third or those receiving oxygen support by one-fifth. The new studies reinforce the benefits of steroids when treating some severely ill coronavirus patients. \"These trials and the meta-analysis have strengthened confidence, further defined the benefit, and shifted usual care of COVID-19-related ARDS to include corticosteroids,\" researchers wrote in an accompanying editorial. \"However, many clinically important questions remain.\" The World Health Organization on Wednesday recommended corticosteroids for patients with severe forms of COVID-19. One prospective analysis of seven randomized trials in 12 countries that enrolled 1,703 critically ill patients found that corticosteroids were associated with lower mortality. The study examined trials conducted between Feb. 26 and June 7. In each trial, patients received dexamethasone, hydrocortisone, or methylprednisolone, all steroids, or the standard of care or placebo. A second study found that intravenous dexamethasone, when used in combination with the standard of care, kept hospitalized COVID-19 patients off ventilators longer. The research study, conducted by researchers in Brazil, involved 299 patients who were treated between April 17 to June 23; 151 received the steroid and the standard of care, while the remaining patients received only the standard of care. A third randomized, placebo-controlled clinical trial in France that examined 149 critically ill COVID-19 patients in intensive care between March 7 and June 1 was halted early when early findings showed no difference between hydrocortisone and the placebo groups at day 21. However, researchers said the study was \"likely underpowered.\""}]}