{"article": [{"url": "https://www.marketwatch.com/story/are-you-bankrolling-your-adult-kids-in-a-crisis-2020-07-01", "published": 1593580160.0, "headline": "Are you bankrolling your adult kids in a crisis?", "body": "This article is reprinted by permission from NerdWallet. Financial fallout from the pandemic is hitting millennials hard — and many will soon turn to their parents for help, if they haven’t already. Before parents ride to the rescue, financial planners urge them to map out a strategy that doesn’t just plug a short-term need but also makes sense in the long run. “Often the heartstrings will get pulled — ‘I really have to help them!’— but it can be detrimental to the parent,” says certified financial planner Jeffrey L. Corliss of Westport, Connecticut. (Of course, financial aid can flow the other way, as many millennials help support their parents. I’m addressing parents here, but most of the advice applies to kids helping their folks as well.)Millennials losing jobs, income Even before the pandemic, millennials had lower median incomes, far more debt and a much smaller slice of the nation’s wealth than boomers had at the same age. Millennials — usually defined as those ages 24 to 39 — are more likely than older generations to have lost jobs or household income because of the pandemic, various surveys show. “I’ve already seen clients coming in, worried about their kids,” says CFP Deborah Badillo of Miami. “‘They’re going to lose the house! What can I do to help them?’”Have them explore alternatives Encourage your kids to take full advantage of available financial help before extending yours, Badillo says. They may not know, for example, that unemployment benefits have been dramatically expanded because of the pandemic. Weekly payments are higher and are available to people who normally wouldn’t qualify, including gig workers, the self-employed and people whose hours have been reduced. Related: How to get your grown kids to stop using your credit cards In addition, there are many more options for people struggling to pay debt. Most mortgages qualify for forbearance programs that allow homeowners to skip payments for up to a year. Hardship programs have been added or expanded by credit card companies and other lenders. Federal student loan payments have been paused until Sept. 30, and income-driven programs can reduce payment amounts after that. Another option is a coronavirus hardship withdrawal, which allows people to tap their IRAs and 401(k)s without penalty if they were physically or financially affected by COVID-19. The withdrawals are taxable, but if the money is paid back within three years those taxes are refundable. Raiding retirement funds isn’t ideal, of course, but your kids have many more years to replenish their retirement savings than you do.Assess your own situation While your kids are filing for unemployment and calling their lenders, take a moment to assess your own finances. Where will the cash for your kids come from? It’s one thing to give away money you’ve been saving for a vacation, since you’re unlikely to travel soon anyway. It’s quite another to undermine your own ability to retire or handle a layoff or other setback. See: Feeling helpless and hopeless, many millennials face an early midlife crisis Some parents make a conscious decision to operate with a smaller cushion, or to delay their retirements, to help their children, says CFP Lazetta Rainey Braxton in New York. Just keep in mind that you may not get to decide when you retire. Many workers retire earlier than expected, often because of a health problem or job loss. Helping your children now could mean you have to lean on them later, Braxton says. If you’re not sure how this financial aid will impact your future finances, a consultation with a fee-only financial adviser could bring you some clarity.Set some boundaries Financial planners typically recommend deciding how much to give, and then setting clear boundaries about when the financial help will end. That’s tricky now, of course, because no one knows how long the current economic crisis will last. Also see: 4 ways to build your wealth and make it last longer But parents can still set expectations in other ways, financial planners say. If the child didn’t have an emergency fund, for example, parents can discuss the importance of saving money out of every future paycheck, so the child won’t have to rely on family help again, Braxton says. “Some parents will just put on a Band-Aid and give them money, but they really haven’t helped in terms of their financial capacity,” Braxton says. If an adult child is moving back home, Corliss suggests a written contract outlining chores and responsibilities, such as how soon they’ll be expected to move out after finding a job. A similar end date can be set for any cash the parents hand out. Corliss says the message should be clear: “We expect you to get on your feet as soon as you can.”More from NerdWallet: Mortgage Relief Programs for Homeowners Hit by the Coronavirus Crisis What Is a Credit Card Hardship Program? Cashing Out a 401(k) Due to COVID-19? Consider These Things First Liz Weston is a writer at NerdWallet. Email: lweston@nerdwallet.com. Twitter: @lizweston."}]}