{"article": [{"url": "https://www.marketwatch.com/story/us-factory-orders-climb-62-in-june-signaling-steady-manufacturing-recovery-2020-08-04", "published": 1596560780.0, "headline": "U.S. factory orders climb 6.2% in June, signaling steady manufacturing recovery", "body": "The numbers: U.S. factory orders rose 6.2% in June to mark the second increase in a row, pointing to a steady rebound after widespread shutdowns in the early stages of the pandemic. Economists polled by MarketWatch had predicted a 4.6% increase. See: MarketWatch Economic Calendar Even after a spike in coronavirus cases since June, the early evidence suggests that manufacturers made further strides in July as well. A survey of industry executives rose to a 15-month high, according to a closely report produced by the Institute for Supply Management. Read:Manufacturers expand for 3rd straight month, but not all the jobs are coming back What happened: Orders for durable goods rose a revised 7.6% in July, the government said Tuesday, a bit higher than the initially reported 7.3% increase. Orders for non-durable goods such as oil, chemicals and textiles and advanced 5%, the Commerce Department said. Read:Job trouble? Wave of rehiring after economy reopened to fade in July after viral spiral Big picture: The manufacturing side of the U.S. economy strengthened further in July even as some states reimposed restrictions to combat the latest coronavirus spike. Yet production remains well below precrisis trends and businesses say they are still plagued by uncertainty. Factory orders are off 10% from a year earlier. Until the virus is brought under control, American factories are expected to produce fewer goods with fewer workers, making it harder for the economy to fully recover. Read: Economy suffers titanic 32.9% plunge in 2nd quarter, points to drawn-out recovery Also:‘A massive welfare economy’ - federal aid prevents even steeper GDP collapse Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% rose modestly in Tuesday trades."}]}