{"article": [{"url": "https://www.marketwatch.com/story/activist-investors-are-the-unexpected-heroes-of-the-pandemic-for-u-k-stocks-unlike-in-u-s-and-europe-11602241838", "published": 1602263420.0, "headline": "How activist investors in U.K. stocks beat their counterparts in U.S. and Europe", "body": "U.K. companies targeted by activists outperformed the market by an average of 1.5% during the coronavirus pandemic. daniel leal-olivas/Agence France-Presse/Getty Images When it comes to activist investing during the pandemic: buy British. That is the conclusion of a new study from consulting firm Alvarez & Marsal (A&M), which looked at the share performance of 245 corporates after they were targeted by activists during the six months to the end of August. It found that U.K. companies targeted by activist investors during the period outperformed the Stoxx Europe 600 equity benchmark by 1.5%. European companies targeted by activists did less well, outperforming the same index by just 0.1%, while U.S. targets underperformed the S&P 500 index by 5.8% over the same time frame. “The diverging performance of activist targets across the regions underlines that activists are playing by different national rules. The more collaborative approach U.K.-focused activists typically take with boards can leave corporates better equipped to react quickly to external shocks, such as COVID,” said Malcolm McKenzie, managing director at A&M. “In contrast, the generally more hostile nature of U.S. campaigns has taken its toll on share performance amid COVID, distracting management desperately trying to navigate the COVID disruptions,” he added. Read: Shareholder Activists Are Ripping Up Their Traditional Playbook. But Passivism Won’t Last Long. A&M’s analysis comes as activists are set to ramp up the number of campaigns in coming months, as they seek to take advantage of lower stock prices to press for changes at companies. On Wednesday, activist investor Daniel Loeb urged entertainment giant Walt Disney DIS, +1.53% to skip paying its $3 billion annual dividend and instead pour the funds into hits for its subscription streaming service, as it looks to compete with Netflix NFLX, +1.43% and Amazon AMZN, +3.01%. Meanwhile, Nelson Peltz’s Trian Fund Management has built up stakes in Invesco IVZ, +1.23% and Janus Henderson JHG, +2.37%, and plans to push for consolidation to create a rival to the biggest asset managers in the world. U.K. targets also outperformed their European and U.S. rivals over a longer time period. Activist campaigns including a mergers and acquisitions component also had a positive impact on the share price of their targets, outperforming the market by 2.8% over the two-year period. However, this slumped significantly to -2.9% in the six months during the COVID-19 pandemic. A&M attributed this, in part, to the slowdown in merger activity during the pandemic, and the subsequent failure to deliver the share price increases that had been assumed by the market. However, deal making has since picked up, with global M&A volumes surging to $1 trillion over the summer, according to data provider Refinitiv — the best third quarter since it started tracking numbers in 1998. Read: Wall Street banks net $64 billion in fees in bumper year for M&A and IPOs In September, U.K. rail and bus operator FirstGroup FGP, +7.45% said that it had received “significant interest from potential buyers” of its U.S. businesses that it put up for sale following pressure from Coast Capital Management, which holds more than 10% of its stock. Activist campaigns focused on governance demands were comparatively disappointing, with an average underperformance of -6.7% after one year. This improved significantly during the second year, with an average outperformance of 4.7%, leading to a two-year underperformance of 2%."}]}