{"article": [{"url": "https://www.marketwatch.com/story/america-is-a-slightly-better-place-to-retire-but-theres-plenty-of-room-for-improvement-2020-09-29", "published": 1601547680.0, "headline": "America is a slightly better place to retire - but there's plenty of room for improvement", "body": "The United States ranked No. 16 in an annual assessment of well being and financial security for retirees around the world - an improvement from last year - but it still has work to do to ensure Americans have retirement security in their old age. The Global Retirement Index of 44 countries, which is in its eighth year and sponsored by French investment bank Natixis, examines 18 factors for retirement security across four categories, including finances, health, material well being and quality of life. Northern European countries, including Iceland, Switzerland and Norway, continued to dominate the rankings. Ireland, the Netherlands, New Zealand, Australia, Canada, Denmark and Germany made up the remaining top 10 of the list. What if I'm in my 40s and don't have a retirement fund? The U.S. may have jumped up from No. 18, but there were glaring inconsistencies in how the country ranks for well being in retirement, said Dave Goodsell, Executive Director of the Natixis Investment Managers Center for Investor Insight. The country had high scores for investment in health care per capita, for example, yet it saw a decline in life expectancy. The U.S. placed sixth in the world for income per capita, which shows there is an opportunity for Americans to save more for retirement - still, recent studies and surveys consistently find many people are not prepared for retirement. See: Entering retirement in the middle of a health and financial crisis? How to handle your money and your emotions There are five critical risks to retirement security, according to the Natixis report: a recession, where unemployment has the potential to drive up debt and derail any retirement plans; interest rates, which while hovering at low levels could diminish portfolio returns and balances; public debt, a figure that is rising as the country spends on stimulus and financial aid; climate and natural disasters, leaving some retirees even more vulnerable than normal; and economic inequality, which shows imbalances in lifetime earnings and retirement stability for people of different races and gender. The pandemic will likely exacerbate these findings, Goodsell said. The data used in this report is based on 2019 figures, but the trends of a recession, interest rates and climate issues are expected to continue into the coming years. \"It is a challenge to look at going forward,\" he said. \"The challenge will always be how do you balance these things?\" Interest rates could be especially troublesome for retirees in the U.S. A low interest rate environment is good for consumers, such as those looking to purchase a home, but it can be problematic for retirees who unintentionally draw down more of their portfolios because of these rates, or pension managers, who are held responsible for paying future balances and the inflated values these rates will bring. Also see: The coronavirus could bring systemic changes to our health care system and retirement safety net - but don't expect it anytime soon Americans are trying to combat the effects of the pandemic, and the government did help financially at the beginning of the crisis with the CARES Act, which provided funding to small businesses and individuals across the country. But more can - and needs - to be done, experts argue. More than a third of people said an unanticipated job loss pushed them into retirement sooner than they expected, and a quarter said a health issue did, according to the Retirement Risk Readiness survey from Allianz Life Insurance - that was in January, before the pandemic began. The coronavirus crisis has not only changed Americans' expected retirement date - but how much they'll need to save before they get there, another study from the New School's Schwartz Center for Economic Policy Analysis found. Americans need about 70% of their preretirement income to live comfortably in retirement, the center said, but many workers who retire at age 62 have a replacement ratio of 55% instead, and that figure is expected to drop to 48% in response to the pandemic."}]}