{"article": [{"url": "https://www.marketwatch.com/story/president-trump-running-for-re-election-is-faking-it-on-the-economy-and-the-pandemic-11598372253", "published": 1598431160.0, "headline": "Trump is faking it on the economy, just as heâ\u0080\u0099s faking it on the pandemic, just as heâ\u0080\u0099s faked everything his whole life", "body": "You need 270 electoral votes to be elected president. Donald Trump fakes empathy. Evan Vucci/Associated Press When my daughter was about 4 years old, she had a great friend who would lead them on wonderful adventures. â\u0080\u009cLetâ\u0080\u0099s fake that we are grown-ups,â\u0080\u009d sheâ\u0080\u0099d say in a memorable phrase. â\u0080\u009cLetâ\u0080\u0099s fake that we are explorers.â\u0080\u009d Or â\u0080\u009cletâ\u0080\u0099s fake that weâ\u0080\u0099re having a tea party.â\u0080\u009d It was my job to go over after a couple of hours and gently tell her: â\u0080\u009cMake-believe time is over. Letâ\u0080\u0099s go scrub the real dirt off your face, put some real food in your body, and get you ready to have more wonderful adventures in your dreams.â\u0080\u009d Donald Trumpâ\u0080\u0099s father never told him to stop pretending. Heâ\u0080\u0099s been faking his whole life. Faking that he built successful companies. Faking that he is a strong leader. Faking that he is a good family man. Faking wisdom and expertise and reverence. Faking that he loves America more than himself.Trumpâ\u0080\u0099s own fake news Faking it is the only thing Donald Trump has ever been good at. Weâ\u0080\u0099re finding out more of the details of how he built his real estate empire on a pile of lies and a mountain of unpaid taxes. His career in show business was built on faking being a boss. His political career was built on lies about Barack Obama, Hillary Clinton, immigrants, Gold Star parents, his Republican primary opponents, and the help he sought and got from Russia. “ His economic policies have been just like Trump himself: Loud, brash and largely ineffective. ” And his presidency has been an endless deep fake, especially the lie that the economy, which hundreds of millions Americans built, is his achievement alone. Now read: Why presidents shouldnâ\u0080\u0099t get credit or blame for the economy Donald Trump did not build that economy. His signature policiesâ\u0080\u0094a hugely irresponsible and unnecessary tax giveaway to corporations and the wealthy, a mindless trade war with all of our trading partners, and the wholesale abolition of regulations that keep workers, consumers, the environment and the economy safeâ\u0080\u0094had almost no effect on the growth rate or the number of jobs or the stock market. His economic policies have been just like Trump himself: Loud, brash and largely ineffective. Now read: Trump didnâ\u0080\u0099t transform the economyâ\u0080\u0094itâ\u0080\u0099s mostly the same as it was under Obama Here are the facts, using the same metrics that Trump himself brags about: U.S. gross domestic product grew at a 1.9% annual rate from the time Trump was inaugurated in 2017 through first quarter of this year when the coronavirus hit, a bit slower than the 2.4% annual growth rate in the equivalent period just before Trump took office. Job growth slowed slightly over that same period, from 223,000 per month under Obama to 185,000 under Trump. The total annual return of the S&P 500 SPX, +0.87% Index rose slightly over that period, from 9.3% under Obama to 11% under Trump. Not only did Trump not build the best economy ever, he didnâ\u0080\u0099t budge it from its trend. Until the coronavirus hit.Pandemic exposes Trump The coronavirus has exposed all of Donald Trumpâ\u0080\u0099s fakery. He doesnâ\u0080\u0099t understand the economy any better than he understands the pandemic. Thatâ\u0080\u0099s part of the reason the U.S. is failing so badly, with than 5.7 million COVID cases and 28 million people collecting unemployment checks. Prophetic: Audaciously, Trump is running for re-election as the Hero of the Coronavirus War Whatâ\u0080\u0099s more, he doesnâ\u0080\u0099t understand the presidentâ\u0080\u0099s role in a crisis, which is to be a steady leader who inspires us all make the necessary sacrifices to achieve success. Such a leader must level with the people about the task ahead while at the same time giving us hope and strength. He or she must not be afraid to show humility in the face of new and unexpected challenges. She or he must not be afraid to admit mistakes, or to ask for help. In other words, a crisis is no time to fake it. Character counts in times like these. “ You donâ\u0080\u0099t have to fool all the people all the time; you just need 270 electoral votes. ” Trumpâ\u0080\u0099s responses to the pandemic and to the economic crisis it created have been a failure. Trump has failed to grasp what almost everyone else has: That the economy cannot recover fully unless the pandemic is brought under control. There is no trade-off between the public health and a strong economy, because the economy can never recover until itâ\u0080\u0099s safe to go about our lives again. The economy had to be locked down to give public health authorities time to prepare to defend the nation against the virus. But that time was squandered. Hospital capacity was beefed up as required, but the other essential steps to control the pandemic werenâ\u0080\u0099t taken, in part because Trump failed as a leader. “ A crisis is no time to fake it. Character counts in times like these. ” His failure began with his lack of empathy for those stricken, and it continued with his attempt to shift the blame for his own failures onto China. He refused to coordinate the complex task of quickly testing for infections, tracking possible vectors and isolating the infectious, which is the only way to contain the virus absent an effective and universal vaccine. When he did try to lead us, it was mostly in the wrong direction. He denied the severity of the virus, he promoted quack cures, and he fought against and politicized the common-sense measures that would have made a difference, such as wearing masks and avoiding large crowds. He undermined the authority of his own experts and even questioned the value of testing. He still brags about the one bold step he took, but that was ineffective, because his ban on travel from China and Europe didnâ\u0080\u0099t stop U.S. residents from bringing the virus into the country. Economic catastrophe His response to the economic crisis was nearly as bad. He wisely kept out of the way in the early days when Democrats and Republicans in Congress actually agreed to the large CARES relief package, which gave or lent billions to small businesses, families and unemployed workers to bide them over. Soon enough, Trump began to agitate to reopen everything before the testing, tracking and isolation regime was ready. Under his direction, governors prematurely removed the restrictions on social distancing and allowed the virus to spread further. Then Trump began to promote quack cures for the economy, such as a payroll-tax holiday that would do nothing for those suffering the most, or a capital-gains tax cut that would further reward the wealthy, who have largely escaped the worst of the pandemic, both physically and financially. He expressed no interest in renewing the relief measures that had already worked. And so we still donâ\u0080\u0099t have a relief package, a month after many effective measures expired. Itâ\u0080\u0099s no surprise that job growth is slowing and consumer confidence is tumbling. Trump denies the depth of economic misery, and blames those whoâ\u0080\u0099ve been laid off for not rushing back into unsafe working conditions. He demands that schools and sporting events return to business as usual without taking any precautions. He insists that everything will be OK, but does nothing to hasten that day. Great salesman And yet, Trump gets his best marks from voters on his handling of the economy. Despite all the evidence to the contrary, many still believe that heâ\u0080\u0099s the genuine article, not a fake. Trump may be a lousy president, but heâ\u0080\u0099s a great salesman and he knows better than most that if you boast with confidence, thereâ\u0080\u0099s almost nothing you canâ\u0080\u0099t persuade people to believe. Some people run on their record, but Trump knows itâ\u0080\u0099s better to lie about your record and run on that. People often confuse confidence for competence. You donâ\u0080\u0099t have to fool all the people all the time; you just need 270 electoral votes. Trump is running for re-election, but he has no concrete plans for his second term, just a list of wishes. He still doesnâ\u0080\u0099t have a strategy for getting the virus under control, or for reopening the economy safely. For the first time ever, the Republican Party is refusing to adopt a party platform. The party that made its mark fighting against slavery and communism and in favor of freedom and limited government now finds itself unable to articulate what it believes in beyond blind loyalty to the supreme leader. Trump himself has no idea what he would do in a second term. Friendly interviewers have given him softball questions about what he hopes to achieve in the next four years, but he always comes up blank. Instead of a party platform, Trumpâ\u0080\u0099s campaign has released a list of 50 â\u0080\u009ccore prioritiesâ\u0080\u009d for a second term, but the list is remarkably short on specifics. It reads like a list of New Yearâ\u0080\u0099s resolutions, with lofty goals such as creating 10 million jobs, â\u0080\u009creturning to normal in 2021â\u0080\u009d and wiping out global terrorism, along with garden-variety graft such as â\u0080\u009cexpanding opportunity zones.â\u0080\u009d The only things missing are the vows to lose 10 pounds and to call your sister more often. In other words, Trump is still faking it. He knows what people want to hear, but he has no clue how to make any of it happen. Unfortunately, Trumpâ\u0080\u0099s presidency is not a game of make-believe. Itâ\u0080\u0099s as real as 24 million people out of work, and as final as 177,000 deaths. Iâ\u0080\u0099m here to tell you gently: Make-believe time is over. Rex Nutting is a columnist for MarketWatch who has covered economics and politics for 25 years."}]}