{"article": [{"url": "https://www.marketwatch.com/story/mastercard-stock-gains-after-earnings-top-expectations-2020-07-30", "published": 1596112940.0, "headline": "Mastercard earnings dip as COVID-19 limits spending but drives greater demand for antifraud services", "body": "Mastercard Inc. delivered better-than-expected second-quarter results Thursday even as revenue and earnings declined due to weaker consumer spending during the pandemic. Shares were off 0.7% in midday trading. While areas like travel spending remain weak, pressuring Mastercard’s MA, +2.09% payment volumes, the company saw an increase in services revenue, indicating greater demand for cybersecurity offerings and other products that help merchants address the surging interest in e-commerce amid the COVID-19 crisis. The company saw second-quarter net revenue drop to $3.34 billion from $4.11 billion a year before, while the FactSet consensus was for $3.25 billion. The company said that the “other revenue” line, which includes cybersecurity tools, data analytics, and other services, was up 12%, or 14% on a constant-currency basis, driven mainly by booming demand for those services, with some benefits from acquisitions. Chief Financial Officer Sachin Mehra said on Mastercard’s earnings call that the company is seeing improved spending levels in July relative to June. The U.S. is showing positive growth relative to a year ago and Europe seems to be seeing a faster recovery than some other regions, “which could bode well for us given our strong position in Europe,” according to Mehra. Read: Visa tops earnings expectations, but travel category remains slow to snap back Mastercard’s gross dollar volume for the quarter dropped 10% while cross-border volume fell 45%. President Michael Miebach said that cross-border volume, or the value of transactions made between shoppers and merchants originating in different countries, has been improving and could continue to get better even before a COVID-19 vaccine becomes widely available. “Once border restrictions are lifted, we will see some increase there,” he said on the earnings call. “So that is the first step, then you go into therapeutics and vaccines.” Miebach noted that Mastercard was seeing “some early green shoots” in Europe as countries there began easing travel restrictions. “People do get into their cars and drive across borders,” said Miebach, who is due to take over as chief executive in January. Mastercard disclosed that contactless transactions represented 37% of those made in person during the quarter, up from 28% a year earlier. “The use of contactless is proliferating widely,” Mehra told MarketWatch. In markets that were earlier to adopt contactless payments, transit systems often served as a popular early use case that prompted people to eventually try tap payments for small purchases in other settings. Public transit ridership is down in the U.S., which is later to the game in terms of adoption, but Mastercard is seeing contactless growth in everyday spend categories like groceries, which could translate into broader adoption once people resume more normal lifestyles. Mehra said that the pandemic has prompted some e-commerce skeptics to dive into online purchases out of necessity, including for things like online grocery orders. “We think a lot of them will retain their habits from an online commerce standpoint,” he said. “It’s all about muscle memory.” Mastercard benefits from greater e-commerce adoption as this cuts into purchases that may have otherwise been made with cash or checks. PayPal CEO: ‘I don’t think there is any going back’ from e-commerce after COVID-19 After pausing its share-repurchase program in the second quarter, Mastercard resumed the program in the third quarter and has bought back about 3.3 million shares at a cost of $1 billion so far in the period. “We feel a little bit more certain about the environment,” Mehra said, as the company deems the U.S. to be in the “normalization” phase of the crisis, the third rung on Mastercard’s four-tiered approach to pandemic recovery. The company posted net income of $1.4 billion, or $1.41 a share, down from $2.05 billion, or $2 a share, in the year-prior quarter. Mastercard’s adjusted earnings per share fell to $1.36 from $1.89, while analysts surveyed by FactSet had been expecting $1.16. Mastercard shares have added 12% over the past three months, as the S&P 500 SPX, +0.87% has added 11%."}]}