{"article": [{"url": "https://www.marketwatch.com/story/commerzbank-taps-deutsche-bank-exec-to-be-next-ceo-2020-09-28", "published": 1601259260.0, "headline": "Commerzbank taps Deutsche Bank exec to be next CEO", "body": "Commerzbank AG named Manfred Knof, head of rival Deutsche Bank AG's private bank in Germany, as its new chief executive, putting a banking- and insurance-industry veteran in charge of likely deeper cost cuts at the German lender. Like most European lenders, Commerzbank is struggling to earn money while interest rates remain low or negative, and faces stiff competition in its heavily banked home market. Mr. Knof, who will take over in January, will succeed current CEO Martin Zielke, who resigned along with Commerzbank's chairman in July after acknowledging he had failed to sufficiently turn around the bank. Commerzbank's new chairman, Hans-Jörg Vetter, said Mr. Knof has the \"necessary expertise and human leadership skills for the tasks that lie ahead.\" U.S. investor Cerberus Capital Management, which holds more than 5% of Commerzbank, complained last summer the bank didn't have a coherent strategy and wasn't executing on \"progressively less ambitious\" plans. It said it wants deeper cuts and two board seats, a request Commerzbank has shunned. Cerberus didn't immediately respond to a request for comment on Mr. Knof's appointment. Germany continues to be Commerzbank's largest shareholder, with a roughly 15% stake after a financial crisis-era bailout. Mr. Knof, 55 years old, has been head of Deutsche Bank private bank in Germany, and until 2017 was CEO at Allianz Deutschland AG. His appointment comes in a year that has included leadership changes at several large European banks, including Credit Suisse Group AG, UBS Group AG and ING Groep NV, as earlier restructurings of the lenders were wrapped up and the sector prepares for an expected phase of consolidation. Commerzbank is going through an overhaul centered around job cuts and branch closures to improve its profitability. It briefly held talks last year to merge with larger rival Deutsche Bank as a possible way to carve out duplicate costs while scaling up in lending. Since then, an important slice of Commerzbank's customer base, Germany's Mittelstand market of small and medium-size companies, has been hit especially hard by the coronavirus pandemic. On Friday, Moody's Investors Service changed the outlook on the bank's A-1 rating to negative from stable, saying there are uncertainties around how Commerzbank will keep funding its balance sheet, which grew by about 19% this year from companies drawing more loans and the bank's taps of cheap funding from the European Central Bank. Commerzbank signaled Mr. Knof will help it to digitize its operations further, another industrywide move that is costing banks billions of dollars to bring more banking online and to automate processes. Combining forces on the spending is one more driver for bank mergers, banking analysts say. Write to Margot Patrick at margot.patrick@wsj.com"}]}