{"article": [{"url": "https://www.marketwatch.com/story/clueless-investors-just-keep-driving-this-stupidly-bullish-stock-market-higher-cnbcs-jim-cramer-says-2020-08-05", "published": 1596632960.0, "headline": "â\u0080\u0098Cluelessâ\u0080\u0099 investors just keep driving this â\u0080\u0098stupidly bullishâ\u0080\u0099 stock market higher, CNBCâ\u0080\u0099s Jim Cramer says", "body": "“ â\u0080\u0098Sometimes the market rallies and it makes perfect sense. Then there are days like today, when I canâ\u0080\u0099t take how stupidly bullish this market can be.â\u0080\u0099 ” Thatâ\u0080\u0099s CNBC â\u0080\u009cMad Moneyâ\u0080\u009d host Jim Cramer shaking his head at â\u0080\u0098cluelessâ\u0080\u0099 investors who ignored multiple warning signs to buy up stocks during Tuesdayâ\u0080\u0099s bullish trading action. â\u0080\u009cNever underestimate the power of enthusiastic buyers who do not know what theyâ\u0080\u0099re doing,â\u0080\u009d he said after the Dow Jones Industrial Average DJIA, +0.56% Â finished the session with a triple-digit gain. The S&P 500 SPX, +0.87% Â and Nasdaq Composite COMP, +1.39% Â also ended higher. He specifically pointed to oil giant BP BP, -0.74% Â and biopharma firm Sorrento SRNE, +0.67% Â as examples. Thereâ\u0080\u0099s â\u0080\u009cplenty of stupidity,â\u0080\u009d he said, â\u0080\u009cespecially during earnings season when thereâ\u0080\u0099s so much news that itâ\u0080\u0099s hard to keep track of whatâ\u0080\u0099s going on.â\u0080\u009d BPâ\u0080\u0099s surge, in particular, didnâ\u0080\u0099t sit right with Cramer, who said it might be the â\u0080\u009cdumbest actionâ\u0080\u009d so far this year. â\u0080\u009cNot only are they telling you business is terrible, BP is trying to distance itself from crude while preserving cash, but maybe that dividend hike was a mistake,â\u0080\u009d he said. In Sorrentoâ\u0080\u0099s case, Cramer pointed out the stock barely rallied last week when the company announced a new saliva-based Covid-19 test that yields results within half an hour. But then on Tuesday, the stock surged for the same reason. â\u0080\u009cThe stock marketâ\u0080\u0099s supposed to be efficient,â\u0080\u009d he said, â\u0080\u009cbut somehow it took Wall Street six days to process this news.â\u0080\u009d Watch this clip: As for Wednesdayâ\u0080\u0099s session, more stupidity? The Dow was up more than 300 points, at last check, while both the S&P and Nasdaq were adding to recent gains, as well. â\u0080\u009cAre any of these moves the fault of the Fed?â\u0080\u009d Cramer wrote in a separate take. â\u0080\u009cNo, the fault, as Cassius tells us, is not in our stars like Trump or Powell, but in the buyers themselves.â\u0080\u009d"}]}