{"article": [{"url": "https://www.marketwatch.com/story/black-homeownership-has-declined-since-2012-heres-where-black-households-are-most-likely-to-be-homeowners-2020-06-30", "published": 1593597680.0, "headline": "Black homeownership has declined since 2012 â\u0080\u0094 hereâ\u0080\u0099s where Black households are most likely to be homeowners", "body": "Blacks Americans are far less likely than their white peers to be homeowners â\u0080\u0094 but in some cities, they have something of a leg up. A new report from real-estate brokerage Redfin RDFN, +2.16% Â examined the national homeownership gap. Only 44% of Black families owned their homes as of the first quarter of 2020, compared with 73.7% of white households, Redfin found, based on an analysis of U.S. Census Bureau data. But on a local level, the Black homeownership rate â\u0080\u0094 and the gap in homeownership between white and Black households â\u0080\u0094 varies widely. Redfin examined these data points across all metro areas with populations over 1 million. Read more:Rents are softening nationwide â\u0080\u0094 but hereâ\u0080\u0099s where they are falling the most Washington, D.C., was the only city in the country where a majority of Black households were homeowners, with a homeownership rate of 51%. And half of Black families in Birmingham, Ala., were homeowners. Thatâ\u0080\u0099s a major shift from 2012, when there were six cities where 50% or more of Black households owned their homes, and overall most cities have seen a decrease in the Black homeownership rate. The decline in Black homeownership since 2012 is a reflection of the impact of the Great Recession. During the housing crisis, Black households faced foreclosure at twice the rate of their white neighbors, largely because Black homeowners were targeted with subprime loans, research shows. The financial hit Black communities took because of the recession was larger than other groups, making it harder for them to recover. At the other end of the spectrum, only 25% of Black families in Minneapolis are homeowners, the lowest rate in the nation. Minneapolis also had the largest racial homeownership gap in the country, with a 51-point difference between the Black and white homeownership rates. Metro area Black homeownership rate (2018) White homeownership rate (2018) Median home-sale price (2018) Washington, D.C. 51% 72% $399,000 Birmingham, AL 50% 78% $199,900 Richmond, VA 49% 75% $246,500 Philadelphia, PA 48% 76% $229,000 New Orleans, LA 47% 73% $215,000 Atlanta, GA 47% 75% $236,511 Memphis, TN 46% 75% $177,000 Baltimore, MD 46% 77% $270,000 Miami, FL 45% 74% $275,000 Raleigh, NC 45% 74% $282,500 Virginia Beach, VA 44% 72% $229,900 Charlotte, NC 44% 75% $242,000 Orlando, FL 44% 70% $244,000 Jacksonville, FL 44% 72% $227,000 San Antonio, TX 44% 71% $223,458 Hartford, CT 43% 77% $219,500 Austin, TX 43% 65% $309,000 Nashville, TN 43% 72% $286,000 Riverside, CA 42% 71% $360,000 Houston, TX 42% 72% $236,990 Detroit, MI 42% 78% $177,000 St. Louis, MO 40% 77% $177,333 Chicago, IL 40% 75% $240,000 Denver, CO 38% 70% $405,000 Tampa, FL 38% 71% $224,990 Kansas City, MO 37% 72% $210,000 Louisville, KY 37% 74% $187,000 Dallas-Ft. Worth, TX 37% 69% $269,900 Indianapolis, IN 36% 73% $178,000 Cleveland, OH 36% 75% $145,714 Oklahoma City, OK 36% 70% $170,000 Tucson, AZ 36% 69% $210,000 Pittsburgh, PA 35% 74% $165,100 Columbus, OH 34% 69% $203,000 Sacramento, CA 33% 67% $395,000 Grand Rapids, MI 33% 78% $195,000 Phoenix, AZ 33% 70% $262,500 Los Angeles, CA 33% 58% $645,000 Boston, MA 33% 69% $455,000 San Francisco, CA 33% 61% $900,000 Cincinnati, OH 33% 73% $175,000 Seattle, WA 32% 65% $479,500 Portland, OR 32% 66% $391,000 Rochester, NY 32% 74% $144,000 Providence, RI 32% 68% $267,500 New York, NY 32% 67% $403,000 Buffalo, NY 32% 73% $149,900 San Jose, CA 31% 65% $1,175,000 San Diego, CA 30% 61% $569,995 Las Vegas, NV 29% 62% $270,500 Salt Lake City, UT 28% 72% $315,000 Milwaukee, WI 27% 70% $206,000 Minneapolis, MN 25% 76% $265,000 A multitude of factors have contributed to the lower rate of Black homeownership in this country. Historically, redlining policies barred Black Americans from accessing mortgage credit, preventing many of them from becoming homeowners in certain neighborhoods. The term refers to the Federal Home Loan Bank Board and the Home Ownersâ\u0080\u0099 Loan Corporation creating color-coded maps designating how risky it was for lenders to originate mortgages in different neighborhoods across the country. The neighborhoods deemed most risky were outlined in red, and those neighborhoods tended to be predominantly Black. Even before redlining practices existed, deed restrictions prevented people of color from purchasing homes in white communities. Racial covenants within the original deeds to these properties stipulated that only white people could purchase those homes. Both practices were common throughout the first half of the 20th Century and were officially outlawed through a series of laws passed in the 1960s and 1970s. However, Black Americans are still far less likely to get a mortgage, and investigations have shown that racial bias persists in the real-estate industry. The long-term effects of those historical policies remain. Homeownership is one of the main drivers of generational wealth in the U.S.; as a result the racial wealth gap remains large. Additionally, home prices are still depressed in historically redlined neighborhoods, which has stunted many Black familiesâ\u0080\u0099 ability to grow their wealth and pass it on from generation to generation. Also see:Mortgage rates keep falling to record lows â\u0080\u0094 so is now a good time to refinance? And the coronavirus pandemic threatens to exacerbate the racial gap in homeownership. â\u0080\u009cBlack and Latino people have been hardest hit by stay-at-home orders and other public-health measures put in place to slow the spread of COVID-19 because of a legacy of occupational segregation,â\u0080\u009d Urban Institute vice president of housing finance policy Alanna McCargo and senior fellow Solomon Greene, wrote in a recent report. Black and Latino households are disproportionately struggling to pay the rent, and those financial setbacks could make it more difficult to afford buying a home down the road. Additionally, 28% of black homeowners did not pay or deferred their mortgage payment in May, compared with just 9% of white homeowners, the Urban Institute reported."}]}