{"article": [{"url": "https://www.marketwatch.com/story/dr-fauci-is-cautiously-optimistic-there-will-be-a-covid-19-vaccine-by-the-end-of-2020-or-in-early-2021-2020-06-23", "published": 1592921540.0, "headline": "Dr. Fauci is cautiously optimistic there will be a COVID-19 vaccine by the end of 2020 or early 2021", "body": "WASHINGTON (AP) — Dr. Anthony Fauci said Tuesday he is cautiously optimistic there will be a COVID-19 vaccine by the end of the year or early 2021, but warned that the next few weeks will be critical to tamping down coronavirus hot spots around the country. Fauci and other top health officials also said they have not been asked to slow down testing for coronavirus, an issue that became controversial after President Donald Trump said last weekend that he had asked them to do just that because it was uncovering too many infections. Trump said Wednesday that he wasn’t kidding when he said that. “We will be doing more testing,” Fauci, the government’s top infectious disease expert, told a House committee. The U.S. has tested more than 27 million people, with about 2.3 million – or 8.4% – testing positive. The health officials returned to Capitol Hill at a fraught moment in the nation’s pandemic response, with coronavirus cases rising in about half the states and political polarization competing for attention with public health recommendations. “We’ve been hit badly,” said Fauci, infectious diseases chief at the National Institutes of Health. He said he was “really quite concerned” about rising community spread in some states. “The next couple of weeks are going to be critical in our ability to address those surges,” he said. Fauci, who heads the National Institute of Allergy and Infectious Diseases, was testifying along with Centers for Disease Control and Prevention director Dr. Robert Redfield, Federal Drug Administration chief Dr. Stephen Hahn and the head of the U.S. Public Health Service, Adm. Brett Giroir. Since Fauci’s last appearance at a high-profile hearing more than a month ago, the U.S. has begun emerging from weeks of stay-at-home orders and business shutdowns. But it’s being done in an uneven way, with some states far less cautious than others. A trio of states with Republican governors who are bullish on reopening — Arizona, Florida and Texas — are among those seeing worrisome increases in cases. Last week, Vice President Mike Pence published an opinion article in The Wall Street Journal saying the administration’s efforts have strengthened the nation’s ability to counter the virus and should be “a cause for celebration.” Then at Trump’s weekend rally in Tulsa, many of his supporters didn’t wear masks, which for some was an act of defiance against what they see as government intrusion. White House officials later tried to walk back Trump’s comment there on slowing down testing, suggesting it wasn’t meant to be taken literally. Rep. Frank Pallone of New Jersey, who chairs the Energy and Commerce Committee, said during Tuesday’s hearing that Trump’s testing comment at the rally “was an extremely reckless action, and unfortunately it continues the president’s pattern of ignoring the advice of his own public health experts.” Trump, departing the White House for a visit to Arizona on Tuesday, played down those comments, saying under his administration the U.S. is doing more testing than any other country. Trump’s trip includes a rally at a megachurch. Fauci has recently warned that the U.S. is still in the first wave of the pandemic and has continued to urge the American public to practice social distancing. And, in a recent ABC News interview, he said political demonstrations such as protests against racial injustice are “risky” to all involved. Asked if that applied to Trump rallies, he said it did. Fauci continues to recognize widespread testing as critical for catching clusters of COVID-19 cases before they turn into full outbreaks in a given community. About 2.3 million Americans have been sickened in the pandemic, and some 120,000 have died, according to data from Johns Hopkins University. Giroir was tapped by the White House to oversee the expansion of coronavirus testing. But he gained notoriety after a whistleblower complaint flagged him for trying to push a malaria drug touted by Trump to treat COVID-19 without conclusive scientific evidence. The FDA has since withdrawn its emergency use authorization for hydroxychloroquine. “There have been a lot of unfortunate missteps in the Trump administration’s response to the COVID-19 pandemic,” Pallone said. “As communities across the country ease social distancing guidance and reopen their economies, it is critically important that both the administration and Congress remain focused on containing the spread of the coronavirus and providing the resources and support Americans need during this time of crisis.” There is still no vaccine for COVID-19, and there are no treatments specifically developed for the disease, although the antiviral drug remdesivir has been shown to help some patients, as well as a steroid called dexamethasone, and plasma from patients who have recovered. Since Fauci last testified, hospital physicians have become more skilled in treating coronavirus patients with the techniques and medications at their disposal. The U.S. continues to ramp up testing, with some 27.5 million Americans, or more than 8% of the population, tested thus far. But most communities still lack enough health workers trained in doing contact tracing, the work of identifying people who have had interactions with an infected person. That could make it more difficult to tamp down emerging outbreaks. The Energy and Commerce Committee has oversight over drugs and vaccines, among other facets of the U.S. health care system. Committee Democrats have been harshly critical of the administration. However, not all Republicans have lined up to defend the White House. Some GOP members were growing concerned early in the year that the administration wasn’t doing enough to prepare."}]}