{"article": [{"url": "https://www.marketwatch.com/story/pandemic-has-boosted-online-dating-match-group-earnings-show-2020-08-04", "published": 1596628400.0, "headline": "Pandemic has boosted online dating, sending Match Group stock surging", "body": "COVID-19 has closed a lot of traditional meeting grounds for singles, but the online equivalent has been open, and apparently thriving. Match Group Inc. MTCH, -0.94% on Tuesday reported strong gains in profit and revenue in the second quarter, beating Wall Street estimates in the first full period of sheltering-in-place due to the spread of the coronavirus pandemic. Shares in the parent company of Tinder, Match.com, OKCupid and other online-dating properties are up nearly 12% in Wednesday morning trading. “Despite the pandemic, our user trends, like engagement and willingness to pay for our products, is up, proving what we’ve always known: Our products satisfy a very critical human need, and those needs aren’t going anywhere,” Chief Executive Shar Dubey said in an email. Match reported second-quarter profit of $103.1 million, or 51 cents a share, on sales of $555.5 million, up from earnings of 45 cents a share on revenue of $498 million a year ago and better than Match expected three months ago, when it guided for a sequential decrease from first-quarter revenue of about $545 million. Analysts on average expected earnings of 45 cents a share on sales of $520.3 million, according to FactSet. Match showed more confidence in its third-quarter guidance Tuesday, predicting revenue of $600 million or more. Analysts on average were projecting about $563 million in third-quarter sales, according to FactSet. The company expects at least $2.3 billion in revenue for the full year. The guidance reflects an outlook for “general stability or even slight acceleration in top-line year-over-year growth rates for the remaining two quarters of the year,” Chief Financial Officer Gary Swidler said on the Wednesday morning earnings call. Match has attempted to roll out video offerings on its online-dating properties to respond to new needs during the pandemic, and executives said in a letter to shareholders Tuesday that the effort was paying off. “Our one-to-many live-streaming video products, especially at Plenty of Fish, are seeing healthy adoption and associated revenue generation,” executives said in the letter. “We have also introduced one-to-one video chat capabilities on most of our major platforms, including Face-to-Face at Tinder.” Don’t miss: Online dating amid coronavirus means longer conversations and a ‘pivot’ to video dates Services such as video dating are important for Match’s efforts to add paying subscribers to Tinder and other properties, a big reason for its increased revenue recently. Match topped 10 million average subscribers in the quarter, an 11% gain year over year and higher than analysts’ average expectations for 9.88 million subscribers. “Since early May, we have seen a recovery in propensity to pay across the portfolio,” Dubey and Swidler wrote in the letter to shareholders. “Increases in both subscriber conversion and ARPU led to year-over-year revenue growth for almost all of our major brands in the second quarter. On top of 15% direct revenue growth for Tinder, for the first time since 2016 our non-Tinder brands delivered a second consecutive quarter of year-over-year direct revenue growth, increasing 9% in Q2.” Revenue at Tinder rose in July for the third straight month despite increased COVID-19 case numbers in many U.S. states. Though trends seem more stable in the U.S., Dubey said that Tinder has seen negative impacts in some international markets including India and Brazil. India was “the most impacted of any markets that we’ve seen thus far” and is still “under pressure,” while Brazil is “recently starting to tick back up” after challenges in May and June. The report arrives not long after a big change for Match, which completed its separation from former corporate parent IAC/InteractiveCorp. IAC, +0.79% on June 30 after starting the process almost a year ago. Match also promoted Dubey to CEO earlier this year and named a new leader for Tinder last week. Shares have gained about 13% since the separation from IAC was made official, as the S&P 500 index SPX, +0.87% has increased roughly 6%."}]}