{"article": [{"url": "https://www.marketwatch.com/story/instant-pot-has-launched-a-coffeeespresso-maker-the-instant-pod-available-exclusively-at-walmart-2020-08-27", "published": 1598698640.0, "headline": "Instant Pot has launched a coffee/espresso maker, the Instant Pod, available exclusively at Walmart", "body": "Instant Brands, the company behind the home-cook favorite Instant Pot, has launched a two-in-one coffee/espresso maker, the Instant Pod, that’s available exclusively at Walmart Inc. The Instant Pod brews both Nespresso capsules and K-Cup coffee and tea pods. K-Cup pods are produced by Keurig Dr Pepper Inc. KDP, +1.91% The machine will also work with reusable pods. Walmart WMT, +1.00% is selling the item for $119. It’s available online along with other Instant Pot items, and in stores. The Instant Pod is launching at a time when retailers are already beginning to turn their attention to the holiday season following a slow start to the back-to-school shopping period. Read:Amazon Prime Day delay, back-to-school uncertainty is changing the shopping calendar Many retailers, including Walmart and Target Corp. TGT, +1.14% , have already announced that their shops will be closed on Thanksgiving, giving workers a much-needed break after the shopping surge due to the coronavirus pandemic. Target made a holiday announcement in July, getting a jump on the important holiday period. Amazon.com Inc. AMZN, +3.01% has pushed back its Prime Day shopping event, which has typically taken place in the summer. Last year, the event took place over July 15 and 16. The Instant Pot has been a hot item during Prime Day for at least thepast couple of years. Amazon is also getting into the holiday spirit, previewing the items available for the shopping season this week. Watch:Work from home is here to stay. Here’s what it means for retail Among the gift ideas are the Breville Barista Express Espresso Machine, which is in the bestseller category and currently priced at about $700 on the e-commerce site; a JBL Boombox Portable Bluetooth Speaker; products from the Honest Beauty skin care line; and “HRH: So Many Thoughts on Royal Style,” a book about British royal family fashions by Elizabeth Holmes slated to be released in November. On Thursday, Amazon announced the launch of the Halo fitness tracker and health subscription. Walmart, Target and Amazon have all experienced a surge in sales during the coronavirus pandemic, with shares up for the year to date. Amazon stock has skyrocketed 84% for the year to date. The Amplify Online Retail ETF IBUY, +1.39% has gained 79% for 2020 so far. And the S&P 500 index SPX, +0.87% is up 8.6% for the period."}]}