{"article": [{"url": "https://www.marketwatch.com/story/stock-market-legend-who-called-3-stock-market-bubbles-says-this-one-is-the-real-mccoy-this-is-crazy-stuff-2020-06-17", "published": 1592770280.0, "headline": "Stock-market legend who called 3 financial bubbles says this one is the 'Real McCoy,' this is 'crazy stuff'", "body": "“ 'My confidence is rising quite rapidly that this is, in fact, becoming the fourth, real McCoy, bubble of my investment career. The great bubbles can go on a long time and inflict a lot of pain but at least I think we know now that we're in one. And the chutzpah involved in having a bubble at a time of massive economic and financial uncertainty is substantial.' ” That is Jeremy Grantham, co-founder and chief investment strategist at Boston-based money manager Grantham, Mayo, Van Otterloo & Co., offering up a stark warning to speculators driving the stock market to new heights amid the greatest pandemic of the past century. \"This is really the real McCoy, this is crazy stuff,\" said Grantham during a Wednesday afternoon interview on CNBC that appeared to knock some of the stuffing out of a market that had been drifting along listlessly on Wednesday. Gratham painted a very dire picture of the investment landscape in the U.S., suggesting that rampant trading by out-of-work investors and speculative fervor around bankrupt companies, including car-rental company Hertz Global Holdings Inc. HTZ, -1.78%, reflects a market that may be the most bubblicious he's seen in his storied career. Read: The rise of mom-and-pop investors in the stock market will 'end in tears,' warns billionaire Cooperman \"It is a rally without precedence,\" he told CNBC, noting that the run-up comes amid a period in which U.S. economic health is at a low point, with millions of people out of work and bankruptcies likely to continue to rise due to a slowdown in business activity and closures that have come in the aftermath of lockdowns implemented to curb the spread of the deadly COVID-19 pathogen. Markets, however, have been busting higher since hitting a low on March 23. Indeed, the Dow Jones Industrial Average DJIA, +0.56% has zoomed 40.5% higher since late March, the S&P 500 SPX, +0.87% has climbed 39% and the technology-heavy Nasdaq Composite Index COMP, +1.39% has soared more than 44% over the period, establishing an all-time high last week for the first time since Feb. 19 Grantham is worth paying attention to due to his prescient calls over the years. He said that stocks were overvalued in 2000 and again in 2007, anticipating those market downturns, the Wall Street Journal reports. Grantham also signaled that elements of the financial market had become unmoored from reality leading up to the 2008-09 financial crisis. Check out:'The dollar is going to fall very, very sharply,' warns prominent Yale economist Asked what level of exposure investors should have to U.S. equities, Grantham offered an unflinching view that may leave some bulls gobsmacked. \"I think a good number now is zero and less than zero might not be a bad idea if you can stand that.\" The investment expert noted that monetary stimulus from the Federal Reserve, whose balance sheet has jumped from $4 trillion in March to $7.21 trillion last week, and efforts by the government to help average Americans has been a factor that has helped boost equity values amid this crisis. \"Clearly, the Fed scattering money around has created a favorable environment.\" Even before the CNBC interview that aired on Wednesday, Grantham and those at his firm had been bearish. \"Uncertainty has seldom been higherâ\u0080¦oddly, neither has the stock market,\" warned Ben Inker, GMO's head of asset allocation, adding that investment company slashed its stock exposure in its flagship Benchmark-Free Allocation Strategy from 55% in March to just 25% by the end of April. Check out the Grantham interview on CNBC below:"}]}