{"article": [{"url": "https://www.marketwatch.com/story/rich-countries-may-try-to-stockpile-coronavirus-vaccine-according-to-global-health-partnership-founded-by-bill-and-melinda-gates-2020-07-14", "published": 1594731380.0, "headline": "Rich countries may try to stockpile coronavirus vaccine, according to global health partnership founded by Bill and Melinda Gates", "body": "LONDON (AP) — Politicians and public health leaders have publicly committed to equitably sharing any coronavirus vaccine that works, but the top global initiative to make that happen may allow rich countries to reinforce their own stockpiles while making fewer doses available for poor ones. Activists warn that without stronger attempts to hold political, pharmaceutical and health leaders accountable, vaccines will be hoarded by rich countries in an unseemly race to inoculate their populations first. After the recent uproar over the United States purchasing a large amount of a new COVID-19 drug, some predict an even more disturbing scenario if a successful vaccine is developed. Dozens of vaccines are being researched, and some countries — including Britain, France, Germany and the U.S. — already have ordered hundreds of millions of doses before the vaccines are even proven to work. While no country can afford to buy doses of every potential vaccine candidate, many poor ones can’t afford to place such speculative bets at all. The key initiative to help them is led by Gavi, a public-private partnership started by the Bill & Melinda Gates Foundation that buys vaccines for about 60% of the world’s children. In a document sent to potential donors last month, Gavi said those giving money to its new “Covax Facility” would have “the opportunity to benefit from a larger portfolio of COVID-19 vaccines.” Gavi told donor governments that when an effective vaccine is found within its pool of experimental shots, those countries would receive doses for 20% of their population. Those shots could be used as each nation wished. That means rich countries can sign deals on their own with drugmakers and then also get no-strings-attached allocations from Gavi. Poorer countries that sign up to the initiative would theoretically get vaccines at the same time to cover 20% of their populations, but they would be obligated to immunize people according to an ethical distribution framework set by the United Nations. The donor countries are “encouraged (but not required) to donate vaccines if they have more than they need,” the document says. “By giving rich countries this backup plan, they’re getting their cake and eating it too,” said Anna Marriott of Oxfam International. “They may end up buying up all the supply in advance, which then limits what Gavi can distribute to the rest of the world.” Dr. Seth Berkley, Gavi’s CEO, said such criticisms were unhelpful. Right now there’s no vaccine for anyone, he said, and “we’re trying to solve that problem.” Berkley said Gavi needed to make investing in a global vaccine initiative attractive for rich countries. Gavi would try to persuade those countries that if they ordered vaccines already, they should not attempt to obtain more, he said. But he acknowledged there was no enforcement mechanism. “If, at the end of the day, those legal agreements are broken or countries seize assets or don’t allow the provision of vaccines (to developing countries), that’s a problem,” Berkley said. Gavi asked countries for an expression of intent from those interested in joining its initiative by last Friday. It had expected about four dozen high and middle income countries to sign up, in addition to nearly 90 developing countries. Dr. Richard Hatchett, CEO of the Coalition for Epidemic Preparedness Innovations, which is working with Gavi and others, said they would be talking in the coming weeks with countries who had signed deals with drug companies to secure their own supplies. One possibility: They might ask countries to contribute their private vaccine stockpile to the global pool in exchange for access to whichever experimental candidate proves effective. “We’ll have to find a solution because some of these arrangements have been made and I think we have to be pragmatic about it,” he said. After a vaccine meeting last month, the African Union said governments should “remove all obstacles” to equal distribution of any successful vaccine. Africa Centers for Disease Control and Prevention chief John Nkengasong said Gavi should be “pushing hard” on convincing companies to suspend their intellectual property rights. “We don’t want to find ourselves in the HIV drugs situation,” he said, noting that the life-saving drugs were available in developed countries years before they made it to Africa. Shabhir Mahdi, principal investigator of the Oxford vaccine trial in South Africa, said it was up to African governments to push for more vaccine-sharing initiatives, rather than depending on pharmaceutical companies to make their products more accessible. “If you expect it to be the responsibility of industry, you would never get a vaccine onto the African continent,” Mahdi said. Last month, Gavi and CEPI signed a $750 million deal with AstraZeneca to give developing countries 300 million doses of a shot being developed by Oxford University. But that deal happened after the drug company had already signed contracts with Britain and the U.S., who are first in line to get vaccine deliveries in the fall. “We are working tirelessly to honor our commitment to ensure broad and equitable access to Oxford’s vaccine across the globe and at no profit,” said AstraZeneca CEO Pascal Soriot. He said its contract with Gavi and CEPI marked “an important step in helping us supply hundreds of millions of people around the world, including to those in countries with the lowest means.” Chinese President Xi Jinping has also vowed to share any COVID-19 vaccine it develops with African countries — but only once immunization has been completed in China. The World Health Organization has previously said it hopes to secure 2 billion doses for people in lower-income countries by the end of 2021, including through initiatives like Gavi’s. About 85% of the world’s 7.8 billion people live in developing countries. Kate Elder, senior vaccines policy adviser at Doctors Without Borders, said Gavi should try to extract more concessions from pharmaceutical companies, including compelling them to suspend patents on the vaccines. “Gavi is in a very delicate position because they’re completely reliant on the goodwill” of drug companies, said Elder. She said the system of how vaccines are provided to developing countries needed to be overhauled so that it wasn’t based on charity, but on public health need. “We’re just having our governments write these blank checks to industry with no conditions attached right now,” she said. “Isn’t now the time to actually hold them to account and demand we as the public, get more for it?” Yannis Natsis, a policy official at the European Public Health Alliance, said the last thing on the minds of officials in rich countries is sharing with poor ones. “Politicians are scared if they don’t throw money at companies, the citizens in the next country over will get the vaccines first and they will look very bad,” Natsis said."}]}