{"article": [{"url": "https://www.marketwatch.com/story/nike-fourth-quarter-sales-drop-nearly-40-2020-06-25", "published": 1593255920.0, "headline": "Nike fourth-quarter sales drop nearly 40%", "body": "Nike Inc. shares fell 3% in premarket trade Friday, after the sporting goods maker swung to a fourth-quarter loss and total sales dropped 38% despite a jump in online sales. The quarter’s online sales rose 75% with “strong double-digit increases” across geographies and made up about a third of total revenue for the quarter, Nike NKE, +0.97% said. Nike lost $790 million, or 51 cents a share, in the fourth quarter, contrasting with earnings of $989 million, or 62 cents a share, in the year-ago quarter. Sales fell to $6.3 billion from $10.1 billion a year ago. Nike pinned the 38% drop on store closures due to the coronavirus pandemic and fewer shipments to its wholesalers, which increased inventory. Analysts polled by FactSet had expected Nike to report a GAAP loss of 8 cents a share on sales of $7.3 billion. The company vowed to continue to invest more in online sales. “We are uniquely positioned to grow, and now is the time to build on Nike’s strengths and distinct capabilities,” Chief Executive John Donahoe said in a statement. “We are continuing to invest in our biggest opportunities, including a more connected digital marketplace, to extend our leadership and fuel long-term growth.” As of Thursday, about 90% of Nike-owned stores are open worldwide, including about 85% in North America, the company said. Retail traffic continues to improve, it said. Margins also dropped as higher full-price average selling prices “were more than offset” by higher product costs including factory cancellation charges, increased inventory, and the impact of supply-chain fixed costs on the lower shipments. As of May 31, the company had $12.5 billion in cash and equivalents, $4.1 billion higher than last year thanks to proceeds from a $6 billion debt sale in March. Nike said it secured a new $2 billion credit facility, adding to an existing credit facility of $2 billion “to ensure appropriate liquidity and flexibility during the COVID-19 pandemic.”"}]}