{"article": [{"url": "https://www.marketwatch.com/story/joe-biden-defines-income-of-400-000-as-wealthy-but-heres-why-its-barely-scraping-by-for-some-11602010209", "published": 1602063920.0, "headline": "Joe Biden defines income of $400,000 as â\u0080\u0098wealthy,â\u0080\u0099 but hereâ\u0080\u0099s why itâ\u0080\u0099s barely scraping by for some", "body": "Joe Biden Agence France-Presse/Getty Images Apparently, for some earning $400,000 a year, the struggle is real. Joe Biden defines that threshold as â\u0080\u009cwealthy,â\u0080\u009d and, according to CNBC, those making that much money represent the top 1.8% of taxpayers, but the reality on the ground in pricy big cities tells a different story. In fact, at least one financial number-cruncher says that kind of salary barely covers the bills in New York, San Francisco, Los Angeles, etc. Read: How rich is the â\u0080\u0098middle classâ\u0080\u0099? â\u0080\u009cBased on the expenses, a $400,000 household income provides for a relatively middle-class lifestyle,â\u0080\u009d popular â\u0080\u009cFinancial Samuraiâ\u0080\u009d blogger was quoted as saying on CNBC. â\u0080\u009cA middle-class lifestyle is defined as: owning a home, having two kids, saving for retirement, saving for college, going on modest vacations several weeks a year, and retiring in oneâ\u0080\u0099s early 60s.â\u0080\u009d Hereâ\u0080\u0099s how he breaks it down: So $400,000 a year leaves you with $34? Of course, that includes maxing out your 401(k), owning a nice home, taking a vacation, etc. Not a lot of tears are being shed by those who earn much less and canâ\u0080\u0099t make ends meet, but still, itâ\u0080\u0099s easy to see why someone with that kind of salary doesnâ\u0080\u0099t exactly feel wealthy. â\u0080\u009cThey are not living it up on $400,000 a year,â\u0080\u009d the Financial Samurai said. Hereâ\u0080\u0099s more on the story, courtesy of CNBC: .wsj-interactive.generic-iframe-embed[name=\"cnbc\"] { height: 349px; margin-bottom: 5px; } .at16units .bleed .wsj-interactive.generic-iframe-embed[name=\"cnbc\"] { height: 349px; } body.at12units .bleed .wsj-interactive.generic-iframe-embed[name=\"cnbc\"] { height: 349px; } body .inline .wsj-interactive.generic-iframe-embed[name=\"cnbc\"], body .offset .wsj-interactive.generic-iframe-embed[name=\"cnbc\"], body .header .wsj-interactive.generic-iframe-embed[name=\"cnbc\"], body.at8units .bleed .wsj-interactive.generic-iframe-embed[name=\"cnbc\"] { height: 349px; } body.at4units .inline .wsj-interactive.generic-iframe-embed[name=\"cnbc\"], body.at4units .offset .wsj-interactive.generic-iframe-embed[name=\"cnbc\"], body.at4units .header .wsj-interactive.generic-iframe-embed[name=\"cnbc\"] { height: 349px; } As for Bidenâ\u0080\u0099s tax plan, he Â wants the 12.4% Social Security tax to kick back in for incomes above $400,000 and is also looking to put the top bracket rate back to the Obama-eraâ\u0080\u0099s 39.6% rate from its current 37% rate. People with adjusted gross incomes at or below $400,000 would have a 0.9% average decrease in after-tax income, while people making that threshold would see a 17.7% after-tax income drop, according toÂ a budget modelÂ from the Wharton School of Business."}]}