{"article": [{"url": "https://www.marketwatch.com/story/mortgage-rates-are-circling-record-lows-will-the-feds-actions-push-them-lower-2020-06-11", "published": 1591871480.0, "headline": "Mortgage rates are circling record lows â\u0080\u0094 will the Fedâ\u0080\u0099s actions push them lower?", "body": "Mortgage rates continue to hover near their all-time low. And the Federal Reserveâ\u0080\u0099s approach to the economic recovery might keep them lower for longer. The 30-year fixed-rate mortgage average 3.21% for the week ending June 11, up three basis points from a week earlier, Freddie Mac FMCC, +0.52% Â reported Thursday. Meanwhile, the 15-year fixed-rate mortgage and the 5-year Treasury-indexed hybrid adjustable rate mortgage were both unchanged from last week at 2.62% and 3.1% respectively. Mortgage rates hit a fresh record low at the end of May, when the 30-year rate dropped to 3.15%. It was the third time that rates hit an all-time low this year. Also see:This is how long the coronavirus pandemic could delay millennialsâ\u0080\u0099 homeownership Last week, mortgage rates appeared primed to increase substantially in the wake of the better-than-expected monthly jobs report, said Matthew Speakman, an economist at Zillow ZG, -0.42% Â . â\u0080\u009cJust last week, mortgage rates appeared to be trending upward, rising quickly from all-time lows to their highest level in just under a month,â\u0080\u009d Speakman said. â\u0080\u009cBut all that changed in the last few days.â\u0080\u009d “ â\u0080\u0098With no end in sight for this Fed policy, itâ\u0080\u0099s likely that mortgage rates are poised to remain low for a while.â\u0080\u0099 ” â\u0080\u0094 Matthew Speakman, Zillow economist The Federal Reserve indicated Wednesday that it will keep the federal funds rate steady at a range of 0% to 0.25% through at least 2021. â\u0080\u009cWeâ\u0080\u0099re not even thinking about thinking about raising rates,â\u0080\u009d Fed Chairman Jerome Powell said during a press conference as the Fed updated its economic forecast. The Fed controls short-term interest rates, so the policy wonâ\u0080\u0099t directly impact mortgage rates. Instead, mortgage rates roughly track the direction of long-term bond yields, including the 10-year Treasury note TMUBMUSD10Y, 0.777% Â . The yield on the 10-year note initially fell in response to the Fedâ\u0080\u0099s announcement. More notably for the mortgage market, Powell also said the Fed will continue buying mortgage-backed securities â\u0080\u009cat least at the current pace.â\u0080\u009d That will continue to pump liquidity into the mortgage market, which lenders will use to continue to offer low rates to attract borrowers. â\u0080\u009cWith no end in sight for this Fed policy, itâ\u0080\u0099s likely that mortgage rates are poised to remain low for a while,â\u0080\u009d Speakman said."}]}