{"article": [{"url": "https://www.marketwatch.com/story/democrats-say-trump-tax-avoidance-allegations-show-need-to-make-filings-public-11601306767", "published": 1601309240.0, "headline": "Democrats say Trump tax avoidance allegations show need to make filings public", "body": "House Ways and Means Committee Chairman Rep. Richard Neal, D-Mass., shown earlier this year, has said the New York Times story shows the importance of Democrats winning a lawsuit to force Trump to hand over his tax returns under an existing law. Congressional Democrats say the New York Times story alleging President Donald Trump paid only $750 in income taxes in two recent years supports their calls to get his returns and require future candidates to disclose as well. U.S. House Speaker Nancy Pelosi said the questions raised by the report, including whether Trump has hundreds of millions in debt coming due soon, add up to a national security risk. “I do know if there is a review of somebody, if they’re going to be federally appointed to a job or whatever, if they have outstanding debt, that is an important factor because that means somebody else has leverage over them,” she said in an interview on MSNBC. “So, for me, this is a national security question,” she said. In a statement Sunday evening when the story was first released, Pelosi noted the House was already on record calling for disclosure of presidential business and personal tax returns in a bill called the “For the People Act.” That bill, which was passed on a straight party-line vote of 234-193 in early 2019, would require candidates for president and vice president to disclose 10 years’ worth of tax returns. It has not received a vote in the Senate. The New York Times on Sunday reported Trump has paid only $750 in income taxes for 2016 and 2017, the years he won the presidential race and his first year in office. He had paid no incomes taxes in 10 of the previous 15 years, using offsets from previous business losses, the Times said, based on tax information it had obtained. Trump, in a series of tweets Monday morning, said he was “entitled, like everyone else, to depreciation & tax credits” to reduce his tax bill. Trump also denied he was heavily in debt, tweeting, “Also, if you look at the extraordinary assets owned by me, which the Fake News hasn’t, I am extremely under leveraged — I have very little debt compared to the value of assets.” Sen. Chuck Grassley, the Republican chairman of the tax-writing Senate Finance Committee, said the report’s description of Trump’s 2010 taxes still being in dispute concerned him. “The thought that comes to my mind is how come it’s taking the IRS so long to get the audits done. I am concerned that the IRS is not getting their work done,” he told reporters on Capitol Hill. “I want to wait until the IRS gets done so I know how much he owes,” he said. Richard Neal, the Massachusetts Democrat who heads the Ways and Means Committee, said the Times story shows the importance of Democrats winning a lawsuit to force Trump to hand over his tax returns under an existing law. “Now, Donald Trump is the boss of the agency he considers an adversary. It is essential that the IRS’s presidential audit program remain free of interference. Today’s report underscores the importance of the Ways and Means Committee’s ongoing lawsuit to access Mr. Trump’s tax returns and ensure the presidential audit program is functioning effectively, without improper influence,” Neal said. “I remain confident that the law is on the Committee’s side, and that our request meets the standard the Supreme Court set with its July 2020 rulings. Our case is very strong, and we will ultimately prevail,” he said. Neither Senate Majority Leader Mitch McConnell nor House Republican Leader Kevin McCarthy has issued public statements since the report came out. Rep. Bill Pascrell, a New Jersey Democrat and a subcommittee chairman on the Ways and Means Committee, took to Twitter Sunday night to express his outrage. iframe.twitter-tweet { width: 100% !important; } Ron Wyden, the ranking Democrat on the Senate Finance Committee, tweeted, “It’s unconscionable that the millions of working families struggling to pay bills and save for the future are paying more in federal taxes than Donald Trump. It’s no wonder he’s been fighting tooth and nail to hide his tax returns.”"}]}