{"article": [{"url": "https://www.marketwatch.com/story/historic-decline-in-us-gdp-in-the-second-quarter-314-annual-pace-2020-09-30", "published": 1601459900.0, "headline": "Historic decline in U.S. GDP in second quarter modified to 31.4% annualized pace", "body": "The numbers: The record decline in the U.S. economy in the early stages of the coronavirus pandemic was modified slightly to a 31.4% annual pace — setting the stage for a big rebound in the third quarter. The decline in gross domestic product, the official score card for the U.S. economy, was previously put at 31.7% during the months of April, May and June. The economy has been engaged in a comeback since the start of the summer, and GDP is expected to show a big snap-back rebound in the third quarter. Economists polled by MarketWatch predict the U.S. is likely to expand at a record 25% annual clip during the July-to-September time frame. Third-quarter GDP will be released at the end of October. Opinion:About that K-shaped recovery: For half of America, the economy is still terrible, writes Rex Nutting Even a rebound of that size, however, will leave the economy in a shrunken state compared with before the advent of the coronavirus pandemic in March. Most economists think a full recovery could take a few years. GDP is a checkup of sorts for an economy, measuring consumer spending, business investment, government outlays and other contributors to an expansion or a contraction. Previously GDP had never shrunk by more than 10% on an annualized basis in any quarter since the government began keeping track after World War II. Read:Consumer confidence surges to highest level since start of coronavirus pandemic What happened: Consumer spending, the main engine of the economy, contracted by a slightly revised 33.2% annual clip in the spring, the government said Wednesday. Business investment in structures and equipment each sank by a more than 30% rate in the second quarter. Both were record declines. The level of inventories fell by a $206.1 billion annual rate in the second quarter, little changed from the prior estimate. Federal spending jumped by a revised 16.4%. The government spent trillions to help households and businesses get through an economic lockdown that shuttered many companies and severely depressed growth, putting millions out of work. Inflation as measured by the Federal Reserve’s preferred PCE price index declined by a 1.6% annual rate, compared to prior -1.8% reading. Most other figures in the GDP report were little changed. Big picture: The second quarter is water under the bridge. The just-about-to-end third quarter is in some ways also water under the bridge. It’s sure to turn out to be a strong one because the economy reopened and millions of people returned to work. What matters now is how fast the U.S. grows in the final three months of the year, an outcome that could shape the nature of the recovery in the longer run. While there are signs growth has slowed, the economy has also proven more resilient than most forecasters expected. That’s a potentially good omen. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 index SPX, +0.87% opened higher on Wednesday, defying premarket indications largely shaped by the debacle that was the fist presidential debate, staged Tuesday night in Cleveland."}]}