{"article": [{"url": "https://www.marketwatch.com/story/bidens-lead-grows-to-12-points-in-fox-news-poll-which-trump-blasts-as-phony-2020-06-19", "published": 1592564660.0, "headline": "Biden's lead grows to 12 points in Fox News poll, which Trump blasts as 'phony'", "body": "Joe Biden has taken a 12-point lead over President Donald Trump in a new Fox News poll focused on the White House race, up from an 8-point advantage last month. Conducted from Saturday through Tuesday among a random national sample of 1,343 registered voters, the survey shows 50% backing the presumptive Democratic presidential nominee and 38% supporting the Republican incumbent. Some 5% of respondents chose \"Other,\" another 5% said \"Don't know,\" and 2% said they wouldn't vote in the November election. When asked about the job that Trump is doing as president, 27% of those polled said they strongly approved and 17% said they somewhat approved, while 11% said they somewhat disapproved, 45% said they strongly disapproved and 1% didn't know. Trump fared better when it came to respondents' views on how he's handling the economy, with 49% approving, 46% disapproving and 4% saying they didn't know. The stock market on Friday was advancing and heading for a weekly gain, with the S&P 500 SPX, +0.87%  trimming its year-to-date loss from coronavirus-related worries and economic impacts to 3%. But when it came to how the president has handled race relations, 32% said they approved, 61% disapproved and 7% didn't know. Trump has slipped in polls amid extensive protests over police killings of black Americans. Trump on Friday morning blasted the survey, tweeting that Fox News \"is out with another of their phony polls, done by the same group of haters that got it even more wrong in 2016. Watch what happens in November. Fox is terrible!\" The cable news channel's parent company, Fox Corp. FOX, -1.45% FOXA, -1.25%, and MarketWatch's parent, News Corp NWSA, -1.35%  NWSA, -1.35%, share common ownership. In a RealClearPolitics moving average of national polls as of Friday, Biden has an 8.8-point lead over Trump."}]}