{"article": [{"url": "https://www.marketwatch.com/story/trumps-debate-antics-leave-many-viewers-disgusted-11601435829", "published": 1601455340.0, "headline": "Presidential debate antics leave many viewers disgusted", "body": "Joe Biden and President Donald Trump speak Tuesday night. AFP via Getty Images “A disgrace.” “A mess.” “Embarrassing.” Those were some of the reactions on social media Tuesday night, after a chaotic presidential debate in which the candidates exchanged insults and strayed from the agreed-upon topics. President Donald Trump frequently and aggressively interrupted Joe Biden, to the point where the former vice president told him to “shut up.” See: Trump, Biden blast each other on economy, coronavirus in fiery first debate Moderator Chris Wallace of Fox News at times chided Trump for his behavior, noting that both parties had agreed to let the other side talk uninterrupted for defined periods of time. “Frankly, you’ve been doing more interrupting,” Wallace told Trump, appealing to him to let Biden speak. On Twitter, many decried the messy debate, which at times was unintelligible because of the candidates talking over each other. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Some said Trump’s behavior was flat-out childish. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } While others said the whole thing just stressed them out. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Also see: Fox News host Chris Wallace faulted for failing to serve as moderating influence at first presidential debate By Wednesday morning, numerous pundits were advancing the view that chaos at the debate may have been a Trump strategy aimed at creating disillusionment with the political process and dampening voter turnout. House Speaker Nancy Pelosi told MSNBC that disorder and chaos have been the order of the day for the president every day."}]}