{"article": [{"url": "https://www.marketwatch.com/story/10-year-note-yield-near-2-week-low-as-us-sets-record-for-new-coronavirus-infections-2020-06-25", "published": 1593103340.0, "headline": "10-year note yield near 2-week low as investors grapple with rising coronavirus tally", "body": "Treasury yields fell slightly Thursday as reports of soaring coronavirus cases in a number of states have shaken investor optimism to the benefit of government debt.What are Treasurys doing? The 10-year Treasury note rate TMUBMUSD10Y, 0.777% was down 0.9 basis points to 0.674%, around a two-week low, while the two-year note yield TMUBMUSD02Y, 0.156% was virtually unchanged at 0.184%, but also around a two-week low. The 30-year bond yield TMUBMUSD30Y, 1.576% declined 2.8 basis points to 1.417%.What’s driving Treasurys? The focus remains on the growing tally of coronavirus infections in more states. That has pushed the U.S. to a record in daily new cases. On Wednesday, the U.S. reported 38,680 new cases, edging out the previous high of 36,739 cases on April 24, the Associated Press reported. Meanwhile, states that have made progress in controlling the coronavirus, but were also the worst-hit in the early days of the pandemic, are moving to curtail the risk from rising infections in other parts of the country. New York, New Jersey and Connecticut imposed a two-week quarantine on visitors coming from states and areas with high infection rates. Renewed concerns around the pandemic could stall efforts to reopen businesses and ease restrictions on social activities, slowing the pace of the economic rebound. Texas Gov. Greg Abbott said he would “pause” any further reopening of the state. Investors saw a rush of U.S. economic data in the morning. Durable goods jumped 15.8% in May, after sliding 18.1% in the previous month. The trade deficit widened to $74.3 billion from $70.7 billion in the prior month. The number of Americans filing for jobless claims was higher than expected, running at 1.48 million in the latest week, down from 1.51 million. The Federal Reserve will also release the results of its stress tests of U.S. banks, which are designed to check if the banks can survive a severe economic downturn without curbing lending. Read: Banks to wait until market close on June 29 to talk about impact of Fed stress tests on their capWhat did market participants say? “This week’s pandemic spread in recent hot-spot states has become visible in national trends, a negative for the economy,” said Jim Vogel, an interest-rate strategist at FHN Financial. “Q2’s market anticipation of reopening wasn’t about phases 1 or 2 in May or June in individual states, it was about the path to sustained and wider reopening in August and September for the entire country,” he wrote."}]}