{"article": [{"url": "https://www.marketwatch.com/story/economy-softened-in-august-feds-beige-book-finds-as-some-temporary-layoffs-turn-permanent-2020-09-02", "published": 1599058820.0, "headline": "U.S. economy softened in August, Fedâ\u0080\u0099s Beige Book finds, as some temporary layoffs turn permanent", "body": "The outlook: The U.S. economy expanded in August, but many parts of the country experienced slower growth amid lingering anxiety over the coronavirus, according to the Federal Reserveâ\u0080\u0099s latest â\u0080\u009cBeige Bookâ\u0080\u009d findings. â\u0080\u009cContinued uncertainty and volatility related to the pandemic, and its negative effect on consumer and business activity, was a theme echoed across the country,â\u0080\u009d the central bankâ\u0080\u0099s so-called Beige Book reported. The Beige Book is the Fedâ\u0080\u0099s regular survey of the economy. â\u0080\u009cThe pickup in activity seen in May and June has slowed over the past couple of months,â\u0080\u009d Cleveland Federal Reserve President Loretta Mester said in a separate speech on Wednesday. She and other senior Fed officials are urging Congress to provide more help to the economy, indicating urgency on the part of a the central bank that historically has shied away from offering advice to lawmakers. Read: Brainard says Fed should shift to more aggressive strategy to boost the economy Last week, the Fed broke with longstanding tradition and adopted a new approach to managing inflation thatâ\u0080\u0099s likely to result in interest rates staying low for longer periods of time. Read:The Fedâ\u0080\u0099s new strategy to allow higher inflation Also:Fedâ\u0080\u0099s Clarida says new inflation-fighting strategy has roots in failure of old approach What happened: The Fed said manufacturers in most of the country grew again. Consumer spending on houses and new cars and trucks were also bright spots. Yet total spending by both businesses and consumers was still well below pre-crisis levels. Energy producers and farmers in particular suffered from low prices and little prospect of improvement soon. Some companies were also turning temporary furloughs into permanent layoffs because of weak demand, the Beige Book found. A spate of airlines, hotels and schools last week said they would eliminate more jobs to offset a lack of customers and a sharp decline in revenue. Even in cases when companies wanted to hire, â\u0080\u009cfirms continued to experience difficulty finding necessary labor, a matter compounded by day care availability, as well as uncertainty over the coming school year and jobless benefits,â\u0080\u009d the Fed said. In July, a $600 federal stipend for the unemployment expired. President Trump has temporarily authorized $300 payments with Congress deadlocked on what to do next. Earlier Wednesday, ADP said a smaller-than-expected 428,000 jobs were created in the private sector in August. Read: ADP says private sector added a less-than-expected 428,000 new jobs in August The U.S. Labor Department on Friday is expected to show a bigger increase of 1.2 million, according to the MarketWatch forecast. The latest Beige Book was based on information collected on or before Aug. 24. See: MarketWatch Economic Calendar Big picture: The Beige Book offers more proof that an economic rebound from the coronavirus slowed toward the end of the summer after an initial burst of growth once states reopened. The end of a federal unemployment stipend and other government benefits at the end of July also appears to have restrained a recovery. Without more federal help, analysts say, these layoffs could leave lasting scars on the economy. Democrats and Republicans are still at loggerheads. See MarketWatch Recovery Tracker Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% rose in Wednesday trades."}]}