{"article": [{"url": "https://www.marketwatch.com/story/just-4-in-10-americans-now-say-they-would-get-a-first-generation-coronavirus-vaccine-and-most-dont-expect-to-pay-out-of-pocket-11600875043", "published": 1601012540.0, "headline": "Just 4 in 10 Americans now say they would get the first coronavirus vaccine", "body": "Seven vaccine candidates in the U.S. are in the clinical-trial phase with human participants. Chandan Khanna/Agence France-Presse/Getty Images A declining share of Americans say they would receive the first coronavirus vaccine, according to a new survey, and most expect someone else to completely or partially foot the bill. Just 39% of respondents to the most recent Axios/Ipsos Coronavirus Index poll say they are likely to get the first-generation COVID-19 vaccine as soon as it’s available, a nine-percentage point drop from a poll conducted Aug. 21 to Aug. 24. Six in 10 in the most recent poll say they’re not likely to take the first vaccine, up from 51% in the August poll. Meanwhile, 38% of respondents say their health insurance will completely cover the cost, and 11% say the same of the federal government. Another 9% said their health insurance would partially cover the cost and they would pay some out of pocket, and 4% expected to pay completely out of pocket for the vaccine. (Some 21% indicated they wouldn’t get the vaccine, and 16% answered the question with “don’t know.”) How much money would people be willing to pay out of pocket? For a third of respondents, the answer was “nothing.” Another 26% said they would be willing to pay less than $20, while 25% said $20 to less than $50, and 10% said they would pay $50 to less than $100. Just 5% said they would be willing to shell out $100 or more. The nationally representative poll, conducted Sept. 18 to Sept. 21, included responses from 1,008 U.S. adults. The Trump administration’s “Operation Warp Speed” program includes “the goal of no upfront costs to providers and no out-of-pocket cost to the vaccine recipient,” according to a distribution-strategy report published last week by the Health and Human Services and Defense Departments. “Various plans, supported by the CARES Act and the Families First Coronavirus Response Act, are under development with the objective of ensuring no one will be charged any out–of-pocket expenses for the administration of the vaccine either,” the document says. “The objective is to ensure no one desiring vaccination will face an economic barrier to receiving one.” While the CARES Act provides for free COVID-19 vaccine coverage, Medicare beneficiaries — 15% of the country’s population — could wind up paying out of pocket if a vaccine is approved under a less-stringent emergency-use authorization rather than full Food and Drug Administration approval, according to a recent Wall Street Journal report. A Centers for Medicare and Medicaid Services spokesperson told MarketWatch the administration was committed to modernizing Medicare to ensure access to a vaccine with no cost sharing. The White House and HHS didn’t immediately return requests for comment. A safe and effective coronavirus vaccine has not yet been approved. Seven vaccine candidates in the U.S. are in the clinical-trial phase with human participants, including four candidates — AstraZeneca AZN, +1.16% in partnership with the University of Oxford, BioNTech BNTX, +1.23% and partner Pfizer PFE, -0.27%, Moderna MRNA, +0.09% and most recently Johnson & Johnson JNJ, +1.39% — that are in Phase 3 clinical trials, the final and most critical stage."}]}