{"article": [{"url": "https://www.marketwatch.com/story/that-v-shaped-economic-recovery-forecasters-have-been-calling-for-dont-hold-your-breath-11602174696", "published": 1602171740.0, "headline": "That V-shaped economic recovery forecasters have been calling for? Don't hold your breath", "body": "Is the economy stuck in a rut? iStockphoto Hope for the V, but prepare for the L. At this point, many analysts are clinging to the idea of a V-shaped recovery for the U.S. economy, even as increased volatility continues to roil markets. After all, the data has been mostly positive in recent months, and considering the recession resulting from the coronavirus pandemic was among the deepest on record, there's plenty of room for more growth, especially when the next flood of fiscal stimulus hits from Congress. In a note last week, Ed Yardeni of Yardeni Research painted a rather rosy picture of the future, pointing to low interest rates as just one of the factors driving the rebound, even as challenges remain. \"We believe that the resulting housing boom should more than offset the weak recoveries-and possible stalling-of many pandemic-challenged industries,\" he wrote. Yardeni also raised his estimate for growth in third-quarter GDP by 5 percentage points to 30% on an annualized basis and lifted his fourth-quarter call by the same amount, to 10%. But a Bloomberg News analysis of 36 recessions going back to 1965 across the G7 countries, which is illustrated in this tweet, suggests the economy could remain in the L-shaped ditch for a while. iframe.twitter-tweet { width: 100% !important; } \"With the world facing a second wave of COVID infections this winter, it's not hard to imagine how the pandemic could inflict significantly more long-term damage than forecasters envisage,\" Bloomberg's Dan Hanson and Yelena Shulyatyeva wrote. As for the latest temperature check on the economy, the number of Americans who applied for jobless benefits fell slightly in early October to a new pandemic low. They are, however, declining more slowly, which could be signaling that the labor market is experiencing a setback amid another wave of corporate layoffs. Meanwhile, the stock market enjoyed another day of gains, with the Dow Jones Industrial Average DJIA, +0.56%, tech-heavy Nasdaq Composite COMP, +1.39% and S&P 500 SPX, +0.87% all pushing higher in Thursday's upbeat session."}]}