{"article": [{"url": "https://www.marketwatch.com/story/investors-expect-banks-to-kick-off-better-q3-earnings-but-fear-stimulus-bridge-for-u-s-economy-is-crumbling-11601733335", "published": 1601719580.0, "headline": "Investors expect banks to kick off better Q3 earnings, but fear stimulus bridge for U.S. economy is crumbling", "body": "The sun sets behind the Brooklyn Bridge Bryan R. Smith/Agence France-Presse/Getty Images Big banks will kick off third-quarter earnings reports in earnest on Oct. 13, helping to set the tone for the broader U.S. stock market, as businesses cope with the eighth month of the pandemic. The nation’s largest lenders are expected to reap the rewards of a rip-roaring market for initial public offerings anda record corporate borrowing spree during the pandemic. See: Wall Street banks net $64 billion in fees in bumper year for M&A and IPOs On the flip side, major banks also are expected to reflect the downside of the Federal Reserve’s protracted near-zero interest rate policy, as well as concerns about commercial real estate and other parts of the economy hard hit by the coronavirus pandemic. “Clearly, the banks always start off earnings and everyone pays attention to that, given how sensitive they are to the economy,” said Aaron Clark, portfolio manager at GW&K Investment Management. JP Morgan Chase & Co JPM, -0.57% and Citigroup, Inc. C, +0.47% are set to report their third-quarter results on Oct. 13, following a day later by Bank of America Corp. BAC, +0.47%, Goldman Sachs GS, -0.21% and Wells Fargo & Co. WFC, . But after putting meaty investment banking fees to one side, Clark sees plenty of headwinds for banks that reflect the broad challenges the economy faces in the coming months, including whether Congress provides another significant fiscal stimulus package to bolster U.S. households, businesses and cities. “Unfortunately, that’s the key,” he told MarketWatch. “You’re basically trying to bridge-fund the economy until a vaccine comes along.” President Donald Trump on Friday gave the Wall Street a stark reminder of what could be at stake due to the untamed pandemic, after he was taken to Walter Reed Medical Center in Bethesa, Md. out of an “abundance of caution,” after testing positive to COVID-19. See: President Trump tested positive for coronavirus — here’s everything we know so far The revelation came on Friday via Twitter TWTR, -0.23%, some 30-odd days before the Nov. 3 U.S. election and about two weeks before third-quarter earnings kick off. It also left the Dow Jones Industrial Average DJIA, +0.56% to close 134 points lower Friday, the S&P 500 index SPX, +0.87% down 32 points and the Nasdaq Composite Index COMP, +1.39% 215.49 points lower. More important, it also underscored how COVID-19, the deadly illness that has killed more than 1 million people and sparked a global economic downturn, can pose a threat to anyone — even the U.S. president –and how it could derail the broader economic recovery. “Part of Trump’s strategy has been to create this reality, this image, that the virus is powerless, that he’s a much stronger force. And that it’s business as usual,” said Eric Schiffer, chief executive officer of private-equity firm Patriarch Organization in Beverly Hills, Calif. “To the extent it gets bad, I think that it would be a massive reality check,” he said. “But if he’s able to overcome it with mild symptoms, he can reframe it as part of his narrative” that the pandemic remains a minimal threat. Diane Jaffee, a senior portfolio manager at TWC, said that although financials always led the way, she will be keeping an eye on cost cutting efforts by companies reporting during coming earnings, including job losses. “Clearly cost-cutting has started,” she said, while pointing to the 28,000 job layoffs announced in the past week by Disney DIS, +1.53%. “Usually coming out of a recession earnings look better, because companies are made up of people like you and me — they want to exist and prosper,” she told MarketWatch. “The real question becomes how do we recover if we have 25%-30% of people out of work?” she said. “We need judicious recovery acts going forward, in my opinion.” Economists pointed out that despite Friday’s less dismal jobs report, which showed the unemployment rate falling to 7.9% in September for a fifth straight month, that it decreased for “the wrong reasons,” namely that the labor-force participation rate fell. “Of key concern, the share of permanent unemployed rose from 30.6% to 35.6%, while the share of temporary unemployed fell to 36.7%,” wrote Nancy Vanden Houten, lead U.S. economist at Oxford Economics, in a note Friday. Even so, analysts looking ahead to the third-quarter bumped up their earnings estimates for companies in the S&P 500 index by 4.1%, or to $33.08 to $31.78 from June 30 to Sept. 30, according to FactSet data. That marked the first such quarterly boost since the second quarter of 2018. For context, over the past 10 years, the average decline in quarterly bottom-up earnings per share estimate (EPS) has been 5%, according to FactSet. “Look, there is a good chunk of their business that is directly related to the consumer, and to businesses in general,” said Lindsey Bell, chief investment strategist at Ally Invest, in an interview with MarketWatch, about the coming raft of bank earnings reports. “You’ll get a nice sense of what the consumer is doing and what business is doing, including small businesses,” she said. “I think we’re going to be pleasantly surprised about what we’ll hear from banks.” Next week will be light for U.S. economic data, with a focus on what members of the Federal Reserve will have to say in public forums throughout the week, including during a briefing Wednesday on racism and the economy. Minutes of the Federal Open Market Committee’s meeting for the week of Sept. 16 also will be released on Wednesday. “There’s a strong underlying force of activity that’s happening,” said Schiffer of the economy. “The question is, will that be arrested by election fears and the fact that fiscal stimulus has been eviscerated.”"}]}