{"article": [{"url": "https://www.marketwatch.com/story/stock-index-futures-edge-higher-as-investors-await-fed-decision-wade-through-earnings-flood-2020-07-29", "published": 1596040220.0, "headline": "U.S. stocks close higher after Fed keeps interest rates near zero, Powell vows to keep up support during pandemic", "body": "Stocks finished higher Wednesday, after the Federal Reserve left benchmark interest rates unchanged near zero and Fed Chair Powell reiterated his promise to provide support until the threat of the coronavirus to the U.S. economy has passed. A Capitol Hill hearing with top executives of the world’s most powerful technology firms also was a focus, along with wrangling over coronavirus aid and a flood of blue-chip corporate earnings reports. See: Big Tech’s latest reckoning is coming as it continues to rack up record valuationsHow did major benchmarks fare? The Dow Jones Industrial Average DJIA, +0.56% ended 160.29 points higher, or 0.6%, at 26,539.57, while the blue-chip benchmark lagged behind other equity indexes, with the S&P 500 SPX, +0.87% adding 40 points, or 1.2%, to close at 3,258.44. The Nasdaq Composite COMP, +1.39% climbed 140.85 points, or 1.4%, ending at 10,542.94. The Dow on Tuesday fell 205.49 points, or 0.8%, to close at 26,379.28, while the S&P 500 lost 20.91 points, or 0.7%, to finish at 3,218.44. The Nasdaq closed at 10,402.09, down 134.18 points, or 1.3%.What drove the market? Stocks cheered the Federal Reserve’s decision to leave its benchmark interest rates unchanged near zero on Wednesday and Chairman Jerome Powell’s pledge once again to provide stimulus until the economy has weathered the pandemic. Powell noted that households and the jobs market have slightly improved since May as the nation made headway against the biggest shock to the U.S. economy “in living memory,” but also warned that rising coronavirus cases in many states now threaten the pace of the recovery. “Fiscal policy is essential here,” Powell said in an afternoon news conference, where he reiterated that the Fed had no plans to rein in its slate of emergency lending facilities to keep credit flowing, and also nudged members of Congress to provide additional coronavirus aid. “I think they are playing with fire,” Diane Jaffee, a senior portfolio manager at TCW, said about the protracted debate in Congress over further pandemic aid, in an interview following the Fed’s decision. “If Congress was counting on the fact that the economy was going to reopen, and they wouldn’t need to do another package, clearly, that Plan A is gone.” Investors hope Republicans, Democrats and the White House can agree on additional coronavirus aid ahead of the end-of-the-month expiration of supplemental unemployment benefits that have been credited with helping cushion the economic blow from the pandemic. Treasury Secretary Steven Mnuchin said the Trump administration and Democrats remained far apart on the proposed fiscal stimulus bill. Investors also were tuned into testimony in Washington from the nation’s most prominent chief executives in the technology sector, who were fielding tough questions on their business practices and accusations they have used their market power to thwart competition, in a hearing before the House Judiciary Antitrust Subcommittee. Jeff Bezos of Amazon.com Inc. AMZN, +3.01% kicked off the testimony, followed by Sundar Pichai of Google parent Alphabet Inc. GOOGL, +1.82% GOOG, +1.97%, Tim Cook of Apple Inc. AAPL, +1.74% and Mark Zuckerberg of Facebook Inc. FB, +0.26% FB, +0.26%. “A big theme in this hearing,” writes MarketWatch’s Jeremy Owens in Live Blog coverage, “is that these platforms use data involving other companies on their platforms to form their own product approaches.” Read:Congress has a million-plus documents from Big Tech antitrust investigation, and are ready to grill big-name CEOs The busiest week of earnings reporting season also rolled on, including results from a number of closely followed companies, General Electric Co. GE, +2.85% and plane-maker Boeing Co. BA, -0.39%, which is still reeling from the grounding of its 737 MAX aircraft and uncertainty about the future of flight in the wake of the pandemic. In U.S. economic data, the trade deficit in goods dropped to $70.6 billion in June, a 6.1% decline in June from the previous month. The index of pending home sales soared 16.6% last month, helped by low borrowing rates, as compared with May, the National Association of Realtors reported Wednesday.Which companies were in focus? General Electric Co. GE, +2.85% shares shed 4.4% after the diversified industrial conglomerate reported a wider-than-expected second-quarter loss but topped expectations for revenue and free cash flow. Boeing Co. BA, -0.39% Shares of fell 2.8% after the aerospace and defense giant reported a much wider-than-expected loss, amid a big miss in commercial airplanes revenue. General Motors Co. GM, -0.15% shares dropped 1.7% after the car maker posted a smaller-than-expected loss for the second quarter and sales that topped estimates. Shares of Starbucks Corp. SBUX, +0.53% rose 3.7% after the coffee chain late Tuesday reported a narrower-than-expected loss and better-than-expected sales in its fiscal third quarter. Starbucks estimated that it missed out on more than $3 billion in sales as the pandemic’s curtailed store traffic and said it would expand curbside pickups. Advanced Micro Devices Inc. AMD, -3.94% shares soared 12.5% after the chip maker late Tuesday reported second-quarter earnings that topped expectations and boosted its full-year forecast. Shares of eBay Inc. EBAY, +6.47% were 3.2% down after the e-commerce company delivered results Tuesday afternoon that were largely in line with Wall Street expectations. Carnival Corp. CCL, +0.51% shares gained 2.2% after it disclosed Wednesday that it expects to remove two more cruise ships from its fleet that previously projected. How did other markets trade? In Asia, China’s CSI 300 index 000300, +2.04% jumped 2.4%, the Shanghai Composite SHCOMP, +1.67% rose 2.1%, Hong Kong’s Hang Seng Index HSI, -0.30% gained 0.5% and Japan’s Nikkei 225 NIK, -0.11% fell 1.2%. Stocks finished mostly lower in Europe, with the Stoxx 600 Europe index SXXP, +0.55% down 1% and the U.K.’s FTSE 100 UKX, +0.64% up less than 0.1%. Gold futures US:GCQ20 rose about 0.5%, to settle at a fresh record of $1,953.40 an ounce, while the ICE U.S. Dollar Index DXY, -0.58% was off 0.3%. US:CLU20 Oil futures ended higher, with the U.S. benchmark US:CLU20 up 0.6% on the New York Mercantile Exchange. The yield on the 10-year U.S. Treasury note TMUBMUSD10Y, 0.777% were less than a 1 basis point lower at 0.578%. Yields move in the opposite direction of prices. William Watts contributed reporting"}]}