{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-cases-edge-close-to-21-million-us-counts-more-than-1000-deaths-to-extend-a-2-week-streak-2020-08-14", "published": 1597408880.0, "headline": "Coronavirus update: Global cases edge close to 21 million; U.S. counts more than 1,000 deaths to extend a 2-week streak", "body": "The number of confirmed cases of the coronavirus illness COVID-19 worldwide edged closer to 21 million on Friday, and the U.S. counted more than 50,000 new cases for a second day and suffered more than 1,000 deaths, continuing a more than two-week streak. The U.S. now has 5.25 million confirmed cases, and 167,253 people have died, according to data aggregated by Johns Hopkins University, the most in the world by a wide margin. The U.S. has the fourth highest number of deaths per 100,000 people at 51.08, the data show, after the U.K., Peru and Chile. Robert Redfield, head of the Centers for Disease Control and Prevention, warned this week that America is bracing “for the worst fall, from a public health perspective, we’ve ever had.” That’s because the flu season is expected to start in October and continue through February, while COVID-19 remains uncontained in most of the United States. “We’re going to have COVID in the fall, and we’re going to have flu in the fall. And either one of those by themselves can stress certain hospital systems,” Redfield said, noting many hospitals have already been overwhelmed by the number of coronavirus patients. There have been reports of hospitals in Texas and Arizona calling in refrigerated trucks to serve as temporary morgues to handle the volume of dead bodies, as New York had done at the peak of infections there. The flu has seen between 140,000 and 810,000 people hospitalized each year since 2010. President Donald Trump used his Thursday coronavirus press briefing to bash Joe Biden’s call for a national mask mandate; challenge the security of mail-in voting; and question the eligibility of Kamala Harris, a California native, to serve as vice president. Biden, the presumptive Democratic presidential nominee, called for a national mask mandate to limit the spread of COVID-19, and said it could save 40,000 lives in a three-month period. That message matches the advice of public health experts who maintain that, in the absence of a vaccine, the best ways to contain the spread are to wear a face mask in public places, wash your hands frequently and socially distance from others. Globally, at least 760,761 people have died of COVID-19, the Johns Hopkins data show. At least 13 million people are confirmed to have recovered. Brazil is second to the U.S. with 3.2 million cases and 105,463 deaths. India is third measured by cases, with its total rising to 2.5 million, followed by Russia with 910,778 and South Africa with 572,865. Mexico has 505,751 cases and 55,293 deaths, the third highest in the world. India now has 48,040 deaths, putting it ahead of the U.K. That country has 315,600 cases and 46,791 fatalities, the highest in Europe and fifth highest in the world. China, where the illness was first reported late last year, has 89,144 cases, and 4,700 fatalities In other news: • A number of countries in Europe are taking steps to order holiday makers returning from places with rising case numbers to quarantine or be tested, as early hot spots, including Spain and Italy, are seeing a resurgence of infections. The U.K. added France and the Netherlands to the list of countries from which returning citizens must quarantine for two weeks. The move takes effect on Saturday, prompting some travelers to rush back to skirt the requirement. The news hurt the stocks of travel companies including airlines in Europe as some people are now expected to cancel planned vacations. See also:The U.K. has now quarantined its closest neighbors, and that will have an economic cost — but it may be worth it, for everyone • Spain is closing discos and banning smoking in the street without social distancing, as it moves to contain a fresh outbreak in recent weeks, Agence France-Presse reported. Health Minister Salvador Illa announced new measures to be enforced nationwide after an emergency meeting of regional health authorities. • Italy’s health minister, Roberta Speranza, has signed an order requiring holiday makers from Spain, Croatia, Malta and Greece to be tested for COVID-19, after the number of new cases topped 500 for the first time in weeks, the Guardian reported. “We need to maintain the utmost caution in order to defend what we have achieved so far,” said Speranza. “People returning from these countries will now have to have swabs.” • The ongoing pandemic has seen Poland enter its first recession since the end of communism three decades ago, according to its statistics office. Hungary, Bulgaria and Romania also saw their worst quarters since the communist regimes in those countries collapsed, AFP reported. • New Zealand is extending lockdown measures in its biggest city, Auckland, after 29 new cases were detected and linked to the four recently identified that ended the country’s more than 100 days of zero cases, CNN reported. Prime Minister Jacinda Ardern said Auckland will remain at a Level 3 lockdown and the rest of the country at Level 2 for another 12 days. • Vietnam is planning to buy Russia’s controversial COVID-19 vaccine, Reuters reported, citing state television. Vietnam was praised early on in the pandemic for successfully containing infection but has recently seen more than 20 deaths after an outbreak in the coastal city of Danang. The Russian vaccine has been registered after Phase 1 and Phase 2 trials involving at most a few hundred patients. New medicines are typically only approved after going through a Phase 3 trial involving thousands of patients. Most experts are skeptical the Russian vaccine will prove safe or effective. For more, see:Russia’s accelerated COVID-19 vaccine greeted with alarm as experts say Phase 3 trial is essentialWhat’s the latest medical news? Countries continued to announce bulk purchases of unproven vaccines on Friday, in a sign of the urgency with which officials are racing to secure supplies that may be limited. The U.K. government has signed a deal for another million doses of vaccines that are currently in development at Novavax Inc. NVAX, +0.18% and Johnson & Johnson JNJ, +1.39%, MarketWatch’s Lina Saigol reported. The U.K. has now secured access to six different candidates, across four different vaccine types, taking its potential stockpile to 340 million doses — enough for five doses per person. The European Commission said it will purchase 300 million doses of AstraZeneca PLC’s AZN, +1.16% AZN, +0.63% vaccine candidate once it has been proved safe and effective. with an option to purchase 100 million more, on behalf of E.U. member states. The commission continues discussing similar agreements with other vaccine manufacturers. Opinion: Here’s a pandemic stock tip: Buy on the rumor of a COVID-19 vaccine, sell on the newsWhat’s the economy saying? Sales at U.S. retailers rose modestly in July and returned to precrisis levels, but growth has tapered off since the economy reopened and could soften again in the months ahead in the absence of another major federal relief package, MarketWatch’s Jeffry Bartash reported. Retail sales rose 1.2% in July, the government said Friday. Economists polled by MarketWatch had forecast a 2% advance. Receipts have slowed from a 8.4% increase in June and a record 18.3% gain in May, when an economic rebound began. Retailers have been on a roller-coaster ride since the pandemic began, sinking in March and April and recovering rapidly in the following two months as the economy reopened. The more mild increase in sales in July might be a sign of what lays ahead, however. What the July Jobs Report Tells Us The resurgence of coronavirus cases this summer sapped the economy of momentum, delayed the return of people to their jobs and in some cases spurred more layoffs. At the same time, a $600 federal unemployment benefit expired at the end of last month, and Washington is deadlocked over another major aid package. “From here on, the recovery in consumer spending as measured in the retail-sales report is likely to be a lot more grudging,” said chief economist Joshua Shapiro of MFR Inc. Separately, industrial production rose 3% in July for the third straight monthly gain after sharp declines in March and April, the Federal Reserve reported Friday. The gain in July was above Wall Street expectations of a 2.7% gain, according to a survey by MarketWatch. Production in June was raised to a 5.7% gain from the earlier estimate of a 5.4% increase. Despite the strong gains over the past two months, production is below precrisis levels, the Fed said. The index is 8.4% below its prepandemic February level. A consumer-sentiment indicator edged up to 72.8 in August from 72.5. in July, but it’s still just barely above the pandemic low, the University of Michigan said Friday. Americans regained some confidence in the early stages of the recovery in May and early June, but their hopes for a faster rebound were dashed by a fresh outbreak of the coronavirus during the summer. See also:‘A massive welfare economy’: Huge federal aid programs prevent an even steeper GDP collapse Consumers expressed low confidence in the current state of the economy. An index that measures attitudes right now slipped to 82.5 from 82.8. An index that measures expectations for the next six months rose slightly to 66.5 from 65.9. Yet most Americans think it will be years before the economy returns to normal. “Bad economic times are anticipated to persist not only during the year ahead, but the majority of consumers expect no return to a period of uninterrupted growth over the next five years,” said Richard Curtin, the chief economist of the sentiment survey. Here’s the latest news on companies and COVID-19: • Alaska Air Group Inc. ALK, +0.15% expects total revenue to be down 70% to 75% in August from a year ago, after a 73% decline in July, as the pandemic has crushed demand for air travel. The current FactSet consensus for third-quarter revenue of $776 million implies a 67.5% decline. The airline expects an August load factor of 40% to 45%, compared with a July load factor of 54%. Capacity is expected to be down 50% from a year ago, compared with the July decline of 63%, while traffic is expected to be down 70% to 75% after being down 74% in July. The company expects revenue passengers of 1.2 million to 1.3 million for the month, up from 1.14 million in July. Cash burn in July was $175 million, which increased from June because of slowing ticket sales and the timing of certain payroll cycles, partially offset by lower debt service. Cash burn is expected to decline to “less than $125 million” in August, primarily because of ticket sales. • China-based search engine Baidu Inc. BIDU, -0.20% reported an adjusted profit that was above Wall Street expectations and sales that met forecasts, but said its online ad sales fell 8% year-on-year during the pandemic. Online marketing revenues were RMB 17.7 billion ($2.50 billion), down 8%, the company said. “With COVID-19 becoming more manageable in China, Baidu’s business is steadily rebounding,” the company’s co-founder and chief executive, Robin Li, said in a statement, echoing a statement he made in May. Baidu guided for third-quarter revenue between RMB26.3 billion ($3.7 billion) and RMB28.7 billion ($4.1 billion), representing a negative growth rate of 6% and a growth rate of 2% year over year. “The COVID-19 situation in China is evolving, and business visibility is very limited,” with the guidance “subject to substantial uncertainty,” the company said. • Caterpillar Inc. CAT, +1.45% reported rolling three-month retail sales data for July, which showed a deceleration in the declines from the previous month. Total machines sales were down 20%, after falling 23% in June, with the decline in North America sales improving to 38% from 40%. In the construction and mining equipment maker’s resource industries, global sales fell 19% in July after declining 21% in June, while North America sales fell 49% in July after being down 46% in June. For construction industries, sales fell 20% globally after dropping 23% in June, and fell 35% in North America after declining 38% in June. In energy and transportation, retail sales fell 16% in July, after declining 18% in June. • DraftKings Inc. DKNG, -4.51% posted a bigger-than-expected loss for the second quarter but sales that topped estimates. The stock had already taken a dip after a Bloomberg report that the Internal Revenue Service will require fantasy sports companies to pay federal excise tax on their entry fees. Boston-based DraftKings ended the quarter with more than $1.2 billion in cash after a follow-on offering. The company said it saw increased engagement on its platform toward the end of the quarter as sporting events began to resume. “This positive momentum has accelerated with the return of MLB, the NBA, WNBA, the NHL, and MLS,” it said in a statement. DraftKings is now expecting pro forma revenue of $500 million to $540 million for fiscal 2020, equal to growth of 22% to 37%. The company is not expecting any impact to its long-term plans from COVID-19. • Farfetch Ltd. FTCH, -0.30%, the luxury fashion platform, reported a narrower-than-expected quarterly loss and sales that surpassed expectations. Farfetch also announced the departure of five board members, including the board’s chair. The e-tailer lost $95 million, or 31 cents a share, in the second quarter, compared with a loss of $436 million, or $1.29 a share, in the year-ago quarter. Revenue rose 74% to $365 million, the company said. Analysts polled by FactSet had expected a loss of 37 cents a share on sales of $327 million for the quarter. The company called for an adjusted loss between $20 million and $25 million for the third quarter, and said ongoing “uncertainties” in connection with the pandemic “could have material impacts on our future performance and projections.” Farfetch ended the quarter with about $802 million in cash and equivalents, including net proceeds from April 2020 issuance of $400 million in convertible debt. As for the board changes, Farfetch said that five members, including chairperson Natalie Massenet, have left and four new directors have joined the company’s board. • Madison Square Garden Sports Corp. MSGS, -0.20% reported a wider-than-expected fourth-fiscal-quarter loss and a surprise negative revenue, as the company’s New York Knicks and New York Rangers had their seasons suspended as a result of the pandemic. The net loss for the quarter to June 30 was $78.5 million, or $3.27 a share, after a loss of $73.2 million, or $3.08 a share, in the year-ago period. The FactSet consensus for net losses per share as $2.14. Revenue swung to a negative $7.0 million from $68.15 million, compared with the FactSet consensus of revenue of $12.4 million. When the NBA basketball and NHL hockey seasons were suspended in March, the Knicks had 16 games remaining (eight at home) and the Rangers had 12 games remaining (five at home). When the seasons resumed, the Knicks were not part of the NBA’s restart. The company said it had $293 million of liquidity as of June 30 while total debt outstanding was $350 million. “We remain confident in our company’s future prospects and are comfortable that we have the financial flexibility to navigate through this period of uncertainty,” said Chief Executive Andrew Lustgarten."}]}