{"article": [{"url": "https://www.marketwatch.com/story/nvidias-deal-with-arm-paves-the-path-to-a-trillion-dollar-market-value-2020-09-14", "published": 1600100600.0, "headline": "Nvidiaâ\u0080\u0099s deal with Arm paves the path to a trillion-dollar market value", "body": "Nvidiaâ\u0080\u0099s $40 billion acquisition of Arm Holdings will be the biggest deal ever in semiconductors. The announcement, made Sunday, was met with investor excitement, driving Nvidiaâ\u0080\u0099s NVDA, -0.54% Â share price up as much as 8% and adding more than $25 billion to its market value â\u0080\u0094 about two-thirds of the equity needed to make the acquisition. But why is this purchase such a big deal and what does it mean for Nvidia? That is the question investors should be asking. An acquisition of this size will have hurdles but, make no mistake, Nvidia with Arm is a powerful combination that has the promise to take Nvidia to new heights, assuming it can get past regulators and keep current Arm licensees on board. Letâ\u0080\u0099s look at the pros and cons. Read:Nvidia and SoftBank are each winners in $40 billion deal for Arm Holdings The positives of the deal outweigh the negatives by a wide margin, especially for the two companies involved. SoftBank, in the wake of recent challenges, has been looking to offload Arm, and there arenâ\u0080\u0099t a lot of natural landing places for the company, especially landing places that have as natural of a fit as Nvidia. Chip design For those less familiar with Arm, the acquisition takes Nvidia from top-tier status as a GPU maker for data center, automotive and gaming, and it instantly cements the company as a top-tier chip designer with scale that few, if any other company, can match. While companies like Intel INTC, -1.03%, Qualcomm QCOM, +2.06% Â and AMD AMD, -3.94% Â all do certain things that will be unique to the Nvidia plus Arm combination, these companies represent the level of scale that we are talking about. Arm and its intellectual property (IP) are already included in billions of chips sold each year. This includes a large volume of smartphone devices that use Arm-based microcontrollers, but also a huge portion of the overall revolution of smartphone devices that have been built leveraging Arm architectures. Today, Nvidia has effectively zero smartphone business, and with this acquisition Nvidia instantly becomes one of the largest players in what is arguably societyâ\u0080\u0099s most valued piece of technology. Nvidia with Arm will benefit significantly from the continued growth in smartphones, which is all but certain over the next decade. Artificial intelligence The other massive opportunity for Nvidia is going to be using Armâ\u0080\u0099s licensing model to offer its artificial intelligence (AI) technology at scale. In CEO Jensen Huangâ\u0080\u0099s remarks to analysts immediately following the announcement, he was overt in mentioning the substantial business opportunity around AI and using Arm to take Nvidiaâ\u0080\u0099s Ampere architecture to edge, internet of things (IoT), consoles, smartphones and automotive. The challenges here have the most to do with gaining the approval of regulators and the trust of Armâ\u0080\u0099s current customer base. With little overlap in current offerings, I donâ\u0080\u0099t see how regulators become overly problematic. However, these things are never a slam dunk. Remember that Nvidia was able to navigate and overcome these challenges with its recent acquisition of Mellanox. I envision that China will be the biggest potential holdup, given the planned concessions of retaining Armâ\u0080\u0099s corporate HQ in Cambridge, England, along with making further investments in the U.K. Armâ\u0080\u0099s neutrality The licensees will certainly see conflicts with this acquisition. Up to now, Arm has been a haven for chipmakers to license and leverage their way to new, innovative products that power billions of devices, most notably smartphones. Having Arm run with a high level of autonomy will smooth some of the edges, but large licensees including Samsung, Huawei and Qualcomm will have questions about Armâ\u0080\u0099s neutrality after Nvidia completes this acquisition. In the end, I think Nvidia will do what it has to in order to protect its $40 billion investment in Arm â\u0080\u0094 both in terms of customers and regulators. I believe this deal will happen in the 18-month time frame provided. The acquisition of Arm by Nvidia isnâ\u0080\u0099t only the biggest deal ever in semiconductors, but a springboard to take Nvidiaâ\u0080\u0099s market value north of half a trillion dollars with a sustained runway for growth. With Nvidiaâ\u0080\u0099s already strong momentum, coupled with a greater set of tools in the form of architecture and licensing to expand its footprint, this deal is every bit as significant as the early-market reaction indicates. Could a trillion be in Nvidiaâ\u0080\u0099s sights? Ambitious, perhaps, but certainly not out of the question for Nvidia with Arm in tow. Daniel Newman is the principal analyst at Futurum Research, which provides or has provided research, analysis, advising and/or consulting to Qualcomm, Nvidia, Intel, Samsung, ARM, and dozens of companies in the tech and digital industries. Neither he nor his firm holds any equity positions in any companies cited. Follow him on Twitter @danielnewmanUV."}]}