{"article": [{"url": "https://www.marketwatch.com/story/childrens-place-is-in-a-good-place-for-a-comeback-analysts-say----right-behind-walmart-target-and-kohls-2020-08-26", "published": 1598519600.0, "headline": "Childrenâ\u0080\u0099s Place is in a good place for a comeback, analysts say -- right behind Walmart, Target and Kohlâ\u0080\u0099s", "body": "Childrenâ\u0080\u0099s Place Inc. is taking a hit from the slow start to the back-to-school season, but analysts say the company is well-positioned for a comeback when the time comes. Shares of the kidâ\u0080\u0099s retailer fell nearly 19% on Tuesday after it reported wider-than-expected losses during the second quarter and braced investors for continued pain in the third quarter. The stock is down more than 13% for the week so far and shares have plunged more than 69% for the year to date. The S&P 500 index SPX, +0.87% Â has gained 7.7% for the period. But analysts took a hopeful tone for Childrenâ\u0080\u0099s Placeâ\u0080\u0099s PLCE, -6.78% Â future, with the retailer holding a top spot with consumers, alongside Walmart Inc. WMT, +1.00% Â , Target Corp. TGT, +1.14% Â and Kohlâ\u0080\u0099s Corp. KSS, -1.64% Â â\u0080\u009cWe see a meaningful opportunity for Childrenâ\u0080\u0099s Place to take market share once the pandemic ends and the retail landscape normalizes,â\u0080\u009d UBS analysts led by Jay Sole said. See:COVID-19-related consumer needs are turning Best Buy into an essential retailer, analysts say â\u0080\u009cNew market research shows 6.8% of U.S. moms say The Childrenâ\u0080\u0099s Place is the retailer they shop most often for childrenâ\u0080\u0099s clothing. This percentage ranks fourth to only Walmart, Target and Kohlâ\u0080\u0099s.â\u0080\u009d UBS rates Childrenâ\u0080\u0099s Place stock neutral with a $20 price target, down from $26. â\u0080\u009cSince the onset of the pandemic in March, we have focused on internally modeling and externally discussing the potential short-term headwinds of COVID-19 as they relate to our business, particularly, the impact of continued remote learning through the back half of the year and the pressure on Q4 due to reduced holiday traffic and a sustained promotional environment,â\u0080\u009d said Jane Elfers, chief executive of Childrenâ\u0080\u0099s Place, on the earnings call, according to FactSet. â\u0080\u009cAt the same time, weâ\u0080\u0099ve remained focused on the long term by accelerating our digital and fleet optimization strategies in support of market share opportunities that have been and will continue to be created by the pandemic.â\u0080\u009d Childrenâ\u0080\u0099s Place online sales rose 118% during the quarter. And:Target reports record-setting quarterly profits and comparable sales, $5 billion in market share gains for first half of 2020 â\u0080\u009cChildrenâ\u0080\u0099s Place gained market share in 1H20 despite permanent and temporary store closings and is well ahead of the competition in its omnichannel transformation with e-commerce trending to ~60% of total sales in FY22,â\u0080\u009d wrote Monness Crespi Hardt in a note. â\u0080\u009cWe continue to see significantly greater earnings potential in FY21 and beyond and think Childrenâ\u0080\u0099s Place shares are undervalued based on this earnings power.â\u0080\u009d Monness Crespi Hardt rates Childrenâ\u0080\u0099s Place stock buy with a $35 price target, down from $55. And Wedbush analysts rate Childrenâ\u0080\u0099s Place stock neutral with a $20 price target, down from $25, taking into account the increased fulfillment costs during the remainder of the year as the company hangs on to the advantages of offering free shipping. Donâ\u0080\u0099t miss:Walmart said government stimulus money bolstered Q2â\u0080\u0099s blowout results and analysts are concerned now that itâ\u0080\u0099s been spent Childrenâ\u0080\u0099s Place plans to keep its back-to-school assortment available for a longer period this year to give parents time to determine when, or if, in-person learning will take place. â\u0080\u009cTypically, approximately 70% of 3Q sales generate in August and September, with the majority of sales coming from the back-to-school products,â\u0080\u009d Wedbush said."}]}