{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-slump-as-investors-await-us-retail-sales-report-2020-08-14", "published": 1597413920.0, "headline": "Gold declines for the session, posts first weekly loss since early June", "body": "Gold futures ended lower Friday, pulling back after two straight days of gains, with prices registering their first weekly loss in 10 weeks on the back of recent strength in U.S. Treasury yields. The week began with gold trading in record territory, but will end with “several factors weighing on the price of gold,” including hopes for a COVID-19 vaccine and a rise in Treasury yields, said Chris Gaffney, president of World Markets at TIAA Bank. Higher yields in government debt have been attributed to some of the softness in the gold, which doesn’t offer a yield. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% on Thursday touched its highest in eight weeks. In Friday dealings, it was trading at 0.693% compared with 0.562% last Friday. “The ‘cost of carry’ of gold is negative in the current environment as investors are not sacrificing interest to carry hard assets such as gold,” Gaffney told MarketWatch. December gold GCZ20, +2.17% GC00, +2.17% retreated $20.60, or nearly 1.1%, to settle at $1,949.80 an ounce, after climbing 1.1% on Thursday. Gold prices saw a weekly decline of about 3.9%, based on the most-active contract’s settlement last Friday, which snapped a nine-week win streak, according to FactSet data. On Tuesday, futures prices suffered the biggest daily dollar decline since April 15, 2013. Meanwhile, September silver prices US:SIU20 dropped $1.63, or 5.9%, to end at $26.089, after surging 6.7% a day ago. Silver suffered a 5.3% weekly loss. “ ‘If one word could be used to describe gold’s price action this week, the best fit would be “insane”.’ ” — Lukman Otunuga, FXTM “If one word could be used to describe gold’s price action this week, the best fit would be ‘insane’,” Lukman Otunuga, senior market analyst at FXTM, told MarketWatch. “After experiencing an intense session of profit-taking earlier in the week…the precious metal is trading back above $1,950,” he said. “Investors still remain attracted towards the precious metal thanks to U.S.-China tensions, the U.S. stimulus stalemate and an unloved U.S. dollar.” Investors Thursday also parsed economic reports in the U.S. to help gauge the impact of the COVID-19 pandemic on the national economy. A report on U.S. retail sales rose 1.2% in July, coming in weaker than a forecast. U.S. retail sales missed expectations, “a sign the global recovery is slowing,” said Gaffney. “This is why a vaccine is so important. Consumers will not feel fully confident to travel and spend until they feel safe from the virus.” The U.S.’s report on sales come after a 1.1% decline in Chinese retail sales in July, versus expectations for a flat reading. Separately, a report on U.S. productivity rose at an annualized rate at 7.3% in the second quarter, far surpassing expectations for a reading of 1.4%, based on average estimates from economists polled by MarketWatch. Industrial production rose by a better-than-expected 3% in July, for the third straight monthly gain. Looking ahead, gold traders will continue to monitor “the possible emergence of a ‘second wave’ of the virus across Europe and Asia,” as well as interest rates, as gold will benefit if interest rates stay low, said Gaffney. Traders will also watch talk of economic stimulus and the resulting interest in debt levels, he said. Among other metals traded on Comex Thursday, September copper US:HGU20 tacked on nearly 1.9% to $2.859 a pound, for a weekly rise of 2.4%. October platinum PLV20, +3.99% shed 2.4% to $959.10 an ounce, losing 1.2% for the week, and September palladium US:PAU20 lost 3.3% to $2,143.80 an ounce—down 1.5% from the week-ago finish."}]}