{"article": [{"url": "https://www.marketwatch.com/story/republican-attempts-to-suppress-the-vote-must-be-stopped-11601905209", "published": 1601973200.0, "headline": "Republican attempts to suppress the vote must be stopped", "body": "AFP via Getty Images . Donald Trump has governed in some ways that no U.S. president has ever done before. One is that he made almost no attempt to expand his support beyond his hard-core base. Even dictators generally come to a different conclusion about what is best for their political survival. But Trump has had difficulty even distancing himself from violent organized white supremacists. Another is the unprecedented extent to which he has used distraction as a primary media and political strategy. There is always something potentially damaging about him in the media—many observers thought he was finished before the 2016 election when the infamous “grab ‘em by the pussy” tapes were released. Trump’s strategy for damage control has been unique, and unrelenting: create a distraction that the media will latch onto and displace the scandal du jour. Even if the distraction is a net negative in the polls, it is easy to move on to something else. Rinse, repeat. Trump’s trade wars, for example, were made-to-order for this strategy; it is easy to pick a fight with almost any trading partner and declare victory when it’s over. “ This is about an attempt to steal an election—one of the most serious crimes that can be committed in a democracy. ” Trump’s strategy has kept his approval ratings at a more constant level than any president in the past 70 years. But the downside, for Trump, is that he will need to expand beyond his base in order to get re-elected. Unless he can suppress enough Democratic votes, that is. Therefore, voter suppression is the first priority of his 2020 strategy. Also read: Trump wants poll watchers — This is what happened after New Jersey Republicans used them to intimidate voters in 1981 That is where the United States post office comes in. Because of the COVID-19 pandemic, there will be a record number of votes by mail; and Democrats are expected to vote much more by mail than Republicans. In May, Louis DeJoy, a major Republican donor, was appointed to run the U.S. post office, and he immediately began implementing measures that slowed down the delivery of mail. On Aug. 18 he announced that he would suspend his initiatives that were slowing mail delivery. This happened the day after two members of Congress, Reps. Ted Lieu and Hakeem Jeffries, threatened to go to the FBI to pursue criminal charges against him for interfering with mail delivery, including ballots in particular. The threat of criminal prosecution must be stepped up; it’s probably the only thing that people like DeJoy will listen to. Members of Congress should make it clear that anyone in the management of the U.S. post office—or anywhere else—who was involved in reducing the capacity of the U.S. Postal Service to process mail ballots will face criminal prosecution to the full extent of the law. This includes DeJoy, who should be promised immediately that there will be a congressional investigation of what has happened at the post office under his management. Opinion: Instead of selling off the Postal Service, why not expand the services it provides to every community in America? There is already considerable evidence of a deliberate intent to slow mail delivery, which would warrant a criminal investigation by the FBI. Two weeks ago, a federal judge in Washington state stated: “At the heart of DeJoy’s and the Postal Service’s actions is voter disenfranchisement.” Chief Judge Stanley A. Bastian, of the U.S. District Court for the Eastern District of Washington state, also issued an injunction prohibiting the Postal Service from the use of various instructions that would slow down mail delivery. These include “ (1) eliminating overtime; (2) decommissioning sorting machines; (3) removing mailboxes; (4) reducing operating hours; and (5) changing how election mail is classified.” Trump himself gave a pretty clear indication of his own intentions back in August, when he announced that he would not approve emergency funding for the U.S. Postal Service, and followed with: “They don’t have the money to do the universal mail-in voting. So therefore, they can’t do it, I guess,” Trump said. There have now been four nationwide injunctions against the U.S. Postal Service issued by federal judges, as a result of lawsuits over the changes that DeJoy has made since May. This is a major achievement by state attorneys general and others who have taken legal action; but it is not enough. This is about an attempt to steal an election—one of the most serious crimes that can be committed in a democracy. Anyone involved in such an operation—including Trump himself—must be held criminally liable. 4 common mistakes that could get your mail-in ballot rejected—and how to make sure your vote is counted Democrats will also need to make sure that Trump cannot get the same kind of mileage from distractions in the month that remains until Election Day. that he has gotten over the past four years, In the 2018 elections, Democrats stayed on message—focusing on issues such as health care and Republican attempts to eliminate Affordable Care Act coverage; they turned out 25 million more voters than in the last non-presidential-year election (2014) and took 41 new seats to regain a majority in the House. Trump’s provocations such as threatening to not accept the election results are a distraction; of course they must be denounced forcefully, most important for promoting violence. But between now and the election, Trump and his party must be held accountable for what they have already done, and the mass death and suffering that their decisions have caused. Trump’s falling ill with COVID has obviously elevated the visibility of this issue; but there is no telling how this will play out in the debate over health policy during the 30 days remaining before the vote. The vast majority of the 200,000 Americans who have perished in the pandemic could have been saved. And both Trump and his party have tried very hard, and continue to try, to take away health care from millions of Americans; with some Republican governors succeeding. And now they—both Trump and his party—deny desperately needed aid to the unemployed and to the state and local governments who must help the poor, the sick, and the vulnerable in this unprecedented crisis of deep recession and pandemic. And at the same time, Democrats need to bring some “law and order” to these elections: people who deprive Americans of their constitutional right to vote, in order to steal an election, will be prosecuted, convicted, and imprisoned. If you can’t do the time, don’t do the crime. Mark Weisbrot is co-director of the Center for Economic and Policy Research in Washington, D.C. He is the author of “Failed: What the ‘Experts’ Got Wrong About the Global Economy” (2015, Oxford University Press).More on the election Three in four Americans are worried about foreign interference in the presidential election Peter Morici: The case for Trump Nouriel Roubini: Why Biden is better for the economy than Trump"}]}