{"article": [{"url": "https://www.marketwatch.com/story/bidens-401k-plan-changing-tax-incentive-for-retirement-saving-is-a-great-idea-2020-09-14", "published": 1600094060.0, "headline": "Bidenâ\u0080\u0099s 401(k) plan: Changing tax incentive for retirement is a great idea", "body": "The financial-services industry seems very upset by a relatively modest proposal in Joe Bidenâ\u0080\u0099s tax plan â\u0080\u0094 namely, changing the tax incentive to save for retirement from a deduction to a flat, refundable tax credit. Letâ\u0080\u0099s see if this proposed change would really â\u0080\u009cupendâ\u0080\u009d our entire 401(k) system. Saving under current law is tax-advantaged. Employers and individuals take an immediate deduction for contributions to retirement plans and participants pay no tax on investment returns until benefits are paid out in retirement. This favorable tax treatment significantly reduces the lifetime taxes of those who receive part of their compensation in contributions to retirement plans relative to those who receive all their earnings in cash wages. Donâ\u0080\u0099t miss:Will Bidenâ\u0080\u0099s 401(k) plan help you or hurt you? The favorable treatment accorded retirement plans costs the Treasury the difference between the present value of revenue forgone and the present value of future taxes each year. The 2020 cost for all retirement plans is estimated at $286 billion, roughly half attributable to 401(k)â\u0080\u0093type plans. Those are big numbers. These tax incentives have two problems. First, they give the biggest reward to high earners. If a single earner in the top income-tax bracket contributes $1,000, he saves $370 in taxes. For a single earner in the 12% tax bracket, that $1,000 deduction is worth only $120. In terms of simple fairness, it makes no sense to have the size of the incentive depend on earnings. Second, until relatively recently, it was unclear whether the tax incentives actually encouraged people to save more. A study of Danish data appears to have resolved this question. It found that about 85% of people are â\u0080\u009cpassiveâ\u0080\u009d savers who pay little attention to tax incentives; they adjust their spending to their take-home pay, and therefore their saving is very responsive to defaults such as auto-enrollment. Only 15% are â\u0080\u009cactiveâ\u0080\u009d savers who would be responsive to tax subsidies; but they respond to subsidies by shifting their money across accounts rather than by altering their total saving. Thus, defaults such as auto-enrollment are more effective than tax incentives at increasing saving. See:Worried about being bored in retirement? Your financial adviser has a plan In response to these issues, several policy experts have suggested restructuring and/or cutting back on the tax expenditures for retirement plans. The Biden proposal restructures the incentive by replacing the deduction with a tax credit, which is estimated to be 26%. Thus, low-wage workers would be rewarded more than under current law and those in the top brackets somewhat less. And the credit would be refundable so that even workers with no tax liability would benefit from putting $1,000 into a 401(k) plan. As under current law, earnings would continue to accrue tax-free, and withdrawals at retirement would continue to be taxed as regular income. My view is that the Biden proposal is a desirable change on equity grounds and would have little effect on contribution patterns. It doesnâ\u0080\u0099t merit hysteria. The big challenge is to close the coverage gap so that low earners as well as high earners are automatically enrolled in a workplace savings program. As the study based on the Danish data showed, automatic enrollment â\u0080\u0094 not financial subsidies â\u0080\u0094 is the key to increasing saving. The Biden website says almost all workers without a retirement plan will have access to an automatic 401(k). Now that would be a really big deal. Read on:Mike Bloomberg pledges $100 million to help Joe Biden win Florida"}]}