{"article": [{"url": "https://www.marketwatch.com/story/the-senates-china-bashing-legislation-on-auditors-has-the-nuance-of-a-sledgehammer-2020-07-24", "published": 1595606540.0, "headline": "The 'Holding Foreign Companies Accountable Act' has all the nuance of a sledgehammer", "body": "Reliable financial statements are the bedrock of U.S. capital markets, and, according to the Securities and Exchange Commission, a \"key component\" of such statements is inspection of public company accounting firms by the Public Company Accounting Oversight Board (PCAOB). If that's so, we have a problem. The PCAOB has yet to regularly inspect any PCAOB-registered firms in China and Hong Kong since the requirement was instituted in 2002. Now, following on the discovery of potential accounting fraud at a major Chinese issuer and in an election year where politicians are scrambling to establish their China hawk bona fides, the Senate has unanimously passed the \"Holding Foreign Companies Accountable Act,\" a measure described by its bipartisan sponsors as \"bill to kick deceitful Chinese companies off U.S. exchanges.\" SEC Chairman Jay Clayton offered guarded praise: \"I'm not a guy who wants to take precipitous [sic], hit the nail on the head with a hammer tomorrow, but I like the way they've approached it.\" The legislation, though, has all the nuance of a sledgehammer where a ball-peen hammer would serve better. It would not only exclude virtually all Chinese companies from U.S. markets, but it would place the SEC in a geopolitical minefield, likely harming U.S. financial market competitiveness and investors in the process. The measure would require the SEC to delist foreign issuers after three years of audits by accounting firms that the PCAOB cannot inspect due to foreign law or regulators, preventing the companies from trading on U.S. national securities exchanges and OTC markets. It also requires specific disclosures relating to state ownership and the participation of members of the Chinese Communist Party in the company's leadership. “ Chinese firms make up the vast majority of those not inspected, but the problem is not limited to China. ” It is fundamental to the rule of law that neutral rules be applied uniformly. The basic ground rules of disclosure must apply to Chinese companies as much as to any other. But seeking to vindicate the rule of law while simultaneously engaging in a little China bashing seems ill-calculated to bring about the desired result. It's true that Chinese firms make up the vast majority of those not inspected, but the problem is not limited to China. Currently, the PCAOB is unable to inspect certain Belgian accounting firms, and similar issues could resurface in the future with any country with which the PCAOB currently has an inspection arrangement. Yet the legislation only subjects China to special rules, which seems likely to inflame passions in Beijing and to do little to advance the SEC's mission of protecting investors and preserving market integrity. It thus appears all-too-reminiscent of other misguided attempts to advance foreign policy aims under the guise of the securities laws, such as the resource extraction and Congo conflict minerals rules under Dodd-Frank. Foreign policy is best left to executive agencies better positioned to advance the national interest. Delisting Chinese issuers also may also result in more harm to U.S. investors and market competitiveness than a more targeted solution. Chinese issuers are likely to go elsewhere, increasing the relative attractiveness of other securities markets, including Hong Kong and Singapore, further depressing the U.S. IPO market. U.S. investors could lose the opportunity to invest directly in high-growth companies like Alibaba BABA, -0.26% and Baidu BIDU, -0.20%. Investor demand for Chinese companies will continue, forcing investors to seek opportunity elsewhere, such as in index investments or private offerings. Delisting Chinese issuers may paradoxically increase rather than decrease investor risk. The bill, if it becomes law, may also have perverse effects on multinational corporations operating in China-including American companies-ranging from delisting of their own shares to difficulties in securing audit services. Other solutions should be considered to encourage Chinese compliance with PCAOB inspections and to protect U.S. investors, including many proposed at the SEC's recent Staff Roundtable on Emerging Markets. For example, consider making disclosure of PCAOB inspection deficiencies more prominent. Consider Nasdaq's proposed exchange rules that would increase scrutiny for companies operating in jurisdictions where inspections are blocked, including imposing higher listing standards, requiring offerings to be underwritten, and requiring management to have U.S. public company experience. Consider halting new listings altogether for problem companies. According to the ancient Confucian doctrine of the \"rectification of names,\" things tend to fall apart when words no longer correspond to the underlying realities they represent. As Confucius said, \"If names be not correct, language is not in accordance with the truth of things. If language be not in accordance with the truth of things, affairs cannot be carried on to success.\" This goes for both our securities laws and acts of Congress. If legislators want to pursue a more aggressive foreign policy toward China, fair enough. But let's not confuse that with \"Holding Foreign Companies Accountable.\" Jennifer J. Schulp is the director of financial regulation studies at the Cato Institute's Center for Monetary and Financial Alternatives. C. Wallace DeWitt is a financial regulatory lawyer in Washington, D.C., and an adjunct scholar with the center. The Cato Institute is a libertarian think tank in Washington, D.C."}]}