{"article": [{"url": "https://www.marketwatch.com/story/travelers-from-four-more-states-added-to-nys-mandatory-quarantine-2020-07-14", "published": 1594745120.0, "headline": "Travelers from four more states added to N.Y.â\u0080\u0099s mandatory quarantine", "body": "Travelers coming from New Mexico, Minnesota, Wisconsin and Ohio will have to quarantine for two weeks when they arrive in the New York tri-state area, Gov. Andrew Cuomo announced on Tuesday. They join a growing list that now totals 22 states from which travelers must self-quarantine when they arrive in New York, New Jersey or Connecticut or else face local penalties. The quarantine mandate came as new cases surge elsewhere in the U.S., including hotspots like Florida, Texas, Arizona and California. Delaware, which was briefly subject to the quarantine order, was taken off the list on Tuesday, Cuomo said.Â â\u0080\u009cRising cases around the country continue to threaten our progress,â\u0080\u009d Cuomo said in a news statement on Tuesday. The number of positive cases in New York state ticked up on Monday with 912 new positives recorded, roughly 1.5% of the 60,000 people tested that day; 71 people were hospitalized. Five deaths from COVID-19 were recorded that day. The state has provided several examples in recent weeks of contract tracers linking a cluster of cases back to domestic travel, including an attendee at a Westchester high school graduation whoâ\u0080\u0099d traveled back from Florida. The governor said on Monday that tracers found a cluster in the Capital Region tied to travelers from Georgia.Â Read: How New York City got down to zero deaths The tri-state area determines which states must quarantine based on a formula: If 10% or more of daily tests were positive on a seven-day rolling average, or if 10 per 100,000 residents were diagnosed, also on a seven-day rolling average. Enforcement teams stationed at the airports will collect travel history and contact information from travelers to ensure they adhere to the quarantine, the state announced on Monday. New York is issuing $2,000 fines to those who defy the quarantine, and up to $10,000 for those if â\u0080\u009cthey do harm,â\u0080\u009d Cuomo has said."}]}