{"article": [{"url": "https://www.marketwatch.com/story/amid-pandemic-us-officially-withdraws-from-world-health-organization-2020-07-07", "published": 1594141160.0, "headline": "Amid pandemic, U.S. officially withdraws from World Health Organization", "body": "WASHINGTON — The Trump administration has formally notified the United Nations of its withdrawal from the World Health Organization, although the pullout won’t take effect until next year, meaning it could be rescinded under a new administration or if circumstances change. The withdrawal notification makes good on President Donald Trump’s vow in late May to terminate U.S. participation in the WHO, which he has harshly criticized for its response to the coronavirus pandemic and accused of bowing to Chinese influence. The move was immediately assailed by health officials and critics of the administration, including numerous Democrats who said it would cost the U.S. influence in the global arena. Former Vice President Joe Biden has said he supports the WHO and Democrats suggested he would reverse the decision if he defeats Trump in November. Trump is trailing Biden in multiple polls and has sought to deflect criticism of his administration’s handling of the virus by aggressively attacking China and the WHO. The withdrawal notice was sent to U.N. Secretary-General Antonio Guterres on Monday and will take effect in a year, on July 6, 2021, the State Department and the United Nations said on Tuesday. The State Department said the U.S. would continue to seek reform of the WHO, but referred to Trump’s June 15 response when asked if the administration might change its mind. “I’m not reconsidering, unless they get their act together, and I’m not sure they can at this point,” Trump said. Guterres, in his capacity as depositary of the 1946 WHO constitution, “is in the process of verifying with the World Health Organization whether all the conditions for such withdrawal are met,” his spokesman, Stephane Dujarric, said. Under the terms of the withdrawal, the U.S. must meet its financial obligations to the WHO before it can be finalized. The U.S., which is the agency’s largest donor and provides it with more than $400 million per year, currently owes the WHO some $200 million in current and past dues. On May 29, less than two weeks after warning the WHO that it had 30 days to reform or lose U.S. support, Trump announced his administration was leaving the organization due to what he said was its inadequate response to the initial outbreak of the coronavirus in China’s Wuhan province late last year. The president said in a White House announcement that Chinese officials “ignored” their reporting obligations to the WHO and pressured the organization to mislead the public about an outbreak that has now killed more than 130,000 Americans. “We have detailed the reforms that it must make and engaged with them directly, but they have refused to act,” Trump said at the time. “Because they have failed to make the requested and greatly needed reforms, we will be today terminating the relationship.” The withdrawal notification was widely denounced as misguided, certain to undermine an important institution that is leading vaccine development efforts and drug trials to address the COVID-19 outbreak. “To call Trump’s response to COVID chaotic and incoherent doesn’t do it justice,” said New Jersey Sen. Bob Menendez, the top Democrat on the Senate Foreign Relations Committee. “This won’t protect American lives or interests — it leaves Americans sick and America alone.” Sen. Patty Murray, the top Democrat on the health committee, called Trump’s decision to withdraw an “abdication of America’s role as a global leader.” “It is the opposite of putting America first — it will put America at risk,” Murray said in a statement. “Refusing to work with our partners across the world to fight this pandemic will only prolong the crisis, further undermine our international standing, and leave us less prepared for future crises.” UN Foundation President Elizabeth Cousens called the move “short-sighted, unnecessary, and unequivocally dangerous. WHO is the only body capable of leading and coordinating the global response to COVID-19. Terminating the U.S. relationship would undermine the global effort to beat this virus — putting all of us at risk.” The ONE Campaign, which supports international health projects, called it an “astounding action” that jeopardizes global health. “Withdrawing from the World Health Organization amidst an unprecedented global pandemic is an astounding action that puts the safety of all Americans and the world at risk. The U.S. should use its influence to strengthen and reform the WHO, not abandon it at a time when the world needs it most,” ONE president Gayle Smith said."}]}