{"article": [{"url": "https://www.marketwatch.com/story/eu-offers-new-trans-atlantic-agenda-to-the-us-whoever-is-next-president-2020-09-16", "published": 1600265540.0, "headline": "EU offers 'new trans-Atlantic agenda' to the U.S., whoever is next president", "body": "European Commission President Ursula von der Leyen offered on Wednesday to build with the U.S., \"whatever may happen later this year (â\u0080¦) a new trans-Atlantic agenda. To strengthen [the EU-U.S.] bilateral partnership - be it on trade, tech or taxation.\" - In her annual \"state of the union\" address to the European Parliament, she said that even though European Union leaders \"might not always agree with recent decisions by the White House,\" Europeans \"will always cherish the trans-Atlantic alliance.\" - The list of disagreements between the U.S. and Europe has grown in the last years, from trade disputes to strategic and diplomatic differences, or divisions on how to tax big internet multinationals. - Von der Leyen only said a few words about Brexit, warning that the chances of a trade deal \"do start to fade.\" This is another issue where EU leaders also resent the Trump administration's position, after the U.S. president's repeated and wholehearted support for the U.K.'s departure from the Union. - The chief of the EU's top executive body also warned the European governments who advocate closer ties with Russia. \"The poisoning of [Russian opposition leader] Alexei Navalny with an advanced chemical agent is not a one-off. We have seen the pattern in Georgia and Ukraine, Syria and Salisbury - and in election meddling around the world,\" she said. Read:Trump is Putin's 'useful idiot,' Alexander Vindman says The outlook: The rules of diplomacy naturally prevent European leaders from expressing a preference in the next U.S. presidential election, although it is hardly a mystery that they would welcome a change in Washington. But what EU governments are trying to sort out for now is whether or not (and if so, how quickly) a new administration in the U.S. would help solve the outstanding problems between the two sides, and put the trans-Atlantic relationship back on its pre-2016 path. Read: U.K. economy has shed 700,000 jobs since March. And it's about to get worse"}]}