{"article": [{"url": "https://www.marketwatch.com/story/disney-loses-nearly-5-billion-in-three-months-as-pandemic-wreaks-havoc-on-business-2020-08-04%c2%a0", "published": 1596889160.0, "headline": "Disney shakes up streaming approach after losing nearly $5 billion due to pandemic", "body": "Streaming was about the only thing working for Walt Disney Co. amid a pandemic that has all but paralyzed its theme parks, live productions and cruise line, so Disney is going to rely on that direct-to-consumers pipeline even more. Disney DIS, +1.53% reported a depressing financial performance Tuesday that included a quarterly loss of nearly $5 billion due to COVID-19 and long-term depreciation of its European linear television channels. The only segment in the media empire to grow amid the pandemic included Disney+, the company’s streaming service that launched late last year and has already grown to more than 60 million subscribers. After detailing those numbers, new Disney Chief Executive Bob Chapek outlined a plan Tuesday that will leverage Disney+ and attempt to replicate its success. Disney will slightly unclog the studio’s pandemic-paused movie pipeline by premiering its long-delayed “Mulan” live-action feature on Disney+ as a pay-per-view option for $30 on Sept. 4 and launch a new streaming service overseas. Disney will release the big-budget feature in theaters in countries where the facilities are open, and charge a similar price in other countries that are sheltered in place due to COVID-19. “We see this as an opportunity to bring this incredible film to a broad audience currently unable to go to movie theaters, while also further enhancing the value and attractiveness of a Disney+ subscription,” Chapek said in a conference call. Chapek also said that Disney now expects to launch a new international streaming service under its Star brand in 2021. Disney owns most of Hulu, a streaming service in the U.S. that packages its own content and licensed shows, and seems to be creating something similar for an international audience that will be paired with Disney+. “The offering will be rooted in content we own from the prolific and critically acclaimed production engines and libraries of ABC Studios, Fox Television, FX, Freeform, 20th Century Studios and Searchlight,” Chapek said. “In many markets, the offering will be fully integrated into our established Disney+ platform from both a marketing and a technology perspective and it will be distributed under the Star brand, which has been successfully utilized by the company for other general entertainment platform launches, particularly with Disney+ Hotstar in India.” Read more: Disney+ was the only plus for Disney as coronavirus slammed other businesses Disney shares initially dropped 2% after the results hit but they rose about 10% in morning trading Wednesday following the twin streaming announcements. Disney’s shares are down 19% this year, while the broader S&P 500 index SPX, +0.87% is up 2% in 2020. The “Mulan” move could help Disney drive revenue in a fallow period, and is another nail in the coffin of “window” periods, which have allowed new films to only be shown in theaters for roughly three months. Last week, AMC Entertainment Holdings Inc. AMC, -2.17% and Comcast Corp.’s CMCSA, -0.99% Universal Filmed Entertainment Group announced a deal that severely shortened that window to less than three weeks, and now Disney will completely surpass theaters in most of the world with one of the most anticipated releases of the year. Disney could use the revenue help. Sales plunged 42% to $11.78 billion in the third quarter from a record $20.25 billion a year ago, the company reported Tuesday, while the bottom line crashed to a loss of nearly $5 billion. Disney reported a loss of $2.61 a share, compared with net income of 79 cents a share a year ago, largely due to a $4.95 billion impairment charge that “reflected the impacts of COVID-19 and of the ongoing shift of film and television distribution from licensing of linear channels to a direct-to-consumer business model on the International Channel businesses.” After adjusting for that charge and other factors, Disney reported net income of 8 cents a share, compared with $1.34 a share a year ago. Analysts surveyed by FactSet had expected an adjusted loss of 64 cents a share on sales of $12.4 billion. See also: Disney World tightens face mask policy after guests took advantage of loophole The biggest cause of the downfall was the theme parks business freefalling to less than $1 billion in sales as most offerings were closed for the entire period because of the coronavirus. Sales in the theme-parks business plummeted to $983 million from $6.58 billion a year ago; analysts had been expecting $1.05 billion on average. The direct-to-consumer and international division, which includes Disney+, reported revenue of $3.97 billion after recording sales of $3.86 billion a year ago. Analysts had expected $4.65 billion, according to FactSet. The movie business declined to $1.74 billion from $3.84 billion a year ago, while analysts expected $1.67 billion. Disney’s TV business reported revenue of $6.56 billion, down from $6.71 billion a year ago but higher than the average analyst estimate of $6.28 billion. An accounting maneuver in the TV business that boosted operating income beyond expectations helped Disney beat expectations for profit overall. Disney said that it moved costs related to its ownership of rights to sports programming to future quarters because U.S. professional sports were not played in the quarter. That boosted operating income in the media-networks segment to more than $3 billion, 48% higher than last year and nearly double analysts’ average expectation. Disney’s ESPN and ABC missed out on the NBA Finals during the quarter, but began airing fresh NBA action last week. Major League Baseball’s restart on July 23 set TV ratings records on ESPN, though the sport has been clouded by a COVID-19 outbreak among the Miami Marlins and St. Louis Cardinals, leading to a string of postponed games. Disney also recognized a gain of nearly $400 million from its investment in DraftKings Inc. DKNG, -4.51% , which went public in late April. Disney had invested in the daily-fantasy and sports-gambling website when it was a startup, and said that its investment had appreciated by $382 million, which landed on Disney’s bottom line."}]}