{"article": [{"url": "https://www.marketwatch.com/story/stock-futures-point-to-positive-finish-for-volatile-week-on-wall-street-2020-09-11", "published": 1599900380.0, "headline": "Dow ends 131 points higher Friday, but Nasdaq registers worst week since March", "body": "Stocks closed up modestly higher Friday, but Wall Street finished a volatile, holiday-shortened week sharply lower. The Nasdaq Composite booked its sharpest weekly loss since March 20, during the height of the coronavirus pandemic selling. How did major benchmarks trade? The Dow Jones Industrial Average DJIA, +0.56% rose 131.06 points, or 0.5%, ending at 27,665.64; while the S&P 500 SPX, +0.87% tacked on 1.78 points, or 0.1%, to close at 3,340.97. The Nasdaq Composite Index COMP, +1.39% shed 66.05 points, or 0.6%, finishing at 10,853.55. For the week, the Dow shed 1.7%, while the S&P 500 fell 2.5% and the Nasdaq dropped 4.1%. Markets were closed Monday for Labor Day. What drove the market? Markets don’t like uncertainty, but that is probably what’s in store over the next few months, particularly if recent Wall Street jitters over technology-led gains deepen. “A longer-lasting correction cannot be ruled out,” said Frédérique Carrier, head of investment strategy at RBC Wealth Management, in a Friday note, pointing to the Nasdaq’s rapid 10% fall into correction territory from a record close in September that “barely dents its recent outperformance.” “Investors should brace for more choppiness in the months ahead, with COVID-19 infection rates remaining in the headlines, U.S. elections approaching, U.S.-China tensions ratcheting up, and Brexit challenges lingering,” she said. The S&P 500 index on Friday booked its largest two-week drop since March 27, according to Dow Jones Market Data. “The gains and valuations have been reaching the extremes in the nosebleed section,” said Deron McCoy, chief investment officer at SEIA, in Los Angeles, of soaring technology and stay-at-home shares during the pandemic. “Everyone’s rushed into those name and bullishness has been so high.” He recommends taking profits in the S&P 500’s top five technology companies, while rotating into shares of industrials and materials that have lagged behind, but also could benefit from an improving economy in 2021, once an effective COVID-19 vaccine looks more likely to be at hand and the nation gets on the other side of November’s election. The sharp rally that took stocks from their March pandemic lows to new all-time highs was led by a handful of large-cap, tech-related stocks. Among those highfliers, shares of Apple Inc. AAPL, +1.74% and Netflix Inc. NFLX, +1.43% declined more than 6.5% on the week, while Facebook Inc. FB, +0.26% saw an 5.7% weekly decline. “The assets that led 2020, might not be the assets the lead 2021,” McCoy told MarketWatch. Related: Big Tech is turning on one another amid antitrust probes and litigation The week also saw U.S. politicians fail to agree on a new coronavirus rescue package after Democrats blocked a Republican bill on the Senate floor, leaving the way forward unclear, analysts said. Powerful wildfires also blazed up and down much of the West Coast, with fires now burning across more than a dozen Western states and an unprecedented 10% of Oregon’s population forced to evacuate their homes Friday. And as Lauren Goodwin, New York Life Investment’s economist and multiasset portfolio strategist, pointed out in a note Friday, the pandemic only accelerated the push toward more sustainable, socially responsible investing, which likely continues overtime, “regardless of who sits in the Oval Office.” “Corporations that fail to transform their business models to focus on environmental impact, social good, and solid governance will lose ground to others that have the adaptive flexibility to thrive in a new world that values smart, clean, and healthy activities,” she warned. In U.S. economic news, the consumer-price index for August rose 0.4% last month, beating average economists’ estimates for a rise of 0.3% but falling below the past two months at 0.6%. On a year-over-year basis, the CPI increased 1.3% after gaining 1.0% in July, the Labor Department said on Friday. The Treasury Department also said the federal budget deficit officially surpassed $3 trillion in August, and is on pace to hit $3.3 trillion when the fiscal year ends this month. Although, bond investors aren’t necessarily spooked by the financial strain on government finances, writes MarketWatch’s Sunny Oh. Which companies were in focus? Shares of Oracle Corp. ORCL, +0.42% fell 0.6%, even after the database software company late Thursday reported fiscal second-quarter results and an outlook that exceeded Wall Street estimates. Peloton Interactive Inc. PTON, +6.97% shares shed 4.2% after reporting late Thursday its first quarterly profit as a public company alongside record revenue. Unity Software Inc.estimated that it will sell shares in its coming public offering for a price of $34 to $42 apiece, according to an SEC filing Wednesday. Nikola Inc. NKLA, -1.36% shares lost 14.5%, a day after short seller Hindenburg Research published a report on electric-truck maker, accusing it of perpetrating an “intricate fraud” built on lies told by Trevor Milton, its founder over many years. How did other markets fare? The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% fell 1.6 basis point to 0.668%, a weekly decline of 5.2 basis points. Bond prices move inversely to yields. The ICE U.S. Dollar Index DXY, -0.58%, which tracks the performance of the greenback against its major rivals, fell 0.1%. Gold futures GCZ20, +2.17% closed 0.8% lower at $1,947.90 an ounce, snapping a three-day winning streak but booking a weekly rise. The U.S. crude oil benchmark CL.1, -1.62% tacked on 0.1%, settling at $37.33 a barrel Friday, but logging a second weekly fall blamed on rising worries over the outlook for demand. The Stoxx Europe 600 index SXXP, +0.55% rose 0.1%, closing the week up 1.7%, while the U.K.’s benchmark FTSE UKX, +0.64% rose 0.5% Friday and 4% for the week. In Asia, Hong Kong’s Hang Seng Index HSI, -0.30% and the Shanghai Composite Index SHCOMP, +1.67% both rose 0.8%, while Japan’s Nikkei NIK, -0.11% rose 0.7%."}]}