{"article": [{"url": "https://www.marketwatch.com/story/dont-cut-the-payroll-tax-lets-help-those-without-a-job-2020-07-28", "published": 1595944940.0, "headline": "Don't cut the payroll tax - let's help those without a job", "body": "For the life of me, I can't understand why anyone would think that cutting the payroll tax is a sensible thing to do in response to COVID-19 and widespread unemployment. I was encouraged to see that such a provision appears to have been shelved for now in the debate over the next federal stimulus bill. But, since bad ideas have a way of coming back, it's worth explaining why a payroll tax cut is the wrong answer. 80% of older Americans can't afford to retire - COVID-19 isn't helping The pandemic has divided the world into two groups. Those who have kept their jobs and those who are unemployed. All efforts should be aimed at helping those without a job and preventing more unemployment by helping employers - including state and local governments - to retain their current workers. Read: What I learned from being laid off in the last recession I am convinced by arguments that this is not the time to worry about deficits, but it also seems like a good time to target money to those most in need. And those who have been lucky enough to keep their jobs - and pay the payroll tax - do not need a tax cut. Moreover, fooling around with Social Security's finances can put the program at risk. Yes, the payroll tax was cut during the Obama administration, and the Treasury replenished its coffers. But why put Social Security in play during these tumultuous times? In the best of times, Social Security is a unifying force within our economy. We all participate. It forces all of us to do something that we are loathe to do on our own-put aside resources for the time when we stop working. Because we all contribute, we all feel good about receiving our benefits. Read: I have 4 goals for my money in retirement Social Security is also a great equalizer. It shrinks the huge retirement wealth gap that exists by race and ethnicity. Excluding Social Security, the ratio of white-to-black retirement wealth is 7 to 1. Add in Social Security wealth and that ratio drops to 2 to 1. For Hispanics, the ratio starts out 5 to 1 and drops to 2 to 1 with Social Security. These numbers are for late boomers, but the same pattern exists across many cohorts. Social Security particularly shines when times get tough, like now. For retirees, it offers a steady source of income, unaffected by the recession. And for older workers, it offers a critical safety net in the event they lose their jobs or are fearful of going back to work. With all the good the program does, policy makers should be devising plans to increase the money going into Social Security, not tampering with its revenue stream. Even if the Treasury makes a transfer from general revenues to cover lost payroll taxes, such a move is a big departure from secure financing by an earmarked tax and breaks the link between contributions and benefits. Read: Why you need a coronavirus care plan and how to make one In addition, while a general revenue transfer would not technically affect the program's financial balance, it would have the potential of making Social Security's shortfall look bigger to policymakers. When considering changes to eliminate the 75-year deficit in the program, Congress would have to find money not only to cover the current shortfall (3.21% of taxable payroll reported in the 2020 Trustees Report) but also to make up for the payroll tax cut. In short, a payroll tax cut is a terrible idea. Congress should focus its energies on supporting those who are already unemployed and making it possible for employers to retain workers so that the ranks of the unemployed do not swell any further."}]}