{"article": [{"url": "https://www.marketwatch.com/story/how-activist-investors-risk-triggering-even-more-automation-job-losses-and-wealth-inequality-2020-06-16", "published": 1592311400.0, "headline": "How activist investors risk triggering even more automation, job losses and wealth inequality", "body": "As COVID-19 has shut down much of the U.S. economy, socially conscious investors are making a new wave of ESG (environmental, social and governance) demands. Companies are now being asked by their shareholders to both provide greater disclosure regarding their pandemic response and to improve worker safety generally. While it is heartening to see investors place their attention and emphasis behind enhancing working conditions, if their ambitions are narrowly defined then such demands may have the unintended consequence of creating additional unemployment through increased automation. Economists already predict that upwards of 42% of the jobs lost in the coronavirus pandemic may be gone for good. In the retail space particularly, companies are looking for any and all excuses to cut costs. In this, and other industries where the risk of automation is high, ESG investors must do more than make demands related to improving worker safety. The drawback to the current ESG investor approach is that when they require more protection of workers’ health in isolation, CEOs may turn to the least costly option to address it. Economists often observe that in life, or business, there are no perfect solutions, only trade-offs in the face of scarcity. This yields a difficult situation for well-intentioned investors. While their desire is for companies to provide safe working conditions for employees, the reality may be increased unemployment and widening inequality. Because employee safety and health are added costs that eat into a firm’s bottom line, a CEO who is pressed on the issue of worker health may be more inclined — on the margin — to trade a human employee for one that can never get sick (i.e. a robot). For example, while the pandemic may have forced Gap Inc. GPS, -0.10% to temporarily shutter its brick and mortar operations, it created a dramatic spike in online purchases that, given social distance guidelines, could not be met safely by humans. What to do? Gap’s response has been to speed the acquisition and implementation of robots that assemble orders in warehouses. So far the company is treating this as positive step towards ensuring employee safety as opposed to a replacement mechanism. Yet given that one robot can do the work of four people, along with the endless search for efficiency present in the industry, automated replacement seems inevitable. “ Demands by investors for greater worker protections need to be tailored for the particular situation an employee faces. ” Examples like this from the retail sector should give pause to the ESG crowd and illustrate why blanket calls for employee safety are not sufficiently nuanced. Demands by investors for greater worker protections need to be tailored for the particular situation an employee faces in terms of the risk of automation of their position. The same goes for those in the airline industry and any other industry where automation is a possible substitute for human labor if the price of labor increases (in this case due to safety costs). More broadly, investors interested in a more optimal outcome for employees must be ready and willing to engage management on a much wider set of issues. These include unionization, severance, extension of health insurance, unemployment benefits. To do otherwise could result in a situation where companies automate at a quickened clip, and kick employees to the curb with no protections, resources, or means of recourse. Lest anyone think ESG investing is little more than a passing fad, or their potential to influence overblown, pay close to the actions of BlackRock BLK, +1.18% and its Chairman Larry Fink. BlackRock has almost $7 billion in assets under management, so when Fink speaks the business community listens. Early this year, Fink penned a letter advising CEOs that his company has placed sustainability at the center of its investment approach. While this particular action was heavily motivated by climate change risks, it is clear that the firm’s thinking extends more broadly. In closing his message, Fink stated that “companies must be deliberate and committed to embracing purpose and serving all stakeholders.” It is the same belief we hold at the George Mason University Business for a Better World Center, and the mindset we try to instill in our students. In the wake of this crisis, it is also the same value system that is motivating investors. The most high-profile instance, though, may be Amazon.com AMZN, +3.01% and its Whole Foods Market subsidiary. While Amazon is no stranger to pressure from government officials and unions on workplace safety, some of the most stinging criticism has been from its own shareholders. Prior to its annual shareholder meeting, an activist group of Amazon shareholders, including pension fund managers, took the company to task for its apparent lax approach to managing worker health in light of COVID-19. Some even went as far as to hold their own shareholder meeting, designed specifically to air grievances around workplace safety and precautions not taken to ensure employee health. While no concrete steps have been taken in response, it’s clear the reaction from shareholders has not gone unnoticed. In recent weeks we have seen much greater attention being paid to solutions that may aid workplace safety. Robots are cleaning surfaces using UV and scanning employees and patrons for fevers, and checkout counters are self-sterilizing. These advances are all being implemented with both employee and customer health in mind. They aim to stop the spread of the virus while reducing the risk of exposure to employees by removing them from the cleaning process — a laudable development in and of itself. Our concern is that the removal isn’t temporary, and ultimately the robot will serve as a permanent substitute for the labor of an employee. Derek Horstmeyer is an associate professor of finance at the George Mason University School of Business. Lisa Gring-Pemble is an associate professor at the George Mason University School of Business and the founder of Business for a Better World Center at George Mason. More:As boomers hand over the keys to the stock market, sustainability-minded younger investors let their consciences lead Plus: These 4 groups of funders are uniquely positioned to help close the racial wealth gap"}]}