{"article": [{"url": "https://www.marketwatch.com/story/trump-biden-fight-for-primacy-on-social-media-platforms-2020-07-04", "published": 1593873200.0, "headline": "Trump, Biden fight for primacy on social media platforms", "body": "On an average day, President Donald Trump sends about 14 posts to the 28 million Facebook followers of his campaign account. His Democratic rival, Joe Biden, delivers about half that many posts to an audience of just 2 million. The numbers are similarly skewed in other spheres of the social media landscape. On Twitter TWTR, -0.23% , Trump’s 82.4 million followers dwarf Biden’s 6.4 million. The president has spent years cultivating a ragtag digital “army” of meme makers and political influencers who retweet campaign messages hundreds of times daily. Trump is outspending Biden on Google GOOG, +1.97% and YouTube advertising by nearly 3 to 1. As his reelection bid faces growing obstacles, his primacy in the dizzying digital world is one of his top advantages, giving him a massive platform to connect with supporters and push a message that ignores his vulnerabilities related to the pandemic, unemployment and race relations. Biden and his allies are now working feverishly to establish a social media force of their own. For the first time, Biden outspent Trump on Facebook FB, +0.26% advertising in June, pouring twice as much money into the platform as the president. His campaign is recruiting Instagram supporters to hold virtual fundraisers. And it’s plotting ways to mobilize the power of hundreds of teens on TikTok who reserved tickets for Trump’s recent Oklahoma campaign rally and took credit for sinking the event by artificially inflating the crowd count before it began. But Trump’s head start may be tough to overcome. “Vice President Biden and Trump have very different challenges right now,” said Tara McGowan, the founder of liberal digital firm Acronym and former digital director for the Democratic super PAC Priorities USA during the 2016 campaign. “Trump needs to hold his base ... and Vice President Biden needs to define and in a lot of ways introduce himself to you new voters, and potential supporters.” But Trump’s unimpeded access to the digital microphone is facing its limits. Twitter is beginning to fact check Trump’s posts, including one that made unfounded claims that mail-in voting would lead to fraud. The company also alerted users when the president posted a manipulated video, and it hid his Twitter threat about shooting looters in Minneapolis. Under pressure in June as major companies yanked advertising from its site, Facebook promised it would label Trump posts when they break rules around voting or hate speech. Video messaging platform Snapchat SNAP, -0.18% last month also said it would keep the president’s account active and searchable but would stop showcasing his profile on the platform. And in a move to clamp down on hate and violent speech, the online comment forum Reddit decided to ban one of the president’s most prolific fan forums, The_Donald. Trump and Biden have strikingly divergent tactics on social media. A centerpiece of Trump’s digital efforts is the Team Trump Online! nightly live broadcasts streamed on Facebook, Twitter, Instagram and Twitch, an online streaming platform. The broadcasts feature top Trump surrogates including daughter-in-law Lara Trump and Vice President Mike Pence. Trump also tweets with far greater velocity, sending more than 160 Twitter messages during a seven-day period starting June 14, an Associated Press analysis of Trump and Biden’s accounts reveals. More than 50 of Trump’s posts were retweets from an assortment of users that included the U.S. Army, far-right meme makers, conservative news outlets, little-known congressional candidates and anonymous accounts that in some cases promoted conspiracy theories. The president’s steady retweets of everyday users helps fans feel connected to him, said Logan Cook, a Kansas internet meme maker whose work Trump has regularly promoted on his social media accounts. “President Trump’s team, they’re blending in with social media culture, which is also why they’re getting into so much trouble,” said Cook, whose Twitter account @CarpeDonktum was permanently suspended last week for copyright violations. His memes are controversial because he alters videos to mock Trump’s political rivals, including Biden. Twitter users celebrate being retweeted by the president, or his inner circle, like the president’s son, Donald Trump Jr., who has more than 5 million followers. Trump’s followers see producing sardonic memes or videos as a game where the ultimate prize is a retweet from the president, said Misha Leybovich, a tech entrepreneur who produces social media engagement products that support Democratic candidates and causes. “The fan base is having a blast,” Leybovich said. “If they never gave the fans the ability to be amplified by the president, the stakes would be lower.” Biden has stuck to a more conventional approach, tweeting nearly 60 messages during that same time, only a handful of which were retweets from verified accounts, like former President Barack Obama, or established news outlets. Every video Biden tweeted out over that week in June was produced by his own campaign. But the effectiveness of campaign messaging isn’t just about numbers, said Jennifer Mercieca, a political rhetoric professor at Texas A&M University. “If you want to compare the attention and engagement metrics, it might look like Trump is way ahead, but that attention and outrage isn’t always good,” Mercieca said. “When a child is throwing a tantrum, you’re giving them attention, but it’s not because you approve of their behavior.” Indeed, the Biden campaign argues that despite being outmatched on social media, their engagement is strong. “The way that they treat their supporters, it’s about distraction. It’s about keeping them angry,” said Rob Friedlander, Biden campaign digital director. “For us it’s about, how do we make you feel like you’re brought into the campaign.” The campaign is creating Facebook groups, holding virtual events on Instagram and partnering with social media influencers who create posts in support of the campaign. One such group is an Instagram account called Bakers for Biden,which bakes bread and ships sourdough starters across the country in exchange for donations to Biden. The group was born out of what Brooklyn marketing executive Domenic Venuto first saw as an inadequate response from Biden’s campaign to Trump’s taunts and conspiracy theories. Venuto said he’s come to understand the campaign’s digital strategy of ignoring Trump’s attacks. “They’ve been very good at promoting values and shying away from being baited into the same tactics (as the Trump campaign),” Venuto said."}]}