{"article": [{"url": "https://www.marketwatch.com/story/china-protests-as-u-s-rejects-its-south-china-sea-claims-11594710409", "published": 1594696460.0, "headline": "China protests as U.S. rejects its South China Sea claims", "body": "This aerial file photo taken on January 2, 2017 shows a Chinese Navy formation, including the aircraft carrier Liaoning (C), during military drills in the South China Sea. str/Agence France-Presse/Getty Images BEIJING (AP) — China on Tuesday described a U.S. rejection of its maritime claims in the South China Sea as completely unjustified and accused the U.S. of attempting to sow discord between China and the Southeast Asian countries with which it has territorial disputes. The Chinese Embassy in Washington said that a statement issued by U.S. Secretary of State Mike Pompeo deliberately distorts the facts and disregards the efforts of China and the others to achieve peace and stability in the South China Sea. “The United States is not a country directly involved in the disputes. However, it has kept interfering in the issue,” the embassy said on its website. “Under the pretext of preserving stability, it is flexing muscles, stirring up tension and inciting confrontation in the region.” Pompeo, in a statement released Monday, said the U.S. now regards virtually all Chinese maritime claims outside its internationally recognized waters to be illegitimate. The new position does not involve disputes over land features that are above sea level, which are considered to be “territorial” in nature. Previous U.S. policy had been to insist that maritime disputes between China and its smaller neighbors be resolved peacefully through U.N.-backed arbitration. Pompeo’s statement was a major change in South China Sea policy, said Zhu Feng, the director of a South China Sea studies center at Nanjing University. He said other countries challenging China’s claims may take a more aggressive stance because of America’s openly stated support. “The U.S. didn’t used to comment on the sovereignty issue in the South China Sea, because it itself is not the claimant,” Zhu said. “But this time it has made itself into a judge or arbiter. It will bring new instability and tension.” He advised against a strong response from China, saying that current U.S. policy toward the country is being driven in a significant way by President Donald Trump’s reelection considerations. “Trump’s current China policy is insane,” Zhu said. “He is making the China issue the most important topic for his election to cover his failure in preventing the epidemic and to divert public attention. I have no idea how far he will go in fully utilizing the China issue.” Chu Yin, a professor at the University of International Relations, dismissed the statement as a campaign move that doesn’t deserve serious attention. “I personally believe that Trump doesn’t have the ability to introduce a medium to long-term strategy.” Chu said. “If the two governments want to engage in strategic dialogue, we will have to wait until the completion of the U.S. election.” Associated Press researcher Yu Bing contributed to this report."}]}