{"article": [{"url": "https://www.marketwatch.com/story/hamilton-and-everything-else-coming-to-disney-in-july-2020-2020-06-24", "published": 1593803300.0, "headline": "'Hamilton' and everything else coming to Disney+ in July 2020", "body": "\"Hamilton\" is coming to Disney+ in July, and that's really all you need to know. Sure, the Walt Disney Co. DIS, +1.53%  streaming service is also adding a new Muppets series, \"Muppets Now\" (July 31), and movies like \"Solo: A Star Wars Story\" (July 10) and \"The Mighty Ducks\" (July 3), but the one true highlight will be the filmed version of the Broadway smash, starring Lin-Manuel Miranda and the rest of the original cast. \"Hamilton\" was scheduled to be released in theaters in October 2021, but due to the pandemic, it'll drop instead on July 3, just in time for Fourth of July celebrations, which are likely to be more indoors this year. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Read more: What's streaming in July on Netflix | Amazon Prime | Hulu | HBO Max Here's what else is on tap:Coming in July 2020 July 3 Animal ER (Seasons 1-2) Diary of a Wimpy Kid: Rodrick Rules Ice Age: Collision Course Ice Road Rescue (Seasons 1-4) Race to Witch Mountain (2009) The Big Green The Mighty Ducks Hamilton Pixar in Real Life, Episode 109, \"UP: Balloon Cart Away\" Disney Family Sundays, Episode 135, \"Peter Pan: Shadow Box Theater\" One Day at Disney, Episode 131, \"Zama Magudulela: The Lion King Madrid, Spain\" It's a Dog's Life with Bill Farmer, Episode 108, \"Movie Star Dogs & Hounds and Horses\" July 10 Critter Fixers: Country Vets (Season 1) Gigantosaurus (Season 1) Secrets of the Zoo (Season 3) Solo: A Star Wars Story Disney Family Sundays, Episode 136, \"Lilo and Stitch: Family Tree\" One Day at Disney, Episode 132, \"Marc Smith: Story Artist\" It's a Dog's Life with Bill Farmer, Episode 109 July 17 A Pre-Opening Report from Disneyland Diary of a Wimpy Kid: The Long Haul Disney Junior Music Lullabies Lost City of Machu Picchu Super Robot Monkey Team Hyperforce Go! (Seasons 1-2) The Mousketeers at Walt Disney World Wild Chile (S1) Disney Family Sundays, Episode 137, \"Moana: Tomato Photo Holder\" One Day at Disney, Episode 133, \"Mike Davie: Imagineering Project Manager\" It's a Dog's Life with Bill Farmer, Episode 110, \"Snake Search Dogs & Hawaiian Conservation Dogs\" July 24 Wild Congo (Season 1) Wild Sri Lanka (Season 1) Rogue Trip: All Episodes 101-108 Disney Family Sundays, Episode 138, \"Jungle Book: Finger Puppet\" One Day at Disney, Episode 134, \"Chris Christi: Helicopter Reporter\" July 31 Alaska Animal Rescue (Season 1) Animal Showdown (Season 1) Best Job Ever (Season 1) Big Cat Games Cradle of the Gods Destination World (Season 1) Dr. Oakley, Yukon Vet (Season 8) Fearless Adventures with Jack Randall (Season 1) Hidden Kingdoms of China Hunt for the Abominable Snowman India's Wild Leopards Jungle Animal Rescue (Season 1) King Fishers (Season 1) Lost Temple of the Inca Marvel Funko (Seasons 1-2) Surviving the Mount St. Helens Disaster Weirdest, Bestest, Truest (Season 1) What Sam Sees (Season 1) Muppets Now, Episode 101, \"Due Date\" div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Disney Family Sundays, Episode 139, \"Mickey and Minnie: Pillows\" One Day at Disney, Episode 135, Lauren Cabo, \"Imagineering Portfolio Creative Executive\""}]}