{"article": [{"url": "https://www.marketwatch.com/story/major-events-like-the-great-depression-or-covid-19-can-change-your-relationship-with-money-for-a-lifetime-11591981806", "published": 1591967900.0, "headline": "Major events like the Great DepressionÂ â\u0080\u0094 or COVID-19Â â\u0080\u0094 can change your relationship with money for a lifetime", "body": "Money is a universal necessity, but how each person feels about it, chooses to spend it (or not spend it) can be drastically different. Those differences, known as â\u0080\u009cmoney mindsetsâ\u0080\u009d or â\u0080\u009cmoney scripts,â\u0080\u009d are informed by personal histories, experiences, and family circumstances. They play into every aspect of a personâ\u0080\u0099s lifeâ\u0080\u0094relationships, goals, fears, careers, successes, struggles, and ultimately, higher order needs related to meaning, purpose and legacy. Thatâ\u0080\u0099s why they are important to understand.Â Â Â Â Â Â Take for example those who lived through the Great Depression in 1929. So many members of this generation grew up to earn a reputation for being thrifty. Even those who went on to have successful careers and gain substantial wealth, continued to live frugally. Why? Because their experience growing up during a period of widespread hardship and deprivation shaped them. COVID-19 will have a similarly profound impact on the money mindset of the generations who experienced it, particularly on the youngest of them. That certainly was the case with other large-scale economic disruptions such as the tech bubble, 9/11 and the great recession of 2008-2009. In fact, given the recent frequency of such events, there are some generations who will have the dubious distinction of having lived through all of these â\u0080\u0093 and their money mindsets will likely show it.Â Read: Coronavirus put seniors in the crosshairs, how can we help them? What is a money script? Research suggests that understanding our money mindset and the history that contributes to our belief system helps facilitate financial health and leads to better outcomes.Â Â Large macroeconomic events, like depressions or the current global pandemic, are a significant factor in shaping money scripts but there are many other smaller factors that contribute as well â\u0080\u0093 and they begin at a very young age. â\u0080\u009cMoney scripts are typically unconscious beliefs each of have developed concerning money and life.Â Most commonly, money scripts are formed in childhood, shaped from Â both direct and indirect messages we receive about money from our parents, other significant people in our lives, our circumstances and society as a whole,â\u0080\u009dÂ says Brad Klontz, Psy.D., CFPÂ®Â In other words, it is the emotional relationship you have with money.Â This is important because as most of us know all too well, our emotions often override our rational behavior when it comes to money matters. Thatâ\u0080\u0099s why we often get that uncomfortable gut reaction to a money topic.Â And itâ\u0080\u0099s especially the case for women as their emotional quotient tends to be higher than that of men.Â Â Â Â Read: Watch out: This is the age when you should stop trading stocks But because money tends to be a topic that is private and discussing it is often considered taboo, exploring money mindsets and unique money scripts can be uncomfortable. There are ways to makeÂ this a much more natural and common conversation through wealth planning and money script storytelling.Â This begins with a deeper understanding of the clientâ\u0080\u0099s belief system around money and an awareness how unconscious scripts can get in the way of healthy financial habits. Taking financial wellbeing beyond the numbers allows advisersÂ to connect a clientâ\u0080\u0099s financial plan with their life plan and then help them stay on track in achieving their most important goals.Â COVID-19 impact on money scripts The global COVID-19 pandemic of 2019-2020 will undoubtedly go down as a pivotal time in history, but it will also likely be an influential event in many a money script. Business owners and their employees have been devastated financially by the economic lockdown.Â Millions of jobs evaporated in a matter of weeks, particularly in the female-dominated service and hospitality sectors. And daily life as we had previously known it radicallyÂ changed. Â For the impressionable younger generations, the COVID-19 crisis is sure to leave a lasting impression, given the significant disruption to college life, graduations, internships, and job prospects. Many college grads, unable to enter the job market and launch their own lives, will also be influenced by living back at home and witnessing constant family financial stress.Â A new â\u0080\u009cscarcity of goodsâ\u0080\u009d mindset, symbolized by empty grocery shelves and toilet paper hoarding, will also likely influence how and what they buy in the future.Â Â Â Â Â For parents, in times of financial crisis such as this, our reaction to financial stress and the narrative we share with our impressionable kids can have a lasting impact.Â For all these reasons, now more than ever, we encourage clients to have healthy money discussions with their children. Share your family history and money scripts with them and how that plays into how you handle financial stress and make decisions. Help them see that what they are experiencing today will certainly shape how they view and manage money in the future.Â Angie Oâ\u0080\u0099Leary is head of Wealth Planning at RBC Wealth Management-U.S.Â Â Â Â Â Â RBC Wealth Management, a division of RBC Capital Markets, LLC, Member NYSE/FINRA/SIPC."}]}