{"article": [{"url": "https://www.marketwatch.com/story/gold-futures-slip-set-to-take-a-breather-after-carving-out-fresh-9-year-peak-2020-07-09", "published": 1594304900.0, "headline": "Gold futures pull back from a fresh 9-year peak, but hold above $1,800 an ounce", "body": "Gold futures ended lower on Thursday, pulling back a day after scoring another settlement at the highest since September 2011, but the haven metal held ground above $1,800 an ounce after data showed weekly U.S. jobless claims remained well above one million. “The U.S. economy is in recovery mode, but the recovery isn’t that smooth as per the data,” said Naeem Aslam, chief market analyst at AvaTrade. “”There is a feeling that momentum in terms of recovery have slowed or started to level off.” The number of initial jobless claims fell by almost 100,000 to a four-month low 1.31 million in the week ended July 4. The number of people receiving traditional jobless benefits through the states, meanwhile, declined to 18 million in the week ended June 27 from 18.8 million. These are known as continuing claims. If all eight state and federal assistance programs are included, continuing claims totaled an unadjusted 32.9 million in the seven days ended June 20, the most recent data available. That marks an increase from 31.5 million in the prior week. Following the data, gold futures spent time paring some of the losses they saw shortly before the release. U.S. benchmark stock indexes were trading lower as gold futures settled, but the S&P 500 SPX, +0.87% and Nasdaq Composite COMP, +1.39% have held onto gains for the week so far. “If investors truly believed that the economy was returning to pre-pandemic levels soon, gold wouldn’t be standing today at [a] 9-year high, so it’s evident that investors who are participating in this risk-on rally are also hedging their positions by adding safe havens for their safety net,” said Hussein Sayed, chief market strategist at FXTM, in a market update. Read:Why safe-haven gold is acting like a ‘risk-on’ asset as it soars toward an all-time high Also see:Why gold has become a ‘weapon of choice’ for investors August gold US:GCQ20 fell $16.80, or 0.9%, to settle at $1,803.80 an ounce, a day after the most-active contract rose 0.6% to settle at $1,820.60, the highest since Sept. 14, 2011, according to FactSet data. Prices on Thursday touched a low of $1,799.60. Precious metals have mostly benefited from expectations for a lengthy period of government and central bank stimulus to support economies harmed by the COVID-19 pandemic, but some analysts say that July also has been a seasonally strong period for gold due to heightened physical demand and appetite from exchange-traded funds. The World Gold Council said that global net inflows for gold-backed exchange-traded funds reached $39.5 billion, topping the previous annual inflow record of $23 billion from 2016, according to a report issued Tuesday. Softness in the U.S. dollar, which commodities tend to be priced in also has provided some support to precious metals, some experts say. The ICE U.S. Dollar index DXY, -0.58% was up 0.3% on Thursday, but the gauge of a half-dozen currencies has been down 0.6% so far this week, according to FactSet data. “The most significant development [in the market] seems to concern the breakout in the precious metals given ongoing U.S. dollar weakness at a time when yields also remain weak,” wrote Mark Newton, technical analyst at Newton Advisors, in a Thursday research report. “This time in July should be a sweet-spot for metals strength, and overweighting silver and gold should be favored for additional upside in the weeks ahead,” he wrote. Meanwhile, September silver US:SIU20 lost 20 cents, or 1%, at $18.962 an ounce, following its 2.5% surge on Wednesday to the highest level for a most-active contract since September 2019. For the week, silver futures have gained more than 3% so far. James Hatzigiannis, chief market strategist at Ploutus Capital Advisors, told MarketWatch that he’s “very bullish on silver,” and that it’s likely to outpace the move in gold for the rest of the year. He believes silver could easily reach the $25 level, “unless we see a corona[virus] cure.” Further spread of the pandemic will “cause silver to move up as the dollar should decrease in value ...and silver mining production will start to shut down again,” said Hatzigiannis. Elsewhere on Comex, September copper US:HGU20 settled 0.5%, higher at $2.8385 a pound. October platinum PLV20, +3.99% fell by 4.2% to $846.90 an ounce, while September palladium US:PAU20 tacked on 1.3% to $1,963.20 an ounce, bringing its weekly gain thus far to nearly 1.9%."}]}