{"article": [{"url": "https://www.marketwatch.com/story/chinas-economic-rebound-picks-up-pace-2020-09-30-14855425", "published": 1601431340.0, "headline": "China's economic rebound picks up pace", "body": "BEIJING--China's economy gathered more steam in September as a rebound in global demand and the government's supportive measures bolstered factory activity and helped push sentiment in the service sector to its highest level in nearly seven years. China's official manufacturing purchasing managers index rose to 51.5 in September, according to data released by the National Bureau of Statistics on Wednesday, higher than both the 51.2 forecast by economists and August's reading of 51.0. A separate private gauge of manufacturing activity, the Caixin China manufacturing purchasing managers index, stood at a robust 53.0, roughly in line with the previous month's level. Readings above 50 suggest an expansion in activity, with higher numbers pointing to a broader-based trend. China's service sector, a weak link in the economy for much of the summer due to lingering coronavirus concerns, also turned in a strong September. China's official nonmanufacturing PMI, which includes both the service and construction sectors, jumped to 55.9 in September, its highest result since November 2013 and better than the previous month's reading of 55.2. The improvement in the service sector, which Goldman Sachs says accounts for about 80% of the weighting in the nonmanufacturing PMI, was boosted by a bounce back in the transportation, hotel and restaurant industries, as consumers appeared more willing to travel and spend, China's statistics bureau said. Officials on Wednesday expressed hope that an eight-day holiday, which begins Thursday, will further lift consumer spending nationwide, as localities launch promotion campaigns. Lu Ting, chief China economist at Nomura, told clients in a note Wednesday that the holiday will \"likely present good numbers for retail sales and tourism due both to a pent-up demand, government promotions, and restrictions on overseas travel.\" China's retail sales, a major measurement of domestic consumption and the last holdout in negative territory among China's major economic indicators for much of the year, finally returned to growth in August for the first time this year, logging a 0.5% increase from a year earlier. The consumer sentiment had been depressed by infection concerns and elevated jobless rates. On the manufacturing side, both the official and private measures pointed to improving demand from overseas markets. The official export-order subindex climbed into expansionary territory for the first time this year, while the Caixin survey showed export orders hitting a three-year high. \"Improving external demand added fuels to China's recovery which could not rely solely on domestic demand,\" said Serena Zhou, an economist with Mizuho Securities. China's export machine has beaten economists' gloomy expectations repeatedly this year. The country's relatively quick resumption in factory activity in the spring made it possible to churn out medical equipment and work-from-home electronic goods as the rest of the world struggled with the pandemic. While some economists expect demand for pandemic-related goods to wane in the coming months, Ms. Zhou believes the rebound in global demand will continue to buoy China's exports. On the labor front, both the official and Caixin PMI reports showed further gains in hiring in September. Separately, Beijing's measures to support small businesses and boost domestic consumption began to yield positive results in September, helping small-factory activity to climb back into expansionary territory for the first time this year. An official subindex of small-factory activity rose to 50.1 after Beijing ordered state banks to extend billions of dollars worth of cheap loans to the small companies that were hardest hit by the pandemic. Grace Zhu and Bingyan Wang contributed to this article. Write to Jonathan Cheng at jonathan.cheng@wsj.com"}]}