{"article": [{"url": "https://www.marketwatch.com/story/10-year-treasury-yield-bumps-up-against-ceiling-of-two-month-range-as-supply-weighs-on-trading-2020-08-26", "published": 1598459120.0, "headline": "10-year Treasury yieldâ\u0080\u0099s move above 0.70% is short-lived after strong debt auction", "body": "Long-dated U.S. Treasury yields trimmed their rise Wednesday after market participants showed strong appetite for a record-large debt auction, affirming the bond marketâ\u0080\u0099s ability to shrug off the waves of new supply.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 0.6 basis points to 0.686%, after rising as high as 0.721%, while the two-year note rate TMUBMUSD02Y, 0.156% stood pat at 0.154%. The 30-year bond yield TMUBMUSD30Y, 1.576% climbed 2 basis points to 1.406%. Bond prices move inversely to yields.Whatâ\u0080\u0099s driving Treasurys? Debt auctions held across the world from major developed economies, including Australia and Germany, added to the pressure to global bond markets early in the day, as traders struggled to take down the rush of supply. But much of that bearish momentum vanished after investors showed strong demand for the $51 billion sale of five-year Treasurys notes, which hadall been held down by the Federal Reserveâ\u0080\u0099s clear commitment to keep its benchmark interest rate near zero for a long time. In economic reports, durable goods orders for July jumped 11.2%, much higher than the consensus forecast of a 4.8% increase, but much of the rise was driven by higher auto sales. Investors are now turning their attention to the Federal Reserveâ\u0080\u0099s policy review announcement on Thursday, where itâ\u0080\u0099s expected to switch to a policy of allowing temporary overshoots of inflation before contemplating tighter monetary policy. Read: Powell in Jackson Hole speech will put out Fedâ\u0080\u0099s welcome mat for hot labor markets and inflation overshootsWhat did market participants say? â\u0080\u009cThereâ\u0080\u0099s still a lot of demand for Treasurys. Supply matters, but it only matters so much,â\u0080\u009d said Tom Graff, head of fixed income at Brown Advisory, in an interview."}]}