{"article": [{"url": "https://www.marketwatch.com/story/us-industrial-production-has-solid-gain-in-july-index-remains-well-below-pre-pandemic-levels-2020-08-14", "published": 1597402220.0, "headline": "U.S. industrial production has solid gain in July, but index remains well below pre-pandemic levels", "body": "The numbers: Industrial production rose 3% in July for the third straight monthly gain after sharp declines in March and April, the Federal Reserve reported Friday. The gain in July was above Wall Street expectations of a 2.7% gain, according to a survey by MarketWatch. Production in June was raised to a 5.7% gain from the earlier estimate of a 5.4% increase. Despite the strong gains over the past two months, production is below pre-crisis levels, the Fed said. The index is 8.4% below its pre-pandemic February level. iframe.twitter-tweet { width: 100% !important; } What happened: Manufacturing output improved in July, rising 3.4%. Most major industries posted gains. The largest increase was registered by motor vehicles and parts. Excluding autos, factory output rose 1.6%. Mining production, which includes oil and gas extraction, rose 0.8% in July, the first gain after five straight months of decline. Output of utilities rose 3.3% as hotter weather increased air-conditioning demand. Capacity utilization rose 2.1 percentage points to 70.6%, which is 6.4 percentage points above its April low. Big picture: Economist said that the industrial sector is recovering but faces several hurdles in coming months, including weak global growth and the resurgent virus. What are they saying? “Overall, our Nowcasting models for auto sales suggest sales moderated in late July and early August. That likely means industrial production will moderate further in the coming months, settling at a pace slower than the pre-pandemic trend as the aerospace industry continues to struggle,” said T.J. Connelly, head of research at Contingent Macro. Market reaction: Stocks opened lower on Friday on a weaker-than-expected gain in retail sales. The Dow Jones Industrial Average DJIA, +0.56% and the S&P 500 SPX, +0.87% indexes were lower."}]}