{"article": [{"url": "https://www.marketwatch.com/story/closed-attractions-and-travel-restrictions-put-new-york-citys-70-billion-tourism-industry-on-hold-indefinitely-2020-07-09", "published": 1594305200.0, "headline": "Closed attractions and travel restrictions put New York City's $70 billion tourism industry on hold indefinitely", "body": "With Broadway theaters dark, museums and stadiums closed, and no bars letting patrons in to take a break from sweaty sidewalks, New York City looks nothing like its usual self at the height of the summer tourist season. The city's signature features are closed for the foreseeable future, putting much of the economy on hold, and making how long it will be until tourists return a multibillion-dollar question. And just as New York seems to have finally gotten a handle on coronavirus cases, infection rates have exploded in dozens of states, effectively dashing hopes of returning to anything resembling the city's usually lucrative tourism trade any time soon. Indoor dining that was supposed to come as part of Phase 3 has been put on hold indefinitely, and Gov. Andrew Cuomo recently imposed a 14-day quarantine on visitors from 19 states including California, Texas and Florida. In 2019, tourism was a $70 billion industry that brought a record 67 million visitors to New York City. But as far as when the city might be able to safely start welcoming back visitors, \"I think it's a big question mark,\" said Andrew Rigie, executive director of the New York City Hospitality Alliance. \"Without knowing when [tourists are] going to come back, it creates even more uncertainty for small-business owners.\" Read: 5 myths about wearing masks Experts have estimated that as many as 25,000, or 20%, of the city's hotel rooms may not return after the pandemic, indicating that the current crisis could have longer-ranging effects on the city's volume of visitors. In lieu of making plans that are contingent on tourism, bars, restaurants, and venues are instead turning their attention toward creatively drumming up business from locals for the foreseeable future. \"Worldwide tourism will be back, but right now the main focus of bars and restaurants is serving their local regulars and attracting 'tourists' from other parts of town,\" said Ariel Palitz, senior executive director of New York City's Office of Nightlife. But even city residents will be limited in their options as \"tourists,\" unable to take in shows at Lincoln Center, Brooklyn Cyclones games in Coney Island, or exhibitions at the Metropolitan Museum of Art, all of which remain closed. And though expanded outdoor dining and the ability to legally deliver alcoholic drinks have helped some bars and restaurants reopen to brisk business, in an industry known for slim margins, those measures may not be enough to keep businesses afloat during an indefinite tourism drought. Also see: Under proposed plan, NYC students to attend in-person classes two or three times a week in September \"There's no way small-business owners will be able to pay multiple months of missed rent, or even pay their pre-pandemic rents when they're reopened but at a limited capacity,\" Rigie said. \"We're going to continue to need support from the federal, city and state governments to sustain these businesses so they can fully recover when the time comes.\" While theaters and venues remain closed, the city's entertainment industry is exploring options for moving summer events outdoors or in spaces that allow for adequate social distancing. Late last month, the Tribeca Film Festival announced plans to host a series of drive-in movies this summer at Orchard Beach in the Bronx. \"We're getting a ton of those inquiries,\" said Anne Del Castillo, commissioner of New York City Mayor's Office of Media and Entertainment. \"We're coordinating to really look holistically at public space throughout the city and develop opportunities for organizations to collaborate.\" Accommodating local residents is a priority, as it's getting increasingly unclear how long it will take for tourists to return. Current travel restrictions apply to any state with an infection rate higher than 10%, which means that more than 150 million Americans are technically barred from visiting New York City without undergoing a two-week self-quarantine upon arrival. Instead of asking how to accommodate tourists, the going question for public officials right now is how to properly enforce restrictions on so many of them. \"The first part [of recovery] is getting the workforce back in the entertainment, media and nightlife sectors,\" Del Castillo said. \"The second part is getting New Yorkers to come back out to enjoy those offerings. And that builds momentum for tourism â\u0080¦ to come back.\" Read more: Even with reopening, New York still faces a future that looks very different But having seen what's happened with hasty reopenings in other states, which have experienced near-immediate spikes in cases and abruptly closed back down, even owners of businesses that depend the most on tourism are approaching the issue with caution. \"The feedback from various sectors is that they appreciate\" the city's staggered reopening plans, Del Castillo said. \"They see what's happening in other jurisdictions and don't want that to happen here.\""}]}