{"article": [{"url": "https://www.marketwatch.com/story/student-loan-borrowers-can-skip-payments-until-2021-but-that-may-not-be-long-enough-11598369805", "published": 1598782640.0, "headline": "Student-loan borrowers can skip payments until 2021, but that may not be long enough", "body": "The Department of Education, led by Secretary of Education Betsy DeVos clarified President Donald Trump's executive action on student loans last week. jonathan ernst/Reuters It’s official: Millions of student loan borrowers won’t have to make payments on their debts through the end of this year, the Department of Education clarified last week. But the extra few months of student-loan relief likely isn’t enough to mitigate the economic devastation borrowers are experiencing. And the timing of the resumption of payments could still create administrative headaches for borrowers. “We’re still just kicking the can down the road,” said Persis Yu, the director of the Student Loan Borrower Assistance Project at the National Consumer Law Center. “What we were really hoping for was a long-term solution that would both stop the hemorrhaging and then allow people to recover.” The Department of Education’s announcement comes as negotiations on another coronavirus stimulus package remain stalled in Washington. Earlier this month, President Donald Trump announced that he would be pausing student loan payments until the end of the year, but questions about the details remained. The Department’s announcement Friday clarified that essentially the pause on student loan payments and collections passed by Congress as part of the CARES Act in March — which was set to expire on Sept. 30, roughly one month before the presidential election — will instead continue until Dec. 31. Like the CARES Act, this latest payment pause only applies to borrowers with federally-held student loans. That means at least roughly $165 billion in federal student loans are ineligible for the payment pause, according to Mark Kantrowitz, the publisher of SavingforCollege.com. Borrowers with these types of loans are “still left out,” Yu, notes, putting them in danger of falling off a financial cliff, she said. Still, two key questions voiced by advocates when Trump announced the payment pause appear to have been answered by last week’s announcement. Ben Miller, vice president of post-secondary education at the Center for American Progress, a left-leaning think tank, said he was pleased to see that it appears that the paused payments will count as part of the 120 monthly payments needed to qualify for Public Service Loan Forgiveness and that borrowers who have defaulted on their student loans won’t be subject to collections during the pause period. The Department’s announcement notes that borrowers whose wages are garnished over their defaulted debts during this period will receive refunds. The agency has faced challenges implementing the provisions of the CARES Act related to defaulted borrowers. Up to 22,000 borrowers who’ve already had their wages seized didn’t have a valid address on file with the Department, according to documents filed as part of a lawsuit on behalf of borrowers who were still having their paychecks seized despite the CARES Act payment pause. That means their refunds could be on hold. Though he believes that the policy choices surrounding PSLF and defaulted borrowers were the right ones, Miller added that, “I don’t think stopping the pause at the end of the year makes a lot of sense.” “I just would be shocked if the economy was in much better shape by the end of the year such that you wouldn’t want to keep pausing anyway,” Miller said. In addition to economic concerns, restarting student loan payments on the first of the year will likely create many administrative challenges, he said. The holiday season and end of the year is a time when it’s difficult for many to focus on getting finances and paperwork in order to restart student loan payments. Borrowers who may want to enroll in payment plans that allow them to repay their loans as a percentage of their income won’t have updated tax data at the end of the year, Miller noted, because the only completed tax year they’ll have will be from 2019, before the pandemic. Resuming student loan payments and collections before the new tax season could also create financial challenges for defaulted student loan borrowers, Yu said. If student loan collections do start again on Jan. 1, defaulted borrowers’ tax refunds could be at risk of being seized to repay their student loans, she said. “We know how important these tax refunds are for helping folks weather storms,” Yu said. Many people may use them to pay back due rent or other expenses they struggled to cover as a result of the pandemic. “Even if we are in the recovery period,” when payments resume, Yu said, “those funds are going to be vital for borrowers to actually recover.” These and other concerns mean that Trump’s executive order doesn’t absolve Congress from doing more, Miller said. The HEROES Act passed by the Democratic-led House of Representatives in May included $10,000 of student loan forgiveness for economically distressed borrowers and extended the payment pause until September 2021. The Republican-led Senate hasn’t taken up the measure. The proposed stimulus bill Republican Senators released last month includes a provision allowing borrowers who aren’t making any money to skip student loan payments, an option already available to borrowers under the current system. Both Miller and Yu said they would like to see some kind of debt cancellation provision. Miller noted this period could be a particularly opportune time to consider the plight of borrowers who have defaulted on relatively small loan balances — a group that tends to struggle to get out from under their debts. “This is just one piece of the puzzle,” Miller said of the payment pause. “There’s still nothing for colleges, nothing for states and without that, whatever pause we’re giving borrowers now is just going to be totally swamped by tuition increases, debt increases.”"}]}