{"article": [{"url": "https://www.marketwatch.com/story/travelers-from-high-risk-states-to-new-york-must-self-quarantine-violators-could-be-subject-to-2000-fine-2020-06-24", "published": 1593018020.0, "headline": "Travelers from high-risk states to New York must self-quarantine; violators could be subject to $2,000 fine", "body": "New York, New Jersey and Connecticut will impose a quarantine on travelers visiting the tri-state region from states with high infection rates beginning midnight Thursday. Travelers coming from high-risk areas will have to self-quarantine for 14 days once they arrive to limit potential spread in a region once battered by one of the most severe outbreaks in the world. The list of states subject to the new quarantine will be updated regularly, and as of Wednesday included Florida, Utah, North and South Carolina, Alabama, Utah, Washington, Texas, Arkansas and Arizona, Gov. Andrew Cuomo said during a joint news conference with Govs. Phil Murphy of New Jersey and Ned Lamont of Connecticut. “We’ve worked very hard to get the viral transmission rate down and we don’t want to see it go up again because people are traveling into the state and bringing it with them,” Cuomo said. Enforcement will be hard and rely on a mixture of law enforcement, people reporting noncompliance and travelers taking the law seriously. Violators in New York will be subject to mandatory quarantine and a $2,000 fine if discovered, and will be liable for up to $10,000 if “you cause harm,” Cuomo said. He gave the example of police officers pulling over cars with license plates from high-risk states and using data from the Port Authority to check when visitors arrived. Also see: 100 days of the COVID-19 pandemic: 5 critical mistakes that created the biggest public-health crisis in a generation The governors called the decision a common-sense policy as much of the country struggles with renewed flare-ups of COVID-19. Residents of the tri-state area have been through “hell and back,” Murphy said at the joint briefing. “The last thing we need to do is subject our people to another round.” The states’ departments of health would coordinate on which places to include in the mandatory quarantine. It would be based on a standard metric of states where the infection rate is higher than 10 per 100,000 residents, or a 10% positive test rate. As of Wednesday, New York’s positive test rate was 1.1% statewide. New York is among very few places that have so far successfully contained its outbreak, which peaked in early April with tens of thousands of people in hospitals and, in downstate, makeshift health-care facilities. As of Wednesday, total hospitalizations statewide were down to 1,071, Cuomo said. Nearly two-dozen states have widespread active outbreaks or are at risk of second waves, according to a multidisciplinary organization Covid Act Now, as speedy reopenings failed to control transmission. More than 20% of all Arizonans tested for the disease are now coming back positive and intensive care units are at capacity in the state, according to the organization. Traveler quarantines are but one of numerous policies the state has crafted to contain the virus, which included hiring thousands of tracers to find and test potential carriers and implementing a cautious, phased reopening. Malls, gyms and movie theaters learned this week that they would not reopen, as some thought, when five regions of New York begin Phase 4 on Friday. The regions to enter the final phase this week include the Mohawk Valley, North Country, Southern Tier, Finger Lakes and Central New York—all relatively rural. Also see: Fauci says in 40 years of dealing with viral outbreaks, he’s never seen anything like COVID-19 New research has shown that air-conditioning systems can recirculate the disease, making crowded enclosed spaces vulnerable, Cuomo said on Wednesday. Public health experts would review the latest information to craft guidelines on places like malls and theaters. “We’ll have a decision as soon as we review the data,” he said, adding that he doesn’t anticipate adding a fifth phase. Other New York developments: Marathon canceled: The New York City Marathon, which draws tens of thousands of runners each year from all over the world, is canceled this year due to the pandemic, New York Road Runners announced on Wednesday. The annual race was scheduled for Nov. 1. Beaches: New York City will open its beaches to swimmers beginning July 1, Mayor Bill de Blasio said on Wednesday. Pools will remain closed. Layoffs: The mayor also said the city could have to lay off as many as 22,000 city workers in the wake of a budget shortfall caused by the pandemic. The city is still holding out hope for another round of federal stimulus that would aid state and local governments."}]}