{"article": [{"url": "https://www.marketwatch.com/story/economy-suffers-titanic-329-plunge-in-2nd-quarter-gdp-shows-and-points-to-drawn-out-recovery-2020-07-30", "published": 1596128300.0, "headline": "U.S. economy plunges at titanic 32.9% rate in 2nd quarter and points to drawn-out recovery", "body": "The numbers: An economy badly battered by the coronavirus shrank at a record 32.9% annual pace in the second quarter, underscoring just how big a hole the U.S. finds itself in as it labors to recover from the deepest recession in American history. The tidal wave of damage from the first global pandemic in a century was almost as bad as Wall Street expected. Analysts polled by MarketWatch had forecast a 35% decline in gross domestic product at an annual pace, the official scorecard of the U.S. economy. The economy began to recover in mid-May after a severe contraction at the beginning of the quarter, but the U.S. faces a long road back, analysts say. Millions of Americans are still out of work, thousands of businesses have closed and many of those that remain open have had to scale back operations because of tepid demand or ongoing government restrictions. The recent surge in coronavirus cases in about half of U.S. states, especially large ones such as Texas, Florida and California, has also dealt a blow to a fragile economic recovery. Read:Consumer confidence wanes in July and points to rockier economic recovery Previously GDP had never shrunk by more than 10% on an annualized basis in any quarter since the government began keeping track shortly after World War Two. What happened: Consumer spending, the main engine of the economy, contracted by a record 34.6% annualized clip in the spring. The decline was especially sharp in services — travel, tourism, medical care, eating out and the like. Businesses that rely on large groups of customers and heavy store traffic bore the brunt of government lockdowns after the pandemic erupted. Spending on services nosedived at a 43.5% annual pace. Households also spent far less on goods, though the decline wasn’t quite as steep. Purchases dropped 11.3%. Americans bought more cars, groceries and certain other household staples with many working from home, but sales of clothing, gasoline and many other goods all fell sharply. Read:Jobless claims rise for second straight week as U.S. economic activity slows down Business investment also stumbled badly as companies froze or slashed spending. Outlays on infrastructure such as oil rigs sank 35% while spending on equipment shrank by 37.7%. Both are record declines. Investment in new housing also shriveled up by 38.7%, but it appears to have sprung back quickly. Record low mortgage rates have spawned a rash of new home sales and spurred builders to step up construction toward the end of the quarter. The level of inventories also shrank by a whopping $234.6 billion annual rate in the second quarter, compared to an $80 billion dropoff in the first quarter. Companies cut back on production as sales slumped and exports tumbled. That’s also weighed heavily on the economy, though production has picked up in the last few months after the economy largely reopened. Government spending was a mixed bag. The federal government stepped in with massive infusions of aid for businesses, households and the unemployed, but states and localities have suffered a big drop in tax revenue even as expenses soared. Read: ‘A massive welfare economy’ - federal aid prevents even steeper GDP collapse Overall government outlays edged up 2.7% in the spring. Federal spending jumped more than 17%, offsetting a 5.6% decline in state and local outlays. International trade was a smaller drag on the economy. Exports dwindled by 64% in the second quarter, topping a 53% drop in imports. The coronavirus caused massive disruptions in the flow of global trade and a worldwide economic slump resulted in far less demand. Read:U.S. trade deficit in goods falls 6% as exports rebound, but the big picture is still ugly It may be months if not years before trade fully recovers, economists say, especially with the U.S. and China still at loggerheads on a number of issues. The two countries have the world’s largest economies. The rate of inflation, meanwhile, fell at a 1.9% pace in the second quarter after increasing early in the year. The cost of many goods and services have fallen as companies cut prices to try to drum up sales. Inflation is likely to remain low until the pandemic fades. Looking back at the first quarter, the originally reported 5% drop in GDP was unchanged. The pandemic struck in early March and tore a huge hole the economy in the final month of the quarter. Big picture: The economy is primed to expand in the third quarter, but the surge in coronavirus cases in many U.S. states has already taken some air out of the recovery. Economists polled by MarketWatch predict GDP will expand at an 18% annual pace from July to September, though estimates are likely to be ratcheted down. The path of the recovery depends heavily on whether Congress passes another massive relief package, economists say, and whether the pandemic is brought under control again. Prolonged uncertainty will only cause Americans to save more and spend less, thus hurting the economy. Read:Capitol Hill talks on next COVID-19 financial aid bill stuck in neutral What they are saying?: “The virus is the boss,” said corporate economist Robert Frick of Navy Federal Credit Union. “The longer this goes on, the deeper the damage.” Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 index SPX, +0.87% fell sharply in Thursday trades."}]}