{"article": [{"url": "https://www.marketwatch.com/story/president-trump-cheated-his-way-into-the-best-school-in-the-world-according-to-his-nieces-new-book-2020-07-07", "published": 1594138760.0, "headline": "President Trump cheated on his SAT, according to his nieceâ\u0080\u0099s new book", "body": "Cheaters never prosper? Mary Trump, according to excerpts cited in the New York Times, flipped that saying on its head in her new book by claiming her famous uncle Donald paid someone to take the SAT, which ultimately paved his way into Wharton, a university he dubbed as â\u0080\u009cthe best school in the world.â\u0080\u009d “ â\u0080\u0098Donald, who never lacked for funds, paid his buddy well.â\u0080\u0099 ” â\u0080\u0094 Mary Trump The book, â\u0080\u009cToo much and never enough: How my family created the worldâ\u0080\u0099s most dangerous man,â\u0080\u009d is a tell-all coming out next week that takes a deep dive into how President Trumpâ\u0080\u0099s dysfunctional upbringing turned him into a leader who â\u0080\u009cnow threatens the worldâ\u0080\u0099s health, economic security and social fabric,â\u0080\u009d as publisher Simon & Schuster put it. â\u0080\u009cIf he is afforded a second term, it would be the end of American democracy,â\u0080\u009d Mary Trump wrote in the memoir. â\u0080\u009cDonald, following the lead of my grandfather and with the complicity, silence and inaction of his siblings, destroyed my father. I canâ\u0080\u0099t let him destroy my country.â\u0080\u009d She explained, as the New York Times reported, that generations of greed and betrayal have led to Trumpâ\u0080\u0099s â\u0080\u009ctwisted behaviorsâ\u0080\u009d and his practicing â\u0080\u009ccheating as a way of life.â\u0080\u009d She claims that heâ\u0080\u0099s a narcissist, a sociopath, hypocritical about religion, pathological in several aspects and that he went to a movie while his brother Freddy was sent alone to die in the hospital. But it was the SAT cheating stuff that struck a chord on Twitter TWTR, -0.23% Â , with calls ringing out for the guy who took the exam to come forward and spill the beans: iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Others just enjoyed some partisan piling-on: iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } And how about a little circumspection? iframe.twitter-tweet { width: 100% !important; } Mary Trump, 55 years old and long estranged from her uncle, is the first member of the Trump clan to write a book delving into the history. The family doesnâ\u0080\u0099t like it one bit and has been trying to spike it on the grounds of a confidentiality agreement she signed nearly 20 years ago. President Trumpâ\u0080\u0099s younger brother, 72-year old Robert, issued a statement with help from the presidentâ\u0080\u0099s celebrity attorney Charles J. Harder. â\u0080\u009cHer attempt to sensationalize and mischaracterize our family relationship after all of these years for her own financial gain is both a travesty and injustice to the memory of my late brother, Fred, and our beloved parents,â\u0080\u009d he said. â\u0080\u009cI and the rest of my entire family are so proud of my wonderful brother, the president, and feel that Maryâ\u0080\u0099s actions are truly a disgrace.â\u0080\u009d The book is being published two weeks early, following a court battle over its release. The publisher has already printed 75,000 copies of the book, according to CNN. White House press secretary Kayleigh McEnany on Tuesday dismissed the book in a Q&A with reporters on the White House driveway. â\u0080\u009cItâ\u0080\u0099s ridiculous, absurd allegations that have absolute no bearing in truth,â\u0080\u009d she said. â\u0080\u009cHave yet to see the book, but it is a book of falsehoods.â\u0080\u009d Surely, the real President Trump will have plenty to say about it, but in the meantime: iframe.twitter-tweet { width: 100% !important; } â\u0080\u0094"}]}