{"article": [{"url": "https://www.marketwatch.com/story/pence-harris-clash-over-coronavirus-and-taxes-at-vice-presidential-debate-2020-10-07", "published": 1602112340.0, "headline": "Pence, Harris clash over coronavirus and taxes at vice-presidential debate", "body": "Mike Pence and Kamala Harris clashed over the Trump administration’s handling of the coronavirus pandemic and President Donald Trump’s corporate tax cuts on Wednesday, as they faced off in the sole vice-presidential debate of the 2020 campaign. Vice President Pence acknowledged that the U.S. has “gone through a very challenging time this year” while also saying that Trump has put Americans’ health first. Harris attacked such assertions, with the U.S. COVID-19 death toll topping 211,000. The senator from California charged that Americans have witnessed what she called “the greatest failure of any presidential administration in the history of our country.” Coronavirus update:U.S. death toll tops 211,000 as doctors caution that Trump is entering a key phase in his diagnosis Harris said she’d take a coronavirus vaccine if the government’s top doctors say it’s safe. “If Donald Trump tells us that we should take it, I’m not taking it,” she said. Pence asked her to “stop playing politics with people’s lives.” Despite occasional barbs, the Pence-Harris face-off was civil compared with the first debate between Trump and Biden, at which the presidential contenders frequently talked over each other and the moderator. Pence and Harris sat 12 feet apart, separated by plexiglass, while on stage at the University of Utah in Salt Lake City, in a visual reminder of how the virus has spread throughout the country, and even to the White House. See MarketWatch live blog of Pence-Harris debate. The two also sparred over the Republican tax overhaul of 2017, which sharply increased the federal deficit while lowering corporate taxes and some personal taxes and doing away with some popular deductions, with Pence charging that a Biden-Harris administration would raise Americans’ taxes. Harris countered by saying Biden wouldn’t raise taxes on anyone making less than $400,000 a year. From the MarketWatch archives (May 2018): Share-buyback boom in overdrive after tax revamp Now read:Joe Biden defines income of $400,000 as ‘wealthy,’ but here’s why it’s barely scraping by for some As they clashed over other issues including the nomination of Amy Coney Barrett to the Supreme Court, Harris and Pence also dodged questions including about the ages of their running mates. Pence did not answer a question about what he would do if Trump refused to accept defeat if he loses to Biden. And Harris would not say whether Democrats would expand the Supreme Court. U.S. stock futures YM00, +0.82% rose modestly during the debate."}]}