{"article": [{"url": "https://www.marketwatch.com/story/starbucks-says-it-lost-31-billion-in-sales-due-to-covid-19-pivots-to-more-curbside-pickups-2020-07-28", "published": 1595958080.0, "headline": "Starbucks says it lost $3.1 billion in sales due to COVID-19, pivots to more curbside pickups", "body": "Starbucks reported fiscal third-quarter results. This update also corrects FactSet expectations for the company. Shares of Starbucks Corp. SBUX, +0.53% rose 5% in the extended session Tuesday after the retailer reported a narrower loss and better-than-expected sales in its fiscal third quarter. The company estimated that it missed out on more than $3 billion in sales thanks to the pandemic's cutting down on store traffic and other impacts, and it plans to offer curbside pickups in more of its stores. Starbucks said it lost $678.4 million, or 58 cents a share, in the quarter, versus earnings of $1.37 billion, or $1.12 a share, in the year-ago period. It estimated that impact of the COVID-19 shaved off about $1.20 a share from its results, it said. Adjusted for one-time items, Starbucks lost 46 cents a share, contrasting with an adjusted profit of 78 cents a year ago. Revenue fell 38% to $4.2 billion, the company said. Analysts polled by FactSet had expected an adjusted loss of 59 cents a share on sales of $4.1 billion. Same-store sales fell 40%, Starbucks said. Due to the pandemic, Starbucks estimated it lost about $3.1 billion in sales relative to its expectations for the quarter. That included the effects of temporary store closures, modified operations, reduced hours and reduced customer traffic, it said. The company's board declared a cash dividend of 41 cents a share, payable Aug. 21 to shareholders of record as of Aug. 7. Starbucks said it plans to launch curbside pickup in several hundred existing locations in the near future and add over 50 Starbucks pickup locations in the next 12 to 18 months to meet \"evolving customer preferences that have accelerated because of COVID-19.\" Shares had ended the regular trading session down 2.4%."}]}