{"article": [{"url": "https://www.marketwatch.com/story/heres-how-much-a-reduction-in-extra-unemployment-benefits-could-slash-consumer-spending-2020-08-11", "published": 1597149800.0, "headline": "Here's how much a reduction in extra unemployment benefits could slash consumer spending", "body": "Until July 31, some 30 million jobless Americans received an extra $600 a week in unemployment benefits on top of what they would have received from their state as part of the $2 trillion CARES Act stimulus package that was passed in March. As a result, the average amount of weekly unemployment benefits Americans received fell to $257 from $812, according to a paper titled \"The Effect of Fiscal Stimulus: Evidence from COVID-19\" circulated by the National Bureau of Economic Research on Monday. If federal unemployment benefits were $200 a week, the researchers found that the replacement rate would decline by 44% and spending would fall by 28%. At $400 a week, the replacement rate would fall by 29% and spending would fall by 12%. “ If federal unemployment benefits were $200 a week, the researchers found that the replacement rate would decline by 44% and spending would fall by 28% ” Such research may be valuable to Republican and Democratic lawmakers who continue to clash over federal unemployment benefits, as well as an overarching stimulus package, said Julia Lane, a professor at the New York University Wagner Graduate School of Public Service, and an author of the study. \"They're trying to figure out what the biggest bang for the buck is in terms of creating interventions so that they can move people from one sector that's been laid off into another sector,\" she added. Republican senators proposed, as part of the recently unveiled HEALS Act, lowering the supplemental benefits to $200 a week for two months until state workforce agencies can implement weekly unemployment benefits equal to 70% of a workers' prior wage. However, Senate Majority Leader Mitch McConnell indicated last week that he would support an extension of the $600 a week if President Donald Trump backed it. Ultimately, Trump signed an executive order on Saturday that would, among other things, allocate an additional $300 in federal weekly unemployment benefits from a $44 billion fund set aside for disaster aid. But Republicans and Democrats have questioned the extent to which Trump can legally implement the executive order.Republicans and Democrats have been unable to reach an agreement Republicans and Democrats have been unable to reach an agreement on unemployment insurance as well as an overarching stimulus package. House Speaker Nancy Pelosi and Senate Minority Leader Chuck Schumer have repeatedly signaled that they are not willing to budge on the $600 weekly benefit arguing that it is essential to help keep jobless Americans afloat. The tradeoff of paying less money in unemployment benefits is that people will not be able to spend as much to support businesses. Indeed, the model the authors used to study this tradeoff predicts without the $600 supplemental benefit there will be a 44% decline in consumer spending. The authors of the study use weekly unemployment claims data on 1.2 million workers from January 25 to June 27 provided by the Illinois unemployment insurance system to calculate Illinoisans' wage replacement rates by comparing their weekly unemployment insurance benefits to their average wages in 2019. They then aggregated the weekly replacement rates at the county, industry and week level to estimate how changes of those rates will impact credit- and debit-card spending using data provided by several private companies and aggregated by Opportunity Insights, a nonpartisan research organization at Harvard University. “ Before the extra $600 expired, more than two-thirds of Americans received more in unemployment benefits than they did from their former jobs. ” While the Bureau of Labor Statistics' monthly unemployment report gives lawmakers a general sense of how the U.S. economy is performing, it leaves several important questions unanswered, Lane, who is a professor at New York University's Wagner Graduate School of Public Service, said. The BLS arrives at the monthly unemployment rate by gauging whether jobless Americans' are \"actively looking for work\". \"But lots of people who are on furlough are not actively looking for work, because there aren't any jobs,\" Lane told MarketWatch. \"What we've shown here is you could take the underlying weekly unemployment claims data and you can figure out the implications on spending.\" While the paper Lane co-authored is limited to Illinois, the framework the authors laid out can be used to make similar assessments \"for every county in every state if they harvest this data properly.\" Before the extra $600 expired, more than two-thirds of Americans received more in unemployment benefits than they did from their former jobs, also known as the replacement rate. Since it expired, it's arguably less attractive to remain unemployed when you can earn more from working. In the meantime, Trump called on states to pay out an extra $100 a week on top of the $300. But many lawmakers, including New York's Gov. Andrew Cuomo, a Democrat, said that states cannot afford to do so. iframe.twitter-tweet { width: 100% !important; } At the same time, the coronavirus-induced recession has pushed the unemployment rate to 10.2%, according to the latest job's report. Although 9.3 million jobs that were lost amid the pandemic have been recovered, 12.9 million jobs have not, suggesting that there likely is not a job available for every unemployed American to fill. House Majority Leader Steny Hoyer said however that he is willing to compromise on the $600 benefit. \"It's not $600 or bust,\" he said in a CNN interview two weeks ago. He also said that the Republicans' argument that the extra $600 discourages people from working \"has some validity to it, and we ought to deal with that.\" Related: After Trump's actions on unemployment aid, Mnuchin and Senate leaders can only talk about a lack of relief talks"}]}