{"article": [{"url": "https://www.marketwatch.com/story/rampant-speculation-in-the-stock-market-you-aint-seen-nothing-yet-thank-the-federal-reserve-2020-06-11", "published": 1592041160.0, "headline": "Rampant speculation in the stock market - you ain't seen nothing yet. Thank the Federal Reserve", "body": "Investors' goal is to make money consistently in all market conditions - amid rampant speculation, a good or bad economy, a pandemic, varied Federal Reserve policies. It's time for investors who have made money in the stock market over the past decade to say thank you to the Fed. Now comes the hard part. At Wednesday's press conference, Fed Chairman Jerome Powell was adamant in that, irrespective of bubbles in the stock market or good economic data, the Fed is set on a course to print money and keep interest rates at zero through 2022. Here is the most striking statement: \"We're not thinking about raising rates. We're not even thinking about thinking about raising rates.\" Notice the double emphasis on \"thinking about.\" It's a big milestone. Finally the tutoring of the Fed, supposedly an independent body, by politicians is complete - it's all about \"not thinking\" - not thinking about how to ultimately unwind the massive balance sheet the Fed is building and the massive national debt that politicians are happy to undertake. What does it mean for stock market investors? In theory, it will lead to rampant stock market speculation in the short term and a massive crash down the road. In the very short term, the stock market is very overbought, and overbought markets tend to be vulnerable to the downside. Further, we have been sharing with you that proprietary sentiment indicators at The Arora Report have been in the extreme zone. Sentiment is a contrary indicator at extremes. In plain English, this means that when sentiment is extremely bullish, it's a sell signal. Let's explore this idea further with the help of a chart.Chart Please click here for an annotated chart of the Dow Jones Industrial Average ETF DIA, +0.57%, which tracks the Dow Jones Industrial Average DJIA, +0.56%. Note the following: â\u0080¢ First and foremost, everything that affects the markets, including macro-economic data, fundamentals, sentiment, risk appetite, short squeezes as well as monetary and fiscal policies, are reflected in the charts. It takes years of observation, hard work and dedication to learn to correctly read charts. The naysayers simply have not spent the time and effort needed to benefit from charts. â\u0080¢ Start from the left-hand side of the chart. The chart shows that in 2007, before the 2008 Great Recession, the Federal Reserve balance sheet was $0.87 trillion. â\u0080¢ The chart shows that in March 2009, an aggressive buy signal was given by The Arora Report, which turned out to be the start of the great bull market. The Fed balance sheet was $2.08 trillion. â\u0080¢ The chart shows that, by 2012, the Fed balance sheet had ballooned to $2.8 trillion. â\u0080¢ The chart shows that, by 2018, the Fed balance sheet had exploded to $4.4 trillion. â\u0080¢ Don't let fancy words about the increase in the Fed's balance sheet confuse you. It is just a fancy description among the elite for money printing. â\u0080¢ The chart shows the rise in the stock market coincided with more money printing by the Fed. As the Fed printed more money, it went into assets such as stocks, bonds and real estate. Those with capital got richer. Working-class people who were depending on their labor and not on capital got relatively poorer - therein lies the root of income inequality in our society. â\u0080¢ In 2018, after years of money printing, the Fed came to its senses. Apparently somebody told the Fed that there was no free lunch. So the Fed embarked on reducing its balance sheet. â\u0080¢ The chart shows that the Fed's balance sheet was reduced to $3.77 trillion - only a marginal reduction of the money that was printed. â\u0080¢ The chart shows that the stock market threw a big tantrum. In December 2018, as shown on the chart, the stock market quickly fell about 20%. â\u0080¢ The drop in the stock market - mind you, still greatly elevated from the lows in 2009 - apparently scared the Fed and politicians. They decided it was better in the short term for them to let the tail wag the dog. The tail being the stock market and the dog being the future of the U.S. â\u0080¢ The Fed made an about-face. The stock market took off again. â\u0080¢ The chart shows that, in October 2019, the Fed added a small amount of additional liquidity and the stock market took off to new heights. â\u0080¢ The chart shows that Fed money printing has reached $7.17 trillion on the way to $10 trillion. This is on top of the national debt of $26 trillion. Who's counting? The party is in full swing. The rich are getting richer and plenty of lip service is being given to the working class. Rampant speculation You had to have lived under a rock not to have noticed the rampant speculation in the stock market over the past couple of months. Perhaps the money flowing in the big five tech stocks Apple AAPL, +1.74%, Microsoft MSFT, +2.48%, Amazon AMZN, +3.01%, Alphabet GOOG, +1.97%  GOOGL, +1.82% and Facebook FB, +0.26% can be justified but how about the money flowing in bankrupt companies Hertz HTZ, -1.78%, J.C. Penney JCP, -2.53%, Whiting Petroleum WLL, -2.19% ; and in travel companies such as American Airlines AAL, +0.34%, United Airlines UAL, +0.32%, Carnival Cruise CCL, +0.51% and Royal Caribbean RCL, +2.59%. As virus cases were rising in many states, the stock market's answer was to buy airlines and cruise lines. This is how rampant speculation looks. You have seen nothing yet. Thank you, Federal Reserve. Your questions regarding the crash need to be answered. They will be answered in future columns. For the time being, the most important message is worth repeating: Investors' job is to make money consistently from all market conditions. Disclosure: Arora Report portfolios have positions in Apple, Amazon, Alphabet, Microsoft, Facebook and Hertz. The Arora Report may take positions in other securities opportunistically anytime. Nigam Arora is the founder of The Arora Report, which publishes four newsletters. He can be reached at Nigam@TheAroraReport.com."}]}