{"article": [{"url": "https://www.marketwatch.com/story/not-all-401k-investors-are-as-optimistic-about-their-accounts-as-president-trump-2020-10-05", "published": 1601978900.0, "headline": "Not all 401(k) investors are as optimistic about their retirement accounts as President Trump", "body": "President Trump — on Twitter — listed some reasons why Americans should vote for him on Monday morning; one being their 401(k) plans. The president often touts how well the economy is doing under his administration, including a stock market recovery in the six months following a pandemic-fueled economic shutdown and sharp market decline. During the presidential debate against Democratic nominee Joe Biden last week, Trump said when the stock market does well, jobs and 401(k) balances benefit. On Monday, he also tweeted quotes from individuals who said their retirement accounts have risen dramatically while he was president. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } But not all Twitter users agreed about the status of their 401(k) plans. While some investors have seen their balances grow in recent months, that hasn’t been a universal experience. Some said their balances have suffered recently and others said they had to borrow from their retirement accounts to pay their bills in the middle of the crisis. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Critics also argued not all workers have access to employer-sponsored retirement accounts. Only a third of Americans were invested in a 401(k) plan in 2017, according to U.S. Census Bureau data. Even when workers do have access to a plan through their employer, not all can participate — or contribute enough — citing other financial obligations. Companies suffering from the effects of the pandemic may also have to change what they offer their workers. Some businesses, for example, have had to suspend their 401(k) matches in recent months. How well a 401(k) balance does depends largely on what is invested within that portfolio. An account that is invested heavily in funds that are tied to a stock market index, such as the S&P 500 SPX, will react in line with how that index is doing. A portfolio that is well diversified among various asset classes may be impacted by market volatility, but perhaps not as much as one that is mostly in equities. These accounts are also most beneficial to higher-income workers, and how well they fared because of the stock market also depends on if an individual has been able to maintain a job during the pandemic, said Alicia Munnell, director of the Center for Retirement Research at Boston College. Upticks of the stock market do benefit 401(k) account balances, but only if someone is not relying on that money and can continue to contribute to it. “If you retain [a job] you should be fine, but if you lose a job, that puts pressure on 401(k) balances, if they have to turn to them,” she said. Young employees or those who don’t expect to retire for a few decades are typically advised to stick with a portfolio heavily invested in equities, which is why they may have seen balances rise and fall dramatically in the last few months. Someone who is anticipating retirement sooner is generally advised to have more conservative investments in their portfolios, to protect against market volatility. Still, some Twitter users said they have seen their 401(k) plans doing well under the Trump administration. iframe.twitter-tweet { width: 100% !important; } Many Americans weren’t expecting a crisis, and they weren’t financially prepared for one either. One in four people expect to retire later than expected because of the pandemic, according to a joint report from personal finance app Stash and lender LendingTree, while another 70% said there has been no change to their plans. Fidelity Investments, which tracks its investors’ workplace and individual retirement accounts, said balances of defined contribution accounts — such as 401(k) plans — have stayed relatively consistent in recent years. Defined-contribution plans had an average balance of $104,400 in the second quarter of 2020, a 14% rebound from the previous quarter. Most employers adopted the CARES Act provision that increased the allowable 401(k) loan from $50,000 to $100,000, but even then, loan usage was down during the second quarter of 2020, according to Fidelity. Other 401(k) providers have seen similar trends. Principal Financial said 401(k) loans have been down more than 50% from the beginning of 2020 to Aug. 31, compared with the same period in 2019. About 3.4% of participants originated a loan during this time, compared with 7.6% in 2019. Another 3.5% of participants took advantage of the CARES Act provision for coronavirus-related distributions, with an average withdrawal of $13,200. Another 0.7% of participants took a hardship withdrawal, down from 1% in 2019. In the LendingTree survey of nearly 5,000 Americans, those who made less than $35,000 a year expected to delay their retirements, compared with 17% of people who earn more than $100,000. Almost a third of Latino consumers and 28% of Black consumers said they’ll also hold off on retirement, versus 23% of white consumers. Members of Generation X, who are between 44 and 55 years old, said they would likely push off retirement, compared with millennials and their younger cohorts, Generation Z, of whom 21% and 24% said they would retire later, respectively."}]}