{"article": [{"url": "https://www.marketwatch.com/story/grocers-lead-ftse-down-following-disappointing-profits-from-morrisons-11599737342", "published": 1599723440.0, "headline": "Grocers lead FTSE down, following disappointing profits from Morrisons", "body": "The hit to Morrisons' profits came from what it said were £155 million in costs related to responding to the pandemic. Justin Tallis/Agence France-Presse/Getty Images Poor profit performance from Wm Morrison due to the high costs of responding to the pandemic rippled through other grocers, and led the FTSE 100 down in morning trading in London. Morrisons MRW, +1.52% stock fell as much as 5%, as the grocery chain reported a 25% fall in adjusted pretax profit due to high costs, while second-quarter sales rose 12%. The hit to Morrisons’ profits came from what it said were £155 million in costs related to responding to the pandemic, including hiring additional staff, though costs were offset by £93 million in lower business rates. Despite disappointing profit results, some analysts are optimistic about the supermarket’s position moving forward. “Looking at Morrisons outside the scope of the immediate disruption, its operational flexibility and savvy partnerships leave it in good stead,” said Thomas Brereton, an analyst at GlobalData. Last month, Amazon AMZN, +3.01% made Morrisons’ offerings available through its main site, with Amazon Prime members receiving free same-day delivery on orders over £40 ($53) and at a cost of £3.99 for orders under that amount. Orders are picked by Morrisons staff and delivered by Amazon. “As the supermarkets gear up for what is expected to be an exceptionally challenging Christmas period (with at least one wary eye on the growing number of new U.K. cases), Morrisons appears to have all of its bases covered,” Brereton said. Grocers Sainsbury’s SBRY, +1.80%, Tesco TSCO, +1.80%, and Ocado OCDO, -3.17% followed Morrisons down. The FTSE 100 UKX, +0.64%, the index of London’s top 100 stocks by market capitalization, was filled with more losers than gainers in Thursday morning trading, down near 0.5% with 70 of its constituent companies falling. IAG IAG, -3.44%, the owner of British Airways, fell 2% in morning trading after starting the day buoyed by the news that it had raised £2.46 billion ($3.2 billion) in new capital after the issuance of fresh shares. Oil price woes made their way into London markets, with BP BP, +0.56% and Royal Dutch Shell RDSA, +2.08% both falling. BP said it would launch its first offshore wind-power venture by taking a 50% stake in two of Equinor’s 0M2Z, +1.79% wind assets off the East Coast of the U.S. for $1.1 billion. The pound GBPUSD, +0.83% was trading strong against the dollar, up 0.18, and edging slightly down against the euro ahead of a much-awaited European Central Bank decision. A winner on the London Stock Exchange was Games Workshop GAW, +1.06%, a maker of tabletop games, which saw its stock price jump 12% after it announced that it expected quarterly sales to come in at £90 million, firmly ahead of analyst expectations of £78 million."}]}