{"article": [{"url": "https://www.marketwatch.com/story/is-it-safe-to-go-back-to-the-gym-if-youre-over-50-2020-06-29", "published": 1593425660.0, "headline": "Is it safe to go back to the gym if you're over 50?", "body": "This article is reprinted by permission from NextAvenue.org. I miss my gym. It's been three months, three weeks and two days since I took my last interval training class - not that I'm counting. And I'm a little dubious about going back. I'm 59, in fairly good shape and a longtime member of the Good Samaritan Hospital's Wellness Center in suburban Chicago. Before COVID-19 forced the facility to temporarily close in mid-March, I worked out there four or five times a week. I took yoga, Tabata (high-intensity interval training) and other interval training classes. But since then, my fitness regimen has been reduced to walks around my neighborhood and an occasional online strength class.Anxiety about returning to the gym So, imagine my joy when Illinois announced gyms in my region could reopen in early July. Finally! But my excitement has been tempered with a dose of anxiety. Is it really wise to go back to the gym when you're over 50 and the coronavirus is still infecting thousands of Americans? Are the rewards of working out at the gym worth the risk of catching the virus? You might like: For older workers, there are risks if they return to the office-and if they don't I asked some experts and found that the answers really depend on the facility, the activity and the person (not the person's age). Most gyms and health clubs in the U.S. are reopening with more rigorous cleaning and disinfecting protocols than before the pandemic. They're also limiting access to locker rooms, saunas and snack bars. Some gyms, like mine, are doing temperature screens when members walk in and barring anyone from entering with a temperature of 100.4 degrees or higher. Although most gyms seem to be requiring employees to wear masks, many aren't asking members to do the same since some people might find wearing one while working up a sweat uncomfortable. The Centers for Disease Control and Prevention (CDC), however, recommends wearing masks to slow the spread of the coronavirus by reducing exposure to saliva and other respiratory secretions. \"The more people you put into a room and the tighter the room is without a mask, the more dangerous the situation becomes,\" says Dr. William Rhoades, the hospital's chief medical director for my wellness center. It's essential to wear one when you are out in public and around others. So, if you will be going back to a gym, wear a mask. If that will make you uncomfortable, don't go.Keep your distance Like every public facility, the ability to maintain a social distance of at least six feet is now crucial at health clubs and gyms. The larger the facility, the easier it will be to do that. Ventilation is just as important. Dr. Preeti Malani, an infectious disease expert at the University of Michigan, says proper airflow dilutes virus particles and prevents it from spreading. \"If they've got windows that they can open up or offer classes outside, that can really improve safety,\" says Malani. Don't miss: Read this before scheduling that elective surgery in the near future Iron Flagg Fitness in Westmont, Ill. was able to reopen earlier than some competitors because it has large garage doors that provide good cross-ventilation when open. That encouraged Bea Farmer, 55, to resume CrossFit there in early June. \"Having an open-air facility really helps, so I feel safe,\" says Farmer.Some activities are now safer than others Some fitness activities are safer than others in the pandemic. Malani says swimming laps is relatively safe because the chlorine in pool water inactivates the virus. Walking or running on a track should be safe, too, as long as you maintain a distance of at least six to 10 feet from others. The same is true for using treadmills and elliptical trainers - proper spacing is key. The risk of an infection increases, though, for group classes like aerobics, spin and yoga that are often held in smaller studios. People tend to breathe hard in those classes, emitting aerosolized particles. See: 'Shameful, not cool, a sign of weakness': Men are less likely to wear face masks to protect against coronavirus, study finds Malani says someone in one of those classes who gets infected with the virus could spread it to others there, even with social distancing. \"Gyms are trying to figure out how to do those group classes,\" says Malani. \"Just because they're doing them, doesn't mean that you should go to them.\" This is a big concern for me because the group classes I take at the Wellness Center are held in smaller studios with little air flow. Its Operations Vice President Michael Combes tried to allay my concerns. \"One of the things we've discussed is group exercise classes on the basketball court, because we won't be having basketball. It's a more open space.\"It's about your health more than your age Older adults also need to consider any underlying health conditions before heading back to the gym. The virus has been particularly dangerous to people who are obese or suffer from hypertension, diabetes or respiratory disease. Rhoades, a gerontologist, and Dr. Rajwinder Deu, an orthopedic surgeon specializing in sports-related injuries at Johns Hopkins University, say whether to return to the gym is not so much about age, but more about your own health and fitness. Of course, not working out also carries health risks. I have lost some muscle tone, flexibility and cardio endurance during my hiatus. Also on MarketWatch: 24 Hour Fitness declares bankruptcy, expects to reopen most gyms by end of June Deu says it's especially important for older athletes to maintain muscle strength through resistance training. He notes that this can be accomplished at home with resistance bands. \"Bands are great. They take up no space. You can tie them to anything,\" says Deu.Missing my gym friends Still, I miss working out with other people and socializing with the regulars in my classes. I'm more motivated in a group, too. But I wonder: as part of a demographic that's been affected more by the virus than others, do I risk being stigmatized by younger members at the gym? That's a question I asked Bea and Jim Farmer. As they wrapped up their gym class at Iron Flagg Fitness, a group of 20-something athletes took the floor for another session. The Farmers said they haven't felt shunned or stigmatized since returning to the gym. \"Everybody has been welcoming,\" says Jim, 58. \"It's a community. They all encourage me.\" I'm still deciding if I'll return to my gym in early July. Before I make a decision, I plan to stop by and walk around the facility wearing a mask. I want to be sure I'll feel safe getting back in shape. Diane Eastabrook is a Chicago-based journalist. She has reported for Al Jazeera and the PBS Nightly Business Report. This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}