{"article": [{"url": "https://www.marketwatch.com/story/trump-extends-unemployment-benefits-defers-payroll-tax-2020-08-08", "published": 1596925640.0, "headline": "Trump extends unemployment benefits, defers payroll tax", "body": "Seizing the power of his podium and his pen, President Donald Trump on Saturday bypassed the nation’s lawmakers as he claimed the authority to defer payroll taxes and replace an expired unemployment benefit with a lower amount after negotiations with Congress on a new coronavirus rescue package collapsed. At his private country club in Bedminster, New Jersey, Trump signed executive orders to act where Congress hasn’t. Not only has the pandemic undermined the economy and upended American lives, it has imperiled the president’s November reelection. Perhaps most crucially, Trump moved to continue paying a supplemental federal unemployment benefit for millions of Americans out of work during the outbreak. However, his order called for up to $400 payments, one-third less than the $600 people had been receiving. Congress allowed those higher payments to lapse on Aug. 1, and negotiations to extend them have been mired in partisan gridlock, with the White House and Democrats miles apart. Trump largely stayed on the sidelines during the administration’s negotiations with congressional leaders, leaving the talks on his side to chief of staff Mark Meadows and Treasury Secretary Steve Mnuchin. Trump’s embrace of executive actions to sidestep Congress runs in sharp contrast to his criticism of former President Barack Obama’s use of executive orders on a more limited basis. And the president’s step-back from talks with Congress breaks with his self-assured negotiating skills. Now, Trump, who has not spoken with Democratic House Speaker Nancy Pelosi since last year, sought to play the role of election-year savior, with the $400 weekly assistance, as well as a deferral of payroll tax and federal student loan payments and the continuation of a freeze on some evictions during the crisis. “It’s $400 a week, and we’re doing it without the Democrats,” Trump said, asking states to cover 25% of the cost. Trump is seeking to set aside $44 billion in previously approved disaster aid to help states maintain supplemental pandemic jobless benefits, but Trump said it would be up to states to determine how much, if any of it, to fund, so the benefits could be smaller still. Many states have been facing budget shortfalls due to the coronavirus pandemic and would have difficulty assuming the new obligation. The previous unemployment benefit was fully funded by Washington. The president said at his club on Friday night that “if Democrats continue to hold this critical relief hostage I will act under my authority as president to get Americans the relief they need.” Democrats had said they would lower their spending demands from $3.4 trillion to $2 trillion but said the White House needed to increase their offer. Republicans have proposed a $1 trillion plan. White House aides have watched the talks break down with apprehension, fearful that failure to close a deal could further damage an economic recovery already showing signs of slowing down. Friday’s July employment report showed jobs were added back but at a slower rate than in the past two months, in part because a resurgence of the virus has led to states rolling back their reopenings. The president’s team believes the economy needs to stabilize and show signs of growth for him to have any chance at winning reelection. Aides were hoping to frame the expected executive orders signings as a sign that Trump was taking action in a time of crisis. But it also would reinforce the view that the president, who took office declaring he was a dealmaker, was unable to steer the process to an agreement. See also: Trump’s stimulus orders don’t seem to be feasible or legal, experts say Trump said Saturday the orders “will take care of pretty much this entire situation, as we know it.” But they are far smaller in scope than congressional legislation, and even aides acknowledged they didn’t meet the needs of all that was required. “This is not a perfect answer — we’ll be the first ones to say that,” Meadows said Friday as talks broke down. “But it is all that we can do and all the president can do within the confines of his executive power, and we’re going to encourage him to do it.” Trump said the employee portion of the payroll tax would be deferred from Aug. 1 through the end of the year. The move would not directly aid unemployed workers, who do not pay the tax when they are jobless, and employees will need to repay the federal government eventually without an act of Congress, where there is bipartisan opposition on Capitol Hill. In essence, the deferral is an interest-free loan that would have to be repaid. Trump said he’ll try to get lawmakers to extend it, and the timing would line up with a post-election lame-duck session in which Congress will try to pass government funding bills. “If I win, I may extend and terminate,” Trump said, repeating a longtime goal but remaining silent on how he’d fund the Medicare and Social Security benefits that the 7% tax on employee income covers. Employers also pay 7.65% of their payrolls into the funds. “This fake tax cut would also be a big shock to workers who thought they were getting a tax cut when it was only a delay,” said Democratic Sen. Ron Wyden of Oregon. “These workers would be hit with much bigger payments down the road.” Both the House and Senate have left Washington, with members sent home on instructions to be ready to return for a vote on an agreement. With no deal in sight, their absence raised the possibility of a prolonged stalemate that stretches well into August and even September. Often an impasse in Washington is of little consequence for the public — but not so this time. It would mean more hardship for millions of people who are losing enhanced jobless benefits and further damage for an economy pummeled by the still-raging coronavirus. Friday’s negotiations at the Capitol added up to only “a disappointing meeting,” said Senate Democratic leader Chuck Schumer of New York. He said the White House had rejected an offer by Pelosi, D-Calif., to curb Democratic demands by about $1 trillion. Schumer urged the White House to “negotiate with Democrats and meet us in the middle. Don’t say it’s your way or no way.” That Capitol Hill session followed a combative meeting Thursday evening that for the first time cast real doubt on the ability of the Trump administration and Democrats to come together on a fifth COVID-19 response bill. Pelosi declared the talks all but dead until Meadows and Mnuchin give ground. The breakdown in the negotiations is particularly distressing for schools, which have been counting on billions of dollars from Washington to help with the costs of reopening. But other priorities are also languishing, including a fresh round of $1,200 direct payments to most people, a cash infusion for the struggling Postal Service and money to help states hold elections in November. Mnuchin said renewal of a $600-per-week pandemic jobless boost and huge demands by Democrats for aid to state and local governments are the key areas where they are stuck. Democrats have offered to reduce her almost $1 trillion demand for state and local governments considerably, but some of Pelosi’s proposed cost savings would accrue chiefly because she would shorten the timeframe for benefits like food stamps. Pelosi and Schumer continue to insist on a huge aid package to address a surge in cases and deaths, double-digit joblessness and the threat of poverty for millions of the newly unemployed. Senate Republicans have been split, with roughly half of Majority Leader Mitch McConnell’s rank and file opposed to another rescue bill at all. Four prior coronavirus response bills totaling almost $3 trillion have won approval on bipartisan votes despite intense wrangling, but conservatives have recoiled at the prospect of another Pelosi-brokered agreement with a whopping deficit-financed cost. McConnell has kept his distance from the negotiations while coordinating with Mnuchin and Meadows. ___"}]}