{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-struggle-for-direction-on-friday-as-china-us-tensions-flare-up-2020-07-24", "published": 1595604380.0, "headline": "Oil ends modestly higher, supported by signs of economic recovery, even as China-U.S. tensions flare up", "body": "Oil futures ended with a modest gain on Friday, with U.S. prices up more than 1% for the week, as investors weigh some signs of economic improvement against tensions between the world’s biggest economic superpowers, both of which may influence global energy demand. “The heightened trade tensions between the U.S. and China has failed to have a big impact on the energy market,” said David Madden, market analyst at CMC Markets UK. “China is the largest importer of oil in the world, so should any economic disruption come from the political spat, we could see oil slide.” Still, it is “worth noting that oil hit a four month high during the week, so the wider trend is still positive,” he said in a market update. Traders also continued to eye the impact of rising cases of COVID-19 in parts of the world, which could lead to business disruptions and a slowdown in economic recovery. “New COVID cases and the growing cold war between the U.S. and China” put some pressure on oil, said Phil Flynn, senior market analyst at The Price Futures Group. However, it seems that parts of global economy are recovering, “as economic data is blowing out to the upside.” Oil traders said that economic data out of Europe helped to inject some optimism in markets about oil demand. The eurozone manufacturing PMI rose to 51.1 from 47.4 in June, and the services PMI rose to 55.1 from 48.3 in June, as the composite PMI of 54.8, a 25-month high In China, “refinery runs in July most likely hit record highs as companies lift average run rates to 84% of capacity,” said Flynn. S&P Global Platts reported that crude throughput at China’s domestic refineries rose 9% year on year to hit an all-time high of 14.14 million barrels per day in June, citing data from the General Administration of Customs. West Texas Intermediate crude for September delivery CL.1, -1.62% US:CLU20 on the New York Mercantile Exchange tacked on 22 cents, or 0.5%, to settle at $41.29 a barrel, after declining 2% on Thursday. September Brent crude BRN.1, -0.07% UK:BRNU20 inched up by 3 cents, or 0.07%, to $43.34 a barrel on ICE Futures Europe, following a 2.2% skid in the previous session. For the week, front-month WTI futures saw a 1.3% weekly gain, and Brent rose 0.5%, according to Dow Jones Market Data. Overnight China ordered the closure of a U.S. consulate in Chengdu, in apparent retaliation for the U.S. ordering the closure of a Chinese consulate in Houston earlier this week, highlighting elevated tensions between Beijing and Washington, among the biggest consumers of crude and its byproducts. President Donald Trump also added to a sense of iciness forming between the nations when he said late Thursday that the trade pact forged between the two countries last year and signed earlier this year “means much less” to him than it did before. The U.S. has accused China of mishandling the COVID-19 outbreak, which was first identified in Wuhan, China in December. U.S. Secretary of State Mike Pompeo on Thursday also called on governments around the world to join the U.S. in confronting China’s Communist Party leaders, saying in a fiery election-year speech that engagement with Beijing has failed. “Smooth international trade relations are needed for oil demand to remain uninterrupted on the long term and tensions between the U.S. and China are never a good sign,” wrote Bjornar Tonhaugen, head of oil markets at Rystad Energy, in a daily note. “Closing consulates is a clear escalation and how this relationship develops is something to keep an eye on,” he said. Meanwhile, data from Baker Hughes BKR, -1.34% showed that the number of active U.S. rigs drilling for oil edged up by 1 to 181 this week. That marked the first increase since the week ended March 13, implying a possible uptick in production is on tap. Traders also eyed storms forming in the U.S. Gulf Coast that could buoy crude prices because they may create supply disruptions in the oil-rich region. Tropical Storm Hanna formed late Thursday in the Gulf of Mexico, was at about 230 miles from Corpus Christi, Texas Friday afternoon, according to the National Hurricane Center. Hanna, as well as Tropical Storm Gonzalo, and a storm expected to be named later, “will no doubt mess up oil imports and exports in the coming weeks,” said Flynn. On Nymex, August natural gas US:NGQ20 settled at $1.808 per million British thermal units, up 1.3%. The contract ended about 5.2% higher for the week. Among the petroleum products, August gasoline US:RBQ20 rose 2.1% to $1.2848 a gallon, ending the week 4.9% higher, while August heating oil US:HOQ20 added 0.2% to $1.2563 a gallon, for a nearly 3.1% weekly rise."}]}