{"article": [{"url": "https://www.marketwatch.com/story/protect-the-economy-or-the-population-the-coronavirus-dilemma-facing-governments-as-protests-escalate-2020-09-30", "published": 1601562500.0, "headline": "Lockdown fatigue and rising protests against new coronavirus restrictions are becoming tougher for governments to manage", "body": "Governments trying to contain the resurgence of the coronavirus pandemic are facing increased political opposition to the measures they think are necessary to control an alarming new wave, with the number of new infections nearing all-time-highs in many countries. - In France, one of Europe’s countries worst affected by the new spike, the local lockdowns decided by the government are criticized by local authorities. In Marseille, the newly-elected mayor indicated the local police wouldn’t slap fines on restaurants that remain open in violation of a recent government decree. Meanwhile, the government is expected to announce the same, most severe level of alert and restrictions for Paris in the coming days. - In London, where police clashed with protesters over the weekend, U.K. Prime Minister Boris Johnson barely avoided a major crisis on Wednesday with the members of Parliament from his own Conservative Party. But he was warned by Speaker of the House of Commons Lindsay Hoyle that he should stop treating the legislative branch “with contempt,” and start consulting MPs before enacting stringent restrictions. “Some explanations why important measures have come into effect before they can be laid before this House have been unconvincing and show a total disregard for the House,” Hoyle said in statement. - In Spain, the center-left central government and the conservative head of the Madrid region are engaged in a mutual blame game over the measures enacted in the Spanish capital, which the government deems insufficient to curb the rising number of infections. Read: Spanish government orders a heavily infected Madrid to shut down The outlook: Lockdown fatigue is spreading across Europe, and governments find it harder and harder to build even a modicum of consensus on the measures they are taking. The coronavirus dilemma — protect the economy, or protect the population — is becoming tougher to manage, as the economic recovery threatens to peter out throughout Europe. The protests now don’t only come from fringe far-right movements, as they did earlier this year during the first phase of the virus. But as people seem to gradually lose trust in their governments’ handling of the virus, official decisions, laws and regulations are now systematically contested, whether on health or economic grounds. And the counterfactual — what would happen to the economy if nothing was done now — is by definition more difficult to argue. Read:Boris Johnson rails against calls to let the virus ‘take its course,’ warning the U.K. is at a ‘critical moment’"}]}