{"article": [{"url": "https://www.marketwatch.com/story/how-the-22-trillion-cares-act-helps-americans-save-money-on-their-2019-taxes-2020-05-28", "published": 1594892780.0, "headline": "Wednesday was Tax Day, but thereâ\u0080\u0099s still time to save money on your 2019 taxes", "body": "Itâ\u0080\u0099s been three extra months in the making, but this yearâ\u0080\u0099s deadline Wednesday to file federal income taxes is approaching fast. The good news is thereâ\u0080\u0099s still time to make some quick moves to shrink your tax bill. When the Trump administration pushed this yearâ\u0080\u0099s income-tax deadline from April 15 to July 15, it intended to give taxpayers some peace of mind and extra cash flow amid the coronavirus outbreak. That extra time also gives people a chance to reduce their tax bill â\u0080\u0094 so long as they feel they have solid financial footing at this precarious moment, experts say. Taxpayers need to submit their 2019 tax returns or file for an extension by Wednesday July 15. People must pay their 2019 tax bill by then, or arrange an installment plan with the Internal Revenue Service. “ People can reduce their 2019 tax liability by contributing to their individual retirement account (IRA). ” As of early-July, the IRS had received 2.9 million fewer returns than it had at the same point the year before, a 2% drop year-over-year. The window is closing, but taxpayers can use the dwindling extra time to their advantage, explained Barbara Weltman, author of â\u0080\u009cJ.K. Lasserâ\u0080\u0099s Your Income Tax 2020,â\u0080\u009d and take advantage of some provisions under the governmentâ\u0080\u0099s $2.2 trillion CARES Act designed to help Americans during the coronavirus pandemic. People can reduce their 2019 tax liability by contributing to their individual retirement account (IRA). The maximum contribution amount is $6,000, or $7,000 for those 50 and above. IRA contributions are deductible going in, but the money is taxed at withdrawal. Donâ\u0080\u0099t miss:Opinion: Your 401(k) wonâ\u0080\u0099t be enough for retirement Someone in the 22% tax bracket, which applies this tax season to individuals making between $39,476 and $84,200 per year, and married couples filing jointly that make between $78,951 and $168,400 per year, who is contributing $1,000 would save themselves $220 in taxes, Weltman said. â\u0080\u009cIf you do have the cash, itâ\u0080\u0099s always good to continue to save for retirement,â\u0080\u009d she added. Luke Sotir, an adviser with Equitable Advisors, said if people are going to put money towards their nest egg, they should consider how the coronavirus might impact their income during the next tax season too. â\u0080\u009cIf you feel that you will be in a higher marginal tax bracket now, and lower bracket in retirement, you should prefer traditional contributions,â\u0080\u009d he said. “ People can also shrink their tax bill by contributing to their Health Savings Account (HSAs). ” That means a person should take the tax deduction now at the higher marginal tax rates instead of opting for the tax-free future withdrawal with a Roth IRA, Sotir added. People can also shrink their tax bill by contributing to their Health Savings Account (HSAs), Weltman said. These tax-advantaged accounts are paired with a high-deductible health plan. A â\u0080\u009chigh deductible,â\u0080\u009d in the eyes of the IRS, kicks in at $1,350 for an individual and $2,700 for a family. When it comes to HSA contributions, Weltman said the money goes in tax deductible, it grows tax deferred and itâ\u0080\u0099s tax-free when used for qualified expenses. The money sent to an IRA and an HSA are both â\u0080\u009cabove the lineâ\u0080\u009d deductions, so filers can take the deduction on top of either their standard deduction ($12,200 for a single filer and $24,400 for a married couple) or their itemized deduction. See also:Taking cash out of your IRA under the CARES Act is more complicated than it soundsHow coronavirus-related bills relate to your taxes The $2.2 trillion stimulus bill, known as the Coronavirus Aid, Relief, and Economic Security (CARES) Act, contains some tax breaks that can apply retroactively to this yearâ\u0080\u0099s return. For example, the law suspended the excess business-loss disallowance rule for 2018 through 2020. Before the CARES act, individuals and other non-corporate taxpayers couldnâ\u0080\u0099t deduct business losses above $250,000 or $500,000 for a married couple filing jointly. “ The CARES Act suspended the excess business-loss disallowance rule for 2018 through 2020. ” The stimulus bill also lets taxpayers withdraw up to $100,000 from their IRA and pay it back to their account in three years without a consequence on their income taxes. But the interim tax consequences can get complicated, as MarketWatch tax columnist Bill Bischoff points out. Thereâ\u0080\u0099s actually very few tax breaks for many average individual filers in the coronavirus-related bills, according to attorney Lisa Petkun, an attorney at Pepper Hamilton, which is headquartered in Philadelphia. Those provisions apply during next yearâ\u0080\u0099s tax season, she noted. One small break for individual filers is a $300 â\u0080\u009cabove the line deductionâ\u0080\u009d for charitable contributions. Though filers typically can only write off donations if they itemize, this CARES Act provision lets them write off the donation without itemizing. The write-off applies for next tax season, however. Nevertheless, Petkun wondered if the IRS would be more lenient about enforcing penalties for people who cannot pay their taxes this year. To avoid penalties, the IRS says filers need to show a â\u0080\u009creasonable causeâ\u0080\u009d about why they cannot meet their tax obligations. “ Another CARES Act provision lets people write off a $300 charitable donation without itemizing. ” Between the IRSâ\u0080\u0099s role sending out millions of stimulus checks and issuing guidance on coronavirus-related tax matters, the agency â\u0080\u009creally has its hands full,â\u0080\u009d Petkun said. â\u0080\u009cThereâ\u0080\u0099s not a whole lot of wiggle room under the law, but still, there is discretion,â\u0080\u009d she said. The IRS did not immediately respond to a request for comment. Self-employed workers and sole proprietors will start seeing the tax effects from the CARES Act, Weltman noted. Those who are their own boss need to pay both the employer side and employee side of payroll taxes. This includes the 6.2% tax that the employer and the 6.2% tax that the employee sends to the feds in every pay period for Social Security. (The tax applies to annual incomes of $137,700 and below.) The first and second installment of a self-employed workerâ\u0080\u0099s quarterly estimated payments are due July 15. But under the CARES Act, self-employed workers, and other employers, can defer payment for an entire year of employer-side Social Security taxes, Weltman said. Filers who defer payment on this part of their payroll taxes can pay one half of the taxes by the end of 2021 and the second half by the end of 2022. Weltman added, â\u0080\u009cFor the gig worker who has a little cash flow issue, this could be a help.â\u0080\u009d This story was published on May 28 and updated on July 13."}]}