{"article": [{"url": "https://www.marketwatch.com/story/disneys-streaming-changes-have-built-a-big-enough-life-raft-to-get-through-pandemic-analysts-say-as-stock-spikes-2020-08-05", "published": 1596694940.0, "headline": "Disney has 'built a big enough life raft' with streaming changes, analysts say as stock enjoys best day in months", "body": "Walt Disney Co.'s shares spiked 8.8% Wednesday to their highest close of the COVID-19 pandemic after investors and analysts focused on the media titan's new plans for streaming rather than financial results that were destroyed by the COVID-19 pandemic. \"Despite long-term worries about cord-cutting, linear advertising, theatrical box office attendance and a possible new normal in consumer travel, Disney has accomplished what their peers have not: They have built a big enough life raft to get the Street's attention,\" MoffetNathanson analyst Michael Nathanson wrote in a note Wednesday morning, while maintaining a neutral rating and raising his price target to $118 from $111. \"And that attention helps override poor free cash flow generation, an unusually un-Disney-like stretched balance sheet and a relatively high valuation.\" That life raft was Disney's DIS, +1.53%  attempt to leverage the one positive aspect of a portfolio pounded by the pandemic: Streaming. After detailing a quarterly loss of $5 billion that was transformed into an adjusted profit thanks to an accounting trick involving sports rights, Disney changed the conversation by announcing that it would allow consumers to watch its long-delayed \"Mulan\" film for $30 on Disney+ and launch a new international streaming service under its Star brand. Full earnings results: Disney shakes up streaming approach after losing nearly $5 billion due to pandemic Analysts were quick to jump on the positive news and use it to wipe away their previous doubts about Disney's business. \"While COVID-related dynamics are likely to severely impact many of Disney's businesses for some time, we are removing the 20% risk discount we have applied to our target price given what we see as increased visibility,\" Credit Suisse analysts wrote while upgrading Disney to outperform from neutral and raising their price target to $146 from $116. \"With new CEO Mr. Bob Chapek now indicating an 'innovative and bold' further pivot to streaming, we expect Disney shares to be even more aggressively positioned as a streaming growth story (where investors have limited investment vehicles), and eventual COVID recovery play.\" Credit Suisse was one of at least three banks to upgrade Disney shares in the wake of the fiscal third-quarter earnings report, while many boosted their price targets, pushing the average price target on Disney stock from $128.48 to $132.09 Wednesday, according to FactSet tracking. Disney shares jumped as high as $130.31 before closing at $127.61, recording their best one-day percentage gain since March 24 and highest close since Feb. 25. See also: Disney will overhaul Splash Mountain ride amid criticism over connections to racist film - here's the movie they chose Much of the consumer chatter from Disney's earnings involved the cost of \"Mulan,\" the live-action remake of a Disney animated movie that has been repeatedly delayed and will now be sold as a pay-per-view on Disney+ for $30. In explaining the difficult job of pricing the movie, Bernstein analyst Todd Juenger described it as \"both shockingly high, and quite a consumer bargain, depending on one's view.\" See also: Disney+ was the only plus for Disney as coronavirus slammed other businesses \"Certainly, $30 for a family is significantly less expensive than it would cost to take that family to see this movie in a theater. On the other hand, the marginal cost of watching some other movie on Disney+ or Netflix is 'zero.' Or framed differently, a consumer could receive almost a half-year of Hulu SVOD ad-supported, or Disney+ at the annual discounted rate, for the same price as watching Mulan once,\" Juenger wrote while maintaining a market perform rating and raising his price target to $116 from $105. While the \"Mulan\" move made big waves, analysts pointed out that Disney was adamant that the move was a one-off that will help get some needed revenue - Juenger pointed out that less than 15% of Disney+ subs would need to rent the movie for Disney to get its costs back. The bigger long-term move from the analysts' perspective was the move for an international Star-branded streaming service similar to Hulu, Disney's majority-owned North American streaming offering. \"The announcement lacked details, but we believe it is a significant development as it could be a driver in helping Disney achieve 200M global streaming subs, potentially in 2022, following reaching 100M in June,\" Rosenblatt Securities analyst Bernie McTernan wrote while maintaining his buy rating and increasing his target to $145 from $135. \"This would be a significant milestone in catching up to Netflix NFLX, +1.43%, as we expect Netflix to cross 200M subscribers during CY'20E.\" See also:Here's everything coming to Netflix in August 2020 - and what's leaving Juenger described it as \"a chance to replay the [2019] playbook,\" referencing Disney's launch of Disney+ last year. \"Announce a new [direct-to-consumer offering]. Hold an investor day. Announce 5-year sub, ARPU, and profitability target. Collect a 'Netflix revenue multiple' against that guidance priced into the stock,\" he wrote, before adding a cautionary view of that approach. \"Before we get too carried away, hold on, this is not quite the same. Disney/Fox TV content is not consumer-distinguished in the same way as the Disney+ brands. There will be sizable required investments, we believe the biggest of which will be, once again, foregone licensing. Not to mention accelerated decline of int'l linear channels ($5bn write-off in the quarter).\" Read: Walt Disney World tightens face mask policy after guests took advantage of loophole Not all analysts were swayed by Disney's streaming plans. Needham analyst Laura Martin reiterated her hold rating and summarized the questionable numbers Disney released Tuesday. \"Disney provided no forward guidance. COVID-19-related costs in Disney's FY3Q20 were $3B, net of cost savings, with Parks' adverse impact alone at $3.5B. ... We remain on the sidelines until the structural economic impacts of COVID-19 on Disney are clearer,\" she wrote. Most other analysts, though, were happy to point toward new streaming initiatives as a potential savior for Disney. \"Disney management delivered a focused message of boldly pursuing additional global streaming video opportunities by leveraging STAR and Disney+ assets and a premium VOD window,\" wrote Guggenheim analysts, who upgraded the stock to buy from neutral and increased the price target to $140 from $123. \"While it would be easy to maintain a cautious or skeptical approach to these initiatives, we expect the possible further expansion of streaming economics and core underlying investor confidence in Disney intellectual property make further share appreciation the more likely path from here.\" Disney Loses Nearly $5 Billion Amid Pandemic Here's why Netflix stock, now below $500, is going to $1,000"}]}