{"article": [{"url": "https://www.marketwatch.com/story/watchdog-says-trumps-2019-fourth-of-july-gala-cost-taxpayers-13-million-2020-06-26", "published": 1593173420.0, "headline": "Watchdog says Trumpâ\u0080\u0099s 2019 Fourth of July gala cost taxpayers $13 million", "body": "President Donald Trumpâ\u0080\u0099s Fourth of July gala in the nationâ\u0080\u0099s capital last year cost taxpayers more than $13 million, twice as much as previous celebrations, government watchdogs reported Thursday. Trumpâ\u0080\u0099s desire to have Department of Defense military vehicles participate helped drive up the cost, as did the presidentâ\u0080\u0099s attendance near the Lincoln Memorial. Trumpâ\u0080\u0099s military-focused Independence Day event went beyond the traditional concert on the Capitol lawn featuring the National Symphony Orchestra and fireworks near the Washington Monument. Trump altered the lineup last year by adding his own speech from near the steps of the Lincoln Memorial, shifting the fireworks closer to that landmark and summoning an array of tanks and warplanes to entertain the crowds. A White House spokesman declined to directly address the findings on costs. Responding to Democratic lawmakersâ\u0080\u0099 charges that the presidentâ\u0080\u0099s spending on the Fourth of July is extravagant and amounts to political activity on the taxpayerâ\u0080\u0099s dime, spokesman Judd Deere said Trumpâ\u0080\u0099s celebration â\u0080\u009cis not about politics.â\u0080\u009d â\u0080\u009cItâ\u0080\u0099s about all Americans coming together to celebrate Independence Day, our great armed forces and their heroic sacrifices, which have preserved our freedoms for generations, and our amazing heritage,â\u0080\u009d Deere said. The Interior Department called the 2019 event â\u0080\u009can incredible celebration,â\u0080\u009d but also refused to comment on the costs accrued then or whatâ\u0080\u0099s expected for this yearâ\u0080\u0099s event. The White House has said Trump plans to mark the holiday this year by attending a fireworks show July 3 at Mount Rushmore in the Black Hills of South Dakota and then celebrating in the nationâ\u0080\u0099s capital on Independence Day. Trump and first lady Melania Trump will host the event from the White Houseâ\u0080\u0099s South Lawn and the Ellipse, with music, military demonstrations and flyovers. The president also is expected to deliver remarks. The White House has said this yearâ\u0080\u0099s event will have a different look because of the coronavirus pandemic. The Government Accountability Office estimated that holiday celebrations from 2016 to 2018 cost from $6 million to $7 million annually. Its estimate for 2019 did not include costs such as the military flyovers of the National Mall. Three Democrats on the Senate Appropriations Committee had asked for the GAO investigation of how much the federal government spent on the 2019 festivities. Sen. Tom Udall, D-N.M., said in a statement that the findings showed careless use of unbudgeted taxpayer money to meet Trumpâ\u0080\u0099s â\u0080\u009cextravagant demands.â\u0080\u009d The senators, in a letter to the GAO that was released Thursday, requested that the agency examine costs for the Trumpâ\u0080\u0099s Fourth of July plans this year. The president â\u0080\u009cintends to use these Fourth of July celebrations as a way to marshal the resources of federal agencies to conduct de facto political events with official funds,â\u0080\u009d Udall and Sens. Patrick Leahy, D-Vt., and Chris Van Hollen, D-Md., wrote congressional investigators. Extra costs for last yearâ\u0080\u0099s fete included a $2.5 million contract to an unidentified private entity for overall event planning, paid out of National Park Service appropriations, according to the congressional investigators. The presence of Trump and other top government officials required numerous Secret Service agents and overtime, the investigators said. District of Columbia officials had to consult with engineers on whether city roads, bridges and sewers would stand up to the weight of Bradley Fighting Vehicles, rolled in to serve as props on both sides of musical bands near the Lincoln Memorial."}]}