{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-surge-over-3-toward-four-month-high-as-eu-agrees-stimulus-package-2020-07-21", "published": 1595346500.0, "headline": "Oil prices climb by more than 2% to four-month high as EU agrees to stimulus package", "body": "Oil futures ended sharply higher on Tuesday, with prices marking their highest settlement since early March, as markets grow more positive about the world’s ability to address the COVID-19 pandemic which has crushed demand for crude and its byproducts. A historic stimulus package forged by the 27-nation European Union after marathon negotiations since Friday, helped to set the stage for a climb higher for oil. Investors also may also becoming more assured that countrys can beat back a surge in COVID-19 cases. Investors cheered the positive results from at least two experimental COVID-19 vaccines Monday. The catalyst for the overnight crude spike is the stimulus package in Europe “that will feed demand and allow a risk-on attitude to drive markets higher and create economic forces that will burn more oil,” said Phil Flynn, senior market analyst at The Price Futures Group. The EU agreed a €750 billion ($860 billion) coronavirus rescue fund, and investors also are watching for developments with additional fiscal stimulus measures from the U.S., which could help curtail the recession that has been wrought by the pandemic. Against that backdrop, West Texas Intermediate crude for August delivery CL.1, -1.62% US:CLQ20 on the New York Mercantile Exchange rose $1.15, or 2.8%, to settle at $41.96 a barrel, after gaining 0.5% on Monday. The front-month contract ended at its highest level since March 5, according to Dow Jones Market Data. The August contract expired at the end of the day’s session. September WTI crude US:CLU20, which is now the front month, settled up $1, or 2.4%, at $41.92 a barrel. September Brent crude BRN.1, -0.07% on ICE Futures Europe climbed by $1.04, or 2.4%, at $44.32 a barrel, after the global benchmark rose 0.3% in the previous session. The Tuesday gain lifted Brent to the highest level since March 6. On Monday, crude scored an injection of fresh optimism on the back of reports on progress toward vaccine candidates for coronavirus being developed by the University of Oxford and AZN, +1.16% as well as those in the works from the likes of Pfizer PFE, -0.27% and BNTX, +1.23%. The global tally for confirmed cases of the coronavirus that causes COVID-19 climbed to 14.7 million on Tuesday, according to data aggregated by Johns Hopkins University, and the death toll rose to 610,292. Oil prices got a boost Monday from “optimism that a vaccine for the novel coronavirus will be ready for production this year,” said Stephen Innes, global chief market strategist at AxiCorp, in a market update. “All the while, U.S. production shows few signs of coming back,” with data Friday from Baker Hughes showing a weekly fall of just 1 in the number of active U.S. oil drilling rigs, he said. The “offset” is the COVID-19 headlines, which are “adding to pressure ahead of the return next month of some supply as the OPEC+ production cuts begin to taper.” Looking ahead, “the pace of oil price improvement in the face of real virus demand risks will likely remain sluggish, suggesting [that] unless the epidemic curve flattens and lockdown are rolled back, there remains more considerable downside than upside price risk through the near term contract,” said Innes. Weekly petroleum inventory data from the Energy Information Administration will be released Wednesday morning. The American Petroleum Institute, a trade group, will release its own figures late Tuesday. On average, analysts expect the EIA to report a decline of 1.9 million barrels in crude inventories for the week ended July 17, according to a survey of analysts conducted by S&P Global Platts. That would mark a second straight weekly decline. The survey also called for a fall of 2 million barrels for gasoline stockpiles, but distillate inventories are expected to show a climb by roughly 280,000 barrels. Back on Nymex, August gasoline US:RBQ20 added 4.2% to $1.2797 a gallon. August heating oil US:HOQ20 rose 3.6% to $1.28 a gallon—the highest since early March. August natural gas US:NGQ20 climbed by 2.1% to $1.675 per million British thermal units, looking to recoup part of the 4.5% it lost Monday."}]}