{"article": [{"url": "https://www.marketwatch.com/story/this-california-legislator-is-taking-on-smiledirectclub-2020-07-10", "published": 1594463720.0, "headline": "This California legislator is taking on SmileDirectClub", "body": "California Assemblymember Evan Low is not what most people would consider anti-technology. A Democrat from Campbell, Calif., Low represents several towns and bedroom communities of Silicon Valley in the state legislature, including Cupertino, the hometown of Apple Inc. AAPL, +1.74%. He also was co-chairman of former presidential candidate Andrew Yang’s campaign, and before the pandemic shelved it, he introduced a California basic income bill inspired by Yang’s universal “freedom dividend.” “I represent Silicon Valley,” Low told MarketWatch in an interview. “I have always been supportive of the tech economy.” But in the past year, he has become a rare legislator willing to take on the controversial and litigious teledenistry company SmileDirectClub Inc. SDC, -2.59% SDC, -2.59% SDC, -2.59% Low has already written one law signed last October by California Gov. Gavin Newsom, which provided some new protections for those using direct-to-consumer dentistry products. Now, he is backing another new bill with additional protections, but one that in the age of COVID-19 had to be amended to recognize that in-person dental visits cannot be mandated. SmileDirect is known for taking its battles with critics through the legal system. In May, SmileDirect — which makes lower-cost self-applied straightening aligners for mild to moderate teeth-positioning problems — filed a $2.85 billion defamation lawsuit against NBC News for an investigation into consumer complaints about the company. In that story, Comcast Corp.’s CMCSA, -0.99% NBC interviewed two patients who said they believed SDC aligners caused problems with their teeth and/or bite and caused other problems, like headaches for one patient. SmileDirectClub called NBC’s story a “hit piece” that ignored data on the lack of credibility of the patients, such as the criminal record of one and the failure to adhere to instructions by the other, and ignored the opportunity to interview patients pleased with their aligner results. NBC told The Wall Street Journal that it stands by its reporting. In its longer, online version of the story, NBC included comments of four patients who had positive experiences. In its lawsuit against NBC, SmileDirectClub mentioned Low, contending that NBC omitted from its report “the bias of the congressmen who wrote to the FDA and FTC and the state representative (Evan Low) involved with the California regulation discussed,” which the lawsuit credits to “financial ties to dental organizations and doctors who are attempting to block teledentistry, generally, and SDC, in particular.” Low began tangling with the company last year while researching a review of the continued status of the California Dental Board, which regulates licensed dentists in the state. Low and his staff learned of consumer issues and complaints involving the use of the self-applied aligners by mail, and dug in a bit more, he said in an interview with MarketWatch. He believed that there needed to be more protections in place for consumers, some of whom have said they had to sign nondisclosure agreements in order to receive a refund for SDC’s treatment plans, which cost less than metal braces or plastic aligners provided by orthodontists. “We found there could be additional consumer harm, and so we want to limit that,” he said. “Given the info we learned last year, I could not just do nothing.” Low likens the need for regulations for teledentistry companies like SmileDirectClub to the regulations in optometry. Low is the son of an optometrist, and noted that optometrists want you to buy your glasses and sunglasses in their offices. “I personally don’t always do that. ...That is my right. ...But the prescription is done by a doctor. This is the same thing,” he said. “I just cannot go to the mall and buy glasses without a prescription, but I went to the mall because my dad had a terrible selection.” The result of that review by Low and his staff was last October’s AB-1519, which provided protections for teledentistry consumers. It required that all dentists in the state providing orthodontia in the “correction of malpositions of human teeth or the initial use of orthodontic appliances” must review diagnostic digital or conventional radiographs of a patient before diagnosing braces or aligners, or their conduct would be deemed unprofessional under the Dental Practice Act. The law also states that a dental provider shall not ask a patient to sign an agreement that would prevent their ability to file a complaint with the dental board. “I support innovation, I support tech, but you have to make sure you are doing it in an appropriate fashion. If there is unethical behavior, I am going to call you out,” Low said. SmileDirectClub said it is in compliance with the law, and tells investors that the dentists in its network review a complete photo set and an intra-oral scan of a patient’s mouth, which, prior to the pandemic, were taken in-person at a SmileShop retail location. Potential patients also can make an impression of their mouth with an at-home kit and send it in to the company, which then creates a dental plan and the aligners. If an X-ray is needed, “it’s really up to the treating doctor, not the state legislature,” SmileDirectClub Chief Executive David Katzman said in an earnings call last November, after the new California law passed. “That was our opposition to the bill. But as far as being in compliance, we’re in full compliance as it stands today.” In a statement, SDC, based in Nashville, Tenn., said it has successfully treated more than 150,000 Californians. In a state where 50% of the dentists and orthodontists are located in only five out of 58 counties in the state, remote treatment for some patients may be the only viable option, especially during the pandemic. Now Low is getting support for another bill. The latest legislation passed the state Assembly in early June and moved to a committee in the Senate last week. That bill, AB-1998, introduced in the pre-COVID-19 world in January, sought to require California dentists to conduct an in-person examination of their patients prior to approving a treatment plan for clear aligners or other orthodontics. SmileDirectClub has a dentist or orthodontist in its network review each case remotely and check in with patients every 90 days, guiding treatment remotely from beginning to end. But after objections from the California Dental Association and others, the requirement for in-person exams — a huge issue during the pandemic — was removed. When asked about the bill in its pre-amended form in June, SmileDirectClub said that it “would restrict consumer accessibility to quality, affordable care for millions of Californians.” The company also said that the bill “defies logic as well as public health and safety,” as telemedicine has become more necessary in the current pandemic. The amended bill mandates that a patient can obtain information on how to reach their assigned dentist after they have received the treatment plan (a complaint often heard from teledentistry patients), gives explicit rights on obtaining records signed by the patient, and expands the prohibition for any patient or employee to enter into a contract that limits the ability to complain to a regulator. Affordable care for all is the mantra for telemedicine companies, but Low said that in his position, as chair of the state legislative committee that watches over consumer affairs, he wants to make sure consumers are not getting subpar health care from these companies. “This will disproportionately hurt communities of color; not everyone can go to health-care providers,” Low said. “But the reality is that subpar treatment can do real harm, the risk is too high.” In a statement, SmileDirectClub said “Assemblyman Low’s campaign relies heavily on donations from the California Dental Association and he has a history of protecting the dental industry’s financial interests to the detriment of his constituents.” Since 2014, Low has received $46,600 in contributions from the California Dental Association including $1,000 from the Dental Access Plan, out of a total of $4.6 million in contributions, according to Followthemoney.org, which uses data from the nonprofit National Institute on Money in Politics. “Assemblymember Low doesn’t let contributions influence his policy-making decisions,” Low’s chief of staff Gina Frisby said in an email. “The company has hundreds of consumer complaints against them and as chair of B&P, the Assemblymember is only interested in protecting the consumer.” Low is chairman of the Assembly Committee on Business and Professions and a co-founder of the California Legislative Technology and Innovation Caucus, and has declined to identify the donors to that group, according to a report by CalMatters. After that report in February, the state’s enforcement division of the Fair Political Practices Commission told Low it was investigating potential violations of disclosures, but at that time it had not made any determination about the possible violations. The investigation is still ongoing, a spokesman for the commission said in an email. Low said that SmileDirectClub’s attitude is typical of many of the startups or unicorn-IPO companies in Silicon Valley, including Uber Technologies Inc. UBER, -0.18% and Lyft Inc. LYFT, +2.16%, which have an adversarial approach to regulation. “By definition, the startups move so quickly, they invest in R&D, sales and marketing, and they think about the regulatory later on,” he said, adding that he tries to get his friends in the VC world and elsewhere to think more about engaging with the government early on. “I was born and raised in Silicon Valley, these are frank conversations I have with my dear friends.” After growing up in the valley, and being the youngest mayor in the history of the city of Campbell, Low has a lot of friends in the tech business, so he is sometimes in a tough position. “I did not run for the California state legislature because I wanted to go after companies. It gives me no pleasure to do so. I am chair of the tech caucus, which has VCs from the Silicon Valley. These are my folks. [But] we have to hold our friends to account.”"}]}