{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-inch-lower-tuesday-morning-as-investors-turn-cautious-after-tech-driven-rally-2020-08-04", "published": 1596560120.0, "headline": "Nasdaq logs 30th record of 2020 and S&P 500 ends above 3,300 in choppy session, as large-cap tech stocks take a breather", "body": "U.S. stocks concluded a bumpy trading session on a high note Tuesday, with another record for the Nasdaq Composite, even as technology-related names took a backseat to outperformance in beaten-down sectors energy, real estate and consumer staples. Investors parsed a trove of quarterly results from U.S. corporations and awaited a resolution to a stalemate between congressional Democrats and Republicans on a fresh fiscal relief package for Americans that have been put out of work due to the COVID-19 pandemic. How did equity benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% picked up 164.07 points, or 0.6%, at 26,828.47, lifted by gains in McDonald’s Corp. MCD, -0.43% and UnitedHealth Group Inc. UNH, +1.68% and capped by a loss in shares of Microsoft Corp. MSFT, +2.48%. The S&P 500 index SPX, +0.87% rose 11.90 points, or 0.4%, to 3,306.51, near its intraday peak, which put it above a psychological round-number level above 3,300. The Nasdaq Composite Index COMP, +1.39% finished 38.37 points, or 0.4%, to close at 10,941.17, also near its highs of the session. The Nasdaq notched its 30th record close of 2020, putting the benchmark one record away from exceeding its record close tally for all of 2019 and placing it ahead of the 29 records for 2018, according to Dow Jones Market Data. The Nasdaq Composite has risen for five consecutive sessions while the S&P 500 and the Dow have gained for three straight trading days. On Monday, the Dow climbed 236.08 points, or 0.9%, to close at 26,664.40. The S&P 500 SPX, +0.87% rose 23.49 points, or 0.7%, to 3,294.61. The Nasdaq Composite gained 157.52 points, or 1.5%, to close at 10,902.80. What drove the market? Market participants appear to be betting on progress toward a fresh coronavirus aid package for out-of-work Americans but none was forthcoming on Tuesday. Mark Meadows, White House chief of staff, was quoted by the Wall Street Journal as saying that a deal seemed far off. “We’re a long ways away from striking any kind of a deal,” said Meadows, coming out of a Senate Republican lunch on Tuesday. House Speaker Nancy Pelosi and Senate Minority Leader Chuck Schumer were scheduled to meet with the Trump administration at 3:30 p.m. Eastern, but expectations for a deal this week seemed to be fading. Still, markets took the lack of progress in strike, betting on under-loved sectors which may benefit from further fiscal support after investors piled into technology and e-commerce stocks that have been viewed as more resilient to the economic environment that the COVID-19 pandemic has created. Paul Nolte, portfolio manager at Kingsview Asset Management, said that he believed that the investors were taking Tuesday as an opportune to diversify their holdings. “So, the rest of the market is playing a little bit of catch up today and value is doing well over growth,” he noted. One measure of value, or stocks that are trading at a discount by some metric, the iShares S&P 500 Value ETF IVE, +0.16%, gained 0.5%, while growth names, represented by the iShares S&P 500 Growth ETF IVW, +1.32% , gained a more subdued 0.2% on the day. That said, the growth sector’s weekly gain stands at 1.2% compared with a 0.8% gain thus far this week for value. Equity gains came as haven assets were headed toward historic highs, reflecting uncertainty about the sustainability of the stock market rally that has been primarily driven by a handful of names and doubts about the economy to bounce back sharply from the shock from the coronavirus pandemic. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% closed at 0.514%, near its all-time closing low, according to Dow Jones Market Data, while gold prices GC00, +2.17% soared 1.7% to notch their first finish above $2,000 in history. “The stock market is living off the Federal Reserve largesse,” Nolte said, referring to the trillions of dollars the central bank has doled out to provide liquidity to financial markets, including Treasurys and other fixed-income securities, that seized up during the apex of this public-health crisis. “Gold is doing well because interest rates have been suppressed and it doesn’t cost anything to hold gold,” the Kingsview money manager said, adding that investors also may be bracing for an unsightly July jobs report on Friday. “I think people are nervous about this jobs reports because of the weekly jobless claims numbers haven’t come down by as much as many people have expected,” he said. Markets got a slight and momentary lift early in the session after a reading of U.S. factory orders rose 6.2% in June to mark the second increase in a row, pointing to a steady rebound after widespread shutdowns in the early stages of the pandemic. Economists polled by MarketWatch had predicted a 4.6% increase. Meanwhile, a slowing of coronavirus infections was providing some cause for optimism on the public-health front. The Wall Street Journal reported that hard-hit states appeared to be getting a respite from rising case counts and hospitalizations as the U.S. reported fewer than 50,000 new coronavirus cases for the second day in a row. The daily tally of new cases in the U.S. was more than 45,000, slightly lower than the previous day’s total, marking the smallest daily gain since July 6, according to data compiled by Johns Hopkins University. The total U.S. death toll was more than 155,000.Which stocks were in focus? Ralph Lauren Inc. RL, -0.59% stock fell 4.4% Tuesday after the luxury lifestyle brand reported fiscal first-quarter revenue that missed expectations. Shares of Abiomed Inc. ABMD, +0.87% declined 1% lower on Tuesday after the company said its Impella heart pump had received an emergency use authorization from the Food and Drug Administration as a treatment for some COVID-19 patients. Travel firm Booking.com BKNG, +1.62% said it would cut 25% of its workforce as a result of the COVID-19 pandemic. Shares finished Tuesday trade up 1.5%. KKR & Co. KKR, -0.61% on Tuesday said its second-quarter profit rose year over year, marking a recovery for the asset-management company. Its stock climbed 1.2%. Ford F, -1.36% announced that CEO Jim Hackett was retiring Oct. 1. Shares gained 2.5%. Space-tourism company Virgin Galactic Holdings SPCE, -3.12% says it entered into deposit agreements with a dozen new customers, plans to sell more than 20 million fresh shares. Shares tumbled nearly 14%. How did other markets trade? European equity markets ended little changed. The Stoxx Europe 600 index SXXP, +0.55% declined less than 0.1%, and the FTSE 100 UKX, +0.64% advanced 0.1%. In Asian trade Tuesday, China’s CSI 300 index 000300, +2.04% gained less than 0.1%, the Shanghai Composite Index inched 0.1% higher. Japan’s benchmark Nikkei index NIK, -0.11% climbed 1.7% after a 2.2% gain on Monday. In other assets, the ICE U.S. Dollar index DXY, -0.58% fell 0.1%, giving up an earlier modest gain. Crude futures CL00, -1.62% rose 69 cents, or 1.7% to finish at $41.70 a barrel on the New York Mercantile Exchange, after trading as low as $40.14. Gold futures for December US:GCQ20 rose $34.70, or 1.7%, to end a record at $2,021 an ounce."}]}