{"article": [{"url": "https://www.marketwatch.com/story/gap-hopes-it-can-burnish-its-image-with-a-new-kanye-west-clothing-line-repeating-the-rappers-brand-success-with-adidas-2020-06-26", "published": 1593607940.0, "headline": "Gap hopes it can burnish its image with a new Kanye West clothing line, repeating the rapperâ\u0080\u0099s brand success with Adidas", "body": "UBS analysts saw what Kanye West did for Adidas AG and think the controversial rapper and fashion designer could do the same for ailing Gap Inc. Gap GPS, -0.10% Â announced Friday that it has partnered with Kanye for the Yeezy Gap collection that will include items for men, women and children at affordable prices. The clothes are coming to the namesake clothing chainâ\u0080\u0099s stores and to the website in 2021. â\u0080\u009cWhen Adidas ADS, +1.87% Â began partnering with Kanye West five years ago, it began a resurgence for the brand,â\u0080\u009d wrote Wells Fargo analysts led by Ike Boruchow. See:Nikeâ\u0080\u0099s COVID-related sales decline is a bump in the path to long-term growth, analysts say â\u0080\u009cBears will likely point out that an additional $700 million in sales (in the best case scenario) is not material to Gapâ\u0080\u0099s $15 billion sales base, but we would argue that, much more importantly, this partnership could provide a positive halo effect to the ailing Gap brand (and share price) that has struggled to rediscover its â\u0080\u0098coolâ\u0080\u0099 over the past decade, while driving incremental traffic and purchases from new and lapsed customers.â\u0080\u009d Gap stock closed Friday up 18.8%. The stock has lost 28.9% of its value over the past year while the S&P 500 index SPX, +0.87% Â is up 5.3%. Gapâ\u0080\u0099s portfolio also includes the Banana Republic and Old Navy brands. Wells Fargo upgraded Gap earlier this week, calling the move â\u0080\u009cidiosyncratic.â\u0080\u009d The upgrade was based on the strength of the Athleta brand and the companyâ\u0080\u0099s real estate, but analysts say the call drew â\u0080\u009clargely (and loudly) negative incoming call volume.â\u0080\u009d Read:More consumers are willing to head back to stores than to dine out at restaurants, S&P Global says Wells Fargo rates Gap stock overweight with a $19 price target. iframe.twitter-tweet { width: 100% !important; } â\u0080\u009cWhile this announcement was unexpected, it is highly aligned with our view that Gap ownership and new management have taken on a new â\u0080\u0098all options on the tableâ\u0080\u0099 mentality, and are highly committed to finding new and creative ways to unlock value from their portfolio,â\u0080\u009d analysts said. Cowen analysts agree there are a number of benefits for the Gap, including a connection to a premium and relevant brand. â\u0080\u009cGapâ\u0080\u0099s creative direction and merchandise execution has been highly inconsistent; these efforts may set the brand in a new positive direction and drive greater appeal to a younger customer,â\u0080\u009d wrote analysts led by Oliver Chen. Analysts say there are risks, like the challenges of launching a new brand while trying to execute a turnaround, and the possibility that Yeezy Gap could cannibalize Gapâ\u0080\u0099s core merchandise. But given the Friday stock move, Cowen says the partnership could yield a $1 billion topline benefit by 2025. Cowen rates Gap stock market perform with an $11 price target."}]}