{"article": [{"url": "https://www.marketwatch.com/story/pelosi-says-russia-poses-greater-threat-to-election-than-china-2020-08-09", "published": 1597153880.0, "headline": "Pelosi and fellow Democrats say Russia poses urgent threat to 2020 election and China and Iran don't belong in the same conversation", "body": "WASHINGTON - House Speaker Nancy Pelosi said Sunday the threats of interference in the U.S. presidential election from Russia and China are not equal, pointing to a more serious risk with Moscow's efforts to boost President Donald Trump's re-election bid. \"They're not equivalent,\" said Pelosi, a California Democrat. \"Russia is actively 24/7 interfering in our election. They did so in 2016, and they are doing so now.\" She urged intelligence agencies to \"put more information out there\" on the specific nature of the threats. An intelligence report last week said Russia was already using a \"range of measures\" to undercut Trump's Democratic challenger, Joe Biden, and promote Trump with misinformation on social media. The statement Friday by William Evanina, director of the National Counterintelligence and Security Center, also said China does not want Trump to win a second term and has accelerated its criticism of the White House, and that Iran is also hoping Trump will lose. Pelosi said trying to equate China and Russia on the threat of foreign election interference doesn't tell the story. See:Russia aims to run down Biden candidacy in support of Trump's re-election, says U.S. counterintelligence official \"The Chinese, they said, prefer Biden - we don't know that, but that's what they're saying, but they're not really getting involved in the presidential election,\" she said. Trump's national-security adviser, Robert O'Brien, said Sunday that the U.S. is taking any threat to U.S. elections seriously. He said that China has engaged in cyberattacks and phishing \"with respect to our election infrastructure.\" \"We're not going to put up with it,\" he said. \"We're going to take every action necessary to keep folks out, whether it's China or Russia or Iran or Cuba or Venezuela or others.\" Pelosi and other congressional Democrats have expressed concern that intelligence agencies have been withholding from the public specific intelligence information about the threat of foreign interference in American politics. \"The facts are chilling,\" Sen. Richard Blumenthal, D-Conn., wrote in an op-ed published Friday evening in the Washington Post. \"I believe the American public needs and deserves to know them. The information should be declassified immediately.\" Pelosi spoke on CNN's \"State of the Union\" and \"Fox News Sunday\"and O'Brien appeared on CBS' \"Face the Nation.\" Read on:Republican Ron Johnson subpoenas FBI documents amid Senate committee probe into origins of Trump-Russia investigation"}]}