{"article": [{"url": "https://www.marketwatch.com/story/pfizer-ceo-coronavirus-vaccine-could-be-distributed-in-us-by-end-of-year-2020-09-13", "published": 1600049420.0, "headline": "Pfizer CEO: Coronavirus vaccine could be distributed in U.S. by end of year", "body": "The chief executive of Pfizer Inc. said Sunday that the pharmaceutical giant should know if its experimental COVID-19 vaccine works by the end of October — and, if approved, it could be distributed in the U.S. by the end of the year. In an interview on Sunday with CBS News’ “Face the Nation,” CEO Albert Bourla said there is a “good chance” of getting key data from late-stage trials to the Food and Drug Administration by the end of October, and that the company is already producing the vaccine, just in case. “We started already manufacturing, and we have already manufactured hundreds of thousands of doses, so just in case we have a good study readout, conclusive, and FDA, plus the advisory committee, feels comfortable, that we will be ready,” Bourla said. Read:Here’s what you need to know about clinical trials as drug makers push forward with coronavirus vaccine studies He said Pfizer PFE, -0.27%, which is teaming with German drug maker BioNTech BNTX, +1.23% on the coronavirus vaccine’s development, will absorb a financial hit if the vaccine fails, but was adamant about not taking government funding to keep the process apolitical, with CEOs of nine pharmaceutical companies having recently felt compelled to push back against a growing perception that Donald Trump and his administration were pressuring regulators to get vaccines and therapies to market ahead of the Nov. 3 presidential election, pledging that their companies would not seek premature approvals or authorizations. “ “I wanted to liberate our scientists from any bureaucracy ... basically I gave them an open checkbook so that they can worry only about scientific challenges, not anything else. And also, I wanted to keep Pfizer out of politics.” ” — Pfizer CEO Albert Bourla Bourla said Pfizer has already invested about $1.5 billion into the vaccine effort. “At the end of the day, it’s only money. But that will not break the company, although it’s going to be painful,” he said of the possibility that the vaccine does not prove to be effective. On Saturday, Pfizer and BioNTech sought FDA approval to expand their Phase 3 vaccine trial to up to 44,000 participants, up from the originally planned 30,000. In July, the companies announced a $1.95 billion deal with the U.S. government to produce 100 million doses of the vaccine, if it wins approval by regulators. The vaccine effort by Pfizer and BioNTech is one of many currently underway. On Saturday, AstraZeneca PLC AZN, +1.16% said it has resumed its vaccine study in the U.K. after halting global studies last week to investigate an unexplained illness in a participant. While British regulators said the trial was safe to proceed, the study remains paused in other countries."}]}