{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-slump-over-170-points-as-investors-parse-first-presidential-debate-11601464935", "published": 1601484740.0, "headline": "Dow ends 329 points higher, but stocks book worst month since March as fiscal stimulus hopes fade", "body": "U.S. stock indexes closed higher Wednesday, but booked their worst month since March, as hopes faded for another round of fiscal stimulus from Washington ahead of November’s election. Market participants also were wary of a potentially contested November result following Tuesday’s rancorous first presidential debate. How did stock benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% rose 329.04 points, or 1.2%, to close at 27,781.70, while the S&P 500 index SPX, +0.87% gained 27.53 points, 0.8%, to end at 3,363. The Nasdaq Composite COMP, +1.39% finished 0.7%, or 82.26 points higher, at 11,167.51. For the month, the Dow closed 2.3% lower, the S&P 500 down 3.9% and the Nasdaq Composite ended off 5.2%, marking the first monthly decline for each benchmark since March which saw the low point of the sell off resulting from the coronavirus pandemic. On a quarterly basis, the Dow advanced 7.6%, the S&P 500 rose 8.5% and the Nasdaq Composite surged 11%.What drove the market? Stocks closed higher, but off the session’s best levels, as doubts grew about Washington’s ability to provide the U.S. economy with another round of fiscal stimulus ahead of the November elections. Senate Majority Leader Mitch McConnell told reporters Wednesday afternoon that Republicans and Democrats were still “very very far apart” on how much to spend, according to Reuters News. The statement contradicted Treasury Secretary Steven Mnuchin who, earlier in the day, said he was hopeful about a striking a deal, after a new $2.2 trillion House Democratic bill was unveiled late Monday. “Mitch McConnell said the opposite,” said Peter Cardillo, chief market economist at Spartan Capital, in an interview, adding that his comments led early stock-market gains to wobble. “I kind of think they will still get a deal done,” he told MarketWatch. “Because at this point, it’s politically motivated and it serves both parties going into the election.” See: Coronavirus aid talks entering final stages as Pelosi, Mnuchin meet in Washington Developments on Capitol Hill overshadowed positive data on housing and jobs that had been a focus for much of the session. “Most people gauge their net worth not on their stock portfolio, but on the value of their house,” said Kent Engelke, chief economic strategist at Capitol Securities Management, in an interview. “We now have two parts of the economy starting to really show strength.” Home-contract signings were at a record high in August, the National Association of Realtors said Wednesday. Earlier Automatic Data Processing said 749,000 private-sector jobs had been created in September, ahead of estimates for a gain of 650,000, and the strongest reading in three months. Last month, the ADP data showed that 480,000 jobs were created in August. ADP’s reading could bode well for Friday’s more closely followed nonfarm-payrolls report from the U.S. Labor Department, with 800,000 jobs estimated for September and the unemployment rate slipping to 8.2% from 8.4%. Also, a reading of Chicago-area business activity in September was stronger than expected, with a reading of 62.4. U.S. GDP losses for the second quarter also were cut slightly to -31.4%, from -31.7% on an annualized basis. Minneapolis Federal Reserve President Neel Kashkari on Wednesday said to expect only a “grinding” economic recovery, without a dramatic change in policy or a vaccine breakthrough, while urging Congress to provide more fiscal stimulus. Diane Jaffee, senior portfolio manager at TCW, sees incremental progress in both the economy, particularly in hiring, and in the market, with some broadening of sector gains. “I think Chairman Powell said it best: there are multiple phases for this, and we’re in phase two, a recovery from the horrific lows, but the broad damage done to the leisure industry and restaurants and small businesses is going to take a long, long time,” Jaffee told MarketWatch. “That’s why the Fed is going to be patient.” But Jaffee also thinks another round of fiscal support from Washington is critical. “While some states have stepped into the void, there are still a lot of hurting people out of there and that should be done at a national level,” she said. More positive data on potential coronavirus treatments also helped bolster investor sentiment with an experimental COVID-19 drug from Regeneron Pharmaceuticals REGN helping reduce virus levels and improve symptoms in sick patients who weren’t hospitalized . The first presidential debate late Tuesday night, one of a three-part series, between President Donald Trump and Democratic challenger former Vice President Joe Biden did little to alter the trajectory of the race for the White House or to offer clear guidance for market participants on policy. See: Presidential debate antics leave many viewers disgusted “It was an acrimonious, chaotic and insulting debate,” wrote Naeem Aslam, analyst at AvaTrade in a note, adding that there’s a growing possibility of an uncertain outcome in the Nov. 3 contest, which could roil markets in the short term. Both candidates suggested that the presidency may not be decided on Election Day.Which stocks were in focus? Palantir Technologies Inc. PLTR, -0.50% shares gained 31% from the reference price listed by the New York Stock Exchange, which is based on previous trades in private markets, after its direct listing. In other debuts, Yalla Group YALA, -4.44% shares tumbled 6.7%, while Boqii Holdings BQ, +8.78% shares skid 28% and Asana ASAN, -3.12% shares rose 37.1% above its reference price after its direct listing. Duke Energy DUK, +0.16% shares jumped 7.5% after The Wall Street Journal reported that NextEra Energy NEE, +0.62% recently made a takeover approach. Walt Disney DIS, +1.53% shares fell 1.1% after the entertainment giant said on Tuesday that it plans to lay off about 28,000 employees at its domestic theme parks. Regeneron Pharmaceuticals REGN, +0.36% said on Tuesday that its experimental COVID-19 drug helped reduce virus levels and improve symptoms in sick patients who weren’t hospitalized. Shares fell 2.4%. Moderna MRNA, +0.09% said a small study showed in early-stage testing that its coronavirus vaccine can generate neutralizing antibodies in older and elderly adults, but told the FT a vaccine wouldn’t be ready before November’s election. The stock gained 0.3%. Hasbro Inc. HAS, +1.36% shares rose 1.8% after an upgrade from Stifel analysts. How did other markets perform? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 3.3 basis points to 0.677% Wednesday, while booking its biggest one-quarter yield gain since Dec. 2019, according to Dow Jones Market Data. Bond prices move inversely to yields. U.S. benchmark crude futures for November delivery CL.1, -1.62% rose 93 cents, ending above $40.22 a barrel on the New York Mercantile Exchange, despite concerns about rising case counts. Gold futures GCZ20, +2.17% dipped 0.4%, to settle at $1,895.50 an ounce. In global equities, the Stoxx Europe 600 index SXXP, +0.55% traded 0.1% lower, while the U.K.’s FTSE 100 UKX, +0.64% fell 0.5%. In Asia overnight, Japan’s Nikkei NIK, -0.11% lost 1.9% and Hong Kong’s Hang Seng HSI, -0.30% Index closed 0.8% higher. The ICE U.S. Dollar index DXY, -0.58%, a gauge of the greenback’s strength against a basket of currency trading partners, edged down less than 0.1%. Read next: Market swings are a sign ‘something is lurking,’ says strategist who called ’08 crisis Mark DeCambre contributed reporting"}]}