{"article": [{"url": "https://www.marketwatch.com/story/short-sellers-made-26-bln-off-wirecard-plunge-2020-06-22", "published": 1592791760.0, "headline": "Short sellers made $2.6 bln off Wirecard plunge", "body": "Investors betting against shares in Wirecard AG, the stricken German fintech company, hit a prodigious payday this week. For some passionate critics of the company, the reward wasn't just in money, but in vindication. Before Wirecard revealed more than $2 billion of cash was missing from its business on Thursday, investors who bet on stocks to decline had made it one of their most popular targets. That set up what may have been one of the biggest paydays for short sellers on a single stock in years. Short sellers, who borrow shares and sell them hoping to buy them back for less in the future, notched paper profits of $2.6 billion off Wirecard's plunge, according to data-analytics firm S3 Partners. Bets by the eight funds with the biggest short exposure to Wirecard, including in options markets, delivered paper profits of $1 billion according to Breakout Point, a research service. New York-based Slate Path Capital and two U.K. funds, TCI Fund Management and Marshall Wace, had the biggest short positions Wednesday and are up as much as EUR184 million ($206 million), EUR161 million and EUR136 million respectively over the past two days, Breakout Point estimates. Other funds that were short include Darsana Capital Partners, Samlyn Capital and Viking Global Investors. The path to riches was hardly linear. While critics were proven right in the end, gobs of money were lost over the years as the company's share price marched higher, wiping out short bets. Wirecard runs vital, but little-noticed technology that connects online merchants, consumers and the banking system. It has attracted attention from hedge funds questioning its accounting for so long that some are no longer in business. Blue Ridge Capital, which began shorting Wirecard in the mid-2000s, according to people familiar with the firm, closed down in 2017. \"It's finally impossible for anyone to avoid what's been going on and how this company has operated,\" said Fahmi Quadir. Her boutique New York fund, Safkhet Capital Management, has had a quarter of its capital devoted to shorting Wirecard since last year. John Hempton of Bronte Capital in Australia has been betting against the company for about a decade. It has been a costly experience: In that time, its shares went from less than EUR7 each to nearly EUR200 each at their peak in 2018. They finished Friday at EUR25.82, down 75% over two days. It was painful also because Wirecard made an aggressive defense against the criticism. Some investors said they purposely kept their short bets below the threshold required for disclosure for years to avoid catching the company's attention. Matthew Earl, who runs a research and investment firm called ShadowFall Capital & Research in London, spent more than GBP100,000 ($123,000) on legal and other fees defending himself when the company pursued him over critical reports in 2016. Under the name of Zatarra Research & Investigations, Mr. Earl and a former partner, Fraser Perring, accused Wirecard of corruption, corporate fraud and lax money laundering controls in part related to illegal online gambling, allegations the company denied at the time. In December of 2016, Mr. Earl received letters from Wirecard's outside lawyers that accused him of defamation and malicious falsehood among other things. He noticed a car parked outside his home, which followed him to the train station on at least one occasion. In one of the letters, reviewed by The Wall Street Journal, Wirecard's lawyers, Jones Day, confirmed that \"private investigators undertook limited and lawful surveillance.\" They argued this was necessary to ensure he was available to receive an urgent letter and denied that it was \"disruptive, persistent or intimidatory.\" Jones Day declined to comment. Mr. Earl, who has had no bets on the company's shares since the Zatarra episode, and others, including Blue Ridge Capital, suffered cyberattacks, which they believed were connected to their Wirecard positions. The Citizen Lab, part of the Munk School of Global Affairs & Public Policy at the University of Toronto, found in a report this month that hackers engaged in sustained targeting of short sellers, journalists and investigators working on topics related to Wirecard. Mr. Earl was one of those targeted by a group based in India, according to the report. The company didn't respond to requests for comment on claims of hacking, surveillance or intimidation Friday. In an earlier statement on its website, it said: \"Wirecard AG has at no time been in direct or indirect contact with a hacker group from India.\" Complicating matters for the shorts, Wirecard found allies in Germany's financial regulator, BaFin. The government watchdog opened multiple investigations into potential market manipulation by Wirecard short sellers over the past decade, including against Mr. Earl. In 2019, after the Financial Times published a series of critical articles about Wirecard's accounting, the company sued the newspaper. BaFin then opened a probe against the lead writer. BaFin also took the unusual step of banning short selling against the company for a stretch after the Financial Times articles caused the stock price to drop. It was the only time Germany had banned short selling outside of a financial crisis and involving a single company. BaFin more recently took aim at Wirecard, launching an investigation this year into its executives over the timing of the release of insider information. Marc Cohodes, a veteran short seller who invests his own money, said Wirecard's aggressive defense inspired him to get involved at the beginning of 2019. \"It's not about the money,\" said Mr. Cohodes. \"This is all about principle.\" Write to Paul J. Davies at paul.davies@wsj.com and Juliet Chung at juliet.chung@wsj.com"}]}