{"article": [{"url": "https://www.marketwatch.com/story/rethinking-big-city-life-here-are-8-smaller-places-that-still-have-the-urban-perks-2020-06-25", "published": 1593272240.0, "headline": "Rethinking big city life? Here are 8 smaller places that still have the urban perks", "body": "Over the past few months, the COVID-19 pandemic has prompted many people to re-examine their living situations. Amid shutdowns, for instance, having easy access to open space — or a backyard at the very least — emerged as a new priority for many. Meanwhile, the economic turmoil accompanying the pandemic gave city-dwellers reason to question whether it’s really worth paying a premium to live in a big, crowded metropolis. A recent national survey by Ipsos found that 42% of people have either moved or thought about moving since March, and rural areas, small and midsize cities were their top choices. Becoming a suburbanite, or transitioning to small-town living, doesn’t mean you need to completely abandon life as an urbanite, though. Some of the country’s best small and midsize towns are within proximity of major metropolises. That means you can enjoy the wide open spaces and quaint downtowns, but still zip into the big city for amenities and attractions (when they reopen, of course) like pro sports, malls, museums and amusement parks. Ahead, eight awesome small cities that are close to big cities — so you can enjoy the best of both worlds.1. Castle Rock, Colorado (population, 64,827) Proximity to Denver: 30 miles A southern suburb of Denver, residents in Castle Rock enjoy wide open spaces (5,475 acres of it, to be exact) with the snow-capped Rocky Mountains serving up a glorious backdrop. Plus, the city sets itself apart with ultra unique amenities like “Challenge Hill,” an outdoor, 200-step incline (think: a stair stepper, but make it scenic), golf courses galore, horseback riding trails and a growing craft brewery scene. A straight shot north on I-25 takes you to Denver, where you’ll find restaurants captained by James Beard Award-winning chefs, more breweries, world-class museums, pro sports teams and funky dive bars dotting Colfax and Broadway.2. Ann Arbor, Mich. (population, 113,998) Proximity to Detroit: 45 miles Ann Arbor, Michigan iStock/Getty Images Small town charm collides with collegiate charisma in Ann Arbor. Here, the beloved Literati Bookstore bestows upon the community a public typewriter where customers can write anonymous letters and inspiring messages. Installed on some businesses and homes are tiny fairy doors — architectural doubles of human-sized doors — to serve as portals for the mythical creatures bringing magic and whimsy to Ann Arbor. Perusing the farmers markets, catching a festival or cheering on the Wolverines can easily fill up weekends in Ann Arbor, which you can rightfully call by its nickname, A-squared, once you live here. But in less than an hour, you can also be in downtown Detroit, enjoying an incredible arts scene and cultural gems like the Motown Museum and the General Motors Center for African American Art inside the Detroit Institute of Arts. Also read: With New York City offices still closed, companies consider downsizing—or heading for the suburbs For an architectural case study on the future of stadiums, pay a visit to Little Caesars Arena, where the Pistons and Red Wings play. The deconstructed layout allows for restaurants and retailers to be connected to the stadium, and remain open even when no games or concerts are scheduled.3. Santa Fe, N.M. (population 84,612) Proximity to Albuquerque: 65 miles Santa Fe, New Mexico AFP/Getty Images An artistic wonderland packed with art festivals, galleries and wildly inventive margaritas, Santa Fe has rightfully established itself as “The City Different.” Several time-honored traditions bring residents together here, including the Canyon Road Farolito Walk during Christmastime, Santa Fe Opera tailgating, and a consensus that green chile reigns supreme. But Santa Fe goes to bed pretty early, so if you’re looking for a night out on the town, slip away to downtown Albuquerque. Even better? A $10 train ticket can transport you between the two cities. With a population of 560,200, Albuquerque reigns as New Mexico’s biggest city. Old Town features dining and artisan shops, plus the city has a botanical garden, brewpubs in Nob Hill and a bona fide nightlife scene that keeps Central Ave. thrumming with youthful energy.4. Gettysburg, Penn. (population: 7,633) Proximity to Baltimore: 50 miles; proximity to Washington, D.C.: 80 miles; proximity to Philadelphia: 110 miles You’re already familiar with Gettysburg because of its historical significance and its famed landmarks like Gettysburg National Military Park. But there’s plenty of farm-to-table bounty here, with unpretentious and delicious eateries and cideries. A regional Pie Trail epitomizes small town living, right? But the beauty of Gettysburg is that depending on which way you venture, you can end up in some of the East Coast’s biggest cities. The historic city is within proximity of Washington, D.C., Baltimore and Philadelphia, so you’ll never run out of weekend getaways to experience big-city arts, culture and sports.5. Asheville, N.C. (population: 92,452) Proximity to Charlotte, N.C.: 120 miles Asheville, North Carolina. iStock Tucked in the Blue Ridge Mountains, Asheville excels when it comes to mountain town living. With a cool and laid-back persona, this North Carolina city is home to a highly regarded craft beer scene, plus there’s plenty of outdoor adventures (Hiking! Mountain biking! Whitewater rafting!). Residents here love dogs and have an appreciation for great food (nearby farms supply the bounty to restaurants). And as an added bonus, there’s very little traffic. Instead, jam out at one of the acclaimed live music venues. But when you’re craving a big city experience, Charlotte is 120 miles away and is bidding for attention. It’s home to the U.S. National Whitewater Center, a must-visit attraction for intrepid types to try out white-water courses on kayaks and rafts. Go on a self-guided barbecue tour, shop the 7th Street Public Market, and enjoy the nightlife. (We double-dare you to ride the mechanical bull at Dale Earnhardt Jr.’s Whisky River.)6. Hamilton, Ohio (population: 62,359) Proximity to Cincinnati: 17 miles; Proximity to Dayton: 32 miles Over the past few years, Hamilton has pumped $65 million into its downtown, and the revitalization efforts are bringing about a thriving arts and culture scene and market-rate apartments. Residents here can enjoy a variety of public art sculptures, the 300-acre Pyramid Hill Sculpture Park & Museum, and jazz and comedy performances at the Fitton Center for Creative Arts. Seasonal festivals like IceFest, where ice sculptors chisel works of art out of blocks of ice, bring the community together even in the doldrums of winter. Located within the Cincinnati-Dayton metroplex, it’s easy to zip between the two big cities, whether it’s for a work commute or to enjoy a day exploring the bigger cities’ attractions like the Cincinnati Zoo and Botanical Garden. See: 4 questions to ask before retiring to the suburbs7. Franklin, Tenn. Proximity to Nashville: 21 miles One visit to Franklin makes it easy to see why this small city outside of Nashville is growing fast. Franklin has all the charm of a historic Southern town, including a seriously picturesque Main Street and downtown, friendly people and fantastic restaurants cooking up Tennessee favorites from scratch. But it’s also home to headquarters of major corporations like Nissan NSANY, -1.50% and Mars Petcare, which means residents have access to career opportunities they’d usually only find in a much bigger city. Living here means being just a short drive from Nashville’s world-famous music venues, but don’t discount the creative scene in Franklin — you don’t have to leave city limits to see up-and-coming artists at open mic nights or international superstars at Pilgrimage, a two-day music festival that draws acts like Justin Timberlake and the Foo Fighters. Read: Americans are eyeing homes in the suburbs as pent-up demand hits housing market8. Hood River, Ore. (population: 7,806) Proximity to Portland, Ore.: 60 miles Postcard-perfect, Hood River sits on the front porch of the Columbia River Gorge and the Cascade Range. The 35-mile Hood River Fruit Loop packs a lot of charm per square mile, with snow-capped peaks, orchards, lavender fields, fruit stands and alpacas. Plus, it’s the windsurfing capital of the world if you’re looking to take up a new socially distanced-approved hobby. An hour’s drive along I-84 will get you to Portland, where there’s plenty of coffeehouses, breweries and museums to explore. And, until you’re comfortable flying again, there’s an acclaimed Japanese Garden to help satiate your wanderlust. These are the Top 100 Best Places to Live in America in 2019 Read the original article on Livability."}]}