{"article": [{"url": "https://www.marketwatch.com/story/us-jobless-claims-fall-to-131-million-in-early-july-2020-07-09", "published": 1594294160.0, "headline": "Jobless claims fall to four-month low of 1.31 million in early July, but layoffs still high", "body": "The numbers: The number of initial jobless claims fell by almost 100,000 in early July to a four-month low 1.31 million, but the pace of layoffs is still quite high and appears to be bogging down an economic recovery from the coronavirus pandemic. Initial jobless claims, a rough gauge of layoffs, dropped to 1.31 million in the seven days ended July 4 from a revised 1.41 million in the prior week, the Labor Department said Thursday. The figures are seasonally adjusted. Economists polled by MarketWatch had forecast 1.40 million new claims. These figures reflect applications filed the normal way through state unemployment offices. Hundreds of unemployed people wait in long lines to try to file applications for unemployment benefits. States have been overwhelmed by the huge numbers of people who’ve filed applications for compensation. Getty Images An additional 1.04 million people applied for benefits last week through a temporary federal-relief program, pushing the combined total for the week to 2.35 million. The number of people receiving traditional jobless benefits through the states, meanwhile, declined in the week ended June 27 to a three-month low of 18 million from 18.8 million. These are known as continuing claims. Yet if all eight state and federal assistance programs are included, continuing claims totaled an unadjusted 32.9 million in the seven days ended June 20, the most recent data available. That marks an increase from 31.5 million in the prior week. Read:Jobless claims tell us 32.9 million people are unemployed, but is it really that bad? MarketWatch is reporting select jobless claims data using actual, or unadjusted, figures to give a clearer picture of unemployment. The seasonally adjusted estimates typically expected by Wall Street have inflated jobless claims during the pandemic and become less accurate. What happened: New jobless claims were the highest in the states of California, Texas, New York, Florida and Georgia. California and New York are among a group of states that have been hit hardest by the coronavirus and that have struggled to process a deluge of new jobless claims. New reports from California suggest that up to 2 million claims are still outstanding. More than 50 million new claims have been filed since mid-March. Before the crisis the states processed fewer than 225,000 claims a week. The decline in the latest week may have been bigger than expected because of July 4. State employment offices were closed last Friday and some people may have waited until after the holiday to file claims. See: MarketWatch Economic Calendar Big picture: Pentup demand and the return of millions of workers to their jobs in May and early June gave a big jolt of adrenaline to the economy, but a renewed rise in coronavirus cases in some states may have robbed the recovery of its momentum. Many companies might have to close for good and some are deciding they won’t bring back all their workers because the demand simply isn’t there. Economists say Congress should extend emergency unemployment benefits that expire at the end of the July or the U.S. could suffer another setback. Yet some also say the extra $600 in temporary federal benefits probably needs to be reduced because many workers are getting more money from unemployment than they would have earned in their old jobs. That might be discouraging employees from returning to work and leaving jobless claims — and the unemployment rate — higher than it otherwise would be. What they are saying? “Filings remain high and are declining at a stubbornly slow pace. We could see upward pressure in coming weeks in response to a surge in virus cases and related closures of businesses,” said Rubeela Farooqi, chief U.S. economist at High Frequency Economics. “One should take claims for a holiday week with a grain of salt, but the drop is encouraging at face value,” said chief economist Scott Brown of Raymond James. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% fell sharply in Thursday trades on worries that the recovery is petering out."}]}