{"article": [{"url": "https://www.marketwatch.com/story/my-boyfriend-is-buying-a-house-and-does-not-wish-me-to-have-equity-im-moving-in-with-him-and-selling-my-home-what-should-i-do-with-the-proceeds-2020-07-20", "published": 1596367580.0, "headline": "My boyfriend is buying a house and does not want me to have equity. Iâ\u0080\u0099m moving in with him and selling my home â\u0080\u0094 what should I do with the proceeds?", "body": "Dear Moneyist, My boyfriend and I are planning on moving in together. We each have one child and are planning on one more together. There is a large income disparity (in his favor). He is purchasing the home, and does not wish for me to have equity in the house. I completely understand his reasons and have no desire to fight him on that. I will be selling my current home to move with him. The Moneyist: â\u0080\u0098Iâ\u0080\u0099m having a hard time understanding how earning over $200,000 a year is too much to qualify for a decent stimulus checkâ\u0080\u0099 What is the best way for me to contribute to our new life together, while also making sure that I have an investment for myself later should I need to purchase my own home, or something for my child(ren) to inherit after I am gone? I donâ\u0080\u0099t want to help pay the mortgage if Iâ\u0080\u0099m not receiving equity. Iâ\u0080\u0099m more than happy to pay for other things. With no home equity, I will not be building savings in that way. Does it make sense to take my current home profits after the sale and put it in a separate money making account for the future? We both love each other and are comfortable with this arrangement, I just want to be sure that I am also protecting myself just as he is, while also helping to contribute to our new household.Anonymous Dear Anonymous, You are asking the wrong question. Your letter stopped me in my tracks here: â\u0080\u009cI will be selling my current home to move with him.â\u0080\u009d Stop. Donâ\u0080\u0099t sell this home unless you absolutely have to, and I see no reason in your letter why you should sell to move in with a man who does not wish to buy a home together, especially given that you are planning to have children together. Itâ\u0080\u0099s a red flag. The Moneyist: I filed a joint tax return with my estranged wife because she is a gambler and her finances are a mess. But I got NO stimulus check â\u0080\u0094 what can I do? Iâ\u0080\u0099ll leave the relationship to you, but I urge you not to give up your financial independence and your home. If this relationship does not work out and you sell your home, you will be in a tricky situation and you will rue the day you ever sold it. If you do stay together, you and your children will be living in his home. Thatâ\u0080\u0099s not a good outcome for you or your child.Assuming you keep your home and have a tenant, itâ\u0080\u0099s fair for you to pay a set amount every month toward rent in your boyfriendâ\u0080\u0099s home, but if that feels weird or creates a low status/high status situation in your relationship, or doesnâ\u0080\u0099t feel right to you, listen to your gut. It will be your best guide on how to proceed. Donâ\u0080\u0099t move in if something feels wrong about this. The Moneyist: I didnâ\u0080\u0099t get my stimulus check because I owe back child support. Itâ\u0080\u0099s not fair. My stepchildren rely on me â\u0080\u0094 what can I do? You can email The Moneyist with any financial and ethical questions related to coronavirus at qfottrell@marketwatch.com. Want to read more?Follow Quentin Fottrell on Twitterand read more of his columns here.Would you like to sign up to an email alert when a new Moneyist column has been published? If so, click on this link.Hello there, MarketWatchers. Check out the Moneyist private Facebook FB, +0.26% Â group where we look for answers to lifeâ\u0080\u0099s thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}