{"article": [{"url": "https://www.marketwatch.com/story/freakish-siberian-heat-has-become-at-least-600-times-likelier-because-of-climate-change-2020-07-16", "published": 1594920920.0, "headline": "Freakish Siberian heat has become at least 600 times likelier because of climate change", "body": "Nearly impossible without manmade global warming, this year’s freak Siberian heat wave is producing climate change’s most flagrant footprint of extreme weather, a new flash study says. International scientists released a study Wednesday that found the greenhouse effect multiplied the chance of the region’s prolonged heat by at least 600 times, and maybe tens of thousands of times. In the study, which has not yet gone through peer review, the team looked at Siberia from January to June, including a day that hit 100 degrees (38 degrees Celsius) for a new Arctic record. Opinion:That 100-degree day in the Arctic underscores how this region is now warming twice as fast as Earth Plus:Siberian heat wave alarms scientists: ‘Arctic is figuratively and literally on fire’ “ Scientists from the U.K., Russia, France, the Netherlands, Germany and Switzerland concluded that without climate change the type of prolonged heat that hit Siberia this year would happen once in 80,000 years, making it ‘effectively impossible without human influence.’ ” Scientists from the United Kingdom, Russia, France, Netherlands, Germany and Switzerland used 70 climate models running thousands of complex simulations comparing current conditions to a world without manmade warming from the burning of coal, oil and gas. They found that without climate change the type of prolonged heat that hit Siberia would happen once in 80,000 years, “effectively impossible without human influence,” said study lead author Andrew Ciavarella, a scientist at the U.K. Met Office. This study, coordinated by World Weather Attribution, was done in two weeks and hasn’t yet been put through the microscope of peer review and published in a major scientific journal. But the researchers who specialize in these real-time studies to search for fingerprints of climate change in extreme events usually do get their work later published in a peer-reviewed journal and use methods that outside scientists say are standard and proven. World Weather Attribution’s past work has found some weather extremes were not triggered by climate change. But 2020’s Siberian heat wave stood out among the many studied, said attribution team co-lead Friederike Otto, acting director of Oxford University’s Environmental Change Institute. “Definitely from everything we have done it’s the strongest signal that we have seen,’’ Otto said. The team looked at both the average temperature in Siberia over the first six months of the year when temperatures averaged 9 degrees (5 degrees Celsius) above normal and the heat spike of 100 degrees occurred in the Russian town of Verkhoyansk in June. Both just really couldn’t happen in a world without the additional heat-trapping gases from burning fossil fuel, Ciavarella said. The scientists said the heat added to problems with widespread wildfires fires, pest outbreaks and the thawing of permafrost which led to a massive pipeline oil spill. Thawing permafrost also has the potential to release huge amounts of greenhouse gases trapped under the frozen ground, which could then worsen the warming, scientists said. “This event is really worrying,” said study co-author Olga Zolina, a climate scientist at the P.P. Shirshov Institute of Oceanology in Moscow. At least 10 outside scientists contacted by the Associated Press said this study was scientifically sound, using established and proper techniques. “They have, in an impressively short time, marshaled a lot of different datasets together which really give credence to their results,” said Danish Meteorological Institute climate scientist Ruth Mottram, who wasn’t part of the research. These types of studies allow people and world leaders to “connect the dots” between extreme weather events and climate change and prepare for them, said French climate scientist Valerie Masson-Delmotte, who wasn’t part of the research. “The climate of the future is very different as this paper shows,” said Pennsylvania State University meteorology professor David Titley, who wasn’t part of the research. “We can either adapt or suffer.” Read on:The Biden-Sanders climate-change policy pact: 8 key features"}]}