{"article": [{"url": "https://www.marketwatch.com/story/disney-world-guests-cant-eat-or-drink-while-walking-anymore-because-face-masks-2020-07-21", "published": 1595499680.0, "headline": "Walt Disney World tightens face mask policy after guests took advantage of loophole", "body": "Be our guest — with some exceptions. That seems to be Disney World’s pandemic motto, as the beloved theme park struggles to keep visitors safe and socially-distanced while still providing a fun and memorable experience after partially reopening on July 11. Some restaurants and attractions remain closed in the Walt Disney Co.’s DIS, +1.53% Orlando, Fla. resort, for example, and guests can’t hug and take selfies with the costumed characters like Mickey and Minnie Mouse anymore. Guests must also get their temperatures checked before entering the park, and face masks are required at all times — except when a guest is actively eating or drinking. Related:Will wearing a face mask protect you from COVID-19? It’s complicated. Here are the 5 biggest mask myths Problem is, that dining exception has created a mask loophole: Some guests were seen strolling the reopened Magic Kingdom and Animal Kingdom with their masks off while they sipped drinks and noshed pretzels. So the park has updated its mask policy to specify that guests shouldn’t walk and eat or drink at the same time. “You may remove your face covering while actively eating or drinking, but you should be stationary and maintain appropriate physical distancing,” the revised guidelines read. What’s more, an EPCOT cast member told Walt Disney World News Today that “guests are now being asked to find a safe spot six feet from other guests before removing their masks to eat and drink.” The stricter social distancing rules have been met with mixed reactions on Twitter TWTR, -0.23% and the Facebook-owned FB, +0.26% Instagram. Some critics complain that the safety and sanitary measures taken to prevent the spread of COVID-19 have sapped the joy from visiting the Happiest Place on Earth. Others argue that this is an example of personal rights being violated. “Dictating to customers that they cannot walk and eat or drink is absurd,” wrote one reader. “Are we now ‘Nazi Germany?’ Have all our freedoms been taken away?” “No character meet ups. No fireworks. No parades. Can’t walk and eat and drink,” tweeted another, who then asked what is “the point” of even going? iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Others applauded the move, such as a Tampa Bay Times reporter who has noticed guests using refreshments as an excuse to pull down their masks in neighboring Florida theme parks Busch Gardens and SeaWorld. “Disney is on to you folks who take their mask off to eat and drink,” she tweeted. iframe.twitter-tweet { width: 100% !important; } Some guests supporting the measure also said that the updated policy makes them feel safer, and also serves to better protect Disney park employees. iframe.twitter-tweet { width: 100% !important; } The new rule also resurfaced the debate over theme parks reopening at all, especially as coronavirus cases have continued to skyrocket in Florida. Disney World began welcoming back guests on July 11 — the same day that the state reported more than 15,000 new cases of COVID-19. CNN business editor Alexis Benveniste said at the time that it “feels like the beginning of a horror movie”. Meanwhile, Disneyland in Anaheim, Calif. postponed its July 17 reopening as coronavirus cases have spiked across its home state. Read more:‘The beginning of a horror movie’? Disney World slammed as doors reopen amid spiking coronavirus cases “Why are these parks open again?” asked one Twitter user after reading about the new eating and walking rule. Some potential guests also noted that the stricter mask guidelines have given them another reason to delay returning to the theme park until the pandemic is under control, and life returns to something resembling normalcy. iframe.twitter-tweet { width: 100% !important; } Disney heiress Abigail Disney, who does not have an operating role in the company, has also questioned the decision to reopen the park that shares her name. “I’m confused about how they think they can possibly protect their guests and their employees,” she said on CNBC’s “Squawk Box.” The number of confirmed COVID-19 cases in the U.S. rose above 3.8 million on Tuesday, with 54 states and territories showing rising case numbers over the past 14 days, according to a New York Times tracker. Shares of Disney have been down 17.9% this year to date compared to a 5.75% decline for the Dow Jones Industrial Average DJIA, +0.56% and a 1.02% gain for the S&P 500 Index SPX, +0.87%. Read more of MarketWatch’s coronavirus coverage here."}]}