{"article": [{"url": "https://www.marketwatch.com/story/yankees-national-kneel-in-black-lives-matter-salute-as-baseball-season-finally-starts-2020-07-23", "published": 1595543720.0, "headline": "Players kneel in Black Lives Matter salute as baseball season finally starts", "body": "WASHINGTON — The Nationals and Yankees knelt in unison before the first game of the baseball season as part of an opening day ceremony Thursday night that featured references to the Black Lives Matter movement, the coronavirus pandemic — including an off-the-mark first pitch by Dr. Anthony Fauci — and the home team’s 2019 championship. Players for the Giants and Dodgers, playing in the second game of the season Thursday night, knelt as well. iframe.twitter-tweet { width: 100% !important; } In Washington, players from both clubs wore T-shirts saying Black Lives Matter during batting practice at Nationals Park, and the letters “BLM” were stenciled into the back of the mound at the center of the diamond. In a poignant reference to the racial reckoning happening in the U.S., players and other members of both teams held a long black ribbon while standing spaced out along the two foul lines. After they placed the ribbon on the ground, everyone then got on their knees. iframe.twitter-tweet { width: 100% !important; } They all then rose for a taped performance of the national anthem. Hours later in Los Angeles, the Giants and Dodgers held a black ribbon that wound along the baselines in a show of unity after pregame introductions. Anthem singer Keith Williams Jr. stood in the new center field seating at Dodger Stadium to perform instead of the usual spot near home plate. Some of the Giants kneeled during the performance. In a video, 98-year-old Rachel Robinson, whose husband, Jackie, broke the major league color barrier in 1947, gave the traditional call: “It’s time for Dodger baseball.” Yankees players decided Wednesday they wanted to kneel for 60 seconds before the anthem. New York officials then asked Washington if that time could be added to the pregame script. The Nationals decided they wanted to join the Yankees. “We’ve had conversations as an organization. We’ve had conversations as a team. We’ve had smaller group conversations. Conversations with one another,” New York manager Aaron Boone said hours before the game. “And we’ve kind of decided ... we’ll, as a team, have our own demonstration on the field.” That display followed a series of videos shown on the outfield scoreboard: about Black Lives Matter, showing major league players such as New York’s Aaron Judge and Washington’s Howie Kendrick; about the Nationals’ postseason run; about the COVID-19 outbreak. Without any spectators present to appreciate the celebrations, flags noting the franchise’s first title were raised beyond right field and above the scoreboard, and “2019 World Champions” was written on a red mat that was wrapped around the batter’s boxes during pregame introductions. Fauci, the country’s top infectious disease expert, was invited by the Nationals to throw out the ceremonial first pitch -- a fitting choice during the current medical crisis. Wearing a mask on the mound, Fauci sent his toss well wide of home plate, and the ball bounced past his “catcher,” Washington reliever Sean Doolittle. Afterward, Fauci and Doolittle tapped gloves, instead of shaking hands. Judge got the first hit of the season and moments later teammate Giancarlo Stanton tagged Washington ace Max Scherzer for the first home run of the season. In the bottom of the first inning, Adam Eaton homered off prized Yankees newcomer Gerrit Cole. The game went into a rain delay in the sixth inning with the Yankees batting while leading 4-1."}]}