{"article": [{"url": "https://www.marketwatch.com/story/who-chief-warns-against-politicizing-the-coronavirus-pandemic-2020-06-22", "published": 1592820980.0, "headline": "WHO chief warns leaders against â\u0080\u0098politicizingâ\u0080\u0099 the coronavirus pandemic", "body": "DUBAI, United Arab Emirates (AP) â\u0080\u0094 World leaders must not politicize the coronavirus pandemic but unite to fight it, the head of the World Health Organization warned Monday, reminding all that the pandemic is still accelerating and producing record daily increases in infections. The comments by Tedros Adhanom Ghebreyesus, who has faced criticism from U.S. President Donald Trump, comes as the number of reported infections soared in Brazil, Iraq, India and southern and western U.S. states, straining local hospitals. In New York City, once the epicenter of the U.S. outbreak, Monday was a key day for lifting many coronavirus lockdown restrictions. It took over three months for the world to see 1 million virus infections, but the last 1 million cases have come in just eight days, Tedros said during a videoconference for the Dubai-based World Government Summit. Tedros never mentioned Trumpâ\u0080\u0099s name or the fact that he is determined to pull the United States out of the U.N. health agency but warned against â\u0080\u009cpoliticizingâ\u0080\u009d the pandemic. â\u0080\u009cThe greatest threat we face now is not the virus itself, itâ\u0080\u0099s the lack of global solidarity and global leadership,â\u0080\u009d he said. â\u0080\u009cWe cannot defeat this pandemic with a divided world.â\u0080\u009d Trump has criticized the WHO for its early response to the outbreak and what he considers its excessive praise of China, where the outbreak began, as his administrationâ\u0080\u0099s response in the U.S. has come under scrutiny. In response, Trump has threatened to end all U.S. funding for the WHO. Nearly 9 million people have been infected by the virus worldwide and more than 468,000 have died, according to figures compiled by Johns Hopkins University. Experts say the actual numbers are much higher, due to limited testing and asymptomatic cases. â\u0080\u009cThe COVID-19 pandemic has demonstrated that, indeed, the world was not prepared,â\u0080\u009d Tedros said. â\u0080\u009cGlobally, the pandemic is still accelerating.â\u0080\u009d Companies around the world are racing to find a vaccine to counter COVID-19 and there is a fierce debate about how to make sure that vaccine is distributed fairly. Speaking later in the conference, WHOâ\u0080\u0099s special envoy on COVID-19, Dr. David Nabarro, said he believed it would be â\u0080\u009c2 1/2 years until there will be vaccine for everybody in the world.â\u0080\u009d â\u0080\u009cEven if thereâ\u0080\u0099s a candidate by the end of the year, the safety and efficacy tests will take some time,â\u0080\u009d the British physician said. â\u0080\u009cAnd then the effort has to be put into producing large amounts of vaccine so everyone in the world can get it and then organizing the vaccination programs.â\u0080\u009d He added: â\u0080\u009cI would love it to be proved wrong.â\u0080\u009d Indiaâ\u0080\u0099s health care system has been slammed by the virus. The countryâ\u0080\u0099s caseload climbed by nearly 15,000 Monday to 425,282, with more than 13,000 deaths. After easing a nationwide lockdown, the Indian government ran special trains to return thousands of migrant workers to their villages in recent weeks. Nearly 90% of Indiaâ\u0080\u0099s poorest districts have cases, although the outbreak remains centered in Delhi, Maharashtra and Tamil Nadu states, which are home to major cities. In Pakistan, infections are accelerating and hospitals are having to turn away patients, with new cases up to 6,800 a day in mid-June. The government has relaxed pandemic restrictions, hoping to salvage a near-collapsed economy as the number of people living in poverty has risen to 40%, up from 30% of the population of 220 million people. In Iraq, masked workers were setting up makeshift coronavirus wards in Baghdadâ\u0080\u0099s vast exhibition grounds as a long-dreaded spike in infections strained its overstretched hospitals, battered by years of conflict and poor infrastructure. More than two-thirds of the new deaths of late have been reported in the Americas. The coronavirus has killed about 120,000 people across the U.S., over 50,000 in Brazil and nearly 22,000 in Mexico. U.S. authorities have reported more than 30,000 new infections a day in the last few days. Infections have slowed in China and South Korea, suggesting some progress in stemming their newest outbreaks. South Korea reported 17 new cases, the first time its daily increase fell to under 20 in nearly a month and Beijingâ\u0080\u0099s increase was in single digits for the first time in eight days. The U.N. AIDS agency, meanwhile, warned that the pandemic could jeopardize the supply of AIDS drugs in developing countries and lead to deadly shortages. UNAIDS said lockdowns and border closures adopted to stop the spread of COVID-19 were affecting both the production and distribution of the medicines, which could result in higher costs and shortages in the next two months. As of June 2019, UNAIDS estimated more than 24 million people were on life-saving anti-retroviral drugs. â\u0080\u009cI call on countries and buyers of HIV medicines to act swiftly in order to ensure everyone who is currently on treatment continues to be on it,â\u0080\u009d said Winnie Byanyima, executive director of UNAIDS in a statement."}]}