{"article": [{"url": "https://www.marketwatch.com/story/giving-away-money-well-is-very-hard-the-giving-pledge-turns-10-and-its-signers-are-richer-than-ever-2020-08-08", "published": 1597064240.0, "headline": "The Giving Pledge turns 10: These billionaires pledged to give away half their wealth, but they soon ran into a problem", "body": "The Giving Pledge was heralded as a worthy goal when it was announced 10 years ago this week, but those good intentions have been outmatched by a mighty foe: the breakneck pace of wealth creation. Though they’ve promised to shed at least half of their wealth for the common good, many of the billionaires who have signed the Giving Pledge are richer than ever, the Institute for Policy Studies said; it added that, “while some pledgers earnestly intend to fulfill their promises, many are unable to because their assets are simply growing too fast.” The list of pledgers includes well-known business figures such as Tesla TSLA, +1.89% co-founder Elon Musk, Virgin SPCE, -3.12% Group founder Richard Branson, hedge fund manager Ray Dalio, Netflix NFLX, +1.43% CEO Reed Hastings and former Citigroup CITI, +1.05% CEO Sanford Weill. “ ‘Instead of supporting charities on the front lines of problem solving, these billions end up sitting in tax-advantaged intermediaries.’ ” — Chuck Collins, co-author of ‘Gilded Giving 2020: How Wealth Inequality Distorts Philanthropy and Imperils Democracy’ But they soon ran into a problem. Their giving can’t keep up with their escalating fortunes. The combined wealth of the 62 living U.S. pledgers who were billionaires in 2010 has increased by 95%, from $376 billion in 2010 to $734 billion as of July 18, 2020, according to “Gilded Giving 2020,” a report from the Institute for Policy Studies, a left-leaning think tank. If these pledgers want to make good on their promises, they’ll have to “dramatically accelerate their giving just to keep up with their asset growth,” the report added. One notable exception to the list of Giving Pledge signers: the world’s richest individual, Jeff Bezos, whose current net worth is roughly $189 billion. He and his ex-wife launched a $2 billion philanthropic venture called Day One Fund in 2018 to address homeless and preschool education for low-income children. Earlier this year, Bezos pledged $10 billion to address climate change. (Amazon did not respond to a request for comment.) Berkshire Hathaway BRK.A, +0.06% CEO Warren Buffett and Microsoft MSFT, +2.48% co-founder Bill Gates and his wife Melinda Gates announced the Giving Pledge in August 2010. People who sign the Giving Pledge promise publicly to give away at least half their wealth, either during their lifetimes or in their wills. “It’s kind of the best of capitalism,” Bill Gates said in the first TV interview about the Giving Pledge, saying that people who had made a lot of money could then use their wealth to “create good circumstances for other people.’” A decade later, 11 of the 62 living signers who were billionaires in 2010 have seen their wealth decline because of “aggressive” charitable giving or market changes, the Institute for Policy Studies found. But the other 51 are earning money so fast they’re having a hard time giving it away, the report found. “The Giving Pledge is a textbook case of top-heavy philanthropy in action,” it added. “What was intended to be a civic-minded initiative to encourage generosity is, instead, continuing the concentration of taxpayer-subsidized private charitable power.”Some argue that taxpayers lose out Charitable giving is partly subsidized by taxpayers, and the Institute for Policy Studies argues that for every dollar a billionaire gives to charity, “the rest of us chip in as much as 74 cents to make up for the lost revenue.” The organization has advocated for reforming charity laws to prevent money from being “sequestered” in private foundations and donor-advised funds. “Donors should only receive a tax reduction if funds are deployed to serve the public interest in a timely way,” according to its “Gilded Giving” report. Warren Buffett, who has called for higher taxes for the wealthy, recently said that he received “only minor benefits” from tax deductions related to his philanthropy — his combined federal and state income taxes were reduced by about 43 cents for every $1,000 of value he’s donated in the form of Berkshire Hathaway Class B shares, he said. Buffett dropped to eighth place on the Bloomberg Billionaires Index after a $2.9 billion stock donation in July. But others say the Giving Pledge represents an extraordinary achievement. “The Giving Pledge was an historic moment in the history of philanthropy because it created a new kind of public accountability for generosity, at least in theory,” said Jacob Harold, executive vice president of Candid, an organization that provides information on nonprofits and foundations. “That said, billionaires are made possible by inequality and we as a society are wrestling with that right now. I would argue that if billionaires exist, I’m glad they’re giving their money away and I’m glad there’s a mechanism to organize that.” Since it was first launched, 210 people from 23 countries have signed the Giving Pledge. “The Giving Pledge is a multi-generational effort to help shift the social norms of philanthropy among the world’s wealthiest people and inspire people to give more, establish their giving plans sooner, and give in effective and impactful ways,” said Robert Rosen, director of Philanthropic Partnerships at the Bill & Melinda Gates Foundation, speaking on behalf of the Giving Pledge. He added that the signers “are solidifying a new standard of generosity for billionaires — that they have a moral obligation to commit to giving the majority of their wealth to philanthropy to address society’s most pressing needs.”‘Giving away money well is very hard’ Some Giving Pledgers may appear to be giving away their money slower than critics would like because spending money for the common good is more difficult than it looks, two experts told MarketWatch. “Giving away money well is very hard,” said Avery Fontaine, head of Strategic Philanthropy for BNY Mellon Wealth Management. “It seems like the greatest job in the world. It’s incredibly stressful.” She added, “That sounds like an ‘Oh, poor me,’ type thing to say for any wealthy person,” but Fontaine noted that many donors feel personally responsible for the success or failure of the endeavors they fund. “ ‘The intelligent distribution of money for good can be a more challenging exercise than making money in the first place.’ ” — Jacob Harold, executive vice president of Candid, an organization that provides information on nonprofits and foundation Because “mega-donors” have such high visibility — especially in the age of Twitter TWTR, -0.23% and Facebook FB, +0.26% — many wealthy families try to do their giving as anonymously as possible. One way to stay private is to donate to a donor-advised fund, a giving vehicle that’s been criticized for its lack of transparency. “It’s not that they’re up to anything, they just want the opportunity to fail and learn and grow without a lot of scrutiny,” Fontaine said. Jacob Harold of Candid made a similar observation. “The intelligent distribution of money for good can be a more challenging exercise than making money in the first place, and I think that’s why a lot of givers have not ramped up their giving,” he said. The recent $1.7 billion gift from MacKenzie Scott — ex-wife of Amazon AMZN, +3.01% founder and CEO Jeff Bezos — to 116 nonprofits offered a “very interesting solution to this puzzle,” he said. Others could learn from Scott’s example of giving out a large amount of money relatively quickly and making the donations “unrestricted,” meaning that the nonprofits who got the money can use the funds however they see fit. “That is a gesture of trust and humility,” Harold said.Where has the Giving Pledge money gone? Each Giving Pledge signer writes a public letter explaining their motivations for signing the pledge, but beyond that, there’s no official accounting of where pledgers donate their money, or running tally of how much pledgers have donated. They give to a wide variety of causes: the Bill & Melinda Gates Foundation has focused on global health problems like malaria and HIV and education in the U.S.; Salesforce CRM, +2.21% CEO Marc Benioff and his wife Lynne have given to help solve homelessness and to children’s hospitals; Coinbase CEO Brian Armstrong started an effort to give direct payments in the form of cryptocurrency to people living in poverty. Critics like the Institute for Policy Studies argue that many Giving Pledge signers make their donations to their own private family foundations or to donor-advised funds (DAFs), which means they get a tax break, but that the money may not trickle down quickly to on-the-ground charities. (DAFs are accounts where people can put money they intend to give to charity. Donors get an immediate tax deduction, but can decide later which nonprofits get the money.) “ Michael Bloomberg’s $1.8 billion gift to Johns Hopkins University to provide financial aid and eliminate the need for student loans is among one of ‘game changing’ donations ” — Una Osili, associate dean for research and international programs at Indiana University’s Lilly Family School of Philanthropy “Instead of supporting charities on the front lines of problem solving, these billions end up sitting in tax-advantaged intermediaries,” Chuck Collins, director the Program on Inequality and co-author of the report “Gilded Giving 2020: How Wealth Inequality Distorts Philanthropy and Imperils Democracy,” wrote in a recent opinion piece. Another criticism that’s been leveled against Giving Pledgers is that their gifts have gone to “more traditional causes” like education and health, said Una Osili, associate dean for research and international programs at Indiana University’s Lilly Family School of Philanthropy. “But if you dig a little deeper, you’ll see that that may be too simplistic,” Osili told MarketWatch. Some pledgers have made “game-changing” donations, she noted, pointing to Michael Bloomberg’s $1.8 billion gift to Johns Hopkins University to provide financial aid and eliminate the need for student loans, and recent efforts on COVID-19 testing by the Chan-Zuckerberg Initiative, the charitable organization founded by Facebook FB, +0.26% CEO Mark Zuckerberg and his wife Priscilla Chan. (CZI did not respond to a request for comment.) Bloomberg — whose net worth is currently estimated at $54.9 billion — has given $8.65 billion through Bloomberg Philanthropies since signing the Giving Pledge in 2010. “Mike’s lifetime giving to date is over $10 billion — and his giving has increased every year of his life,” said Bloomberg Philanthropies spokeswoman Rachel Nagler. Bloomberg has said he plans to give away the vast majority of his wealth in his lifetime, she added. “His joke has always been that he plans to ‘bounce the check to the undertaker,’” Nagler said."}]}