{"article": [{"url": "https://www.marketwatch.com/story/fauci-has-harsh-words-for-the-american-public-and-lawmakers-as-covid-19-surges-in-florida-california-and-texas-2020-06-30", "published": 1594228160.0, "headline": "'Now we're seeing the consequence of community spread': Fauci says Americans must do 3 things to beat COVID-19", "body": "Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases for three decades and one of the leading experts on pandemics in the U.S. for the last four decades, dished out some harsh words to both the U.S. public and federal authorities. He said SARS-CoV-2, the name for the virus that causes COVID-19, will continue to spread unless everyone ups their game. On Tuesday, in an interview livestreamed on Twitter TWTR, -0.23% and Facebook FB, +0.26%  with the head of the National Institutes of Health, Francis Collins, Fauci said that unlike Europe, U.S. communities \"never came down to baseline and now are surging back up\" and \"we're still knee-deep in the first wave.\" Fauci previously said the virus may be mutating to become more transmissible, and focused on three main failings by both the public and authorities: Many states have reopened too quickly, people are not abiding by rules of social distancing, and the authorities could do a better job at contact tracing to track people who've been in contact with those who test positive. “ 'We do need to open up again, no doubt about it, we want to get the economy back, but you've got to do it in a measured way, and now we're seeing the consequence of community spread, which is even more difficult to contain.' ” - Anthony Fauci, National Institute of Allergy and Infectious Diseases \"What we saw were a lot of people who maybe felt that because they think they are invulnerable, and we know many young people are not because they're getting [this] serious disease; therefore they're getting infected has nothing at all to do with anyone else when, in fact, it does,\" Fauci told lawmakers in D.C. last week. The main reason: Those who don't social distance are putting more senior Americans at risk. \"For COVID-19, the elderly have been overwhelmingly the worst hit,\" according to an analysis by Deutsche Bank. \"For the Spanish flu of 1918, the young working-age population were severely affected too. In fact, the death rate from pneumonia and influenza that year among 25-34-year-olds in the United States was more than 50% higher than that for 65-74-year-olds. A remarkable difference to COVID-19.\" Francis Yared, the global head of rates research at Deutsche Bank DB, -0.85%, said the overall mortality rate measured by weekly new deaths and weekly new cases is around one-third of the level observed in the second half of April. \"So we have an interesting situation at the moment, where rapidly rising cases in the U.S. are slowing reopenings (negative) but the death rate is falling (positive). This may eventually give us more faith that we are now better at living with the virus,\" Deutsche Bank said. COVID-19, the disease caused by the virus SARS-CoV-2, had infected 11.9 million people globally and over 3 million in the U.S. as of Wednesday, according to official figures collated by Johns Hopkins University's Center for Systems Science and Engineering. The disease had claimed at least 545,980 lives worldwide and 131,960 in the U.S. While COVID-19's progress has slowed in New York, where most cases in the U.S. are still centered, confirmed coronavirus cases have recently risen in nearly 40 U.S. states. New cases are up 51% in the Virgin Islands, 41% in Florida over the past week, 34% in Idaho, 35% in Montana, 34% in Arizona, and was up 25% in Texas, and 19% in California, according to this tally by the Washington Post. Thus far, New York has had the most deaths from COVID-19 in the U.S. (32,251), followed by New Jersey (15,332), Massachusetts (8,243), Illinois (7,309), Pennsylvania (6,812), California (6,577) and Michigan (6,262). Texas has reported 2,796 deaths. The Dow Jones Industrial Index DJIA, +0.56%  and the S&P 500 SPX, +0.87%  ended higher Wednesday amid a surge of coronavirus in states that have loosened restrictions. \"What has happened, I guess understandably, but nonetheless regrettably, is that people took the attitude in some places of either 'all or none,'\" Fauci told CNN in an another one-on-one interview. \"Either you're locked down, or you just let it fly, and you just ignore many of the guidelines of physical distancing.\" \"That's a recipe for disaster,\" Fauci told the cable network. Fauci said America needs to balance the needs of the nation's economic and public health. \"We do need to open up again, no doubt about it, we want to get the economy back, but you've got to do it in a measured way, and now we're seeing the consequence of community spread.\" Also see:Florida records 10,000 new coronavirus cases - the largest daily surge since the pandemic began Community spread, Fauci added, is insidious. \"It makes it extremely problematic to do efficient contact tracing, because most of the people who are infected don't even know they're infected. So how do you do contact tracing when someone doesn't have any symptoms?\" Fauci said the U.S. government has not been doing well with contact tracing, the process of tracing people who have been in contact with someone who has the virus, and instructing them to stay home for 14 days. \"I don't think we're doing very well, for a number of reasons, and not all of which is the fault of the system.\" said Elizabeth Cohen, who interviewed Fauci for CNN T, -1.01% The public also needs to be more cooperative, he said. Some people close to the border are reluctant to give names to authorities to trace, while other names that are given to health authorities \"are lost in the shuffle. That's a very, very difficult situation. That we've got to do better on.\" In states where coronavirus spread is surging, like Arizona, Texas, Florida and California, he said, \"20% to 40% of the people who are infected don't have any symptoms, so the standard, classic paradigm of identification, isolation, contact tracing doesn't work no matter how good you are.\" “ 'Twenty percent to 40% of the people who are infected don't have any symptoms, so the standard, classic paradigm of identification, isolation, contact tracing doesn't work no matter how good you are, because you don't know who you're tracing.' ” - Anthony Fauci, National Institute of Allergy and Infectious Diseases Fauci previously said that was the single biggest threat and surprise about COVID-19. \"I've been dealing with viral outbreaks for the last 40 years. I've never seen a single virus - that is, one pathogen - have a range where 20% to 40% of the people have no symptoms,\" he said last week during a House Committee on Energy and Commerce hearing on the Trump administration's response to the novel coronavirus pandemic. The coronavirus pandemic is \"not even close to being over,\" according to the head of the World Health Organization, and the worst is still to come, in what was a grim assessment of the state of affairs some six months after the first cases were reported in China. \"Six months ago, none of us could have imagined how our world - and our lives - would be thrown into turmoil by this new virus,\" Tedros Adhanom Ghebreyesus told reporters at a news briefing last week. \"The pandemic has brought out the best and the worst of humanity.\" Tedros said WHO is sending a team to Wuhan, China next week to work on the virus's origins. The WHO currently estimates that 16% of people with COVID-19 are asymptomatic and can transmit the coronavirus, while other data show that 40% of coronavirus transmission is due to carriers not displaying symptoms of the illness. As a result, public health officials have advised people to keep a distance of 6 feet from one another. A recent University of California, San Francisco, study found that there's a high load of SARS-CoV-2 shedding in the upper respiratory tract, even among pre-symptomatic patients, \"which distinguishes it from SARS-CoV-1, where replication occurs mainly in the lower respiratory tract.\" Such a viral load makes symptom-based detection of infection less effective in the case of SARS CoV-2, it said. After two months of obfuscation over the efficacy of face masks, during which New York City became the epicenter of the pandemic in the U.S., and one month after the WHO declared the COVID-19 outbreak a pandemic, U.S. federal authorities said all Americans should, after all, wear face coverings in public settings. Fauci has said he was hopeful that a coronavirus vaccine could be developed by early 2021, but said it's unlikely that a vaccine will deliver 100% immunity; he said the best realistic outcome, based on other vaccines, would be 70% to 75% effective. The measles vaccine, he said, is among the most effective by providing 97% immunity. (This story was updated on July 8.) How COVID-19 is transmitted"}]}