{"article": [{"url": "https://www.marketwatch.com/story/rents-are-softening-nationwide-but-heres-where-they-are-falling-the-most-2020-06-27", "published": 1593429740.0, "headline": "Rents are softening nationwide â\u0080\u0094 but hereâ\u0080\u0099s where they are falling the most", "body": "With record numbers of Americans out of work because of the coronavirus pandemic, rents are decreasing in many parts of the country. Apartment List, an rental listing platform, reported last week that its national rent index fell by 0.1% between May and June. Moreover, the index has fallen 0.3% since March, when the number of COVID-19 cases began ramping up in the U.S. Over the past year, rents are up only 0.2%, even those this is the time of year when rent appreciation heats up. â\u0080\u009cThis is by far is by far the lowest year-over-year growth rate that weâ\u0080\u0099ve observed in June over any of the past five years,â\u0080\u009d Chris Salviati, housing economist at Apartment List, wrote in the report. â\u0080\u009cThe fact that weâ\u0080\u0099re seeing rents decrease at what is normally the peak season for rental activity is reflective of the financial hardship and shifting preferences being imposed by the pandemic,â\u0080\u009d Salviati said. Also see:Home prices continued to rise even as the coronavirus pandemic swept across America, FHFA says In some parts of the country, the decrease in rents is happening at a much faster pace. Two cities, San Francisco and Orlando, Fla., lead the country in terms of rent declines. Rents in both cities have fallen 2.2% since March. The two cities are emblematic of the parts of the country where rents are falling most quickly. In expensive markets like San Francisco, high rents were already a burden for residents, and that burden has only grown as a result of the pandemic-fueled loss of income. Other cities where this is true include New York, which has had the third largest decline in rent since March with a 1.8% drop, and San Jose, Calif., where rents have dwindled 1.7%. “ â\u0080\u0098The fact that weâ\u0080\u0099re seeing rents decrease at what is normally the peak season for rental activity is reflective of the financial hardship and shifting preferences being imposed by the pandemic.â\u0080\u0099 ” â\u0080\u0094 Chris Salviati, housing economist at Apartment List â\u0080\u009cAs layoffs expand beyond the service industry and into white collar occupations, landlords in these markets appear to be responding to a lack of demand for high-priced rentals,â\u0080\u009d Salviati wrote. The other category of real-estate market where rents have dropped are mid-size cities where the local economy relies on the tourism and the service industry. These sectors of the economies were among the hardest hit by the stay-at-home orders imposed to slow the spread of the coronavirus. Beyond Orlando, cities that typify this trend include Miami, where rents are down 1.7%, Houston (down 1.2%) and Tampa, Fla. (down 1.1%). Whether these rent declines will continue depends on a number of factors. Many Americans have signaled an interest in moving to the suburbs, where they can have more space, because of the coronavirus. That could put downward pressure on rents in downtown areas, but lead to an increase in rent for homes in the suburbs. Read more:Mortgage rates keep falling to record lows â\u0080\u0094 so is now a good time to refinance? And separate research from Apartment List has shown that many Americans are nervous about moving in the midst of the pandemic. They found 30% of people say they are less likely to move in 2020 because of COVID-19. But 17% of renters said the pandemic has made them more likely to move because of the need for greater affordability. With a shortage of affordable units nationwide, competition for these could grow in the months to come, while the luxury end of the industry languishes. â\u0080\u009cThere are indications that the recovery will be more drawn out than many had initially hoped, making it likely that weâ\u0080\u0099ll see a protracted uptick in downgrade moves as many households facing financial hardship begin looking for more affordable housing,â\u0080\u009d Salviati wrote."}]}