{"article": [{"url": "https://www.marketwatch.com/story/with-the-big-stock-market-gains-over-its-time-for-some-unusual-coupon-clipping-hsbc-strategist-says-11602238792", "published": 1602232340.0, "headline": "With the big stock-market gains over, itâ\u0080\u0099s time for some unusual â\u0080\u0098coupon clipping,â\u0080\u0099 HSBC strategist says", "body": "HSBC Global Asset Management strategist Joseph Little calls for coupon clipping, with stock markets in a rangebound environment. AFP via Getty Images Stock markets arenâ\u0080\u0099t really out of line in any direction, to hear one strategist tell it. â\u0080\u009cWe havenâ\u0080\u0099t got a big qualm with the market at this point in time. I donâ\u0080\u0099t see really significant, anomalous valuations in the market, and that takes me to this idea of staying invested, being diversified, but not being too tactically adventurous,â\u0080\u009d said Joseph Little, global chief strategist at HSBC Global Asset Management. Little added the Nasdaq Composite COMP, +1.39% isnâ\u0080\u0099t as stretched as it was during the dot-com bubble. HSBC is overweight global stocks, particularly for Northern Asian emerging markets that are leveraged to Chinaâ\u0080\u0099s recovery. Little isnâ\u0080\u0099t a proponent of the argument, however, to switch now into cyclical stocks from the defensive companies that have outperformed. â\u0080\u009cI think you need to have a bit more confidence in a macro momentum story, of upgrades to investor expectations about growth. Iâ\u0080\u0099m not sure I have that confidence at the moment,â\u0080\u009d he said. The global economy, he said, is entering a slower phase after the rapid recovery since the initial lockdowns. The economy will be operating somewhere between 5% to 10% below its pre-pandemic level for the next six to 12 months. He called the situation, with rangebound markets, â\u0080\u009ca coupon-clipping environment.â\u0080\u009d HSBC is recommending using alternatives to government bonds, such as inflation-linked securities or gold GCZ20, +2.17%, for the safer parts of a portfolio. The downturn in U.S. stocks in September was tricky, because the traditional hedges, and even some of the more unusual ones like bitcoin BTCUSD, +3.14%, havenâ\u0080\u0099t really delivered, he said. â\u0080\u009cThis learned response of relying on govvies as the ultimate hedging instrument for equity portfolios is perhaps not right,â\u0080\u009d Little said. A â\u0080\u009cprotective put strategy â\u0080\u0094 being long the equity market and having put protection â\u0080\u0094 has been outperforming a 60/40 portfolio during the course of this year â\u0080\u0094 even when volatility VIX, -5.15% is very high, and put protection is expensive,â\u0080\u009d he said. A 60/40 portfolio is one 60% invested in stocks and 40% invested in safer securities like government bonds. Read more on the debate over 60/40 portfolios. Investors may want to consider more exotic parts of the fixed income space, such as high-yield Asian corporate debt, or Chinese government bonds, he said. â\u0080\u009cI donâ\u0080\u0099t think thereâ\u0080\u0099s a silver bullet around what can be the diversifier of choice for multiasset investors,â\u0080\u009d Little said. But with monetary policy â\u0080\u009con steroids,â\u0080\u009d as he said, â\u0080\u009cthese classic risk-free asset classes are behaving a little bit differently in practice.â\u0080\u009d The buzz All eyes on the stimulus talks. A spokesman for House Speaker Nancy Pelosi says Treasury Secretary Steven Mnuchin told her that the Trump administration would agree to a comprehensive stimulus deal, though the two sides arenâ\u0080\u0099t close on what that would be. iframe.twitter-tweet { width: 100% !important; } Pelosi separately said she is creating a commission to review the presidentâ\u0080\u0099s health and fitness for office, a development that Trump said shows the speaker is â\u0080\u009ccrazy.â\u0080\u009d Vice President Mike Pence and the cabinet have the power to remove Trump, under the 25th Amendment to the U.S. Constitution. Gilead Sciences GILD, +0.82% said late on Thursday that a late-stage study of its experimental COVID-19 treatment showed it shortened time to recovery. The company said a study of remdesivir, which goes by the trade name Veklury, plus standard care shortened the time of recovery by an average four days. Advanced Micro Devices AMD, -3.94% is in advanced talks to buy rival chip maker Xilinx XLNX, +14.10% for more than $30 billion, according to The Wall Street Journal, news that sent Xilinx shares up 16% in premarket trade. Also in the chip space, NXP Semiconductors NXPI, +4.96% boosted its outlook, citing demand from the automotive and mobile industry. HCA Healthcare HCA, +1.61% rose in premarket trade after the hospital operator said it would return $6 billion in government assistance, as it also reported a 15% rise in third-quarter same facility revenue per equivalent admission. The United Nations World Food Program won the Nobel Peace Prize for efforts to reduce world hunger. The market The march upward continues. After the S&P 500 SPX, +0.87% ended higher Thursday for the eighth time in 11 sessions, U.S. stock futures YM00, +0.82% NQ00, +1.63% pointed to a further advance. Crude-oil CL.1, -1.62% futures slipped, while gold rose above $1,900 per ounce. The chart iframe.twitter-tweet { width: 100% !important; } Jeffrey Kleintop, chief global investment strategist at Charles Schwab, highlights this chart showing money flowing out of the stock market ahead of the U.S. presidential election, as it has the last three presidential cycles. As Kleintop notes in his tweet, however, flows of late havenâ\u0080\u0099t been particularly correlated with performance. The tweet A baked bean smoothie? The replies to this tweet showed customers arenâ\u0080\u0099t convinced. iframe.twitter-tweet { width: 100% !important; } Random reads Tom Brady may be the greatest quarterback of all time, but he again stormed off the field after losing to Nick Foles. NASA is planning a heist â\u0080\u0094 of an asteroid. Need to Know starts early and is updated until the opening bell, butÂ sign up hereÂ to get it delivered once to your email box. The emailed version will be sent out at about 7:30 a.m. Eastern."}]}