{"article": [{"url": "https://www.marketwatch.com/story/clashing-with-democrats-republicans-want-to-raise-standard-of-proof-on-covid-related-lawsuits-against-companies-2020-07-31", "published": 1596368780.0, "headline": "", "body": "Republican leaders are making added liability protections for businesses, schools and health-care providers a key plank of their $1 trillion proposal for another coronavirus relief bill. Now it’s a question of whether that shield turns into a stumbling block during negotiations with Democrats. The Republicans’ HEALS Act would authorize a new round of direct checks, 70% wage replacement in supplemental unemployment benefits, and a liability shield that would let consumers and employees successfully sue for coronavirus exposure only if they can prove “gross negligence” or “willful misconduct.” When it comes to COVID-19-exposure lawsuits, the proposed shield raises the standard of proof from what’s applied in ordinary tort cases, with meritless lawsuits subject to a fine of up to $50,000. Anyone who sues for exposure has to list all the people and places they visited, and all the people who visited them, in the two weeks before the onset of symptoms. The added protections would stay in place until October 2024. They would also apply to nonprofit organizations and places of worship. The coronavirus pandemic has unleashed a wave of lawsuits, but liability shield opponents say personal-injury cases account for a small portion. Shield proponents say that’s irrelevant because businesses need the protection before they’re served with a potentially ruinous lawsuit, not afterwards. The HEALS Act is the Republicans’ answer to the Democrat-backed $3 trillion HEROES Act, a bill with no extra liability protections. Democrats and Republicans passed the $2.2 trillion CARES Act in March. “ ‘We’re not going to let trial lawyers throw a party on the backs of the frontline workers and institutions.’ ” — Senate Majority Leader Mitch McConnell “We’re not going to let trial lawyers throw a party on the backs of the frontline workers and institutions,” Senate Majority Leader Mitch McConnell, a Kentucky Republican, said as he announced the HEALS Act earlier this week. But House Speaker Nancy Pelosi, a California Democrat, has panned McConnell’s insistence on a shield, telling reporters he “doesn’t sound like anybody who wants to have an agreement or anybody who can pass a bill on the floor of the Senate.” By Wednesday, the sides didn’t seem any closer to striking a deal on any part of a rescue bill. So is there any middle ground on the rules for coronavirus exposure lawsuits, especially with so much at stake? Some Capitol Hill observers say yes. “ ‘When you read between the lines, they are saying there’s room for negotiation.’ ” — Stephen Myrow, managing partner of Beacon Policy Advisors McConnell and GOP leaders are insisting on the added protections, but “when you read between the lines, they are saying there’s room for negotiation,” said Stephen Myrow, a managing partner of Beacon Policy Advisors, a policy research provider counseling institutional investors. “This not a binary thing of a shield or no shield.” The sides could agree to things like more nuance in the statute’s language, added workplace safety rules for employees, relaxed proof standards or scrapping the $50,000 penalty, Myrow said. “There’s plenty of wiggle room,” he said. Don’t miss: Opinion: Your boss wants you back in the office — An employment law expert explains your rights The real stumbling block is how to proceed with unemployment benefits and direct checks, as well as aid to state and local governments, according to Ed Mills, a Washington policy analyst at Raymond James. Republicans won’t support another bill without a shield of some sort, but Democrats, “while opposed, have not made this their line in the sand,” he said. One solution is to give businesses immunity if they notify customers of a potential exposure within a certain time frame. Business should inform customers within 24 hours to avoid a lawsuit and could have a 14-day outer limit for the protection, two professors suggest, but they wouldn’t be protected in cases of gross negligence. “ ‘There has to be room for compromise.’ ” — Daniel Rodriguez, professor at Northwestern University Pritzker School of Law An idea like this navigates between public-health concerns and imperatives to reopen the economy, said Daniel Rodriguez, a Northwestern University law professor who proposed the idea with Daniel Hemel, a University of Chicago Law School professor, in a Washington Post opinion piece. Businesses have valid concerns about avoiding litigation, Rodriguez told MarketWatch, but customers need protection — and, if necessary, legal recourse. It’s hard enough already for plaintiffs to legally trace an infection to one party and win a case, he noted. “There has to be room for compromise,” Rodriguez said. The shield might block the ‘vast majority’ of potential personal-injury cases Republican federal lawmakers are calling for added protections at a time when a handful of states have enacted their own versions of a liability shield. Some companies — and President Trump’s re-election campaign — have also asked consumers to sign waivers. Whether these types of waivers will hold up in court remains an open question, some experts say. “In the absence of this shield, ordinary tort liability would apply and you could sue for negligence, carelessness and unreasonable behavior, the way most tort suits are brought,” said Kenneth Abraham, a professor at the University of Virginia School of Law. “ Plaintiffs can win under the GOP shield proposal if they can show ‘gross negligence’ or ‘willful misconduct.’ ” The proposal, however, narrows valid coronavirus claims down to “gross negligence,” which is defined as “a conscious, voluntary act or omission in reckless disregard” of legal duties, government guidelines and consequences to others. It also allows cases alleging “willful misconduct,” which is an act or omission that’s done “intentionally to achieve a wrongful purpose ... knowingly without legal or factual justification” and “in disregard of a known or obvious risk.” Plaintiffs pressing a case typically have to persuade a judge or jury by a “preponderance of the evidence,” a standard that Abraham says boils down to being more probable than not. But here, plaintiffs would need to make their case by “clear and convincing evidence,” a more exacting standard. The bill also requires plaintiffs to show defendants acted with a state of mind that illustrates the gross negligence or willful misconduct. All told, Abraham said the proposal could close the door on the “vast majority” of would-be personal-injury lawsuits alleging coronavirus exposure and injury. Personal-injury cases are a small share of coronavirus lawsuits But Abraham and others point out there has not been a torrent of personal-injury cases about exposure. In many outbreak-related lawsuits, it’s businesses that are suing in the wake of costly lockdown orders. They allege their insurance carriers are wrongly refusing to pay a business interruption policy, which supplies income when a business has to temporarily close for a covered event. The sides disagree, however, on whether that applies to a government-ordered shutdown due to a viral outbreak. In other cases, consumers and college students say they’ve been stiffed over refunds for purchases or tuition. Insurance cases constitute nearly one-quarter of all coronavirus lawsuits, according to calculations by the American Association for Justice, formerly called the Association of Trial Lawyers of America. “ There were 838 insurance related lawsuits filed because of the outbreak, but 161 personal-injury cases, according to one count. ” There were 838 lawsuits filed over insurance disputes and 161 personal-injury cases, the organization said, looking through a law firm’s database of more than 3,400 coronavirus-related lawsuits filed by mid-July. Meanwhile, some high-stakes lawsuits have emerged over alleged exposure and negligence. For example, the estate of a Walmart WMT, +1.00% associate is suing the retail giant in Illinois state court for wrongful death. Lawyers allege the store was negligent toward employees and customers, and that as a result Wando Evans died in March at age 51. Walmart says in court papers that the case should be dismissed because the allegations should go to a state worker’s compensation commission, not civil court. “We continue to mourn the loss of Wando Evans,” a Walmart spokesman said. “While we are sensitive to this situation, we do not believe these claims can be brought in a civil lawsuit.” The spokesman declined to comment on the GOP shield proposal, but pointed to a letter from the Business Roundtable, an association of CEOs chaired by Walmart CEO Doug McMillon. “ ‘Narrowly-tailored liability protections will facilitate a safe and effective reopening of offices, retail outlets and manufacturing facilities.’ ” — A July 21 letter from the Business Roundtable to congressional leaders The letter, sent before the HEALS Act’s unveiling, urged congressional action on a range of issues. “Narrowly-tailored liability protections will facilitate a safe and effective reopening of offices, retail outlets and manufacturing facilities,” it said at one point. Meanwhile, Princess Cruise Lines CCL, +0.51% is defending against cases from passengers who allege they were sickened due to the cruise line’s negligence. In two other cases, families are suing the company for a passenger’s death from the virus. A federal judge dismissed lawsuits earlier this month from passengers who didn’t contract COVID-19 aboard, but said they were traumatized by the experience on board. Princess Cruise Lines did not respond to a request for comment. Liability shield opponents and supporters sound as far apart as negotiators on either side of the aisle. The proposal “will make it nearly impossible to get ahead of this pandemic and more lives will be lost,” American Association for Justice CEO Linda Lipsen said in a statement. But Harold Kim, the president of the U.S. Chamber Institute for Legal Reform, an affiliate of the U.S. Chamber of Commerce, which lobbied for the shield, said that “liability protections are not and should not be a partisan issue.” “Waiting for an onslaught of litigation to happen is like leaving your umbrella at home when there is a storm in the forecast,” he said."}]}