{"article": [{"url": "https://www.marketwatch.com/story/alphabet-in-the-age-of-covid-19-google-braved-one-recession-and-now-its-more-diversified-2020-04-08", "published": 1595881760.0, "headline": "Google is being squeezed by a softening ad market that has cut more than $8 billion from sales expectations", "body": "This article is part of a series tracking the effects of the COVID-19 pandemic on major businesses, and will be updated. It was originally published on April 8. Alphabet Inc.’s dominance of online advertising took a major hit during the onset of coronavirus, and things could get really gnarly when Google’s parent company reports results Thursday. Softening of the advertising market in the early days of the pandemic hit all the major players, including Alphabet GOOGL, +1.82% “ GOOG, +1.97% . ”In March we experienced a significant slowdown in ad revenues,” Alphabet Chief Financial Officer Ruth Porat said during its first-quarter earnings call in late April. That trend did not end as the second quarter began, and in fact may have reached its bottom during the period, prompting Monness Crespi Hardt analyst Brian White last week to warn “Alphabet will continue to struggle with weak digital ad spending and wrestle with antitrust investigations.” Hardt predicts Q2 sales of $36.8 billion, down 6% year-over-year, and significantly shy of the $37.3 billion modeled by analysts polled by FactSet. “As the COVID-19 crisis ravages more parts of the U.S. in the most nefarious and unpredictable of ways, we believe businesses will be less inclined to spend on advertising,” White said in a July 24 note that maintained a buy rating and price target of $1,420. Google, the core business of Alphabet, commands roughly 28% of the $332.84 billion digital-advertising market worldwide, and is expected to maintain that lead in 2021 and beyond, according to eMarketer. YouTube is a big reason why — the video-streaming site is expected to haul in $8.42 billion in 2020 and $14.1 billion in 2022, according to eMarketer. In late April, Alphabet reported it brought in $4 billion in ads through YouTube in the first quarter, and $2.78 billion via Google Cloud. White and others remain optimistic about the upside of Google Cloud and Alphabet’s longer-term position in a world that will become much more digital in the aftermath of this crisis. “We believe changes announced [July 23] to Google Shopping are consistent with the company’s more aggressive strategy to attract merchants, product listings and consumers to Google’s shopping app/tab,” Baird analyst Colin Sebastian said in a note July 23 that maintained an outperform rating and price target of $1,650. “Over time, we believe these ‘free’ initiatives could attract more ad spending to Search, YouTube and Display.” Business in the age of COVID-19: Read profiles of how other large companies will be affected by the coronavirus Google has been here before, when it wasn’t named Alphabet. During the recession sparked by the subprime-loan crisis a decade ago, sales remained at single-digit growth for five quarters in a row. Google’s revenue estimates declined at least 15% in 2009 and 2010, with a marginally greater earnings hit, according to analysis by MKM Partners. However, Google had the field all to itself more than a decade ago, before Facebook Inc. FB, +0.26% , Snap Inc. SNAP, -0.18% and Twitter Inc. TWTR, -0.23% emerged as online ad rivals. Since the last recession, Google has also acted to diversify its business beyond search ads, with YouTube and Cloud accounting for more than 40% of incremental growth, MKM Partners reported. How the numbers are changing Revenue: Average analyst expectations for the second quarter were $45.86 billion at the end of 2019, but have declined to $37.3 billion as of July 27. Estimates for Google websites, which account for most of Alphabet’s revenue, have declined from $32.09 billion to $24.98 billion in that time period, according to FactSet. For the full year, analysts expect revenue of $169.7 billion. Earnings: Average analyst expectations from FactSet were $13.38 per share at the end of 2019. As of July 27, they were $7.95 per share. For the full year, analysts expect earnings of $41.49 per share. Stock movement: Through Friday, Class A shares improved 14%. Google crested at $1,564.85 on July 19, and closed at $1,534.60 on July 27.What the company is saying July 27: Google tells employees it will extend its work-from-home order until at least July 2021 because of the pandemic, according to a report in The Wall Street Journal. July 23: Google makes a bid to bring more sellers and products to its shopping site by waiving sales commissions and letting retailers use popular third-party payment and order management services like Shopify Inc. SHOP, +2.50% instead of the company’s own systems. Commissions on Google Shopping range from a 5% to 15% cut, depending on the products. April 28: Google’s profits were punctured even more than expected as the COVID-19 pandemic caused “a significant slowdown in ad revenues,” parent company Alphabet disclosed in a quarterly earnings report. “Performance was strong during the first two months of the quarter, but then in March we experienced a significant slowdown in ad revenues,” Alphabet Chief Financial Officer Ruth Porat said. “We are sharpening our focus on executing more efficiently, while continuing to invest in our long-term opportunities.” April 23: Google confirmed it is slashing its marketing budget by as much as half in the second half of the year, and has imposed a hiring freeze for full-time and contract employees, to reduce spending the rest of the year. See also: Google to cut back on hiring, other spending due to coronavirus, Alphabet CEO says What analysts are saying • “We’re expecting to see a continued decline in Google’s search ad revenues in Q2, though we are expecting Q2 to be the bottom of that market. We are looking out for any color they give as to whether April was the low point and spending was coming back a bit in May and June. YouTube, meanwhile, likely continued to grow at double-digit rates throughout Q2 (though that still represented a downgrade to pre-COVID growth expectations). Here, we’ll be looking for additional comments on whether the brand/direct response advertiser mix is changing at all in favor of direct response advertisers — an area Google was hoping to grow this year.” — eMarketer analyst Nicole Perrin, on July 23. • “Google may also be viewed as a laggard with what appears to be a low-bar for 2Q earnings, but we expect its P/E premium to FB (currently 2-turns) will continue to erode as growth premiums expand and FB grows much faster. We believe that Google will trade at a higher multiple than its recent historical range. We think antitrust risk will return as the economy recovers but will no longer be a focus of upcoming elections. We think all digital platforms will benefit by behavior shift post-COVID and expect that opportunities across Google and Other Bets will be accelerated.” — Loop Capital Markets analyst Rob Sanderson, maintained his hold rating and price target of $1,500 on July 20. • “In contrast to 2008 and the subsequent recovery, we do not see ad spending this cycle dropping materially as a percent of GDP but rather broadly holding its share. This is based on a more constructive view of performance based advertising platforms like Facebook, Snapchat, YouTube, and Amazon.” — Morgan Stanley analyst Benjamin Swinburne, on assessing the digital advertising climate on July 20."}]}