{"article": [{"url": "https://www.marketwatch.com/story/california-orders-bars-indoor-dining-and-most-gyms-churches-shut-again-amid-coronavirus-surge-2020-07-13", "published": 1594677740.0, "headline": "California orders bars, indoor dining and most gyms, churches shut again amid coronavirus surge", "body": "SACRAMENTO, Calif. — Bars and inside restaurant dining are banned throughout California, while indoor religious services, gyms and hair and nail salons are again off-limits in most of the state, Gov. Gavin Newsom said Monday in issuing a sweeping set of closures to head off surging coronavirus cases and hospitalizations. The order is part of the state’s new strategy to control the spread of the virus by focusing on limiting indoor activities to reflect public health officials’ evolving understanding of how the virus spreads. Earlier in the pandemic California closed beaches, campgrounds and state parks as it sought to limit interactions of people from different households. But as data showed the virus was most likely to be transmitted indoors, the Newsom administration began modifying public health orders, including ordering people to wear face coverings and leaving outdoor activities alone. Newsom has repeatedly implored people to refrain from social gatherings and he expressed frustration that many aren’t following the guidance. “COVID-19 is not going away anytime soon, until there is a vaccine and or an effective therapy,” Newsom said. “Limit your mixing with people outside of your household. It’s just common sense, but the data suggests not everyone is practicing common sense.” The city of Los Angeles immediately implemented the mandated shutdowns and Mayor Eric Garcetti said he wouldn’t hesitate to go further. Earlier this month the city created a color-coded system to designate the threat level from the virus and corresponding shutdowns. Rising numbers of cases and hospitalizations now have it at orange — the second-highest designation, when people are to minimize all contact with anyone outside their household. “Red is when everything shuts down again — everything, to our strictest level. And I do want to warn people that we’re close to that,” Garcetti said. Newsom’s move faced immediate resistance from religious groups and business organizations. Fred Jones, attorney for the Professional Beauty Federation of California, suggested many hair salons may not comply with the order. He said there is “no evidence that a single contagion has been spread in a salon since we’ve been allowed to reopen.” “He should be partnering with his state licensed-professionals, not shutting us down,” Jones said. Robbert Tyler, the attorney for California-based Advocates for Faith and Freedom, said he believes Newsom’s order on religious services is unconstitutional. While Newsom says churches can meet outdoors, Tyler said many don’t have the facilities for that. “We have not only an economic crisis but we have a spiritual and mental health crisis that requires as much attention as COVID-19,” said Tyler, whose nonprofit organization represents churches on religious liberty issues. “To tell churches they can no longer meet indoors is just a further restriction upon the incredible services provided by churches across the state that are desperately needed.” California was the first state in the country to issue a mandatory, statewide stay-at-home order aimed at slowing the spread of the coronavirus. Most businesses and churches voluntarily complied, scrambling to let employees work from home and moving worship services online. Public health officials praised Newsom, crediting the March 19 order with limiting the virus’ impact in the nation’s most populous state, which has about 40 million residents. But the order devastated the economy, causing more than 7.5 million people to file for unemployment benefits. Newsom moved quickly to reopen the economy in May but by mid-June there were signs that the virus was resurgent and when July arrived Newsom took action. For counties on the state’s watch for rising virus cases, he ordered bars to close and indoor operations halted at restaurants, wineries, tasting rooms, zoos, museums and family entertainment centers like bowling alleys and miniature golf courses. On Monday, Newsom extended that order statewide. In the last two weeks, the number of counties on the watch list has swelled from 19 to 30, covering roughly 80% of the state’s population. During that period coronavirus-related hospitalizations have risen 28%, including a 20% increase in patients requiring intensive care. The state’s death toll now is above 7,000. Also Monday, Newsom imposed new restrictions for counties on the state’s watch list, ordering them to halt indoor operations for gyms, nail salons, tattoo parlors, hair salons and barbershops, shopping malls and offices for nonessential sectors. The affected counties include Los Angeles and virtually all of Southern California. Francesca Schuler, advisory board member for the California Fitness Alliance, said her group appreciates the challenge Newsom is facing but is disappointed by the closures. She said fitness centers worked with the state to develop high standards and strict guidelines, including having people wear masks when they work out. “We’re all in on supporting doing the right thing to flatten the curve, but we do believe physical and mental health is the second crisis that’s emerging right now,” she said. “Fitness is key to that, particularly to mental health.” In Los Angeles County, where 10 million people live, Public Health Director Barbara Ferrer said she would update the county’s public health order to reflect Newsom’s new directives. She said data shows “everything is pointing toward an alarming trend,” noting that “every day thousands of people in our community are being infected.” “I know this step back in our recovery journey is disheartening but we must do everything in our power to stop the virus from spreading, from making the people we love sick and from causing untimely deaths,” Ferrer said. Other county leaders were frustrated. Butte County Supervisor Bill Connelly said he has not changed his behavior during the pandemic, except when he was forced to wear a mask while attending church on Sunday. He blamed Newsom for making the “cure worse than the disease.” “He’s putting these small businesses under extreme strain, they are going to go under,” said Connelly, whose county is not on the state’s watch list. “We should have more discretion as to what to do in our communities.” For most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death."}]}