{"article": [{"url": "https://www.marketwatch.com/story/climate-change-poses-a-systemic-threat-to-the-economy-investors-with-1-trillion-at-stake-warn-the-fed-and-sec-2020-07-21", "published": 1595410160.0, "headline": "Climate change poses a â\u0080\u0098systemic threatâ\u0080\u0099 to the economy, investors with $1 trillion at stake warn the Fed and SEC", "body": "The Federal Reserve, the Securities and Exchange Commission and other financial regulators should act on climate-change concerns to avoid economic disaster, a letter from pension funds and other investors representing almost $1 trillion in assets urges. The U.S. has sustained more than $1.775 trillion in costs from more than 265 climate-related extreme weather events since 1980, by some measures, and more than $500 billion in economic losses between 2015 and 2019. â\u0080\u009cThe climate crisis poses a systemic threat to financial markets and the real economy, with significant disruptive consequences on asset valuations and our nationâ\u0080\u0099s economic stability,â\u0080\u009d reads the letter, which was signed by more than three dozen pension plans, fund managers and other financial institutions. These investors worry that if regulators do not act, climate change may cause the worth of some companies to fall suddenly, an unstable situation for the economy. But providing more information about that risk â\u0080\u0094 for example, requiring greenhouse gas emissions data or mandating companies to disclose how facilities are vulnerable to rising seas â\u0080\u0094 could help investors price assets and make better decisions. Specifically, the investors want the agencies to treat climate change as a systemic risk. For the SEC, the call is for adoption of mandatory and consistent disclosure of climate threats at the companies under its watch. A unified regulatory stance on these risks would create an incentive for businesses to adopt policies that could help them lower insurance costs in the long run, or assure better access to loans and capital, says Ceres, an advocate for sustainable investing that organized the letterâ\u0080\u0099s participants. The Fedâ\u0080\u0099s San Francisco branch late last year held the first-of-its-kind climate summit for the central bank, exploring among other things the risks and rewards of steering industries from dependence on fossil fuels. â\u0080\u009cBecause there is considerable uncertainty about the persistence, breadth and magnitude of climate-related shocks to the economy, it could be challenging to assess what adjustments to monetary policy are likely to be most effective at keeping the economy operating at potential with maximum employment and price stability,â\u0080\u009d Fed Gov. Lael Brainard said at that event. In one paper presented in San Francisco, the authors said climate change could subtract 7% from real world per-capita gross domestic product by 2100. The official letter to the regulators advances a report issued last month by Ceres. That report, warning of â\u0080\u009cgreen swanâ\u0080\u009d risks, and which had some bipartisan support, laid out a 50-step plan for markets and regulators on climate change. The letter also emerges as the private sector has taken a lead in efforts toward a zero-emissions future. Read:Microsoft, Starbucks and Nike opt for show-and-tell to push others to hit net zero carbon emissions Letter signatories include major institutional investors like California pension CalSTRS, the New York State and New York City Comptrollers, the Maryland State Treasurer, and the Seattle City Employee Retirement System, as well as five former members of Congress from both major political parties, former U.S. financial regulators, venture capital groups, trade associations and major philanthropic foundations. Donâ\u0080\u0099t miss:Climate change will break the housing market, says David Burt, who predicted the 2008 financial crisis The letter was also timed to the 10-year anniversary of The Doddâ\u0080\u0093Frank Wall Street Reform and Consumer Protection Act. Opinion:More than 33,000 tips, $2.5 billion in financial remedies and $500 million in awards to investors â\u0080\u0094 the SECâ\u0080\u0099s whistleblower program turns 10 years old today"}]}