{"article": [{"url": "https://www.marketwatch.com/story/good-news-you-now-have-until-nov-21-to-claim-your-stimulus-check-2020-10-06", "published": 1602165080.0, "headline": "Good news: You now have until Nov. 21 to claim your stimulus check", "body": "People who make too little to file income taxes now have more time to register with the Internal Revenue Service to claim their stimulus check. The IRS on Monday extended the deadline to Nov. 21 for people to use the non-filer portal. Oct. 15 marked the previous registration deadline. That’s an extra five weeks to seek an Economic Impact Payment, which is $1,200 for individuals making less than $75,000 and couples making less than $150,000. The IRS includes $500 per qualifying child under age 17. The autumn push for stimulus checks comes as talks continue on another round of fiscal stimulus. House Speaker Nancy Pelosi and Treasury Secretary Steven Mnuchin are scheduled to speak Tuesday. The Democrat-controlled House passed a $2.2 trillion stimulus bill last week that serves as a bargaining point in the talks. The bill would include another round of direct checks. “We took this step to provide more time for those who have not yet received a payment to register to get their money, including those in low-income and under-served communities,” IRS Commissioner Chuck Rettig said in a statement. Last month, the IRS sent out letters to nearly 9 million households saying they may be eligible for a still-unclaimed stimulus check. More than 7 million people have already used the non-filer portal, according to the IRS. The IRS has distributed more than 160 million stimulus checks as of early summer. The letters and extended deadline continue an effort by the IRS and the community groups to put much-needed money into the hands of people who could potentially miss out on the checks. When the IRS determined-stimulus check eligibility, it looked at a household’s 2018 income-tax return or their 2019 return. It also sent the checks to people receiving benefits through the Social Security Administration and the Department of Veterans Affairs, among other places. That still leaves eligible people who didn’t receive those sorts of benefits and didn’t make enough money to justify filing an income tax return — and that is where the non-filer portal registration comes in. A single person who made less than $12,200 per year in employee wages or a married couple making less than $24,400 per year in wages didn’t need to file a return with the IRS. Even though the non-portal filing deadline is being pushed back, the Oct. 15 deadline is still intact for people to file a return if they requested an extension."}]}