{"article": [{"url": "https://www.marketwatch.com/story/joe-biden-picks-kamala-harris-as-his-running-mate-2020-08-11", "published": 1597165220.0, "headline": "Joe Biden picks Kamala Harris as his running mate", "body": "Joe Biden said Tuesday that he has chosen Sen. Kamala Harris of California to be his running mate, tapping a former rival in the Democratic presidential primary as he takes on Donald Trump for the White House. Harris, 55, drew praise last summer for her strong performance in the first Democratic presidential debate, when she attacked Biden for his stance decades ago on busing, but her 2020 campaign ultimately failed to get traction, leading her to exit the race in December. “I have the great honor to announce that I’ve picked @KamalaHarris — a fearless fighter for the little guy, and one of the country’s finest public servants — as my running mate,” Biden tweeted in making his announcement. He also invoked Harris’s work with his late son Beau, the former attorney general of Delaware, and the pair’s work “as they took on the big banks,” KBE, -0.69% and advocated for working people and women and children. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Harris brings law-enforcement experience to Biden’s presidential bid, having served as California’s attorney general and San Francisco’s chief prosecutor before becoming a U.S. senator, though that record as a “top cop” also has drawn criticism. Biden, who served as vice president in the Obama administration and as a U.S. senator from Delaware, had long said he would choose a woman as his running mate. The choice of Harris, who is Black, comes in the wake of nationwide protests over police killings of Black Americans. Related:Politicians have supported heavily armed police task forces — with underwhelming outcomes Biden and Harris will appear together on Wednesday in Wilmington, Del., to deliver joint remarks, Biden’s campaign said. Trump’s campaign attacked Harris as embracing “the left’s radical manifesto” in her own campaign, and said she would bring the same agenda to Biden’s ticket. “Joe Biden is no moderate, and with Harris as his ‘political living will,’ he is surrendering control of our nation to the radical mob with promises to raise taxes, cut police funding, kill energy jobs, open our borders, and appease socialist dictators,” said Katrina Pierson, a senior Trump adviser. The 77-year-old politician’s age has prompted questions about whether he would serve two terms as president and put extra focus on his choice for vice president. Biden in late April said he viewed himself “as a transition candidate” who would have young leaders in his administration. Other Democratic politicians under consideration for the No. 2 job included former national-security adviser Susan Rice, Sen. Tammy Duckworth of Illinois, Sen. Elizabeth Warren of Massachusetts and Rep. Val Demings of Florida. One expert told MarketWatch in June that Wall Street SPX, +0.87% DJIA, +0.56% could have been shaken if Biden had picked Warren, who is known for taking on the financial sector and other parts of Corporate America."}]}