{"article": [{"url": "https://www.marketwatch.com/story/retirees-it-may-be-time-to-ditch-your-investment-strategy-11593008864", "published": 1593072860.0, "headline": "4 ways to build your wealth and make it last longer", "body": "They’ve long been endangered, but 2020 may mark their demise: After four decades of falling interest rates, it seems safe investments offering attractive yields have finally disappeared. At 0.7%, the payout on 10-year Treasury notes is below the 1.3% expected inflation rate for the next decade. High-quality corporate and municipal bonds offer more generous after-tax income, but hardly enough to excite investors. In the years ahead, the yield-obsessed will no doubt turn to riskier fare—high-dividend stocks, preferred shares, junk bonds, Wall Street-engineered contraptions—and many will end up badly burned. My advice: It’s time to say goodbye to the notion of a safe yield and confront its many implications. There are obvious steps, like lowering our return expectations, saving more to compensate and paying down debt. But here are four other possibilities: 1. Abandon bonds. As I argued back in early May, stocks are now the only option for long-term investors hoping to clock significant gains in the financial markets. Meanwhile, high-quality bonds not only offer after-tax yields that barely exceed the inflation rate and are sometimes below, but also there’s a risk of short-term losses as the economic recovery nudges interest rates higher and thus depresses the price of existing bonds. Read: My dad left me his IRA when he died. Is there a way I can share it with my siblings? That brings me to an idea advanced in 1989 by the late Peter Bernstein. Instead of the classic balanced portfolio with 60% stocks and 40% bonds, perhaps investors should opt for 75% stocks, with the other 25% in cash investments like money market funds and high-yield savings accounts. Bernstein found that the latter investment mix had a similar risk level to the classic balanced portfolio, but higher returns. The appeal of the Bernstein portfolio depends, I believe, on what role we see conservative investments playing in our portfolio. If we’re in the workforce, we should probably lean toward bonds, and especially Treasury bonds. Those Treasurys will likely jump in value when the economy next contracts, unemployment rises and stocks crash. We could then sell those Treasury bonds either to rebalance into stocks or to pay for groceries if we find ourselves out of work. Meanwhile, if we want a pool of money for upcoming spending that should never lose its nominal value, no matter what happens in the financial markets, cash investments are more attractive. My hunch: That pool of cash—perhaps equal to five years of portfolio withdrawals—could be especially appealing to retirees. 2. Delay Social Security. This has always been a smart idea. With bond yields so low, it now looks even more compelling. Imagine you were born in 1958, so you turn age 62 this year. For purposes of Social Security, your full retirement age is 66 years and eight months. If you were eligible for $1,000 a month at that point, you might instead opt this year for a reduced benefit of $716 per month or wait until age 70 and get a delayed monthly benefit equal to $1,267. Suppose you postpone benefits. How long does it take to recoup the benefits you missed by not claiming at age 62? Let’s assume that, no matter when you claim Social Security, you invest your benefits in government bonds, which arguably involve similar risk. Those bonds earn an after-tax return equal to the inflation rate—a generous assumption these days. The bottom line: Claiming at age 62 is the smart move if you’re dead by age 78. But if you live to that age or later, you’re better off delaying to your full retirement age of 66 and eight months. What if you wait until 70 to claim Social Security? By age 80, you’re ahead of where you’d be if you claimed benefits at 62 and, by age 82, you’re ahead of where you’d be if you had claimed at your full retirement age. What’s the life expectancy of someone in their mid-60s? It’s age 85—somewhat less for men, somewhat longer for women. The upshot: Thanks to today’s modest bond yields, delaying Social Security looks even more attractive. That’s doubly true if you’re married, you were the family’s main breadwinner and hence you have the larger Social Security benefit. The reason: Even if you die early in retirement, your benefit may live on as a survivor benefit for your spouse. Read: How grim is the outlook for aging in America? Who shouldn’t delay? If you’re in poor health—or if you’re married and you’re both in poor health—claiming early likely makes sense. You might also claim right away if you’re that rare retiree who is 100% invested in stocks and thus claiming early means you can leave your stocks to grow for longer. But if you’re in good health and you’re claiming early so you can leave your bond portfolio untouched for longer, you’re likely making a mistake. 3. Bet your life. If delaying Social Security is unpopular with many retirees, buying immediate fixed annuities is a total anathema. But just as low bond yields boost the case for postponing Social Security, it also increases the appeal of immediate fixed annuities. Why? Falling interest rates have hurt the payout on both bonds and immediate fixed annuities—but it’s hurt immediate annuities far less. As I explained in one of March’s newsletters, interest rates are just one element in the pricing of immediate annuities. The other key component is life expectancies, and those have barely budged. Result: While 10-year Treasury yields today are at less than half of year-end 2019’s 1.92%, payouts on immediate annuities have dropped only slightly, making them a good choice for retirees who need to squeeze more income out of their retirement savings. Read: If you want to live to 100, do this one thing 4. Revisit tax efficiency. For years, the preferred strategy for minimizing taxes was to use retirement accounts to hold real estate investment trusts, taxable bonds, and actively managed stocks and stock funds. Meanwhile, for a taxable account, the top choice was to buy and hold tax-efficient stock investments, such as total market index funds. But with bond yields so low, holding taxable bonds in a regular taxable account no longer looks like a mistake. Suppose you’re deciding whether to use your taxable account to hold Treasury bonds yielding 1% or an S&P 500 fund yielding 2%. Yes, the Treasury yield might be taxed at a federal income tax rate of 22%, while the S&P 500 fund benefits from the special 15% rate on qualified dividends. Still, the total annual tax bill on the S&P 500 fund will clearly be higher, plus those dividends will rise over time, which means an even larger tax bill down the road. Meanwhile, not only are Treasury yields lower, but also the interest avoids state taxes. Is it time to ditch the old strategy? It depends on what sort of bonds you buy. Today, holding Treasurys in a taxable account would be less taxing than holding a broad stock market index fund. But that wouldn’t be the case if your taste runs to high-quality corporates, where you can still earn yields above 2%. One other consideration: Suppose you foresee using your taxable account to hold broad stock market index funds until your death. If you do that, the funds will benefit from the step up in cost basis and thus the embedded capital gains tax bill will disappear. That means your heirs will receive the funds tax-free, unless estate taxes are owed. Indeed, bequeathing appreciated stock investments in a taxable account has become a more attractive strategy, now that the stretch IRA has been killed off. This column was originally published on Humble Dollar. It was republished with permission."}]}