{"article": [{"url": "https://www.marketwatch.com/story/sanofi-looks-to-accelerate-ms-treatment-with-368-billion-acquisition-of-principia-biopharma-2020-08-17", "published": 1597673600.0, "headline": "Sanofi looks to accelerate MS treatment with $3.68 billion acquisition of Principia Biopharma", "body": "Sanofi has agreed to buy Principia Biopharma, in a deal that values the U.S. maker of a promising multiple sclerosis treatment at $3.6 billion, including debt. The deal marks the second struck by Sanofi Chief Executive Paul Hudson since he took over as head of the French drugmaker from Olivier Brandicourt in September. Just three months later, Sanofi snapped up Synthorx to bolster its immuno-oncology pipeline for $2.5 billion Under the terms of the deal, announced on Monday, Sanofi SAN, +1.20% will offer $100 a share in cash to shareholders of Prinicipia Biopharma US:PRNB, representing a 10% premium to the closing price of the San Francisco-based company of $90.74 on Aug. 14. The acquisition will boost Sanofi’s research capabilities in areas such as autoimmune and allergic diseases, the two companies said. “This acquisition advances our ongoing R & D [research and development] transformation to accelerate development of the most promising medicines that will address significant patient needs,” Hudson said in a statement. The deal is expected to complete in the fourth quarter of 2020. Shares in Sanofi were up fractionally higher at 0.23% in early European trading on Monday. “We like the relatively low risk value accretion of this deal with longer-term optionality, that fits within the strategy of deploying firepower across numerous bolt-on deals,” analysts at Jefferies wrote n a research note on Monday. Hudson, who joined Sanofi from rival Swiss drugmaker Novartis NOVN, +0.77%, has been restructuring the French drugmaker into three main global business units: specialty care (immunology, rare diseases, rare blood disorders, neurology and oncology), vaccines, and general medicines (diabetes, cardiovascular, and established products) to simplify the business and help drive growth. Its consumer health-care division will be a stand-alone business unit. The company is aiming to make $2 billion in savings by 2022 through limiting spending on those deprioritized businesses, “smart spending,” and improving manufacturing productivity. Read:The World Could Have Enough COVID-19 Vaccines by the End of 2021 Sanofi has also joined the global race to find a coronavirus vaccine. The U.S. government said in July it will pay $2.1 billion to Sanofi and its U.K. partner GlaxoSmithKline GSK, +1.52% for 100 million doses of the COVID-19 vaccine the two companies are developing. The deal is one of the biggest from ‘Operation Warp Speed,’ the White House initiative aimed at expediting vaccine development. The same month, Sanofi and Glaxo agreed to supply 60 million doses of the vaccine to the U.K. government. The agreement underscores the U.K. government’s aggressive strategy to secure supplies of experimental shots to fight the pandemic. On Friday, it signed deals for a further 90 million doses of coronavirus vaccines, taking its potential stockpile to 340 million doses — one of the biggest in the world. That is enough for five doses per person. Under the U.K. government’s latest in-principle agreements, U.S. drug developer Novavax NVAX, +0.18% will provide 60 million doses of its coronavirus vaccine to the U.K. Janssen Pharmaceutica, a division of Johnson & Johnson JNJ, +1.39%, will supply the U.K. with 30 million doses of its candidate."}]}