{"article": [{"url": "https://www.marketwatch.com/story/biden-eyes-major-foreign-policy-shifts-if-he-wins-2020-08-01", "published": 1596301520.0, "headline": "Biden eyes major foreign policy shifts if he wins", "body": "Should former Vice President Joe Biden win the White House in November, America will likely be in for a foreign policy about-face as Biden reverses, dismantles or severely curtails many of President Donald Trump’s most significant and boldest actions. From the Middle East to Asia, Latin America to Africa and, particularly, Europe, and on issues including trade, terrorism, arms control and immigration, the presumptive Democratic nominee and his advisers have vowed to unleash a tsunami of change in how the U.S. handles itself in the international arena. With few exceptions, Americans could expect Biden to re-engage with traditional allies. Where the iconoclastic Trump has used blunt threats and insults to press his case, Biden, a former senator, would be more inclined to seek common ground. Historically, U.S. foreign policy hasn’t changed drastically as the presidency shifted between Democratic and Republican administrations. Allies and adversaries stayed the same and a non-partisan diplomatic corps pursued American interests. That changed with Trump. Under his “America First” policy, he viewed both allies and the foreign policy establishment with suspicion, while speaking warmly of adversaries like North Korea’s Kim Jong Un and Russia’s Vladimir Putin. But Trump found it hard to make swift changes. Academics often say that American foreign policy is like an aircraft carrier: easy to order a wholesale change of direction from the bridge but far more difficult and time-consuming to alter course. Trump saw that when he was unable to extricate the U.S. from the Iran nuclear deal for more than year. His well-publicized withdrawals from the Paris Climate Accord and the World Health Organization won’t actually become final until after the Nov. 3 election, if ever. His decision to redeploy thousands of troops from Germany could take years. Trump’s initial problems may have reflected a lack of governmental experience by both him and his top advisers. That created a steep learning curve that was complicated by their intense distrust of national security institutions. Biden, with his Senate and White House experience, may be better positioned to deliver on change swiftly. Biden told reporters Tuesday in Delaware that he knows “how to get things done internationally.” “I understand the national security and intelligence issues,” he said. “That’s what I’ve done my whole life. Trump has no notion of it. None.” Biden’s campaign also has assembled an experienced team of foreign policy advisers: Jake Sullivan served as deputy assistant to President Barack Obama and policy planning director at the State Department. Nicholas Burns had high-level foreign policy positions under Presidents George W. Bush and Bill Clinton. Tony Blinken was deputy secretary of state and deputy national security adviser to Obama. Susan Rice, national security adviser and U.N. ambassador under Obama, is a finalist for vice president. If she isn’t selected, she could become a key adviser if Biden wins. The Trump campaign casts Biden’s foreign policy experience as a weakness. “Joe Biden’s record of appeasement and globalism would be detrimental for American foreign policy and national security, and after decades of the status quo, President Trump has made it clear that the United States will no longer be taken advantage of by the rest of the world,” deputy press secretary Ken Farnaso said in a statement. For decades, the first and often only foreign policy shift that new presidents of both parties directed on their first day in office, and Trump was no exception, was abortion-related. Like clockwork, Republicans enacted the so-called “Mexico City” language — known by opponents as the “global gag rule” — to prohibit the use of U.S. foreign assistance for abortion-related services. Democrats rescinded it and should Biden win, he has promised to follow suit. But he’s also pledged to demolish other Trump policies on Day One. They include reversing Trump’s ban on immigration from mainly Muslim countries, restoring U.S. funding and membership to the WHO and halting efforts to oppose the Paris Climate Accord. He’s promised to call top NATO leaders and declare of U.S. foreign policy, “We’re back” while convening a summit of major heads of state in his first year. One area that will require more nuance is China, which Trump has placed at the top of his foreign policy agenda and on which he has painted Biden as weak. After previously boasting of warm ties with Chinese leader Xi Jinping, Trump has relentlessly attacked China, blaming it for the coronavirus outbreak that threatens his reelection prospects. Biden has been slower to directly criticize Trump’s recent actions against China, but his campaign questions whether the president will eventually undermine his administration’s tough actions of late by personally striking softer tones toward Beijing “The administration has a history of talking very loudly but not producing results,” said Jeff Prescott, a campaign foreign policy adviser, Biden also has said he would immediately restore daily press briefings at the White House, State Department and Pentagon, events once deemed critical to communicate U.S. policy that the Trump administration has all but abandoned. Biden and his surrogates say they intend to act quickly on the following: - Middle East: Restore assistance to the Palestinian Authority that the Trump administration has eliminated as well as to agencies that support Palestinian refugees. Biden hasn’t said he will reverse Trump’s recognition of Jerusalem as Israel’s capital or return the embassy to Tel Aviv. - United Nations: Restore U.S. membership in U.N. agencies such as the U.N. Educational, Scientific and Cultural Organization and possibly the U.N. Human Rights Council. - Europe: Tone down rhetoric Trump has used to berate and insult European allies. Biden can be expected to try to warm relations among NATO partners. - Africa: Try to raise America’s profile on the continent, which has become a new battleground for competition with China. - Asia: Revert to a traditional U.S. stance supporting the presence of American troops in Japan and South Korea. Biden has also criticized Trump’s personal relationship with Kim. - Latin America: Cancel Trump administration agreements that sent asylum-seeking immigrants to Mexico and other countries while they await court dates. Biden has also promised to divert funding away from the southern border wall and use it on other priorities, though the Trump campaign notes that the former vice president in past comments hasn’t committed to halting all new border wall construction. Biden also wants to restart Obama-era engagement with Cuba. ___"}]}