{"article": [{"url": "https://www.marketwatch.com/story/eu-nations-close-to-21-trillion-coronavorus-relief-plan-as-marathon-summit-continues-2020-07-20", "published": 1595311880.0, "headline": "EU nations agree to $2.1 trillion budget and coronavirus relief plan after marathon summit", "body": "BRUSSELS (AP) — Weary but relieved, European Union leaders finally clinched a deal on an unprecedented 1.8 trillion-euro ($2.1 trillion) budget and coronavirus recovery fund early Tuesday, somehow finding unity after four days and nights of fighting and wrangling over money and power in one of their longest summits ever. With masks and hygienic gel everywhere at the summit, which was spread over five days, the 27 leaders were constantly reminded of the potent medical and economic threat the virus poses to their continent, and grudgingly committed to a massive aid package for those hit hardest by the pandemic. To confront the biggest recession in its history, the EU will establish a 750 billion-euro coronavirus fund, partly based on common borrowing, to be sent as loans and grants to the hardest-hit countries. That comes on top of the seven-year, 1 trillion-euro EU budget that leaders had been haggling over for months even before the pandemic. iframe.twitter-tweet { width: 100% !important; } “This was a summit meeting where I believe the consequences will be historic,” said French President Emmanuel Macron. “It created the possibility of setting up loans together, of setting up a recovery fund in the spirit of solidarity.” German Chancellor Angela Merkel said, “We have laid the financial foundations for the EU for the next seven years and came up with a response to this arguably biggest crisis of the European Union.” With Macron and Merkel negotiating as the closest of partners, the traditionally powerful Franco-German alliance struggled for days to get the quarreling nations in line. “The EU as a whole now has a big chance to come out stronger out of the crisis,” said EU Commission President Ursula von der Leyen. “Tonight is a big step toward recovery.” At first, the grants were to total 500 billion euros, but the so-called “frugals” — five wealthy northern nations led by the Netherlands — wanted a cut in such spending and strict economic reform conditions imposed, and the figure was brought down to 390 billion euros. The summit at the urn-shaped Europa Center laid bare how the nations’ narrow self-interests trumped the obvious common good for all to stand together and face a common adversary. Rarely had a summit been as ill-tempered as this one, and it was the longest since a five-day summit in Nice, France, in 2000, when safeguarding national interests in institutional reforms long was a stumbling block. “There were extremely tense moments,” said Macron. Still, considering every EU leader had the right of veto on the whole package, the joint commitment to invest and spend such funds could be seen as a success. The days and nights of brutal summiteering will surely have left many wounds between member states, but as history has proven, the EU has an uncanny gift to quickly produce scar tissue and move on. “People have often accused Europe of being too little, too late. Here we demonstrated the opposite,” von der Leyen said. “This is an absolute record for a new budgetary instrument.” Even if Tuesday’s agreement was a giant leap forward, the European Parliament, which has called the moves of the member states too timid considering the challenge, still has to approve the deal. But Tuesday was a moment to revel in the achievement itself. “An extraordinary situation demands extraordinary efforts,” Merkel said as the leaders pushed on with one of the bloc’s longest summits ever. What was planned as a two-day summit scheduled to end Saturday was forced into two extra days by deep ideological differences among the 27 leaders. The coronavirus has sent the EU into a tailspin, killing around 135,000 of its citizens and plunging its economy into an estimated contraction of 8.3% this year. Spanish Prime Minister Pedro Sanchez insisted the adoption of an ambitious plan was required, with the crisis continuing to threaten the continent. The leaders mulled a proposal from the five wealthy northern nations that suggested a coronavirus recovery fund with 350 billion euros of grants and the same amount in loans. The five northern nations — the Netherlands, Austria, Finland, Sweden and Denmark — had long opposed any grants at all, while the EU executive had proposed 500 billion euros. The latest compromise proposal stands at 390 billion euros in grants. Dutch Prime Minister Mark Rutte and others also wanted a link to be made between the handout of EU funds and the rule of law — a connection aimed at Poland and Hungary, countries with right-wing populist governments that many in the EU think are sliding away from democratic rule."}]}