{"article": [{"url": "https://www.marketwatch.com/story/these-4-groups-of-funders-are-uniquely-positioned-to-help-close-the-racial-wealth-gap-2020-06-11", "published": 1592076680.0, "headline": "These 4 groups of funders are uniquely positioned to help close the racial wealth gap", "body": "The dual plagues of the pandemic and racial inequities are shining a powerful light on the cracks and gaps in our systems and revealing the horrific toll of unchecked racism that affect communities of color. I have been flooded with calls from friends, clients, allies, and partners who are not only frustrated and pained about what’s happening, but are looking for guidance around what they can do. The killing of George Floyd at the hands of Minneapolis police was a wake-up call for many. But black and brown Americans have known systemic inequities for far too long, and we have created and innovated in spite of them. This is a critical point for the U.S. and system-wide change is the only answer. There must be a shift in the uneven distribution of wealth and power. It’s time for a more inclusive economy where voices are heard, people are seen and ideas are funded. The road to achieving racial justice and equity is long. Change won’t happen overnight, and it won’t happen at the hands of just one leader, one organization or one industry. Every sector has a role to play, but four groups of capital allocators — those with the lion’s share of the resources — are uniquely positioned to close the racial wealth gap. Here are some actions these groups can do now: 1. Philanthropy: Philanthropy has to do better. There must be more philanthropic investment in social enterprises and organizations that are led by, created by or have a person of color in a leadership position. It is important to have leaders who understand and are representative of the communities that philanthropic organizations seek to serve. The W.K.Kellogg Foundation’s recent $1.5 million investment in Blavity demonstrates how essential it is for this sector to partner with the voices that are engaging an entire generation that is ready for change. Organizations must recruit, hire and give decision-making power, budgets and resources to program managers of color to lead this work. Some the biggest U.S. organizations with billion-dollar endowments and the most influence lack diversity. Philanthropy must have a race and equity lens through all its work. I challenge these institutions to double-down on their commitments to their grantees by rapidly deploying capital to leading organizations in crucial social-reform areas including justice, health, housing, climate, and economic advancement — and to do it publicly. Sector leaders such as The W.K.Kellogg Foundation, The Ford Foundation and a few others are putting their resources in the hands of those on the front lines of this work. 2. Investors: Private-market investors must open their eyes to the opportunities black and brown company founders present. These entrepreneurs are equally qualified yet disproportionately marginalized. For examples, look to programs such as The Intentionally Good Project, led by tech entrepreneur Joey Womack, which trains diverse-led startups by accelerating their path to investors and funders for financial capital. Hundreds of accelerator programs such as Beta Boom, Propeller and Backstage Capital are tapping and training the next wave of game-changing entrepreneurs. Investors can be adaptable and create solutions to meet immediate needs. When COVID-19 struck we saw investors step up to offer relief aid to diverse-led businesses that were locked out and in a state of emergency. The NDN Collective , for example, provided rapid relief to some of the most underserved Tribal communities in the U.S. Invest Atlanta, meanwhile, saw the impact of COVID-19 on the city’s black community and the economic stability of its predominantly black women-owned small businesses. Invest Atlanta launched the Strength in Beauty fund to deploy grants as a means to address financial challenges. 3. Corporations: Businesses must be mission-driven and their values must be more than just profit-driven. When Larry Fink, chairman and CEO of investment giant BlackRock BLK, +1.18% , challenged companies to contribute to society or risk losing BlackRock’s support, he championed what so many in the social impact space have spent decades fighting to achieve. Many companies such as Ben and Jerry’s and Chobani have shown that you can do well by doing good. Businesses must also put people of color in leadership positions and give them the power and resources needed to have an impact. I question the authenticity of a company’s commitment to diversity if it hasn’t diversified its own leadership and staff. Companies must build a social contract with their stakeholders by being transparent about their willingness to learn and do better. Luxury brand Gucci launched its Gucci Changersmaker Impact Fund in response to leadership’s realization that the company had work to do both internally and externally. Gucci formed a North American advisory board of leaders to hold the company accountable, diversify internal leadership, provide grants to organizations making a social impact, and award scholarships to young professionals in the fashion industry. Read: Companies are speaking out against racial injustice after the killing of George Floyd, but they have to back it up with action Plus: Many tech employees are more ‘woke,’ but changing monolith companies is not easy 4. Individuals: If you are a person with power and privilege, spend down your privilege every day. You wake up with a full tank of privilege — it's your responsibility to share it with others. Each morning, ask yourself how you can unlock the door for someone who doesn’t look like you. Look around at the people in your work meetings and notice if the faces are diverse. If not, find a way to bring others in. Buy from diverse-owned business. Forbes recently highlighted 75 such businesses to support; New York Magazine published a list of 125 businesses where you can spend your money. No one knows how this latest chapter in America’s story will end, but I hope it’s the beginning of a new era. Making a difference isn’t easy, but someone has to do it — why not you? Keisha Senter is senior content lead for SPECTRUMVirtual, and founder and chief impact officer of The Solution Senter. Read more: ‘We are not even close to the end.’ America faces another economic and social upheaval and once again it includes race Financial incentives have given us ever more aggressive policing — if we want real change, we must change those incentives Hiring and promoting women police officers could bring real justice reform and make communities safer Defund the police for safer, healthier and sustainable black communities"}]}