{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-struggle-amid-earnings-rush-and-as-fed-decision-looms-2020-07-29", "published": 1596016760.0, "headline": "European stocks struggle amid earnings rush and as Fed decision looms", "body": "European stocks struggled for gains on Wednesday, as investors fielded a flood of earnings from banks such as Barclays PLC and Deutsche Bank AG, and waited for a Federal Reserve announcement due later. The Stoxx Europe 600 index SXXP, +0.55% slipped 0.2% to 367 after gaining 0.4% on Tuesday. The German DAX DAX, +0.06% fell 0.2% and the FTSE 100 index UKX, +0.64% was flat, while the French CAC 40 PX1, +0.71% rose 0.5%, boosted by well-received results from heavyweight Schneider Electric SE. But gains were hard to come by as company results globally have confirmed the tough climate caused by the pandemic. The yield on 10-year German bonds TMBMKDE-10Y, -0.521% hit minus 0.5% on Wednesday, a level not seen in two months. The yield on 10-year gilts TMBMKGB-10Y, 0.283% hit the lowest since March at -0.135%. Investors are waiting on the outcome of a two-day Federal Reserve meeting — the decision won’t come until after the close of European markets. While no major policy changes are expected, Fed Chairman Jerome Powell is expected to maintain the central bank’s dovish position. As well, progress on a second coronavirus aid package out of the U.S. is being closely monitored. “For all the optimism about a new U.S. stimulus program, the rising hopes of a vaccine, and the likelihood of central banks keeping monetary policy extraordinarily loose, the resurgence of coronavirus cases that are starting to get reported across the world is prompting the realization that hopes of a V-shaped recovery is starting to look like pie in the sky,” said Michael Hewson, chief market analyst at CMC Markets, in a note to clients. While cases may be starting to plateau in some of the hardest hit U.S. states, some 21 are considered hot spots, the New York Times reported. That’s as parts of Asia and Europe are grappling with a potential second wave of the virus, with outbreaks in parts of Spain and Belgium. The U.K. over the weekend recommended against all but essential travel to Spain, throwing the struggling travel industry into uproar. Several big banks reported results on Wednesday, with the economic fallout from the coronavirus forcing those institutions to book major charges. Shares of Barclays PLC BARC, +4.33% BARC, +0.16% slid 5% after reporting said pretax profit more than halved in the first half of 2020 as the lender booked a £3.74 billion ($4.8 billion) credit impairment charge. Barclays also warned of a challenging second half. Shares of Banco Santander SA SAN, -1.48% SAN, -1.28% also fell 5% after the Spanish lender reported a surprise massive loss in the second quarter, weighed by a 12.6 billion euros ($14.76 billion) impairment stemming from the pandemic’s economic hit. Shares of Deutsche Bank AG DB, -0.85% DBK, -1.27% fell nearly 5%. The German bank posted a second-quarter loss, but higher revenue on a strong performance by its investment bank unit, though bad-loan provisions reached the highest level in more than a decade. Shares of Schneider Electric SE SU, +1.07% climbed 3% after the French energy-management group SU, +1.07% reported a fall in first half net profit, but re-established full-year targets and its share buyback program. Tullow Oil PLC TLW, +2.78% shares plunged 5% after the U.K. oil producer said that it expects to report lower revenue and forecast pretax impairments of between $1.4 billion and $1.7 billion."}]}