{"article": [{"url": "https://www.marketwatch.com/story/biden-says-4-more-years-of-trumps-climate-denial-could-mean-more-suburbs-burned-in-wildfires-2020-09-14", "published": 1600103960.0, "headline": "Biden says â\u0080\u00984 more years of Trumpâ\u0080\u0099s climate denialâ\u0080\u0099 could mean more suburbs â\u0080\u0098burned in wildfiresâ\u0080\u0099", "body": "Joe Biden on Monday attacked President Donald Trumpâ\u0080\u0099s responses to the wildfires in the West and climate change, saying the fires represent â\u0080\u009cyet another crisis he wonâ\u0080\u0099t take responsibility for.â\u0080\u009d â\u0080\u009cThe West is literally on fire, and he blames the people whose homes and communities are burning,â\u0080\u009d the Democratic presidential nominee said in a speech at the Delaware Museum of Natural History in Wilmington, Del. â\u0080\u009cIf we have four more years of Trumpâ\u0080\u0099s climate denial, how many suburbs will be burned in wildfires? How many suburbs will have been flooded out? How many suburbs will have been blown away in superstorms?â\u0080\u009d At least 35 people had been declared dead as of late Sunday as nearly 100 wildfires blazed in the West over the weekend. Bidenâ\u0080\u0099s comments came as Trump on Monday got briefed on the wildfires as he visited the Sacramento, Calif., area. With 50 days to go before the Nov. 3 election, the Democratic challenger has an edge of 3.7 percentage points over the Republican incumbent in a RealClearPolitics moving average of polls focused on top swing states that are likely to decide the White House race. Betting markets are giving the former vice president a 52.7% chance of winning vs. Trumpâ\u0080\u0099s 46.5% chance. See:Trump spars with California official on wildfires and climate change: â\u0080\u0098Itâ\u0080\u0099ll start getting coolerâ\u0080\u0099 Opinion:7 ways youâ\u0080\u0099re already paying for climate change Biden also said Trump thinks â\u0080\u009choaxâ\u0080\u009d when he thinks about climate change, while he thinks â\u0080\u009cjobs.â\u0080\u009d â\u0080\u009cWhen Donald Trump thinks about LED light bulbs, he says he doesnâ\u0080\u0099t like them because the lights are no good. They always make him look orange,â\u0080\u0099â\u0080\u009d the former vice president added. â\u0080\u009cI see small businesses and master electricians designing and installing award-winning energy conservation measures.â\u0080\u009d Biden on Tuesday is slated to visit the swing state of Florida. He said on Monday that while in Florida he â\u0080\u009cwill talk about how I am going to work like the devil to make sure I turn every Latino and Hispanic vote.â\u0080\u009d Related:The West burns, coastlines are threatened, and Trump and Biden are too quiet on climate change, say analysts And see:VP nominee Kamala Harris has a particular climate-change agenda: environmental justice"}]}