{"article": [{"url": "https://www.marketwatch.com/story/home-improvement-projects-are-underway-during-covid-19-with-millennials-spending-the-most-says-bank-of-america-2020-06-24", "published": 1593251000.0, "headline": "Home improvement projects are underway during COVID-19 with millennials spending the most, says Bank of America", "body": "More people are strapping on their tool belts and getting to work on home improvement projects during the COVID-19 pandemic, with millennials spending the most to get the job done, according to Bank of America. Bank of America polled 1,054 Americans about their attitudes and shopping habits during coronavirus and found that more than 70% have decided to tackle home improvement projects, with more planned for 2021. “Although we expect some near-term deceleration as parts of the population go back to their places of business and spend less time at home, COVID-19 could provide a longer-term benefit for home improvement stocks if it ultimately does cause an increase in housing turnover as our survey may suggest,” analysts led by Elizabeth Suzuki wrote. “A shift into larger existing homes (corresponding to a shift out of cities) and older homes requiring renovation (which most young buyers can more easily afford), could be a multi-year tailwind.” Since younger homeowners are tackling these projects in older homes, analysts also found that spending from millennials outpaced other groups. Read:Lowe’s benefited from delayed DIY projects done during coronavirus lockdowns, while Home Depot saw professional jobs put on hold “This may be kicking off a wave of renovation activity by a generation that has been relatively slow to enter the housing market,” Bank of America said. This is part of the reason why Lowe’s Cos. Inc. LOW, +1.38% had such a good first-quarter showing, according to analysts. Lowe’s reported earnings and sales that blew past expectations late last month. The majority of Lowe’s customer base, 75% to 80%, are do-it-yourself shoppers compared with rival Home Depot Inc. HD, +0.49% , which counts 55% of the DIY community as its customer base, Bank of America said. “Given Home Depot’s higher reliance on professional customers, we continue to rate HD as neutral, as the longer-term implications of high unemployment/recession could slow growth in professionally-driven projects,” analysts said. Bank of America rates Lowe’s stock buy. Another company benefiting from the trend is Tractor Supply Co. TSCO, +0.47% , which is getting a boost from what analysts call an “urban exodus” and a shift to “outdoor categories.” Analysts note that younger people have more flexibility since they’re more likely to not yet have a family, and may be looking to move from their small living spaces where living under quarantine is more difficult. And:Tractor Supply benefiting from consumer trends like gardening and the move to rural communities, analysts say Tractor Supply stock has soared 69% over the last three months. Other research groups are taking note of the increased home improvement activity, with Stifel raising price targets for both Lowe’s (to $156 from $149) and Home Depot (to $276 from $250) in a note published June 16. Analysts highlighted the 16.6% year-over-year increase in seasonally adjusted spending reported by the U.S. Census Bureau. Stifel rates both Home Depot and Lowe’s stock buy. Instinet raised price targets for the home improvement retailers as well. “We believe that both Home Depot and Lowe’s are well positioned in the current environment and beyond, as we expect home-related retail trends to stay strong for some time,” wrote analysts led by Michael Baker. Instinet rates both companies buy. Home Depot’s price target was moved up $10 to $266, and Lowe’s price target increased to $146 from $130. Home Depot shares are up 34.3% over the past three months, and Lowe’s has skyrocketed 56% for the period. Other companies are reaping the benefits from the home improvement boom. Scotts Miracle-Gro Inc. SMG, +4.65% announced an upward revision of its guidance for the fiscal year ending September 30, with the company now expecting sales growth of 16% to 18%. Previous guidance was for 6% to 8% growth. “An unprecedented number of consumers planting and maintaining gardens has led to a nearly 40% increase in consumer purchases of Miracle-Gro branded soils and more than 30% increase in plant food,” said Jim Hagedorn, chief executive of Scotts Miracle-Gro, in a statement. “We’ve seen a more than 50% increase in purchases of Ortho outdoor pest control products and nearly 40% increase in indoor products. In fact, with the exception of mulch – which is gaining ground but still lagging last year due to a lack of retailer promotions – we have seen strong growth in every category this year.” That stock is up 31% over the past three months. And on Wednesday, Sherwin-Williams Co. SHW, +1.47% raised its second-quarter sales guidance. “Sharp increases in domestic do-it-yourself (DIY) paint demand during a period of shelter-in-place initiatives in 2Q 2020 is leading to much better than expected sales results in Sherwin-Williams’ Consumer Brands Group and in the Americas Group businesses,” wrote JPMorgan. Analysts rate Sherwin-Williams stock neutral and raised their price target to $555 from $520. Sherwin-Williams shares have gained 26.2% over the last three months. The S&P 500 index SPX, +0.87% is up 24.1% over that period."}]}