{"article": [{"url": "https://www.marketwatch.com/story/online-grocery-sales-will-skyrocket-but-margins-take-a-hit-analysts-say-11602009539", "published": 1602056720.0, "headline": "Online grocery sales will skyrocket but margins take a hit, analysts say", "body": "Walmart was a top choice for grocery delivery, according to data from online grocery delivery service Good Eggs Walmart Shoppers are buying more groceries online, which is great for convenience, but terrible for margins, experts say. Bank of America analysts expect global online grocery sales to reach $705 billion by 2025, triple the sales of 2019. “The sector faces bigger challenges than non-food sectors when it comes to building a successful home delivery model, such as short sell-by dates, and fragile and varying food characteristics (e.g., temperature),” analysts wrote in a detailed report on COVID-19’s impact on the accelerated shift to e-commerce. “However, the sector has grown exponentially given investment by grocers in ‘click and collect’ and home delivery services and societal change towards quicker shopping.” Analysts note that in the U.S., online grocery growth has been through the roof, up 183% in April, for example. However, it started from a low point. The U.S. accounts for 17% of global grocery sales value. See: ‘Zoom-worthy’ pieces like earrings and necklaces are selling though jewelry is expected to take a COVID-19 hit in 2020 “We think there will also be a world pre- and post-COVID-19, with accelerated growth for grocery online thanks to a higher acquisition rate of new customers,” Bank of America said. “Grocery online should today be seen as an opportunity for faster growth and market share gains for those food retailers willing and able to grab the opportunity.” The challenges for online grocery sales that analysts highlight make finding an efficient and effective business model difficult. Fulfilling orders for home delivery is expensive, and making in-store pick-up work also means finding a way to do so without disrupting customers who are doing their own shopping at a store location. “Online grocery is as a result dilutive to already thin retailer operating margins,” Bank of America said. A Moody’s report published Tuesday makes that point as well. “We expect online sales to remain higher than they were before the pandemic, even for retail categories where fewer purchases were made online, like food and consumables,” analysts wrote. “This is because consumers have become increasingly comfortable with internet shopping. As growth slows, the longer-term credit challenge for grocers will remain how to preserve margins despite the rising adoption of lower-margin online shopping.” Watch: Why retail bankruptcies won’t necessarily create a ‘retail apocalypse’ Overall, Bank of America analysts say that there’s been a $480 billion shift in value to e-commerce, which will continue to drive the store closures that consumers and investors have already seen across a variety of categories. Bank of America forecasts an 8% decline in store numbers between 2019 and 2025. For clothing and shoes, online penetration will reach 40% by 2025, according to Bank of America calculations, up from 20% in 2019. E-commerce had already been accelerating in the U.S. before the coronavirus but the pandemic quickly became “the largest accelerator of e-commerce” around the world in a decade, with online penetration in the U.S. moving to 31.5% in April 2020 from 19% in January 2020. Even with this movement across the spectrum of online shopping, a CommerceHub report, “COVID-19 Consumer Retail Trends: 6 Months Later,” shows that grocery stores are still frequented by customers more than stores that carry other goods. Also: Beyond Meat, Incogmeato, Impossible Foods up ante in plant-based meat market More than 60% of those who participated in an August survey of 2,000 U.S. consumers said they “seldom” go to a store other than a grocer. In part, that might have something to do with what’s available and what’s convenient. Another survey of nearly 2,600 consumers, conducted by San Francisco-based online grocery delivery service Good Eggs, found that many of those customers who are ordering groceries and having them delivered are also going to the store, picking up orders curbside and also buying meal kits. “The downside of shopping online includes the lack of available items or difficulty finding the items they want (45%), getting poor quality foods they wouldn’t have picked themselves (41%), and receiving the wrong items in, or having items missing from, their orders (39%),” Good Eggs found. For online grocery shopping, Good Eggs found that Walmart Inc. WMT, +1.00% is the top choice followed by Amazon.com Inc. AMZN, +3.01%, either through Prime or Whole Foods Market, followed by Instacart and regional grocery stores that have their own online delivery offering, like Safeway and Wegeman’s. Bank of America analysts also note the digital momentum at grocers like Kroger Co. KR, +0.46% and Albertsons Cos. Inc. ACI, +1.71% “Grocery online should today be seen as an opportunity for faster growth and market share gains for those food retailers willing and able to grab the opportunity,” analysts said. Don’t miss: Target to host Deal Days shopping event during Amazon Prime Day One key part of the developmental process will be finding a business model that works for companies and consumers alike. “Home delivery is not a viable solution if not charged and in-store pick is not productive enough while disruptive for in-store customers,” Bank of America wrote. “Developing an economically viable model has been the reason for slow entry and progress in grocery online.”"}]}