{"article": [{"url": "https://www.marketwatch.com/story/next-coronavirus-aid-package-may-not-become-reality-until-second-week-of-august-analysts-say-2020-07-23", "published": 1595664920.0, "headline": "Next coronavirus aid package may not become reality until second week of August, analysts say", "body": "As Democrats and Republicans take stances on another big coronavirus financial aid package, analysts are predicting that the next measure is likely to become reality in the first week of August, but warn that it could take until next month’s second week. “It’s clear no Phase Four deal will be made until the week of August 3rd, which remains our base case,” said analysts at Beacon Policy Advisors in a note Thursday. “But given the current lack of unity among Republicans, which could slow down the pace of the negotiations with Democrats, a final deal could even slip a few days further into the week of August 10th.” The next package has been called Washington’s “Phase 4” response to the coronavirus crisis as it would follow April’s $484 billion “Phase 3.5” measure, which came after the $2 trillion CARES Act that passed in late March. Before that, Washington delivered a mid-March package costing an estimated $192 billion, and an $8 billion measure that was finalized in early March. Other analysts see a similar timeline for the upcoming relief measure, after it previously was expected in June and then late July. “It continues to be our base case expectation that this bill will pass in the first week of August, likely after the $600/week booster UI payments have expired, but there is a very long time between now and then and plenty could happen in the interim,” said Henrietta Treyz, director of economic policy research at Veda Partners, referring to enhanced unemployment insurance that’s going away. “The bill could pass next week (a low probability event at the moment), or they could pass the week of August 10th, something House Democrats are specifically prepared to incur.” See:The extra $600 in unemployment benefits ‘gave people a real lifeline,’ Trump says, so ‘we’re doing it again’ but in smaller increments And read:Pelosi opens door to no August break for House if next coronavirus relief bill isn’t done Senate Majority Leader Mitch McConnell and his fellow Republicans have said they expect the next measure to include coronavirus-related liability protections for businesses, another round of direct payments for households, an extension of the Paycheck Protection Program for small businesses and $105 billion for schools to help them deal with the virus and reopen. But Senate Republicans have moved more slowly than expected in releasing the text of their Phase 4 legislation. “This slow rolling pushes negotiations around a final bill further into next week, potentially delaying final passage beyond the very early August timeline we have been expecting,” said Height Capital Markets analysts in a note on Thursday. Related:Senate GOP closing in on COVID aid bill deal with White House White House ends payroll tax cut bid as Republicans unveil virus aid package House Speaker Nancy Pelosi and her fellow Democrats made their opening offer in the negotiations on May 15 by passing their $3 trillion HEROES Act, which includes almost $1 trillion in additional aid for state and local governments, an extension for a $600 enhanced unemployment benefit and a second round of stimulus check to households. U.S. stocks SPX, +0.87% DJIA, +0.56% are trading below their February peaks after the coronavirus pandemic triggered the shutdown of businesses, but they have rallied from their March lows thanks in part to optimism around Washington’s aid efforts. The S&P 500 and Dow industrials were recently trading flat to slightly lower on Thursday."}]}