{"article": [{"url": "https://www.marketwatch.com/story/johns-hopkins-scientists-examining-weird-side-effects-of-covid-19-say-this-could-be-how-virus-gains-a-foothold-in-the-body-2020-08-19", "published": 1598244260.0, "headline": "Johns Hopkins scientists examining weird side effects of COVID-19 suggest one way coronavirus 'gains a foothold in the body'", "body": "It's an odd side effect. But could it provide clues as to how coronavirus attacks the body? Why do some people with COVID-19 lose their sense of smell? And what can be learned from that? Scientists studying tissue removed from patients' noses during surgery believe they may have discovered the reason why so many people with COVID-19 lose their sense of smell, even when they have no other symptoms and, as a result, one way the virus enters the body. In a study published in the European Respiratory Journal on Wednesday, the researchers found extremely high levels of \"angiotensin converting enzyme II,\" or ACE-2, only in the area of the nose responsible for smelling. The ACE-2 enzyme is thought to be the gateway that allows coronavirus to enter the cells of the body and cause an infection. “ 'These results suggest that this area of the nose could be where the coronavirus is gaining entry to the body.' ” - Dr. Mengfei Chen, a research associate at Johns Hopkins School of Medicine Researchers at the Johns Hopkins University School of Medicine in Baltimore conducted the study, led by Professor Andrew Lane, director of the division of rhinology and skull base surgery, and Dr. Mengfei Chen, a research associate. They used fluorescent dyes on the tissue samples to detect and visualize the presence of ACE-2 in the nose cells. The study used these samples from the back of the nose of 23 patients, removed during endoscopic surgical procedures for conditions such as tumors or \"chronic rhinosinusitis,\" an inflammatory disease of the nose and sinus. They also studied biopsies from the trachea (windpipe) of seven patients. None of the patients had been diagnosed with coronavirus. \"This technique allowed us to see that the levels of ACE-2 - the COVID-19 'entry point' protein were highest in the part of the nose that enables us to smell,\" Chen said. \"These results suggest that this area of the nose could be where the coronavirus is gaining entry to the body.\" They found the most ACE-2 on the lining cells of the \"olfactory epithelium\" at the back of the nose where we detect smells. In fact, the levels of ACE-2 in these cells was between 200 and 700 times higher than other tissue in the nose and trachea, Chen said, and they found similarly high levels in all the samples of olfactory epithelium. The ACE-2 enzyme was not detected on olfactory neurons, the nerve cells that pass information about smells to the brain. \"The olfactory epithelium is quite an easy part of the body for a virus to reach, it's not buried away deep in our body, and the very high levels of ACE-2 that we found there might explain why it's so easy to catch COVID-19,\" Chen said. Lane added that this research may enable doctors to tackle the infection with antiviral therapies delivered directly through the nose. Related:COVID-19 and 1918 flu have one depressing thing in common: exacerbating social and economic inequality Many common respiratory infections, such as coughs and colds, can make us temporarily lose our sense of smell, said Tobias Welte, professor of pulmonary medicine and director of the Department of Pulmonary and Infectious Diseases at Hannover University School of Medicine, Germany. Welte, who was not involved in this study, said this study may reveal why that happens in so many patients. It could also be one reason why COVID-19 is so infectious and, he added, this theory could potentially offer more effective treatments. \"It suggests that the part of our nose responsible for smelling could also be the place where the coronavirus gains a foothold in the body. This finding will need to be confirmed, but it offers possible new avenues for treating the infection.\" “ Another study found evidence of direct viral damage to the olfactory system in two patients who died from COVID-19. ” A separate study released earlier this month and published in JAMA Otolaryngology - Head & Neck Surgery, a peer-reviewed journal, looked at the nasal cells of two patients who had died of SARS-CoV-2, the virus that causes the disease COVID-19, and found evidence of direct viral damage to the sensory system used for smelling in patients testing positive for SARS-CoV-2. As of Monday, COVID-19 has now killed at least 808,716 people worldwide. The U.S. has the world's highest number of confirmed COVID-19 cases (5,703,561) and deaths (176,808). Worldwide, confirmed cases are now at 23,421,944, according to data aggregated by Johns Hopkins University, which does not, for the most part, account for asymptomatic cases. Some younger COVID-19 patients who were otherwise healthy are suffering loss of taste and/or smell, blood clots and strokes. Many \"long-haulers\" - COVID-19 patients who show symptoms for months after the initial infection passed - report neurological problems including confusion, difficulty concentrating, headaches, extreme fatigue, mood changes and insomnia. Coronavirus update:The Dow Jones Industrial Index DJIA, +0.56%, the S&P 500 SPX, +0.87% and the Nasdaq Composite COMP, +1.39%  ended higher Friday. Last week, the Federal Reserve minutes urged Congress for more pandemic aid, underscoring the challenge to the country's economic recovery as the world anxiously awaits a COVID-19 vaccine. AstraZeneca AZN, +1.16%, in combination with Oxford University; BioNTech SE BNTX, +1.23% and partner Pfizer PFE, -0.27% ; GlaxoSmithKline GSK, +1.10% Johnson & Johnson JNJ, +1.39% ; Merck & Co. MERK, +1.59% ; Moderna MRNA, +0.09% ; and Sanofi SAN, -1.48% are among those currently working toward COVID-19 vaccines."}]}