{"article": [{"url": "https://www.marketwatch.com/story/airlines-will-need-to-take-extreme-precautions-to-keep-passengers-safe-2020-06-23", "published": 1593088100.0, "headline": "Airlines must take extreme precautions to keep passengers safe, experts tell Congress", "body": "You might need to show up four hours before your next flight. During a hearing Tuesday before the House of Representatives Subcommittee on Space and Aeronautics, experts laid out the challenges airlines will face in keeping their passengers and crew healthy, while continuing to fly amid the coronavirus pandemic. Guaranteeing that there will be no transmission of the virus that causes COVID-19 would likely be an involved ordeal. “ ‘If the SARS-CoV-2 virus is as contagious as the influenza virus with the transmission rate that we super-sized in our simulation, one can expect one to two passengers or crew to become infected on a full flight of 4 hours.’ ” To do this, airlines would need to mandate that all passengers and flight crew members show up at least four hours in advance of departure, said Vicki Hertzberg, a biostatistician and professor at Emory University. At that point, all people boarding the flight would need to undergo a nasal-swab test for COVID-19, and anyone who tested positive would be barred from flying. Without this process, “there is no way to absolutely guarantee that SARS-CoV-2 virus will not be transmitted during flight,” Hertzberg told lawmakers during the hearing. Also read:If airlines keep the middle seat empty due to fears of coronavirus transmission, will air travel become more expensive? Hertzberg previously co-led research, funded by Boeing BA, -0.39%, simulating passengers’ habits during flights to see how infectious diseases spread on aircraft that are at or near full capacity. “If the SARS-CoV-2 virus is as contagious as the influenza virus with the transmission rate that we ‘super-sized’ in our simulation, one can expect one to two passengers or crew to become infected on a full flight of 4 hours duration” amid the coronavirus pandemic, Hertzberg said. Airlines are implementing precautionary measures in a bid to entice people back to flying after the coronavirus pandemic severely reduced air travel across the globe. Some airlines, including JetBlue JBLU, -0.07%, have said that they would block out the middle seats for passengers not traveling together to aid in social distancing onboard flights. Industry trade group Airlines for America said last week that its member carriers, which include JetBlue, United Airlines UAL, +0.32%, Alaska Airlines ALK, +0.15%, American Airlines AAL, +0.34%, Delta Air Lines DAL, +0.39%, Hawaiian Airlines HA, +0.36%, and Southwest Airlines LUV, +1.89%, will impose strict face-mask rules, including potential bans for passengers who don’t follow the rules. “ Some airlines, including JetBlue, have said that they would block out the middle seats for passengers not traveling together. Others have proposed putting plexiglass barriers between passengers. ” Others have proposed putting plexiglass barriers in between passengers on flights. But the experts at Tuesday’s hearing said they still don’t know enough about the virus that causes COVID-19 and how it may spread on airplanes to say whether these precautionary measures are effective. Read more:Is there a big risk of getting coronavirus from food? As restaurants reopen, the CDC has an answer “If we put a barrier between the seats, does that reduce the risk by 5% or 95%? We just don’t know that,” Byron Jones, an engineer and professor at Kansas State University, told lawmakers. “It’s very difficult to get those data.” Jones added that other precautions may not be financially feasible for airlines. For instance, in order to reduce the probability of exposure to a very low level, “you would need to make the seating density so low that it would be impractical to operate an aircraft economically,” Jones said. Another issue is the consistency across the industry. The witnesses during Tuesday’s hearing noted that a national preparedness plan for the airline sector was not implemented by the Department of Transportation, despite a recommendation from the U.S. Government Accountability Office. As a result, airlines and airports have been left to their own devices to a large extent in coming up with safeguards to prevent the spread of COVID-19 among travelers and workers, they said. With the process varying so much from carrier to carrier and airport to airport, public trust becomes a concern. “If passengers start to find that their experiences are inconsistent or confusing, that may impact their confidence in the system,” said Heather Krause, director of physical infrastructure issues at the Government Accountability Office."}]}