{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-was-the-perfect-storm-for-tech-innovation-and-this-fund-manager-made-out-2020-06-11", "published": 1592648900.0, "headline": "Coronavirus was the perfect storm for tech innovation, and this fund manager made out", "body": "“It’s been a fascinating time to be an active manager,” Cathie Wood told MarketWatch in early June. Left unsaid: It’s been a fascinating time to be an active manager whose long-held strategy aligned perfectly with a once-in-a-lifetime crisis-driven upheaval of technology. Wood, the founder and CEO of ARK Invest, has grabbed attention, some of it skeptical, for that unwavering belief in deeply disruptive technology companies, and for her insistence that big bets on outside-the-box investments are akin to value plays. “If you have a five-year time horizon, like us, I can tell you with a straight face that I believe we’re a deep value manager because of these opportunities,” Wood said in an extended interview with MarketWatch in December. The company’s flagship fund, the ARK Innovation ETF ARKK, +2.17% , is up 26% in the year to date, compared to just a 7.4% gain for the Nasdaq COMP, +1.39% . It’s pulled in over $1.3 billion in assets in that time period, according to FactSet data. Wood is known for her transparency: ARK researchers communicate regularly with people in the industries they’re investing in, the company publishes its trades, and it sends out weekly commentary on big movers in its portfolios. In an update since the COVID-19 pandemic locked down much of the country, Wood newly shared what her ideas have meant in practice: how the coronavirus crisis has helped accelerate innovation, more details on the trades she made during the March madness, and why the intuition of active managers beats algorithms. MarketWatch: At an online event last month, you said, speaking of the pandemic and the lockdowns, that “innovation gains traction during tumultuous times.” You listed working from home, being educated from home, calling doctors from home and online retail as activities that have gained more traction during this period, and said, “I believe we have compressed three years of progress in terms of these new innovative platforms into three months. I don’t believe the economy is going back.” Could you talk a little bit more about that idea, and also how ARK thinks about finding investment opportunity in that backdrop? Cathie Wood: Companies make plans to adopt new technologies, but sort of take their time. They will take a three- to five-year look at the investment cycle. What has happened is, well-established companies were not well set up for a digital workplace. We heard about a lot of struggles taking place out there and a determination to say, finally, we have got to get onto the newest platforms. We have heard a lot of our companies saying, we have seen more interest in the past few months than we expected in the next few years. It’s an accelerated shift toward the technologies that are faster, less expensive, more productive [and] allow for more creativity. Share gains absolutely have taken place in all kinds of innovation. We have learned the hard way that credit cards and debit cards are the most vicious virus spreaders out there. They’re worse than cash. The move toward digital wallets has taken off and this will be very disruptive for banks. Square Inc. SQ, +2.06% has network effects. Banks, to attract a customer, have been willing to pay hundreds of dollars. Square spends about $20... these new services, providing peer-to-peer transactions, small business and consumer loans, the reason Square especially can do this is that it sees every single transaction these small businesses have. “ ‘In this season of despair for all kinds of reasons, we’re seeing innovation be a great source of hope.’ ” — Cathie Wood, founder and CEO of ARK Invest Before coronavirus, online shopping was only 15% of total retail sales. We think it is going to be 60% by 2030, especially as drones start evolving and rolling robots are approved to allow deliveries of groceries. When it reaches scale we think it will cost about 25 cents, certainly less than a dollar, to send a five-pound package 15 miles. The other thing that’s been galvanized by this crisis is collaborative robots. Universal Robots, which is owned by Teradyne TER, +4.38% , makes a product that look like the arms of a robot for picking and packing. They’re going to be working with humans, and increase human productivity. They will have sensors so they don’t harm people and are able to work beside people. This will be accelerated because of social distancing. People on assembly lines can’t be working next to each other. The robots are dropping in price, they’re below $20,000 now. They’re getting to be competitive with human beings and are taking jobs that are quite menial. Hopefully we will retrain people so they get interesting jobs. In this season of despair for all kinds of reasons, we’re seeing innovation be a great source of hope. It was very interesting to be managing our style of portfolio during the teeth of the crisis because what we saw was the quantitatively-oriented managers just sent algorithms out there to look for any company with a small cash cushion and negative cash burn and kill it. One was 2U Inc. TWOU, +3.51% , an online education company serving colleges and businesses and boot camps. Algorithms found 2U and took it, in the span of two weeks, from $30 to $11.50. We bought the heck out of it because we knew it was a solution to the problems out there. I remember saying, in our portfolio, let’s look at those companies that are getting hit hard: Zillow Z, -0.74% and Invitae NVTA, +0.90% . They were trashed. Trading around disruption and the volatility associated with disruptive innovation can be profitable… Zillow was a fascinating one. Its peak was $66.68, it dropped in the span of three weeks to $20, and now is back up at roughly $60. These great buying opportunities were partially because of the automatic-pilot high frequency trading out there. We were a buyer of these companies that were absolutely solutions to the problems coronavirus handed us. I mean, Zillow saw a 500% increase in online virtual tours. It’s been a fascinating time to be an active manager. MarketWatch: Funny, one of the themes that’s gotten the most attention recently as a result of the pandemic is working from home — and that’s one you didn’t mention. Wood: Oh yes! We have a fund called Next Generation Internet ARKW, +1.65% . We owned, though not in size, Zoom ZM, +2.89% , because we thought the barriers to entry were low. It really moved through this brilliantly. We sold Zoom and it’s been an out-of-sight stock. We may have been very wrong on the barriers to entry. We sold stocks that attracted a lot of capital, and what we decided to do was buy enterprise (software as a service) stocks that provide all of the various back ends. A more important and better business model is ZScaler Inc. ZS, +2.91% , which provides cloud based security. That stock was crucified when Zoom was moving up. We bought that nicely. It went from about $66 down to $35 and now is at $106. This was a company that said we’re not going to give you guidance. Their year is going to be much better than they thought. Even Netflix NFLX, +1.43% and Amazon AMZN, +3.01% , they were the obvious beneficiaries, and we own them in the next gen fund, but we sold some because they held up so well so we could move into digital infrastructure plays. It’s a very high margin model, 70-80-90% gross margins. Most people don’t know these names. Pagerduty PD, -0.43% , Twillio TWLO, +2.38% . We did not own Slack WORK, +3.36% before. We were saying, low barriers to entry. They just announced a quarter that disappointed people but on the same day announced Amazon is starting to use Slack not only internally but also in communicating with suppliers and retailers. This could begin to enjoy the networking effect. MarketWatch: Is there any way that the technology that you invest in can be used to address some of the issues that have come to the forefront in the past few weeks around social justice and racial equity? I’m thinking of the facial recognition issues around artificial intelligence, but there are probably many others that you know better than I. Wood: We probably have one of the most diverse teams in the financial services industry. I’m not saying we forced that into being. It happened very naturally, very organically. I think people attracted to a firm like ARK see our message... our young analysts, the reason they’ve been attracted is they know they’re going to be competing out there with some very seasoned analysts in other organizations but having one foot in the new world is a competitive advantage. We absolutely stand against racism. I often say we like to lead by example, so having diversity at the company to the extent we do is one form. There’s tremendous hope at ARK. And there has been tremendous sadness and we had a long discussion about it. Every other week we will watch a movie or read an article about the difficulties black people have had in the marketplace. Like the movie “Selma.” We will all watch it, so we all level-set and discuss it at a virtual lunch hour. What has happened here, as tragic as it is, it has elevated this discussion and legitimized it in a way that should have been done a long time ago. I have heard those accounts (of facial recognition technology) as well and I think they’re going to get a lot more noticed. I think what happened to George Floyd — and what was exposed through technology — in a profound way, has changed this discussion forever. I really do believe that. See:A first-of-its-kind racial empowerment ETF is ‘flying under the radar.’ Maybe it shouldn’t. MarketWatch: You get a lot of press, including from me, about your thinking on Tesla TSLA, +1.89% but this time I’d love to get your take on bitcoin BTCUSD, +3.25% . Why should investors be paying attention now, and does anything that we’ve just talked about apply to it? The idea that it could be a more accessible form of capital for the underbanked, people cut off from credit? Wood: Oh, could we just talk about Tesla a little bit, since it just hit a new all-time high, $1,000? MarketWatch: Yes, that’s a really good point. Of course. Wood: It’s very interesting. There’s an awakening in this market. If you looked at Tesla a year ago it had been trashed by hedge funds and many others, saying it is going to run out of cash. From one year ago when the stock got down to the $170s, to now, it just crossed $1,000, what you will see is that the balance sheet everyone was criticizing last year, today looks like a fortress compared to the balance sheets of traditional auto manufacturers. Traditional manufacturers are in trouble. We’ve been trying to get that message out for a long time. Tesla was going to disrupt the traditional manufacturers which would have to make a number of great leaps to catch up. In fact, they’ve had to cut back on their investments. They haven’t succeeded in switching from the traditional internal combustion engine. They can’t get up to Tesla’s standards. We’ve seen Tesla moving toward autonomous. Artificial intelligence is a big part of that. I think that analysts are beginning to get it. It’s less auto analysts and maybe analysts who are more technology-oriented. This is going to be one of the biggest investment opportunities of our lifetime. We were roundly disparaged last year. MarketWatch: You came out with a $7,000 price target in February, I think it was. Does that still stand? Wood: We’ve adjusted our base price for coronavirus. Over a five-year horizon, we took the base price target to $6,800 but there is something else that we think could take it much higher. It will probably launch its own ride hailing service, with human drivers, sometime this year. Tesla will sell a car for a down payment, and then the person buying the car will be able to pay the rest of it via their earnings. It’s a really good idea and I think they’re going to do it and we’ve just finished the modeling. It would take our price target up considerably. Compared to their current model, ride hailing is much more profitable, and I don’t think anyone has put that in their model. As far as bitcoin, I think a couple of things have happened. It probably is the reserve currency of the crypto ecosystem. Since the peak at the end of 2017 to its low at $3,500 earlier this year, we have seen bitcoin’s share of the crypto asset ecosystem, the equivalent of market cap, go from 30% to above 70%. That tells you that bitcoin is the flight-to-safety currency. That is an exalted role. We also have another impetus for bitcoin to get going here, and that is that we’ve seen traditional gold US:GCM20 getting a nice bid. That is, a lot of investors wondering where all this monetary and fiscal stimulus is going to go. This is digital gold. If bitcoin got just 10% of the traditional gold investment market, its market cap would go from about $170 billion now, to about $900 billion. We also think it’s an insurance policy against... an outright confiscation of wealth, as has happened in Venezuela, in Saudi Arabia… I think more people are thinking about insurance policies, [saying to themselves] wow, if I just kept the keycode in my head I could walk across the border away from a country that’s trying to confiscate my wealth and have it at my disposal. The other reason I’m more optimistic about it is the technology under it has been battle-tested. We just went through the halving… [I]t’s developing some scarcity value. There are about 18 million units out there now. It’s going to be growing even more slowly than traditional gold is mined. Another thing happened recently, in conjunction with coronavirus. In March when bitcoin imploded, what happened was an exchange called Bitmex had allowed 100 times leverage for some traders. It happened in the middle of March when everything was getting hit hard. That introduced new governance measures in exchanges and decentralized parts of the financial ecosystem. I think that’s making the technology and the use of it more robust. I like to see these tests. And finally, what we’ve seen is that… this is a constantly appreciating currency year to year. This year it did not get to a new low, meaning this low was not lower than the last low, in March 2019. So you’ve got technicians looking at this, saying this chart is beginning to look robust. MarketWatch: Is there anything you’re thinking about or working on that we haven’t talked about? Wood: One thing I think is important, as we have been trying to make our way more into the institutional world, we often run into a question: what do we compare you against? My answer is always, well, whatever you want. But that is not satisfactory. Institutions do not want that answer. They want to have an independent arbiter of returns. What’s happened recently is we have worked with MSCI, which has developed some innovation indices. I have to have a complete arms-length relationship, but our research department has worked with theirs... [and] the traditional indexes have been value traps. I think when people hear ARK has a relationship with an index provider, they’ll think it’s a disconnect because I’ve been saying for so long index funds are about the past, not the future. See: Investors are making big ‘BETZ’ on this online sports and gaming ETF"}]}