{"article": [{"url": "https://www.marketwatch.com/story/teslas-stock-story-is-one-of-newbs-and-rubes-but-not-quite-the-way-you-think-it-is-2020-09-03", "published": 1599140900.0, "headline": "Teslaâ\u0080\u0099s stock story is one of newbs and rubes â\u0080\u0094 but not quite the way you think it is", "body": "Thereâ\u0080\u0099s an old saying in poker: donâ\u0080\u0099t just play the cards, play the players. Itâ\u0080\u0099s the same thing in markets. You canâ\u0080\u0099t just focus on the cards youâ\u0080\u0099re dealt, i.e., the fundamentals of this stock or that stock. You also have to focus on the other players who are playing these same cards, and that means understanding the behavior of a crowd of buyers and sellers in the stock market. Just like in poker, sometimes the cards/fundamentals donâ\u0080\u0099t matter at all. Sometimes poker players will think they have an edge in understanding the other players sitting around the table, and before you know it, thereâ\u0080\u0099s a huge pot in the middle of the table regardless of what cards have been dealt. Thatâ\u0080\u0099s exactly what has happened with Tesla TSLA, +1.89% stock over the past few months. Thereâ\u0080\u0099s a huge pot of money in the middle of the table in the form of an enormous market cap for Tesla as the stock keeps getting bid up, and none of it has anything to do with the fundamentals of the company. And, despite what I know youâ\u0080\u0099ve heard, almost none of it has anything to do with people buying the stock because itâ\u0080\u0099s â\u0080\u009ccheaperâ\u0080\u009d since the stock split. Oh sure, weâ\u0080\u0099ve all heard stories of the idiot friend of a friend who either thinks theyâ\u0080\u0099re getting four brand new shares of Tesla with the 5-for-one split or believes itâ\u0080\u0099s more â\u0080\u009caffordableâ\u0080\u009d now that itâ\u0080\u0099s been split. But the truth is that fractional share purchases have been a standard feature of every retail Davey Day Traderâ\u0080\u0099s online stock trading platform for months and months. If you wanted to buy $100 worth of Tesla stock, you didnâ\u0080\u0099t need a stock split to make that happen (and the stock split didnâ\u0080\u0099t lower the price per share to that level anyway). These stories about the idiot friend of a friend are just that â\u0080\u0094 stories. They arenâ\u0080\u0099t entirely apocryphal, maybe, but nowhere near even a rounding error in the average daily trading volume (more than 70 million shares a day) of Tesla stock. The feeding frenzy on Tesla has nothing to do with that handful of rubes buying the stock because itâ\u0080\u0099s more â\u0080\u009caffordableâ\u0080\u009d after the split. It has something to do with traders buying the stock because they believe the story that there will be rubes buying the stock because itâ\u0080\u0099s more â\u0080\u009caffordableâ\u0080\u009d after the split. And it has everything to do with traders buying the stock because they believe that other traders believe the story that there will be rubes buying the stock because itâ\u0080\u0099s more â\u0080\u009caffordableâ\u0080\u009d after the split. This is the Common Knowledge Game in action. It is the power of the crowd watching the crowd. It is the power of not what you think is true, and not what you think the crowd thinks is true, but of what the crowd thinks the crowd thinks is true. Today, the crowd thinks the crowd thinks that there are newbs and rubes buying the stock because itâ\u0080\u0099s cheaper post-split. And that is whatâ\u0080\u0099s driving the feeding frenzy in Tesla shares. Apple AAPL, +1.74% Â , too. Itâ\u0080\u0099s an old idea in investing, dating back at least to John Maynard Keynes in the 1930s, who called it the Newspaper Beauty Contest to use as market analogy the social media of his day. Maybe we should call it the Robinhood Effect. Read: Popular trading platforms TD Ameritrade, Robinhood, and others faced outages early Monday as Tesla and Apple stocks split But in both the 1930s and the 2020s, the idea is the same: in markets like these, the fundamentals donâ\u0080\u0099t matter. You can play any hand youâ\u0080\u0099re dealt! What matters is the story around a company or a stock, and what matters even more is whether itâ\u0080\u0099s a story that everyone believes that everyone else believes. How does the game end? When you stop reading stories about the idiot friend of a friend buying â\u0080\u009ccheapâ\u0080\u009d Tesla shares for the first time. Not because there were ever enough of these newbs and rubes to actually make a difference in Tesla price action, but because the story that these newbs and rubes are out there will be broken. Youâ\u0080\u0099ve seen exactly that happen in the past few days. Now that the stock split is over and there are no new online articles shouting â\u0080\u009cidiots who donâ\u0080\u0099t understand stock splits will be buying Tesla hand over fist!â\u0080\u009d, the Common Knowledge Game breaks the other way. Read: Teslaâ\u0080\u0099s stock sinks again on Wednesday to kick off a correction after disclosure of another large seller But you know who understands this game really well? Elon Musk. Tim Cook, too. Thatâ\u0080\u0099s why Tesla is selling up to $5 billion worth of fresh stock while the price is so high. Think of it as the house taking their rake from the overinflated pot of money now sitting in the middle of the poker table. So donâ\u0080\u0099t worry about Elon and Tim. Theyâ\u0080\u0099ll find another story to drive another round of the Common Knowledge Game. They always do. Ben Hunt is co-founder and chief investment officer at Second Foundation Partners and also writes on his Epsilon Theory website. Follow him on Twitter @EpsilonTheory."}]}