{"article": [{"url": "https://www.marketwatch.com/story/this-fund-manager-whose-biggest-short-was-wirecard-says-he-is-the-most-bullish-toward-stocks-since-2009-2020-06-19", "published": 1592564300.0, "headline": "This fund manager whose biggest short was Wirecard says he is the most bullish toward stocks since 2009", "body": "The concerns over German payrolls processor Wirecard WDI, +0.14% didn’t just develop overnight, or even after the Financial Times in October alleged subsidiaries were inflating profit and sales. “We’ve been short Wirecard, on and off, for years,” said Barry Norris, manager of the FP Argonaut Absolute Return Fund, who told MarketWatch the stock was his biggest short position heading into Thursday’s revelation it was missing €1.9 billion in cash. “What I’ve been amazed about is how resilient the company has been for the last few years.” As to why Ernst & Young didn’t catch the missing cash earlier, Norris said auditors often rely on the word of the auditors of the subsidiaries. “I think that’s probably why it went on so long. These subsidiaries of Wirecard’s were the entities not only generating most of the profit, but they were the subsidiaries where the cash balances were mostly held.” Wirecard’s chief executive, Markus Braun, resigned on Friday. Norris hasn’t let the Wirecard experience deter him from buying stocks more generally. He pointed out coronavirus is mostly impacting the elderly and not the general population. “When we realize the nature of the virus wasn’t another Spanish flu, then the rationale for the lockdown forever, or until we find a vaccine, has completely disappeared, and then we should get back to normal economic activity,” he said. With his view of the virus, it’s “almost impossible” to be bearish, he said. “The last time I’ve felt this bullish was 2009, when you had similar once-in-a-decade opportunities,” he said. Norris said he is now looking at recovery plays, after having invested in the likes of Amazon AMZN, +3.01%, Netflix NFLX, +1.43% and Zoom Video Communications ZM, +2.89% in the first quarter. “I just look at them now and I think, if we’re going to be locked down forever, maybe these are going to be good investments, but I just think that I struggle to see where the incremental buyer for those stocks is going to come from in the short term.” He likes U.K. home builders, semiconductor makers — Micron Technology MU, -0.02% was his biggest long position in May — and recently bought plane maker Airbus AIR, -0.20% for the first time in four years. “Whereas people don’t really like commuting or going to the office, they do like going on a holiday,” he said. “I think that aerospace is an industry that is going to come roaring back when the truth about the virus comes out.” He also likes reinsurance stocks, including Swiss Re SREN, -0.62% and Reinsurance Group of America RGA, +1.17%, on expectations they will increase prices after enduring a short-term earnings hit. “Historically, the one time when you buy reinsurance is when share prices are halved, because they’re going to take a hit, but they always recover when pricing goes up.” Exercise bike company Peloton PTON, +6.97% is one he was short before the lockdown, went long afterward, and now is back to being short. “Nearly every fitness trend has been a fad. Going back to the hula hoop, Jane Fonda videos, it has never lasted,” he said. The lockdown was great for Peloton, but its business model relies on users to keep their subscriptions for 10 years, he said. “The market cap is now absurd relative to the long-term profit potential,” he said. Random reads A company is planning space tourism flights in a high-altitude balloon — and will charge less than Virgin Galactic SPCE, -3.12%. Better toothpaste improves elite athletes’ performance, a study says. Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. Be sure to check the Need to Know item. The emailed version will be sent out at about 7:30 a.m. Eastern."}]}