{"article": [{"url": "https://www.marketwatch.com/story/us-adds-18-million-jobs-in-july-as-hiring-slows-after-fresh-coronavirus-outbreak-2020-08-07", "published": 1596792680.0, "headline": "U.S. adds 1.76 million jobs in July as hiring slows after fresh coronavirus outbreak", "body": "The numbers: The torrid pace of U.S. employment growth in the late spring gave way in July to a sharp slowdown in hiring, underscoring the fragile nature of a recovery with the coronavirus still running rampant in many states. The economy regained 1.76 million jobs last month, just one-third of the revised 4.79 million gain in June. The official unemployment rate, meanwhile, fell for the third month in a row to 10.2% from 11.1%, the government said Friday. The U.S. stock market fell in early Friday trades. The increase in new jobs was slightly above the 1.68 million MarketWatch forecast. The smaller increase in job creation took place against the backdrop of surge in coronavirus cases in a number of states, including California, Texas and Florida. Some restrictions on businesses were reimposed and Americans showed more caution in where they went and what they did. The U.S. economy added 1.8 million new jobs in July, reflecting a sharp slowdown in hiring after a resurgence in coronavirus cases halted the return of many workers to their jobs. Getty Images The mild improvement in hiring was a bit weaker than it appeared. The government’s process of seasonal adjustments showed an exaggerated increase in school employment. Stripping out government employment, private-sector jobs rose by 1.46 million last month. The slowdown in hiring — hardly unexpected — will make it harder for the economy to recover quickly. The U.S. shed more than 22 million jobs during the height of the pandemic. So far it’s only restored about 9.3 million, leaving more than half of the Americans who lost their jobs in the lurch. What’s more, an even larger 31 million people were collecting unemployment benefits in mid-July based on the most recent numbers available. A divided Congress still hasn’t agreed to extend a $600 federal unemployment bonus that expired at the end of July, another potential roadblock for the recovery. Read: Economy suffers titanic 32.9% plunge in 2nd quarter, points to drawn-out recovery Also:‘A massive welfare economy’ - federal aid prevents even steeper GDP collapse What happened: Restaurants and retailers added the most jobs in July, but at a slower pace compared to the prior two months. Restaurants rehired 502,000 workers and retailed raised employment by 258,000. Restaurants and retailers have been at the epicenter of the pandemic. They suffered the biggest decline in employment early on, shedding more than 8 million jobs combined. They’ve brought back about half of those jobs since then, but progress from here on out is likely to be erratic after the latest coronavirus outbreak spurred states to tighten restrictions on business openings and indoor activities. The number of peopled employed by government showed an 301,000 increase, but the outsized gained was partly a statistical anomaly. Many school workers such as bus drivers and cafeteria workers who would normally be laid off in July were sent home after schools closed early in the spring. The government’s normal process of seasonal adjustments made it look like hiring rose simply because those layoffs did not take place in July as usual. The federal government also hired more Census workers. In other key segments of the economy, health-care providers boosted payrolls by 126,000. Manufacturers added 26,000 jobs. And construction companies took on 20,000 workers to keep pace with rising demand for houses. Home builders have been a surprise beneficiary of the crisis. Mortgage interest rates have fallen to modern record lows and many people are fleeing crowded cities for more space in the suburbs and country. The energy sector, on the other hand, has also been hard hit by the pandemic. People are driving and flying far less, reducing demand for oil and gas. Employment fell by 7,000. Average hourly wages edged up slightly, rising 7 cents to $29.39 an hour. Yet massive swings in employment have made the normally slow-changing pay data less useful as a gauge of how much wages going up. Although the official jobless rate fell again, it’s quite likely the true level of unemployment is higher. A broader measure of unemployment known as the U6 rate suggests the “real” rate was 16.5% in July, a bit lower from 18% in the prior month. The U6 rate includes workers who can only find part-time jobs and those who have become too discouraged to look for jobs because so few are available. The government revised the June employment gain down slightly to 4.79 million. The increase in May was raised a touch to 2.73 million. Read: Here’s ‘the real surprise’ in the July jobs report — economists react Big picture: The resurgence in coronavirus cases partly sidetracked a recovery that gained steam in May and early June and indicates a rocky path ahead for the economy. The U.S. simply can’t return to normal while the coronavirus is still a big threat and millions of people can’t go back to work. The longer the health crisis goes on, economists say, the more likely that temporary job losses become permanent and the longer it will take for the U.S. to recover. Some say the process could take years absent a vaccine or other effective treatments for COVID-19. See:Marketwatch’s Coronavirus Economic Recovery Tracker What they are saying? The economic outlook deteriorated markedly from the middle to the end of July as consumers became less willing to spend money, and businesses grew increasingly uncertain about the demand for their goods,” said economist John Leer at Morning Consult. “As a result, the current employment situation is likely weaker than these numbers indicate.” Read:Consumers hold the key to an economic recovery and right now they’re very anxious Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% were set to open lower in Friday trades."}]}