{"article": [{"url": "https://www.marketwatch.com/story/president-trump-saying-he-feels-good-returns-to-white-house-and-promptly-ignites-new-mask-controversy-2020-10-05", "published": 1601929340.0, "headline": "President Trump, saying he feels good, returns to White House and promptly ignites new mask controversy", "body": "BETHESDA, Md. — President Donald Trump staged a dramatic return to the White House Monday night after leaving the military hospital where he has been receiving an unprecedented level of care for COVID-19. He immediately ignited a new controversy by declaring that despite his illness the nation should not fear the virus that has killed more than 210,000 Americans — and then he entered the White House without a protective mask. Trump’s message alarmed infectious disease experts and suggested the president’s own illness had not caused him to rethink his often-cavalier attitude toward the disease, which has also infected the first lady and several White House aides, including new cases revealed on Monday. Landing at the White House on Marine One, Trump gingerly climbed the South Portico steps, removed his mask and declared, “I feel good.” He gave a double thumbs-up to the departing helicopter from the portico terrace, where aides had arranged American flags for the sunset occasion. He entered the White House, where aides were visible milling about the Blue Room, without wearing a face covering. The president left Walter Reed National Military Medical Center, where his doctor, Navy Cdr. Sean Conley, said earlier Monday that the president remains contagious and would not be fully “out of the woods” for another week but that Trump had met or exceeded standards for discharge from the hospital. Trump is expected to continue his recovery at the White House, where the reach of the outbreak that has infected the highest levels of the U.S. government is still being uncovered. Still Trump indicated he won’t be kept from campaigning for long, tweeting before leaving the hospital, “Will be back on the Campaign Trail soon!!!” Trump made a point of sounding confident earlier. He tweeted, “I will be leaving the great Walter Reed Medical Center today at 6:30 P.M. Feeling really good! Don’t be afraid of Covid. Don’t let it dominate your life. ... I feel better than I did 20 years ago!” Trump’s nonchalant message about not fearing the virus comes as his own administration has encouraged Americans to be very careful and take precautions to avoid contracting and spreading the disease as cases continue to spike across the country. For more than eight months, Trump’s efforts to play down the threat of the virus in hopes of propping up the economy ahead of the election have drawn bipartisan criticism. “We have to be realistic in this: COVID is a complete threat to the American population,” Dr. David Nace of the University of Pittsburgh Medical Center, said of Trump’s no-fear comment. “Most of the people aren’t so lucky as the president,” with an in-house medical unit and access to experimental treatments, added Nace, an expert on infections in older adults. “It’s an unconscionable message,” agreed Dr. Sadiya Khan of Northwestern University Feinberg School of Medicine. “I would go so far as to say that it may precipitate or worsen spread.” There was political pushback to Trump’s attitude toward the virus, as well. Republican Sen. John Cornyn of Texas told the Houston Chronicle editorial board that Trump had “let his guard down” in his effort to show that the country was moving beyond the virus and had created “confusion” about how to stay safe. Conley said that because of Trump’s unusual level of treatment so early after discovery of his illness he was in “uncharted territory.” But the doctor also was upbeat at an afternoon briefing and said the president could resume his normal schedule once “there is no evidence of live virus still present.” According to the Centers for Disease Control and Prevention, those with mild to moderate symptoms of COVID-19 can be contagious for as many — and should isolate for at least — 10 days. Trump’s expected discharge raised new questions about how the administration was going to protect other officials from a disease that remains rampant in the president’s body. Press secretary Kayleigh McEnany announced she had tested positive for the virus Monday morning and was entering quarantine. Both Nace and Khan expressed fear Trump won’t properly stay isolated at the White House -- and that he hasn’t learned his lesson about wearing a mask. “We know he hates the mask, we know he hates to be restricted, we know he’s unpredictable,” Nace said. “The rest of the American people are held accountable to a 10-day isolation period.” There were also lingering questions about potential long term effects to the president — and even when he first came down with the virus Conley repeatedly declined to share results of medical scans of Trump’s lungs, saying he was not at liberty to discuss the information because Trump did not waive doctor-patient confidentiality on the subject. COVID-19 has been known to cause significant damage to the lungs of some patients. Conley also declined to share the date of Trump’s most recent negative test for the virus — a critical point for contact tracing and understanding where Trump was in the course of the disease. Only a day earlier, Trump suggested he had finally grasped the true nature of the virus, saying in a video, “I get it.” But then on Sunday afternoon, Trump briefly ventured out of the hospital while contagious to salute cheering supporters by motorcade — an outing that disregarded precautions meant to contain the virus. White House officials said Trump was anxious to be released after three nights at Walter Reed National Military Medical Center, where doctors revealed that his blood oxygen level had dropped suddenly twice in recent days and that they gave him a steroid typically only recommended for the very sick. Trump’s experience with the disease has been dramatically different from most Americans, who do not have access to the same kind of monitoring and care. While most must cope with their symptoms — and fear of whether they’ll take a turn for the worse — at home and alone, Trump has been staying in the presidential suite of one of the nation’s best hospitals and has been given experimental drugs not readily available to the public. He returns to the White House where there is a team of doctors on call with 24-hour monitoring. Trump was leaving the hospital after receiving a fourth dose of the antiviral drug remdesivir Monday evening, Conley said. He will receive the fifth and final dose Tuesday at the White House. Less than one month before Election Day, Trump was eager to project strength despite his illness and to press his campaign effort across the country. Vice President Mike Pence returned to the campaign trail moments after Trump announced he would soon leave the hospital. The vice president boarded Air Force Two to fly to Salt Lake City, where he is to face off against Democratic vice presidential nominee Sen. Kamala Harris on Wednesday. Joe Biden’s campaign, meanwhile, said the Democratic presidential nominee again tested negative for coronavirus Sunday. The results came five days after Biden spent more than 90 minutes on the debate stage with Trump. McEnany, who announced Monday that she had contracted the virus, spoke briefly with reporters on Sunday evening without wearing a mask, but said that no members of the White House press corps spent enough time around her to be considered close contacts. Even before Trump’s motorcade outing on Sunday, some Secret Service agents had expressed concern about the lackadaisical attitude toward masks and social distancing inside the White House, but there isn’t much they can do, according to agents and officials who spoke to The Associated Press. This close to the election, thousands of agents are engaged on protective duty so they can be subbed out quickly should someone test positive. Trump’s aggressive course of treatment included the steroid dexamethasone and the single dose he was given Friday of an experimental drug from Regeneron Pharmaceuticals Inc. that supplies antibodies to help the immune system fight the virus. Trump on Friday also began a five-day course of remdesivir, a Gilead Sciences drug currently used for moderately and severely ill patients. The drugs work in different ways — the antibodies help the immune system rid the body of virus, and remdesivir curbs the virus’ ability to multiply."}]}