{"article": [{"url": "https://www.marketwatch.com/story/stop-killing-unarmed-black-people-athletes-express-anger-over-shooting-of-black-man-in-wisconsin-2020-08-24", "published": 1598461820.0, "headline": "â\u0080\u0098Weâ\u0080\u0099ve been hung, weâ\u0080\u0099ve been shotâ\u0080\u0099: Clippers coach Doc Rivers reacts to the Jacob Blake shooting in Wisconsin", "body": "Officers in Kenosha, Wis., shot and gravely wounded Jacob Blake, a black man, after responding to a call about a domestic dispute. Seven shots were fired by the police officers directed at Blake, who was unarmed, according to local officials. Breaking news:Milwaukee Bucks boycott playoff game vs. Orlando in protest of police shooting back home in Wisconsin Protests erupted, causing Kenosha County to declare a state of emergency and impose a curfew. The incident was captured on video. Daytime and evening protests have devolved into violence and property damage on ensuing nights. Late Tuesday, a reported militia member armed with a semiautomatic weapon is believed to have slain two demonstrators. A third victim reportedly suffered non-life-threatening wounds. Athletes have not been shy about commenting on issues of policing and race in recent months. In the aftermath of the death of George Floyd, more and more athletes have voiced views about police brutality against people of color, and often in support of the Black Lives Matter movement. NBA players have been among the most vocal about police brutality in particular, and social issues in general, in comparison with professionals in other sports. iframe.twitter-tweet { width: 100% !important; } Los Angeles Lakers star LeBron James, an outspoken advocate for the Black Lives Matter movement, voiced his anger toward the shooting of Jacob Blake in a tweet Monday afternoon, and again after his teamâ\u0080\u0099s victory over the Portland Trail Blazers on Monday night iframe.twitter-tweet { width: 100% !important; } Los Angeles Clippers coach Doc Rivers discussed the situation in Kenosha on Tuesday night: iframe.twitter-tweet { width: 100% !important; } Rivers, a high-school star in suburban Chicago some 60 miles south and a collegiate all-American at Marquette, just 40 miles from Kenosha in Milwaukee, fought back tears as he told the press: â\u0080\u009cWeâ\u0080\u0099ve been hung. Weâ\u0080\u0099ve been shot. And all you do is keep hearing about fear. Itâ\u0080\u0099s amazing. We keep loving this country. And this country doesnâ\u0080\u0099t love us back.â\u0080\u009d Utah Jazz All-Star guard Donovan Mitchell was another NBA notable commenting on the situation: iframe.twitter-tweet { width: 100% !important; } Oklahoma City Thunder guard Chris Paul took time directly after his teamâ\u0080\u0099s victory on Monday to address the evolving situation in Wisconsin: iframe.twitter-tweet { width: 100% !important; } Athletes have continued to fire off posts expressing frustration over the Blake shooting, including New Orleans Saints star wide receiver Michael Thomas and his teammate, Alvin Kamara: iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Blakeâ\u0080\u0099s brother told reporter Lauren Linder of the Milwaukee station WTMJ-TV early Monday that Blake had had surgery and was in the intensive-care unit (it was later reported that he was paralyzed from the waist down, at least temporarily, as a result of spinal-cord injuries and had also suffered organ damage): iframe.twitter-tweet { width: 100% !important; } Kansas City Chiefs star safety Tyrann Mathieu, who has voiced his concerns about police brutality in the past, also commented on the situation: iframe.twitter-tweet { width: 100% !important; } Green Bay Packers quarterback Aaron Rodgers told the press on Monday afternoon, â\u0080\u009cthere are antiquated laws that are prejudicial against people of color in this stateâ\u0080\u009d: iframe.twitter-tweet { width: 100% !important; } Green Bay, Wis., lies some 150 miles north of Kenosha. The officers involved in the have been placed on administrative leave, according to the Wisconsin Department of Justiceâ\u0080\u0099s Division of Criminal Investigation."}]}