{"article": [{"url": "https://www.marketwatch.com/story/the-federal-reserves-bank-stress-tests-put-dividend-payments-at-risk-2020-06-26", "published": 1593417380.0, "headline": "Are the dividends from your bank stocks safe? Stress test results put pressure on future payouts", "body": "(Updates story with comments from James Shanahan, a financial-services analyst at Edward Jones.) The Federal Reserve on Thursday announced the results of its annual stress tests for 33 large U.S. banks and U.S. subsidiaries of foreign banks. Since the Fed’s “severely adverse scenario” for the stress tests was designed in February, before the coronavirus pandemic caused a recession, the regulator also conducted “sensitivity analyses” to reflect a harsher economic reality. As you can see in the table below, Wells Fargo & Co. WFC, appears at greatest risk for a dividend cut among the “big six” U.S. banks. The Fed announced steps to make sure the banks maintained their capital strength, but one member of the Federal Reserve Board said publicly that the measures weren’t strong enough. Under the severely adverse economic scenario used in the stress tests, the U.S. unemployment rate would peak at 10% in the third quarter of 2021. Since the U.S. unemployment rate had already climbed to 14.7% in April (improving to 13.3% in May), it was obvious that the COVID-19 outbreak had to be considered. The sensitivity analysis included three economic recovery scenarios, with unemployment peaking at levels ranging from 15.6% to 19.5%. The good news, according to Federal Reserve Vice Chair for Supervision Randal Quarles, was that “the banking system remains well capitalized under even the harshest of these downside scenarios — which are very harsh indeed.” He also said the banks will be required to “resubmit and update their capital plans later this year to reflect current stresses.” Here’s the entire statement from Quarles.Shoring up capital — then backing off a bit The largest U.S. banks had already suspended their stock buyback programs, but the Fed said these suspensions were now required for the stress-tested banks. Quarles also said ”banks will be prohibited from increasing their dividends and will be further limited in their dividend payments based on recent income. In its summary of the coronavirus sensitivity analyses, the Fed said third-quarter dividend payments could “not exceed an amount equal to the average of the firm’s net income for the four preceding calendar quarters.” That’s a lot less strict than looking only at the first and second quarters of 2020, which have been greatly affected by the COVID-19 outbreak and incredible rise in unemployment. The banks’ first-quarter earnings were down because of higher provisions for loan loss reserves, in anticipation of loans souring during the coronavirus recession. At the same time, the “big six” U.S. banks have been seeing a bump in trading and underwriting revenue, so there are many moving parts. Using consensus estimates for second-quarter earnings from FactSet and reported cash dividends paid on common and preferred stock, here’s a comparison of four-quarter estimated earnings averages and first-quarter dividends paid: Bank Ticker Estimated average net income - four quarters through June ($mil) Cash dividends on Common and preferred shares - first quarter ($mil) J.P. Morgan Chase & Co. JPM, -0.57% $5,968 $3,188 Bank of America Corp BAC, +0.47% $4,999 $2,083 Citigroup Inc. C, +0.47% $3,372 $1,365 Wells Fargo & Co. WFC, $2,207 $2,312 Goldman Sachs Group Inc. GS, -0.21% $1,557 $538 Morgan Stanley MS, -0.34% $1,909 $688 Sources: FactSet, company filings Only Wells Fargo paid cash dividends during the first quarter that exceeded its estimated four-quarter average of net income through the second quarter. There are many unknowns. For example, second-quarter provisions for loan losses may come in lower than expected. But from the above numbers, it would appear third-quarter dividends are likely to be unchanged from the second quarter, except possibly for Wells Fargo. In a report published Friday, Jefferies equity analyst Ken Usdin wrote that Wells Fargo “remains the bank that appears closest to the line in terms of having the greatest risk of cutting its dividend (to some extent).” Oppenheimer managing director Chris Kotowski wrote in a Friday note that for the banking industry, dividend payments will be a “quarter-by-quarter decision,” except for Wells Fargo, “where there is clear risk to the dividend from idiosyncratic issues.” Wells Fargo operates under a consent order with the Fed, under which the bank must continue to improve its corporate governance and limit asset growth. According to James Shanahan, a financial-services analyst at Edward Jones, stock buybacks made up 75% of capital returns (buybacks and dividends) for the largest eight U.S. banks during 2018 and 2019. “The banks’ voluntarily suspending buybacks in mid-March through the second quarter was already far more impactful for the preservation of capital,” he said during an interview. The banks will make their capital-plan announcements on Monday, June 29, after the market close.Fed’s Brainard says to suspend dividend payments Lael Brainard, a member of the Fed’s Board of Governors, said in a statement that the banks’ strong capital buffers were allowing them to “play a constructive role in responding to the COVID-19 pandemic.” But she is against giving a “green light for large banks to deplete capital” and believes it is time to suspend dividend payments entirely. Earnings increase capital and earnings are reduced as loan losses increase. Share buybacks and dividends lower capital. The stress-tested banks are required to suspend buybacks. But according to Brainard, allowing dividend payments now “raises the risk” that banks “will need to tighten credit or rebuild capital during the recovery.” “Rebuilding capital,” if it were necessary, would probably mean banks would dilute the ownership stakes of current shareholders by selling more shares to the public. “Temporarily halting shareholder payouts at large banks due to the COVID-19 shock would create a level playing field and allow all banks to preserve capital without suffering a competitive disadvantage relative to their peers,” Brainard said.Waiting for October Christopher Marinac, director of research at Janney Montgomery Scott, said during an interview that the Fed’s decision to “give the banks some latitude” on dividends made sense, because regulators need more data on the effect of loan forbearances and other modifications on earnings. “The forbearances and deferrals are the biggest problem the industry has at the moment,” he said. Even when the banks report their second-quarter results in July, information about the effect of loan deferrals won’t be complete. When the banks file their quarterly 10-Q reports in early August, there will be updates on the loan modification situation as of late July. Marinac called the banks “a store of value,” saying they were leading the pandemic relief efforts, in contrast to their position in the 2008 credit crisis, when they were “part of the problem.” The banks were well-prepared for the current crisis, “with less leverage, more capital and less concentration” of credit risk, he said. Looking ahead, the consensus among analysts is for large banks’ earnings to improve. “If we fail to achieve that reduction in loss costs that analysts are forecasting, estimates are too high and dividends could be at risk for many more banks,” Shanahan said. Odeon Capital senior research analyst Richard Bove took a negative tone, writing in a note to clients on June 26 that the Fed’s actions indicate “a number of banks must sharply reduce their payouts.” Bove said six banks “might unilaterally choose to reduce their dividends due to their poor scores in one of the stress tests administered by the Fed,” including Ally Financial Inc. ALLY, -0.21%, Capital One Financial Corp. COF, -0.49%, Goldman Sachs GS, -0.21%, Citizens Financial Group Inc. CFG, -2.10%, Regions Financial Corp. RF, -1.91% and Truist Financial Corp. TFC, +0.34%."}]}