{"article": [{"url": "https://www.marketwatch.com/story/consumer-spending-jumps-56-in-june-but-the-recovery-already-appears-to-be-slowing-2020-07-31", "published": 1596188780.0, "headline": "Consumer spending jumps 5.6% in June, but the U.S. recovery already appears to be slowing", "body": "The numbers: Americans increased spending on a variety of goods and services in June as more people returned to work after the spring business shutdowns and massive infusions of government aid flowed through the economy, but the progress appears to have waned lately after a recent spike in coronavirus cases. Personal spending jumped 5.6% in June, the government said Friday, after a revised 8.5% advance in May. Incomes fell 1.1% — somewhat more than expected — owing to reduced federal aid for families. The government sent onetime stimulus checks to most families in May as part of an unprecedented effort by Washington to keep people working or provide them with more generous unemployment benefits during the worst health crisis in a century. More aid was distributed in June, just not as much. Read:Economy suffers titanic 32.9% plunge in 2nd quarter, points to drawn-out recovery A closely watched measure of inflation, meanwhile, matched the biggest increase in three years owing largely to higher gasoline prices. The PCE index, the Federal Reserve’s preferred inflation barometer, rose by 0.4%. The yearly rate of inflation was quite low, however, at less than 1%. What happened: Consumers spent more on new cars and trucks, clothing, gasoline and recreation as the economy largely reopened in June. Americans also spent more on medical care as they returned to hospitals for treatments unrelated to the coronavirus. Still, spending is running well below pre-crisis levels with so many Americans out of work and others worried about their financial security. Read:Jobless claims rise for second straight week as U.S. economic activity slows down The extremely high level of savings fell to 19% from 24% in May. Households have been saving a record levels just in case the economy or their own situations take a turn for the worse. Inflation, for its part, poses little threat to the economy right now. Although the cost of some staples such as gas and food have risen, most companies have had to cut prices of goods and services to generate sales after a collapse in demand early in the pandemic. Read:Consumer confidence wanes in July and points to rockier economic recovery The rate of inflation in the past 12 months rose to 0.8% from 0.5%, according to the PCE index. Yet it’s well below January’s 1.9% pace. A separate measure of inflation that strips out food and energy, known as the core rate, edged up 0.2% in June. It’s risen just 0.9% in the past year, however, and is sitting nearly the lowest level since the Great Recession a decade earlier. See: MarketWatch Economic Calendar Big picture: The reopening of the economy fueled a rebound in May and early June as millions of Americans returned to work. Yet another large outbreak of coronavirus cases sapped the recovery of momentum and a variety of measures show economic growth has waned in July. What’s likely to determine if growth picks up again is whether Washington extends emergency unemployment benefits and other measures. They expire this week. Without more aid, economists say, the recovery is likely to lose more steam. Read:‘A massive welfare economy’ — federal aid prevents even steeper GDP collapse What they are saying? “The snapback in spending provides a good starting point for the third quarter,” said senior economist Sal Guatieri of BMO Capital Markets. Yet “high-frequency indicators suggest consumption slowed in July due to the partial rollback of reopenings in several states.” “With numerous assistance programs expiring, and a mismanaged health crisis constraining spending on services, the second phase of the recovery will likely be much slower,” said chief U.S. economist Gregory Daco of Oxford Economics. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% were set to rise slightly in Friday trades."}]}