{"article": [{"url": "https://www.marketwatch.com/story/what-if-heat-waves-were-named-like-hurricanes-new-push-draws-mega-insurers-athens-and-miami-mayors-red-cross-and-dozens-more-stakeholders-2020-08-04", "published": 1596634100.0, "headline": "What if heat waves were named like hurricanes? New push draws mega insurers, Athens and Miami mayors, Red Cross and dozens more stakeholders", "body": "The expanding risk of extremely hot temperatures has brought together for the first time a varied list of stakeholders to try to stem the deadly effects: mayors, insurance executives, scientists, building engineers, forest restorers, the Red Cross and more are banding together as 30% of the world already copes with deadly heat waves lasting 20 days or longer. Projections suggest heat waves will impact 75% of the planet’s inhabitants by 2100 if preventive measures are not implemented to mitigate their effects, especially on under-served population groups and major urban centers. Combating that risk, or at least preparing for it, is the broad goal of a newly formed group announced Tuesday: the Extreme Heat Resilience Alliance (EHRA). The global alliance, which is 30-members strong at its start, is created in part by the Atlantic Council’s Adrienne Arsht-Rockefeller Foundation Resilience Center. The group’s No. 1 priority is a push for a standard practice of naming and ranking heat waves globally, just as tropical storms are, so that communities and people can communicate about the emergency, adequately prepare and, hopefully, lives can be saved. A heat wave is defined by the National Weather Service as a period of abnormally and uncomfortably hot and unusually humid weather that typically lasts two or more days. The World Health Organization defines it in human-health terms: as prolonged periods of excessive heat that results in dehydration, heat stroke, heart kidney failure and a host of heat-related illnesses that can lead to mortality. Heat waves are getting hotter and longer and record high temperatures are outpacing record low temperatures, says Climate Central. Since the 1980s, there have been three daily record highs for every two record lows set in the U.S. alone. Read:Why climate change is also a health care story — it’s the biggest health threat this century And:Here’s what to know about climate change and weather “This extreme heat crisis can no longer be the ‘silent killer’ it is,” said Kathy Baughman McLeod, director and SVP of the Adrienne Arsht-Rockefeller Foundation Resilience Center. “This growing risk — and related solutions — must be blasted from a megaphone to decision makers and to people everywhere made even more vulnerable by the impacts of COVID-19.” By mid-century, heat waves are expected to affect more than 3.5 billion people globally — 1.6 billion people in urban centers — as they grow in frequency, duration and intensity. As temperatures rise, the urban poor will likely remain susceptible, suffering from a combination of medical conditions (e.g., cardiovascular or respiratory diseases) that are exacerbated by heat, an inadequate awareness of heat risks, and insufficient means to mitigate (e.g., costs of cooling measures such as air conditioning) the effects of high heat. Beyond the threat to human life, economic and financial losses are substantive. According to the International Labour Organization, costs of lower labor productivity due to rising temperatures is expected to reach up to $160 billion in lost wages annually in the U.S. by 2090. Globally, GDP losses from heat are projected at greater than 20% by century’s end. Don’t miss:Climate change poses a ‘systemic threat’ to the economy, investors with $1 trillion at stake warn the Fed and SEC Amplifying heat risk to the alarm level that natural disasters earn is part of the shift needed, said California Insurance Commissioner Ricardo Lara, who is part of the alliance. Related:This unappreciated climate-change risk lurks in many portfolios according to BlackRock “Naming heat waves as a global threat is the first step to being able to mitigate the risk to vulnerable communities,” he said. “We know that extreme heat harms those who have the least power to protect themselves and has long-term ripple effects on our health and economy. Recognizing the impact of heat storms can galvanize global risk players to take action.” EHRA member and mayor of Miami Francis Suarez, whose city is a signatory of the Paris Climate pact, said the south-Florida metro already logs 25 dangerous heat days per year. Projections show that number could top 100 days by 2050. He wants Miami to track the science now, which will enable the city to assume a “data-driven” approach to both its heat extremes and the effectiveness of policies to both cool the city and allow citizens to shelter in cooler conditions when needed. Jad Daley, president and CEO at nonprofit American Forests, said preserving and planting heat- and CO2-absorbing trees will be a key policy push. He cited his organization’s findings that maintaining tree cover in urban areas can cut heat-related deaths by 22% on average. But he also warned that “tree equity” needs some work as tree-canopy maps of urban and suburban areas closely track the historic real estate red-lining that has promoted inequity for decades."}]}