{"article": [{"url": "https://www.marketwatch.com/story/in-apparent-u-turn-trump-tweets-photo-of-himself-wearing-a-face-mask-many-people-say-that-it-is-patriotic-to-wear-a-face-mask-2020-07-20", "published": 1595404340.0, "headline": "Echoing Fauciâ\u0080\u0099s message, Trump has change of heart on face masks: â\u0080\u0098If youâ\u0080\u0099re close together, I would put on the maskâ\u0080\u0099", "body": "President Trumpâ\u0080\u0099s resolve may be cracking â\u0080\u0094 at least when it comes to face masks. At Tuesdayâ\u0080\u0099s 5 p.m. daily presser, Trump said, â\u0080\u009cI have no problems with the masks. If youâ\u0080\u0099re close together, I would put on the mask.â\u0080\u009d In response to a question about whether heâ\u0080\u0099d experienced a sudden a change of heart on both masks and social distancing. â\u0080\u009cIâ\u0080\u0099m getting used to the mask ...I will wear it where appropriate. Iâ\u0080\u0099ve always agreed with that. Iâ\u0080\u0099ve never fought either one.â\u0080\u009d A day earlier, the president tweeted TWTR, -0.23% Â a photo of himself wearing a mask with a presidential seal: â\u0080\u009cMany people say that it is Patriotic to wear a face mask when you canâ\u0080\u0099t socially distance.â\u0080\u009d CNN T, -1.01% reported that the presidentâ\u0080\u0099s falling poll numbers likely played a role in his latest decisions to wear a mask and resume his daily 5 p.m. update on the coronavirus pandemic. On April 3, the Trump administration and the Centers for Disease Control and Prevention reversed their policies on face masks and said all Americans â\u0080\u0094 not, as they previously said, just medical workers â\u0080\u0094 should wear cloth face coverings. As of Wednesday, COVID-19 had claimed at least 140,909 lives in the U.S. and infected more than 3.9 million people. Unlike New York Mayor Bill de Blasioâ\u0080\u0098s mandate to wear masks in stores, however, the federal governmentâ\u0080\u0099s recommendations are voluntary. Whatâ\u0080\u0099s more, Trump at the time signaled his staunch resistance to wearing a mask. â\u0080\u009cI donâ\u0080\u0099t think Iâ\u0080\u0099m going to be doing it,â\u0080\u009d he said. â\u0080\u009cWearing a face mask as I greet presidents, prime ministers, dictators, kings, queens â\u0080\u0094 I just donâ\u0080\u0099t see it.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases for three decades and one of the leading experts on pandemics in the U.S. for four decades, did not attend Tuesdayâ\u0080\u0099s White House daily briefing, and prevoiusly said he has not officially briefed the president since June 2. He has advocated the use of face masks since April along with the CDC and WHO. But the public appear to have responded favorably to Fauciâ\u0080\u0099s message. Most voters said they approved of the doctor, although the majority of Republicans said so by a whisker, according to a New York Times/Siena College poll of 1,337 registered voters from June 17 to June 22. Overall, 67% of voters gave Fauci the thumbs up, including 81% of Democrat and 51% of Republicans. President Trump and Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases. MarketWatch photo illustration/Getty Images Trump has stopped short of a federal mandate. During an interview on Fox News, journalist Chris Wallace asked Trump if he would introduce a federal mandate to wear face masks in public places where social distancing is not possible. â\u0080\u009cNo, I want people to have a certain freedom,â\u0080\u009d Trump replied. â\u0080\u009cI donâ\u0080\u0099t agree with the statement that if everyone wears a mask everything disappears.â\u0080\u009d Asked if he took responsibility for not having a federal policy on coronavirus during the interview, Trump replied, â\u0080\u009cLook, I take responsibility always for everything because itâ\u0080\u0099s ultimately my job too. I have to get everybody in line. Some governors have done well, some governors have done poorly. We have more testing by fair than any country in the world.â\u0080\u009d As of Wednesday, COVID-19 had infected nearly 15 million people globally. It had killed more than 616,990 people worldwide, according to Johns Hopkins Universityâ\u0080\u0099s Center for Systems Science and Engineering. New York, once the epicenter of the virus in the U.S., has still had the most deaths of any state (32,520), followed by New Jersey (15,737) and Massachusetts (8,450). CityWatch:CDC confirms that coronavirus already spreading in New York City when European travel ban went into effect in March On Feb 29, the surgeon general tweeted his opposition to the public wearing masks. â\u0080\u009cSeriously people: STOP BUYING MASKS!â\u0080\u009d he wrote. â\u0080\u009cThey are NOT effective in preventing general public from catching #coronavirus, but if health-care providers canâ\u0080\u0099t get them to care for sick patients, it puts them and our communities at risk!â\u0080\u009d He reversed course in April. The public was confused. N95 masks appear to be effective for health-care workers. One study says N95 medical-grade masks do help filter viruses that are larger than 0.1 micrometers. (One micrometer, um, is one millionth of a meter.) The coronavirus is 0.125 um. The masks have â\u0080\u009cefficacy at filtering smaller particles and are designed to fit tightly to the face,â\u0080\u009d the study said. The markets appear torn between optimism on the momentum behind positive vaccine research results and the impact of new infection surges, particularly in California, Arizona, Florida and Texas. The Dow Jones Industrial Index DJIA, +0.56% Â and S&P 500 SPX, +0.87% Â closed higher Tuesday as investors looked toward the prospect of further fiscal stimulus. The Nasdaq Composite COMP, +1.39% Â ended lower."}]}