{"article": [{"url": "https://www.marketwatch.com/story/sell-rosh-hashana-buy-yom-kippur-why-some-traders-put-stock-in-this-strategy-11600447900", "published": 1601292140.0, "headline": "Sell Rosh Hashana, buy Yom Kippur? Why some traders put stock in this strategy", "body": "It might seem like folly to base your investment decisions around holidays, but such a strategy—known unofficially as a “Sell Rosh Hashana, Buy Yom Kippur”—is one that some traders follow, even if purely for the novelty of watching what some have described as an interesting seasonal trend in markets. Friday evening marks the beginning of Rosh Hashana, the Jewish New Year, and ends on the evening of Sept. 20. The evening of Sept. 27 begins Yom Kippur, the day of atonement, which ends on the following evening. Traders looking at action over the 8-day period within the highest holy days on the Jewish calendar say they have spotted a pattern, in which the Dow Jones Industrial Average DJIA, +0.56% falls during Rosh Hashana and subsequently is bought, pushing stocks higher, when Yom Kippur kicks off. Dating back to 1971, the Dow has fallen 27 out of 49 Rosh Hashana holiday periods. Last year saw the Dow sink 1.4% over that stretch only to stage an ascent the day after Yom Kippur. “There is some validity to the market weakness during the high holidays but it also correlates with [third-quarter] weakness and lot of jockeying for position by traders,” Jeff Hirsch, editor of the Stock Trader’s Almanac, told MarketWatch. In a blog post, Hirsch explains that the basis for the trade “is that with many traders and investors busy with religious observance and family, positions are closed out and volume fades, creating a buying vacuum.” “It is the holiest time of the Jewish calendar and you do see a bit of a reduction of volume as people go atone for their sins and such, and go to be with their families for the New Year,” he told MarketWatch. He also notes that the period also comes during a month, September, that has traditionally been one of the weakest for the stock market overall. Traders are, indeed, looking at a rough patch ahead of them with markets processing the Federal Reserve’s most recent policy update and the Nov. 3 presidential elections looming large. That is not to even mention the fact that the economy is in the midst of a viral pandemic that has left much of the developed world in the worst recession in recent memory. So far, September is mostly living up to its billing for stock-market weakness. The Dow is off 2.1%, the S&P 500 SPX, +0.87% is off nearly 5% and the once-highflying Nasdaq Composite Index COMP, +1.39% has shed 8.4% so far this month, pushing it into correction territory since its Sept. 2 peak. To be sure, all three of those indexes are well above their late-March lows, which were sparked by economic calamity as the COVID-19 pandemic gripped the country. Statistically speaking, however, the efficacy of the Rosh Hashana/Yom Kippur trading strategy appears to be only slightly better than a coin toss. Still, traders don’t need much to see value in a razor-thin edge. “While being long Yom Kippur to Passover has produced 59% more advances, half as many losses and average gains of 6.7%,” Hirsch wrote in his blog."}]}