{"article": [{"url": "https://www.marketwatch.com/story/tyson-sued-by-families-of-3-iowa-workers-who-died-from-coronavirus-2020-06-25", "published": 1593110600.0, "headline": "Tyson sued by families of 3 Iowa workers who died from coronavirus", "body": "IOWA CITY, Iowa — The families of three workers who died after contracting the coronavirus in an Iowa meat plant outbreak sued Tyson Foods and its top executives Thursday, saying the company knowingly put employees at risk and lied to keep them on the job. The lawsuit alleges that Tyson TSN, -1.71% officials were aware the virus was spreading at the Waterloo pork processing plant by late March or early April but kept that information from employees and the public. As the outbreak grew, the company failed to implement safety measures, allowed some sick and exposed employees to remain on the production line, and falsely assured workers and the public that the plant was safe, the suit alleges. “Tyson intended by these false representations to deceive workers in the Waterloo facility ... and to induce them to continue working despite the uncontrolled COVID-19 outbreak at the plant and the health risks associated with working,” according to the lawsuit, which was filed in Black Hawk County district court. Tyson spokesman Gary Mickelson said the company was saddened by the deaths and that its “top priority is the health and safety of our workers.” He said Tyson has implemented safety measures that meet or exceed federal guidelines. Meatpacking plants have been hot spots for coronavirus because of their crowded conditions, prompting several to temporarily close. Thousands of workers have become infected and several dozen have died. The largest union representing meatpacking workers said Thursday that more than 14,000 employees at unionized plants have been infected with coronavirus and 65 have died. Meat companies including Smithfield Foods and JBS USA and retailers such as Amazon and Walmart have been sued by the families of workers who died from coronavirus. But the lawsuit filed Thursday against Tyson may be the first involving multiple victims at one workplace during the pandemic, according to news reports. Last week, Iowa Gov. Kim Reynolds signed a bill into law shielding businesses and health care providers from legal claims from people exposed to the virus, retroactive to Jan. 1. But the law has exceptions for injuries that result in hospitalization and death, and appears unlikely to block the case from moving forward. The lawsuit seeks damages for the estates of employees Sedika Buljic, 58, who died on April 18; Reberiano Garcia, 60, who died on April 23; and Jose Ayala, Jr., 44, who died on May 25. Waterloo attorneys Tom Frerichs and John Rausch and the Spence Law Firm in Wyoming are representing the families. At least two other Waterloo workers have died after contracting the virus, which infected more than 1,000 of the plant’s 2,800 workers and has devastated the broader community. With illnesses mounting, Tyson refused calls from local leaders to close the plant for several days and lobbied the governor to keep it open, the suit alleges. The county sheriff. who visited the plant April 10, has said he was shaken by seeing workers in crowded conditions without face coverings and pressed Tyson to close. The plant is Tyson’s largest pork facility and can process around 20,000 hogs per day. Iowa’s Occupational Safety and Health Administration inspected the plant April 20 in response to complaints, and said earlier this month it found no violations. The plant closed two days after the inspection before reopening with new safety measures in early May. In addition to damages for pain and suffering and loss of income, the lawsuit seeks punitive damages to punish Tyson for an “incorrigible, willful and wanton disregard for workplace safety” and to send a message to other companies. The lawsuit names the company as well as Chairman John H. Tyson, CEO Noel White, spokeswoman Liz Croston, and several other executives and plant supervisors. Its claims include gross negligence and fraudulent misrepresentation. John H. Tyson asserted in a newspaper ad in April that the “food supply chain is breaking” due to plant closures and warned that customers would see meat shortages at grocery stores. The lawsuit claims those warnings were exaggerated and notes that Tyson’s pork exports to China, including some from the Waterloo plant, increased significantly that month. The lawsuit makes an explosive claim that Tyson has denied previously: that the company allowed workers and subcontractors from another Iowa plant that had closed due to a coronavirus outbreak to begin working in Waterloo in April. Plant supervisors told employees that their sick coworkers had the flu and warned them not to discuss coronavirus at work, the suit alleges. One man who vomited while on the production line was allowed to keep working, it claims."}]}