{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-and-u-s-equity-futures-rise-as-11602230505", "published": 1602235160.0, "headline": "European stocks rise as American stimulus hopes stay alive", "body": "A waitress serves a customer on the terrace of restaurant in Marseille, southeastern France, on October 5, 2020. nicolas tucat/Agence France-Presse/Getty Images European equities traded higher on Friday, as investors kept hopes alive for an American stimulus deal, at the end of a positive week for markets. The Stoxx Europe 600 index SXXP, +0.55% rose 0.4% and is up 1.5% for the week, with one more session to go. The German DAX DAX, +0.06% was flat, while the French CAC 40 PX1, +0.71% rose 0.5%, and the FTSE 100 UKX, +0.64% gained 0.8%. U.S. stock futures ES00, +1.13% NQ00, +1.63% rose across the board, following on from Thursday’s gains, on fading worries over a contested election outcome and hopes for over a stimulus package, even if it doesn’t arrive until after that battle for the White House. President Donald Trump said on Thursday that stimulus talks with Democrats have turned productive, following his decision just days earlier to call them off. Hours later, Speaker of the House Nancy Pelosi said she still wanted a big deal. “EU stocks will continue to be fuelled by U.S. stimulus hopes and expectations of a ‘blue wave’ that is currently viewed as a stimulus friendly outcome at the November U.S. election,” said Stephen Innes, chief global market strategist at AxiCorp. “The recent rise in COVID-19 cases in Europe/ and tighter restrictions continued to generate lots of headlines but not much market reaction.” Elsewhere, a private gauge of China’s services-sector activity showed faster-than-expected growth in September. Mining shares, sensitive to news about China, a big consumer of natural resources, were higher. Shares of Anglo American UK:AAL rose nearly 5% and BHP BHP, +1.22% gained 2.3%. Economic news was less positive for the U.K., where the economy grew just 2.1% in August, disappointing forecasts for growth of 4.6%, and the slowest monthly gain since the initial coronavirus lockdowns. France reported a slowing pace of industrial production in August. Rising oil prices were lifting shares of heavily-weighted oil companies. Oil prices CL.1, -1.62% BRN00, -0.07% finished higher on Thursday as Hurricane Delta forced the shut-in of more than 90% of crude output in the Gulf of Mexico. Crude prices were steady on Friday. Shares of Total TOT, +0.91%, Royal Dutch Shell RDSA, +1.90%, and BP BP, +0.56% all rose more than 1%. European semiconductor-related stocks rose after shares of NXP Semiconductors NXPI, +4.96% rallied late in the U.S. on Thursday, due to a higher outlook. And Advanced Micro Devices AMD, -3.94% is in advanced talks to buy rival chip maker Xilinx in a deal that could be worth more than $30 billion, The Wall Street Journal reported, citing people familiar with the matter. Shares of Infineon Technologies IFX, +2.51% and ASM International gained 3% each, and those for Dialog Semiconductor DLG, +0.77% rose 1.2%, and ASML Holding ASML, +2.12% rose 1.7%. Shares of Rolls-Royce Holdings RR, +14.25% were again rising, up 13%. Shares have gained 95% this week, but remain 67% lower year to date. The London Stock Exchange LSE, +0.40% has agreed to sell its entire shareholdering in the parent company of Borsa Italia to Euronext ENX, -4.39% in a deal valued at €4.33 billion ($5.09 billion). LSE shares rose 0.8%, while Euronext stock rose 0.9%. On the downside, shares of BASF BASF, -4.15% fell more than 2%, after the German chemicals giant warned on Friday of a big write-down due to declining demand in the automotive and aviation industries BASF said it will lose €2.12 billion in the third quarter, mostly due to a €2.8 billion write-down."}]}