{"article": [{"url": "https://www.marketwatch.com/story/owners-warned-stop-kissing-pets-as-uk-latest-to-sound-the-alert-over-cat-infected-with-coronavirus-2020-07-28", "published": 1596012140.0, "headline": "Owners warned stop kissing pets as U.K. latest to sound the alert over cat infected with coronavirus", "body": "A six-year-old siamese cat has become the first animal in the U.K. infected with coronavirus, just weeks after the U.S. announced the first infection in two pet cats in New York state. The U.K.’s chief veterinary officer confirmed the virus responsible for COVID-19 has been detected in the pet cat in the U.K. It had suffered a shortness of breath. An increasing number of pets has caught the virus, but infections have been reported in relatively few animals worldwide. In April, the U.S. Centers for Disease Control and Prevention and the U.S. Agriculture Department’s National Veterinary Services Laboratories announced the first confirmed cases of SARS-CoV-2 infection in two pet cats. Around the same time, a 17-year-old Pomeranian dog died after being cleared of coronavirus in Hong Kong, and a female Malayan tiger tested positive at the Bronx Zoo in New York. In the U.K., the infection was confirmed following tests at the Animal and Plant Health Agency laboratory in Weybridge, Surrey. Chief veterinary officer Christine Middlemiss said: “All available evidence suggests that the cat contracted the coronavirus from its owners who had previously tested positive for COVID-19. The cat and its owners have since made a full recovery and there was no transmission to other animals or people in the household. “Although this is the first confirmed case of an animal infection with the coronavirus strain in the U.K., there is no evidence to suggest that the animal was involved in transmission of the disease to its owners or that pets or other domestic animals are able to transmit the virus to people.” Read:Coronavirus tally: Global cases of COVID-19 hit 16.5 million The case has been reported to the World Organization for Animal Health in line with international commitments. There have been a very small number of confirmed cases in pets in other countries in Europe, North America and Asia. Experts have warned owners not to kiss their cats, share food or sleep with them. Margaret Hosie, professor of comparative virology at the University of Glasgow, told the Guardian: “Don’t kiss your cat. Don’t have the cat sleeping in a bed with you, and don’t share food with the cat.” Read:These diagnostic dogs may be able to quickly spot people with coronavirus"}]}