{"article": [{"url": "https://www.marketwatch.com/story/kamala-harris-says-supreme-court-nominee-amy-coney-barrett-will-overturn-obamacare-2020-09-28", "published": 1601391560.0, "headline": "Kamala Harris says Supreme Court nominee Amy Coney Barrett 'will overturn' Obamacare", "body": "“ 'President Trump and his party and Judge Barrett will overturn the Affordable Care Act. And they won't stop there. They have made clear that they want to overturn Roe vs. Wade and restrict reproductive rights and freedoms.' ” - Democratic vice-presidential nominee Kamala Harris The line above came Monday afternoon from Democratic vice-presidential nominee Kamala Harris, as she gave a speech in the swing state of North Carolina on President Donald Trump's push to fill the current vacancy on the Supreme Court. Joe Biden's running mate also criticized Trump and the Republican-led Senate's decision to ignore the late liberal Supreme Court Justice Ruth Bader Ginsburg's \"final wish to hold off the nomination to replace her until after the next president is chosen\" - and asked voters to make them pay on Nov. 3. \"You can make it very clear very soon how you feel about being cut out of this Supreme Court nomination process,\" Harris said in her address at Shaw University in Raleigh, N.C. The Trump administration is waging a legal fight against the Affordable Care Act, also known as Obamacare, arguing that it must be scrapped a decade after its overhaul of U.S. health care XLV, +0.90%. The Supreme Court is slated to hear arguments on the matter on Nov. 10. Related:The Supreme Court's Obamacare case was high stakes before Amy Coney Barrett's nomination. Here's why it's even more important now And see:Here's where Trump and Biden stand on health care But Nicholas Bagley, a University of Michigan law professor, is among the experts who have argued that it's not clear how Trump's Supreme Court pick, Amy Coney Barrett, would rule in the suit, which he said is \"significantly weaker\" than a past challenge to the ACA. \"I think ACA supporters should be concerned,\" Bagley told NBC News. \"Not panicked: The lawsuit is weak and the Supreme Court is unlikely to endorse it. But a small risk of a bad thing is worth worrying about.\" On Roe vs. Wade, the landmark 1973 ruling on abortion, Barrett said in 2013 that the \"public response to controversial cases like Roe reflects public rejection of the proposition that [precedent] can declare a permanent victor in a divisive constitutional struggle rather than desire that precedent remain forever unchanging. Court watchers embrace the possibility of overruling, even if they may want it to be the exception rather than the rule.\" She also said in 2016 that she doesn't think the right to abortion is likely to change, but \"some of the restrictions would change.\" The Senate Judiciary Committee is expected to have Barrett's confirmation hearing begin Oct. 12 with opening statements from the panel's members and the judge, with questioning to start Oct. 13. Harris, California's junior senator and a member of the committee, told reporters on Monday that she planned to take part in those proceedings. \"I am definitely going to be involved in the hearings and performing my role and responsibility on the Senate Judiciary Committee,\" Harris said. This is an updated version of a report first published on Sept. 28, 2020."}]}