{"article": [{"url": "https://www.marketwatch.com/story/almost-12-million-babies-could-die-during-the-pandemic-but-not-from-the-coronavirus-2020-07-02", "published": 1593705140.0, "headline": "Almost 1.2 million babies could die during the pandemic â\u0080\u0094 but not from the coronavirus", "body": "Pandemic disruptions of health services and food supply chains may be more deadly for young children and pregnant women than the novel coronavirus itself. Thatâ\u0080\u0099s according to a dire new report from Johns Hopkins Bloomberg School of Public Health published in The Lancet Global Health journal. It warns that more than 6,000 additional children under five could die every day from preventable causes over the next six months, as a result of the COVID-19 pandemic and shutdowns to stem its spread weakening health care systems and threatening the food supply and social services in low-income and middle-income countries. The study, which was funded in part by Microsoft MSFT, +2.48% founder Bill Gatesâ\u0080\u0099 philanthropic organization, the Bill & Melinda Gates Foundation, saw researchers model three different scenarios where maternal and child health interventions (such as antibiotics and sanitary birth environments during child delivery, access to nutritious food, vaccinations and other health services) were reduced by varying degrees in 118 countries. And in the worst-case scenario where these services were cut by more than 50%, nearly 1.2 million additional babies and 57,000 mothers could die in six months. The least severe scenario still saw 253,500 additional child deaths and 12,200 additional maternal deaths. These potential child deaths would be in addition to the 2.5 million children who already die before their fifth birthday every six months in the 118 countries included in the study, UNICEF noted, which would reverse almost a decade of progress toward ending preventable mortality in children younger than five. Related:What we do know â\u0080\u0094 and donâ\u0080\u0099t know â\u0080\u0094 about the coronavirus at day 100 of the pandemic â\u0080\u009cUnder a worst-case scenario, the global number of children dying before their fifth birthdays could increase for the first time in decades,â\u0080\u009d said UNICEF executive director Henrietta Fore in a statement. â\u0080\u009cWe must not let mothers and children become collateral damage in the fight against the virus. And we must not let decades of progress on reducing preventable child and maternal deaths be lost.â\u0080\u009d According to the Johns Hopkins models, the 10 countries at risk for the most additional child deaths include Bangladesh, Brazil, the Democratic Republic of the Congo, Ethiopia, India, Indonesia, Nigeria, Pakistan, Uganda and the United Republic of Tanzania. And the 10 countries that would suffer the highest excess child mortality rates under the worst-case scenario would be Djibouti, Eswatini, Lesotho, Liberia, Mali, Malawi, Nigeria, Pakistan, Sierra Leone and Somalia. UNICEF, which published a commentary included in the Lancet report, also warned of several other ripple effects from the pandemic that could be devastating for families. For example, nearly 1.3 billion students â\u0080\u0094 more than 72% â\u0080\u0094 are out of school right now as a result of nationwide school closures in 177 countries to stop the spread of COVID-19. And besides missing out on education and socialization, millions of kids are also more food insecure as a result, since nearly 370 million children across 143 countries depend on school meals for a reliable source of daily nutrition. Whatâ\u0080\u0099s more, some 117 million children in 37 countries may miss out on their measles vaccinations (as of April 14) as the pandemic has paused immunization campaigns. But thatâ\u0080\u0099s not to say that higher-income countries are completely in the clear. A survey conducted by the American College of Emergency Physicians at the end of April indicated that a third of all Americans were delaying or avoiding medical treatment during the pandemic, including emergency care. And while the United States has plenty of food available, shoppers have repeatedly run into empty supermarket shelves during the pandemic as the countryâ\u0080\u0099s food supply chain has grappled with such challenges as meat-processing plants closing as workers fell sick with COVID-19; stockpiling by panic-shopping consumers, as well as the foodservice industry struggling to pivot from preparing food for restaurants and schools to packaging it for retailers. Read more:We have plenty of food, so why are grocery store shelves so empty? Even when shelves are full, tens of millions of Americans have lost their jobs during the pandemic. A new Census Bureau report released Wednesday found that about 11.8 million children are living in households that have missed a mortgage or rent payment or sought a deferment during the pandemic, while 3.9 million children are experiencing food shortages stemming from the pandemic â\u0080\u0094 and nearly 1.3 million kids live in households that are experiencing both. There has also been ongoing concern about domestic violence spiking as more women and children are unable to avoid abuse or other dangerous situations in their homes due to lockdown measures that have closed schools, workplaces and community spaces that may have provided some escape, or the means to get help. Calls to the New York State Domestic Violence hotline have jumped 30%, for example, and New York Gov. Andrew Cuomo said that the state has seen an â\u0080\u009calarming spikeâ\u0080\u009d in domestic violence reports during the COVID-19 crisis. Read more:â\u0080\u0098Weâ\u0080\u0099ve seen an alarming spike in domestic violence reports:â\u0080\u0099 For some women, itâ\u0080\u0099s not safe to leave the house OR stay home â\u0080\u009cIf routine health care is disrupted and access to food is decreased (as a result of unavoidable shocks, health system collapse, or intentional choices made in responding to the pandemic), the increase in child and maternal deaths will be devastating,â\u0080\u009d the new Lancet report concluded. â\u0080\u009cWe hope these numbers add context as policy makers establish guidelines and allocate resources in the days and months to come.â\u0080\u009d One bright spot for parents during the pandemic that has infected more than 10.7 million and killed almost 517,000 people worldwide as of Thursday morning is that children are less likely to be infected with COVID-19 â\u0080\u0094 and when they are, symptoms are generally milder in children than in adults. In a recent Pediatrics study of COVID-19 in Chinese children, 90% of the kids who tested positive had mild symptoms, if they had any symptoms at all. Yet there have also been cases of a rare but possibly life-threatening multisystem inflammatory syndrome in children that appears to be related to COVID-19. Read more:What parents should know about the mysterious coronavirus-related disease affecting kids: multisystem inflammatory syndrome in children The CDC also recently updated its guidance for pregnant women, warning that expecting moms are more likely to be hospitalized for COVID-19, and they also bear a higher risk of needing intensive care or going on a ventilator than women who arenâ\u0080\u0099t pregnant. Stay up-to-date with MarketWatchâ\u0080\u0099s coronavirus coverage here."}]}