{"article": [{"url": "https://www.marketwatch.com/story/trump-taps-conservative-barrett-for-supreme-court-2020-09-26", "published": 1601146580.0, "headline": "Trump taps conservative Barrett for Supreme Court", "body": "President Donald Trump nominated Judge Amy Coney Barrett to the Supreme Court on Saturday, capping a dramatic reshaping of the federal judiciary that will resonate for a generation and that he hopes will provide a needed boost to his reelection effort. Barrett, a former clerk to the late Justice Antonin Scalia, said she was “truly humbled” by the nomination and quickly aligned herself with Scalia’s conservative approach to the law, saying his “judicial philosophy is mine, too.” Barrett, 48, was joined in the Rose Garden by her husband and seven children. If confirmed by the Senate, she would fill the seat vacated by liberal icon Ruth Bader Ginsberg. It would be the sharpest ideological swing since Clarence Thomas replaced Justice Thurgood Marshall nearly three decades ago. She would be the sixth justice on the nine-member court to be appointed by a Republican president, and the third of Trump’s first term in office. Trump hailed Barrett as “a woman of remarkable intellect and character,” saying he had studied her record closely before making the pick. Republican senators are lining up for a swift confirmation of Barrett ahead of the Nov. 3 election, as they aim to lock in conservative gains in the federal judiciary before a potential transition of power. Trump, meanwhile, is hoping the nomination will galvanize his supporters as he looks to fend off Democrat Joe Biden. For Trump, whose 2016 victory hinged in large part on reluctant support from white evangelicals on the promise of filling Scalia’s seat with a conservative, the latest nomination in some ways brings his first term full circle. Even before Ginsburg’s death, Trump was running on having confirmed in excess of 200 federal judges, fulfilling a generational aim of conservative legal activists. Trump joked that the confirmation process ahead “should be easy” and “extremely noncontroversial,” though it is likely to be anything but. No court nominee has been considered so close to a presidential election before, with early voting already underway. He encouraged legislators to take up her nomination swiftly and asked Democrats to “refrain from personal and partisan attacks.” In 2016, Republicans blocked President Barack Obama’s nomination of Merrick Garland to the Supreme Court to fill the election-year vacancy, saying voters should have a say in the lifetime appointment. Senate Republicans say they will move ahead this time, arguing the circumstances are different now that the White House and Senate are controlled by the same party. Senate Majority Leader Mitch McConnell said the Senate will vote “in the weeks ahead” on Barrett’s confirmation. Hearings are set to begin Oct. 12. Senate Democratic leader Chuck Schumer and House Speaker Nancy Pelosi warned that a vote to confirm Barrett to the high court would be a vote to strike down the Affordable Care Act. Schumer added that the president was once again putting “Americans’ healthcare in the crosshairs” even while the coronavirus pandemic rages. The set design at the Rose Garden, with large American flags hung between the colonnades, appeared to be modeled on the way the White House was decorated when President Bill Clinton nominated Ginsburg in 1993. Barrett, recognizing that flags were still lowered in recognition of Ginsburg’s death, said she would be “mindful of who came before me.” Although they have different judicial philosophies, Barrett praised Ginsburg as a trailblazer for women and for her friendship with Scalia, saying, “She has won the admiration of women across the country and indeed all across the world.” Within hours of Ginsburg’s death, Trump made clear he would nominate a woman for the seat. Barrett was the early favorite and the only one to meet with Trump. Barrett has been a judge since 2017, when Trump nominated her to the Chicago-based 7th U.S. Circuit Court of Appeals. But as a longtime University of Notre Dame law professor, she had already established herself as a reliable conservative in the mold of Scalia, for whom she clerked in the late 1990s. She would be the only justice on the current court not to have received her law degree from an Ivy League school. The eight current justices all attended either Harvard or Yale. The staunch conservative had become known to Trump in large part after her bitter 2017 appeals court confirmation included allegations that Democrats were attacking her Catholic faith. The president also interviewed her in 2018 for the vacancy created by the retirement of Justice Anthony Kennedy, but Trump ultimately chose Brett Kavanaugh. Trump and his political allies are itching for another fight over Barrett’s faith, seeing it as a political windfall that would backfire on Democrats. Catholic voters in Pennsylvania, in particular, are viewed as a pivotal demographic in the swing state that Biden, also Catholic, is trying to recapture. While Democrats appear powerless to stop Barrett’s confirmation in the GOP-controlled Senate, they are seeking to use the process to weaken Trump’s reelection chances. Barrett’s nomination could become a reckoning over abortion, an issue that has divided many Americans so bitterly for almost half a century. The idea of overturning or gutting Roe v. Wade, the landmark 1973 decision that legalized abortion, has animated activists in both parties for decades. Now, with the seemingly decisive shift in the court’s ideological makeup, Democrats hope their voters will turn out in droves because of their frustration with the Barrett pick. Trump has also increasingly embraced the high court — on which he will have had an outsize hand in reshaping -– as an insurance policy in a close election. Increases in mail, absentee and early voting brought about by the coronavirus pandemic have already led to a flurry of election litigation, and both Trump and Biden have assembled armies of lawyers to continue the fight once vote-counting begins. Trump has been open about tying his push to name a third justice to the court to a potentially drawn-out court fight to determine who will be sworn in on Jan. 20, 2021. “I think this will end up in the Supreme Court,” Trump said Wednesday of the election. “And I think it’s very important that we have nine justices.” No Democratic senators are expected to vote to confirm Barrett before the election, even though some did support her in 2017. Two Democrats still serving in the Senate who voted to confirm Barrett in 2017, Sen. Tim Kaine of Virginia and Sen. Joe Manchin of West Virginia, now say it’s too close to the election to consider her nomination. Meanwhile, outside conservative groups are planning to spend more than $25 million to support Trump and his nominee. The Judicial Crisis Network has organized a coalition that includes American First Policies, the Susan B. Anthony List, the Club for Growth and the group Catholic Vote to help confirm Barrett. The Republican National Committee has launched a $10 million digital campaign of its own, in conjunction with Trump’s reelection campaign."}]}