{"article": [{"url": "https://www.marketwatch.com/story/amd-eyes-100-billion-market-cap-as-more-analysts-see-market-share-grab-from-intel-2020-08-04", "published": 1596558800.0, "headline": "AMD closes just shy of $100-billion market cap, as more analysts see it taking market share from Intel", "body": "Advanced Micro Devices Inc.’s stock soared to fresh records Tuesday after another analyst hiked his price target on the chip company, driving it to a market cap just shy of $100 billion. AMD AMD, -3.94% shares spent Tuesday carving out new intraday records, and closed up 9.5% at $85.04 for a new closing record and a market cap of $99.84 billion. The stock’s intraday high of $85.81 put the company at a market cap of more than $100 billion for the first time, and a close of $85.18 would have put AMD just over the $100 billion mark. AMD’s stock last closed at a record $78.20 on July 30, fresh from AMD’s strong earnings and indications that the company’s market share gain from Intel Corp. INTC, -1.03% was quickening. Intel shares, for their part, finished up 1.7% at $49.13, giving the company a market cap of $208.95 billion. In late July, Intel said it was delaying the release of its 7-nanometer chips until at least late 2022 because of manufacturing issues. In chip parlance, nanometers, or nm, refers to the size of the transistors that go on a computer chip, with the general rule being that smaller transistors are faster and more efficient in using power. AMD, on the other hand, already sells 7-nm chips, and has spent 2020 releasing more and more versions of them. In a Tuesday note, Jefferies analyst Mark Lipacis, who has a buy rating on AMD, raised his price target to $95 from $86. Lipacis said the lead of AMD, and its chip fabricator Taiwan Semiconductor Manufacturing Co. TSM, +1.11%, over Intel appeared “systemic.” Lipacis said he expects AMD share gains to accelerate, especially in the server market, with an estimated 30% share over the next two to three years, and 50% in four to five years. In its recent earnings call, AMD said it had just reached 10% share of the server market. BofA Securities analyst Vivek Arya, who has a buy rating, had forecast a $100 billion AMD in a Sunday note, after hiking his price target on the stock to $100. Arya said AMD is well on its way back to its peak market share of 20% of the PC market and 25% of the server market as Intel struggles. On AMD’s big upsides, Arya said AMD’s PC CPUs are \"equally competitive (or in some cases superior) products that still sell at a 15%-45% discount” to Intel’s. Of the 36 analysts who cover AMD, 15 have overweight or buy ratings, 18 have hold ratings, and three have sell ratings, with an average price target of $75.76, according to FactSet data. For the year, AMD shares are up 85%, while Intel shares are down 18%. Pacing AMD are shares of Nvidia Corp. NVDA, -0.54%, which are up 91%, valuing the company at $276.20 billion. Meanwhile, the S&P 500 index SPX, +0.87% is up 2.4% for the year, while the tech-heavy Nasdaq Composite Index COMP, +1.39% is up 22%, and the PHLX Semiconductor Index SOX, +1.77% is up 19%."}]}