{"article": [{"url": "https://www.marketwatch.com/story/tesla-stock-surges-past-1000-amid-elon-musks-push-for-tesla-semi-2020-06-10", "published": 1591808300.0, "headline": "Tesla stock surges past $1,000 on Elon Musk's push for Tesla Semi", "body": "Shares of Tesla Inc. rose more than 9% on Wednesday after Chief Executive Elon Musk urged the company \"to go all out\" on the production of the Tesla Semi, its electric freight truck, amid a surge in investor interest about an emerging competitor. Tesla TSLA, +1.89%  stock closed at a record $1,025.05. It traded as high as $1,027.48. The company's market cap swelled to $190 billion, a stone's throw from supplanting Japan's Toyota Motor Corp. TM, -0.65%  7203, -0.95%  as the world's highest valued car maker. Toyota's market value hovers at $216 billion. A memo from Musk, first reported by Electrek, an online publication mostly focused on the Silicon Valley car maker, said that it was \"time to go all out and bring the Tesla Semi to volume production.\" Musk went on to say that the commercial truck's batteries and powertrain would be made at Tesla's Nevada battery factory with other work likely taking place \"in other states.\" Musk's memo comes amid a rally for the shares of Nikola Corp. NKLA, -1.36%, an Arizona-based electric-truck startup that went public last week. See also: Tesla's Elon Musk gets performance-based payday worth nearly $800 million Nikola is developing commercial and passenger vehicles using batteries and hydrogen fuel cell technology, and the stock has more than doubled since it began trading publicly. Nikola shares traded as low as $64.95 on Wednesday. Musk's memo also left open the possibility that the making of Semi parts or the truck's assembly work could take place at Tesla's next U.S. factory. The company reportedly has picked Austin, Texas, and Tulsa, Okla., as finalists for its new U.S. assembly plant. No official decision has been made. Musk last month defied local shelter-in-place orders to reopen its sole U.S. car-making factory in Fremont, Calif., after igniting Twitter and legal rants that included the threat to move out of the San Francisco Bay Area entirely. Related:Elon Musk vs. Bay Area officials: These emails show what happened behind the scenes in the Tesla factory fight The Tesla Semi had flown under the radar in recent months, when most of Tesla news was focused on the Model Y, the compact SUV that is the newest Tesla vehicle, sales of its Model 3 mass-market sedan in China, and speculation about the locations for the company's next U.S. and European factories. A concept Tesla Semi was unveiled in November 2017, with a base model expected to cost around $150,000. Tesla has been taking reservations for the truck, requiring $20,000 upfront, broken down as a $5,000 credit-car payment and $15,000 wire transfer. The commercial truck was expected to be available in 2019, and several companies, including J.B. Hunt Transport Services Inc. JBHT, -0.05%, Wal-Mart Inc. WMT, +1.00%  and United Parcel Service Inc. UPS, +0.27%  have placed orders. Tesla shares have gained 140% this year, contrasting with losses of 1% and 5% for the S&P 500 index SPX, +0.87%  and the Dow Jones Industrial Average. DJIA, +0.56% "}]}