{"article": [{"url": "https://www.marketwatch.com/story/trump-threatens-federal-funding-for-schools-says-he-disagrees-with-cdc-over-reopening-guidelines-2020-07-08", "published": 1594213100.0, "headline": "Trump threatens federal funding for schools, says he disagrees with CDC over reopening guidelines", "body": "President Donald Trump on Wednesday threatened federal funding for schools and said he disagreed with CDC guidelines for reopening them, increasing pressure on educational institutions even as coronavirus cases are soaring in some states. On Twitter, Trump said reopening guidelines from the Centers for Disease Control and Prevention are “very impractical” and that he would be meeting with the organization. Those guidelines currently include spacing desks at least 6 feet apart and cleaning frequently touched surfaces, according to CDC Director Robert Redfield. Trump didn’t say which of the guidelines he disagreed with. iframe.twitter-tweet { width: 100% !important; } Redfield told reporters that his agency will issue new guidance in the coming days and said keeping schools closed is not the intent. “It is critical that we get these schools open,” he said at a briefing at the Education Department. Vice President Mike Pence told reporters at the same event that the administration will “work with” schools if any of the recommendations present barriers to children returning to classrooms. In a separate tweet, Trump said school reopening is important for children and families. “May cut off funding if not open!” he tweeted, without elaboration. Pence signaled that the White House would tie funding in the next coronavirus recovery package to reopening, saying the administration will look for a “strong incentive” to get kids back to school. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Trump’s tweets followed his call on Tuesday during a White House event for schools to reopen, even as the country neared its 3 millionth case of the coronavirus disease COVID-19, alongside nearly 131,000 deaths. “We want to reopen the schools,” said Trump. “It’s time to do it.” “It’s very important for the well-being of the student and the parents,” Trump said. “So we’re going to be putting a lot of pressure on: Open your schools in the fall,” he said. Even as Trump made his preference clear, administration officials on Tuesday said the decision to reopen is up to local jurisdictions. Some public schools have announced plans to bring students back for only a few days a week, an option that Education Secretary Betsy DeVos on Tuesday said was unacceptable. During a call with governors Tuesday, DeVos criticized plans by Virginia’s Fairfax County Public Schools to have families decide between fully remote instruction or two days a week at school. “A choice of two days a week in the classroom is not a choice at all,” DeVos said, according to audio of the call obtained by the Associated Press. U.S. stocks DJIA, +0.56% rose in Wednesday’s trade, led by the tech-heavy Nasdaq COMP, +1.39%, even as investors dealt with an acceleration of coronavirus infections in the U.S. and escalating tensions between Washington and Beijing. See Market Snapshot. The Associated Press contributed to this story. Sign up for Trump Today and more MarketWatch newsletters."}]}