{"article": [{"url": "https://www.marketwatch.com/story/the-cares-act-could-keep-poverty-rates-at-pre-pandemic-levels-but-researchers-worry-what-will-happen-when-the-money-runs-out-2020-06-23", "published": 1593076640.0, "headline": "White House 'very seriously considering' another stimulus bill - here's how the CARES Act has impacted poverty rates", "body": "The Trump administration is \"very seriously considering\" another stimulus bill as the coronavirus pandemic continues, Treasury Secretary Steven Mnuchin said Tuesday. Speaking to Bloomberg three months after lawmakers passed the $2.2 trillion Coronavirus Aid, Relief and Economic Security (CARES) Act, Mnuchin revealed few details on what a new round of fiscal relief would look like, though he did say it will be \"much more targeted to the businesses that are impacted.\" As for the funds that are already being disbursed under the CARES act, Mnuchin said, \"There's no question that money is having a major impact on the economy.\" In a separate interview Tuesday with Time Magazine, Mnuchin said a bill could take shape next month. While Republican and Democratic lawmakers figure out the provisions for another bill, researchers say the CARES Act is helping families now - as long as they can access the money. Stimulus checks and expanded unemployment payments could help keep America's poverty rate around where it was before the coronavirus outbreak, according to new research from Columbia University. One measure of poverty would have climbed from an estimated 12.5% rate to 16.3% without any sort of federal intervention, the researchers said. (Great Recession-era levels peaked at approximately 16%, according to U.S. Census Bureau data.) But because of the money from stimulus checks and expanded unemployment, that poverty rate stayed at an estimated 12.7%, the Columbia researchers projected. A four-person family with two kids under age 18 is considered to live under the poverty threshold if their income is under $25,926 a year, according to the Census Bureau's 2019 threshold, its most recent figure. The Columbia researchers' calculations assume \"medium access\" to the money, which means 70% of eligible people received stimulus checks and 60% of recently unemployed people received their expanded unemployment. The stimulus checks paid $1,200 to every eligible adult making under $75,000 or $2,400 for a married couple earning under $150,000. The government also cut $500 checks for every eligible child. The Internal Revenue Service had issued 159 million stimulus payments as of early June, the agency said. The stimulus bill also paid unemployed workers $600 a week on top of state unemployment benefits. That extra federal money will end at the end of July. As the pandemic shut businesses, unemployment soared from decades-low rates to double-digit territory, standing at 13.3% in May. As lawmakers debate another relief bill, the Columbia study serves as another illustration of how important the stimulus money has been for the millions of Americans who have received benefits and stimulus checks. The findings also underscore the potential harm for people who are missing out on the money. For example, approximately 7% of people said they unsuccessfully applied for unemployment benefits or gave up because the process was too tough, according an approximate 25,000-person survey in April from the left-leaning Economic Policy Institute. The stimulus bill has been a \"critically important anti-poverty measure,\" according to the researchers, Zachary Parolin, Megan Curran and Christopher Wimer. But bureaucratic barriers to get unemployment benefits and certain deadlines to reap stimulus check money \"threaten to weaken the poverty reduction potential of the CARES Act,\" they added. The study also raises the question of what will happen later this summer after the stimulus checks are paid out and the enhanced unemployment payments stop at the end of July. “ 'If high unemployment rates persist, additional income support will likely be needed to mitigate hardship in the short-term and prevent subsequent rises in poverty and economic insecurity moving forward.' ” - Authors in 'The CARES act and poverty in the COVID-19 crisis' \"If high unemployment rates persist, additional income support will likely be needed to mitigate hardship in the short-term and prevent subsequent rises in poverty and economic insecurity moving forward,\" they wrote. See also:What to do if someone else is fraudulently claiming your unemployment benefits The U.S. Census Bureau has two ways to gauge poverty levels. There's the official measure, which focuses on gross pre-tax cash income and the \"supplemental poverty measure,\" which focuses of after-tax money and a broader base of potential benefits. The study focused on the second measure. The researchers emphasized that they used monthly census income data from April to aid their simulation. Though they were looking at yearly projected poverty rates, they acknowledged the yearly rate wouldn't capture the \"immediate hardship\" of many families as they waited for money - or their problems if income dries up after the stimulus money runs out. 'A significant number of families are explicitly left out' Approximately 30 million people are unable to access stimulus money because of eligibility rules surrounding stimulus checks and unemployment benefits, the researchers said. This includes approximately 15 million people who are 17 and above, who are still being claimed as dependents by their families for tax purposes. See also: 'My mother claimed me as a dependent in 2019, but I was not aware of this.' What can I do to claim my $1,200 stimulus check? Approximately 15 million people in immigrant families are also left out of the stimulus money, they study said. The rules on stimulus check eligibility and immigration status can get complicated. For example, green card holders are eligible for a check, but not necessarily their spouse. Likewise, both people in a married couple need a Social Security number to get the stimulus check, the IRS says. If one person has an \"individual taxpayer identification number,\" a tax number for non-citizens, the IRS says the couple cannot collect the check. Several lawsuits have challenged the rules on stimulus checks and immigration status. In some pending class-action cases, U.S. citizens contend they are missing out on stimulus money because they are married to non-citizens. They are being punished because of who they choose to marry, they say. In one case, seven U.S. citizen children born in the states to non-citizen parents argue they are being deprived of their $500 stimulus checks because of their parents' immigration status. Either one or both of their parents are undocumented immigrants, court papers said. Last week, District of Maryland Federal Judge Paul Grimm said the children could proceed with the case. He denied the government's dismissal motion and scheduled more briefing in the case for next month. The Justice Department and Treasury Department did not immediately respond to a request for comment."}]}