{"article": [{"url": "https://www.marketwatch.com/story/biden-to-outline-how-hed-equitably-distribute-covid-19-vaccine-2020-09-16", "published": 1600276520.0, "headline": "Biden promises â\u0080\u0098effective distribution planâ\u0080\u0099 for coronavirus vaccine, calls U.S. economy â\u0080\u0098more equitableâ\u0080\u0099 in Obama era", "body": "Joe Biden talked up how his administration would go about distributing a COVID-19 vaccine, as the coronavirus pandemic features ever more significantly in the White House race. The Democratic presidential nominee also addressed polls that show President Donald Trump has an edge when it comes to economic issues. â\u0080\u009cIf Iâ\u0080\u0099m elected president, Iâ\u0080\u0099ll begin by implementing an effective distribution plan from the minute I take office,â\u0080\u009d Biden said in a speech in Wilmington, Del., following a briefing by public health experts. â\u0080\u009cI will provide the leadership necessary to carry out that plan. Iâ\u0080\u0099ll level with the American people, Iâ\u0080\u0099ll take responsibility, and Iâ\u0080\u0099ll support â\u0080\u0094 rather than take down â\u0080\u0094 the experts responsible for the day-to-day execution of the plan. Iâ\u0080\u0099ll simply follow the science.â\u0080\u009d The former vice president addressed concerns that the Trump administration may try to rush out a vaccine ahead of the Nov. 3 election, saying politics shouldnâ\u0080\u0099t â\u0080\u009cinterfere with the vaccine in any way.â\u0080\u009d During a brief question-and-answer period with reporters after his speech, Biden â\u0080\u0094 who served as former President Barack Obamaâ\u0080\u0099s No. 2 â\u0080\u0094 pushed back on a question about Trumpâ\u0080\u0099s advantage when it comes to the economy. The Democratic challenger said he has been out of office for four years, and thatâ\u0080\u0099s â\u0080\u009ca long time,â\u0080\u009d so â\u0080\u009citâ\u0080\u0099s a matter of my being able to communicate my position on jobs and trade and what I would do.â\u0080\u009d â\u0080\u009cWe actually created more jobs in the last three years of our administration than he created in the first four years of his administration. We actually had more equitable distribution among middle class folks and the like â\u0080\u0094 there were fewer people at risk,â\u0080\u009d Biden said. He also noted a World Trade Organization ruling on Tuesday against the Trump administrationâ\u0080\u0099s tariffs on China, saying the Obama administration â\u0080\u009cwon every single timeâ\u0080\u009d with the WTO. Globally, the number of confirmed cases of the coronavirus that causes COVID-19 is moving closer to 30 million. The U.S. accounts for 6.6 million of those cases, according to data aggregated by Johns Hopkins University. Polling shows Biden has the edge over Trump on whom voters trust more to handle the pandemic. In August, a Wall Street Journal/NBC News poll found that 58% of registered voters disapproved of Trumpâ\u0080\u0099s pandemic management. Now see:Trump, Xi and Putin are least trusted leaders during pandemic; Merkel is most trusted The pandemic has been thrust anew into the campaign by Trumpâ\u0080\u0099s acknowledgment to journalist Bob Woodward that he played down the seriousness of the coronavirus in his public remarks for weeks. Trump responded by saying he was trying to prevent panic. The federal government, meanwhile, outlined a sweeping plan Wednesday to make vaccines for COVID-19 available for free to all Americans, even as polls show a strong undercurrent of skepticism rippling across the U.S. In a report to Congress and an accompanying â\u0080\u009cplaybookâ\u0080\u009d for states and localities, federal health agencies and the Defense Department sketched out complex plans for a vaccination campaign to begin gradually in January or possibly later this year, eventually ramping up to reach any American who wants a shot. The main U.S. stock gauges SPX, +0.87% DJIA, +0.56% Â COMP, +1.39% Â closed mostly lower Wednesday, as investors parsed a reading on U.S. retail sales in August and a policy update from the Federal Reserve. The Associated Press contributed to this story."}]}