{"article": [{"url": "https://www.marketwatch.com/story/here-are-two-stocks-that-stand-to-benefit-from-californias-electric-vehicle-push-2020-09-24", "published": 1601131040.0, "headline": "Here are two stocks that stand to benefit from Californiaâ\u0080\u0099s electric-vehicle push", "body": "California is aiming to ban sales of new gas-powered vehicles by 2035, and Morgan Stanley has two stock picks for those willing to play a long game. One is, of course, Tesla Inc. TSLA, +1.89%, the electric-car maker based in California. The other â\u0080\u009cbest positioned on this announcementâ\u0080\u009d is Aptiv PLC APTV, +0.09%, the global auto-parts company based in Dublin, Ireland, Morgan Stanley said. Morgan Stanleyâ\u0080\u0099s analyst Adam Jonas said in a note Thursday heâ\u0080\u0099d expect Tesla post â\u0080\u009cBattery Dayâ\u0080\u009d to â\u0080\u009cembark upon a campaign to find support from state and national governments world-wide to adopt his industrial battery capacity plans.â\u0080\u009d Tesla held the event on Tuesday. Donâ\u0080\u0099t miss: Teslaâ\u0080\u0099s Battery Day was â\u0080\u0098long on vision and boldness,â\u0080\u0099 short on here-and-now Aptiv â\u0080\u009chas a leading (and potentially dominating) position in electric-vehicle architectureâ\u0080\u009d and safety features, Morgan Stanley said in note earlier this month. Shares of Aptiv have lost 11% this year, while shares of Tesla have jumped 370%. That compares with gains around 1% for the S&P 500 index. Californiaâ\u0080\u0099s Wednesday announcement continued to weigh down shares of gasoline refiners, and seemed to have played at least a partial role in boosting shares of two relatively small and unknown solar-power cell makers. The rule would not prevent people from owning gas-powered vehicles past the target year or selling them on the used-car market. Considering a typical rate of turnover around 15 years, most gas-powered cars would be off the roads by 2050. Shares of SPI Energy Co. Ltd. SPI, -8.51% were 15% higher on Thursday after a 1,236% gain on Wednesday; Sunworks, Inc. SUNW, -1.67% Â rose 233% on Thursday after a 50% gain in the prior session. The companies, both based in California, have a market cap of $240 million and $63 million, respectively. SPI on Wednesday announced a subsidiary focused on EV and EV charging. See also:SPI Energyâ\u0080\u0099s stock adds to previous dayâ\u0080\u0099s rocket ride, as Sunworksâ\u0080\u0099 stock also soars Some refiner stocks recovered on Thursday but most big names, such as Valero Energy Corp. VLO, -1.62% Â and Phillips PSX, -1.11%, Â extended their losses. Shares of PBF Energy Inc. PBF, -5.22%, a company with about a third of its refining capacity in California, fell 14% this week so far. California, where 11% of U.S. new light-duty vehicles are sold, has led the way in fuel-economy and low-emissions requirements and 14 states, including New York and Massachusetts, No. 2 and No. 3 in share of U.S. new light-duty vehicle sales, have adopted Californiaâ\u0080\u0099s standards. Together, the states represent a third of the light-vehicle market in the U.S. About 2 million new cars are sold in California each year, about the same as Canada and Italy and just below 2.3 million sold in the U.K., according to analysts at Tudor, Pickering and Holt. â\u0080\u009cCalifornia is one the most progressive markets in pushing towards electrification of the auto fleet, this was still a surprising step from the administration and has raised many questions around feasibility of implementation,â\u0080\u009d the analysts said in a note Thursday. It remains to be seen whether â\u0080\u009cas California goesâ\u0080\u009d will remain true in EV goal, they said. The state had already made a goal to have about 5 million EVs on the road by 2030, which compares with about 30 million vehicles in use in the state in recent years and an estimated EV fleet around 500,000 to 600,000, the analysts said. Last year, fully electric cars and hybrids represented about 7% of new-car sales in California, they said. â\u0080\u009cCalifornia took a bold and ambitious position regarding electric vehicles to attack climate change,â\u0080\u009d said Michelle Krebs, an analyst for Autotrader. The state has â\u0080\u009cgreat cloutâ\u0080\u009d as the U.S.â\u0080\u0099s largest automotive market and one of the worldâ\u0080\u0099s largest economies on its own, she said. â\u0080\u009cThe evidence shows regulation or government initiatives, like those in China and Europe, is what really makes a difference in EV adoption,â\u0080\u009d Krebs said."}]}