{"article": [{"url": "https://www.marketwatch.com/story/softbank-near-40-billion-deal-to-sell-arm-holdings-to-nvidia-2020-09-12", "published": 1599919160.0, "headline": "SoftBank near $40 billion deal to sell Arm Holdings to Nvidia", "body": "SoftBank Group Corp. is nearing a deal to sell British chip designer Arm Holdings to Nvidia Corp. for more than $40 billion, the latest in a series of big asset sales by the Japanese technology conglomerate. The cash-and-stock deal being discussed would value Arm in the low $40 billions, the Wall Street Journal reported Saturday. The terms under discussion would mark a big win for SoftBank SFTBY, -1.46% , which bought Arm four years ago for $32 billion and had struggled to jump-start growth in the business. Arm and Nvidia NVDA, -0.54% have been in exclusive talks for several weeks and a deal could be sealed early next week, assuming it isn’t derailed at the last minute. Arm designs microprocessors that power most of the world’s smartphones. By joining forces with Nvidia, the combined company would be a powerhouse in the semiconductor or chip industry. Nvidia is a fast-growing industry player whose chips are used to run the intense calculations for graphics—and play a key role in videogaming, cloud-computing and other activities for which the coronavirus pandemic has stoked demand. That has sent its shares up more than 100% this year, making it the best-performing stock in the S&P 500 index SPX, +0.87% . Should a deal come together, it would be one of the largest transactions so far this year and potentially the largest semiconductor deal ever. Though business disruptions stemming from the pandemic have dented global deal volume, consolidation has kept up pace in the semiconductor industry as chip makers seek scale and expand their product portfolios to support the increasing number of everyday items that are connected to the internet. Such linkage is commonly referred to as the Internet of Things. Another of the year’s biggest deals was the $22 billion purchase of Maxim Integrated Products Inc. by fellow chip maker Analog Devices Inc. ADI, +2.48% A sale to Nvidia could prompt scrutiny from antitrust regulators and potentially pushback from Arm’s customers, which include major chip makers and electronics manufacturers such as Intel Corp. INTC, -1.03% , Samsung Electronics Co. and Apple Inc AAPL, +1.74% . An expanded version of this story appears on WSJ.com"}]}