{"article": [{"url": "https://www.marketwatch.com/story/sacha-baron-cohen-calls-facebook-trumps-willing-accomplice-in-spreading-conspiracy-theories-2020-10-08", "published": 1602168380.0, "headline": "Sacha Baron Cohen calls Facebook Trump's 'willing accomplice' in spreading conspiracy theories", "body": "Borat isn't finished with Facebook yet. British comedian and satirist Sacha Baron Cohen - who has a history of pushing buttons with the movie \"Borat\" and TV series \"Who Is America?\" - calls the social network President Donald Trump's \"willing accomplice\" as \"the greatest propaganda machine in history\" in a new op-ed for Time. In his column \"We Must Save Democracy From Conspiracies\", Cohen refers to studies that show people are especially susceptible to misinformation and conspiracy theories during periods of great uncertainty - such as the coronavirus pandemic, the resulting economic crisis, and the racial reckoning that Americans have been facing this year. And he accuses the president of exploiting the public's fear and uncertainty, and claims that Facebook FB, +0.26%  has given him the platform to do so. “ \"The Demagogue in Chief has a willing accomplice in Mark Zuckerberg's Facebook - a megaphone that history's worst autocrats could only dream of.\" ” - Sacha Baron Cohen Cohen writes that Facebook's algorithm \"deliberately amplifies content that generates more engagement,\" and quotes an anonymous Facebook executive who recently told Politico that \"Right-wing populism is always more engaging\" because it triggers \"anger, fear\" and \"an incredibly strong, primitive emotion.\" Indeed, six of the top 10 best-performing link posts by U.S. Facebook pages over 24 hours on Wednesday were from conservative sources, including radio host and Fox News contributor Dan Bongino, Fox News, and Donald Trump for President. iframe.twitter-tweet { width: 100% !important; } A Facebook spokesperson told MarketWatch by email that: \"We enforce our rules against anyone, including politicians, who try to use our platform to suppress voting or spread harmful misinformation about COVID-19. We've removed posts from President Trump making harmful claims about COVID-19 - including one this week equating the virus with the flu - and we've applied many labels to his posts on voting noting that vote-by-mail is a trustworthy method.\" Cohen also didn't pull any punches against Facebook while giving a speech hosted by the Anti-Defamation League last November. Then, he claimed that if Facebook had existed in the 1930s, it would have allowed Adolf Hitler to post ads for his \"solution\" to the \"Jewish problem\" on the platform, because the social network cares \"more about boosting their share price than about protecting democracy.\" But he also noted that Twitter TWTR, -0.23%  and the Alphabet-owned Google TWTR, -0.23%  were part of the problem, too. Read: Sacha Baron Cohen amplifies his sharp rebuke of big tech companies, while Facebook insists it's anti-hate speech Facebook responded at the time by saying that Cohen had \"misrepresented\" its policies. \"Hate speech is actually banned on our platform,\" the statement read. \"We ban people who advocate for violence and we remove anyone who praises or supports it. Nobody - including politicians - can advocate or advertise hate, violence or mass murder on Facebook.\" And in January, Cohen tweeted out a Guardian investigation looking at 218,100 political ads on Facebook, which found that Trump's re-election campaign spent about $20 million in 2019 to target conservative voters, far outspending any other presidential candidate. iframe.twitter-tweet { width: 100% !important; } \"Terrifying,\" he tweeted, adding that history would judge Mark Zuckerberg harshly - \"if we still have historians after you help destroy democracy!\" It should be noted that social media sites have stepped up their anti-misinformation campaigns this year, with Facebook banning controversial conspiracy group QAnon on Oct. 6, and removing all of its content across its platforms. Both Twitter and Facebook also flagged a Monday tweet by President Trump that made false claims comparing the coronavirus and the flu, with Facebook pulling down the post. And social media companies also removed the controversial \"plandemic\" video that was pushing misleading information about hydroxychloroquine as a COVID-19 treatment over the summer. The Big Tech companies have been in the hot seat this year for their business practices, including their alleged complicity in the spread of misinformation. A House Judiciary subcommittee report released this week even suggests breaking apart tech companies like Facebook, Apple, AMZN, +3.01%  and Google. This article has been updated with a response from Facebook."}]}