{"article": [{"url": "https://www.marketwatch.com/story/cnbcs-jim-cramer-says-enough-is-enough-this-is-the-beginning-of-the-end-of-the-selloff-11600705105", "published": 1600697180.0, "headline": "CNBCâ\u0080\u0099s Jim Cramer says enough is enough: â\u0080\u0098This is the beginning of the end of the selloffâ\u0080\u0099", "body": "Jim Cramer Getty Images The stock market was getting beaten up pretty badly midway through Mondayâ\u0080\u0099s trading session, with the Dow Jones Industrial Average DJIA, +0.56% down more than 800 points amid rising concerns of another spike in COVID-19 cases in Europe. But CNBCâ\u0080\u0099s â\u0080\u009cMad Moneyâ\u0080\u009d host Jim Cramer, who has been telling his viewers for weeks to consider locking in profit, doesnâ\u0080\u0099t seem to be too worried about it. “ â\u0080\u0098Weâ\u0080\u0099re down on something that nobody really understands. Iâ\u0080\u0099m kind of tempted to take the other side of the tradeâ\u0080¦ Iâ\u0080\u0099m looking for opportunity just because everything is so ugly. Isnâ\u0080\u0099t that when you look for opportunity?â\u0080\u0099 ” Cramer played down coronavirus fears, saying that another lockdown in Europe doesnâ\u0080\u0099t necessarily mean that the U.S. is trending in the same direction. He also addressed troubling reports from the finance sector. â\u0080\u009cI know that you get a lockdown in Europe and youâ\u0080\u0099ve got a problem with some banks and that causes us to go down big? I donâ\u0080\u0099t know. Doesnâ\u0080\u0099t seem right to me,â\u0080\u009d he said in reference reports that banks allowed money laundering for years, involving $2 trillion in transactions in question. At last check, the Nasdaq Composite COMP, +1.39%, which hit a record high on Sept. 2, was falling deeper into correction territory, as big name tech stocks continued to drag on the market. â\u0080\u009cI do think that this is the beginning of the end of the selloff,â\u0080\u009d Cramer said. â\u0080\u009cIâ\u0080\u0099m willing to put it out there like that.â\u0080\u009d Watch the full segment: .wsj-interactive.generic-iframe-embed[name=\"cramer\"] { height: 349px; margin-bottom: 5px; } .at16units .bleed .wsj-interactive.generic-iframe-embed[name=\"cramer\"] { height: 349px; } body.at12units .bleed .wsj-interactive.generic-iframe-embed[name=\"cramer\"] { height: 349px; } body .inline .wsj-interactive.generic-iframe-embed[name=\"cramer\"], body .offset .wsj-interactive.generic-iframe-embed[name=\"cramer\"], body .header .wsj-interactive.generic-iframe-embed[name=\"cramer\"], body.at8units .bleed .wsj-interactive.generic-iframe-embed[name=\"cramer\"] { height: 349px; } body.at4units .inline .wsj-interactive.generic-iframe-embed[name=\"cramer\"], body.at4units .offset .wsj-interactive.generic-iframe-embed[name=\"cramer\"], body.at4units .header .wsj-interactive.generic-iframe-embed[name=\"cramer\"] { height: 349px; } â\u0080\u0093"}]}