{"article": [{"url": "https://www.marketwatch.com/story/these-are-your-rights-when-a-barber-gym-owner-or-president-trump-asks-you-to-sign-a-covid-19-waiver-2020-06-15", "published": 1592661920.0, "headline": "These are your rights when a barber, gym owner or President Trump asks you to sign a COVID-19 waiver", "body": "Americans venturing out to salons and gyms after weeks sheltering in place will have to learn a new ritual: Signing away their right to sue. My local YMCA now asks anyone wishing to use its gym to sign a waiver. My child’s dentist requires patients to accept the risk of contracting COVID-19. And my law students taking the bar exam have to give up their right to sue — before they’re allowed to file lawsuits. This seems to be happening anywhere there’s prolonged time indoors or close personal contact. Want a haircut? Sign a waiver. Summer camp? Waiver. Church? They’re being considered. Even President Trump is requiring people attending his rallies to agree to “assume all risks related to exposure to COVID-19.” Maria Trysla, CEO of online waiver company Smartwaiver, told me her company starting seeing requests for COVID-19 waivers in early May. And they were coming from industries that aren’t in the habit of using waivers, like nail salons, day spas and even some restaurants. Should you think twice before signing one of these waivers? Absolutely, though you’re unlikely to have much choice. These waivers tend to be presented on a take-it-or-leave it basis, which raises questions about how well they will hold up in court. But they also raise the question of who is best able to manage the health risks associated with COVID-19 as the economy reopens. The legal risk shouldn’t just be shifted over to customers. Instead, it should be a shared responsibility.The law of waivers Waivers are unusual legal creatures because they sit at the intersection of two different areas of law — torts and contracts. Tort law is the law of negligence and defines what we owe to each other in everyday life. Texting while driving, for example, is considered grossly negligent. Likewise, businesses are considered negligent when they expose their customers to additional risk — like leaving a banana peel on the floor of a supermarket or serving boiling hot coffee. Conversely, taking reasonable precautions to protect customers from hazards like the coronavirus — such as social distancing measures — would tend to protect businesses from tort liability. That may be is why law firms are recommending health precautions, rather than waivers, as a first line of defense. Contract law, on the other hand, is about a compact between two or more people in which you agree to some form of bargained exchange. A waiver is a contract that puts tort law out of reach. In a typical waiver, you agree that you will not sue another person or business for negligent behavior or acknowledge that certain activities are inherently dangerous and you “assume the risk” of injury or death. These sort of waivers may be familiar if you’ve ever gone skiing or taken your kids to a trampoline park. Waivers are a matter of state law, which vary widely, and there is no single federal law governing them. Some states approach waivers with a “freedom of contract” stance, on the notion that people should have the freedom to agree to whatever they like. But there are limits on what companies can waive away. Courts generally decline to enforce waivers when the conduct was egregious, like intentional harms or cases involving gross negligence. A court will also sometimes invalidate a waiver if it considers the agreement too one-sided or harmful to the public. For example, the Oregon Supreme Court invalidated a waiver printed on an injured snowboarder’s lift ticket, noting the public interest in ensuring ski hills design their jumps with safety in mind. In other words, signing a waiver is taking a gamble with your legal rights. You might be able to wiggle out of it later, but you might be stuck with it. Either way, businesses may be hoping that a waiver will deter customers from even trying to sue if they get sick. And if businesses think they are legally bulletproof, they may take fewer health precautions.A problem of shared risk A waiver is like a contractual hot potato — you’re passing a legal risk to someone else without really addressing the underlying danger. However, a contractual approach to safety hazards can fairly allocate legal risks with the goal of making everyone safer. American jurist Guido Calabresi argued that legal risks should be borne by the party who could avoid them at least cost — what he called the “cheapest cost avoider.” Some responsibility to manage infection fairly belongs with the customer, who can most easily prevent the spread of coronavirus to workers and others by staying home if they have symptoms or wearing a mask if they do not. And indeed, some of the waiver forms I reviewed contained reasonable language like this. Other risks are beyond the customer’s control, such as a store’s sanitation practices or social distancing measures. The risks associated with adopting these types of health precautions should remain with the business. So “assume the risk” language in a contract might be fair if the business also promises to adopt its own reasonable measures. A naked waiver that simply passes the buck to the customer is not. It’s no secret that businesses consider the legal risks of COVID-19 unbearable and are lobbying for immunity legislation from the federal government. The reality is that these risks are unbearable for everyone — businesses, consumers and especially workers. And the best way for the law to help is to encourage each of us to adopt health measures that protect those around us. Elizabeth C. Tippett is associate professor at the University of Oregon’s School of Law. This article was published with the permission of The Conversation."}]}