{"article": [{"url": "https://www.marketwatch.com/story/youngest-to-oldest-whos-coping-best-in-a-covid-19-world-2020-08-25", "published": 1598354060.0, "headline": "Youngest to oldest, whoâ\u0080\u0099s coping best in a COVID-19 world?", "body": "This article is reprinted by permission from NextAvenue.org. Nearly six months into the pandemic, the biggest change to Carmen and Bernie Rollinsâ\u0080\u0099 lives is a lack of spontaneity. The retired couple in San Bernardino Countyâ\u0080\u0099s Upland, Calif., ages 71 and 66 respectively, see their two daughters less frequently, and no longer drop everything to head to the beach on a nice day. Other than that, things are just fine. â\u0080\u009cBefore March, weâ\u0080\u0099d go see our daughter in Long Beach or our other daughter in [Los Angeles],â\u0080\u009d says Carmen, who used to work for the state of California in licensing for places such as foster family homes and senior care facilities. â\u0080\u009cSince then, weâ\u0080\u0099ve seen our kids twice, and itâ\u0080\u0099s outside in the backyard â\u0080\u0094 very carefully, everybody with masks on. Thatâ\u0080\u0099s been hard.â\u0080\u009d The employment changes millions of Americans are facing due to theÂ pandemic, whether itâ\u0080\u0099sÂ adjusting to working from homeÂ and balancing the demands of managing distance learning or child care â\u0080\u0094 orÂ losing employment all togetherÂ â\u0080\u0094 arenâ\u0080\u0099t worries they have. Carmenâ\u0080\u0099s parents and Bernieâ\u0080\u0099s father are deceased. Bernieâ\u0080\u0099s mother lives with his brother, alleviating Bernie of concerns about her. They havenâ\u0080\u0099t been impacted financially, either. â\u0080\u009cWeâ\u0080\u0099ve always been careful of how we spend so that we couldÂ survive layoffs from workÂ and things like that,â\u0080\u009d Bernie, a former electrician, says. The two have picked up new or neglected hobbies during this stretch of isolation. Bernie is making bread at home and the two are tending to a vegetable garden. Carmen â\u0080\u009cdid theÂ Marie KondoÂ thing,â\u0080\u009d she says, and while she used to visit the salon every six weeks for her habitual haircut, she now embraces long hair. And most important, they have the company of one another. â\u0080\u009cWeâ\u0080\u0099re in a special situation, I think,â\u0080\u009d says Carmen.A pattern of pandemic resilience But their situation might not be that special. New pandemic-time research suggests that despite the increased vulnerability in becoming seriously ill if they contract COVID-19, older people are managing the best out of everyone on the mental and emotional front. In 25 days of diary data collected from 776 Americans and Canadians during March and April,Â a University of British Columbia study found its older participants (ages 60+) felt less stressed and threatened by the pandemic and experienced better emotional well-being than others. Take Louise Jackson, who relocated from her condo in Missouri to independent senior housing in Tyler, Texas at the beginning of the pandemic to be closer to her ailing brother and his family â\u0080\u0094 a move she planned on making, COVID-19 or not. Jackson, 83, at first felt overwhelmed by how the coronavirus outbreak changed the new living situation she expected. Thereâ\u0080\u0099d be no communal meals, and meeting new people would be a challenge. â\u0080\u009cYou can either deal with change or it can overwhelm you, and Iâ\u0080\u0099m not planning to be overwhelmed,â\u0080\u009d Jackson says. â\u0080\u009cIâ\u0080\u0099m sometimes a bit lonely, but Iâ\u0080\u0099m adjusting.â\u0080\u009d Another study,Â this one from think tank AgeWave and investment company Edward Jones, surveyed 9,000 people in the U.S. and Canada across five generations and also found that older adults are faring better in the pandemic than younger generations. When asked how well they were coping with the impacts of COVID-19, 39% of the Silent Generation (ages 75+) and 33% of boomers (56-74) surveyed said â\u0080\u009cvery well,â\u0080\u009d which decreased to 29% for Generation X (40-55), 26% for millennials (24-39) and 31% for Gen Z (18-23). Twenty four percent of the millennials and Gen Zers answered â\u0080\u009cnot well,â\u0080\u009d compared with 15% of Gen X, 12% of the boomers and just 5% of the Silent Generation surveyed. Source: Edward Jones and Age Wave: The Four Pillars of Retirement 2020 This, in some part, could be due to the types of stressors that arise during particular points in our lives and COVID-19â\u0080\u0099s effect on certain age-associated circumstances over others. â\u0080\u009cIf youâ\u0080\u0099re in your 20s, 30s or 40s, you might have disruption to your predictability and expectations,â\u0080\u009d says Ken Dychtwald, CEO and president of AgeWave. â\u0080\u009câ\u0080\u0099I may not have a job. What am I going to do?â\u0080\u0099 At the same time, youâ\u0080\u0099re still paying down college loans, raising your kids who are having a rough time not getting out of the house.â\u0080\u009d Traditional retirees are worrying less about losing jobs and caring for small children (although many grandparents are guardians for grandchildren). They also often have Social Security and Medicare benefits to lean on in times of uncertainty. Also see: Social Security is squandering billions of dollars through a hidden weakness in how it invests its funds â\u0080\u009cYouâ\u0080\u0099re got those safety nets that give you some degree of protection against this difficult time,â\u0080\u009d Dychtwald says. â\u0080\u009cYounger people, for the most part, donâ\u0080\u0099t have those.â\u0080\u009d The University of British Columbia studyâ\u0080\u0099s younger (18-39 years old) and middle-aged (40-59 years old) participants reported more interpersonal conflicts, work and family-related stressors than older ones. â\u0080\u009cI think retired people are in a better position than younger people who have children or have their parents to take care of,â\u0080\u009d says Carmen Rollins.With age comes strength Life circumstances aside, older people tend to be positioned exceptionally well to handle lifeâ\u0080\u0099s challenges. Older adults tailor their strategies to reduce stress, according to Patrick Klaiber, a Ph.D. student in psychology at the University of British Columbia, one of several researchers behind the diary-based study. â\u0080\u009cThis is something that has been found in a lot of past research.â\u0080\u009d He says older people tend to recognize which stressful situations are ones that can be changed, and which are ones that canâ\u0080\u0099t. And they use different approaches depending on the answer. Also read: Millions of COVID-hit nursing home residents risk losing their vote Trying to make things different might be a good approach for situations that have the potential to change. For example: concerned about contracting COVID-19? Cope by taking seriously social distancing, wearing a mask and all other public health recommendations. Given what you canâ\u0080\u0099t change, you might instead change how you think about the situation. Or you might focus on seeking out positive feelings and experiences to offset the stress, rather than eliminate it. This is something, Klaiberâ\u0080\u0099s research says, older people excel at. Dealing with stress is a skill that can be improved and developed over the course of a lifetime. â\u0080\u009cOlder adults have certainty that stressful situations will not last forever and better times will come, which makes sense because theyâ\u0080\u0099ve lived longer,â\u0080\u009d says Klaiber. Jackson spent her career as a university professor, instructing future teachers on how to teach children reading and writing. With her move, she planned to make her skills available to the area libraries and schools, but now with the pandemic, sheâ\u0080\u0099s too at-risk to do so. Also see: Inflation will have a big impact on your retirement â\u0080\u009cIâ\u0080\u0099m recognizing that I may not be able to do the kinds of things I have always done, and thatâ\u0080\u0099s the way life is going to be, and I can live with that,â\u0080\u009d she says. For younger people with less lived experience, the COVID-19 pandemic might be the first major crisis theyâ\u0080\u0099ve encountered. â\u0080\u009cI think I may be more willing to accept what weâ\u0080\u0099re having to deal with now than I might have earlier. I might have been more impatient. With age, you have to learn with what comes down the pipe,â\u0080\u009d Jackson says. Contrary to stereotypical ideas about older people, the AgeWave/Edward Jones study found that while self-rated physical health declines with age, self-ratedÂ mentalÂ health actually tends to improve over the lifespan. â\u0080\u009cOften, younger people are afraid of getting older, lonely and sad, but psychological well-being is maintained often in very high age,â\u0080\u009d Klaiber says. â\u0080\u009cThese benefits might be due to life experience and give people an advantage in dealing with stress.â\u0080\u009dMuch to learn Researchers say younger generations could stand to learn much from their older counterparts in how to deal with stress, have positive experiences in the face of adversity and embrace gratitude. Donâ\u0080\u0099t miss: Thereâ\u0080\u0099s only one generation in U.S. history thatâ\u0080\u0099s considered to be more unlucky than the â\u0080\u0098Lost Generationâ\u0080\u0099 â\u0080\u009cYounger people could benefit from the emotional intelligence of older people,â\u0080\u009d says Dychtwald. â\u0080\u009cAnd thereâ\u0080\u0099s lots of older people who could be helping young people who are frightened and struggling to calm down, see the silver lining or grow closer to family.â\u0080\u009d Both the Rollinses and Jackson commend their parents and elders before them for modeling resilience in the face of hardship â\u0080\u0094 the same attitudes they employ today. Grace Birnstengel is a reporter, writer and editor for Next Avenue where she focuses on Americaâ\u0080\u0099s diverse experiences of aging. She recently concluded an in-depth series onÂ Americaâ\u0080\u0099s first generation aging with HIV/AIDS. This article is reprinted by permission from NextAvenue.org, Â© 2020 Twin Cities Public Television, Inc. All rights reserved."}]}