{"article": [{"url": "https://www.marketwatch.com/story/oil-pulls-back-but-on-track-for-10-weekly-rise-as-hurricane-delta-bears-down-on-u-s-gulf-coast-11602245700", "published": 1602256520.0, "headline": "Oil settles lower on reported end to Norway strike, but gains on week as Hurricane Delta shuts Gulf output", "body": "Residents along the Gulf Coast are bracing for the arrival of Hurricane Delta. Mario Tama/Getty Images Oil futures settled lower Friday following a reported end to a strike in Norway that threatened production, but the U.S. benchmark scored a nearly 10% weekly advance as Hurricane Delta neared landfall on the U.S. Gulf Coast. Oil enjoyed a week of impressive gains, but the rise was not caused “by factors that are here to stay,” said Bjornar Tonhaugen, head of oil markets at Rystad Energy, in emailed commentary. “Hurricanes that curb production in the U.S. will subside and output will rise again,” he said. “The same applies with strikes in Norway,” so both market events, in a way, are “artificial.” Prices fell to session lows after Reuters reported that Norwegian oil firms reached a wage agreement with labor union officials Friday. The strike could have resulted in production cuts of just under 1 million barrels a day by next week, according to Commerzbank. West Texas Intermediate crude for November delivery CL.1, -1.62% on the New York Mercantile Exchange fell 59 cents, or 1.4%, to settle at $40.60 a barrel. For the week, the front-month contract gained 9.6%, according to Dow Jones Market Data. The global benchmark, December Brent crude BRN00, -0.07% fell 49 cents, or 1.1%, to $42.85 a barrel on ICE Futures Europe, with prices up 9.1% for the week. Read: OPEC expects oil to hold ground as the world’s fuel of choice through 2045 Oil’s loss on Friday may also show that the “market is more worried about refineries shutting down in the wake of Hurricane Delta and sending crude oil to storage, than it is of crude oil production being shut in,” said Robert Yawger, director of energy at Mizuho Securities, in a note. Hurricane Delta, a Category 2 hurricane with sustained winds near 110 miles per hour as of Friday afternoon, was expected to make landfall on the Louisiana coast later Friday. The Bureau of Safety and Environmental Enforcement on Friday estimated that around 91.55% of current oil production in the Gulf of Mexico had been shut in as a result of the storm, along with 62.17% of natural-gas output. Meanwhile, Baker Hughes BKR, -1.34%, also on Friday, reported a third straight weekly increase in the number of active U.S. oil drilling rigs — up 4 to 193 this week. In the near term, upward movement for oil is “limited since traders are cognizant of substantial spare capacity existing with virtually every oil-producing nation,” Manish Raj, chief financial officer at Velandera Energy, told MarketWatch. Traders are also aware of the Organization of the Petroleum Exporting Countries and their allies’ “resolve to manage production, so prices do not fall below $40,” he said. “Therefore, in the near term, we expect crude oil to be range bound around $40.” Also on Nymex, November gasoline RBX20, -2.11% fell by 2.3% to $1.2032 a gallon, but still finished up by 7.1% for the week. November heating oil shed less than 0.1% to $1.1933 a gallon, settling up 10% for the week. November natural gas NGX20, +5.17% finished at $2.741 per million British thermal units, up 4.3% Friday, for a weekly rise of more than 12%. That marked a third straight weekly climb."}]}