{"article": [{"url": "https://www.marketwatch.com/story/trumps-stance-on-major-aid-is-just-a-reflection-that-votes-dont-exist-in-the-senate-for-a-deal-analyst-says-2020-10-07", "published": 1602074960.0, "headline": "Trump's stance on major aid is just a reflection that 'votes don't exist in the Senate for a deal,' analyst says", "body": "Analysts on Wednesday said it wasn't likely that a divided Washington would produce even targeted coronavirus aid before the Nov. 3 election, after President Donald Trump partly walked back his tweet that pulled the plug on talks on another major relief package. Trump on Tuesday night said he supported additional targeted aid for airlines JETS, +0.16%  and small businesses, as well as another round of stimulus checks for \"our great people,\" with that move coming after he had tweeted on Tuesday afternoon that he was ending negotiations on a broad relief package. \"What happened yesterday afternoon would be more accurately be described as President Trump learning or acknowledging that the majority of the Senate Republican conference preferred to go into the election focused on the Supreme Court and do not have the votes for deficit-increasing legislation above the $300B level they agreed to last month,\" said Henrietta Treyz, director of economic policy at Veda Partners, in a note to clients. \"The votes don't exist in the Senate for a deal and rather than force that reality into daylight, which would be an indicator not only of Republican resolve but President Trump's own inability to lead the conference when it comes to legislating, he decided to cast the decision as his alone,\" she added. Republican Sen. Susan Collins of Maine, who is lagging her Democratic challenger in polls ahead of the Nov. 3 vote, said delaying negotiations on another aid package is a \"huge mistake,\" and Republican Sen. Lisa Murkowski of Alaska said talks \"should continue.\" But most Republican senators, who have a 53-seat majority in their chamber, have a different view. Last week, GOP Sen. John Thune of South Dakota, expressed skepticism about the Senate passing a bigger package. \"Could you pass it? Maybe. But you're going to pass it with 47 Democrats and 13 Republicans and that's - depending on what that number is, I don't know where the 13 Republicans would come from,\" said Thune, the No. 2 Senate Republican, a week ago. To overcome a filibuster threat, a package would need 60 votes in the Senate, and Democrats control only 47. Treyz said her shop is downbeat on the chances for both targeted aid and a major package. \"Investors should anticipate a lot of spaghetti being thrown at the wall for the next few weeks, but we do not see a path for a bipartisan stimulus bill or stand-alone bailout for airlines becoming law,\" she said. Analysts at Height Capital Markets also sounded pessimistic on the prospects of smaller relief measures. \"We view Trump's push for various stand-alone measures - some, like airline aid, which have Democratic support - as unlikely to proceed in an environment where Trump has cleanly absolved Democrats of all blame for the breakdown in talks,\" Height's team said in a note. House Speaker Nancy Pelosi, the California Democrat, has \"little motivation to give Trump wins on the type of stand-alone aid he is asking for.\" The president's initial decision to end talks was \"ill-advised\" as he aims for re-election in less than a month, the Height analysts also said, noting that one unnamed Trump campaign adviser reportedly described it as \"politically inept.\" U.S. stocks SPX, +0.87%  were trading higher Wednesday, after closing with losses on Tuesday. Now read:Mnuchin and Pelosi resume discussions after Trump changes course on fiscal stimulus"}]}