{"article": [{"url": "https://www.marketwatch.com/story/the-smart-money-is-wrong-about-the-battered-dollar-11597154861", "published": 1597309340.0, "headline": "The smart money is wrong about the battered dollar", "body": "MarketWatch photo illustration/iStockphoto LAGUNA BEACH, Calif. (Project Syndicate)—A near-10% drop in the value of the U.S. dollar BUXX, -0.69% since its March high has given rise to two distinct narratives. The first takes a short-term perspective, focusing on how a depreciation could benefit the U.S. economy and markets; the second takes the long view, fretting over the dollar’s fragile status as the world’s reserve currency. Both narratives contain some truth, but not enough to justify the emerging consensus around them. Downward pressure Several factors have combined to put downward pressure on the dollar (as measured by the index of trade-weighted currencies DXY, -0.58% ) in recent weeks, resulting in a depreciation that has reversed almost half of the appreciation of the last 10 years within the space of just months. “ While the immediate effects are theoretically positive, the practical situation is likely to be different, because so much economic activity is currently impaired by government restrictions and the reluctance of individuals and companies to return to previous consumption and production patterns ” As the Federal Reserve has loosened monetary policy (actually and prospectively) in response to a worsening economic outlook, the income accruing to dollar-denominated safe havens, such as U.S. government bonds TMUBMUSD10Y, 0.777%, has declined. And with U.S.-based investments having lost some of their relative attractiveness, there has been a shift in holdings in favor of emerging markets and Europe (where the European Union last month agreed to pursue deeper fiscal integration). There also are indicators of lower capital inflows into the United States. House purchases by foreigners appear to have decreased again, owing in part to the U.S. government’s embrace of inward-looking policies and the related weaponization of trade and sanction measures. With the exception of Lebanon, Turkey, and a few other countries that have experienced even sharper exchange-rate depreciations than the U.S., most currencies have strengthened against the dollar. But among those with appreciating currencies, the reactions to this generalized phenomenon have been far from uniform. Some like it weaker Some countries, particularly in the developing world, have welcomed the reversal, because their previous currency weakness had been contributing to higher import prices, including for foodstuffs. Moreover, a weaker dollar provides them with greater scope to support domestic economic activities through more stimulative fiscal and monetary measures. But the reaction has been less welcoming in the other advanced economies. Japan and eurozone member states, in particular, fear that currency appreciation JPYUSD, 0.01 EURUSD, +0.60% could threaten their own economic recovery from the COVID-19 shock. Also, the Bank of Japan and the European Central Bank now have to worry that they are not only reaching the limits of their policy effectiveness, but could also be putting their economies at greater risk of collateral damage and unintended consequences. In the U.S., meanwhile, the dollar’s depreciation has been welcomed as an overwhelmingly positive development for the economy, at least in the short term. What the textbooks say After all, economic textbooks tell us that a weakening dollar boosts U.S. producers’ international and domestic competitiveness relative to foreign competitors, makes the country more attractive for foreign investors and tourism (in price terms), and increases the dollar value of revenue earned overseas by home-based companies. That is also all good for U.S. stock and corporate bond markets, which benefit further from the greater attractiveness of dollar-denominated securities when priced in a foreign currency. Read more: Here’s what the U.S. dollar’s fall means for the stock market The longer-term consensus view is less positive for the U.S. The worry is that a dollar depreciation will further erode the currency’s global status, which has already been weakened by U.S. policies of the past three years—from trade protectionism and the weaponization of sanctions to increasingly bypassing global standards and the rule of law. The more the dollar’s credibility is eroded, the more the U.S. risks losing the “exorbitant privilege” that comes with issuing the world’s main reserve currency. Dollar could be a ‘crash risk’ if U.S. loses ‘credibility,’ analyst warns A country in this position can exchange bits of printed paper or digital entries (currency creation) for the goods and services that other countries produce. It enjoys disproportionate influence over important multilateral decisions and appointments. And it benefits from others’ willingness to outsource to its own institutions the management of their financial wealth. Both of these (partly true) consensus narratives imply further significant dollar depreciation. Theory vs. reality While the immediate effects are theoretically positive, the practical situation is likely to be different, because so much economic activity is currently impaired by government restrictions and the reluctance of individuals and companies to return to previous consumption and production patterns. Around half of U.S. states have now reversed or halted the process of economic re-opening. Moreover, today’s positive market effects demand further qualification beyond the health crisis. Owing to the reliable and ample provision of liquidity, particularly by central banks, most valuations have already decoupled from economic and corporate fundamentals. Under these financial conditions, it is hard to imagine that a dollar depreciation will have any more than a marginal effect on real economic performance. As for the dollar’s role as a reserve currency, I am reminded of a simple principle I learned at university: it is hard to replace something with nothing. At this time, there simply is no other currency that can or will fill the dollar’s shoes. Instead, we will continue to see small pipes being built around the dollar. And, because none of these will be large enough to replace it, the eventual result will be a more fragmented international monetary system. As has happened before, the current consensus views on the dollar will probably end up overstating the long-term implications of short-term movements. Today’s dollar weakness is neither a boon to markets and the U.S. economy nor an augury of the currency’s global downfall. But it is part of a larger, gradual fragmentation of the international economic order. The main factor in that process is the shocking lack of international policy coordination at a time of rising global challenges. Mohamed A. El-Erian, chief economic adviser at Allianz, was chairman of President Barack Obama’s Global Development Council. He is the author, most recently, of “The Only Game in Town: Central Banks, Instability, and Avoiding the Next Collapse.“ This article was published with permission of Project Syndicate—Reading the Dollar Doldrums. Suggested further reading Anne Krueger: The American tragedy: A lousy economy and lots of COVID-19 infections U.S. political squabbling could doom the world to lower growth, wider inequality and dangerously distorted markets, says Mohamed El-Erian Robert Shiller explains the pandemic stock market and why it’s decoupled from the economy"}]}