{"article": [{"url": "https://www.marketwatch.com/story/warren-buffett-is-willing-to-look-like-an-idiot-in-the-short-term-according-to-wall-streets-biggest-influencer-2020-07-19", "published": 1595238440.0, "headline": "Warren Buffett is â\u0080\u0098willing to look like an idiot in the short term,â\u0080\u0099 according to â\u0080\u0098Wall Streetâ\u0080\u0099s biggest influencerâ\u0080\u0099", "body": "Barstool Sports founder and mouthy trader Dave Portnoy got plenty of heat last month for calling Warren Buffett an â\u0080\u009cidiotâ\u0080\u009d after the Berkshire Hathaway BRK.B, +0.24% boss unloaded his airline stocks and missed out on a big rebound in the beaten-down sector. According to Shane Parrish of the popular Farnam Street blog, thatâ\u0080\u0099s all part of the plan: “ â\u0080\u0098You have to be willing to look like an idiot in the short term to get the best long-term results. Iâ\u0080\u0099d suggest that because the future has become increasingly uncertain, heâ\u0080\u0099s preparing for the widest range of possible futures.â\u0080\u0099 ” Thatâ\u0080\u0099s how Parrish, hailed as â\u0080\u009cWall Streetâ\u0080\u0099s biggest influencer,â\u0080\u009d described Buffettâ\u0080\u0099s current investment strategy in a recent interview with Business Insider. â\u0080\u009cWhen you donâ\u0080\u0099t understand with a certain degree of certainty, you sit out until you do,â\u0080\u009d Parrish added, addressing criticism that Buffett has raised cash when he should be taking a more active role in profiting from the chaos. Read: Warren Buffett may have found a stock he likes â\u0080\u0094 his own Parrish, who has hundreds of thousands of Twitter TWTR, -0.23% followers and has interviewed some of the biggest names on Wall Street, has been obsessed with Buffett for years. His blog is named after the street address of Berkshireâ\u0080\u0099s corporate headquarters. â\u0080\u009cBuffett has taught me to be conscious about happiness, be conscious about being optimistic about the future based on the past, and just constantly having a smile and having fun with life,â\u0080\u009d Parrish once wrote in a post about Buffettâ\u0080\u0099s impact on his life beyond just investing. â\u0080\u009cItâ\u0080\u0099s not about being purely rational about every minute of your day and optimizing your time. Itâ\u0080\u0099s about living life.â\u0080\u009d And with that, Parrish said heâ\u0080\u0099s confident in the direction Berkshire is headed. â\u0080\u009cPeople always seem to want the optimal solution for the moment, and thus he ends up looking out of touch at times,â\u0080\u009d Parrish, a longtime attendee of Berkshireâ\u0080\u0099s annual meeting, told Business Insider. â\u0080\u009cBut you have to be willing to do something different to get different results.â\u0080\u009d Read: Diversify? Almost half of Berkshire Hathaway portfolio is composed of a single stock Buffett, putting some of that $137 billion in cash in play, has been more active lately, with Berkshire having closed a $10 billion deal for Dominion Energyâ\u0080\u0099s D, -0.34% natural-gas assets. But Parrish said Buffett is still focused on protecting his investors and keeping plenty of that cash on hand to help navigate the ups and downs of this treacherous climate. â\u0080\u009cYou canâ\u0080\u0099t win if you donâ\u0080\u0099t finish... you canâ\u0080\u0099t compound if you zero out,â\u0080\u009d Parrish said. â\u0080\u009cIn periods of high uncertainty, you want to ensure you have the most possible options.â\u0080\u009d Or, as Parrish put it in a tweet last month: iframe.twitter-tweet { width: 100% !important; } Cash looks to be a decent place to be heading into the new, earnings-heavy week, with the Dow Jones Industrial Average DJIA, +0.56% Â , S&P 500 SPX, +0.87% and tech-heavy Nasdaq Composite COMP, +1.39% all leaning lower early in Mondayâ\u0080\u0099s session."}]}