{"article": [{"url": "https://www.marketwatch.com/story/us-jobless-claims-jump-in-july-18-week-first-gain-since-late-march-2020-07-23", "published": 1595496920.0, "headline": "U.S. new jobless benefit claims rise for first time since late March", "body": "The numbers: Initial jobless claims rose in the week ended July 18 for the first time since late March. New applications for unemployment benefits, a rough gauge of layoffs, rose by 109,000 to 1.42 million, the Labor Department said Thursday. The figures are seasonally adjusted. Economists polled by MarketWatch had forecast 1.41 million new claims. These figures reflect applications filed the traditional way through state unemployment offices. An additional 974,999 people sought benefits through a temporary federal-relief program. The number of people receiving traditional jobless benefits through the states, known as continuing claims, fell by 1.1 million to 16.20 million in the week ended July 11. What happened: The seasonal adjustment factors are playing havoc with the jobless claims data in July. This is the month when auto plants typically shut down for summer holidays but that is not happening this year. On an non-adjusted basis, claims fell 141,816 to 1.37 million this week. Big picture: Claims had been trending down from a peak of 6.9 million in late March. Economists won’t read too much into one report, but the increase will add to worries the spread of COVID-19 in July is slowing down the economy. They don’t expect much improvement in the labor market until the pandemic is contained. In addition, some firms that received Paycheck Protection Program funding could also be reducing payrolls. What are they saying? “To put these data in perspective, before the pandemic surge, the highest single weekly tally ever was 695,000 in 1982. Now, more than four months into the crisis, initial claims are still running at an astonishing 1.4 million per week. We continue to believe that after an initial period of sharp, but partial rebound as the economy reopens, the remainder of the process is going to be prolonged, and that the road back to February’s peak employment levels will be a long and bumpy one,” said Josh Shapiro, chief U.S. economist at MFR Inc. Market reaction: U.S. stock-index futures pared earlier gains to trade near flat on Thursday after the increase in jobless claims. The S&P 500 index SPX, +0.87% gained 0.6% on Wednesday."}]}