{"article": [{"url": "https://www.marketwatch.com/story/if-the-supreme-court-strikes-down-obamacare-trumps-health-care-order-is-not-enough-to-replace-it-11602008822", "published": 1602058700.0, "headline": "Trumpâ\u0080\u0099s executive order on health care is no replacement for Obamacare â\u0080\u0094 hereâ\u0080\u0099s why", "body": "President Donald Trump shows his signed executive order on health care in September. Getty Images The battle over the replacement of Justice Ruth Bader Ginsburg has refocused American attention on the future of the Affordable Care Act. The Supreme Court isÂ scheduled to hear oral arguments Nov. 10 in a case seeking to overturn the lawÂ that brought insurance coverage toÂ millions of Americans. Meanwhile, Trump recently released his â\u0080\u009cAmerica-First Healthcare Plan.â\u0080\u009d In it, the president claims significant achievements. He also outlines broad principles of his vision for the future of health care in America. Over the past three years, the Trump administration has taken a number of steps to dismantle pieces of the ACA. And his recently introduced executive orderÂ lacks a number of key detailsÂ and theÂ legal grounds for enacting much of the proposal. The two factors leave me â\u0080\u0094 aÂ health policy and politics scholar whoÂ has closely followed the Affordable Care ActÂ â\u0080\u0094 skeptical about the emergence of aÂ meaningful replacementÂ to the ACA that would expand insurance access should the Supreme Court invalidate theÂ Obama administrationâ\u0080\u0099s signature achievement.Trumpâ\u0080\u0099s moves on health care President Trump campaigned and entered office with the pledge to â\u0080\u009crepeal and replaceâ\u0080\u009d the ACA. In his own words, there would be a â\u0080\u009creally great HealthCare Plan with far lower premiums (costs) & deductiblesâ\u0080\u009d right after the election. Since 2016, Congress has made little headway besides eliminating the ACAâ\u0080\u0099s penalty for not carrying insurance. This is the basis for theÂ current lawsuitÂ to be heard before the Supreme Court in November.Â The argument isÂ that because Congress did away with the penalty, the individual mandate can no longer be constitutionally justified as a tax. As a result, the entire law should fall. While Republicans have been unable to repeal the law, the Trump administration has taken a number ofÂ executive actions to limit its reach. In combination, these efforts have contributed to bringing the uninsured rate toÂ 14% by 2019 from a low of 11% in 2016. This leaves millions of Americans without coverage and exposed to medical bills should they fall ill. One of the major targets of the Trump administration has been reducing enrollment through theÂ ACAâ\u0080\u0099s marketplaces. Here, the administrationÂ shortened the periods in which people are allowed to purchase insuranceÂ and drasticallyÂ reduced funding for individuals who help consumers enroll in coverage as well as advertising. It alsoÂ withheld subsidiesÂ to support low-income individuals with out-of-pocket costs, which also caused problems to insurers offering plans to those people. The administration has also worked to expand alternative insurance plans like so-calledÂ short-term, limited-duration health plansÂ andÂ association health plans. While these plans have lower premiums, they do not carry the consumer protections of the ACA like preexisting condition coverage. They also do not pay for prescription drugs or hospital stays. And unlike the ACA, they also require consumers to undergo a medical assessment before enrollment. Consumers may be charged higher premiums or rejected entirely based on their medical condition and age. Regulations issued by the Trump administration have reduced access toÂ reproductive care for women. The administration has also pushed states to implementÂ work requirements for Medicaid beneficiariesÂ andÂ discourage immigrants from enrollingÂ in Medicaid for fear of being denied permanent residency. As a result,Â thousands of individuals have become uninsured. Even on one of the presidentâ\u0080\u0099s favorite topics, reducing the cost of prescription drugs, numerous initiatives regardingÂ generic drugs, drug importation and capping insulin pricesÂ for Medicare beneficiariesÂ have done very little to reduce cost or improve access. On one of the presidentâ\u0080\u0099s other priorities, eliminatingÂ surprise billsÂ for medical services that patients unexpectedly receive for care that they reasonably thought would be covered by their insurance, the administrationâ\u0080\u0099s actions have yet to have aÂ meaningful effect.Executive order When it comes to Trumpâ\u0080\u0099s executive order, the topic that received the most public attention â\u0080\u0094 the guarantee that â\u0080\u009cAmericans with pre-existing conditions can obtain the insurance of their choice at affordable ratesâ\u0080\u009d â\u0080\u0094 carries no legal weight nor clear explanation of how it would be achieved or funded. More generally,Â after years of promising a detailed plan, theÂ America-First Healthcare PlanÂ focuses primarily on past actions. It also spends just 491 words on laying out a set of objectives â\u0080\u0094 lower costs, better care and more choice â\u0080\u0094 yet does not provide a mechanism or road map for how to implement them. All this leads me to believe that if the ACA is overturned before the Supreme Court, the prospect of substantive replacement that seeks to expand care to more Americans is unlikely. Now read: Another Supreme Court hearing on Obamacare is coming â\u0080\u0094 8 ways health insurance could change Simon F. Haeder is an assistant professor of public policy at Pennsylvania State University in State College. This was first published by The Conversation â\u0080\u0094 â\u0080\u009cIf the Supreme Court strikes down the Affordable Care Act, Trumpâ\u0080\u0099s health care order is not enough to replace itâ\u0080\u009c."}]}