{"article": [{"url": "https://www.marketwatch.com/story/christopher-nolan-blockbuster-tenet-now-delayed-indefinitely-due-to-coronavirus-2020-07-20", "published": 1595263100.0, "headline": "Christopher Nolan blockbuster â\u0080\u0098Tenetâ\u0080\u0099 now delayed indefinitely due to coronavirus", "body": "NEW YORK â\u0080\u0094 Christopher Nolanâ\u0080\u0099s â\u0080\u009cTenet,â\u0080\u009d which had hoped to herald Hollywoodâ\u0080\u0099s return to big theatrical releases, has yet again postponed its release due to the ongoing coronavirus pandemic. AT&T Inc.â\u0080\u0099s T, -1.01% Â Warner Bros. said Monday that â\u0080\u009cTenetâ\u0080\u009d will not make its Aug. 12 release date. Unlike previous delays, the studio this time didnâ\u0080\u0099t announce a new target for the release of Nolanâ\u0080\u0099s much-anticipated $200 million thriller. â\u0080\u009cTenetâ\u0080\u009d had already shifted from July 17, then July 31 and then Aug. 12. Nolan, a staunch advocate for the big-screen experience, has strenuously hoped that â\u0080\u009cTenetâ\u0080\u009d could lead the resumption of nationwide and global moviegoing. But the surge of the virus across much of the U.S. has upended the industryâ\u0080\u0099s aims for even a late-August return. Last week, California ordered its cinemas closed. Warner Bros. Pictures Group chairman Toby Emmerich said the studio will soon share a new â\u0080\u009c2020 release dateâ\u0080\u009d for â\u0080\u009cTenet.â\u0080\u009d It may be a much different rollout, with the film opening in staggered international release. â\u0080\u009cWe are not treating â\u0080\u0098Tenetâ\u0080\u0099 like a traditional global day-and-date release, and our upcoming marketing and distribution plans will reflect that,â\u0080\u009d said Emmerich. Emmerich said the pandemicâ\u0080\u0099s spread has forced the studio to reevaluate its plans. Warner Bros. also shifted the horror sequel â\u0080\u009cThe Conjuring 3â\u0080\u009d from Sept. 11 to June 4, 2021. â\u0080\u009cOur goals throughout this process have been to ensure the highest odds of success for our films while also being ready to support our theater partners with new content as soon as they could safely reopen,â\u0080\u009d said Emmerich. â\u0080\u009cWeâ\u0080\u0099re grateful for the support weâ\u0080\u0099ve received from exhibitors and remain steadfast in our commitment to the theatrical experience around the world.â\u0080\u009d Other films have planned their releases partially around the launch of â\u0080\u009cTenet.â\u0080\u009d Walt Disney Co.â\u0080\u0099s DIS, +1.53% Â â\u0080\u009cMulanâ\u0080\u009d remains scheduled for theatrical release on Aug. 21. Movie theaters remain in a precarious limbo. Without new releases, U.S. indoor theaters and drive-ins that are open have played mostly older films and a smattering of smaller new releases. Before the recent spike in the coronavirus crisis, theater chains have sought to assure moviegoers with protocols like limiting theaters to 25-50% capacity and cleaning seats in between showings. But months of closed theaters and no new product has put enormous pressure on an already stressed business. AMC Theaters, the worldâ\u0080\u0099s largest chain, recently reached a debt deal to help itself remain solvent. AMC AMC, -2.17% Â has been aiming to reopen most locations July 30. Cineworld CINE, +0.54% Â , which owns Regal Cinemas, had set July 31 for its reopening."}]}