{"article": [{"url": "https://www.marketwatch.com/story/report-card-which-hotel-brands-have-adapted-best-to-covid-19-2020-08-25", "published": 1598332160.0, "headline": "Report card: Which hotel brands have adapted best to COVID-19?", "body": "This article is reprinted by permission from NerdWallet. The COVID-19 pandemic has turned travel upside down, and the hotel industry has been forced to cope with a constantly changing landscape of traveler expectations. From new cancellation policies to improved cleaning and social distancing procedures, major hotel brands have scrambled to adapt to the new reality. But which hotel brands have adapted best? Which have offered the most customer-friendly policies and been willing to sacrifice bottom-line concerns for the sake of guest safety? To find out, we performed a comprehensive “grading” of eight major hotel brands, looking at the policies they currently have in place as well as the evolution of these policies throughout the early stages of the pandemic. Note: These hotel brands have introduced new cleaning and sterilization policies, often in partnership with health care providers. Since we are not experts in this area, we did not attempt to compare these policies. We instead focused on policies such as mask enforcement that can be compared directly.Winners and losers Overall: Hyatt (Grade: A) Runners-up: Radisson, Hilton and Marriott (Grade: A-) To determine the final grade, we compared two major categories: Flexible change and cancellation policies, including current and past policies for both existing and new bookings. Health and social distancing policies, over six criteria including mask enforcement, social distancing in common areas and low-contact check-in procedures. We gave each brand a grade in each category (see below for more details), then averaged these two grades. NerdWallet As you can see, the disparity between the “flexibility” and “health” grades from some programs was huge. Best Western, for example, scored a B+ for its health policies, but an abysmal D for its flexible booking policies. Hyatt H, -2.69% took top overall marks thanks to its consistent customer-first policies across many categories and dates. Hilton HLT, -1.26% , Marriott MAR, -0.96% , and Radisson US:REZIF also performed consistently, but not uniformly. On the other end of the spectrum, Choice CHH, -0.43% and Wyndham WH, -1.99% disappointed across all criteria we considered. Note: These rankings are current as of July 24, 2020, and do not reflect any changes since.Health and social distancing Winner: Hyatt (Grade: A) Runners-up: Best Western, IHG IHG, +1.02% and Marriott (Grade: B+) We compared each program across six criteria, based on the official policies stated on the hotel websites: Social distancing: Specific policies that ensure appropriate social distance between guests in common areas. Rooms blocked: Policies that ensure that guest rooms are not accessed for a specific number of days between reservations or after cleaning by staff. Low contact check-in/out: Features such as mobile check-in and express checkout, which minimize contact between guests and staff. Staff wear masks: Specific policies (not recommendations) that require staff to wear masks. Guests wear masks: Published policies that require hotel guests to wear masks even in states where it is not required. Trained local health leader: Each hotel assigned an on-staff, trained health coordinator or leader. Staff health checks: Specific policies (not recommendations) such as temperature checks to help screen staff. Enhanced cleaning procedures: As mentioned above, we considered whether a hotel had published a cleaning policy but did not compare the specifics of these procedures. NerdWallet Despite a rocky rollout of its health policy, Hyatt’s last-minute face mask requirement and staff training procedures set it apart. Also see: Travel experts offer tips on refunds, cancellations, insurance and booking new trips Best Western, Hilton and Marriott also performed well, thanks to a new mask requirement policy from Marriott, room-blocking from Hilton, and a comprehensive health plan from Best Western introduced soon after the pandemic started.Flexible booking policies Winners: Hilton (grade: A+) and Radisson (grade: A+) Runner-up: Marriott (grade: A) When travel plans were first disrupted, some hotels outlined flexible policies for existing reservations, letting guests change or cancel these bookings without fees. Then came policies allowing free changes and cancellations on new bookings, in an attempt to entice some travelers back into making new plans. Then came rollbacks of both policies in the summer as the virus seemingly abated. Related: Airlines want people to believe that air travel is safe during the pandemic, but travelers are skeptical To grade these ever-evolving policies, we looked at two types of change/cancellation fee waivers (new and existing bookings) over two time periods in April and July 2020. So each hotel brand received four individual grades, summarized in one overall flexibility grade below. We also graded these policies on a curve, as with the health policies above. NerdWallet Radisson has consistently offered top-tier flexibility for guests throughout the crisis. And although Hilton’s generosity has waned in the summer, it led the charge earlier in the spring with highly flexible policies for both new and existing bookings. On the other end of the spectrum, Best Western and Choice Hotels have failed to consistently provide meaningfully flexible choices for both new and existing bookings, earning them the bottom spots. Also see: Is a hotel or an Airbnb safer for your summer vacation? In general, hotels have been much quicker to scale back their flexible policies than airlines, many of which continue to offer fully refundable fares throughout the summer. So even though we have awarded two “A+” grades, we still see plenty of room for improvement in this area.The bottom line Similar to our analysis of how airlines have been handling the pandemic, we have done our best to boil this extraordinarily complex topic into a simple grading system and provide help for travelers in choosing which hotel to trust with bookings for the remainder of 2020 and beyond. It is important, in my opinion, that we hold hotels and other businesses accountable for the actions they take at times like these. So if you’re on the fence about a hotel booking, maybe you lean toward a brand like Hyatt that scored well across the board. If ensuring health and proper social distancing are your primary concerns, consider brands like Hyatt, Best Western, IHG or Marriott, which scored best in these areas. If, on the other hand, maintaining flexibility amid coronavirus uncertainty is paramount, check out the brands like Radisson, Hilton, Marriott and Hyatt, which rated the highest. In either case, make sure to check the most current policies of a given hotel before booking.More from NerdWallet: 5 Destinations From Netflix Hits to Inspire Your Future Travels Which Airline Should I Fly In 2020 (and Beyond)? Which Airline Has the Most Valuable Elite Status Program? Sam Kemmis is a writer at NerdWallet. Email: skemmis@nerdwallet.com. Twitter: @samsambutdif."}]}