{"article": [{"url": "https://www.marketwatch.com/story/as-eu-relations-sour-u-k-inks-first-post-brexit-trade-deal-with-japan-01599818132", "published": 1599804200.0, "headline": "As EU relations sour, U.K. inks first post-Brexit trade deal with Japan", "body": "UK Foreign Secretary Dominic Raab (L) and Japan's Foreign Minister Toshimitsu Motegi attend a joint news conference following the eighth Japan-UK Foreign Ministers' Strategic Dialogue at Iikura Guest House on February 8, 2020 in Tokyo, Japan. Tomohiro Ohsumi/Getty Images LONDON (AP) — The U.K. secured its first major post-Brexit trade deal on Friday after signing an agreement with Japan just as discussions with the European Union appeared to be on the verge of collapse. The deal, which has so far only been agreed upon in principle and for which details are thin, will increase commerce with Japan by around 15 billion pounds ($19 billion) and expands upon a recently signed deal between the EU and Japan, the U.K. said. “The agreement we have negotiated — in record time and in challenging circumstances — goes far beyond the existing EU deal, as it secures new wins for British businesses in our great manufacturing, food and drink, and tech industries,” said Britain’s international trade secretary, Liz Truss. The government said U.K. businesses will benefit from tariff-free trade on 99% of exports to Japan and that it will give British businesses a gateway to the Asia-Pacific region. Skeptics say no amount of such trade deals can mitigate for the losses Britain would suffer in the event of a ‘no-deal’ outcome with the EU, given that trade with the 27-nation bloc accounts for around half the country’s total. While the U.K. left the EU this year, it is still trying to agree on new trade relations when current deals expire at the end of the year. Concerns over a post-Brexit deal have risen in the past few days as relations between the U.K. and the EU soured. The announcement from the British government that new legislation breaches parts of the withdrawal agreement, which allowed for the country’s smooth departure from the bloc, has prompted a furious reaction from the EU and raised the prospect of an imminent collapse in the talks. Even before the standoff, the trade discussions had made little progress, with the two sides seemingly wide apart on several issues, notably on business regulations, the extent to which the U.K. can support certain industries and over the EU fishing fleet’s access to British waters. The EU has been particularly insistent on ensuring that British-based businesses don’t have an unfair advantage as a result of laxer social, environmental or subsidy rules in the U.K. British businesses are worried about a collapse in the talks that could see tariffs and other impediments slapped on trade with the EU at the start of next year. Though the U.K. left the bloc on Jan. 31, it is in a transition period that effectively sees it abide by EU rules until the end of this year. The discussions are about agreeing the broad outlines of the trading relationship from the start of 2021. Most economists think that the costs of a “no-deal” outcome would fall disproportionately on the U.K. Supporters of Brexit have said that one of the benefits of unshackling the British economy from the EU is that it allows the country to sign trade deals with whoever it wishes — the EU negotiates trade deals on behalf of all its members. The concern over future trade ties comes at a time when the British economy continues to recover from a deep recession caused by the shutdown of businesses to limit the coronavirus pandemic. The Office for National Statistics said the economy grew by a month-on-month rate of 6.6% in July as many sectors started reopening after months of being idle. Despite the increase, the economy remains 11.7% smaller than it was in February. Economists think the recovery will moderate as new virus infections have picked up again, leading the government to put new limits on social gatherings and travel. The looming end of a salary-support scheme and heightened uncertainties over a trade deal with the EU are also expected to weigh on growth and, as a result, most economists think the economy will end the year about 8% smaller than it was before the pandemic. “The big risk to the U.K. upswing remains a disorderly hard exit from the EU single market,” said Kallum Pickering, senior economist at Berenberg Bank."}]}