{"article": [{"url": "https://www.marketwatch.com/story/kids-under-age-5-may-carry-a-much-higher-coronavirus-viral-load-than-older-children-and-adults-study-2020-07-31", "published": 1596273080.0, "headline": "Kids under age 5 may carry a much higher coronavirus viral load than older children and adults: study", "body": "A small study is raising questions about whether young children could be coronavirus super spreaders, even as the country deliberates how to reopen schools in the coming weeks. One of the few silver linings of the COVID-19 pandemic so far has been that the novel coronavirus that has infected more than 17 million people worldwide has largely spared kids. Children are infected at lower rates, and they tend to have milder symptoms — although a rising number have been exhibiting a mysterious multisystem inflammatory syndrome that appears to be related to their body’s immune response to COVID-19 exposure. But how contagious are kids? And could reopening schools lead to more community outbreaks if children (and teachers) become exposed to COVID-19 in classrooms, and then spread the virus to their families? A small Chicago study published in JAMA Pediatrics this week is renewing such questions, as it suggests that small children infected with COVID-19 carry at least as much of the virus as adults do — if not much, much more. Dr. Taylor Heald-Sargent, a pediatric infectious diseases specialist at Lurie Children’s Hospital of Chicago, analyzed 145 nasal swabs from patients with mild to moderate cases of COVID-19 within a week of showing symptoms. Her team tested for the genetic pieces of the virus (RNA) in the samples. And they found that older children and adults had similar amounts of the viral genetic material, which can be extrapolated to measure how much live virus they carried. (Live viral cultures are used in research settings, not clinical settings like this one, which is why they went this route.) The most alarming finding, however, was that kids under 5 had significantly more of the viral genetic material in their noses — 10 to 100 times more, in fact, compared to older children and adults. “People thought maybe [young children] can’t get infected, and that is not the case. They definitely do get infected,” Heald-Sargent told MarketWatch. “And once they get infected, they have rip-roaring amounts of virus.” There are some caveats to keep in mind with this report — namely that it was a small study, and it wasn’t looking at samples of live virus, but rather the genetic material that the virus leaves behind. The study also did not measure transmissibility, and so these findings do not prove that children are more contagious. But it does provide more evidence that kids can indeed become infected with COVID-19, which suggests that it is also possible for them to spread it. “There has been some suspicion that kids may actually not transmit it to adults, which would be a good thing, but I do not think we can hold out that hope,” Dr. Sunil Sood, a pediatric infectious disease specialist from Northwell Health’s Southside Hospital who was not part of the study, told MarketWatch. “I see no biological reason why they wouldn’t be contagious,” he continued. “Why would this virus be different from other respiratory viruses — even coronaviruses that cause common colds? Kids transmit them to other kids and adults commonly, so why would this virus be any different?” Of course, this virus has proven to be different at almost every turn — from its growing laundry list of symptoms to how many asymptomatic patients could be unknowingly carrying the virus — which has helped make it so difficult to bring under control. “It’s so confusing,” Heald-Sargent said. “We’re learning more every day, so it’s hard to weigh each piece of data on its own. You have to take it collectively.” Her paper is consistent with research that has come out of France and Germany. A recent study of 47 COVID-19 infected children between the ages of 1 and 11 in Germany found that even asymptomatic kids had viral loads on par with those of adults — if not higher. And a French study also found that children without symptoms appear to have COVID-19 viral loads similar to those of children with symptoms. And in May, another JAMA study found that children age 4 and under are largely responsible for spreading respiratory syncytial virus (commonly called RSV) in adults over 65. “We know for sure that kids spread RSV,” Sood told MarketWatch. While it’s predominantly found in younger kids, he noted that it can cause severe cases of pneumonia in seniors. “So what I think our paper adds [to the discussion of kids and coronavirus] is this answer to whether children can get infected. They can,” Heald-Sargent said. “We don’t know that they’re spreading it, but we need to be cautious. It doesn’t mean schools can’t open; we just need to be safe about it.” “This paper should reinforce to any skeptical parents that kids need to wear masks so that they are less likely to transmit the virus to others,” Sood added. “They may have a high virus count in their noses, even without being very sick themselves.” The CDC states on its site that children do not appear to be at higher risk for COVID-19 than adults, based on available evidence. But it does caution that “the more people children interact with, and the longer that interaction, the higher the risk of COVID-19 spread.” To keep families safe, the CDC suggests practicing good hygiene, such as: washing hands often; cleaning and disinfecting high-touch surfaces daily; and laundering clothes and plush toys as needed. It also recommends practicing social distancing with kids: avoiding people who are sick, sneezing or coughing; keeping at least six feet away from other people outside of your household; and having kids ages 2 and up wear cloth face masks in public settings where it is difficult to follow social distancing. Its guidelines for reopening schools also include mask wearing, spreading desks at least three feet apart and canceling group activities like choirs and assemblies. The CDC has also stated that “decisions about how to open and run schools safely should be made based on local needs and conditions.” Follow MarketWatch’s coronavirus coverage here."}]}