{"article": [{"url": "https://www.marketwatch.com/story/states-sue-trump-administration-over-relief-for-scammed-student-loan-borrowers-11594844265", "published": 1594830320.0, "headline": "States sue Trump administration over relief for scammed student-loan borrowers", "body": "A coalition of attorneys general sued Secretary of Education Betsy DeVos on Wednesday over a rule for scammed student loan borrowers. (Photo by Alex Wong/Getty Images) Alex Wong/Getty Images A coalition of 23 attorneys general sued Secretary of Education Betsy DeVos and the Department of Education Wednesday, alleging that the Trump administration is illegally limiting relief for scammed student-loan borrowers. The suit, led by California Attorney General Xavier Becerra and Massachusetts Attorney General Maura Healey, centers around the “borrower defense” rule, a law that allows student-loan borrowers who say they were misled by their schools to have their federal student debt discharged. The coalition of state law enforcement officials is accusing the DeVos-era Department of Education of unlawfully repealing a version of the borrower defense rule implemented by the Obama administration in 2016 and replacing it with a version that’s friendly to industry at the expense of borrowers. “Once again, Secretary DeVos and the Department of Education has decided to put students and those who borrowed money in good faith behind protecting predatory for-profit institutions,” Becerra said on a call with reporters. On the books since the 1990s, but rarely used until 2015 The suit is the latest development in a years-long battle over the borrower defense rule. On the books since the 1990s, the rule was used rarely until 2015 when former for-profit college students began clamoring for relief. These students had attended institutions like Corinthian Colleges and ITT Technical Institute — large, publicly traded chains that filed for bankruptcy amid allegations they lured students into taking on loans with inflated job placement and graduation rates. Meanwhile, borrowers with debt from these schools were still left with their loans and a credential worth little in the labor market. In response to pressure from activists and these borrowers, the Obama administration created a streamlined process that scammed students could use to obtain relief. But the Trump administration has tried to avoid implementing the Obama-era version of the rule, arguing that it was “an overreach.” Angela Morabito, a spokeswoman for the Department of Education, wrote in an emailed statement that the agency’s borrower defense rule “clearly protects students from fraud, ensures they are entitled to financial relief if they suffered harm and holds schools accountable.” She added, “This is yet another grandstanding, politically driven lawsuit meant to grab a cheap headline, and the media seems to always oblige.” In announcing her agency’s version of the rule in December, DeVos said the Department wouldn’t “tolerate furiously giving away taxpayer money to those who have submitted a false claim or aren’t eligible for relief.” The agency has said its version of the rule would save taxpayers $11 billion over 10 years. The Department has faced several lawsuits over its approach to borrower defense. The DeVos version of the rule makes it ‘virtually impossible’ to have debt discharged, advocates say The 2019 borrower defense rule heightened the burden of proof for borrowers seeking debt cancellation under the law. For example, borrowers need to prove they were financially harmed by their school’s actions. In this, and other ways, the rule “puts up so many obstacles” that it makes it “virtually impossible” for a borrower to successfully have their debt discharged, Healey said on the call with reporters. In some cases where the agency has acknowledged borrowers were defrauded by their schools, it has discharged a small fraction of their debt and even none at all. Earlier this year, a bipartisan coalition of lawmakers voted to repeal the 2019 borrower defense rule and return to the Obama-era version. But Trump vetoed the bill and Democrats failed to gather enough votes to override the veto. As a result, the DeVos-era version of the rule took effect July 1. And now, as Healey put it: “Here we are.” “We’re back in court because we have witnessed first-hand the heartbreaking devastation to borrowers and their families,” she told reporters. “It’s about accountability, it’s about fairness and it’s about getting the relief these students deserve.”"}]}