{"article": [{"url": "https://www.marketwatch.com/story/for-first-time-ever-majority-of-shareholders-push-oil-giant-chevron-to-align-with-paris-climate-pact-2020-06-23", "published": 1592993360.0, "headline": "For first time ever, majority of shareholders push oil giant Chevron to align with Paris climate pact", "body": "Proposals by the Climate Action 100+ investor signatories calling on major oil and electric power companies to disclose lobbying activities and improve governance on climate change earned record support during the latest shareholder proxy season. Notably, a 53% majority of shareholders at Chevron Corp. CVX, -1.62% voted for a resolution seeking a commitment from the oil giant to align its climate-policy lobbying activities with the goal of the Paris Agreement, an international voluntary effort that aims to keep global average temperature rise to below 2 degrees Celsius, and ideally limit it to 1.5 degrees. “ ‘Lobbying that is inconsistent with the goals of the Paris Agreement presents a direct threat to our portfolios, our economies, and our clients.’ ” — Adam Kanzer, head of stewardship for the Americas, BNP Paribas Asset Management Filed by Climate Action 100+ investor signatory BNP Paribas Asset Management, this was the first climate-related proposal ever to win a majority of Chevron shareholder votes and it was the only proposal on Chevron’s 2020 proxy ballot that won a majority, Climate Action 100+, a group of more than 450 leading asset managers, pension funds and others with a combined $40 trillion in assets, said in a Tuesday release. “This landmark vote at Chevron signals an evolution of investor concerns about corporate lobbying activities. Lobbying that is inconsistent with the goals of the Paris Agreement presents a direct threat to our portfolios, our economies, and our clients,” said Adam Kanzer, head of stewardship for the Americas, BNP Paribas Asset Management, the lead sponsor of the proposal. “More than 14 large European companies, including BP BP, -0.74% , Shell RDS.A, +0.83% and Total TOT, +0.91% , have agreed to publish reviews of their trade associations, using the Paris Agreement as a benchmark. There is no reason why American companies can’t do the same,” he said. Similar lobbying proposals filed by Climate Action 100+ investor signatories won significant support, although short of a majority, at Duke Power DUK, +0.16% with 42.4% in favor, ExxonMobil XOM, -1.47% with 37.5%, Caterpillar CAT, +1.45% with 34% in favor, General Motors GM, -0.15% with 33%, Delta Airlines DAL, +0.39% at 45.9% and United Airlines UAL, +0.32% at 31.4%. The advocacy group’s investor signatories also filed proposals seeking independence between the position of board chair and CEO at a number of companies based on the expectation that an independent board will take a longer-term view of the climate risks facing a company. Independent board chair resolutions won high votes at power companies Dominion Energy and Duke Energy at 46.6% and 40.1% respectively, at oil giant ExxonMobil with 32.7% and at Southern Company with 22%. Read:As boomers hand over the keys to the stock market, sustainability-minded younger investors let their consciences lead “Climate Action 100+ investor signatories are propelling the transition to net-zero emissions, calling on companies to account for their climate risks, disclose their lobbying, and act on climate,” said New York City Comptroller Scott Stringer, who filed proposals at several of the companies. “We were pleased to see encouraging vote results on proposals that we led at Dominion Energy, Duke Energy, and General Motors. Companies are on notice that investors demand climate action from the companies they own.” Under CEO Darren Woods, Exxon has blocked six climate resolutions from the 2020 ballot, which has inspired activists to push harder for the leadership split. Despite Exxon’s concerted opposition, the refiled resolution seeking an independent board chair received 32.7% of shareholder support. Past filings have revealed a majority of shareholders believe they “derive significant benefits” from the combined roles held by Woods. “Companies that fail to address investors’ climate risk concerns ​do so at ​great peril,” said New York State Comptroller Thomas P. DiNapoli. “Exxon, in particular, has made itself an outlier for its refusal to seriously account for the demands of a lower carbon global economy. Climate Action 100+ investors will continue to make ground as we advance corporate reforms that address ​risks posed by the climate crisis.” ​ Pact signatory BlackRock, the world’s largest asset manager with some $7 trillion under watch, did push for an independent chair at Exxon, voted against two directors and publicly called out the oil concern for a too-slow response with climate goals. Earlier this year, BlackRock BLK, +1.18% CEO Larry Fink promised to put sustainability and climate change at the center of its investment strategy and analysis. Top Exxon holders include BlackRock, Vanguard Group and State Street Corp, which combined own about 20% of Exxon shares. The largest U.S. pension fund, California Public Employees Retirement System or CalPERS, also voted against two ExxonMobil directors and publicly declared its concern with the board’s failure to disclose greenhouse gas emissions across the company’s full value chain. “Climate change poses a systemic risk for investors like CalPERS. As fiduciaries, we need to hold boards accountable for setting targets for reducing the greenhouse gas emissions that cause global warming,” said Anne Simpson, CalPERS interim managing investment director, and a member of the global steering committee of Climate Action 100+. Read:Amazon’s $2 billion fund for innovation in curbing climate change is latest sustainability effort from criticized delivery giant The list of over 100 targeted firms in the Climate Action pact include “systemically important emitters” that account for two-thirds of annual global industrial emissions, alongside more than 60 others with significant opportunity to drive the clean energy transition. The initiative has grown to include more than 450 investor signatories with combined assets under management of more than $40 trillion. Signatories engage with companies through dialogue and wider engagement which often result in significant progress. However, when dialogues do not produce the momentum needed, signatories file shareholder proposals. “The record high votes for Climate Action 100+ shareholder proposals and the near unanimous support for them from proxy advisors is clear evidence that capital market influencers are aligning around the goals of the Paris Agreement,” said Mindy Lubber, Ceres CEO and President, and a member of the global steering committee of Climate Action 100+. One of the alliance’s most significant victories came last month when following a combination of dialogue and shareholder proposals over the past several years, Southern Company SO, +0.05% , one of the largest electricity producers in the U.S., pledged to set a goal to achieve net-zero emissions by 2050."}]}