{"article": [{"url": "https://www.marketwatch.com/story/at-home-or-in-class-how-to-save-money-on-back-to-school-shopping-this-year-2020-08-10", "published": 1597036220.0, "headline": "At home or in class: How to save money on back-to-school shopping this year", "body": "This article is reprinted by permission from NerdWallet. Back-to-school shopping is an expensive chore in a normal year; this year is anything but normal. But with August upon us, stores are putting out back-to-school displays in anticipation of children needing to learn, whether in the classroom or at home. Two-fifths (40%) of parents with children in K-12 or college anticipate their children will be attending classes in a hybrid environment (both in-person and remote) in the fall of 2020, according to a new NerdWallet survey conducted online July 16-20 by The Harris Poll among over 600 parents. Planning for multiple scenarios could result in the need for increased back-to-school spending, but many may not have the extra money this year. Nearly half (47%) of parents expect they’ll spend less on back-to-school shopping than they otherwise would, due to the coronavirus pandemic, according to the survey. Of them, 40% say it’s because their household income has been affected by the pandemic and related economic effects. On the other hand, one-fifth (20%) of parents expect to spend more this year on back-to-school purchases than they otherwise would, due to the pandemic. Of them, 54% think they’ll be spending more to outfit a home learning environment, and 50% will be spending more to account for supplies for both in-person and at-home learning. “Saving on back-to-school shopping takes some strategizing in a normal school year, but this year poses unique challenges: Not only is it harder to know what students might need, but many families are eyeing big purchases to make remote learning easier, including electronics and desks,” says Kimberly Palmer, personal finance expert at NerdWallet. “At the same time, many families have less room in their budget to make new purchases because of the pandemic.”1. Shop for the short term Whether you’re spending less this year out of necessity or you’re anticipating having to spend more: Buy only what you need. If 2020 has taught us anything, it’s that well-laid plans can change. So purchase what you need to get the school year started and plan to supplement those purchases as the semester unfolds. You may find that some items get less expensive as the seasons change. “Unless you have your eye on a specific type of computer or another item that could sell out, it’s OK to wait to make your purchases until after the school year begins — in fact, that’s when you see many of the best deals,” Palmer says.2. Take advantage of credit card rewards More than half (53%) of parents who will back-to-school shop this year plan to use a credit card on those purchases, according to the survey. Putting your expenses on a cash-back credit card could put your money to work for you. You may even reap enough to cover next year’s back-to-school expenses entirely. Just make sure you’re able to pay off the balance each cycle, as interest can quickly negate any benefits.3. Check prices before and after shopping Price matching involves comparing identical items at other stores and asking a retailer to match a lower price. The trick may not make sense for a package of pencils, but for clothing, electronics and other higher-dollar items, a successful price match could save you tens of dollars, if not more. Also on MarketWatch: Tech companies are offering parents additional benefits as COVID-19 threatens schools’ return Check a retailer’s website for its price matching policy details. Many will also refund the price difference if you spot a cheaper price within a certain time frame after the purchase.4. Team up to buy in bulk Regardless of where your child is learning this fall, they’ll need supplies that other students are also after. By teaming up with other parents, you can purchase things like hand sanitizer and supplies for homework and note-taking in bulk. If your child’s teacher is reluctant to give out parents’ contact information, ask if they would send out yours in a group email so other parents can reach you if they’re interested in group savings. Also see: From nanny services to ‘private educators,’ wealthy parents are paying up to $100 an hour for ‘teaching pods’ during the pandemic “With many parents focused on at-home learning, you can also find savings by teaming up with other families in your neighborhood on purchases,” Palmer says. “Some communities are forming ‘pandemic pods’ to share the burden of teaching at home and keep kids socialized — pooling school supplies across the pod can spread the expenses and make them more manageable.”5. Shop on tax-free holidays Sixteen states are having sales tax holidays in August 2020. Most of them last through a full weekend, and some even longer. Retailers that offer online ordering for in-store pickup may require you to order and pick up on those particular days to reap the tax-free benefits. The specifics of each state’s holiday vary, but generally, they allow you to purchase certain back-to-school items without paying sales tax.6. Practice and teach thriftiness If money is very tight, your child might be able to reuse some of last year’s supplies such as their backpack or leftover pencils and notebooks. You can also shop secondhand on sites like Poshmark or thredUP for clothing throughout the school year. And don’t be afraid to ask for help — many schools are putting programs in place that help outfit homes with the technology needed for remote learning. Related: This chart reveals what matters most as schools announce COVID-19 reopening plans If your child isn’t accustomed to having to make sacrifices like this, use them as a teachable moment. Older kids can learn the complexities of managing a budget, a tool they’ll need in adulthood, and younger ones can learn what saving money means and help you search for the lowest prices. “Some communities are also organizing online volunteer opportunities for high-schoolers to help match up with elementary school children who need extra help, which can be a great way to provide learning opportunities to both age groups in a safe, free way,” Palmer adds. “This school year will be unlike any other, which means parents and children will have to get more creative with stretching their back-to-school budgets.”More from NerdWallet: What to Know Before Laying Down Money for a Mattress What to Buy (and Skip) in February Here’s When Everything Will Go on Sale in 2020 Elizabeth Renter is a writer at NerdWallet. Email: elizabeth@nerdwallet.com. Twitter: @elizabethrenter."}]}