{"article": [{"url": "https://www.marketwatch.com/story/his-short-position-just-got-obliterated-but-this-tesla-bear-isnt-giving-up-11598976511", "published": 1598979980.0, "headline": "His short position just got â\u0080\u0098obliterated,â\u0080\u0099 but this Tesla bear isnâ\u0080\u0099t giving up", "body": "It's hard out there for a Tesla short. Getty Images Any investor in the painful position of being caught on the short side of the Tesla juggernaut would certainly be forgiven for keeping a low profile, considering the stockâ\u0080\u0099s incredible run. But Stanphyl Capitalâ\u0080\u0099s Mark Spiegel, in a recent letter to investors highlighted on the ValueWalk blog, reiterated the anti-Tesla thesis that heâ\u0080\u0099s been spouting for years, while acknowledging the carnage that his short position has caused to his broader portfolio. â\u0080\u009cYear-to-date, TeslaÂ (the biggest bubble in modern stock market history) is up an astounding 495%â\u0080¦ and that hurt usÂ significantly,â\u0080\u009d he wrote.Â â\u0080\u009cSo our short positions have obliterated the profits from our long positions, and yet when this bubble pops weâ\u0080\u0099ll be glad we have them.â\u0080\u009d From there, he touched on the bullet points as to why he believes he will ultimately profit from Teslaâ\u0080\u0099s demise, including the lack of a moat and a return to red ink once emission credit sales expire. He also tore into CEO Elon Musk, who heâ\u0080\u0099s been consistently been painting as a fraud. “ â\u0080\u0098Need I say more about what anÂ insane bubble Â this stock is? Okay, Iâ\u0080\u0099ll say moreâ\u0080¦â\u0080\u0099 ” â\u0080\u0094 Mark Spiegel â\u0080\u009cSuperior competitionâ\u0080\u009d will also be a huge factor going forward, Spiegel explained, with growing electric lineups from Audi, BMW, Mercedes, Volvo and Volkswagen, to name just a few. â\u0080\u009cFor those who still think â\u0080\u0098Tesla is years ahead of the competition,â\u0080\u0099 the most competitive EV region in the world is Europe, and Teslaâ\u0080\u0099s EV market share there has now declined from over 30% to a year-end estimate of single digits,â\u0080\u009d he wrote, pointing to this chart: iframe.twitter-tweet { width: 100% !important; } Meanwhile, Tesla shares TSLA, +1.89% took a hit on Tuesday, after the company took advantage of the stockâ\u0080\u0099s best monthly performance in seven years to raise more capital. Before the offering was disclosed, the stock wasÂ up as much as 7.9% premarket. The broader stock market, however, finished in the green, with the Dow Jones Industrial Average DJIA, +0.56%, S&P 500 SPX, +0.87% and tech-heavy Nasdaq Composite COMP, +1.39% all firmly in positive territory."}]}