{"article": [{"url": "https://www.marketwatch.com/story/here-are-tech-companies-plans-for-increasing-diversity-amid-protests-over-racial-inequality-2020-06-25", "published": 1593520280.0, "headline": "Here are tech companiesâ\u0080\u0099 plans for increasing diversity amid protests over racial inequality", "body": "Sparked by social protests over systemic racism, the tech industry is laying out concrete plans to increase diversity within their workforces. Here are the plans that have been publicly announced recently by some of the biggest names in technology. â\u0080¢ Netflix Inc. NFLX, +1.43% Â said it plans to put 2% of its cash holdings, or up to $100 million initially, toward financial institutions and other groups â\u0080\u009cthat directly support Black communities in the U.S.â\u0080\u009d â\u0080¢ Microsoft Corp. MSFT, +2.48% Â Chief Executive Satya Nadella, in an email to employees posted on Microsoftâ\u0080\u0099s corporate blog, said the software giant is adding $150 million to its diversity and inclusion investment, and will â\u0080\u009cdouble the number of Black and African American people managers, senior individual contributors, and senior leaders in the United States by 2025.â\u0080\u009d Read: After years of talk, tech companies appear to be getting serious about diversity efforts â\u0080¢ In a wide-ranging interview with CBS before the Apple Worldwide Developers Conference, Apple AAPL, +1.74% Â CEO Tim Cook spoke about the role smartphone cameras play in revealing systemic racism. He further highlighted the conversation at the start of his keynote speech, touching on racial justice, equality, and COVID-19. â\u0080\u009cWeâ\u0080\u0099re committed to being a force for change,â\u0080\u009d said Cook, who earlier this month pledged to donate $100 million to organizations furthering racial equity and justice. The company has also announced a new developer entrepreneur camp for black developers. See also: CEO Cook on Appleâ\u0080\u0099s role in tackling inequality: â\u0080\u0098I do believe, optimistically, this is one of those moments that we could make significant progressâ\u0080\u0099 â\u0080¢ Google parent Alphabet Inc. GOOGL, +1.82% Â GOOG, +1.97% Â vowed to increase the proportion of â\u0080\u009cleadership representation of underrepresented groupsâ\u0080\u009d overall by 30% at the company by 2025, according to Alphabet CEO Sundar Pichai. Additionally, Alphabet will provide $175 million in a mix of financing and funding to related businesses. â\u0080\u009cListening to the personal accounts of members of our Black Advisory Leadership Group and our Black+ Googlers has only reinforced for me the reality our Black communities face: One where systemic racism permeates every aspect of life, from interactions with law enforcement, to access to housing and capital, to health care, education, and the workplace,â\u0080\u009d Pichai wrote in a memo. â\u0080¢ Facebook Inc. FB, +0.26% Â Chief Operating Officer Sheryl Sandberg announced in a blog post that the company has committed to a 30% increase in the number of people of color in leadership positions over the next five years, and will devote $200 million to support black-owned businesses and organizations â\u0080\u0094 part of a $1.1 billion investment in black and diverse suppliers and communities in the U.S. â\u0080¢ SAP SE SAP, +0.65% Â issued a pledge to â\u0080\u009cdouble the representation of African-American talent in the U.S. over the next three years.â\u0080\u009d Additionally, it introduced a new marketing program, â\u0080\u009cSpotlight Black Businesses,â\u0080\u009d to assist small, black-owned businesses that have been impacted by COVID-19 and protests caused by social unrest. â\u0080¢ In a May Corporate Responsibility Report, Intel Corp. INTC, -1.03% Â released diversity goals of increasing the number of women in technical roles to 40% and doubling the number of women and underrepresented minorities in senior roles by 2030. In early 2015, then-CEO Brian Krzanich pledged $300 million toward diversity efforts and set 2020 as a deadline to reach â\u0080\u009cfull representationâ\u0080\u009d in hiring. The company said that it actually achieved that goal in 2018. â\u0080¢ Kicking off Hewlett Packard Enterprise Co.â\u0080\u0099s HPE, -1.80% Â Discover Virtual Experience conference, CEO Antonio Neri acknowledged the need to do more â\u0080\u0094 recent actions include formation of a global inclusion and diversity council chaired by him to oversee the development of a detailed plan. â\u0080\u009cI challenge you to join me to use this moment to take a stand, to speak up on inclusion and to advocate for equity,â\u0080\u009d Neri said. â\u0080\u009cWe have to do better as a society. And, together, we can make a difference and be a force for good.â\u0080\u009d â\u0080¢ Mozilla Corp. said it intends to double the percentage of black and Latinx representation of its 1,000-person U.S. staff. It also wants to increase black representation in the U.S. to 6% at the director level and up, as well as representation on Mozilla and Mozilla Foundation boards. â\u0080\u009cThis is a starting point for what Mozilla should look like, not an aspirational end point, and it applies to all levels of the organization,â\u0080\u009d Mark Surman, executive director of the Mozilla Foundation, told MarketWatch. â\u0080\u009cThere is no question events of the past few weeks have underlined the need to focus more on racial justice. The collective push of the tech industry is promising and important, but we need to make sure we are collectively held accountable on moving the ball.â\u0080\u009d â\u0080¢ Two weeks ago, Reddit named Y Combinator CEO Michael Seibel, who is black, to its board of directors after Reddit co-founder Alexis Ohanian stepped down and asked to be replaced by a black candidate."}]}