{"article": [{"url": "https://www.marketwatch.com/story/now-you-can-screen-for-humidity-and-more-on-marketwatchs-upgraded-where-should-i-retire-tool-2020-09-30", "published": 1601715800.0, "headline": "Now you can screen for humidity and more on MarketWatch's upgraded 'Where should I retire?' tool", "body": "In the search for the perfect retirement spot, \"perfect\" weather is high on the list. And while that definition can vary, one thing MarketWatch readers have repeatedly told us is that humidity (or lack of) matters. Average July highs in the 80s would be great too, they say. On top of weather, they want a below-average cost of living and low taxes. So the good news is that MarketWatch has added summer humidity in the latest update to its \"Where should I retire?\" tool. And just where is that perfect place to retire? The bad news: you probably need to compromise. When I asked the retirement tool to select metro areas with very low humidity in July, a low overall tax burden (as measured by the Tax Foundation's \"tax freedom day\"), a below-average cost of living, those summer temperatures in the 80s and average January highs in the 40s, I got three government-defined micropolitan statistical areas, all in Idaho and all with fewer than 50,000 people that met 100% of the criteria. The trio - the areas around Burley, Moscow and Mountain Home - all get snow, and in the case of the city of Moscow, 4 feet of it annually. How about settling for low humidity, rather than very low humidity, but keeping everything else the same? No perfection. But if you are flexible on winter temperatures and on taxes (after all, these are areas where the cost of living is below the national average), your options open up to dozens of areas, even to California. (You must search separately for low and extremely low humidity. You can also sort by population or cost of living.) Add more criteria and your options narrow, of course. How are we measuring humidity? Dew points. The higher the dew point, the more moisture is in the air. In the heat of summer, that extra moisture means it's more uncomfortable. The data comes from Prism Climate Group at Oregon State University using government weather data from 1981 to 2010. MarketWatch used July data as the proxy for summer, and Chris Daly, who directs Prism, and other meteorologists, helped us group the numbers into five categories, from extremely low to extreme humidity. A word of caution: The Prism data breaks down the continental U.S. into small grids. MarketWatch averaged the data across each metropolitan or micropolitan statistical area. If there is a considerable change in elevation in that MSA - think Brookings, Ore., or the Truckee-Grass Valley area of California - the average isn't as useful. Perhaps not surprisingly, the southeast is particularly humid. There's that trade-off for the warm winter weather. And Arizona isn't as dry as outsiders might expect. That's because of its monsoon season from June through September, which can bring everything from heavy rains to hail (and even dust storms). MarketWatch isn't breaking down July humidity to Prism's level of detail. We've settled on under 50 for extremely low humidity, 50 to 59 for low humidity, from 60 to just under 65 for moderate humidity, from 65 to just under 70 for high humidity and anything 70 or higher as extreme humidity. By comparison, here's what U.S. humidity looks like in January. In exceptionally dry places, your skin will chap, and you may want to compensate by adding moisture with a humidifier. More additions What else has been added? Doctors. Using data from the University of Wisconsin Population Health Institute, you can now screen for areas that have an above-average number of primary-care doctors per capita. That should translate into an easier time finding a new doctor. The addition builds on previous upgrades to the health-care options, including adding screens for VA medical centers, top cancer hospitals (cancer centers designated by the National Cancer Institute) and hospital and nursing homes rated five stars by Medicare. In our latest update, we also added more options on the median values of owner-occupied homes. This uses Census Bureau data, not real-time market data. Previous updates included more demographic data, from the share of seniors and college grads in an MSA to whether an area is particularly religious. We also narrowed the definition of college towns to only areas with top research universities. Why no crime data? Despite requests from readers, we have not added crime data. One reason is that we are looking at metro areas, not individual towns or neighborhoods. Crime can vary considerably within a large city or a county, let alone across several counties. So the data wouldn't offer much insight. And that assumes there is national data. Unfortunately, the FBI's Uniform Crime Report is voluntary and inconsistent (no New York metro area in the 2018 report, for example). Smaller metropolitan areas don't appear at all. MarketWatch will continue to revisit the topic, particularly after the FBI launches its new crime reporting system. Of course, a place that looks good on paper may not feel right once you see it in person. So while these additions should get you closer to finding your perfect place to retire - and we hope that place exists for you - take a deeper look. When you visit, act as if you are living there, rather than being on vacation. See it at its worst (weather). You want to avoid unpleasant surprises after you move; that's too expensive a mistake to make with your hard-earned retirement."}]}