{"article": [{"url": "https://www.marketwatch.com/story/stock-futures-higher-after-big-tech-delivers-blowout-earnings-2020-07-31", "published": 1596274880.0, "headline": "Stocks stage a late-day comeback to end higher one day after a Big Tech earnings blowout", "body": "Stocks rebounded late Friday to close modestly higher after trading lower most of the day, weighed down by a mixed batch of earnings results, disappointing economic data and a lack of progress on Capitol Hill toward another coronavius aid package. Inspired by blowout earnings from tech heavyweights Apple, Amazon, Facebook and Google parent Alphabet, stocks rallied at the open, slipped into mostly negative territory during the session, and then recovered in the final hour.What did the major benchmarks do? The Dow Jones Industrial Average DJIA, +0.56% added 114.67 points, or 0.4%, to close at 26,428.32, while the S&P 500 SPX, +0.87% gained 24.90 points, or 0.8%, ending the trading day at 3,271.12. The tech-heavy Nasdaq Composite COMP, +1.39% closed at 10,745.27, up 157.46 points or 1.5%. The Dow on Thursday fell 225.92 points, or 0.9%, to end at 26,313.65, while the S&P 500 lost 12.22 points, or 0.4%, to close at 3,246.22. The Nasdaq Composite rose 44.87 points, or 0.4%, to finish at 10,587.81. For the week, the Dow lost 0.2%, while the S&P 500 gained 1.7% and the Nasdaq surged 3.7%. What drove the market? Tech earnings were in focus following results from some of the industry’s largest and most powerful players after Thursday’s closing bell, including Apple Inc. AAPL, +1.74%, Facebook Inc. FB, +0.26%, Amazon.com Inc. AMZN, +3.01% and Google parent Alphabet Inc. GOOGL, +1.82% GOOG, +1.97%. Apple soared 10% to a new record high, while Facebook gained 7%. Read:Pandemic? Antitrust? No worries for Big Tech, which racked up $200 billion in sales anyway Need to Know:Apple and Amazon to dominate an economy ‘without mouths or noses’ but 10% of jobs may never come back, strategist says But it was a different story outside the tech sector with the energy sector hit by poor second quarter results and Dow component Chevron CVX, -1.62% down 2.7%. “This morning the mood was mixed with a plethora of earnings results. Exxon had its worst quarterly loss in modern history, while Chevron’s results were the worst in three decades,” said Edward Moya, analyst at Oanda, in a note. Stocks softened after a downbeat reading on U.S. consumer sentiment. The final reading of the University of Michigan’s consumer sentiment index in July slipped to 72.5 from an initial 72.9. The index registered 73.2 in June. “The deterioration in consumer sentiment along with a failure to extend full emergency unemployment benefits will weigh on consumer spending,” said Nancy Vanden Houten, lead economist at Oxford Economics. “We do expect policy makers to approve another round of direct payments to households, but that will provide only temporary relief.” There was little sign of progress in talks between congressional Democrats, Republicans and the White House on a new coronavirus relief bill with expanded unemployment benefits due to expire Friday. Democrats rejected a White House proposal to temporarily extend the $600-a-week in added benefits, saying the Trump administration didn’t understand the severity of the crisis. Talks between Trump administration officials and congressional Democrats could stretch into the weekend, White House chief of staff Mark Meadows told reporters Friday morning. Peter Andersen, founder of Boston-based Andersen Capital Management, thinks investors should take some comfort from the unprecedented messaging coming from policy makers, both monetary and fiscal. While the details of another aid package aren’t finalized yet, Andersen said in an interview, Washington is sending “signals” that it will support the economy. “In a moment when we can’t be analytical, it’s important to be psychological,” he said. “I’m thrilled that the Fed came out and said, we’re going to keep rates low. I just think the market is positioned for a tremendous rally when the consumer emerges from lockdown with a vaccine, low gas prices and ultra-low interest rates.” Still, the drumbeat of bad news continues, for now. The U.S. saw record deaths from COVID-19 in Texas, Florida and Arizona, while California faced its second-deadliest day. In vaccine news, European drugmaker Sanofi SNY, +0.89% said the U.S. government will pay up to $2.1 billion for the COVID-19 vaccine candidate it is developing with GlaxoSmithKline GSK, +1.10%. The funding, part of Operation Warp Speed, will be used to support ongoing clinical development and manufacturing of the experimental candidate, with at least 100 million doses promised to the U.S. U.S. consumer spending rose 5.6% in June, while personal incomes declined by 1.1%, government data showed, but spending may be slowing again in July given unemployment benefit claims are edging up again in weekly data. A related measure of core inflation, the Federal Reserve’s favorite gauge of price pressures, rose 0.2%, in line with expectations. The employment cost index for the second quarter rose 0.5%, versus expectations for a 0.6% rise.Which companies were in focus? Shares of Apple roared 10.5% higher, after the iPhone maker reported record profit, crushing Wall Street expectations, and announced a 4-for-1 stock split that will change the pecking order of the price-weighted Dow Jones Industrial Average. Amazon shares were up 3.7% after delivering results that soared past forecasts for sales and earnings. Facebook shares rose 8.2% after the social-networking giant easily topped expectations for earnings and revenue. Alphabet shares were down 3% after the Google parent met expectations despite a dip in advertising revenue. Shares of Dow component Caterpillar Inc CAT, +1.45% lost 2.8% after the construction-equipment giant reported earnings and revenue that fell less than expected. Oil company Chevron Corp. CVX, -1.62% saw shares fall 2.7% after delivering a wider-than-expected loss and revenue that lagged estimates. Shares of oil giant Exxon Mobil Corp. XOM, -1.47% closed up 0.5% after trading in the red most of the day and despite disappointing on earnings and revenue. Chevron and Exxon Mobil are also members of the Dow. Ford Motor Co. F, -1.36% shares initially rose after delivering a narrower-than-expected adjusted loss in the second quarter, with sales cut in half in comparison with a year ago but in line with Wall Street forecasts, but closed 2.1% lower. Shares of Merck & Co. Inc. MRK, -0.14% rose 1.6% after its earnings and revenue beat expectations and the drugmaker raised its outlook. What did other markets do? In Asia, China’s CSI 300 index 000300, +2.04% rose 0.8%, the Shanghai Composite SHCOMP, +1.67% rose 0.7%, Hong Kong’s Hang Seng Index HSI, -0.30% fell 0.5% and Japan’s Nikkei 225 NIK, -0.11% slumped 2.8%. Stocks closed lower in Europe, with the Stoxx 600 Europe index SXXP, +0.55% down 0.9% at 356.33, while the U.K.’s FTSE 100 UKX, +0.64% fell 1.5% to close at 5,897.76. Gold futures US:GCQ20 closed at a fresh all-time high, notching their best monthly gain since 2016. December gold GCZ20, +2.17% closed at $1,985.90 an ounce Friday, up 1%, or $19.10. The ICE U.S. Dollar Index DXY, -0.58% edged up 0.4%, marking its biggest monthly fall since 2010. Oil futures closed higher, with the U.S. benchmark US:CLU20 up 0.9% to $40.27 a barrel on the New York Mercantile Exchange, and gaining 2.6% for the month. The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% fell 1.8 basis points to 0.538%. Yields move in the opposite direction of prices. See: 10-year Treasury yield plunged to its lowest in 234 years, says Deutsche Bank"}]}