{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-flat-but-dow-futures-climb-170-points-after-trump-postpones-stimulus-talks-11602056524", "published": 1602057980.0, "headline": "European stocks struggle on weak oil prices, while investors watch U.S. politics", "body": "ozan kose/Agence France-Presse/Getty Images European stocks struggled for direction on Wednesday, even as Wall Street was poised to rebound as investors clung to hopes for stimulus moves. Weak oil prices weighed on heavily weighted energy companies. The Stoxx Europe 600 index SXXP, +0.55% was flat, the German DAX DAX, +0.06% fell 0.2%, and the French CAC 40 PX1, +0.71% slipped 0.1%. The FTSE 100 UKX, +0.64% was also unchanged. President Donald Trump said he would end fiscal stimulus talks until after the November election. The Dow industrials DJIA, +0.56% fell 375 points in reaction to that news, but Dow futures YM00, +0.82% rose about 200 points. Trump later tweeted that he would be willing to pass several independent stimulus measures, including a new round of stimulus checks. At the end of the day, “investors know that whoever will win the U.S. presidential election, another stimulus package is more likely to happen,” said Naeem Aslam, chief market analyst at AvaTrade, in a note to clients. The U.S. election stays in focus for later with a debate between Vice President Mike Pence and Democratic challenger Sen. Kamala Harris of California. In Europe, investors will also hear from European Central Bank President Christine Lagarde in an early afternoon speech. The U.S. will get the minutes of the latest Federal Reserve meeting alongside a couple of members speaking. Fresh data showed German industrial production declined in August after three straight months of growth. Berlin has become the latest European city to introduce stricter closing times for bars and businessness, which will have to close by 11 p.m. local time. Madrid and Paris have seen similar curfews. On the corporate front, shares of Tesco TSCO, +1.80% pared a gain down to 0.5% after the U.K. grocer reported a higher pretax profit for the first half of fiscal 2021 as revenue rose. Shares of Rolls-Royce Holdings RR, +14.25% rose 1.7%, and were poised for a third-straight session of gains. The engineering company’s shares jumped 12% on Tuesday, a day after the company announced a £1 billion ($1.3 billion) convertible bond offering and winning a contract in India. Drinks makers were also trading higher, with shares of Heineken NV HEIA, -0.63%, Pernod Ricard RI, +0.91%, and Anheuser-Busch InBev BUD, -0.21% all gaining more than 2%. Shares of Diageo DGE, -0.27% rose 1.3%. A team of analysts at Jefferies highlighted the above drinks names as those to own in a post-pandemic environment. Shares of energy companies fell, with Total and BP down over 1% each as U.S. CL.1, -1.62% and Brent crude prices BRN00, -0.07% dropped over 2% each."}]}