{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-case-tally-tops-145-million-as-us-death-toll-climbs-above-140000-with-new-infections-still-rising-2020-07-20", "published": 1595248160.0, "headline": "Coronavirus update: Global case tally tops 14.5 million as U.S. death toll climbs above 140,000 with new infections still rising", "body": "The number of cases of the coronavirus illness COVID-19 world-wide rose above 14.5 million on Monday, and the U.S. case tally rose to 3.77 million and its death toll topped 140,000, as new infections continued to surge in the South and West. There was positive news from two separate trials of vaccine candidates, both of which triggered immune responses. Experts cautioned that the data is preliminary and more evidence from bigger trials is needed. In an interview with Fox News Anchor Chris Wallace, President Donald Trump defended his record on managing the pandemic, but he again claimed that testing is behind spikes in the U.S. and belittled his leading infectious-disease expert, Dr. Anthony Fauci, calling him an “alarmist.” Trump claimed that young people are to blame for the recent spike and claimed they “would heal in a day.” “They have the sniffles and we put it down as a test,” he said. Trump said he did not support a federal mandate on wearing face masks, a step that health experts say is needed to contain the spread of the deadly illness, along with frequent hand washing and social distancing. Roughly half of U.S. states have taken some action mandating face masks and on Monday, retailers including Walmart Inc. WMT, +1.00%, Target Corp. TGT, +1.14%, Best Buy Co. Inc. BBY, +1.45% and Lowe’s Cos. LOW, +1.38% launched face-covering requirements for all of their customers across the U.S. Outside the U.S., more countries are adopting mandatory face-masks, including France, where it is required in all indoor spaces as of Monday, and the U.K., where it will be required from Friday. Senate Minority Leader Chuck Schumer said Trump’s comments showed that he is still denying the severity of the crisis: “He still has no adequate national testing strategy and continues to underutilize the Defense Production Act, wasting valuable time and resources,” Schumer wrote in a letter to Democrats as they gear up to debate the next stimulus bill. On Sunday, Kentucky, Louisiana, Oregon and South Carolina set new one-day records for new infections, the Washington Post reported. Florida, the new U.S. hot spot, is running out of intensive-care unit beds. Miami-Dade Country, the Florida epicenter, now has 84,237 cases and 1,302 deaths, according to a New York Times tracker. The mayor of Hialeah, Fla., a city in Miami-Dade country, told CNN it is at a “breaking point.” iframe.twitter-tweet { width: 100% !important; } Latest tallies There are now 14.54 million confirmed cases of COVID-19, according to data aggregated by Johns Hopkins University, and the death toll has climbed 606,206. At least 8.1 million people have recovered. The U.S. has 3.77 million cases, or about a quarter of the global total, and 140,534 deaths. A full 53 states and territories have seen cases climb for the last 14 days, according to a New York Times tracker. Brazil is second to the U.S. with 2.1 million cases and 79,488 deaths. India is third measured by cases at 1.1 million, followed by Russia with 770,311 and South Africa with 364,328, which has moved ahead of Peru, which has 353,590 cases. The U.K. has 296,364 cases and 45,385 fatalities, the highest in Europe and third highest in the world. China, where the illness was first reported late last year, has 85,314 cases and 4,644 fatalities. See now: Amid summit stalemate, EU leader pleads for unity to pass massive coronavirus recovery fundWhat’s the latest medical news? A flurry of news on potential COVID-19 vaccines led to active trading of drug and biotech stocks Monday. AstraZeneca shares AZN, +1.16% AZN, +0.63% were volatile after a medical journal published a study that found the company’s vaccine candidate produced antibody and T-cell responses in participants in a Phase 1/2 clinical trial, MarketWatch’s Jaimy Lee reported. AstraZeneca is developing the experimental vaccine with the University of Oxford; the study was published in The Lancet. The single-blind, randomized, controlled trial found that neutralizing antibody responses were reported in 91% of 35 patients when utilizing one test and 100% of 35 patients when using a different test. It also found that T-cell responses peaked on day 14. “A single dose elicited both humoral and cellular responses against SARS-CoV-2, with a booster immunization augmenting neutralizing antibody titers,” the study’s authors wrote. Read:Abbott, J&J results buoyed by surprising June uptick in medical procedures even as coronavirus cases rise BioNTech BNTX, +1.23% and Pfizer Inc. PFE, -0.27%, which are also developing a COVID-19 vaccine, said earlier on Monday that their vaccine candidate produced a T-cell response in participants in an early-stage trial in Germany. The U.K. Government said it has secured early access to 90 million vaccine doses of the Pfizer/BioNTech vaccine candidate, as well as one from French group Valneva. The business ministry signed an agreement with the BioNTech/Pfizer alliance for 30 million doses. Delivery of an initial 10 million doses is expected to start by the fourth quarter of 2020, subject to clinical success and regulatory approval, with a further 20 million doses to be delivered in 2021. Shares of Enzymatica ENZY, -0.55% jumped 67% in Stockholm after the company said preliminary results in a study of the mouth spray ColdZyme, shows that in vitro, it can deactivate the virus causing the COVID-19 pandemic. A study demonstrated that ColdZyme deactivates the coronavirus by 98.3%, the company said. See now:Rule change for how hospitals report coronavirus data to government comes under fire “Even if the current in vitro results cannot be directly translated into clinical efficacy, it is very interesting that ColdZyme is able to effectively deactivate SARS-CoV-2 in vitro since it constitutes a proof-of-principle that can be taken further into clinical studies. Thus, the results indicate that ColdZyme can offer a protective barrier against SARS-CoV-2,” says Claus Egstrand, Enzymatica’s chief operating officer. Synairgen SNG, +7.54%, a U.K. respiratory drug company, saw its shares jump 370% after announcing positive results from a trial in hospitalized COVID-19 patients. The odds of developing severe disease during the treatment period were significantly reduced by 79% for patients receiving its SNG001 compared to patients who received placebo, the company said. “The results confirm our belief that interferon beta, a widely known drug that, by injection, has been approved for use in a number of other indications, has huge potential as an inhaled drug to be able to restore the lung’s immune response, enhancing protection, accelerating recovery and countering the impact of SARS-CoV-2 virus,” said Tom Wilkinson, professor of respiratory medicine at the University of Southampton and trial chief investigator. Finally, Moderna Inc. shares MRNA, +0.09% slid 10%, after J.P. Morgan downgraded the stock to neutral from overweight over concerns about the valuation of the preclinical company, which has never produced an approved product. Moderna is also developing a COVID-19 vaccine candidate, one that is widely considered one of the front-runners; it was the first company to share data about how its experimental vaccine performed in a Phase 1 clinical trial. Shares have soared 384.9% since the start of the year, as the S&P 500 SPX, +0.87% has dipped 0.2%. “This stock move itself isn’t entirely surprising given the rapid execution on mRNA-1273, the tremendous widespread investor interest on this program, and the obvious unmet need/opportunity for a COVID-19 vaccine,” they wrote in a note Monday. “That said, at these levels we are having difficulty justifying more upside given the uncertainty of the duration/characteristics of the COVID-19 pandemic.”What are companies saying? The second-quarter earnings season continued with numbers from egg producer Cal-Maine Foods Inc., which swung to a profit from a loss a year ago. Profit and sales were boosted by demand for eggs and a big improvement in pricing, driven by consumers eating more at home during the pandemic. Read now:S&P 500 earnings set to plunge as the coronavirus batters all sectors — with Wall Street counting on a bounce that may not come Oil services company Halliburton Co. reported an unexpected adjusted profit for its quarter, but revenue fell short of expectations. Oil companies have been hit by the twin effects of a falling oil price and lowered demand during the pandemic. Here’s the latest news on companies and COVID-19: • Briggs & Stratton Corp. US:BGG filed for chapter 11 bankruptcy protection and reached an agreement to sell most of its assets to KPS Capital Partners. The Milwaukee-based company, which makes gasoline engines for outdoor power equipment like lawn mowers, has secured debtor-in-possession financing of $677.5 million from KPS and its existing lenders to allow it to continue normal operations ahead of the closing of the deal. “Over the past several months, we have explored multiple options with our advisers to strengthen our financial position and flexibility,” Chief Executive Todd Teske said in a statement. “The challenges we have faced during the COVID-19 pandemic have made reorganization the difficult but necessary and appropriate path forward to secure our business • Cal-Maine Foods Inc. CALM, -0.75% swung to a profit in its fiscal fourth quarter from a loss a year ago, buoyed by demand for eggs during the pandemic. “After three fiscal quarters characterized by an oversupply of eggs and depressed market prices, demand for eggs increased and market prices rose 62.4 percent during our fourth fiscal quarter over the average price for the first three quarters, as consumers purchased more eggs for preparing meals at home in response to the COVID-19 pandemic,” Chief Executive Dolph Baker said in a statement. The demand trend coincided with the Easter season, a peak for egg sales. The supply of eggs continued to trend downward through the quarter, he said, as hen numbers fell by 13.9 million to 319.8 million, according to USDA numbers. Specialty egg sales came to $133.3 million to account for 29.9% of egg sales revenue, compared with 119.9 million, or 44.1 percent of egg sales revenue, in the fourth quarter of fiscal 2019. “Current supplies of corn and soybeans are favorable, and we believe we will continue to have an adequate supply of both grains in fiscal 2021,” said Baker. “However, current ongoing uncertainties and supply chain disruptions related to the COVID-19 outbreak, weather fluctuations and geopolitical issues surrounding trade agreements and international tariffs may lead to further price volatility.” The company will not pay a dividend this quarter. • Halliburton Co. HAL, -1.79% reported a surprise second-quarter adjusted profit but revenue that fell short of expectations. Completion and production revenue dropped 56% to $1.67 billion, just below the FactSet consensus of $1.70 billion, and drilling and evaluation revenue fell 28% to $1.52 billion to miss expectations of $1.62 billion. North America revenue dropped 68% to $1.05 billion, just shy of expectations of $1.08 billion. The company said results were pressured by a decrease in pumping activity and drilling-related services. • ManpowerGroup MAN, -0.65% reported an adjusted second-quarter profit that missed expectations, while revenue fell less than forecast, as the pandemic “materially” impacted results. The company swung to a net loss as revenue fell 30.4% • PetMed Express Inc. PETS, -1.98% reported first-quarter earnings that missed expectations. Reorder sales rose 19% to $80.4 million, and new orders were up 29% to $15.8 million. PetMed acquired 186,000 new customers for the quarter, up from 140,000 last year. The company is considered an essential business and was open during coronavirus lockdown periods. PetMed declared a quarterly dividend of 28 cents per share, payable on August 7 to shareholders of record as of the close of business on July 31."}]}