{"article": [{"url": "https://www.marketwatch.com/story/killing-the-600-unemployment-benefit-is-a-boneheaded-move-11595954240", "published": 1595960300.0, "headline": "Killing the $600 unemployment benefit is a boneheaded move", "body": "Hundreds of unemployed Kentucky residents wait in long lines in Frankfort for help with their unemployment claims on June 19. John Sommers II/Getty Images Senate Republicans have so far resisted extending the $600/week assistance program because they believe the amount is too generous and creates a disincentive for unemployed Americans to return to work. But that argument has no basis in fact, nor does this position make any political sense. Many critics opposing the $600/week extension cite a survey conducted last May by the National Federation of Independent Business (NFIB), which included a question on whether that supplemental amount made it more difficult for employers to rehire workers. The NFIB has a membership of 300,000 small-business owners and the trade group took a random sample to answer questions that include the effects of the enhanced unemployment benefit. They managed to collect 685 responses in that survey and just 18% (123 businesses) admitted that an employee declined a job offer and preferred to stay on unemployment. In contrast, nearly seven out of 10 businesses said they experienced no such problem and were able to get people off unemployment and return to work. Breaking news: Consumer confidence wanes in July and points to rockier economic recovery It just stands to reason it would be poor strategy for Congress to vigorously oppose this benefit on the basis of such a flimsy survey result. There are other reasons as well. The belief that many unemployed Americans would much prefer sit on a couch watching daytime TV and temporarily collect unemployment—instead of being employed, earning a secure income and getting health-care benefits—utterly defies logic. People do want to get back to a safe work environment and maintain their skills and professional contacts. They know full well that employers can choose from a much larger pool of unemployed these days given all the recent layoffs. Anyone rejecting an invitation to return to work runs the risk of losing that position entirely. Let’s also remember there are many large industries where you cannot return to work at all, such as airlines, restaurants, lodging, retailers, telecommunications, banking, entertainment, oil, and advertising. Blocking the $600 a week funds in the middle of the worst pandemic in more than a century is a mindless position to take politically. With a fast-approaching national election that will determine who sits in the Oval Office the next four years and which party controls the Senate and House, it makes no sense to slash this benefit when it can cause financial hardships to more than 20 million voters who greatly depend on these funds at this time. Also read: America is facing an eviction crisis as moratoriums expire: ‘This is a potential catastrophe’ Some Republicans worry such government spending will only spill more red ink and worsen the national debt. It’s hard not to laugh at this sentiment. What an awful time to suddenly get religion and turn into born-again deficit hawks! Such a position has no credibility whatsoever after the GOP’s enthusiastic support for the 2017 tax cut, which benefited mostly high-income households and, yes, also helped blow up the deficit! Without a major fiscal package that leans closer to the HEROES Act passed in the House, the economy would be condemned to terribly weak growth in the second half of this year. Bernard Baumohl is chief global economist at The Economic Outlook Group."}]}