{"article": [{"url": "https://www.marketwatch.com/story/powell-in-jackson-hole-speech-will-put-out-feds-welcome-mat-for-hot-labor-markets-and-inflation-overshoots-2020-08-26", "published": 1598514560.0, "headline": "Powell in Jackson Hole speech will put out Fedâ\u0080\u0099s welcome mat for hot labor markets and inflation overshoots", "body": "In the old days, there were two things the Federal Reserve couldnâ\u0080\u0099t abide: hot labor markets and brewing inflation pressures. On Thursday, Fed Chairman Jerome Powell is going to start to lay out a reversal in policy, essentially putting out the welcome mat and hoping that these two conditions will arise in coming years. The Fed has said that Powell will start to discuss a formal change to its strategy, in the planning stages for much of the past two years. The need to revamp its policy strategy stems from the fact that it was built around a neutral interest rate around 4%. Over the past decade, global economic forces have pushed down the U.S. economyâ\u0080\u0099s steady-state interest rates to somewhere closer to 2%. The Fedâ\u0080\u0099s tool-kit just didnâ\u0080\u0099t work as well. The Fedâ\u0080\u0099s favorite tool for fighting recessions, cutting interest rates, doesnâ\u0080\u0099t carry the same punch anymore. Barrons:Jerome Powell is speaking at Jackson Hole: Hereâ\u0080\u0099s what to expect Former top Fed staffer, David Wilcox, now a senior fellow at the Peterson Institute for International Economics notes that much of the discussion of the Fedâ\u0080\u0099s new strategy centers on the central bankâ\u0080\u0099s newfound willingness to allow inflation to run hot for a period of time to â\u0080\u009cmake upâ\u0080\u009d for period of inflation that was below the central bankâ\u0080\u0099s 2% target. This is called â\u0080\u009caverage inflation targetingâ\u0080\u009d by central bankers. Another aspect of the Fedâ\u0080\u0099s strategy that is getting less attention is that Powell and his colleagues are going to disarm the central bankâ\u0080\u0099s hair trigger for raising interest rates at the first sign of a â\u0080\u009chotâ\u0080\u009d labor market. In the past, if the unemployment rate fell below what was considered a sustainable rate, the Fed automatically went on war footing. In the economic expansion that ended abruptly in March this year due to the coronavirus pandemic, the Fedâ\u0080\u0099s actions suggested it was beginning to change and it might to allow â\u0080\u009cthe lowest possible unemployment rateâ\u0080\u009d so long as inflation looked quiescent, Wilcox said. â\u0080\u009cThe Fed can and should clarify that it sees no intrinsic cost to unemployment running below its estimated lowest sustainable rate. Most market participants already understand the Fed to believe that, but itâ\u0080\u0099s important to align words with actions,â\u0080\u009d Wilcox said. The new policy strategy might also make clear that â\u0080\u009chot labor marketsâ\u0080\u009d have greater benefits for groups like Blacks and Latinos that historically have been relatively marginalized, he said. â\u0080\u009cIn short, hot labor markets are an excellent tool for reducing economic inequality,â\u0080\u009d Wilcox said. Given where the economy is relative to the coronavirus pandemic, these changes to strategy donâ\u0080\u0099t have an immediate impact on policy, said Lewis Alexander, chief U.S. economist at Nomura Securities. â\u0080\u009cIt will be a long time before labor markets could, under any metric, be considered too strong,â\u0080\u009d Alexander said in a note to clients. Still, the approach should reinforce, at the margin, â\u0080\u009clower for longerâ\u0080\u009d forward guidance on interest rates that the Fed has adopted and the market has embraced. Robert Perli, economist at Cornerstone Macro, said the change in policy is necessary but he is worried they will not be sufficient. â\u0080\u009cThe Fed is putting up a valiant effort. I think the odds that it will succeed are low,â\u0080\u009d Perli said. He said that investors already think interest rates will stay low so there is no rush to take advantage of the better credit terms. There has to be more than keeping rates low, he said. Wilcox of the Peterson Institute also said he didnâ\u0080\u0099t think low interest rates would be enough. He said that spending by Congress will have to step up and play a more active and consistent role in fighting recessions. Fed chair Powell will deliver his speech at 9 a.m. ET Thursday to the Jackson Hole central bankers conference which is being held online this year due to the coronvirus pandemic."}]}