{"article": [{"url": "https://www.marketwatch.com/story/trump-has-no-right-to-demand-money-from-microsoft-tiktok-deal-2020-08-03", "published": 1596557240.0, "headline": "Trump has no right to demand money from Microsoft-TikTok deal", "body": "President Donald Trump’s attempt to force Chinese company ByteDance to divest the U.S. version of its popular TikTok social-media app has some precedent. But the rest of the bizarre corporate drama that has recently played out in two Washingtons is not based in reality, especially the president’s demand for a cut of any deal in which Microsoft Corp. acquires TikTok. Trump said Monday he was ready to approve a deal for Microsoft MSFT, +2.48% to purchase TikTok — a change in his stance since Friday’s opposition — but only if the U.S. government receives a lot of money in exchange. On Sunday, Trump had a phone conversation with Microsoft Chief Executive Satya Nadella, in which he told the CEO that a “very substantial portion of the price [for TikTok] is going to have to come into the Treasury of the United States, because we’re making it possible for this deal to happen,” Trump said Monday. Trump, of course, likened the deal to his native business — real estate — comparing it to a landlord renting out a property to a tenant. “Right now, they don’t have any rights, unless we give it to them. It’s a little bit like the landlord/tenant [relationship] — without a lease, a tenant has nothing. So they pay what’s called key money or they pay something. But the United Sates should be reimbursed or paid something a substantial amount of money,” he said. “That’s not how it works, Mr. President,” said James Lewis, senior vice president at the Center for Strategic and International Studies in Washington. “Of course we aren’t going to get a cut on the deal. It’s just not how it works. The government doesn’t get cuts from a deal.” Yet Microsoft appears ready to acquiesce. In a blog post confirming the software giant’s involvement in the possible acquisition of TikTok in the U.S., the company wrote that it “is committed to acquiring TikTok subject to a complete security review and providing proper economic benefits to the United States, including the United States Treasury.” The fact that Trump seems to think that the U.S. government is acting as an investment banker in this possible match-up is a new level of delusion. Finder’s fees may be a core component of how real estate works, but not the federal government. “There is zero legal authority for the president to extort money from a company seeking to clear a deal under the laws creating CFIUS,” John Coates, a professor of law at Harvard University, said in an email. “Congress has never authorized an executive branch official, or any agency, to condition regulatory approval or clearance on the payment of the ‘cut’ of a deal, a ‘finder’s fee,’ or a bribe. The fact that the money might in theory go into the U.S. Treasury does not make it legal. Congress, and only Congress, can authorize taxes, through legislation.” The president’s decree that TikTok must sell or stop operating appears to be on sounder legal ground. CFIUS, or the Committee on Foreign Investment in the U.S., is a committee under the Treasury Department that analyzes cross-border transactions. Trump has used powers related to CFIUS before in blocking Broadcom Inc. AVGO, +0.90% from acquiring Qualcomm Corp. QCOM, +2.06% , and predecessors used it to block Chinese acquisitions of chip companies and other transactions, saying those deals threatened national security. In a direct precedent, CFIUS last year disapproved the 2016 sale of the popular gay-dating app Grindr to a Chinese company, Beijing Kunlun Tech Co. Ltd. 300418, +3.10%, forcing it to sell a 98.59% stake in Grindr to San Vincente Acquisition Co. for $608 million. Bytedance did not seek CFIUS approval for its acquisition in 2017 of Musical.ly, the predecessor to TikTok, and now with the app’s popularity in the U.S., the government is afraid of the security of its users’ personal data. “CFIUS can reach back and say ‘we thought about it and you have to undo it,’” Lewis said. “The authority is there and it has been used. This wasn’t invented just for TikTok.” So while CFIUS has a legal authority to get involved and force TikTok to sell, Trump doesn’t have many powers beyond that, and certainly cannot demand a piece of the action. “Realistically, unless the White House wants to start a new precedent of extorting money from private parties in a M&A transaction, I don’t see how this is affected,” Donald Polden, dean emeritus at Santa Clara University School of Law, said in an email. “If the U.S. government had an investment stake in the acquired company or some contractual rights either in the transaction or in the acquired company, then the government could get to the bargaining table and exact some terms in the transaction. But I don’t read the powers of the Committee on Foreign Investment to include imposing a fee, duty, tariff or other charge on the transaction.” The deal for Microsoft to buy the U.S. operations of TikTok looks like it could go through eventually, but Trump needs to step aside and stop making an already complicated deal more complex. If Trump continues to make silly demands, it will fall apart. MarketWatch staff writer Levi Sumagaysay contributed to this article."}]}