{"article": [{"url": "https://www.marketwatch.com/story/eddie-van-halen-legendary-rock-guitarist-dies-at-65-2020-10-06", "published": 1602004100.0, "headline": "Eddie Van Halen, legendary rock guitarist, dies at 65", "body": "Eddie Van Halen, the guitar virtuoso whose blinding speed, control and innovation propelled his band Van Halen into one of hard rock’s biggest groups, fueled the unmistakable fiery solo in Michael Jackson’s hit “Beat It” and became elevated to the status of rock god, has died. He was 65. A person close to Van Halen’s family confirmed the rocker died Tuesday due to cancer. The person was not authorized to publicly release details in advance of an official announcement. With his distinct solos, Eddie Van Halen fueled the ultimate California party band and helped knock disco off the charts starting in the late 1970s with his band’s self-titled debut album and then with the blockbuster record “1984,” which contains the classics “Jump,” “Panama” and “Hot for Teacher.” Van Halen is among the top 20 best-selling artists of all time, and the band was inducted into the Rock and Roll Hall of Fame in 2007. Rolling Stone magazine put Eddie Van Halen at No. 8 in its list of the 100 greatest guitarists. Eddie Van Halen was something of a musical contradiction. He was an autodidact who could play almost any instrument, but he couldn’t read music. He was a classically trained pianist who also created some of the most distinctive guitar riffs in rock history. He was a Dutch immigrant who was considered one of the greatest American guitarists of his generation. “You changed our world. You were the Mozart of rock guitar. Travel safe rockstar,” Motley Crue’s Nikki Sixx said on Twitter. The members of Van Halen — the two Van Halen brothers, Eddie and Alex; vocalist David Lee Roth; and bassist Michael Anthony — formed in 1974 in Pasadena, California. They were members of rival high school bands and then attended Pasadena City College together. They combined to form the band Mammoth, but then changed to Van Halen after discovering there was another band called Mammoth. Their 1978 release “Van Halen” opened with a blistering “Runnin’ With the Devil” and then Eddie Van Halen showed off his astonishing skills in the next song, “Eruption,” a furious 1:42 minute guitar solo that swoops and soars like a deranged bird. The album also contained a cover of the Kinks’ “You Really Got Me” and “Ain’t Talkin’ ’Bout Love.” Mike McCready of Pearl Jam told Rolling Stone magazine that listening to Van Halen’s “Eruption” was like hearing Mozart for the first time. “He gets sounds that aren’t necessarily guitar sounds — a lot of harmonics, textures that happen just because of how he picks.” Van Halen released albums on a yearly timetable — “Van Halen II” (1979), “Women and Children First” (1980), “Fair Warning” (1981) and “Diver Down” (1982) — until the monumental “1984,” which hit No. 2 on the Billboard 200 album charts (only behind Michael Jackson’s “Thriller”). Rolling Stone ranked “1984” No. 81 on its list of the 100 Greatest Albums of the 1980s. “Eddie put the smile back in rock guitar, at a time when it was all getting a bit brooding. He also scared the hell out of a million guitarists around the world, because he was so damn good. And original,” Joe Satriani, a fellow virtuoso, told Billboard in 2015. Van Halen also played guitar on one of the biggest singles of the 1980s: Jackson’s “Beat It.” His solo lasted all of 20 seconds and took only a half an hour to record. He did it as a favor to producer Quincy Jones, while the rest of his Van Halen bandmates were out of town. Van Halen received no compensation or credit for the work, even though he rearranged the section he played on. “It was 20 minutes of my life. I didn’t want anything for doing that,” he told Billboard in 2015. “I literally thought to myself, ‘Who is possibly going to know if I play on this kid’s record?’” Rolling Stone ranked “Beat It” No. 344 on its list of the 500 Greatest Songs of All Time. Jackson’s melding of hard rock and R&B preceded the meeting of Run-DMC and Aerosmith by four years. But strains between Roth and the band erupted after their 1984 world tour and Roth left. The group then recruited Sammy Hagar as lead singer —some critics called the new formulation “Van Hagar” — and the band went on to score its first No. 1 album with “5150,” More studio albums followed, including “OU812,” “For Unlawful Carnal Knowledge” and “Balance.” Hit singles included “Why Can’t This Be Love” and “When It’s Love.” Hagar was ousted in 1996 and former Extreme singer Gary Cherone stepped in for the album “Van Halen III,” a stumble that didn’t lead to another album and the quick departure of Cherone. Roth would eventually return in 2007 and team up with the Van Halen brothers and Wolfgang Van Halen, Eddie’s son, on bass for a tour, the album “A Different Kind of Truth” and the 2015 album “Tokyo Dome Live in Concert.” Van Halen’s music has appeared in films as varied as “Superbad,” “Minions” and “Sing” as well as TV shows like “Glee” and “It’s Always Sunny in Philadelphia.” Video games such as “Gran Turismo 4” and “Guitar Hero” have used his riffs. Their song “Jamie’s Cryin” was sampled by rapper Tone Loc in his hit “Wild Thing.” For much of his career, Eddie Van Halen wrote and experimented with sounds while drunk or high or both. He revealed that he would stay in his hotel room drinking vodka and snorting cocaine while playing into a tape recorder. (Hagar’s 2011 autobiography “Red: My Uncensored Life in Rock” portrays Eddie as a violent, booze-addled vampire, living inside a garbage-strewn house.) “I didn’t drink to party,” Van Halen told Billboard. “Alcohol and cocaine were private things to me. I would use them for work. The blow keeps you awake and the alcohol lowers your inhibitions. I’m sure there were musical things I would not have attempted were I not in that mental state.” Eddie Van Halen was born in Amsterdam and his family immigrated to California in 1962 when he was 7. His father was a big band clarinetist who rarely found work after coming to the U.S., and their mother was a maid who had dreams of her sons being classical pianists. The Van Halens shared a house with three other families. Eddie and Alex had only each other, a tight relationship that flowed through their music. “We showed up here with the equivalent of $50 and a piano,” Eddie Van Halen told The Associated Press in 2015. “We came halfway around the world without money, without a set job, no place to live and couldn’t even speak the language.” He said his earliest memories of music were banging pots and pans together, marching to John Philip Sousa marches. At one point, Eddie got a drum set, which his older brother coveted. “I never wanted to play guitar,” he confessed at a talk at the Smithsonian’s National Museum of American History in 2015. But his brother was good at the drums, so Eddie gave into his brother’s wishes: “I said, ‘Go ahead, take my drums. I’ll play your damn guitar.’” He was a relentless experimenter who would solder different parts from different guitar-makers, including Gibson and Fender. He created his own graphic design for his guitars by adding tape to the instruments and then spray-painting them. He said his influences were Eric Clapton, and Jimi Hendrix. Van Halen, sober since 2008, lost one-third of his tongue to a cancer that eventually drifted into his esophagus. In 1999, he had a hip replacement. He was married twice, to actress Valerie Bertinelli from 1981 to 2007 and then to stuntwoman-turned-publicist Janie Liszewski, whom he wed in 2009."}]}