{"article": [{"url": "https://www.marketwatch.com/story/the-first-and-only-negative-fee-etf-just-closed-heres-what-that-tells-us-about-investing-2020-06-18", "published": 1593423980.0, "headline": "The first â\u0080\u0094 and only â\u0080\u0094 negative-fee ETF didnâ\u0080\u0099t make it. Hereâ\u0080\u0099s what that tells us about investing.", "body": "In early 2019, when the first negative-fee exchange-traded fund launched, it seemed only logical: the culmination of a steady march lower for fund management fees, until the only place left to go to lure prospective investors was below zero. Logical, perhaps, but not convincing. The fund, the Salt Low TruBeta U.S. Market ETF LSLT, +0.30% Â , attracted only about $9.3 million in its first year in existence. In June, its issuer, Salt Financial, announced the fund, and a companion, the Salt High TruBeta U.S. Market ETF SLT, +1.00% Â , would be acquired by Pacer Advisors. For Tony Barchetto, one of two of Saltâ\u0080\u0099s co-founders, the pairâ\u0080\u0099s short lives have been more a learning experience about how new funds find interested new investors than about how frugal those would-be customers are. â\u0080\u009cWhen we created the fee structure we knew it was a bit radical, but that was the point,â\u0080\u009d Barchetto said in an interview. â\u0080\u009cPeople kept hearing about fees. But itâ\u0080\u0099s more about value than cost, and our experiment showed that.â\u0080\u009d Related:These are the companies that open â\u0080\u0094 and close â\u0080\u0094 the most ETFs While Barchetto continues to believe the fundsâ\u0080\u0099 approach provides plenty of value â\u0080\u0094 he and his co-founder, Alfred Eskandar, will continue to manage the indexes behind the funds in partnership with Pacer â\u0080\u0094 he thinks the biggest challenge is in getting that story, and the funds themselves, to interested investors. â\u0080\u009cWhat held us back is distribution,â\u0080\u009d he said. The asset management industry is dominated by big players that offer both financial products and the means for investors to access them. The â\u0080\u009cBig Threeâ\u0080\u009d â\u0080\u0094 Vanguard, BlackRock BLK, +1.18% Â , and State Street Global Advisors STT, +2.20% Â â\u0080\u0094 get lots of attention for holding roughly 80% market share, according to many estimates, of assets under management in the ETF ecosystem. But just as problematic, according to Barchetto and other observers, is allowing small funds access to platforms run by advisor-dominated companies like Schwab and Morgan Stanley. Saltâ\u0080\u0099s sales pitch was well-received, Barchetto said, but ultimately, if advisors or end investors couldnâ\u0080\u0099t access a way to invest in the fund, that meant nothing. See:Are ETFs safe... for retail investors? â\u0080\u009cItâ\u0080\u0099s a chicken and egg problem,â\u0080\u009d said Todd Rosenbluth, head of ETF and mutual-fund research for CFRA. Funds must meet a certain threshold of assets under management and tenure in order to be included on many platforms, but without access to the platforms, they generally canâ\u0080\u0099t raise those funds or stay around for long. â\u0080\u009cFor a new ETF from a small provider to come to market and be successful, it needs something eye-catching to break through the crowd,â\u0080\u009d Rosenbluth said. â\u0080\u009cThereâ\u0080\u0099s a reason why every year hundreds of ETFs close.â\u0080\u009d Rosenbluth made a public mea culpa on Twitter when he read of the Salt acquisition. iframe.twitter-tweet { width: 100% !important; } â\u0080\u009cI just thought investors were so cost-conscious,â\u0080\u009d he told MarketWatch. â\u0080\u009cThe data shows that so much money is going into products that are 20 basis points less, 30 basis points less, (than competitors) and survey after survey confirms that investors are choosing fees as the most important metric.â\u0080\u009d But both he and Barchetto point to an increasingly bifurcated ETF market in which the most basic products â\u0080\u0094 those that simply track a straightforward index like the S&P 500 SPX, +0.87% Â , for example â\u0080\u0094 are chosen based on fees, while other more exotic products, seen to add â\u0080\u009cvalue,â\u0080\u009d as Barchetto put it, can charge slightly more. One example, Barchetto noted, might be the â\u0080\u009cInnovatorâ\u0080\u009d lineup of annuity-linked products profiled by MarketWatch in 2019. As to the question of distribution, Rosenbluth thinks the path taken by Saltâ\u0080\u0099s managers, to allow not-quite-at-critical-mass funds to be acquired by a larger company with a better grasp on distribution, may be the future for smaller, independent issuers. (Itâ\u0080\u0099s ETF industry thinking that a fund must gather about $50 million in assets to be profitable.) For his part, Barchetto believes smaller players with innovative ideas may stick to creating the intellectual property behind fund indexes, and leave the administrative headaches to the bigger institutional players. â\u0080\u009cETFs are cheap to get into but not cheap to execute on,â\u0080\u009d he said. â\u0080\u009cFor the true independent, unless you have something real flashy thatâ\u0080\u0099s going to make the news, doing it yourself is hard.â\u0080\u009d See:Time, money, and effort, and then your great ETF idea gets ripped off"}]}