{"article": [{"url": "https://www.marketwatch.com/story/breaking-down-this-miracle-covid-19-survivors-11-million-hospital-bill-2020-06-16", "published": 1592641340.0, "headline": "Breaking down this â\u0080\u0098miracleâ\u0080\u0099 COVID-19 survivorâ\u0080\u0099s $1.1 million hospital bill", "body": "This life-saving coronavirus treatment could easily drain someoneâ\u0080\u0099s life savings. And then some. A Seattle COVID-19 survivor knew that he must have run up a pretty huge medical tab after spending March and April in the hospital, including more than a month in the intensive care unit. But Michael Flor, 70, told the Seattle Times that the 181-page, $1.1 million hospital bill nearly gave him a heart attack. â\u0080\u009cI opened it and said â\u0080\u0098Holy [bleep]!â\u0080\u0099â\u0080\u009d he said. Flor was dubbed â\u0080\u009cthe miracle childâ\u0080\u009d by nurses at Swedish Medical Center in Issaquah, Wash., for his incredible turnaround after spending four weeks on a ventilator. He was so close to death at one point that a night-shift nurse held a phone to his ear so that his wife and children could say their final goodbyes from quarantine. He was â\u0080\u009cas sick as you can get, with basically every organ system shutting down,â\u0080\u009d according to one of his doctors. “ â\u0080\u009cI opened it and said â\u0080\u0098Holy [bleep]!â\u0080\u0099â\u0080\u009d ” The good news is that Flor recovered and is back at home. And heâ\u0080\u0099s probably off the hook for that $1.1 million, because his insurance is footing the bill for most of his medical costs. And his remaining $6,000 out-of-pocket expenses will probably be picked up by the more than $100 billion that Congress has earmarked to help hospitals and insurance companies cover the costs of the COVID-19 pandemic. But Florâ\u0080\u0099s hospital bill still offers a fascinating look at the cost of treating a life-threatening illness such as COVID-19. Hereâ\u0080\u0099s how the $1,122,501.04 bill breaks down: The 181-page book â\u0080\u0094 sorry, bill â\u0080\u0094 includes almost 3,000 itemized charges, averaging about 50 a day. The greatest expense by far was his 42-day stay in the ICU, totaling $408,912. His room had to be sealed, and was accessed only by medical staff wearing plastic suits and headgear, which cost $9,736 a day. Flor also was hooked to a mechanical ventilator for 29 days, which at $2,835 a day ran up to $82,215. There were two days when his heart, kidneys and lungs were all failing. And the bill for that touch-and-go period spans 20 pages and runs almost $100,000 in costs as doctors â\u0080\u009cwere throwing everything at me they could think of,â\u0080\u009d Flor said. Almost a quarter of the bill includes various drug costs, and this accounting doesnâ\u0080\u0099t even factor in Florâ\u0080\u0099s two weeks of recovery in a rehabilitation facility. Flor said that the bill has given him survivorâ\u0080\u0099s guilt. â\u0080\u009cThereâ\u0080\u0099s a sense of â\u0080\u0098why me?â\u0080\u0099 Why did I deserve all this?â\u0080\u009d he told the Seattle Times. â\u0080\u009cLooking at the incredible cost of it all definitely adds to that survivorâ\u0080\u0099s guilt.â\u0080\u009d “ The median cost of a coronavirus hospitalization is $14,366. ” But he should know that heâ\u0080\u0099s not the only COVID-19 survivor to be shocked with a surprise medical bill following a bout with the deadly disease thatâ\u0080\u0099s killed 116,250 Americans and counting. Lawyer turned writer David Lat recently wrote about his own $320,000 COVID-19 bill in Slate. He spent 16 nights in the hospital in March, including a week in the ICU and six days on a ventilator. And while he was bracing to pay $6,000 or $7,000 in out-of-pocket costs, he also didnâ\u0080\u0099t end up on the hook for any of it because his hospital, NYU Langone, was in-network for his insurance company, UnitedHealthcare UNH, +1.68%. And UHC is among the insurance companies that have waived patient cost-sharing for COVID-19 treatment. But this doesnâ\u0080\u0099t mean that everyone can expect â\u0080\u009cfreeâ\u0080\u009d coronavirus treatment. While the nationâ\u0080\u0099s largest insurers, including Aetna CVS, -1.76%, Anthem ANTM, +0.38%, Blue Cross Blue Shield, Cigna CI, -0.82%, Humana HUM, +1.43% Â and United Healthcare, did announce that they are not making patients pay deductibles, copays, coinsurance and other charges if they are hospitalized with COVID-19, the people who get health insurance through their jobs may still end up having to pay for treatment. And thatâ\u0080\u0099s because employers with â\u0080\u009cself-fundedâ\u0080\u009d or â\u0080\u009cself-insuredâ\u0080\u009d health plans are allowed to opt out of waiving cost-sharing for their employees. Whatâ\u0080\u0099s more, insurers are only waiving this cost-sharing for a limited time. Read more: Most major health insurers arenâ\u0080\u0099t charging patients for coronavirus treatment â\u0080\u0094 but that doesnâ\u0080\u0099t mean itâ\u0080\u0099s free The City University of New York (CUNY) Graduate School of Public Health and Health Policy recently ran a computer simulation to gauge what the nationâ\u0080\u0099s COVID-19-related health care costs could be. They determined that the median cost of a coronavirus hospitalization is $14,366. And that doesnâ\u0080\u0099t include the long-term health care costs for patients with severe illness who suffer significant lung damage, for example. Other estimates have pushed COVID-19 hospitalization costs closer to $20,000. Opinion:Treating a typical coronavirus infection is four times the cost of a case of the flu Even COVID-19 testing, which is supposed to be free, has resulted in some eye-watering bills. Earlier in the pandemic, a Miami man reportedly racked up $3,270 in hospital charges when he went in for a COVID-19 test after a work trip to China. And a Pennsylvania man had to set up a GoFundMe page to help pay for $3,918 in surprise bills after he was evacuated from China and quarantined with his 3-year-old daughter. Indeed, Florâ\u0080\u0099s bill and these other COVID-19 hospital costs are a stark reminder that: one in six Americans get hit with a â\u0080\u009csurpriseâ\u0080\u009d medical bill after a trip to the emergency room; one in five Americans get hit with a surprise medical bill after elective surgery; and one in five patients hospitalized with a severe case of pneumonia get stuck with a surprise medical bill from an out-of-network provider. Whatâ\u0080\u0099s more, the American Cancer Society estimates that 137 million Americans are burdened by medical debt â\u0080\u0094 and cancer treatment is a huge part of that, of course, with one in four cancer survivors struggling to pay medical bills. Read more:How to handle surprise medical bills Flor added that while he feels that a million bucks to save his life is â\u0080\u009cmoney well-spent,â\u0080\u009d he also appreciates that â\u0080\u009cI might be the only one saying that.â\u0080\u009d"}]}