{"article": [{"url": "https://www.marketwatch.com/story/apple-faces-new-complaints-from-app-makers-as-eu-launches-antitrust-probes-2020-06-16", "published": 1592349860.0, "headline": "Apple faces new complaints from app makers as EU launches antitrust probes", "body": "Apple Inc. is facing fresh complaints about the 30% cut it takes from App Store purchases, as European regulators launch two antitrust investigations into the tech giant. Late Tuesday, Match Group Inc. MTCH, -0.94% , parent company of Tinder, OK Cupid and other popular dating services, criticized Apple AAPL, +1.74% for squeezing app makers’ revenue. “Apple is a partner, but also a dominant platform whose actions force the vast majority of consumers to pay more for third-party apps that Apple arbitrarily defines as ‘digital services,’” Match Group said in an emailed statement to MarketWatch. “Apple squeezes industries like e-books, music and video streaming, cloud storage, gaming and online dating for 30% of their revenue, which is all the more alarming when Apple then enters that space, as we’ve repeatedly seen. We’re acutely aware of their power over us. Match Group continued: “The overwhelming majority of apps, including Internet behemoths that connect people (rideshare/gig apps), or monetize by selling advertising (social networks), have never been subject to Apple’s payments systems and fees, and this is not right. We welcome the opportunity to discuss this with Apple and create an equitable distribution of fees across the entire App Store, as well as with interested parties in the EU and in the U.S.” Separately, The Verge reported Tuesday that the makers of a new email app called Hey, which launched Monday, received an unpleasant surprise when Apple reportedly threatened to remove the app from its App Store if it did not allow in-app subscriptions, which Apple would get a 30% cut from. In a series of tweets Tuesday, David Heinemeier Hansson, the founder of Basecamp, which made Hey, likened Apple to “gangsters” trying to shake him down. “This is profoundly, perversely abusive and unfair,” he said. iframe.twitter-tweet { width: 100% !important; } The makers of Hey maintain that since users can only sign up and pay for the service outside of Apple’s iOS app, it shouldn’t have to pay Apple a cut of its revenue. In an email to The Verge, Apple suggested it not doing anything out of the ordinary with Hey. Apple reportedly told Protocol that Hey should not have been approved in the first place, since Apple doesn’t allow client apps — that is, where users can sign in but not sign up — for consumer services. For consumer apps, Apple reportedly told Protocol that it requires they offer feature in-app sign-ups and payments, so Apple can take a cut. While not commenting on specific cases, Apple told MarketWatch in an email Tuesday night that it requires developers to follow strict guidelines, and that its App Store guidelines clearly lay out its policy on in-app purchases. Apple said it is committed to offering a fair and level platform for developers. The complaints from the app makers come at a bad time for Apple, which earlier in the day found itself in the crosshairs of EU antitrust regulators, who announced they are investigating its Apple Pay service as well as its App Store. Complaints of unfair App Store restrictions from Spotify Technology SA SPOT, +0.08% , among others, led to the EU probe. If found guilty, Apple could face a fine of 10% of its annual revenue. In 2019, Apple’s annual revenue was about $260 billion, meaning a fine in the range of a whopping $26 billion. Apple is also facing antitrust scrutiny in the U.S. from the Justice Department and Federal Trade Commission."}]}