{"article": [{"url": "https://www.marketwatch.com/story/in-reversal-uk-to-require-face-masks-in-stores-2020-07-13", "published": 1594678880.0, "headline": "In reversal, U.K. to require face masks in stores", "body": "LONDON — The British government decided Monday to require people to wear face coverings in shops, joining a long list of countries that have made masks mandatory under some circumstances in response to the coronavirus pandemic. After weeks of prevarication and days of confused messaging, Prime Minister Boris Johnson’s government said that masks will be required in stores starting July 24. Johnson’s office said “growing evidence that wearing a face covering in an enclosed space helps protect individuals and those around them from coronavirus.” Those who flout the law can be fined up to 100 pounds ($125) by the police under public health laws. Many European nations, including Germany, Spain, Italy and Greece, already require masks to be worn in enclosed spaces, but Britain had only made masks obligatory on public transit. Johnson’s government until now recommended — but did not require — mask-wearing in stores. The prime minister, who in the spring spent a week in the hospital being treated for COVID-19, was not seen in public in a mask until Friday, when he suggested that the government was considering “stricter” rules for mask use. Cabinet Office Minister Michael Gove suggested Sunday that no government order was required, saying he trusted people to use “common sense.” The opposition Labour Party questioned Monday why the new mask measure would not come into force for 11 days. Labour health spokesman Jonathan Ashworth said the government “has been slow and muddled again over face coverings.” The new requirement only applies to in England. Scotland already made masks mandatory in stores. Scientific opinion has been divided on the value of face coverings, but a growing body of evidence suggests it brings some benefit in preventing the spread of the virus."}]}