{"article": [{"url": "https://www.marketwatch.com/story/facebook-gaming-is-clear-winner-in-teaming-with-microsoft-2020-06-22", "published": 1592845160.0, "headline": "Facebook Gaming is clear winner in teaming with Microsoft", "body": "It's game on for Facebook Gaming. The social-networking giant is the clear winner after Microsoft Corp.’s MSFT, +2.48% Xbox unit on Monday shuttered its Mixer videogame streaming service following an unsuccessful and pricey bid to grab a large, worldwide user base. Xbox will recommend players and audiences shift to Facebook’s FB, +0.26% streaming site instead. Additionally, the software maker plans to partner with Facebook on Microsoft’s xCloud mobile game service, which will be widely available July 22. Visitors to Mixer will be redirected to Facebook Gaming. The stunning move sent Microsoft shares up 2.8% to close at a 52-week high, while Facebook’s stock inched up to a 52-week high. For close followers of Microsoft’s recent gaming strategy, however, the decision may have not been all that surprising. Microsoft plunged into the $152 billion videogame industry in 2016 with the acquisition of Beam, two years after Amazon.com Inc. AMZN, +3.01% plunked down nearly $1 billion for Twitch to reach an increasingly growing audience of teens and young adults who watch others play games rather than play themselves. Facebook Gaming debuted in 2018. In its aggressive pursuit of market share, Microsoft spent lavishly on top gaming talent like Tyler “Ninja” Blevins and Michael “Shroud” Grzesiek, neither of whom are under obligation to join Facebook Gaming, though Facebook is talking to Blevins and others. “I love my community and what we built together on Mixer. I have some decisions to make and will be thinking about you all as I make them,” Ninja wrote on Twitter on Monday. Despite spending millions of dollars on Mixer, Microsoft lagged in fourth place among platforms tracked by market-research firms StreamElement and Arsenal.gg. Even as more gamers were confined to their homes during the COVID-19 pandemic, Mixer’s 15% growth in hours watched from March to April lagged behind market leader Twitch and Facebook, and fell well short of the 45% growth for the overall streaming sector, according to StreamElement. “While we were proud of the community that we had built on Mixer, we weren’t achieving the scale goals that we had on our own,” Phil Spencer, executive vice president of gaming at Microsoft, told Bloomberg News in an interview. He said the team decided earlier this year to exit the business and look for a partner, leading to months-long talks with Facebook. According to Spencer, Microsoft plans to work with Facebook on xCloud, a service for streaming videogames to mobile devices that Microsoft is testing. Eventually, gamers will be allowed to click within a stream on Facebook to play or purchase a videogame in xCloud, he said."}]}