{"article": [{"url": "https://www.marketwatch.com/story/could-flu-vaccines-lower-your-risk-of-alzheimers-research-sheds-new-light-2020-08-10", "published": 1597035980.0, "headline": "Could flu vaccines lower your risk of Alzheimerâ\u0080\u0099s? Research sheds new light", "body": "This article is reprinted by permission from NextAvenue.org. With vaccines top of mind in the U.S. and across the globe during the coronavirus pandemic, two studies presented recently at theÂ Alzheimerâ\u0080\u0099s Association International ConferenceÂ (AAIC) 2020, shed new light on how vaccines for flu and pneumonia may lower risk for Alzheimerâ\u0080\u0099s disease. Both studies wereÂ previewed at AAICÂ prior to peer-reviewed journal publication. The first study, conducted at the McGovern Medical School at the University of Texas Health Science Center in Houston, was done because previous research had shown a possible connection between vaccines and reducing or delayingÂ cognitive decline. Until now, no comprehensive analysis had been done on this theory. Researchers analyzed a dataset of 9,066 American health records and found annual flu vaccinations correlated to a 17% lower prevalence of Alzheimerâ\u0080\u0099s with an additional 13% reduction for patients who continued to receive the vaccination over a period of years. The research also indicated those who received their first flu vaccine before age 60 had a stronger protective association than those who got it after 70. The second study, conducted by the Duke University Social Science Research Institute, looked at the pneumococcal vaccine, typically given after age 65 to fight infections such as pneumonia, meningitis and sepsis. Researchers looked at 5,146 participants over 65 from the Cardiovascular Health Study and found if the vaccination is given between age 65 and 75, there is a reduced risk of developing Alzheimerâ\u0080\u0099s by 25% to 30% after adjusting for sex, race, birth cohort, education and smoking and the connection to genetic risk factors. â\u0080\u009cThe results of these studies show vaccines are strongly associated with lower prevalence of dementia,â\u0080\u009d said Maria Carrillo, Alzheimerâ\u0080\u0099s Association chief science officer, in an email interview. â\u0080\u009cWe also know that infections like the flu and pneumonia can have deleterious effects on overall health and even cognition. More research is needed to determine conclusively if getting vaccinated for flu or pneumonia on its own can reduce risk of Alzheimerâ\u0080\u0099s.â\u0080\u009d Watch out, FIRE fans:New reports say retiring early can give you Alzheimerâ\u0080\u0099s According toÂ Centers for Disease Control and PreventionÂ (CDC) estimates, the last two flu seasons have seen 39 to 56 million Americans infected each year with the virus. People over 75 have the highest mortality risk from flu each year. Thatâ\u0080\u0099s the same demographic group most vulnerable to COVID-19.Â Yet, according to the CDC, during the last flu season less than half of U.S. adults â\u0080\u0094 only about 45% â\u0080\u0094 got the flu shot. AmongÂ populations with higher risk for Alzheimerâ\u0080\u0099s, such as African-Americans and Hispanics, both groups were less likely than whites to get an annual flu shot. The U.S. Office of Minority Health reports reluctance for flu vaccinations among African-Americans, who typically cite concerns over safety and fear of negative side effects, while many older Latinos have less access to vaccinations, often based on language barriers. Vaccinations for pneumonia are a different story.Â Healthy People 2020, part of the U.S. Department of Health and Human Services Office of Disease Prevention and Health Promotion, reports from 2015 to 2016, pneumococcal vaccination increased roughly 3% to about 67% among adults 65 and older. Carrillo noted that racial differences were not accounted for in this particular study on flu vaccination and Alzheimerâ\u0080\u0099s prevalence, so no conclusions can be drawn on the relationship between race, vaccination and Alzheimerâ\u0080\u0099s risk. But she did emphasize that African-Americans are twice as likely â\u0080\u0094 and Hispanics are 1.5 times as likely â\u0080\u0094 to develop dementia than their white counterparts.Family caregivers also benefit from vaccines While flu shots may offer prevention for both flu and Alzheimerâ\u0080\u0099s risk among older Americans, the other population group needing to receive an annual flu shot are the almost 42 million family caregivers for older loved ones. Some 16 million of them are caring for people with Alzheimerâ\u0080\u0099s or dementia. Also see: The latest victim of COVID-19: Alzheimerâ\u0080\u0099s research Since the onset of the coronavirus, concerns about virus transmission to vulnerable older adults has created a newfound adherence to public health safety. Health care professionals hope this practice translates as well to caregivers getting an annual flu shot.Â â\u0080\u009cMedical staff all get a series of vaccinations for infectious disease including rubella, tuberculosis, hepatitis and flu,â\u0080\u009d said Dr. Lon Schneider, director of the USC California Alzheimerâ\u0080\u0099s Disease Research Center in Los Angeles. â\u0080\u009cEvidence shows vaccines are important for maintaining health and preventing illness, which is vitally important for family caregivers. These studies show that adherence to prevention pays off both in less incidence of flu and possibly a decreased risk of developing Alzheimerâ\u0080\u0099s.â\u0080\u009dÂ SchneiderÂ added: â\u0080\u009cNumerous research studies are indicating up to 40% of dementia cases could be potentially mitigated or reduced if people focused on overall health such as treating hypertension, addressing hearing loss, reducing exposure to air pollution toxins, preventing obesity and diabetes. Itâ\u0080\u0099s not just vaccines, but all these factors combined that provide a whole package of better health and the ability to possibly prevent or delay diseases like Alzheimerâ\u0080\u0099s.â\u0080\u009dMaking the case for vaccines In a separate study published in the Annals of Internal Medicine,Â Daniel Shepshelovich, deputy chief of medicine at Israelâ\u0080\u0099s Tel Aviv Medical Center and co-author of the research, found â\u0080\u009cvaccines are remarkably safe.â\u0080\u009dÂ Shepshelovich and his co-authors analyzed data over nearly two decades (1996-2015) covering 57 vaccines approved by the U.S. Food and Drug Administration to determine the safety of the vaccines post-approval and any safety label warnings or changes over time. Compared to pharmaceuticals and medical devices, the authors noted vaccines are â\u0080\u009cremarkably safeâ\u0080\u009d and rightly considered as one of the greatest achievements of biomedical science and public health. But the paper also noted that in recent years, vaccination rates have fallen, partly driven by reduced public trust and parental concerns over safety. See: This Seattle man volunteered to be injected with an experimental COVID-19 vaccine Healthy People 2020 has stated its goal is to have 70% of the population over 6 months old vaccinated every year for flu. Vaccinations overall, starting with routine immunizations in childhood, save 33,000 lives every year and prevent 14 million cases of disease. This also reduces direct health care costs by $9.9 billion and saves $33.4 billion in indirect costs. Experts stress the importance of the flu vaccine in the middle of the coronavirus pandemic. Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases and a member of the White House coronavirus task force, in a recent interview withÂ MarketWatchÂ said, â\u0080\u009cWeâ\u0080\u0099re telling people that, when the flu vaccine becomes available, make sure you get vaccinated so that you could at least blunt the effect of one of those two potential respiratory infections.â\u0080\u009dÂ Sherri Snelling is a gerontologist, consultant and national speaker specializing in caregiver wellness. She is CEO and founder ofÂ Caregiving ClubÂ and author ofÂ â\u0080\u009cA Cast of Caregivers â\u0080\u0093 Celebrity Stories to Help You Prepare to Care.â\u0080\u009d @sherrisnelling This article is reprinted by permission from NextAvenue.org, Â© 2020 Twin Cities Public Television, Inc. All rights reserved."}]}