{"article": [{"url": "https://www.marketwatch.com/story/no-americans-please-eu-shuts-out-the-us-as-it-reopens-to-more-than-a-dozen-other-countries-2020-06-30", "published": 1593866000.0, "headline": "No Americans, please - EU shuts out travelers from U.S. as it reopens to more than a dozen countries", "body": "Surprising almost no one, the European Union on Tuesday left the United States off its list of countries whose residents will be able to travel into the 14-bloc nation without travel restrictions. Citizens of Australia, Canada, Japan, New Zealand, South Korea, Thailand, Uruguay and China, \"subject to confirmation of reciprocity,\" will all be able to travel to the EU as of July 1. Also on the list are Algeria, Morocco, Georgia, Montenegro, Rwanda, Serbia and Tunisia. \"The criteria to determine the third countries for which the current travel restriction should be lifted cover in particular the epidemiological situation and containment measures, including physical distancing, as well as economic and social considerations,\" said the EU Council, in a news release. \"They are applied cumulatively.\" Coronavirus daily update:Pandemic is 'not even close to being over,' says WHO director-general, urging better testing - and face masks Those countries are expected to meet criteria that include their numbers of new COVID-19 cases over the last 14 days and per 100,000 inhabitants being close to or below the EU average. While the virus's spread has stabilized in Europe over the past few months, cases have been rising in the last 14 days in 35 U.S. states. Statista The EU is also looking at individual countries' responses to the virus, including testing, surveillance, contact tracing, containment, treatment and reporting. Most countries haven't had much luck so far with contact tracing, outside of China. In the case of the U.S., a ban remains on European travelers from early March, when the breakout was severe in places such as Spain and Italy. EU citizens and long-term EU residents and family members, or any travelers with an essential function traveling from the banned list to Europe will be exempt under the new rules. The EU has been expecting to announce the ban for days, with Russia, and Brazil among the countries also not allowed in. The EU plans to update the list every two weeks, reserving the right to reintroduce any bans where needed."}]}