{"article": [{"url": "https://www.marketwatch.com/story/mcdonalds-and-taco-bell-among-the-restaurant-chains-hit-by-covid-19-related-breakfast-weakness-2020-06-17", "published": 1592657600.0, "headline": "McDonaldâ\u0080\u0099s and Taco Bell among the restaurant chains hit by COVID-19-related breakfast weakness", "body": "With fewer people heading to work, mornings are quiet at fast-food chains, which is slowing the coronavirus recovery at big names like McDonaldâ\u0080\u0099s Corp. and Taco Bell. McDonaldâ\u0080\u0099s MCD, -0.43% Â said Tuesday that it is seeing same-store sales improvement, with nearly all U.S. locations operating at least with drive-thru, delivery and takeaway service and about 1,000 locations offering a dine-in option. However, the company said breakfast was a weak spot. â\u0080\u009cMcDonaldâ\u0080\u0099s has the disadvantage of a high breakfast mix (~25-30% of sales pre-COVID vs. 13-14% at Burger King and ~20% at Jack in the Box), which is currently the weakest daypart in the industry (aside from late night), due to fewer commuters,â\u0080\u009d wrote SunTrust Robinson Humphrey analysts. See:Retail sales gains in May may fade once government stimulus money runs out, experts say Another chain that says it has been hurt by breakfast weakness is Taco Bell, which is part of the Yum Brands Inc. YUM, +0.08% Â portfolio. Yum said in a business update last week that both the breakfast and late-night business has been hurt by COVID-19. McDonaldâ\u0080\u0099s knew that breakfast would be the segment of the day hit hardest by the coronavirus, so there was a pullback in marketing, Chief Executive Chris Kempczinski said at the Evercore ISI Virtual Consumer & Retail Summit on Tuesday. Now the company is committing $200 million to global advertising to aid with the recovery. â\u0080\u009c[A]s opposed to it being a broad scale national push that we do on breakfast, I think itâ\u0080\u0099s probably going to first start regionally based on just people returning to patterns,â\u0080\u009d he said, according to a FactSet transcript. â\u0080\u009cBut weâ\u0080\u0099ve got a great breakfast business and we know a lot of people are interested in going after the breakfast business. And as we sad previously, we intend to defend it.â\u0080\u009d One of the companies getting in on breakfast is Wendyâ\u0080\u0099s Co. WEN, +2.20% Â , which launched a breakfast menu in March. SunTrust said that business is â\u0080\u009centirely incremental,â\u0080\u009d making up about 8% of sales. SunTrust rates McDonaldâ\u0080\u0099s stock buy with a $208 price target, up from $195. Also:Soaring demand for Campbell Soup products drove blowout earnings but also created inventory shortages Data provided by retail intelligence company Placer.ai in May took note of the sharp decline in breakfast traffic between the hours of 8 a.m. and 11 a.m. at some chains due to the coronavirus pandemic. However, Wendyâ\u0080\u0099s did see a year-over-year increase in breakfast-time traffic, Placer.ai said, which could be a good sign. â\u0080\u009cItâ\u0080\u0099s clear that Wendyâ\u0080\u0099s new breakfast menu is driving traffic and intrigue, even during a time of uncertainty,â\u0080\u009d Placer.ai said in a blog post. â\u0080\u009cThis is a very strong sign for their revitalized breakfast menu and could position the brand for a post-COVID surge.â\u0080\u009d Even though McDonaldâ\u0080\u0099s is feeling the squeeze now, analysts are confident that as states continue to open up, the company will bounce back. â\u0080\u009cWhile lagging several QSR [quick-service restaurant] peers on U.S. comp recovery trends (breakfast exposure), McDonaldâ\u0080\u0099s remains well-positioned given an operations/throughput focus, upcoming marketing investments, favorable breakfast dynamics, and eventual innovation,â\u0080\u009d wrote UBS analysts in a note. â\u0080\u009cDefensive characteristics, pre-COVID momentum, scale and tech investment should support resiliency and long-term gains.â\u0080\u009d UBS rates McDonaldâ\u0080\u0099s stock neutral with a $205 price target. And what McDonaldâ\u0080\u0099s might lack in breakfast demand at the moment, it makes up for in drive-thru business, although this Georgia police officer might disagree. Donâ\u0080\u0099t miss:Red Robin Gourmet Burgers cut 55 menu items due to coronavirus and doesnâ\u0080\u0099t plan to bring them back â\u0080\u009cLunch and dinner comps are roughly flat while breakfast remains the weakest daypart, accounting for half of the comp decline,â\u0080\u009d wrote analysts led by Peter Saleh. â\u0080\u009cThe concept has benefited from larger group orders and faster throughput as drive-thru service times have improved by 25 seconds from pre-pandemic levels.â\u0080\u009d McDonaldâ\u0080\u0099s stock has slipped 3.5% for the year to date while the Dow Jones Industrial Average DJIA, +0.56% Â is down 8.5% for the period."}]}