{"article": [{"url": "https://www.marketwatch.com/story/im-52-wont-live-past-80-and-have-16-million-i-am-tired-of-both-the-rat-race-and-workplace-politics-should-i-retire-2020-07-31", "published": 1601894540.0, "headline": "I'm 52, won't live past 80 and have $1.6 million. 'I am tired of both the rat race and workplace politics.' Should I retire?", "body": "Hi, I started working when I was 19 and have been saving half of my salary since my mid-20s. Now at 52, I am tired of both the rat race and workplace politics. With the virus, it feels even worse. I have saved about $800,000 in trading, $800,000 in my 401(k) and $300,000 in a house. I also have six months worth of emergency funds. I don't have any debt and I own my vehicles, too. I can easily live on a $60,000 budget (including taxes) but often it is less than that. No one in my family has ever survived beyond 80 years old. Thinking of the remaining days, I wonder should I just retire, do some one-off gig work or learn a language that I always wanted to learn? I just wonder if it is prudent to do so. Or should I keep on slogging another 10 years? What do you think? Wondering in Alamo. See: I'm 63, a widow and lost my job because of COVID. I don't have much in savings and feel lost. What can I do? Dear Wondering in Alamo, You bring up a question I think a lot of people have been asking themselves lately. The coronavirus crisis has certainly shaken up the way people live, and some of us have been wondering if this is the time to make a big change. But before you do, it's important that you think about all of the potential consequences on your finances and lifestyle. Because there are a few personal details missing from your question, it was hard for financial advisers and me to tailor this answer specifically to you. We'd have to know if you're married, have any dependents, what your salary is roughly, where about in the country you live (I looked it up and there are a few cities named Alamo in the U.S.!) and if you'd have access to health care if you were to leave the workforce. We also weren't sure what exactly you had included in your $60,000 budget, except for your taxes. Still, the following may help you - and others who are wondering if now is the time to \"get out of the rat race.\" Health insurance is probably one of the most crucial - if not the most crucial - consideration you'll need to make before you leave your job. You're 52, which means you have 13 years until you qualify for Medicare. Private health insurance can be quite expensive, so if you don't have a spouse whose insurance can cover you, the premiums alone could take quite a large chunk of your annual budget. \"He is going to have exorbitant rates until Medicare kicks in,\" said Michelle Gessner, founder of Gessner Wealth Strategies. The pandemic may also affect how high those rates go in the foreseeable future, especially as hospitals and other medical institutions try to recover from the crisis, said George Gagliardi, a financial adviser at Coromandel Wealth Management. Even if rates don't jump because of COVID-19, health care expenses tend to rise, year after year. A single man retiring at 65 years old in 2019 would need $135,000 to spend on health care alone for the rest of his life, according to Fidelity Investment's 2019 annual Retiree Health Care Cost estimate. That calculation is based on Medicare coverage and does not include long-term care insurance. Between 2002 and 2018, the estimate for health care costs jumped 75%, according to Fidelity's analysis. If you would end up needing private coverage because you left the workforce, do your research so that you get the most for your money. Look at the health insurance marketplace, set a budget for yourself, and use comparison sites - being careful to review what is and is not included in the plan so that you are not without services and prescriptions you will need. I know you said people in your family tend not to live past 80 years old, but you may still want to consider long-term care insurance, Gessner said. It's not unheard of for nursing homes to cost somewhere around $90,000 a year (or more), and if toward the end of your life you should need some sort of facility like that, you could wind up dwindling your nest egg down to nothing. \"He is thinking, 'Oh I'll die by 80,' but that is not a given,\" Gagliardi said. Your estimated budget of $60,000 most likely would not be enough to clear your everyday expenses and medical expenses. Now on to your savings. Aside from your trading and 401(k) investments, you have an emergency fund - something not everyone has or even thinks about, financial advisers said. Having that account will certainly help, both financially and emotionally, in the future. Also, having a $1.6 million nest egg, outside of your emergency fund, is of course a wonderful feat. But this is the not-so-great news: you may be surprised at how quickly that could be spent, especially if you find out you need more than $60,000 a year to live. \"He has enough money as long as he lives a frugal life and nothing goes wrong and dies in his 80s,\" said Jen Grant, a financial adviser at Perryman Financial Advisory. \"That is a lot of assumptions to count on. Medicine has improved and he will very probably outlive his ancestors.\" When you start withdrawing money from your portfolio also matters. With the \"sequence of return\" risk, an investor who starts taking money from a portfolio during a downward cycle could diminish potential returns of the future (as there is less principal to grow on). \"The other problem is we have had an amazing run-up of stocks the last 10 years,\" Gagliardi said. \"If you look at 10-year projections, we are not going to see the same.\" The market is pretty volatile these days, which of course does not mean people can't retire in the middle of these ups-and-downs - it just means you should think carefully before you start withdrawing money from these accounts, especially if you don't have to yet. On top of that, you'll want to strategize which accounts you withdraw from and when, depending on the types of investment accounts you have (traditional or Roth), your age and your income each year. Typically, 401(k) account holders pay a 10% penalty if they take a distribution prior to 59½ years old, but there is the so-called rule of 55, where employees who have been separated from their jobs during or after their 55th birthday can withdraw money penalty-free. Also see: I'm a 32-year-old stay-at-home mom, and my husband earns $150,000 a year. Will I ever be able to enjoy a retirement? Beyond the numbers, think about what you want to do with your time. Retiring at 52 is quite young, and even if you do live to your personal life expectancy and not more, that's 30 years of retirement. What will you do with that time? \"My recommendation would be to spend some time self-reflecting on hobbies and things he feels passionately about,\" Grant said. This may be a sport, a new skill - you did mention wanting to learn a new language - or perhaps volunteer work. Or, it could just be a good time to take a breather and make a career switch. \"It might be the perfect time to pivot,\" Grant said. \"He has done a great job saving. Let that money grow another 10 years before he taps into it. He could get a different job, he could get a part-time job, he could get a lower paying (less mentally stressful) job that has health insurance.\" Having another job, if even one that pays a fraction of what you currently earn, or building a gig business for yourself, would bring more money in through the years, offsetting potential pitfalls or gaps in your savings needs. Remember that if you decide to retire, you're essentially putting yourself on a fixed budget. Of course there are opportunities to find part-time or gig work in your retirement - something plenty of Americans do - but that income may not be as steady as the work you have now. \"It becomes a whole different mentality,\" Gessner said. \"It's very scary for people to put yourself on a budget if you're not already. Think about how you want to live on that budget. Because that makes all the difference in the world.\" Have a question about your own retirement savings? Email us at HelpMeRetire@marketwatch.com"}]}