{"article": [{"url": "https://www.marketwatch.com/story/will-bidens-401k-plan-help-you-or-hurt-you-2020-09-09", "published": 1600172900.0, "headline": "Will Biden's 401(k) plan help you or hurt you?", "body": "If you're a single person with a taxable income below around $40,000 a year or a married couple below around $80,000, Joe Biden and Kamala Harris have a proposal that could help fatten your retirement savings. That's according to independent expert calculations. And if you earn substantially more than those levels, the plan is supposed to raise your taxes-but there is a relatively simple way to get around it. Confused? You don't know the half of it. The proposals themselves leave many details open and they have inspired a flurry of articles that haven't always revealed more than they obscure. But the kernel of the plan is relatively straightforward. Right now you can deduct your contributions to your 401(k) plan right off the top of your income. So far as the IRS is concerned, the money is invisible for this year's calculations. Make $200,000 and contribute the maximum $19,500 to your 401(k), and as far as Uncle Sam (and your state) are concerned, you didn't make $200,000 this year, you only made $181,500. The more tax you pay, the more this saves you. If you have to pay the top, 37% federal tax rate on every extra dollar you earn, deducting that money from your tax return saves you $7,215 in income taxes. But if you're only paying 10% federal tax on each extra dollar you earn, deducting $19,500 would save you just $1,950. The Biden-Harris proposal would change that. If elected, and if they got this through Congress, in future they would replace these deductions with a flat deduction available to everybody. \"The current tax benefits for retirement savings are based on the concept of deferral, whereby savers get to exclude their retirement contributions from tax, see their savings grow tax-free, and then pay taxes when they withdraw money from their account,\" the campaign states. \"This system provides upper-income families with a much stronger tax break for saving and a limited benefit for middle-class and other workers with lower earnings. The Biden Plan will equalize benefits across the income scale, so that low- and middle-income workers will also get a tax break when they put money away for retirement.\" The proposals are similar to those put forward some years ago by the Urban Institute, a Washington think-tank. Analysts' best guess is that everyone would save the same percentage each year on their taxes: 20.5%, equal almost exactly to $4,000 for someone making the maximum annual contribution. And if your tax bill for the year is less than $4,000, Uncle Sam-meaning other taxpayers, actually-would chip in the money on your behalf. Good news for anyone currently paying less than 20.5% federal tax on each extra dollar. Not so good for those earning more. You might not know the net effects from some of the coverage, but Garrett Watson, senior analyst at the independent Tax Foundation, talked me through the implications. Naturally, as this involves the Byzantine U.S. tax code, there are complicating issues. The income tax brackets apply to \"taxable income,\" which is not the same as gross income, gross adjusted income, or modified gross adjusted income. And the policy wonks who first came up with this proposal talk about a \"26%\" tax credit, but numbers in Washington, D.C., don't mean the same as they do outside. A tax credit, he explains, calculated on the money left over, not the money you had at the start. (Earn $1 gross and pay 20.5% tax and you'd end up with 79.5 cents. If Uncle Sam gets rid of that tax break, but gives you back your 20.5 cents, he calls that 26%, because it'sâ\u0080¦. 26% of 79.5 cents. Confused? You won't be, after this week's episode of... Uncle Sam). The goal of the proposal is to try to tackle the looming crisis of retirement savings, which is particularly acute among the poor and near-poor. That's a worthy idea, but to some extent this is just a shell game. We're effectively subsidizing retirement savings for those earning less by raising taxes on everyone else. We could, of course, just as easily raise taxes on everyone else and spend the money on, say, Social Security. (Incidentally the Democrats also have proposals designed to shore up Social Security's finances.) \"It's a very creative way to try to incentivize greater savings on the part of those with lower incomes,\" says Watson, but he adds that there are other policy options that would do more, such as expanding the Savers' Credit. The headline pitch of the Biden-Harris proposal is that it's progressive, because currently people paying top rates of tax are currently getting the biggest tax breaks. Well, yes, goes one reply: That's how it's supposed to work. In theory, the proposals would raise taxes on those in higher tax brackets who contribute to their 401(k) plans. In practice, of course, most of those would simply get around the maneuver by changing their contributions from \"traditional\" to \"Roth.\" This means that instead of taking a tax deduction up front, and then paying tax when they access their money in retirement, they would forego any tax deduction up front, but pay no taxes when they access money down the road. A growing number of 401(k) plans offer a \"Roth\" option. Under the Biden-Harris proposals, someone in high rate of tax would probably be better off paying the 37% now, and taking all their gains tax-free in future. The clever twist? If that happens, the Biden-Harris proposal would also boost tax revenues straight away, as wealthier people stopped deducting their 401(k) contributions. To be sure, that will then reduce tax revenues in the long run, when those rich people start tapping their tax-free accounts. But in the long run we're all dead anyway, right?"}]}