{"article": [{"url": "https://www.marketwatch.com/story/deutsche-bank-posts-loss-on-loan-loss-provisions-2020-07-29", "published": 1595986520.0, "headline": "Deutsche Bank posts loss on loan-loss provisions", "body": "Deutsche Bank AG on Wednesday posted a second-quarter loss despite a strong performance of its investment bank pushing quarterly revenue up but its provisions for bad loans hit its highest level in more than a decade. The German bank set aside 761 million euros ($891.5 million) to cover credit losses, adding to the roughly half a billion euros it stowed away in the first quarter. Like other banks in Europe and the U.S., the lender is preparing for a potential wave of loan losses brought about by the coronavirus pandemic. Earlier this month, U.S. banks JPMorgan Chase & Co., Wells Fargo & Co. and Citigroup Inc. took $28 billion in bad-loan charges. However, the provisions are lower than the EUR818 million analysts had forecast, according to a consensus forecast provided by the bank. Deutsche Bank posted a loss attributable to shareholders of EUR77 million compared with a loss of EUR3.27 billion a year earlier, when heavy restructuring charges weighed on the results. It is the fifth consecutive such a quarterly loss in a row for the bank. When including noncontrolling interests and other components, the bank had an after-tax profit of EUR61 million. This compares with a EUR3.15 billion loss a year earlier and analysts' expectations of a loss of EUR46 million. Germany's largest bank is headed for another loss-making year, analysts forecast, following a EUR5.3 billion loss last year. Deutsche is undergoing a deep restructuring, which includes cutting 18,000 jobs and exiting businesses. Revenue rose 1% to EUR6.29 billion, beating expectations of EUR6.11 billion. Investment-bank revenue rose 46% on year, with fixed-income revenue up 39%. \"In a challenging environment we grew revenues and continued to reduce costs, and we're fully on track to meet all our targets,\" Chief Executive Christian Sewing said."}]}