{"article": [{"url": "https://www.marketwatch.com/story/states-would-be-on-the-hook-for-billions-under-trumps-jobless-benefits-plan-2020-08-09", "published": 1596990740.0, "headline": "States would be on the hook for billions under Trumpâ\u0080\u0099s jobless-benefits plan", "body": "FALLS CHURCH, Va. â\u0080\u0094 Whether President Donald Trump has the constitutional authority to extend federal unemployment benefits by executive order remains unclear. Equally up in the air is whether states, which are necessary partners in Trumpâ\u0080\u0099s plan to bypass Congress, will sign on. Trump announced an executive order Saturday that extends additional unemployment payments of $400 a week to help cushion the economic fallout of the pandemic. Congress had approved payments of $600 a week at the outset of the coronavirus outbreak, but those benefits expired Aug. 1 and Congress has been unable to agree on an extension. Many Republicans have expressed concern that a $600 weekly benefit, on top of existing state benefits, gives people an incentive to stay unemployed. But under Trumpâ\u0080\u0099s plan, the $400 a week requires a state to commit to providing $100. Many states are already facing budget crunches caused by the pandemic. Asked at a news conference how many governors had signed on to participate, Trump answered: â\u0080\u009cIf they donâ\u0080\u0099t, they donâ\u0080\u0099t. Thatâ\u0080\u0099s up to them.â\u0080\u009d Aubrey Layne, secretary of finance for Virginia Gov. Ralph Northam, a Democrat, said in a phone interview Sunday he believes it would be feasible for Virginia to participate in such a program if states are allowed to use money thatâ\u0080\u0099s been allocated to them under the already passed CARES Act. He said his preliminary understanding is that states can do so, but he and others are waiting to see the rules published. The better solution, Layne said, would be for Congress to pass legislation. â\u0080\u009cItâ\u0080\u0099s ludicrous to me that Congress canâ\u0080\u0099t get together on this,â\u0080\u009d he said. â\u0080\u009cI think it would have been better for the president to use his influence in those negotiations, rather than standing on the sideline and then riding in like a shining knight.â\u0080\u009d Indeed, details about the program became confused on Sunday. On CNNâ\u0080\u0099s â\u0080\u009cState of the Nationâ\u0080\u009d White House economic adviser Larry Kudlow said conflicting things about whether the federal money was contingent on an additional contribution from the states. Initially Kudlow said that â\u0080\u009cfor an extra $100, we will lever it up. We will pay three-quarters, and the states will pay 25 percent.â\u0080\u009d In the same interview, though, he later said that â\u0080\u009cat a minimum, we will put in 300 bucks ... but I think all they (the states) have to do is put up an extra dollar, and we will be able to throw in the extra $100.â\u0080\u009d A clarifying statement from the White House said the â\u0080\u009cfunds will be available for those who qualify by, among other things, receiving $100/week of existing assistance and certify that they have lost their jobs due to COVID-19.â\u0080\u009d Several advocacy groups that follow the issue, though, said itâ\u0080\u0099s clear the way the executive order is structured that the federal money will be contingent on states making a 25 percent contribution. New York Gov. Andrew Cuomo, a Democrat, called the plan â\u0080\u009can impossibility.â\u0080\u009d â\u0080\u009cI donâ\u0080\u0099t know if the president is genuine in thinking the executive order is a resolution or if this is just a tactic in the negotiation,â\u0080\u009d Cuomo said. â\u0080\u009cBut this is irreconcilable for the state. And I expect this is just a chapter in the book of Washington COVID mismanagement.â\u0080\u009d In Connecticut, Democratic Gov. Ned Lamont said on CBSâ\u0080\u0099 â\u0080\u009cFace the Nationâ\u0080\u009d that the plan would cost his state $500 million to provide that benefit for the rest of the year, and called Trumpâ\u0080\u0099s plan â\u0080\u009cnot a good idea.â\u0080\u009d â\u0080\u009cI could take that money from testing â\u0080\u0094 I donâ\u0080\u0099t think thatâ\u0080\u0099s a good idea,â\u0080\u009d Lamont said. On CNN, Republican Ohio Gov. Mike DeWine praised Trump for issuing the order. â\u0080\u009cHeâ\u0080\u0099s trying to do something. Heâ\u0080\u0099s trying to move the ball forward,â\u0080\u009d DeWine said. Still, he was noncommittal about whether Ohio would participate. â\u0080\u009cWeâ\u0080\u0099re looking at it right now to see whether we can do this,â\u0080\u009d he said. In Maryland, Michael Ricci, spokesman for Republican Gov. Larry Hogan, said in an email that â\u0080\u009cwe will wait on new guidance from US Department of Labor before looking at any (unemployment insurance) changes.â\u0080\u009d In Minnesota, Department of Employment and Economic Development Commissioner Steve Grove said his agency is â\u0080\u009cawaiting further guidance from the U.S. Department of Labor.â\u0080\u009d On ABCâ\u0080\u009ds â\u0080\u009cThis Week,â\u0080\u009d Senate Minority Leader Chuck Schumer, D-N.Y., called it â\u0080\u009can unworkable plan. â\u0080\u009cMost states will take months to implement it, because itâ\u0080\u0099s brand new. Itâ\u0080\u0099s sort of put together with spit and paste. And many states, because they have to chip in $100, and they donâ\u0080\u0099t have money, wonâ\u0080\u0099t do it,â\u0080\u009d Schumer said. Many states struggled to adjust outdated computer systems to accommodate the $600 payment, which along with the massive influx of new claims resulted in long delays in providing benefits. Reprogramming the computers again to accommodate the new amount could result in similar glitches. On ABC, Kudlow said that many of those outdated systems have since been upgraded. â\u0080\u009cI donâ\u0080\u0099t think there will be a huge delay. Labor Department has been working with the states. The states are the ones that process the federal benefits before. So, I donâ\u0080\u0099t see any reason why it would be all that difficult,â\u0080\u009d he said."}]}