{"article": [{"url": "https://www.marketwatch.com/story/i-want-to-take-money-out-of-my-roth-ira-tax-free-when-can-i-do-that-2020-07-17", "published": 1595059820.0, "headline": "I want to take money out of my Roth IRA tax-free - when can I do that?", "body": "Q: A friend of mine says that if you withdraw money from a Roth IRA within five years of putting it in, you'll pay tax and a penalty. I started my Roth in 2018 when I turned 30 and thought I could get the $11,500 I have put in over the last two years out at any time without tax because I didn't get a tax break when I made my deposits. What gives? -Harry A.: Harry, I think your friend is mixing a few things together. There are two \"five-year rules\" that come up often with Roth IRAs. One applies to conversions and the other to earnings. You don't mention any conversions, so I'll just address the five-year rule on earnings here. A significant difference between the two rules is that the rule affecting earnings only needs to be satisfied once in your lifetime whereas the rules affecting conversions apply to each conversion transaction separately before age 59½. First, you are correct that the $11,500 in contributions can be withdrawn at any time. Those contributions were made with after-tax money and are not taxed again when distributed. In fact, due to the ordering rules, when you withdraw funds from a Roth IRA, the withdrawal is considered to be from contributions first before any other funds. If your account is worth $14,000 and you pull $8,000 out, no taxes are due. At that point, you have $6,000 left consisting of $3,500 in contributions and $2,500 in earnings. It is the earnings that are subject to the one-time five-year rule. The five year earnings rule says that, with a few exceptions, in order for earnings in a Roth IRA to be withdrawn tax-free, the taxpayer must be 59½ years old AND it must be at least five years since the taxpayer funded their first Roth IRA even if that account no longer exists. Therefore, if this was your first Roth account, you should be aware of this rule because you are under 59½ and only in the second year after the year you opened the account. If you were to now take the $6,000 left in our example, the first $3,500 is deemed to be contributions and the next $2,500 is earnings that will generate a tax bill. You will owe taxes on $2,500 of ordinary income. In addition, because you are under age 59½ a $250 early distribution penalty (10% of $2,500) is due. This can get confusing, but it gets a little easier when you keep in mind that with respect to taking earnings out of a Roth IRA tax-free, the taxpayer need only satisfy the five year time frame once in their lifetime AND be over 59½ when they distribute earnings. Harry, if you had funded a Roth IRA in 2015 or earlier and closed it, you would meet the five-year time requirement even though your current account was started in 2018. However, you would still face tax and penalty on distributions of earnings because you would not meet the age requirement. If you were over age 59½ and withdrew the final $6,000 from the account from our example above in which we assume this is your first Roth IRA, you would meet the age requirement but not the five-year requirement so the $2,500 in earnings would be taxable. However, the 10% penalty would not apply because you would be over 59½. This can trip up some retirees that convert or rollover 401(k)s, including Roth 401(k) accounts to their first Roth IRA. They are old enough to get to earnings tax-free but haven't met the five-year rule for earnings. If you have a question for Dan, please email him with \"MarketWatch Q&A\" on the subject line. Dan Moisand is a financial planner with Moisand Fitzgerald Tamayo. His comments are for informational purposes only and are not a substitute for personalized advice. Consult your adviser about what is best for you. Some questions are edited for brevity."}]}