{"article": [{"url": "https://www.marketwatch.com/story/a-powerful-force-will-determine-what-happens-next-in-the-stock-market-wharton-professor-predicts-2020-08-25", "published": 1598688380.0, "headline": "A â\u0080\u0098powerful forceâ\u0080\u0099 will determine what happens next in the stock market, Wharton professor predicts", "body": "“ â\u0080\u0098Itâ\u0080\u0099s not going to be a serious correction, not anywhere again down near those March lows. A little pause if we get that wave, but I donâ\u0080\u0099t think itâ\u0080\u0099s going to really stop the longer-term momentum upward.â\u0080\u0099 ” Thatâ\u0080\u0099s Jeremy Siegel, the Wharton professor credited for calling Dow 20,000 in 2015, talking with CNBC about his bullish market outlook despite the potential for a surge in coronavirus cases. He explained that, ultimately, the combination of an effective vaccine and a government committed to pumping the economy with stimulus should provide a tailwind for the stock market. â\u0080\u009cEven if it takes another six months more than we hope to get an effective vaccine, when you come back with the liquidity thatâ\u0080\u0099s provided by the Fed, thatâ\u0080\u0099s a really powerful force,â\u0080\u009d Siegel said. Considering stocks are forward-looking assets, he explained that the market should hold up in the coming months even with lousing economic numbers and a lingering pandemic. â\u0080\u009cThatâ\u0080\u0099s why you can have a â\u0080\u0098Uâ\u0080\u0099 economy, a â\u0080\u0098Wâ\u0080\u0099 economy, and you can still have a â\u0080\u0098Vâ\u0080\u0099 stock market,â\u0080\u009d Siegel said. Read:That V-shaped economic recovery? Donâ\u0080\u0099t count on it, warns â\u0080\u0098Dr. Doomâ\u0080\u0099 In reference to the increasingly popular Wall Street theme that value stocks will return as tech stock run out of gas, Siegel told CNBC it doesnâ\u0080\u0099t have to be one or the other. â\u0080\u009cThe amount of the liquidity thatâ\u0080\u0099s been added to this economy is there. Itâ\u0080\u0099s not going to be withdrawn by the Fed because unemployment is going to remain high,â\u0080\u009d he said. â\u0080\u009cSo I think thereâ\u0080\u0099s room really for both groups to go up in 2021, even though we finally might get a turn towards value.â\u0080\u009d Watch the full interview: Meanwhile the stock market hit a bit of a speed bump on Tuesday, with the Dow Jones Industrial Average DJIA, +0.56% Â and S&P 500 SPX, +0.87% Â moving lower. The Nasdaq Composite COMP, +1.39% Â , however, managed to push into positive territory."}]}