{"article": [{"url": "https://www.marketwatch.com/story/feds-evans-sees-risks-of-recessionary-dynamics-without-more-fiscal-stimulus-2020-09-22", "published": 1600782200.0, "headline": "Fedâ\u0080\u0099s Evans sees risks of â\u0080\u0098recessionary dynamicsâ\u0080\u0099 without more fiscal stimulus", "body": "It is important that Congress pass more spending to help the economy during the pandemic or there is a risk the economy sinks in a downward spiral, Chicago Fed President Charles Evans warned Tuesday. â\u0080\u009cEvery week and every month we go without renewing additional fiscal supportâ\u0080¦we risk a longer period of slower growth if not recessionary dynamics,â\u0080\u009d Evans said during a discussion sponsored by OMFIF, an international forum for economic policy. Evans said he was surprised to see how strong the economy has rebounded from the lockdown in April and May. The economy is back about 90% even though the toll of deaths has been â\u0080\u009chorrific,â\u0080\u009d Evans said. Manufacturing has â\u0080\u009ccome way backâ\u0080\u009d led by the auto sector, he said. Read:Fed Powell says its tough for Fed to lend to small business Evans said he expects the unemployment rate to end the year in a range of 7%-7.5%, and to improve to a 5.5% rate by the end of 2021. The jobless rate was 8.4% in August. The labor market â\u0080\u009chas really come back a lot better,â\u0080\u009d he said. The Chicago Fed president, who has been in his post since 2007, said his forecast assumes more fiscal stimulus and a vaccine becoming available sometime in the middle of next year. â\u0080\u009cIf those things donâ\u0080\u0099t happen, it is going to be an obstacle,â\u0080\u009d he said. Inflation is going remain below the Fedâ\u0080\u0099s 2% target for a number of years and that means Fed policy will have to remain accommodative, he said. The Fed has adopted a new policy to allow inflation to run above the 2% target for some time so that inflation averages 2%. Asked how long the Fed would allow inflation to overshoot 2% and how high it would allow inflation to rise, Evans said it the Fed was â\u0080\u009ctimidâ\u0080\u009d and limited its inflation overshoot to 2.25%, then it would take until 2026 or 2028 to average 2%. â\u0080\u009cI would like to raise rates as soon as anybody,â\u0080\u009d Evans said. For me, thatâ\u0080\u0099s going to be when the economy is very very strong and real interest rates are rising,â\u0080\u009d he said. â\u0080\u009cMonetary policy in some sense would follow the economy up,â\u0080\u009d he said. â\u0080\u009cWe could start raising rates before we start averaging 2%, we need to discuss that,â\u0080\u009d he added. iframe.twitter-tweet { width: 100% !important; } Stocks were mixed Tuesday after steep losses on Monday. The Dow Jones Industrial Average DJIA, +0.56% Â was up less than 0.1%, while the S&P 500 index SPX, +0.87% was trading 0.4% higher."}]}