{"article": [{"url": "https://www.marketwatch.com/story/foot-lockers-stocks-jumps-after-adjusted-profit-tops-forecasts-and-same-store-sales-beat-by-wide-margin-2020-08-21", "published": 1597996040.0, "headline": "Foot Locker's stocks jumps after adjusted profit tops forecasts, and same-store sales beat by wide margin", "body": "Shares of Foot Locker Inc. FL, -0.80% shot up 4.5% in premarket trading Friday, after the athletic shoe and gear retailer reported a fiscal second-quarter profit that topped forecasts and a big same-store sales beat. Net income fell to $45 million, or 43 cents a share, from $60 million, or 55 cents a share, in the year-ago period. Excluding non-recurring items, adjusted earnings per share came to 71 cents, above the FactSet consensus of 69 cents. Sales rose 17.1% to $2.08 billion, matching the FactSet consensus, while same-store sales grew 18.6% to beat expectations of a 1.9% rise. Merchandise revenue fell 2.7% to $1.19 billion. Cash totaled $1.37 billion, while debt on the balance sheet was $121 million. The company did not provide a financial outlook, citing uncertainties related to the COVID-19 pandemic. \"We delivered a meaningful increase in sales, managed our expenses tightly, and made progress towards our goal of improving our inventory position,\" said Chief Financial Officer Lauren Peters. \"Looking ahead, we believe the Company is well positioned financially to maneuver through the evolving COVID-19 pandemic.\" In a separate filing, Foot Locker announced that executive salaries, which had been slashed starting May 3 as part of the COVID-19-related cost-saving effort, would be restored on September 1 due to the company's performance. Chief Executive Richard Johnson's salary was cut 40%, executive vice presidents and senior vice presidents had their salaries reduced by 20%. And corporate vice presidents and general manager-level executives had their salaries reduced by 10%. In addition, the share repurchase program will be restarted on that date. And the company has declared a 15-cents-per-share quarterly dividend payable on October 30 to shareholders of record as of October 16. The stock has tumbled 30.3% year to date through Thursday, while the SPDR S&P Retail ETF XRT, +0.05% has gained 12.5% and the S&P 500 SPX, +0.87% has tacked on 4.8%."}]}