{"article": [{"url": "https://www.marketwatch.com/story/goldman-sachs-now-expects-gold-to-reach-2300-an-ounce-2020-07-28", "published": 1595933240.0, "headline": "Goldman Sachs has a new blowout forecast for gold", "body": "A weaker day is setting up for stocks on Tuesday, as optimism over U.S. stimulus progress and vaccine news starts to fade, and attention turns to the start of a two-day Federal Reserve meeting. The asset that stole the show on Monday, of course, was gold US:GCQ20, which climbed to $1,931 an ounce, the highest settlement in history. That juiced the crowd expecting $2,000 an ounce soon, and leads us to our call of the day from Goldman Sachs, which has ditched its own $2,000 forecast and says we’re going to see $2,300 an ounce in the next 12 months. The bank also lifted its silver outlook to $30 from $22 an ounce. Driven by “a potential shift in the U.S. Fed toward an inflationary bias against a backdrop of rising geopolitical tensions, elevated U.S. domestic political and social uncertainty, and a growing second wave of COVID-19 related infections,” gold’s surge to new highs lately has outpaced gains for real rates and other alternatives to the dollar, said a team of analysts led by Jeffrey Currie. “Combined with a record level of debt accumulation by the U.S. government, real concerns around the longevity of the U.S. dollar as a reserve currency have started to emerge,” said the team. One point made by Currie and the team is that hedges against inflation like commodities and stocks are likely far cheaper currently, than maybe in the future when inflation could start to show up. Current debasement — lowering the value of currencies — and debt accumulation “sows the seeds for future inflationary risks despite inflationary risks remaining low today.” Gold is up around 7% over the past month, versus a 3.7% drop for the ICE U.S. Dollar Index DXY, -0.58%. That said, gold seems to have paused that run on Tuesday, while the dollar has inched up. Analysts at Commerzbank caution that record-high prices for gold will weigh on important physical demand for some time, notably from Asia, with China reporting a 38% drop in first-half consumption this year. “Much will therefore depend on whether investors in the West remain willing to buy large quantities of gold even at the current prices,” said analyst Carsten Fritsch. Goldman’s Currie isn’t that concerned though, as he said emerging market currencies are starting to see an ease in pressure and growth is starting to look up for the region. He sees those buyers will be ready to step in when prices stabilize and developed market purchasers run out of gas. The market The Dow DJIA, +0.56% , S&P SPX, +0.87% and Nasdaq COMP, +1.39% are down, with European stocks SXXP, +0.55% also falling, while Asian stocks advanced.The chart Real-time labor statistics from Arizona State University and Virginia Commonwealth University (thanks to @johnauthors) show pandemic unemployment has hit those without college degrees much harder than those with: Check out more of that data here.The buzz Earnings news is weighing on shares of conglomerate 3M MMM, +0.94% and lifting those of pharmaceutical group Pifzer PFE, -0.27%, while fast food giant McDonald’s MCD, -0.43% is down on its results. Biotech Amgen AMGN, -1.41%, credit card company Visa V, +1.80%, coffee chain Starbucks SBUX, +0.53% and chip group AMD AMD, -3.94% are coming after the close. Outside of the Fed meeting, the Case-Shiller national home price index and consumer confidence are ahead. Republicans unveiled their latest COVID-19 stimulus package on Monday, but plenty of horse-trading is to come before a deal with Democrats is agreed. Data continue to show U.S. cases may just be starting to plateau in some of the hardest-hit southern and southwest states. But parts of Europe, such as Spain and Belgium, and Asia are seeing cases start to rise again. The tweet iframe.twitter-tweet { width: 100% !important; } Random reads Ex-Malaysian leader found guilty of looting 1MDB state investment fund. Costco: Where America’s beloved party cakes go to die. Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. Be sure to check the Need to Know item. The emailed version will be sent out at about 7:30 a.m. Eastern. Follow MarketWatch on Twitter, Instagram, Facebook."}]}