{"article": [{"url": "https://www.marketwatch.com/story/child-care-costs-are-soaring-just-when-parents-need-it-most-11594761449", "published": 1594793180.0, "headline": "Child care costs are soaring just when parents need it most", "body": "\"I want her to have a proper education and be socialized but I don't want to put her at risk,\" said Alessandra Green, pictured. Her 5-year-old daughter is set to start kindergarten this fall. Alessandra Green For parents who were suddenly forced to become home-school teachers when schools shifted to distance learning in March amid the pandemic, the prospect of having their children back in a classroom five days a week sounds far too good to be true. For many parents, that dream won’t come true this fall. Already, Los Angeles and San Diego schools, which make up the two largest public school districts in California, announced Monday that all classes in the fall will be held virtually. For working parents, that could mean having to cut back their hours to care for their children or take on more hours to pay for child care. Across the U.S. some 26.8 million workers are dependent on child care in order to work, according to a recent study published by McKinsey. Meanwhile, the pandemic has exacerbated the existing shortage of child care facilities in the U.S. as many have had to close permanently due to low attendance and health restrictions that make it more costly to run. Some 4.5 million child care slots could disappear permanently because of the pandemic, according to a recent report by the Center for American Progress, a left-leaning think tank. The shortage is most pronounced in rural communities, where three in five lacked adequate child care supply in 2018, according to the Center for American Progress. In California, parents spend an average of 17.8% of their annual income on center-based child care for infants, according to Child Care Aware of America, a nonprofit organization that researches the cost of child care. That makes California the least affordable state for center-based child care for infants. Ahead of Los Angeles and San Diego’s announcement, New York City’s Department of Education announced a hybrid school week model for the country’s largest school system where children will have in-person, socially-distanced learning some days and virtual learning other days. If a parent is not comfortable with sending their child to school for in-person learning they can opt for remote learning only. On the surface, Alessandra Green, 27, said that model sounds ideal for her 5-year-old daughter, who will be starting kindergarten in the fall. “I want her to have a proper education and be socialized but I don’t want to put her at risk,” Green who lives in San Antonio, Tex. and works 40 hours a week as a manager at a cleaning company, said. “At the same time, I don’t know if there would be anybody available to watch her either.” Her partner, Alberto Flores, has been watching their two daughters throughout the pandemic because he was out of work. However recently he’s been getting more job opportunities as a landscaper and handyman. They’ve been relying on family members and babysitters to watch their kids when both of them are working at the same time. “ ‘I want her to have a proper education and be socialized but I don’t want to put her at risk’ ” — Alessandra Green Their other daughter, age 4, is set to attend preschool in the fall, though Green has been informed that if a child or teacher were to get sick everyone would have to quarantine at home for two weeks. From a health perspective, that plan, Green said, is not ideal. “I wouldn’t be comfortable with it but it would probably just be an option I would have to go with because I did lose some work [during the pandemic] and I got pay cuts.” “Before I could’ve afforded child care but now since their dad hasn’t been working until this week I can’t.” Many parents across the country share the dilemma Green is confronting Although President Donald Trump has demanded all schools open for in-person learning this fall, threatening to defund schools that don’t, parents worry that the costs of being exposed to coronavirus outweigh the benefits. More than half of the parents with kids entering kindergarten through third grade surveyed by the New York City Dept. of Education anticipate needing child care on the days when their child doesn’t attend school in person. Parents are increasingly concerned about the rising cost of child care. Some 52% of parents anticipate that the cost of child care will be higher than before COVID-19, according to a survey of more 2,000 parents conducted by Care.com, an online marketplace for finding child care. From 2013 to 2019, the average weekly cost of a nanny or child care center increased by 20% and 16% respectively, according to Care.com data. Despite the expense, in-person caregivers are getting booked for the school year, said Tricia Han, chief product officer at Care.com. One option which has seen a spike in demand is Care.com’s nanny-sharing program, where different families split the cost of a nanny who watches children from both families at once. “ From 2013 to 2019, the average weekly cost of a nanny or child care center have increased by 20% and 16%, respectively ” This is a great option for parents who are uncomfortable sending their children to school but still want them to socialize with other children, Han said. Han also encouraged parents to research whether their employer offers a Dependent Care Flexible Spending Account. There are also various tax benefits that can greatly reduce the cost of child care. “If there’s any upside to the fall it’s that we have time to plan,” said Han, who is a parent herself. “In March it all happened overnight.”"}]}