{"article": [{"url": "https://www.marketwatch.com/story/consumer-sentiment-slips-in-late-june-as-confidence-in-us-economic-policies-slumps-to-trump-era-low-2020-06-26", "published": 1593168680.0, "headline": "Consumer sentiment slips in late June as confidence in U.S. economic policies slumps to Trump-era low", "body": "The numbers: Americans turned slightly more cautious about how quickly the economy will recover from the coronavirus in late June as confidence in Washington’s policies fell to the lowest level during the Trump presidency, according to a closely followed survey of consumer sentiment. The final results of the consumer-sentiment survey in June slipped to 78.1 from an initial 78.9, the University of Michigan said Friday. What happened: Consumers don’t think the economy can get much worse, but they are unsure how long it will take for the U.S. to return to normal. Read:U.S. entered recession in February after end of longest expansion in history The reopening of the economy helped buoy spirits in May and early June, but a recent rise in cases, especially in the South, could end up being a setback. The South was the first region to reopen. Consumer sentiment barely rose in the South in June, whereas it soared in the Northeast “with residents apparently expecting the later and more gradual reopening to produce at worst a negligible increase in infections,” said Richard Curtin, the chief economist of the sentiment survey. Consumers also expressed more pessimism over Washington’s ability to help. Confidence in Washington’s economic policies fell to the lowest level since President Trump took office in January 2017. See:Marketwatch’s Coronavirus Economic Recovery Tracker. Big picture: The cautious optimism about an economy recovery last month could soon give way to more unease if a new explosion in coronavirus cases is not brought under control. The disease is spreading more rapidly in the South and parts of the West even as it slows in the harder hit Northeast. Most economists predict a choppy recovery and uneven growth as the nation searches for ways to allow businesses, schools and other entities to safely reopen. Unemployment is likely to remain high for at least the next year. Read: Revisiting that funky drop in unemployment to 13.3%: Nobody really believes it What they are saying? “The report notes that sentiment is more closely tied to the coronavirus,” said chief economist Scott Brown of Raymond James. “The recent increase in reported cases of COVID-19 should reduce sentiment in July, but you could have probably guessed that already.” Market reaction:The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% fell in Friday trades. Stocks have zig-zagged over the past few weeks as the economy reopened but suffered another increase in coronavirus cases."}]}