{"article": [{"url": "https://www.marketwatch.com/story/pound-volatile-amid-speculation-over-u-k-european-union-trade-deal-will-be-reached-11601555960", "published": 1601542040.0, "headline": "Pound volatile amid speculation over whether U.K.-European Union trade deal will be reached", "body": "European Commission President Ursula von der Leyen adjusts her face mask ahead of delivering a statement before the first day of a European Union summit on October 1, 2020. johanna geron/Agence France-Presse/Getty Images The pound was volatile on Thursday, with focus lying squarely on talks between the U.K. and European Union on a trade deal. The pound GBPUSD, +0.83% dropped from $1.2932 to as low as $1.2820 as U.K. traders started for the day, as the European Union started formal legal proceedings against the U.K.’s internal markets bill that would undo some of last year’s withdrawal agreement. But the U.K. currency picked back up, rising to $1.2940, after a reporter from the Financial Times tweeted “a landing zone on state aid” has been reached. That leaves fishing as the last hurdle to a deal. iframe.twitter-tweet { width: 100% !important; } The U.K. currency has gained nearly 4% against the dollar over the last three months, over optimism that an EU deal will be reached, as well as the recovery in the global economy as coronavirus restrictions have been removed. Additional restrictions in England were announced for regions including Liverpool and Middlesbrough on Thursday. The FTSE 100 UKX, +0.64% rose 0.6%, in a broad-based advance led by the financial sector. Medical device maker Smith & Nephew SN, +0.29% was another gainer, up nearly 3%, after saying all three of its franchises have made a significant recovery in the third quarter. Rolls-Royce RR, +14.25% shares stumbled 11%. The struggling U.K. aircraft-engine maker said it would sell £2 billion in shares priced at a 41% discount to Wednesday’s close and raise at least £1 billion more in the bond market. Read: EU takes legal action against U.K. for breach of Ireland protocol. Here’s why that doesn’t mean a trade deal can’t still happen"}]}