{"article": [{"url": "https://www.marketwatch.com/story/lowes-targets-professionals-and-its-main-competitor-home-depot-with-new-services-2020-08-20", "published": 1598086220.0, "headline": "Loweâ\u0080\u0099s targets professionals, and its main competitor Home Depot, with new services", "body": "Loweâ\u0080\u0099s Cos. second-quarter results got a bump from professional tradespeople, a group that usually favors the home improvement retailerâ\u0080\u0099s main competitor, Home Depot Inc. HD, +0.49% Â Loweâ\u0080\u0099s LOW, +1.38% Â reported profit and sales that were well ahead of expectations, and U.S. same-store sales growth of 35.1%, triple the 11.9% rise FactSet forecast. Comparable sales in the professional category were up in the mid-20% range. Loweâ\u0080\u0099s is taking aim at professionals with new initiatives and efforts designed for these shoppers, including a partnership with Stream for a free augmented reality video chat service called JobSight. Launched on June 1, it allows professionals to meet with clients virtually, a feature thatâ\u0080\u0099s particularly suited to the coronavirus pandemic. Read:Transactions of $1,000 or more grew 16% at Home Depot during the second quarter For professional loyalty customers, thereâ\u0080\u0099s a free one-year subscription to Home Advisor that comes will job leads and access to experts. And Loweâ\u0080\u0099s is launching a tool rental program that will start rolling out in Charlotte on Aug. 20. â\u0080\u009cAs over 70% of pros are currently utilizing tool rental programs, this will provide a meaningful opportunity for Loweâ\u0080\u0099s to deepen our relationship with this customer segment,â\u0080\u009d said Joseph McFarland, Loweâ\u0080\u0099s executive vice president of stores, according to a FactSet transcript of the Wednesday earnings call. Loweâ\u0080\u0099s stock has gained 32.4% for the year to date, while the S&P 500 index SPX, +0.87% Â is up 4.8% for the period. â\u0080\u009cLoweâ\u0080\u0099s has traditionally been a DIY [do-it-yourself] heavy business, but their investments in the pro space may enhance growth in this segment since it is likely that DIY customers may shift their share of wallet back to travel and eating out once the pandemic subsidies,â\u0080\u009d wrote Raymond James in a note. Analysts think Loweâ\u0080\u0099s could be setting itself up for gains in fiscal 2021. Raymond James rates Loweâ\u0080\u0099s stock market perform. Truist Securities also think the professional category will be key to Loweâ\u0080\u0099s turnaround. â\u0080\u009cLoweâ\u0080\u0099s has started to see substantially faster growth than peer Home Depot,â\u0080\u009d analysts led by Keith Hughes said. â\u0080\u009cWe attribute the brand focus and store execution of Loweâ\u0080\u0099s as a driver, in addition to finally seeing better online and pro sales.â\u0080\u009d Truist rates Loweâ\u0080\u0099s shares buy with a $178 price target. See:Target reports record-setting quarterly profits and comparable sales, $5 billion in market share gains for the first half of 2020 Even with its existing strength with DIY shoppers, GlobalData Retail thinks thereâ\u0080\u0099s still room for Loweâ\u0080\u0099s to take share in this category as well. â\u0080\u009cHome improvement shoppers, especially ones who do not regularly shop the sector, have been more focused on practical matters like convenience, availability, and how easy it is to use apps and websites,â\u0080\u009d wrote Neil Saunders, GlobalData managing director, in a note. â\u0080\u009cThis shift has been beneficial for Loweâ\u0080\u0099s. It has created some churn where Loweâ\u0080\u0099s has picked up consumers who would usually visit Home Depot and it has also allowed Loweâ\u0080\u0099s to secure a good share of new home improvement buyers.â\u0080\u009d"}]}