{"article": [{"url": "https://www.marketwatch.com/story/founder-trevor-milton-steps-down-as-chairman-of-embattled-electric-truck-maker-nikola-11600675079", "published": 1600669760.0, "headline": "Shares of electric-truck maker Nikola plunge as founder Trevor Milton steps down as chairman", "body": "Pictured, Trevor Milton, former executive chairman at Nikola at an undated presentation. Nikola Corp. The founder and executive chairman of embattled electric truck maker Nikola, Trevor Milton, has voluntarily resigned, the company said Monday. “Nikola is truly in my blood and always will be, and the focus should be on the Company and its world-changing mission, not me,” said Milton, who will also be stepping down from the company’s board of directors. according to a company press release. “So I made the difficult decision to approach the Board and volunteer to step aside as Executive Chairman. Founding Nikola and growing it into a company that will change transportation for the better and help protect our world’s climate has been an incredible honor.” Nikola shares plunged nearly 30% in premarket trade, set to open at a four-month low. Stephen Girsky, former vice chairman of General Motors and a member of Nikola’s NKLA, -1.36% Board, has been appointed chairman of the board, effective immediately. “We’ve built a deep bench of talent over the years, and I am confident that Nikola’s Chief Executive Officer, Mark Russell, supported by Chief Financial Officer, Kim Brady, and the rest of the leadership team will advance our goal of making Nikola the global leader in zero-emissions transportation,” added Milton. Mark Russell, Nikola’s chief executive officer, said the company’s priorities “remain unchanged.” News of Milton’s departure surfaced on trade publication FreightWaves late Sunday. The report said Milton, who is a major shareholder in the company, decided to step down to prevent to shield the company and his investments. Investors in the hydrogen-powered truck maker have been on a roller-coaster ride this month. Shares surged over 40% on Sept. 8 after the group announced a billion-dollar deal with General Motors GM. Nikola shares fell sharply on Sept. 10 and 11 after a report from short-seller Hindenburg Research that Nikola had misled investors. Nikola has refuted those claims, though to the allegations it filmed a truck rolling down a hill, the company said it never stated it was driving under its own propulsion. Nikola took another hit after a Sept. 14 report from Bloomberg News that the Securities and Exchange Commission was looking into the short-seller claims. Nikola responded by saying it had “proactively contacted and briefed” the SEC about Hindenburg’s report, claiming it was designed to manipulate the market to benefit short sellers. In a statement, Nikola said it “welcomes the SEC’s involvement in this matter.” The Wall Street Journal reported on Sept. 15 that the Justice Department had joined U.S. securities regulators in that probe. Representatives of the SEC and Manhattan U.S. attorney’s office and Nikola declined to comment to the WSJ, For September so far, Nikola has lost 16%, but have soared 231% for 2020 so far. Wedbush analyst Dan Ives said Milton’s exit was “shocking,” and will leave investors with some “white knuckles,” in a note to clients. He said Nikola’s partnership with with General Motors will be a “linchpin to its success.” “Trevor stepping down voluntarily at Nikola will be perceived by the Street as a major near-term gut punch for the company’s lofty EV ambitions as he plays a key role strategically in driving the company’s vision,” Ives wrote in a note to clients. “In a nutshell, Nikola is still a ‘prove me’ stock, which speaks to why we are watching this from the sidelines with a neutral rating until we can get more confidence in the EV and hydrogen fuel cell execution story over the next 12 to 18 months.” Tomi Kilgore contriubuted to this report"}]}