{"article": [{"url": "https://www.marketwatch.com/story/the-real-estate-industry-may-finally-be-abandoning-master-bedrooms-after-years-of-discussion-2020-08-05", "published": 1596888260.0, "headline": "Real-estate reckoning on 'master bedrooms' as a racist term took place after years of discussion - yet many home builders dropped the term years ago", "body": "In the aftermath of the Black Lives Matter protests earlier this summer, there is also a reckoning about product names and even the etymology of the language used in certain industries. The real-estate industry has come to a slow decision that took years in the making to stop using the word \"master.\" The decision came as other industries re-evaluated their use of language in a racial context. GitHub, a Microsoft-owned company MSFT, +2.48%  that hosts a platform for software development, announced in July that it would no longer use the terms \"master\" and \"slave\" to describe versions of projects. In the photography world, Canon CAJFF, -3.40%  also said it would eliminate the terms \"master\" and \"slave\" to describe modes on cameras and other devices. But the movement to abandon the \"master bedroom\" is not a new one. Behind the scenes, some major players in the real-estate industry have been skipping the term for years now. Home builders, in particular, have stopped using the terminology. PulteGroup PHM, +0.02%  has been using the phrase \"owner's suite\" instead for several years. Lennar Corp. LEN, +0.07%  recently chose to standardize \"owner's suite\" across its markets. Internally, the National Association of Home Builders has altered its survey language to use the phrase \"primary bedroom,\" a spokeswoman told MarketWatch. \"We have been hearing that members are making the change to use other descriptions such as primary bedroom or primary suite,\" she said. But it took weeks of nationwide protests sparked by the police killings of Black people in police custody and by the police across the U.S. for the Houston Association of Realtors to announce in late June that it would no longer use the word \"master\" to describe the largest bedroom and bathroom in a home because some of its members viewed the term as racist. Instead, the Realtor group is opting to use the word \"primary\" on the multiple listing service platform that real-estate agents use to search for available properties. In Chicago, local brokerage @properties also informed its employees that same month that it would stop using the term \"master\" to describe bedrooms and bathrooms on its website and in marketing materials. The brokerage's agents, who are independent contractors, aren't banned from using the word, the company noted. \"This is one small change we can make that seems easy and obvious. What is most important is not the origin of the term 'master bedroom,' but rather the fact that it is offensive to some on the basis of race and sex,\" the company said.Many have soured on the 'master' bedroom - not always because of race To many, the phrase \"master bedroom\" is associated with slavery and evokes imagery of violence against people of color. \"It's a repetitive reminder of slavery and plantations,\" Donnell Williams, president of the National Association of Real Estate Brokers, said. \"I don't feel that it's proper, and I'm glad someone brought it up.\" The origins of the phrase do not appear to come from the era of slavery. In fact, the term was first used in 1925, according to Merriam-Webster. Real-estate brokerage Trelora meanwhile cites the earliest known reference to a master bedroom as appearing in a 1926 Sears SHLDQ, -3.08%  advertisement for a pre-fabricated home. Back in 1995, under the Clinton administration, the U.S. Department of Housing and Urban Development ruled that use of the term \"master bedroom\" was not considered discriminatory under the Fair Housing Act. And some people's objections to the phrase don't stem from concerns about its racial implications. One definition of the word master is a male head of household, according to Merriam-Webster. \"Based on the discussion that took place, more members viewed the terms as sexist than racist, although some did view them as racist,\" the Houston Association of Realtors noted in discussion of the name change. \"Others didn't personally view them as sexist or racist but believed we should change the terms for anyone else who might find them objectionable. The consensus was that Primary describes the rooms equally as well as Master while avoiding any possible misperceptions.\"Broad support for a new term has yet to materialize A survey of 300 real-estate agents conducted by HomeLight found that roughly 26% supported replacing the word master, and only 8% of agents reported having buyers or sellers expressing discomfort with the term. Multiple factors will make the shift away from the \"master\" bedroom and bathroom difficult. For starters, most multiple listing services nationwide still use that term. These platforms store data about different properties and are used to generate information about homes listed for sale. There is not one national MLS, though - there are over 800 of them nationwide, according to the National Association of Realtors. \"You have to think about the MLS service in any market, because they have to standardize the terminology,\" said Jeff Cohn, president and CEO of Cohn Marketing, a Denver-based marketing agency that works with real-estate brokerages among other clients. “ 'This needs to be looked at from a national perspective from an organization like National Association of Realtors.' ” - Jeff Cohn, president and CEO of Cohn Marketing Individual brokerages will find it difficult to adopt new terminology if the MLS in their area is still using the old term. Some argue that for broader change to occur it will take the involvement of major national industry leaders. \"This needs to be looked at from a national perspective from an organization like National Association of Realtors,\" Cohn said. \"If they decide, 'Yes, that's where we want to go as an industry,' that's where you'll see real change because it's going to be it's not going to be haphazard.\" Cohn also said major influencers, particularly the home improvement and design channel HGTV, will play a role in this cultural reset. \"If you start seeing them using the new terminology, I think many others would follow,\" he said. The National Association of Realtors \"has no objection to the use of other terminology if consensus evolves that the word has taken on new meaning,\" the organization's president Vince Malta said in an emailed statement. Jane Latman, president of HGTV DISCA, -2.32%  , told MarketWatch in an email that the network continues to have discussions around the language it uses. \"Retrofitting hundreds of hours of shows that are already shot and delivered is not always feasible, but we will be more thoughtful moving forward and have brought up this issue to our production partners,\" Latman said. \"We are committed to future change and want to use words that are more descriptive and inclusive - like primary or main bedroom instead of master bedroom.\"Others argue that the real-estate industry has more pressing issues to consider As discussion about the phrase \"master bedroom\" continues, some insist that the real-estate industry has more important changes it could tackle in the name of social justice. \"The truth of the matter is there's opportunity for improvement far beyond marketing terminology in the industry,\" said Drew Uher, CEO of HomeLight. \"There are much larger issues that still need to be addressed - from the ramifications of redlining and steering, wealth inequality, access to down payment funds, and diversity in the industry across agents, brokerages, and Realtor boards - that would drive lasting change and move us towards equality.\" The homeownership rate among Black Americans has always lagged that of white Americans, and last year it fell to the lowest level in decades. And in the current context of the coronavirus pandemic, Black and Hispanic Americans are disproportionately struggling to afford their monthly housing payments. \"There needs to be an African American homeownership program,\" Williams said, pointing to the Section 184 Indian Home Loan Guarantee Program designed to boost homeownership among Native Americans as a blueprint."}]}