{"article": [{"url": "https://www.marketwatch.com/story/how-an-algorithm-to-streamline-exam-grades-is-a-fail-for-the-u-k-government-11597745505", "published": 1597844900.0, "headline": "How an algorithm to streamline exam grades is a failure for the U.K. government", "body": "High school leavers students march from Parliament Square to the Department of Education to protest the downgrading of examination results. The U.K. government has ditched the system it used to grade students whose examinations were canceled by the coronavirus pandemic. The closure of schools around the world meant countries had to find a way to assess students who couldn’t sit the usual end-of-year exams. England’s qualifications regulator Ofqual used an algorithm to combine teachers’ predicted grades for high school leavers with the historic performance of schools. It aimed to ensure consistency between year groups and avoid overinflated grades, but it was met with criticism after 39.1% of English students’ predicted grades were lowered, meaning many missed the grades they needed to secure places at university. Read: More than 1 in 5 college students won’t be enrolling in college this fall On Monday, Ofqual and the education secretary Gavin Williamson apologized for upset caused by the approach, and said students would now be awarded teachers’ predicted grades instead. Days earlier, Williamson had said there would be “no change” to the government’s approach. “We now believe it is better to offer young people and parents certainty by moving to teacher-assessed grades,” Williamson said on Monday. “I am sorry for the distress this has caused young people and their parents but hope this announcement will now provide the certainty and reassurance they deserve,” he added. The Scottish government had made a similar reversal a week earlier, after significant backlash against its own grading algorithm. Williamson has faced calls to resign over the issue but when asked if he would do so in an interview round on Tuesday morning he repeatedly avoided answering. The opposition Labour party’s leader Sir Keir Starmer did not call on Williamson to resign but has described the affair as a “screeching U-turn.” iframe.twitter-tweet { width: 100% !important; } “Incompetence has become this Government’s watchword,” Starmer said. Read: Should schools reopen amid the coronavirus outbreak? The downside of keeping kids home is pretty severe, Goldman says Labour had urged the government to drop its approach and allow teacher-assigned grades to stand. “The injustice and chaos surrounding A-level and GCSE results must come to an end,” said Kate Green, Labour’s education spokesperson. “The Government must now allow young people to use the grades their teachers predicted,” she said. But Williamson and Prime Minister Boris Johnson were also pushed by lawmakers from their own Conservative Party, who argued it was unfair for students to have grades lowered by a computer program, for exams they didn’t take. “I am pressing the government to take further action to remedy the situation for all those who have been affected,” Conservative lawmaker Laurence Robertson said on Twitter TWTR, -0.23%. iframe.twitter-tweet { width: 100% !important; } Younger students in England will receive their GCSE exam results on Thursday and will breathe a sigh of relief, as the policy change applies to both A-levels and GCSEs. Opinion: School closures force many Americans to choose between their children’s education and earning a paycheck Their results will now reflect teachers’ predicted grades, not those based on the computer algorithm, which were expected to cause more upset than the A-level results. One student who was set to be the first from his school to attend the University of Cambridge had been predicted four A* (similar to A+) grades, but was rejected after the government’s system awarded him one A* and three As. Mithushan Thiagarajah said on the BBC’s “Newsnight”: “I knew I could get those grades if I actually did the exams.” He was one of many who missed out on conditional university offers they had expected to meet."}]}