{"article": [{"url": "https://www.marketwatch.com/story/former-republican-and-democratic-epa-bosses-call-for-agency-reset-after-election-2020-08-12", "published": 1597247000.0, "headline": "Former Republican and Democratic EPA bosses call for agency reset after election", "body": "Six former Environmental Protection Agency chiefs are calling for an agency reset after President Donald Trump’s regulation-chopping, industry-minded first term, backing a detailed plan by former EPA staffers that ranges from renouncing political influence in regulation to boosting climate-friendly electric vehicles. Most living former EPA heads joined in Wednesday’s appeal, with Trump’s first EPA chief, Scott Pruitt, being the notable exception. The group — William Reilly, Lee Thomas, Carol Browner, Christine Todd Whitman, Lisa Jackson and Gina McCarthy — served under Republican and Democratic presidents. The Environmental Protection Network, a bipartisan group of more than 500 former EPA senior managers and employees, crafted the hundreds of pages of recommendations for a change of course at the agency. The group said the road map was meant to guide whatever administration the Nov. 3 presidential election puts in place, although many of the proposals are implicitly or explicitly critical of Trump EPA actions. The former EPA heads’ accompanying statement did not mention Trump but said they were “concerned about the current state of affairs at EPA.” Read:Trump signs plan to spend $3 billion a year on national parks and public land during a 2020 crammed with EPA rollbacks EPA spokesman James Hewitt responded Wednesday, saying EPA Administrator Andrew Wheeler “is proud of our record addressing environmental problems impacting Americans.” He cited the current EPA’s work on Superfund sites, lead contamination and air. Wheeler “won’t be taking ‘reset’ advice from administrators who ignored the Flint lead crisis, botched the Gold King Mine response, and encouraged New Yorkers to breath contaminated air at Ground Zero,” Hewitt said in an email, referencing the drinking water contamination in Flint, Michigan, and a waste water spill in Colorado. Some of the reset recommendations were aimed at the Trump era, such as minimizing industry and political influence on science-based decisions in regulatory actions, combating climate change and cutting air pollution with electric vehicles, and others. The proposals are in line with critics’ complaints about Trump and with many of Democratic presidential rival Joe Biden’s proposals. Read:VP nominee Kamala Harris has a particular climate-change agenda: environmental justice The EPA under Wheeler, a former coal lobbyist, has been an avid agent of Trump’s drive to cut regulations he sees as unnecessarily burdensome to business, including the coal, gas and oil industries. The administration says it is rolling back rules without increasing risk to the public health and environment. Nationally, many public health officials, environmental groups, Democratic lawmakers, scientists and others disagree, saying Trump’s regulation-cutting, combined with sharp drops in many areas of enforcement against polluters, is increasing air and water pollutants and industrial toxins and jeopardizing the health of Americans. When it comes to the EPA’s mandate of protecting peoples’ health and the environment, “the last few years, the agency has been derailed from that mission,” Browner, who led the agency in the Clinton administration, said in a statement. Saying environmental and health protections were essential to economic growth, Browner called the reset recommendations “reaffirmations of our environmental laws, and return to where the Clean Air Act and Clean Water Act are respected and enforced and where policy is science-based and aimed at protecting our health and environment.” Related:Trump’s EPA to adopt global climate standards for aviation — that’s an outdated model, say environmental groups The ex-EPA staffers’ recommendations range from broad mandates — like increasing the agency’s actions across the board on the disproportionate exposure that Black, Hispanic and other minority communities and low-income areas have to all kinds of dangerous pollutants — to the specific, like which measures from Trump’s first term to focus on in the first 100 days of a new term. They also urge increased funding. Specific public health and environmental rollbacks from Trump’s first term targeted for proposed annihilation or rewriting by the ex-EPA employees include a pending Trump regulation-easing measure for climate-damaging methane from oil and gas production that the EPA is expected to announce in the coming days. Some of the many other Trump EPA measures on the “out” list in the reset proposal: a “transparency” rule supported by industry that limits what public health studies the agency can use in making regulations; a Trump-driven move to ease vehicle mileage and emission standards; and a heavily voluntary plan for cutting fossil fuel emissions by power plants that replaced the Obama administration’s broad plan for making the nation’s power sector more climate friendly. Another recommendation: Cultivate “a more open and respectful exchange between reporters and EPA.” Wednesday’s recommendations at times make the job of changing course at the EPA seem formidable. The agency’s air office, for instance, they say, “has a massive to-do list, a huge amount of pressure from outside groups, a demoralized and diminished career staff to tend to, and an incredible sense of urgency.” Michelle Roos, executive director of the ex-employees group, said more than 100 former EPA staffers prepared the action plan over 10 months. Roos said the changes would “better protect the air we breathe and the water we drink” and do more to confront climate change and the heightened pollutant risks of minority and low-income communities."}]}