{"article": [{"url": "https://www.marketwatch.com/story/can-the-federal-government-stop-the-nfl-from-playing-plus-other-burning-questions-about-the-nfls-return-2020-06-19", "published": 1592731460.0, "headline": "Can the federal government block the NFL from playing its season? And other burning questions about the NFLâ\u0080\u0099s bid to return", "body": "The NFL is planning to play its full 2020-21 season, beginning with the season opener between the Super Bowl champion Kansas City Chiefs and the Houston Texans on Sept. 10. So it surprised many people earlier this week when Dr. Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases, said on CNN that â\u0080\u009cfootball may not happen this yearâ\u0080\u009d unless players are essentially in a bubble to protect both team members and the communities they live and play in. While no official statements have been made about the presence of fans at games, Foxâ\u0080\u0099s NFL insider Jay Glazer said the league has given â\u0080\u009cevery indicationâ\u0080\u009d it plans on playing the entire season in front of fans â\u0080\u0094 even though the country is still dealing with the initial wave of the coronavirus pandemic, and it has long been feared that a second wave will emerge in the autumn. The NFL began allowing some coaches and staff to return to team facilities this month with certain safety precautions in place. The league previously ordered a shutdown of all facilities due to the coronavirus. With the start of NFL training camps less than a month away, here are the burning questions about the NFLâ\u0080\u0099s return: Will the NFL implement a bubble as the NBA did? The NBAâ\u0080\u0099s â\u0080\u009cbubbleâ\u0080\u009d at the ESPN Wide World of Sports Complex at Disneyâ\u0080\u0099s DIS, +1.53% Â resort complex in central Florida will include 22 teams with eight games to conclude the regular season suspended on March 11 and then playoffs â\u0080\u0094 and some oddly specific rules for how players should behave within the bubble. But unlike the NBA, the NFL has to play a full seasonâ\u0080\u0099s worth of games, and Dr. Allen Sills, chief medical officer of the NFL, has stated that the league will not construct a bubble. â\u0080\u009cWe do not feel itâ\u0080\u0099s practical or appropriate to construct a bubble,â\u0080\u009d Sills told Tom Pelissero of the NFL Network. â\u0080\u009cAnyone who tests positive will be isolated until medically appropriate to return.â\u0080\u009d Sillsâ\u0080\u0099s comments came shortly after Fauci said the following on CNN: â\u0080\u009cUnless players are essentially in a bubble â\u0080\u0094 insulated from the community and they are tested nearly every day â\u0080\u0094 it would be very hard to see how football is able to be played this fall. If there is a second wave, which is certainly a possibility and which would be complicated by the predictable flu season, football may not happen this year.â\u0080\u009d President Trump tweeted that Fauci â\u0080\u009chas nothing to do with NFL Football.â\u0080\u009d Could Fauci or the federal government stop the NFL from playing? Even though Fauciâ\u0080\u0099s recent comments show he would prefer the NFL construct a bubble system like the NBA, it is not a mandate. Neither Fauci nor the president, or the federal government, has the ability to force the NFL to construct a bubble or to cancel or suspend its season. A representative of the Centers for Disease Control and Prevention told MarketWatch that the CDC and the government will not be involved in the NFLâ\u0080\u0099s 2020 season in any way; only local governments hold authority to do so. â\u0080\u009cCDC would not be involved in this. It could be an issue that the state and local public health departments work with the government in their respective locations to decide, but it would not involve us.â\u0080\u009d How will the league protect players off the field? The NFL has taken steps this offseason to limit in-person events to slow virus transmission among players, coaching staffs and other personnel. The 2020 NFL draft in April was conducted digitally for the first time in league history, in-person minicamps were canceled in favor of online variants, and staff at team facilities were cut to essential personnel only. According to the NFL Network, the league will rely on a â\u0080\u009crobustâ\u0080\u009d contact-tracing system. While most details of that system are still unknown, Sills, the leagueâ\u0080\u0099s lead medical officer, said, â\u0080\u009canyone who tests positive will be isolated until medically appropriate to return.â\u0080\u009d Multiple NFL players have already tested positive for COVID-19, including, this week, Dallas Cowboys running back Ezekiel Elliott. Key Words:Dallas Cowboys star running back Ezekiel Elliott tests positive for COVID-19 and has a one-word question about how the news broke How will the league protect players on the field? One interesting aspect of the NFLâ\u0080\u0099s resuming play will be the equipment used by players. Because football features close personal contact on every play, the equipment used this season could be highly scrutinized. One piece of equipment that could be altered in some way this season is the helmet. Thom Mayer, the NFL Players Association medical director, said the league is looking into new face masks. â\u0080\u009cYes, itâ\u0080\u0099s a possibility,â\u0080\u009d Mayer told ESPN. â\u0080\u009cBack in early March, I suggested ways to handle the helmets and the facemasks. ... [T]he leagueâ\u0080\u0099s bioengineers are testing prototypes with Oakley. Theyâ\u0080\u0099re looking at every issue, including when masks fog up.â\u0080\u009d Oakley, an NFL sponsor and a unit of the Italian conglomerate Luxottica Group SpA, whose parent is EssilorLuxottica EL, +0.45%, has carried out design work in the past on glasses that donâ\u0080\u0099t fog up for the U.S. military, according to Mayer. The sports media network Stadium created a conceptual image of what an NFL helmet might look like this season: iframe.twitter-tweet { width: 100% !important; } What if NFL cities and their states have adopted different standards for protecting public health? The federal government and the CDC will not be able to control the actions of the NFL. But what about local and state governments? Because the NFL is not implementing a bubble system in a single locale, but electing to have teams travel to the various stadiums throughout the U.S., the league may run into situations in which different states have different rules surrounding the pandemic. For example, California, home to four NFL teams, has a mandatory mask order, while Texas, home to two NFL teams, does not. States have individually set standards on how many people can attend large gatherings, as do some cities. Dr. Glenn Copeland, medical adviser for several sports franchises and to QuestCap, a company working with sports leagues to bring sports back, said the NFL needs to â\u0080\u009ccreate its own rules.â\u0080\u009d Copeland told MarketWatch that a singular list of rules for all teams in the league to abide by is the only way to maintain consistency. Whether itâ\u0080\u0099s daily testing, mask wearing at all times at a team facility or new mandatory equipment, rules must, Copeland said, be uniform and strict. â\u0080\u009cProtocols are going to have to be stringent.â\u0080\u009d Itâ\u0080\u0099s undetermined at this stage whether some states will block the playing of NFL games, even if the league has does come up with rules for all teams. The U.S. Open had to get approval from New York Gov. Andrew Cuomo to conduct the tennis tournament, without fans, starting in late August. Asked for comment, Brian McCarthy, vice president of communications for the NFL, told MarketWatch that the league is â\u0080\u009cprepared to make adjustments as necessary.â\u0080\u009d â\u0080\u009cThereâ\u0080\u0099s three months from tonight until the first NFL game, so we know many things will change between now and then. Itâ\u0080\u0099s hard to predict today what things will look like then. Look at where we were three months ago and where we are today.â\u0080\u009d"}]}