{"article": [{"url": "https://www.marketwatch.com/story/why-some-say-shaming-college-students-is-unfair-and-counterproductive-to-preventing-covid-outbreaks-11598565539", "published": 1598782460.0, "headline": "Colleges have threatened a return to remote instruction and suspended students over COVID-19 safety violations", "body": "Students gathering on the Syracuse University campus in August. (Walter Freeman via AP) Since Celeste Coughlin returned to Bloomington, Ind. a few weeks ago for her senior year at Indiana University, she’s been taking whatever steps she can to keep herself safe from the coronavirus pandemic. Coughlin stocked up on masks and sanitizing products. She’s sketched out a plan to try to get tested for COVID-19 every week. She dropped a class important to her degree progress to ensure she’d only be taking courses remotely. If it were up to Coughlin, the school wouldn’t have offered any face-to-face undergraduate classes except to students whose citizenship or residential status depended on attending class in person. “There is clear evidence about the dangers of returning to campus and welcoming students back,” she said, pointing to prominent outbreaks at other schools. So seeing school officials adopt what she described as a paternalistic tone toward students after photos of off-campus parties circulated widely on social media was just one of the ways the school’s approach to the pandemic has “thoroughly disappointed” her, Coughlin said. The school’s provost, Lauren Robel, wrote in a communication to students: “if enough of you don’t follow the rules, game over. We’ll have to do what other universities have done and go all online.” “We are well on our way to seeing some very serious consequences in our community as a result of their lack of leadership,” Coughlin said of school officials. “It’s hard to put the blame on the university because they do such a good job of putting responsibility on students.” So far, IU hasn’t seen the level of positive cases that sent students at other schools back to remote instruction or even home earlier in August — after testing more than 39,000 students upon arrival to campus, the school had a positivity rate of 0.91 percent, as of the week of Aug. 24. Chuck Carney, an IU spokesman, wrote in an emailed statement that officials “wouldn’t want students to think that it’s only they who are responsible for conducting themselves in a way to keep things on track.” Still, he said the off-campus parties, “violated state, county, and city COVID-19 health regulations. At that point, we needed to emphasize to the minority of students who were potentially putting our community in danger of viral spread that we all had to follow these guidelines.” Colleges are telegraphing to students that their behavior is key to preventing outbreaks IU’s message in response to the parties is one of many that have been circulated by college officials across the country over the past few weeks telegraphing to students that their behavior is key to preventing outbreaks on campus. But students are making their decisions in an environment established and controlled by the institutions, experts have noted. Though individuals of course have a role to play in keeping themselves and their communities safe, universities, facing revenue shortfalls and political pressure, invited students back assuring them that they were taking steps to prevent the spread of COVID. What’s more, adopting a tone of blame towards students during this period could actually make it more difficult to prevent an outbreak on campus, some experts say. “It’s both unfair and it’s also incredibly counterproductive,” Joshua Salomon , the director of the Prevention Policy Modeling Lab at Stanford University, said of universities pointing to student behavior amid COVID concerns. “If students are afraid that they’re going to get punished, then it’s going to make them less likely to disclose that they have been at risk and it’s going to make the contact tracing much harder.” The messages come after months of preparation by colleges to shift responsibility for COVID outbreaks from themselves to students. Many schools that have brought students back to campus have seen an escalation in cases, and some have even switched to remote instruction. The prevalence in cases followed warnings from scientists, faculty and students on many campuses about the risks of reopening. Now that schools are bringing students back to campus, blaming student behavior for a rise in COVID outbreaks doesn’t square with the way schools have historically approached socializing and its relationship to the experience they’re selling, said Holden Thorp, the former chancellor of the University of North Carolina Chapel Hill. Colleges typically celebrate the idea of campus as a gathering place for studying, researching or just chatting on the quad, said Thorp, who also served as the provost at Washington University in St. Louis. In addition, they often let other types of social behavior on campuses go, even when it can have unfortunate consequences, he said. “ ‘It’s very hard to say we’re suspending you for this now, but then next year we’re going to run a picture of a student section at a football game where the students are all celebrating.’ ” — Holden Thorp, former chancellor of the University of North Carolina Chapel Hill “It’s very hard to say we’re suspending you for this now, but then next year we’re going to run a picture of a student section at a football game where the students are all celebrating and say this is why it’s so great to come to our university,” said Thorp, who is now the editor in chief of the Science family of journals. “That just doesn’t go together.”Officials decry student partying as selfish, reckless At Syracuse University, J. Michael Haynie, the school’s vice chancellor of strategic initiatives and innovation, called the decision by a group of first-year students to gather on the school’s quad “selfish and unsettling,” in a communication sent this month, and said it could jeopardize “the very thing that so many of you claim to want from Syracuse University — that is, a chance at a residential college experience.” In a virtual press conference with local media, Haynie said that he believes that “our students can rise and our students can elevate to the challenge of this novel circumstance.” “Was I disappointed and frustrated by what happened last week?” Haynie said, referring to the gathering on the quad. “Absolutely yes. Did I communicate my disappointment to the group involved very directly and in no uncertain terms? Yes I did. But does it mean that I have any less confidence today in my belief that the overwhelming majority of Syracuse University students are committed to doing the right thing by their classmates by their professors and by this community? Absolutely no, it does not mean that at all.” In a letter to students this month, Melissa Shivers, Ohio State University’s vice president for student life, warned students to “remember that this is all about more than the individual. We have one shot at this – responding to what so many of you asked for: an on campus semester at Ohio State,” adding that, “for some, this is where they find housing safety and food security. Don’t make intentional choices now that inherently challenge the future for so many members of our Buckeye family.” Officials at OSU issued about 225 interim suspensions for off-campus parties and gatherings held between August 19 and August 23, according to Ben Johnson, a spokesman. Roughly 120 of those suspensions were lifted after students were able to show they did not attend or host an unsafe gathering, Johnson wrote in an email. From ‘cautiously optimistic’ to ‘it wasn’t going to last’ At Central Michigan University, officials have told students “we expect you to take responsibility for your actions,” threatening fines and suspensions for students who attend large gatherings, calling student attendance at off campus parties, “reckless, irresponsible behavior.” For a while, Jessa Baumdraher was “cautiously optimistic” about the idea of coming back to campus, given that she’s always loved being a CMU student. But once she returned to campus in the fall for classes she realized pretty quickly that “it wasn’t going to last.” She’s been taking her own precautions, like limiting even small gatherings with friends and taking her courses online. Jessa Baumdraher was “cautiously optimistic” about the idea of coming back to campus “It is up to the students, according to the university, it’s up to all of us,” said Baumdraher, a third-year majoring in political science as well as public and nonprofit administration at CMU. “But the students are being expected to maintain six feet of distance and have smaller gatherings, which at the collegiate level just really isn’t very realistic.” Heather Smith, a CMU spokesperson, wrote in an email that “there is certainly shared responsibility to protect the health and safety of our campus community — being on campus this semester carries new responsibilities for everyone.” The school has been preparing for months to welcome students safely back to campus and so far has approximately 100 positive cases out of 15,000 students, tied mostly to three large houses off campus. In response to those new cases, the school has taken steps, including directing all Greek life organizations to suspend in-person activities and fining and even suspending individuals who host and attend large gatherings, Smith wrote. “Two weeks into the semester, I can say that most of our students are doing the right thing because they want to ensure we have a successful semester,” she wrote. Though school officials have been in regular communication with students, Baumdraher said she’s concerned that students haven’t felt “safe or informed,” noting that she finds the most up-to-date data on local coronavirus cases by checking a state government website. She feels the best plan for this fall would have been to offer courses largely remotely with the exception of classes that needed to be in-person — like labs or performance — and are required for students’ majors. University leaders are weighing financial, political concerns A variety of factors figured into whether colleges decided to bring students back to campus this fall. Finances were certainly key, as colleges whose business models were already strained, found themselves squeezed even further by the pandemic, making it difficult to risk forgoing revenue by offering another remote-only semester. But politics also likely also played a role, Thorp said. At public colleges, officials are often working within systems that are politically governed, he noted. Private schools typically have boards of trustees filled with members who are successful in the private sector and “those folks have their own views on all of this,” Thorp said. “Since unfortunately the pandemic and our response to it is a political issue, you can’t ignore the political overlay that’s on this whole thing,” he said. In the South and the Midwest, schools have invited students back, in part because “there is this political pressure to open colleges and universities, in my view, prematurely,” he added. Our political and cultural attitudes are also limiting the tools available to university officials to influence students’ behavior, said Brent Roberts, the director of the Center for Social and Behavioral Science at the University of Illinois at Urbana-Champaign. Social science research indicates that the college student age group is not “perfectly well-suited to this enterprise,” of strictly following rules set forth by officials, Roberts said. That means, “we should do everything we can to make this situation easier on them,” he added. Many colleges have worked to design a system that will minimize the role of students’ behavior in protecting the campus from COVID. Some, for example, are requiring that all large lecture courses be held online, Roberts said. But colleges can’t do much about students’ behavior off-campus. The idea of shutting down Greek life or bars for the semester is anathema to the sense of autonomy and individuality that Americans hold so dear, he said. And preventing the spread of a pandemic likely requires a collective response that would infringe on that sense of autonomy. Colleges may face obstacles to closing these kinds of gathering places, but what they can do is take advantage of the research available at their own institutions to better steer students’ behavior. “We’re publishing these papers, we know what happens — use the information to your benefit so you can actually design a program that’s better,” he said. “Going at it by just punishing students is obviously a very simple violation of what we know about trying to shape behavior. You should at least have a package of rewards and punishments.” More broadly, institutions’ and governing boards’ policies have created the environment in which students are making their individual choices, said Louise Seamster, an assistant professor of sociology and criminology at the University of Iowa. In one of her courses, she spends the entire semester teaching students how to analyze policies at the individual, organizational and institutional level — for example, asking them to evaluate the role of pharmaceutical companies in opioid addiction, which is often portrayed as a personal choice. Colleges’ approach to COVID offers a “perfect example” that she can use this semester to help her students understand these concepts, Seamster said. Often we focus on individuals’ choices, like the decision whether to attend a party, and individual outcomes, like whether you contract COVID or face a punishment. “But people’s behavior is coordinated through organizations, like universities,” Seamster said, and “university behavior is coordinated by institutional policies.” “We have had a failure at the institutional and organizational level at most universities, with a few notable exceptions,” she said. “What’s left now is students being blamed.”"}]}