{"article": [{"url": "https://www.marketwatch.com/story/i-want-to-retire-to-a-rural-location-with-four-seasons-that-gets-me-out-of-new-york-state-so-where-should-i-go-2020-06-19", "published": 1594302440.0, "headline": "I want to get out of New York state and retire to a rural location with four seasons â\u0080\u0094 where should I go?", "body": "Dear MarketWatch, I currently live in upstate New York (Saratoga County). I will retire from my state government job with an $80,000 public pension. If I stay, I wonâ\u0080\u0099t have to pay state income taxes on my pension, Social Security and the first $20,000 annually from my deferred compensation. Despite all of that, all the other taxes in New York make retiring here seem very expensive. Iâ\u0080\u0099m looking for a rural retirement location with four seasons and where I can have a hobby farm. I like living less than 45 minutes from a town with a vibrant downtown, golf, fishing, hiking, hunting, and skiing. The location must be affordable, including housing, as I will have a mortgage and also want good health-care options. To add to the wish list, Iâ\u0080\u0099d love to be closer to my family who are in Fort Collins, Colo., and Mesa, Ariz.), or least be within 90 minutes of an airport so I can visit often. Any suggestions would be most appreciated! Sandy Sandy, Letâ\u0080\u0099s look out West for that four-season retirement spot and also get you closer to family. Your $80,000 pension already makes you better off than many retirees, and thatâ\u0080\u0099s before any investment or other income, so you have plenty of choices. Natural beauty and amenities often come with a price premium, of course. Iâ\u0080\u0099ll suggest three smaller cities and leave you to scout out the nearby rural options and the hobby farm possibilities. The cost of farmland varies widely across the U.S., depending on local conditions and what the land is used for, but on the whole, itâ\u0080\u0099s cheapest in the mountain states region, which includes Wyoming and Montana. Iâ\u0080\u0099m assuming you have worked out the time commitment and financial implications of having such a farm and already know that hobby farms donâ\u0080\u0099t qualify for the tax breaks that small farms do. As always, spend some time in any place youâ\u0080\u0099re considering and make sure to experience it in all kinds of weather. Sometimes no matter how perfect a place may sound on paper, itâ\u0080\u0099s the intangibles that capture your heart -- or turn you off.Cheyenne, Wyoming Wyoming, as you may know, has no state income tax. For someone who wants out of New York state taxes, thatâ\u0080\u0099s a big plus. Itâ\u0080\u0099s also 45 minutes from your family in Fort Collins, so that eliminates one set of airline tickets without, I hope, being too close. Youâ\u0080\u0099re definitely in cowboy country here. In Cheyenne, the state capital, youâ\u0080\u0099ll find 65,000 people, one of the biggest hospitals in the state, several golf courses â\u0080\u0094 and the worldâ\u0080\u0099s largest outdoor rodeo festival in Cheyenne Frontier Days. Laramie, home to the University of Wyoming and just over half the size of Cheyenne, is an hour away. Donâ\u0080\u0099t worry about hunting opportunities. Your closest option for downhill skiing, Snowy Range Ski Area, is 90 minutes away, on the other side of Laramie. The downside: the cost of housing is above the national median, even though the overall cost of living is just below the national average. Of course, thatâ\u0080\u0099s for Cheyenne, and youâ\u0080\u0099re looking for something more rural but with land. You can see whatâ\u0080\u0099s on the market right now across Laramie County on Realtor.com (owned, as is MarketWatch, by News Corp.) If the Laramie area (in Albany County) is more to your liking, hereâ\u0080\u0099s what your money buys there.Pocatello, Idaho The tourism office calls this town of 57,000, located in the southeast corner of the state, an unassuming mountain town, but itâ\u0080\u0099s livelier than you might expect given Idaho State University and its 12,000 students. Youâ\u0080\u0099ll find golf, fishing in the Snake River, skiing just 30 minutes away (only $43 for a lift ticket!) and plenty of hiking trails. You didnâ\u0080\u0099t mention cycling, but the website Singletracks rates Pocatello No. 3 among the best affordable mountain bike towns . To top off all the outdoor opportunities, youâ\u0080\u0099d be sandwiched between two vastly different national parks â\u0080\u0094- Crater of the Moon National Monument and Grand Teton National Park. Both housing and the cost of living are below the national average. Itâ\u0080\u0099s also one of the choices that comes up using MarketWatchâ\u0080\u0099s â\u0080\u009cwhere should I retire?â\u0080\u009d tool. (Coeur dâ\u0080\u0099Alene, at the other end of the state, does too, but itâ\u0080\u0099s pricier.) Hereâ\u0080\u0099s whatâ\u0080\u0099s on the market now in Pocatello and Bannock County. Yes, Idaho has a state income tax but its â\u0080\u009ctax freedom dayâ\u0080\u009d, as calculated by the National Tax Foundation and taking all federal, state and local taxes into account, actually comes a few days earlier than Wyomingâ\u0080\u0099s. Thatâ\u0080\u0099s a good reminder that income taxes arenâ\u0080\u0099t the only tax to consider. One downside is the local airportâ\u0080\u0099s limited service. But the airport in Idaho Falls (population 63,000) just an hour away has more options. Thatâ\u0080\u0099s also your closest â\u0080\u009cbig city,â\u0080\u009d though youâ\u0080\u0099ll find some of the stateâ\u0080\u0099s largest hospitals in both Pocatello and Idaho Falls. Both Salt Lake City (with its major airport) as well as Jackson Hole and the Tetons are about 2Â½ hours away. Bozeman, Montana A reader recently flagged Livingston, a town of 7,000 on the way to Yellowstone National Park, as a retirement destination. The New York Times has called it â\u0080\u009cthe literary town on the Yellowstone Riverâ\u0080\u009d. Another writer described it as having â\u0080\u009ca blue-collar heart and a bohemian soul.â\u0080\u009d The big city, just 30 minutes away, would be fast-growing Bozeman, now about 51,000 people and home to Montana State with almost 17,000 students. Among the many reasons I like college towns is that state universities often let retirees audit classes for free. Thatâ\u0080\u0099s the case here. Montana checks the box on low taxes (including no sales tax) â\u0080\u0094 its â\u0080\u009ctax freedom dayâ\u0080\u009d is April 6, the same as Idahoâ\u0080\u0099s â\u0080\u0094 and Bozeman has a large hospital. The local economy has been strong, with unemployment below the national average. Unfortunately, housing costs are above average, even within 20 miles of Bozeman. So finding your new home and farm may take some looking. To see whatâ\u0080\u0099s on the market across Gallatin County (home to Bozeman), click here. Outside Bozeman, Mt. courtesy Bozeman CVB In some ways, this is the most rural choice; the nearest really big city â\u0080\u0094 Salt Lake City â\u0080\u0094 is 400 miles. What you do get in exchange is plenty of outdoors. Itâ\u0080\u0099s no coincidence that the big ski resort an hour south of Bozeman is called Big Sky, with one run that goes on for 6 miles. Fishing is big here. Golf courses are plentiful. You can get to Yellowstone National Park in less than two hours. On the way is Livingston as well as the rugged Absaroka-Beartooth Wilderness (nearly 1 million acres, with many peaks above 12,000 feet) and hot springs. With all there is to do, will there be time for a hobby farm? A word of warning: winter is no joke here. Bozeman on average gets more than 5 feet of snow. But thatâ\u0080\u0099s similar to what you now get in Saratoga County. Winter is long, with frost into late May. The flip side is a low-humidity summer. And if you want a break from all that snow, what better time to visit the family in Mesa? Even better, you can catch a non-stop flight from Bozeman Yellowstone International Airport. Readers, where do you think Sandy should go?"}]}