{"article": [{"url": "https://www.marketwatch.com/story/square-enables-retailer-customers-to-offer-on-demand-deliveries-via-courier-2020-06-24", "published": 1593004700.0, "headline": "Square enables retailer customers to offer on-demand deliveries via courier", "body": "Square Inc. will let small businesses offer courier delivery through partners as merchants look for new ways to generate sales in the COVID-19 era. The payments company announced Wednesday that its merchants will be able to offer delivery options on their own websites and then dispatch couriers from third-party services to get those orders to customers. The company is initially partnering with Postmates and has plans to add additional delivery partners. Square SQ, +2.06% will charge a flat fee of $1.50 per order to merchants who use this service, and delivery partners can add their own fees. Square argues that this fee structure is beneficial for merchants that don’t have their own delivery personnel but also don’t want to have to pay fees to food-delivery aggregators that charge for listings. See also: Venmo and Square’s Cash App were going gangbusters before the pandemic — now they’re doing even better Merchants will have the option to pass fees on to buyers or offer custom promotions for delivery orders, Square said, while buyers will be able to track their orders through live maps. Square intends to waive processing costs for on-demand delivery orders through July 8 for up to $50,000 in sales and waive dispatch fees until July 1. Square merchants will be able to facilitate delivery from Postmates and other future partners from within their own websites. The company has been rolling out features to help bricks-and-mortar sellers do more business online as the COVID-19 crisis has altered consumer buying patterns. Square announced in its last earnings letter to shareholders that weekly volume for its Square Online Store was up more than five times in late April from January and February levels, before the company rolled out curbside pickup and local delivery options. Square also disclosed in that letter that since its March launch of curbside pickup and delivery features, sign-ups for Square Online Store were ahead of the company’s usual sign-ups for its point-of-sale offering. Read: Coffee delivery from indie shops is surging amid COVID-19, new data show Shares of Square have more than doubled over the past three months, while the S&P 500 SPX, +0.87% has risen 24%."}]}