{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-death-toll-tops-700000-with-185-million-confirmed-cases-and-us-accounts-for-more-than-a-quarter-2020-08-05", "published": 1596636260.0, "headline": "Coronavirus update: Global death toll tops 700,000 with 18.5 million confirmed cases and U.S. accounts for more than a quarter", "body": "The number of confirmed deaths across the globe from the coronavirus illness COVID-19 climbed above 700,000 on Wednesday, according to data aggregated by Johns Hopkins University, as the case tally climbed above 18.5 million, with the U.S. accounting for 4.77 million of that total, or more than a quarter. The U.S. death toll is now edging toward 157,000 after averaging more than 1,000 a day for nine straight days. The U.S. counted at least 1,348 new deaths on Tuesday and more than 53,000 new cases. Fourteen states are showing rising cases over a 14-day period, according to a New York Times tracker, while 30 states are showing cases to be much the same and 10 are showing cases declining. But 27 states are showing their death tolls rising over the same period. The administration of President Donald Trump is continuing to push for schools across the nation to reopen on time and in person, even as public health experts caution that teachers, parents and children will be put at risk of infection. Andy Slavitt, former acting administrator of the Centers for Medicare and Medicaid Services, told MSNBC on Wednesday that the U.S. should consider throwing every resource at the virus for four weeks to get it under control. “Why not do it now?” he asked, observing that a more complete lockdown early in the pandemic would have put the country on a more healthful course far sooner, but that a broad definition of the term essential worker and an individual-focused view of civil liberties in many states and regions had been detriments. “The ultimate civil liberty is health. It’s a much more important liberty than [whether the country is] asking someone to wear a mask.” Other experts have also argued that the U.S. needs to shut down again and go back to Square 1, gradually reopening while mandating the wearing of face masks, washing hands frequently and social distancing. That would give the country the time to speed up and expand the testing, tracing and isolating that are deemed crucial to containing the spread. On Tuesday, a group of six governors said they were joining forces to purchase millions of coronavirus tests in an effort to reduce the turnaround time that is making their testing efforts all but useless. In some instances, test results are taking two weeks to come back. The six states — Louisiana, Maryland, Massachusetts, Michigan, Ohio and Virginia — are working with the Rockefeller Foundation to expand the use of rapid point-of-care antigen tests in what they called the first interstate testing compact of its kind. “With severe shortages and delays in testing and the federal administration attempting to cut funding for testing, the states are banding together to acquire millions of faster tests to help save lives and slow the spread of COVID-19,” said Gov. Larry Hogan of Maryland, a Republican who is the head of the National Governors Association but hands the association’s reins to New York Gov. Andrew Cuomo on Wednesday. Hogan has been a vocal critic of Trump’s response to the pandemic and recently wrote an attention-grabbing op-ed in the Washington Post on the subject. “We are bringing together this bipartisan, multistate coalition to combine our purchasing power and get rapid testing supplies to our communities as quickly as possible,” said Virginia Gov. Ralph Northam, a Democrat. “The people in our six states want to see action, and we’re delivering.” Elsewhere, Mississippi Gov. Tate Reeves said Tuesday he is signing a statewide order mandating the wearing of face masks in public, following a surge in COVID-19 infections. And in Ohio, Gov. Mike DeWine said school children from kindergarten through 12th grade will be required to wear face masks if and when they return to school. Latest tallies There are now 18.57 million confirmed cases of COVID-19 worldwide, the Johns Hopkins data show. At least 11.2 million people are confirmed to have recovered. Brazil is second to the U.S. with 2.8 million cases and 95,819 deaths. India is third measured by cases at 1.9 million, followed by Russia with 864,948 and South Africa with 521,318. Mexico has 449,961 cases and 48,869 deaths, the third highest diagnosed-case tally in the world. The U.K. has 307,256 cases and 46,295 fatalities, the highest in Europe and fourth highest in the world. China, where the illness was first reported late last year, has 88,206 cases, and 4,676 fatalities.|What’s the latest medical news? Shares of biotech Novavax Inc. NVAX, +0.18% soared Wednesday, after the company said its experimental coronavirus vaccine induced promising immune responses and was generally well-tolerated in healthy adults in the first human study of the shot, the Wall Street Journal reported. Two weeks after taking a second dose, most subjects had high levels of neutralizing antibodies, which are immune-system agents believed to be most effective at fighting the virus, according to results in a paper that Novavax submitted to the preprint server medRxiv, with hopes of publishing it in a peer-reviewed journal. Novavax is aiming to move to a larger study involving 30,000 patients in the fall. Moderna Inc. MRNA, +0.09%, which is developing one of the frontrunning COVID-19 vaccines, reported earnings on Wednesday and said it plans to complete enrollment for the Phase 3 trial for its COVID-19 vaccine candidate in September, MarketWatch’s Jaimy Lee reported. The company said it has already received $400 million in deposits in preparation of the experimental vaccine’s regulatory authorization. Moderna, founded in 2010, is considered a preclinical company because it does not market any approved medical products. “As we pivot to a commercial-stage company, we recognize the need for responsible pricing in the face of the pandemic,” CEO Stephane Bancel said in a news release. Moderna had a loss of $116.5 million, or 31 cents per share, in the second quarter of 2020, compared with a loss of $134.9 million, or 41 cents per share, in the same quarter a year ago. It had revenue of $66.3 million in the quarter, up from $13.1 million in the like quarter in 2019, with the company attributing the increase to COVID-19 funding and unrelated collaboration revenue from AstraZeneca PLC AZN, +1.16% AZN, +0.63%. Separately, Eli Lilly & Co. LLY, +2.20% said the National Institutes of Health plans to study whether several experimental monoclonal antibodies can treat hospitalized COVID-19 patients. The first therapy to be studied in the Phase 3 randomized, controlled trial is Lilly’s LY-CoV555, an antibody that was first detected in a blood sample from a recovered COVID-19 patient. Researchers will evaluate whether the therapy is efficacious in 300 people who have mild or moderate symptoms of COVID-19. Lilly is developing the therapy in partnership with the privately held Abcellera Biologics. Johnson & Johnson JNJ, +1.39% said it will receive more than $1 billion from the U.S. government to manufacture 100 million doses of its investigational COVID-19 vaccine. The vaccine will be provided at a “global not-for-profit basis for emergency pandemic use,” J&J said. The company’s vaccine candidate recently entered the Phase 1/2a clinical trial, which is taking place in Belgium and the U.S. Don’t miss: FDA’s Hahn says agency won’t make regulatory decisions based on preprints or news releasesWhat’s the economy saying? The pace of U.S. private-sector job growth slowed in July, perhaps as a result of the rising coronavirus infection rate, as MarketWatch’s Greg Robb reported. Private-sector employment rose by 167,000 jobs in July, Automatic Data Processing Inc. reported. The gain was well below forecasts from economists surveyed by Econoday, who expected a gain of 1.9 million jobs. Job gains totaled 4.3 million in June and 3.3 million in May after a loss of 19.4 million in April, according to ADP data. Goods producers added only 1,000 jobs last month, down from 496,000 in June. Services producers added 166,000 jobs, the bulk of the job gains in the month but that was way down from 3.8 million in the prior month. The report is consistent with fears that the rebound is running out of steam, economists said. Analysts use the ADP data to get an indication of the Labor Department’s employment monthly report, which will be released Friday and covers government jobs in addition to those in the private sector. “Overall, this report largely confirms that the economy flattened in July after sharp rebounds in May and June,” said T.J. Connelly, head of research at Contingent Macro Research. There was better news from the Institute for Supply Management’s index of nonmanufacturing companies, which edged up to 58.1% last month from 57.1% in June. That topped the 55% forecast of economists polled by MarketWatch. Any number above 50% indicates more companies are expanding. Fifteen of the 18 service industries tracked by ISM grew in July. In a worrisome sign, the improvement did not lead to more companies bringing back workers. The employment gauge slipped to 42.1% from 43.1%. Some companies had to lay off or furlough workers again last month in states such as California where business restrictions were reimposed to slow the latest outbreak of the virus.What are companies saying? Walt Disney Co. DIS, +1.53% was the latest household-name company to report quarterly earnings and showed exactly how the pandemic has battered its parks, film production and cruise businesses, as MarketWatch’s Jeremy Owens and Jon Swartz reported. The company posted a loss of nearly $5 billion. The only segment to show growth was streaming, and Disney is doubling down on that business after it attracted 60 million subscribers since its launch late last year. New Disney Chief Executive Bob Chapek outlined a plan that will leverage Disney+ and attempt to replicate its success. Disney will slightly unclog the studio’s pandemic-paused movie pipeline by premiering its long-delayed “Mulan” live-action feature on Disney+ as a $30 pay-per-view release on Sept. 4 and launch a streaming service overseas. Disney will release the big-budget feature in theaters in countries where facilities are open, and charge a similar price in other countries that are sheltered in place due to COVID-19. “We see this as an opportunity to bring this incredible film to a broad audience currently unable to go to movie theaters, while also further enhancing the value and attractiveness of a Disney+ subscription,” Chapek said in a conference call. Disney’s revenue fell 42% to $11.78 billion in the quarter, missing the consensus estimate. The theme-parks business saw revenue fall to less than $1 billion as most offerings were closed for the entire period because of the coronavirus. The direct-to-consumer and international division, which includes Disney+, reported revenue of $3.97 billion after recording sales of $3.86 billion a year ago. Analysts had expected $4.65 billion, according to FactSet. The movie business declined to $1.74 billion in revenue from $3.84 billion a year ago, while analysts expected $1.67 billion. Disney’s TV business reported revenue of $6.56 billion, down from $6.71 billion a year ago but higher than the average analyst estimate of $6.28 billion. Disney Loses Nearly $5 Billion Amid Pandemic Elsewhere, Beyond Meat Inc. BYND, +0.80% posted a widening loss even as revenue rose 69% to a record $113.3 million, ahead of the consensus estimate. While Beyond Meat acknowledged a “meaningful slowdown” in its food-service business because of COVID-19, resulting in the closure or limited operations of many of its customers, the company said it “experienced an increase in demand by its retail customers as consumers shifted toward more at-home consumption, which more than offset the decline in sales to food-service customers.” On Wednesday, Michael Kors parent Capri Holdings Inc. surprised with a revenue beat, although its losses came to $180 million. Drugstore chain CVS Health Inc. beat estimates, and it raised its full-year guidance. Here are the latest stories about companies and COVID-19: • Acadia Healthcare Co. Inc. ACHC, +0.90% reported second-quarter revenue that lagged Wall Street expectations, and the company said it was expanding its offerings thanks to the mental-health toll it expects the pandemic will exact. A decrease in per-day revenue is “primarily attributable to a decline in outpatient volumes and reimbursement in certain markets for CTC in-person services that was temporarily affected by stay-at-home orders,” Acadia said. Volumes improved toward the end of the quarter as more localities eased restrictions. “We believe the ongoing mental and emotional toll caused by continuing economic and societal concerns will further increase the already strong demand for mental health and substance use treatments we provide in the U.S. and U.K.,” Acadia said in a statement. “We continue to make the necessary investments to serve our patients’ needs through bed expansion opportunities and additional service offerings.” • Alaska Air Group Inc.’s ALK, +0.15% Alaska Airlines announced more stringent requirements for cloth masks and face coverings in an effort to stop the spread of the COVID-19 virus, saying, “No mask, no travel, no exceptions.” The air carrier said everyone 2 years old and above must wear a face covering over their nose and mouth at all times when at the airport or onboard Alaska Airlines aircraft, “with no exceptions.” The company said that if a customer is unwilling or unable to wear a mask “for any reason while at the airport,” they will not be permitted to travel. If a passenger refuses to wear a mask after boarding, the company said he or she will be barred from future travel. “We all need to look out for each other during this health emergency, and the best way we can do that — and prevent the spread of the virus — is to simply wear a mask or face covering when we’re around each other,” said Max Tidwell, vice president of safety and security. “Our tougher policy shows how important this issue is to us and our guests. If you don’t wear a mask, you won’t be flying with us.” • AmerisourceBergen Corp. ABC, -1.65% surged toward a five-year high, as the pharmaceutical products supplier reported third-fiscal-quarter earnings that beat expectations and raised its full-year outlook. Revenue rose 0.3% to $45.37 billion, beating the FactSet consensus of $44.64 billion, as pharmaceutical distribution services revenue rose 0.1% to $43.6 billion and other revenue grew 4.4% to $1.8 billion, boosted by growth in its ABCS and World Courier businesses. For fiscal 2020, the company raised its adjusted EPS guidance range to $7.80 to $7.95 from $7.35 to $7.65. Revenue is now expected to grow in the mid-single digit percentage range, compared with previous guidance of low- to mid-single-digit growth. The FactSet revenue consensus of $187.5 billion implies 4.4% growth. • Boot Barn Holdings Inc. BOOT, +0.77% swung to a loss in its latest quarter, but its numbers were better than expected. The Western-wear retailer said same-store sales dropped 27.1% while e-commerce sales rose 51.9%. While the company said it would not issue second-quarter guidance because of the uncertainty surrounding the pandemic, CEO Jim Conroy said in a statement: “With the exception of temporary store closures due to COVID-19, we are fortunate to have all of our stores open and believe we are well positioned to reengage in growth when customer confidence in store shopping returns.” • Capri Holdings Ltd.’s stock CPRI, +2.55% rose after the luxury fashion house reported first-fiscal-quarter revenue that beat expectations. Net losses totaled $180 million, or $1.21 per share, after net income of $45 million, or 30 cents per share, last year. Its adjusted loss per share was $1.04, ahead of the FactSet consensus for a loss of $1.17. Revenue of $451 million was down from $1.35 billion last year and beat the FactSet forecast for $426 million. Michael Kors revenue was down 68.7% to $307 million for the quarter. Versace revenue fell 55.1% to $93 million. And Jimmy Choo’s revenue was down 67.7% to $51 million. Capri did not give fiscal 2021 guidance due to the uncertainty caused by the coronavirus. • CVS Health Corp. shares CVS, -1.76% soared after the drugstore chain trounced estimates for the second quarter and raised its full-year guidance despite the impact of the pandemic on its operations. The pandemic adversely affected revenue in the retail and pharmacy services segments, mostly due to fewer new therapy prescriptions due to lower provider visits. Front store revenue was hurt by shelter-in-place orders. CVS raised its full-year EPS guidance and now expects it to range from $5.59 to $5.72, up from a prior range of $5.47 to $5.60. It expects adjusted EPS to range from $7.14 to $7.27 versus a prior range of $7.04 to $7.17. • Humana Inc. HUM, +1.43% reported second-quarter profit and revenue that beat expectations, while maintaining its adjusted earnings outlook. The company said as a result of the pandemic, admissions and utilization were “significantly depressed” in April, then increased through May and June, and were “modestly below normal” at the end of the quarter. Humana affirmed its 2020 adjusted EPS guidance range of $18.25 to $18.75, but nudged up its full-year individual Medicare Advantage membership growth outlook to 330,000 to 360,000 members from 300,000 to 350,000 members • Lumber Liquidators Holdings Inc. LL, +4.17% swung to a surprise second-quarter profit as sales fell less than expected, as sales trends improved through the quarter as markets reopened following COVID-19-related shutdowns. The wood flooring retailer’s sales fell 20.2% to $230.3 million, above the FactSet consensus of $220.6 million, while same-store sales dropped 21.3% to beat expectations of a 24.4% decline. Through May 23, same-store sales had been down 30%. And through late June, all employees who had been furloughed because of the pandemic had returned to work, as the company’s distribution centers resumed “normal” operations. “Based on what we know today about the impact of COVID-19, the company believes that cash flows from operations, together with the liquidity under its Credit Agreement, provides sufficient liquidity to navigate the current environment,” the company said. • Monster Beverage Corp. MNST, +2.24% topped Wall Street estimates for the latest quarter, posting a profit and sales that were only slightly below the year-earlier period. “Currently, the company does not foresee a material impact on the ability of its co-packers to manufacture and its bottlers/distributors to distribute its products as a result of the COVID-19 pandemic,” Monster said in a statement. “In addition, the company is not experiencing raw material or finished product shortages in its supply chain.” • The New York Times Co. NYT, -3.79% posted better-than-expected earnings for the second quarter on Wednesday, and said digital revenue had exceeded print revenue for the first time. “We believe that the significant growth over the last several years in subscriptions to our products demonstrates the success of our ‘subscription-first’ strategy and the willingness of our readers to pay for high-quality journalism,” the company said in a statement. New York Times added 493,000 net new subscribers to its core news product in the quarter, and 176,000 additions to other digital products for net new digital additions of 669,000. At quarter-end, it had 5.7 million digital-only subscribers and 6.5 million total subscriptions, said CEO Mark Thompson, who is handing the reins to COO Meredith Kopit Levien in September. Advertising revenue fell 43.9% in the quarter, while subscription revenue rose 7.5% and other revenue fell 5%. Digital ad revenue fell 31.9%, while print ad revenue was down 55%. “Print advertising revenue decreased as the COVID-19 pandemic further accelerated secular trends, largely impacting the entertainment, luxury, and technology categories,” said the statement. • Regeneron Pharmaceuticals Inc. REGN, +0.36% headed for a record high after the biotechnology company reported second-quarter profit and revenue that beat Wall Street expectations, and said it expects clinical studies to remain generally on track in the face of the pandemic. Revenue rose to $1.95 billion from $1.58 billion, topping the FactSet consensus of $1.73 billion, as product sales and Sanofi collaboration revenue beat expectations, while Bayer collaboration revenue fell a bit shy. “We have advanced REGN-COV2, our antibody cocktail for COVID-19, into late-stage clinical studies in record time and are working to ensure supply is available later this year,” said Chief Executive Leonard Schleifer. • Texas Roadhouse Inc. TXRH, +0.83% reported a steady increase in comparable sales during the second-quarter, aided by its ability to serve more dine-in customers. Comparable sales were down 32.8% for the quarter, rising from April (down 46.7%) through June (down 14.1%). “Those limited capacity restaurants for July were down 11.2% and we’ve got a pretty fair mix of 100% capacity restaurants, 75%, 50% down to 25%,” said Tonya Robinson, chief financial officer for Texas Roadhouse on the call, according to a FactSet transcript. Whether the capacity is far reduced or at 100%, Robinson also said the company’s to-go business “holds pretty well across the board.” The highest number of restaurants, 332, are operating at 50% capacity, while 115 are operating at 100% capacity. Sixty-eight are at a quarter of capacity and 27 are at 75%. • Wayfair Inc. W, -2.59%, the online seller of home furnishings and housewares, swung to a big profit beat in the second quarter, as orders delivered more than doubled during the pandemic. Revenue soared 83.7% to $4.3 billion, beating the FactSet consensus of $4.07 billion. Orders delivered increased 106.2% to 18.9 million, while the average order value declined to $227 from $255. The number of active customers in the Direct Retail business grew 46% to 26 million. “We experienced unprecedented demand in Q2 and saw record numbers of new and repeat customers choose Wayfair,” said Chief Executive Niraj Shah. • Wendy’s Co. WEN, +2.20% reported better-than-expected profit for the second quarter, but revenue fell short of estimates. U.S. same-restaurant sales fell 4.4%, ahead of the FactSet consensus for a 5.6% decline. Global same-store sales fell 5.8%, just below the FactSet outlook for a 5.6% decline. The same-store decrease was partially offset by the new breakfast menu. Breakfast accounted for about 8% of second-quarter U.S. sales. Wendy’s declared a dividend of 5 cents per share, payable on Sept. 15, 2020 to shareholders of record as of Sept. 1, 2020. And the fast-food chain intends to resume share repurchases in 2020 to minimize dilution. The board has approved an extension of the $100 million buyback program, which was set to expire in February 2022. Wendy’s previously withdrew its guidance due to COVID-19. • WW International Inc. shares WW, +3.96% fell after the company formerly known as Weight Watchers reported second-quarter adjusted profit and sales that were below Wall Street expectations. WW said it ended the quarter with its highest-ever second-quarter subscriber base of five million people, “driven by a record level of digital subscribers.” Location closures due to COVID-19, however, dented service and product sales, the company said. “We are nimbly managing our studio cost structure and are on track to deliver on our $100 million cost-savings initiative, while maintaining strong liquidity and financial flexibility,” Chief Financial Officer Nick Hotchkin said in a statement."}]}