{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-case-tally-edges-toward-13-million-and-florida-trounces-one-day-case-record-set-by-california-last-week-2020-07-13", "published": 1594707320.0, "headline": "Coronavirus update: Global case tally edges toward 13 million, and Florida trounces one-day case record set by California last week", "body": "The number of confirmed cases of the coronavirus illness COVID-19 worldwide edged closer to 13 million on Monday, a day after the World Health Organization reported another one-day case record above 230,000, and Florida set a U.S. record that trounced the previous one set by California last week. Florida’s Department of Health reported 15,299 people tested positive for COVID-19 on Sunday, bumping the total confirmed case tally for the Sunshine State to 269,811 cases, as the Associated Press reported. The previous record was 11,694 cases in a single day, set last week by California. In more bad news, Florida counted a record of 514 fatalities last week, compared with the average of 30 deaths a day the state was recording just three weeks ago. Testing has doubled in the past month to almost 50,000 a day from 25,000 and the percentage of people testing positive has risen to an average of 19% in the last week from few than 5% a month ago, the AP reported. Meanwhile, Arizona continues to clamor for help with testing as its hospitals are becoming overwhelmed. In Texas, the mayor of Houston Sylvester Turner and Harris County Judge Lina Hidalgo, both Democrats, said a stay-at-home order is needed to help the city cope with its recent surge in cases. State health officials reported 8,196 new cases Sunday, another 80 deaths and a total of 10,410 people hospitalized due to the virus, as the AP reported. “Not only do we need a stay home order now, but we need to stick with it this time until the hospitalization curve comes down, not just flattens,” Hidalgo said on Twitter Sunday. “Many communities that persevered in that way are reopening for the long haul. Let’s learn from that & not make the same mistake twice.” A 30-year old in Texas died after attending a so-called “COVID-19 party,” telling nurses he thought the virus was a hoax, the New York Times reported. President Donald Trump wore a face mask while visiting a military hospital on Saturday, but his administration continued to criticize and point fingers at a key member of the White House Task Force set up to manage the pandemic. Trump himself got the ball rolling in an interview with Fox News Anchor Sean Hannity, in which he said Dr. Anthony Fauci, head of the National Institute for Allergies and Infectious Diseases and the man deemed to be the nation’s leading infectious-disease expert, “is a nice man, but he’s made a lot of mistakes.” Adm. Brett Giroir said Sunday on NBC News show “Meet the Press” that Fauci “is not 100% right, and he also doesn’t necessarily, he admits that, have the whole national interest in mind.” Giroir is testing coordinator at the Department of Health and Human Services, and was being questioned about a Washington Post report that said Fauci has argued states with spikes should shut down again. Giroir said he doesn’t “think we need to shut down” again — “at least in most places around the country” but suggested Americans “avoid bars” and “wear a mask in public.” Fauci is not the only public health expert arguing there is a need for another shutdown. “Somehow we thought that we could basically win an argument with this virus and now we know we can’t,” said Michael Osterholm, head of the Center for Infectious Disease Research and Policy at the University of Minnesota, in a weekend interview with MSNBC. On Monday, he said it’s too late for people who have already become infected. “Those people are already in the pipeline. The next two weeks ... that history is already written,” Osterholm said in another MSNBC interview. “Let me just say I’m not a politician; I’m a scientist. and frankly I’m frustrated by this entire situation because the more minutes we spend talking about this, the less we’re spending talking to people about distancing, about the importance of why cases even in young adults are leading to a number of intensive-care-unit hospitalizations and deaths, why what we have to do is make sure that when you’re in indoor-air settings like bars and restaurants you put yourself at high risk of transmitting this virus, why it is so important,” he said. Osterholm estimates that the number of Americans already infected is at 7% or 8%, far from the 50% to 70% required “that will be required to get infected or be vaccinated and be protected in order to slow this virus transmission down.” Osterholm has consistently argued said the U.S. needs to go back to Square One, shut down, reopen gradually, like early hot spot New York and the rest of the world, and then live with COVID-19 until a vaccine has been developed On Monday, New York City officials reported the first day of zero COVID-19 deaths since the start of the outbreak. Latest tallies There are now 12.9 million cases of COVID-19 worldwide and the U.S. accounts for about a quarter or 3.31 million, according to data aggregated by Johns Hopkins University. At least 569,878 people have died of the illness and at least 7.1 million have recovered. The U.S. has the highest death toll at 135,213. A Harvard Global Health Institute researchers’ national tracker created to trace the severity of the outbreak on a state-by-state basis is flashing red for eight states, namely Arizona, Florida, Louisiana, South Carolina, Texas, Georgia, Alabama and Idaho. Brazil is second to the U.S. with 1.86 million cases and 72,100 deaths. See: Tax us: Abigail Disney among 83 millionaires begging for higher taxes for coronavirus relief India is third measured by cases at 878,254, followed by Russia with 726,826 and Peru with 326,326. The U.K. has 291,155 cases and 44,904 fatalities, the highest in Europe and third highest in the world. China, where the illness was first reported late last year, has 85,117 cases and 4,641 fatalities.What’s the latest medical news? Pfizer Inc. PFE, -0.27% and BioNTech SE BNTX, +1.23% said Monday that two of their vaccine candidates to protect against the virus that causes COVID-19 received Fast Track designation status from the Food and Drug Administration. Fast Track is a process to expedite the review of new drugs and facilitate development of new drugs. The government has already committed to a program aimed at accelerating vaccine development called “Operation Warp Speed.” Pfizer’s and BioNTech’s BNT162b1 and BNT162b2 are currently being evaluated in Phase 1/2 clinical studies in the U.S. and Germany. “The FDA’s decision to grant these two COVID-19 vaccine candidates Fast Track designation signifies an important milestone in the efforts to develop a safe and effective vaccine against SARS-CoV-2,” said Peter Honig, Senior Vice President, Global Regulatory Affairs, Pfizer. “We look forward to continue working closely with the FDA throughout the clinical development of this program, Project Lightspeed, to evaluate the safety and efficacy of these vaccine candidates.” Separately, Enzo Biochem Inc. ENZ, -2.11% received an emergency use authorization from the Food and Drug Administration for its COVID-19 diagnostic test. The regulator issued the EUA on July 7. It has granted emergency authorization to at least 137 diagnostic tests during the COVID-19 pandemic. What are companies saying? PepsiCo Inc. PEP, +0.42% reported second-quarter profit and revenue that fell less than expected, as snacks and food business remained resilient amid the pandemic. Net income fell to $1.65 billion, or $1.18 a share, from $2.04 billion, or $1.44 a share, in the year-ago period. Excluding non-recurring items, core earnings per share came to $1.32, above the FactSet consensus of $1.25. Revenue fell 3.1% to $15.95 billion, but topped the FactSet consensus of $15.37 billion. Frito-Lay North America revenue rose 6.6% to $4.27 billion, beverages North America revenue fell 6.6% to $4.97 billion and Quaker Foods North America revenue grew 23.0% to $664 million. The company said it was not providing full-year financial guidance given the uncertainties associated with the pandemic, but said it plans to return $7.5 billion to shareholders through dividends of $5.5 billion and stock repurchases of about $2 billion. Goldman Sachs initiated coverage of Walt Disney Co. stock DIS, +1.53% with a buy rating and $137 price target, amid high hopes that its streaming service could amass more than 150 million Disney+ streaming subscribers by 2025. The company had 54.5 million subscribers as of early May. The company is “rapidly emerging as a global leader in direct-to-consumer entertainment,” analyst Brett Feldman wrote, and he argued that the consensus view underestimates the profit potential for Disney+. Feldman expects that the service could turn profitable in fiscal 2021, while he said the consensus view is targeting fiscal 2023. Disney reopened its Florida parks over the weekend — and social media reacted predictably. Risk for Major Missteps Within the Mouse House Elsewhere, companies continued to offer updates on earnings, on liquidity and to brace for the second-quarter earnings season which kicks off informally tomorrow with the first of the big banks. Don’t miss:S&P 500 earnings set to plunge as the coronavirus batters all sectors — with Wall Street counting on a bounce that may not come Here’s the latest news about companies and COVID-19: • AMC Entertainment Holdings Inc. AMC, -2.17% has reached an agreement to reduce its debt by at least $460 million and has secured $300 million in new funding. The company, which has been battered during the pandemic as it was forced to close its theaters, said it has amended exchange offer and other agreements to reduce its debt by up to $630 million with holders of 73% of its roughly $2.3 billion in senior subordinated notes supporting an amendment announced late Friday. Separately, the company has reached agreements to restructure some $600 million of convertible bonds issued in 2018 to Silver Lake. In another liquidity-boosting move, AMC has converted cash interest on new exchange notes for 12 months, and under certain conditions up to 18 months, into payment-in-kind and they will be deferred until 2026. The company could save $100 million to $200 million of cash in the near term. “This is one of many steps we have taken since March as we navigate through these turbulent coronavirus times, including significantly reducing operating costs and capital expenditures, working with theatre landlords to abate and defer rents, raising $500 million of new public debt in April and developing new health and cleaning protocols with the best global experts to keep our theatres safe,” Chief Executive Adam Aron said. • Bed Bath & Beyond Inc. BBBY, -1.37% has appointed Neil Lick to the senior vice president of owned brands role, leading a new team that will start launching private labels in 2021 for the home retailer. Lick previously spent 22 years with Williams-Sonoma Inc. WSM, +1.34% where he held a number of roles, including head of corporate social responsibility. Analysts are optimistic about the opportunities available for Bed Bath & Beyond moving forward, despite the company’s most recent earnings miss. • Hi-Crush Inc. US:HCR, a Houston-based provider of proppant and logistics services for hydraulic fracturing operations, filed for bankruptcy, hurt by the falling oil price and reduced demand during the pandemic. The bankruptcy will help implement a restructuring support agreement with creditors holding nearly all of its outstanding 9.5% senior unsecured notes due 2026. Hi-Crush has received commitments for $65 million in debtor-in-possession and exit financing, as the company will continue to operate its business during the bankruptcy. Terms of the bankruptcy include payment of substantially all trade claims in the ordinary course, cancellation of current equity, conversion of $450 million of existing pre-petition debt into equity of the reorganized company and a $40 million rights offering for new secured convertible notes. • Quest Diagnostics Inc. DGX, +0.33% expects second-quarter revenue of about $1.83 billion, a decline of about 6% from the year-earlier period but well ahead of the $1.53 billion FactSet consensus. Testing volumes in the company’s base business, which excludes COVID-19 molecular and antibody testing, fell about 18%, the company said. It now expects per-share earnings of $1.33 to $1.36, compared with $1.51 a year ago. Adjusted EPS is expected to range from $1.39 to $1.42, compared with $1.73 in 2019 and a the FactSet consensus of 16 cents. The company will report second-quarter earnings on July 23. •Yelp Inc. YELP, -1.66% disclosed in a filing that it plans to bring back “nearly all” of the employees it furloughed earlier in the year when the COVID-19 outbreak pressured its business. “Of the more than 1,000 furloughed employees, many will return in August as planned, while our sales force is returning on a staggered timeline over a four-month period starting this month,” Chief Executive Jeremy Stoppelman said in a message to employees that was also filed with the Securities and Exchange Commission. The company would also be restoring employees to 100% pay and time starting Aug. 10. Yelp anticipates that it will continue with remote work “into the first half of 2021” and the company is eliminating 63 roles, primarily related to workplace and recruiting efforts, as a result of the pandemic."}]}