{"article": [{"url": "https://www.marketwatch.com/story/dc-area-health-departments-open-letter-faults-contact-tracing-efforts-amid-white-house-coronavirus-outbreak-2020-10-08", "published": 1602229940.0, "headline": "D.C.-area health departments fault contact-tracing efforts amid White House coronavirus outbreak", "body": "WASHINGTON (AP) — In an extraordinary step, the Washington, D.C., Department of Health has released an open letter appealing to all White House staff and anyone who attended a Sept. 26 event in the Rose Garden to seek medical advice and take a COVID-19 test. The letter indicates a lack of confidence in the White House medical team’s own contact-tracing efforts regarding an ongoing virus outbreak that has infected President Donald Trump, multiple senior staff members and two U.S. senators, among others. News Pulse:White House is not tracing contacts of guests and staff at Rose Garden event 10 days ago: New York Times Coronavirus update:Expert calls for ‘radical transparency’ on Trump’s coronavirus treatment and progress as more in president’s circle test positive Co-signed by nine other local health departments from neighboring jurisdictions in Maryland and Virginia, the letter flatly states a belief that contact tracing on the outbreak has been insufficient. It says the public appeal is based on, “our preliminary understanding that there has been limited contact tracing performed to date, there may be other staff and residents at risk for exposure to COVID positive individuals.” It asks all White House employees, anyone who attended the Sept. 26 event and anyone who may have been in contact with those people to “contact your local health department for further guidance/questions regarding your potential need to quarantine.” The letter represents a rising level of concern and a clear shift in strategy by Mayor Muriel Bowser’s government, which had previously remained publicly hands-off and said it trusted the White House’s robust medical operation to handle its own contact tracing and follow-up. Bowser said earlier this week that repeated attempts to contact the White House over the outbreak had received a “very cursory” response but that she believed the necessary steps were being taken. “There are established public health protocols at the White House that are federal in nature,” Bowser said on Monday. “We assume that those protocols have been engaged.” A Health Department spokeswoman did not respond to questions on whether the letter had been directly sent to any White House employees or people who attended the Sept. 26 event, or if the D.C. government had been provided with a list of attendees. The move highlights the public health dilemma faced by Bowser’s government regarding the current outbreak. The Trump White House has operated for months in open violation of several D.C. virus regulations, hosting multiple gatherings that exceeded the local 50-person limit and in which many participants didn’t wear masks. It shines a further spotlight on the Sept. 26 Rose Garden ceremony to introduce Trump’s Supreme Court nominee, Amy Coney Barrett. Multiple attendees, including Trump and University of Notre Dame President Rev. John Jenkins, who flew in from Indiana for the ceremony, have now tested positive. Washington’s local virus regulations don’t apply on federal property, but the current outbreak has blurred those distinctions. Trump inner-circle members like former counselor Kellyanne Conway, who has also tested positive, are D.C. residents, as are many of the staffers, employees, Secret Service members and journalists who have had close contact with infected officials. White House spokesman Judd Deere said Monday that the White House “has established a robust contact tracing program led by the White House Medical Unit with CDC integration to provide appropriate recommendations.” On Wednesday, White House deputy press secretary Brian Morgenstern detailed the in-house contact tracing regime to reporters. “We look back 48 hours to find people who may have been within six feet [of an infected person] for at least 15 minutes. And the purpose is to mitigate further transmission of the virus, correct? It’s not to go back and identify patients zero. I understand that people are very curious about that I’m curious too,” he said. “It’s sort of an unknowable question as to where it entered the environment.” The District of Columbia has reported 15,765 positive COVID-19 cases, with 634 deaths. Bowser on Wednesday announced she was extending the local state of emergency, which was scheduled to expire Oct. 9, through Dec. 31. Read on:CDC returns to its website deleted guidance about airborne spread of coronavirus"}]}