{"article": [{"url": "https://www.marketwatch.com/story/tiktoks-fate-up-in-the-air-as-judge-weighs-ban-from-app-stores-2020-09-27", "published": 1601241320.0, "headline": "Judge blocks Trump administrationâ\u0080\u0099s ban against TikTok from going into effect", "body": "NEW YORK â\u0080\u0094 A federal judge on Sunday postponed a Trump administration order that would have banned the popular video sharing app TikTok from U.S. smartphone app stores around midnight. A more comprehensive ban remains scheduled for November, about a week after the presidential election. The judge, Carl Nichols of the U.S District Court for the District of Columbia, did not agree to postpone the later ban. The ruling followed an emergency hearing Sunday morning in which lawyers for TikTok argued that the administrationâ\u0080\u0099s app-store ban would infringe on First Amendment rights and do irreparable harm to the business. Earlier this year, President Donald Trump declared that TikTok was a threat to national security and that it must either sell its U.S. operations to American companies or be barred from the country. TikTok, owned by Chinese company ByteDance, is scrambling to firm up a deal tentatively struck a week ago in which it would partner with Oracle ORCL, +0.42% Â , a huge database-software company, and Walmart WMT, +1.00% Â in an effort to win the blessing of both the Chinese and American governments. In the meantime, it is fighting to keep the app available in the U.S. Judge Nichols did not explain his reasoning publicly, instead filing his judicial opinion under seal. Initially, both the U.S. governmentâ\u0080\u0099s brief in the case and the entire Sunday morning hearing were also due to be sealed, although the court later relented. In arguments to Judge Nichols, TikTok lawyer John Hall said that TikTok is more than an app, since it functions as a â\u0080\u009cmodern day version of a town square.â\u0080\u009d â\u0080\u009cIf that prohibition goes into effect at midnight, the consequences immediately are grave,â\u0080\u0099â\u0080\u009d Hall said. â\u0080\u009cIt would be no different than the government locking the doors to a public forum, roping off that town squareâ\u0080\u009d at a time when a free exchange of ideas is necessary heading into a polarized election. TikTok lawyers also argued that a ban on the app would affect the ability of tens of thousands of potential viewers and content creators to express themselves every month and would also hurt its ability to hire new talent. In addition, Hall argued that a ban would prevent existing users from automatically receiving security updates, eroding national security. Justice Department lawyer Daniel Schwei said that Chinese companies are not purely private and are subject to intrusive laws compelling their cooperation with intelligence agencies. The Justice Department has also argued that economic regulations of this nature generally are not subject to First Amendment scrutiny. â\u0080\u009cThis is the most immediate national security threat,â\u0080\u009d argued Schwei. â\u0080\u009cIt is a threat today. It is a risk today and therefore it deserves to be addressed today even while other things are ongoing and playing out.â\u0080\u009d Schwei also argued that TikTok lawyers failed to prove the company would suffer irreparable business harm. The Justice Department laid out its objections to TikTokâ\u0080\u0099s motion for a temporary injunction in a brief under seal, but it was unsealed in redacted form to protect confidential business information. Trump set the process in motion with executive orders in August that declared TikTok and another Chinese app, WeChat, threats to national security. The White House says the video service is a security risk because the personal information of its millions of U.S. users could be handed over to Chinese authorities. Trump has given tentative approval to a proposed deal in which Oracle and Walmart could initially own a combined 20% of a new U.S. entity, TikTok Global. But Trump also said he could retract his approval if Oracle doesnâ\u0080\u0099t have â\u0080\u009ctotal controlâ\u0080\u009d of the company; the president did not explain what he meant by that. The deal remains unfinalized, and the two sides have also appeared at odds over the corporate structure of TikTok Global. ByteDance said last week that it will still own 80% of the U.S. entity after a financing round. Oracle, meanwhile, put out a statement saying that Americans â\u0080\u009cwill be the majority and ByteDance will have no ownership in TikTok Global.â\u0080\u009d Government-owned media in China have criticized the deal as bullying and extortion. ByteDance said Thursday it has applied for a Chinese technology export license after Beijing tightened control over exports last month in an effort to gain leverage over Washingtonâ\u0080\u0099s attempt to force an outright sale of TikTok to U.S. owners. Chinaâ\u0080\u0099s foreign ministry has said the government will â\u0080\u009ctake necessary measuresâ\u0080\u009d to safeguard its companies but gave no indication what steps it can take to affect TikTokâ\u0080\u0099s fate in the United States. TikTok is also asking a federal court to declare Trumpâ\u0080\u0099s Aug. 6 executive order unlawful. The Chinese firm said the president doesnâ\u0080\u0099t have the authority to take these actions under the national-security law he cited; that the ban violates TikTokâ\u0080\u0099s First Amendment speech rights and Fifth Amendment due-process rights; and that thereâ\u0080\u0099s no authority for the restrictions because they are not based on a national emergency."}]}