{"article": [{"url": "https://www.marketwatch.com/story/ibm-stock-soars-after-company-says-planned-spinoff-will-allow-more-focus-on-hybrid-cloud-opportunity-11602163158", "published": 1602149240.0, "headline": "IBM stock soars after company says planned spinoff will allow more focus on hybrid cloud opportunity", "body": "IBM expects September-quarter results in line with the FactSet consensus, according to a release announcing the planned spinoff of its managed infrastructure services business. Getty Images International Business Machines Corp. will spin off its managed infrastructure services business into a separate company, a move that its recently installed chief executive said would allow IBM to become more focused on hybrid-cloud opportunities. “We’re noticing that client buying needs for application and infrastructure services are diverging,” Chief Executive Arvind Krishna said in a Thursday morning post on IBM’s IBM, -2.81% website. He expects that IBM will be able to “sharpen its focus on its open hybrid cloud platform and AI capabilities” and said that the new managed-infrastructure company will be “twice the size of its nearest competitor.” IBM shares are up 10 % in premarket trading Thursday. See more: IBM’s stock surges after plan to spin off managed infrastructure services unit Krishna, who took over as chief executive in April, anticipates that the separation will take place by the end of 2021 and sees room for both companies to benefit from an operational standpoint. IBM will be able to “simplify and optimize [its] operating model for speed and growth,” he said in his post, while the new company “will also have greater freedom to forge partnerships and alliances in the managed infrastructure services space.” The two businesses will work together after the separation, with the new company serving as IBM’s “preferred partner for infrastructure.” The managed infrastructure services business currently sits within IBM’s Global Technology Services segment, and the company said that its Technology Support Services, also part of the GTS segment, will remain a part of the main IBM company. IBM also disclosed that it expects to record $17.6 billion in revenue and $2.58 a share in adjusted earnings per share for the September quarter. Both numbers are in line with the FactSet consensus. IBM shares have added 5.4% over the past three months as the Dow Jones Industrial Average DJIA, +0.56%, of which IBM is a component, has gained 8.6%."}]}