{"article": [{"url": "https://www.marketwatch.com/story/cftcs-groundbreaking-climate-change-report-sounds-a-bipartisan-alarm-on-costly-risks-for-u-s-financial-system-11599676452", "published": 1599910940.0, "headline": "Climate change is huge risk for the American financial system, a major new bipartisan report says", "body": "Thousands of people fled their homes in northern California last month as hundreds of fast-moving wildfires spread across the region, burning houses and leading to the death of a helicopter pilot. This week, Oregon is under warning. The U.S. financial system, including banks, agricultural and oil interests, as well as regulators and investors, requires a unified front in accounting for climate-change risk, says the first comprehensive government report on such efforts. Notably, the report released Tuesday by the Commodity Futures Trading Commission and an affiliated panel representing several sectors revives a call for taxing carbon pollution. The CFTC’s Climate-Related Market Risk Subcommittee of the Market Risk Advisory Committee released its findings in Managing Climate Risk in the U.S. Financial System. The panel behind the release voted unanimously 34-0 to adopt the over 190-page report which recommends that 16 financial regulators and other bodies “incorporate climate-related risk into their mandates and develop a strategy for integrating these risks in their work, including into their existing monitoring and oversight functions.” Disjointed rules and goals has been a major gripe from an investing world that’s increasingly factoring in climate change to decision-making. The report provides 53 recommendations to be implemented across financial regulatory agencies, and calls for a national price on carbon pollution. Such a tax would require congressional approval. U.S.-based carbon pricing has so far been a regional effort, and with mixed results. The panel’s leadership also took the opportunity to link the immediacy of financial-market adaption to climate change-linked headlines dominating current events even while COVID-19 hampers the economy. “As we’ve seen in the past few weeks alone, extreme weather events continue to sweep the nation from the severe wildfires of the West to the devastating Midwest derecho and damaging Gulf Coast hurricanes. This trend — which is increasingly becoming our new normal — will likely continue to worsen in frequency and intensity as a result of a changing climate,” said CFTC Commissioner Rostin Behnam, one of two Democrats on the five-member body. “Beyond their physical devastation and tragic loss of human life and livelihood, escalating weather events also pose significant challenges to our financial system and our ability to sustain long-term economic growth,” he said. While wildfires and hurricanes occur for myriad reasons, their frequency and intensity has factored into the climate-change discussion. Read: Raging wildfires in California force power outages The bipartisan and cross-sector panel included 35 representatives ranging from Goldman Sachs Group GS, -0.21% to oil giant BP BP, +0.56%, agricultural groups and environmental interests including The Nature Conservancy and Ceres. “For a politically and sectorally diverse group of influential members to issue such a strong call for regulatory action is testament to just how important a financial issue climate change is, and to just how urgently we need leadership now,” said Mindy Lubber, president and CEO of sustainable-investing advocate Ceres and a member of the panel. The CFTC group’s chief recommendation is to “establish a price on carbon” that is robust enough to incentivise the private sector to cut use of carbon dioxide-producing oil and gas. Beyond that aim, the report’s dozens of other recommendations include a sweeping rewrite of financial market rules and practices that could go forward without congressional act and no matter who wins the presidency come November, including requiring banks to address climate-related financial risks and publicly-traded companies to disclose emissions. The report, which presents 53 recommendations to mitigate the risks to financial markets posed by climate change, concludes that: Climate change poses a major risk to the stability of the U.S. financial system and to its ability to sustain the American economy; Climate risks may also exacerbate financial system vulnerability that have little to do with climate change; including vulnerabilities caused by a pandemic that has stressed balance sheets, strained government budgets, and depleted household wealth; U.S. financial regulators must recognize that climate change poses serious emerging risks to the U.S. financial system, and they should move urgently and decisively to measure, understand, and address these risks; Existing statutes already provide U.S. financial regulators with wide-ranging and flexible authorities that could be used to start addressing financial climate-related risk now; Regulators can help promote the role of financial markets as providers of solutions to climate-related risks; and Financial innovation is required not only to efficiently manage climate risk but also to facilitate the flow of capital to help accelerate the net-zero transition and increase economic opportunity. Regulators in the United States have so far lagged behind their European counterparts in addressing climate-change risk in the financial system. The Trump administration has been largely rolling back environmental regulations, alleging their costly burden on business and inconsistent enforcement. The administration has also targeted the inclusion of Environmental, Social and Governance (ESG) investments in retirement plans. “Financial institutions face real risks from climate change and re-aligning their investment and lending portfolios to net-zero greenhouse gas emissions not only addresses that risk, it also provides additional capital to invest in ways that will contribute to reducing the emissions driving climate change, including investment in nature climate solutions,” said Dave Jones, senior director, environmental risk for The Nature Conservancy, who participated on the panel. “Nature” solutions historically have included reforestization and carbon capture. The Federal Reserve this year for the first time officially acknowledged the potential for climate change to destabilize the financial system, while mulling possible responses. Read: Climate change poses a ‘systemic threat’ to the economy, investors with $1 trillion at stake warn the Fed and SEC The report urges financial authorities, including the Fed, to integrate climate risk “into their balance sheet management and asset purchases, particularly relating to corporate and municipal debt.” The findings also call for regulators to conduct more robust research into the financial implications of climate change and join international climate-focused groups."}]}