{"article": [{"url": "https://www.marketwatch.com/story/10-things-you-should-know-about-diversification-2019-07-17", "published": 1597507160.0, "headline": "10 things you should know about diversification", "body": "One of the most important ways investors take care of their portfolios is by diversifying their holdings. If you’re not sure exactly what diversification is, or how to make it work for you, you’re in the right place. Here are 10 things you should know. 1. What exactly is diversification? Think of the concept of variety. If you’re an investor, diversification is the act of — and the result of — achieving variety in the things that make up your portfolio. Holding a variety of assets reduces your portfolio’s overall level of risk. “Don’t put all your eggs in one basket” sums it up. If you own a single stock, for example, you take the risk that the company could go belly-up and you lose 100%. If you own 100 stocks there’s almost no chance that you’ll lose everything.2. The stocks you choose are unlikely to beat the market The academics tell us the theoretical expected return of one stock is the same as the average return of all stocks in the same asset class. It’s true that one stock can return 10 times as much as its peers. On the other hand, any stock can lose most of its value for a variety of reasons. By and large, investors believe the stocks they own are worth much more than average; that’s why they own them. People who own stock usually have much higher opinions of that company than people who don’t own the stock. Try as they might, and despite enormous financial incentives for cracking this particular nut, the world’s best investors, managers and researchers have not found any reliable way to identify the long-term winners. Therefore, if the average return of all stocks will meet your needs, the smart money will own them by the hundreds (or even thousands) through mutual funds or ETFs.3. Your chances of picking the winners are much slimmer than you think A recent study addressed a question that would seem to have an obvious answer: “Do stocks outperform Treasury bills?” The answer was a shock to many people: From a vast database of the common stocks available since 1926, the study found that the majority — roughly four of every seven — had lifetime buy-and-hold returns less than one-month T-bills. The researchers found they could attribute almost the entire net gain in the stock market since 1926 to only 4% of individual stocks. Collectively, the other 96% matched the gains of Treasury bills. That means roughly one of every 25 stocks was a long-term winner. Everybody wants to identify that one in 25, but the odds against that are pretty overwhelming. That helps explain why so many stock portfolios deliver below-average returns. Unless you are willing to bet your financial future that you or your manager can pick the 4% of stocks that will be winners, I suggest you plan to own them all, through index funds.4. You should diversify among asset classes Even if you own 1,000 stocks, you’re still exposed to the risk that almost all similar stocks will decline significantly during a bear market (defined as a drop of 20% from a high point). This is called market risk. You can mitigate that risk by diversifying among asset classes. For example, you can own small-cap stocks as well as large-cap ones, value stocks as well as growth stocks, international stocks as well as U.S. stocks. In the 2000-2002 bear market when the S&P 500 index SPX, +0.87% had a compound annual loss of 14.6%, U.S. small-cap value stocks had a positive compound return of 12.2%, enough to offset most of the loss in the S&P 500. In the 10-year period ending in 2009, the S&P 500 had a compound annual loss of 0.9%, while small-cap value stocks gained 12.4%, compounded. In these two periods, international small-cap value stocks gained 1.9% and 13.5%, respectively. U.S. real-estate investment trusts gained 15.1% and 10.7% in those two periods. Any of these other asset classes would have improved a portfolio based on only the S&P 500. 5. Even the best equity diversification won’t necessarily protect you from a bear market In 2008, virtually all equity asset classes were badly impacted. My recommended Ultimate Buy-and Hold Strategy portfolio (all equity) lost a whopping 41.2%, and the S&P 500 was down 37%. But long-term government bonds were up 25.9% that year, rewarding investors who diversified by holding bonds as well as stocks. In an equity catastrophe like that (an event that in fact is normal every once in a while), U.S. government bonds are a safer safe harbor than corporate bonds. Read: These are the best new ideas in retirement6. You can get a lot of diversification in a single package Target-date retirement funds can manage your lifetime diversification with one decision: the approximate year you plan to retire. The fund will provide many stocks and a variety of asset classes (points 1, 2, 3 and 4 above) and provide an age-based growing exposure to bonds (point 5) in a single package. Target-date funds are offered by most large mutual-fund companies. At Morningstar.com, you can compare the portfolios of target-date funds offered by Fidelity, Vanguard and BlackRock. You’ll see their somewhat different approaches to managing the mix of asset classes and the timing of how they add bonds. Read: Fears of a retirement crisis are overblown — and these numbers prove it7. Thousands of authors, speakers, salespeople, brokers and investment advisers will happily give you advice on how to diversify by slicing and dicing stock and bond funds You could diversify by combining several strategies. Here are a few no-cost suggestions: •Rick Ferri’s Core-4 portfolios. •Vanguard, Fidelity and Schwab portfolios at a site called Money Under 30. •My own suggested portfolios here and here. Low-cost newsletters with fine long-term track records are available from Sound Mind Investing and Moneyletter. Read: Some ETFs cost you more than 1% to trade8. You can diversify time itself Although you can’t control time, you can use the calendar to at least partially control the prices you pay for investments. If you are regularly adding money to your portfolio or if you have a substantial lump sum of cash and don’t want to invest it all at the worst possible time, turn to dollar-cost averaging. This low-tech technique will ensure that you buy at a variety of prices, picking up more shares when those prices are lower and fewer shares when prices are higher. 9. You can even diversify your tax obligations You can’t get rid of taxes, but smart diversification can help you manage them. You do this by paying attention to how you use tax-deferred account like IRAs and 401(k)s and fully taxable accounts. In 401(k) plans and IRAs, there are also important tax differences between regular and Roth accounts. In retirement, you may want to withdraw money from your taxable accounts first, leaving money in your tax-deferred accounts to grow without the burden of taxes. A good accountant may be able to help you manage distributions in a way that avoids pushing you into a higher tax bracket. These are custom solutions that depend on individual circumstances, and I can’t give you any great rule of thumb except to think carefully about taxes.10. There are many levels of diversification In my latest podcast, I have addressed 20 variations, each one of which can help protect you from some form of financial risk. Check it out here. Richard Buck contributed to this article."}]}