{"article": [{"url": "https://www.marketwatch.com/story/russias-accelerated-covid-19-vaccine-greeted-with-alarm-as-experts-say-phase-3-trial-is-essential-2020-08-11", "published": 1597221980.0, "headline": "Russia's accelerated COVID-19 vaccine greeted with alarm as experts say Phase 3 trial is essential", "body": "News that Russia has registered the first vaccine to treat COVID-19 before starting and completing Phase 3 trials was greeted with alarm on Tuesday, with experts concerned it may come with safety issues that could stoke antivaccination and anti-science sentiment. President Vladimir Putin announced the news of the vaccine at a government meeting, The Wall Street Journal reported, following accelerated trials conducted by the Gamaleya Institute for Epidemiology and Microbiology in Moscow in collaboration with the Defense Ministry. Putin said one of his daughters has already received a dose of the vaccine, which has been named Sputnik-V, referring to the satellite Russia launched into space during the Cold War, beating the U.S. to the punch. Russia has conducted just two trials of the vaccine, with a third planned after volunteers register. The normal approval process for a new medicine is to gather data from a Phase 1 and Phase 2 trial, and then expand the patient base to thousands in a Phase 3 trial to create enough evidence it is effective and safe. \"There are no Olympic medals for being first,\" said Dr. Matthew Schmidt, University of New Haven Associate Professor of National Security and Political Science and a Russia expert, in emailed comments. \"Cheating on the scientific process hurts the perception of vaccine safety everywhere. The goal isn't to be first, it's to be first in a way that gives people faith in a vaccine's safety,\" he said. See:Dr. Osterholm: Americans will be living with the coronavirus for decades If the Russian vaccine proves to be unsafe, it \"could even stoke the antivaccine movement and drive up the number of people who refuse to be inoculated because it will feed conspiracy theories, in the US and elsewhere,\" he said. “ 'There are no Olympic medals for being first. Cheating on the scientific process hurts the perception of vaccine safety everywhere. The goal isn't to be first, it's to be first in a way that gives people faith in a vaccine's safety.' ” - Dr. Matthew Schmidt, Associate Professor of National Security and Political Science, University of New Haven A range of biotechs and drug companies are working all over the world to come up with an effective COVID-19 vaccine, which is for now the only safeguard against the deadly illness that has infected more than 20 million people and killed more than 756,000, according to data aggregated by Johns Hopkins University. The list includes Pfizer Inc. PFE, -0.27%  and partner BioNTech SE BNTX, +1.23%, Johnson & Johnson JNJ, +1.39%, Merck & Co. MRK, -0.14%, AstraZeneca PLC AZN, +1.16%  AZN, +0.63%  in combination with Oxford University, Moderna Inc. MRNA, +0.09%, Sanofi SAN, +1.20%  and GlaxoSmithKline GSK, +1.10% GSK, +1.52%, among others. A vaccine would change the trajectory of the pandemic, allowing economies to fully reopen and people to return to work and school. But vaccine development is normally a lengthy process. Even PhRMA, the pharmaceutical industry's largest lobbying group, says vaccine development takes 10 years, and the chief executives of Novartis AG NVS, +0.97%  and Johnson & Johnson, have said developing a COVID-19 vaccine will take longer than 12 months. At the same time, several companies developing COVID-19 vaccines have pledged millions and sometimes billions of doses of vaccines that have yet to prove their efficacy. Read now: This Seattle man volunteered to be injected with an experimental COVID-19 vaccine: 'It was kind of my duty as a healthy individual to step up' The World Health Organization has not received enough information on how Russia developed the vaccine to evaluate it, according to Jarbas Barbosa, assistant director of the Pan American Health Organization , a WHO branch, as the Guardian reported. Barbosa said the vaccine should not be produced until Phase 3 trials have been completed. \"Any vaccine producer has to follow this procedure that guarantees it is safe and has the WHO's recommendation,\" he said. Russia's Association of Clinical Trials Organizations, a nongovernmental agency, appeared to also have safety concerns Tuesday and asked the health minister in an open letter to delay registering the vaccine until all trials have been completed, The Wall Street Journal reported. \"It hasn't even completed testing with participation of even 100 people,\" the letter said. \"It's exactly in the course of that phase when proof of the effectiveness can be ascertained as well as information about undesirable reactions, which the vaccine can cause in various patient groups.\" The data has not been peer-reviewed, according to media reports, another important step in achieving regulatory approval. Russia has not made data from the earlier trials public. Russia has 890,799 confirmed COVID-19 cases, fourth highest in the world, Johns Hopkins data shows, and at least 14,973 Russians have died. Scott Gottlieb, former commissioner of the U.S. Food and Drug Administration, said he would not take the Russian vaccine, \"certainly not outside of a clinical trial right now.\" In an interview with CNBC, Gottlieb said in addition to the limited number of patients involved in trials, it appears to be similar to a vaccine being developed by Chinese biotech CanSino which is currently in clinical trials in Canada. \"Early data on that vaccine is not very encouraging,\" he said. \"A lot of people had antibodies to the viral vector itself, so they effectively neutralized the viral vector, because it was based on a common cold.\" It's not clear if the Russian trial will also find patients have prior immunity, he said. iframe.twitter-tweet { width: 100% !important; } Florian Krammer, professor of microbiology at the Icahn School of Medicine at New York's Mount Sinai Hospital, said he too would not take any vaccine that had not been thoroughly investigated. \"Not sure what Russia is up to but I certainly would not take a vaccine that hasn't been tested in Phase III,\" he said on Twitter. \"Nobody knows if its safe or if it works. They are putting HCWs (health care workers) and their population at risk.\" iframe.twitter-tweet { width: 100% !important; } Russia is planning to start inoculation with the vaccine in October and will offer voluntary vaccination to the country's health care workers and teachers first. After that, it's hoping to roll out the vaccine at home and overseas. Kirill Dmitriev, head of Russia's Direct investment Fund, which partnered with Gamaleya Institute for the vaccine, said Russia had already received requests from 20 countries, including Brazil, Indonesia, and the United Arab Emirates, the Journal reported. So far, Russia has orders for one billion doses of Sputnik-V, he said. Dr. Michael Osterholm, director of the Center of Infection Disease Research and Policy at the University of Minnesota, reiterated his message that the virus has infected just 8% to 10% of Americans, but will not stop until at least 50% to 70% are infected. \"We can get there through natural disease, or we can get there through a vaccine,\" he said in an interview on MSNBC. \"We can't count on the vaccine yet being there, and so we have to come to grips with this virus. We have to learn how to deal with it. And we're not. we're ignoring it, thinking that it'll go away, and it's not going to happen.\" See:Coronavirus update: U.S. case tally tops 5 million, more than one-quarter of the 20 million global cases"}]}