{"article": [{"url": "https://www.marketwatch.com/story/birx-warns-of-pandemics-dangerous-new-phase-as-pelosi-assails-her-credibility-2020-08-02", "published": 1596394340.0, "headline": "Birx warns of pandemicâ\u0080\u0099s dangerous â\u0080\u0098new phase,â\u0080\u0099 as Pelosi assails her credibility", "body": "Dr. Deborah Birx, the coordinator of the White Houseâ\u0080\u0099s coronavirus task force, warned Sunday that the COVID-19 pandemic has entered a â\u0080\u009cnew phase,â\u0080\u009d while House Speaker Nancy Pelosi said she has no confidence in Birx. Speaking Sunday on CNNâ\u0080\u0099s â\u0080\u009cState of the Union,â\u0080\u009d Birx said the coronavirus is much more widespread than it was months ago. â\u0080\u009cWhat we are seeing today is different from March and April. It is extraordinarily widespread. Itâ\u0080\u0099s into the rural as equal urban areas,â\u0080\u009d Birx said. â\u0080\u009cTo everybody who lives in a rural area, you are not immune or protected from this virus.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } Birx told CNN that people need to keep wearing mask and distancing, and states need to take more precautions and restrict large gatherings, noting that each state needs unique, â\u0080\u009cdramatically tailoredâ\u0080\u009d plans. She also said that people need to understand the risks of vacationing in certain spots. â\u0080\u009cIf youâ\u0080\u0099ve chosen to go on vacation into a hot spot, you really need to come back and assume youâ\u0080\u0099re infected,â\u0080\u009d she said. Meanwhile, Pelosi, the California Democrat, told ABC Newsâ\u0080\u0099 â\u0080\u009cThis Weekâ\u0080\u009d that Birx should be doing more to refute President Donald Trumpâ\u0080\u0099s inaccurate remarks about the coronavirus. Unlike Dr. Anthony Fauci â\u0080\u0094 who Pelosi has praised â\u0080\u0094 Birx has not made a point of publicly correcting the president. â\u0080\u009cI think the president is spreading disinformation about the virus and she is his appointee,â\u0080\u009d Pelosi told ABC News. â\u0080\u009cSo I donâ\u0080\u0099t have confidence there, no.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } Pelosi pointedly did not deny a report by Politico last week that said she had called Birx â\u0080\u009cthe worstâ\u0080\u009d in a meeting with Trump administration officials, accusing her of spreading disinformation. Birx defended herself on CNN, saying sheâ\u0080\u0099s willing to stake her career on using scientific data to â\u0080\u009csave more lives,â\u0080\u009d and suggested Pelosiâ\u0080\u0099s comments were in response to a New York Times report in July â\u0080\u0094 which Birx has disputed â\u0080\u0094 that claimed Birx was too eager to embrace overly optimistic projections about the pandemic. The White House on Sunday decried Pelosiâ\u0080\u0099s criticism. â\u0080\u009cIt is deeply irresponsible of Speaker Pelosi to repeatedly try to undermine & create public distrust in Dr Birx, the top public health professional on the coronavirus task force,â\u0080\u009d Alyssa Farah, the White Houseâ\u0080\u0099s director of strategic communications, tweeted Sunday. â\u0080\u009cItâ\u0080\u0099s also just wrong. Period. Hard stop.â\u0080\u009d As of Sunday evening, the U.S. had more than 4.6 million confirmed COVID-19 cases and nearly 155,000 deaths, according to Johns Hopkins data, both figures by far the most of any other country."}]}