{"article": [{"url": "https://www.marketwatch.com/story/review-the-new-mercedes-benz-s-class-2020-10-05", "published": 1602047420.0, "headline": "Review: The new Mercedes-Benz S-Class", "body": "Mercedes calls the new S-Class sedan “the heart of our brand.” With an acknowledgment like that, it’s easy to see why the German company has poured so much of its mechanical prowess and technical might into this large and luxurious machine, which goes on sale in the U.S. next spring as a 2021 model. The new S-Class is powerful, too. The two available engines in the U.S. version of this spacious all-wheel-drive (AWD) sedan include a turbocharged 3.0-liter inline-6 with 429 horsepower (S 500) or a twin-turbo 4.0-liter V8 with 496 horsepower (S 580). Both powertrains are mounted to a 9-speed automatic transmission, and both profit from an integrated 48-volt starter/generator that aids economy, power, and smoothness. As you’d expect of a flagship Mercedes sedan, the new S, known internally as the W223, is packed with safety and driver-assist technologies, many supported by onboard processing with 50 percent more power. Also, the new 2021 Mercedes-Benz S-Class now has the latest version of the MBUX “Hey Mercedes” user interface, which has better voice recognition and can function in 27 languages. Interestingly, the new S also can store seven different driver profiles (each with personalized preset settings for the seats, the mirrors, the audio, the chassis). The car recognizes the driver in four ways: through fingerprint authentication (via a touchpoint), facial recognition (via a tiny camera pointed at the driver), voice identification (using the microphone of the MBUX system), or a PIN that can be entered. Just how luxurious is the new S? Consider this: The heated and cooled front seats of the base model have 10 different massaging programs, each offered in two levels of intensity and in sessions that last 8 or 18 minutes. Each front seat has 18 motors and six fans. The new S also is available with up to five digital screens (two in front and three in back, with one of those being a removable tablet) plus rear-seat frontal airbags. In a frontal collision, airbags deploy from the rear of the front backrests to protect the two folks in each outer rear seat. The bags deploy from a spot below the color touchscreens on the back of the front seats.What’s new for 2021? The S-Class is an all-new vehicle for 2021, based on a new chassis with an aluminum-intensive body. All models that come to the U.S. are long-wheelbase versions with 4Matic all-wheel drive. What we like 4Matic all-wheel drive Potent engine offerings Packed with technology Available rear-seat airbags Available rear-wheel steering What we don’t Expected starting price of about $100,000 Too cautiously styled? No hybrid (or electric model) for the U.S. AMG Line has reduced rear steering angle How much? Estimated at $100,000Fuel economy Buyers in the U.S. have a choice of engines. You can get a turbocharged 3.0-liter inline-6 (with 429 horsepower and 384 lb-ft of torque) in the S 500. If you even more power, the twin-turbo 4.0-liter V8 in the S 580 puts out 496 horsepower and a whopping 516 lb-ft of torque. Both powerplants mate to a 9-speed automatic transmission, and both have a 48-volt mild hybrid system with an integrated starter/generator that adds21 horsepower and 184 lb-ft of torque. EPA fuel-economy figures for the 2021 Mercedes-Benz S-Class sedans have not been released. For some perspective, consider that last year’s S 450 4Matic, powered by a twin-turbo 3.0-liter V6 with 363 horsepower, was rated by the EPA at 18 miles per gallon city/28 mpg highway. We expect the new S 500, with a turbo 3.0-liter inline-6, to post similar numbers. Also, last year’s S 560 4Matic, powered by a twin-turbo 4.0-liter V8 with 463 horsepower, was rated at 17 mpg city/27 mpg highway. Don’t be surprised if the new S 580, also powered by a twin-turbo 4.0-liter V8, posts similar mpg numbers.Standard features and options Naturally, standard features abound on the 2021 Mercedes S-Class. On the Luxury Line base model (if you can call it that), the S-Class has a panoramic sunroof and a beautiful leather-upholstered interior with a 12.3-inch digital instrument cluster, a large 12.8-inch central OLED touchscreen, and massaging multi-contour seats with heating and cooling. The 2021 S-Class also has soft-close doors, the latest “Hey Mercedes” driver interface, and a navigation system with helpful augmented-reality arrows that point you in the right direction. Read: What’s it like to own an Audi e-tron? Airmatic air suspension and 19-inch alloy wheels are standard, as is a new multifunction steering wheel, wireless smartphone charging, wireless Apple AAPL, +1.74% CarPlay/Android Auto, and a 360-degree surround-view camera. Other standard niceties include power rear sunshades, six USB-C ports, and a Burmester audio system with 15 speakers. While the S-Class AMG Line has some attractive AMG styling cues and unique alloy wheels, the Executive Line is the S-Class with the most standard equipment. Available only as a V8-powered S 580, the Executive Line features active multi-contour seats (with neck & shoulder heating) and an electrically adjustable rear seat. Perhaps most significant, the Executive Line has the auto industry’s first rear-seat airbags designed to protect the outer rear passengers in frontal impacts. The airbags deploy from the back of the front seatbacks, from a spot just below the digital touchscreens. Other S-Class Executive Line hardware includes 4-zone climate control, wireless rear smartphone charging, and rear-seat interface for the MBUX infotainment system. The Executive Line also comes standard with rear-axle steering, which at low speeds contributes up to 10-degrees of opposite-phase rear steering to tighten the turning circle of the big new sedan by 6 feet. While that may not seem like much, the S-Class Executive Line has the same turning radius as the much smaller A-Class sedan, which means it will be much easier to park at the mall (if we ever do that again) or pull a U-turn on a narrow neighborhood street. Also notable: The AMG Line S-Class can be ordered with rear-axle steering, but it gets only 4.5 degrees of it because of clearance issues related to its wider rear tires. Options on the standard S-Class Luxury Line are highlighted by Nappa leather upholstery and a powerful Burmester 4D surround-sound audio system with 30 speakers. Its claim to fame? The seats reverberate to the music, giving the driver and front passenger a good “feel” for the tunes. (For those wondering, that function can be shut off.) The new S-Class also is available with a 3-D Technology Package (featuring 3-D gauges and a head-up display), plus 20-inch wheels and a Warmth & Comfort Package (heated rear seats and heated front and rear armrests). Also on MarketWatch: Which is better? The Tesla Model S and Model 3 compared S-Class AMG Line models are available with a heated steering wheel and the AMG Night Package, plus a Warmth & Comfort Package and 4.5 degrees of rear-axle steering. You can also order AMG alloy wheels in 20- or 21-inch sizes. As the top S-Class offering, the S 580 Executive Line can be ordered with a finer grade of Nappa leather, a 3-D Technology Package (3-D instrument cluster, a head-up display, and augmented-reality navigation), plus the Warmth & Comfort Package and a system that keeps the driver fresh and alert via the seat massagers and a pleasant smelling air ionizer. Twenty-inch alloy wheels with 10 spokes also are available on the Executive Line.Safety It’s too early to have any crash-test data on the 2021 Mercedes S-Class sedan, either from the National Highway Traffic Safety Administration (NHTSA) or the Insurance Institute for Highway Safety (IIHS). Nevertheless, it’s clear that the new S-Class sedan has been built with occupant safety in mind. Take, for example, the rear-seat airbags that are standard on the S-Class Executive Line. The first of their kind, they deploy from the rear of the front seatbacks to greatly reduce the head and neck loads felt by the two outer rear passengers in a frontal collision. All new S-Class models also benefit from Pre-Safe Plus, which automatically tightens the seat belts (and closes the windows and sunroof) before a collision. It also applies the brakes to prevent the S-Class from rolling post-accident into any other possible dangerous situation. And with Pre-Safe Sound, also standard, the S-Class emits a loud sound right before impact, triggering a protective reflex in the ear that helps prevent hearing damage during the boom of the actual crash. Also see: A look at Cadillac’s first electric car, promising a range greater than 300 miles Also worth noting: There’s another new safety technology coming on the 2022 S-Class that will raise the car a few inches before it gets T-boned by another car. This, using the E-Active Body Control system, helps direct impact forces at the stronger part of the chassis at the doorsill level. Again, this clever system will make its U.S. debut for the 2022 model year.Behind the wheel Autotrader hasn’t driven the new 2021 Mercedes-Benz S-Class yet. We’ll report back soon.Other cars to consider 2020 Audi A8 L — Looking for another big German sedan with standard all-wheel drive? Hard to go wrong with the handsome and slightly longer Audi A8 L 60, whose twin-turbo 4.0-liter V8 is mounted much farther forward in the chassis. 2020 BMW 750 xDrive Series BMWYY, -1.10% –Another big AWD German, this Bavarian sedan packs a 523-horsepower punch and outstanding driving dynamics. 2020 Cadillac CT6 Platinum — This Caddy is 1.2 inches shorter than the S-Class, but the CT6 Platinum version is especially potent. It’s powered by a turbocharged 4.2-liter V8 with a nice even 500 horsepower. A bit less expensive than the Mercedes, too, and equipped with Cadillac’s impressive semiautonomous Super Cruise. Genesis G90 — This big Korean sedan is a couple of inches shorter than the S-Class, but you’re bound to be impressed by its quality, its elegance, its price, and its fantastic warranty. The 5.0L Ultimate model is powered by a 5.0-liter V8 with 420 horsepower. See: How does the Genesis G90 stand up to the Lincoln Continental? Lexus LS 500 — As a large 4-door showcasing the technical might of Toyota TM, -0.65% , the big LS is an impressive sedan. Its less than an inch shorter than the new S, and it’s powered by a twin-turbo 3.5-liter V6 with a stout 416 horsepower. Quality is a given.Questions you may ask When does the 2021 Mercedes-Benz S-Class go on sale? Autotrader has been told that the all-new Mercedes-Benz S-Class sedans will go on sale in the U.S. this spring as 2021 models. How large is the central touchscreen in the new S-Class? The handsome OLED (organic light-emitting diode) central display in the new S-Class is 9.4 x 8.6 inches, and it has a diagonal screen size of 12.8 inches. Mercedes says that’s 64 percent larger than in the preceding S. The digital instrument panel of the new S is 11.5 inches wide and 4.3 inches tall, with a diagonal length of 12.3 inches. What are some of the standard driving-assistance programs in the 2021 S-Class? The better question might be: “What doesn’t the new S-Class have?” In addition to adaptive cruise control (with predictive speed regulation) and automatic emergency braking, the new 2021 S-Class comes with lane-keep assist, active lane-centering, active steering assist, traffic sign assist, active lane-change assist, attention assist, active brake assist, blind-spot assist, an exit warning, and even evasive steering assist. Also see: 8 new luxury SUVs for under $50,000 Where does Mercedes-Benz make the 2021 S-Class? Mercedes-Benz builds the new S-Class sedan in Sindelfingen, Germany, at a thoroughly modern new facility called Factory 86. How does the new S-Class compare in size to the previous S-Class? The 2021 Mercedes S-Class is a tiny bit larger than the outgoing S-Class. It’s 1.3 inches longer, it has a 2-inch-longer wheelbase, and its front and rear tracks have increased by 1.4 and 2.0 inches, respectively. The headroom in front is about the same as before, but there’s about a half-inch more in back. Rear legroom has improved by about an inch. What’s bigger, the Mercedes S-Class or the BMW 7 Series? The BMW 7 Series is a 207.4-inch sedan with a 126.4-inch wheelbase. At 207.0 inches, the new Mercedes S-Class is fractionally shorter than the big BMW, but it has a longer 127.0-inch wheelbase.Autotrader’s advice If you’re going to be a bear, you might as well be a grizzly. That’s our way of recommending the flagship S 580 Executive Line. Yes, it’s the most opulent S-Class sedan available, and yes, it has the 30-speaker Burmester 4D stereo, but it’s also the only new S-Class with rear airbags and 10 degrees of active rear steering, the latter something we can’t wait to try. Regardless of model, though, the increasingly digital 2021 Mercedes-Benz S-Class sedan is a fitting replacement for the outgoing S, which has had a nice long run. This story originally ran on Autotrader.com."}]}