{"article": [{"url": "https://www.marketwatch.com/story/google-searches-for-k-shaped-recovery-white-supremacy-and-how-to-move-to-new-zealand-spiked-during-the-debate-2020-09-30", "published": 1601477300.0, "headline": "Google searches for K-shaped recovery, white supremacy and 'how to move to New Zealand' spiked during the debate", "body": "The first presidential debate between Donald Trump and Joe Biden may have raised more questions than it answered. While the political opponents battled over the government response to the coronavirus pandemic, economic recovery and civil unrest across the country - often talking over each other and steamrolling over moderator Chris Wallace in the process - viewers turned to search engines like Google GOOG, +1.97% and dictionary sites like Merriam-Webster to help decipher what the candidates were saying. During the first hour of the roughly 90-minute debate, Google's top trending searches were: 1. K-shaped recovery 2. Roe v. Wade 3. How many people have pre existing conditions? 4. Who is winning the debate? 5. Affordable Care Act These correlated with the candidates arguing over whether we'll see a V-shaped (Trump) or K-shaped (Biden) economic recovery, as well as Trump nominating conservative Amy Coney Barrett for Ruth Bader Ginsburg's vacant Supreme Court seat, and concerns that she could overturn Roe v. Wade, the landmark decision that legalized abortion. Opinion: About that K-shaped recovery: For half of America, the economy is still terrible Trump and Biden also sparred over health care, with Biden accusing Trump of cutting coverage for \"100 million people who have pre-existing conditions\" in the president's attempts to scrap the Obama-era Affordable Care Act. Trump countered that, \"There aren't 100 million people with pre-existing conditions.\" The real number depends upon whom you ask: The Kaiser Family Foundation estimated that at least 53.8 million adults had pre-existing conditions in 2018, but a 2017 Department of Health and Human Services study estimated that 133 million people had pre-existing conditions that would make them unable to buy insurance. Read more:Here's where Trump and Biden stand on health care Search interest for \"white supremacy\" also surged during the debate, after Wallace asked Trump to condemn white supremacists and militia groups, and to tell them to stand down and not add to the violence in cities that have been rocked by protests against racial injustice and police brutality. The president's response left many critics concerned. He told the Proud Boys, a far-right group that the Southern Poverty Law Center has classified as a hate group, and that has been suspended by Twitter TWTR, -0.23%  and Facebook FB, +0.26%, to \"stand back and stand by.\" He then added, \"But I'll tell you what, somebody's got to do something about antifa and the left.\" iframe.twitter-tweet { width: 100% !important; } This exchange led the top trending-related search, \"Trump's response to white supremacy,\" to spike more than +5,000%, Google reported. That subject struck a nerve with a lot of viewers, as \"Proud Boys\" was the top Twitter trend on Wednesday morning, and \"Trump\" and \"white supremacy\" also dominated Google trends early in the day. The New York Times reported that the Proud Boys themselves were calling Trump's comments \"historic,\" and that in one channel dedicated to the Proud Boys on the private messaging app Telegram, members considered the president's words a \"tacit endorsement of their violent tactics.\" iframe.twitter-tweet { width: 100% !important; } Merriam-Webster tracked dictionary lookups during and after the debate, as well, finding that the most searched words included \"white supremacist,\" \"antifa,\" \"petulant,\" \"racism,\" \"poll watcher,\" \"moderator\" and \"standby,\" which could all be traced back to Trump and Biden's heated exchanges on Tuesday night. iframe.twitter-tweet { width: 100% !important; } Dictionary.com also picked up on CNN's Dana Bash calling the debate a \"sh-show,\" clarifying that the crude phrase is one word, and saying that searches for it suddenly spiked on Tuesday night. iframe.twitter-tweet { width: 100% !important; } What's more, U.S. Google searches for \"how to move to New Zealand\" also skyrocketed during the debate, according to Google Trends and reported by Newshub, a New Zealand media company. People in the state of Oregon (home to Portland, which has been a hotbed of protests against injustice) googled \"how to move to New Zealand\" the most, while residents in Washington, Nevada and Utah were also especially interested, according to the data. Related:Here's how you can get foreign citizenship and a second passport in as little as two years Read MarketWatch's debate analysis here, and track our 2020 election coverage here."}]}