{"article": [{"url": "https://www.marketwatch.com/story/some-lower-income-households-cant-fully-afford-bills-medical-care-or-food-because-of-covid-19-and-many-didnt-get-stimulus-checks-11596635198", "published": 1596980720.0, "headline": "Some lower-income households can't fully afford bills, medical care or food because of COVID-19 - and many didn't get stimulus checks", "body": "Nearly 43% of households in a new survey reported seeing income reduction due to the coronavirus. Mario Tama/Getty Images As lawmakers negotiate a second relief package to mitigate COVID-19's health and economic toll, a new study sheds light on how lower-income Americans have fared during the pandemic - including those who missed out on the first round of stimulus checks. Nearly half of lower-income U.S. households report being unable to completely pay for at least one basic expense because of the coronavirus, according to a survey conducted by the research and policy organization Prosperity Now and sponsored by H&R Block HRB, -1.80%.  About 24% of respondents said they had skipped paying bills or paid late because of the pandemic's economic blow; some also said they had forgone essential medical care (17%), couldn't afford the kind or quantity of food they needed (17%), or didn't pay their full rent or mortgage amount (10%). Another 10% reported having overdrafted their bank account or borrowed from a payday lender, pawn shop or car-title lender. \"Most of these hardship impacts cost additional money for the households who can least afford it,\" wrote report authors Guillermo Cantor and Stephanie Landry, citing costs like late fees and interest charges. \"They also leave families vulnerable to additional risks, including eviction or foreclosure, utility shut-off, damage to credit reports and scores, account closure, and/or cycles of borrowing predatory lending products.\" About 84% of the lower-income households in the survey said they received a stimulus check from the government. But while the $2.2 trillion CARES Act did provide a much-needed cash infusion to many families, \"many households were not able to access these supports or were excluded from them entirely,\" the report said. For example, lower-income households who fell into relatively higher income brackets were more likely to land a stimulus check than their lowest-income-bracket counterparts. Some 87% of households making $25,000 to $49,999 a year said they had received a stimulus payment, compared to just under 79% of households making less than $25,000 a year. Meanwhile, white low-income households (88%) were more likely than their Black (80%), Latino (79%) or Asian (77%) counterparts to say they received an economic-impact payment - suggesting the payments \"did not reach different segments of the population evenly,\" Cantor and Landry wrote. \"These disparities are especially troublesome as communities of color and low-income communities, which are already vulnerable, are disproportionately bearing the brunt of this financial crisis and yet have been less likely to receive a major piece of the federal government's financial relief,\" the report said. The survey sample included 2,252 lower-income households with a similar demographic distribution to the overall U.S. population. The report defined \"lower-income households\" as those making $49,999 or less in annual income. Possible reasons for not receiving a stimulus check include the Internal Revenue Service not having a person's bank-account details on file, debt collectors seizing money that suddenly appears in a bank account, or a person's immigration status complicating their payout, MarketWatch previously reported. As the present study points out, the federal government extended the tax-filing deadline, allowed people to register for stimulus payments as a \"non-filer\" and sent some payments as prepaid debit cards rather than checks to help lower-income families access their payments. It also waived tax-filing requirements for recipients of some federally administered benefits, though this automatic-payment approach still leaves out about 12 million Americans, said the Prosperity Now report, citing an estimate from the progressive Center on Budget and Policy Priorities. All told, almost 38% of lower-income households surveyed said their finances were either \"somewhat\" or \"much\" worse off because of the pandemic - a figure that tracked with the nearly 43% of households that reported seeing income reduction due to the coronavirus. About 35% of both Black and white survey respondents said they felt worse off, while 44% of Latino respondents and 47% of Asian respondents said the same. Days after the CARES Act's $600-a-week federal unemployment benefit ran dry, congressional leaders were still hashing out a coronavirus relief package. While Republicans and Democrats disagree on the extra $600 in unemployment, both sides have proposed sending Americans a second round of stimulus payments."}]}