{"article": [{"url": "https://www.marketwatch.com/story/postal-service-head-slated-to-testify-friday-before-senate-panel-11597764060", "published": 1597765880.0, "headline": "Postal Service head suspends changes until after November election", "body": "Postmaster General Louis DeJoy arrives at a meeting at the office of Speaker of the House Rep. Nancy Pelosi earlier this month. Getty Images Postmaster General Louis DeJoy on Tuesday pledged that the mail service is ready today to handle all of the mail-in ballots it receives in November. “The Post Office is ready today to handle whatever volume of election mail it receives this fall. We will deliver the nation’s election mail on time and within our well-established service standards,” DeJoy said in a statement sent to the news media. Since taking over the Post Office in May, DeJoy has launched an effort he has characterized as designed to cut costs at the mail service. He has banned overtime work and extra routes. Pictures of blue mailboxes being collected from street corners have sparked outrage though, as have firsthand accounts of sorting machines being decommissioned and even destroyed at some Postal Service locations. Democrats worry the efforts are designed to slow down the post-office delivery of mail-in ballots in this November’s election during the coronvirus pandemic and perhaps be part of a long-running campaign by President Trump to raise questions about the legitimacy of the vote. Some House Democrats even asked the Federal Bureau of Investigation to investigate the Postmaster General’s decisions. In his statement, DeJoy defended his planned reforms of the mail service as essential but said he would suspend them until after the Nov. 3. election. “To avoid even the appearance of any impact on election mail, I am suspending these initiatives until after the election is concluded,” DeJoy said. Democrats were not satisfied with Dejoy’s statement. Senate Minority Leader Charles Schumer said the cost cutting must be permanently stopped. He added that ballots should be treated as first class mail. https://twitter.com/SenSchumer/status/1295790824878485504 Critics said DeJoy should take more steps and reverse his bans on overtime and extra delivery trips. https://twitter.com/JHWeissmann/status/1295784147370336256 Dejoy has been invited to testify Friday to the Senate Homeland Security and Governmental Affairs committee, the panel announced. DeJoy had previously been set to testify on the issue next Monday to a House panel. The Republican-controlled Senate panel may give him a friendlier platform to explain his controversial reform efforts than the Democratic-controlled House panel might. DeJoy was a major donor to the Trump campaign. Speaker Nancy Pelosi has called the House back from vacation for a Saturday session to consider legislation that would reverse the reforms and block DeJoy from taking any further steps to overhaul the Postal Service. The legislation also includes $25 billion in aid for the mail service. Treasury Secretary Steven Mnuchin on Tuesday suggested the mail service didn’t need more funding. “The post office has plenty of cash on hand,” Mnuchin told CNBC. The mail service has about $15 billion available and an additional $10 billion if needed, he added. Key Words (April 2020): White House may not have explicitly threatened a veto but made clear Trump’s strong opposition to post-office rescue funds in CARES Act relief legislation early this year"}]}