{"article": [{"url": "https://www.marketwatch.com/story/small-business-confidence-climbs-in-june-nfib-2020-07-14", "published": 1594707980.0, "headline": "Small business confidence climbs in June: NFIB", "body": "Small-business owners confidence in the U.S. economy rose in June for second consecutive month as the country continued to reopen, data from a survey compiled by the National Federation of Independent Business showed Tuesday. The NFIB Small Business Optimism Index stood at 100.6 in June, a 6.2 points increase compared with May's reading. Economists polled by Dow Jones Newswires had expected a lower level of 98.0. The NFIB is a monthly snapshot of small businesses in the U.S., which account for nearly half of private sector jobs. Economists look to the report for a read on domestic demand and to extrapolate hiring and wage trends in the broader economy. \"We're starting to see positive signs of increased consumer spending, but there is still much work to be done to get back to pre-crisis levels,\" NFIB's chief economist Bill Dunkelberg said in prepared remarks. Despite the strong gains registered in May and June, the index is still below February's pre-pandemic level of 104.5. June's results, based on 670 companies polled across the country, saw increases in eight of the 10 index components compared with May. Owners are anticipating improving sales as the economy continues to reopen, with real sales expectations in next three months increasing 37 points to a net 13%. Outlook for general business conditions over the next six months improved five points to a net 39%. \"Optimism about future conditions improved and small-business owners indicate they expect the recession to be short-lived,\" the NFIB said. The percentage of owners thinking it's a good time to expand improved eight points to 13%. Hiring plans increased eight points to a net 16%. Labor market remains weak, according to respondents, but there are signs of potential strengthening in the near term. The net percentage of owners reporting inventory increases went up slightly, but inventory levels remained surprisingly low, the NFIB said. While small-businesses owners felt more optimistic about the future, they also reported that the current crisis is taking a toll on earnings when looking at the last three months. Positive profit trends fell nine points to a net negative 35%, data showed. Asked about which is the most important problem they face, small-business owners reported quality of labor and taxes. The Uncertainty Index decreased one point in June to 81. \"Small businesses are navigating the various federal and state policies in order to reopen their business and they are doing their best to adjust their business decisions accordingly,\" Mr. Dunkelberg said. Write to Xavier Fontdegloria at xavier.fontdegloria@wsj.com"}]}