{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-cases-near-30-million-trump-contradicts-cdc-head-on-vaccine-timetable-and-again-derides-face-masks-2020-09-17", "published": 1600355600.0, "headline": "Coronavirus update: Global cases near 30 million; Trump contradicts CDC head on vaccine timetable and again derides face masks", "body": "The number of confirmed cases of the coronavirus that causes COVID-19 worldwide continued to head toward 30 million on Thursday, and the U.S. case tally climbed above 6.6 million, as President Donald Trump contradicted the head of the main U.S. public health agency to insist a vaccine would be ready in weeks. At a Wednesday briefing, Trump disputed comments made earlier in the day by Robert Redfield, head of the Centers for Disease Control and Prevention, who told Congress that a vaccine may not be available to the general public until well into next year. Redfield also said a face mask could be “more guaranteed to protect me against Covid than when I take a Covid vaccine.” “As soon as it’s announced, we’ll be able to start,” Trump said. “That’ll be from mid-October on — maybe a little bit later than that. We’ll be all set so as soon as it’s given the go-ahead — they’re doing trials, as you know — so as soon as it’s given the go-ahead, we will get it out, defeat the virus.” It’s not the first time that Trump has contradicted his own health experts. “I believe he was confused,” the president said about Redfield. Trump also again mocked his presidential opponent, Democrat Joe Biden, for wearing a face mask in public. See:Coronavirus vaccine likely to be unavailable to most Americans until well into 2021 His comments again raised concerns that science and health experts and the agencies they work for are being undermined and politicized during the current administration. They come just a day after the news that Michael Caputo, the assistant secretary of health for public affairs, will take a 60-day leave of absence “to focus on his health and the well-being of his family,” a statement from the Department of Health and Human Services said. Read also:House Democrats to probe whether officials meddled with CDC coronavirus data Caputo has been accused of trying to muzzle an important scientific report in the midst of the coronavirus pandemic, and apologized Tuesday for a separate video in which he reportedly says scientists battling the virus are conspiring against President Donald Trump. HHS also said Dr. Paul Alexander, who reportedly pressured officials to alter a key CDC report, is leaving the department. World Health Organization head of emergencies Mike Ryan told reporters at a Thursday briefing that it’s important to have “consistent messaging” from all levels by top officials. “It isn’t easy for everyone to be on message all the time,” Ryan said. “What is important is that governments, scientific institutions, step back, review the evidence, and give the most comprehensive, easy-to-understand-and-digest information so that people can take the appropriate action.” The public need to understand that means complying with all of the measures recommended by health experts, from frequent hand washing to social distancing and wearing a face mask, said Ryan. Dr. Vin Gupta, affiliate assistant professor of Health Metrics Sciences at the Institute for Health Metrics and Evaluation (IHME) at the University of Washington, agreed. “The science is that if 95% of Americans wore masks, we would follow the trajectory of Hong Kong, or these places that were puddle jumps from Wuhan, and have not experienced nearly what we’ve experienced,” he told MSNBC in an interview. The U.S. now has “definitive proof” of what Trump knew in February, said Gupta, namely that the virus was airborne. “That should trigger (the response) to ensure not only that every American has access to a mask, but to one that is well fitting and high quality,” said Gupta. The president tried to pin the blame for total COVID-19 deaths on “blue states,” arguing if you take out such areas — which include many of the largest cities by population, such as New York and Los Angeles — the death count would be far lower. He again urged Democratic governors to reopen their states. But about 47% of COVID-19 deaths have occurred in red states, versus 53% in blue states, according to the Washington Post. Over time, the blue states that were early hot spots, have succeeded in containing the spread, and are seeing fewer hospitalizations and deaths. Since mid-June, the majority of new deaths are occurring in red states, where governors moved fast to reopen for business. The University of Washington’s Institute on Health Metrics is expecting nearly 413,000 deaths by year-end, half of which are expected to occur in red states. In other news: • The WHO is warning of “alarming rates of transmission” of COVID-19 across Europe and cautioned governments against shortening quarantine periods, Agence France-Presse reported. Hans Kluge, WHO head of Europe, said rising infections “should serve as a wake-up call for all of us.” Kluge said the WHO is sticking with its guidance for individuals to quarantine for 14 days if exposed to the coronavirus. France has reduced the recommended period for self-isolation to seven days, while the U.K. and Ireland have cut it to 10 days. • A new study has found that people of color are far more likely than white people to test positive for COVID-19, to be hospitalized and to die, supporting other research on the racial disparities among coronavirus patients. The study from the Kaiser Family Foundations’ Epic Health Research Network analyzed the records of about 50 million patients across 21 states. “Although there were not large differences in testing by race and ethnicity, among those tested, Hispanic patients were over two and a half times more likely to have a positive result (311 per 1,000) and Black and Asian patients were nearly twice as likely to test positive (219 and 220 per 1,000, respectively) compared to White patients (113 per 1,000),” the study found. • China has locked down a city located on the border with Myanmar and started a campaign to test the entire population of more than 200,000 people, the Guardian reported. The move comes after two new cases surfaced among travelers from Myanmar. Residents have been ordered to stay at home and checkpoints have been set up to stop people entering or leaving. • Just one day after officials said they are planning to lock down poorer neighborhoods in Madrid to stem the spread of infections, plans have changed, the Guardian reported. The justice minister in the Madrid regional government, Enrique Lopez, said today the word confinement “generates anxiety” and stressed that the government planned only to “reduce mobility and contacts” in areas with a high rate of infections but would not lock them down.Latest tallies There are now 29.9 million confirmed cases of COVID-19 worldwide, according to data aggregated by Johns Hopkins University, and 942,631 people have died. At least 20.4 million have recovered, the data show. The U.S. has the highest tallies in the world with 6.6 million cases and 197,223 deaths. Brazil has the second highest death toll at 134,106 and third highest case tally at 4.4 million. India is third with 83,198 deaths and second with 5.1 million cases. Mexico is fourth with 71,978 deaths and seventh with 680,931 cases. The U.K. has 41,794 deaths and 384,075 cases, the highest death toll in Europe and fifth-highest in the world. China, where the illness was first reported late last year, has 90,262 cases and 4,736 deaths, according to its official numbers. What’s the latest medical news? Eli Lilly and Co. LLY, +2.20% and Amgen Inc. AMGN, -1.41% will collaborate on COVID-19 antibody treatments as a way to significantly boost global supply capacity. The announcement comes a day after Lilly said interim data from a mid-stage clinical trial assessing its experimental antibody treatment reduced the rate of hospitalization as well as viral load in some COVID-19 patients. The investigational therapy, LY-CoV555, is produced using neutralizing antibodies gathered from patients who have recovered from COVID-19. The ongoing, randomized, double-blind, placebo-controlled Phase 2 study is expected to enroll a total of 800 participants, all of whom have mild to moderate symptoms and are being treated with LY-CoV555 in an outpatient setting. “Through this collaboration, the two companies will have the ability to quickly scale up production and serve many more patients around the world should one or more of Lilly’s antibody therapies prove successful in clinical testing and receive regulatory approval,” Lilly and Agmen said in a joint statement. Don’t miss:There are seven coronavirus vaccine candidates being tested in the U.S. — here’s where they stand Rigel Pharmaceuticals Inc. RIGL, -1.15% has started a randomized, double-blind, placebo-controlled Phase 2 clinical trial evaluating Tavalisse as a treatment for hospitalized COVID-19 patients. The study, which is sponsored by the National Heart, Lung and Blood Institute, will enroll about 60 patients and consider disease progression as well as safety and efficacy. “Expanding our clinical effort into this second trial in COVID-19 related lung injuries is critical,” Rigel CEO Raul Rodriguez said in a news release. The Food and Drug Administration approved Tavalisse as a treatment for chronic immune thrombocytopenia in adults in 2018. Quest Diagnostics Inc. DGX, +0.33% will sell a COVID-19 diagnostic test directly to consumers to use at home. The test, which requires nasal swab collection, previously received an emergency use authorization from the Food and Drug Administration. See now:Here’s what you need to know about clinical trials as drug makers push forward with coronavirus vaccine studies When a consumer orders the test online, a physician reviews the order before agreeing to send it out. Consumers can either perform the test at home and mail it back to Quest, or take the kit to a Walmart Inc. WMT, +1.00% drive-through pharmacy, perform the test, and then drop it off there. Finally, Moderna Inc. MRNA, +0.09%, which is currently conducting a Phase 3 trial of its mRNA COVID-19 vaccine candidate, plans to start developing a seasonal flu vaccine. “We are increasing our investment in vaccines and we will develop a seasonal flu vaccine given the unmet need for highly effective vaccines,” Moderna CEO Stéphane Bancel said in a news release.What’s the economy saying? The number of Americans who applied for unemployment benefits through state and federal programs fell in September for the first time in five weeks, but initial jobless claims are still very high and point to ongoing job losses due to the coronavirus pandemic, MarketWatch’s Jeffry Bartash reported. Initial jobless claims filed traditionally through state employment offices fell to 860,000 in the week of Sept. 6 to Sept. 11, the Labor Department said Thursday. Economists polled by MarketWatch had forecast new claims to fall to 870,000. New claims also fell for the first time since mid-August if self-employed workers who applied for benefits under a separate federal program are included. Some 658,737 people filed under the Pandemic Unemployment Assistance Act. See also:Stock markets have now seen the ‘peak of Fed stimulus’ unless these 2 things happen That put the number of actual or unadjusted new claims at 1.45 million, compared to 1.73 million in the prior week. Federal filings declined for the first time in five weeks. The labor market continues to heal from the viral recession, but unemployment remains extremely elevated and will remain a problem for at least a couple of years,” said chief economist Gus Faucher of PNC Financial Services in Pittsburgh. “With initial claims at almost four times their pace before the pandemic, layoffs are far higher than normal.” Separately, The Philadelphia Fed said its gauge of business activity in its region dipped in September. The regional Fed bank’s index fell to 15 from 17.2 in August. Any reading above zero indicates improving conditions. This is the fourth straight positive reading. Economists polled by MarketWatch expected a 13 reading. The major indexes moved lower, with the Dow Jones Industrial Average DJIA, +0.56% down more than 100 points and the S&P 500 SPX, +0.87% down about 0.7%.What are companies saying? • Delta Air Lines Inc. DAL, +0.39% said the debt offering planned with its SkyMiles IP Ltd. subsidiary was upsized to $9.0 billion from previous plans for a $6.5 billion offering. The offering will include an aggregate of $2.5 billion in 4.5% senior secured notes due 2025 and $3.5 billion in 4.75% senior secured notes due 2028. The company said it also expects to enter into a credit agreement providing for a $3.0 billion term loan facility. • Cinema operator The Marcus Corp. MCS, +0.65% is planning to offer $87 million in convertible bonds that mature in 2025, joining the many companies issuing record levels of debt and equity during the coronavirus pandemic. Proceeds will be used to pay the cost of capped call transactions that aim to reduce dilution on conversion. See also:Red-hot IPO market sends Snowflake surging and JFrog leaping, with more software companies to come • The Michaels Cos. Inc. MIK, -1.95% is planning to offer $500 million of 7-year bonds as the arts and crafts retailer joins the many companies issuing record levels of debt during the coronavirus pandemic. Proceeds will be used together with borrowings from a term loan and cash on hand to refinance an existing term loan and pay fees. • Perrigo Company PLC PRGO, +0.13% is voluntarily recalling albuterol sulfate inhalation aerosols over concerns that some may not dispense properly due to clogging. The Dublin-based maker of over-the-counter and generic health products already halted production and distribution of the aerosols. Perrigo is expecting to book a charge of $18 million to $22 million in the third quarter relating to the recall, and has not booked any revenue from the product since August. It reiterated its guidance for fiscal 2020 adjusted per-share earnings to range from $3.95 to $4.15, citing strong demand in the consumer self-care Americas business and faster-than-expected recovery in consumer self-care international and base prescription businesses that were hurt by the pandemic. Additional reporting by Connor Smith, Jaimy Lee, Tomi Kilgore, Tonya Garcia and Tim Rostan"}]}