{"article": [{"url": "https://www.marketwatch.com/story/consumer-sentiment-improves-in-late-september-and-hits-six-month-high-2020-10-02", "published": 1601638040.0, "headline": "Consumer sentiment hits a six-month high in September for best reading since COVID-19 erupted", "body": "Americans grew more optimistic toward the end of September as consumer sentiment reached a six-month high, reflecting more confidence in the U..S. economy after a summer lull. The final consumer sentiment survey in September climbed to 80.4 from a preliminary reading of 78.9, the University of Michigan said Friday. It was also up from August’s 74.1 score. The index now sits at the highest level since the pandemic erupted in March, mirroring the results of other household surveys. Earlier this week the Conference Board said its consumer confidence index also shot up to a pandemic high. Read:Consumer confidence surges to highest level of coronavirus era What happened: A decline in coronavirus cases earlier in the month helped lift the optimism of consumers, as did the creation of more jobs. The U.S. regained 661,000 jobs in September and 877,000 in the private sector, the government said earlier Friday. Read:U.S. adds 661,000 jobs in September and unemployment rate falls to 7.9% An index that measures current conditions rose to 87.8 from a preliminary 87.5 reading earlier in the month. Consumers also felt somewhat better about the rest of the year. An index that measures expectations for the next six months edged up to 75.6 from a preliminary 73.3 reading and 68.5 in August. “While consumers have anticipated gains in the national economy ever since the April shutdown, the September survey recorded a significant increase in the proportion that expected a reestablishment of good times financially in the overall economy,” said Richard Curtin, the chief economist at the group that produces the sentiment survey. Yet confidence was greater among wealthier Americans than other households, highlighting the wide disparity in who’s been hurt most by the coronavirus. Many workers in lower-paying jobs in hotels, restaurants, retail stores and other service-oriented businesses have suffered higher levels of unemployment. “The data indicate that lower-income households face continued income and job losses compared with the modest gains expected by upper-income households,” Curtin added. The big picture: Higher confidence has long been associated with stronger economic growth and faster hiring. Throughout the pandemic consumer confidence has been shaped by the ebb and flow of coronavirus cases and the steady return of people to work. As long as the virus remains under control, the economy is likely to continue to recover. But if the virus starts spreading faster again or rehiring slows, confidence is bound to suffer another blow. What they are saying? “The recovery is not being spread evenly across income groups. That is not surprising, though it is quite troubling,” said Joel Naroff of Naroff Economic Advisors. “Republicans are much more positive than Democrats, while political independents are broadly in the middle and more indicative of the overall result,” said chief economist Joshua Shapiro of MFR Inc. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% fell in Friday trading. President Trump contracting the coravirus and a lukewarm September employment report weighed on stocks."}]}