{"article": [{"url": "https://www.marketwatch.com/story/the-tech-industry-has-a-moral-imperative-to-take-action-on-inequity-new-silicon-valley-leader-says-11598640233", "published": 1598626280.0, "headline": "The tech industry has a â\u0080\u0098moral imperativeâ\u0080\u0099 to take action on inequity, new Silicon Valley leader says", "body": "Ahmad Thomas is the new chief executive of the Silicon Valley Leadership Group. MarketWatch Illustration/Silicon Valley Leadership Group| iStockphoto Ahmad Thomas is stepping into the CEO role at the Silicon Valley Leadership Group during a pandemic, a backlash against the tech industry and a reckoning on race and inequality across the nation. It might be the perfect time for him to show what the first Black chief executive of the SVLG â\u0080\u0094 and only the fourth CEO in the influential groupâ\u0080\u0099s history â\u0080\u0094 can do. â\u0080\u009cMaybe, just maybe, Iâ\u0080\u0099m the guy,â\u0080\u009d Thomas, who was most recently a Barclays BCS, +0.18% investment banker, told MarketWatch in an interview. He spoke about what he brings to his position at SVLG, the policy-advocacy group founded by Hewlett-Packard co-founder David Packard, which now has more than 350 member companies that include some of the biggest names in tech and business. Thomas also addressed questions about how the tech industry can help close racial and wealth gaps that are particularly pronounced in the valley, where 13% of households hold more than 75% of the regionâ\u0080\u0099s wealth, according to the Silicon Valley Index. This interview, the latest installment of The Value Gap, has been edited for length and clarity. MarketWatch: Youâ\u0080\u0099re the first African-American CEO of SVLG. Can you talk about the significance of that during this time? Thomas: Iâ\u0080\u0099m California-born and raised, a small-town kid from Lompoc who grew up in a military family. My dad is a Vietnam vet, Air Force vet; my mom a retired RN. Sheâ\u0080\u0099s from the Caribbean, a West Indian from Trinidad [and] Tobago, and my dad is from rural Alabama. He was born and raised in the segregated South. My family obviously had a different set of life experiences than me; Iâ\u0080\u0099ve been so fortunate in many ways. It has really imbued in me [a] sense of identity, purpose, and I hope a real sense of authenticity in understanding what it feels like to be on the outside looking in to opportunity, prosperity and success. As a small-town guy, Iâ\u0080\u0099m here in the tech capital, and I still sometimes feel like a fish out of water seeing the magnitude of opportunity that we have here. Itâ\u0080\u0099s incredible. I went to Cornell and studied business and government, where I met my wife, and then grad school for public policy at the London School of Economics, then straight out of grad school to Sen. Dianne Feinsteinâ\u0080\u0099s office. Sen. Feinstein has been the largest and most profound influence in my professional life and career. I became a senior member of her staff during the Great Recession. The confidence she had in me, whatever she saw in me â\u0080\u0094 if you think about a Black executive and the type of deep confidence you need to put yourself out there, for these types of positions, you have to believe you can do it and believe you belong. I canâ\u0080\u0099t say enough about her. For the past 10 years, Iâ\u0080\u0099ve been working at Barclays. My role has been focused on public-sector and social-impact banking, first leading Silicon Valley and California coverage, and then most recently our social-impact work on the West Coast. I have a background that is unique, clearly a set of unique experiences as a Black American is part of this. Iâ\u0080\u0099m also a business executive, which might not be typical for a position like this. But I have cross-functional expertise, which is understanding politics and policy. What drew me to this role is the moment that is unique, and I believe an opportunity that is very limited. Our companies must capitalize on this, from a business standpoint, for revenue, for competitiveness, and also thereâ\u0080\u0099s a moral imperative. Weâ\u0080\u0099re working on innovative proposals and ideas, steps our member companies can collaborate on and take to drive change. We have more than 350 of the biggest and most influential companies not just in Silicon Valley but the world â\u0080\u0094 if we get 116 (about a third) of them to get on board with the type of change weâ\u0080\u0099re talking about, it is going to change corporate culture in America. And thatâ\u0080\u0099s why I left a very comfortable investment-banking job to make the transition. MarketWatch: For years, Silicon Valley tech companies have said theyâ\u0080\u0099re committed to diversity in their workforces. But as we know, the changes theyâ\u0080\u0099ve made have been incremental, and the numbers show it. How can SVLG help? Thomas: We have a moment of moral reckoning in this country. [Democratic vice presidential nominee] Sen. Kamala Harris has spoken to this. A realization of the many inequities in our society. I believe there is a finite window to act. The theme is moving with alacrity, a sense of urgency, because all I know is what Iâ\u0080\u0099ve seen with my two eyes. Iâ\u0080\u0099m not young. If these moments are not capitalized upon, we revert to the status quo. We cannot allow this moment of reckoning in our country to pass without taking action. Again, thereâ\u0080\u0099s a moral imperative. But Iâ\u0080\u0099m here to ensure the competitiveness and strong business climate in our region and the success of our member companies. Iâ\u0080\u0099m a revenue-oriented business person. Itâ\u0080\u0099s critical to the bottom lines of my companies to lead and excel in this area. Whatâ\u0080\u0099s different today? We have two things to do: We need to hire more Black executives and employees, from the C-suite down. We need to fund Black entrepreneurs. The same holds for Latinx and Native Americans. Iâ\u0080\u0099m fortunate to be dealt a very strong hand of very influential executives. So as we think through solutions, we are starting top-down at the executive level because thatâ\u0080\u0099s where we have access and ability to move with alacrity to see change. I was very blunt and direct with Jed York [the incoming chair of SVLG and owner of the San Francisco 49ers] when he asked me my thoughts on diversity. I was heartened and very pleasantly surprised that I did not need the numbers, data and supporting information that I had at my fingertips to make my case about why itâ\u0080\u0099s necessary. Because he asked me, â\u0080\u009cHow do we do it? Iâ\u0080\u0099m on board.â\u0080\u009d As I talked to other members of the board, the question was not why, how, â\u0080\u009cwell, letâ\u0080\u0099s write some letters and in three years come back to thisâ\u0080\u009d or something. It was [former SVLG CEO] Carl Guardino who recognized this as a priority, and he has already put a committee of 87 executives in place. I didnâ\u0080\u0099t expect that â\u0080\u0094 and Iâ\u0080\u0099ll be honest about it, I was extremely heartened by that. And that is why Iâ\u0080\u0099m having these conversations today, and Iâ\u0080\u0099ve got a set of life experiences, maybe, thatÂ allow me to speak more bluntly and directly about it. What I hope the executives and board members and members of our community take away is that they have someone authentically committed to driving change. Maybe, just maybe, Iâ\u0080\u0099m the guy who can speak to the business executives and our community leaders, and when they hear me, they know Iâ\u0080\u0099m not just talking â\u0080\u0094 I believe what Iâ\u0080\u0099m saying. MarketWatch: What about diversity beyond the workforce? Critics of some of your member companies, for example Facebook Inc. FB, +0.26% and Palantir Technologies Inc. PLTR, -0.50%, say those companiesâ\u0080\u0099 policies actually hurt minorities. (For example, Facebook is currently under fire for failing to remove posts that were flagged as calls to violence in Kenosha, Wis., until after protesters there were killed this week. And Palantir has long been criticized by activists over its work with immigration authorities.) How can SVLG help encourage those companies to think about diversity in a holistic way? Thomas: Carl [Guardino] deserves this credit. He moved to formalize racial and equity issues as a platform. We have 87 executives focused on this. Every decision we make, every policy, every proposal that we view, there is now a lens to what the corollary impacts are. We will have open dialogue first behind closed doors, being very direct in what I see and where I believe there is support for change. Once weâ\u0080\u0099ve had these conversations, we will collaborate and find ways to support our companies and make the changes we can. Driving change and a reorientation of thinking in very large organizations takes time. But I tell you what, if we get executives and managers in these roles who look different and have a different set of life experiences, I bet you they will pick up on some things others may not have. These are not issues to be resolved tomorrow, but itâ\u0080\u0099s urgent and critical that action is taken soon. On our board there is strong support for a structured approach that is mindful of competitiveness and our place in society. MarketWatch: What about the criticism against companies that have a two-tier wage system for their workers, such as gig companies that employ many independent contractorsÂ who California law says should actually be classified as employees? The employment status of gig workers contributes to racial and wage gaps. Thomas: We sent a letter to California Gov. Gavin NewsomÂ urging him to work with gig-economy workers and Transportation Network Companies (TNCs) to fashion a resolution that allows drivers to remain independent while providing them the benefits, rights and protections available to all workers under state and federal law. Â The potential for significant job losses and harm to our stateâ\u0080\u0099s economy during this challenging time are of very serious concern.Â Both Uber UBER, -0.18% and Lyft LYFT, +2.16% are SVLG member companies. MarketWatch: Housing inequality is a longtime problem in the valley and is being exacerbated by this pandemic. According to one estimate, more than 40,000 households in Silicon Valley risk eviction during this economic crisis. What is SVLGâ\u0080\u0099s role when it comes to housing? Thomas: One of the selling points in bringing me in as a business executive who does have a policy perspective is that Iâ\u0080\u0099ve worked in infrastructure for the past 10 years. As I presented to the SVLG board, itâ\u0080\u0099s about continued policy leadership related to permitting and environment and all the issues that allow projects to be in a position to be placed online, coupled with market-based solutions. Housing is a great example because these are revenue-generating and revenue-sustaining projects. There is a social-impact investing movement in this country. Iâ\u0080\u0099ve been part of this, having led a deal of the year in social impact. There is far more money sitting in these funds that need to be earmarked for high-impact projects than actual projects. At SVLG, we should be working to connect the dots â\u0080\u0094 between our elected officials and the projects that are shovel-ready and high impact, between our member companies that have impact funds of their own, between large institutional investors that are looking to put impact dollars to work. These can be issued tax-exempt; there are a lot of ways to structure it. Affordable housing is an example. There are innovative ways to use impact investment and dollars to get projects funded, and Mayor Sam Liccardo is a leader around this thinking with his affordable-housing initiatives in San Jose. This is where I hope to bring my experience in the private sector to bear. I believe, based off feedback I received, that this was a big component of why I was hired: understanding how infrastructure is financed and funded. MarketWatch: How does SVLG plan to tackle education and transportation as ways to address economic inequality in the valley? Thomas: We are deeply engaged in the work to diversify the STEM pipeline, and it starts at the K-12 level with some of our elementary-school programs as well as our Leadership Summits, where young men and women have a chance to engage with successful tech leaders who can inspire them to achieve.Â At the next level, our Community College to Career Initiative has been a major priority for us. Nearly 80% of community-college students are minorities, and more than half are women.Â Community College to Careers connects our 350-plus member companies with 19 community colleges in Silicon Valley for quality career positions that do not require a four-year degree. We also know that community colleges provide nearly half of the University of California systemâ\u0080\u0099s STEM students â\u0080\u0094 investing in our community colleges today means more Black and brown tech business leaders tomorrow. Regarding transportation, SVLG has adopted racial justice and equity as a pillar of our organization. That means when we evaluate any infrastructure issue or bill, we do so with a lens looking at the impact it has on our minority communities.Â Transportation is a critical area for equity and inclusion. How we get where we go affects our opportunities in jobs and housing, so our transit system must have frequency, affordability and connectivity. Frequent transit is more equitable transit: Not every member of our community is on a 9-to-5 work schedule at a desk, so having more frequency during what are considered â\u0080\u009coff hoursâ\u0080\u009d in the early morning and in the evening levels the playing field for many workers.Â This is why we take part in advocating for CalTrain and BART extension and service expansions through ballot-initiative campaigns and working with public officials. Highly connected public transit can induce density that can help make housing more affordable â\u0080\u0094 this is happening now in and around new and future BART stations in San Jose. Also, how we travel affects the air we breathe, and we know minorities are disproportionately affected by pollution. MarketWatch: What is your approach to this emergency that we find ourselves in â\u0080\u0094 this pandemic? Thomas: When we talk about impact, one of the components to that is immediate impact. Under Carlâ\u0080\u0099s leadership, weâ\u0080\u0099ve raised almost $9 million for COVID relief funds and PPE. We are a key part of the recovery task force [in Silicon Valley]. Simply put, we must continue that work."}]}