{"article": [{"url": "https://www.marketwatch.com/story/american-airlines-stock-suffering-a-wave-of-selling-as-covid-19-cases-surge-2020-06-25", "published": 1593155660.0, "headline": "American Airlines stock's late rally snaps 6-day losing streak, while COVID-19 cases surge", "body": "Shares of American Airlines Group Inc. swung to a gain at Thursday's close, erasing a sharp loss early in the session to snap a long losing streak, as continued improvement in travel demand helped fend off, for the moment, concerns over a recent surge in new COVID-19 cases. American Airlines' stock AAL, +0.34%  closed up 1.0% at $13.17, erasing a loss of as much as 6.6% at its intraday low. The gain snapped a six-session losing streak, the longest since the six-day stretch ended April 2, in which the stock had tumbled 23.4%. The stock's late rally into positive territory comes after the air carrier announced a $4.5 billion boost to liquidity this week, including a $2.5 billion notes offering that priced late Wednesday and $2 billion worth of common stock and convertible debt offerings that priced on Tuesday. The offering of $2.5 billion senior secured notes due 2025, which was upsized from $1.5 billion, priced slightly below par - 99% of face value - despite paying an interest rate of 11.75% per annum. That compares with the yield on 5-year Treasury notes TMUBMUSD05Y, 0.338%  of 0.32%. FactSet, MarketWatch While the increased cash balances following the offerings \"removes liquidity risk,\" UBS analyst Myles Walton American's \"problem\" isn't the amount of cash it has, but how much cash it burns to operate. And with cash burn set to continue, \"the return to normalized earnings is so far out that material downside remains for the equity,\" Walton wrote in a note to clients. He reiterated the sell rating he's had on the stock since late 2019, but trimmed his price target to $9, which is 28.5% below current levels, from $10. American's stock became part of a broader airline sector rally, as the U.S. Global Jets exchange-traded fund JETS, +0.16%  climbed 1.5% to bounce of Wednesday's three-week closing low. The Jets ETF, which dropped 5.9% on Wednesday to suffer a fifth loss in six days, has lost 24.4% since closing at a three month high of $21.94 on June 8. Among the sector tracker's other more-active components, shares of United Airlines Holdings Inc. UAL, +0.32%  ran up 4.9%, Delta Air Lines Inc. DAL, +0.39%  climbed 2.5%, Spirit Airlines Inc. SAVE, +1.35%  hiked up 2.8%, Southwest Airlines Co. LUV, +1.89%  advanced 2.2% and JetBlue Airways Corp. JBLU, -0.07% rallied 4.1%. The Dow Jones Transportation Average DJT, +0.84%  , which includes six airline components, rose 1.%, while the Dow Jones Industrial Average DJIA, +0.56%  jumped 299.66 points, or 1.2%. Helping fuel the rally, data from the Transportation Security Administration (TSA) shows that the number of people going through traveler checkpoints continues to increase. The average daily number of travelers for the week ended Sunday has increased for nine straight weeks, to reach 522,327 in the latest week, up from a trough of 97,799 for the week ended April 19, according to a MarketWatch analysis of TSA data. Meanwhile, the decline from a year ago in average daily passengers per week has decreased each week, to 80.0% in the latest week from a peak of 95.8%, also for the week ended April 19. More ominously, however, the number of new cases of the coronavirus illness in the U.S. rose to 34,700 on Wednesday, the highest level since the peak of 36,400 seen in late April, according to the Associated Press, with data aggregated by Johns Hopkins University of Medicine indicating 30 states are seeing increased infection rates over the past week. Don't miss: Coronavirus update: Global case tally climbs to 9.5 million and rising cases in U.S., Brazil and others show pandemic is far from over. “ \"Demand has improved recently despite cases on the rise, but we are concerned this could be tenuous.\" ” - Analyst Helane Becker at Cowen Cowen analyst Helane Becker is particularly concerned about the rising trend of infections in Arizona, California, Florida, Georgia and Texas, which together represent more than half of the new cases in the U.S. in recent days. Also read: Texas Gov. Greg Abbott puases reopening of state after spike in COVID-19 cases and hospitalizations \"All airlines have relatively similar exposure to these five states,\" Becker wrote in a note to clients. \"Demand has improved recently despite cases on the rise, but we are concerned this could be tenuous.\" On Wednesday, the governors of Connecticut, New Jersey and New York said those traveling into their states from Arizona, Florida and Texas, as well as from Alabama, Arkansas, North Carolina, South Carolina, Washington and Utah, have to self-quarantine for 14 days, or face fines ranging from $2,000 to $10,000. The Jets ETF has declined 1.4% over the past three months through Thursday, and tumbled 47.4% year to date. In comparison, the S&P 500 index SPX, +0.87%  has rallied 17.3% over the past three months but slipped 4.6% this year. What to Expect When Flying Now (and in the Future)"}]}