{"article": [{"url": "https://www.marketwatch.com/story/zuckerberg-tells-fauci-that-us-pandemic-response-has-been-really-disappointing-2020-07-16", "published": 1594929860.0, "headline": "Zuckerberg tells Fauci that U.S. pandemic response has been 'really disappointing'", "body": "Facebook Inc. Chief Executive Mark Zuckerberg expressed frustration with the Trump administration's response to the coronavirus pandemic during a live chat Thursday with Dr. Anthony Fauci. \"You know, I was certainly sympathetic early on when it was clear that there would be some outbreaks no matter how well we handle this,\" Zuckerberg said during the hourlong interview, which was livestreamed on Facebook FB, +0.26%  . \"But now that we're here in July, I just think that it was avoidable and it's really disappointing that we still don't have adequate testing, that the credibility of the top scientists like yourself and the CDC is being undermined, and that until recently, parts of the administration were calling into question whether people should even follow basic best practices like wearing masks.\" Fauci did not criticize the Trump administration, but did take exception to the idea that containing COVID-19 and reopening the economy is a one-or-the-other predicament. \"We should be looking at public health measures as a vehicle, or a gateway, to opening the country, not as the obstacle in the way, but as the gateway,\" Fauci said, implying some states have reopened too soon. \"You have got to do it correctly. You can't jump over steps, which is very perilous when you think about rebound. The proof of the pudding is, look what has happened. There really is no reason that we are having 40, 50, 60 thousand, other than we are not doing something correctly.\" Both Fauci and Zuckerberg agreed that the country needs to \"regroup\" to form an effective response to the latest pandemic developments, as cases have surged to record levels in many states in the South and West. Fauci also urged young people to take the pandemic more seriously. \"You have to have responsibility for yourself but also a societal responsibility that you're getting infected is not just you in a vacuum. You're propagating the pandemic,\" he said, noting that hospitals are seeing more complications in young people infected by the virus. Fauci's comments came after some in the Trump administration, including the president, have increasingly criticized the nation's top infectious-diseases specialist. White House trade adviser Peter Navarro on Wednesday wrote an op-ed in USA Today blasting Fauci as being \"wrong about everything.\" USA Today on Thursday said the column should not have being published, saying it was misleading and failed the newspaper's fact-checking standards. Fauci dismissed the attack, telling The Atlantic: \"I just want to do my job. I'm really good at it.\""}]}