{"article": [{"url": "https://www.marketwatch.com/story/press-corps-laboring-under-intensifying-coronavirus-risk-at-white-house-2020-10-06", "published": 1602064520.0, "headline": "Press corps laboring under intensifying coronavirus risk at White House", "body": "NEW YORK (AP) — President Donald Trump’s return to the White House to recover from the coronavirus seems certain to raise the already heightened anxiety level of the journalists assigned to follow him. Three reporters have tested positive for COVID-19 in recent days while covering a White House described as lax, at best, in following basic safety advice like wearing masks. Discomfort only increased Monday with news that press secretary Kayleigh McEnany had tested positive. The image of Trump standing on a balcony and removing his mask after a helicopter dropped him off Monday evening, then turning to enter the White House maskless, could hardly be reassuring to people who work there. After McEnany’s announcement Monday, Fox News chief White House correspondent John Roberts spent part of his afternoon waiting outside an urgent care center for his own test. He had attended McEnany’s briefing last Thursday. She didn’t wear a mask, and neither did one of her assistants who later tested positive, and Roberts sat near both of them. He tested negative. He called it an inconvenience, but stronger emotions were spreading. American Urban Radio Networks correspondent April Ryan said she found it infuriating that Trump and his team had risked the health of her colleagues. CNN’s Kaitlan Collins said it was “irresponsible, at best.” “It’s frustrating,” said Jonathan Karl, ABC News White House correspondent. “Frankly, it makes you angry.” Trump takes the health and safety of those who work for and cover him very seriously, spokesman Judd Deere said. The White House works to incorporate current CDC guidance and best practices to limit COVID-19 exposure to the greatest extent possible on the grounds and when the president is traveling, he said. Yet Trump clearly dislikes masks, and it is a message that has filtered down through much of his staff. The White House Correspondents Association has placed signs on the door to the press briefing room saying that masks are required for admittance. “The only people who have habitually not followed that rule have been that White House staff,” Karl said. When asked why, staffers generally say they don’t wear a mask because they tested negative that day, said CBS News correspondent Weijia Jiang. But doctors have made clear that a negative test doesn’t mean you don’t have COVID-19 or aren’t contagious, “so it seems like covering their face is a simple way to protect people,” she said. Michael D. Shear of The New York Times is the only reporter to reveal his positive test. Shear can’t say for sure where he contracted the virus, but he covered Trump’s rally in Pennsylvania on Sept. 26 and rode back on Air Force One, where the president spoke to reporters without a mask. “What’s frustrating is when you know the risks can be mitigated if they took it more seriously,” he said Monday. Shear took a coronavirus test late Thursday and found he was positive the next morning; his wife is positive, too. No one in the White House has criticized him for wearing a mask, but there have been times when people told him “I can’t hear you.” “My feeling is you just talk louder at that point,” he said. “I’m not going to take my mask off.” Shear said he’s surprised that no one at the White House has reached out to him for contact tracing. Following the the positive tests for Shear and two others, the WHCA recommended remote work for all reporters who are not part of the day’s press pool and who don’t have an enclosed work space. The 13-member press pool, with a rotating cast of electronic and print journalists, is responsible for following the president when he leaves the White House; the WHCA objected Sunday when the pool wasn’t alerted to Trump’s drive-by of supporters outside his hospital. The White House has generally been responsive to the WHCA’s safety concerns for the pool, said Zeke Miller, the association’s president and an Associated Press reporter. For example, the White House arranged to increase the buffer zone between the audience at Trump rallies and journalists. The AP has its own rotation system so it has only one reporter at the White House while others work at home. If he comes into contact with someone who has tested positive, Miller said he’s prepared to go to a hotel and not home to his family, although he hasn’t had to do that yet. The atmosphere is markedly different at the Capitol, said Andrew Desiderio, who covers the Senate for Politico. With the exception of Kentucky Sen. Rand Paul, virtually all staff and senators wear masks, he said. They follow the lead of Senate Majority Leader Mitch McConnell, he said. As a result, Desiderio isn’t worried about the seven-minute interview he conducted last week with Wisconsin Sen. Ron Johnson days before Johnson revealed a positive COVID test. Both men wore masks and kept their distance, he said. But at the White House, Ryan said she is concerned for fellow reporters. With underlying health conditions, she’s been doing her job from home since March. “My colleagues, I give them all props,” she said. “But I didn’t sign up to die for this, especially for someone who’s always saying that we’re the enemy.”"}]}