{"article": [{"url": "https://www.marketwatch.com/story/amd-is-set-up-to-withstand-coronavirus-in-the-short-term-2020-04-16", "published": 1595939060.0, "headline": "AMD is weathering coronavirus while biggest rival struggles", "body": "This article is part of a series tracking the effects of the COVID-19 pandemic on major businesses, and will be updated. It was originally published on April 16. Advanced Micro Devices Inc. is expected to withstand the COVID-19 pandemic because it serves two areas in demand for millions of people being confined in their homes — work and play — but a prolonged economic downturn could muddle that outlook. AMD AMD, -3.94% has become a fierce contender in the CPU market dominated by Intel Corp. INTC, -1.03% and the GPU market dominated by Nvidia Corp. NVDA, -0.54% with its new 7-nanometer line of chips, and its position improved even more following Intel’s recent announcement that its 7-nm chip would be delayed until at least late 2022. Even before the COVID-19 pandemic ramped up, AMD was forecasting strong growth, especially in its data-center business, where it was competing with Intel again after many years of avoiding the server-chip business. With millions of people working from home and millions more confined due to extant shelter-in-place orders, increased demand for chips that power data centers and cloud services has held up, as well as the devices on the other side of the internet connection. Business in the age of COVID-19: Read profiles of how other large companies will be affected by the coronavirus AMD has continued launching new products during the pandemic, following an ambitious multiyear road map that was publicly disclosed in early March. The chip maker is scheduled to release a further update in second-quarter earnings late Tuesday. In the second half of the year, some analysts are cautious about the extent of business spending given recessionary concerns, but AMD has yet to backtrack from its long-term outlook as it banks on its continued rollout of 7-nanometer-based chips. Speaking for the broader chip sector, Cowen analyst Matthew Ramsay said he does not expect a slowdown in data-center sales — as some investors fear — given the big ramp-up from widespread working and learning from home because of COVID-19. “Our industry contacts indicate there may be some inventory adjustments at certain hyperscalers around DRAM in particular, and we do expect eventually softer enterprise/government server spending, but so far our own checks do not point to softer cloud spending or a repeat of 2H18/1H19 server ‘digestion,’” Ramsay said. DRAM, or dynamic random access memory, is the type of memory commonly used in PCs and servers. Major DRAM supplier Micron Technology Inc. MU, -0.02% said at the end of June that it expects cloud memory sales to remain healthy for the year. What the numbers are saying Revenue: AMD forecast second-quarter revenue of $1.75 billion to $1.95 billion in April, and analysts surveyed by FactSet at that time forecast $1.85 billion. The average Wall Street projection has declined from $1.92 billion since the end of March. For the full year, analysts expect sales of $8.4 billion, down from an estimate of $8.56 billion at the end of March. Analysts expect a 45% surge in computing and graphics chip sales to $1.36 billion in the first quarter, but an 18% decline in enterprise embedded and semi-custom chip sales — the unit that includes data-center and gaming-console chips — to $485.5 million. Earnings: Analysts expect earnings of 16 cents a share from AMD, down from 21 cents a share expected at the end of March. For the full year, analysts expect earnings of $1.02 a share, down from $1.11 a share at the end of March. Stock movement: In the second quarter, AMD shares gained 16%, compared with a 32% gain in the PHLX Semiconductor Index SOX, +1.77% , a 20% gain in the S&P 500 index SPX, +0.87%, and a 31% gain in the tech-heavy Nasdaq Composite Index COMP, +1.39%. Over the past month, however, AMD shares have rallied 31%, while the SOX index has gained 5%, and both the S&P 500 and the Nasdaq have advanced about 4%. What the company is saying July 21: AMD released its 7-nanometer Ryzen 4000 series of chips for PCs. June 16: AMD expands release of its Ryzen 3000 line of chips to include three new processors. June 1: AMD Chief Executive Lisa Su said the Massachusetts Institute of Technology, New York University, and Rice University will be the first universities to receive AMD supercomputing clusters for COVID-19 medical research. April 21: AMD released new consumer desktop chips in its third-generation Ryzen line. April 15: Su said AMD was launching a high-performance computing fund with an initial donation of $15 million of high-performance systems to key medical research institutions April 14: AMD unveiled three new Epyc-branded processors for the database, commercial high-performance computer and hyperconvergence markets, revealing that Dell Technologies Inc. , Hewlett Packard Enterprise Co. , International Business Machines Corp. , Lenovo Group Ltd. and Microsoft Corp. are among the initial customers. March 15: AMD said it was “continuously monitoring and assessing the situation” with regards to COVID-19 and said it would “continue to make adjustments and mitigate the impact on our global operations.” March 5: AMD forecast a long-term compound annual growth rate of 20% at an analysts’ presentation. What analysts are saying • “We are concerned about broader PC fundamentals in 2H’20 given the continued impact of COVID-19 and the likelihood that the WFH benefit dissipates. And, in particular, we are worried that PC OEMs have started to cut back on inventory holdings given these concerns (note: both Hynix and Intel referred to inventory draw downs on their calls), a result that could weigh on AMD’s PC related business in CQ3.” — Wedbush analyst Matt Bryson, who has a $75 price target and an outperform rating on AMD. • “Strong and predictable product execution (i.e. Milan launch, Big Navi launch, Genoa design closure, 5nm timelines) and server revenue growth remain the most important [long-term] LT measuring sticks; we are confident in both.” — Cowen’s Matthew Ramsay. • “We would expect 2q numbers at least in line with consensus, and for the first time in a while we would expect the company to post guidance above Street estimates for September (with higher revs/lower gross margins) as videogame consoles have accelerated.” — Morgan Stanley analyst Joseph Moore, who has an equal-weight rating and a $56 price target on the stock. • “With PC unit shipments benefiting from WFH and remote learning (evidenced by Gartner, IDC, our ODM notebook tracker, and Intel results) and DC also benefiting from higher network traffic, second-quarter results for AMD appear to have significant upside.” — Susquehanna Financial analyst Christopher Rolland, who has a neutral rating and a $64 price target on AMD. Of the 36 analysts who cover AMD, 14 have overweight or buy ratings, 19 have hold ratings, and three have sell ratings, with an average price target of $55.48, according to FactSet data."}]}