{"article": [{"url": "https://www.marketwatch.com/story/how-to-spot-whether-a-stimulus-deal-will-bring-a-short-lived-stock-market-bounce-or-a-sustained-rally-strategist-says-11601897339", "published": 1601981060.0, "headline": "Hereâ\u0080\u0099s how to spot whether a stimulus deal will bring a â\u0080\u0098short-livedâ\u0080\u0099 stock market bounce or a sustained rally, strategist says", "body": "The stock market bounce following any new stimulus deal is likely to be 'short-lived', Mill Tabak & Co warned. Matthias Hangst/Getty Images Any near-term bounce from a new fiscal plan is likely to be â\u0080\u009cshort-lived,â\u0080\u009d according to Miller Tabak & Coâ\u0080\u0099s lead strategist Matt Maley. Maley said Trumpâ\u0080\u0099s positive COVID-19 test improved the chances of a new stimulus boost, as it gave both sides the opportunity to concede ground without losing face. However, he warned multiple factors meant any pop fueled by a deal would be brief. Read: Trumpâ\u0080\u0099s coronavirus recovery, stimulus hope, election clarity: Whatâ\u0080\u0099s really driving the market? â\u0080\u009cWe believe an agreement on a new fiscal plan is likely, but weâ\u0080\u0099re not so sure it will help the stock market rally in a sustainable way. The market is still quite overvalued and the combination of the weakening employment picture plus a second wave of the virus does not bode well for any improvement for the â\u0080\u0098Eâ\u0080\u0099 part [earnings] of the P/E ratio going forward,â\u0080\u009d Maley said. â\u0080\u009cMore importantly, history shows us that stimulus programs play a much bigger role as a catalyst for a strong/sustained rally when the stock market is flat on its backâ\u0080¦not after a strong six-month rally,â\u0080\u009d he said, noting that the S&P 500 SPX, +0.87% was still more than 50% above its March lows,â\u0080\u009d he said. He added that another â\u0080\u009cdown-legâ\u0080\u009d to the September correction will come in October before we see a sustainable rally in stocks. But the strategist said Miller Tabak & Co one important indicator â\u0080\u0094 chip stocks â\u0080\u0094 would signal whether they were wrong. â\u0080\u009cThe chip stocks have been a very important leadership group for the broad stock market, so itâ\u0080\u0099s action over the coming days and weeks should be vitally important.â\u0080\u009d He said if the SMH semiconductor ETF SMH, +1.71% can break above its September closing highs of $183.55 it was â\u0080\u009cvery, very bullish on several different levels.â\u0080\u009d â\u0080\u009cIf that happens, weâ\u0080\u0099ll have to change our tune rather quickly.â\u0080\u009d"}]}