{"article": [{"url": "https://www.marketwatch.com/story/the-no-1-market-timer-of-the-1980s-and-1990s-has-this-message-for-buy-and-hold-investors-now-2020-07-13", "published": 1597503620.0, "headline": "The No. 1 market-timer of the 1980s and 1990s has this message for todayâ\u0080\u0099s buy-and-hold investors", "body": "The best-performing stock-market timing system of the 1980s and 1990s is saying that you be in cash until the last two days of July. But before you rush to sell your stocks as part of a short-term trade, you should know that this systemâ\u0080\u0099s record in recent years has been less impressive. Nevertheless thereâ\u0080\u0099s hope that the system can return to its winning ways. Iâ\u0080\u0099m referring to the Seasonality Timing System first introduced in the 1970s by Norman Fosback, then the head of the Institute for Economic Research. The system calls for being invested in equities around the turns of each month as well as immediately prior to exchange holidays. The rest of the time itâ\u0080\u0099s in cash. My Hulbert Financial Digest began tracking Fosbackâ\u0080\u0099s system at the end of 1981. Not only was it top-ranked over the next 20 years, it was the only market timing system the HFD tracked over that period which made more money than a simple buy-and-hold strategy. Moreover, given that the approach incurred far less risk than the overall market, it nearly doubled the marketâ\u0080\u0099s return on a risk-adjusted basis. Yet Fosbackâ\u0080\u0099s market timing system has lagged the market over the most recent decade. Consider a hypothetical portfolio that is 100% invested in the Wilshire 5000 Total Return Index whenever the system calls for being in the market, but otherwise earns the 90-day T-Bill rate. For the decade through this past Jun. 30, this portfolio produced an 8.4% annualized return, versus 12.5% for buying and holding. Though this portfolio came closer to equaling the market on a risk-adjusted basis, it nevertheless lagged on that basis as well. What accounts for this deterioration? The most likely explanation is that itâ\u0080\u0099s a victim of its success. As more and more investors began following it, they killed the goose laying the golden egg.Middle of the month strength It may be possible to tweak the Fosback system to give it new life, according to Vincent Deluard, head of global macro strategy at investment firm StoneX. In a recent communication to clients, Deluard highlighted another monthly pattern that, while similar to the ones exploited by Fosbackâ\u0080\u0099s original system, has not weakened over the past decade. This additional pattern recognizes the above-average strength in U.S. stocks during the middle of a month. But why would the market exhibit strength at that time? Deluard believes itâ\u0080\u0099s for the same reason that equities previously exhibited strength around the turns of the month: Inflows from 401(k)s. Money withheld from employee paychecks to deposit in their 401(k)s (and often matched by employers) quickly make their way into the stock market. Many employees are paid on a twice-monthly payroll cycle, so itâ\u0080\u0099s not just at the end of the month that these 401(k)-sourced inflows take place. Some also take place mid-month. Deluard hypothesizes that because the turn-of-month strength was more widely known, it was arbitraged away while the mid-month strength was able to persist.How to follow seasonal patterns You might think that you have to be a day trader to exploit this seasonal pattern. Not exactly. There will be times, for other reasons entirely, when you will invest new money in the market or pull money out. Based on the historical pattern of monthly strength, you could invest new money a couple of days before any of the seasonally strong periods. That way your investment will get a little extra boost if and when that strength appears. You also could pull money out of the market a couple of days after those seasonally strong periods. That way you would benefit from any abnormal market strength during that time. Should you focus these inflows and outflows only before or after the mid-month period? Deluard, in an email, suggested also doing so before or after turns of the month. Thatâ\u0080\u0099s because thereâ\u0080\u0099s always the chance that the turn-of-the-month pattern will come roaring back. Even if doesnâ\u0080\u0099t, there is no evidence that the market is a below-average performer on those days. Thereâ\u0080\u0099s a broader lesson here too about how efficient markets operate: Once too many investors know about a profitable pattern and try to exploit it, that pattern stops working. Insofar as the mid-month strength pattern that Deluard identified continues to work in the future, it will do so only so long as too many investors donâ\u0080\u0099t know about it. (So donâ\u0080\u0099t tell.) Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com Read:â\u0080\u0098Itâ\u0080\u0099s like trying to beat the casinoâ\u0080\u0099 â\u0080\u0094 Rookie trader turns $15,000 into $1 million, then loses almost everything More: Â Retired and want to try day trading? Read this first"}]}