{"article": [{"url": "https://www.marketwatch.com/story/new-us-jobless-claims-flat-at-884000-a-fresh-wave-of-layoffs-hitting-the-economy-2020-09-10", "published": 1599745040.0, "headline": "U.S. jobless claims, including federal filings, rise fourth straight week in sign of stalling labor market", "body": "The numbers: The number of Americans who applied for unemployment benefits through state and federal programs rose in early September for the fourth week in a row, signaling that a gradual improvement in the labor market during the summer has stalled. Initial jobless claims filed traditionally through state employment offices were unchanged at a seasonally adjusted 884,000 in the week of Aug. 30 to Sept. 5 , the Labor Department said Thursday. Economists polled by MarketWatch had forecast new claims to fall to 840,000. Yet new claims rose when including self-employed workers who applied for benefits under a separate federal program. Some 838,916 people filed under the Pandemic Unemployment Assistance Act. That put the number of actual or unadjusted new claims at 1.69 million, compared to 1.59 million in the prior week. Federal filings have risen four weeks in a row. Continuing jobless claims, or the number of people already receiving benefits, rose by 93,000 to a seasonally adjusted 13.39 million in the seven days ended Aug. 29. It was the first increase in five weeks. Two weeks ago, the Bureau of Labor Statistics changed its process for seasonal adjustments to make its report more accurate. The level of seasonally adjusted jobless claims had run notably higher during the pandemic than the real or actual number of people applying for benefits. Now the two sets of numbers are more closely aligned. And what they both show is that the decline in new claims appears to have stalled for now. For a more complete explanation, read about the big change in jobless-claims data reporting. What happened: Jobless claims might be rising partly because President Trump temporarily increased via an executive memo federal benefits by $300 a week after a $600 stipend expired at the end of July, economists say. He tapped FEMA funds for the $300 supplement. The end of federal assistance for small businesses and other key industries that kept employees on payrolls could be another factor. More ominously, the increase could reflect a fresh wave of layoffs in hard-hit businesses such as airlines and hotels. Major companies such as American Airlines AAL, +0.34% and MGM MGM, -2.59% said earlier this month they would cut more jobs permanently because demand is still in a slump and federal aid has dried up. Altogether, the number of people getting benefits through eight state and federal programs increased by 380,379 to an unadjusted 29.6 million as of Aug. 22. The data are released with a two-week delay. Read: The economy has a mountain to climb, but it’s digging itself out faster than expected Big picture: Although new jobless claims are much lower now compared with the early stages of the pandemic, the number of layoffs each week would still be at record highs when compared against any other period since World War II. The latest worry is the spate of recent announcements by major airlines and hotels that they will turn thousands of temporary furloughs into permanent job cuts because their industries remain mired in a historic slump. It’s not all bad news, though. The broader economy has continued to expand through the summer, and a rapid decline in coronavirus cases could help speed up growth, absent new outbreaks. Also see: Did the expired $600 federal jobless benefit keep people from going back to work? What they are saying? “Jobless claims are no longer falling,” said chief economist Chris Low of FHN Financial. “It is especially concerning that the pace of layoffs has not slowed more materially even though the economy has reopened more fully, and more and more businesses have come back online,” said chief economist Rubeela Farooqi of High Frequency Economics. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% were lower at midday Thursday after initial attempts to move higher."}]}