{"article": [{"url": "https://www.marketwatch.com/story/borrowers-are-still-having-their-paychecks-seized-over-defaulted-student-loans-even-though-the-cares-act-was-supposed-to-stop-wage-garnishment-lawsuit-says-11596727697", "published": 1596980660.0, "headline": "Borrowers are still having their paychecks seized over defaulted student loans, even though the CARES Act was supposed to stop wage garnishment, lawsuit says", "body": "Documents in a lawsuit filed against Secretary of Education Betsy DeVos indicate that more than 2,800 student loan borrowers are having their wages garnished despite a pandemic-induced pause on student loan payments and collections. (Photo by JIM WATSON/AFP via Getty Images) More than 2,800 borrowers are having their paychecks garnished over defaulted student loans, even though the CARES Act was supposed to pause student debt payments and collections starting in March. That’s according to the latest filings in a lawsuit accusing Secretary of Education Betsy DeVos and her agency of violating the CARES Act, the coronavirus relief package Congress passed in March. The law suspended payments and collections on some federal student loans until September 30. About one month after President Trump signed the CARES Act into law, Elizabeth Barber, a borrower who was still having her wages garnished, filed the class-action lawsuit. The case was filed on behalf of Barber and similarly situated borrowers by attorneys at the National Student Legal Defense Network, an organization founded by former Obama administration officials that represents student-loan borrowers and for-profit college students in litigation, and the National Consumer Law Center, a nonprofit focused on consumer issues, particularly as they affect low-income people. Though Barber’s wages are no longer being garnished and the money she lost to garnishment has been refunded, some borrowers are still having a portion of their paychecks seized, according to status reports in the case provided by the Department. How are you planning for the end of the student loan payment pause? email: jberman@marketwatch.com In those reports, the agency discloses the percentage of all borrowers they believe are having their wages garnished. Based on their analysis of these disclosures, the plaintiffs’ attorneys estimate that about 2,886 borrowers are still losing out on a portion of their paychecks. Up to 22,000 borrowers who’ve already had their wages seized don’t have a valid address on file with the Department, according to these status reports. That means their refunds are likely on hold. “The unfortunate reality is that there is going to be some amount of borrowers that go through the entire CARES Act period without receiving the relief they’re entitled to,” said Alex Elson, senior counsel at NSLDN and one of the lawyers representing the borrowers. “That’s just unacceptable.” Department filed a motion to dismiss the case The Department filed a motion to dismiss the case last month, arguing that the named plaintiffs’ claims were moot because Barber and another borrower later added as a named plaintiff in the case were no longer seeing their wages garnished and the money that was seized had been refunded. Angela Morabito, a Department of Education spokeswoman, wrote in an emailed statement that the agency has mailed letters to employers at least three separate times to ask them to stop garnishing wages, called employers and reached out daily to those firms that aren’t complying. “We have made substantial progress getting employers to stop wage garnishment,” she wrote. In a memo filed to the court supporting their motion to dismiss, government attorneys also said that the Department has worked to stop the wage garnishment and detailed those efforts. The number of borrowers having their wages garnished has generally trended down, going from 390,000 between March 13 and June 2 to 2,886 as of July 23. Still, between July 9 and July 23, the number of borrowers losing their paychecks actually went up, according to court filings. Two days before the CARES Act was passed, the agency instructed its contractor responsible for working with defaulted borrowers to direct employers to stop wage garnishment and to initiate refunds for borrowers whose wages had been seized during the pause period, according to the memo. The agency’s servicer continues to contact employers who are still garnishing borrowers wages, the memo states, and the Department believes that many of the remaining employers still seizing paychecks are small businesses that have been impacted by the pandemic. In the memo, the government’s attorneys argue that the agency has “already met their obligations” regarding wage garnishment under the CARES Act by notifying all employers to stop seizing paychecks. “The Department has no further responsibility,” they write. Back and forth comes just two months before the payment pause is supposed to end The attorneys suggest in the memo that plaintiffs’ counsel bring forward borrowers whose wages are being garnished so that they can address it. They also say borrowers have an adequate remedy to the situation available to them because they can sue their employers in state court to stop the garnishment. “That doesn’t just ignore the Department’s legal obligations under the CARES Act, but it’s so out of touch with reality given everything that is happening in our country,” Elson said. “The vast majority of these borrowers are low-income, they’re struggling to support themselves in the middle of the pandemic — suggesting that they should use their time, energy and resources to hire lawyers and risk their careers to sue the sources of their livelihood, that was a pretty remarkable argument that they made.” The back and forth in the case comes less than two months before the CARES Act pause on payments and collections is supposed to end. Advocates are worried that given the continued economic devastation, borrowers aren’t financially ready for student loan payments and collections to resume. In addition, they’re concerned that the student loan system won’t be able to handle a flood of requests from borrowers to change repayment plans, putting them at risk of sliding into delinquency or default. The HEROES Act, the coronavirus stimulus bill passed by the Democratic-led House of Representatives in May, included a provision extending the payment and collections pause until September 2021. The Republican-led Senate hasn’t taken up the measure. The proposed stimulus bill Republican Senators released last week includes a provision allowing borrowers who aren’t making any money to skip student loan payments, an option already available to borrowers under the current system. President Trump has expressed interest in extending the student loan payment pause. But if the government doesn’t act, “there will be borrowers who have not received any of the relief, and those who had, who are going to be put in a very tough position when the faucet gets turned back on,” Elson said."}]}