{"article": [{"url": "https://www.marketwatch.com/story/buy-one-get-one-free-airline-tickets-ryanair-hopes-fliers-say-yes-as-it-warns-hundreds-of-jobs-at-risk-11600946997", "published": 1600933040.0, "headline": "'Buy one, get one free' airline tickets? Ryanair hopes fliers say yes, as it warns hundreds of jobs at risk", "body": "Passengers can get a free flight with Ryanair. paul faith/Agence France-Presse/Getty Images Irish airline Ryanair on Thursday launched a \"Buy One, Get One Free\" offer on its flights for the first time in its history. The offer applies to Value Fare bookings and allows travelers to take a friend or family member along on the same flight free. But consumers will have to be quick. The offer, which expires at midnight on Sept. 24, applies on 1,600 routes across Ryanair RYA, -2.60% 's network and will be valid from Sept. 25. until Dec. 14. 2020. iframe.twitter-tweet { width: 100% !important; } \"For the first time in Ryanair RYAAY, -2.08% history, we have a \"Buy One, Get One Free\" offer landing. Anyone would be crazy to miss it,\" said Alejandra Ruiz, Ryanair's head of communications. The move comes as Ryanair Chief Executive Michael O'Leary said Britain risks losing hundreds of thousands of travel and tourism jobs in the coming months, unless the government offers support to workers and eases travel restrictions. His comments come ahead of a plan by the European Union plan aimed at clearing up the confusion of coronavirus restrictions on travelers across Europe. Airlines around the world have been forced to cancel flights over the past few months because of changes in travel restrictions. Ryanair last week blamed European governments for \"continuous changes\" in travel restrictions, as it announced a 20% cut in October capacity. Read: Come back, Americans: Urgent calls for U.S.-U.K. air bridge with airlines hit by fresh lockdown fears \"EU travel restrictions have risen from 46% (10 August) to 63% of routes being restricted on 1 September (and likely risen since). We think for both Ryanair and the European aviation sector the possibility of further travel restrictions is an overhang,\" analysts at UBS wrote in a research note on Wednesday. On Sept. 4, the European Commission identified four key areas for improving cross-border coordination, including the development of common quarantine rules and a shared 'color-coding' of higher-risk areas. \"The decision as to whether to introduce restrictions to free movement remains the responsibility of the Member States, which have to act in compliance with Union law. Equally, Member States retain the flexibility not to introduce restrictions even if the criteria and thresholds outlined in this Recommendation are met,\" the Commission's briefing paper stated. Several EU countries have imposed new coronavirus restrictions in recent days amid a surge in virus cases. The World Health Organization warned on Sept. 18 of \"alarming\" transmission rates of COVID-19 in Europe. \"It's going to get tougher. In October, November, we are going to see more mortality,\" said WHO Europe director Hans Kluge."}]}