{"article": [{"url": "https://www.marketwatch.com/story/negotiators-report-progress-in-covid-19-aid-talks-in-congress-2020-08-01", "published": 1596301700.0, "headline": "Negotiators report progress in COVID-19 aid talks in Congress", "body": "Lawmakers reported progress on a huge coronavirus relief bill Saturday, as political pressure mounts to restore an expired $600-per-week supplemental unemployment benefit and send funding to help schools reopen. “This was the longest meeting we’ve had and it was more productive than the other meetings,” said Senate Minority Leader Chuck Schumer, D-N.Y., who was part of the rare weekend session. “We’re not close yet, but it was a productive discussion — now each side knows where they’re at.” Schumer spoke alongside House Speaker Nancy Pelosi, D-Calif., after meeting for three hours with Treasury Secretary Steven Mnuchin and White House chief of staff Mark Meadows. The Democratic leaders are eager for an expansive agreement, as are President Donald Trump and top Republicans like Senate Majority Leader Mitch McConnell of Kentucky. But perhaps one half of Senate Republicans, mostly conservatives and those not facing difficult races this fall, are likely to oppose any deal. Prior talks had yielded little progress and Saturday’s cautious optimism was a break from gloomy private assessments among GOP negotiators. The administration is willing to extend the newly expired $600 jobless benefit, at least in the short term, but is balking at other Democratic demands like aid for state and local governments, food stamp increases, and assistance to renters and homeowners. Pelosi mentioned food aid and funding for voting by mail after the negotiating session was over. She and Schumer appeared more upbeat than they have after earlier meetings. “We have to get rid of this virus so that we can open our economy, safely open our schools, and to do so in a way that does not give a cut in benefits to American workers,” Pelosi said. Mnuchin said restoring the $600 supplemental jobless benefit is critically important to Trump. “We’re still a long ways apart and I don’t want to suggest that a deal is imminent because it is not,” Meadows said afterward. “There are still substantial differences, but we did make good progress.” The additional jobless benefit officially lapsed on Friday, and Democrats have made clear that they will not extend it without securing other relief priorities. Whatever unemployment aid negotiators agree on will be made retroactive — but antiquated state systems are likely to take weeks to restore the benefits. Republicans in the Senate had been fighting to trim back the $600 benefit, saying it must be slashed so that people don’t make more in unemployment than they would if they returned to work. But their resolve weakened as the benefit expired, and Trump abruptly undercut their position by signaling he wants to keep the full $600 for now. On Friday, Trump used Twitter to explicitly endorse extending the $600 payment and to criticize Schumer. Washington’s top power players agree that Congress must pass further relief in the coming days and weeks. At stake beyond the $600 per week jobless benefit is a fresh $1,200 direct payment to most Americans, and hundreds of billions of dollars in other aid to states, businesses and the poor, among other elements. Democrats hold a strong negotiating hand — exploiting GOP divisions — and they are expected to deliver a necessary trove of votes. The COVID package will be the fifth legislative response to the pandemic and could well be the last one before the November election. The only other must-pass legislation on the agenda is a stopgap spending measure that should advance in September. Since May, Republicans controlling the Senate had kept the relief negotiations on “pause” in a strategy aimed at reducing its price tag. But as the pandemic surged back over the summer — and as fractures inside the GOP have eroded the party’s negotiating position — Republicans displayed some greater flexibility. Even with signs of progress in the talks, the list of items to negotiate remains daunting. McConnell’s must-have item is a liability shield from lawsuits for businesses, schools, and charities that reopen as the pandemic goes on. The GOP’s business allies are strong backers but the nation’s trial lawyers retain considerable clout in opposition. A compromise is probably a challenging but necessary part of a final deal. Among the priorities for Democrats is a boost in food stamp benefits. Republicans added $20 billion for agribusinesses but no increase for food stamp benefits in their $1 trillion proposal. Meadows played a role in killing an increase in food aid during talks on the $2 trillion relief bill in March, but Pelosi appears determined. The food stamp increases, many economists say, provide an immediate injection of demand into the economy in addition to combating growing poverty. “Traditionally we’ve had a partnership between farms and families, and they’ve consistently broken that,” said Sen. Debbie Stabenow of Michigan, the top Democrat on the Senate Agriculture Committee."}]}