{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-case-tally-climbs-above-39-million-as-trump-finally-urges-americans-to-wear-face-masks-2020-07-22", "published": 1595486900.0, "headline": "Coronavirus update: U.S. case tally climbs above 3.9 million and Trump's late move on face masks criticized by health experts", "body": "The number of U.S. cases of the coronavirus illness COVID-19 climbed above 3.9 million on Wednesday, a day after President Donald Trump finally encouraged Americans to wear face masks in public, marking a break with his approach to the pandemic thus far. In his first briefing on the crisis in three months, alone and without any of the health care experts on the White House Task Force created to manage the pandemic, Trump acknowledged that the pandemic \"will probably, unfortunately, get worse before it gets better,\" conceding that the deadly illness is not a hoax and will not just disappear, as he has claimed in the past. His comments came on a day when the U.S. counted more than 65,000 new infections, and more than 1,000 deaths, bumping the death toll to 142,080, according to data aggregated by Johns Hopkins University. Florida, Arizona and Texas reported record numbers of deaths from the virus for a single day on Tuesday, according to the Washington Post. The Centers for Disease Control and Prevention said reported cases of COVID-19 vastly underestimate the true number, citing a study published in JAMA, as the Associated Press reported. True COVID-19 rates were more than 10 times higher than reported cases in most U.S. regions from late March to early May, the study found, based on COVID-19 antibody tests performed on routine blood samples in 16,000 people in 10 U.S. regions. Many people had no symptoms or only mild ones and did not know they were infected and spreading the virus. Now read:Echoing Fauci's message, Trump has change of heart on face masks: 'If you're close together, I would put on the mask' Hospitals in states in the South and West, including Texas are now running out of intensive-care unit beds, according to local media. There are 42 states and territories showing rising cases over the past 14 days, according to a New York Times tracker. A Harvard Global Health Institute tracker is flashing red for 11 states, which researchers say is a sign they need to shut down again. Ashish Jha, head of the Harvard Global Health Institute, welcomed Trump's new enthusiasm for masks and respect for the virus, but said on Twitter that the rest of the briefing contained distractions and misinformation. iframe.twitter-tweet { width: 100% !important; } In an interview with MSNBC, Jha said the U.S. is hitting a wall on testing. \"We have expanded testing quite a bit since March, and that's good news,\" he said. \"But clearly there are two sets of issues: One is we don't have enough testing for the level of outbreak we have, and, second, the testing we do have, or system wasn't really designed to deliver on, and so what's happening, as you've heard, is there are 10-day, two-week turnaround times. If it's taking two weeks for the test results to come back, it's pretty close to useless at this point, so we need a whole new strategy on testing.\" Speaker of the House Nancy Pelosi said Trump's new position on masks is about three months too late: \"If he had said months ago, let's wear masks and let's not - let's socially distance instead of rallies and whatever they were, then more people would have followed his lead,\" Pelosi said in an interview on CNN. \"He's the president of the United States. Instead of being a bad example, like (making it) a manhood thing not to wear a mask.\" A group of health care experts will deliver an open letter to America's leaders later Wednesday, arguing that it's time to shut down, start over and do it right this time. The letter was signed by Ezekiel J. Emanuel, MD, Ph.D.-University of Pennsylvania, Harvard T.H. Chan School of Public Health's William Hanage, Ph.D., Northwestern University's Seth Trueger, MD, MPH and Yale School of Medicine's Reshma Ramachandran, MD, MPP, among others. \"Right now we are on a path to lose more than 200,000 American lives by November 1st,\" said Matt Wellington, U.S. PIRG's (Public Interest Research Groups) Public Health Campaigns Director. \"Yet, in many states people can drink in bars, get a haircut, eat inside a restaurant, get a tattoo, get a massage, and do myriad other normal, pleasant, but nonessential activities.\" U.S. PIRG is planning to deliver the letter to a set of governors, leadership in Congress and the Trump administration. Trump Urges Americans to Wear a Mask Latest tallies There are now 14.9 million confirmed cases of COVID-19 worldwide and at least 617,415 people have died, the Johns Hopkins data shows. At least 8.5 million people have recovered. Brazil is second to the U.S. with 2.16 million cases and 81,487 deaths. India is third measured by cases at 1.2 million, followed by Russia with 787,846 and South Africa with 381,798. The U.K. has 297,391 cases and 45,507 fatalities, the highest in Europe and third highest in the world. China, where the illness was first reported late last year, has 85,314 cases and 4,644 fatalities. Some countries are seeing renewed surges in cases after ending restrictions on movement, including Belgium, according to Agence France-Presse. Belgium had one of Europe's worst per capita tolls earlier this year, but was able to bring it under control using lockdown measures. In Japan, the governor of Tokyo has urged residents to stay at home during a coming four-day holiday weekend, after it hit a new daily record of 293 cases last week, AFP reported. Japan has had just over 26,300 cases and close to 1,000 deaths, a low figure compared with countries worst hit by the pandemic, but Japanese experts say the number of patients in serious condition is gradually increasing. Australia counted another record of 502 new coronavirus infections, mostly in the southeastern state of Victoria. Officials are working to contain an outbreak in Melbourne, which has been under lockdown for the last two weeks. What's the latest medical news? BioNTech BNTX, +1.23% and Pfizer Inc. PFE, -0.27% said they will receive $1.95 billion from the U.S. government to produce at least 1 million doses of their experimental COVID-19 vaccine if it receives approval or emergency use authorization from the Food and Drug Administration. The announcement came one day after a House of Representatives lawmaker said during a hearing that Pfizer had \"rejected taxpayer money\" for its coronavirus vaccine candidate. Most drugmakers, including AstraZeneca PLC AZN, +1.16% AZN, +0.63%  and Moderna Inc. MRNA, +0.09%, that have moved their vaccines into clinical trials in the U.S. have already established financial relationships with the U.S. government. Pfizer chief business officer John Young responded to lawmakers by saying that the company \"didn't accept the federal government funding solely for the reason that we wanted to be able to move as quickly as possible with our vaccine candidate.\" For more, read: Democratic lawmakers signal concern about coronavirus vaccine pricing, speed of development The companies also expect to launch a Phase 2b/3 clinical trial this month and aim to apply for an EUA or approval in the U.S. by October if the studies are successful. Read also:The latest victim of COVID-19: Alzheimer's researchWhat are companies saying? The second-quarter earnings season pushed on with the latest numbers from social-media service Snap Inc., parent of Snapchat, showing widening losses and weaker-than-expected revenue, as MarketWatch's Jon Swartz reported. Daily active users, an important measure of the service's popularity, improved 17% to 238 million, roughly in line with the average analyst forecast of 238.5 million. Snap said that users increased from the previous quarter and the previous year in all of its geographies. It forecast a range of between 242 million and 244 million in the third quarter. In prepared remarks, Snap Chief Financial Officer Derek Andersen estimated year-over-year third-quarter revenue growth of 32% through July 19. \"While we are cautiously optimistic that these trends could sustain over time, we are also conscious that operating conditions may remain volatile, and that economic conditions could further deteriorate,\" he said. See also: S&P 500 earnings set to plunge as the coronavirus batters all sectors - with Wall Street counting on a bounce that may not come The second-quarter jump in revenue heartened analysts, who have trained a keen eye on the financial performance of Snap during the first wave of COVID-19 in the spring. As the first major social-media company to report in the June quarter, it offered an early look at the economic damage wrought by the escalating pandemic. Guggenheim analyst Michael Morris downgraded the stock to neutral from buy Wednesday, while raising his price target to $22 from $18. \"While commentary indicated continued overall improvement from April revenue trend lows, management's cautious tone, below consensus DAU guide and meaningfully slower monetization outside the U.S. and Europe drive near-term uncertainty for an expensive stock,\" Morris wrote. There was better news from biotech Biogen Inc. BIIB, -0.13%  , which beat profit expectations for its second quarter and raised its guidance. Hospital operator HCA Healthcare Inc. HCA, +1.61%  also topped estimates after receiving $822 million of stimulus funds via the CARES Act. \"Patient volumes across most service lines were significantly impacted in April due to state and local policies implemented to contain the spread of COVID-19 and preserve personal protective equipment,\" the company said. United Airlines Holdings Inc. reported an expected billion-dollar loss and called the quarter the \"most difficult\" financial period in its 94-year history, as MarketWatch's Claudia Assis reported. Cash burn during the quarter averaged $40 million a day, including $3 million in principal payments and severance expenses, United said. It forecast its average daily cash burn to be about $25 million during the third quarter, including $6 million of principal repayments and severance expenses. United said it believes that average to be the lowest among large air carriers as it did \"the best job of matching actual capacity to demand among its largest network peers.\" See also:Tesla stock options are priced for an unusually big post-earnings move-but the odds are stacked against bettors \"We accomplished this by quickly and accurately forecasting the impact that COVID would have on passenger and cargo demand, accurately matching our schedule to that reduced demand, completing the largest debt financing deal in aviation history, and cutting expenses across our business,\" Chief Executive Scott Kirby said in a statement accompanying results. Elsewhere, companies continued to offer updates on the state of their businesses and their dealings with the public during the pandemic. Here's the latest news about companies and COVID-19: â\u0080¢ Baker Hughes Co. BKR, -1.34% posted a wider-than-expected second-quarter loss on revenue that fell more than forecast, amid the COVID-19 pandemic and the \"sharp decline\" in activity as a result of lower oil and gas prices. Oilfield services revenue declined 26% to $2.41 billion to top the FactSet consensus of $2.34 billion, while turbomachinery and process solutions revenue dropped 17% to $1.16 billion to miss expectations of $1.40 billion. Oilfield equipment revenue was roughly flat at $696 million, above expectations of $693 million. â\u0080¢ Best Buy Co. Inc.'s BBY, +1.45% U.S. online sales more than tripled in the quarter-to-date period, thanks mostly to sales of computers, appliances and tablets. Best Buy is increasing its starting hourly wage for all U.S. employees to $15 effective Aug. 2. \"Strong consumer demand, combined with shopping experiences that emphasize safety and convenience, has helped produce our sales results to date,\" Best Buy Chief Executive Corie Barry said in a statement. Shoppers were allowed into more than 800 Best Buy stores starting on June 15, and a week later most stores had reopened. Fiscal second-quarter sales increased about 2.5% quarter-to-date through Saturday. U.S. online sales rose 255% quarter-to-date through Saturday compared with the same period last year. â\u0080¢ Biogen Inc. BIIB, -0.13% reported second-quarter profit that rose well above expectations, and raised its full-year outlook. Among Biogen's biggest-selling drug products, Tecfidera revenue rose 3% to $1.18 billion, above the FactSet consensus of $1.11 billion; Spinraza revenue rose 1% to $495 million, below expectations of $506 million; and Tysabri revenue fell 9% to $432 million to miss expectations of $445 million. For 2020, Biogen raised its adjusted EPS guidance range to $34.00 from $36.00 from $31.50 to $33.50, compared with the FactSet consensus of $33.07, but lowered its revenue outlook to $13.8 billion to $14.2 billion from $14.0 billion to $14.3 billion, compared with expectations of $13.94 billion. The earnings report comes after Biogen announced late Tuesday that Chief Financial Officer Jeffrey Capello will step down, and be succeeded by Iqvia Holdings Inc.'s [s: iqv] current CFO Michael McDonnell. â\u0080¢ Check Point Software Technologies Ltd. CHKP, +1.50%,  a security software company, reported second-quarter profit and revenue that rose above expectations. The company's products and licenses, security subscriptions and updates and maintenance businesses all beat revenue expectations. Sales increased, as the pandemic accelerated organizations' migration to the cloud, and as attacks have increased against networks and systems that manage infrastructure for energy, manufacturing, transportation and utilities. â\u0080¢ HCA Healthcare Inc. HCA, +1.61%  beat estimates for its second quarter, even as the pandemic led it to accept government stimulus under the CARES Act. HCA posted a profit, instead of an expected loss. Revenue fell to $11.068 billion from $12.602 billion, above the FactSet consensus of $10.091 billion. \"Patient volumes gradually improved in May and June as states began to reopen and allow for non-emergent procedures.\" The company ended the quarter with cash of $4.638 billion, total debt of $30.942 billion and total assets of $48.709 billion. â\u0080¢ Hertz Global Holdings Inc. HTZ, -1.78% has reached an interim $650 million deal with a creditor group that has been fighting the rental-car company's plan to reduce the size of its leased fleet, mostly idled amid the coronavirus pandemic, The Wall Street Journal reported. The resolution between Hertz and its asset-backed securities lenders and their representatives is effective at least through the end of the year, the newspaper said, citing a filing in bankruptcy court. Hertz filed for bankruptcy in May and has said it wanted to cut down its fleet size. â\u0080¢ Nike Inc. NKE, +0.97% announced a number of promotions on Wednesday as part of a reorganization to align its leadership with its Consumer Direct Acceleration (CDA) initiative. CDA aims to use the athletic giant's digital capabilities to grow the direct-to-consumer business, navigate partnerships and generate long-term profitability. Among the changes, Amy Montagne will move to the role of vice president and general manager of men's from her current position as vice president and general manager of global categories; and Whitney Malkiel has been named vice president and general manager of women's, moving from vice president and general manager of specialty categories, which includes golf, tennis and Nike SB. Craig Williams, president of the Jordan brand, and G. Scott Uzzell, CEO of Converse Inc., will also join Nike's Executive Leadership Team, which reports to Nike's Chief Executive John Donahoe. The reorganization will lead to job losses and one-time employee termination costs of $200 million to $250 million. â\u0080¢ United Airlines Holdings Inc. UAL, +0.32% is requiring all of its passengers to wear a face mask while in the more than 360 airports where it operates around the world. That includes at kiosks and customer service counters, United Club locations and gates and baggage claim areas. \"If customers refuse to comply, they may be refused travel and banned from flying United at least while the mask requirement is in place,\" United. The requirement extends to all travelers apart from infants below the age of two. \"The most important thing any of us can do to slow the spread of the coronavirus is to simply wear a mask when we're around other people,\" Chief Executive Scott Kirby said in a statement. United already requires all passengers to wear a face mask while flying. The airline is also limiting the number of people on board a flight and will separate them where possible. Read now:The feared jumbo mortgage debacle is here - thanks to the coronavirus - and ready to pound the housing market"}]}