{"article": [{"url": "https://www.marketwatch.com/story/pandemic-on-track-to-crush-nyc-economy-says-influential-business-group-2020-07-20", "published": 1595273900.0, "headline": "Pandemic on track to crush NYC economy, says influential business group", "body": "As many as one-third of New York City’s small businesses fold; tens of billions of dollars are lost in city revenue; poverty and unemployment rise, crushing already strained affordable housing; and both the tourism and nonprofit funds that fuel arts and culture dry up. That’s the bleak future the five boroughs could be headed to, according to an exhaustive report the Partnership for New York, an influential business group, released Monday. The organization, which assembled the 67-page report with the help of 14 global consulting firms, is pushing for immediate private-public partnerships to avoid a worst-case scenario. “The pandemic unleashed political, racial and economic tensions that can either leave the nation’s largest and most important urban center in chaos or, as this report outlines, provide the impetus for working together for recovery and positive change,” according to the report. The damage to the city’s small and minority-owned businesses was among the most disturbing pictures painted in the report. More than 75,000 neighborhood businesses could close for good. Small businesses have already shed as many as half a million jobs as a result of the pandemic, while a decline in consumer spending has hit neighborhood retail particularly hard, the report said. The crisis has exacerbated affordability for both the commercial and residential tenants. Landlords have reported that rent collection from commercial tenants is down 60%, and residential delinquencies are occurring in 20%-25% of regulated and affordable units in the city, up from 15% before the pandemic, according to the report. That could put a strain on banks with large mortgage portfolios. But it also shows that the need for more affordable housing, already in scant supply in the city, is likely to rise. The shortage is projected to rise to 760,000 from 650,000 units by next spring, according to the report. Also see: Mass evictions could be the next crisis in New York City Meanwhile, the future of the city’s office towers remains up in the air, as many of Manhattan’s 1.2 million office workers opt to work remotely until it’s safe. At the same time, a strained real-estate sector, battered tourism, closed businesses, reduced consumer spending and other blows to the economy were on track to cause a $115 billion decline in real Gross City Product (GCP), according to the report. The city is projecting an $8 billion tax revenue decline over the next two years as a result of the crisis, further straining jobs and city services. However, a strong public health response was the first and most important step toward economic recovery, according to the organization, which also laid out a number of private-public initiatives that could help accelerate economic recovery. Also see: ‘Don’t be stupid’ — New York governor warns bars and restaurants can be closed again if street partying continues Among them is a so-called “health passport” system — reminiscent of the “health code” system in China — that would enable people to meet and move around with less restriction. One format would be an app where people upload verified proof of a COVID-19 test or, in the future, a proof of vaccination. “We need a universal standard that will allow people to move freely in and out of buildings and transit without fear of infection and illness,” said Kewsong Lee, co-CEO of The Carlyle Group and a member of the Partnership’s executive committee. Other suggestions laid out in the report included creating a clearinghouse of resources, such as lending, procurement and technical assistance, for small businesses; organized cross-sector brainstorming sessions; and private partnerships to make the city a leader in blended and online learning. New York City, once the national epicenter of the virus, saw its unemployment rate soar to a peak of 18.3% in May, with much of the job loss in leisure and hospitality. The city has recorded more than 200,000 confirmed cases of the disease and more deaths than any other city in the U.S. As of Monday, there were nearly 18,800 fatalities across the five boroughs (more than 23,400 if probable deaths are included.) Mayor Bill de Blasio did not address the report at his Monday briefing."}]}