{"article": [{"url": "https://www.marketwatch.com/story/congress-risks-creating-a-recipe-for-disaster-if-more-pandemic-aid-isnt-delivered-quickly-to-consumers-warn-bond-investors-2020-07-30", "published": 1596133100.0, "headline": "Congress risks creating a 'recipe for disaster,' if more pandemic aid isn't delivered quickly to consumers, warn bond investors", "body": "Consumers drove the U.S. economy to its longest period of economic expansion in history-or at least until the pandemic hit. That is something bond investors want policy makers in Washington to keep in mind as they haggle over another coronavirus aid package, and get down to the wire on the fate of the extra $600 a week CARES Act unemployment benefit that expires Friday. \"COVID 19 isn't anybody's fault,\" said Michelle Russell-Dowe, head of securitized credit at global asset manager Schroders, in an interview. \"But it's created a lot of potholes that need to be filled in by monetary and fiscal stimulus.\" Russell-Dowe also said its \"pretty critical\" for the economy, which shrank a record 32.9% in the second quarter, that \"Congress gets something together for consumers.\" \"Otherwise, what we've been fending off is having good borrowers, or even good companies, go bad as collateral damage.\" In June, data on car loans, credit cards and other forms of U.S. consumer debt packaged into bond deals in the $1.5 trillion asset-backed bond market showed 30-day plus delinquencies decline from a year prior, according to Goldman Sachs analysts. Stimulus in action Goldman Sachs Goldman's team points out the declines can be attributed to \"strong fiscal support\" from the CARES Act and the willingness of lenders to modify loans to keep borrowers current. But longer loan terms have been a harbinger of higher defaults, and focusing on the recent dip doesn't show how borrowers with weak finances have struggled to stay current even before the pandemic. “ \"Your most levered borrower has had to borrow to stay afloat, and already has been victimized by income inequality.\" ” - Dave Goodson, head of securitized credit at Voya Take subprime auto loan delinquencies, an area flagged as a potential concern even while the economy was roaring. Goldman's team pegged miss payments of at least 30 days at 8.85% in June from 10.86% a year prior. But \"pre-pandemic\" delinquencies also rivaled those during the aftermath of the 2007-08 global financial crisis, according to BofA data. \"In our view, if further support is not provided, credit performance will deteriorate more markedly,\" wrote BofA Global's team of analysts led by Chris Flanagan, in their second half outlook. Ralph Saturne, senior research analyst at Income Research + Management, said he's already seeing a roughly doubling of loan extensions and 60-plus day delinquencies in July, across the major consumer bond issuers he tracks, when comparing the year's first half with the same period of 2019. \"I think that's definitely a concern,\" he said. Federal Reserve Chairman Jerome Powell struck a similar tone Wednesday, when he warned that the economic recovery is showing signs of fading as U.S. Covid-19 infections accelerated since late June. He again vowed to use the Fed's \"full range of tools\" until the economy has weathered the storm of the pandemic and urged more spending by Congress. Powell also cautioned against pulling the rug out from under lower-income borrowers who have been the hardest-hit by the pandemic, which this Urban Institute report shows has been impacting Black and Hispanic, or Latino, households the most. \"In an environment like this, and even before the economic slowdown, your most levered borrower has had to borrow to stay afloat, and already has been victimized by income inequality,\" said Dave Goodson, head of securitized credit at Voya. \"The CARES Act was a godsend for those borrowers,\" he told MarketWatch, adding that it not only propped up struggling households, but also contributed to an eye popping rate of personal savings since February. \"If we get caught up in a world of uncertainty, because both sides of the political aisle negotiate this aid package into oblivion, how are borrowers supposed to plan what to do next?\" he asked. \"That could be a real recipe for disaster.\" U.S. stocks came under pressure Thursday, with the blue-chip Dow Jones Industrial Average DJIA, +0.56%  off 0.9%, but still only about 7.8% away from erasing its losses for the year, while the Nasdaq Composite Index COMP, +1.39%  was 0.4% higher, following the release of data showing the U.S. gross domestic product plunged in the second quarter to a historic low. Related: Americans will be living with the coronavirus for decades"}]}