{"article": [{"url": "https://www.marketwatch.com/story/teslas-stock-run-leads-to-5-1-share-split-2020-08-11", "published": 1597230680.0, "headline": "Tesla's stock run leads to 5-1 share split", "body": "Shares of Tesla Inc. surged 8% on Wednesday, a day after the Silicon Valley car maker's board approved a five-for-one split of the company's stock. The move was geared to \"make stock ownership more accessible to employees and investors,\" the company said. Tesla TSLA, +1.89%  shares have more than tripled so far this year. Each shareholder of record as of Aug. 21 will receive a dividend of four additional shares of common stock for each then-held share, to be distributed after the close on Aug. 28, Tesla said. See also:For Nikola stock, no news was not good news Trading on a stock split-adjusted basis will begin on Aug. 31, it said. The split is a recognition that the market \"is increasingly influenced by individual investors, including those looking to gain exposure to next-generation transportation trends,\" Baird analyst Ben Kallo wrote in a note Wednesday. Tesla shares rallied in the extended session Tuesday and in the premarket on Wednesday. That \"strength is indicative of investors electing to purchase stocks which are positioned to benefit from the current upgrade cycle for technology around transportation, renewable energy, and the software enabling both,\" Kallo said. For Wedbush analyst Dan Ives, Tesla is following Apple Inc.'s AAPL, +1.74%  lead \"and ultimately we expect more tech giants to potentially head down this path over the coming months as the parabolic rally in tech/EV names over the past five months has put companies in a position of strength to make such moves,\" he said in a note. The split was \"a smart strategic move at the right time\" for Tesla given its strong retail base and \"growing appetite\" among investors for Tesla, and, more broadly, for the electric-vehicle industry, Ives said. Tesla shares have gained 255% this year, compared with gains around 5% for the S&P 500 SPX, +0.87%, and are up 550% in the past 12 months, compared with a 17% advance for the S&P in the same period. Related:Fisker is going public: Five things to know about the electric-car maker ahead of its IPO The shares have hit a string of closing records, most recently July 20's $1,643 close. Tesla twice this year surprised investors with a quarterly profit when Wall Street called for a loss; its second-quarter earnings, its fourth consecutive quarter of GAAP profit, put it on track to join the S&P 500. The inclusion, expected to happen within a few months, would unleash a torrent of new money from countless exchange-traded funds, and be followed by pension, mutual and other actively managed funds in the U.S. and overseas, that track the large-cap benchmark or have size or other restrictions on which stocks to add to their holdings. Besides Tesla's profitability, several analysts have praised Tesla's cash reserves, the continued strong demand for its electric vehicles, its new factories being built in Texas and in Germany, and a \"battery day\" scheduled for Sept. 22 as well as the expected launch of the Cybertruck, its electric pickup."}]}