{"article": [{"url": "https://www.marketwatch.com/story/us-jobless-claims-aka-layoffs-fall-slightly-in-early-october-but-still-very-high-2020-10-08", "published": 1602153200.0, "headline": "U.S. jobless claims - aka layoffs - fall slightly in early October but still very high", "body": "The numbers: The number of Americans who applied for jobless benefits fell slightly in early October to a fresh pandemic low, but they are declining more slowly in a sign the labor market could be experiencing a setback amid another wave of corporate layoffs. Initial jobless claims filed through state programs slid to 840,000 in the week ended Oct. 3 from a revised 849,000 in the prior week, the Labor Department said Thursday. Economists polled by MarketWatch had forecast new claims to fall to 820,000. An unadjusted 464,437 people also filed new claims under the Pandemic Unemployment Assistance Act, the federal law that temporarily made self-employed workers eligible for benefits for the first time. That put the number of actual or unadjusted new claims at 1.27 million, also a pandemic low. New applications for unemployment benefits have gradually receded from a pandemic peak of 6.9 million in late March, but the weekly total has fallen by less than 100,000 in the past month. New jobless claims are still quadruple the pre-crisis average and are higher than any point during the severe 2007-2009 recession. A small but growing number of high-profile corporations in industries such as airlines and entertainment that have been hardest hit by the pandemic have announced they will cut more jobs permanently unless the government provides extra financial help. Many economists worry the economic recovery will falter without another federal relief package. Read:Consumer confidence surges to highest level since start of coronavirus pandemic What happened: New jobless claims rose the most in the states of Florida, Ilinois and Virginia. They declined the most in New Jersey and Pennsylvania. For the second week in a row, the number of new claims in California was frozen at the same level as they were on Sept. 19. The state stopped accepting claims for two weeks to process a large backlog and to install fraud-detection measures after widespread problems in its system. It's possible the claims figures in California have inflated the national total, but it won't be known until the state resumes reporting its data. California will start accepting applications again next Monday. Continuing jobless claims filed through state programs, meanwhile, sank by a large 1 million to a seasonally adjusted 10.98 million in the week ended Sept. 26. That's also the lowest level since late March, when the virus shut down much of the U.S. economy. Altogether, the number of people reportedly getting benefits through eight state and federal programs fell by 1 million to an unadjusted 25.5 million as of Sept. 19, the latest data available. Some economists question the accuracy of the estimate given that other government data shows the pool of unemployed is about half that size. Big picture: The economy is still growing, but not as rapidly as it was earlier in the summer. The big worry now is that another wave of layoffs could crash over the economy and stunt the recovery. Disney DIS, +1.53%  , American Airlines AAL, +0.34%, United Airlines UAL, +0.32%  and MGM Resorts MGM, -2.59%  are among a coterie of large companies that say they plan to cut more jobs in light of ongoing difficulties. Yet consumer confidence surged in September to the highest level since the pandemic and the economy is still adding more jobs than it's losing. Other economists say the recovery appears durable enough to keep growing even without another massive dose of federal aid. Right now it looks like the economy is largely on its own. Democrats and Republicans in Congress have been deadlocked for months over another round of financial aid and it's unclear if any more help is coming before the election in early November. What they are saying? \"The decline in continuing claims is welcome, but initial claims offer a better read on the real-time state of the labor market, and the downward trend has stalled, more or less,\" said chief economist Ian Shepherdson of Pantheon Macroeconomics. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% rose in Thursday trades."}]}