{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-struggle-for-direction-after-hurricane-laura-spares-refineries-2020-08-28", "published": 1598628620.0, "headline": "Oil prices edge lower, but tally a weekly gain after Hurricane Laura spares refineries", "body": "Oil futures ended modestly lower Friday, but tallied a weekly gain a day after Hurricane Laura made landfall on the Gulf Coast as a Category 4 storm but refineries were spared from extensive damage. “No reports of major damage to refineries or massive flooding should allow the industry to bounce back quickly,” said Phil Flynn, senior market analyst at The Price Futures Group, in a Friday note. “While refineries may stay shut for weeks, they will use this opportunity to do maintenance, and after some seasonal weakness in prices, petroleum should resume its longer-term upward trend.” Read:Hurricane Laura may do little to disturb relative calm in summer gasoline prices West Texas Intermediate crude for October delivery CL.1, -1.62% fell 7 cents, or 0.2%, to settle at $42.97 a barrel on the New York Mercantile Exchange. Based on the front-month contracts, prices saw a weekly climb of 1.5%, which represents their fourth weekly rise in a row according to Dow Jones Market Data. October Brent crude UK:BRNV20, the global benchmark, lost 4 cents, or 0.09%, at $45.05 a barrel on ICE Futures Europe, ahead of the contract’s expiration at Monday’s settlement. For the week, front-month contract prices climbed by 1.6%. Hurricane Laura was responsible for at least six deaths and caused extensive damage as it came ashore and moved inland Thursday. However, production from oil rigs in the Gulf of Mexico and activity at refiners in the Gulf Coast, the heart of the U.S. oil-processing industry, was expected to rebound quickly. The five Texas oil refineries that were shut ahead of Hurricane Laura are planning to restart soon, but two major refineries near Lake Charles, La. May take longer due to power outages and “potentially more serious storm damage,” according to an article Friday from S&P Global Platts. The storm surge was less than anticipated, lowering the probability of prolonged downtime, said Jason Gammel, analyst at Jefferies, in a note. Still, largely all the refining capacity in Lake Charles, Louisiana, and nearby Port Arthur, Texas, was offline in anticipation of the storm, he noted, which along with some reductions and closures in the Houston area likely affected around 3.4 million barrels a day of distillation capacity. ”In normal times this might have led to a sustainable surge in refining margins, but we expect the gains this week will be fleeting given the ample unutilized capacity elsewhere and high product inventories,” Gammel said. Around half of U.S. petroleum refining capacity is located outside of the region. Analysts said crack spreads—the difference in price between a barrel of crude and the products refined from it—remain at unattractive levels, which could weigh on demand for oil. The gasoline crack spread settled at $7.95 on Thursday, the weakest settlement since April 13, said Robert Yawger, director of energy at Mizuho Securities, while the heating oil crack ended at $8.657, the lowest since June 4. “Refiners generally do not make money when the cracks are trading at levels below $10…Refiners may be reluctant to quickly return to production when the product they make is a money losing proposition,” he said, in a note. Data from the Interior Department’s Bureau of Safety and Environmental Enforcement on Friday estimated that 84.3% of current oil production in the Gulf of Mexico was shut in, with shut ins of 60.1% for natural-gas production—both unchanged from Thursday. Also Friday, Baker Hughes BKR, -1.34% reported a decline of 3 in this week’s number of active U.S. oil rigs. Last week, it was up by 11 rigs, following three weeks of declines. On Friday, front-month September gasoline US:RBU20 rose 2.4% at $1.3155 a gallon, with prices up nearly 2.5% for the week, while September heating oil US:HOU20 added nearly 0.5% at $1.2162 a gallon—up 0.7% for the week. The September contracts expire at Monday’s settlement. On its first full session as a front-month contract, October natural gas US:NGV20 fell 2% to $2.657 per million British thermal units. For the week, the contract was up 3.3%, but prices rose 8.5% from last Friday’s finish for the September contract, which was the front month."}]}