{"article": [{"url": "https://www.marketwatch.com/story/10-year-treasury-yield-pops-back-above-060-as-traders-brace-for-key-bond-auction-2020-08-11", "published": 1597162280.0, "headline": "10-year Treasury yield pops back above 0.60% after its biggest daily jump in two months", "body": "U.S. Treasury yields climbed on Tuesday as the bond market came under pressure due to a combination of coronavirus-vaccine developments, increased debt supply worries and improved economic data.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 8.4 basis points to 0.657%, its highest since July 6, marking its biggest daily rise since June 5. The two-year note rate TMUBMUSD02Y, 0.156% rose 3 basis points to 0.159%, its highest since July 13. The 30-year bond yield TMUBMUSD30Y, 1.576% surged 9.9 basis points to 1.347%, its highest since July 8. Bond prices move inversely to yields. What’s driving Treasurys? Investors handled some news on the medical front after Russia announced it had approved the world’s first vaccine against the coronavirus, but questions around its safety remained. The U.S. Treasury Department sold $48 billion of three-year notes on Tuesday afternoon to strong demand after yields rose enough to attract bargain-searching bond-buyers. At the same time, the increased supply helped to push yields higher ahead of the sale as traders made room for the influx of debt. The auction was $10 billion larger than when the U.S. Treasury first started increasing the size of its debt sales back in April to finance the response to the COVID-19 pandemic. Some data also added to pressure on the bond market, which has been on the backfoot in the past few days. U.S. producer prices jumped by an unexpected 0.6% in July, well above the 0.3% forecast from MarketWatch-polled economists, allaying concerns that the U.S. was at the risk of succumbing to deflationary pressures. What did market participants say? “The Russian vaccine story is being taken as positive, the administration’s executive order put into place more stimulus without congressional action, and then you had a slowing of the infection rate which has become a bit of a reality. Investors are also asking themselves do they want to keep sitting in the bond market with all these low yields,” Tom di Galoma, managing director of Treasurys trading at Seaport Global Securities, told MarketWatch."}]}