{"article": [{"url": "https://www.marketwatch.com/story/stock-index-futures-falter-ahead-of-us-gdp-data-weekly-jobless-claims-2020-07-30", "published": 1596126320.0, "headline": "Dow, S&P 500 finish lower but Nasdaq books a gain ahead of parade of earnings from megacap tech-related firms", "body": "U.S. stocks finished off their worst levels of the day, with the Nasdaq eking out a positive finish as investors braced for a litany of quarterly results from behemoths of the technology and e-commerce world, which could influence trade to end a choppy week. Markets were under pressure at the start of Thursday’s action, prompted by the worst GDP on record in the second quarter and a labor-market report that underscores a rise in COVID-19 cases. Lack of progress in talks between congressional Democrats, Republicans and the White House on a new coronavirus aid package also weighed on sentiment. How did major benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% closed 225.92 points, or 0.9%, at 26,313.65, while the S&P 500 SPX, +0.87% lost 12.22 points, or 0.4%, to close at 3,246.22, but had been down by as many as 550 points at the session’s nadir. The Nasdaq Composite Index COMP, +1.39%, meanwhile, gained 44.87 points, or 0.4%, to end at 10,587.81 after hitting an intraday low at 10,412.09. All three benchmarks closed well off their worst levels of Thursday trade. Read:Nasdaq Composite exhibiting signs of panic-like buying as stock market trades off its lows on Thursday On Wednesday, the Dow rose 160.29 points, or 0.6%, to close at 26,539.57, while the S&P advanced 40 points, or 1.2%, finishing at 3,258.44. The Nasdaq Composite jumped 140.85 points, or 1.4%, to end at 10,542.94.What drove the market? Markets mostly ended lower but clawed back from their worst levels of the session after a first reading on U.S. gross domestic product data for the second quarter confirmed the pandemic pummeled the economy. GDP fell at a 32.9% annualized pace, the Commerce Department said, a bit better than the 34.6% annual decline forecast in a MarketWatch survey, but still the worst in history. Separately, first-time claims for unemployment benefits rose slightly last week, to 1.43 million from an upwardly-revised 1.42 million, while continuing claims also rose to 17 million in the week ended July 18. “This is really a day that will live in infamy,” said Kent Engelke, chief economic strategist and managing director of Glen Allen, Va.-based Capitol Securities. The economic data wasn’t as bad as feared, Engelke said in an interview just before the opening bell, but four of five of the largest companies in the market report earnings after the close, an event that could be “pivotal,” he added. “We have this incredible wall of worry,” Engelke said. “The Fed told us yesterday, we’re going to keep zero interest rates forever and ever. But how is this going to impact us down the road? Gold and the dollar are telling us something. What about November? The election is going to get uglier and uglier. How is this going to weigh on sentiment? I could see the wall of worry increasing to a gargantuan cliff.” There were no signs of progress toward a spending package as lawmakers face a self-imposed Friday deadline to work out a deal. That’s when supplemental unemployment benefits, which have been credited with helping to cushion the blow of the pandemic, are due to expire. Stocks extended gains Wednesday after the Fed left interest rates unchanged as expected, and indicated that it planned to keep rates near zero and continue to provide support to the economy — and do more if needed. Fed Chairman Jerome Powell warned that the resurgence in coronavirus cases in many U.S. states may be damping economic growth and said that the path of the recovery depends on the path of the virus. The moves came ahead of what will be the most hectic day of corporate earnings reporting season, with results from dozens of high-profile companies due after the bell on Thursday, including Google parent Alphabet Inc. GOOG, +1.97% GOOGL, +1.82%, Apple Inc. AAPL, +1.74% Facebook Inc. FB, +0.26% and Amazon.com Inc. AMZN, +3.01% Chief executives from those four companies were grilled for hours Wednesday in a virtual hearing before the antitrust subcommittee of the House Judiciary Committee. Read:Amazon, Apple, Facebook and Google CEOs grilled by House members in historic antitrust hearingWhich companies were in focus? Procter & Gamble Co. PG, +0.89% shares rose 2.4% after the consumer products company delivered fiscal fourth-quarter profit and revenue that topped expectations and provided an upbeat outlook, driven by increased demand for household cleaning and personal health products amid the COVID-19 pandemic. Shares of United Parcel Service Inc. UPS, +0.27% surged 14.4%, after the package delivery giant reported second-quarter profit and revenue that easily topped forecasts, driven by a surge in residential demand and health care shipments that emerged from the COVID-19 pandemic. ConocoPhillips COP, -1.12% reported a quarterly loss that was wider than Wall Street had expected. Stay-at-home orders and the slumping oil price pushed earnings down sharply, management said. Shares ended off 5.8%. Keurig Dr Pepper Inc. KDP, +1.91% reported adjusted earnings that beat analyst forecasts as consumers increasingly used its K-cup coffee makers at home during the pandemic. Shares fell 1.6%. Yum Brands Inc. YUM, +0.08% shares finished down 3.4% after the parent company of Taco Bell, KFC and Pizza Hut reported earnings that weren’t as bad as analysts had anticipated. Eli Lilly shares LLY, +2.20% closed down 5.4% after the drugmaker beat profit expectations and raised its full-year outlook, while revenue fell short of forecasts. Shares of General Electric Co. GE, +2.85% closed 5% lower one day after reporting earnings. Northrop Grumman NOC, -1.37% Shares of jumped 3.4% after the defense contractor delivered larger-than-expected profit and sales for the second quarter and raised its full-year guidance. DuPont shares DD, +0.06% finished down 2.6% after the chemical company reported a wider-than-expected loss. Dunkin’ Brands DNKN, +1.26% reported second-quarter adjusted profit that fell below expectations, but revenue that fell less than forecast and announced the reinstatement of its dividend program. Shares were down 4.2%. How did other markets trade? In Asia, China’s CSI 300 index 000300, +2.04% fell 0.5%, the Shanghai Composite SHCOMP, +1.67% declined 0.2%, Hong Kong’s Hang Seng Index HSI, -0.30% lost 0.7% and Japan’s Nikkei 225 NIK, -0.11% gave up 0.3%. European bourses narrowed earlier losses, with the Stoxx 600 Europe index SXXP, +0.55% closing 2.2% and the U.K.’s FTSE 100 UKX, +0.64% finishing 2.3% lower. Gold futures US:GCQ20 fell by $11.10, or 0.6%, to settle at $1,942.30 an ounce, after settling at a record on Wednesday, marking its ninth straight advance, which is its longest win streak since a 10-session climb ended in January. Meanwhile the ICE U.S. Dollar Index DXY, -0.58% edged down 0.1%. Oil futures US:CLU20 were lower on demand concerns, with the U.S. benchmark US:CLU20 dropping $1.35, or 3.3%, to settle at $39.92 a barrel. The yield on the 10-year U.S. Treasury note TMUBMUSD10Y, 0.777% dropped 3.8 basis points to 0.540% to around its lowest since March 9, according to Dow Jones Market Data. Yields move in the opposite direction of prices. Read next:‘The stock market no longer thinks it needs the economy if it has the Fed,’ David Rosenberg says"}]}