{"article": [{"url": "https://www.marketwatch.com/story/can-you-answer-all-six-of-these-simple-questions-2020-09-21", "published": 1601121140.0, "headline": "Hope to retire someday? See if you can answer these six simple questions", "body": "So you think you’re financially astute? Then try taking the following financial literacy test containing just three basic questions about interest rates, inflation and diversification. Despite being quite elementary, only 34% of adults aged 38 to 64 are able to answer all three correctly. Among millennials this percentage is just 16%. Those results are sobering enough. But what’s even more striking is the disconnect between these low scores and investors’ self-perception. More than 71% of older adults rate themselves as having “high financial knowledge.” The comparable percentage among millennials is only slightly lower at 62%. These results are reported in a just-published study, “Millennials and money: Financial preparedness and money management practices before COVID-19.” Its authors, all affiliated with the Global Financial Literacy Excellence Center at George Washington University, are Annamaria Lusardi (the Center’s founder and director), Andrea Hasler, and Andrea Bolognesi. Here are these three basic questions for which the researchers report “shockingly low” levels of financial literacy. They were devised a decade ago by Lusardi and Olivia Mitchell, a professor at the Wharton School of the University of Pennsylvania, and have been so widely used since then that many researchers now refer to them as the “Big Three” of financial literacy. (The correct answers, should you have any doubt, are listed at the end of this column.) • Suppose you had $100 in a savings account and the interest rate was 2% per year. After five years, how much do you think you would have in the account if you left the money to grow? [More than $102; Exactly $102; Less than $102; Don’t know; Prefer not to say] • Imagine that the interest rate on your savings account was 1% per year and inflation was 2% per year. After 1 year, how much would you be able to buy with the money in this account? [More than today; Exactly the same; Less than today; Don’t know; Prefer not to say] • Buying a single company’s stock usually provides a safer return than a stock mutual fund. [True; False; Don’t know; Prefer not to say] Since you are regular readers of MarketWatch and subscribers to Retirement Weekly, I have no doubt that you correctly answered all three questions. But can you answer the following three bonus questions as well? Only 7% of older adults could answer all six questions correctly, and just 3% of millennials. These three additional questions are: • If interest rates rise, what will typically happen to bond prices? [They will rise; They will fall; They will stay the same; There is no relationship between bond prices and the interest rate; Don’t know; Prefer not to say] • Suppose you owe $1,000 on a loan and the interest rate you are charged is 20% per year compounded annually. If you didn’t pay anything off, at this interest rate, how many years would it take for the amount you owe to double? [Less than 2 years; At least 2 years but less than 5 years; At least 5 years but less than 10 years; At least 10 years; Don’t know; Prefer not to say] • A 15-year mortgage typically requires higher monthly payments than a 30-year mortgage, but the total interest paid over the life of the loan will be less. [True; False; Don’t know; Prefer not to say] There are several reasons to focus on how few are able to answer these questions correctly. The most important is that there is a direct causal connection between illiteracy and reduced retirement financial security. This has been shown empirically, such as in this study by Lusardi and Mitchell. The authors of this recent report give a few examples, including the widespread use among millennials of “alternative financial services.” “Alternative financial services are forms of short-term borrowing that fall outside of the traditional banking sector. It includes borrowing using auto title loans, payday loans, pawnshops, and rent-to-own stores. These are particularly expensive forms of borrowing, with APRs as high as 400% or more and, as such, have been defined as high-cost borrowing methods. In 2018, a staggering 43% of millennials reported using at least one form of alternative financial service in the [prior] five years.” This surprising reliance on high-cost-borrowing methods becomes less surprising when we focus on millennials’ answer to the second of the bonus questions above—the one that asks about compound interest. Just 32% of them could answer it correctly. The researchers found that higher levels of financial literacy were correlated with less reliance on alternative financial services. Another reason to focus on financial literacy is to warn you about the dangers of overconfidence. Chances are good that you rate your financial literacy to be higher than it really is. And overconfidence leads to pursue particularly risky behaviors. The investment moral I draw from this new report is the importance of using the services of a retirement financial expert. Having someone to bounce your ideas off of is an excellent way of making sure you haven’t built your retirement financial security on a shaky foundation. Having this reality check is important for all of us, even if we are in that small minority of investors who can correctly answer all six financial literacy questions. Most of all, be on guard against overconfidence. Humility is a virtue. Correct answers to the 6 financial literacy questions 1. Suppose you had $100 in a savings account and the interest rate was 2% per year. After 5 years, how much do you think you would have in the account if you left the money to grow? More than $102 2. Imagine that the interest rate on your savings account was 1% per year and inflation was 2% per year. After 1 year, how much would you be able to buy with the money in this account? Less than today 3. Buying a single company’s stock usually provides a safer return than a stock mutual fund. False 4. If interest rates rise, what will typically happen to bond prices? They will fall 5. Suppose you owe $1,000 on a loan and the interest rate you are charged is 20% per year compounded annually. If you didn’t pay anything off, at this interest rate, how many years would it take for the amount you owe to double? At least 2 years but less than 5 years 6. A 15-year mortgage typically requires higher monthly payments than a 30-year mortgage, but the total interest paid over the life of the loan will be less. True Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com."}]}