{"article": [{"url": "https://www.marketwatch.com/story/feds-clarida-expects-pickup-in-growth-to-continue-for-rest-of-year-11596632728", "published": 1596625880.0, "headline": "Fedâ\u0080\u0099s Clarida expects pickup in economic growth to continue for rest of year", "body": "Richard Clarida, vice chairman of Federal Reserve System, speaks during the National Association of Business Economics (NABE) economic policy conference in Washington, D.C., U.S., on Tuesday, Feb. 25, 2020. This year's annual conference theme is \"Examining Policy Prescriptions in an Election Year.\" Photographer: Sarah Silbiger/Bloomberg While the outlook for the U.S. economy is â\u0080\u009ccomplex,â\u0080\u009d Federal Reserve Vice Chairman Richard Clarida said Wednesday that he remains confident the economy will continue to grow over the rest of the year. â\u0080\u009cI do think economic activity began to pick up in May and June and my personal forecast is that will continue into the second half of the year,â\u0080\u009d Clarida said in an interview on CNBC. Clarida said the â\u0080\u009cgood newsâ\u0080\u009d in the outlook was that the economic momentum from mid-May until early July was â\u0080\u009cmore solidâ\u0080\u009d than he expected. The â\u0080\u009cbad newsâ\u0080\u009d is the recent pickup in coronavirus infections, he said. Clarida said he thought that White House officials and Democrats in Congress would ultimately reach a deal on a new fiscal stimulus package. â\u0080\u009cSo I think if you mix it all together itâ\u0080\u0099s a complex picture but my baseline view for the outlook is not really changed,â\u0080\u009d he added. Clarida, who is a member of Fed Chairman Jerome Powellâ\u0080\u0099s inner circle, said the economy could return to its pre-pandemic level of activity at the end of 2021. Thatâ\u0080\u0099s faster than some other Fed officials have estimated. Stocks opened higher on Wednesday despite the disappointing July ADP reading. The Dow Jones Industrial Average DJIA, +0.56% was up 300 points in morning trading ."}]}