{"article": [{"url": "https://www.marketwatch.com/story/pactiv-evergreen-begins-trading-below-ipo-price-and-sinks-further-2020-09-17", "published": 1600443560.0, "headline": "Pactiv Evergreen begins trading below IPO price and sinks further", "body": "Food packaging manufacturer and distributor Pactiv Evergreen Inc. got off to a slow start when it began trading on Thursday. The first trade was at $12.75 at 10:50 a.m. Eastern for 2.3 million shares. The stock proceeded to fall as much as 19.6% in Thursday afternoon trading. Shares closed at $10.93, and bounced back 3.6% on Friday. Pactiv Evergreen’s PTVE, +4.74% initial public offering priced at $14, well below the expected range of $18 to $21. The company offered 41.03 million shares in the IPO. Graeme Hart, owner of Rank Group, agreed to purchase 3.6 million shares for about $50 million. Pactiv Evergreen trades on the Nasdaq under the ticker “PTVE.” The Illinois-based food packaging company raised $574 million in the IPO and was valued at about $2.46 billion at the IPO price. Fourteen banks underwrote the deal, led by Credit Suisse and Citigroup. Proceeds will be used to repay debt and for general corporate purposes. Read:Snowflake IPO surge makes it the priciest tech stock by a mile When you buy a container of fruit at the grocery store or a cup of coffee at your favorite beverage chain, there’s a good chance that the packaging those items come in is made by Pactiv Evergreen. “We are the largest manufacturer and distributor of fresh food service and food merchandising products and fresh beverage cartons in North America (as measured by revenue),” the company said in its prospectus. Pactiv Evergreen’s products include hot and cold cups, meat trays and egg cartons. Items are made from a range of materials such as resins, plant- and paper-based fibers. These items are sold to fast-food chains, supermarkets and food processors. As of December 31, 2019, the company had 46 manufacturing and 27 distribution facilities with 98% of the products sold manufactured in the U.S. Over the past two fiscal years, Pactiv Evergreen has invested about $374 million in areas like automation and operational efficiency. And in 2019, $22 million, on a pro forma basis, was spent on research and development. The business is divided into three segments: food service, food merchandising and beverage merchandising. Nearly half (42%) of fiscal 2019 pro forma net revenue was generated by the food service business, at $2.2 billion. More than a quarter (28%) came from beverage merchandising at $1.6 billion, and 27% from food merchandising at $1.4 billion. The food service business has been hit hard by the coronavirus pandemic, with cafeterias, restaurants and other dining venues operating with reduced guests or shuttered all together for a period. See:IPO market gears up for busiest week since May 2019 — when Uber went public — with 12 deals on tap “Our food service segment has experienced a significant decline in net revenue due to the closure or reduced activity of restaurants,” the prospectus says, though business began to recover toward the end of second quarter as restrictions eased. “Our food merchandising segment has experienced a strong market demand for many of our products such as meat trays as people continue to eat more at home, while there has been a decline in demand for other products, such as bakery and snack containers typically used in many of the group gatherings that were either canceled or scaled back during the second quarter.” For the six months ending June 30, pro forma net revenue totaled $2.319 billion, down from $2.582 billion last year. The company intends to pay a dividend. The company notes that during the last recession, the operating income from its food service and packaging business rose 28% from $234 million to $300 million from 2008 to 2009. “We believe our participation in recession-resilient food and beverage end markets helps us maintain a strong financial profile for each of our segments throughout the economic cycle,” the prospectus says. “Regardless of the economic environment, consumers will continue to eat and drink and our products keep their food and beverages safe and fresh.” John McGrath has served as Pactiv Evergreen’s chief executive since 2010, and has been a member of the board since August. The company was incorporated under the name Reynolds Group Holdings Limited on May 30, 2006 under the Companies Act 1993 of New Zealand. The company was incorporated in Delaware under Pactiv Evergreen Inc. prior to the offering. Pactiv Evergreen tallied 89% of its fiscal 2019 revenue in the U.S. and the remainder from the rest of North America. For fiscal 2019, about 65% of the company’s pro forma net revenue came from products made from recycled, recyclable or renewable materials. Pactiv Evergreen aims to make all of its items from eco-friendly materials by 2030. Among the company’s new products are the EarthChoice line of compostable plates and bowls. Nineteen percent of Pactiv Evergreen’s fiscal 2019 pro forma revenue came from cups and lids, followed by cartons for fresh beverage (16%), containers (15%) and dinnerware (10%). Clients include McDonald’s Corp. MCD, -0.43%, Starbucks Corp. SBUX, +0.53% Amazon.com Inc.’s AMZN, +3.01% Whole Foods Market, Coca-Cola Co. KO, +0.69% and Pete & Gerry’s Organic Eggs. The Renaissance IPO ETF IPO, +1.98% has soared 55.4% for the year to date while the S&P 500 index SPX, +0.87% is up 3.2% for the period. Also: Red-hot IPO market sends Snowflake surging and JFrog leaping, with more software companies to come Here are five things to know about Pactiv Evergreen: • Its operations are considered “essential businesses.” As an essential business, Pactiv Evergreen facilities remained open during government lockdowns instituted to stop the spread of COVID-19. However, some of the companies are located in places that have high rates of infection, resulting in many workers out sick or quarantined. Production was impacted at these plants. Pactiv Evergreen has put measures in place, such as providing personal protective equipment and social distancing rules. Costs have increased as a result of the pandemic, but the company has made adjustments, such as furloughing certain employees and cutting nonessential spending. Moreover, the company plans to invest $9 million to shift its focus toward in-demand items during the pandemic. Pactiv Evergreen expects the impact on its business to be less significant in the third quarter, though the effect down the line is uncertain. The company has not experienced any significant supply chain disruptions up to this point. • The company has “significant” debt and a history of net losses. Pactiv Evergreen had $743.5 million in debt as of June 30. Net losses for fiscal 2019 totaled $168 million. Don’t miss:Snowflake IPO: 5 things to know about the Berkshire-backed company after its record software offering • Pactiv Evergreen is involved in a number of legal proceedings. “If liabilities or fines resulting from these proceedings are substantial or exceed our expectations, our business, financial condition or results of operations may be adversely affected,” the prospectus said. • There are risks associated with the company’s pension plans. The company’s largest pension plan is RGPP. “[W]hile persons who have never been our employees do not currently accrue benefits under the plan, the total number of individuals/beneficiaries covered by this plan is much larger than if only our personnel were participants,” the prospectus said. “For this reason, the impact of the pension plan on our net income and cash from operations is greater than the impact typically found at similarly sized companies.” • Pactiv Evergreen’s hedging activity could lead to major losses. The company enters into hedging transactions to limit its exposure to raw material and energy price risks. Commodity hedging is primarily in resin, natural gas, ethylene, and other materials. The company also depends on a small number of raw material suppliers, in some cases, a single supplier, which could harm the business. Additional reporting by Ciara Linnane and Tomi Kilgore."}]}