{"article": [{"url": "https://www.marketwatch.com/story/the-decades-hottest-investing-trend-playing-it-safe-11601585149", "published": 1601716160.0, "headline": "â\u0080\u0098Anything can happen:â\u0080\u0099\nWhy the hottest investing trend is playing it safe", "body": "Don't be a turkey. iStockphoto â\u0080\u009cConsider a turkey that is fed every day. Every single feeding will firm up the birdâ\u0080\u0099s belief that it is the general rule of life to be fed every day by friendly members of the human race â\u0080\u0098looking out for its best interests,â\u0080\u0099 as a politician would say. On the afternoon of the Wednesday before Thanksgiving, something unexpected will happen to the turkey. It will incur a revision of belief.*â\u0080\u009d â\u0080\u0095Â Nassim Nicholas Taleb,Â The Black Swan: The Impact of the Highly Improbable Does anything from your recent experience make you feel like Talebâ\u0080\u0099s poor turkey on the fateful Wednesday before Thanksgiving? Say February 2020, when stocks plummeted from all-time highs to a sharp correction in a matter of days? Or maybe you think of September 2008, when the entire financial system was brought to its knees? If you feel like youâ\u0080\u0099ve incurred your own â\u0080\u009crevision of beliefâ\u0080\u009d over the past few years â\u0080\u0094 the entire global financial system canâ\u0080\u0099t just collapse overnight, modern science will keep us safe from a little virus, the greatest democracy in the world never has to think twice about a peaceful and orderly transition of power â\u0080\u0093 youâ\u0080\u0099re not alone. Whether the world truly is more unstable, or itâ\u0080\u0099s just that investors, advisers and analysts have grown gun-shy, a change has been rippling through the investing landscape. Bored millennials making the stock market into a casino grab headlines, but the more meaningful shift may be happening at the opposite end of the spectrum. Controlling risk, even at the expense of giving up some upside reward, may end up being the investment theme that defines the decade. After all, the investment industry already has built an arsenal of products to make that happen. â\u0080\u009cWe now have so many instability points that we can no longer model all of them,â\u0080\u009d said Dave Nadig, chief investment officer and director of research at ETF Database. â\u0080\u009cFive years ago there was no sense that there was a shoe that was about to drop. Now it feels like there are quite a few shoes about to drop. It is very reasonable to be worried about risk right now.â\u0080\u009d One of the most visible industry efforts to address such risk came a few years ago, when the biggest concern among investors was rising interest rates, and the likely end of the longest bull market in history. In mid-2018, a company called Innovator launched one of the first set of products known as â\u0080\u009cdefined outcomeâ\u0080\u009d exchange-traded funds. The funds BOCT, +0.62% POCT, +0.45% UOCT, +0.32% use options to allow investors to participate in the stock market â\u0080\u0093 to a degree. Losses are limited, but so are upside gains â\u0080\u0093 and the investor always knows by exactly how much. Innovatorâ\u0080\u0099s Defined Outcome products have attracted over $3.4 billion, and a host of similar products from issuers like First Trust and Cboe Vest joined in. More recently, a firm called Cabana Asset Management took a strategy it had run for client accounts, which rebalances money among various asset classes based on a macro model, and launched a series of ETFs pegged to it. Each of the five ETFs TDSC, +0.18% in the lineup has a particular target (but not a guarantee) â\u0080\u009cdrawdownâ\u0080\u009d â\u0080\u0093 or maximum amount it can lose. Also in September, a new company called Simplify launched a set of funds, also using options SPYC, +0.83%, to harness the financial-markets concept known as â\u0080\u009cconvexity,â\u0080\u009d in which bigger swings in the market can mean more upside for the investor. The trend says a lot about investor psyche, said Corey Hoffstein, chief investment officer of Newfound Research. â\u0080\u009cInvestors seem to be willing to explicitly define the upside theyâ\u0080\u0099re going to give up. It speaks to me of a lot of risk aversion and desire for certainty in the planning process.â\u0080\u009d But perhaps more explicitly, Hoffstein said in an interview, it also speaks to financial markets so upended by the 2008 and 2020 crises that the asset class ordinarily used to mitigate risk â\u0080\u0093 bonds â\u0080\u0093 largely have been taken off the table. â\u0080\u009cA lot of the problems advisors are faced with are what to do with bond allocation,â\u0080\u009d Hoffstein said. â\u0080\u009cWith 10 year rates TMUBMUSD10Y, 0.777% so low, the math is inescapable. Fixed-income may not serve as the yield generator and portfolio buoy as it did in the past. A lot of advisors have been burnt by alternatives and are trying to find alternative methods that have greater transparency.â\u0080\u009d Philadelphia-based Kathmere Capital Management, which serves high-net-worth households, uses Innovator products in its model portfolios. Kathmere upped its allocation in May, after the big March crash and the subsequent rebound, CIO Nicholas Ryder told MarketWatch. â\u0080\u009cOur thesis was that markets had rallied close to near all-time highs and we thought the balance was tilted to the downside and as a result, we said, letâ\u0080\u0099s move modestly defensive.â\u0080\u009d But given how little bonds were yielding, and the very real possibility that the only realistic path for rates was up, the firm didnâ\u0080\u0099t want to put money in bonds or cash.Â â\u0080\u009cWe think of the Defined Outcome products as another form of defensive equity,â\u0080\u009d Ryder said. Not everyone is sold. John Davi is the founder of Astoria Advisors, a New York City-based firm that constructs â\u0080\u009cinstitutional-typeâ\u0080\u009d portfolios for advisers to bring to individual-investor clients.Â â\u0080\u009cWe wouldnâ\u0080\u0099t necessarily use this type of product,â\u0080\u009d Davi said in an interview. â\u0080\u009cWe would solve for the outcome ourselves using our own strategic asset allocation.â\u0080\u009d Investors have spent the past decade or so believing rates canâ\u0080\u0099t go any lower, and yet they have, Davi pointed out. â\u0080\u009cI would argue that people should develop a strategic asset allocation and really understand where they are on the risk curve. If youâ\u0080\u0099re concerned about volatility youâ\u0080\u0099re probably taking too much risk.â\u0080\u009d Read: The Fed has bought $8.7 billion worth of ETFs. Here are the details Still, most market participants who spoke with MarketWatch for this story think advisers who rely on bonds arenâ\u0080\u0099t serving clients well â\u0080\u0093 and that their loss is being felt. Hoffstein, for one, thinks the move toward risk-management products is â\u0080\u009ca growing trendâ\u0080\u009d and expects to see more iterations. â\u0080\u009cWhat people actually always want is annuities,â\u0080\u009d Nadig said. â\u0080\u009cThey want someone to tell them, youâ\u0080\u0099re going to get this pattern of returns and weâ\u0080\u0099ll figure it out for you. That doesnâ\u0080\u0099t work in the real world. Removing bonds from the equation means all these things try to squeeze into bond-like clothing.â\u0080\u009d Ironically, itâ\u0080\u0099s most likely the response to the crises of the past decade, in the form of central banks hoovering up so much of the bond market, thatâ\u0080\u0099s created this dilemma. Robert Davis is CIO of Round Table Services, a registered investment advisor, which uses Innovatorâ\u0080\u0099s products to allow clients to stay invested but â\u0080\u009cmaintain risk.â\u0080\u009d In an interview, Davis mused on the current market landscape. â\u0080\u009c2008 and 2020 have illuminated the idea that things can happen that no one even thought of,â\u0080\u009d he said. â\u0080\u009cIn this crisis, the market sold off and hit its bottom in 23 days. That was amazing. If you had told me, the government is going to shut down the economy and no-one is allowed out, Iâ\u0080\u0099d say you were crazy. Itâ\u0080\u0099s almost like the tails on what can happen now have widened.â\u0080\u009d It makes an adviserâ\u0080\u0099s job more tricky, Davis thinks. â\u0080\u009cFrom a risk management perspective, we have to be more cognizant of what can happen. Even if itâ\u0080\u0099s a low probability, we need to have those tools in our investment portfolio. Certainly, you can reduce risk in bonds but with the ten year at 66 basis points, itâ\u0080\u0099s not like years ago where you make capital appreciation. Today, itâ\u0080\u0099s just like parking it somewhere and hoping yields donâ\u0080\u0099t rise.â\u0080\u009d The risks may be shifting, Davis said, but so too are the tools. Theyâ\u0080\u0099re becoming â\u0080\u009cmore innovative.â\u0080\u009d Read next: Investing legend Burton Malkiel on day-trading millennials, the end of the 60/40 portfolio and more"}]}