{"article": [{"url": "https://www.marketwatch.com/story/why-you-might-want-to-consider-ditching-your-401k-plan-2020-07-21", "published": 1595675120.0, "headline": "Why you might want to consider ditching your 401(k) plan", "body": "“ ‘The claim that a frog placed in slowly warming water will die without trying to escape is factually incorrect, but too useful a metaphor to discard. We have been slowly raising the temperatures on 401(k)s for 40 years, and we’re nearing the point that they no longer make sense for workers.’ ” That’s Aaron Brown, author and former managing director at AQR Capital Management, explaining in an op-ed for Bloomberg News why retirement savers might want to reconsider their 401(k)s. And, no, it isn’t because, as Donald Trump warned earlier this month, your nest egg could “disintegrate and disappear” if Joe Biden wins the presidency. Let’s get back to the frog metaphor. “I don’t know which is worse, if the worker frog jumps out and thereby exacerbates the middle-class retirement savings problem,” he wrote, “or if the worker frog stays in and finds its retirement plan eroded by unexpected effects of fees and taxes. So let’s turn off the heat and add some cold water.” Brown explained that the tax advantage enjoyed by those investing in 401(k)s is nowhere near as beneficial as it once was, based on these four factors that, for a median-income married couple with two children, have changed in a big way over the last 40 years. The marginal federal income tax rate was 43% in 1980, 12% today The capital gains tax rate was 28% in 1980, 0% today The likely retirement bracket tax rate was 15% in 1980, 12% today Interest rates in 1980 were around 15%, compared to 0% today Making reasonable assumptions about a worker with 30 years to retirement, Brown wrote that the 1980 version of the 401(k) tax deferral mean an additional investment return of 9.2% a year, “an extraordinary incentive to save for retirement, even without an employer match,” he said. Today’s figure, however, shows a benefit of less than 1%. 80% of older Americans can't afford to retire - COVID-19 isn't helping “So in 1980, the government offered a huge tax savings to encourage retirement savings, while today it offers little or no benefit,” Brown wrote, pointing out that an employer contribution is still valuable, with a 100% match worth 2.3% a year in extra return over 30 years. “But this has nothing to do with the 401(k) structure,” he added. The availability of zero-cost index funds is a major knocks against 401(k)s. Investors in 1980 paid something like 3.5% of assets in fees, both in and out of 401(k)s. Now, that number has dropped to 1.5% in the typical 401(k) but 0.5% outside of it. It’s time for a change, he said. “Now that 401(k)s have become the primary source of retirement savings for the middle class working in the private sector, we should restore the large tax incentive and bring fees into line with taxable investment standards,” Brown suggested. For one, he said that workers should be allowed to roll over their 401(k) funds into self-directed IRAs, even if they aren’t changing jobs. This would force 401(k) to compete in the open market. “Reducing taxes on 401(k)s will cost the government money, but it could be a good investment if it results in retirement security for more middle-income households,” Brown wrote. He said contributions and accumulated returns should be tax-free when withdrawn in retirement by below-median-income households, with no subsidy for the top half of households. Retirement accounts were looking pretty good on Tuesday, with the Dow Jones Industrial Average DJIA, +0.56% up more than 300 points. The S&P 500 SPX, +0.87% was also higher, while the tech-heavy Nasdaq Composite COMP, +1.39% was missing out on all the fun."}]}