{"article": [{"url": "https://www.marketwatch.com/story/how-is-coronavirus-changing-us-12-life-lessons-we-are-learning-2020-07-07", "published": 1594282400.0, "headline": "Coronavirus is changing us - but which of these lessons are we learning?", "body": "A lot has changed in the last several weeks, and it likely won't be going back to being completely normal soon. This time at home has taught us a lot, though. I think for many, we are learning life lessons and resetting our priorities. We need to hang on to these essential life lessons even when we start moving forward and go back to whatever new normal awaits us. Think about it - much of how we lived our lives before this point included a ton of social media, a bunch of keeping up with the Jones', and a sense of financial security and health invincibility because the stock market was doing well. We as a society were traveling like crazy and doing all kinds of new things without getting sick; according to the World Tourism Organization, tourist arrivals across the globe were supposed to cross 1.5 billion by this year. That has all come to a grinding halt. Mother Earth has made us a victim of her latest punishment. We as humans need to not only stay safe and sane during this time (and please do: work to relieve stress, and practice self-care, please), but we also need to take this wake-up call and learn from it. We CANNOT keep going as we were. It's not sustainable. So what life lessons am I referring to? I made a list. See if you agree, or if you'd have anything to add.1. Prioritizing our relationships with family and friends This is a must, and I don't think we were doing this enough. Now we are forced to, and I'm sure some families are at each other's last nerve. But I think we should take a minute and appreciate what we are being given: a chance to reconnect and understand each other. An opportunity to work on our interpersonal relationships, let go of past issues, forgive each other, make new memories and get creative with how we are spending our time together. Life Lessons: I think this is an essential life lesson to take away. The people closest to you deserve your time and attention, and vice versa. Use this time to reforge these relationships so that you can carry them with you for the rest of ever. No more excuses for not having enough time to do so; we have enough technology at our fingertips to stay connected no matter what. For those who feel they can't reach out to family, remember that not every family is made of blood. So find your people, your loved ones, and use this time to strengthen the bonds you do have.2. The importance of health and wellness I hope everyone who once took their health and their access to medications for granted now realizes how lucky we've been thus far. I also hope everyone says, \"OK, time to make health a priority.\" Until you are taking care of yourself, you will not be able to fight not just COVID but any illness. Life lesson: Take steps now to redefine your view of fitness and health. I'm not saying you need to become a bodybuilder, but pay attention to your food and activity levels, and work on developing healthy habits and build a healthy lifestyle. Think of food like it's medicine and use it to work for you and keep you fit (versus what a lot of people do with eating fast food and the like, and it makes them ill). Pay attention to your activity and movement. Take care of yourself now so that your body and mind can fight for you later. 3. Decreasing pollution benefits us and the planet Climate change is real (polar ice caps are melting, earth's surface temperatures have increased, sea levels have risen, and the ocean is warmer). This is all due to increased carbon dioxide in the atmosphere. One of the good things to come from this situation is that it has put a halt on production and factories have shut down. Thus, air pollution levels are at an all-time low, and animals are coming out to play. Life lesson: I think this is one of the most important lessons ever. The planet doesn't need us; we need it. Let's start respecting the ground we live on and take care of it because by doing so, we will extend our ability to live in it, and we'll make life better for ourselves. Read:That 100-degree day in the Arctic underscores how this region is now warming twice as fast as Earth4. We really don't need to spend as much as we usually do How many people under normal circumstances would have online shopped and gone to the mall about five times now? I could probably fall into this category. Spending money is a wonderful stress reliever. Life lesson: How much of our spending is actually necessary? I've saved a lot of money in the last month alone, mainly by not eating out and not buying things I don't need. Funny thing, I don't feel like I'm missing out. Hopefully, this has shown us that we don't need much to be happy, what we have is good enough, and we need to be thankful for it, the rest is just excess and look how easy it is to cut it out of our lives! Those items you thought you couldn't live without? Guess what, you're living without them now, and you're surviving! So let's reconfigure how we treat our hard-earned dollars and go forward spending wisely and showing more respect for our money. Read:How to save money in tough times: 6 do's and don'ts5. We need to have an emergency fund While you're creating that spending plan, take note of emergency funds. This is the longest rainy day/period ever. For anyone who couldn't figure out why they needed an emergency fund before, I hope it all makes sense now. Life lesson: You should have about 3-6 months' worth of living expenses put away, and it should be untouched except for in an emergency. This might seem like a lot. However, the purpose is to give you a cushion if you lose your job or need some time to transition between jobs. Going forward, this is also your pandemic relief fund. Basically, it's so that you don't go into debt or have to sell you prized possessions to get by. Read:'I don't want to be someone in need of cash': How economic slumps inflicts permanent 'scars' on spending and saving Also:Are you bankrolling your adult kids in a crisis?6. Career backup plans are important So many people are suffering pay cuts or losing their jobs during this time. Unemployment topped 13%! A common theme to address this that I've noticed is advocating for multiple income streams or starting a side hustle. While I think that's a viable option, not everyone can do that. Their skill sets don't allow them to, or they are already bogged down so much by their primary jobs, or there is some other reason. Life Lesson: Yes, multiple sources of income are one way to cushion yourself in the future, but I think we should all also consider career backup plans going forward. This crisis has shown us that you never know what can happen; even health care is not a secure profession (many people in the front lines are taking pay cuts, as are subspecialty services that only do elective procedures or outpatient care). We all should have an idea of what else we could do with our skills; or what areas we'd be willing to learn so that if we're forced to, we can pivot. Times are changing, and more change is coming. We must adapt to these life-changing events and be prepared for any possibility. Read:Midcareer? Your job is at risk - here's what to do now7. Social media exaggerates How many are completely overwhelmed or frustrated by social media? There's only so much any brain can take. Now we all have so much time on our hands, and I'm sure much of it is spent online. But, as I'm sure you are finding out, it actually makes this worse. Life lesson: There's a lot on social media that is exaggerated, falsified or taken out of context. I had to stop reading stories because of all of these reasons. I hope that everything you read online from here on out, you take with a large grain of salt. Find trustworthy news outlets to understand the facts; trust the experts who are doing their best and working tirelessly to bring you updates; and most importantly, take a break from your phones. You don't have to always be connected.8. Our teachers are so, so important How many parents are home schooling right now? How many think that poking their eyes out with a hot stick would be less painful? Life lesson: Our teachers are some of the most essential people in our society. They really work hard and deserve so much more respect and money than they currently get. When schools reopen and we continue moving forward with life, let's give our teachers a huge shout-out and advocate for their support.9. We need to slow down We live in a world that is \"go go go.\" We are constantly under pressure to be productive, to compete and be better than our peers or ourselves, and to never take breaks. While this has resulted in many of us having successful careers, as I mentioned earlier, this isn't sustainable. We are burning out, we are getting tired, and we are hiding our depression. In essence, we have lost our work-life balance. We need to get it back and start living our best lives. Life Lessons: Let's slow down. We need to live one day at a time and pay attention to where we are at. I know this is much easier said than done, and I'm not saying you shouldn't plan for the future. I just think that we need to do a better job of being present and being more mindful. We all know that life is short; let's wake up from this and try to really enjoy life and make every moment count.10. Mental health is important What we're going through right now, dealing with being confined, coping with boredom, going crazy in our homes, learning to cope with our fears, and struggling to keep our sanityâ\u0080¦. some people fight this battle every day, every week, every year. To simplify it further, life is made up of all kinds of nonsensical stuff we have to deal with, and now it's worse due to the pandemic. Recent research is showing that over one-third of Americans are suffering from depression and anxiety - an increase from before the pandemic. Life Lesson: Mental health is an integral part of our health and needs to be continuously addressed, just like our physical health is. It's not taboo. It's real, and it's normal. I hope that this pandemic will bring to light the need to have regular mental-health checks and care.11. Who we consider essential has changed I'm sure our perspective has shifted in the last few weeks about who really matters for us to function as individuals and as a society. Life Lesson: It's not the online influencers that matter most or the makeup artists that you can't live without. No, it's our health-care workers - including everyone who works in a hospital - our minimum-wage workers and the labor force that does all the back-end work that we never notice, and our banks and grocery stores that provide us with the core essentials we can't survive without. Let's all take a minute to recognize these people, be grateful that they exist, and that we have access to them. As we come out of this quarantine, let's continue to show gratitude, compassion, and kindness for them and recognize their hard work. Let's change our mindset and take care of them as they care for us. Let's NOT take them for granted anymore.12. We are all equal Illness and natural disasters are great equalizers, and they also highlight the disparities in our society. Life Lesson: Money, status, fame and looks have no bearing on what happens to you, nor does it protect you in any way. At the end of the day, we are all susceptible to the same human vices, illnesses and consequences. We need to remember that we are all human. In summary, the situation, hopefully, is helping you to reprioritize your time and your life purpose. I hope you can use this time to find yourself and realize what truly matters to you and allows you to live your best life. Let's carry these lessons with us as we move forward so that we, as a society, are better as a whole because of this experience. Let's not make the same mistakes we have been making. Sanjana Vig is a physician anesthesiologist who also has an MBA. She blogs at YouBeThree, with the aim to empower people to be the best version of themselves. This was first published on Your Money Geek, a website that aims to make personal finance fun."}]}