{"article": [{"url": "https://www.marketwatch.com/story/cdc-director-warns-america-is-in-for-the-worst-fallweve-ever-had-2020-08-13", "published": 1597478420.0, "headline": "CDC director warns America is in for the â\u0080\u0098worst fall â\u0080¦ weâ\u0080\u0099ve ever hadâ\u0080\u0099", "body": "While the world watches and waits for a COVID-19 vaccine to bring the coronavirus pandemic under control, thereâ\u0080\u0099s another inoculation poised to be just as important this fall. That would be the flu shot, as Americaâ\u0080\u0099s annual influenza season usually begins in October before peaking between December and February. And the Centers for Disease Control and Prevention is very worried about what is going to happen as the pandemic thatâ\u0080\u0099s killed at least 200,000 Americans since March bleeds into flu season, which is responsible for between 12,000 and 61,000 deaths a year. CDC director Robert Redfield warned in a WebMD interview on Wednesday that America is bracing for â\u0080\u009cthe worst fall, from a public health perspective, weâ\u0080\u0099ve ever had.â\u0080\u009d This is not because cooler weather somehow makes the coronavirus worse, or that the summerâ\u0080\u0099s heat kills the virus, which has been a common misconception about the coronavirus causing the disease COVID-19. Rather, fall and winter become influenzaâ\u0080\u0099s time to shine. Donâ\u0080\u0099t miss:Coronavirus daily update: Global cases edge close to 21 million; U.S. counts more than 1,000 deaths to extend a 2-week streak Read more:Does sunshine kill coronavirus? Was it made in a lab? Will antibiotics help? Burning questions about COVID-19 that refuse to go away â\u0080\u009cWeâ\u0080\u0099re going to have COVID in the fall, and weâ\u0080\u0099re going to have flu in the fall. And either one of those by themselves can stress certain hospital systems,â\u0080\u009d Redfield said, noting that many hospitals have already been overwhelmed by the number of coronavirus patients. There have also been reports of hospitals in New York, Texas and Arizona calling in refrigerated trucks to serve as temporary morgues to handle the number of dead bodies during the pandemic. And the flu has seen between 140,000 and 810,000 people hospitalized each year since 2010. Both outbreaks at the same time could be devastating this fall. But one of them â\u0080\u0094 influenza â\u0080\u0094 actually has a vaccine and treatment that can keep it under control. The problem is, less than half of the country (47%) got a flu shot last year. The CDC normally recommends that 60% to 70% of the country get the influenza inoculation to keep the virus under control. This year, Redfield said that heâ\u0080\u0099s pushing for 65% compliance. And while the CDC normally purchases about 500,000 doses of the vaccine each year for uninsured adults, this year Redfield said that itâ\u0080\u0099s ordered an extra 10 million doses, for more than 190 million doses total, to encourage everyone to get vaccinated against the flu. Donâ\u0080\u0099t let reports that vaccines have been less effective in some flu seasons put you off. (For example, the 2017â\u0080\u009318 vaccineâ\u0080\u0099s efficacy rate was just about 36%, which means it cut flu-related doctor visits by that amount.) The vaccine can still lower your risk of complications or dying from the flu, even if you do get sick. â\u0080\u009cIf thereâ\u0080\u0099s one thing we all can do â\u0080\u0094 besides the importance of wearing a mask, social distancing hand washing and being smart about gatherings â\u0080\u0094 that basically ultimately prepares ourselves for the fall, (it) is to get the influenza vaccine,â\u0080\u009d said Dr. Redfield. â\u0080\u009cSo by getting that flu vaccine, you may be able to then negate the necessity to have to take up a hospital bed. And then that hospital bed can be more available for those that potentially get hospitalized for COVID.â\u0080\u009d “ â\u0080\u0098This is a year that Iâ\u0080\u0099m asking people to really think deep down about getting the flu vaccine.â\u0080\u0099 ” â\u0080\u0094 Dr. Robert Redfield Yet health officials are concerned that fears of catching COVID-19 in public could keep people from seeking out the flu vaccine or other essential medical care as the pandemic continues. In fact, less than half of Americans said they would get the COVID-19 vaccine if and when one becomes available. Two-thirds of parents in an Orlando Health report released this week said that they are â\u0080\u009cstill nervousâ\u0080\u009d about taking their kids to the pediatrician because of the pandemic. The World Health Organization and UNICEF have also warned of â\u0080\u009can alarming declineâ\u0080\u009d in the number of children getting lifesaving vaccinations around the world as the coronavirus has spread. And about half of families (48%) in a recent Kaiser Family Foundation survey said that they have a family member who has delayed getting medical care during the pandemic, and one in 10 said that their family memberâ\u0080\u0099s condition got worse as a result. Whatâ\u0080\u0099s more, as millions of Americans have lost their jobs, theyâ\u0080\u0099ve then also lost their health insurance to get this kind of preventive care. If youâ\u0080\u0099re uninsured, the shots generally run between $40 and $60 at drugstores like CVS CVS, -1.76%, Â Walmart WMT, +1.00% Â and Target TGT, +1.14%, or those with Costco COST, +1.19% Â or Samâ\u0080\u0099s Club memberships have been able to get jabbed for just $20 or $30. You can also find health centers near you, or look up your stateâ\u0080\u0099s free and discounted vaccine offerings, at Vaccines.gov. Whatâ\u0080\u0099s more, autumn also ushers in respiratory illnesses such as the rhinovirus (one cause of the â\u0080\u009ccommon coldâ\u0080\u009d) and respiratory syncytial virus (RSV) â\u0080\u0094 the latter which is the most common cause of severe respiratory illness in young children, and a leading cause of death from respiratory illness in adults over 65. The good news is, safety measures to avoid COVID-19 â\u0080\u0094 such as frequent hand-washing, social distancing and wearing face masks â\u0080\u0094 can also help minimize the spread of these other viral respiratory infections. These measures could potentially lead to a less severe flu season, as well. Related:Biden calls for national mask mandate, saying it would save 40,000 lives over 3 months â\u0080\u009cWhen you ask me what Thanksgivingâ\u0080\u0099s going to be like, I think itâ\u0080\u0099s just dependent on how the American people choose to respond,â\u0080\u009d Dr. Redfield said. If people follow the CDCâ\u0080\u0099s social distancing and hygiene recommendations and get their flu shots, â\u0080\u009cit will bring this [COVID-19] outbreak down,â\u0080\u009d he said. Capitol Report:Trump used White House coronavirus briefing to criticize Bidenâ\u0080\u0099s call for a mask mandate, decry mail-in voting, question Kamala Harrisâ\u0080\u0099s eligibility to serve as vice president"}]}