{"article": [{"url": "https://www.marketwatch.com/story/jobless-claims-tell-us-30-million-people-are-unemployed-but-many-doubt-its-that-bad-2020-07-08", "published": 1594288580.0, "headline": "Jobless claims tell us 33 million people are unemployed, but many doubt it's that bad", "body": "What the heck is really going on in the labor market? Are 33 million Americans unemployed? Or is it 18 million? Are companies bringing back millions of workers? Or laying even more people off? It's hard to get a clear answer from the government's two main tools to assess the labor market. Weekly jobless claims and the monthly employment report appear to tell very different stories. Read:U.S. regains 4.8 million jobs in June. Is rehiring poised to slow? Consider jobless claims. Although they have fallen from a peak of nearly 7 million in late March, more than 1 million new applications for unemployment benefits are being filed each week. And that doesn't even include workers who filed through a temporary federal relief program. Some 1.31 million new claims were filed through the states in the week of June 28 to July 4, the government said Thursday. Read:Jobless claims fall to four-month low of 1.31 million in early July, but layoffs still high See: MarketWatch Economic Calendar Perhaps worse, the number of people receiving benefits through all state and federal programs has hovered near 30 million from the first week of May to late June. These are known as continuing jobless claims. The rose again in the week ended June 20 to 32.9 million. \"I am surprised and disappointed the continuing claims have not come down further,\" said chief economist Stephen Stanley of Amherst Pierpont Securities. \"It doesn't ring true with everything we are seeing.\" The monthly employment report paints a very different scene. It shows that the economy regained 7.5 million jobs in May and June, partially recovering some of the more-than 22 million jobs lost during the first two months of the pandemic. A variety of other economic indicators also suggest that more people have gone back to work. What to believe? Most but not all economists see the monthly employment report as a more accurate gauge of the labor market. After all, jobless claims only reveal one side of the coin: How many people may have lost their jobs. It doesn't tell us how many people returned to work. The monthly employment report, however, presents a net figure, or both sides of the coin: Job gains minus job losses. \"The monthly employment report is a better indicator of the jobs market. It shows real improvement,\" said chief economist Gus Faucher of PNC Financial Services. \"The claims number is a weekly snapshot, but there is a lot more 'noise' in the data.\" But some economists are less willing to believe the feel-good story told by the monthly employment report. James Knightley, chief international economist at ING, said he'd rather trust data on how much the government is shelling out in benefits than a monthly report based on a survey of households. While he acknowledges jobless claims are more prone to weekly distortions, he said \"the fact that the number of people claiming benefits has been around 30 million for six weeks now suggests something distressing has been happening in the labor markets.\" He thinks there's a good chance new claims will actually rise again soon, specially after a fresh outbreak of coronavirus cases forced some states to reimpose restrictions or delay reopening plans. Companies could also cut more jobs once they realize not all their customers are coming back. It's possible, economists say, that both reports tell an accurate story in their own way. The economy could be losing lots of jobs each week, but regaining more of them each month. Still, it's hard to square the 32.9 million people reported as claiming benefits through state unemployment offices with the 17.8 million people that the monthly jobs report indicates are still unemployed. Read:Federal Reserve leaders see 'bumpier' recovery, slower decline in unemployment Various explanations abound. The claims report might include multiple applications from the same people, one theory goes. Or perhaps exceedingly generous federal benefits, including $600 extra for unemployed workers, has led to hanky-panky that's distorted the weekly data. Read:U.S. entered recession in February after end of longest expansion in history Whatever the case, economists say, it will be a while before a reliable picture of the labor market emerges. The only thing that's clear, Faucher said, is that labor market remains in serious trouble. \"I think claims are going to remain elevated until we as a society do a better job of containing the virus.\""}]}