{"article": [{"url": "https://www.marketwatch.com/story/cdc-returns-to-its-website-deleted-guidance-about-airborne-spread-of-coronavirus-11601924593", "published": 1601910680.0, "headline": "CDC returns to its website deleted guidance about airborne spread of coronavirus", "body": "CDC Director Robert Redfield at a Senate hearing on Sept. 16 regarding the U.S.'s coronavirus response efforts. Pool/Getty Images The U.S. Centers for Disease Control and Prevention said tiny particles that linger in the air can spread the coronavirus, revising its guidelines on the matter just a few weeks after the health agency had acknowledged a role for the particles and then abruptly removed it. Don’t miss: CDC says retracted posting that appeared to change the agency’s position on the aerosolized spread of coronavirus was ‘an honest mistake’ The guidelines on how the coronavirus spreads were initially updated last month to acknowledge a role, and possibly the primary one, played by tiny aerosol particles in spreading the virus. But the agency removed the changes only days later, saying a draft version of the proposed changes had been posted in error. In its latest revisions to the guidelines Monday, the CDC acknowledged a role for the tiny airborne particles, though the latest wording says they aren’t the main way the virus spreads. The virus is primarily transmitted via respiratory droplets by people who are physically near a person with Covid-19 or who have direct contact with them, the CDC said. The agency also recognized, however, evidence indicating the virus can spread under certain conditions via the smaller airborne particles to people who were more than 6 feet away. An expanded version of this report appears at WSJ.com. Trending at WSJ.com: Anthony Fauci on what it will take to put the pandemic behind us How Republicans fell in line with Trump-McConnell plan to break Merrick Garland precedent and push forward on getting Amy Coney Barrett confirmed to Supreme Court"}]}