{"article": [{"url": "https://www.marketwatch.com/story/trump-says-us-government-should-get-a-cut-of-any-deal-for-chinese-owned-tiktok-2020-08-03", "published": 1596471020.0, "headline": "Trump says U.S. government should get a cut of any deal for Chinese-owned TikTok", "body": "President Donald Trump on Monday suggested the U.S. government should get part of the proceeds of any sale of Chinese-owned video-sharing app TikTok, as he also signed an executive order that aims to prevent federal agencies from replacing U.S. workers with overseas staff. Trump recounted a Sunday conversation with Microsoft Corp. MSFT, +2.48% CEO Satya Nadella about the American software giant’s interest in acquiring TikTok from Beijing-based ByteDance Ltd., two days after surprising Wall Street and his own White House by stating that he opposed such a deal and leaned toward banning the app in the U.S. “I did say that, ‘If you buy it … a very substantial portion of that price is going to have to come into the Treasury of the United States, because we’re making it possible for this deal to happen.’ Right now they don’t have any rights unless we give it to them,” the president said. See:Microsoft says TikTok acquisition talks are back on after Nadella, Trump chat Trump also said TikTok will “close down on Sept. 15 unless Microsoft or somebody else is able to buy it.” Meanwhile, the order tied to overseas staffing “follows the federally-owned Tennessee Valley Authority’s (TVA) announcement that it will outsource 20 percent of its technology jobs to companies based in foreign countries,” the White House said in a news release. It represents another move against foreign workers as Trump seeks to score points with his core supporters before the November presidential election. Other such efforts include his administration’s June decision to extend a ban on green cards issued outside the U.S. until the end of the year and add many temporary work visas to the freeze, including those used heavily by tech companies XLK, +1.52%. Trump criticized the TVA, saying he had fired two board members, its CEO was overpaid, and he was pushing for that executive's removal. “Let this serve as a warning to any federally appointed board. If you betray American workers, then you will hear two simple words: You’re fired,” he said. In RealClearPolitics averages of polls as of Monday, Democratic challenger Joe Biden was leading Trump by 7.4 percentage points in nationwide surveys and by 5.5 points in top swing states. Trump and his campaign have said pollsters are getting the 2020 race wrong. Also on Monday, Trump tweeted that “Jobs, Stocks, and 401k’s” would “all come crashing down” if Biden were to become president. The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% closed with modest gains Monday. See:A record high for the Nasdaq ‘would all come crashing down,’ says Trump in a tweet In addition, a New York Times report said the Manhattan district attorney’s office suggested in a new court filing that it has been investigating Trump and his company for potential bank and insurance fraud, a broader inquiry than prosecutors previously have acknowledged. See:Manhattan prosecutor cites ‘extensive and protracted criminal conduct at the Trump Organization’ in defending records demand"}]}